{"organizations": [], "uuid": "4c0b3a3b55364294415d28e7bb840b4977500495", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-celgene-corporation-announces-preliminary-2017-unaudited-results-and-2018-financial-guidance.html", "country": "US", "domain_rank": 767, "title": "Celgene Corporation Announces Preliminary 2017 Unaudited Results and 2018 Financial Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T18:35:00.000+02:00", "replies_count": 0, "uuid": "4c0b3a3b55364294415d28e7bb840b4977500495"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-celgene-corporation-announces-preliminary-2017-unaudited-results-and-2018-financial-guidance.html", "ord_in_thread": 0, "title": "Celgene Corporation Announces Preliminary 2017 Unaudited Results and 2018 Financial Guidance", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "celgene corporation announces preliminary 2017 unaudited results", "sentiment": "negative"}, {"name": "j.p. morgan healthcare conference", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}, {"name": "celgene corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "- Preliminary Q4 2017 total revenue of $3.5 billion, a 17 percent increase Y/Y\n- Preliminary FY 2017 total revenue of $13.0 billion, a 16 percent increase Y/Y\n- Reaffirming 2020 total revenue and adjusted diluted EPS financial targets\nSUMMIT, N.J.--(BUSINESS WIRE)-- Celgene Corporation (NASDAQ:CELG) today provided a business update as well as its preliminary 2017 unaudited results and financial guidance for 2018 at the 36 th Annual J.P. Morgan Healthcare Conference. Based on U.S. Generally Accepted Accounting Principles (GAAP), GAAP diluted earnings per share (EPS) for the full-year of 2017 is expected to be in the range of $3.64 to $4.19, a 57 percent year-over-year increase based on the mid-point of the range. Full year 2017 GAAP operating margin is expected to be approximately 36 percent, an increase from 28 percent in the prior year, primarily due to increased product sales. For the fourth quarter 2017, GAAP EPS is expected to be in the range of ($0.09) to $0.46, a 65 percent year-over-year decrease based on the mid-point of the range. Fourth quarter 2017 GAAP operating margin is expected to be approximately 34 percent, an increase from 31 percent in the prior year, primarily due to increased product sales.\nAdjusted EPS is expected to be approximately $7.44 for the full year of 2017, a 25 percent year-over-year increase. Full year 2017 adjusted operating margin is expected to be 58.1 percent, an increase of 310 basis points (bps) year-over-year. For the fourth quarter of 2017, adjusted EPS is expected to be approximately $2.00, a 24 percent year-over-year increase. Fourth quarter 2017 adjusted operating margin is expected to be 55.3 percent, a decrease of 70 bps year-over-year.\n“2017 was a strong year for Celgene as we delivered excellent top- and bottom-line growth and achieved critical milestones across our hematology, oncology, inflammation and immunology franchises,” said Mark J. Alles, Chief Executive Officer of Celgene. “We are executing on a strategy to achieve our 2020 targets, accelerate portfolio diversification and expand our pipeline of innovative therapies.”\nPreliminary Q4 and FY 2017 Net Product Sales and Total Revenue are expected to be (Unaudited, in millions):\nQ4 2017\nY/Y%\nFY 2017\nY/Y%\nREVLIMID ® $2,188 21% $8,187 17% POMALYST ® /IMNOVID ® $442 17% $1,614 23% OTEZLA ® $371 22% $1,279 26% ABRAXANE ® $251 (6)% $992 2% Total Revenue $3,483 17% $13,003 16% Certain activities involved in determining the audited results for the fiscal year ended December 31, 2017 are in-process and could result in the final reported audited results being different from the unaudited results noted in this press release. The ranges of our estimated GAAP diluted earnings per share for the quarter and year ended December 31, 2017 include an estimated financial statement impact of between approximately $800 million and approximately $1,300 million related to the Tax Cuts and Jobs Act (“Tax Act”), which was enacted on December 22, 2017. Our estimate of the impact of the Tax Act is based on currently available information and interpretation of its provisions. Our actual results may materially differ from our current estimate due to, among other things, further guidance that may be issued by U.S. tax authorities or regulatory bodies and/or changes in interpretations and assumptions we have preliminarily made. We will continue to analyze the Tax Act to finalize its financial statement impact, including the mandatory deemed repatriation of foreign earnings, re-measurement of deferred taxes and certain other provisions of the Tax Act. We anticipate finalizing our preliminary analysis and the impact on our December 31, 2017 financial statements by the time we announce our financial results currently anticipated on January 25, 2018. Additionally, please see the attached Use of Non-GAAP Financial Measures and Reconciliation of Estimated/Projected GAAP to Adjusted (Non-GAAP) Measures for further information relevant to the interpretation of adjusted financial measures and reconciliations of these adjusted financial measures to the most comparable GAAP measures, respectively, for each of 2017 and 2018.\nCelgene Expects Volume-Driven Product Sales and Earnings Growth in 2018\nIn 2018, total revenue is expected to be approximately $14.4 billion to $14.8 billion, a 12 percent increase year-over-year, based on the mid-point of the range. Based on GAAP, EPS for the full-year 2018 is expected to be in the range of $6.58 to $6.95, excluding the impact of any strategic transactions, impairments, loss contingencies, changes in the fair value of equity investments and non-operating tax adjustments that have not yet occurred. For the full-year 2018, adjusted diluted EPS is expected to be in the range of $8.70 to $8.90, an 18 percent increase year-over-year, based on the mid-point of the range.\nYear-over-Year\nChange\nTotal Revenue $14.4B to $14.8B 12% * REVLIMID ® Net Product Sales Approximately $9.4B 15% POMALYST ® / IMNOVID ® Net Product Sales Approximately $1.9B 18% OTEZLA ® Net Product Sales Approximately $1.5B 17% ABRAXANE ® Net Product Sales Approximately $1.0B 1% GAAP diluted EPS $6.58 to $6.95 N/M ** Adjusted diluted EPS $8.70 to $8.90 18% * GAAP operating margin Approximately 46.5% N/M** Adjusted operating margin Approximately 60.0% ~ +200 bps Weighted average diluted shares 775M -34M Adjusted Tax Rate ~18% ~ +200 bps * Year-over-year percentage change based on the mid-point of the range.\n** Not meaningful as the 2018 measures exclude the impact of any strategic transactions, impairments, loss contingencies, changes in the fair value of equity investments and non-operating tax adjustments that have not yet occurred.\nReaffirming Expected 2020 Long-term Financial Targets\n2020 total revenue range of $19.0 billion to $20.0 billion Adjusted Diluted EPS to exceed $12.50\n2018 Expected Operational Milestones\nHematology & Oncology\nRegulatory Submissions\nSubmission of a supplemental New Drug Application (sNDA) to the U.S. Food and Drug Administration (FDA) for REVLIMID ® in combination with bortezomib and dexamethasone (RVd) in patients with newly diagnosed multiple myeloma (NDMM) Submission of a New Drug Application (NDA) to the FDA for fedratinib in myelofibrosis\nTrial Initiations\nInitiate the pivotal program with CC-122 in non-Hodgkin lymphoma (NHL) Initiate the pivotal program with BGB-A317 (tislelizumab) in non-small cell lung cancer (NSCLC) Initiate a phase III trial with bb2121 in third-line plus multiple myeloma in collaboration with bluebird bio Initiate a phase III trial with JCAR017 in transplant-eligible second-line diffuse large B-cell lymphoma (DLBCL) in collaboration with Juno Therapeutics Initiate the phase III COMMANDS ™ trial with luspatercept in first-line, lower-risk myelodysplastic syndromes (MDS)\nClinical Data\nData from the phase III AUGMENT ® trial with REVLIMID ® in combination with rituximab in patients with relapsed and/or refractory follicular lymphoma (FL) Data from the phase III ROBUST ® trial with REVLIMID ® in patients with first-line ABC-subtype DLBCL Data from the phase III apact ® trial with ABRAXANE ® as adjuvant therapy in patien", "external_links": ["http://www.businesswire.com/news/home/20180108006273/en/", "https://www.facebook.com/Celgene", "https://www.youtube.com/celgene", "https://twitter.com/celgene", "https://www.pinterest.com/celgene/", "https://www.linkedin.com/company/celgene"], "published": "2018-01-08T18:35:00.000+02:00", "crawled": "2018-01-08T21:20:33.013+02:00", "highlightTitle": ""}