{"organizations": [], "uuid": "451c26c8f9a1fb4941deff4044b36c4abb9f07c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-archrock-inc-announces-agreement-to-acquire-remaining-public-stake-in-archrock-partners-l-p.html", "country": "US", "domain_rank": 767, "title": "Archrock, Inc. Announces Agreement to Acquire Remaining Public Stake in Archrock Partners, L.P.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.386, "site_type": "news", "published": "2018-01-02T15:00:00.000+02:00", "replies_count": 0, "uuid": "451c26c8f9a1fb4941deff4044b36c4abb9f07c1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-archrock-inc-announces-agreement-to-acquire-remaining-public-stake-in-archrock-partners-l-p.html", "ord_in_thread": 0, "title": "Archrock, Inc. Announces Agreement to Acquire Remaining Public Stake in Archrock Partners, L.P.", "locations": [], "entities": {"persons": [{"name": "archrock", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "acquire remaining public stake in archrock partners", "sentiment": "negative"}, {"name": "archrock, inc", "sentiment": "neutral"}, {"name": "archrock, inc.", "sentiment": "none"}, {"name": "archrock partners", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "archrock", "sentiment": "none"}, {"name": "aroc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Accelerated deleveraging with increased retained cash flow\nCombined company targeting 10-15 percent annual dividend growth through 2020 Expected cash available for dividend coverage above 2.00x through 2020 Elimination of incentive distribution rights and simplified capital structure 23.4% premium to Archrock Partners trading price on December 29, 2017 Expected to be immediately accretive to Archrock, Inc. shareholders Transaction expected to close in Q2 2018\nHOUSTON, Jan. 02, 2018 (GLOBE NEWSWIRE) -- Archrock, Inc. (NYSE:AROC) (“Archrock” or “AROC”) and Archrock Partners, L.P. (NASDAQ:APLP) (“Archrock Partners” or “APLP”) today announced that they have entered into a definitive merger agreement under which Archrock will acquire all of the outstanding common units of Archrock Partners it does not already own for Archrock common stock valued at approximately $607 million, based on the most recent closing price of Archrock common stock.\nUnder the merger agreement, each outstanding common unit of Archrock Partners that Archrock does not already own will be converted into 1.400 shares of Archrock common stock, representing a 23.4 percent premium to the Archrock Partners closing price on December 29, 2017; and a 23.9 percent premium to Archrock Partners volume-weighted average trading price during the ten trading days ended December 29, 2017.\n“We believe the combination of Archrock and Archrock Partners will enhance our cash available for dividend coverage, improve our credit profile, simplify our capital structure, and lower our cost of capital. Additionally, our increased retained cash flow will better position us to continue to invest in our robust opportunity set of growth projects and significantly reduce our need for equity capital,” said Brad Childers, President and Chief Executive Officer. “We believe this transaction is attractive for our stockholders and unitholders, as it will improve our platform to capture the next leg of growth in the U.S. natural gas compression market.”\nThe transaction is expected to be immediately accretive to Archrock, and the combined company is expected to have a cash available for dividend coverage ratio above 2.00x through 2020. Management intends to recommend to the Archrock board of directors a 10 percent increase in the first full quarterly dividend following the completion of the transaction and expects a 10 to 15 percent annual dividend growth rate through 2020.\nFollowing the completion of the transaction, Archrock is expected to have an approximate $2.8 billion enterprise value and will continue to be the largest outsourced provider of natural gas compression services in the United States. Stockholders of Archrock and unitholders of Archrock Partners are expected to benefit from the larger size of the combined company, improved equity trading liquidity, and a lower cost of funding for future growth. Following the completion of the transaction, Archrock does not expect to pay cash federal income taxes through at least 2023.\nAdditional Transaction Terms and Details\nUnder the terms of the merger agreement, Archrock will acquire all of the approximately 41.3 million outstanding units of Archrock Partners it does not already own at a fixed exchange ratio of 1.400 Archrock common shares for each publicly held common unit of Archrock Partners. Archrock Partners common units will no longer be publicly traded after the transaction. In aggregate, Archrock will issue approximately 57.8 million shares in connection with the proposed transaction, representing approximately 44.9 percent of the total shares outstanding of the pro forma combined entity.\nFollowing completion of the transaction, all senior notes of Archrock Partners will remain outstanding. Because Archrock Partners will be wholly owned by Archrock, the incentive distribution rights in Archrock Partners will be terminated upon the closing of the transaction.\nThe transaction terms were negotiated, reviewed and approved by the conflicts committee of the board of directors of the managing general partner of Archrock Partners and approved by the board of directors of the managing general partner of Archrock Partners. The Archrock Partners conflicts committee is composed of the independent members of the board of directors of Archrock Partners’ managing general partner. The board of directors of Archrock also approved the merger agreement.\nConditions to Closing\nSubject to customary approvals and conditions, the transaction is expected to close in the second quarter of 2018. The transaction is subject to the approval of APLP common unitholders and AROC stockholders and the effectiveness of a registration statement related to the issuance of the new AROC shares to Archrock Partners’ unitholders.\nAdvisors\nCiti is acting as exclusive financial advisor and Latham & Watkins is acting as legal advisor to Archrock. Evercore Group L.L.C. is acting as exclusive financial advisor and Akin Gump Strauss Hauer & Feld LLP and Morris, Nichols, Arsht & Tunnell LLP are acting as legal advisors to the Archrock Partners conflicts committee.\nConference Call Details\nArchrock and Archrock Partners will host a joint conference call on January 2, 2018 to discuss the transaction. The call will begin at 10:00 a.m. Eastern Time.\nTo listen to the call via a live webcast, please visit Archrock’s website at www.archrock.com . The call will also be available by dialing 1-888-771-4371 in the United States and Canada or +1-847-585-4405 for international calls. Please call approximately 15 minutes prior to the scheduled start time and reference Archrock conference call number 4624 2542.\nA replay of the conference call will be available on Archrock’s website for approximately seven days. Also, a replay may be accessed for approximately seven days by dialing 1-888-843-7419 in the United States and Canada, or +1-630-652-3042 for international calls. The access code is 4624 2542#.\nArchrock non-GAAP measures\nCash available for dividend, a non-GAAP measure, is defined as distributions received by Archrock from Archrock Partners, L.P., plus Archrock deconsolidated gross margin (defined as total revenue less cost of sales (excluding depreciation and amortization expense), less the following deconsolidated items: maintenance and other capital expenditures, cash sales, general and administrative expense excluding corporate office relocation costs, cash interest expense associated with Archrock’s debt, cash tax and (gain) loss on sale of property, plant and equipment. Cash available for dividend coverage is defined as cash available for dividend divided by total dividends.\nArchrock is unable, without unreasonable efforts, to provide a quantitative reconciliation of its preliminary non-GAAP outlook of cash available for dividend coverage because net income or loss, maintenance and other capital expenditures, expense or benefit from income taxes, and cash tax expense or refund cannot be estimated due to the level of unpredictability and uncertainty associated with these items. For these same reasons, Archrock is unable to assess the probable significance of these excluded items.\nAbout Archrock\nArchrock, Inc. (NYSE:AROC) is a pure-play U.S. natural gas contract compression services business and a leading supplier of aftermarket servic", "external_links": ["https://www.globenewswire.com/Tracker?data=kmLtLTBaRnjlvb_6yWFUYARGdFuubT3hXSD-WSfpZPfs40dbWSTemSL5wiUMOkWQyLCzjaE28y8YxnjtU3uxHg==", "https://www.globenewswire.com/Tracker?data=kmLtLTBaRnjlvb_6yWFUYH78XQj_RQM-5iglE7fC0KJrsiMG8Gu1Q2Bb7S5L8OYgGxY9TbI-tXUuZykiZmAbOQ==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/dd81720e-2635-49df-98b9-df30e952f6e7"], "published": "2018-01-02T15:00:00.000+02:00", "crawled": "2018-01-02T16:19:40.003+02:00", "highlightTitle": ""}