{"organizations": [], "uuid": "44f514ec3bb0af498aa5d19cc6efb8133bb1c0b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/20/104854021-GettyImages-876722966.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/a-government-shutdown-could-send-investors-for-a-ride-history-shows.html", "country": "US", "domain_rank": 767, "title": "A government shutdown could send investors for a ride, history shows", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.145, "site_type": "news", "published": "2018-01-17T13:00:00.000+02:00", "replies_count": 0, "uuid": "44f514ec3bb0af498aa5d19cc6efb8133bb1c0b4"}, "author": "Fred Imbert", "url": "https://www.cnbc.com/2018/01/16/a-government-shutdown-could-send-investors-for-a-ride-history-shows.html", "ord_in_thread": 0, "title": "A government shutdown could send investors for a ride, history shows", "locations": [], "entities": {"persons": [{"name": "michael nagle", "sentiment": "none"}, {"name": "kensho", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "federal hall", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "venture capital", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "cboe volatility index", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Venture Capital A government shutdown could send investors for a ride, history shows CNBC analysis using Kensho found that the S&P 500 falls an average of 0.3 percent one week after the government closes its doors. One of the best-performing assets one week after a shutdown is the Cboe Volatility Index, which rises an average of 9.7 percent. But the pullback in stocks after a government shutdown is often short-lived, history shows. SHARES Michael Nagle | Bloomberg | Getty Images Caution tape hangs near the steps of Federal Hall across from the New York Stock Exchange (NYSE) in New York. \nThe U.S. government could shut down later this week and that could spell trouble for investors in the near term, history shows. \nCNBC analysis using Kensho found that the S&P 500 falls an average of 0.3 percent one week after the government closes its doors. The benchmark index also trades positive just 40 percent of the time one week after a shutdown. \nOne of the best-performing assets one week after a shutdown is the Cboe Volatility Index , also known as the VIX and considered the best gauge of fear in the market. It trades positive 75 percent of the time one week after a shutdown and averages a return of 9.7 percent. \nStocks failed to hold strong gains Tuesday as the possibility of a government shutdown loomed over investors' minds. The Dow Jones industrial average erased a 283 point gain, closing down 10.3 points. The S&P 500 also saw its advances evaporate, closing 0.4 percent lower after rising as much as 0.8 percent. \nCongress needs to pass a spending bill by the end of Friday to avoid a government shutdown. A point of contention between Republicans and Democrats is an immigration bill that Democrats want to pass. Those talks have complicated efforts to keep the government open. \n\"Key Democratic constituencies are demanding that congressional Democrats insist on making DACA part of the 'must pass' budget legislation to keep the government open,\" said L. Thomas Block, Washington policy strategist at Fundstrat Global Advisors. \n\"DACA is actually the easy issue for a budget compromise. More difficult is needed legislation to avoid defense and non-defense spending cuts under the sequestration required by the Budget Act of 2011,\" Block said. \nBut the pullback in stocks after a government shutdown is often short-lived, history shows. The S&P 500 averages a return of 2.1 percent a month after a shutdown and trades positive 80 percent of the time. \nThe VIX, meanwhile, averages a return of just 0.9 percent a month after a government shutdown. \nDisclosure: NBCUniversal, parent of CNBC, is a minority investor in Kensho.", "external_links": [], "published": "2018-01-17T13:00:00.000+02:00", "crawled": "2018-01-17T13:05:44.002+02:00", "highlightTitle": ""}