{"organizations": [], "uuid": "9f57bdc5a152245e440d0510a6316b76e15ec43a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/technologyNews", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-funds-artificial-intelligence/google-brain-co-founder-raises-175-million-fund-for-ai-startups-idUSKBN1FJ1XF", "country": "US", "domain_rank": 408, "title": "Google Brain co-founder raises $175 million fund for AI startups", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T16:01:00.000+02:00", "replies_count": 0, "uuid": "9f57bdc5a152245e440d0510a6316b76e15ec43a"}, "author": "", "url": "https://www.reuters.com/article/us-funds-artificial-intelligence/google-brain-co-founder-raises-175-million-fund-for-ai-startups-idUSKBN1FJ1XF", "ord_in_thread": 0, "title": "Google Brain co-founder raises $175 million fund for AI startups", "locations": [], "entities": {"persons": [{"name": "andrew ng", "sentiment": "none"}, {"name": "ng", "sentiment": "none"}, {"name": "stephen nellis", "sentiment": "none"}, {"name": "ba", "sentiment": "none"}], "locations": [{"name": "baidu", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "google brain", "sentiment": "negative"}, {"name": "baidu inc", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "sequoia capital", "sentiment": "none"}, {"name": "alphabet inc", "sentiment": "none"}, {"name": "new enterprise associates", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "softbank group corp", "sentiment": "none"}, {"name": "greylock partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 2:02 PM / Updated an hour ago Google Brain co-founder raises $175 million fund for AI startups Stephen Nellis 3 Min Read \n(Reuters) - Andrew Ng, who formerly led artificial intelligence projects at Alphabet Inc’s Google and Chinese firm Baidu Inc, has raised a $175 million fund to invest in AI startups, starting with one of his own aimed at computers detecting defects in products. \nNg announced Tuesday that he raised money from venture capital firms New Enterprise Associates, Sequoia Capital and Greylock Partners as well as SoftBank Group Corp. \nIn an interview with Reuters, Ng said his goal was to identify new business ideas around artificial intelligence and be able to put cash into them quickly from the so-called AI Fund, of which he will serve as general partner, so that founders of the portfolio companies will not need to burn time pitching traditional venture capitalists. \nNg said he plans to draw on his experience at Baidu, one of China’s largest internet companies, where he led the artificial intelligence team to develop a range of new business lines. Under Ng, Baidu released a voice-based operating system that users can talk to - much like Amazon’s Alexa voice assistant or Apple’s Siri - and also started working on self-driving cars and face recognition technology to open things like transit turnstiles when users approach. \n“Based on that experience, I have an unusual point of view on the building of AI businesses. I think it’s a more systematic, repeatable process than most people think,” said Ng, who also taught artificial intelligence courses at Stanford University. \nThe first company to receive money from the fund will be Landing.ai, a company Ng founded. Landing.ai is working with Hon Hai Precision Industry Co Ltd, better known as electronics assembler Foxconn, on using artificial intelligence to make factories more efficient. \nIn many factories, workers look over parts coming off an assembly line for defects. In Landing.ai’s system, workers instead put a circuit board beneath a digital camera connected to a computer and the computer identifies any defects. The system can be trained with as few as five images, which the company says is fewer than its competitors. [nL1N1OE03Q] \nNg, who also co-founded online learning site Coursera, said he is also working on new tools for training workers whose jobs are in danger from artificial intelligence, though he said Landing.ai was not displacing visual inspectors. \n“When you go to Japan, there is such a talent shortage that the debate about AI taking jobs is almost non-existent. The debate is, how can we automate this so we can get all the work done?” Ng said. Reporting by Stephen Nellis; Editing by Lisa Shumaker", "external_links": [], "published": "2018-01-30T16:01:00.000+02:00", "crawled": "2018-01-30T16:11:48.000+02:00", "highlightTitle": ""}