{"organizations": [], "uuid": "c26a09dc4c6db19e2ee3e5ac9001bfad066e1e38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 21, "shares": 21, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/12/104524979-20170612-1092-2390.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/12/cramer-remix-buy-facebook-on-tuesday.html", "country": "US", "domain_rank": 767, "title": "Cramer Remix: Buy Facebook on Tuesday", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T02:00:00.000+02:00", "replies_count": 0, "uuid": "c26a09dc4c6db19e2ee3e5ac9001bfad066e1e38"}, "author": "Elizabeth Gurdus", "url": "https://www.cnbc.com/2018/01/12/cramer-remix-buy-facebook-on-tuesday.html", "ord_in_thread": 0, "title": "Cramer Remix: Buy Facebook on Tuesday", "locations": [], "entities": {"persons": [{"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "negative"}, {"name": "mark zuckerberg", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "boeing", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "caterpillar", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "19 Hours Ago | 01:12 \nAfter hours of marveling at the tape's incessant march higher, CNBC's Jim Cramer took a step back to check the market layout. \n\"What's driving it? ... Same as always: [a] stock shortage — it's really been acute in the industrials — 401(k) money being thrown at the market, animal spirits, a stronger consumer, tax reform, deregulation and a general revaluation higher,\" the \" Mad Money \" host said. \"Who's doing the leading? Once again, it's Boeing , it's Caterpillar , it's Adobe , it's Alphabet , it's Apple , and it's Netflix .\" \nCertainly, the layout can change. On Friday, shares of frequent market leader Facebook were taken down after CEO Mark Zuckerberg said he wanted to change its News Feed to promote \"meaningful social interactions.\" \nBut Facebook's 4 percent decline failed to jolt the broader market, so Cramer gave investors his take on whether the social media giant's stock is worth buying into weakness. \n\"Yes, but you've got to wait,\" the \"Mad Money\" host said. \"Come Tuesday afternoon, it will probably make sense – Tuesday, market's closed Monday – to pick up some Facebook. By that point, the stock will have likely caught some more downgrades – this happened so quickly today they couldn't downgrade it.\" \nWith that in mind, Cramer rattled off the stocks and events he's watching for his weekly gameplan . This time it's different Getty Images A file photo inside the Nasdaq Marketsite in New York City. \nBack in the day, Cramer would always hear that the four most dangerous words in the English language were \"this time it's different.\" \nAnd when it came to market-rattling events like the dotcom bubble burst — when investors chased internet stocks to artificial highs hoping to catch the \"next big thing\" — that idea usually proved right. \n\"But honestly, I've now been at this business a pretty long time, and I'm beginning to wonder if the four most dangerous words about stock investing are 'this time it's the same,'\" Cramer said on Friday. \nAfter watching big-cap tech stocks like Facebook , Amazon , Netflix , and Alphabet drive the market to new heights, Cramer argued that a \"this-time-it's-different\" mentality could've cost investors fortunes if they had applied it to the FANG names. Casino comeback George Rose | Getty Images People sitting at a bank of slot machines at the Wynn Hotel and Casino is seen in this 2009 Las Vegas, Nevada. \nIn February of 2016, Cramer started recommending the stock of Wynn Resorts , which was then trading at about $79 a share. \nSince then, Wynn's share price has nearly doubled — making it one of S&P 500's best-performing stocks for 2017 — so Cramer thought it was worth revisiting some of the casino names. \n\"Remember, the two big worldwide casino stocks, Wynn and Las Vegas Sands , LVS, are very much plays not on the Nevada casinos, not on Vegas, but on Macau, the Chinese gambling haven,\" the \"Mad Money\" host said. Alder Biopharmaceuticals CEO discuss migraine treatment \nAlder Biopharmaceuticals' migraine treatment is one step closer to being FDA-approved after its latest trial, the drugmaker's co-founder and CEO Randall Shatzman told Cramer on Friday. \n\"What the trial showed was that when we administer Eptinezumab in these patients, as soon as day one, we can see a dramatic clinical benefit: 50 percent less migraines on day one,\" the CEO said. \"About 15 percent of the patients in the study had zero migraines for the 12-week duration of that study, and that's going from 16 migraines down to zero. And this is with a single dose of Eptinezumab that lasted the full three months of the study. So we think it's an opportunity … to really transform how migraine is treated today.\" \nAlder's intravenous treatment has faced competition from giants like Allergan , who have developed migraine treatments in pill form. \nBut Shatzman said that patients with severe migraines don't care how treatments are administered; they simply care whether or not they work. \n\"For them, whether it comes as a subcutaneous injection or whether it comes as an IV infusion that they take four times per year, that's very appealing for them,\" he told Cramer. \"The next steps for us are to get that filing for the FDA together and get it in and look forward to continuing our interactions with the FDA for an ultimate approval next year.\" Faherty Brand CEO: Retail closures are opportunities \nFaherty Brand founder and CEO Alex Faherty said that the recent wave of store closings across the country only creates more bountiful opportunities for his budding clothing brand. \n\"Right now, with all the stores that are closing, it creates opportunity for new brands,\" he told Cramer at the ICR Conference in Orlando, Florida. \"Landlords are willing to do shorter-term deals where the brands can actually make money, and I think that now is going into our favor as far as being able to open up new retail stores.\" \nWith a business that's 40 percent e-commerce, Faherty's high-quality clothing has become especially popular among 21-to-45-year-olds, the CEO said, adding that services like Shopify have changed the game entirely for retailers. \n\"Our technology can do whatever the largest of brands can do now. The barriers to entry have completely changed,\" Faherty said. \"Basically, what used to cost $10 million, to build a back-end of a website for a customer, I, for $1,000 a month can basically have the world's greatest mousetrap when it comes to creating a website.\" Lightning Round: Don't waste your opportunity with WM \nIn Cramer's lightning round , he zipped through his take on some callers' favorite stocks: \nWaste Management : \"It is a super-de-duper buy. Did you see that buyback they just announced? I've been telling club members of ActionAlertsPlus.com the cash flow and the tax regime [are] both fabulous.\" \nOrbital ATK : \"That's kind of a done deal. I think it's time for Raytheon and then General Dynamics .\" \nDisclosure: Cramer's charitable trust owns shares of Facebook, Alphabet, Apple, Allergan and Waste Management. \nQuestions for Cramer?", "external_links": [], "published": "2018-01-13T02:00:00.000+02:00", "crawled": "2018-01-13T02:15:51.010+02:00", "highlightTitle": ""}