{"organizations": [], "uuid": "ae745cb638af29b80e71a1a2f1cfcb4b74bbe3ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-c-h-robinson-reports-fourth-quarter-results.html", "country": "US", "domain_rank": 767, "title": "C.H. Robinson Reports Fourth Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.014, "site_type": "news", "published": "2018-01-31T00:15:00.000+02:00", "replies_count": 0, "uuid": "ae745cb638af29b80e71a1a2f1cfcb4b74bbe3ff"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-c-h-robinson-reports-fourth-quarter-results.html", "ord_in_thread": 0, "title": "C.H. Robinson Reports Fourth Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "c.h. robinson reports fourth results", "sentiment": "negative"}, {"name": "c.h. robinson worldwide, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS--(BUSINESS WIRE)-- C.H. Robinson Worldwide, Inc. (“C.H. Robinson”) (NASDAQ: CHRW), today reported financial results for the quarter ended December 31, 2017. This table of summary results presents our service line net revenues consistent with our historical presentation and is on an enterprise basis. The service line net revenues in the table differ from the segment service line net revenues discussed below as our segments have revenues from multiple service lines. Summarized financial results are set forth in the following table (dollars in thousands, except per share data).\nThree Months Ended December 31, Twelve Months Ended December 31, 2017 2016 % change 2017 2016 % change Total revenues $ 3,959,786 $ 3,414,975 16.0 % $ 14,869,380 $ 13,144,413 13.1 % Net revenues: Transportation Truckload $ 342,134 $ 296,740 15.3 % $ 1,229,999 $ 1,257,191 -2.2 % LTL 105,306 94,299 11.7 % 407,012 381,817 6.6 % Intermodal 5,867 7,521 -22.0 % 29,145 33,482 -13.0 % Ocean 73,135 69,033 5.9 % 290,630 244,276 19.0 % Air 27,595 23,743 16.2 % 100,761 82,167 22.6 % Customs 21,142 15,860 33.3 % 70,952 50,509 40.5 % Other logistics services 29,554 28,404 4.0 % 117,117 105,369 11.1 % Total transportation 604,733 535,600 12.9 % 2,245,616 2,154,811 4.2 % Sourcing 27,116 25,916 4.6 % 122,434 122,717 -0.2 % Total net revenues 631,849 561,516 12.5 % 2,368,050 2,277,528 4.0 % Operating expenses 420,973 367,951 14.4 % 1,592,931 1,439,997 10.6 % Income from operations 210,876 193,565 8.9 % 775,119 837,531 -7.5 % Net income $ 152,556 $ 122,303 24.7 % $ 504,893 $ 513,384 -1.7 % Diluted EPS $ 1.08 $ 0.86 25.6 % $ 3.57 $ 3.59 -0.6 % Our total revenues increased 16.0 percent in the fourth quarter of 2017 compared to the fourth quarter of 2016. The increase in total revenues was driven by increased customer pricing, volume, and fuel costs in most of our transportation services. Our total net revenues increased 12.5 percent in the fourth quarter of 2017 compared to the fourth quarter of 2016.\nFor the fourth quarter of 2017, our total operating expenses increased 14.4 percent compared to the fourth quarter of 2016. Personnel expenses increased 19.7 percent in the fourth quarter of 2017 compared to the fourth quarter of 2016. The increase in personnel expenses was the result of an increase in average headcount of 6.8 percent and an increase in variable compensation in the fourth quarter of 2017 compared to the fourth quarter of 2016. Other selling, general, and administrative expenses increased 1.6 percent.\nInterest and other expenses increased approximately $14.4 million in the fourth quarter of 2017 compared to the fourth quarter of 2016. Interest expense increased due to a higher average debt balance and higher interest rates during the fourth quarter of 2017 compared to the fourth quarter of 2016. The higher average debt balance is a result of borrowings for the acquisition of Milgram and increased working capital needs. Additionally, in the fourth quarter of 2016, we had approximately $4 million in currency gains, primarily due to a stronger U.S. dollar.\nThe provision for income taxes decreased 40.1 percent in the fourth quarter of 2017 compared to the fourth quarter of 2016. During the fourth quarter of 2017, the provision for income taxes decreased by $19.7 million due to the benefit of deductions under Section 199 of the Internal Revenue Code and $12.1 million due to the impact of the Tax Cuts and Jobs Act (“Tax Reform”), which was signed into law on December 22, 2017. The $12.1 million benefit resulting from Tax Reform was primarily the result of the revaluation of deferred tax assets and liabilities due to the decrease in the corporate Federal income tax rate from 35 percent to 21 percent and was partially offset by the impact of certain transition taxes and other impacts of Tax Reform.\nResults by Segment\nOur three reportable segments are: North American Surface Transportation (“NAST”), Global Forwarding, and Robinson Fresh. The balance of our business is reported as “All Other and Corporate.” All Other and Corporate includes our non-reportable segments, including Managed Services and Other Surface Transportation.\nNAST provides freight transportation services across North America through a network of offices in the United States, Canada, and Mexico. The primary services provided by NAST include truckload, less than truckload (“LTL”), and intermodal. Summarized financial results of our NAST segment are as follows (dollars in thousands):\nThree Months Ended December 31, Twelve Months Ended December 31, 2017 2016 % change 2017 2016 % change Total revenues (1) $ 2,618,587 $ 2,281,435 14.8 % $ 9,728,810 $ 8,737,716 11.3 % Net revenues 415,315 363,281 14.3 % 1,525,064 1,524,355 0.0 % Income from operations 180,557 157,631 14.5 % 628,110 674,436 -6.9 % (1) Excludes intersegment revenues. NAST total revenues increased 14.8 percent to $2.6 billion in the fourth quarter of 2017 from $2.3 billion in the fourth quarter of 2016. This increase was driven by pricing increases in all services. NAST net revenues increased 14.3 percent to $415.3 million in the fourth quarter of 2017 compared to $363.3 million in the fourth quarter of 2016, primarily from an increase in truckload net revenues.\nNAST truckload net revenues increased 16.6 percent to $304.5 million in the fourth quarter of 2017 compared to $261.1 million in the fourth quarter of 2016, while truckload volumes declined 3 percent. NAST truckload net revenue margin was flat in the fourth quarter of 2017 compared to the fourth quarter of 2016.\nNAST accounted for approximately 94 percent of our total North America truckload net revenues in the fourth quarter of 2017 and 93 percent in the fourth quarter of 2016. The majority of the remaining North American truckload net revenues is included in Robinson Fresh. Excluding the estimated impacts of the change in fuel prices, our average North America truckload rate per mile charged to our customers increased approximately 15 percent in the fourth quarter of 2017 compared to the fourth quarter of 2016. Our truckload transportation costs increased approximately 14.5 percent, excluding the estimated impacts of the change in fuel prices.\nNAST LTL net revenues increased 10.9 percent to $100.5 million in the fourth quarter of 2017 compared to $90.6 million in the fourth quarter of 2016. NAST LTL volumes increased approximately 10 percent in the fourth quarter of 2017 compared to the fourth quarter of 2016, and net revenue margin decreased.\nNAST intermodal net revenues decreased 34.4 percent to $4.7 million in the fourth quarter of 2017 compared to $7.1 million in the fourth quarter of 2016. NAST intermodal net revenues and net revenue margin decreased while volume increased in the fourth quarter of 2017 compared to the fourth quarter of 2016 due to higher costs on owned and leased containers.\nNAST operating expenses increased 14.2 percent in the fourth quarter of 2017 to $234.8 million compared to $205.7 million in the fourth quarter of 2016. This increase was due to increases in personnel expenses. The increase in personnel expenses is related to an increase in variable compensation in the fourth quarter of 2017 and an increase in average headcount of 1.0 percent compared to the fourth quarter of 2016. The operating expenses of NAST and all other segments include allocated corporate expenses.\nGlobal Forwarding provides global logistics services through an international network of offices in North America, Asia, Europe, Australia, New Zealand, and South America and also contracts with independent agents worldwide. The primary services provided by Global Forwarding include ocean freight services, air freight services, and customs brokerage. Summarized financial results of our Global Forwarding segment are as follows (dollars in thousands):\nThree Months Ended December 31, Twelve Months Ended December 31, 2017 2016 % change 2017 2016 % change Total revenues (1) $ 591,245 $ 475,971 24.2 % $ 2,140,987 $ 1,574,686 36.0 % Net revenues 127,869 114,079 12.1 % 485,280 397,537 22.1 % Income from operations 16,836 24,631 -31.6 % 91,842 80,931 13.5 % (1) Excludes intersegment revenues. Global Forwarding total revenues increased 24.2 percent in the fourth quarter of 2017 to $591.2 million from $476.0 million in the fourth quarter of 2016. Global Forwarding net revenues increased 12.1 percent to $127.9 million in the fourth quarter of 2017 compared to $114.1 million in the fourth quarter of 2016. The acquisition of Milgram accounted for approximately five percentage points of the net revenue growth in Global Forwarding.\nOcean net revenues increased 5.5 percent to $73.1 million in the fourth quarter of 2017 compared to $69.3 million in the fourth quarter of 2016. Air net revenues increased 16.7 percent to $25.7 million in the fourth quarter of 2017 compared to $22.0 million in the fourth quarter of 2016. Customs net revenues increased 33.3 percent to $21.1 million in the fourth quarter of 2017 compared to $15.9 million in the fourth quarter of 2016. These increases were primarily due to volume increases, including those from acquisition.\nGlobal Forwarding operating expenses increased 24.1 percent in the fourth quarter of 2017 to $111.0 million from $89.4 million in the fourth quarter of 2016. This increase was due to increases in both personnel and selling, general, and administrative expenses. The personnel expense increase was driven by an average headcount increase of 19.0 percent. The acquisition of Milgram added approximately 7.5 percent to Global Forwarding average headcount. The selling, general, and administrative expense increase was primarily driven by the addition of Milgram.\nRobinson Fresh provides sourcing services under the name of Robinson Fresh. Our sourcing services primarily include the buying, selling, and marketing of fresh fruits, vegetables, and other perishable items. Robinson Fresh sources products from around the world and has a physical presence in North America, Europe, Asia, and South America. This segment often provides the logistics and transportation of the products it sells, in addition to temperature controlled transportation services for its customers. Summarized financial results of our Robinson Fresh segment are as follows (dollars in thousands):\nThree Months Ended December 31, Twelve Months Ended December 31, 2017 2016 % change 2017 2016 % change Total revenues (1) $ 594,646 $ 529,449 12.3 % $ 2,415,740 $ 2,344,131 3.1 % Net revenues 54,123 51,753 4.6 % 226,059 234,794 -3.7 % Income from operations 12,887 12,980 -0.7 % 53,374 75,757 -29.5 % (1) Excludes intersegment revenues. Robinson Fresh total revenues increased 12.3 percent to $594.6 million in the fourth quarter of 2017 from $529.4 million in the fourth quarter of 2016. Robinson Fresh net revenues increased 4.6 percent to $54.1 million in the fourth quarter of 2017 compared to $51.8 million in the fourth quarter of 2016 as a result of increases in sourcing and transportation net revenues.\nRobinson Fresh sourcing net revenues increased 4.6 percent to $27.1 million from $25.9 million in the fourth quarter of 2017 compared to the fourth quarter of 2016. This increase was due to an increase in net revenue margin and a case volume increase of one percent compared to the fourth quarter of 2016.\nRobinson Fresh transportation net revenues increased 4.5 percent to $27.0 million in the fourth quarter of 2017 compared to $25.8 million in the fourth quarter of 2016, primarily due to an increase in other transportation revenue, partially offset by a decrease in truckload net revenues. Robinson Fresh transportation net revenue margin decreased in the fourth quarter of 2017 compared to the fourth quarter of 2016.\nRobinson Fresh operating expenses increased 6.4 percent in the fourth quarter of 2017 to $41.2 million from $38.8 million in the fourth quarter of 2016. This was primarily due to an increase in salaries and variable compensation, partially offset by a decline in selling, general, and administrative expenses.\nAll Other and Corporate includes our Managed Services segment, as well as Other Surface Transportation outside of North America and other miscellaneous revenues. It also includes any unallocated corporate expenses. Managed Services provides Transportation Management Service, or Managed TMS. Europe Surface Transportation provides services similar to NAST across the European continent. Net revenues for Managed Services and Other Surface Transportation are summarized as follows:\nThree Months Ended December 31, Twelve Months Ended December 31, Net revenues 2017 2016 % change 2017 2016 % change Managed Services $ 18,322 $ 17,667 3.7 % $ 72,166 $ 64,701 11.5 % Other Surface Transportation 16,220 14,736 10.1 % 59,481 56,141 5.9 % Managed Services net revenues increased 3.7 percent in the fourth quarter of 2017 to $18.3 million compared to $17.7 million the fourth quarter of 2016. This increase was a result of new business. Other surface transportation net revenues increased 10.1 percent in the fourth quarter of 2017 to $16.2 million compared to $14.7 million in the fourth quarter of 2016. This increase is primarily the result of increased volumes, partially offset by margin compression in the surface transportation business in Europe.\nAbout C.H. Robinson\nAt C.H. Robinson, we believe in accelerating global trade to seamlessly deliver the products and goods that drive the world’s economy. Using the strengths of our knowledgeable people, proven processes, and global technology, we help our customers work smarter, not harder. As one of the world’s largest third-party logistics providers (3PL), we provide a broad portfolio of logistics services, fresh produce sourcing and managed services for more than 120,000 customers and 73,000 active contract carriers through our integrated network of offices and more than 15,000 employees. In addition, the company, our Foundation and our employees contribute millions of dollars annually to a variety of organizations. Headquartered in Eden Prairie, Minnesota, C.H. Robinson (CHRW) has been publicly traded since 1997. For more information, visit www.chrobinson.com .\nExcept for the historical information contained herein, the matters set forth in this release are that represent our expectations, beliefs, intentions or strategies concerning future events. These are subject to certain risks and uncertainties that could cause actual results to differ materially from our historical experience or our present expectations, including, but not limited to such factors as changes in economic conditions, including uncertain consumer demand; changes in market demand and pressures on the pricing for our services; competition and growth rates within the third party logistics industry; freight levels and increasing costs and availability of truck capacity or alternative means of transporting freight, and changes in relationships with existing truck, rail, ocean, and air carriers; changes in our customer base due to possible consolidation among our customers; our ability to successfully integrate the operations of acquired companies with our historic operations; risks associated with litigation and insurance coverage; risks associated with operations outside of the U.S.; risks associated with the potential impacts of changes in government regulations; risks associated with the produce industry, including food safety and contamination issues; fuel prices and availability; risks of unexpected or unanticipated events or opportunities that might require additional capital expenditures; the impact of war on the economy; and other risks and uncertainties detailed in our Annual and Quarterly Reports.\nAny forward-looking statement speaks only as of the date on which such statement is made, and we undertake no obligation to update such statement to reflect events or circumstances arising after such date. All remarks made during our financial results conference call will be current at the time of the call, and we undertake no obligation to update the replay.\nConference Call Information:\nC.H. Robinson Worldwide Fourth Quarter 2017 Earnings Conference Call\nWednesday, January 31, 2017; 8:30 a.m. Eastern Time\nWe invite call participants to submit questions in advance of the conference call, and we will respond to as many of the questions as we can in the time allowed. To submit your question(s) in advance of the call, please email adrienne.brausen@chrobinson.com .\nPresentation slides and a simultaneous live audio webcast of the conference call may be accessed through the Investor Relations link on C.H. Robinson’s website at www.chrobinson.com .\nTo participate in the conference call by telephone, please call ten minutes early by dialing: 877-269-7756\nInternational callers dial +1-201-689-7817\nCallers should reference the conference ID, which is 13674982\nAn audio replay will be available at http://investor.chrobinson.com .\nTelephone audio replay available until 11:30 a.m. Eastern Time on February 7, 2018: 877-660-6853;\npasscode: 13674982#\nInternational callers dial +1-201-612-7415\nThree Months Ended\nDecember 31,\nTwelve Months Ended\nDecember 31,\n2017 2016 2017 2016 Revenues: Transportation $ 3,647,167 $ 3,110,978 $ 13,502,906 $ 11,704,745 Sourcing 312,619 303,997 1,366,474 1,439,668 Total revenues 3,959,786 3,414,975 14,869,380 13,144,413 Costs and expenses: Purchased transportation and related services 3,042,434 2,575,378 11,257,290 9,549,934 Purchased products sourced for resale 285,503 278,081 1,244,040 1,316,951 Personnel expenses 311,599 260,305 1,179,527 1,064,936 Other selling, general, and administrative expenses 109,374 107,646 413,404 375,061 Total costs and expenses 3,748,910 3,221,410 14,094,261 12,306,882 Income from operations 210,876 193,565 775,119 837,531 Interest and other expense (17,502 ) (3,118 ) (46,656 ) (25,581 ) Income before provision for income taxes 193,374 190,447 728,463 811,950 Provisions for income taxes 40,818 68,144 223,570 298,566 Net income $ 152,556 $ 122,303 $ 504,893 $ 513,384 Net income per share (basic) $ 1.09 $ 0.86 $ 3.59 $ 3.60 Net income per share (diluted) $ 1.08 $ 0.86 $ 3.57 $ 3.59 Weighted average shares outstanding (basic) 139,572 141,711 140,610 142,706 Weighted average shares outstanding (diluted) 140,724 142,164 141,382 142,991 BUSINESS SEGMENT INFORMATION (unaudited, dollars in thousands) All Global Robinson Other and NAST Forwarding Fresh Corporate Eliminations Consolidated Three Months Ended December 31, 2017 Revenues $ 2,618,587 $ 591,245 $ 594,646 $ 155,308 $ — $ 3,959,786 Intersegment revenues (1) 133,197 6,742 51,011 4,398 (195,348 ) — Total revenues $ 2,751,784 $ 597,987 $ 645,657 $ 159,706 $ (195,348 ) $ 3,959,786 Net revenues $ 415,315 $ 127,869 $ 54,123 $ 34,542 $ — $ 631,849 Operating income $ 180,557 $ 16,836 $ 12,887 $ 596 $ — $ 210,876 Depreciation and amortization $ 6,126 $ 8,734 $ 1,196 $ 7,581 $ — $ 23,637 Total Assets $ 2,277,252 $ 821,182 $ 434,080 $ 703,320 $ — $ 4,235,834 Average headcount 6,878 4,683 935 2,540 — 15,036 All Global Robinson Other and NAST Forwarding Fresh Corporate Eliminations Consolidated Three Months Ended December 31, 2016 Revenues $ 2,281,435 $ 475,971 $ 529,449 $ 128,120 $ — $ 3,414,975 Intersegment revenues (1) 86,898 6,726 36,203 1,569 (131,396 ) — Total revenues $ 2,368,333 $ 482,697 $ 565,652 $ 129,689 $ (131,396 ) $ 3,414,975 Net revenues $ 363,281 $ 114,079 $ 51,753 $ 32,403 $ — $ 561,516 Operating income $ 157,631 $ 24,631 $ 12,980 $ (1,677 ) $ — $ 193,565 Depreciation and amortization $ 5,575 $ 7,868 $ 1,192 $ 7,318 $ — $ 21,953 Total Assets $ 2,088,611 $ 703,741 $ 376,654 $ 518,752 $ — $ 3,687,758 Average headcount 6,809 3,934 951 2,380 — 14,074 (1) Intersegment revenues represent the sales between our segments and are eliminated to reconcile to our consolidated results.\nBUSINESS SEGMENT INFORMATION (unaudited, dollars in thousands) All Global Robinson Other and NAST Forwarding Fresh Corporate Eliminations Consolidated Twelve Months Ended December 31, 2017 Revenues $ 9,728,810 $ 2,140,987 $ 2,415,740 $ 583,843 $ — $ 14,869,380 Intersegment revenues (1) 462,390 30,198 167,292 18,174 (678,054 ) — Total revenues $ 10,191,200 $ 2,171,185 $ 2,583,032 $ 602,017 $ (678,054 ) $ 14,869,380 Net revenues $ 1,525,064 $ 485,280 $ 226,059 $ 131,647 — $ 2,368,050 Operating income $ 628,110 $ 91,842 $ 53,374 $ 1,793 — $ 775,119 Depreciation and amortization $ 23,230 $ 33,308 $ 4,730 $ 31,709 — $ 92,977 Total Assets $ 2,277,252 $ 821,182 $ 434,080 $ 703,320 — $ 4,235,834 Average headcount 6,907 4,310 957 2,513 — 14,687 All Global Robinson Other and NAST Forwarding Fresh Corporate Eliminations Consolidated Twelve Months Ended December 31, 2016 Revenues $ 8,737,716 $ 1,574,686 $ 2,344,131 $ 487,880 $ — $ 13,144,413 Intersegment revenues (1) 298,438 30,311 119,403 2,211 (450,363 ) — Total revenues $ 9,036,154 $ 1,604,997 $ 2,463,534 $ 490,091 $ (450,363 ) $ 13,144,413 Net revenues $ 1,524,355 $ 397,537 $ 234,794 $ 120,842 $ — $ 2,277,528 Operating income $ 674,436 $ 80,931 $ 75,757 $ 6,407 — $ 837,531 Depreciation and amortization $ 22,126 $ 23,099 $ 3,782 $ 25,662 — $ 74,669 Total Assets $ 2,088,611 $ 703,741 $ 376,654 $ 518,752 — $ 3,687,758 Average headcount 6,773 3,673 942 2,282 — 13,670 (1) Intersegment revenues represent the sales between our segments and are eliminated to reconcile to our consolidated results.\nCONDENSED CONSOLIDATED BALANCE SHEETS (unaudited, in thousands) December 31, 2017 December 31, 2016 Assets Current assets: Cash and cash equivalents $ 333,890 $ 247,666 Receivables, net 2,113,930 1,711,191 Other current assets 63,116 49,245 Total current assets 2,510,936 2,008,102 Property and equipment, net 230,326 232,953 Intangible and other assets 1,494,572 1,446,703 Total assets $ 4,235,834 $ 3,687,758 Liabilities and stockholders’ investment Current liabilities: Accounts payable and outstanding checks $ 1,096,664 $ 921,788 Accrued compensation 105,316 98,107 Accrued income taxes 12,240 15,472 Other accrued expenses 58,229 70,351 Current portion of debt 715,000 740,000 Total current liabilities 1,987,449 1,845,718 Long term debt 750,000 500,000 Noncurrent income taxes payable 26,684 18,849 Deferred tax liability 45,355 65,122 Other long-term liabilities 601 222 Total liabilities 2,810,089 2,429,911 Total stockholders’ investment 1,425,745 1,257,847 Total liabilities and stockholders’ investment $ 4,235,834 $ 3,687,758 CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS (unaudited, in thousands, except operational data) Twelve Months Ended December 31, 2017 2016 Operating activities: Net income $ 504,893 $ 513,384 Stock-based compensation 41,805 37,565 Depreciation and amortization 92,977 74,669 Provision for doubtful accounts 13,489 5,136 Deferred income taxes (28,731 ) 15,009 Excess tax benefit on stock-based compensation (13,657 ) (18,462 ) Other 4,491 1,907 Changes in operating elements, net of acquisitions: Receivables (364,181 ) (173,211 ) Prepaid expenses and other (9,173 ) (6,378 ) Other non-current assets (19,099 ) (3,934 ) Accounts payable and outstanding checks 144,041 115,917 Accrued compensation and profit-sharing contribution 7,209 (47,570 ) Accrued income taxes 19,452 19,921 Other accrued liabilities (13,015 ) (4,545 ) Net cash provided by operating activities 380,501 529,408 Investing activities: Purchases of property and equipment (40,122 ) (73,452 ) Purchases and development of software (17,823 ) (17,985 ) Acquisitions, net of cash (49,068 ) (220,203 ) Other (521 ) (1,348 ) Net cash used for investing activities (107,534 ) (312,988 ) Financing activities: Borrowings on accounts receivable securitization facility 250,000 — Borrowings on line of credit 8,784,000 6,600,000 Repayments on line of credit (8,809,000 ) (6,310,000 ) Net repurchases of common stock (165,412 ) (190,332 ) Excess tax benefit on stock-based compensation — 18,462 Cash dividends (258,222 ) (245,430 ) Net cash used for financing activities (198,634 ) (127,300 ) Effect of exchange rates on cash 11,891 (9,683 ) Net change in cash and cash equivalents 86,224 79,437 Cash and cash equivalents, beginning of period 247,666 168,229 Cash and cash equivalents, end of period $ 333,890 $ 247,666 As of December 31, Operational Data: 2017 2016 Employees 15,074 14,125 Source: C.H. Robinson\nCHRW-IR\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130006327/en/\nC.H. Robinson Worldwide, Inc.\nAndrew Clarke, 952-683-3474\nChief Financial Officer\nor\nTim Gagnon, 952-683-5007\nVice President\nSource: C.H. Robinson Worldwide, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestor.chrobinson.com&esheet=51751085&newsitemid=20180130006327&lan=en-US&anchor=http%3A%2F%2Finvestor.chrobinson.com&index=3&md5=33561859858db8802e9b9c5ff6fe1ab2", "http://www.businesswire.com/news/home/20180130006327/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.chrobinson.com&esheet=51751085&newsitemid=20180130006327&lan=en-US&anchor=www.chrobinson.com&index=1&md5=5ab3eaf8fdd998d7bb7764448ba229cc", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.chrobinson.com&esheet=51751085&newsitemid=20180130006327&lan=en-US&anchor=www.chrobinson.com&index=2&md5=2af25c43b1520727f6a883b8e0a3663d"], "published": "2018-01-31T00:15:00.000+02:00", "crawled": "2018-01-31T02:50:07.001+02:00", "highlightTitle": ""}