{"organizations": [], "uuid": "6fd38e359d0d2f87b97a92991870c6de813359cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 75, "shares": 75, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1222002362&w=1200&r=LYNXMPEE0D0PE", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-global-markets/asia-shares-hit-historic-high-dollar-on-defensive-idUSKBN1F310Q", "country": "US", "domain_rank": 408, "title": "Asia shares hit historic high, dollar on defensive", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T07:43:00.000+02:00", "replies_count": 0, "uuid": "6fd38e359d0d2f87b97a92991870c6de813359cc"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-global-markets/asia-shares-hit-historic-high-dollar-on-defensive-idUSKBN1F310Q", "ord_in_thread": 0, "title": "Asia shares hit historic high, dollar on defensive", "locations": [], "entities": {"persons": [], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "nasdaq", "sentiment": "none"}, {"name": "treasuries", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - The euro shot to a three-year high on Monday as optimism around growth buoyed expectations of tighter monetary policy from European Central Bank, while the chance of a pro-European Union coalition in Germany also boosted confidence in the continent.\nWith the world in general and Europe in particular showing signs of sustained economic growth, global stock benchmarks jumped to new highs, even though investors are now pricing in the withdrawal of central banks’ stimulus.\nThat view was given further fuel last week by an account of ECB discussions that suggested policymakers may soon start preparing the ground for a reduction in support.\nThe single currency climbed as much as 0.8 percent to $1.22965 at one stage on Monday, a price last seen in December 2014, just before the ECB first announced its government bond purchase program.\nIn addition, Bank of Japan Governor Haruhiko Kuroda offered a positive view on his nation’s economy and inflation on Monday, sending the yen to a four-month high against the dollar.\n“The latest leg up in the euro has clearly come from optimism that the German government is moving towards an agreement for a coalition government,” said Investec economist Victoria Clarke.\nGerman Chancellor Angela Merkel’s CDU party and the Social Democrats (SPD) are moving towards formal coalition talks, soothing concerns around Europe’s largest economy.\nThe SPD’s pro-European stance - leader Martin Schulz recently argued for a “United States of Europe” - also strengthens the case for investment in the euro.\n“This follows an earlier move triggered by the crucial line in the ECB account which has got people thinking about when the first move on rates will happen,” said Clarke.\nEuro zone money markets now price in a 70 percent chance of a 10-basis-point rate increase by the ECB by the end of the year, up from 50 percent a week before.\nThe strength in the euro pushed European stocks a touch lower, as exporters were hit by the currency strength. An index of pan-European stocks was down 0.1 percent on the day, but still not far from multi-year high hit last week.\nThe slight decline comes in the wider context of boom for stocks so far in 2018, as investors bask in strong growth numbers from most of the world’s largest economies.\nMSCI’s all-country index of world stocks soared to new records overnight and MSCI’s Asia ex-Japan index breached its 2007 high for the first time to set a new all-time record.\nStocks in Hong Kong jumped 0.9 percent from Friday’s record closing high. Investors were optimistic that Chinese gross domestic product data for the December quarter due on Thursday would show growth of at least 6.7 percent for the world’s second-biggest economy.\nThe momentum of global economic growth through the closing months of last year is being underlined by the early stages of the fourth-quarter earnings season.\nEarnings for S&P 500 companies are expected to increase on average by 12.1 percent in the quarter, with profit for financial services companies likely to increase 13.2 percent, according to Thomson Reuters I/B/E/S.\nWall Street stocks set records on Friday and looked set to rise again, with U.S. stock futures up 0.1 percent, but U.S. markets will be mostly closed on Monday for the Martin Luther King Day holiday.\nDOLLAR DOWN The dollar index dropped to fresh troughs on Monday, with strength in the euro helping to push it down half a percent against a basket of six major currencies, to its lowest in more than three years.\nThough the Federal Reserve is expected to continue to raise U.S. rates this year, those increases have largely been priced in and investors are starting to position for central bank action in Europe and Japan instead.\nThe dollar slipped to a six-week low against the yen at 110.67 yen, even as the head of the Bank of Japan reiterated his commitment to keeping yields low.\nOil prices dropped following six straight sessions of gains, with output cuts led by OPEC and Russia as well as healthy demand keeping crude near December 2014 highs. [O/R]\nBrent crude futures fell 19 cents to $69.68 a barrel, while U.S. crude was lower 12 cents at $64.19.\nReporting by Abhinav Ramnarayan; Additional reporting by Wayne Cole in Sydney, editing by Larry King\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T07:43:00.000+02:00", "crawled": "2018-01-15T01:52:45.013+02:00", "highlightTitle": ""}