{"organizations": [], "uuid": "387157c41309fdb7acaacaa62ca1d4a7c03fd431", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180117.html", "section_title": "Archive News &amp; Video for Wednesday, 17 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-usa-trafficking-massageparlors/sex-trafficking-in-u-s-massage-parlors-a-2-5-billion-business-study-finds-idUSKBN1F6321", "country": "US", "domain_rank": 408, "title": "Sex trafficking in U.S. massage parlors a $2.5 billion business, study finds", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.145, "site_type": "news", "published": "2018-01-18T06:38:00.000+02:00", "replies_count": 0, "uuid": "387157c41309fdb7acaacaa62ca1d4a7c03fd431"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-trafficking-massageparlors/sex-trafficking-in-u-s-massage-parlors-a-2-5-billion-business-study-finds-idUSKBN1F6321", "ord_in_thread": 0, "title": "Sex trafficking in U.S. massage parlors a $2.5 billion business, study finds", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "new york", "sentiment": "negative"}, {"name": "polaris", "sentiment": "none"}, {"name": "rochelle keyhan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Thomson Reuters Foundation) - U.S. traffickers make $2.5 billion a year forcing women to have sex in massage parlors, according to a report on Wednesday describing victims as new immigrants with debts and no language skills.\nThe illegal massage parlor business is the second largest U.S. human trafficking industry after escort services, the anti-slavery group Polaris said in is study.\nTypical victims are recent Chinese or South Korean immigrant mothers who speak little or no English and are burdened by debt, the study found.\nThey work in some 9,000 massage parlors found along highways and behind storefronts in strip malls across the country.\nNew York and California are the main ports of entry for recruits who often are lured by acquaintances promising a legitimate job, it said.\nOnce in the United States, the women are kept quiet with threats and are moved among locations every few weeks.\nThe study’s finding that the industry makes some $2.5 billion a year is the first time an estimated value has been made public, said Rochelle Keyhan, the report’s lead author.\nGlobally, human trafficking earns profits of roughly $150 billion a year for traffickers, according to the International Labour Organization. That figure includes profits from sexual exploitation and forced labor.\nPolaris said it reviewed some 3,000 cases and interviewed law enforcement and survivors.\nRooting out trafficking rings behind operations hiding in plain sight would require the public learning to decode signs of illicit setups, it said.\nThose signs might include surveillance cameras, entrances equipped with door buzzers, covered windows or female staff serving customers at odd hours, Polaris said.\nAlso helping in the fight would be higher public awareness of the crime, Keyhan told the Thomson Reuters Foundation.\n“Unfortunately the dominant narrative around this type of trafficking is that it’s all consensual,” she said.\nLaws governing massage parlors are riddled with loopholes that allow for criminal operations, Polaris said.\nThe Washington-based group cited San Francisco, which regulates hours of operation of massage businesses, as taking a positive step. The move resulted in the closing of more than 100 massage parlors, it said.\nGlobally, more than 40 million people are victims of human trafficking, according to the ILO. An estimated 4 million of them are forced into sexual exploitation.\nReporting by Sebastien Malo @sebastienmalo, Editing by Ellen Wulfhorst. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T06:38:00.000+02:00", "crawled": "2018-01-18T16:09:35.052+02:00", "highlightTitle": ""}