{"organizations": [], "uuid": "4b6736b1adcabe63b3f8c037fd216e344b8c2969", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INformulaOne", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/germany-politics/german-parties-at-odds-ahead-of-coalition-talks-idINKBN1ER04O", "country": "US", "domain_rank": 408, "title": "German parties at odds ahead of coalition talks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T05:16:00.000+02:00", "replies_count": 0, "uuid": "4b6736b1adcabe63b3f8c037fd216e344b8c2969"}, "author": "", "url": "https://in.reuters.com/article/germany-politics/german-parties-at-odds-ahead-of-coalition-talks-idINKBN1ER04O", "ord_in_thread": 0, "title": "German parties at odds ahead of coalition talks", "locations": [], "entities": {"persons": [{"name": "angela merkel", "sentiment": "none"}, {"name": "merkel", "sentiment": "none"}, {"name": "thorsten schaefer-guembel", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}], "organizations": [{"name": "shalal", "sentiment": "none"}, {"name": "spd", "sentiment": "none"}, {"name": "min read  berlin", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN (Reuters) - Chancellor Angela Merkel’s conservatives and Social Democrats (SPD) traded barbs about migration and tax cuts on Tuesday amid mounting questions about whether they can agree to renew the “grand coalition” that ruled Germany for the past four years.\nMerkel, under pressure after failing to form a government three months after national elections, hopes to secure a fourth term in office by persuading the centre-left SPD to join the government despite punishing losses in September’s election.\nParty leaders will meet for preliminary talks on Jan. 3 ahead of exploratory talks scheduled for Jan. 7 through Jan. 12, but a growing number of politicians now say Merkel might have to rule with a minority government, or face new elections.\nSPD deputy leader Thorsten Schaefer-Guembel said recent comments by some conservatives were “counterproductive for every form of government formation” and said they had sparked doubts about the will of conservatives to govern together.\nHe said a deal on a new coalition was far from certain and it was unclear if the talks could develop sufficient trust.\n“A minority government remains an option, even if Chancellor Angela Merkel doesn’t want to acknowledge that,” he said in an interview published Tuesday in the Passauer Neue Presse newspaper.\nSchaefer-Guembel cited differences with conservatives on a range of issues and rejected as “absurd” proposals by some conservatives to cut taxes for high-income earners.\nConservatives and the SPD are also at odds over healthcare, immigration, Europe, work regulations and pensions.\nSchaefer-Guembel said he backed calls by SPD parliamentary leader Andrea Nahles to raise taxes for the wealthiest and urge fresh efforts to prevent big companies from evading taxes.\nActing German Chancellor Angela Merkel address a news conference at the Christian Democratic Union (CDU) party headquarters in Berlin, Germany, December 18, 2017. REUTERS/Hannibal Hanschke/Files Merkel’s Bavarian sister party, the CSU, has distanced itself from the SPD through policy papers calling for corporate tax cuts, reductions in benefits for asylum seekers, higher military spending and limits on immigration.\nThe powerful economic council of Merkel’s Christian Democrats (CDU) said it will urge CSU party leaders to push for a minority government when they meet this week, arguing that Germany would face “enormous financial burdens for generations” if the SPD pushed through its spending plans in a coalition.\n“A grand coalition will be more expensive in the long term than a minority government,” Wolfgang Steiger, secretary general of the council told the Augsburger Allgemeine newspaper.\nThe SPD initially wanted to stay in opposition, but agreed to explore the possibility of governing with the conservatives in the interest of political stability after Merkel’s coalition talks with two smaller parties collapsed in November.\nExperts say new elections could hand more gains to the far-right Alternative for Germany (AfD) party that entered parliament for the first time in September. Merkel says a new coalition would be more stable than minority government.\nBavarian Interior Minister Joachim Herrmann, a CSU negotiator, told the Funke media group his party would insist on limiting immigration levels. It wanted to extend a temporary ban on family reunifications for migrants who were granted “subsidiary protection”, an asylum status for those not officially classed as refugees.\nHe said his party viewed it as a democratic responsibility to negotiate a new coalition if policy gaps could be overcome.\n“I hope the Social Democrats feel the same sense of responsibility,” he said. “We have an urgent need for action on the legislative front.... We urgently need clear majorities in parliament, we need reliable coalitions.”\nA top member of the pro-business Free Democrats, which dropped out of coalition talks with conservatives and Greens in November, said such a coalition remained a future possibility.\nAlexander Lambsdorff, deputy leader of the FDP’s parliamentary group, also told the Heilbronner Stimme newspaper that he did not exclude the possibility of new elections or a minority government. “That would not be nice, but it also would not result in a constitutional crisis,” he said.\nReporting by Andrea Shalal; Editing by Peter Graff\n ", "external_links": [], "published": "2018-01-02T05:16:00.000+02:00", "crawled": "2018-01-02T05:32:45.296+02:00", "highlightTitle": ""}