{"organizations": [], "uuid": "3c8f1148e328c8241f598ddbe8594d7fb8102687", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-wall-street-edges-higher-on-strong-earnings-idUSL4N1PI4Z1", "country": "US", "domain_rank": 408, "title": "US STOCKS-Wall Street edges higher on strong earnings", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-23T23:11:00.000+02:00", "replies_count": 0, "uuid": "3c8f1148e328c8241f598ddbe8594d7fb8102687"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-wall-street-edges-higher-on-strong-earnings-idUSL4N1PI4Z1", "ord_in_thread": 0, "title": "US STOCKS-Wall Street edges higher on strong earnings", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "sruthi shankar jan", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "verizon", "sentiment": "neutral"}, {"name": "netflix", "sentiment": "neutral"}, {"name": "travelers", "sentiment": "neutral"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Netflix at record high on upbeat Q4 subscriptions\n* Verizon, Travelers up after earnings beat\n* Trump slaps import tariffs on washing machines, solar panels\n* Indexes: Dow down 0.08 pct, S&P up 0.09 pct, Nasdaq up 0.28 pct (Updates to open)\nBy Sruthi Shankar\nJan 23 (Reuters) - Wall Street’s main indexes were higher in morning trading on Tuesday as upbeat results from Netflix, Travelers outweighed concerns of the potential impact of President Donald Trump’s decision to impose steep import tariffs.\nNetflix jumped 11 percent to a life-high of $257.71 after the video-streaming pioneer beat Wall Street targets for new subscribers in the fourth quarter. The stock provided the biggest boost to the Nasdaq.\nThe results also boosted other FAANG stocks, led by Amazon’s 1.5 percent gain.\nTravelers was the biggest gainer on the Dow, rising 4.7 percent after the property and casualty insurer reported profit that beat Wall Street estimates.\nSouth Korea and China protested against Trump’s move to impose import tariffs on washing machines and solar panels, with Seoul saying it would respond to the spread of protectionist measures.\n“We don’t know if this is the beginning of something larger or if it’s something that will escalate into a trade war,” said Art Hogan, chief market strategist at B. Riley FBR in Boston.\nHogan also said it sparked fears about U.S. walking away from NAFTA.\nNAFTA’s future hangs in the balance this week as negotiators from the United States, Canada and Mexico try to settle major differences over revamping a pact that Trump has threatened to abandon.\nAt 9:36 a.m. ET (1446 GMT), the Dow Jones Industrial Average was down 22.23 points, or 0.08 percent, at 26,192.37 and the S&P 500 was up 2.42 points, or 0.09 percent, at 2,835.39. The Nasdaq Composite was up 21.11 points, or 0.28 percent, at 7,429.14.\nThe major indexes notched record closing highs on Monday after U.S. lawmakers reached a deal to end a three-day federal government shutdown.\nSeven of the 11 major S&P sectors were higher, led by a 0.62 percent gain in consumer discretionary stocks.\nVerizon rose about 1 percent after the No. 1 U.S. wireless carrier reported quarterly revenue that exceeded analyst estimates as phone subscribers grew while tax cuts helped its profits soar.\nJohnson & Johnson fell 1.3 percent after the healthcare company reported a quarterly loss due to a $13.6 billion charge related to the new U.S. tax law, but beat adjusted quarterly profit estimate.\nShares of Whirlpool rose 3 percent and solar companies such as Real Goods Solar, Sunworks and First Solar rose between 7 percent and 39 percent following the new tariffs.\nProcter & Gamble fell 2.5 percent after the company reported an 8 percent drop in quarterly profit due to the sale of a chunk of its beauty brands to Coty and a charge related to the recent U.S. tax overhaul.\nAdvancing issues outnumbered decliners on the NYSE by 1,288 to 1,262. On the Nasdaq, 1,232 issues fell and 1,145 advanced.\nReporting by Sruthi Shankar in Bengaluru; Editing by Sriraj Kalluvila\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T23:11:00.000+02:00", "crawled": "2018-01-24T15:48:02.014+02:00", "highlightTitle": ""}