{"organizations": [], "uuid": "34961617211c97efa9a182cf8d1a5c19a482d7d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-resmed-inc-announces-results-for-the-second-quarter-of-fiscal-year-2018.html", "country": "US", "domain_rank": 767, "title": "ResMed Inc. Announces Results for the Second Quarter of Fiscal Year 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T00:05:00.000+02:00", "replies_count": 0, "uuid": "34961617211c97efa9a182cf8d1a5c19a482d7d7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-resmed-inc-announces-results-for-the-second-quarter-of-fiscal-year-2018.html", "ord_in_thread": 0, "title": "ResMed Inc. Announces Results for the Second Quarter of Fiscal Year 2018", "locations": [], "entities": {"persons": [{"name": "mick farrell", "sentiment": "none"}, {"name": "farrell", "sentiment": "none"}, {"name": "mobi", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mobi", "sentiment": "none"}], "organizations": [{"name": "asx", "sentiment": "negative"}, {"name": "resmed inc", "sentiment": "negative"}, {"name": "resmed inc.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "resmed", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 22, 2018 /PRNewswire/ -- ResMed Inc. (NYSE: RMD, ASX: RMD) today announced results for its quarter ended December 31, 2017. Revenue for the quarter was $601.3 million, a 13 percent increase compared to the same period of the prior year.\n\"We had a strong quarter with double-digit revenue and operating profit growth\" said Mick Farrell, ResMed's chief executive officer. \"Our masks have performed well around the world, device sales are solid, and our cloud-based software continues to grow rapidly. Our operating excellence initiatives are achieving leverage in the business with more runway ahead.\"\nFarrell concluded, \"We recently announced our first ResMed branded portable oxygen concentrator, called Mobi, which will launch in the current quarter. Mobi exemplifies patient-centered innovation and our commitment to pioneer products and create value with services and solutions that improve patients' quality of life, reduce the impact of chronic disease and save healthcare costs globally.\"\nAnalysis of second quarter results\nSecond quarter revenue in United States, Canada and Latin America, excluding Brightree, was $329.2 million, a 12 percent increase over the same period of the prior year. Brightree revenue for the second quarter was $38.7 million, an increase of 14 percent compared to the same period of the prior year. Revenue in Europe, Asia and other markets was $233.4 million, an increase of 8 percent on a constant currency basis, compared to the same period of the prior year.\nGross margin in the second quarter was 58.2 percent, lower than the prior year's quarter gross margin of 58.3 percent mainly due to declines in average selling prices, which were partially offset by manufacturing and procurement efficiencies.\nIncome from operations for the quarter was $146.0 million, a 51 percent increase compared with the quarter ended December 31, 2016. Non-GAAP income from operations for the quarter was $157.3 million, a 20 percent increase compared to the same period of the prior year.\nSelling, general and administrative expenses were $151.8 million, a 9 percent increase over the same period in the prior year, or a 6 percent increase on a constant currency basis. SG&A expenses improved to 25.2 percent of revenue in the quarter, compared with 26.3 percent reported in the quarter ended December 31, 2016.\nResearch and development expenses were $40.6 million, or 6.8 percent of revenue. R&D expenses increased by 6 percent compared with the same period last year, or a 4 percent increase on a constant currency basis.\nAmortization of acquired intangible assets was $11.3 million during the quarter, which is consistent with the same period last year. Stock-based compensation costs incurred during the quarter of $12.0 million consisted of expenses associated with employee equity grants and our employee stock purchase plan.\nNet income for the quarter was $9.5 million, an 88 percent decrease compared to the same period of the prior year. Non-GAAP net income was $143.8 million, a 39 percent increase compared to the prior year.\nNon-GAAP measures adjust for amortization of acquired intangibles, impact of U.S. tax reform on income tax expense, restructuring expenses, litigation settlement expenses, acquisition related expenses and the Astral battery field safety notification expenses.\nGAAP diluted earnings per share for the quarter decreased by 87 percent to $0.07. Non-GAAP diluted earnings per share of $1.00 were 37 percent higher compared with the same period of the prior year.\nCash flow from operations for the quarter was $132.6 million compared to net income in the current quarter of $9.5 million. During the quarter we paid $49.9 million in dividends.\nImpact of U.S. tax reform on income tax expense\nOn December 22, 2017 \"H.R.1\", originally known as the Tax Cuts and Jobs Act, was enacted into law (\"U.S. tax reform\"). ASC 740 Income Taxes requires companies to recognize the effect of any tax laws during the period in which they are enacted. Accordingly, the company performed preliminary calculations and based on these, recognized additional income tax expense of $126.6 million for the three and six months ended December 31, 2017.\nThe U.S. tax reform significantly revises the U.S. corporate income tax by, among other things, imposing a one-time transition tax on unremitted foreign earnings, lowering the corporate income tax rate from 35 percent to 21 percent and implementing a territorial tax system in regard to foreign earnings. The one-time transition tax on unremitted foreign earnings results in additional income tax expense of $119.9 million, of which $10.5 million has been recorded as income taxes payable and $109.4 million has been recorded as long-term income taxes payable. The lower corporate tax rate results in a reduction of net deferred tax assets and an increase in income tax expense of $6.7 million.\nShare repurchase program\nDuring the quarter, the company repurchased 100,000 shares at a cost of $8.5 million, as part of its ongoing capital management program.\nDividend program\nThe ResMed board of directors today declared a quarterly cash dividend of $0.35 per share. The dividend will have a record date of February 8, 2018, payable on March 15, 2018. The dividend will be paid in U.S. currency to holders of ResMed's common stock trading on the New York Stock Exchange. Holders of Chess Depositary Instruments trading on the Australian Securities Exchange will receive an equivalent amount in Australian currency, based on the exchange rate on the record date, and reflecting the 10:1 ratio between CDIs and NYSE shares. The ex-dividend date will be February 7, 2018 for common stock holders and for CDI holders. ResMed has received a waiver from the ASX's settlement operating rules, which will allow ResMed to defer processing conversions between its common stock and CDI registers from February 7, 2018 through February 8, 2018, inclusive.\nWebcast details\nResMed will discuss its second quarter fiscal year 2018 results today on its webcast at 1:30 p.m. U.S. Pacific Time. The live webcast of the call can be accessed on ResMed's investor relations website at investor.resmed.com . Please go to this section of the website and click on the icon for the \"Q2 2018 earnings webcast\" to register and listen to the live webcast. A replay of the earnings webcast will be available on ResMed's investor relations website approximately two hours after the live webcast. In addition, a telephone replay of the conference call will be available approximately two hours after the webcast by dialing 800-585-8367 (U.S.) and +1 416-621-4642 (outside U.S.) and enter the passcode 2385139. The telephone replay will be available until February 5, 2018.\nAbout ResMed\nResMed (NYSE: RMD, ASX: RMD), a world-leading connected health company with more than 4 million cloud-connected devices for daily remote patient monitoring, changes lives with every breath. Its award-winning devices and software solutions help treat and manage sleep apnea, chronic obstructive pulmonary disease and other respiratory conditions. Its 6,000-member team strives to improve patients' quality of life, reduce the impact of chronic disease and save healthcare costs in more than 120 countries.\nSafe harbor statement\nStatements contained in this release that are not historical facts are \"forward-looking\" statements as contemplated by the Private Securities Litigation Reform Act of 1995. These forward-looking statements– including statements regarding ResMed's projections of future revenue or earnings, expenses, new product development, new product launches and new markets for its products, litigation, and tax outlook– are subject to risks and uncertainties, which could cause actual results to materially differ from those projected or implied in the forward-looking statements. Additional risks and uncertainties are discussed in ResMed's periodic reports on file with the U.S. Securities & Exchange Commission. ResMed does not undertake to update its forward-looking statements.\nFor investors\nFor media\nAgnes Lee\nJayme Rubenstein\nO: 858-836-5971\nO: 858-836-6798\ninvestorrelations@resmed.com\nnews@resmed.com\nRESMED INC. AND SUBSIDIARIES\nCondensed Consolidated Statements of Income (Unaudited)\n(In thousands, except per share data)\nThree Months Ended\nSix Months Ended\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nNet revenue\n$\n601,273\n$\n530,397\n$\n1,124,932\n$\n995,846\nCost of sales\n251,481\n221,326\n469,535\n412,522\nAstral field safety notification expenses (1)\n-\n-\n-\n5,070\nGross profit\n349,792\n309,071\n655,397\n578,254\nOperating expenses:\nSelling, general and administrative\n151,816\n139,307\n295,666\n268,158\nResearch and development\n40,643\n38,190\n78,058\n72,637\nRestructuring expenses (1)\n-\n4,413\n-\n4,413\nLitigation settlement expenses (1)\n-\n8,500\n-\n8,500\nAcquisition related expenses (1)\n-\n10,076\n-\n10,076\nAmortization of acquired intangible assets (1)\n11,317\n11,690\n23,099\n23,431\nTotal operating expenses\n203,776\n212,176\n396,823\n387,215\nIncome from operations (1)\n146,016\n96,895\n258,574\n191,039\nOther income (expenses), net:\nInterest income (expense), net\n(2,791)\n(2,437)\n(5,706)\n(4,929)\nOther, net\n(1,460)\n1,749\n(2,618)\n3,021\nTotal other income (expenses), net\n(4,251)\n(688)\n(8,324)\n(1,908)\nIncome before income taxes\n141,765\n96,207\n250,250\n189,131\nIncome taxes (1)\n132,238\n19,464\n154,599\n36,282\nNet income (1)\n$\n9,527\n$\n76,743\n$\n95,651\n$\n152,849\nBasic earnings per share\n$\n0.07\n$\n0.54\n$\n0.67\n$\n1.08\nDiluted earnings per share\n$\n0.07\n$\n0.54\n$\n0.67\n$\n1.08\nNon-GAAP diluted earnings per share (1)\n$\n1.00\n$\n0.73\n$\n1.66\n$\n1.34\nBasic shares outstanding\n142,715\n141,310\n142,511\n141,048\nDiluted shares outstanding\n143,855\n142,097\n143,757\n141,982\n(1)\nSee the reconciliation of non-GAAP financial measures in the table at the end of the press release.\nRESMED INC. AND SUBSIDIARIES\nCondensed Consolidated Balance Sheets (Unaudited - In thousands)\nDecember 31,\nJune 30,\n2017\n2017\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n858,899\n$\n821,935\nAccounts receivable, net\n482,934\n450,530\nInventories\n296,062\n268,319\nPrepayments and other current assets\n116,454\n103,219\nTotal current assets\n1,754,349\n1,644,003\nProperty, plant and equipment, net\n401,537\n394,241\nGoodwill\n1,075,315\n1,064,874\nOther intangibles, net\n240,027\n261,800\nDeferred income taxes and other non-current assets\n92,772\n103,569\nTotal non-current assets\n1,809,651\n1,824,484\nTotal assets\n$\n3,564,000\n$\n3,468,487\nLIABILITIES AND STOCKHOLDERS' EQUITY:\nCurrent liabilities:\nAccounts payable\n78,351\n92,763\nAccrued expenses\n189,368\n186,295\nDeferred revenue\n53,284\n51,918\nIncome taxes payable\n16,276\n29,150\nShort-term debt\n1,019,132\n-\nTotal current liabilities\n1,356,411\n360,126\nNon-current liabilities:\nDeferred revenue\n63,289\n53,235\nDeferred income taxes\n13,141\n13,822\nOther long term liabilities\n2,217\n2,427\nLong-term debt\n-\n1,078,611\nLong-term income taxes payable\n109,414\n-\nTotal non-current liabilities\n188,061\n1,148,095\nTotal liabilities\n1,544,472\n1,508,221\nSTOCKHOLDERS' EQUITY:\nCommon stock\n572\n569\nAdditional paid-in capital\n1,409,993\n1,379,130\nRetained earnings\n2,312,335\n2,316,237\nTreasury stock\n(1,555,152)\n(1,546,611)\nAccumulated other comprehensive income\n(148,220)\n(189,059)\nTotal stockholders' equity\n$\n2,019,528\n$\n1,960,266\nTotal liabilities and stockholders' equity\n$\n3,564,000\n$\n3,468,487\nRESMED INC. AND SUBSIDIARIES\nCondensed Consolidated Statements of Cash Flows (Unaudited - In thousands)\nSix Months Ended\nDecember 31,\n2017\n2016\nCash flows from operating activities:\nNet income\n$\n95,651\n$\n152,849\nAdjustment to reconcile net income to cash provided by operating activities:\nDepreciation and amortization\n58,945\n55,504\nStock-based compensation costs\n23,958\n22,802\nImpairment of cost-method investments\n2,254\n206\nChanges in fair value of business combination contingent consideration\n-\n10,076\nChanges in operating assets and liabilities, net of effect of acquisitions:\nAccounts receivable, net\n(26,145)\n(7,080)\nInventories, net\n(20,760)\n(36,104)\nPrepaid expenses, net deferred income taxes and other current assets\n(2,858)\n(15,197)\nAccounts payable, accrued expenses and other\n95,489\n23,086\nNet cash provided by operating activities\n226,534\n206,142\nCash flows from investing activities:\nPurchases of property, plant and equipment\n(32,000)\n(29,247)\nPatent registration costs\n(4,624)\n(4,603)\nBusiness acquisitions, net of cash acquired\n-\n(3,184)\nInvestments in cost-method investments\n(3,725)\n(3,867)\nProceeds / (Payments) on maturity of foreign currency contracts\n(3,330)\n8,209\nNet cash used in investing activities\n(43,679)\n(32,692)\nCash flows from financing activities:\nProceeds from issuance of common stock, net\n6,587\n9,816\nPurchases of treasury stock\n(8,541)\n-\nProceeds from borrowings, net of borrowing costs\n50,000\n75,000\nRepayment of borrowings\n(110,000)\n(80,000)\nDividends paid\n(99,553)\n(92,865)\nNet cash (used in) / provided by financing activities\n(161,507)\n(88,049)\nEffect of exchange rate changes on cash\n15,616\n(28,689)\nNet increase / (decrease) in cash and cash equivalents\n36,964\n56,712\nCash and cash equivalents at beginning of period\n821,935\n731,434\nCash and cash equivalents at end of period\n$\n858,899\n$\n788,146\nReconciliation of Non-GAAP Financial Measures (Unaudited)\n(In US$ thousands, except share and per share data)\nThe measure, \"non-GAAP income from operations\" is reconciled with GAAP income from operations below:\nThree Months Ended\nSix Months Ended\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nGAAP income from operations\n$\n146,016\n$\n96,895\n$\n258,574\n$\n191,039\nAmortization of acquired intangible assets (A)\n11,317\n11,690\n23,099\n23,431\nRestructuring expenses (A)\n-\n4,413\n-\n4,413\nLitigation settlement expenses (A)\n-\n8,500\n-\n8,500\nAcquisition related expenses (A)\n-\n10,076\n-\n10,076\nAstral battery field safety notification expenses (A)\n-\n-\n-\n5,070\nNon-GAAP income from operations\n$\n157,333\n$\n131,574\n$\n281,673\n$\n242,529\nThe measures \"non-GAAP net income\" and \"non-GAAP diluted earnings per share\" are reconciled with GAAP net income and GAAP diluted earnings per share in the table below:\nThree Months Ended\nSix Months Ended\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nGAAP net income\n$\n9,527\n$\n76,743\n$\n95,651\n$\n152,849\nAmortization of acquired intangible assets, net of tax (A)\n7,697\n7,968\n15,710\n15,975\nU.S. tax reform transition impact (A)\n119,880\n-\n119,880\n-\nU.S. tax reform impact on deferred taxes (A)\n6,723\n-\n6,723\n-\nRestructuring expenses, net of tax (A)\n-\n3,085\n-\n3,085\nLitigation settlement expenses, net of tax (A)\n-\n5,392\n-\n5,392\nAcquisition related expenses (A)\n-\n10,076\n-\n10,076\nAstral battery field safety notification expenses (A)\n-\n-\n-\n3,549\nNon-GAAP net income (A)\n$\n143,827\n$\n103,264\n$\n237,964\n$\n190,926\nDiluted shares outstanding\n143,855\n142,097\n143,757\n141,982\nGAAP diluted earnings per share\n$\n0.07\n$\n0.54\n$\n0.67\n$\n1.08\nNon-GAAP diluted earnings per share (A)\n$\n1.00\n$\n0.73\n$\n1.66\n$\n1.34\n(A)\nResMed adjusts for the impact of the amortization of acquired intangibles, impact of U.S. tax reform, restructuring expenses, litigation settlement expenses, acquisition related expenses and the Astral battery field safety notification expenses, from their evaluation of ongoing operations and believes investors benefit from adjusting these items to facilitate a more meaningful evaluation of current operating performance.\nResMed believes that non-GAAP diluted earnings per share is an additional measure of performance investors can use to compare operating results between reporting periods. ResMed uses non-GAAP information internally in planning, forecasting, and evaluating the results of operations in the current period and in comparing it to past periods. ResMed believes this information provides investors better insight in evaluating ResMed's performance from core operations and provides consistent financial reporting. Our use of non-GAAP measures is intended to supplement, and not to replace, our presentation of net income and other GAAP measures. Like all non-GAAP measures, non-GAAP earnings are subject to inherent limitations because they do not include all the expenses that must be included under GAAP.\nView original content with multimedia: http://www.prnewswire.com/news-releases/resmed-inc-announces-results-for-the-second-quarter-of-fiscal-year-2018-300586074.html\nSOURCE ResMed Inc.", "external_links": ["http://investor.resmed.com/investor-relations/default.aspx", "http://www.prnewswire.com/news-releases/resmed-inc-announces-results-for-the-second-quarter-of-fiscal-year-2018-300586074.html"], "published": "2018-01-23T00:05:00.000+02:00", "crawled": "2018-01-23T02:15:35.013+02:00", "highlightTitle": ""}