{"organizations": [], "uuid": "42fcab3ac06cac8ead738fde619241d96461b346", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220831569&w=1200&r=LYNXMPEE090OT", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-newsnow-jan10/wednesday-morning-briefing-idUSKBN1EZ1CA", "country": "US", "domain_rank": 408, "title": "Wednesday Morning Briefing", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T20:20:00.000+02:00", "replies_count": 0, "uuid": "42fcab3ac06cac8ead738fde619241d96461b346"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-newsnow-jan10/wednesday-morning-briefing-idUSKBN1EZ1CA", "ord_in_thread": 0, "title": "Wednesday Morning Briefing", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "pruitt", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "daca", "sentiment": "negative"}, {"name": "kodak", "sentiment": "negative"}, {"name": "eastman kodak", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "epa", "sentiment": "none"}, {"name": "reuters tv", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Judge blocks Trump’s move to end DACA, Kodak goes for cryptocurrency and U.S. oil hits a high sparking worries of an overheated market.\nPolitics\nA judge in San Francisco temporarily barred President Donald Trump’s administration from ending a program shielding young people brought to the United States illegally by their parents from deportation.\nReuters TV: Trump demands border wall for deal on Dreamers\nExclusive: An official who has been a defender of refugees has been sidelined within the State Department in what some advocates and former officials fear is part of the Trump administration’s goal of limiting refugee resettlement in the United States.\nThe Supreme Court returns to the issue of voting rights as the justices hear arguments over whether Ohio’s policy of purging infrequent voters from its registration rolls disenfranchises thousands of people and violates federal law.\nReuters TV: EPA's Pruitt plans 2018 climate debate\nCryptocurrencies\nShares of Eastman Kodak more than doubled after the one-time leader in photography became the latest company to jump on the cryptocurrency bandwagon .\nThe going is getting tough for U.S. companies hoping to win the race to bring a bitcoin exchange-traded fund to market .\nFund managers say bitcoin ETF proposals withdrawn due to SEC concern\nBreakingviews: Bitcoin will never be real money\nFollow the latest updates on the Future of Money .\nMembers of the \"Edge of Ice\" team of Russia work on the ice sculpture called \"Key to all doors\" during the annual international festival of snow and ice sculptures \"The Magical Ice of Siberia\" in Krasnoyarsk, Russia January 9, 2018. Picture taken January 9, 2018. REUTERS/Ilya Naymushin World\nSouth Korean President Moon Jae-in credited Donald Trump for helping to spark the first inter-Korean talks in more than two years, and warned that Pyongyang would face stronger sanctions if provocations continued.\nMyanmar prosecutors sought charges against two Reuters reporters under the Official Secrets Act, which carries a maximum prison sentence of 14 years, the reporters’ lawyer said.\nTurkish Foreign Minister Mevlut Cavusoglu has said that relations with the United States were harmed by Washington’s refusal to extradite cleric Fetullah Gulen and its provision of arms to the Kurdish militant YPG.\nA stricken Iranian oil tanker in the East China Sea could burn for as long as one month , South Korea’s Ministry of Oceans and Fisheries told Reuters as the blaze raged for a fourth day following a collision with a freight ship.\nCommentary: Inside the growing backlash against China\nUnder President Xi Jinping, Beijing has been pushing an increasingly aggressive and high-profile foreign policy. Now a broader backlash is beginning, writes Peter Marino . Countries that only a few years ago welcomed Chinese investment and engagement are beginning to mobilize against Chinese influence - a development that \"does not bode well for a country that will have to start addressing legitimate diplomatic concerns around the world.\"\nBusiness\nExclusive: Saudi Aramco is working to secure billions of dollars in cheap loans from banks seeking to strengthen their ties with the oil giant before its stock listing, banking and export credit agency (ECA) sources said.\nU.S. oil prices hit their highest since 2014 as OPEC-led production cuts and healthy demand helped to balance the market, but analysts warned of possible overheating .\nFrench President Emmanuel Macron said a contract with China for 184 Airbus A320 narrow-body jets would be finalized soon and that his country also had ambitions to sell A350 and A380 planes to China in coming weeks or months.\nCES update\nFord has said it will partner with delivery service Postmates as the automaker starts later this year testing in a U.S. city how to transport people, food and packages using its self-driving cars.\nReuters TV: Google takes on Amazon in the fight for smart devices\nIn pictures: The best of CES\n ", "external_links": ["https://www.reuters.tv/v/5k6/2018/01/10/trump-demands-border-wall-for-deal-on-dreamers", "http://reut.rs/2EtCgNf", "http://reut.rs/2DfsTl8", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T20:20:00.000+02:00", "crawled": "2018-01-10T15:52:56.018+02:00", "highlightTitle": ""}