{"organizations": [], "uuid": "8811a645c69eea1ba2f28a5fc4fa0e8b124054b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-nors-lillehammer/lillehammer-legacy-looms-large-in-norwegian-winter-sports-idUSKBN1EV0E6", "country": "US", "domain_rank": 408, "title": "Lillehammer legacy looms large in Norwegian winter sports", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T15:38:00.000+02:00", "replies_count": 0, "uuid": "8811a645c69eea1ba2f28a5fc4fa0e8b124054b5"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-nors-lillehammer/lillehammer-legacy-looms-large-in-norwegian-winter-sports-idUSKBN1EV0E6", "ord_in_thread": 0, "title": "Lillehammer legacy looms large in Norwegian winter sports", "locations": [], "entities": {"persons": [{"name": "kjetil andre aamodt", "sentiment": "none"}, {"name": "philip o'connor", "sentiment": "none"}], "locations": [{"name": "lillehammer", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": [{"name": "min read  stockholm", "sentiment": "none"}, {"name": "international olympic committee", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 6, 2018 / 1:41 PM / Updated 5 minutes ago Lillehammer legacy looms large in Norwegian winter sports Philip O'Connor 5 Min Read \nSTOCKHOLM (Reuters) - A golden generation of Norwegian athletes born in the wake of the hugely successful Lillehammer Games in 1994 head to Pyeongchang hoping to maintain their position as the most successful nation in Winter Olympic history. \nDespite being the smallest country by population ever to host a Winter Games, the Norwegians have won 329 Olympic medals and 20 years after Lillehammer they topped the medals table in Sochi with 11 golds and 26 in total. \nSuch was the effect of those 1994 Games that in 2017 an Olympic Legacy Sports Centre was opened in Lillehammer with support from the International Olympic Committee. \nAn international center for winter sports, it will also welcome athletes from countries that lack the ‘conditions, resources and expertise’ Norway enjoys. \nFour-times Olympic champion skier Kjetil Andre Aamodt, who picked up two silver medals in the downhill and combined events at Lillehammer, is well aware of the effect the Games had on the nation’s youth. \n“On the first day of the downhill, Axel Lund Svindal was one of the 60,000 people who came to watch, and I believe that is what the Olympics is all about - inspiring kids, youth or even older people to follow their dream,” Aamodt told Reuters. \nNow 35, Svindal went on to win three medals, including gold in the Super G, in Vancouver in 2010 and heads to Pyeongchang as one of Norway’s hottest medal prospects. \nFor Espen Bredesen, who won one gold and one silver medal for ski jumping at Lillehammer, it is no surprise that the 1994 Games made winter sports more popular than ever in Norway. \n“We won a lot, we had heroes captured in fantastic TV pictures, skiing, cross-country, jumping - our heroes appeared in these wonderful pictures and young people copied them,” Bredesen told Reuters. \n“In that way, it was a tremendous advertisement for winter sports that has gone on for years and years.” \nNorway set a record in 1994 by winning 10 gold medals on home soil, and even if it was subsequently broken by Canada in Vancouver, Bredesen and the Norwegians remain proud of their dominant performances and the Games they hosted. \n“It was a wonderful Olympics in terms of the weather and the public. It was fantastic arena, the tracks were perfect, the winter was perfect, the weather was perfect,” Bredesen explained. \n“There was an enormous interest from the general public, from the media - everyone I knew was incredibly interested.” \nFor Bredesen, nothing could beat competing on home soil. \n“That was the time before mobile phones had arrived, and people took pictures with ordinary cameras, so everything you saw from Lillehammer, you were either there or you saw it on TV,” he recalled. \n“There wasn’t a hundred channels to choose from either, there wasn’t huge amount of sports to choose from - it was the Winter Olympics, and that was it. Everyone got to see it.” \nOne of those subsequently inspired by Espen Bredesen was ski jumper Daniel Andre Tande, who was born in Narvik in northern Norway just a couple of weeks before the Lillehammer games began. \n“Of course Lillehammer is something people still talk about. The Olympics is an extremely special competition, since it’s only every fourth year,” Tande told Reuters. \nThe 23-year-old said that he and his team mates are often stopped in the street in Norway during the season, and after a strong start to the season he is hoping to represent Norway in Pyeongchang. \n“We always have a goal for the team, for the entire country of Norway, to get as many medals as possible and to be on the top of the medal statistics,” Tande added. \nFor Bredesen, who works for a waste management company and was part of state broadcaster NRK’s team until 2014, ski jumping remains his first love, but the Norwegian population as a whole will be focusing on other events. \n“Cross-county is popular, and biathlon is something the Norwegian Olympic Committee is investing in, so it’s very popular,” he said, adding that the time difference to Pyeongchang is unlikely to reduce the nation’s feverish interest. \n“It’s great, because all you have to do is pick up your phone and you get the live broadcasts.” Reporting by Philip O'Connor; editing by Sudipto Ganguly", "external_links": [], "published": "2018-01-06T15:38:00.000+02:00", "crawled": "2018-01-06T15:57:27.016+02:00", "highlightTitle": ""}