{"organizations": [], "uuid": "884b5038138bb34c06493731180860bc90be2975", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-egypt-politics/egypt-court-postpones-verdict-against-presidential-hopeful-sources-idUSKBN1ES1JU", "country": "US", "domain_rank": 408, "title": "Egypt court postpones verdict against presidential hopeful: sources", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T01:17:00.000+02:00", "replies_count": 0, "uuid": "884b5038138bb34c06493731180860bc90be2975"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-egypt-politics/egypt-court-postpones-verdict-against-presidential-hopeful-sources-idUSKBN1ES1JU", "ord_in_thread": 0, "title": "Egypt court postpones verdict against presidential hopeful: sources", "locations": [], "entities": {"persons": [{"name": "abdel fattah al-sisi", "sentiment": "none"}, {"name": "mohamed mursi", "sentiment": "none"}, {"name": "khaled ali", "sentiment": "none"}, {"name": "sisi", "sentiment": "none"}, {"name": "ali", "sentiment": "none"}], "locations": [{"name": "cairo", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "muslim brotherhood", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAIRO (Reuters) - An Egyptian court on Wednesday postponed its verdict in a case against rights lawyer and presidential hopeful Khaled Ali, judicial sources said, leaving uncertainty over whether he will be allowed to run in a forthcoming election.\nPresident Abdel Fattah al-Sisi is widely expected to seek a second term in the presidential vote early this year, but has not yet announced his candidacy.\nAli said in November he intended to run against former military commander Sisi, who led the ousting of Muslim Brotherhood President Mohamed Mursi in 2013 before taking office a year later.\nBut a three month prison sentence passed in September for public indecency over an alleged rude hand gesture he made outside a courthouse last year might yet disqualify Ali.\nAli has appealed, denying the charges which he says are politically motivated. Wednesday’s hearing at an appeals court delayed the final decision until March 7.\nIf the guilty verdict is upheld he will not be allowed to run, even if he is not jailed.\nIf the election takes place before March 7, however, Ali will be allowed to run, he and another lawyer said.\nEgyptian security forces stand guard outside the court during the trial of human rights lawyer and ex-presidential candidate, Khaled Ali in Cairo, Egypt, January 3, 2018. REUTERS/Mohamed Abd El Ghany “Nothing stands in the way of my running,” Ali told Reuters by phone.\n“The (September) verdict ... has no value until it becomes final through an appeals court,” he said.\nEgypt will announce a date for the 2018 vote next week.\nEgyptian security forces stand guard outside the court during the trial of human rights lawyer and ex-presidential candidate, Khaled Ali in Cairo, Egypt, January 3, 2018. REUTERS/Mohamed Abd El Ghany Ali, a socialist, ran in the 2012 election coming seventh. Mursi won that vote as Egypt’s first freely elected president.\nA judicial source said the appeals court had postponed its verdict while footage was examined to determine whether Ali made the alleged rude sign.\nAli gained prominence in January last year when he won a case that nullified a government transfer of two Red Sea islands to Saudi Arabia, a deal that had prompted mass protests.\nSisi’s critics say his popularity has been dimmed by austerity reforms, security problems and a crackdown on dissidents.\nHis allies dismiss accusations of rights abuses, saying his measures are needed for security in the face of an Islamist insurgency in the North Sinai region that has expanded to include civilian targets.\nReporting by Haitham Ahmed and Arwa Gaballa, writing by John Davison; Editing by Richard Balmforth\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-04T01:17:00.000+02:00", "crawled": "2018-01-03T19:23:59.038+02:00", "highlightTitle": ""}