{"organizations": [], "uuid": "8524c5f798fe4d97297bfb91285ade759264bf7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/02/104924335-RTX42TPU-kim-jong-un.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/north-korea-scoffs-at-trump-nuclear-button-tweet-says-it-was-the-spasm-of-a-lunatic.html", "country": "US", "domain_rank": 767, "title": "North Korea scoffs at Trump 'nuclear button' tweet, says it was the 'spasm of a lunatic'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.929, "site_type": "news", "published": "2018-01-16T13:04:00.000+02:00", "replies_count": 0, "uuid": "8524c5f798fe4d97297bfb91285ade759264bf7a"}, "author": "Kcna", "url": "https://www.cnbc.com/2018/01/16/north-korea-scoffs-at-trump-nuclear-button-tweet-says-it-was-the-spasm-of-a-lunatic.html", "ord_in_thread": 0, "title": "North Korea scoffs at Trump 'nuclear button' tweet, says it was the 'spasm of a lunatic'", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "rodong sinmun", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "trump white house", "sentiment": "none"}, {"name": "mins ago shares kcna", "sentiment": "none"}, {"name": "kcna", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "korean central news agency", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North Korea's state-run media say U.S. President Donald Trump 's tweet about having a bigger nuclear button than leader Kim Jong Un's is the \"spasm of a lunatic.\"\nRodong Sinmun, the ruling party newspaper, lashed out at Trump in a commentary on Tuesday that took issue with the U.S. commander in chief's Jan. 3 tweet that \"I too have a Nuclear Button, but it is a much bigger & more powerful one than his, and my Button works!\"\nA summary of the commentary by North Korea's official news agency described the tweet as \"the spasm of a lunatic.\"\n\"The spasm of Trump in the new year reflects the desperate mental state of a loser who failed to check the vigorous advance of the army and people of the DPRK,\" the Rodong Sinmun commentary said, using the acronym for North Korea's formal name, the Democratic People's Republic of Korea. \"He is making (a) bluff only to be diagnosed as a psychopath.\"\nshow chapters South Koreans 'more afraid' of Donald Trump than Kim Jong Un: NYT's Tom Friedman 8:14 AM ET Tue, 9 Jan 2018 | 03:12 That tone is not uncommon for the North Korean media.\nBut Trump's willingness to respond in kind — he has repeatedly called Kim \"little rocket man\" — is rare for an American leader and has led to several fiery verbal barrages since he took office nearly a year ago.\nTrump has more recently suggested he might be willing to meet with Kim, and reportedly told the Wall Street Journal the two \"probably have a very good relationship.\"\nIf so, however, the North's propaganda machine doesn't seem to have gotten the memo.\nTrump's controversial \"nuclear button\" tweet was in response to Kim's New Year's Day warning that North Korea's nuclear arsenal is a real threat and that he has a nuclear launch button on his desk at all times.\nshow chapters Trump taunts Kim Jong Un's 'nuclear button' 7:19 AM ET Wed, 3 Jan 2018 | 02:06 Rodong Sinmun also recently ran a story about the book \"Fire and Fury: Inside the Trump White House,\" which casts the president as a leader who doesn't understand the weight of his office and whose competence is questioned by aides. Trump and other White House officials have blasted it as inaccurate.\nThe title of the book comes from a Trump Quote: about North Korea.\nLast summer, Trump threatened North Korea with \"fire and fury like the world has never seen\" in an exchange of taunts with the North, which claimed it was examining plans to launch missiles toward the American territory of Guam.\nThe book's sales reflect \"rapidly surging anti-Trump sentiments in the international community,\" the article said. \"The anti-Trump book is sweeping all over the world so Trump is being massively humiliated worldwide.\"\nThe book's popularity \"foretells Trump's political demise,\" it concluded.", "external_links": [], "published": "2018-01-16T13:04:00.000+02:00", "crawled": "2018-01-16T13:08:57.026+02:00", "highlightTitle": ""}