{"organizations": [], "uuid": "68a0cf7222dc761da91b78917e5ea051465d120d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220136804&w=1200&r=LYNXMPEE07021", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-spain-mad-marcelo/we-feel-like-we-are-sinking-says-reals-marcelo-idUKKBN1EX02A", "country": "US", "domain_rank": 408, "title": "We feel like we are sinking, says Real's Marcelo", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T03:42:00.000+02:00", "replies_count": 0, "uuid": "68a0cf7222dc761da91b78917e5ea051465d120d"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-spain-mad-marcelo/we-feel-like-we-are-sinking-says-reals-marcelo-idUKKBN1EX02A", "ord_in_thread": 0, "title": "We feel like we are sinking, says Real's Marcelo", "locations": [], "entities": {"persons": [{"name": "marcelo", "sentiment": "negative"}, {"name": "zinedine zidane", "sentiment": "none"}, {"name": "maxi gomez", "sentiment": "none"}, {"name": "daniel wass", "sentiment": "none"}, {"name": "gareth bale", "sentiment": "none"}, {"name": "celta vigo", "sentiment": "none"}], "locations": [{"name": "santiago bernabeu", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "fc barcelona", "sentiment": "none"}, {"name": "vigo", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "la liga", "sentiment": "none"}, {"name": "soccer football - la liga santander - real madrid", "sentiment": "none"}, {"name": "real madrid", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "celta", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "barca", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 1:39 AM / Updated 2 hours ago We feel like we are sinking, says Real's Marcelo Reuters Staff 3 Min Read \nVIGO (Reuters) - Real Madrid players feel like their La Liga title hopes are “sinking” into a black hole after they let a 2-1 lead against Celta Vigo slip through their fingers in the final eight minutes, leaving them 16 points adrift of leaders Barcelona. Soccer Football - La Liga Santander - Real Madrid vs FC Barcelona - Santiago Bernabeu, Madrid, Spain - December 23, 2017 Real Madrid’s Marcelo warms up before the match REUTERS/Stringer \nReal were leading with eight minutes to go against Celta after Gareth Bale’s quick-fire double had overturned Daniel Wass’s opening strike. \nBut Maxi Gomez’s headed goal in the 82nd minute ensured the match finished in a 2-2 draw and piled more pain on Zinedine Zidane’s side, who had lost 3-0 to arch rivals and runaway leaders Barca in their last Liga outing. \n“It is how it looks from the outside - we are sad, angry and we feel like we are sinking,” Brazilian defender Marcelo told reporters. \n“It is one of the worst situations I’ve experienced here,” added the 29-year-old who has been with the club for over a decade. \n“We’ll try to work hard and fight so we can win our next game but we don’t like this situation at all, it’s difficult because the more games you draw or lose the more pressure you are under.” \nThe last time Real were 16 points behind the Liga leaders was during Jose Mourinho’s tension-filled final campaign in 2012-13, when they finished 15 points adrift of Barca. \n“There’s nothing else we can do other than keep our heads up and fight and do our best to start winning again,” added Marcelo, who has won four La Liga and three Champions League titles since joining Real in 2007. \n“We can’t do anything more, we’re trying to play good football, to move the ball around and score goals but it’s not coming off.” \nReal coach Zidane usually leaps to the defence of his players after negative results but he was not in a forgiving mood on Sunday. \n“The main thing we lacked today was we didn’t play the second half,” said the Frenchman, who last season guided Real to their first Liga and European Cup double since 1958. \n“We played very well in the first 45 minutes but not in the second half and a game lasts 90 minutes.” \nZidane also refused to comment on whether or not his side were out of the title race. \n“We’re not going to talk about the league every weekend. If we keep losing points we’re not going to get there. We have to focus on each game now and try to win them,” he said. Reporting by Richard Martin, editing by Pritha Sarkar", "external_links": [], "published": "2018-01-08T03:42:00.000+02:00", "crawled": "2018-01-08T04:33:31.006+02:00", "highlightTitle": ""}