{"organizations": [], "uuid": "54eea5783700fb0e33d83aa93823b49bb03d0b4c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-wynnchurch-capital-announces-promotions-and-new-hires.html", "country": "US", "domain_rank": 767, "title": "Wynnchurch Capital Announces Promotions and New Hires", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.027, "site_type": "news", "published": "2018-01-11T21:20:00.000+02:00", "replies_count": 0, "uuid": "54eea5783700fb0e33d83aa93823b49bb03d0b4c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-wynnchurch-capital-announces-promotions-and-new-hires.html", "ord_in_thread": 0, "title": "Wynnchurch Capital Announces Promotions and New Hires", "locations": [], "entities": {"persons": [{"name": "houlihan lokey", "sentiment": "none"}, {"name": "john hatherly", "sentiment": "none"}, {"name": "carl", "sentiment": "none"}, {"name": "ben", "sentiment": "none"}, {"name": "kevin hanley", "sentiment": "none"}, {"name": "wynn", "sentiment": "none"}, {"name": "carl howe", "sentiment": "none"}, {"name": "brian", "sentiment": "none"}, {"name": "kevin", "sentiment": "none"}, {"name": "brian riordan", "sentiment": "none"}, {"name": "wynnchurch", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}, {"name": "chris waldock", "sentiment": "none"}, {"name": "ben cherry", "sentiment": "none"}, {"name": "frank", "sentiment": "none"}], "locations": [{"name": "ill.", "sentiment": "none"}, {"name": "rosemont", "sentiment": "none"}, {"name": "wynnchurch", "sentiment": "none"}], "organizations": [{"name": "wynnchurch capital announces promotions", "sentiment": "negative"}, {"name": "wynnchurch capital", "sentiment": "negative"}, {"name": "northwestern university", "sentiment": "none"}, {"name": "healthcare m&a", "sentiment": "none"}, {"name": "alvarez & marsal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROSEMONT, Ill.--(BUSINESS WIRE)-- Wynnchurch Capital, LLC (“Wynnchurch”), a leading middle-market private equity firm, announced today the promotions of Carl Howe and Brian Riordan to Vice President and JD Frank and Kevin Hanley to Senior Associate. In addition, Wynnchurch recently hired two new associates, Chris Waldock and Ben Cherry.\nJohn Hatherly, Managing Partner at Wynnchurch, said, “We are excited to announce the well-earned promotions of Carl, Brian, Kevin and JD. They have been important contributors to the growth and success of the firm. We are very appreciative of their efforts and know they represent a bright future ahead for Wynnchurch. In addition, we are also pleased to welcome Ben and Chris to the firm. They help deepen and strengthen our team and we look forward to working with them.”\nCarl Howe joined Wynnchurch in 2012. Prior to joining Wynnchurch, Carl worked at Houlihan Lokey in the Healthcare M&A division and Alvarez & Marsal. Carl earned his B.S. in Economics and Political Science from Northwestern University and is a CFA charterholder.\nBrian Riordan joined Wynnchurch in 2012. Prior to joining Wynnchurch, Brian worked at BMO Capital Markets as an Investment Banking Analyst. Brian earned his B.B.A. in Finance from the University of Wisconsin and M.B.A. from the Kellogg School of Management at Northwestern University and is a CFA charterholder.\nJD Frank joined Wynnchurch in 2014. Prior to joining Wynnchurch, JD worked as an Analyst at BMO Capital Markets in the Industrials Investment Banking Group. JD earned his B.B.A. in Finance and International Business at the University of Wisconsin, with honors.\nKevin Hanley joined Wynnchurch in 2014. Prior to joining Wynnchurch, Kevin worked in the Industrials M&A division at Houlihan Lokey and KeyBanc Capital Markets. Kevin earned his B.S. in Finance from Indiana University’s Kelley School of Business, with distinction.\nChris Waldock worked in the M&A group at KeyBanc Capital Markets and received his B.S.B.A. in Finance and Economics from the University of Dayton, with distinction. Ben Cherry worked as an Investment Banking Analyst at BMO Capital Markets and received his B.B.A. from the University of Michigan, with distinction.\nWynnchurch Capital is actively investing from its $1.3 billion Fund IV. In November 2017, Wynnchurch acquired America II, a global leader in electronic component distribution and supply chain services serving a broad array of products for use in higher value-add applications across diversified end-markets. Other recent Wynnchurch investments include Stampede Meat, a processor and distributor of portioned, marinated and cooked beef, chicken, and other protein products for restaurants, retail, home delivery and other channels; and Rosboro Company, LLC, a leading integrated forest products operation producing a wide variety of products including laminated beams, studs, and veneer.\nAbout Wynnchurch Capital:\nWynnchurch Capital, LLC, headquartered in the Chicago suburb of Rosemont, Illinois, with offices in California and Canada, was founded in 1999, and is a leading middle-market private equity investment firm. Wynnchurch's strategy is to partner with middle market companies in the United States and Canada that possess the potential for substantial growth and profit improvement. Wynnchurch Capital manages a number of private equity funds with $2.2 billion of committed capital under management and specializes in recapitalizations, growth capital, management buyouts, corporate carve-outs and restructurings. For more information, please visit: www.wynnchurch.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180111005887/en/\nWynnchurch Capital, LLC\nJohn Hatherly\nManaging Partner\njhatherly@wynnchurch.com\n847.604.6100\nor\nFrank Hayes\nManaging Partner\nfhayes@wynnchurch.com\n847.604.6100\nor\nChris O’Brien\nManaging Partner\ncobrien@wynnchurch.com\n847.604.6100\nSource: Wynnchurch Capital, LLC", "external_links": ["http://www.businesswire.com/news/home/20180111005887/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fr20.rs6.net%2Ftn.jsp%3Ft%3Dssohcryab.0.0.oo7ok8bab.0%26id%3Dpreview%26r%3D3%26p%3Dhttp%253A%252F%252Fwww.wynnchurch.com&esheet=51742057&newsitemid=20180111005887&lan=en-US&anchor=www.wynnchurch.com&index=1&md5=f4388e26cc507266cab65a2767c2d4a5"], "published": "2018-01-11T21:20:00.000+02:00", "crawled": "2018-01-11T23:45:13.022+02:00", "highlightTitle": ""}