{"organizations": [], "uuid": "172845c28ce37dff5ba0640411f6e5eca470c462", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/business-wire-mediawan-announces-3-acquisition-projects-to-become-the-leading-group-of-fiction-producers-in-france.html", "country": "US", "domain_rank": 767, "title": "Mediawan Announces 3 Acquisition Projects, to Become the Leading Group of Fiction Producers in France", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-15T20:12:00.000+02:00", "replies_count": 0, "uuid": "172845c28ce37dff5ba0640411f6e5eca470c462"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/business-wire-mediawan-announces-3-acquisition-projects-to-become-the-leading-group-of-fiction-producers-in-france.html", "ord_in_thread": 0, "title": "Mediawan Announces 3 Acquisition Projects, to Become the Leading Group of Fiction Producers in France", "locations": [], "entities": {"persons": [{"name": "dominique besnehard", "sentiment": "none"}, {"name": "sharif", "sentiment": "none"}, {"name": "mediawan", "sentiment": "none"}, {"name": "michel feller", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "acquisition of europacorp", "sentiment": "negative"}, {"name": "leading group of fiction producers in france planned", "sentiment": "negative"}, {"name": "acquisition projects", "sentiment": "negative"}, {"name": "mon voisin productions", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Planned acquisition of 3 major production companies: Acquisition of EuropaCorp’s TV business (excluding US series), which has a track record of successes in France and internationally including among others “XIII”, “No Limit”, “Les Bleus” and “Taxi Brooklyn” Exclusive negotiations in connection with the acquisition of a majority stake in the Makever group, one of France’s leading producers with strong franchises such as “Captain Sharif”, “Kaboul Kitchen” and “The Red Band Society” Exclusive negotiations regarding the acquisition of 60% of Mon Voisin Productions, created by Dominique Besnehard and Michel Feller, this company being the root of the TV series “Call My Agent” In each case, Mediawan would be associated with the founders and longstanding managers to further pursue these companies’ development while strengthening their distribution capabilities and accelerating their international growth These transactions will enable Mediawan to become France’s leading producer of fiction 1 with a portfolio of high-visibility series and an unparalleled projects line-up Following its recent breakthrough in the animated content sector (with ON Kids & family), these transactions further strengthen Mediawan’s ambition of being the independent leader in audiovisual content in Europe\nPARIS--(BUSINESS WIRE)-- Regulatory News:\nMediawan (Paris:MWD) (Ticker: MWD – ISIN: FR0013247137), an independent European audiovisual content platform, announces the project of acquiring majority stakes in three production companies: Makever, Mon Voisin Productions and Storia Television (the company created to take over EuropaCorp’s TV business, excluding US series).\nThese companies gather together strong programs, acknowledged talents and numerous major projects in France and internationally. They would allow Mediawan to continue supplement its premium content offering and expand its production volumes, as they represented revenues of over €50 million in 2017. Mediawan is thus strengthening its position in European independent production, notably by becoming the leading French producer of TV fiction 1 . The new Group will have an out-and-out catalogue, with strong brands enabling it to be - by far - the most represented fiction producer in the 100 top French audiences in 2017.\nPierre-Antoine Capton, Mediawan’s Chairman of the Board, says : “These strategic investments in EuropaCorp TV, Makever and Mon Voisin Productions would be another milestone in the implementation of Mediawan’s strategy. With an extensive offering of premium content combining fiction, animated content and documentaries, Mediawan is in the best position possible to meet the substantial market demand. We have, in France and across Europe, a unique expertise in terms of audiovisual content creation, and are very proud to support these teams with their international development and to be partner with the best creative talents of the market: producers, directors, authors and actors.”\nThe companies perfectly meet Mediawan’s strategic objectives: premium content with recognized and strong identifiable brands, high catalogue value backed by the Group’s international network, substantial growth prospects and, most importantly, a pool of exceptionally talented people.\nThrough these projects of acquisition, Mediawan is pursuing its strategy of bringing together major players in their field in order to gradually establish its position as the European independent leader in premium audiovisual content in fiction, animated content (stake in ON kids & family announced in December 2017) and documentaries (acquisition of CC&C in July 2017).\nEuropaCorp Television\nResulting from the purchase of Cipango by EuropaCorp in 2010, EuropaCorp Television incorporates the EuropaCorp group’s television production activities. Mediawan has today carried out the acquisition of part of EuropaCorp Television’s activities, including the teams, the current catalogue and all ongoing projects (except the US activities such as the “Taken” TV series).\nThe acquired catalogue has over 250 hours of series and TV movies in French (including notably “Les Bleus”, “No Limit” and the “Mary Higgins Clark” TV movies’ collection) and in English (such as “XIII”, “Flight of The Storks” and “Taxi Brooklyn”).\nFurthermore, the group has a considerable number of projects under production and development, with a dozen programs due to be delivered in 2018 and 2019. This line-up includes for instance the following:\nFrench spoken series under production, such as “Les Rivières Pourpres”, “Aux animaux la guerre”, “Docteur Alix Rocca” as well as the animated series “Arthur et les Minimoys”; English spoken projects under development, such as “Life after Life” and “The Art of War”.\nThis acquisition was carried out via Storia Television, a company created for this purpose, which is held at 80% by Mediawan and 20% by Thomas Anargyros, Cipango’s and EuropaCorp Television’s longstanding CEO who will chair this activity.\nMakever\nCreated in 2002 by Stéphane Drouet and Matthieu Viala, Makever is a major player in television production and specializes in fiction with a diversified offer in series and TV movies.\nThe Makever group is organized around 6 complementary and independent production studios with between 20 and 35 hours of programs produced each year, including both original contents and new seasons of established series.\nThese production companies (Makingprod, Scarlett, Vema Production, Mademoiselle Films, Love My TV and Alauda Films) have talented teams enabling Makever to produce highly-successful programs such as:\n“Captain Sharif”, whose 5 th season is currently released on France 2 (the previous season had an average of 5 million viewers, or an audience share of over 21%) and is distributed in more than 10 countries; “Kaboul Kitchen”, a strong brand with three seasons broadcasted on Canal+ and a feature film under development; “The Red Band Society”, a series acclaimed at the La Rochelle festival and whose first season will shortly be released on TF1; numerous successful one-off programs or mini-series, such as “Entre 2 mères”, which gathered more than 7 million viewers, or “Don’t Leave Me” which received the International Emmy Awards for best television film in New-York last November.\nMediawan enters into exclusive negotiations in order to acquire a majority stake in Makever’s share capital, through the purchase of shares owned by investors while the founders and management keep the remaining stake. The current team, headed by Matthieu Viala and Dominik Schmelck will work alongside Mediawan to continue driving Makever’s development.\nThis partnership will allow Makever to accelerate its international development, either through to international sales or international coproductions currently under development.\nMon Voisin Productions\nMon Voisin Productions (MVP) was created in 2006 by Dominique Besnehard and Michel Feller. The company has a decade of experience in the production of fiction. Initially specializing in the production of one-off programs and full-length feature films for the cinema, MVP recently expanded its activity into the production of TV series.\nThe company notably produces the “Call My Agent” series, which two seasons broadcasted on France 2 have been a major critical and popular success (the 3 rd season being currently in production). This series also has substantial international potential: the first two seasons are already available on Netflix,", "external_links": ["http://www.businesswire.com/news/home/20180115005515/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.mediawan.fr&esheet=51743259&newsitemid=20180115005515&lan=en-US&anchor=www.mediawan.fr&index=1&md5=edf0e1dded2107bf829fc9db3687133f"], "published": "2018-01-15T20:12:00.000+02:00", "crawled": "2018-01-15T23:00:04.000+02:00", "highlightTitle": ""}