{"organizations": [], "uuid": "125627e7cc3643684bb4cc824493f0eae83574be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1227028328&w=1200&r=LYNXMPEE0U1FE", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-usa-africanunion-trump/letter-from-trump-prompts-african-leaders-to-refrain-from-criticizing-him-idUSKBN1FK2QM", "country": "US", "domain_rank": 408, "title": "Letter from Trump prompts African leaders to refrain from criticizing him", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T20:23:00.000+02:00", "replies_count": 0, "uuid": "125627e7cc3643684bb4cc824493f0eae83574be"}, "author": "", "url": "https://www.reuters.com/article/us-usa-africanunion-trump/letter-from-trump-prompts-african-leaders-to-refrain-from-criticizing-him-idUSKBN1FK2QM", "ord_in_thread": 0, "title": "Letter from Trump prompts African leaders to refrain from criticizing him", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ADDIS ABABA (Reuters) - African leaders say they have decided to refrain from issuing a resolution to criticize Donald Trump’s alleged reference to their nations as “shithole countries” because the U.S. president sent them a letter expressing respect for the continent.\nThe leaders who met at an African Union summit in the Ethiopian capital were initially set to demand an apology from Trump over the remark reported by sources at a meeting on immigration with him this month. Trump denies making the comment.\nReports of the comment touched a nerve because they come on top of decisions by the Trump administration, particularly on visa restrictions, that many Africans say unfairly penalize the continent.\nAs the summit was being held at ministerial level, the gathering drafted a resolution calling on Trump to “publicly apologize to all Africans”.\nAnything short of that would force them to suspend a cooperation deal signed between Washington and the bloc, said the draft seen by Reuters.\nAfrican leaders are “dismayed and shocked by the increasingly consistent trend by the Trump Administration to denigrate of African descent ... thereby promoting racism, xenophobia and bigotry,” it said.\nBut a Jan. 25 letter sent by Trump prompted a change of tack at presidential level.\nOne summit official said the final resolution that is yet to be released contains no reference to the issue after the leaders concluded the meeting late on Monday.\n“I want to underscore that the United States deeply respects the people of Africa and my commitment to strong and respectful relationships with African states as sovereign states is firm,” Trump said.\nSecretary of State Rex Tillerson would “travel to Africa for an extended visit,” he said.\nThe AU Commission had “taken due note” of the letter, which wished the summit success, Chairperson Moussa Faki Mahamat said during the closing press conference.\nRwanda’s President Paul Kagame, who met Trump last week on the sidelines of the annual World Economic Forum in Davos, Switzerland, said Trump’s reported comment had no impact on the AU summit.\n“When the United States decided to give us Trump as their president we deal with that president of the United States. It is not an issue of whether you appreciate him for this or for that, it is a job that he is doing for his country,” added Kagame, who assumed the African Union’s chairmanship this year.\nHe said both he and Trump had stressed the need for more cooperation.\nAdditional reporting by Yeganeh Torbati in Washington; Editing by Matthew Mpoke Bigg\n ", "external_links": [], "published": "2018-01-31T20:23:00.000+02:00", "crawled": "2018-01-31T20:33:42.025+02:00", "highlightTitle": ""}