{"organizations": [], "uuid": "cb44836f0e9c442bd762a109947048e6e6302b62", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180116.html", "section_title": "Archive News &amp; Video for Tuesday, 16 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-stocks-retreat-from-early-gains-as-oil-copper-fall-idUSL1N1PB1I0", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Stocks retreat from early gains as oil, copper fall", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-17T03:52:00.000+02:00", "replies_count": 0, "uuid": "cb44836f0e9c442bd762a109947048e6e6302b62"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-stocks-retreat-from-early-gains-as-oil-copper-fall-idUSL1N1PB1I0", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Stocks retreat from early gains as oil, copper fall", "locations": [], "entities": {"persons": [{"name": "chuck mikolajczak", "sentiment": "none"}, {"name": "merck", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "thomson reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "unitedhealth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dow tops 26,000 but Wall Street gives up gains\n* Dollar holds near three-year lows\n* Oil, copper drop after rally (Updates with European market close)\nBy Chuck Mikolajczak\nNEW YORK, Jan 16 (Reuters) - World stock markets edged lower on Tuesday, giving back earlier gains as Wall Street retreated from initial highs as a decline in oil and metals weighed on the energy and materials sectors.\nWall Street initially moved higher, as the Dow breached the 26,000 mark for the first time. The healthcare sector, up 0.52 percent, provided support to the upside, with Merck up 6.9 percent and UnitedHealth up 2.3 percent.\nUnitedHealth posted quarterly results that topped analyst estimates and raised its 2018 outlook, bolstering optimism for another solid quarter for corporate earnings.\nEarnings growth for the quarter is forecast at 11.9 percent, according to Thomson Reuters data through Tuesday morning.\nBut each of the major Wall Street indexes fell into negative territory as materials, down 1.3 percent and energy , off 1.2 percent, slumped.\nOil prices eased from three-year highs as traders booked profits from the rally but healthy demand underpinned prices near $70, a level not seen since 2014’s market slump.\nU.S. crude fell 0.68 percent to $63.86 per barrel and Brent was last at $69.28, down 1.39 percent on the day.\nCopper lost 1.37 percent to $7,111.50 a tonne, touching a 3-1/2 week low following strong gains late last year and as worries lingered over fading demand in China.\n“Copper has had a huge run and so has oil, frankly,” said Randy Frederick, vice president of trading and derivatives for Charles Schwab in Austin, Texas.\n“When you have big gains in anything and you have a lot of unrealized profits out there, whether it is equities or commodities that have gone straight up, there is reason to take some profits off the table, put on some hedges.”\nThe Dow Jones Industrial Average fell 8.82 points, or 0.03 percent, to 25,794.37, the S&P 500 lost 8.74 points, or 0.31 percent, to 2,777.5 and the Nasdaq Composite dropped 33.00 points, or 0.45 percent, to 7,228.07.\nCitigroup shares rose 0.4 percent to $77.15 after earnings topped expectations, the latest major U.S. bank to post results for the fourth quarter. The S&P financial index is up nearly 5 percent to start the year.\nShares in Europe closed little changed as commodity stocks also weighed.\nThe pan-European FTSEurofirst 300 index percent and MSCI’s gauge of stocks across the globe shed 0.04 percent after hitting a record for a third straight session.\nThe euro turned higher after briefly pulling back from a three-year high, up 0.11 percent to $1.2274 while the dollar gave up its earlier gains and remained near three-year lows.\nU.S. long-dated Treasury yields rose as equities retreated. Benchmark 10-year notes last rose 3/32 in price to yield 2.5426 percent, from 2.552 percent late on Friday.\nEditing by Bernadette Baum and Chizu Nomiyama\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T03:52:00.000+02:00", "crawled": "2018-01-17T19:56:40.014+02:00", "highlightTitle": ""}