{"organizations": [], "uuid": "a7ed75f47975478585f6e1b59af36c822f9fa5fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/malaysia-palmoil-eu/update-1-indonesia-malaysia-condemn-european-move-to-limit-palm-oil-use-idUSL3N1PD2YR", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Indonesia, Malaysia condemn European move to limit palm oil use", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T18:29:00.000+02:00", "replies_count": 0, "uuid": "a7ed75f47975478585f6e1b59af36c822f9fa5fd"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/malaysia-palmoil-eu/update-1-indonesia-malaysia-condemn-european-move-to-limit-palm-oil-use-idUSL3N1PD2YR", "ord_in_thread": 0, "title": "UPDATE 1-Indonesia, Malaysia condemn European move to limit palm oil use", "locations": [], "entities": {"persons": [{"name": "emily chow kuala lumpur", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* EU proposal a “black day for free trade” -Malaysia minister\n* Malaysian ambassadors in EU to raise objections -minister\n* Indonesia to lobby against “discriminatory” move -palm official (Adds comments from Indonesian officials)\nBy Emily Chow\nKUALA LUMPUR, Jan 18 (Reuters) - Top palm oil producers Indonesia and Malaysia on Thursday criticised the European Union for backing a ban on the use of palm oil in biofuels, with a Malaysian minister calling the move a protectionist trade barrier and a form of “crop apartheid”.\nEuropean lawmakers approved draft measures on Wednesday to reform the power market there and reduce energy consumption to meet more ambitious climate goals. The plan includes a ban on the use of palm oil in motor fuels from 2021.\nIndonesia and Malaysia are the world’s top two palm oil producing countries, accounting for nearly 90 percent of global supply. A large portion of European palm oil imports are used to make biofuels, giving the industry’s top two producers cause for concern as they fear overall demand will fall.\n“This vote is very disappointing. It’s a black day for free trade. You are discriminating against palm oil,” Malaysia’s Minister of Plantation Industries and Commodities Mah Siew Keong told reporters at an industry conference.\nBy allowing other vegetable oils to be used in biofuels, the EU was discriminating against palm oil, he said.\n“The EU is practising a form of crop apartheid,” Mah said separately in a statement.\nPalm oil exports are a key source of revenue for Malaysia. The European Union is its second-biggest market after India.\nIndonesian Trade Minister Enggartiasto Lukita told reporters in Jakarta there should be fair treatment for all vegetable oils, and that Indonesia had protested the EU’s “negative campaign” on palm oil on several occasions.\nThe palm oil industry has come under fire in Europe over its impact on forest destruction and Southeast Asian producers have faced calls to meet higher sustainability standards.\nMah said Malaysia’s ambassadors in the 28 EU member countries will raise objections and that he will work closely with Indonesia to protect the interests of smallholders.\n“The government will not tolerate the denigration of the palm oil industry and will ensure Malaysia gives a fitting response to those who harm the palm oil industry,” Mah said.\nEarlier this week, hundreds of Malaysian palm oil farmers gathered in the capital city of Kuala Lumpur to protest ahead of the EU decision.\nThe Indonesian Palm Oil Association, or GAPKI, will work with the government to lobby against the “discriminatory” EU proposal, said Fadhil Hasan, a board member.\n“We have to react firmly and clearly say that this is not a good policy. It doesn’t help strengthen trade and economic relations among (palm oil) producing countries and Europe,” Hasan said on the sidelines of the Kuala Lumpur conference.\nThe rules endorsed by the EU on Wednesday are not final. The European Parliament, the executive European Commission and EU national governments must now negotiate a final draft of the legislation and vote to approve it.\nIndustry analyst James Fry said the EU move, if finalised, would cause “turmoil” in the vegetable oil market in Europe.\n“The practicalities are likely to be unpleasant for the EU. For palm oil, I won’t be surprised if the end result is very little change in the price, because the market will balance itself,” he said.\nThe benchmark palm oil prices on the Bursa Malaysia Derivatives Exchange were down about 0.5 percent on Thursday. (Reporting by Emily Chow; Additional reporting by Bernadette Christina Munthe in JAKARTA; Writing by A. Ananthalakshmi; Editing by Tom Hogue)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T18:29:00.000+02:00", "crawled": "2018-01-19T12:14:31.002+02:00", "highlightTitle": ""}