{"organizations": [], "uuid": "7dc0a4a15a86d2ddec677713c0bbec833df5c2f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/05/the-associated-press-new-us-pot-rule-sparks-latest-clash-over-states-rights.html", "country": "US", "domain_rank": 767, "title": "New US pot rule sparks latest clash over states' rights", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T10:25:00.000+02:00", "replies_count": 0, "uuid": "7dc0a4a15a86d2ddec677713c0bbec833df5c2f5"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/05/the-associated-press-new-us-pot-rule-sparks-latest-clash-over-states-rights.html", "ord_in_thread": 0, "title": "New US pot rule sparks latest clash over states' rights", "locations": [], "entities": {"persons": [{"name": "jeff sessions", "sentiment": "negative"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO (AP) — The decision by Attorney General Jeff Sessions to rescind an Obama-era policy on federal marijuana enforcement sparked an outcry from Republicans and Democrats.\nThey argue that Sessions is trampling on the rights of states that have decided to legalize pot for medical or recreational use, or both.\nPot remains illegal under federal law, and Sessions' new direction lets federal prosecutors in states where marijuana is legal decide how aggressively to enforce that law.\nHere's a look at how states have broken with the federal government on pot and the tension that has generated:\nTHE LEGALIZATION PUSH:\nFederal law classifies marijuana, heroin and LSD among the most dangerous drugs, with no currently accepted medical use and a high potential for abuse. Efforts to change that classification have failed. A federal judge in California in 2015 considered the issue, but then decided it was up to Congress to change the law if it wishes.\nAn increasing number of states, meanwhile, have legalized marijuana. California led the way in 1996, when voters approved marijuana for medical use. Colorado and Washington became the first two states to legalize recreational marijuana with voter-approved measures in 2012. Eight states, including California, have now legalized marijuana for recreational use and more than 30 have medical marijuana programs.\nCritics of Sessions' decision, including members of the Republican Party, say the federal government should respect the wishes of local voters and stay out of states' marijuana choices. They cite the 10th amendment to the U.S. Constitution, which says states have all powers that the constitution does not delegate to the U.S. government or deny them.\n\"Today's decision announced by the Department of Justice is a direct violation of states' rights,\" said U.S. Rep. Don Young, R-Alaska. Alaska allows recreational marijuana use. Republican U.S. Sen. Cory Gardner from Colorado said he's placing a hold on Justice Department nominees in response to Sessions' decision and will try to push legislation to protect marijuana sales in states where they are legal.\n\"With no prior notice to Congress, the Justice Department has trampled on the will of the voters in CO and other states,\" he said in a Tweet.\nSTATE AND FEDERAL LAW CLASH:\nMarijuana's status as an illegal drug under federal law has led to the prosecution of growers and dispensaries that appear to be operating legally under state law, and Sessions' announcement is raising fears of a possible renewed crackdown. \"The states can enact their own laws, but the federal government can say, 'We're going to prosecute people and businesses,'\" said Alex Kreit, a marijuana law expert at the Thomas Jefferson School of Law in San Diego. The U.S. Supreme Court in a 2005 ruling said the federal government could prosecute medical marijuana possession in states that had legalized the drug for medical use.\nIn 2011, California's four U.S. attorneys announced that they were going after the state's \"widespread and illegal marijuana industry.\" Prosecutors threatened landlords with prosecution unless they evicted tenants who were supplying marijuana and moved to seize properties where the drug was sold.\nThe DOJ under former President Barack Obama said in 2013 it wouldn't interfere with state marijuana laws as long as the states tightly regulated the drug and made efforts to keep it from children, criminal drug cartels and other states.\nStill, pot prosecutions continued.\nCONGRESS STEPS IN:\nIn 2014, Obama signed into law a congressional amendment that said the DOJ could not use money allocated by Congress to prevent states that have legalized medical marijuana from implementing laws that permit its use, distribution and possession. A federal appeals court that covers much of the Western U.S. ruled two years ago that the law banned the DOJ from going after medical marijuana users and dispensaries in cases where no state laws were broken. The decision by the 9th U.S. Circuit Court of Appeals covered California, Washington and seven other states.\nWhile the ruling could complicate efforts to ramp up marijuana prosecutions in those states, it's far from a panacea for marijuana dispensaries and users. Kreit said the amendment only applies to medical marijuana, so recreational users and businesses are not protected. Additionally, the protection for medical marijuana disappears if the amendment is not renewed.\nU.S. Rep. Dana Rohrabacher, a Republican from California who co-sponsored the medical marijuana amendment, said during a conference call with reporters on Thursday that Sessions' decision would create momentum for a law that wouldn't have to be constantly renewed and would protect \"all of the decisions\" states make about marijuana.", "external_links": [], "published": "2018-01-05T10:25:00.000+02:00", "crawled": "2018-01-06T16:23:23.010+02:00", "highlightTitle": ""}