{"organizations": [], "uuid": "3a28f6616106fbbb2da554bbb72e091b7158ad64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/business-wire-ga-partners-acquires-denver-based-employer-essentials.html", "country": "US", "domain_rank": 767, "title": "G&A Partners Acquires Denver-Based Employer Essentials", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-10T16:30:00.000+02:00", "replies_count": 0, "uuid": "3a28f6616106fbbb2da554bbb72e091b7158ad64"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/business-wire-ga-partners-acquires-denver-based-employer-essentials.html", "ord_in_thread": 0, "title": "G&A Partners Acquires Denver-Based Employer Essentials", "locations": [], "entities": {"persons": [{"name": "john w. allen", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}], "organizations": [{"name": "g&a partners", "sentiment": "negative"}, {"name": "hdhp", "sentiment": "none"}, {"name": "unitedhealthcare", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON--(BUSINESS WIRE)-- G&A Partners , a leading national professional employer organization (PEO), announced today that it has acquired the accounts of Denver-based Employer Essentials. With the acquisition, G&A Partners now serves over 1,000 clients and 36,000 worksite employees in the U.S. and Latin America, making it one of the largest privately held HR outsourcing organizations in the nation.\n“Acquiring Employer Essentials’ book of business was a great opportunity for G&A Partners,” said John W. Allen, president and COO, G&A Partners. “This acquisition, along with promising organic growth as a result of our UnitedHealthcare master health plan, positions us well to further grow our presence in Colorado and become one of the area’s preeminent PEOs.”\nG&A Partners’ UnitedHealthcare (UHC) master plan launched in 2016 and includes nine different plan options – five traditional PPO plans, two HMO plans and two HDHP plans – offering small and medium-sized Colorado businesses increased flexibility and more competitive pricing on health insurance coverage.\n“We are also looking forward to extending our expansive broker and referral partner network in Denver and the surrounding areas,” said Aaron Call, G&A’s executive vice president of operations for the western United States. “As one of the more broker-friendly PEOs, we are committed to partnering with local agencies and independent agents to develop mutually beneficial relationships that allow us to deliver exceptional value to our shared clients.”\n“We are excited to become part of the G&A Partners family,” said Tara Griffin, president, Employer Essentials. “The consolidation of our two firms will create one of the strongest and most highly skilled HR and administrative service providers in the Western United States.”\nGriffin will join G&A Partners as a regional client services manager, and will help oversee the transition. G&A Partners is also retaining the other client-facing Employer Essentials employees, who will continue serving the firm’s clients from its office located just south of Denver in Englewood, Colorado.\nAbout G&A Partners\nG&A Partners, one of the nation’s leading professional employer organizations (PEO), has been helping entrepreneurs grow their businesses, take better care of their employees and enjoy a higher quality of life for more than 20 years. By providing proven solutions and technology in the areas of HR compliance, employee benefits, payroll administration and workplace safety, G&A alleviates the burden of tedious administrative tasks and allows business owners to focus their time, talent and energy on growing their company. Headquartered in Houston, G&A has offices throughout Texas, as well as in Arizona, Colorado, Minnesota, Utah and Latin America.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180110005214/en/\nIntegrate\nCristina Calderon, (713) 225-0880\ncristina@integrateagency.com\nSource: G&A Partners", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.gnapartners.com%2F&esheet=51740476&newsitemid=20180110005214&lan=en-US&anchor=G%26A+Partners&index=1&md5=0131fb99d544218f69b0f8f19b9156a0", "http://www.businesswire.com/news/home/20180110005214/en/"], "published": "2018-01-10T16:30:00.000+02:00", "crawled": "2018-01-10T19:15:15.064+02:00", "highlightTitle": ""}