{"organizations": [], "uuid": "38000e01ae0e5fca9d21f77cb9ccf3afa3f474cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104959661-GettyImages-599198828-rosenhaus.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/eagles-face-stiff-competition-against-absolutely-freakish-tom-brady.html", "country": "US", "domain_rank": 767, "title": "Eagles face stiff competition against 'absolutely freakish' Tom Brady", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.172, "site_type": "news", "published": "2018-01-22T22:47:00.000+02:00", "replies_count": 0, "uuid": "38000e01ae0e5fca9d21f77cb9ccf3afa3f474cc"}, "author": "Kellie Ell", "url": "https://www.cnbc.com/2018/01/22/eagles-face-stiff-competition-against-absolutely-freakish-tom-brady.html", "ord_in_thread": 0, "title": "Eagles face stiff competition against 'absolutely freakish' Tom Brady", "locations": [], "entities": {"persons": [{"name": "tom brady", "sentiment": "negative"}, {"name": "brady", "sentiment": "none"}, {"name": "rosenhaus", "sentiment": "none"}, {"name": "drew rosenhaus", "sentiment": "none"}], "locations": [], "organizations": [{"name": "philadelphia eagles", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "nfl", "sentiment": "none"}, {"name": "new england patriots", "sentiment": "none"}, {"name": "rosenhaus sports", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "4 Hours Ago | 00:47 \nThe Philadelphia Eagles may be going to the Super Bowl , but the battle against Tom Brady is going to be intense, said well-known sports agent Drew Rosenhaus . \n\"For a guy to be 40 years old and be the NFL's most valuable player and to fight through injuries and to play as well as he ever has is absolutely freakish,\" Rosenhaus said of New England Patriots' quarterback Tom Brady. \nRosenhaus, who owns Rosenhaus Sports and represents at least five Super Bowl-bound players, called Brady's pro football career \"unprecedented\" and said he is \"a remarkable athlete.\" \n\"Tom Brady is the best quarterback in the history of the NFL,\" Rosenhaus said Monday on CNBC's \" Squawk on the Street .\" Brady has won five Super Bowls while playing for the Patriots and has been named Super Bowl Most Valuable Player four times, the most of any single player. \n\"I'm fascinated to learn as an agent the different things that Tom Brady is doing so that our clients can incorporate that,\" Rosenhaus said. \"Brady is an absolute anomaly. To play at this level at his age is absolutely unheard of.\" \nThe Eagles, who are considered by many to be the underdogs, will have some stiff competition against the defending champions. In addition to Brady, the Patriots will have veteran coach Bill Belichick joining them at the 2018 Super Bowl in Minneapolis. This will be Belichick's eighth appearance as head coach at the Super Bowl. \nBut that doesn't mean the lineup from the City of Brotherly Love should be dismissed just yet. Rosenhaus said the team is underrated. \n\"The Eagles have a tremendous offensive line,\" he said. \"They have a terrific group of skill position players. And right now, in my opinion, they have as good a defense as any in the National Football League. Maybe the best defense in the NFL belongs to the Philadelphia Eagles.\" \nThe Eagles' winning recipe also includes running backs Jay Ajayi and LeGarrette Blount, Rosenhaus said. \nThe veteran sports agent pointed out that while Eagles' quarterback Nick Foles doesn't have the same track record as Tom Brady, he shouldn't be written off either. \n\"There was a time in Nick Foles' career where he was a pro ball MVP,\" said Rosenhaus. \"Nick Foles is playing back to the height of his career.\" \nThe Eagles surprised sports fans on Sunday night by beating the Minnesota Vikings 38-7 for the NFC championship, qualifying them for the Super Bowl on Feb. 4 at the U.S. Bank Stadium in Minneapolis. This will be the Eagles' first Super Bowl since 2005. Kellie Ell News Associate for CNBC Playing", "external_links": [], "published": "2018-01-22T22:47:00.000+02:00", "crawled": "2018-01-22T22:58:16.006+02:00", "highlightTitle": ""}