{"organizations": [], "uuid": "d62c691920f5a966d8a0fdf9b4c69b7fa0bd4d3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/04/28/103588946-GettyImages-487953725.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/23/cnbcs-2018-disruptor-50-list--call-for-nominations.html", "country": "US", "domain_rank": 767, "title": "CNBC's 2018 Disruptor 50 list — Call for nominations", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.147, "site_type": "news", "published": "2018-01-23T13:13:00.000+02:00", "replies_count": 0, "uuid": "d62c691920f5a966d8a0fdf9b4c69b7fa0bd4d3d"}, "author": "David Spiegel", "url": "https://www.cnbc.com/2018/01/23/cnbcs-2018-disruptor-50-list--call-for-nominations.html", "ord_in_thread": 0, "title": "CNBC's 2018 Disruptor 50 list — Call for nominations", "locations": [], "entities": {"persons": [], "locations": [{"name": "pinterest", "sentiment": "none"}, {"name": "airbnb", "sentiment": "none"}, {"name": "spotify", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "cnbc disruptor", "sentiment": "none"}, {"name": "warby parker", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Geography Photos | UIG | Getty Images \nThe search is under way for the next group of the most ambitious, innovative private companies transforming the economy and forcing the public giants to rethink the way they do business. \nCNBC is now accepting nominations for the 2018 CNBC Disruptor 50, our annual list of private companies transforming the economy and altering industry. \nIn 2017, companies with a combined valuation of more than $239 billion dollars earned a spot on the CNBC Disruptor 50 list by reimagining markets and harnessing breakthrough technologies with the hope of becoming tomorrow's great public companies. Two 2017 Disruptors — Blue Apron and MongoDB — are already public. Two others — Spotify and Dropbox — are expected to go public in the near future. Meet the 2017 CNBC Disruptor 50 companies \nA handful of household names, like Airbnb , Uber and Pinterest , returned to the list for a fifth straight year in 2017. Others were returned to the list after a year or more away, like Warby Parker , which has brought its revolutionary internet brand to brick-and-mortar; and Foursquare, which has harnessed its treasure-trove of data to become much more than a social network. \nAnd there were the 2017 newcomers, like Uptake Technologies, which brings predictive data analytics to infrastructure and heavy equipment; Trulioo, an internet-age identity verification service; and Skillz, the first Disruptor from the hyper-growing world of esports. \nNow it's 2018, and our only question is, Who's next? \nSubmit your nomination for the 2018 CNBC Disruptor 50 by clicking here . \nThe deadline to submit the 2018 CNBC Disruptor 50 Nominee Submission Form is Friday, Feb. 9, at 8 pm Eastern time. All private, independently owned companies are eligible, and any company founder, executive, representative or investor in the company is welcome to submit the nomination form. 5 years, 147 companies: See them all \nThe competition will be tough. In 2017, 838 companies submitted nominations from the United States and around the world. \nNominees will be put through a comprehensive and rigorous process of researching and scoring across a wide range of quantitative and qualitative criteria. Winners will be notified in April, and the list will be published in May across CNBC's TV and digital platforms. \nTo stay part of the conversation, follow @CNBCDisruptors on Twitter and look for updates at disruptor50.cnbc.com. \nMore from CNBC Disruptor 50:", "external_links": [], "published": "2018-01-23T13:13:00.000+02:00", "crawled": "2018-01-23T13:13:16.005+02:00", "highlightTitle": ""}