{"organizations": [], "uuid": "3fcddd3a761cc1a6e64fc619b7118ba304bcca4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-ups-chief-commercial-officer-alan-gershenhorn-to-retire.html", "country": "US", "domain_rank": 767, "title": "UPS Chief Commercial Officer Alan Gershenhorn to Retire", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.109, "site_type": "news", "published": "2018-01-30T17:00:00.000+02:00", "replies_count": 0, "uuid": "3fcddd3a761cc1a6e64fc619b7118ba304bcca4e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-ups-chief-commercial-officer-alan-gershenhorn-to-retire.html", "ord_in_thread": 0, "title": "UPS Chief Commercial Officer Alan Gershenhorn to Retire", "locations": [], "entities": {"persons": [{"name": "alan gershenhorn", "sentiment": "negative"}, {"name": "david abney", "sentiment": "none"}, {"name": "marken", "sentiment": "none"}, {"name": "alan", "sentiment": "none"}, {"name": "gershenhorn", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}], "organizations": [{"name": "ups", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 30, 2018 (GLOBE NEWSWIRE) -- UPS (NYSE: UPS) today announced Executive Vice President and Chief Commercial Officer, Alan Gershenhorn, has chosen to retire effective June 2018, after 38 years of UPS service.\nGershenhorn’s extensive responsibilities include leading corporate strategy, mergers and acquisitions, marketing, public affairs, communications, and several key growth strategies across the enterprise. He also has oversight for Coyote, UPS’s truckload brokerage business, and for Marken, the company’s specialty clinical trials and healthcare logistics unit. Previous to his current responsibilities, Gershenhorn led sales and solutions, customer experience and relationship management, segment marketing, product development, electronic commerce, revenue management, marketing research, other company-wide staffs and initiatives.\n“Alan’s tremendous impact on UPS is widely known and respected, inside the company and among our global customers, partners and other stakeholders,” said David Abney, UPS chief executive officer. “Alan guided UPS to intensify creation of distinctive customer value and positioned us as a premium service provider who creates revenue-generating insights that help customers succeed. During his tenure UPS introduced industry-leading new products, solutions and commercial innovations that pioneered the ecommerce era and the customer-centric B-to-B and B-to-C strategies that define UPS’s market presence today.”\nHe led, and has been a part of, numerous transformational programs helping to reshape UPS from a $3 billion U.S.-centric ground small package delivery company, when he joined UPS in 1979, to a more than $60 billion leader in global supply chain and logistics solutions.\nGershenhorn first joined the UPS Management Committee in 2007 to serve as president of UPS International where he was responsible for the UPS international package, freight forwarding, customs brokerage, and logistics businesses.\nHe has served in several other significant leadership positions in the United States, Europe, and Canada. These include Vice President UPS Corporate Strategy Group, where he was responsible for the company's retail strategy and operations worldwide and the integration of Mail Boxes Etc. (now recognized as The UPS Store); the president of UPS Canada; the president of UPS Supply Chain Solutions (SCS) Global Transportation and Shared Services; and the president of UPS SCS operations in Europe, Asia, the Middle East, and Africa.\nA native of Long Island, New York, he began his UPS career in Houston, Texas, as a part-time package handler.\nIn addition to his corporate responsibilities, Alan serves as a Trustee of The UPS Foundation and a delegate of the World Business Council for Sustainable Development. He also serves on the Board of Directors of Beacon Roofing Supply, Inc. He holds a degree in finance from the University of Houston.\nAbout UPS\nUPS (NYSE: UPS) is a global leader in logistics, offering a broad range of solutions including transporting packages and freight; facilitating international trade, and deploying advanced technology to more efficiently manage the world of business. Headquartered in Atlanta, UPS serves more than 220 countries and territories worldwide. The company can be found on the web at ups.com or pressroom.ups.com and its corporate blog can be found at longitudes.ups.com . To get UPS news direct, follow @UPS_News on Twitter.\nSteve Gaut 404-828-8787 sgaut@ups.com\nSource: UPS", "external_links": ["https://www.globenewswire.com/Tracker?data=wX04dWpr1ZS5Q6OrT1xQmLDMnWGzhI7QtTnmacLFu1vHBt_c7DeDmZsVOXrc2ClO0CBBcFs9QlpKNEt8hpAHle_c-kgZ1KFC7aac0pRm8PZ2o1biWZYvjgzcpV9TcBLh", "https://www.globenewswire.com/Tracker?data=4b4_PmtC97RhmfzZPqKYysNRwibcaTuwZCveTMXGb01MExIMlQ8VKu1Y7_wj-kkz2mL4AmAdaTHVMIYUvt5ssQ==", "https://www.globenewswire.com/Tracker?data=x750fkZwNv0Fe3Spe1nGsEVDLGG4CXywo3jRSbjwjZ8npq2s5_NbwF9zcgOtl-f6Sm-FY01rUgwJZ-Y6jONISw==", "https://www.globenewswire.com/Tracker?data=4CSK8tmBC5I2l9ppUXf5D7BsHcuwmYVL0cVvc870sv-nw_DWpK9QkgJ0mPSQi2Qz9VaPGo9agRVRfCfLxkUufg3wYVwQeZZbtVk3z4cg5Bs=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/163a219e-1677-4221-830c-03997e1181ce", "https://www.globenewswire.com/Tracker?data=tVKMKBJpWtZrLS9Ibr8as6il9BrF5uywmhIVTl0EDjFSw2_63WMpyH5y-hL46s6d"], "published": "2018-01-30T17:00:00.000+02:00", "crawled": "2018-01-30T18:44:00.005+02:00", "highlightTitle": ""}