{"organizations": [], "uuid": "da42c138c03cac4776195f2b16c36fde608a2dcf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-ameris-bancorp-signs-definitive-merger-agreement-to-acquire-hamilton-state-bancshares-inc.html", "country": "US", "domain_rank": 767, "title": "Ameris Bancorp Signs Definitive Merger Agreement to Acquire Hamilton State Bancshares, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.075, "site_type": "news", "published": "2018-01-26T15:01:00.000+02:00", "replies_count": 0, "uuid": "da42c138c03cac4776195f2b16c36fde608a2dcf"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-ameris-bancorp-signs-definitive-merger-agreement-to-acquire-hamilton-state-bancshares-inc.html", "ord_in_thread": 0, "title": "Ameris Bancorp Signs Definitive Merger Agreement to Acquire Hamilton State Bancshares, Inc.", "locations": [], "entities": {"persons": [{"name": "bob", "sentiment": "none"}, {"name": "ameris", "sentiment": "none"}, {"name": "bob oliver", "sentiment": "none"}], "locations": [{"name": "ga.", "sentiment": "none"}, {"name": "hoschton", "sentiment": "none"}, {"name": "moultrie", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "hoschton", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "southeast", "sentiment": "none"}], "organizations": [{"name": "ameris bancorp", "sentiment": "negative"}, {"name": "ameris bancorp signs definitive merger agreement to acquire hamilton state bancshares, inc", "sentiment": "neutral"}, {"name": "atlantic coast financial corporation", "sentiment": "none"}, {"name": "ameris bank", "sentiment": "none"}, {"name": "hamilton state bank", "sentiment": "none"}, {"name": "hamilton state bancshares, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOULTRIE, Ga. and HOSCHTON, Ga., Jan. 26, 2018 /PRNewswire/ -- Ameris Bancorp (Nasdaq: ABCB) (\"Ameris\"), the parent company of Ameris Bank, announced today the signing of a definitive merger agreement under which Ameris will acquire Hamilton State Bancshares, Inc. (\"Hamilton\"), the parent company of Hamilton State Bank, Hoschton, Georgia. Upon completion of the transaction, and including the previously announced acquisition of Atlantic Coast Financial Corporation, the combined company will have approximately $11.3 billion in assets and a branching network across four states.\n\"Atlanta is the largest market in Georgia and one of the largest markets in the entire Southeast. While we have had a small presence in Atlanta for a number of years, we have been looking for an opportunity to expand our presence in this important market. We have known Bob Oliver and his team for many years and believe their culture and banking philosophy are very similar to our own. We believe that partnering with Bob and his team and the low-cost core deposit franchise that they have built is a fantastic way to jump start our Atlanta strategy,\" commented Edwin W. Hortman, Jr., Executive Chairman, President and Chief Executive Officer of Ameris.\nFormed in 2004, Hamilton has $1.8 billion in assets and currently operates 28 banking locations, 24 of which are located within the Atlanta MSA, two of which are in the Gainesville, Georgia MSA and the other two of which are in Georgia just outside of the Atlanta MSA. In recent years, Hamilton has combined its acquisition strategy with a focus on organic growth in its commercial business-line to become the fifth largest independent community bank in the Atlanta MSA. Combined with Ameris's existing Atlanta location, the combined bank will have approximately $1.4 billion of deposits in the Atlanta MSA and be the thirteenth largest bank in the market.\nRobert C. Oliver, Chairman, President and Chief Executive Officer of Hamilton, said, \"I am excited to have our team join an exceptional institution in Ameris. Like ourselves, Ameris prides itself on being a strong community bank. We look forward to being able to serve our customers with the full suite of products and capabilities offered by Ameris.\"\nUnder the terms of the definitive merger agreement, each share of Hamilton common stock and each restricted stock unit will be converted into the right to receive 0.16 shares of Ameris common stock and $0.93 in cash. The consideration mix is approximately 90% stock and 10% cash. The transaction is valued at approximately $405.7 million in the aggregate based on Ameris's closing stock price of $53.45 as of January 25, 2018.\nThe merger agreement has been unanimously approved by the board of directors of each company. The transaction is expected to close in the third quarter of 2018 and is subject to customary closing conditions, including the receipt of regulatory approvals and the approval of the shareholders of Hamilton.\nStephens Inc. served as financial advisor and Rogers & Hardin LLP provided legal counsel to Ameris. Sandler O'Neill + Partners, L.P. served as financial advisor and Alston & Bird, LLP provided legal counsel to Hamilton.\nConference Call Information\nAmeris will host a teleconference at 10:00 a.m. Eastern time today (January 26, 2018) to discuss the transaction and answer appropriate questions. The conference call can be accessed by dialing 1-877-504-1190 (or 1-855-669-9657 for participants in Canada and 1-412-902-6630 for other international participants). The conference ID name is Ameris Bancorp ABCB. A replay of the call will be available one hour after the end of the conference call until February 9, 2018. To listen to the replay, dial 1-877-344-7529 (or 1-855-669-9658 for participants in Canada and 1-412-317-0088 for other international participants). The conference replay access code is 10115392. The conference call replay and the information discussed will also be available on the Investor Relations page of the Ameris Bank website at www.amerisbank.com .\nCautionary Statements Regarding Forward-Looking Information\nThis news release contains forward-looking statements, as defined by federal securities laws, including, among other forward-looking statements, certain plans, expectations and goals, and including statements about the benefits of the proposed merger between Ameris and Hamilton. Words such as \"may,\" \"believe,\" \"expect,\" \"anticipate,\" \"intend,\" \"will,\" \"should,\" \"plan,\" \"estimate,\" \"predict,\" \"continue\" and \"potential\" or the negative of these terms or other comparable terminology, as well as similar expressions, are meant to identify forward-looking statements. The forward-looking statements in this news release are based on current expectations and are provided to assist in the understanding of potential future performance. Such forward-looking statements involve numerous assumptions, risks and uncertainties that may cause actual results to differ materially from those expressed or implied in any such statements, including, without limitation, the following: the parties' ability to consummate the proposed merger or satisfy the conditions to the completion of the proposed merger, including, without limitation, the receipt of shareholder approval and the receipt of required regulatory approvals on the terms expected or on the anticipated schedule; the parties' ability to meet expectations regarding the timing, completion and accounting and tax treatments of the proposed merger; the businesses of Ameris and Hamilton may not be integrated successfully or such integration may take longer to accomplish than expected; the expected cost savings and any revenue synergies from the proposed merger may not be fully realized within the expected timeframes; disruption from the proposed merger may make it more difficult to maintain relationships with customers, employees or others; diversion of management time to merger-related issues; dilution caused by Ameris's issuance of additional shares of its common stock in connection with the proposed merger; general competitive, economic, political and market conditions and fluctuations, including, without limitation, movements in interest rates; competitive pressures on product pricing and services; and success and timing of other business strategies. For a discussion of some of the other risks and other factors that may cause such forward-looking statements to differ materially from actual results, please refer to Ameris's filings with the Securities and Exchange Commission, including its Annual Report on Form 10-K for the year ended December 31, 2016 and subsequently filed Quarterly Reports on Form 10-Q and Current Reports on Form 8-K. Forward-looking statements speak only as of the date they are made, and neither Ameris nor Hamilton undertakes any obligation to update or revise forward-looking statements.\nAdditional Information and Where to Find It\nAmeris intends to file a registration statement on Form S-4 with the Securities and Exchange Commission to register the shares of Ameris's common stock that will be issued to Hamilton's shareholders in connection with the transaction. The registration statement will include a joint proxy statement/prospectus and other relevant materials in connection with the proposed merger transaction. BEFORE MAKING ANY VOTING OR INVESTMENT DECISION, INVESTORS AND SECURITY HOLDERS ARE URGED TO READ THE PROXY STATEMENT/PROSPECTUS REGARDING THE MERGER AND ANY OTHER RELEVANT DOCUMENTS CAREFULLY IN THEIR ENTIRETY WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT THE MERGER. Investors and security holders may obtain free copies of these documents and other documents filed with the Securities and Exchange Commission on its website at http://www.sec.gov . Investors and security holders may also obtain free copies of the documents filed with the Securities and Exchange Commission by Ameris on its website at http://www.AmerisBank.com .\nThis communication does not constitute an offer to sell or the solicitation of an offer to buy any securities or a solicitation of any vote or approval.\nParticipants in the Merger Solicitation\nAmeris and Hamilton, and certain of their respective directors, executive officers and other members of management and employees, may be deemed to be participants in the solicitation of proxies from the shareholders of Hamilton in respect of the proposed merger transaction. Information regarding the directors and executive officers of Ameris and Hamilton and other persons who may be deemed participants in the solicitation of the shareholders of Hamilton in connection with the proposed transaction will be included in the proxy statement/prospectus for Hamilton's special meeting of shareholders, which will be filed by Ameris with the Securities and Exchange Commission. Information about Ameris's directors and executive officers can also be found in Ameris's definitive proxy statement in connection with its 2017 annual meeting of shareholders, as filed with the Securities and Exchange Commission on April 3, 2017, and other documents subsequently filed by Ameris with the Securities and Exchange Commission. Additional information regarding the interests of such participants will be included in the proxy statement/prospectus and other relevant documents regarding the proposed merger transaction filed with the Securities and Exchange Commission when they become available.\nAmeris Bancorp\nAmeris Bancorp is a bank holding company headquartered in Moultrie, Georgia and the parent of Ameris Bank, a Georgia state-chartered bank. Ameris Bank currently has 97 locations in Georgia, Alabama, northern Florida and South Carolina.\nA presentation with additional information regarding the transaction will be available on the Investor Relations page of www.AmerisBank.com .\nHamilton State Bancshares, Inc.\nHamilton State Bancshares is a Georgia-based bank holding company. It operates Hamilton State Bank with 28 branches throughout North Georgia. Hamilton State Bank is a full-service bank offering a variety of services to its customers from its offices in Barrow, Bartow, Butts, Cherokee, Cobb, Douglas, Hall, Henry, Forsyth, Jasper, Jackson and Paulding counties in Georgia. To learn more about Hamilton State Bank visit www.hamiltonstatebank.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/ameris-bancorp-signs-definitive-merger-agreement-to-acquire-hamilton-state-bancshares-inc-300588694.html\nSOURCE Ameris Bancorp", "external_links": ["http://www.prnewswire.com/news-releases/ameris-bancorp-signs-definitive-merger-agreement-to-acquire-hamilton-state-bancshares-inc-300588694.html", "http://www.sec.gov/", "http://www.amerisbank.com/", "http://www.hamiltonstatebank.com/"], "published": "2018-01-26T15:01:00.000+02:00", "crawled": "2018-01-26T16:42:28.097+02:00", "highlightTitle": ""}