{"organizations": [], "uuid": "7d30d7030598b03496855701e2dcb7b43a3ba199", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/10", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-marketaxess-reports-fourth-quarter-2017-revenues-of-99-point-6-million-pre-tax-income-of-49-point-4-million-and-diluted-eps.html", "country": "US", "domain_rank": 767, "title": "MarketAxess Reports Fourth 2017 Revenues of $99.6 Million, Pre-Tax Income of $49.4 Million and Diluted EPS of $0.88", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-31T14:30:00.000+02:00", "replies_count": 0, "uuid": "7d30d7030598b03496855701e2dcb7b43a3ba199"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-marketaxess-reports-fourth-quarter-2017-revenues-of-99-point-6-million-pre-tax-income-of-49-point-4-million-and-diluted-eps.html", "ord_in_thread": 0, "title": "MarketAxess Reports Fourth 2017 Revenues of $99.6 Million, Pre-Tax Income of $49.4 Million and Diluted EPS of $0.88", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "marketaxess holdings inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fourth Quarter Financial Highlights *\nRevenues of $99.6 million, up 5.4% Pre-tax income of $49.4 million, a decrease of 1.9% One-time tax charge of $11.7 million related to the Tax Cuts and Jobs Act Diluted EPS of $0.88, consistent with prior year Trading volume of $355.6 billion, up 5.1%\n* All comparisons versus fourth quarter 2016.\nFull Year 2017 Financial Highlights **\nRecord revenues of $397.5 million, up 7.4% Record commission revenue of $355.3 million, up 6.9% Expenses of $195.7 million, up 9.8% Record pre-tax income of $201.8 million, up 5.3% Diluted EPS of $3.89, up 16.5% Record total trading volume of $1.5 trillion, up 11.4% Record estimated U.S. high-grade market share of 16.9%, up from 16.0%\n** All comparisons versus full year 2016.\nNEW YORK, Jan. 31, 2018 (GLOBE NEWSWIRE) -- MarketAxess Holdings Inc. (Nasdaq:MKTX), the operator of a leading electronic trading platform for fixed-income securities, and the provider of market data and post-trade services for the global fixed-income markets, today announced results for the quarter ended December 31, 2017.\n“We are pleased to report our ninth straight year of record trading volumes, revenues and operating income. These results were accomplished in spite of the difficult fixed income trading environment in 2017 that had unusually low volatility in both credit spreads and interest rates. As we enter 2018, we are encouraged to see signs of more normal fixed income trading conditions, including improving global economic growth and declining central bank quantitative easing. Client adoption of electronic trading in fixed income continues to grow, and our international client diversification creates a valuable foundation for long term growth.”\nFourth Quarter Results\nTotal revenues for the fourth quarter of 2017 increased 5.4% to $99.6 million, compared to $94.4 million for the fourth quarter of 2016. Pre-tax income was $49.4 million, compared to $50.3 million for the fourth quarter of 2016, a decrease of 1.9%. Pre-tax margin was 49.6%, compared to 53.3% for the fourth quarter of 2016. Net income totaled $33.5 million, or $0.88 per share on a diluted basis, compared to $33.2 million, or $0.88 per share, for the fourth quarter of 2016.\nCommission revenue for the fourth quarter of 2017 increased 2.9% to $88.0 million, compared to $85.5 million for the fourth quarter of 2016. Variable transaction fees decreased 6.5% to $65.4 million on total trading volume of $355.6 billion for the fourth quarter of 2017, compared to variable transaction fees of $69.9 million on total trading volume of $338.3 billion for the fourth quarter of 2016. U.S. high-grade trading volume as a percentage of FINRA’s high-grade TRACE trading volume increased to an estimated 17.6% for the fourth quarter of 2017, compared to an estimated 17.2% for the fourth quarter of 2016.\nAll other revenue, which consists of information services, post-trade services, investment income and other revenue, increased to $11.6 million, compared to $8.9 million for the fourth quarter of 2016. The increase in all other revenue was principally due to higher information services revenue of $1.1 million and post-trade services revenue of $0.9 million.\nTotal expenses for the fourth quarter of 2017 increased 13.8% to $50.2 million, compared to $44.1 million for the fourth quarter of 2016. The increase in total expenses was largely due to higher employee compensation and benefit costs of $1.8 million, mainly due to an increase in headcount, technology and communication costs of $1.2 million, general and administrative costs of $1.1 million and depreciation and amortization of $0.9 million.\nThe effective tax rate for the fourth quarter of 2017 was 32.2%, compared to 34.1% for the fourth quarter of 2016. The fourth quarter of 2017 income tax provision includes a one-time tax charge totaling $11.7 million, or $0.31 per diluted share, related to the enactment of the Tax Cuts and Jobs Act (the “Tax Act”), which was signed into law in December 2017, offset by excess tax benefits of $11.4 million, or $0.30 per diluted share, related to a new share-based compensation accounting standard (ASU 2016-09) adopted as of January 1, 2017. The tax charge relates to the repatriation tax on accumulated undistributed foreign earnings and re-measurement of U.S. deferred tax assets, among other items. The final impact of the Tax Act may differ materially from the charge recognized this quarter due to, among other things, changes in interpretations and assumptions the Company has made, guidance that may be issued by the U.S. Department of Treasury and actions the Company may take as a result of the Tax Act.\nEmployee headcount was 429 as of December 31, 2017, compared to 383 as of December 31, 2016.\nFull Year 2017 Results\nTotal revenues for the year ended December 31, 2017 increased 7.4% to a record $397.5 million, compared to $369.9 million for 2016. Pre-tax income was a record $201.8 million, compared to $191.6 million for 2016, an increase of 5.3%. Pre-tax margin was 50.8%, compared to 51.8% for 2016. Net income totaled $148.1 million, or $3.89 per share on a diluted basis, compared to $126.2 million, or $3.34 per share, for 2016.\nCommission revenue for the year ended December 31, 2017 increased 6.9% to a record $355.3 million, compared to $332.3 million for 2016. Variable transaction fees increased 4.4% to $279.8 million on total trading volume of $1.5 trillion, compared to variable transaction fees of $268.1 million on total trading volume of $1.3 trillion for 2016. U.S. high-grade trading volume as a percentage of FINRA’s high-grade TRACE trading volume increased to an estimated 16.9%, compared to an estimated 16.0% for 2016.\nAll other revenue increased 12.2% to $42.2 million in 2017, compared to $37.6 million for 2016. The increase in all other revenue was principally due to higher information services revenue of $2.5 million and an increase in investment income of $1.5 million.\nTotal expenses for the year ended December 31, 2017 increased 9.8% to $195.7 million, compared to $178.3 million for 2016. The increase in total expenses was principally due to higher employee compensation and benefits costs of $6.0 million mainly due to an increase in employee headcount, general and administrative costs of $3.0 million, technology and communication costs of $2.8 million, professional and consulting fees of $2.2 million and depreciation and amortization of $1.4 million.\nThe effective tax rate for 2017 was 26.6% compared to 34.1% for 2016. The 2017 income tax provision includes excess tax benefits from share-based compensation of approximately $26.1 million, or $0.69 per diluted share, offset by the one-time tax charge totaling $11.7 million, or $0.31 per diluted share, related to the enactment of the Tax Act.\nDividend\nThe Company’s board of directors declared a 27% increase in the quarterly cash dividend to $0.42 per share of common stock outstanding, to be paid on February 28, 2018 to stockholders of record as of the close of business on February 14, 2018.\nShare Repurchases\nA total of 32,500 shares were repurchased in the fourth quarter of 2017 at a cost of $6.1 million.\nBalance Sheet Data\nAs of December 31, 2017, total assets were $581.2 million and included $406.5 million in cash, cash equivalents and investments. Total stockholders’ equity as of December 31, 2017 was $514.8 million.\nGuidance for 2018\nFor 2018, the Company is providing the following guidance:\nExpenses are expected to be in the range of $220.0 million to $232.0 million, including duplicate occupancy costs of approximately $8.0 million for the Company’s new corporate offices in New York during the build-out phase.\nCapital expenditures are expected to be in the range of $43.0 million to $50.0 million, including approximately $25 million of buildout costs for the new corporate offices.\nThe Company’s overall effective tax rate is expected to be between 23.0% to 25.0%, including the estimated impact of the Tax Act and excess tax benefits on share awards that are expected to vest in 2018.\nNon-GAAP Financial Measures and Other Items\nTo supplement the Company’s unaudited financial statements presented in accordance with generally accepted accounting principles (“GAAP”), the Company uses certain non-GAAP measures of financial performance, including earnings before interest, taxes, depreciation and amortization (“EBITDA”) and free cash flow. The Company believes that these non-GAAP financial measures, when taken into consideration with the corresponding GAAP financial measures, are important in understanding the Company's operating results and useful for period-to-period comparison results. See the attached schedule at the end of this release for a reconciliation of GAAP to non-GAAP financial measures.\nWebcast and Conference Call Information\nRichard M. McVey, chairman and chief executive officer, and Antonio L. DeLise, chief financial officer, will host a conference call to discuss the Company’s financial results and outlook on Wednesday, January 31, 2018, at 10:00 a.m. Eastern time. To access the conference call, please dial 855-425-4206 (U.S.) or 484-756-4249 (international). The Company will also host a live audio Webcast of the conference call on the Investor Relations section of the Company's website at http://investor.marketaxess.com . A replay of the call will be made available by dialing 855-859-2056 (U.S.) or 404-537-3406 (international) for one week after the announcement. The passcode for replay callers is 4095858. The Webcast will also be archived on http://investor.marketaxess.com for 90 days following the announcement.\nAbout MarketAxess\nMarketAxess operates a leading electronic trading platform that enables fixed-income market participants to efficiently trade corporate bonds and other types of fixed-income instruments using MarketAxess’ patented trading technology. Over 1,300 institutional investor and broker-dealer firms are active users of the MarketAxess trading platform, accessing global liquidity in U.S. high-grade corporate bonds, emerging markets and high-yield bonds, European bonds, U.S. agency bonds, municipal bonds, credit default swaps and other fixed-income securities. MarketAxess also offers a number of trading-related products and services, including: market data to assist clients with trading decisions; connectivity solutions that facilitate straight-through processing; technology services to optimize trading environments; and execution services for exchange-traded fund managers and other clients. Through its Trax® division, MarketAxess also offers a range of pre- and post-trade services, including trade matching, regulatory transaction reporting and market and reference data, across a range of fixed-income products. Trax is the trading name of Xtrakter Ltd., a MarketAxess group company.\nMarketAxess maintains its headquarters in New York and has offices in London, Boston, Chicago, Los Angeles, Miami, Salt Lake City, San Francisco, São Paulo, Hong Kong and Singapore. For more information, please visit www.marketaxess.com .\nCautionary Note Regarding Forward-Looking Statements\nThis press release may contain forward-looking statements, including statements about the outlook and prospects for Company and industry growth, as well as statements about the Company’s future financial and operating performance. These and other statements that relate to future results and events are based on MarketAxess’ current expectations. The Company’s actual results in future periods may differ materially from those currently expected or desired because of a number of risks and uncertainties, including: the volatility of financial services markets generally; the level of trading volume transacted on the MarketAxess platform; the absolute level and direction of interest rates and the corresponding volatility in the corporate fixed-income market; the level and intensity of competition in the fixed-income electronic trading industry and the pricing pressures that may result; the variability of our growth rate; the rapidly evolving nature of the electronic financial services industry; our ability to introduce new fee plans and our clients’ response; our exposure to risks resulting from non-performance by counterparties to transactions executed between our clients in which we act as an intermediary in matched principal trades; our dependence on our broker-dealer clients; the loss of any of our significant institutional investor clients; our ability to develop new products and offerings and the market’s acceptance of those products; the effect of rapid market or technological changes on us and the users of our technology; our ability to successfully maintain the integrity of our trading platform and our response to system failures, capacity constraints and business interruptions; our vulnerability to cyber security risks; our ability to protect our intellectual property rights or technology and defend against intellectual property infringement or other claims; our ability to enter into strategic alliances and to acquire other businesses and successfully integrate them with our business; our ability to comply with new laws, rules and regulations both domestically and internationally; our ability to maintain effective compliance and risk management methods; the strain of growth initiatives on management and other resources; our future capital needs and our ability to obtain capital when needed; limitations on our operating flexibility contained in our credit agreement; and other factors. The Company undertakes no obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise. More information about these and other factors affecting MarketAxess’ business and prospects is contained in MarketAxess’ periodic filings with the Securities and Exchange Commission and can be accessed at www.marketaxess.com .\nMedia and Investor Relations Contacts:\nTony DeLise\nMarketAxess Holdings Inc.\n+1-212-813-6017\nMary Sedarat\nMarketAxess Holdings Inc.\n+1-212-813-6226\nWilliam McBride\nRF|Binder\n+1-917-239-6726\nMarketAxess Holdings Inc.\nConsolidated Statements of Operations Three Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 (In thousands, except per share data) (unaudited) Revenues Commissions $ 87,975 $ 85,519 $ 355,282 $ 332,307 Information services (1) 6,793 5,667 25,807 23,269 Post-trade services (1) 3,467 2,544 11,090 10,812 Investment income 1,068 668 3,619 2,137 Other (1) 262 38 1,673 1,394 Total revenues 99,565 94,436 397,471 369,919 Expenses Employee compensation and benefits 24,334 22,529 102,751 96,785 Depreciation and amortization 5,208 4,292 19,274 17,838 Technology and communications 5,606 4,449 20,048 17,275 Professional and consulting fees 5,455 4,726 19,367 17,175 Occupancy 1,504 1,075 6,125 4,681 Marketing and advertising 3,005 3,192 9,762 8,934 Clearing costs 1,477 1,306 5,797 6,060 General and administrative 3,605 2,540 12,579 9,569 Total expenses 50,194 44,109 195,703 178,317 Income before income taxes 49,371 50,327 201,768 191,602 Provision for income taxes 15,898 17,162 53,679 65,430 Net income $ 33,473 $ 33,165 $ 148,089 $ 126,172 Per Share Data: Net income per common share Basic $ 0.91 $ 0.90 $ 4.02 $ 3.42 Diluted $ 0.88 $ 0.88 $ 3.89 $ 3.34 Cash dividends declared per common share $ 0.33 $ 0.26 $ 1.32 $ 1.04 Weighted-average common shares: Basic 36,887 36,837 36,864 36,844 Diluted 37,943 37,742 38,038 37,738 (1) The Company reclassified “Information and post-trade services” revenues on the consolidated statements of operations to separately reflect “Information services” revenues and “Post-trade services” revenues. “Information services” revenues includes technology product and service revenue of $0.8 million and $0.7 million for the three months ended December 31, 2017 and 2016, respectively, and $2.9 million for each of the twelve months ended December 31, 2017 and 2016 that was previously reported within “Other” revenue.\nMarketAxess Holdings Inc.\nCommission Revenue Details Three Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 Total Commissions Revenue (In thousands) (unaudited) Transaction Fees U.S. high-grade $ 34,623 $ 34,191 $ 137,034 $ 135,295 Other credit 1 30,271 35,048 140,492 129,976 Liquid products 2 531 699 2,277 2,795 Total transaction fees 65,425 69,938 279,803 268,066 Distribution Fees U.S. high-grade 16,724 15,107 64,709 58,705 Other credit 1 5,648 346 10,154 4,783 Liquid products 2,3 178 128 616 753 Total distribution fees 22,550 15,581 75,479 64,241 Total commissions $ 87,975 $ 85,519 $ 355,282 $ 332,307 Average Variable Transaction Fee Per Million (unaudited) U.S. high-grade - fixed-rate $ 177 $ 189 $ 170 $ 191 U.S. high-grade - floating-rate 73 49 65 39 Total U.S. high-grade 172 185 166 185 Other credit 213 258 242 256 Liquid products 42 40 43 39 Total 184 207 192 205 1 Other credit includes high-yield, emerging markets, Eurobonds and municipal bonds. 2 Liquid products includes U.S. agencies and European government bonds. 3 Includes CDS SEF-related revenue.\nMarketAxess Holdings Inc.\nConsolidated Condensed Balance Sheet Data As of December 31, 2017 December 31, 2016 (In thousands) (unaudited) Assets Cash and cash equivalents $ 167,014 $ 168,243 Investments, at fair value 239,521 194,404 Accounts receivable, net 52,636 50,668 All other assets 122,061 114,727 Total assets $ 581,232 $ 528,042 Liabilities and stockholders' equity Total liabilities $ 66,464 $ 60,029 Total stockholders' equity 514,768 468,013 Total liabilities and stockholders' equity $ 581,232 $ 528,042\nMarketAxess Holdings Inc.\nReconciliation of Non-GAAP Financial Measures Table I. Earnings Before Interest, Taxes, Depreciation and Amortization Three Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 (In thousands) (unaudited) Net income $ 33,473 $ 33,165 $ 148,089 $ 126,172 Add back: Interest expense — — — — Provision for income taxes 15,898 17,162 53,679 65,430 Depreciation and amortization 5,208 4,292 19,274 17,838 Earnings before interest, taxes, depreciation and amortization $ 54,579 $ 54,619 $ 221,042 $ 209,440 Table II. Free Cash Flow Three Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 (In thousands) (unaudited) Cash flow from operating activities $ 46,452 $ 56,607 $ 168,035 $ 89,747 Add back: Net purchases of corporate debt trading investments 25,419 (340 ) 17,081 74,195 Less: Purchases of furniture, equipment and leasehold improvements (4,841 ) (1,631 ) (12,086 ) (6,385 ) Capitalization of software development costs (3,377 ) (3,060 ) (13,471 ) (12,118 ) Free cash flow $ 63,653 $ 51,576 $ 159,559 $ 145,439\nMarketAxess Holdings Inc.\nVolume Statistics* Three Months Ended December 31, Twelve Months Ended December 31, 2017 2016 2017 2016 Total Trading Volume (In millions) (unaudited) U.S. high-grade - fixed-rate $ 191,411 $ 179,317 $ 791,194 $ 704,648 U.S. high-grade - floating-rate 9,815 5,749 33,839 25,917 Total U.S. high-grade 201,226 185,066 825,033 730,565 Other credit 141,857 135,799 579,912 506,762 Liquid products 12,543 17,393 53,383 71,375 Total $ 355,626 $ 338,258 $ 1,458,328 $ 1,308,702 Average Daily Volume (In millions) (unaudited) U.S. high-grade $ 3,246 $ 3,034 $ 3,300 $ 2,922 Other credit 2,281 2,207 2,316 2,021 Liquid products 202 285 213 285 Total $ 5,729 $ 5,526 $ 5,829 $ 5,228 Number of U.S. Trading Days 1 62 61 250 250 Number of U.K. Trading Days 2 63 63 252 253 1 The number of U.S. trading days is based on the SIFMA holiday recommendation calendar. 2 The number of U.K. trading days is based on the U.K. Bank holiday schedule. *Consistent with FINRA TRACE reporting standards, both sides of trades are included in the Company's reported volumes when the Company executes trades on a matched principal basis between two counterparties.\nSource:MarketAxess Holdings, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=3C0P6ybTmrWwRUQn7JFOF0Zsqbnv7FADX4XrmpvMIVyHnyDZBWZAfXAdV8UjIzh3nHqYPK5kft3GfNbdsKyvRKmyjANd4uD_7BC1MwyqyBg=", "https://www.globenewswire.com/Tracker?data=1BwUBKqXign22mErtvMUnrMINf4DtZSrSYdKQqwojgB-S1z0sgyY79-GP0St0Xc6ne4iasEkUkqGlrRebdYmOhhcaAHrFWANIK6GFfWTsm7dq01M3lqgRyx16EAn7RoH", "https://www.globenewswire.com/NewsRoom/AttachmentNg/4111bbc9-012b-4eea-a6dd-71d665cc810c"], "published": "2018-01-31T14:30:00.000+02:00", "crawled": "2018-01-31T17:48:05.015+02:00", "highlightTitle": ""}