{"organizations": [], "uuid": "6670ef5613d97e70da53716b1ebeb3af9a4f7f90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/japan-bonds-boj/japans-central-bank-maintains-bond-purchases-after-earlier-jolt-jgbs-bounce-idUSL4N1P61GG", "country": "US", "domain_rank": 408, "title": "Japan's central bank maintains bond purchases after earlier jolt, JGBs bounce", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T04:41:00.000+02:00", "replies_count": 0, "uuid": "6670ef5613d97e70da53716b1ebeb3af9a4f7f90"}, "author": "", "url": "https://www.reuters.com/article/japan-bonds-boj/japans-central-bank-maintains-bond-purchases-after-earlier-jolt-jgbs-bounce-idUSL4N1P61GG", "ord_in_thread": 0, "title": "Japan's central bank maintains bond purchases after earlier jolt, JGBs bounce", "locations": [], "entities": {"persons": [], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "boj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO, Jan 11 (Reuters) - The Bank of Japan maintained the amount of its bond purchases on Thursday, helping to soothe a market rattled earlier this week by a cut in its buying of longer-dated debt that fanned worries the central bank may be moving to turn off its stimulus.\nThe BOJ maintained the size of its buying in one- to three-, three- to five-, and five- to ten-year Japanese government bonds at 250 billion yen ($2.24 billion), 300 billion yen and 410 billion yen respectively.\nThe 10-year JGB futures were up 0.10 in price in morning trade, paring some of their total losses of 0.37 point over the past two days after the BOJ on Tuesday reduced its buying in JGBs with more than 10 years to maturity.\nMost market players expected the BOJ to avoid causing another shock in the market, especially after U.S. bond markets were shaken by a report that China, the biggest foreign holder of U.S. Treasuries, could slow or stop buying government bonds.\nStill, given the BOJ is already holding almost a half of the market after nearly five years of massive bond buying, many traders believe the central bank has little choice but to continue with its gradual reduction in bond purchase.\nAlthough BOJ Governor Haruhiko Kuroda has repeatedly dismissed the chance of withdrawing stimulus any time soon, some policymakers have recently expressed concerns over the perceived demerits of monetary easing, especially the hit on financial institutions’ profit margins.\n“The BOJ will need to reduce bond buying further. It also probably wants to steepen the yield curve, within the limit of not giving the impression that it is tightening its policy,” said Takehiro Noguchi, senior economist at Mizuho Research Institute.\nOn Tuesday, markets were surprised by the BOJ’s decision to reduce its purchases of 10 to 25 year JGBs and 25 to 40 JGBs paper by 10 billion yen each, from its previous operations, to 190 billion yen and 80 billion respectively.\nThe announcement has helped to lift the yen to six-week highs of 111.27 to the dollar on Wednesday from around 113.10 yen early on Tuesday. ($1 = 111.5800 yen)\nReporting by Hideyuki Sano; Editing by Shri Navaratnam\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-11T04:41:00.000+02:00", "crawled": "2018-01-11T05:34:27.012+02:00", "highlightTitle": ""}