{"organizations": [], "uuid": "d3b9bdc0f33078eeab38f4698307201b2b1c3f24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-rapid7-announces-pricing-of-public-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "Rapid7 Announces Pricing of Public Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-26T04:54:00.000+02:00", "replies_count": 0, "uuid": "d3b9bdc0f33078eeab38f4698307201b2b1c3f24"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-rapid7-announces-pricing-of-public-offering-of-common-stock.html", "ord_in_thread": 0, "title": "Rapid7 Announces Pricing of Public Offering of Common Stock", "locations": [], "entities": {"persons": [], "locations": [{"name": "boston", "sentiment": "none"}], "organizations": [{"name": "rapid7 announces pricing of public offering of common stock", "sentiment": "negative"}, {"name": "barclays capital inc.", "sentiment": "none"}, {"name": "rbc capital markets, llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON, Jan. 25, 2018 (GLOBE NEWSWIRE) -- Rapid7, Inc. (Nasdaq:RPD), a leading provider of analytics solutions for security and IT operations, announced today the pricing of an underwritten public offering of 5,180,000 shares of its common stock at a price to the public of $22.00 per share. Of the shares being offered, 1,500,000 are being offered by Rapid7 and the remaining 3,680,000 shares are being offered by existing stockholders. Certain of such existing stockholders have granted the underwriters a 30-day option to purchase up to an additional 770,000 shares of common stock in the offering at the public offering price. The gross proceeds to Rapid7 from the offering, before underwriting discounts and commissions and offering costs, are expected to be $33.0 million. Rapid7 intends to use the net proceeds from the proposed offering for working capital and general corporate purposes. The offering is expected to close on or about January 30, 2018, subject to satisfaction of customary closing conditions.\nBarclays Capital Inc. and RBC Capital Markets, LLC are acting as joint lead book-running managers for the offering. KeyBanc Capital Markets Inc. and Stifel, Nicolaus & Company, Incorporated are acting as book-running managers. Cowen and Company, LLC, Raymond James & Associates, Inc., William Blair & Company, L.L.C. and BTIG, LLC are acting as co-managers.\nThe securities described above are being offered pursuant to an effective shelf registration statement on Form S-3 that was declared effective by the Securities and Exchange Commission (the “SEC”) on June 2, 2017. The offering may be made only by means of a written prospectus and prospectus supplement that form a part of the registration statement. A final prospectus supplement and accompanying prospectus relating to the offering will be filed with the SEC and will be available on the SEC’s website at www.sec.gov . Copies of the final prospectus supplement and the accompanying prospectus, when available, may also be obtained by request from Barclays Capital Inc., c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717, by telephone: (888) 603-5847 or email: Barclaysprospectus@broadridge.com ; or from RBC Capital Markets, LLC, Attention Equity Syndicate, 200 Vesey Street, 8th Floor, New York, NY 10281-8098, by telephone: (877) 822-4089 or email: equityprospectus@rbccm.com .\nAbout Rapid7\nRapid7 (NASDAQ:RPD) is trusted by IT and security professionals around the world to manage risk, simplify modern IT complexity, and drive innovation. Rapid7 analytics transform today’s vast amounts of security and IT data into the answers needed to securely develop and operate sophisticated IT networks and applications. Rapid7 research, technology, and services drive vulnerability management, application security, incident detection and response, and log management for more than 7,000 organizations across more than 120 countries, including 52% of the Fortune 100.\nForward-Looking Statements\nThis press release includes certain disclosures which contain “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, including, without limitation, statements regarding our expectations regarding the anticipated closing of the public offering and the anticipated use of proceeds of the offering. The words “anticipate,” “believe,” “continue,” “estimate,” “expect,” “intend,” “may,” “will” and similar expressions are intended to identify forward-looking statements. Forward-looking statements are based on our current expectations and assumptions. Because forward-looking statements relate to the future, they are subject to inherent uncertainties, risks, and changes in circumstances that may differ materially from those contemplated by the forward-looking statements, which are neither statements of historical fact nor guarantees or assurances of future performance. Important factors that could cause actual results to differ materially from those in the forward-looking statements include risks related to the satisfaction of closing conditions and the anticipated use of proceeds from the offering, and other factors that are set forth in our filings with the U.S. Securities and Exchange Commission, including our Annual Report on Form 10-K and Quarterly Reports on Form 10-Q, under the caption “Risk Factors.” The forward-looking statements speak only as of the date made and, other than as required by law, we undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise.\nInvestor Contact\nJeff Bray, CFA\nVice President, Investor Relations\n857-990-4235\ninvestors@rapid7.com\nPress Contact\nRachel E. Adam\nDirector of Public Relations\n857-990-4136\npress@rapid7.com\nSource:Rapid7", "external_links": ["https://www.globenewswire.com/Tracker?data=6Y4b5OxIwSqgFr3hnWKMJDRwcttQ9CWl9F8ROMwCexpxlW8424MMcZr5K9DcXf4gXp16CK_s3tyKSV3W5WJ7Xa9Qy70IJooLrOroZCvcanK3TXxG5nkLhuw6wkqyNpcc", "https://www.globenewswire.com/NewsRoom/AttachmentNg/06ff63c6-b10c-4136-b7b8-ee70f03d0bfd", "https://www.globenewswire.com/Tracker?data=XHtE3B5j_5ei-EjbXfTGHJwgAd_8-x63jDHbDGu5R7DAJT0PLERDUFYBcCshKAm2OgP8qTcb6HEUdFaBBCIy97aZlARq3p67A2Pb_Q2Zl_rmeuCKkH-I4-Q29WhAWrfI"], "published": "2018-01-26T04:54:00.000+02:00", "crawled": "2018-01-26T08:20:09.036+02:00", "highlightTitle": ""}