{"organizations": [], "uuid": "8afc1c7feb092a696b392640943faf21796cd425", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/28/104618302-Millennials_laughing.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/17/which-generation-has-the-worst-credit-score-not-millennials.html", "country": "US", "domain_rank": 767, "title": "Which generation has the worst credit score? Not millennials", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T00:30:00.000+02:00", "replies_count": 0, "uuid": "8afc1c7feb092a696b392640943faf21796cd425"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/17/which-generation-has-the-worst-credit-score-not-millennials.html", "ord_in_thread": 0, "title": "Which generation has the worst credit score? Not millennials", "locations": [], "entities": {"persons": [], "locations": [{"name": "minneapolis", "sentiment": "none"}, {"name": "greenwood", "sentiment": "none"}, {"name": "miss.", "sentiment": "none"}], "organizations": [{"name": "federal reserve", "sentiment": "none"}, {"name": "usa today", "sentiment": "none"}, {"name": "experian", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Generation X continues to struggle with debt while millennials and baby boomers are making positive strides, according to a new report.\nExperian's State of Credit report paints a relatively healthy picture for Americans, with the average credit score rising from 673 to 675 over the 12 months ending last June, the highest since 679 in 2007, before the Great Recession began. Consumer confidence is up sharply and the Federal Reserve said this week that credit card debt hit a new record in November. That's a good sign for consumer spending but could spell trouble down the road if the economy and labor market weaken.\nMore from USA Today:\nMinneapolis tops list of cities with best average credit score, Greenwood, Miss., at the bottom\nRetirement crisis: 37% of Gen X say they won't be able to afford to retire\nCredit card debt hits new record, raising warning sign\nSome age groups are handling debt and managing their creditworthiness better than others, according to the credit reporting agency. Here's a rundown. ( Note: the precise range of generations is often debated. This story reflects how Experian defined the ranges for its research).\nshow chapters The biggest mistake millennials are making is not buying a home, says financial expert 11:07 AM ET Thu, 4 Jan 2018 | 01:06 Generation Z (Age 18-20) Average credit score: 634\nThis group is just establishing credit but is off to a good start. They have an average of just 1.44 credit cards per person, less than half the U.S. average, and a typical credit card balance of $2,047, less than a third of the national average. Yet they seem to be taking on more student loan debt than prior generations at their age as college tuition costs continue to ratchet higher, says Kelley Motely, Experian's director of analytics.\nMillennials (Age 21-34) Average credit score: 638\nMany graduated from college during or shortly after the Great Recession, which ended in 2009. That forced many to take lower-paying jobs, setting back their careers. But they're digging out. Their average credit score climbed four points from 2016 — the most of any generation — to 638 and they shaved their overall average debt by 8 percent to $222,000. They've also increased their average mortgage debt by 6 percent to $198,303, giving many who had put off home purchases an opportunity to build wealth.\n\"The economy has improved and they are positioned to improve their financial standing,\" says Rod Griffin, director of public education for Experian.\nshow chapters This is how millennials can catch up to the boomer generation 3:00 PM ET Mon, 15 May 2017 | 00:56 Generation X (age 35-49) Average credit score: 658\nThey're saddled with the highest average mortgage debt of all the age groups at $231,774. Many probably bought homes at the peak of the housing bubble, including expensive houses in higher-income neighborhoods that boasted good schools for their kids, Griffin says. Home values plummeted during the housing crisis before recouping much of those losses in recent years. This group also has a high rate of late debt payments at 0.54 percent and the most average non-mortgage debt at $30,334. Still, they too are making gains. Their average credit score rose 3 points from the prior year to 658.\nBaby boomers (age 50-70) Average credit score: 703\nThey still have substantial mortgage debt at an average $188,828, but that's less than Gen X as many Boomers pay off mortgages or downsize their homes. They're also in pretty good financial shape, with a low late payments rate of just 0.3 percent. The group's average credit score increased to 703 from 700 over the year.\nSilent generation (age 70-plus) Average credit score: 729\nTheir average mortgage debt is surprisingly high for their age at $156,705 but other debts are low, as is their late payment frequency of just 0.12 percent. Their average credit score of 729 is the highest.\nLike this story? Like CNBC Make It on Facebook !\nDon't miss: Why Gen Z responds differently to the success-predicting 'Marshmallow Test' than you would have\nThis article originally appeared on USA Today.\nshow chapters This 33-year-old CEO offers an unusual but much needed perk 11:39 AM ET Thu, 9 Feb 2017 | 00:50", "external_links": ["https://www.usatoday.com/story/money/2018/01/11/which-generation-has-most-debt-and-worst-credit-scores-hint-its-not-millennials/1021927001/", "https://www.experian.com/blogs/ask-experian/state-of-credit/", "https://www.usatoday.com/story/money/2018/01/10/retirement-crisis-37-gen-x-say-they-wont-able-afford-retire/1016739001/", "https://www.usatoday.com/story/money/2018/01/08/credit-card-debt-hits-new-record-raising-warning-sign/1014921001/", "https://www.facebook.com/CNBCMakeIt/", "https://www.usatoday.com/story/money/personalfinance/2018/01/11/experian-finds-new-year-marks-healthiest-credit-picture-u-s-consumers-since-2007-national-average-cr/1021764001/"], "published": "2018-01-18T00:30:00.000+02:00", "crawled": "2018-01-18T00:16:36.002+02:00", "highlightTitle": ""}