{"organizations": [], "uuid": "507bf2408f899e7c665ce86d700a462adad78401", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 149}, "facebook": {"likes": 159, "shares": 159, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220404758&w=1200&r=LYNXMPEE0802O", "site_section": "http://feeds.feedburner.com/reuters/topNews/", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-bitcoin-funds/fund-managers-say-u-s-regulator-told-them-to-suspend-bitcoin-bids-idUSKBN1EY045", "country": "US", "domain_rank": 408, "title": "Fund managers say bitcoin ETF proposals withdrawn due to SEC concern", "performance_score": 1, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T08:09:00.000+02:00", "replies_count": 0, "uuid": "507bf2408f899e7c665ce86d700a462adad78401"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-bitcoin-funds/fund-managers-say-u-s-regulator-told-them-to-suspend-bitcoin-bids-idUSKBN1EY045", "ord_in_thread": 0, "title": "Fund managers say bitcoin ETF proposals withdrawn due to SEC concern", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Two U.S. companies shelved proposals to launch bitcoin exchange-traded funds, citing ongoing concerns by the Securities and Exchange Commission (SEC), filings showed on Monday.\nStaff at the regulatory agency “expressed concerns regarding the liquidity and valuation” of futures contracts based on the digital asset, according to one of the filings.\nThe move adds a new hurdle to the bid by Wall Street firms to capitalize on investor interest in cryptocurrencies, and it opens a rare public divergence between two financial regulatory agencies over how to regulate them.\nTrusts controlled by Rafferty Asset Management LLC and Exchange Traded Concepts LLC each canceled plans to launch three bitcoin funds that could be traded by retail investors as easily as stocks. Neither firm could be reached for comment.\nFund managers thought the proposals had a chance at winning approval given the launch last month of futures contracts based on bitcoin on both the CME and the CBOE exchanges.\nRegulators have been scrambling to figure out how to deal with this relatively new asset, and no single one has control.\nA Bitcoin logo is seen on a cryptocurrency ATM in Santa Monica, California, U.S., January 4, 2018. REUTERS/Lucy Nicholson The SEC has dominion over funds, while the Commodity Futures Trading Commission (CFTC) governs futures contracts. The CFTC has been under pressure to address concerns it did not fully assess the potential risks that bitcoin poses to the financial system.\nBitcoin is a virtual asset that can be used to move money around the world quickly and with relative anonymity, without the need for a central authority, such as a bank or government. Trading has been expensive, difficult and fraught with wild price swings.\nThe SEC’s decisions also face close scrutiny given its power to clear the way for products that could be among the more volatile traded in U.S. equity markets.\nThe SEC and the CFTC could not immediately be reached for comment.\nOne of the ETFs being proposed would be designed to rise or fall in price twice as fast as the price of bitcoin on a given day. Over the last two years alone, bitcoin has gained or lost more than 10 percent on a single day 26 different times, according to data from the Bitstamp exchange.\nBitcoin’s price was little changed at about $15,000 Monday evening on the Bitstamp exchange.\n(Adds dropped word ‘changed’ in final paragraph)\nReporting by Trevor Hunnicutt; Editing by Clive McKeef\n ", "external_links": [], "published": "2018-01-09T08:09:00.000+02:00", "crawled": "2018-01-09T09:41:24.262+02:00", "highlightTitle": ""}