{"organizations": [], "uuid": "73b455055338e26f414f1414715122e5e3bc7df4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-venezuela-looting/lootings-scattered-protests-hit-venezuelan-industrial-city-idUSKBN1EY2DV", "country": "US", "domain_rank": 408, "title": "Lootings, scattered protests hit Venezuelan industrial city", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T21:31:00.000+02:00", "replies_count": 0, "uuid": "73b455055338e26f414f1414715122e5e3bc7df4"}, "author": "", "url": "https://www.reuters.com/article/us-venezuela-looting/lootings-scattered-protests-hit-venezuelan-industrial-city-idUSKBN1EY2DV", "ord_in_thread": 0, "title": "Lootings, scattered protests hit Venezuelan industrial city", "locations": [], "entities": {"persons": [{"name": "erika garcia", "sentiment": "none"}, {"name": "maria ramirez", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}, {"name": "ciudad guayana", "sentiment": "none"}], "organizations": [{"name": "national guard", "sentiment": "none"}, {"name": "ciudad guayana", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 7:32 PM / Updated 11 minutes ago Lootings, scattered protests hit Venezuelan industrial city Maria Ramirez 3 Min Read \nCIUDAD GUAYANA, Venezuela (Reuters) - A second day of lootings and scattered street protests hit the Ciudad Guayana in southeastern Venezuela on Tuesday, as unrest grows in the once-booming industrial city plagued with food shortages and a malaria outbreak. \nAt least five food stores were looted overnight, with police sources saying some 20 people had been arrested. Angry Venezuelans also blocked three major roads to demand anti-malaria medicine, food, cooking gas and spare parts for trucks. \nThere has been increasing unrest around the South American OPEC member in the last few weeks as a fourth straight year of painful recession and the world’s highest inflation leaves millions unable to eat enough. \nErika Garcia tearfully recounted how looters ransacked her food shop and home just 10 minutes after National Guard soldiers who had been patrolling the area withdrew late on Monday night. \n“They stole everything. They broke off the water pipes, they ripped off the toilet bowl, they took away the windows, the fences, the doors, the beds. Everything. They did not kill us because we ran, but they did beat us up,” said Garcia, 38, who planned to sleep at a relative’s house on Tuesday night \nShe said there was no way she could reopen her store. \nThe overnight lootings follow at least four similar in the early hours of Monday. Around 10 liquor stores were also looted on Christmas day in southeastern Bolivar state, according to the local chamber of commerce head Florenzo Schettino. [nL1N1OQ0V9] \nCritics blame President Nicolas Maduro and the ruling Socialist Party for Venezuela’s economic mess, saying they have persisted with failed statist policies for too long while turning a blind eye to rampant corruption and suffering. \nThe government says it is the victim of an “economic war” by political opponents and right-wing foreign powers, intent on bringing down Maduro in a coup. The Information Ministry did not respond to a request for comment about the lootings on Tuesday. \nThe wave of plunder has spooked many in Ciudad Guyana, leading more people to stay indoors come nightfall and dissuading some stores from opening. \nMetal worker Alvaro Becerra lives near a store that was ransacked overnight. \n“We lived a night of terror,” said Becerra, 52, adding he heard gunshots and saw people carrying a freezer full of food. \n“Today everything is closed. There’s no place to buy. The only people who are working are those who sell vegetables,” he said. Reporting by Maria Ramirez; Writing by Alexandra Ulmer; Editing by Lisa Shumaker", "external_links": [], "published": "2018-01-09T21:31:00.000+02:00", "crawled": "2018-01-09T21:44:15.001+02:00", "highlightTitle": ""}