{"organizations": [], "uuid": "4aa7e47aeaaf133f08feb0ae841312d8adebd1ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-jubilant-draximage-receives-approval-for-new-pulmonary-indications-from-theu-s-food-and-drug-administration-for-draximagea.html", "country": "US", "domain_rank": 767, "title": "Jubilant DraxImage receives approval for new pulmonary indications from the U.S. Food and Drug Administration for DRAXIMAGE® DTPA", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-02T18:45:00.000+02:00", "replies_count": 0, "uuid": "4aa7e47aeaaf133f08feb0ae841312d8adebd1ed"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-jubilant-draximage-receives-approval-for-new-pulmonary-indications-from-theu-s-food-and-drug-administration-for-draximagea.html", "ord_in_thread": 0, "title": "Jubilant DraxImage receives approval for new pulmonary indications from the U.S. Food and Drug Administration for DRAXIMAGE® DTPA", "locations": [], "entities": {"persons": [], "locations": [{"name": "montreal", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "u.s. food and drug administration", "sentiment": "neutral"}, {"name": "draximage inc.", "sentiment": "neutral"}, {"name": "fda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Montreal, QC, Jan. 02, 2018 (GLOBE NEWSWIRE) -- Jubilant DraxImage Inc. (“DraxImage”), a Jubilant Pharma wholly-owned subsidiary, is pleased to announce approval of new pulmonary indications for DRAXIMAGE® DTPA (Kit for the Preparation of Technetium Tc 99m Pentetate Injection) from the U.S. Food and Drug Administration (FDA).\nDRAXIMAGE DTPA is a widely-used nuclear medicine imaging agent that has now received the expanded indication for lung ventilation assessments.\nSpecifically, DRAXIMAGE DTPA is a kit for the preparation of Technetium Tc99m pentetate injection. Technetium Tc99m pentetate is a radioactive diagnostic agent indicated for: Brain imaging in adults by intravenous injection; Renal visualization, assessment of renal perfusion, and estimation of glomerular filtration rate in adult and pediatric patients by intravenous injection; Lung ventilation imaging, and evaluation of pulmonary embolism, when paired with perfusion imaging in adult and pediatric patients when administered by nebulizer for inhalation. This product is immediately available in the US market.\nThis expanded labeling provides flexibility to clinicians and enhances the broad utility of DRAXIMAGE DTPA to potentially include clinical applications to image and diagnose key functional aspects of the pulmonary system. Depending upon their patient evaluation, this will allow physicians to consider lung ventilation studies for a much larger patient population suffering from compromised pulmonary function. DraxImage and Jubilant Pharma Senior Vice-President of Medical & Regulatory Affairs and Chief Medical Officer, Dr. Norman LaFrance stated, “Jubilant DraxImage is very proud of this latest FDA approval and with the newly approved pulmonary indications, DRAXIMAGE DTPA will be more useful and valuable as a diagnostic imaging agent.”\n“This recent FDA approval further demonstrates the continued commitment by Jubilant DraxImage to the sustainability and further investment in the field of nuclear medicine. Our goal is to grow SPECT and PET imaging globally as part of our company’s continued mission to bring value to products that enable physicians to deliver high quality diagnostic imaging studies,” commented Mike Rossi, Jubilant DraxImage President.\nDRAXIMAGE® DTPA is available to all US customers, today. For further information please contact DraxImage Customer Service at: 1-888-633-5343 or customerservice@draximage.com\n please contact:\nMr. James A. Kaufman\nVice President, Marketing\nJubilant DraxImage, Inc.\njkaufman@jdi.jubl.com\nwww.draximage.com\nDRAXIMAGE® DTPA (Kit for the Preparation of Technetium Tc 99m Pentetate Injection)\nNew Indications and Usage:\nDRAXIMAGE® DTPA is a kit for the preparation of Technetium Tc 99m pentetate injection. Technetium Tc 99m pentetate is a radioactive diagnostic agent indicated for: Brain imaging in adults by intravenous injection; Renal visualization, assessment of renal perfusion, and estimation of glomerular filtration rate in adult and pediatric patients by intravenous injection; Lung ventilation imaging, and evaluation of pulmonary embolism, when paired with perfusion imaging, in adult and pediatric patients when administered by nebulizer for inhalation.\nImportant Safety Information : This product is contraindicated for patients with hypersensitivity to any component of this product. Contents of the reaction vial are intended only for use in the preparation of Technetium Tc 99m Pentetate Injection and are NOT to be administered directly to the patient.\nPlease consult full Prescribing Information for DRAXIMAGE DTPA at http://www.draximage.com/wp-content/uploads/2016/11/DTPA-PI-Dec-2017.pdf.\nAbout Jubilant DraxImageJubilant\nDraxImage Inc., a subsidiary of Jubilant Life Sciences, develops, manufactures and commercializes radiopharmaceuticals used for the diagnosis and treatment of disease. The company is dedicated to nuclear medicine and serves customers and through them patients, globally, with high quality and reliable products and services. The company is the market leader in North America for I-131 products (diagnosis and treatment of thyroid disorder and cancer), MAA (lung perfusion imaging), DTPA (renal, Brain imaging) and MDP (bone imaging), and also markets other products such as Sestamibi (myocardial perfusion imaging), Gluceptate (brain and renal imaging), and Rubidium-82 Generator (PET Cardiology). The company also has a strong development pipeline of new products.\nAttachments:\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/93175dde-3fcd-4736-a293-5a6215bba520\nDonna Schork Jubilant DraxImage 5146948220 donna.schork@jdi.jubl.com\nSource: Jubilant DraxImage", "external_links": ["https://www.globenewswire.com/Tracker?data=nVFlmqWqIn9Nml1mvn7hSCCskKymNncULxyxyi1Ql-j8DneQrQKPPY9x-8kMpFJs7tzK2sSHbtC_o9bBrk_t4Z25JiXsJX_ieLMVYERbooM=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/93175dde-3fcd-4736-a293-5a6215bba520/en", "http://www.globenewswire.com/NewsRoom/AttachmentNg/93175dde-3fcd-4736-a293-5a6215bba520", "https://www.globenewswire.com/Tracker?data=qGmfvGdRn98Mub5WvZWJ0IRpqv3dGHx5a38ArZVr40MRdnY_xBidLocmJEljIW3JgJZZSPafmtEFO1IHyuTcmqJl3jfXNgagyL3HLq_dSnlReAr-cyGD5l1eflhYOGCV", "http://www.draximage.com/wp-content/uploads/2016/11/DTPA-PI-Dec-2017.pdf.", "https://www.globenewswire.com/Tracker?data=TiCeyqbch9PzavPIzoFZ86IuGppc8GT3If45ffpA3P8tK1Ke2xg71nqTWRJu3QNPR26SeguBGiAf0z4Hr9zOVT9AdX3TciJFKZwZjPmNm49mtJ-AokzTblOUJ_MT17kc4bY9waBlUGCW06Qqom3a2XiQW_KftnUGl6DZT0Rp-HCyT-cyv5_BuvujdALE0d1wQFZlnxXANs_0izvkGexRE49REKl0HQj53PEd_XNR33vH2n2sG4ibdWlTLf5DOCIR7HRMdqFDc0e-m1L6Osudbg==", "https://www.globenewswire.com/Tracker?data=TiCeyqbch9PzavPIzoFZ87kDjGAPBHaWYrnA9Waof2y_FAdN9BtB7YmDO62g17vuPrs2FETPd5Pu0TmkWn2axPzEOZm2DlEgxr8B3PuxeK0jlKO1ZtbC-q26TZspaGlfADrH4Mc5NgiFwMTa-vsTjRw_kWLnZcy057hRCIiE5R4hZW7kfuo5_6tZEMDC-mut6zIebdBq7KzDHPIs9uipcOVAWiNxYXL6fnbaHR9yOeo="], "published": "2018-01-02T18:45:00.000+02:00", "crawled": "2018-01-02T19:09:15.029+02:00", "highlightTitle": ""}