{"organizations": [], "uuid": "cbb7153d49624bc785e4cadb1ea586fc3b68e443", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-dexko-global-acquires-the-assets-of-kodiak-products-company-inc-kodiak.html", "country": "US", "domain_rank": 767, "title": "DexKo Global Acquires the Assets of Kodiak Products Company, Inc. (\"Kodiak\")", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-22T22:30:00.000+02:00", "replies_count": 0, "uuid": "cbb7153d49624bc785e4cadb1ea586fc3b68e443"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-dexko-global-acquires-the-assets-of-kodiak-products-company-inc-kodiak.html", "ord_in_thread": 0, "title": "DexKo Global Acquires the Assets of Kodiak Products Company, Inc. (\"Kodiak\")", "locations": [], "entities": {"persons": [{"name": "dexter", "sentiment": "none"}, {"name": "fred bentley", "sentiment": "none"}, {"name": "bentley", "sentiment": "none"}], "locations": [{"name": "ind.", "sentiment": "none"}, {"name": "elkhart", "sentiment": "none"}, {"name": "tx", "sentiment": "none"}, {"name": "kodiak", "sentiment": "none"}, {"name": "ft. worth", "sentiment": "none"}], "organizations": [{"name": "dexko global inc.", "sentiment": "negative"}, {"name": "kodiak products company, inc.", "sentiment": "neutral"}, {"name": "kps", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ELKHART, Ind., Jan. 22, 2018 /PRNewswire/ -- DexKo Global Inc., a global leader in highly engineered trailer running gear, chassis assemblies and related components is pleased to announce that its subsidiary, Dexter, has acquired Kodiak, based out of Ft. Worth, TX. Kodiak is a manufacturer of light and medium duty axle brakes serving the marine, RV, horse, commercial, industrial, cargo, and select military market segments.\n\"We are excited to add the well-known, premium brake brand, Kodiak, to the Dexter portfolio,\" stated Fred Bentley, CEO of DexKo Global. \"Combining our companies will collectively offer our customers the best trailer components and service in the trailer industry.\" Bentley added, \"As we carry out our DexKo 2020 plan, we continue to see opportunities to improve our product offering through the type of value-added acquisitions that we have recently announced. Our new owner, KPS, is providing full support to add highly engineered and high growth products to our globally leading running gear product offering.\"\n\"Kodiak has built a recognized brand, positioned as a leader of disc brakes, over the last several decades,\" adds Adam Dexter, President and CEO of Dexter. \"Adding additional products to the Dexter product line up will further enhance our ability to service our customers.\"\nDexter, headquartered in Elkhart, Indiana, employs over 2,400 people in the U.S. and Canada, and operates 15 manufacturing facilities.\n\"We are delighted to join the Dexter team and look forward to uniting our best practices to offer our combined customers the best trailer products and exceptional customer service,\" said Cameron Rapp, President of Kodiak.\nDexKo Global is a portfolio company of KPS Capital Partners, LP (\"KPS\"). KPS is the manager of the KPS Special Situations Funds, a family of investment funds with approximately $5.2 billion of assets under management.\nPlease send inquiries to:\n2900 Industrial Parkway East\nStacey K Miller, Brand & Communications Manager\nElkhart, Indiana 46515\nsmiller@dexteraxle.com\nPhone: 574.295.7888\nPhone: 574.296.7228\nFax: 574.296.7368\nDexter has been a leading manufacturer of trailer axles and trailer brakes for over 50 years for the utility trailer, recreation vehicle, heavy duty, manufactured housing, agricultural, marine, and specialty trailer markets. Dexter products are American made in highly automated manufacturing facilities in Indiana, Georgia, Oklahoma, California, Tennessee, Texas, Florida, Ontario, and Alberta. Since 1960, OEMs have installed more than 50 million Dexter axles with the assurance that they are providing a quality product that will enhance the safe operation of their trailers. Dexter Axle is ISO 9001:2015 certified. Dexter is a wholly owned subsidiary of DexKo Global, Inc. For more information visit www.dexteraxle.com and www.dexko.com .\nKPS is the manager of the KPS Special Situations Funds, a family of investment funds with approximately $5.2 billion of assets under management. For over two decades, the Partners of KPS have worked exclusively to realize significant capital appreciation by making controlling equity investments in manufacturing and industrial companies across a diverse array of industries, including basic materials, branded consumer, healthcare and luxury products, automotive parts, capital equipment and general manufacturing. KPS creates value for its investors by working constructively with talented management teams to make businesses better, and generates investment returns by structurally improving the strategic position, competitiveness and profitability of its portfolio companies, rather than primarily relying on financial leverage. The KPS Funds' portfolio companies have aggregate annual revenues of over $6.8 billion, operate 162 manufacturing facilities in 30 countries, and employ over 51,000 associates, directly and through joint ventures worldwide. The KPS investment strategy and portfolio companies are described in detail at www.kpsfund.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/dexko-global-acquires-the-assets-of-kodiak-products-company-inc-kodiak-300586016.html\nSOURCE DexKo Global Inc.", "external_links": ["http://www.kpsfund.com/", "http://www.dexko.com/", "http://www.prnewswire.com/news-releases/dexko-global-acquires-the-assets-of-kodiak-products-company-inc-kodiak-300586016.html", "http://www.dexteraxle.com/"], "published": "2018-01-22T22:30:00.000+02:00", "crawled": "2018-01-22T23:20:06.000+02:00", "highlightTitle": ""}