{"organizations": [], "uuid": "aabe864cb4f2f875647e0c0166332b8069811308", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/12/104943076-Zeman_Drahos.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/12/czech-elections-voters-head-to-the-polls-to-elect-next-president.html", "country": "US", "domain_rank": 767, "title": "Czech elections: Voters head to the polls to elect next president", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T16:27:00.000+02:00", "replies_count": 0, "uuid": "aabe864cb4f2f875647e0c0166332b8069811308"}, "author": "Sam Meredith", "url": "https://www.cnbc.com/2018/01/12/czech-elections-voters-head-to-the-polls-to-elect-next-president.html", "ord_in_thread": 0, "title": "Czech elections: Voters head to the polls to elect next president", "locations": [], "entities": {"persons": [{"name": "milos zeman", "sentiment": "none"}, {"name": "zeman", "sentiment": "none"}], "locations": [{"name": "czech republic", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "prague castle", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Czech Republic voters will go to the polls this weekend, in a presidential election widely regarded as a referendum on the country's western alliance.\nWith voting in the first of a two-round election taking place on Friday and Saturday, opinion polls have shown the outspoken anti-immigration incumbent currently leads the field.\nWho is the favorite? During his five-year tenure to date, President Milos Zeman has become known for his plain-speaking nature and tough opposition to Muslim integration. The 73-year-old is also seen as receptive to authoritarian regimes, while becoming one of Russia's most dependable allies in Europe.\nWhile he was once considered to be in favor of the European Union (EU) — even flying the European flag at Prague Castle a month after his election — Zeman has since become one of the EU's most vocal critics. The Czech president's views on the conflict in Ukraine as well as the continent's migrant crisis are in stark contrast to the European mainstream.\nZeman's first term in office has been divisive on several fronts, from his opposition to EU-mandated immigration quotas to building security barriers around Prague Castle. In a 2015 Christmas message, Zeman described the ongoing influx of migrants in Europe as an \"organized invasion.\"\nThe Czech Republic is a member of a regional alliance of Central European nations called the Visegrad Group, alongside Hungary, Poland and Slovakia. In recent years, the increasingly right-wing alliance has moved away from progressive European integration and toward the policy of protecting native-born citizens.\nRe-election for Zeman would give one of Europe's most ardent Euroskeptic leaders a platform for another five years.\nWhat about the main challengers? Unless one of the candidates wins more than 50 percent of the vote in the first round, a run-off election between the top two candidates will take place at the end of the month. And the two most prominent political rivals to Zeman are both strongly linked to EU and NATO membership.\nJiri Drahos, a 68-year-old liberal independent, is likely to be the most serious contender. Drahos is a staunchly pro-European candidate in a country where opposition to the EU has been growing. Nonetheless, the former president of the Czech Academy of Sciences has campaigned for Prague to play a more active role in the bloc.\nMichal Fludra | NurPhoto via Getty Images Meanwhile, another contender for the presidency is pop music lyricist Michal Horacek. The 65-year-old, who has financed his own campaign, is seen as a pro-EU left-of-center candidate. The former co-owner of a betting agency is a distant third in the polls.\nWho will win? The incumbent is likely to win the first round with close to 40 percent of the votes but the \"anti-Zeman vote\" in the second round should ultimately help Drahos clinch the presidency, Emily Mansfield, lead Czech Republic analyst at the Economist Intelligence Unit (EIU), told CNBC Friday.\n\"People either love Zeman or hate him … So his best chance of winning is to get 50 percent of the vote in the first round,\" Mansfield added.\nIn a Czech television poll published Monday, Drahos is seen unseating the president with 48.5 percent of the second round vote to Zeman's 44 percent. In the same poll, Zeman was expected to receive 42.5 percent of the vote in the first round, compared to Drahos' 27.5 percent.\nWhat are the president's powers? Under the Czech constitution, the president has the authority to choose the prime minister and to appoint members of the central bank. The somewhat ceremonial position also affords the power to pick judges for the country's Constitutional Court, on the basis of parliamentary approval.\nAside from that, the country is largely run by the government chosen and led by the newly elected prime minister. Populist billionaire Andrej Babis, an ally of Zeman, was elected to office in October last year.\nGetty Images Prague, Old Town Hall (15th Century), Town Square and Church of our Lady Tyn (1365) at dawn.", "external_links": ["https://ru-clip.com/video/JGc3v56_ZZY/what-is-nato-cnbc-explains.html"], "published": "2018-01-12T16:27:00.000+02:00", "crawled": "2018-01-12T15:38:50.000+02:00", "highlightTitle": ""}