{"organizations": [], "uuid": "0b6f4f93b31b16ba88889fa117904588da460597", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/20/the-associated-press-the-latest-schumer-says-trump-backed-off-deal.html", "country": "US", "domain_rank": 767, "title": "The Latest: Schumer says Trump 'backed off' deal", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T07:01:00.000+02:00", "replies_count": 0, "uuid": "0b6f4f93b31b16ba88889fa117904588da460597"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/20/the-associated-press-the-latest-schumer-says-trump-backed-off-deal.html", "ord_in_thread": 0, "title": "The Latest: Schumer says Trump 'backed off' deal", "locations": [], "entities": {"persons": [{"name": "schumer", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "chuck schumer", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mcconnell", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — The Latest on the budget battle in Congress (all times local):\n12:50 p.m.\nSenate Minority Leader Chuck Schumer is accusing President Donald Trump of reneging on a deal he thought they had neared on immigration and spending.\nThe New York Democrat said on the Senate floor that after a White House meeting Friday with Trump, he thought \"in my heart\" that senators could complete an agreement by evening. He says he \"reluctantly\" offered concessions on Trump's long-sought border wall with Mexico in exchange for strong protections for young immigrants.\nSchumer says Trump didn't try selling the accord to congressional Republican leaders, who wouldn't accept it. Schumer says Trump \"backed off at the first sign of pressure.\"\nSchumer says of Trump: \"It's almost as if you were rooting for a shutdown. Well, now we'll have one.\"\n12:45 p.m.\nSenate Majority Leader Mitch McConnell says he will seek to halt a shutdown with a proposal to fund the government through Feb. 8.\nMcConnell's comments from the Senate floor came shortly after a measure to extend funding through Feb. 16 failed. That triggered a government shutdown at midnight Friday.\nMcConnell says Feb. 8 is \"a very reasonable time\" and pushes the matter beyond President Donald Trump's Jan. 30 State of the Union address.\nIt's unclear how quickly lawmakers might vote on McConnell's proposal. It's also uncertain if shrinking the timeframe of a short-term agreement from four weeks to three weeks will draw enough votes to reopen the government.\n12:30 a.m.\nVice President Mike Pence Pence is blasting Democrats for the congressional failure to keep the government open.\nPence has been briefed on the government shutdown as he flies across the Atlantic Ocean to the Middle East.\nIn a statement, he says: \"Our administration will do everything within our power to support the brave men and women in uniform who stand on the frontlines of freedom. But as of tonight, due to a completely avoidable government shutdown, they'll stand their post without pay.\"\nPence was briefed on the shutdown by his chief of staff, Nick Ayers. The White House says Pence will continue his trip to Egypt, Jordan and Israel despite the lapse in federal funding, because it is \"integral\" to U.S. national security and diplomacy.\n12:15 a.m.\nThe final Senate vote on a Republican bill aimed at preventing a federal shutdown is in, and it's 10 votes short.\nFriday's late-night vote means a government closure is under way. There have been no clear public signs that the two parties have significantly narrowed their disputes over immigration and the budget.\nThe House approved the measure Thursday over Democratic opposition. It would have kept agencies afloat through Feb. 16, but Democrats wanted a package lasting just days in hopes of intensifying pressure on the GOP to compromise.\nRepublicans control the Senate 51-49. The GOP needed 60 votes to prevail, but the tally was 50-49.\nFive Democrats voted in favor of the measure. Five Republicans voted against it.\n12:01 a.m.\nThe White House says it will not negotiate with the Democrats on immigration until the end of the federal government shutdown.\nWhite House Press Secretary Sarah Huckabee Sanders says in a statement that, \"We will not negotiate the status of unlawful immigrants while Democrats hold our lawful citizens hostage over their reckless demands.\"\nShe adds, \"When Democrats start paying our armed forces and first responders we will reopen negotiations on immigration reform.\"\nThe government shut down at midnight after Congress failed to pass a spending deal.\nSanders says, \"Senate Democrats own the Schumer Shutdown,\" adding, \"This is the behavior of obstructionist losers, not legislators.\"\n12 midnight\nThe U.S. government shut down at midnight after Congress failed to resolve a partisan standoff over immigration and spending.\nIn a late-night vote, Senate Democrats joined to block a bill that would have kept the government running for another four weeks. A flurry of last-minute negotiations failed to beat the deadline.\nDemocrats have tried to use the Friday night funding deadline to win concessions from Republicans, including an extension of an Obama-era program protecting some young immigrants from deportation. The program is set to expire in March. Republicans sought more time for talks, but Democrats refused.\nThe shutdown is only the fourth government closure in a quarter-century. It will only partially curb government operations. Uniformed service members, health inspectors, and law enforcement officers are set to work without pay.\n11:59 p.m.\nMany of the immediate effects of the government shutdown will be muted for most Americans, as it comes on a Friday night.\nSocial Security and most other safety net programs are unaffected by the lapse in federal spending authority. Critical government functions will continue, with uniformed service members, health inspectors and law enforcement officers set to work without pay.\nBut if no deal is brokered before Monday, hundreds of thousands of federal employees are set to be furloughed.\nThe White House and Capitol Hill will be working with skeleton staffs, but some government agencies, like the Environmental Protection Agency, have said they were able to shift funding around to keep most workers on the job. National parks and federal museums will be open, but with potentially reduced services.\n11 p.m.\nSenate Democrats appear to have derailed a Republican bill aimed at preventing a federal shutdown set to begin as soon as the calendar flips to Saturday.\nFriday's late-night vote means at least a short government closure is all but unavoidable. There have been no clear public signs that the two parties have significantly narrowed their disputes over immigration and the budget.\nThe House approved the measure Thursday over Democratic opposition. It would keep agencies afloat through Feb. 16, but Democrats want a package lasting just days in hopes of intensifying pressure on the GOP to compromise.\nRepublicans control the Senate 51-49. The GOP needed 60 votes to prevail, but the tally was 50-48 as of 11 p.m. Eastern time. The Senate is awaiting a final vote from Majority Leader Mitch McConnell.\n10:30 p.m.\nThe Trump administration will exempt several hundred presidential staffers from mandatory furloughs if the government shuts down at midnight.\nContingency plans released Friday night show that 659 Executive Office of the President staffers would be allowed to report to duty because they are considered essential workers. More than 1,000 of 1,700 staffers would be furloughed.\nThe number is higher than the Obama administration, which deemed 545 staffers essential in 2015.\nThe Executive Office of the President includes those who work in White House Office, the Office of the Vice President and the National Security Council, among others.\n9:30 p.m.\nPresident Donald Trump says efforts to avert a government shutdown are \"Not looking good.\"\nTrump says in a tweet late Friday even", "external_links": [], "published": "2018-01-20T07:01:00.000+02:00", "crawled": "2018-01-20T08:16:05.021+02:00", "highlightTitle": ""}