{"organizations": [], "uuid": "7d63362417db962665c141cb478d61397b469942", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222612900&w=1200&r=LYNXMPEE0G068", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-hyundai-motor-grab-breakingviews/breakingviews-ubers-next-ride-share-could-be-in-southeast-asia-idUSKBN1F60BX", "country": "US", "domain_rank": 408, "title": "Uber's next ride-share could be in Southeast Asia", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-17T11:41:00.000+02:00", "replies_count": 0, "uuid": "7d63362417db962665c141cb478d61397b469942"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-hyundai-motor-grab-breakingviews/breakingviews-ubers-next-ride-share-could-be-in-southeast-asia-idUSKBN1F60BX", "ord_in_thread": 0, "title": "Uber's next ride-share could be in Southeast Asia", "locations": [], "entities": {"persons": [{"name": "jek", "sentiment": "none"}, {"name": "dara khosrowshahi", "sentiment": "none"}, {"name": "yandex", "sentiment": "none"}, {"name": "didi", "sentiment": "none"}, {"name": "app annie", "sentiment": "none"}], "locations": [{"name": "southeast asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "southeast asia singapore", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "myanmar", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "organizations": [{"name": "softbank", "sentiment": "none"}, {"name": "brooks entwistle", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SINGAPORE (Reuters Breakingviews) - Uber’s next ride-share could be in Southeast Asia. After struggling in China and Russia, the app operator swapped its businesses there for a stake in Didi and a joint venture with Yandex. Another sensible partner would be Grab, which shares a backer in SoftBank.\nThe stretch from Indonesia to Myanmar is a huge market. With few barriers to entry and a number of logistical problems to resolve, though, Uber rivals such as Singapore-based Grab and Indonesia’s Go Jek have grown quickly. They confronted the region’s chaotic traffic and attracted less affluent clients. Uber, by comparison, took longer to accept cash, for example.\nAll are paying a hefty price to compete. Grab’s aggressive push into 168 cities and a lead position with double Uber’s growth in app downloads last year, according to data from App Annie, has not come cheap. Uber, which is building out in the region under former Goldman Sachs executive Brooks Entwistle, argues its expansion is more sustainable.\nIts broader challenge is Chief Executive Dara Khosrowshahi’s plan for an initial public offering in 2019. In addition to cleaning up a slew of past scandals, he will have to point to a stronger income statement. A wider net loss of some $1.5 billion in the third quarter suggests there is much work to be done.\nIn addition to offloading costly operations in places like China, Uber also recently dumped its car leasing business in Singapore. It merged with the city-state’s largest taxi operator in exchange for access to more drivers.\nIndia is another costly place to do business, but one that may hold greater promise for Uber. Following a similar playbook in Southeast Asia as in China, though, would make sense. In August 2016, Uber swapped its Chinese subsidiary for a roughly 20 percent stake in local rival Didi Chuxing.\nThere are risks inherent to such maneuvers. Local operators don’t always stay local. Grab, for example, could easily go global, and become an Uber competitor in, say, Australia, or beyond.\nContinuing to burn cash is hardly sustainable, though. And regional partnerships at least provide hedges of sorts. Uber’s route to the public markets warrants a detour in Southeast Asia.\nBreakingviews Reuters Breakingviews is the world's leading source of agenda-setting financial insight. As the Reuters brand for financial commentary, we dissect the big business and economic stories as they break around the world every day. A global team of about 30 correspondents in New York, London, Hong Kong and other major cities provides expert analysis in real time.\nSign up for a free trial of our full service at https://www.breakingviews.com/trial and follow us on Twitter @Breakingviews and at www.breakingviews.com . All opinions expressed are those of the authors.", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-17T11:41:00.000+02:00", "crawled": "2018-01-17T11:52:21.008+02:00", "highlightTitle": ""}