{"organizations": [], "uuid": "2107025a3178ab869ab3b365134150d4888540cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-fiscalnote-acquires-eu-regulatory-intelligence-leader-shungham.html", "country": "US", "domain_rank": 767, "title": "FiscalNote Acquires EU Regulatory Intelligence Leader Shungham", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-25T12:00:00.000+02:00", "replies_count": 0, "uuid": "2107025a3178ab869ab3b365134150d4888540cb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-fiscalnote-acquires-eu-regulatory-intelligence-leader-shungham.html", "ord_in_thread": 0, "title": "FiscalNote Acquires EU Regulatory Intelligence Leader Shungham", "locations": [], "entities": {"persons": [], "locations": [{"name": "shungham", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "eu regulatory intelligence leader shungham deal brings eu expertise & analysis", "sentiment": "negative"}, {"name": "fiscalnote customers", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "grm", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Deal Brings EU Expertise & Analysis to FiscalNote Customers and European State-Level Intelligence to Shungham Clients\nWASHINGTON & BRUSSELS & DAVOS-KLOSTERS, Switzerland--(BUSINESS WIRE)-- FiscalNote , the Washington, D.C.-based company that dramatically improves the way organizations engage with government, today announced at the World Economic Forum in Switzerland, its acquisition of Brussels-based Shungham , a provider of systematic regulatory and legislative intelligence about European Union issues through its flagship product “EU Issue Tracker”. The move expands FiscalNote’s international leadership in the government relationship management (GRM) sector where it already provides data on regulatory and legislative issues for EU Member States and more than 20 countries worldwide. As one of the largest companies in the global market, the combined organization will provide the most comprehensive legislative and regulatory data and workflows for the EU and its Member States.\nFounded in 2010 with a strong reputation for the highly-structured analysis and subject matter expertise EU regulatory issues require, Shungham’s EU Issue Tracker helps major global brands including Coca-Cola, L’Oreal, Nestle, Siemens, and BMW better understand potential regulation as it is being developed. With the most comprehensive data and analysis in a market where automated intelligence is difficult due to differing reporting requirements by country, Shungham provides a critical edge to its clients in strategic regulatory intelligence and compliance.\n“As the changes in the global political landscape are giving rise to new and evolving needs in political advocacy, our clients have been asking for more actionable intelligence about the EU and its member states, along with other strategic global regions,” said Tim Hwang, co-founder and CEO of FiscalNote and a WEF Technology Pioneer. “Shungham adds a much needed human element to our AI-powered intelligence that will give our clients more insight into legislative and regulatory issues at all stages of development. As we focus at the World Economic Forum about making connections in an evolving world, this deal will empower organizations worldwide to be more effective in their engagements with government and stay aware of global updates.”\nFiscalNote created the GRM category nearly two years ago with the first comprehensive engagement platform, services, and mobile application. The platform now includes data from 20 countries, and expects to rapidly expand across the world in 2018 in the hopes of one day reaching every country in the world. Shungham is the second acquisition announced in the last six months as FiscalNote attempts to grow its global presence and capabilities for its customers.\n“As Brexit nears, there is a rapidly growing need for strategic intelligence on both the EU and its Members States among our clients, and joining FiscalNote gives us the ability to rapidly scale our human-curation approach and apply automation for the first time,” said Michel Ehrlich, CEO of Shungham. “The combination of our depth of intelligence in this market along with FiscalNote’s collaboration and issues management tools will allow our clients to more easily take strategic action on issues that affect their business.”\nAbout FiscalNote\nFiscalNote is a leading technology innovator at the intersection of global business & government. With offices in DC, NYC, Baton Rouge, Seoul, India, and Brussels, the company has raised more than $43 million from prominent early-stage investors including Renren, First Round Capital’s Dorm Room Fund, Green Visor Capital, MoneyToday, Visionnaire Ventures, Perle Ventures, 645 Ventures, Steve Case, Mark Cuban and Jerry Yang/AME Cloud Ventures. FiscalNote has grown to become one of the largest privately held companies in the legal analytics space, powering 21.9 million users and 1,300 law firms, legal departments and governments across its platforms. FiscalNote is revolutionizing access to legislation, regulations and court cases for organizations around the world. Organizations — from small startups and non-profits to multinational corporations — that rely on FiscalNote’s revolutionary government relationship management (GRM) and grassroots advocacy solutions include Cargill, Toyota, Intel, Johnson & Johnson, the Pharmaceutical Care Management Association, Microsoft, PhRMA, Salesforce, the Consumer Technology Association, Anthem BlueCross BlueShield, Schlumberger, Macy’s, and the National Education Association.\nFiscalNote is a World Economic Forum Technology Pioneer.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005347/en/\nJulie Walsh, Finn Partners\n202-518-6489\nJulie.Walsh@FinnPartners.com\nSource: FiscalNote", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.fiscalnote.com&esheet=51748701&newsitemid=20180125005347&lan=en-US&anchor=FiscalNote&index=1&md5=7eeb7383363406ef843eddb7c7ffc269", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.shungham.com%2F&esheet=51748701&newsitemid=20180125005347&lan=en-US&anchor=Shungham&index=2&md5=73b41e8af147df0087a2b134ce333deb", "http://www.businesswire.com/news/home/20180125005347/en/"], "published": "2018-01-25T12:00:00.000+02:00", "crawled": "2018-01-25T12:30:45.011+02:00", "highlightTitle": ""}