{"organizations": [], "uuid": "bf14b61126cda53129e31ff1c5ae77e16f5889a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-silgan-holdings-elects-william-t-donovan-as-a-member-of-its-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Silgan Holdings Elects William T. Donovan as a Member of Its Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:30:00.000+02:00", "replies_count": 0, "uuid": "bf14b61126cda53129e31ff1c5ae77e16f5889a0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-silgan-holdings-elects-william-t-donovan-as-a-member-of-its-board-of-directors.html", "ord_in_thread": 0, "title": "Silgan Holdings Elects William T. Donovan as a Member of Its Board of Directors", "locations": [], "entities": {"persons": [{"name": "william t. donovan", "sentiment": "negative"}, {"name": "donovan", "sentiment": "none"}, {"name": "edward a. lapekas", "sentiment": "none"}, {"name": "lapekas", "sentiment": "none"}], "locations": [{"name": "conn.", "sentiment": "none"}, {"name": "stamford", "sentiment": "none"}], "organizations": [{"name": "silgan holdings", "sentiment": "negative"}, {"name": "silgan holdings inc.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "board of directors of the company", "sentiment": "none"}, {"name": "total logistics, inc.", "sentiment": "none"}, {"name": "board of rockland industrial holdings", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STAMFORD, Conn.--(BUSINESS WIRE)-- Silgan Holdings Inc. (Nasdaq:SLGN), a leading supplier of rigid packaging for consumer goods products, announced today that William T. Donovan has been elected as a member of the Board of Directors of the Company, filling the vacancy created when Edward A. Lapekas passed away last month. Mr. Donovan will serve as a Class III Director of the Company, completing Mr. Lapekas’ term which runs until the Company’s annual meeting of stockholders in 2018.\nMr. Donovan, 66, brings more than 40 years of business experience to the Company. Mr. Donovan was Chair of the Board of Rockland Industrial Holdings, LLC, a privately held manufacturer of wood flooring products for the truck trailer and container industries, until December 2014. Prior to that, Mr. Donovan was President, Chief Executive Officer and a director of Total Logistics, Inc., a company engaged in providing integrated logistic services, facility management and industrial product manufacturing that had been a publicly traded company listed on Nasdaq. Mr. Donovan also served as President, Chief Financial Officer and a director of Christiana Companies, Inc., a provider of warehousing and logistic services and manufacturer of drill pipe and downhole tools that had been a publicly traded company listed on the New York Stock Exchange, prior to its merger with Weatherford International, Inc. Prior to that, Mr. Donovan was a Principal and Managing Director of Lubar & Co., a private investment and venture capital firm. Prior to joining Lubar & Co., Mr. Donovan was an officer with Manufacturers Hanover Trust Company, now part of JPMorgan Chase & Co., where he specialized in merger and acquisition financing.\nMr. Donovan is also a director since 2008 and a member of various committees including the audit committee of Precision Drilling Corporation, a publicly traded company listed on the Toronto Stock Exchange and the New York Stock Exchange that provides onshore drilling and other services to the oil and natural gas industries, and prior to that was a director since 1997 and a member and chair of the audit committee of Grey Wolf, Inc., a publicly traded company that had been listed on the American Stock Exchange and that was an international land-based provider of contract drilling services to the oil and natural gas industries, until its acquisition by Precision Drilling Corporation in 2008. Mr. Donovan has also served as a director of several other private companies.\nSilgan is a leading supplier of rigid packaging for consumer goods products with annual net sales, on a pro forma basis to include the Dispensing Systems business which was acquired on April 6, 2017, of approximately $4.2 billion in 2016. Silgan operates 100 manufacturing facilities in North and South America, Europe and Asia. The Company is a leading supplier of metal containers in North America and Europe for food and general line products. The Company is also a leading worldwide supplier of metal and plastic closures and dispensing systems for food, beverage, health care, garden, home and beauty products. In addition, the Company is a leading supplier of plastic containers for shelf-stable food and personal care products in North America.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124005120/en/\nSilgan Holdings Inc.\nRobert B. Lewis, 203-406-3160\nSource: Silgan Holdings Inc.", "external_links": ["http://www.businesswire.com/news/home/20180124005120/en/"], "published": "2018-01-24T16:30:00.000+02:00", "crawled": "2018-01-24T19:13:19.010+02:00", "highlightTitle": ""}