{"organizations": [], "uuid": "b6a0f85d0c52fe230595a3529cb950bf591b7d82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223400489&w=1200&r=LYNXMPEE0I1CD", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-legacy/as-south-korea-counts-down-to-olympics-a-ghost-ski-resort-festers-idUKKBN1F827Y", "country": "US", "domain_rank": 408, "title": "As South Korea counts down to Olympics, a ghost ski resort festers", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T19:41:00.000+02:00", "replies_count": 0, "uuid": "b6a0f85d0c52fe230595a3529cb950bf591b7d82"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-legacy/as-south-korea-counts-down-to-olympics-a-ghost-ski-resort-festers-idUKKBN1F827Y", "ord_in_thread": 0, "title": "As South Korea counts down to Olympics, a ghost ski resort festers", "locations": [], "entities": {"persons": [], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 47 PM / Updated 19 minutes ago As South Korea counts down to Olympics, a ghost ski resort festers Reuters Staff 2 Min Read \nGANSEOUNG, South Korea (Reuters) - The chairs of an abandoned ski lift sit on a barren, ghostly mountainside in South Korea; like gravestones for what was one a vibrant holiday resort. \nAs the country prepares to host the 2018 Winter Olympics in a raft of new sporting venues, the abandoned Alps Ski Resort, only around 100 kilometres (60 miles) away, stands in grim contrast, as the future of South Korea’s new facilities remains uncertain. \nLocated close to the border with North Korea, the resort had been used for skiing since the period of Japan’s colonial rule in the early 20th century and was South Korea’s oldest when it closed its doors in 2006. \nIts decline was caused by a drop in the number of people taking part in skiing, a phenomenon that has continued since the resort’s closure. \nThe number of South Koreans skiing has been on the decline since 2012 from its peak around 6.8 million in the 2011-2012 winter ski season, according to data from the Ski Resort Business Association of Korea. Abandoned Alps Ski Resort is seen near the demilitarised zone separating the two Koreas in Goseong, South Korea, January 17, 2018. REUTERS/Kim Hong-Ji \nIn the 2016-2017 season around 4.8 million South Koreans took to the slopes. \nWhether local or national government will bear the cost of maintaining the 14 venues for the Pyeongchang Olympics after the games finish, is a matter of some debate.   \n“We are making our point that (these facilities) should be managed by the state,” Choi Moon-soon, the governor of Gangwon Province, which will host the 2018 Winter Olympics, told Reuters this week. \n“(The) ski jump slope, for instance: this won’t be used only by Gangwon and this will be barely used by anyone else except national athletes ... So we’re asking those who will use to pay for it.” \nWhether South Korea’s new and revamped Olympic venues will thrive, or face the same struggles that led to the Alps Ski Resort’s closure remains to be seen. \nBut the tattered buildings and piles of rubbish, including dozens of discarded toilet bowls, that litter the resort’s landscape are a reminder of the challenges the sport continues to face in South Korea. Writing by Mark Hanrahan in London; Editing by Robin Pomeroy", "external_links": [], "published": "2018-01-19T19:41:00.000+02:00", "crawled": "2018-01-19T20:06:47.027+02:00", "highlightTitle": ""}