{"organizations": [], "uuid": "16686cf33279bd4b91ba687cdeae41e1e2366968", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKCricketNews/", "section_title": "Reuters: Cricket News", "url": "https://uk.reuters.com/article/uk-cricket-test-zaf-ind-toss/india-win-toss-opt-to-bat-in-third-test-v-south-africa-idUKKBN1FD0QO", "country": "US", "domain_rank": 408, "title": "Cricket-India win toss, opt to bat in third test v South Africa", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T09:49:00.000+02:00", "replies_count": 0, "uuid": "16686cf33279bd4b91ba687cdeae41e1e2366968"}, "author": "", "url": "https://uk.reuters.com/article/uk-cricket-test-zaf-ind-toss/india-win-toss-opt-to-bat-in-third-test-v-south-africa-idUKKBN1FD0QO", "ord_in_thread": 0, "title": "Cricket-India win toss, opt to bat in third test v South Africa", "locations": [], "entities": {"persons": [{"name": "virat kohli", "sentiment": "none"}, {"name": "kohli", "sentiment": "none"}], "locations": [{"name": "south africa", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "johannesburg", "sentiment": "none"}, {"name": "johannesburg", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 8:10 AM / Updated 9 hours ago India win toss, opt to bat in third test v South Africa Reuters Staff 3 Min Read \nJOHANNESBURG (Reuters) - India captain Virat Kohli won the toss and elected to bat on a seamer-friendly wicket in the third test against South Africa at the Wanderers in Johannesburg on Wednesday. \nSouth Africa have   lead, but could complete a historic clean-sweep with victory at a ground dubbed ‘The Bullring’ and on a wicket that will suit their vaunted pace attack. \nIndia have not lost any of their four previous visits to Johannesburg though, with a win and three draws, and Kohli says they want to put pressure on the home side with a big first innings score. \n”There is a good grass covering on the pitch but the surface is nice and hard,“ Kohli said at the toss. ”It will be good to get some runs on the board. \n“We have played some really good cricket here, it should be a good contest again. We are up against a side that are really strong in their own conditions and they have proven that in the first two games.” \nIndia go into the test without a recognised spinner as seamer Bhuvneshwar Kumar takes the place of Ravichandran Ashwin, and middle-order batsman Ajinkya Rahane comes in for Rohit Sharma. \nSouth Africa have also selected an all-seam attack, with Andile Phehlukwayo taking the place of Keshav Maharaj as their only change from the second test. \nCaptain Faf du Plessis says they would have opted to bowl first had he won the toss. \n“We were thinking of having a bowl first, just wanting to get into their batting line-up in a series where our bowlers have been on top,” Du Plessis said. \n”Jo‘burg generally doesn’t spin, it is a ground where fast bowlers dominate. There is a lot of bounce and pace, so a lot of nicks behind. \n“We want to try and see if we can take a positive approach and put an extra seamer in.” \nTeams: \nSouth Africa: Dean Elgar, Aiden Markram, Hashim Amla, AB de Villiers, Faf du Plessis (captain), Quinton de Kock (wicketkeeper), Vernon Philander, Andile Phehlukwayo, Kagiso Rabada, Morne Morkel, Lungi Ngidi. \nIndia: Murali Vijay, Lokesh Rahul, Cheteshwar Pujara, Virat Kohli (captain), Ajinkya Rahane, Hardik Pandya, Parthiv Patel (wicketkeeper), Bhuvneshwar Kumar, Ishant Sharma, Jasprit Bumrah, Mohammed Shami. Reporting   John O'Brien", "external_links": [], "published": "2018-01-24T09:49:00.000+02:00", "crawled": "2018-01-24T10:16:47.010+02:00", "highlightTitle": ""}