{"organizations": [], "uuid": "4a567eb0d2a073df4533f7ec225be92affd2f626", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/cmed-ma-aurora-cannabis/canadian-cannabis-firm-aurora-in-talks-to-buy-both-cannimed-and-newstrike-sources-idUSL1N1PE1I4", "country": "US", "domain_rank": 408, "title": "Canadian cannabis firm Aurora in talks to buy both CanniMed and Newstrike -sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T22:39:00.000+02:00", "replies_count": 0, "uuid": "4a567eb0d2a073df4533f7ec225be92affd2f626"}, "author": "", "url": "https://www.reuters.com/article/cmed-ma-aurora-cannabis/canadian-cannabis-firm-aurora-in-talks-to-buy-both-cannimed-and-newstrike-sources-idUSL1N1PE1I4", "ord_in_thread": 0, "title": "Canadian cannabis firm Aurora in talks to buy both CanniMed and Newstrike -sources", "locations": [], "entities": {"persons": [{"name": "john tilak", "sentiment": "none"}, {"name": "newstrike", "sentiment": "none"}, {"name": "nichola saminather", "sentiment": "none"}], "locations": [{"name": "aurora", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "aurora cannabis inc", "sentiment": "none"}, {"name": "newstrike resources ltd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "cannimed therapeutics inc", "sentiment": "none"}, {"name": "cannimed", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 8:40 PM / Updated 17 minutes ago Canadian cannabis firm Aurora in talks to buy both CanniMed and Newstrike -sources John Tilak , Nichola Saminather 3 Min Read \nTORONTO, Jan 19 (Reuters) - Canadian marijuana producer Aurora Cannabis Inc is in talks with rivals CanniMed Therapeutics Inc and Newstrike Resources Ltd to acquire both companies in a friendly deal, people familiar with the situation told Reuters on Friday. \nThe move comes after an attempt by Aurora, Canada’s second-biggest listed cannabis producer, to buy CanniMed in an all-stock bid capped at C$24, was met with resistance from the target. \nA representative of CanniMed declined to comment, citing an agreement on Thursday that prevented CanniMed and Aurora from making public statements about a potential transaction. \nA Newstrike representative did not immediately respond to an emailed request for comment. \nSeparately, CanniMed has been pushing ahead with plans to buy Newstrike, with the latter’s shareholders voting overwhelmingly in favour of the deal on Wednesday. CanniMed on Thursday postponed its own shareholder vote on the deal to Jan. 25 from Jan. 23 to discuss a possible transaction with Aurora. \nWith this latest development, both those bids would be scrapped and replaced with a new friendly agreement, according to the people. \nUnder Aurora’s initial bid, if CanniMed were to buy Newstrike, Aurora’s offer would not proceed. \nUnder both scenarios, Aurora is prepared to pay a higher price for CanniMed and would look to use its own stock, which has been on a tear alongside the rest of the Canadian cannabis industry. \nThe new transaction, which would give Aurora control of both CanniMed and Newstrike, could be announced as early as Monday, the people said, cautioning there is no certainty an agreement would be reached. \nThe people declined to be identified because they were not authorized to speak publicly about the talks. \n“We said from the beginning that we’d be happy to sit down for friendly, collaborative discussions, so we’re going in with an open mind and seeing what they have to say,” Aurora Chief Corporate Officer Cam Battley told Reuters. “Perhaps there’s an opportunity to do something on a friendly basis.” (Reporting by John Tilak and Nichola Saminather; Editing by Denny Thomas and Matthew Lewis)", "external_links": [], "published": "2018-01-19T22:39:00.000+02:00", "crawled": "2018-01-19T23:04:42.018+02:00", "highlightTitle": ""}