{"organizations": [], "uuid": "286ccee247fe62211a5ded4af125f53d0f89aaad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-smart-city-tech-to-drive-over-5-percent-incremental-gdp-trillions-in-economic-growth-over-the-next-decade-reports-abi.html", "country": "US", "domain_rank": 767, "title": "Smart City Tech to Drive Over 5% Incremental GDP, Trillions in Economic Growth Over the Next Decade Reports ABI Research", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.035, "site_type": "news", "published": "2018-01-24T16:00:00.000+02:00", "replies_count": 0, "uuid": "286ccee247fe62211a5ded4af125f53d0f89aaad"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-smart-city-tech-to-drive-over-5-percent-incremental-gdp-trillions-in-economic-growth-over-the-next-decade-reports-abi.html", "ord_in_thread": 0, "title": "Smart City Tech to Drive Over 5% Incremental GDP, Trillions in Economic Growth Over the Next Decade Reports ABI Research", "locations": [], "entities": {"persons": [], "locations": [{"name": "del.", "sentiment": "none"}, {"name": "wilmington", "sentiment": "none"}], "organizations": [{"name": "abi research", "sentiment": "none"}, {"name": "interdigital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WILMINGTON, Del., Jan. 24, 2018 (GLOBE NEWSWIRE) -- The positive impact of smart city technologies on economic development could see cities locking in incremental growth of over 5% and driving more than $20 trillion in additional economic benefits over the coming decade. These are the findings of a new whitepaper by ABI Research which analyzes the impact smart city technologies could have on economic development and GDP growth by 2026.\nAccording to the report, titled ‘ Roles of Smart Cities for Economic Development,’ economic development should be treated as an “uber” benefit, indirectly linked to factors conducive to attract and maintain economic activity within cities, such as security, and livability. Using GDP growth as a key metric, the white paper, commissioned by InterDigital (NASDAQ:IDCC) on behalf of its Smart Cities-focused business, Chordant TM , highlighted the following three dimensions or phases set to be impacted by smart city technologies over the course of the next decade, these include:\nOpen Data Policies, with a potential incremental GDP growth of close to $1 trillion without investments in physical infrastructure; Public investments multiplier effect of up to 10 times, with a potential incremental GDP growth of $10 trillion; and Structural Smart Urban Economy growth, with an expected increase of 2.8% by 2026, driven by next-generation technologies like AI and blockchain.\n“These recent findings further emphasize the importance of technology as a driver for economic development in our future smart cities,” said Jim Nolan, Executive Vice President, Chordant, at InterDigital. “The benefits are clear: trillions in incremental GDP growth will significantly transform the way we live and how our cities operate. But it’s not as simple as deploying technology and hoping it sticks. Cities will have to become strategic in the way they deploy smart city technology to ensure that it maximizes its potential.”\nThe report noted that to operationalize and capture these economic benefits, cities must begin preparation and investment now. In particular, the recommendations from the report suggest that smart city strategies must be optimized based on detailed guidelines and checklist tools. These include:\nDefine priorities and strategies based on an economic development SWOT; Set up processes supporting frictionless interaction with supplier ecosystems; and Optimize based on economic variability according to regional and city size differences.\nIn addition to this, the report identified both economic growth and technological drivers for economic development in a smart city. On economic growth, factors such as a business-friendly environment, skilled workforce and political stability were cited. On technology drivers, areas included:\nConnectivity platforms: a range of technologies such as 5G, fiber, Low Power Wide Area (LPWA) and V2X (Vehicle-to-Infrastructure) will contribute significantly to economic growth by allowing important cost savings through new services like smart bins, smart street lights, etc. Sensors: Both embedded and mobile sensors, in combination with connectivity, allow optimized use of assets through better access to real-time information as well as monitoring environmental metrics to control air and water quality. Analytics: Advanced analytics allow extracting actionable intelligence, from condition-based monitoring to advanced preventive and predictive maintenance. Open data platforms and policies: Standardized platforms will accelerate the unlocking of technological innovation. Opening the access of real-time data to a smart city ecosystem will represent significant economic value in terms of efficiencies, innovation and job creation.\n“Next-generation smart city technologies like AI, blockchain, and closed-loop infrastructure will accelerate future growth by transforming the economy into cognitive, self-governing entities,” said Dominique Bonte, Vice President, Markets, ABI Research. “Distributed ledgers and other financial instruments will allow citizens to seamlessly participate in a networked, all-in economy characterized by frictionless cross-vertical collaboration, transparent commerce, and new forms of employment, driving unseen levels of innovation and urban value creation. Cities will be the catalysts of this emerging new economy which will be both scalable and sustainable.”\nThe report follows a recent whitepaper published by ABI Research in December 2017, and also commissioned by InterDigital, which highlighted the $5 trillion cost saving opportunity for cities using or deploying smart city and IoT technology. According to the report, entitled ‘ Smart Cities and Cost Savings ’, cities employing smart city technology could stand to make significant cost savings across governments, enterprises and citizens.\nThe full ABI Research report, ‘ Role of Smart Cities for Economic Development’ is available to download here .\nAbout InterDigital ®\nInterDigital develops mobile technologies that are at the core of devices, networks, and services worldwide. We solve many of the industry's most critical and complex technical challenges, inventing solutions for more efficient broadband networks and a richer multimedia experience years ahead of market deployment. InterDigital has licenses and strategic relationships with many of the world's leading wireless companies. Founded in 1972, InterDigital is listed on NASDAQ and is included in the S&P MidCap 400 ® index.\nInterDigital is a registered trademark of InterDigital, Inc. Chordant is a trademark of InterDigital.\nFor more information, visit: www.interdigital.com.\nAbout Chordant™\nChordant, an InterDigital business, is part of a global company passionate about innovation and a standards-based approach that stimulates thriving global ecosystems. Solutions powered by the Chordant platform address the fundamental challenges in Smart City deployments. Like a perfect chord of musical notes, the Chordant platform brings harmony to diverse devices, data and services. We have created one of the largest Smart City deployments, integrating hundreds of transport data sources into a transport data marketplace. Our Smart City solutions have also been recognized by leading analyst firms and organizations. For more information, visit: www.chordant.io .\nInterDigital Contact:\nPatrick Van de Wille\nEmail: patrick.vandewille@interdigital.com\n+1 (858) 210-481\nSource:InterDigital, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/0684b61c-736f-464a-ab66-980d9b7c7fb6", "https://www.globenewswire.com/Tracker?data=B4ptYlaBvnsC2NO-U1Py7vtqgSCLUiIZ0ofjEAS-KlV38YqNJeDITnNtsgeWT054At7uljhu01Sm8B48xPN6FeVU30sPkv6AIO-kSgMDM2TCrNmGXv0CuiBrgb06dPrfgIq5Z57gypwPs7g-W9IKX5jFAB8CniStk9o0ZqPdIQg=", "https://www.globenewswire.com/Tracker?data=EuYzEt-TjiQV6xsuF6CzmtHN9_5GRrla59V9Yz5iFo3dZjdBWuJBAHOTMRrztFyAirp_L0tm8-TCWJ-PKOXPzRsb_kq6MNHZRttLCkLPSCUMyzaLLOYaErHPofYe5ulLkYaWOFRsbJvyLxNlW58xZ6zNZe5ZfRwRS0Y8UzVCio114Yl9C1zOOsGBZJwrpEmL", "https://www.globenewswire.com/Tracker?data=83IJb4riktVlSTayrkqqCea6L7QEL3RdszSNLOM6Ju4lmyR83x5_IllGv2xQ7mCdfL_KcjbPB4Kd_HpsdiCOZg==", "https://www.globenewswire.com/Tracker?data=sC_cymyr1QvMr-E1XkYnEOUkaXVK5SD1LmlzTekWqC5b8mMgwkZpXHmDEHs9d-ImmfmSyHIoaW60Yakgtke892xfEVwdm5LOLl0Tys9-SeE=", "https://www.globenewswire.com/Tracker?data=I_Yf1pmq7SJXjmtebYP9Cj1AOpSxcaWSKzbl1EJdzc7zfqNsGAx6Q3IuDTPC1P3ND1GFtAbDFF1-ENb-9WRMHmX1Q9DgoBCeGBsZPsHV91_GmByPjeIPtwX5hYyd_P406GcAiBtQ0SqlLhsCb4Paiw=="], "published": "2018-01-24T16:00:00.000+02:00", "crawled": "2018-01-24T19:13:45.000+02:00", "highlightTitle": ""}