{"organizations": [], "uuid": "70cf0b61f89809216dd42b45b8d6707aedc13d12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/dignity-outlook/update-1-uk-crematorium-operator-dignity-warns-on-2018-profit-cuts-funeral-prices-idUSL3N1PE2LP", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Funeral company Dignity's shares halve after profit warning", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T16:07:00.000+02:00", "replies_count": 0, "uuid": "70cf0b61f89809216dd42b45b8d6707aedc13d12"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/dignity-outlook/update-1-uk-crematorium-operator-dignity-warns-on-2018-profit-cuts-funeral-prices-idUSL3N1PE2LP", "ord_in_thread": 0, "title": "UPDATE 2-Funeral company Dignity's shares halve after profit warning", "locations": [], "entities": {"persons": [{"name": "rahul", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}], "organizations": [{"name": "dignity", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "co-operative group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Funeral services company warns of profit shortfall\n* Cuts and freezes prices for its funeral services\n* Expects more families to opt for simple service (Adds shares, CEO Quote: )\nBy Rahul B\nJan 19 (Reuters) - Shares in British funeral services company Dignity lost half their value on Friday after it warned results for 2018 would be substantially below market expectations as it is forced to cut some of its prices.\nDignity, which is Britain’s largest listed funeral service provider, said families were becoming “increasingly price-conscious” and that it would reduce prices for simple funerals by around 25 percent.\nIt is also freezing the price of the more expensive -- and more popular -- full service funerals from which it earns an average income of 3,800 pounds ($5,295).\nRival Co-op Funeralcare -- part of mutually-owned Co-Operative Group -- cut its prices in September.\nThe comments from Dignity illustrate that its industry is not immune to the pressures facing Britons as higher inflation and subdued wage rises leave them with less money to spend.\n“Customers are increasingly price-conscious and in an over-supplied industry, are shopping around more,” Dignity said in its statement.\nThe price of a simple funeral would fall to 1,995 pounds in England and Wales from 2,660 pounds and come down to 1,695 pounds from 2,260 pounds in Scotland. The company expects the number of simple funerals to rise to around a fifth from only seven percent.\n“We decided to act on prices now as we have room for any such manoeuvre”, Chief Executive Mike McCollum told analysts in a briefing.\nDignity expects to spend an additional 2 million pounds this year on digital and other promotional activities to help publicise its new prices.\nDignity, which has close to 800 funeral locations and operates 44 crematoria in the UK, said it was in talks with the government to regulate the funeral industry and ensure customers are not “misled into accepting below-par service and standards”.\nShares in the FTSE-250 company were down 49.9 percent 0932 GMT and were the biggest drag on the index ($1 = 0.7178 pounds) (Reporting by Rahul B in Bengaluru; Editing by Amrutha Gayathri and Keith Weir)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T16:07:00.000+02:00", "crawled": "2018-01-20T17:36:04.074+02:00", "highlightTitle": ""}