{"organizations": [], "uuid": "cac6fe13ce802ce8a8dac71e09b46cb49ed00395", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/04/the-associated-press-oregon-sues-monsanto-over-pcb-pollution-in-waterways-soil.html", "country": "US", "domain_rank": 767, "title": "Oregon sues Monsanto over PCB pollution in waterways, soil", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T22:34:00.000+02:00", "replies_count": 0, "uuid": "cac6fe13ce802ce8a8dac71e09b46cb49ed00395"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/04/the-associated-press-oregon-sues-monsanto-over-pcb-pollution-in-waterways-soil.html", "ord_in_thread": 0, "title": "Oregon sues Monsanto over PCB pollution in waterways, soil", "locations": [], "entities": {"persons": [], "locations": [{"name": "oregon", "sentiment": "none"}, {"name": "portland", "sentiment": "none"}, {"name": "ore.", "sentiment": "none"}, {"name": "portland harbor", "sentiment": "none"}, {"name": "portland", "sentiment": "none"}, {"name": "willamette river", "sentiment": "none"}], "organizations": [{"name": "monsanto", "sentiment": "negative"}, {"name": "pcb", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "u.s. environmental protection agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PORTLAND, Ore. (AP) — The state of Oregon sued the agrochemical company Monsanto on Thursday over pervasive pollution from PCBs, the toxic industrial chemicals that have accumulated in plants, fish and people around the globe for decades. The company called the lawsuit baseless.\nThe lawsuit seeks $100 million to use to mitigate pollution, particularly along a 10-mile (16 kilometer) stretch of the Willamette River in Portland that will be the target of a $1 billion cleanup announced by federal authorities in 2016.\nOregon's lawsuit cites internal memos and correspondence indicating that Monsanto knew early on about the toxic effects of PCBs.\nA 1937 internal company memo said that exposure to vapors at high temperatures or ingestion of the substances by animals produced \"systemic toxic effects\" and prolonged skin contact could lead to an acne-like rash, the lawsuit alleged.\nMonsanto said in an emailed statement that the litigation undermined decontamination efforts in the Portland Harbor overseen by the U.S. Environmental Protection Agency. The agency declared the area a \"superfund site\" in 2000.\n\"Monsanto voluntarily stopped producing PCBs more than 40 years ago and didn't use or dispose of any PCBs in the state of Oregon. Cleanup efforts are underway in Oregon with the full group of responsible parties under supervision of the EPA, and it's most important that everyone stay focused on that work,\" said Scott S. Partridge, Monsanto's vice president of global strategy.\nIn Oregon, more than two dozen rivers and streams have tested positive for PCB contamination and fish and wildlife in more than 40 watersheds have also shown signs of pollution, according to court documents.\nA variety of fish species in Oregon are vulnerable because the PCBs accumulate in their fatty tissues. When seals, eagles, osprey, orca whales and humans eat those fish, that contamination is passed on, the lawsuit alleged.\nIn some cases, dead orca whales that washed up on shore have been treated as hazardous waste, the lawsuit said.\n\"PCBs cause a wide range of systemic toxic effects in humans and animals and can seriously impair the endocrine, neurologic, and reproductive systems,\" according to the lawsuit.\nPortland's harbor suffered the most pollution because it was lined for a century with businesses that relied heavily on PCBs for manufacturing, metal recycling, fuel storage, railways and other industrial uses.\nPCBs, or polychlorinated biphenyls, were used in many industrial and commercial applications — including paint, coolants, sealants and hydraulic fluids. Monsanto, based in Missouri, produced them from 1935 until Congress banned them in 1979.\nAccording to the EPA, PCBs have been shown to cause a variety of health problems, including cancer in animals as well as effects on the immune, nervous and reproductive systems.\nSeveral cities — including Portland, Oregon, and the California cities of Oakland, Berkeley, San Jose, Long Beach and San Diego —have also sued Monsanto over PCB pollution. Washington became the first state to sue Monsanto over PCBs in 2016.\nThe new lawsuit said that a study included in a 1955 Monsanto internal report that said \"the toxicity of these compounds has been repeatedly demonstrated\" and that prolonged skin exposure could cause a \"serious and disfiguring dermatitis.\"\nA 1968 study of a waterway near a Monsanto plant characterized the creek as a \"potential source of future legal problems,\" the lawsuit said.\nYet Monsanto told officials around the country the contrary, the lawsuit alleged. In a letter to New Jersey's Department of Conservation that year, Monsanto wrote, \"Based on available data, manufacturing and use experience, we do not believe PCBs to be seriously toxic.\"\nOregon's lawsuit seeks damages for public nuisance, unjust enrichment and cites trespassing — saying the contamination hurt the state's natural resources.\nFollow Gillian Flaccus on Twitter at http://www.twitter.com/gflaccus", "external_links": [], "published": "2018-01-04T22:34:00.000+02:00", "crawled": "2018-01-05T06:34:13.012+02:00", "highlightTitle": ""}