{"organizations": [], "uuid": "33f1cda5db66460c2f0f299197fd0ad7746e21f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-sinclair-names-dean-radla-general-manager-at-woai-in-san-antonio.html", "country": "US", "domain_rank": 767, "title": "Sinclair Names Dean Radla General Manager At WOAI In San Antonio", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T22:11:00.000+02:00", "replies_count": 0, "uuid": "33f1cda5db66460c2f0f299197fd0ad7746e21f9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-sinclair-names-dean-radla-general-manager-at-woai-in-san-antonio.html", "ord_in_thread": 0, "title": "Sinclair Names Dean Radla General Manager At WOAI In San Antonio", "locations": [], "entities": {"persons": [{"name": "sinclair", "sentiment": "none"}, {"name": "dean radla", "sentiment": "none"}, {"name": "steve marks", "sentiment": "none"}, {"name": "radla", "sentiment": "none"}, {"name": "marks", "sentiment": "none"}, {"name": "dean", "sentiment": "none"}], "locations": [{"name": "san antonio san antonio", "sentiment": "none"}, {"name": "san antonio", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "woai", "sentiment": "negative"}, {"name": "sinclair names dean radla", "sentiment": "negative"}, {"name": "sinclair broadcast group, inc.", "sentiment": "neutral"}, {"name": "cw", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN ANTONIO, Jan. 2, 2018 /PRNewswire/ -- Sinclair Broadcast Group, Inc. (Nasdaq: SBGI) announced that Dean Radla has been named to General Manager of WOAI (NBC) in San Antonio, Texas. He will continue to be the General Manager of KABB-TV (FOX 29) and retain oversight of Sinclair's provision of services to KMYS-TV (CW 35) under a joint sale agreement. The announcement was made by Steve Marks, Chief Operating Officer of Sinclair's television group.\nIn making the announcement, Mr. Marks said, \"We are pleased to be able to bring Dean's expertise and leadership to WOAI. During his twenty years with us, his skills and determination have been instrumental in helping to build the stations' brand recognition and their success in partnering with the market's local businesses towards reaching their customers.\"\n\"I am very honored and excited to expand my role as General Manager to include WOAI-TV, which is the station where I started my television career,\" commented Mr. Radla. \"I consider it a privilege to work with such a talented and dedicated team of professionals and I look forward to continuing the momentum that our stations are building in the San Antonio market by focusing on connecting our viewers with quality programming and relevant local news content on all media platforms.\"\nMr. Radla has served as General Manager for KABB (FOX 29) and has been responsible for oversight of Sinclair's provision of services to KMYS (CW 35) under a joint sale agreement since 2012. Prior to that, he served as Director of Sales at the same stations since 1999. From 1997 until 1999, he was the Local Sales Manager for KABB (FOX 29). Mr. Radla has over 35 years of sales and management experience, including 27 years in the television industry in the San Antonio market where he began his television career in 1990 at KMOL-TV (now WOAI-TV). During his career with Sinclair, Mr. Radla has been involved in numerous corporate wide projects focusing on inventory management and revenue strategies. In addition, he has also performed the duties of Regional Sales Consultant, with oversight in Sinclair Broadcast's Oklahoma City market. Mr. Radla received a Bachelor of Arts in Public Relations and Advertising from Texas State University.\nSinclair is one of the largest and most diversified television broadcasting companies in the country. Pro forma for the Tribune acquisition (before any related divestitures), the Company will own, operate and/or provide services to 233 television stations in 108 markets. The Company has multiple emerging networks as well as stations affiliated with all the major networks. Sinclair is a leading local news provider in the country and a producer of live sports content. Sinclair's content is delivered via multiple-platforms, including over-the-air, multi-channel video program distributors, and digital platforms. The Company regularly uses its website as a key source of Company information which can be accessed at www.sbgi.net .\nView original content with multimedia: http://www.prnewswire.com/news-releases/sinclair-names-dean-radla-general-manager-at-woai-in-san-antonio-300576543.html\nSOURCE Sinclair Broadcast Group, Inc.", "external_links": ["http://www.sbgi.net/", "http://www.prnewswire.com/news-releases/sinclair-names-dean-radla-general-manager-at-woai-in-san-antonio-300576543.html"], "published": "2018-01-02T22:11:00.000+02:00", "crawled": "2018-01-02T23:43:09.022+02:00", "highlightTitle": ""}