{"organizations": [], "uuid": "db1f4fd92ad0ff589a070440d9959f356c61449f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222766077&w=1200&r=LYNXMPEE0G17J", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-lebanon-wildlife-baboon/in-lebanese-dog-shelter-masoud-the-baboon-dreams-of-home-idUKKBN1F621I", "country": "US", "domain_rank": 408, "title": "In Lebanese dog shelter, Masoud the baboon dreams of home", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T17:54:00.000+02:00", "replies_count": 0, "uuid": "db1f4fd92ad0ff589a070440d9959f356c61449f"}, "author": "", "url": "https://uk.reuters.com/article/uk-lebanon-wildlife-baboon/in-lebanese-dog-shelter-masoud-the-baboon-dreams-of-home-idUKKBN1F621I", "ord_in_thread": 0, "title": "In Lebanese dog shelter, Masoud the baboon dreams of home", "locations": [], "entities": {"persons": [{"name": "masoud", "sentiment": "negative"}, {"name": "hassan hankir", "sentiment": "none"}, {"name": "laura steinbach", "sentiment": "none"}, {"name": "steinbach", "sentiment": "none"}, {"name": "issam abdallah", "sentiment": "none"}], "locations": [{"name": "lebanon", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "min read  tyre", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 3:53 PM / Updated 21 minutes ago In Lebanese dog shelter, Masoud the baboon dreams of home Issam Abdallah , Hassan Hankir 3 Min Read \nTYRE, Lebanon (Reuters) - Masoud, a Hamadryas baboon, was kept as a pet in a house near a highway in south Lebanon until 10 days ago, when an animal activist rescued him. \nBut his journey towards freedom is still an uncertain one and, for now, he spends his days in a small cage in the corner of a dog shelter that Laura Steinbach runs near the coastal city of Tyre. \nShe said she believed Masoud had been brought into Lebanon from Syria, a common route for baboon smugglers. \n“In this country there is not enough awareness on how to raise dogs in households so how are they supposed to know how to deal with a baboon?” Steinbach said. \nShe said she managed to secure Masoud’s release after a three-hour discussion with the owner about the dangers a wild animal could pose. \n“This baboon was living among people in the garden of a house close to a main road. They didn’t know what to feed him or what to do with him when it was cold... This is completely wrong.” A Hamadryas baboon, named Masoud holds a banana inside a cage in the southern city of Tyre, Lebanon January 6, 2018. Picture taken January 6, 2018. REUTERS/Ali Hashisho \nSteinbach said his current situation, though improved, was not ideal. \nShe hopes Masoud, who she believes is between three and four years old, will be able to go to Ethiopia, where Hamadryas live in the wild. The species is present in northeast Africa and was considered sacred by the ancient Egyptians. Slideshow (2 Images) \n“When we first brought him in he was in a very depressive mood, he was anxious. Now he sees that he is around people who understand him and he has improved,” said Lara, Steinbach’s daughter, who helps run the shelter. \nAnimal welfare group Animals Lebanon says there has long been an active and lucrative wildlife trade between Lebanon and Syria, though it could not confirm if Masoud had been smuggled. \n“There are hundreds of them (baboons) already in Lebanon. We are caring for a group of six. There are actually enough of these that they are being bred and sold without the need to smuggle them,” said Jason Mier, the group’s director. \nLebanon passed a wildlife protection law in August 2017 and although Mier said it was an important step, it still has some way to go before the smugglers are stopped. Writing by Ayat Basma; editing by John Stonestreet", "external_links": [], "published": "2018-01-17T17:54:00.000+02:00", "crawled": "2018-01-17T18:21:35.000+02:00", "highlightTitle": ""}