{"organizations": [], "uuid": "bc068d18d0d04a5a34a35e55e0f185b348db861f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-france-qaeda-convict/facing-u-s-extradition-bin-laden-associate-attacks-french-prison-guards-idUSKBN1F02I7", "country": "US", "domain_rank": 408, "title": "Facing U.S. extradition, bin Laden associate attacks French prison guards", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T20:17:00.000+02:00", "replies_count": 0, "uuid": "bc068d18d0d04a5a34a35e55e0f185b348db861f"}, "author": "", "url": "https://www.reuters.com/article/us-france-qaeda-convict/facing-u-s-extradition-bin-laden-associate-attacks-french-prison-guards-idUSKBN1F02I7", "ord_in_thread": 0, "title": "Facing U.S. extradition, bin Laden associate attacks French prison guards", "locations": [], "entities": {"persons": [{"name": "bin laden", "sentiment": "negative"}, {"name": "ganczarski", "sentiment": "none"}, {"name": "emmanuel jarry", "sentiment": "none"}, {"name": "osama bin laden", "sentiment": "none"}, {"name": "christian ganczarski", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "djerba", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "tunisia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 17 PM / Updated 8 minutes ago Facing U.S. extradition, bin Laden associate attacks French prison guards Emmanuel Jarry 3 Min Read \nPARIS (Reuters) - A German believed to have been an associate of Osama bin Laden and convicted for his part in an attack on a synagogue in Tunisia in 2002 attacked four prison guards on Thursday weeks before being eligible for extradition to the United States. \nChristian Ganczarski, a German convert to Islam who spent time in Afghanistan and is believed to have been an adviser to former al Qaeda leader Osama bin Laden, was arrested in France in 2003. \nHe was sentenced in 2009 to 18 years in prison for being one of the masterminds behind the attack in Djerba that killed 21 people. \nThe victims were killed when the bomber drove a tanker truck filled with cooking gas to the synagogue and blew it up as they were entering the building, which was virtually destroyed. A synagogue had stood on the site for 1,900 years. \nGanczarski’s sentence was due to end in February. The United States had indicated it wanted him extradited for his role in the September 11 attacks. \nOfficials said that he attacked four guards with a bladed weapon on Thursday. \n“The head of the establishment told him that he would be extradited to the United States where he is suspected of being one of the organizers of the Sept. 11 attacks,” Jean-Francois Forget, secretary general of the UFAP-UNSA penitentiary union, told Reuters. \n“He was recorded in a telephone call saying he would do something to stay in France.” \nA second union official, Yoan Karar, said that Ganczarski had been put in isolation ahead of his extradition. \nProsecutors opened a counter-terrorism investigation into Thursday’s attack, which will inevitably delay any possible extradition. \nGanczarski was one of three men, including Khalid Sheikh Mohammed, one of the principal figures linked to the Sept. 11 attacks in the United States, who were originally tried in Paris for the Djerba attacks. \nAccording to court documents at the time, Sheikh Mohammed and Ganczarski received telephone calls from the suicide bomber before the attack. \nGerman police also recorded a conversation in which the bomber asked Ganczarski for his blessing together with the reply “May God reward you”. \nThe Polish-born Ganczarski, described by investigators as a computer and communications technology specialist, converted to Islam in 1986 and spent time in both Saudi Arabia and Afghanistan. \nA witness quoted in court documents said he “swore allegiance” to bin Laden in 1998 and became one of al Qaeda’s specialists in radio, Internet and communication. Writing by John Irish, Editing by William Maclean", "external_links": [], "published": "2018-01-11T20:17:00.000+02:00", "crawled": "2018-01-11T20:31:28.012+02:00", "highlightTitle": ""}