{"organizations": [], "uuid": "83052513796582dc7d3d7ca1939e8122560c6172", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/24/reuters-america-update-9-oil-rallies-after-record-10th-straight-fall-in-u-s-inventories.html", "country": "US", "domain_rank": 767, "title": "UPDATE 9-Oil rallies after record 10th straight fall in inventories", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T22:10:00.000+02:00", "replies_count": 0, "uuid": "83052513796582dc7d3d7ca1939e8122560c6172"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/24/reuters-america-update-9-oil-rallies-after-record-10th-straight-fall-in-u-s-inventories.html", "ord_in_thread": 0, "title": "UPDATE 9-Oil rallies after record 10th straight fall in inventories", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "venezuela", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "eia", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. energy information administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* U.S. crude inventories up 1.1 mln bbls -EIA\n* Refining runs dip, production hits 9.9 mln bpd -EIA\n* Saudi oil minister notes drops in Mexico, Venezuela output\n* Brent, U.S. crude futures hit highest since Dec 2014\n* Weaker dollar supports greenback-denominated commodities\n* Options activity shows rising downside protection (New throughout, updates prices, market activity and comments to settlement, adds further details on Cushing inventories, spreads)\nNEW YORK, Jan 24 (Reuters) - Oil prices rallied on heavy volume on Wednesday, boosted by a record 10th straight weekly decline in U.S. crude inventories, though reduced refining activity and rising production signaled U.S. stocks could rise in coming weeks.\nU.S. crude inventories fell by 1.1 million barrels last week, short of expectations, but the 10-week streak of declines represents a record, according to U.S. Energy Information Administration (EIA) data going back to 1982. At 411.6 million barrels, stocks are at their lowest since February 2015.\nThe steady draw has triggered record buying by speculators, pushing oil benchmarks to three-year highs.\nU.S. West Texas Intermediate (WTI) futures settled up $1.14, or 1.8 percent, to $65.80. Brent futures gained 57 cents to $70.53 a barrel. Both benchmarks were at their highest since December 2014.\nMore than 830,000 U.S. crude contracts changed hands, far exceeding the daily average of 618,000 contracts over the last 10 months.\nAlso supporting oil prices was a 0.7 percent drop in the U.S. dollar after Treasury Secretary Steven Mnuchin's comments that a weaker currency was positive for American trade. A weaker dollar makes greenback-denominated commodities less expensive for investors using other currencies.\nU.S. crude production rose to 9.9 million barrels per day last week, nearing the all-time record of 10.04 million bpd set in 1970, the EIA data showed.\nStockpiles continued to decline at the storage hub of Cushing, Oklahoma, falling to 39.2 million barrels, lowest since January 2015. Reduced flows from the Keystone pipeline from Canada helped drain supply there, along with further outflows from the new Diamond Pipeline.\nThe draw in inventories helped to narrow Brent's premium over U.S. crude to $4.91. In late December, that spread touched $7 a barrel, which spurred U.S. exports and reduced imports.\n\"The draws in Cushing are driving that, because Cushing is draining like a cheap canoe,\" said Phil Flynn, analyst at Price Futures Group in Chicago.\nDeclining inventories spurred more buying in the front-month crude contract. The spread between the March and April contract <CLc1-CLc2> widened to 26 cents, highest in three years. This reflected expectations that companies will continue to sell barrels at the current higher price.\nSpeaking at the World Economic Forum in Davos, Switzerland, Khalid al-Falih, Saudi Arabia's energy minister, said he is not concerned about the threat of U.S. production, citing declining output from Venezuela and Mexico.\nU.S. refining capacity use declined by 2.1 percentage points as maintenance season began, though gasoline and diesel demand still exceeded year-ago levels, the EIA said.\nMoney managers hold more bullish positions in crude futures and options than at any time on record, and some investors now appear to be seeking protection against a possible fall in prices. Trading data shows open interest has climbed since the middle of last week for Brent put options for selling at $70, $69 and $68 a barrel.\nSukrit Vijayakar of energy consultancy Trifecta attributed rising sell options to large long positions built in previous months.\n\"We still have ... nine long barrels for every short barrel, so a reversal should be interesting to watch,\" he said.\n(Additional reporting by Amanda Cooper and Henning Gloystein; Editing by David Gregorio and Marguerita Choy)", "external_links": [], "published": "2018-01-24T22:10:00.000+02:00", "crawled": "2018-01-24T22:51:44.035+02:00", "highlightTitle": ""}