{"organizations": [], "uuid": "49ba6ed760c7338d2aa091e68e86d8d5a8de2d52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/emerging-markets/emerging-markets-emerging-equities-tumble-1-3-pct-russian-stocks-rebound-idUSL8N1PP1VF", "country": "US", "domain_rank": 408, "title": "EMERGING MARKETS-Emerging equities tumble 1.3 pct, Russian stocks rebound", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T12:09:00.000+02:00", "replies_count": 0, "uuid": "49ba6ed760c7338d2aa091e68e86d8d5a8de2d52"}, "author": "", "url": "https://www.reuters.com/article/emerging-markets/emerging-markets-emerging-equities-tumble-1-3-pct-russian-stocks-rebound-idUSL8N1PP1VF", "ord_in_thread": 0, "title": "EMERGING MARKETS-Emerging equities tumble 1.3 pct, Russian stocks rebound", "locations": [], "entities": {"persons": [{"name": "cla", "sentiment": "negative"}, {"name": "milhench", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Jan 30 (Reuters) - Emerging market equities tumbled 1.3 percent on Tuesday after a spike in U.S. bond yields and a tech-led slide on Wall Street dampened risk appetite, but Russian shares rebounded on relief the U.S. had not imposed a fresh round of sanctions.\nMSCI’s benchmark emerging stocks index was set for its biggest one-day fall since early December after U.S. 10-year Treasury yields spiked to a new 3-1/2 year high.\nInvestor sentiment was also hit by a tech sell off on Wall Street led by Apple shares on news the company would cut production of its iPhone X smartphone.\nThose emerging markets most exposed to the tech sector took the brunt of the selling, with Asian bourses a sea of red.\nHong Kong, Chinese mainland shares, South Korea, Taiwan and Indonesia all fell over 1 percent. The MSCI EM tech index dived 1.7 percent, its worst one-day fall since end-November 2017.\n“The tech sector had risen very rapidly and it might be it has started to reverse course and that has weighed on sentiment,” said William Jackson, senior emerging economist at Capital Economics.\nHe added that the higher U.S. bond yields had fed into a stronger dollar. This was prompting an unwinding of some of the long emerging currency positions, and had cooled risk appetite for emerging assets more broadly.\nIn emerging Europe Poland led the losses, down 0.9 percent but Russian stocks rebounded 0.7 percent after falling to two-week lows in early trading.\nThe whipsaw moves were triggered by the publication of a list of oligarchs close to the Kremlin by the U.S. Treasury department that included the heads of Russia’s two biggest banks, Sberbank and VTB, metals magnates and the boss of state gas monopoly Gazprom.\nNorilsk Nickel fell 1 percent, aluminium producer Rusal tumbled almost 3 percent and technology firm Yandex 1.6 percent.\nHowever, the Trump administration said it would not immediately impose additional sanctions on Russia, despite a new law designed to punish Moscow’s alleged meddling in the 2016 U.S. election, insisting the measure was already hitting Russian companies. This helped Moscow shares steady.\n“It might be a little bit of relief as fresh sanctions were not imposed, and the nature of the list may not be a big surprise to most analysts,” Jackson said.\nHe added that most people were waiting for a report on whether rouble-denominated bonds would be subject to sanctions.\nStrategists at Societe Generale said that although the chances of restrictive measures could not be fully dismissed, they believed the current U.S. approach “significantly diminished” the risk of harsh measures against Russian sovereign debt over the short-term.\n“With this in mind, we are reinstating a long position in OFZs,” they said in a note, referring to rouble-denominated Russian treasury bonds.\nThe yield on the Russian 10-year local currency bond was trading at around four-year lows.\nThe rouble firmed 0.2 percent against the dollar and Russian five-year credit default swaps narrowed 1 basis point from Monday’s close to 114 basis points, according to IHS Markit data.\nElsewhere the South African rand and the Mexican peso led the currency fallers, down around 0.2 percent.\nIn South Africa investors are waiting for cash-strapped power utility Eskom to post its financial results. The firm has been in embroiled in a governance crisis.\nThe Hungarian central bank will meet today but is expected to keep rates on hold at 0.9 percent. The bank is regarded as one of the most dovish in the world and is employing unconventional easing methods.\nAnalysts at ING noted that the bank had already announced it would tweak its interest rate swap facility in view of the disappointing market reaction after the first tender.\n“We expect the NBH to reiterate its forward rate guidance of unchanged rates until the middle of next year,” they added.\nThe Hungarian forint was slightly weaker against the euro, but trading in line with regional peers. For GRAPHIC on emerging market FX performance 2017, see tmsnrt.rs/2e7eoml For GRAPHIC on MSCI emerging index performance 2017, see tmsnrt.rs/2dZbdP5\nFor TOP NEWS across emerging markets\nFor CENTRAL EUROPE market report, see\nFor TURKISH market report, see\nFor RUSSIAN market report, see) Emerging Markets Prices from Reuters Equities Latest Net Chg % Chg % Chg\non year\nMorgan Stanley Emrg Mkt Indx 1252.40 -15.58 -1.23 +8.11\nCzech Rep 1129.68 -1.55 -0.14 +4.78\nPoland 2577.62 -15.78 -0.61 +4.73\nHungary 40255.64 -244.48 -0.60 +2.23\nRomania 8393.31 -30.60 -0.36 +8.25\nGreece 883.85 -2.69 -0.30 +10.15\nRussia 1287.69 +12.12 +0.95 +11.54\nSouth Africa 52816.35 -1047.41 -1.94 +0.54\nTurkey 20327.94 -517.36 -0.43 +4.33\nChina 3488.19 -34.81 -0.99 +5.47\nIndia 36038.90 -244.35 -0.67 +5.82\nCurrencies Latest Prev Local Local\nclose currency currency\n% change % change\nin 2018\nCzech Rep 25.32 25.29 -0.11 +0.81\nPoland 4.15 4.14 -0.05 +0.71\nHungary 310.22 309.90 -0.10 +0.10\nRomania 4.65 4.65 -0.00 +0.54\nSerbia 118.48 118.59 +0.09 -0.07\nRussia 56.23 56.31 +0.14 +2.53\nKazakhstan 322.31 322.21 -0.03 +3.25\nUkraine 27.99 28.21 +0.79 +0.55\nSouth Africa 11.95 11.94 -0.10 +3.39\nKenya 102.40 102.30 -0.10 +0.68\nIsrael 3.40 3.40 -0.05 +2.34\nTurkey 3.78 3.79 +0.21 +0.12\nChina 6.34 6.33 -0.06 +2.68\nIndia 63.72 63.59 -0.20 +0.18\nBrazil 3.15 3.15 +0.00 +4.98\nMexico 18.65 18.60 -0.24 +5.37\nDebt Index Strip Spd Chg %Rtn Index\nSov‘gn Debt EMBIG 294 1 .03 8 05.78 1\nReporting by Claire Milhench; Editing by Raissa Kasolowsky\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-30T12:09:00.000+02:00", "crawled": "2018-01-30T12:23:07.030+02:00", "highlightTitle": ""}