{"organizations": [], "uuid": "e572c67a06a3e7400f11243ef97224d23d9365ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180124.html", "section_title": "Archive News &amp; Video for Wednesday, 24 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/india-movie-protests/hindu-groups-call-for-all-india-protest-ahead-of-controversial-movie-release-idUSL4N1PJ26U", "country": "US", "domain_rank": 408, "title": "Hindu groups call for all-India protest ahead of controversial movie release", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.347, "site_type": "news", "published": "2018-01-24T14:28:00.000+02:00", "replies_count": 0, "uuid": "e572c67a06a3e7400f11243ef97224d23d9365ef"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/india-movie-protests/hindu-groups-call-for-all-india-protest-ahead-of-controversial-movie-release-idUSL4N1PJ26U", "ord_in_thread": 0, "title": "Hindu groups call for all-India protest ahead of controversial movie release", "locations": [], "entities": {"persons": [{"name": "bhansali", "sentiment": "none"}, {"name": "rakesh singh bais", "sentiment": "none"}, {"name": "padmavati", "sentiment": "none"}, {"name": "sanjay leela bhansali", "sentiment": "none"}], "locations": [{"name": "gujarat", "sentiment": "none"}, {"name": "chhattisgarh", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "hindu", "sentiment": "negative"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 24 (Reuters) - Indian right wing Hindu groups intensified protests against the release of a controversial Bollywood film “Padmaavat” amid heightened police presence in various states on Wednesday, a day after the Supreme Court refused to allow some states to ban the film.\nProtests against the film turned increasingly violent late on Tuesday with vandalism around a number of multiplexes in the Western state of Gujarat and dozens of motorcycles being set on fire around malls that house theatres.\nGroups critical of the project have accused its director, Sanjay Leela Bhansali, of distorting history by portraying a Muslim ruler as the “lover” of Queen Padmavati of the Hindu Rajput warrior clan. The filmmakers deny the accusation.\nThe police had to open fire to disperse crowds on Tuesday night and protests are expected to continue in various parts of the country ahead of the release of the film on Jan. 25.\nIn the central state of Chhattisgarh, dozens of members of Rajput community staged protests and burned an effigy of Bhansali on Tuesday evening, Rakesh Singh Bais of the community group Sarwa Kshatriya Mahasabha told Reuters.\nThe members of the communities and from Hindu organisations will form a human chain on Wednesday and stage a motorcycle rally to give cinema hall owners final warnings, Bais said.\nO. P. Galhotra, the director general of police for Rajasthan, said they have information that members of the Karni Sena and other Rajput groups were planning a protest in various parts of the state against the movie.\n“We have been talking to the leaders of the Karni Sena and they don’t want to end their protest...we have decided to allow them to hold small protests, and have made adequate arrangements to maintain law and order,” Galhotra said.\nRajvansh Singh, the district secretary of the Karni Sena in the city of Chittorgarh in Rajasthan, said he is the custodian of the respect of Hindu Rajput women and anyone trying to depict history as fiction will have to pay a price for their mistake.\n“We will not allow the movie to be released, the director thinks he can change the name and release his film this makes no sense. Queen Padmini is like our goddess, no one will be allowed to insult our goddess and our Hindu pride.” (Reporting by Jatindra Dash and Rupam Jain; Writing by Swati Bhat; Editing by Euan Rocha and Michael Perry)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T14:28:00.000+02:00", "crawled": "2018-01-25T13:28:32.020+02:00", "highlightTitle": ""}