{"organizations": [], "uuid": "ee3803a68631dcba11134037b29ffa24bc85b61b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-nexpoint-credit-strategies-fund-announces-the-regular-monthly-dividend.html", "country": "US", "domain_rank": 767, "title": "NexPoint Credit Strategies Fund Announces the Regular Monthly Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T02:36:00.000+02:00", "replies_count": 0, "uuid": "ee3803a68631dcba11134037b29ffa24bc85b61b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-nexpoint-credit-strategies-fund-announces-the-regular-monthly-dividend.html", "ord_in_thread": 0, "title": "NexPoint Credit Strategies Fund Announces the Regular Monthly Dividend", "locations": [], "entities": {"persons": [], "locations": [{"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "nexpoint credit strategies fund", "sentiment": "negative"}, {"name": "dow jones credit suisse hedge fund", "sentiment": "none"}, {"name": "nexpoint advisors", "sentiment": "none"}, {"name": "highland capital management", "sentiment": "none"}, {"name": "nexpoint credit strate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 3, 2018 /PRNewswire/ -- NexPoint Credit Strategies Fund (NYSE: NHF) (\"NHF\" or the \"Fund\") today announced its regular monthly dividend on its common stock of $.20 per share. The dividend will be payable on Jan 31, 2018 to shareholders of record at the close of business Jan 23, 2018.\nThe Fund is a closed-end fund managed by NexPoint Advisors, L.P. (the \"Manager\"), an affiliated adviser of Highland Capital Management, L.P. The Fund invests primarily in below investment grade debt and equity and has the ability to hedge risk. The Manager attempts to deliver consistent returns in excess of the Dow Jones Credit Suisse Hedge Fund and the HFRX Global Hedge Fund indices in a transparent, registered fund format consistent with monthly dividends.\nTotal Returns as of 12/31/17\n1-year\n3-year\n5-year\n10-year\nSince Inception\n(6/29/06)\nNexPoint Credit Strategies Fund (NAV)\n17.34%\n5.02%\n19.01%\n5.25%\n5.25%\nNexPoint Credit Strategies Fund (Market Price)\n27.31%\n10.01%\n20.76%\n6.18%\n4.43%\nTotal Returns as of 09/30/17\n1-year\n3-year\n5-year\n10-year\nSince Inception\n(6/29/06)\nNexPoint Credit Strategies Fund (NAV)\n16.11%\n5.01%\n17.52%\n3.97%\n4.55%\nNexPoint Credit Strategies Fund (Market Price)\n19.37%\n8.36%\n17.39%\n3.79%\n3.45%\nTotal operating expenses as of the most recent fund semi-annual report are 2.16%. Performance data represents past performance, which does not guarantee future results. Current performance may be higher or lower than the figures shown. Investment return and principal value will fluctuate with market conditions, and you may have a gain or loss when you sell your shares. For most recent month-end performance please visit www.nexpointadvisors.com or call 1-866-351-4440.\nInvestors should consider the investment objectives, risks, charges and expenses of the NexPoint Credit Strategies Fund carefully before investing. This and other information can be found in the Fund's prospectus, which may be obtained by calling 1-866-351-4440 or visiting www.nexpointadvisors.com . Please read the prospectus carefully before you invest.\nInterest Rate Risk. Interest rate risk is the risk that debt securities, and the Fund's net assets, may decline in value because of changes in interest rates. Generally, fixed rate debt securities will decrease in value when interest rates rise and increase in value when interest rates decline.\nLeverage Risk. The Fund uses leverage through borrowings from notes and a credit facility, and may also use leverage through the issuances of preferred shares. The use of leverage magnifies both the favorable and unfavorable effects of price movements in the investments made by the Fund. Insofar as the Fund employs leverage in its investment operations, the Fund will be subject to substantial risks of loss.\nClosed-End Fund Risk. The Fund is a closed-end investment company designed primarily for long-term investors and not as a trading vehicle. No assurance can be given that a shareholder will be able to sell his or her shares on the NYSE when he or she chooses to do so, and no assurance can be given as to the price at which any such sale may be effected.\nIndustry Concentration Risk. The Fund must invest at least 25% of the value of its total assets at the time of purchase in securities of issuers conducting their principal business activities in the real estate industry. The Fund may be subject to greater market fluctuations than a fund that does not concentrate its investments in a particular industry. Financial, economic, business, and other developments affecting issuers in the real estate industry will have a greater effect on the Fund, and if securities of the real estate industry fall out of favor, the Fund could underperform, or its NAV may be more volatile than, funds that have greater industry diversification.\nCredit Risk. Investments rated below investment grade are commonly referred to as high-yield, high risk or \"junk debt.\" They are regarded as predominantly speculative with respect to the issuing company's continuing ability to meet principal and/ or interest payments. Non-payment of scheduled interest and/or principal would result in a reduction of income to the Fund, a reduction in the value of the asset experiencing non-payment and a potential decrease in NAV of the Fund.\nIlliquidity of Investments Risk. The investments made by the Fund may be illiquid, and consequently the Fund may not be able to sell such investments at prices that reflect the Investment Adviser's assessment of their value or the amount originally paid for such investments by the Fund.\nAbout NexPoint Credit Strategies Fund\nNexPoint Credit Strategies Fund is a closed-end fund managed by NexPoint Advisors, L.P. The Fund's investment objectives are to provide both current income and capital appreciation. The Fund is invested primarily in below investment grade debt and equity securities and has the ability to hedge risk. The Manager attempts to deliver consistent returns in excess of the Dow Jones Credit Suisse Hedge Fund and the HFRX Global Hedge Fund indices in a transparent, registered fund format consistent with monthly dividends. No assurance can be given that the Fund will achieve its investment objectives.\nShares of closed-end investment companies frequently trade at a discount to net asset value. The price of the Fund's shares is determined by a number of factors, several of which are beyond the control of the Fund. Therefore, the Fund cannot predict whether its shares will trade at, below or above net asset value. Past performance does not guarantee future results.\nCONTACTS\nFund Information: 1-866-351-4440\nHighland Media Relations: 1-972-419-6272\nView original content with multimedia: http://www.prnewswire.com/news-releases/nexpoint-credit-strategies-fund-announces-the-regular-monthly-dividend-300577308.html\nSOURCE NexPoint Advisors, L.P.", "external_links": ["http://www.nexpointadvisors.com/", "http://www.prnewswire.com/news-releases/nexpoint-credit-strategies-fund-announces-the-regular-monthly-dividend-300577308.html"], "published": "2018-01-04T02:36:00.000+02:00", "crawled": "2018-01-04T05:26:47.002+02:00", "highlightTitle": ""}