{"organizations": [], "uuid": "7ceb072c5c3211065d49acba815b431da6182ff0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-euro-zone-yields-hold-near-highs-after-hawkish-ecb-comments-idUSL8N1OY18Z", "country": "US", "domain_rank": 408, "title": "UPDATE 3-Euro zone yields edge lower as MiFID II kicks in", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-03T17:32:00.000+02:00", "replies_count": 0, "uuid": "7ceb072c5c3211065d49acba815b431da6182ff0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-euro-zone-yields-hold-near-highs-after-hawkish-ecb-comments-idUSL8N1OY18Z", "ord_in_thread": 0, "title": "UPDATE 3-Euro zone yields edge lower as MiFID II kicks in", "locations": [], "entities": {"persons": [{"name": "fanny potkin", "sentiment": "none"}, {"name": "nowotny", "sentiment": "none"}, {"name": "ewald nowotny", "sentiment": "none"}, {"name": "benoit coeure", "sentiment": "none"}], "locations": [{"name": "ireland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* New MiFID II financial rules take effect\n* Most euro zone bond yields lower on day\n* Ireland launches 10-year syndicated bond\n* ECB’s Nowotny says bond buying could end in 2018\n* Euro zone periphery govt bond yields tmsnrt.rs/2ii2Bqr (Updates prices)\nBy Fanny Potkin\nLONDON, Jan 3 (Reuters) - Euro area borrowing costs edged lower on Wednesday, as a sweeping reform of EU financial market rules took effect a day after hawkish comments by ECB rate-setters triggered a sharp bond market sell-off.\nGermany’s 10-year government bond yield fell 2 basis points to 0.44 percent, off two-month highs hit on Tuesday after weekend comments from the European Central Bank’s Benoit Coeure that there was a “reasonable chance” ECB stimulus will not be extended this year.\nIt held near those highs in early trade after ECB rate setter Ewald Nowotny echoed those comments in a German newspaper, before heading down.\nAnalysts said that a significant bond redemption in Germany helped explain the fall in yields.\nMost core euro zone bond yields were down 1-4 bps on the day, with the gap between Italian and German 10-year bonds yields tightened to 160 basis points as Italian yields dropped as much as 6 bps to 2.03 percent.\n“We’ve come a long way down in prices and we had a redemption in Germany, so there many have been some cash being put back to work,” said Orlando Green, European fixed income strategist at Credit Agricole.\nIreland meanwhile kicked off its annual funding drive by raising 4 billion euros with a syndicated 10-year bond, covering around a quarter of its issuance target just three days into the year.\nEuropean stock and bond volumes were generally light after major new securities regulations came into force, although traders said there was little in the way of serious disruption.\nUnder the new MiFID II - or Markets in Financial Instruments Directive II - rules, trades in financial assets and instruments must all be logged in a repository, forcing banks, asset managers and traders to report detailed information on trillions of euros of transactions.\nFixed income volumes were lower at 1000 GMT compared to their average at that time over the previous 30 days, according to data provider Trax, a subsidiary of MarketAxess that tracks around 65 percent of all secondary market deals.\nThe new regulatory regime was delayed by a year due to its complexity, and regulators have had to issue eleventh-hour guidance to banks and financial firms to avoid trading freezes as well as calming the nerves of those not yet fully compliant.\nStrategists said they expected investors to refrain from making large trades until they had a clearer sense of the impact of the reform.\nBond investors were also keeping a close eye on the U.S Federal Reserve’s December meeting minutes due later in the day.\nReporting by Fanny Potkin; Additional reporting by Dhara Ranasinghe; editing by Richard Balmforth\n ", "external_links": ["http://tmsnrt.rs/2ii2Bqr", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-03T17:32:00.000+02:00", "crawled": "2018-01-03T19:29:45.004+02:00", "highlightTitle": ""}