{"organizations": [], "uuid": "1fdaea6959a6a59e31d4f65e242d8ef5fde93874", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-yen-climbs-as-bojs-move-fuels-tightening-speculation-idUSL8N1P4150", "country": "US", "domain_rank": 408, "title": "FOREX-Yen climbs as BoJ's move fuels tightening speculation", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:54:00.000+02:00", "replies_count": 0, "uuid": "1fdaea6959a6a59e31d4f65e242d8ef5fde93874"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-yen-climbs-as-bojs-move-fuels-tightening-speculation-idUSL8N1P4150", "ord_in_thread": 0, "title": "FOREX-Yen climbs as BoJ's move fuels tightening speculation", "locations": [], "entities": {"persons": [{"name": "jemima kelly", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "bank of japan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "boj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Yen hits five-day high after BoJ trims buying in long-dated JGBs\n* Euro below $1.20 on profit-taking after record long positions\n* Dollar index edges up\n* Graphic: World FX rates in 2017 tmsnrt.rs/2egbfVh\nBy Jemima Kelly\nLONDON, Jan 9 (Reuters) - The yen reached a five-day high on Tuesday, after the Bank of Japan trimmed its purchases of long-dated government bonds in market operations, stoking speculation the central bank could start to wind down its huge stimulus policy this year.\nSince it adopted its yield-curve-control policy in 2016, the BOJ has occasionally tweaked its bond operations, with officials saying any changes are meant to keep bond yields in line with its policy goal and not to telegraph hints on its future policy .\nBut while Tuesday’s move was considered largely technical, it surprised some market players and emboldened those analysts who see an exit from the monetary easing programme coming by the end of in 2018.\nThe yen rose as much as half a percent to 112.50 yen to the dollar, rebounding from the two-week low of 113.40 per dollar it touched on Monday, before easing back to 112.81 yen by 0815 GMT, still up 0.3 percent on the day.\n“Speculation is increasing that the Bank of Japan could tighten policy this year, but in my opinion that’s not justified,” said Commerzbank currency strategist Esther Reichelt, in Frankfurt.\nMost economists surveyed in a Reuters poll in December said the BoJ would start scaling back its stimulus in late 2018 or after.\nThe euro - which last week threatened to reach its highest levels in three year, hitting a four-month high - slipped further below $1.20, trading down 0.2 percent on the day at a ten-day low of $1.1941, with investors cautious after a months-long rally.\n“I don’t think right now levels substantially above $1.20 are justified,” Reichelt said. “I know the market is very optimistic about the euro, but if you look at the data and the central bank, the ECB (European Central Bank) is still on an expansionary path.”\nMany analysts said a correction was inevitable for the common currency after an almost 5 percent rally against the dollar in just six weeks thanks to signs of acceleration in the euro zone economy.\nSpeculators’ net long position in euro/dollar futures in Chicago reached a record high last week, data from the Commodity Futures Trading Commission showed on Friday, pointing to potential for profit-taking.\n“The euro is going through a consolidation after it had reached high levels above $1.20. Friday’s euro zone inflation data was somewhat weaker than expected,” said Shinichiro Kadota, senior FX and rates strategist at Barclays in Tokyo.\n“Going forward, the market’s outlook depends more on U.S. factors,” he said.\nThe dollar index, which measures the greenback against a basket of six major currencies, edged up 0.1 percent to 92.484 .\nFor Reuters Live Markets blog on European and UK stock markets see reuters://realtime/verb=Open/url=http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets\nReporting by Jemima Kelly, additional reporting by Hideyuki Sano in Tokyo, editing by Larry King\n ", "external_links": ["http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets", "http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T16:54:00.000+02:00", "crawled": "2018-01-10T03:04:30.001+02:00", "highlightTitle": ""}