{"organizations": [], "uuid": "90abee82beb3e2ad917b753129f75bb5c5fd5227", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/business-wire-allied-motion-acquires-original-equipment-steering-business-from-maval-industries.html", "country": "US", "domain_rank": 767, "title": "Allied Motion Acquires Original Equipment Steering Business from Maval Industries", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.101, "site_type": "news", "published": "2018-01-19T19:47:00.000+02:00", "replies_count": 0, "uuid": "90abee82beb3e2ad917b753129f75bb5c5fd5227"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/business-wire-allied-motion-acquires-original-equipment-steering-business-from-maval-industries.html", "ord_in_thread": 0, "title": "Allied Motion Acquires Original Equipment Steering Business from Maval Industries", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "maval industries amherst", "sentiment": "none"}, {"name": "twinsburg", "sentiment": "none"}, {"name": "maval", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "allied motion technologies inc.", "sentiment": "negative"}, {"name": "maval oe", "sentiment": "none"}, {"name": "torque capital group", "sentiment": "none"}, {"name": "maval industries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AMHERST, N.Y.--(BUSINESS WIRE)-- Allied Motion Technologies Inc. (NASDAQ: AMOT) (“Company”), a designer and manufacturer that sells precision motion control products and solutions to the global market, announced today that it has purchased substantially all of the operating assets associated with the original equipment (“OE”) steering business of Maval Industries, LLC (“Maval”). Allied Motion focuses on designing and selling motion components and systems to original equipment manufacturers and end users through direct and distribution sales channels. Consistent with Allied’s strategy to provide higher level system solutions, the addition of the Maval OE product line enables Allied to provide a fully integrated steering system solution to its customers.\nFounded in 1987 and located in Twinsburg, Ohio, Maval is a leading provider of both new and remanufactured steering system components for the automotive, off-road, performance and specialty vehicle markets. Torque Capital Group acquired Maval in October 2016 and consistent with its strategy to focus on aftermarket and re-man product manufacturing and sales, agreed to sell the OE product line to Allied Motion.\n“We believe this acquisition is an excellent strategic fit with Allied Motion as it adds complementary technology, provides deeper customer penetration and improves our ability to create more value for our customers,” commented Dick Warzala, Chairman and CEO of Allied Motion. “We are very familiar with Maval, having already worked together on the development of new design technologies that leverage the Maval mechanical products and the Allied electronics, motor and gearing technologies to create additional customer value by providing an integrated steering solution. The combination of the capabilities of both companies, now under the Allied One-Team umbrella, will provide our customers with a streamlined supply base and single point of contact for all their steering needs. We welcome the Maval employees that are joining the Allied Motion Team and we look forward to an exciting future together.”\nGiven the costs associated with working through a shared services agreement and completing the production carve-out/separation of the businesses, the acquisition is expected to be neutral to slightly accretive to earnings for Allied in 2018. Once the carve-out is complete, the business will be located entirely within its own dedicated facility in Twinsburg, OH.\nAbout Allied Motion Technologies Inc.\nAllied Motion (NASDAQ: AMOT) designs, manufactures and sells precision and specialty motion control components and systems used in a broad range of industries within our major served markets, which include Vehicle, Medical, Aerospace & Defense, and Industrial/Electronics. The Company is headquartered in Amherst, NY, has global operations and sells into markets across the United States, Canada, South America, Europe and Asia.\nAllied Motion is focused on motion control applications and is known worldwide for its expertise in electro-magnetic, mechanical and electronic motion technology. Its products include brush and brushless DC motors, brushless servo and torque motors, coreless DC motors, integrated brushless motor-drives, gear motors, gearing, modular digital servo drives, motion controllers, incremental and absolute optical encoders, and other associated motion control-related products.\nThe Company’s growth strategy is focused on becoming the motion solution leader in its selected target markets by leveraging its “technology/know how” to develop integrated precision motion solutions that utilize multiple Allied Motion technologies to “change the game” and create higher value solutions for its customers. The Company routinely posts news and other important information on its website at http://www.alliedmotion.com/ .\nSafe Harbor Statement\nThe statements in this news release that relate to future plans, events or performance are “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements include, without limitation, any statement that may predict, forecast, indicate, or imply future results, performance, or achievements, and may contain the word “believe,” “anticipate,” “expect,” “project,” “intend,” “will continue,” “will likely result,” “should” or words or phrases of similar meaning. Forward-looking statements involve known and unknown risks and uncertainties that may cause actual results to differ materially from the expected results described in the forward-looking statements. The risks and uncertainties include those associated with: the domestic and foreign general business and economic conditions in the markets we serve, including political and currency risks and adverse changes in local legal and regulatory environments; the introduction of new technologies and the impact of competitive products; the ability to protect the Company’s intellectual property; our ability to sustain, manage or forecast its growth and product acceptance to accurately align capacity with demand; the continued success of our customers and the ability to realize the full amounts reflected in our order backlog as revenue; the loss of significant customers or the enforceability of the Company’s contracts in connection with a merger, acquisition, disposition, bankruptcy, or otherwise; our ability to meet the technical specifications of our customers; the performance of subcontractors or suppliers and the continued availability of parts and components; changes in government regulations; the availability of financing and our access to capital markets, borrowings, or financial transactions to hedge certain risks; the Company's ability to realize the annual interest expense savings from its debt refinancing; the ability to attract and retain qualified personnel who can design new applications and products for the motion industry; the ability to implement our corporate strategies designed for growth and improvement in profits including to identify and consummate favorable acquisitions to support external growth and the development of new technologies; the ability to successfully integrate an acquired business into our business model without substantial costs, delays, or problems, including the ability to carve out, relocate and separate the Maval OE business; our ability to control costs, including the establishment and operation of low cost region manufacturing and component sourcing capabilities; and other risks and uncertainties detailed from time to time in the Company’s SEC filings. Actual results, events and performance may differ materially. Readers are cautioned not to place undue reliance on these forward-looking statements as a prediction of actual results. Any forward-looking statement speaks only as of the date on which it is made. New risks and uncertainties arise over time, and it is not possible for us to predict the occurrence of those matters or the manner in which they may affect us. The Company has ", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.alliedmotion.com%2F&esheet=51745976&newsitemid=20180119005532&lan=en-US&anchor=Allied+Motion+Technologies+Inc.&index=1&md5=b349d9a9e52fbc1b269ab89f8d6f48e8", "http://www.businesswire.com/news/home/20180119005532/en/", "http://www.alliedmotion.com/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.alliedmotion.com%2F&esheet=51745976&newsitemid=20180119005532&lan=en-US&anchor=http%3A%2F%2Fwww.alliedmotion.com%2F&index=2&md5=5a343523ea0b443e332adfd74147ccd1"], "published": "2018-01-19T19:47:00.000+02:00", "crawled": "2018-01-19T22:53:59.012+02:00", "highlightTitle": ""}