{"organizations": [], "uuid": "91ee38c2f4fafe50071596d940209b7edfe24246", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1225956096&w=1200&r=LYNXMPEE0R03Y", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-india-budget-divestiture/india-likely-to-put-pedal-to-metal-on-asset-sales-idUSKBN1FH04T", "country": "US", "domain_rank": 408, "title": "India likely to put pedal to metal on asset sales", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T08:30:00.000+02:00", "replies_count": 0, "uuid": "91ee38c2f4fafe50071596d940209b7edfe24246"}, "author": "", "url": "https://www.reuters.com/article/us-india-budget-divestiture/india-likely-to-put-pedal-to-metal-on-asset-sales-idUSKBN1FH04T", "ord_in_thread": 0, "title": "India likely to put pedal to metal on asset sales", "locations": [], "entities": {"persons": [{"name": "devidutta", "sentiment": "negative"}, {"name": "manoj kumar", "sentiment": "none"}, {"name": "tripathy", "sentiment": "none"}, {"name": "arun jaitley", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 6:40 AM / in 8 hours India likely to put pedal to metal on asset sales Devidutta Tripathy , Manoj Kumar 5 Min Read \nMUMBAI/NEW DELHI (Reuters) - India’s government may look to raise as much as a record 1 trillion rupees ($15.7 billion) from the sale of state assets in the next fiscal year to help meet tough fiscal deficit limits while giving it room to boost spending and woo voters before general elections that must be called by early 2019. \nInvestment bankers and economists expect the finance minister, Arun Jaitley, to set an ambitious target for the year beginning on April 1 following strong sales in the current fiscal year to the end of March. \nThe government is on track to raise about 925 billion rupees this fiscal year after state-run ONGC ( ONGC.NS ), an upstream oil company, agreed to pay 369 billion rupees to buy just over 51 percent of refiner HPCL ( HPCL.NS ). \nThe deal is set to close this month and would take the government’s asset-sales tally beyond the budget goal of 725 billion rupees, marking the first time in eight years that India had exceeded its targets. \nThe government accelerated asset sales in this current fiscal year after a chaotic rollout of a new national goods and services tax undermined tax collection targets. \nAs part of a goal to gradually bring down the fiscal deficit, India’s government has set a target for the current fiscal year of limiting the deficit to 3.2 percent of GDP and to 3 percent for the upcoming year. Analysts say the government is likely to miss this year’s target and may also revise next year’s goal. \nBuoyed by this year’s bumper sales and with India’s stock markets at record highs, market participants expect Jaitley to unveil an asset-sale target of between 600 billion rupees and 1.2 trillion rupees when he unveils the fiscal 2018/19 budget on Feb. 1. \n“Between this year and next year, I see them doing 2 trillion rupees worth of divestments,” said a senior banker who has worked closely with India’s Department of Investment and Public Asset Management on stake sales. \n“We still have two months left in this fiscal year. If the big ones still expected this year do not happen by March, those would add to the proceeds next year - so I’d look for 1 trillion plus next year,” said the banker, declining to be named as he is not authorized to speak to the media about the government’s plans. \nThe top bureaucrat overseeing the asset sales program, Neeraj Gupta, declined to be interviewed on the plans for asset sales. STRONG PIPELINE \nAnother government official, who also asked not to be identified, said the government may set a divestment target of at least 600 billion rupees to 700 billion rupees in 2018/19. \nCitigroup and Deutsche Bank estimated asset-sale proceeds would top 1 trillion rupees, while Credit Suisse, Goldman Sachs, Macquarie Bank and Morgan Stanley forecast 650 billion rupees to 900 billion rupees. \nThe government official said the government’s efforts to sell a majority stake in flag-carrier Air India [AIN.UL] is expected to close in 2018. \nFour state-run companies including guided weapon systems maker Bharat Dynamics and engineering consultant Rites Ltd have filed preliminary applications in the past month for initial public offerings that would likely happen in fiscal 2018/2019. \nIndia has also sought advisers to help it sell stakes in nearly 20 companies, including several more IPOs based on proposals for adviser appointments reviewed by Reuters. \nThe government is planning secondary sales in two of India’s biggest companies, Indian Oil ( IOC.NS ) and Coal India ( COAL.NS ), and an IPO in Hindustan Aeronautics. Banking advisers for those deals have been named. \nA proposed sale of 10 percent stake in Coal India would be worth 185 billion rupees ($2.9 billion), while a planned 3 percent stake sale in Indian Oil would be worth 57 billion rupees ($897 million), based on their current share prices. The government owned 78.6 percent of Coal India and 57 percent of Indian Oil at the end December. \nThe government has said it plans to take three more general insurance companies public after listing two in 2017, and bankers expect at least one of those sales to happen in 2018/19. \nMore oil sector deals could also be in the offing, bankers said, because Indian Oil and Bharat Petroleum Corp Ltd ( BPCL.NS ) have expressed interest in buying stakes in two other state-run oil companies. \nA government of India vehicle SUUTI is sitting on stakes in three big private-sector companies worth nearly $8 billion, and has already tapped banks to sell part of these stakes down the road. Reporting by Devidutta Tripathy and Manoj Kumar; Editing by Euan Rocha and Neil Fullick", "external_links": [], "published": "2018-01-28T08:30:00.000+02:00", "crawled": "2018-01-28T09:50:06.003+02:00", "highlightTitle": ""}