{"organizations": [], "uuid": "0bfc1c93dd7b5e497418cee15f4100a688a10954", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-metals/metals-shanghai-copper-sinks-after-lme-inventory-jump-idUSL4N1PJ1G5", "country": "US", "domain_rank": 408, "title": "METALS-Shanghai copper sinks after LME inventory jump", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T04:16:00.000+02:00", "replies_count": 0, "uuid": "0bfc1c93dd7b5e497418cee15f4100a688a10954"}, "author": "", "url": "https://www.reuters.com/article/global-metals/metals-shanghai-copper-sinks-after-lme-inventory-jump-idUSL4N1PJ1G5", "ord_in_thread": 0, "title": "METALS-Shanghai copper sinks after LME inventory jump", "locations": [], "entities": {"persons": [], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "lme", "sentiment": "negative"}, {"name": "london metal exchange", "sentiment": "none"}, {"name": "shanghai futures exchange", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "lme mcustx-total", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING, Jan 24 (Reuters) - Shanghai copper prices fell as much as 2.1 percent in early trade to a six-week low on Wednesday, tracking a sharp decline in London on Tuesday after London Metal Exchange refined copper inventories surged. FUNDAMENTALS * The most-traded March copper contract on the Shanghai Futures Exchange was down 1.7 percent to 52,750 yuan ($8,251.73) a tonne, as of 0214 GMT. Earlier in the session, it hit 52,520 yuan a tonne, the lowest since Dec. 14, 2017. * Three-month copper on the LME gained 0.4 percent to $6,947.50 a tonne, partly recovering from a 2.1 percent drop to a one-month low in the previous session. * LME stocks: On-warrant copper stocks - metal not earmarked for delivery from warehouses and available for investors - in facilities certified by the LME MCUSTX-TOTAL jumped by 28 percent on Tuesday, data showed. * USD: The dollar index edged down 0.1 percent to a three-year low. A weak greenback makes dollar-denominated metals cheaper for holders of other currencies and lends support to prices. * LEAD: ShFE lead continued its recent rally amid tight lead stocks and output curbs in China on environmental grounds, climbing 0.8 percent to 19,735 yuan a tonne. * CHILE: Chile's conservative President-elect Sebastian Pinera on Tuesday named a former finance minister in the top copper exporter, Felipe Larrain, to fill the same spot again in his new cabinet. * SCRAP: China's imports of scrap copper fell 19.8 percent in December from a year earlier, customs data showed on Tuesday, as the country continues a clampdown on taking foreign waste. * BRAZIL: Anglo American PLC said on Tuesday it expects to receive long-awaited licenses on Friday which will pave the way for the mining company to boost its Brazilian iron ore production capacity by about 56 percent. For the top stories in metals and other news, click or MARKETS NEWS * Asian shares scaled record peaks on Wednesday as strong corporate earnings and optimism on global growth outweighed concerns over trade tensions, while a fresh burst of speculative selling took the U.S. dollar to three-year lows. {MKTS/GLOB] DATA AHEAD (GMT) 0800 France Markit manufacturing flash PMI Jan 0830 Germany Markit manufacturing flash PMI Jan 0900 Euro zone Markit manufacturing flash PMI Jan 1400 U.S. Monthly home price index Nov 1445 U.S. Markit manufacturing flash PMI Jan 1500 U.S. Existing home sales PRICES BASE METALS PRICES 0146 GMT Three month LME copper 6947.5 Most active ShFE copper 52730 Three month LME aluminium 2226.5 Most active ShFE aluminium 14640 Three month LME zinc 3420.5 Most active ShFE zinc 26145 Three month LME lead 2617 Most active ShFE lead 19720 Three month LME nickel 12840 Most active ShFE nickel 99220 Three month LME tin 20730 Most active ShFE tin 146490 BASE METALS ARBITRAGE LME/SHFE COPPER LMESHFCUc3 941.15 LME/SHFE ALUMINIUM LMESHFALc3 -1903.27 LME/SHFE ZINC LMESHFZNc3 261.2 LME/SHFE LEAD LMESHFPBc3 -519.33 LME/SHFE NICKEL LMESHFNIc3 2037.73 ($1 = 6.3926 Chinese yuan) (Reporting by Tom Daly; Editing by Sherry Jacob-Phillips)\n ", "external_links": [], "published": "2018-01-24T04:16:00.000+02:00", "crawled": "2018-01-24T04:29:34.015+02:00", "highlightTitle": ""}