{"organizations": [], "uuid": "715f9ccc0d9c5ea3fdae5346d3cbe5cd1fbedbd9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 106}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://img1.southernliving.timeinc.net/sites/default/files/styles/story_card_hero/public/gettyimages-52780134_0.jpg?itok&#x3D;y4RNc1_h", "site_section": "http://feeds.southernliving.com/SouthernLiving/latest", "section_title": "Southern Living | Editor's Picks", "url": "https://fortune.com/2018/01/02/amazon-second-headquarters/", "country": "US", "domain_rank": 1196, "title": "Amazon's New Headquarters: Atlanta and Austin Lead Odds to Start 2018", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T23:40:00.000+02:00", "replies_count": 0, "uuid": "715f9ccc0d9c5ea3fdae5346d3cbe5cd1fbedbd9"}, "author": "Southern Living", "url": "https://fortune.com/2018/01/02/amazon-second-headquarters/", "ord_in_thread": 0, "title": "Amazon's New Headquarters: Atlanta and Austin Lead Odds to Start 2018", "locations": [], "entities": {"persons": [{"name": "barry williams getty images je", "sentiment": "negative"}, {"name": "john roberts", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}, {"name": "tex", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Amazon's New Headquarters: Atlanta and Austin Lead Odds to Start 2018 Barry Williams Getty Images Jeff John Roberts January 2, 2018 \nAmazon will make a big splash in 2018 by announcing the location of its second corporate headquarters—a prize expected to bring prestige and as many as 50,000 high paying jobs to the winning city. \nWhen cities submitted their bids in late October, Fortune turned to a popular betting site to see which of the more than 200 candidates had the early edge. Fast forward to the new year, and the initial favorite —Atlanta—is still at the top of the list, but its chances have declined from 2/1 to 3/1 and it now shares the perch with Southern rival, Austin, Tex. \nHere is a screenshot of the latest odds, pulled from PaddyPower, an Irish betting site that lets people put their money where their mouth is on everything from sports to world events: Fortune \nAs you can see by comparing the above list to the original odds below, there have been a number of other developments in the race to attract Amazon . These include a larger list of contenders to bet on (from 13 to 23), and a slight improvement in the outlook for the cities of Philadelphia and Washington, DC. Fortune \nHere are some other developments worth noting: Chicago and Denver, which represents two notable omissions from the first list, and are now there but are marked as relative long shots (16/1 and 20/1) Boston, which is regularly mentioned as one of the favorites, is still hanging tough but has fallen slightly from 6/1 to 7/1 The prospects for Toronto have dimmed significantly, from 7/1 to 16/1. \nOverall, the three leading candidates—Atlanta, Austin and Boston—are not a surprise since they all possess many criteria Amazon is seeking, including a tech savvy workforce and urban amenities. Moreover, their location may prove an advantage since most people think it’s unlikely Amazon will add a second headquarters on the west coast. \nWATCH: The Best-Selling Grits on Amazon Come from This Tiny Southern Town \nGet Data Sheet , Fortune’s technology newsletter. \nMeanwhile, the chances of Toronto or any other non-American city seem far-fetched since it would give President Trump, who has already been assailing Amazon, an excuse to pummel the company for a lack of patriotism. \nFinally, while there has been little in the way of leaks during the process, the city of Atlanta may take encouragement from reports that Amazon recently engaged a lobbyist there. \nSites like PaddyPower (which does not accept bets from Americans) may seem frivolous to some, but many economists view them as valuable “ prediction markets ,” which provide insight into real world outcomes. You May Like", "external_links": [], "published": "2018-01-02T23:40:00.000+02:00", "crawled": "2018-01-03T03:16:21.008+02:00", "highlightTitle": ""}