{"organizations": [], "uuid": "f49ce58d29449e0f38c9acbd858c0e36ff57f075", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218747297&w=1200&r=LYNXMPEE0106N", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-china-csl/hulk-determined-to-deliver-sipgs-first-title-in-2018-idUKKBN1ER0BW", "country": "US", "domain_rank": 408, "title": "Hulk determined to deliver SIPG's first title in 2018", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T08:56:00.000+02:00", "replies_count": 0, "uuid": "f49ce58d29449e0f38c9acbd858c0e36ff57f075"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-china-csl/hulk-determined-to-deliver-sipgs-first-title-in-2018-idUKKBN1ER0BW", "ord_in_thread": 0, "title": "Hulk determined to deliver SIPG's first title in 2018", "locations": [], "entities": {"persons": [{"name": "hulk", "sentiment": "none"}, {"name": "vitor pereira", "sentiment": "none"}], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "zenit st petersburg", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "sipg", "sentiment": "neutral"}, {"name": "sipg football club", "sentiment": "none"}, {"name": "chinese super league", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 6:59 AM / Updated an hour ago Hulk determined to deliver SIPG's first title in 2018 Reuters Staff 3 Min Read \nHONG KONG (Reuters) - Brazilian striker Hulk will start his third season with Shanghai SIPG next month determined to deliver a trophy to the big-spending Chinese Super League club in the new campaign. Brazilian football player Hulk attends the 2017 SIPG Football Club's season mobilization of the Chinese Super League, in Shanghai, China February 13, 2017. REUTERS/Aly Song \nThe burly forward signed for a then-record 55 million euros ($66.13 million) from Zenit St Petersburg in the summer of 2016 but has yet to claim any silverware during his time in China. \nBut the 31-year-old is focused on delivering the club’s first trophy in the 2018 season with new coach Vitor Pereira at the helm. \n“I’ve been with SIPG a year and a half now and I‘m desperate to win a championship,” he told Chinese media. “I hope we can do it in the new season. I’ll try 100 percent to help my team and my team mates.” \nSIPG finished second behind perennial Chinese Super League champions Guangzhou Evergrande last season while they were also runners-up in the Chinese FA Cup and semi-finalists in the Asian Champions League. \nCoach Andre Villas-Boas left after just one season and has been replaced by his Portuguese compatriot Pereira, a man Hulk knows from his time working under the 49-year-old at Porto. \n”I know Pereira well,“ Hulk said. ”He’s a very good coach who is ambitious. He has been keeping us on the right track on a daily basis and I hope his leadership can improve our results. \n”Now there’s a great atmosphere in the team. It’s nice to have this kind of atmosphere at the start of the season and it will put us in a good frame of mind going into the New Year. \n“Hopefully God will bless us with a great year and better achievements.” \nHulk’s position as the most expensive player in Asia was taken by his compatriot Oscar, who signed for Shanghai from Chelsea last January, providing SIPG with one of the most potent attacking forces on the continent. \nThe pair are joined by fellow Brazilian Elkeson as well as veteran defender Ricardo Carvalho and Uzbekistan’s Odil Ahmedov as the club’s foreign players. \nNew rules in the Chinese Super League, however, will allow teams to field no more than three foreigners in each game while forcing coaches to select the same number of Chinese players under the age of 23 as the non-Chinese players in their starting line-up. \nThe amendment to the regulations is certain to have a major impact on the upcoming campaign, but Hulk believes the added competition for places among the overseas players will beneficial to the team. \n“As far as the international competition between the foreign players in the team is concerned, it will be a difficult choice for the coach but it will be a good thing for the team because we have a good pool of players to choose from,” he said. \n“What we need to do is perform well in training.” \n($1 = 0.8317 euros)", "external_links": [], "published": "2018-01-02T08:56:00.000+02:00", "crawled": "2018-01-02T09:18:00.008+02:00", "highlightTitle": ""}