{"organizations": [], "uuid": "283e6eca81158c1d9815829a27520b6ca50e1b24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-virtus-global-multi-sector-income-fund-declares-distribution-and-discloses-sources-of-distribution--section-19a-notice.html", "country": "US", "domain_rank": 767, "title": "Virtus Global Multi-Sector Income Fund Declares Distribution and Discloses Sources of Distribution - Section 19(a) Notice", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T22:27:00.000+02:00", "replies_count": 0, "uuid": "283e6eca81158c1d9815829a27520b6ca50e1b24"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-virtus-global-multi-sector-income-fund-declares-distribution-and-discloses-sources-of-distribution--section-19a-notice.html", "ord_in_thread": 0, "title": "Virtus Global Multi-Sector Income Fund Declares Distribution and Discloses Sources of Distribution - Section 19(a) Notice", "locations": [], "entities": {"persons": [], "locations": [{"name": "hartford", "sentiment": "none"}, {"name": "conn.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HARTFORD, Conn., Jan. 2, 2018 /PRNewswire/ -- Virtus Global Multi-Sector Income Fund (NYSE: VGI) announced the following monthly distribution:\nAmount of Distribution\nEx-Date\nRecord Date\nPayable Date\n$0.156\nJanuary 4, 2018\nDecember 29, 2017\nJanuary 9, 2018\nUnder the terms of the fund's managed distribution plan, the fund will seek to maintain a consistent distribution level that may be paid in part or in full from net investment income and realized capital gains, or a combination thereof. Shareholders should note, however, that if the fund's aggregate net investment income and net realized capital gains are less than the amount of the distribution level, the difference will be distributed from the fund's assets and will constitute a return of the shareholder's capital. You should not draw any conclusions about the fund's investment performance from the amount of this distribution or from the terms of the fund's managed distribution plan.\nThe fund provided this estimate of the sources of the distributions:\nDistribution Estimates\nDecember 2017 (MTD)\nYear-to-date (YTD) (1)\n(Sources)\nPer Share\nAmount\nPercentage\nof Current\nDistribution\nPer Share\nAmount\nPercentage\nof Current\nDistribution\nNet Investment Income\n$ 0.073\n46.5%\n$ 0.073\n46.5%\nNet Realized Short-Term Capital Gains\n0.001\n0.9%\n0.001\n0.9%\nNet Realized Long-Term Capital Gains\n0.082\n52.6%\n0.082\n52.6%\nReturn of Capital (or other Capital Source)\n-\n0.0%\n-\n0.0%\nTotal Distribution\n$ 0.156\n100.0%\n$ 0.156\n100.0%\n(1) YTD December 1, 2017 to November 30, 2018.\nInformation regarding the fund's performance and distribution rates is set forth below. Please note that all performance figures are based on the fund's NAV and not the market price of the fund's shares. Performance figures are not meant to represent individual shareholder performance.\nAs of December 29, 2017\nAverage Annual Total Return on NAV for the 5 year period (2)\n7.90%\nCurrent Fiscal YTD Annualized Distribution Rate (3)\n10.88%\nYTD Cumulative Total Return on NAV (4)\n1.62%\nYTD Cumulative Distribution Rate (5)\n0.91%\n(2) Average Annual Total Return on NAV is the annual compound return for the five-year period. It reflects the change in the fund's NAV and reinvestment of all distributions\n(3) Current Fiscal YTD Annualized Distribution Rate is the current distribution rate annualized as a percentage of the fund's NAV at month end.\n(4) YTD Cumulative Total Return on NAV is the percentage change in the fund's NAV from the first day of the year to this month end, including distributions paid and assuming reinvestment of those distributions.\n(5) YTD Cumulative Distribution Rate is the dollar value of distributions from the first day of the year to this month end as a percentage of the fund's NAV at month end.\nThe amounts and sources of distributions reported in this notice are estimates only and are not being provided for tax reporting purposes. The actual amounts and sources of the distributions will depend on the fund's investment experience during the remainder of its fiscal year and may be subject to changes based on tax regulations. The fund or your broker will send shareholders a Form 1099-DIV for the calendar year that will tell shareholders what distributions to report for federal income tax purposes.\nAbout the Fund\nThe Virtus Global Multi-Sector Income Fund seeks to maximize current income while preserving capital by giving investors an opportunity to benefit from broadly diversified holdings across the major domestic and international fixed-income sectors. It is managed by Newfleet Asset Management, LLC, an affiliated manager of Virtus Investment Partners, Inc. that specializes in multi-sector fixed income investing. For more information on the Fund, contact shareholder services at (866) 270-7788, by email at closedendfunds@virtus.com , or through the closed end fund section on the web at www.virtus.com .\nAn investment in the fund is subject to risk. The fund's shares may be worth less than what an investor paid for them when they are sold. The options strategy may not be successful in its objective of increasing distributable income while limiting the risk of loss and could result in increased losses for investors.\nFund Risks\nAn investment in a fund is subject to risk, including the risk of possible loss of principal. A fund's shares may be worth less upon their sale than what an investor paid for them. Shares of closed-end funds may trade at a discount to their net asset value. For more information about each fund's investment objective and risks, please see the fund's annual report. A copy of the fund's most recent annual report may be obtained free of charge by contacting \"Shareholder Services\" as set forth at the end of this press release.\nAbout Newfleet Asset Management\nNewfleet Asset Management , an affiliated manager of Virtus Investment Partners, provides comprehensive fixed income portfolio management in multiple strategies. The Newfleet Multi-Sector Strategies team that manages the Virtus Global Multi-Sector Income Fund leverages the knowledge and skill of investment professionals with expertise in every sector of the bond market, including evolving, specialized, and out-of-favor sectors. The team employs active sector rotation and disciplined risk management to portfolio construction, avoiding interest rate bets and remaining duration neutral to each strategy's stated benchmark.\nAbout Virtus Investment Partners\nVirtus Investment Partners (NASDAQ: VRTS) is a distinctive partnership of boutique investment managers singularly committed to the long-term success of individual and institutional investors. For more information visit www.virtus.com.\nView original content with multimedia: http://www.prnewswire.com/news-releases/virtus-global-multi-sector-income-fund-declares-distribution-and-discloses-sources-of-distribution--section-19a-notice-300576555.html\nSOURCE Virtus Global Multi-Sector Income Fund", "external_links": ["https://www.virtus.com/investment-partners/newfleet-asset-management-llc", "http://www.virtus.com/", "https://www.virtus.com/products/virtus-global-multi-sector-income-fund", "https://www.virtus.com/", "https://www.virtus.com/our-products/individual-investors/closed-end-funds", "http://www.prnewswire.com/news-releases/virtus-global-multi-sector-income-fund-declares-distribution-and-discloses-sources-of-distribution--section-19a-notice-300576555.html"], "published": "2018-01-02T22:27:00.000+02:00", "crawled": "2018-01-02T23:40:54.015+02:00", "highlightTitle": ""}