{"organizations": [], "uuid": "d7ba7ec77afe5f6156a26a5d4bb2dff499a79f0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/cnbc-transcript-commerce-secretary-wilbur-ross-speaks-with-joe-kernen-today.html", "country": "US", "domain_rank": 767, "title": "CNBC TRANSCRIPT: COMMERCE SECRETARY WILBUR ROSS SPEAKS WITH JOE KERNEN TODAY", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T18:34:00.000+02:00", "replies_count": 0, "uuid": "d7ba7ec77afe5f6156a26a5d4bb2dff499a79f0d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/cnbc-transcript-commerce-secretary-wilbur-ross-speaks-with-joe-kernen-today.html", "ord_in_thread": 0, "title": "CNBC TRANSCRIPT: COMMERCE SECRETARY WILBUR ROSS SPEAKS WITH JOE KERNEN TODAY", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WHEN: Today, Wednesday, January 31, 2018\nWHERE: CNBC's \"Squawk Box\"\nFollowing is the unofficial transcript of a CNBC interview with commerce secretary Wilbur Ross and CNBC's Joe Kernen on CNBC's \"Squawk Box\" (M-F 6AM-9AM) today, Wednesday, January 31st. Following are links to video from the interview on CNBC.com: https://www.cnbc.com/video/2018/01/31/commerce-secretary-wilbur-ross-made-progess-on-easy-issues-with-nafta-but-its-far-from-finished.html?play=1 & https://www.cnbc.com/video/2018/01/31/tpp-group-of-11-dont-have-their-act-together-yet-says-secretary-wilbur-ross.html?play=1 .\nAll references must be sourced to CNBC.\nJOE KERNEN: JOINING US NOW, COMMERCE SECRETARY WILBUR ROSS. I LOVE, YOU KNOW, SPEECHES FOR WHAT THEY'RE WORTH, WILBUR, BUT I REALLY WANT TO LOOK AHEAD AND FIGURE OUT WHAT YOU CAN TELL US ABOUT SOME UPCOMING STUFF IN TERMS OF NAFTA, FOR EXAMPLE, AND IN TERMS OF WHETHER THERE REALLY IS GOING TO BE ANOTHER ATTEMPT AT MULTI-LATERAL STUFF THAT WE HEARD LAST WEEK WITH TPP. BEHIND THE SCENES AND ALSO WHAT, YOU KNOW, THE NEXT STEP WITH CHINA. WE HAD SOLAR PANELS AND WASHING MACHINES. CAN YOU ADDRESS ALL THREE OF THOSE? WHERE ARE WE ON NAFTA? WILL WE THERE BE – WILL WE TRY TO GET IN TPP NOW THAT IT'S ALREADY MOVING FORWARD? WAS THAT REAL OR JUST SORT OF A TRIAL BALLOON? WHAT DO YOU KNOW?\nWILBUR ROSS: WELL, NAFTA JUST IS CONCLUDING ITS THIR— SIXTH SERIES OF TALKS. THE ONES UP IN MONTREAL JUST GOT FINISHED. THEY'VE MADE SOME PROGRESS AGAIN ON EASY ISSUES. VERY LITTLE HAS BEEN DONE ON THE HARD ISSUES. BUT THERE IS ANOTHER ROUND THAT WILL BE IN ANOTHER SEVERAL WEEKS SO WE REMAIN OPTIMISTIC THAT THERE COULD BE SOME PROGRESS MADE, BUT IT IS FAR FROM BEING COMPLETED AT THIS POINT.\nKERNEN: SO YOU -- YOU CAN'T ASSIGN ANY TYPE OF PROBABILITY. I WOULD THINK, YOU KNOW, I SAW ANOTHER PIECE YESTERDAY OR THE DAY BEFORE IN THE WALL STREET JOURNAL, AN AUTHOR WROTE THAT IT'S NAFTA'S RESPONSIBLE FOR OUR .5% GDP EVERY YEAR AND IF WE GET RID OF IT, YOU KNOW, IT'S JUST GOING TO MAKE IT MORE DIFFICULT. IN YOUR VIEW, IS THE PRESIDENT STILL NEGOTIATING BY HOLDING OUT THE POSSIBILITY OF EXITING IT COMPLETELY OR IS THAT A REAL POSSIBILITY?\nROSS: WELL, IT'S DEFINITELY A POSSIBILITY. IT'S HARD TO DEBATE WHETHER THE DEAL AS IT WILL BE FINALLY PRESENTED TO THE PRESIDENT IS GOOD OR BAD WHEN THE MAJOR FEATURES OF IT HAVE YET TO BE CONCLUDED.\nKERNEN: OKAY.\nROSS: SO IT WILL EITHER BE 100% OR 0%, IT WON'T BE SOME PERCENT IN BETWEEN.\nKERNEN: WHAT WILL BE THE NEXT STEP TO TALK TO THE PARTIES INVOLVED IN TPP TO SAY WE'D LIKE TO CONSIDER JOINING? WILL YOU TAKE THAT STEP?\nROSS: WELL, THE PRESIDENT ANNOUNCED THAT IN DAVOS THAT IF TPP IS MODIFIED FROM WHERE IT HAD BEEN HE WOULD CONSIDER JOINING IT, THE MODIFIED TPP, BUT, REMEMBER, THEY DON'T HAVE THEIR ACT TOGETHER AMONG THEMSELVES. THE SO-CALLED GROUP OF 11 IS NOT COMPLETELY RESOLVED ON ITS OWN, LET ALONE RESOLVED RELATIVE TO WHAT CONCESSIONS THEY MIGHT MAKE TO THE UNITED STATES. SO IT'S A LITTLE BIT EARLY TO JUDGE THAT ONE AS WELL.\nKERNEN: WHAT GOES ON? WHAT WOULD BE THE NEXT THING THAT THE TRUMP ADMINISTRATION WOULD DO NOW THAT, YOU KNOW, YOU FLOATED THE TRIAL BALLOON TO ACTUALLY TAKE A CONCRETE STEP TOWARDS RE-ENGAGING ON THAT? WHAT -- WOULD YOU DO THAT? WOULD A TRADE REP DO IT? HOW IS THAT GOING TO HAPPEN AND IS IT GOING TO HAPPEN?\nROSS: WELL, THE PRESIDENT MADE CLEAR THAT HE NEEDS SOME FURTHER CONDITIONS BEFORE HE WOULD WANT TO ENTER INTO IT, BUT RIGHT NOW THE BIG OCCUPATION IS WITH NAFTA BECAUSE THAT'S THE ONE THAT'S REALLY UNDERWAY. AND AS I MENTIONED, IN TERMS OF TPP, THEY HAVEN'T RESOLVED ALL THE ISSUES AMONG THEMSELVES SO IT'S A LITTLE BIT PREMATURE.\nKERNEN: SO IN TERMS -- AND THEN THE THIRD THING I WAS TALKING ABOUT WITH CHINA, IS THERE GOING TO BE -- WHAT WILL BE THE NEXT THING WE HEAR? WILL IT BE CHINA RETALIATING? WILL IT BE SOMETHING IN ADDITION TO SOLAR? IS STEEL NEXT? YOU KNOW A LOT ABOUT STEEL, OBVIOUSLY, BEING INVOLVED WITH SO MANY TURNAROUNDS THERE. WHAT DO YOU THINK THE NEXT CHAPTER ON THE WHOLE CHINA SITUATION IS WITH TARIFFS?\nROSS: WELL, THERE'S THREE CHAPTERS. YOU HAVE THE 301 INVESTIGATION ABOUT INTELLECTUAL PROPERTY, RIGHT? YOU HAVE THE 232 ON STEEL. YOU HAVE THE 232 ON ALUMINUM. AND THEN YOU HAVE A WHOLE HOST OF MORE ROUTINE TRADE CASES THAT COME UP EVERY WEEK OR TWO. IN THE LAST YEAR WE DID MORE THAN 80 INITIATED TRADE ACTIONS, WHICH WAS UP MORE THAN 50% FROM A YEAR AGO, LARGELY BECAUSE THERE ARE MORE INFRACTIONS BEING COMMITTED BY OTHER PARTIES.\nKERNEN: ALL RIGHT. SO YOU CAN'T PREDICT THE FUTURE, I GUESS? YOU DON'T KNOW WHAT THE NEXT SHOE TO DROP IS GOING TO BE AND WHETHER IT'S FROM CHINA OR WHETHER IT'S FROM THE UNITED STATES.\nROSS: WELL, THE PRESIDENT HAS MADE IT VERY CLEAR THAT HIS POLICY IS TO STRICTLY ENFORCE TRADE AGREEMENTS, AND THAT'S IMPORTANTLY A JOB FOR THE COMMERCE DEPARTMENT TO DO. AND WE WILL CONTINUE TO DO THAT, AND WE WILL CONTINUE TO SELF-INITIATE CASES. BUT HIS SPEECH LAST NIGHT WAS ABOUT A LOT MORE THAN JUST TRADE. I THOUGHT IT WAS A VERY UPLIFTING, VERY EMPATHETIC, VERY EXCITING SPEECH, AND, IN FACT, AFTER THE 100th TIME THAT WE STOOD UP AND APPLAUDED, I STOPPED COUNTING. IT WAS REMARKABLE TO HAVE 100 TIMES IN A SPEECH WHERE EVERYBODY, WITH A FEW EXCEPTIONS, STANDS UP AND APPLAUDS. IT'S A GREAT TESTIMONIAL TO THE PRESIDENT AS IS THE RISING STOCK MARKET SO FAR THIS MORNING.\nKERNEN: YEAH. THERE'S GOING TO BE A REBOUND OBVIOUSLY THIS MORNING. THE TWO SIX ON THE FOURTH QUARTER, IT DEPENDS ON LIKE SO MANY THINGS, IT'S LIKE A RORSCHACH TEST FOR PEOPLE BECAUSE IT WOULD HAVE BEEN -- YOU KNOW, IF WE WERE AVERAGING 1.5 TO 2 AND THEN ALL OF A SUDDEN YOU GET A COUPLE OF 3s, THEN YOU GET A 2.6, YOU WOULD THINK MAYBE THAT'S THE LOW END OF THE CURRENT ENVIRONMENT, BUT THAT'S NOT THE WAY -- I MEAN, I THOUGHT CERTAIN OUTLETS SAY THAT WAS A DISASTROUS QUARTER AT 2.6. THE FIRST QUARTER—\nROSS: 2.6 IS –\nKERNEN: IS BETTER THAN –\nROSS: BETTER THAN MOST QUARTERS THAT WE'VE SEEN FOR YEARS AND YEARS.\nKERNEN: THERE'S A PROBLEM WITH THE FIRST QUARTER. LIESMAN'S DONE A LOT OF WORK ON IT AND YOU'VE SEEN IT. THERE'S SOME WEIRD INVENTORY BILL THAT GOES ON, AND IN THE FIRST QUARTER HAS TYPICALLY IN THE LAST THREE, FOUR, FIVE YEARS HAS ALWAS BEEN THE LOWEST IN THE YEAR, SO THAT'S SOMETHING TO CONSIDER THIS TIME AROUND I THINK. ALTHOUGH, I DON'T KNOW—\nROSS: WELL, SURE, BECAUSE YOU HAVE THE POST CHRISTMAS THING AS WELL. IT'S A VERY BIG COMPLICATING FACTOR.\nKERNEN: SO WHAT WOULD BE – WHAT'S YOUR FORECAST AND WHAT WOULD YOU BE SATISFIED WITH FOR THE FIRST QUARTER? AND WILL IT AVERAGE OUT TO -- WILL THERE BE -- I DON'T KNOW WHAT WE'D WOULD NEED TO GET AN ACTUAL 3% YEAR, BUT THE NAYSAYERS UNTIL YOU GET AN AVERAGE FOR FOUR QUARTERS OF 3% THEYRE GOING TO SAY THAT NONE OF THIS IS WORKING.\nROSS: REMEMBER, THE NAYSAYERS WERE BEFORE PRESIDENT TRUMP'S ELECTION, THEY WERE SAYING WE'D NEVER GET OVER A 1.5 TO 2% SO THEY'VE ALREADY BEEN PROVEN QUITE WRONG, AND REMEMBER THIS YEAR THE TAX BONUSES JUST ARE BEING PAID, ALMOST 3 MILLION AMERICANS ARE GETTING $1,000 OR MORE CHECK. AND WHILE NANCY PELOSI MAY SCOFF AT THAT, THAT JUST SHOWS HOW OUT OF TOUCH SHE IS WITH THE IMPORTANCE OF A $1,000 CHECK TO THE AVERAGE WORKING PERSON. IN ADDITION, IT WON'T BE UNTIL FEBRUARY THAT THE WITHHOLDINGS GO DOWN. SO THE FIRST QUARTER IS GOING TO BE A TRANSITIONAL QUARTER IN VERY MANY REGARDS. IT'S QUITE CLEAR THE DIRECTION, AND WHO WOULD HAVE THOUGHT A YEAR AGO, SIX MONTHS AGO OR EVEN THREE MONTHS AGO THAT ALMOST 3 MILLION AMERICANS WOULD GET CHECKS FROM THEIR EMPLOYERS SPECIFICALLY TO SHARE THE TAX BILL.\nKERNEN: WILBUR, I'M LOOKING AT PRESIDENT'S TWITTER FEED AND IT'S QUIET – TOO QUIET. I'VE ALWAYS WANTED TO SAY THAT. THERE'S 11 HOURS SINCE THE LAST ONE. I'M GOING TO STAY HERE EXPECTING – I WILL GET BACK TO YOU. COULD BE ANY SECOND HERE. BUT, WHAT'S GOING ON?\nBECKY QUICK: WHAT'S GOING ON IS IT'S ALMOST ADP.\nKERNEN: HE MIGHT BE SLEEPING IN. HE MIGHT BE SLEEPING IN. BUT I LIKE IT – I LIKE IT WHEN IT HAPPENS. BUT ANYWAYS, WE APPRECIATE IT. THANKS.\nQUICK: THANK YOU, MR. SECRETARY.\nROSS: HE HAD SO MUCH GOOD THINGS TO SAY LAST NIGHT.\nKERNEN: HE DID. HE DID.\nFor more information contact:\nJennifer Dauble\nCNBC\nt: 201.735.4721\nm: 201.615.2787\ne: jennifer.dauble@nbcuni.com\nEmma Martin\nCNBC\nt: 201.735.4713\ne: emma.martin@nbcuni.com\nAbout CNBC:\nWith CNBC in the U.S., CNBC in Asia Pacific, CNBC in Europe, Middle East and Africa, and CNBC World, CNBC is the recognized world leader in business news and provides real-time financial market coverage and business information to more than 409 million homes worldwide, including more than 91 million households in the United States and Canada. CNBC also provides daily business updates to 400 million households across China. The network's 15 live hours a day of business programming in North America (weekdays from 4:00 a.m. - 7:00 p.m. ET) is produced at CNBC's global headquarters in Englewood Cliffs, N.J., and includes reports from CNBC News bureaus worldwide. CNBC at night features a mix of new reality programming, CNBC's highly successful series produced exclusively for CNBC and a number of distinctive in-house documentaries.\nCNBC also has a vast portfolio of digital products which deliver real-time financial market news and information across a variety of platforms including: CNBC.com; CNBC PRO, the premium, integrated desktop/mobile service that provides live access to CNBC programming, exclusive video content and global market data and analysis; a suite of CNBC mobile products including the CNBC Apps for iOS, Android and Windows devices; and additional products such as the CNBC App for the Apple Watch and Apple TV.\nMembers of the media can receive more information about CNBC and its programming on the NBCUniversal Media Village Web site at http://www.nbcumv.com/programming/cnbc .\nFor more information about NBCUniversal, please visit http://www.NBCUniversal.com .", "external_links": ["http://www.nbcumv.com/programming/cnbc", "http://media.ne.cision.com/l/ferwksgy/www.cnbc.com/squawk-box-us"], "published": "2018-01-31T18:34:00.000+02:00", "crawled": "2018-01-31T18:37:07.000+02:00", "highlightTitle": ""}