{"organizations": [], "uuid": "1fd92a2e38cd9cf9901949e2706224f64d09abad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-good-times-restaurants-reports-fiscal-2018-q1-same-store-sales.html", "country": "US", "domain_rank": 767, "title": "Good Times Restaurants Reports Fiscal 2018 Q1 Same Store Sales", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T15:30:00.000+02:00", "replies_count": 0, "uuid": "1fd92a2e38cd9cf9901949e2706224f64d09abad"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-good-times-restaurants-reports-fiscal-2018-q1-same-store-sales.html", "ord_in_thread": 0, "title": "Good Times Restaurants Reports Fiscal 2018 Q1 Same Store Sales", "locations": [], "entities": {"persons": [{"name": "boyd hoback", "sentiment": "none"}], "locations": [], "organizations": [{"name": "good times restaurants", "sentiment": "negative"}, {"name": "good times burgers & frozen custard", "sentiment": "none"}, {"name": "good times restaurants inc.", "sentiment": "none"}, {"name": "burger bar", "sentiment": "none"}, {"name": "good times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Good Times’ Same Store Sales Increase 5.9%\nBad Daddy’s Adjusted Same Store Sales Increase 1.3%\nDENVER--(BUSINESS WIRE)-- Good Times Restaurants Inc. (NASDAQ: GTIM), operator of Good Times Burgers & Frozen Custard, a regional quick-service restaurant chain focused on fresh, high-quality, all-natural products, and of Bad Daddy’s Burger Bar, a full-service, upscale concept, today announced that its Good Times’ same store sales increased 5.9% in its fiscal first quarter ended December 26, 2017 over the prior year’s decrease of 0.5%, and its Bad Daddy’s same store sales increased 0.7% during the quarter over the prior year’s increase of 2.0%. Excluding the Cherry Creek location which continues to be impacted by construction in the surrounding area, Bad Daddy’s adjusted same store sales increased 1.3% for the quarter.\nBoyd Hoback, President & CEO, said, “We saw our sixth consecutive quarter of sequential improvement in our same store sales at Good Times, and exceeded our expectations of 3.0% to 3.5% comps during the quarter. We are very pleased with our results during the quarter, as we continue to compete in an environment with significant discounting in both of our competitive segments. The introduction of our expanded Kids Meals at $3 helped drive traffic and the weather was a mixed bag during the quarter, however we benefited from a string of warm, dry weather in Colorado in December when Good Times’ same store sales increased 10.4%.”\nRegarding Bad Daddy’s results, Hoback added, “Our Bad Daddy’s brand also performed very well, posting positive comp sales for the eleventh consecutive quarter. The Bad Daddy’s restaurants we opened during fiscal 2017 on average continue to perform above our systemwide average weekly sales and the two new Bad Daddy’s that opened at the beginning of the quarter opened exceptionally strong and continue to post above average results. We expect to open our first Bad Daddy’s in the Atlanta metro area on January 8, 2018 with six additional Bad Daddy’s this fiscal year.”\nAbout Good Times Restaurants Inc.: Good Times Restaurants Inc. operates Good Times Burgers & Frozen Custard, a regional chain of quick service restaurants located primarily in Colorado, and in its wholly owned subsidiary, Good Times Drive Thru Inc. Good Times provides a menu of high quality all natural hamburgers, 100% all natural chicken tenderloins, fresh frozen custard, natural cut fries, fresh lemonades and other unique offerings. Good Times currently operates and franchises a total of 38 restaurants.\nGTIM owns, operates, franchises or licenses 26 Bad Daddy’s Burger Bar restaurants through its wholly-owned subsidiaries. Bad Daddy’s Burger Bar is a full-service, upscale, “small box” restaurant concept featuring a chef driven menu of gourmet signature burgers, chopped salads, appetizers and sandwiches with a full bar and a focus on a selection of craft microbrew beers in a high-energy atmosphere that appeals to a broad consumer base.\nGood Times Forward-Looking Statements: This press release contains forward-looking statements within the meaning of federal securities laws. The words “intend,” “may,” “believe,” “will,” “should,” “anticipate,” “expect,” “seek” and similar expressions are intended to identify forward-looking statements. These statements involve known and unknown risks, which may cause the Company’s actual results to differ materially from results expressed or implied by the forward-looking statements. These risks include such factors as the uncertain nature of current restaurant development plans and the ability to implement those plans and integrate new restaurants, delays in developing and opening new restaurants because of weather, local permitting or other reasons, increased competition, cost increases or shortages in raw food products, and other matters discussed under the “Risk Factors” section of Good Times’ Annual Report on Form 10-K for the fiscal year ended September 26, 2017 filed with the SEC. Although Good Times may from time to time voluntarily update its forward-looking statements, it disclaims any commitment to do so except as required by securities laws.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180103005082/en/\nGood Times Restaurants Inc.\nInvestor Relations Contacts:\nBoyd E. Hoback, 303-384-1411\nPresident and CEO\nor\nRyan Zink, 303-384-1432\nCFO\nSource: Good Times Restaurants Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.goodtimesburgers.com&esheet=51736605&newsitemid=20180103005082&lan=en-US&anchor=Good+Times+Restaurants+Inc.&index=1&md5=4c8805686d9d508dab6fbb8b0a057256", "http://www.businesswire.com/news/home/20180103005082/en/"], "published": "2018-01-03T15:30:00.000+02:00", "crawled": "2018-01-03T17:08:53.010+02:00", "highlightTitle": ""}