{"organizations": [], "uuid": "17e5f6690ddb08a6033a56dbd712611fb607fa8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/domesticNews/", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/usa-healthcare-medicaid/analysis-u-s-medicaid-work-rules-face-tough-legal-challenges-experts-say-idUSKBN1FE33N", "country": "US", "domain_rank": 408, "title": "Medicaid work rules face tough legal challenges, experts say", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T23:55:00.000+02:00", "replies_count": 0, "uuid": "17e5f6690ddb08a6033a56dbd712611fb607fa8c"}, "author": "", "url": "https://www.reuters.com/article/usa-healthcare-medicaid/analysis-u-s-medicaid-work-rules-face-tough-legal-challenges-experts-say-idUSKBN1FE33N", "ord_in_thread": 0, "title": "Medicaid work rules face tough legal challenges, experts say", "locations": [], "entities": {"persons": [{"name": "brendan pierson", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "kentucky", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "medicaid", "sentiment": "negative"}, {"name": "u.s. medicaid", "sentiment": "negative"}, {"name": "kentucky medicaid", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - A lawsuit challenging the U.S. federal government’s approval of work requirements for Medicaid recipients in Kentucky could rein in the power of the Trump administration to reshape the health insurance programme for the poor, legal experts said.\nThe proposed class action, filed on Wednesday in federal court in Washington by 15 Kentucky Medicaid recipients, says the administration’s approval of the requirements has “effectively rewritten” the federal Medicaid statute in violation of the law.\nThe statute allows states to implement pilot programs that further the objectives of Medicaid, the government healthcare programme for the poor and disabled. But some experts said making recipients work or get job training does not advance Medicaid’s goal of providing insurance to those who cannot afford it.\n“There is, in contrast, good evidence that such requirements add enrolment hurdles that cause people to lose eligibility,” said Allison Hoffman, a professor at the University of Pennsylvania Law School who specializes in healthcare issues.\nA spokesman for the Department of Health and Human Services, which oversees Medicaid, declined to comment on the lawsuit.\nIf the court strikes down Kentucky’s work requirements, it could be a major setback for the Trump administration’s efforts to reshape Medicaid.\nRepublicans last year had included a cut in funding for Medicaid as part of the healthcare legislation that sought to repeal Obamacare, but they failed to get enough votes. The administration is now emphasizing rule changes to cut back on spending on people covered by government healthcare programs as President Donald Trump keeps an eye on conservative voters who put him in office.\nMedicaid spending in 2016 was $565.5 billion, according to the most recent figures available from the Centers for Medicare and Medicaid Services (CMS).\nAt least nine other states, mostly Republican-led, have proposed changes to Medicaid similar to Kentucky‘s: Arizona, Arkansas, Indiana, Kansas, Maine, New Hampshire, North Carolina, Utah and Wisconsin. None of these state have received federal approval.\nThe Medicaid statute allows the Department of Health and Human Services to grant waivers to states so they can experiment with pilot or “demonstration” programs that depart from the statute. HHS must find such programs “likely to assist in promoting the objectives” of Medicaid.\nCMS, a division of HHS, on Jan. 11 issued guidance inviting states to design and propose test programs that impose work or job training requirements on Medicaid recipients. States must propose such changes through waivers and obtain federal approval.\nIn issuing the guidance, CMS head Seema Verma said people who participate in “activities that increase their education and training” have a better quality of life and improved health outcomes.\nKentucky’s waiver, which was granted on Jan. 12, requires able-bodied adult Medicaid recipients, with some exceptions, to participate in at least 80 hours per month of “employment activities,” including jobs training, education and community service. It also imposes new premiums on recipients and locks them out of the programme for six months if they fail to pay.\nThe Kentucky Medicaid recipients who brought Wednesday’s lawsuit said the waiver, expected to take effect in July, was an “abuse of discretion” by HHS.\nSara Rosenbaum, a professor of health law and policy at George Washington University, said they had a strong case.\n“The question is whether the demonstration is so unsupported by the evidence and veers so far from the federal Medicaid law that as a substantive matter it doesn’t fit under” the waiver programme, Rosenbaum said.\nThe plaintiffs’ legal argument rests largely on the federal Administrative Procedure Act (APA), which allows courts to review agency decisions. Under the law, courts generally defer to agencies, striking down a decision only if it is “arbitrary and capricious.”\nAt least one federal appeals court has struck down a Medicaid waiver under the APA. In 2011, the 9th U.S. Circuit Court of Appeals invalidated a waiver that would have authorized co-pays for Medicaid patients in Arizona.\nRosenbaum noted that courts have been willing to block other Trump policies under the APA, including requirements that employer-provided health insurance cover birth control.\nBut James Blumstein, a professor of constitutional law and health law at Vanderbilt University Law School, said he was sceptical that the plaintiffs in the Kentucky case would prevail. He said HHS has broad authority to determine what was likely to advance Medicaid’s objectives.\nBlumstein said the administration could argue that it sees the Medicaid programme as part of a “comprehensive welfare approach,” with the goal of achieving good outcomes that could include pushing recipients to work and move to private insurance.\n“The idea that this is somehow antithetical to the Medicaid objectives is just contrary to history,” he said.\nReporting by Brendan Pierson in New York; Editing by Noeleen Walder and Leslie Adler\n ", "external_links": [], "published": "2018-01-25T23:55:00.000+02:00", "crawled": "2018-01-26T06:30:58.023+02:00", "highlightTitle": ""}