{"organizations": [], "uuid": "8ed9c70eb15f4855f7ef59cb2cced7e3f682e976", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/02/104924173-HED_Employees_Mary_Delaney.1910x1000.png", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/11-highly-effective-ways-to-connect-with-employees.html", "country": "US", "domain_rank": 767, "title": "11 highly effective ways to connect with employees", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.016, "site_type": "news", "published": "2018-01-04T22:50:00.000+02:00", "replies_count": 0, "uuid": "8ed9c70eb15f4855f7ef59cb2cced7e3f682e976"}, "author": "The Oracles", "url": "https://www.cnbc.com/2018/01/04/11-highly-effective-ways-to-connect-with-employees.html", "ord_in_thread": 0, "title": "11 highly effective ways to connect with employees", "locations": [], "entities": {"persons": [{"name": "mary delaney", "sentiment": "positive"}, {"name": "patrick byrne", "sentiment": "none"}], "locations": [], "organizations": [{"name": "overstock.com", "sentiment": "none"}, {"name": "overstock", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "11 highly effective ways to connect with employees The Oracles Mary Delaney | The Oracles SHARES \nIt's not always easy for entrepreneurs to figure out their employees' needs, wants, or struggles. If you fail to crack the code, you could lose top talent, allow toxic attitudes to fester, or even imperil your entire business. Having a bulletproof way to connect with employees is vital. Here's how top business leaders and members of The Oracles forge world-class connections with their teams. 1. Give employees a voice and a vote \nEmbrace crowdsourcing and social choice. The best knowledge comes from the people on the front lines. We built tools that our people have used to power many decisions for years. There are voting mechanisms within Overstock that make it like a constitutional monarchy—I retain the right to make little adjustments if the crowd wants something that I think is a mistake, but, overwhelmingly, they drive decisions and priorities. — Patrick Byrne , CEO of Overstock.com and tZERO 2. Hear what your employees are actually saying \nThe most powerful way to build any relationship and make someone feel valued is to listen. Opening your ear to employees to find out what's going right and wrong is smart business. You avoid many plane crashes by regularly asking people, \"How's it going?\", before really listening to their answer. It's always nice to get a compliment, but there's real gold in well-intentioned criticism from a loyal employee. The only way you'll get the gold is by actively listening. — Barbara Corcoran , founder of The Corcoran Group and Shark on \" Shark Tank \" 3. Empower, ask, and listen \nOur job as leaders is to empower our teams and root for them. My employees unequivocally know that I want to win, but not at their expense. Make it clear to your employees that you want them to be happy and live their dreams. Instill a strong sense of trust and safety. That kind of support builds insane loyalty, while inspiring employees to go all in and deliver. \nAnother hallmark of a good leader is to ask questions. It's the best way to show your team that you recognize they're more than just cogs on a wheel. \"Hey, how are things going?\" \"How's the new baby?\" \"What are you excited about lately?\" \"Any ideas you'd like to discuss?\" And then, for God's sake, listen. — Gary Vaynerchuk , founder and CEO of VaynerMedia (700+ employees with over $100 million in annual revenue), NYT-bestselling author , and mentor on Planet of the Apps 4. Embrace random connections \nWander around, randomly connect with employees, ask them what they're doing, and how they're doing. Explain what you're doing and what challenges you face. Often, they'll come up with good ideas for how to overcome your obstacles in the process. — Tim Draper , legendary VC, founder of Draper Associates and DFJ 5. Help every employee reach their goals \nYou need to hold people accountable to their goals. One of the big steps in that process is having someone identify their true motivation, or why . \nCreate an environment that encourages and fosters this type of growth. Schedule team and individual meetings where you create the opportunity for employees to define their why. Encourage them to set ambitious goals at work and in their personal lives. \nFinally, act as a coach and accountability partner as they implement their goals. When you take a genuine interest in your employees and impact their lives beyond the office, you build lasting relationships and a more loyal tribe. — Tom Ferry , CEO of Tom Ferry International , ranked the #1 Swanepoel Power 200 real estate coach, and NYT-bestselling author of \" Life! By Design \" ; follow Tom on Facebook and Instagram 6. Train them to quit \nNo matter how much you want people to invest in your dream of building an amazing company, most employees have their own dreams and desires. So, we built a program that's designed to help them quit from Day 1. \nWe explain how the company wants to help employees accomplish their dreams, which they list through \"Six Pillars of Happiness\" (Career, Relationship, Time Off, Health, Wealth, Growth). We then teach employees about happiness with workshops to support each \"Pillar.\" \nWe have a performance environment, so the better someone performs, the quicker they reach their dream. By focusing on the goals and desires of our employees and their families, we're always connected and enjoy relationships that last a lifetime. —  Craig Handley , co-founder and CEO of ListenTrust ; read more about Handley: This boss hires and trains his employees to quit 7. Get involved in the day-to-day of your business \nYou can't understand what's happening at each level of the business if you aren't willing to leave the executive floor and dive into the daily dealings of the business. If you make people feel like they're valuable to the company, they will crush it for you. People want to feel needed and acknowledged, especially for a job well done. And if someone is feeling lost or frustrated, it's even more important to hear their point of view. Take care of your people first, and they'll take care of your business. — Dottie Herman , CEO of Douglas Elliman , a real estate brokerage empire with more than $27 billion in annual sales 8. Make it personal \nOpen your home to employees and be willing to visit a colleague or meet their inner circle. This creates a deeper level of mutual understanding between people who are trying to succeed at work together. It builds trust and opens the door to better understand motives, challenges, and goals, professional and otherwise. It creates opportunities for candor and easy conversation. It gives one another the benefit of the doubt when there's an ability to understand each other's \"bigger picture.\" — Joe Kakaty , co-founder and president of Poker Central 9. Invest in your most important asset \nWhen your team is happy, energetic, and excited, they're better equipped to deal with paying customers and their positive energy is infectious. \nI create this by investing money, but most importantly, my personal time. I get to know my employees by asking meaningful questions (family, spouse, children), and do my best to remember the answers. \nA true leader is in the trenches with their team, fighting for the same goals together. That's how you build relationships. Keep the best talent by keeping them happy. After all, people are more important than the dollars they generate. — Mark Bloom , president at NetWorth Realty , ranked by Glassdoor among the \"Best Places to Work\" for two consecutive years 10. Give employees room to try new things and fail \nEncourage your employees to take responsibility and embrace accountability, and you'll build trust and connections like nothing else — if you deal with their learning curves and failures appropriately. \nOne of my department heads once cost our company $30,000. We arranged a meeting early the next morning. I kicked it off by getting his valued input on upcoming strategic plans. He stopped me a minute into the conversation and said: \"You know I cost the company $30,000. I thought you asked me here to fire me.\" \n\"Fire you?\" I said. \"Why would I ", "external_links": [], "published": "2018-01-04T22:50:00.000+02:00", "crawled": "2018-01-04T22:59:14.014+02:00", "highlightTitle": ""}