{"organizations": [], "uuid": "7e1610096647c5ab813250f41744e543c08414ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220859573&w=1200&r=LYNXMPEE0911M", "site_section": "http://feeds.reuters.com/reuters/UKCricketNews/", "section_title": "Reuters: Cricket News", "url": "https://uk.reuters.com/article/uk-cricket-safrica-rabada/cricket-rabada-set-to-wait-for-opening-chance-despite-rapid-rise-idUKKBN1EZ1Z1", "country": "US", "domain_rank": 408, "title": "Cricket-Rabada set to wait for opening chance despite rapid rise", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T17:14:00.000+02:00", "replies_count": 0, "uuid": "7e1610096647c5ab813250f41744e543c08414ea"}, "author": "", "url": "https://uk.reuters.com/article/uk-cricket-safrica-rabada/cricket-rabada-set-to-wait-for-opening-chance-despite-rapid-rise-idUKKBN1EZ1Z1", "ord_in_thread": 0, "title": "Cricket-Rabada set to wait for opening chance despite rapid rise", "locations": [], "entities": {"persons": [{"name": "rabada", "sentiment": "negative"}, {"name": "cricket-rabada", "sentiment": "negative"}, {"name": "jonny bairstow", "sentiment": "none"}, {"name": "jimmy anderson", "sentiment": "none"}, {"name": "nick said", "sentiment": "none"}, {"name": "kagiso rabada", "sentiment": "none"}], "locations": [{"name": "fourth test - manchester", "sentiment": "none"}, {"name": "pretoria", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "newlands", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "international cricket council", "sentiment": "none"}, {"name": "reuters/jason cairnduff  rabada", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  cape town", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 3:28 PM / Updated 26 minutes ago Cricket - Rabada set to wait for opening chance despite rapid rise Nick Said 3 Min Read \nCAPE TOWN (Reuters) - The world’s top test bowler Kagiso Rabada says it is his ambition to open the bowling for South Africa, but he will likely have to wait for his chance ahead of the second test against India starting in Pretoria on Saturday. Cricket - England vs South Africa - Fourth Test -   August 6, 2017 South Africa's Kagiso Rabada takes a catch to dismiss England's Jonny Bairstow   \nRabada’s thrilling display of fast bowling helped South Africa to a 72-run victory in the first test at Newlands, and catapulted the young firebrand to the summit of the International Cricket Council’s test rankings. \nHe dislodged England’s Jimmy Anderson, a man 13 years his senior, with match figures of 5-75 that only tell half the story of a display brimming with pace, aggression and control. \n“Our bowling attack is very skilled, as we have seen in the past and in the last game. It feels great to be playing alongside these veterans,” Rabada told reporters on Wednesday. \n”I just bowl wherever the team wants me to bowl, but obviously I would like to open. \n“It is very tough at the moment, though, because there are two very good bowlers doing that. I just like to do whatever the team requires me to do and set my own aspirations aside.” \nSince the start of 2016 he has taken 108 test wickets at an average of 21.34 and has a career strike-rate of 39.2 that is better than veterans Dale Steyn, Vernon Philander and Morne Morkel. \nDespite his form, Rabada was the fourth bowler used by South African captain Faf du Plessis in the first innings against India, a bow to his team mates’ seniority. \nThe 22-year-old has long been thought of as a special talent, particularly in his homeland where the desire for role-models for young black cricketers burns strong. But few thought he would deliver so much, so soon. \nThere are many who believe he can still get quicker, adding further to his considerable weaponry. \n“I don’t know how fast I can get. Sometimes I don’t think the speed gun is telling the truth to be honest. I can feel when I‘m bowling quick and when I‘m not,” he added. \nThe loss of Steyn to another injury setback means the burden will be greater on Rabada this season, with two more home tests to come against India and then four tests against the visiting Australians. \n“I need to do more, I am always striving for perfection, even though you will never reach it,” he said. “There is always something else you can work on and that is what I have done in my career so far. There is always a problem!” Reporting By Nick Said; Editing by Christian Radnedge", "external_links": [], "published": "2018-01-10T17:14:00.000+02:00", "crawled": "2018-01-10T17:36:19.023+02:00", "highlightTitle": ""}