{"organizations": [], "uuid": "ee33d6aea8ffb9c4304c6abea8f24a2ceee7c136", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225422914&w=1200&r=LYNXMPEE0P0FZ", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/us-davos-meeting-trump-speech/trump-to-tell-davos-wont-tolerate-trade-abuses-ip-theft-official-idUKKBN1FF0X3", "country": "US", "domain_rank": 408, "title": "Trump to tell Davos he won't tolerate trade abuses, IP theft", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T11:39:00.000+02:00", "replies_count": 0, "uuid": "ee33d6aea8ffb9c4304c6abea8f24a2ceee7c136"}, "author": "", "url": "https://uk.reuters.com/article/us-davos-meeting-trump-speech/trump-to-tell-davos-wont-tolerate-trade-abuses-ip-theft-official-idUKKBN1FF0X3", "ord_in_thread": 0, "title": "Trump to tell Davos he won't tolerate trade abuses, IP theft", "locations": [], "entities": {"persons": [{"name": "davos", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "steve holland", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "davos", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "america first", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 8:59 AM / Updated 32 minutes ago Trump warns Davos on unfair trade, says U.S. 'open for business' Steve Holland 4 Min Read \nDAVOS, Switzerland (Reuters) - U.S. President Donald Trump took his “America First” message to the world’s elite on Friday, telling a summit of business and political leaders that the United States would “no longer turn a blind eye” to what he described as unfair trade practices. \nTrump became the first sitting U.S. President in 18 years to address the annual conclave of the rich and powerful at the Swiss ski resort of Davos, closing the summit with a speech in which he declared the United States “open for business”. \n“Now is the best time to bring your money, your jobs, your businesses to America,” he said, singling out tax cuts and curbs to regulation as boosting the investment climate. \n“After years of stagnation, the United States is once again experiencing strong economic growth,” he said. “The world is witnessing the resurgence of a strong and prosperous America.” \nHe said he would always promote “America First”, as he expected other world leaders to do on behalf of their own countries. “America First does not mean America alone. When the United States grows so does the world,” he said. \nBut he swiftly turned to a theme of demanding tougher enforcement of trade rules, accusing unidentified countries of unfair practices, including stealing intellectual property and providing state aid to industry. \n“We will enforce our trade laws and restore integrity to the trading system. Only by insisting on fair and reciprocal trade can we create a system that works not just for the United States but for all nations,” Trump said. \n“The United States will no longer turn a blind eye to unfair trade practices,” he said. “We cannot have free and open trade if some countries exploit the system at the expense of others. We support free trade but it needs to be fair and it needs to be reciprocal.” President Donald Trump gestures as he delivers a speech during the World Economic Forum annual meeting in Davos, Switzerland January 26, 2018. REUTERS/Denis Balibouse \nWhile he has a record of opposing multi-lateral trade agreements involving many countries, he said the United States would consider “mutually beneficial” bilateral trade agreements with other individual states. \nThat could include countries that have signed up to a Trans-Pacific trade agreement from which he has withdrawn, he said, adding that he would also consider negotiating with them collectively if that was in the U.S. interest. U.S. President Donald Trump gestures as he speaks during the World Economic Forum (WEF) annual meeting in Davos, Switzerland January 26, 2018. REUTERS/Denis Balibouse \nBefore his trip to Davos, Trump imposed 30 percent tariffs on imported solar panels, among the first unilateral trade restrictions made by the administration as part of a broader protectionist agenda. \nNO “DAYLIGHT” ON DOLLAR \nThe Trump administration’s debut at Davos caused a storm, not least because of comments by Treasury Secretary Steven Mnuchin, who said this week the United States benefited from a lower dollar, which would make its exports cheaper. \nMnuchin’s remarks sent the U.S. currency tumbling and drew sharp rebukes from the European Central Bank and other figures, who view countries talking down their own currencies as a violation of unwritten rules to keep trade balanced. \nOn Thursday, Trump said he ultimately wants the dollar to be strong, lifting the greenback briefly. U.S. officials sought to dispel any impression of disarray, saying Mnuchin was making an observation about the impact of a lower dollar, not announcing a new policy to drive it down. \n“I don’t think there’s any daylight between the President and Secretary Mnuchin,” an administration officials told reporters in Davos. “I think that there were some people who took some comments that the secretary made where he was essentially reciting and explaining in descriptive manner a basic economic principle and took it to represent ... some sort of policy announcement or shift.” Additional reporting by Yara Bayoumy, Noah Barkin and Simon Robinson; Writing by Peter Graff; Editing by Mark Bendeich", "external_links": [], "published": "2018-01-26T11:39:00.000+02:00", "crawled": "2018-01-26T12:09:58.000+02:00", "highlightTitle": ""}