{"organizations": [], "uuid": "aaed25b4bd6a53fa8ea3b2959434d097d0857c48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226226524&w=1200&r=LYNXMPEE0S0H3", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-cba-ceo-breakingviews/breakingviews-australias-cba-makes-a-brazen-ceo-choice-idUSKBN1FI0O9", "country": "US", "domain_rank": 408, "title": "Australia’s CBA makes a brazen CEO choice", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T15:42:00.000+02:00", "replies_count": 0, "uuid": "aaed25b4bd6a53fa8ea3b2959434d097d0857c48"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-cba-ceo-breakingviews/breakingviews-australias-cba-makes-a-brazen-ceo-choice-idUSKBN1FI0O9", "ord_in_thread": 0, "title": "Australia’s CBA makes a brazen CEO choice", "locations": [], "entities": {"persons": [{"name": "ian narev", "sentiment": "none"}, {"name": "matt comyn", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "cba", "sentiment": "negative"}, {"name": "commonwealth bank of australia", "sentiment": "negative"}, {"name": "royal commission", "sentiment": "none"}, {"name": "austrac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SINGAPORE Commonwealth Bank of Australia has made a brazen choice for the top job. On Monday, the country’s top lender picked retail head Matt Comyn as the next chief executive, despite a money-laundering scandal in his unit. Investors seem sanguine and CBA’s board argues the bank would be hard for an outsider to master quickly. Even so, the lack of accountability is disappointing.\nCBA has been wrestling since last year with regulator Austrac’s accusations that it did not keep close enough tabs on customers, breaching anti-money laundering and terrorism-financing rules. The bank admits some limited failings but blames a system error in part and says it is tackling the problem. The furore forced the government into launching a wide-ranging probe, known as a Royal Commission, into Australian finance.\nThe $110 billion bank’s response has been tepid. It scrapped short-term bonuses, and made a handful of board changes. But it allowed outgoing CEO Ian Narev to retire gracefully over months, rather than force a faster, and less personally lucrative, exit.\nAnd now it has picked Comyn. That misses the chance to signal genuine change by hiring externally. It means Comyn suffered no real consequences from being at the helm when his unit went off-course: the move to install the “intelligent deposit machines” at the centre of this crisis pre-dates his leadership, but he was in charge when they were gobbling up dodgy deposits. And it also creates a hostage to fortune, should the Royal Commission find more problems within CBA.\nTo be sure, analysts regard Comyn highly. Banks are complex beasts, so familiarity helps. And while Monday’s modest share-price rise is hardly a ringing endorsement, in general investors seem less focused on headlines than on financial performance: the high margins, profits, and return on equity that come with being the top dog in a cosy four-player market.\nThat said, there are plenty of talented financial executives in Europe, the United States and Asia to pick from: it is hard to believe only an insider could keep CBA on track.\n ", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-29T15:42:00.000+02:00", "crawled": "2018-01-29T15:08:22.051+02:00", "highlightTitle": ""}