{"organizations": [], "uuid": "4bb4390467afebcefe85e81a635f83279d959436", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-sigilon-therapeutics-appoints-david-e-moller-m-d-as-chief-scientific-officer.html", "country": "US", "domain_rank": 767, "title": "Sigilon Therapeutics Appoints David E. Moller, M.D., as Chief Scientific Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T18:00:00.000+02:00", "replies_count": 0, "uuid": "4bb4390467afebcefe85e81a635f83279d959436"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-sigilon-therapeutics-appoints-david-e-moller-m-d-as-chief-scientific-officer.html", "ord_in_thread": 0, "title": "Sigilon Therapeutics Appoints David E. Moller, M.D., as Chief Scientific Officer", "locations": [], "entities": {"persons": [{"name": "david e. moller", "sentiment": "negative"}, {"name": "moller", "sentiment": "none"}, {"name": "sigilon", "sentiment": "none"}, {"name": "paul wotton", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}], "organizations": [{"name": "sigilon therapeutics", "sentiment": "negative"}, {"name": "living therapeutics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMBRIDGE, Mass., Jan. 4, 2018 /PRNewswire/ -- Sigilon Therapeutics, a biopharmaceutical company that discovers and develops immune-privileged Living Therapeutics, today announced the appointment of David E. Moller, M.D., to the position of Chief Scientific Officer. Dr. Moller brings a long history of experience in drug discovery and development to the company, including a focus on development of therapeutics for metabolic disorders and in the identification and evaluation of emerging technologies.\n\"Dr. Moller's experience provides an ideal fit for the Sigilon leadership team as we explore the broad therapeutic applications of our Afibromer™-based Living Therapeutics platform, using proprietary engineered cells as protein factories within the body,\" commented Paul Wotton, Ph.D., Chief Executive Officer of Sigilon Therapeutics. \"We are pleased to have Dr. Moller join us at this time in our growth to develop the many potential applications of this new approach to therapy.\"\n\"I am thrilled to join Sigilon Therapeutics at this point in its rapid growth to drive the identification and implementation of new pipeline and platform opportunities,\" added Dr. Moller. \"During my career I've been fortunate to investigate and develop several novel therapies. I'm particularly excited about the opportunity to now join a company that is poised to revolutionize the way that proteins are delivered —continually manufactured in the body by programmable cell implants — to treat numerous serious diseases.\"\nDr. Moller was previously Vice President of Business Development - Emerging Technology and Innovation at Eli Lilly, evaluating applications of breakthrough biology across multiple therapeutic areas. As Vice President of Endocrine and Cardiovascular Research and Clinical Investigation at Eli Lilly, Dr. Moller was responsible for discovery and early drug development in diverse therapeutic areas; his team delivered several key additions to the pipeline including dulaglutide (Trulicity™). Prior to joining Eli Lilly, Dr. Moller led global discovery efforts in diabetes and obesity as Vice President, Metabolic Disorders at Merck (MSD), which included oversight of the team responsible for the discovery of sitaglipitin (Januvia™). Before moving to industry, Dr. Moller was on the faculty of Harvard Medical School. Dr. Moller completed a residency in Internal Medicine at George Washington University, received his medical degree from the University of Cincinnati and earned a B.S. from Brown University.\nAbout Sigilon Therapeutics\nFounded and created by Flagship Pioneering, Sigilon Therapeutics is a biopharmaceutical company that discovers and develops immune-privileged living therapeutic implants for the treatment of chronic diseases. Treatments based on Sigilon Therapeutics' Afibromer™ technology platform include cell implants that act as responsive \"living therapeutics,\" providing more natural control for diseases that are currently treated with intermittent injection or infusion. Initial areas of focus include hematologic, enzyme deficiency, endocrine and metabolic disorders. More natural control would restore health and free patients from the need for therapies that are disruptive to quality of life.\nIn addition to Flagship Pioneering, Sigilon Therapeutics' co-founders include Daniel Anderson, Ph.D., and Robert Langer, Sc.D., of the Massachusetts Institute of Technology Institute of Medical Engineering and Science, Department of Chemical Engineering and Koch Institute; Omid Veiseh, Ph.D., of Rice University; José Oberholzer, M.D., of the University of Virginia; and Arturo Vegas, Ph.D., of Boston University.\nFor more information please visit www.sigilon.com or follow on Twitter at https://twitter.com/Sigilon_Inc .\nView original content: http://www.prnewswire.com/news-releases/sigilon-therapeutics-appoints-david-e-moller-md-as-chief-scientific-officer-300577551.html\nSOURCE Sigilon Therapeutics", "external_links": ["http://www.prnewswire.com/news-releases/sigilon-therapeutics-appoints-david-e-moller-md-as-chief-scientific-officer-300577551.html", "https://twitter.com/Sigilon_Inc", "http://www.sigilon.com/"], "published": "2018-01-04T18:00:00.000+02:00", "crawled": "2018-01-04T19:19:42.004+02:00", "highlightTitle": ""}