{"organizations": [], "uuid": "c6c3ab19fbf2e15fb239fae0e350a8f577c388bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222899989&w=1200&r=LYNXMPEE0H05J", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-cyber-intel/intel-problem-in-patches-for-spectre-meltdown-extends-to-newer-chips-idUKKBN1F708Z", "country": "US", "domain_rank": 408, "title": "Intel: Problem in patches for Spectre, Meltdown extends to newer chips", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T04:28:00.000+02:00", "replies_count": 0, "uuid": "c6c3ab19fbf2e15fb239fae0e350a8f577c388bf"}, "author": "", "url": "https://uk.reuters.com/article/uk-cyber-intel/intel-problem-in-patches-for-spectre-meltdown-extends-to-newer-chips-idUKKBN1F708Z", "ord_in_thread": 0, "title": "Intel: Problem in patches for Spectre, Meltdown extends to newer chips", "locations": [], "entities": {"persons": [{"name": "shenoy", "sentiment": "none"}, {"name": "skylake", "sentiment": "none"}, {"name": "navin shenoy", "sentiment": "none"}, {"name": "stephen nellis", "sentiment": "none"}, {"name": "haswell", "sentiment": "none"}, {"name": "broadwell", "sentiment": "none"}], "locations": [{"name": "kaby lake", "sentiment": "none"}, {"name": "sandy bridge", "sentiment": "none"}, {"name": "ivy bridge", "sentiment": "none"}], "organizations": [{"name": "intel", "sentiment": "negative"}, {"name": "intel corp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 2:22 AM / Updated 3 hours ago Intel: Problem in patches for Spectre, Meltdown extends to newer chips Stephen Nellis 3 Min Read \n(Reuters) - Data centre computers with Intel Corp’s ( INTC.O ) newer chips might reboot more often than normal because of problems with the patches issued to fix the so-called Spectre and Meltdown security flaws, the company said on Wednesday. \nIntel confirmed that patches for the security flaws can cause higher-than-expected reboot rates in Ivy Bridge, Sandy Bridge, Skylake and Kaby Lake processors, said Navin Shenoy, general manager of the data centre group, in a statement on Intel’s website. \nThe Kaby Lake chips are the company’s most recent offering. \nLast week, Intel said it had received reports that its security patches were causing problems in systems with its older Broadwell and Haswell chips. \nShenoy said that Intel had issued patches for 90 percent of Intel chips released in the past five years but that the company had “more work to do.” He also said the company would send out initial versions of fixes for the buggy patches to customers by next week. \n“We have reproduced these issues internally and are making progress toward identifying the root cause,” Shenoy wrote. \nOn Jan. 3 Intel confirmed that the Spectre and Meltdown flaws affected its chips, potentially letting hackers steal information believed to be very secure. \nThe Spectre flaw affected nearly every modern computing device, including those with chips from Intel, Advanced Micro Devices Inc ( AMD.O ) and ARM Holdings. \nIntel on Wednesday also quantified how much of a performance hit the patches cause for data centre customers. For common tasks such as running website servers, the patches caused a 2 percent slowdown, Intel said. Another test that simulated online transactions at a stock brokerage showed a 4 percent slowdown, the company said. \nFor some types for work involving servers that store large amounts of data and try to retrieve it quickly, the company said the slowdown could be as severe as 18 percent to 25 percent. However, it wasn’t immediately clear how common those situations were. Reporting by Stephen Nellis; editing by Grant McCool", "external_links": [], "published": "2018-01-18T04:28:00.000+02:00", "crawled": "2018-01-18T04:48:38.038+02:00", "highlightTitle": ""}