{"organizations": [], "uuid": "848f0388963c8d1bbdb94b5dad30056dc8b9733c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-cleantech-solutions-international-enters-into-exclusivity-agreement-with-channel-power-for-potential-acquisition-of-touch.html", "country": "US", "domain_rank": 767, "title": "Cleantech Solutions International Enters into Exclusivity Agreement with Channel Power for Potential Acquisition of Touch Media", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.62, "site_type": "news", "published": "2018-01-04T14:30:00.000+02:00", "replies_count": 0, "uuid": "848f0388963c8d1bbdb94b5dad30056dc8b9733c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-cleantech-solutions-international-enters-into-exclusivity-agreement-with-channel-power-for-potential-acquisition-of-touch.html", "ord_in_thread": 0, "title": "Cleantech Solutions International Enters into Exclusivity Agreement with Channel Power for Potential Acquisition of Touch Media", "locations": [], "entities": {"persons": [{"name": "yik chung chong", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "channel power for potential acquisition of touch media", "sentiment": "negative"}, {"name": "cleantech solutions international enters", "sentiment": "negative"}, {"name": "cleantech solutions international, inc.", "sentiment": "neutral"}, {"name": "touch media interactive", "sentiment": "none"}, {"name": "ec advertising", "sentiment": "none"}, {"name": "channel power limited", "sentiment": "none"}, {"name": "hk) company limited", "sentiment": "none"}, {"name": "ec advertising limited", "sentiment": "none"}, {"name": "channel power", "sentiment": "none"}, {"name": "ec", "sentiment": "none"}, {"name": "touch media", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG, Jan. 4, 2018 /PRNewswire/ -- Cleantech Solutions International, Inc. (\"Cleantech Solutions\" or \"the Company\") (Nasdaq: \"CLNT\") today announced that its wholly-owned subsidiary, EC Advertising Limited (\"EC Advertising\"), has entered into an exclusivity agreement with the shareholder of Channel Power Limited (\"Channel Power\"), regarding a potential acquisition by EC Advertising of not less than 73% of Channel Power, which in turns holds 70% of the issued share capital of Touch Media Interactive (HK) Company Limited (\"Touch Media\"), an advertising agency in Hong Kong. As a result, EC Advertising will in effect own 51% of the total voting rights of Touch Media.\n\"CLNT has a strong mindset in the global sharing economy, technology and media businesses, which perfectly complements our business development plan,\" said Yik Chung Chong, Director of Channel Power and CEO of Touch Media. \"After establishing ourselves as Hong Kong's leading in-taxi interactive media companies, we look forward to this potential collaboration with CLNT, which can support our efforts to expand our advertising coverage to more taxis and their passengers. At the same time, we will consider replicating this business model in different overseas markets, reaching international taxi passengers en route to their destinations.\"\n\"We are excited about this potential partnership with Touch Media,\" said Parkson Yip, COO of Cleantech Solutions. \"There are currently about 18,000 taxis on the streets of Hong Kong, of which 1,800 have installed Touch Media's touchscreen consoles, which provide passengers with promotional advertisements related to their particular location and can act as a useful travel guide for tourists. By joining Touch Media and CLNT, we can explore the in-vehicle advertising business through their existing taxi network within Hong Kong and plan to increase the base of taxis using their touchscreen consoles, and further expand into other vehicles.\"\n\"From there, we are planning to expand our vision in the concept of a 'mobilized WiFi city' where users, especially foreign visitors, can easily gain access to a WiFi signal through the Touch Media consoles installed in the taxi. Moreover, we plan to develop a 'Sharing Taxi APP' which will allow different passengers going to nearby places to share the same taxi, reducing transportation costs to the passengers while benefiting the environment by sharing trips. We plan for Hong Kong and Macau to be our pilot cities and will expand our business coverage to overseas markets in long run.\n\"The Touch Media console has obtained safety certifications from transportation departments in both Hong Kong and China. It is a valuable in-car terminal where we can develop further value-added functions to expand its business opportunities. The 'mobilized WiFi network' and 'Sharing Taxi' initiatives are just the beginning. We will integrate all these further into our blockchain-powered sharing economy backbone, so in-car media consoles will become another crucial part of our sharing economy ecosystem.\"\nThere can be no assurances that the parties may enter into any agreement to do a transaction, and even if an agreement is entered into, there can be no assurances that such transaction will be consummated.\nAbout Cleantech Solutions International\nCleantech Solutions, through its affiliated companies, designs, manufactures and distributes a line of proprietary high and low temperature dyeing and finishing machinery to the textile industry. The Company's latest business initiatives are focused on targeting the technology and global sharing economy markets, by developing online platforms and rental business partnerships that will drive the global development of sharing through economical rental business models.\nAbout Touch Media\nTouch Media is the leading in-taxi interactive media company in Hong Kong. It provides an interactive touchscreen system for headrests in taxis. Touch Media is now transforming from simple outdoor media into a tech-media company with mobile channel and smart data. The company will provide diversified mobile service network to taxi passengers, based on its unique advantages of interactive technology, location based services and outdoor digital media network.\nSafe Harbor Statement\nThis release contains certain \" \" relating to the business of the Company and its subsidiary and affiliated companies and certain potential transactions that they may enter into. These forward looking statements are often identified by the use of forward looking terminology such as \"believes,\" \"expects\" or similar expressions. Such forward looking statements involve known and unknown risks and uncertainties that may cause actual results to be materially different from those described herein as anticipated, believed, estimated or expected. The Company's actual results could differ materially from those anticipated in these as a result of a variety of factors, including those discussed in the Company's periodic reports that are filed with the Securities and Exchange Commission and available on its website, including factors described in \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in our Form 10-K for the year ended December 31, 2016 and in our Form 10-Q for the quarter ended September 30, 2017. All attributable to the Company or to persons acting on its behalf are expressly qualified in their entirety by these factors other than as required under the securities laws. The Company does not assume a duty to update these .\nView original content: http://www.prnewswire.com/news-releases/cleantech-solutions-international-enters-into-exclusivity-agreement-with-channel-power-for-potential-acquisition-of-touch-media-300577469.html\nSOURCE Cleantech Solutions International, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/cleantech-solutions-international-enters-into-exclusivity-agreement-with-channel-power-for-potential-acquisition-of-touch-media-300577469.html"], "published": "2018-01-04T14:30:00.000+02:00", "crawled": "2018-01-04T14:01:16.006+02:00", "highlightTitle": ""}