{"organizations": [], "uuid": "d5f7921099d22a2f9d2477b703abf9ff48c072ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-la-quinta-holdings-names-keith-a-cline-president-and-ceo-of-corepoint-lodging-inc.html", "country": "US", "domain_rank": 767, "title": "La Quinta Holdings Names Keith A. Cline President and CEO of CorePoint Lodging Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T14:30:00.000+02:00", "replies_count": 0, "uuid": "d5f7921099d22a2f9d2477b703abf9ff48c072ff"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-la-quinta-holdings-names-keith-a-cline-president-and-ceo-of-corepoint-lodging-inc.html", "ord_in_thread": 0, "title": "La Quinta Holdings Names Keith A. Cline President and CEO of CorePoint Lodging Inc.", "locations": [], "entities": {"persons": [{"name": "keith a. cline", "sentiment": "negative"}, {"name": "cline", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "irving", "sentiment": "none"}, {"name": "la quinta", "sentiment": "none"}], "organizations": [{"name": "la quinta holdings", "sentiment": "negative"}, {"name": "corepoint lodging inc", "sentiment": "negative"}, {"name": "board of directors of la quinta holdings inc.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "express, inc.", "sentiment": "none"}, {"name": "corepoint lodging inc.", "sentiment": "none"}, {"name": "la quinta", "sentiment": "none"}, {"name": "l brands", "sentiment": "none"}, {"name": "charming charlie, inc.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "fedex custom critical", "sentiment": "none"}, {"name": "arthur andersen & company", "sentiment": "none"}, {"name": "j.m. smucker company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IRVING, Texas, Jan. 18, 2018 (GLOBE NEWSWIRE) -- The Board of Directors of La Quinta Holdings Inc. (NYSE:LQ) (the \"Company\" or \"La Quinta\") today announced the appointment of Keith A. Cline to serve as President and Chief Executive Officer of CorePoint Lodging Inc. (“CorePoint” or “CPLG”). The appointment will take effect immediately upon the completion of the planned spin-off of La Quinta’s owned real estate assets into a separate publicly traded Real Estate Investment Trust (“REIT”) named CorePoint Lodging Inc.\nMr. Cline has been serving as President and Chief Executive Officer of La Quinta since February 2016 and an on interim basis since September 2015. Mr. Cline joined La Quinta in January of 2013 as its Executive Vice President and Chief Financial Officer, where he led the Company through its initial public offering. Prior to joining La Quinta, Mr. Cline has served in a variety of executive and senior leadership roles at Charming Charlie, Inc., Express, Inc., The J.M. Smucker Company, FedEx Custom Critical, and L Brands. Mr. Cline began his career at Arthur Andersen & Company and graduated summa cum laude from the University of Akron with a B.S. in Accounting and a M.B.A. in Finance.\nMit Shah, Chairman of La Quinta’s Board of Directors, said, \"After a thorough search involving a significant number of highly accomplished executives, the Board is pleased to name Keith Cline the President and CEO of CorePoint. Keith’s experience, strategic vision, acumen and leadership of La Quinta over the last several years, combined with his ability to drive the successful execution of the Company’s key strategic initiatives, make him the right person to lead this important new REIT. The Board is confident that Keith and the organization he will help build at CorePoint will capitalize on future opportunities to drive long term growth and maximize value for its shareholders.”\nRegarding his appointment, Mr. Cline stated, \"I am honored to become the President and Chief Executive Officer of CorePoint. Our objective is to generate premium long-term returns for our stockholders through proactive asset management, value-enhancing investments and disciplined capital allocation. The midscale and upper midscale segments are among the largest in the lodging industry in terms of number of properties and developers – not surprising given the cash on cash returns. As a pure-play lodging real estate company with a portfolio focused in these highly desirable segments, there is a significant opportunity to drive value for CorePoint. I look forward to building a team, executing against our strategy and delivering value for all of our stakeholders.”\nA formal search is ongoing for other executive officers of CorePoint, which includes consideration of both internal and external candidates.\nSeparately, La Quinta announced today that Wyndham Worldwide Corporation (NYSE:WYN) and La Quinta have entered into a definitive agreement under which Wyndham Worldwide will acquire La Quinta’s hotel franchise and hotel management businesses for $1.95 billion in cash. Immediately prior to the sale of La Quinta to Wyndham Worldwide, La Quinta will spin-off its owned real estate assets into CorePoint.\nThe acquisition is subject to the completion of the spin-off of the Company, approval by La Quinta stockholders, regulatory approvals and the satisfaction of other customary closing conditions, and is expected to close in the second quarter of 2018.\nUnder the terms of the agreement with Wyndham, stockholders of La Quinta will receive $8.40 per share in cash (approximately $1.0 billion in aggregate). Also as part of the transaction, La Quinta’s current debt obligation will be retired in its entirety, with Wyndham Worldwide repaying approximately $715 million of La Quinta debt net of cash and setting aside a reserve in the amount of $240 million for estimated taxes to be incurred in connection with La Quinta’s spin of its owned real estate assets into CorePoint. The amount of such tax liabilities could be higher or lower than the estimated reserve amount and will depend upon several factors, including the value of CorePoint once it is spun off. Any difference between the reserve amount and a final estimated tax amount determined after closing will be returned to, or paid by, CorePoint.\nCorePoint is well-positioned to become a pure-play publicly-traded REIT focused exclusively on midscale and upper-midscale select service hotels. CorePoint will own a portfolio of approximately 315 hotels and more than 40,000 rooms throughout the United States in attractive locations in or near employment centers, airports and major travel thoroughfares.\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended and Section 21E of the Securities Exchange Act of 1934, as amended. These statements include, but are not limited to, statements related to the Company’s expectations regarding the performance of its business, its financial results, its liquidity and capital resources, and the outcome of the Company’s strategic initiatives and the potential separation of its businesses and other non-historical statements. You can identify these forward-looking statements by the use of words such as “outlook,” “believes,” “expects,” “potential,” “continues,” “may,” “will,” “should,” “could,” “seeks,” “projects,” “predicts,” “intends,” “plans,” “estimates,” “anticipates” or the negative version of these words or other comparable words. Such forward-looking statements are subject to various risks and uncertainties, including those described under the section entitled “Risk Factors” in the Company’s Annual Report on Form 10-K for the year ended December 31, 2016, filed with the Securities and Exchange Commission (“SEC”), as such factors may be updated from time to time in the Company’s periodic filings with the SEC, which are accessible on the SEC’s website at www.sec.gov . Accordingly, there are or will be important factors that could cause actual outcomes or results to differ materially from those indicated in these statements. These factors should not be construed as exhaustive and should be read in conjunction with the other cautionary statements that are included in this release and in the Company’s filings with the SEC. The Company undertakes no obligation to publicly update or review any forward-looking statement, whether as a result of new information, future developments or otherwise, except as required by law.\nAbout La Quinta Holdings Inc.\nLa Quinta Holdings Inc. (NYSE:LQ) is a leading owner, operator and franchisor of select-service hotels primarily serving the upper-midscale and midscale segments. The Company’s owned and franchised portfolio consists of more than 890 properties representing approximately 87,500 rooms located in 48 states in the U.S., and in Canada, Mexico, Honduras and Colombia. These properties operate under the La Quinta Inn & Suites™, La Quinta Inn ® and LQ Hotel ® brands. La Quinta’s team is committed to providing guests with a refreshing and engaging experience. For more information, please visit: www.LQ.com .\nAbout CorePoint Lodging Inc.\nCorePoint Lodging Inc. is positioned to become the only pure-play publicly-traded RE", "external_links": ["https://www.globenewswire.com/Tracker?data=cRQUNSNhROL3BhWBWRjYjNbQkpV-_DDks7GQSI2JcLiuPD_IA9UU-JanbCBFLWkZGfJwLeNms8tzm4yNNoJhZg==", "https://www.globenewswire.com/Tracker?data=0yOLL-smljUA3QBQe8goYGFPV5ZOxx0TOWwfZ-jct6lm6laBYS42Rj2GjDGl9NGNY87B_JesoL-UBNyqlEUvAH9vOleeqt3TmwVQ6LcNwhK9HgeNMPZpARJPjQQf1Erw", "https://www.globenewswire.com/NewsRoom/AttachmentNg/91ea88bd-7abd-4b58-bc3c-d6e7f200fdfc", "https://www.globenewswire.com/Tracker?data=mq9Pt0ux24oSXu2OJOLdVkWK-pRf4pvS0OwLKB__xU1yMl_fXACVDvNPePGk7d91vDPp-gPSHfRcwuTIQnixWA=="], "published": "2018-01-18T14:30:00.000+02:00", "crawled": "2018-01-18T17:08:06.000+02:00", "highlightTitle": ""}