{"organizations": [], "uuid": "37d666530ea5e2e85277219a40842f4f20f0eec7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221568825&w=1200&r=LYNXMPEE0B1LA", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/us-canada-forex/canadian-dollar-rallies-versus-weaker-greenback-as-rate-hike-bets-firm-idUSKBN1F12PL", "country": "US", "domain_rank": 408, "title": "Canadian dollar rallies versus weaker greenback as rate hike bets firm", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-13T06:19:00.000+02:00", "replies_count": 0, "uuid": "37d666530ea5e2e85277219a40842f4f20f0eec7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-canada-forex/canadian-dollar-rallies-versus-weaker-greenback-as-rate-hike-bets-firm-idUSKBN1F12PL", "ord_in_thread": 0, "title": "Canadian dollar rallies versus weaker greenback as rate hike bets firm", "locations": [], "entities": {"persons": [{"name": "frid", "sentiment": "negative"}, {"name": "taylor", "sentiment": "none"}, {"name": "greg taylor", "sentiment": "none"}], "locations": [{"name": "toronto", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "redwood asset management", "sentiment": "none"}, {"name": "bank of canada", "sentiment": "none"}, {"name": "nafta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO (Reuters) - The Canadian dollar advanced against its broadly weaker U.S. counterpart on Friday as oil prices climbed and chances rose that the Bank of Canada will raise interest rates next week.\nAt 4 p.m. EST (2100 GMT), the Canadian dollar CAD=D4 was up 0.4 at C$1.2472 to the greenback, or 80.18 U.S. cents. The currency traded in a range of C$1.2466 to C$1.2556.\nFor the week, the loonie lost 0.5 percent.\nInvestors took the view that the Bank of Canada will hike on Jan. 17 despite a more uncertain outlook for the North American Free Trade Agreement.\n“They realize, all things being equal, that they have to be more hawkish and hike rates,” said Greg Taylor, portfolio manager at Redwood Asset Management.\n“It might be more of a dovish hike,” Taylor said. “We have to start normalizing, but we really can’t be more aggressive in our hiking stance due to some of the uncertainties around NAFTA.”\nExpectations that the Bank of Canada will boost interest rates for the third time since July had surged after recent blowout domestic jobs data.\nBets had been tempered by a Reuters report on Wednesday that Canada was increasingly convinced U.S. President Donald Trump would soon announce the United States intends to pull out of the North American Free Trade Agreement. But the chances of a hike next week have since recovered to around 80 percent, the overnight index swaps market indicated. BOCWATCH\nCanada, which sends about 75 percent of its exports to the United States, welcomed U.S. President Donald Trump’s suggestion that talks to modernize NAFTA could be extended beyond the end-March deadline, a move which might help break a deadlock at the negotiations. [nL1N1P70QZ]\nU.S. crude oil futures CLc1 settled 0.8 percent higher at $64.30 a barrel. Oil is one of Canada’s major exports. [nL4N1P72CW]\nSpeculators have raised bullish bets on the Canadian dollar for the first time in three weeks, data from the U.S. Commodity Futures Trading Commission and Reuters calculations showed. As of Jan. 9, net long positions had increased to 17,461 contracts from 14,739 a week earlier.\nThe U.S. dollar .DXY fell against a basket of major currencies as the euro extended its recent gains. [nL1N1P71P7]\nCanadian government bond prices were lower across much of the yield curve in sympathy with U.S. Treasuries after data showed underlying U.S. consumer prices rose the most in 11 months. The 10-year CA10YT=RR fell 9 Canadian cents to yield 2.178 percent. [nL1N1P71OV]\nReporting by Fergal Smith; Editing by Lisa Von Ahn and Diane Craft\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-13T06:19:00.000+02:00", "crawled": "2018-01-13T06:47:11.002+02:00", "highlightTitle": ""}