{"organizations": [], "uuid": "fb1422a89a4a53e30f0dcd855b859a14326585c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-green-spirit-industries-inc-completes-acquisition-of-pre-qualified-medicinal-cannabis-dispensary-in-puerto-rico.html", "country": "US", "domain_rank": 767, "title": "Green Spirit Industries Inc. Completes Acquisition of Pre-Qualified Medicinal Cannabis Dispensary in Puerto Rico", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-05T15:05:00.000+02:00", "replies_count": 0, "uuid": "fb1422a89a4a53e30f0dcd855b859a14326585c1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-green-spirit-industries-inc-completes-acquisition-of-pre-qualified-medicinal-cannabis-dispensary-in-puerto-rico.html", "ord_in_thread": 0, "title": "Green Spirit Industries Inc. Completes Acquisition of Pre-Qualified Medicinal Cannabis Dispensary in Puerto Rico", "locations": [], "entities": {"persons": [{"name": "gsrx", "sentiment": "negative"}, {"name": "les ball", "sentiment": "none"}, {"name": "maria", "sentiment": "none"}, {"name": "irma", "sentiment": "none"}], "locations": [{"name": "puerto rico", "sentiment": "none"}, {"name": "puerto rico san juan", "sentiment": "none"}, {"name": "san juan", "sentiment": "none"}], "organizations": [{"name": "green spirit industries inc.", "sentiment": "negative"}, {"name": "green spirit industries inc", "sentiment": "negative"}, {"name": "llc", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "green spirit", "sentiment": "none"}, {"name": "puerto rico department of health", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN JUAN, Puerto Rico, Jan. 05, 2018 (GLOBE NEWSWIRE) -- Green Spirit Industries Inc. (OTC Pink:GSRX) (“Green Spirit” or, the “Company”), through its wholly-owned subsidiary, Project 1493, LLC, has completed an acquisition of a pre-qualified medicinal cannabis dispensary in San Juan, Puerto Rico. The Company plans to open the dispensary in early 2018, pending a satisfactory inspection by the Puerto Rico Department of Health and issuance of the requisite operating permit. This is Green Spirit’s fifth pre-qualified medical cannabis dispensary in Puerto Rico.\n“Despite the delays imposed by Hurricanes Maria and Irma, Green Spirit continues to be fully committed to providing medicinal cannabis in a wide variety of delivery systems to patients in Puerto Rico, and we have, therefore, increased our investment on the island with this new acquisition,” said Les Ball, CEO of Green Spirit Industries Inc. “Our goal is to make medicinal cannabis available throughout the island via locations that are accessible to all, and professionally managed and operated. We are working hard to have our first location open for business within the next few weeks.”\nGreen Spirit’s newest dispensary is located on Calle César González in San Juan‘s Baldrich neighborhood, which includes a mix of both residential and commercial properties and is notable for its large concentration of doctors’ offices and medical practices. As part of the acquisition, Green Spirit has assumed the dispensary’s building lease.\nAs previously reported, the Company has an additional four pre-qualified dispensaries that are in various stages of development and are located in Fajardo, Carolina, Dorado and the Puerto Nuevo neighborhood of San Juan. The Company’s goal is to acquire and open an additional fifteen (15) dispensaries over the next 12-18 months.\nAbout Green Spirit Industries Inc.\nGreen Spirit Industries Inc. (OTC Pink:GSRX), together with its wholly-owned subsidiary, Project 1493, LLC, is in the business of acquiring, developing and operating medical cannabis dispensaries.\nForward-Looking Statements\nThis press release contains forward-looking statements. Such statements include statements regarding our expectations, hopes, beliefs or intentions regarding the future, including but not limited to statements regarding our market, strategy, competition, development plans (including acquisitions and expansion), financing, revenues, operations, and compliance with applicable laws. Forward-looking statements involve certain risks and uncertainties, and actual results may differ materially from those discussed in any such statement. Factors that could cause actual results to differ materially from such forward-looking statements include the risks described in greater detail in the following paragraphs. All forward-looking statements in this document are made as of the date hereof, based on information available to us as of the date hereof, and we assume no obligation to update any forward-looking statement except where applicable law requires us to update these statements. Market data used throughout this prospectus is based on published third party reports or the good faith estimates of management, which estimates are based upon their review of internal surveys, independent industry publications and other publicly available information.\nContact :\nPaul Gendreau\nPGPR\npaul@pgprmedia.com\n678-807-7945\nSource:Green Spirit Industries, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=CY5syG4EXvfCIPDDNvfHRkNHKa_j1tYomeJoszREZahP6LX8aFKitPTiTa2oBUxdRRCWAKbphsXjmg98sj-8E32cTh206xNIk16JbxscTCc="], "published": "2018-01-05T15:05:00.000+02:00", "crawled": "2018-01-05T18:02:48.000+02:00", "highlightTitle": ""}