{"organizations": [], "uuid": "7e617c10ede42b038a81d83eeefb735dcc487853", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220651466&w=1200&r=LYNXMPEE081KK", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-bitcoin-funds-etfs-analysis/road-to-bitcoin-etf-paved-with-red-tape-idUSKBN1EY2OE", "country": "US", "domain_rank": 408, "title": "Road to bitcoin ETF paved with red tape", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T00:09:00.000+02:00", "replies_count": 0, "uuid": "7e617c10ede42b038a81d83eeefb735dcc487853"}, "author": "", "url": "https://www.reuters.com/article/us-bitcoin-funds-etfs-analysis/road-to-bitcoin-etf-paved-with-red-tape-idUSKBN1EY2OE", "ord_in_thread": 0, "title": "Road to bitcoin ETF paved with red tape", "locations": [], "entities": {"persons": [{"name": "gertrude", "sentiment": "negative"}, {"name": "trevor hunnicutt", "sentiment": "none"}, {"name": "marc butler", "sentiment": "none"}], "locations": [{"name": "road", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "sec", "sentiment": "none"}, {"name": "intelligize", "sentiment": "none"}, {"name": "u.s. securities and exchanges commission", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 10:07 PM / Updated a day ago Road to bitcoin ETF paved with red tape Gertrude Chavez-Dreyfuss , Trevor Hunnicutt 5 Min Read \nNEW YORK (Reuters) - The going is getting tough for U.S. companies hoping to win the race to bring a bitcoin exchange-traded fund to market. \nBitcoin’s 1,500 percent surge last year has stoked investor demand for any product with exposure to the red-hot asset. A host of companies are jostling to launch exchange-traded funds which would open up the cryptocurrency to a broad retail market. \nBut regulators are asking tough questions, and five fund managers this week shelved plans to launch ETFs based on bitcoin futures, citing concerns from the U.S. Securities and Exchanges Commission. \n“We can expect the SEC to be increasingly watchful over any companies involved in bitcoin activity,” said Marc Butler, a director at compliance management firm Intelligize. “Investors should be warned. If it’s too good to be true, then it probably is.” \nThe SEC has pending applications for at least 14 different bitcoin ETFs or related products, regulatory filings show. \nA handful of funds have been knocked back. The SEC in March denied a request to list an ETF from investors Cameron and Tyler Winklevoss, owners of the Gemini bitcoin exchange. \nThe Winklevoss fund is seeking to invest in bitcoin directly. Other fund firms staked their hopes on recently launched U.S.-listed bitcoin futures contracts, which promised a more stable base for ETFs than the largely unregulated virtual currency spot market. \nBut on Monday, Rafferty Asset Management LLC, which manages the Direxion brand and hopes to list leveraged funds that would double bitcoin’s daily price moves, disclosed that the SEC was concerned about the “liquidity and valuation” of bitcoin futures contracts. It said the regulator told it to withdraw its application until it could address those issues. \nOn Tuesday, ProShare Capital Management LLC, Van Eck Associates Corp and First Trust Advisors LP said in filings that SEC staff asked them to shelve plans for bitcoin ETFs. \nDirexion, ProShares, VanEck and the SEC declined to comment. First Trust did not immediately respond to an email. \nBitcoin BTC=BTSP was last down 1.5 percent at $14,779 on the Luxembourg-based Bitstamp exchange. FILE PHOTO: The seal of the U.S. Securities and Exchange Commission hangs on the wall at SEC headquarters in Washington, DC, U.S., June 24, 2011. REUTERS/Jonathan Ernst/File Photo ENTHUSIASM UNCURBED \nThe race to launch bitcoin funds is still likely to charge forward, analysts said, as fund managers rush to address the SEC’s concerns and redesign their funds to placate the regulator. \n“This is being driven by retail demand,” said Axel Merk, founder and chief investment officer of Merk Investments, which launched a physically backed gold ETF in 2014. “If people are enthusiastic about bitcoin, then people are going to try to market a bitcoin ETF.” \nMerk said he knows of several funds that have examined the criticisms of the past filings and are determined to push through with their bitcoin ETF launches. \nSome are also attempting indirect approaches that could provide bitcoin exposure via more traditional assets. \nFive fund managers, for instance, have filed proposals for funds that would invest primarily in stocks with exposure to bitcoin or blockchain, the technology used to record bitcoin transactions. \nThorny questions remain for funds that seek to trade in bitcoin futures, including the level of margin required to trade futures and the potential for bitcoin futures to trade at dramatically different prices than the cryptocurrency itself, according to two people who did not want to be identified revealing discussions they had with the SEC. \nRegulatory concerns did not stop the market from opening up by way of futures, though scrutiny of digital currency contracts now appears to be ramping up. \nThe U.S. Commodity Futures Trading Commission last month allowed CME Group Inc ( CME.O ) and CBOE Global Markets Inc ( CBOE.O ) to list bitcoin futures contracts, but recently sought to review its process for listing digital currency futures. \nStill, some think that, head-spinning volatility of bitcoin aside, U.S. capital markets risk missing out on a burgeoning technology if they are too cautious. \n“If the SEC doesn’t start allowing products, the capital markets here in the United States will get left behind by those in Europe and Asia. That’s always a concern,” said Trace Schmeltz, a partner at Barnes & Thornburg in Chicago. Reporting by Gertrude Chavez-Dreyfuss and Trevor Hunnicutt; Additional reporting by Jemima Kelly in London; Editing by Megan Davies and Meredith Mazzilli", "external_links": [], "published": "2018-01-10T00:09:00.000+02:00", "crawled": "2018-01-10T00:19:23.006+02:00", "highlightTitle": ""}