{"organizations": [], "uuid": "ce55fcb751ca6dcd4066fdd3fd289bca20195180", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-african-union-summit-southsudan/african-union-joins-growing-chorus-demanding-sanctions-on-south-sudan-war-idUKKBN1FI2J8", "country": "US", "domain_rank": 408, "title": "African Union joins growing chorus demanding sanctions on South Sudan war", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T21:59:00.000+02:00", "replies_count": 0, "uuid": "ce55fcb751ca6dcd4066fdd3fd289bca20195180"}, "author": "", "url": "https://uk.reuters.com/article/uk-african-union-summit-southsudan/african-union-joins-growing-chorus-demanding-sanctions-on-south-sudan-war-idUKKBN1FI2J8", "ord_in_thread": 0, "title": "African Union joins growing chorus demanding sanctions on South Sudan war", "locations": [], "entities": {"persons": [{"name": "salva kiir", "sentiment": "none"}, {"name": "moussa faki mahamat", "sentiment": "none"}, {"name": "riek machar", "sentiment": "none"}], "locations": [{"name": "south sudan", "sentiment": "none"}, {"name": "african union", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "african union", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 8:03 PM / Updated 10 minutes ago African Union joins growing chorus demanding sanctions on South Sudan war Reuters Staff 3 Min Read \nADDIS ABABA (Reuters) - The African Union said on Monday it is open to imposing sanctions on leaders violating ceasefires in South Sudan, joining a growing chorus of officials who say those prolonging the conflict must be punished. \n“We need to act against those who, with impunity, are continuing to massacre their peaceful populations,” the head of the African Union commission, Moussa Faki Mahamat, told reporters at the AU Summit on Monday. \nOil-rich South Sudan has been wracked by civil war since 2013, when troops loyal to President Salva Kiir clashed with troops loyal to then-Vice President Riek Machar. \nSince then, the conflict has claimed tens of thousands of lives, slashed oil production and driven about a third of the population of 12 million from their homes. \nCeasefires have been repeatedly violated and last week the U.S. ambassador to the United Nations and the internationally-backed ceasefire monitoring team both called for sanctions on leaders who instigated violence. \nMachar is already under house arrest in South Africa, where he flew for treatment after being wounded. \nMahamat’s statement is important because many African countries have been divided on how best to deal with the violence in South Sudan. \nFighting has often split the country along ethnic lines and reports of sexual violence are widespread. The war has sent nearly two million refugees flooding across the region in Africa’s worst such crisis since the 1994 Rwanda genocide. \nMahamat did not specify whether the AU was referring to travel bans, asset freezes or arms embargos - all options that have been discussed. \n“All the agreements that have been signed have been violated,” he said. “Here (at the AU), we have provisions on sanctions.” \nSome top officials close to Kiir have already been sanctioned by the United States, including the once-powerful army chief Paul Malong, who was later fired and forced into exile when he quarrelled with the president. \nThe United States wants to impose an arms embargo, but may face resistance at the U.N. from China, who has invested heavily in South Sudan’s oil fields. Reporting by Aaron Maasho; Editing by Matthew Mpoke Bigg", "external_links": [], "published": "2018-01-29T21:59:00.000+02:00", "crawled": "2018-01-29T22:19:55.001+02:00", "highlightTitle": ""}