{"organizations": [], "uuid": "897a08d93acd6121856083f3f8a19a6d3941be54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/business-wire-mike-jackson-former-presidentcoo-of-supervalu-joins-logileas-advisory-board.html", "country": "US", "domain_rank": 767, "title": "Mike Jackson, Former President/COO of SUPERVALU Joins Logile’s Advisory Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T15:53:00.000+02:00", "replies_count": 0, "uuid": "897a08d93acd6121856083f3f8a19a6d3941be54"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/business-wire-mike-jackson-former-presidentcoo-of-supervalu-joins-logileas-advisory-board.html", "ord_in_thread": 0, "title": "Mike Jackson, Former President/COO of SUPERVALU Joins Logile’s Advisory Board", "locations": [], "entities": {"persons": [{"name": "mike jackson", "sentiment": "negative"}, {"name": "logile", "sentiment": "none"}, {"name": "mike", "sentiment": "none"}], "locations": [{"name": "logile", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "rvalu", "sentiment": "none"}], "organizations": [{"name": "inc.", "sentiment": "negative"}, {"name": "supervalu", "sentiment": "negative"}, {"name": "logile’s advisory board", "sentiment": "neutral"}, {"name": "northwest regional", "sentiment": "none"}, {"name": "retail food operations", "sentiment": "none"}, {"name": "northgate gonzalez markets", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS--(BUSINESS WIRE)-- Logile, Inc. announces that Mike Jackson, former President and COO of SUPERVALU, has joined Logile as an advisory board member.\nDuring his career at SUPERVALU, Mike served the company in many key assignments that included Northwest Regional President, Senior VP of Retail Food Operations, EVP and President of Retail Food Companies and his last position as President/COO of SUPERVALU. He also held numerous positions in his early career that included responsibilities in merchandising, operations and procurement as well as managing several retail supermarkets prior to joining SUPERVALU. Since his retirement from SUPERVALU in late 2009, Mike has been actively involved in his support for industry organizations and causes. He serves on the boards of Northgate Gonzalez Markets and iControl as well as doing work for nonprofit organizations in the central Florida area where he resides.\nMike is an accomplished executive with leadership in retail operations, marketing and logistics. He is strategic, innovative, analytical and decisive with strong mentoring, talent development and change management capabilities. Mike is known in the industry for his visionary thoughts and how retail stores should transform to compete effectively in the marketplace such as streamlining operational planning, integrating operational and merchandizing planning, and recognizing the need for accurate daily forecasting. Mike is a seasoned industry veteran committed to life-long learning. He is accomplishment driven and a collaborative leader that builds rapport with all stakeholders for effectiveness. Mike holds a degree in Management and Accounting from the University of Wisconsin-Green Bay where he also serves as a trustee. Mike also completed the Wharton School’s executive management program at the University of Pennsylvania.\nMike’s leadership and executive guidance will help support Logile’s transformation from a strong Workforce and Execution Management provider of software and consulting services to become an even more significant player with an even larger industry footprint in the retail software and solution marketplace. His insight will be leveraged to address industry needs for the development, messaging, and marketing of Logile’s significant capacities in software, industrial engineering services, and store operations expertise. In addition to his business acumen, Mike brings strong coaching skills with organizational dynamics to Logile that will support the senior management team at Logile. His network throughout the retail industry will be a significant asset to Logile.\nLogile’s Founder and CEO, Purna Mishra, stated, “Mike’s vast experience in retail organizations across a wide spectrum of successful formats and geographies is a great match for Logile’s commitment to support diverse business models across all retail formats and all forms of retailing. His career demonstrates a commitment to excellence in retail differentiation that is critical to support a thought-leadership strategy when too many businesses are falling prey to an imitative catch-up approach in their operations and services.”\nRick Schlenker, Logile’s EVP of Sales and Marketing, added, “Mike’s expertise in retail and wholesale operations, and his extensive merchandising and operations savvy will help propel Logile’s strategic expansion from WFM into related areas of retail operational planning and store operations management. Mike’s unique perspective and experience will help fuel Logile’s growth while ensuring we continue to provide exceptional solutions, services and support to all of our customers.”\nMike Jackson stated, “Logile’s incredibly strong solutions for forecasting, wall-to-wall task based labor scheduling, task and incidence management, built on top of accurate labor standards and an enterprise labor model, is the foundation for success that I have been championing over the past several years. Logile’s success with leading retailers (having never lost a customer in their thirteen-year existence) is echoed by what I hear from the industry and is recognized in the latest RIS Leadership Board rankings. It is an easy decision for me to agree to join their advisory board. I look forward to offering my hand at helping them expand their solutions and to increase their reach across a broader spectrum of retailers.”\nAbout Logile\nLogile, Inc., a Texas based company, was incorporated in 2005 and remains privately held with software development and quality assurance teams located in the United States, the United Kingdom, the European Union, China, and India and industrial engineers and seasoned retail consulting teams located across the United States and Latin America.\nLogile provides Workforce Management and Execution Compliance Solutions encompassing industrial engineering consulting services and planning and execution software applications that empower more than three million retail employees across six continents in 18,000+ stores to optimize efficiency, improve customer service, and increase profitability. Logile is actively expanding its superior portfolio in workforce and execution management to wider area of operational and merchandise planning that are all supported by industry leading artificial intelligence components on an all-mobile user platform. As previously announced, Logile has been ranked the top WFM provider of overall value, support and quality of services in the last three RIS Leaderboard surveys.\nFor more information about our unique and customizable Roadmap of services and solutions, please contact Rick Schlenker at rick.schlenker@logile.com or 972-550-6000 x1001. Follow Logile on LinkedIn .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180115005281/en/\nLogile\nRick Schlenker, 972-550-6000 x1001\nrick.schlenker@logile.com\nSource: Logile", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.logile.com%2Fportfolio%2Fworkforce-management&esheet=51741638&newsitemid=20180115005281&lan=en-US&anchor=Workforce+Management&index=1&md5=b7d6f67c53d9922b9a3d31d49f2977a8", "http://www.businesswire.com/news/home/20180115005281/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Flogile-inc-&esheet=51741638&newsitemid=20180115005281&lan=en-US&anchor=LinkedIn&index=4&md5=8dc8a04e0a5e12cdb9d7df3c1b901a2c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.logile.com%2Fsolutions%2Fexecution-and-communication-management-w-compliance%2F&esheet=51741638&newsitemid=20180115005281&lan=en-US&anchor=Execution+Compliance+Solutions&index=2&md5=708695bf00017fac3fcd26fa37f3df62", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.logile.com%2Froadmap%2F&esheet=51741638&newsitemid=20180115005281&lan=en-US&anchor=Roadmap&index=3&md5=c60e00429158968c1fdd78dd438902d2"], "published": "2018-01-15T15:53:00.000+02:00", "crawled": "2018-01-15T16:27:25.002+02:00", "highlightTitle": ""}