{"organizations": [], "uuid": "0f996024d88f16ec03b09ce9504216abade5ca7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225258715&w=1200&r=LYNXMPEE0O1L9", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-gymnastics-usa-nassar-resignation/fourth-usa-gymnastics-board-member-resigns-after-abuse-scandal-idUKKBN1FE2WY", "country": "US", "domain_rank": 408, "title": "Fourth USA Gymnastics board member resigns after abuse scandal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T22:15:00.000+02:00", "replies_count": 0, "uuid": "0f996024d88f16ec03b09ce9504216abade5ca7b"}, "author": "", "url": "https://uk.reuters.com/article/uk-gymnastics-usa-nassar-resignation/fourth-usa-gymnastics-board-member-resigns-after-abuse-scandal-idUKKBN1FE2WY", "ord_in_thread": 0, "title": "Fourth USA Gymnastics board member resigns after abuse scandal", "locations": [], "entities": {"persons": [{"name": "joseph ax", "sentiment": "none"}, {"name": "nassar", "sentiment": "none"}, {"name": "martinez", "sentiment": "none"}, {"name": "kevin martinez", "sentiment": "none"}, {"name": "larry nassar", "sentiment": "none"}], "locations": [], "organizations": [{"name": "fourth usa gymnastics", "sentiment": "negative"}, {"name": "usa gymnastics", "sentiment": "none"}, {"name": "usag", "sentiment": "none"}, {"name": "u.s. olympic committee", "sentiment": "none"}, {"name": "min read  a fourth usa gymnastics", "sentiment": "none"}, {"name": "espn", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 8:18 PM / Updated 15 minutes ago Fourth USA Gymnastics board member resigns after abuse scandal Joseph Ax 3 Min Read \nA fourth USA Gymnastics board member has resigned amid increasing public pressure after disgraced long-time team doctor Larry Nassar was sentenced to up to 175 years in prison for abusing young female gymnasts. \nKevin Martinez, an ESPN executive, said on Thursday that he has severed ties with the gymnastics federation, after the U.S. Olympic Committee’s chief executive threatened in an open letter on Wednesday to decertify USA Gymnastics as a governing body unless the 18 members on the board of directors were replaced. \nHis departure comes after three other members, who held the board’s leadership positions, stepped down on Monday. \n“I joined the board just nine months ago, well after Nassar’s departure from USAG, in the hopes of helping to move the organization in a positive direction,” Martinez said in an emailed statement. “That hope for this board is no longer possible so I submitted my resignation.” \nNassar, 54, was sentenced to 40 to 175 years in prison on Wednesday for sexually assaulting young girls under the guise of medical treatment, following a weeklong hearing that saw more than 150 accusers recount their stories in a Michigan courtroom. \nHe is already serving a 60-year federal prisons sentence for child pornography convictions and faces a final sentencing next week in Michigan for three additional counts of abuse. \nUSAG’s spokeswoman, Leslie King, did not respond to requests for comment on Thursday. In a statement on Wednesday following the USOC demand, the federation said it supported the letter but did not specifically address the call for board members’ resignations. \nThe webpage listing USAG’s board members appeared to have been taken down around midday on Thursday without explanation. \nThe USOC itself has not escaped criticism from some of the sport’s biggest names. \n“I have represented the USA in two Olympics and have done so successfully,” gold medallist Aly Raisman, who accused Nassar of abusing her, said at his hearing. “And both USA Gymnastics and the U.S. Olympic Committee have been very quick to capitalise and celebrate my success, but did they reach out when I came forward? No.” \nLou Anna Simon, the president of Michigan State University, where Nassar also worked, stepped down late on Wednesday night amid calls from critics and Michigan lawmakers for her termination. \n“As tragedies are politicized, blame is inevitable. As president, it is only natural that I am the focus of this anger,” Simon said in her resignation letter.", "external_links": [], "published": "2018-01-25T22:15:00.000+02:00", "crawled": "2018-01-25T22:50:16.008+02:00", "highlightTitle": ""}