{"organizations": [], "uuid": "3302aaecc3462ad18c35faa9e7d1443747168937", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955078-26904022_2016294648383861_5778017495941657839_n.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/19/burger-king-takes-swat-at-mcdonalds-with-new-gut-bomb-burger.html", "country": "US", "domain_rank": 767, "title": "Burger King takes swat at McDonald's with new gut bomb burger", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T14:06:00.000+02:00", "replies_count": 0, "uuid": "3302aaecc3462ad18c35faa9e7d1443747168937"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/burger-king-takes-swat-at-mcdonalds-with-new-gut-bomb-burger.html", "ord_in_thread": 0, "title": "Burger King takes swat at McDonald's with new gut bomb burger", "locations": [], "entities": {"persons": [{"name": "burger king", "sentiment": "negative"}, {"name": "burger kin", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "mcdonald", "sentiment": "negative"}, {"name": "dollar menu some burger king", "sentiment": "none"}, {"name": "usa today", "sentiment": "none"}, {"name": "burger king", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Think of it as the battle of the gut busters.\nIn an effort to go after rival McDonald's , Burger King has unveiled a hefty new burger made with a half-pound of beef, and it went on sale Thursday.\nSource: Burger King The Double Quarter Pound King The Double Quarter Pound King Sandwich takes direct aim at McDonald's Double Quarter Pounder.\nBurger King's version will consists of two beef patties with American cheese, sliced onions, pickles and ketchup on a toasted, sesame seed bun.\nUnlike the Double Whopper, the new Double Quarter Pound King has no lettuce, tomato or mayonnaise, but it does have two slices of cheese, according to the company. The new burger also has 60% more beef than the old Big King burger.\nMore from USA Today:\nMcDonald's sets goal of recycling, 100% sustainable packaging by 2025\nMcDonald's hopes customers buck up Thursday to new Dollar Menu\nSome Burger King customers who overpaid for breakfast deal could get settlement\nT he new Burger King burger has 900 calories and 54 grams of fat and the Double Whopper, 900 calories and 58 grams of fat, or almost half the 2,000 daily recommended calorie intake for adults. The chain's most caloric burger is the Bacon King at 1,150 and 79 grams of fat.\nBy contrast, McDonald's Double Quarter Pounder with Cheese has 770 calories and 45 grams of fat, while Big Mac is 540 calories and 28 grams of fat, according to the chain's website.\nBut one thing is clear, the new King burger could be a profit driver in the fast-food wars. At a recommended price of $5.39, it stands in contrast to the spate of cheaper burger choices showing up on menu boards.\nPlus, in true Burger King fashion, executives are using the new sandwich to take potshots at the competition.\n\"We'd like to offer our deepest condolences to all the flat-top fried double quarter pound burgers out there. We're flame grilling the competition,\" Burger King said in a statement.\nThis isn't the first time Burger King has trolled McDonald's. An ad at Halloween time featured a scary version of Ronald McDonald made up to resemble Pennywise from the horror movie It , based on the Stephen King book. The tagline was \"Come as a clown, eat like a king.\"\nBurger King's sales grew 3.6%, owner Restaurant Brands International said in its third-quarter earnings report. McDonald's has been making strides in 2017 with the introduction of the upscale Signature Crafted Recipes sandwich line, the hand-crafted McCafe beverages and the new $1-$2-$3 Dollar Menu.\nBoth chains — as well as Wendy's and smaller regional fast-food burger chains — are facing increasing competition from the so-called better-burger players, which serve more expensive and, some say, tastier versions of the American classic, such as Five Guys, Smashburger, Shake Shack and Fatburger.\n\"Menu initiatives that add newness help drive some traffic. It's the one thing quick-service restaurants have to do to attract customers,\" said Helena Song, who covers Restaurant Brands International for S&P Global. \"This particular initiative is aimed at attracting those hard-core burger eaters.\"\nBurger King was founded in 1954 and today is the world's second-largest fast-food burger chain with more than 15,000 locations around the globe, according to the company.\nOntario-based Restaurant Brands International's portfolio also includes Tim Hortons and Popeyes.\nFollow USA TODAY reporter Zlati Meyer on Twitter: @ZlatiMeyer", "external_links": [], "published": "2018-01-19T14:06:00.000+02:00", "crawled": "2018-01-19T14:51:42.004+02:00", "highlightTitle": ""}