{"organizations": [], "uuid": "0ace669e57126e8fa5bbd426f4cff1d5b8c80d08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WU809_3koNW_TOP_20180102121948.jpg", "site_section": "https://www.wsj.com/news/markets", "section_title": "Stock Market &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/u-s-government-bonds-strengthen-after-bojs-kuroda-stands-by-stimulus-1516724794", "country": "US", "domain_rank": 387, "title": "U.S. Government Bonds Strengthen After BOJ’s Kuroda Stands By Stimulus", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T23:47:00.000+02:00", "replies_count": 0, "uuid": "0ace669e57126e8fa5bbd426f4cff1d5b8c80d08"}, "author": "Sam Goldfarb", "url": "https://www.wsj.com/articles/u-s-government-bonds-strengthen-after-bojs-kuroda-stands-by-stimulus-1516724794", "ord_in_thread": 0, "title": "U.S. Government Bonds Strengthen After BOJ’s Kuroda Stands By Stimulus", "locations": [], "entities": {"persons": [{"name": "kuroda", "sentiment": "negative"}, {"name": "haruhiko kuroda", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "bank of japan", "sentiment": "negative"}, {"name": "boj", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS U.S. government bonds strengthened Tuesday after Bank of Japan Gov. Haruhiko Kuroda undercut speculation that the central bank was close to ending its postcrisis stimulus policies.\nThe yield on the benchmark 10-year U.S. Treasury note settled at 2.622%, compared with 2.663% Monday, logging its first decline after four sessions of increases. Yields fall when bond prices rise.\nFollowing the BOJ’s latest policy meeting, Mr. Kuroda said the central bank wasn’t ready to even discuss an exit to its monetary stimulus, given that inflation was still less than halfway to the bank’s target.\nThat message helped bolster government bonds across developed markets, sending a cautionary signal to investors that major central banks could take their time in shifting to tighter monetary policies despite an improved global-growth outlook.\nInvestors and analysts widely agree that bond-buying programs by the BOJ and European Central Bank have played a large role in dragging down yields globally. The purchases have made bonds in those regions more scarce and driven yield-starved investors to buy U.S. fixed-income assets.\nInvestors have speculated recently that better economic data would allow both the BOJ and ECB to stop adding to their bond portfolios, contributing to a large increase in Treasury yields.\nAfter finishing 2017 at 2.409%, the 10-year Treasury yield moved above 2.6% last week and settled Monday at its highest level since April 2014.\nStoking the speculation about central banks, minutes from the ECB’s December meeting revealed officials “widely” agreed that the bank needed to change its guidance to investors early this year to better reflect the state of the eurozone economy. Earlier this month, the BOJ also bought fewer long-term Japanese government bonds than investors had expected, a move that added to market jitters even as some analysts dismissed it as unimportant.\nMany investors and analysts expect the Treasurys market to remain under pressure in the coming months, as long as the economy stays on its current trajectory.\n“In general we think over the next couple of months yields should across the curve grind higher,” said John Herrmann, rates strategist at MUFG Securities in New York. One possibility, he said, is that the Federal Reserve could raise its forecasts for economic growth and inflation, causing a big jump in long-term Treasury yields.\nThough consumer prices have been rising slowly, many investors expect falling unemployment to eventually lead to higher inflation, which is a main threat to government bonds because it erodes the purchasing power of their fixed payments and can make it easier for the Fed to raise interest rates.\nWrite to Sam Goldfarb at sam.goldfarb@wsj.com", "external_links": [], "published": "2018-01-23T23:47:00.000+02:00", "crawled": "2018-01-23T22:52:20.000+02:00", "highlightTitle": ""}