{"organizations": [], "uuid": "732b19b050fc47dfadd7e3f31c81498a4a6935fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 624}, "facebook": {"likes": 25, "shares": 25, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/07/18/101849047-jeff-bezos.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/amazon-grabbed-4-percent-of-all-us-retail-sales-in-2017-new-study.html", "country": "US", "domain_rank": 767, "title": "Amazon grabbed 4 percent of all US retail sales in 2017: New study", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.018, "site_type": "news", "published": "2018-01-03T15:32:00.000+02:00", "replies_count": 0, "uuid": "732b19b050fc47dfadd7e3f31c81498a4a6935fe"}, "author": "Lauren Thomas", "url": "https://www.cnbc.com/2018/01/03/amazon-grabbed-4-percent-of-all-us-retail-sales-in-2017-new-study.html", "ord_in_thread": 0, "title": "Amazon grabbed 4 percent of all US retail sales in 2017: New study", "locations": [], "entities": {"persons": [{"name": "jeff bezos", "sentiment": "negative"}, {"name": "spencer millerberg", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "walmart", "sentiment": "none"}, {"name": "amazon.com", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "There's no denying that Amazon 's retail business had an impressive 2017 and there's still plenty of room for the company to grow in certain categories this year.\nThe internet giant was responsible for about 44 percent of all U.S. e-commerce sales last year, or about 4 percent of the country's total retail sales figure, according to One Click Retail, an e-commerce analytics provider.\n\"Every major trend we see across 2017 can be explained by the fact that more of Amazon's core demographic (millennials) are growing up: they're increasingly owning homes, raising children, and buying a TON of stuff to go with it,\" One Click Retail CEO Spencer Millerberg wrote in an annual review of Amazon.\nTo be sure, he added: \"This raises the question: will this create long-term changes and tailwinds for Amazon? Will 300-ish Whole Foods stores be enough to compete meaningfully in the brick-and-mortar space against Walmart 's 4000+ stores?\"\nOne Click Retail found the fastest-growing product groups on Amazon.com in 2017 were luxury beauty (up 47 percent from a year ago), pantry items (up 38 percent), grocery (up 33 percent) and furniture (up 33 percent).\nThe most sales last year on Amazon.com — more than $8 billion — stemmed from the company's consumer electronics division, which includes laptops, headphones and other computer components. Home and kitchen, publishing (which includes books) and sports and outdoors were other top-grossing categories.\nIn 2017, Amazon worked to quietly build out an automated marketing system that caters to the brands that sell on its website (taking market share from the likes of Google and Facebook ). It also rolled out additional private-label lines across numerous retail categories and took its voice-enabled platform, Alexa, to new highs.\nMillerberg said 2018 should bring more of the same, as Amazon gets more ambitious with its private labels , experiments with Alexa , grows with Whole Foods and lures new shoppers to its Prime membership base.\n\"Ultimately, success — for both Amazon itself and for brands that sell through the platform — comes down to knowing your audience,\" he wrote. \"It's clear that Amazon catered to the right crowd in 2017.\"\nAmazon didn't immediately respond to CNBC's request for comment on One Click Retail's data.\nAt the end of December, One Click Retail said Amazon's private-label brands by themselves had almost $450 million in sales in 2017, with the majority of those sales stemming from AmazonBasics, which sells items such as batteries and computer cables.\n\"This year, Amazon's private brands showed enough success stories to guarantee that Amazon won't be backing off any time soon,\" Millerberg explained at the time.", "external_links": [], "published": "2018-01-03T15:32:00.000+02:00", "crawled": "2018-01-03T15:51:41.004+02:00", "highlightTitle": ""}