{"organizations": [], "uuid": "da3ba2e2c2e59f87e45150a95d992d3b5c5d9b1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955172-AP_051123023742.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/19/delta-sets-more-stringent-requirements-for-support-animals-on-board.html", "country": "US", "domain_rank": 767, "title": "Delta sets more stringent requirements for support animals on board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T15:32:00.000+02:00", "replies_count": 0, "uuid": "da3ba2e2c2e59f87e45150a95d992d3b5c5d9b1e"}, "author": "Leslie Josephs", "url": "https://www.cnbc.com/2018/01/19/delta-sets-more-stringent-requirements-for-support-animals-on-board.html", "ord_in_thread": 0, "title": "Delta sets more stringent requirements for support animals on board", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "delta", "sentiment": "neutral"}, {"name": "delta air lines", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "2 Hours Ago | 00:42 \nDelta Air Lines is cracking down on comfort dogs, turkeys and a host of other animals passengers bring on board. \nStarting March 1, travelers with a psychiatric service or support animal will have to sign and present a document that says the animal can behave, in an effort to prevent aggressive household pets from traveling kennel-free in the cabin, Delta said. They will also have to show proof of the animal's health and up-to-date vaccinations 48 hours in advance. \nThe stricter standards are in response to sharp rise in the number of support animals passengers have been bringing on board, Delta said, and the rise in incidents involving these animals, which has jumped 84 percent since 2016. \nLast year, a passenger's emotional support dog bit the face of the traveler in the next seat aboard a Delta flight. \n\"The rise in serious incidents involving animals in flight leads us to believe that the lack of regulation in both health and training screening for these animals is creating unsafe conditions across U.S. air travel,\" said John Laughter, Delta's senior vice president for corporate safety, security and compliance. \nUnder the 1986 Air Carrier Access Act, support and service animals will still be allowed into the cabin free of charge. \n\"Customers have attempted to fly with comfort turkeys, gliding possums known as sugar gliders, snakes, spiders and more,\" Delta said. \"Ignoring the true intent of existing rules governing the transport of service and support animals can be a disservice to customers who have real and documented needs.\" \nThe Association of Flight Attendants, a union that represents some 50,000 flight attendants across several airlines, including United , cheered the decision. \n\"We need better regulations in place to protect the rights of people with disabilities and our veterans who legitimately need to travel with these animals,\" said Sara Nelson, president of the union. \"We know first-hand that untrained animals can risk the safety, health and security of the passengers and crew.\" \nDelta's flight attendants are not unionized. \nThe Department of Transportation, which held discussions in 2016 with mental and physical disability rights groups about which animals should be allowed in airplane cabins, said it will monitor Delta's policy to make sure it is in line with the rights of passengers with disabilities who travel with service animals. \nA spokesperson for the DOT added that airlines can refuse certain \"unusual service animals\" including snakes, reptiles, ferrets, rodents, and spiders, or if the animal's size or weight would pose a safety threat to passengers. \nOther airlines may soon follow suit. \n\"We are looking at additional requirements to help protect our team members and our customers who have a real need for a trained service or support animal,\" said American Airlines spokesman Ross Feinstein. \"Unfortunately, untrained animals can lead to safety issues for our team, our passengers and working dogs onboard our aircraft. We agree with Delta's efforts and will continue to support the rights of customers, from veterans to people with disabilities, with legitimate needs.\" \nAmerican Airlines requires passengers who want to travel with an emotional or mental health support animals to present a letter from a doctor that states the traveler needs the animal on board with them as well as what his or her emotional or mental disability is. \nUnited, which has a similar policy, also said it was reviewing its current procedures for emotional support animals. Leslie Josephs Airline Reporter for CNBC.com Related Securities", "external_links": [], "published": "2018-01-19T15:32:00.000+02:00", "crawled": "2018-01-19T16:26:53.017+02:00", "highlightTitle": ""}