{"organizations": [], "uuid": "86b567faee6d877114cbebce7e2568b200407e26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-clean-harbors-signs-definitive-agreement-to-acquire-veolia-north-americaas-industrial-cleaning-services-division.html", "country": "US", "domain_rank": 767, "title": "Clean Harbors Signs Definitive Agreement to Acquire Veolia North America’s Industrial Cleaning Services Division", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.083, "site_type": "news", "published": "2018-01-23T16:30:00.000+02:00", "replies_count": 0, "uuid": "86b567faee6d877114cbebce7e2568b200407e26"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-clean-harbors-signs-definitive-agreement-to-acquire-veolia-north-americaas-industrial-cleaning-services-division.html", "ord_in_thread": 0, "title": "Clean Harbors Signs Definitive Agreement to Acquire Veolia North America’s Industrial Cleaning Services Division", "locations": [], "entities": {"persons": [{"name": "geographic rea", "sentiment": "negative"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "customer base norwell", "sentiment": "none"}], "organizations": [{"name": "million transaction will broaden clean harbors’ industrial service capabilities", "sentiment": "neutral"}, {"name": "clean harbors, inc.", "sentiment": "none"}, {"name": "clean harbors", "sentiment": "none"}, {"name": "veolia north america’s u.s. industrial cleaning services division", "sentiment": "none"}, {"name": "veolia north america, inc.", "sentiment": "none"}, {"name": "veolia north america’s industrial cleaning services division", "sentiment": "none"}, {"name": "veolia environmental services north america, llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "$120 Million Transaction Will Broaden Clean Harbors’ Industrial Service Capabilities, Geographic Reach and Customer Base\nNORWELL, Mass.--(BUSINESS WIRE)-- Clean Harbors, Inc. (“Clean Harbors”) (NYSE: CLH) and Veolia Environmental Services North America, LLC, a subsidiary of Veolia North America, Inc. (“Veolia”), today announced the signing of a definitive agreement whereby Clean Harbors will acquire Veolia North America’s U.S. Industrial Cleaning Services Division for $120 million in an all-cash transaction. The acquisition is expected to close in the first quarter of 2018, subject to approval by U.S. regulators and other customary closing conditions.\nFor the 12 months ended December 31, 2017, Veolia North America’s Industrial Cleaning Services Division is expected to have revenues of approximately $210 million. Clean Harbors expects the division to generate Adjusted EBITDA of approximately $15 million to $20 million in its first full year of operations, post synergies.\nThe transaction will enable Clean Harbors to:\nAdd significant size, scale and capabilities to its existing U.S. Industrial Services business Expand its geographic reach, particularly in the Midwest Acquire a talented team of employees, including experienced equipment operators and managers Maximize cross-selling opportunities with its other lines of business Leverage operating efficiencies to reduce cost and improve customer service Accelerate growth in an industry that is recovering from the energy downturn\n“We are excited about the potential benefits to our customers, shareholders and industrial services employees from this transaction,” said Alan S. McKim, Chairman and Chief Executive Officer of Clean Harbors. “The addition of Veolia’s U.S. Industrial Cleaning Services Division to our business will enable us to more rapidly grow our presence in the specialty industrial services market. Its operational footprint, which complements our North American network, will provide us with greater scale and density in key U.S. regions such as the Gulf Coast and will open new industrial markets within the Midwest. This acquisition also further diversifies our base of blue-chip customers, many of whom have long-standing relationships with Veolia. In addition, we expect this acquisition will drive more waste volumes into our disposal network of incinerators, landfills and other waste treatment facilities.”\nThe Veolia division has a fleet of equipment and vehicles consisting of more than 600 units, including vacuum trucks, roll-off trucks, water blasters and light duty vehicles. These assets complement a Clean Harbors’ fleet that today consists of nearly 10,000 pieces of rolling stock. In addition, Veolia is a leader in providing innovative technology in the industrial cleaning market, including Hands Free™ technologies and other automated equipment that improve employee safety.\n“Like Clean Harbors, Veolia North America makes safety a fundamental part of its corporate culture and consistently delivers industry-leading safety results,” McKim said. “It is that commitment to safety, along with an emphasis on delivering quality service, which we expect will create a strong cultural fit between our two organizations.”\nWith more than 60 operating locations across the United States, many of which are nested inside customer facilities, Veolia’s Industrial Cleaning Services Division provides a broad range of services to an extensive customer base. The Division has approximately 1,400 employees and operates a sizeable service fleet of specialized vehicles and equipment. Services offered include industrial vacuuming, hydro-blasting, tank cleaning, chemical cleaning, total waste management programs, decontamination services and transportation services.\nWilliam “Bill” DiCroce, President and CEO of Veolia North America, said, “Clean Harbors is an ideal acquirer for our U.S. Industrial Cleaning Services Division. In divesting this business, we sought a partner that would provide a seamless transition and great continuity for our customers and our employees in that business.”\n“All of our businesses across North America – water, energy, waste and regeneration – are poised for growth,” added DiCroce. “The proceeds of this sale will help fuel and accelerate that growth.”\nMcKim concluded, “We look forward to welcoming the Industrial Cleaning Services employees to the Clean Harbors family. While the energy markets have struggled in recent years, we believe they are beginning to recover. We see this as a compelling acquisition that enables us to leverage our scale to offer customers a broader selection of industrial services from a larger network of locations. We also see the opportunity to drive long-term value for shareholders through the growth prospects we believe will be created by this transaction.”\nDavis, Malm & D’Agostine served as legal counsel to Clean Harbors. Brown Gibbons Lang & Company served as financial advisor to Veolia North America. Orrick, Herrington & Sutcliffe LLP served as legal counsel to Veolia North America.\nAbout Clean Harbors\nClean Harbors (NYSE: CLH) is North America’s leading provider of environmental, energy and industrial services. The Company serves a diverse customer base, including a majority of the Fortune 500, across the chemical, energy, manufacturing and additional markets, as well as numerous government agencies. These customers rely on Clean Harbors to deliver a broad range of services such as end-to-end hazardous waste management, emergency spill response, industrial cleaning and maintenance, and recycling services. Through its Safety-Kleen subsidiary, Clean Harbors also is North America’s largest re-refiner and recycler of used oil and a leading provider of parts washers and environmental services to commercial, industrial and automotive customers. Founded in 1980 and based in Massachusetts, Clean Harbors operates throughout the United States, Canada, Mexico and Puerto Rico. For more information, visit www.cleanharbors.com .\nAbout Veolia North America\nVeolia North America, Inc. is the North American subsidiary of Veolia Environnement S.A., the global leader in optimized resource management. With over 163,000 employees worldwide, the Veolia Group designs and provides water, waste and energy management solutions that contribute to the sustainable development of communities and industries. Through its three complementary business activities, Veolia helps to develop access to resources, preserve available resources, and to replenish them. In 2016, the Veolia group supplied 100 million people with drinking water and 61 million people with wastewater service, produced 54 million megawatt hours of energy and converted 30 million metric tons of waste into new materials and energy. Veolia Environnement (listed on Paris Euronext: VIE) recorded consolidated revenue of €24.39 billion in 2016. www.veolia.com\nSafe Harbor Statement\nAny statements contained herein that are not historical facts are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are generally identifiable by use of the words “believes,” “expects,” “intends,” “anticipates,” “plans to,” “estimates,” “projects,” or similar expressions. Such statements may include, but are not limited to, statements about future financial and operating results, adjusted EBITDA expectations from Veolia’s U.S. Industrial Cleaning Services Division and other statements that are not historical facts. Such statements are based upon the beliefs and expectations of Clean Harbors’ management as of this date only and are subject to certain risks and uncertainties that could cause actual results to differ materially including, without limitation, those items identified as “risk factors” in Clean Harbors’ most recently filed Form 10-K and Form 10-Q. Therefore, readers are cautioned not to place undue reliance on these forward-looking statements. Clean Harbors undertakes no obligation to revise or publicly release the results of any revision to these forward-looking statements other than through its filings with the Securities and Exchange Commission, which may be viewed in the “Investors” section of Clean Harbors’ website at www.cleanharbors.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123005859/en/\nClean Harbors, Inc.\nInvestors:\nJim Buckley, 781-792-5100\nSVP Investor Relations\nBuckley.James@cleanharbors.com\nor\nMedia:\nEric Kraus, 781-792-5100\nEVP Corporate Communications & Public Affairs\nKraus.Eric@cleanharbors.com\nSource: Clean Harbors, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cleanharbors.com%2F&esheet=51747045&newsitemid=20180123005859&lan=en-US&anchor=Clean+Harbors%2C+Inc.&index=1&md5=866837fe6d53cb1c8c4d1d7f2d67ca2d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.veolia.com&esheet=51747045&newsitemid=20180123005859&lan=en-US&anchor=www.veolia.com&index=3&md5=dc64882a6398b2ffae35bc0495fc038e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cleanharbors.com&esheet=51747045&newsitemid=20180123005859&lan=en-US&anchor=www.cleanharbors.com&index=2&md5=7925397d887818f5674214fef8c5cf94", "http://www.businesswire.com/news/home/20180123005859/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cleanharbors.com&esheet=51747045&newsitemid=20180123005859&lan=en-US&anchor=www.cleanharbors.com&index=4&md5=ba991aa9a8ba4126227ba5afe44e46fa"], "published": "2018-01-23T16:30:00.000+02:00", "crawled": "2018-01-23T17:32:10.013+02:00", "highlightTitle": ""}