{"organizations": [], "uuid": "ecaceb77d3a848d6fbb1f7ef140f0bda77deb675", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/10/07/104001971-IMG_7445r.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/05/mester-the-labor-market-is-strong-and-at-maximum-employment.html", "country": "US", "domain_rank": 767, "title": "Mester: The labor market is 'strong' and at 'maximum employment'", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-05T23:19:00.000+02:00", "replies_count": 0, "uuid": "ecaceb77d3a848d6fbb1f7ef140f0bda77deb675"}, "author": "Jeff Cox", "url": "https://www.cnbc.com/2018/01/05/mester-the-labor-market-is-strong-and-at-maximum-employment.html", "ord_in_thread": 0, "title": "Mester: The labor market is 'strong' and at 'maximum employment'", "locations": [], "entities": {"persons": [{"name": "loretta mester", "sentiment": "none"}, {"name": "mester", "sentiment": "none"}], "locations": [{"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "federal open market committee", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "fed", "sentiment": "none"}, {"name": "cleveland fed", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Despite a weaker than expected jobs report for December, the labor market overall is sound and near a peak, Cleveland Fed President Loretta Mester said Friday.\nSpeaking the same day that the government reported that nonfarm payrolls rose by just 148,000 last month — compared to expectations of 190,000, the central bank official said one month's disappointment doesn't change the larger picture.\n\"I think it's a strong report,\" Mester told CNBC in a live interview from Philadelphia. \"I think we're basically at maximum employment from the view of monetary policy. But that doesn't mean it triggers a necessary reaction.\"\nMester has been one of the central bank's more hawkish members. She will be a voting member this year on the Federal Open Market Committee, which sets monetary policy for the Fed. \nThe Fed most recently hiked its benchmark interest rate target a quarter point in December and is expected to approve another increase in March.\nPolicymakers are looking to \"calibrate\" policy at a time when economic indicators have been strongly positive and asset values, particularly in the stock market are soaring, Mester said. She has been in favor of the Fed's approach to hiking rates in a gradual and steady manner.\n\"We're not at our 2 percent goal on [personal consumption] inflation. What we're trying to do is keep policy so that expansion remains sustainable going forward. We're always doing a balancing act.\"\nThe most recent projections from the FOMC indicate three rate hikes for 2018, though the market currently is only pricing in two. Mester said that as long as conditions unfold close to the Fed forecasts, at least three hikes likely will be appropriate.\n\"Three, four, I'm happy with that,\" she said, referring to the expected total of rate hikes. \"We're in an environment where we're balancing risks. A gradual increase in the fed funds rate seems to me the appropriate path at this point. If the economy evolves different than what we expect, we're going to adjust that path consistent with meeting our goals.\"\nMester's comments differed from her fellow Fed president, Philadelphia's Patrick Harker, who said earlier in the day that he would prefer just two rate hikes this year.\nThe Fed's more hawkish members have expressed concern over market values, saying that overly accommodative policies could cause bubbles.\n\"Obviously, you can't really predict a bubble, which is why they call it a bubble,\" Mester said. \"Do we care about asset prices per se? No. We care about asset prices to the extent that they impact the real economy. I'm not that concerned that we're in a financial instability environment.\"\nAs Mester spoke the stock market rally continued, with the Dow adding nearly 200 points.", "external_links": [], "published": "2018-01-05T23:19:00.000+02:00", "crawled": "2018-01-05T22:30:37.017+02:00", "highlightTitle": ""}