{"organizations": [], "uuid": "bd17c2297322d7a2e906eab25a95390a6db747a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-connecticut-water-service-inc-declares-dividends-announces-new-direct-stock-purchase-program-and-sets-date-for-annual.html", "country": "US", "domain_rank": 767, "title": "Connecticut Water Service Inc. Declares Dividends, Announces New Direct Stock Purchase Program and Sets Date for Annual Meeting of Shareholders", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T17:29:00.000+02:00", "replies_count": 0, "uuid": "bd17c2297322d7a2e906eab25a95390a6db747a0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-connecticut-water-service-inc-declares-dividends-announces-new-direct-stock-purchase-program-and-sets-date-for-annual.html", "ord_in_thread": 0, "title": "Connecticut Water Service Inc. Declares Dividends, Announces New Direct Stock Purchase Program and Sets Date for Annual Meeting of Shareholders", "locations": [], "entities": {"persons": [], "locations": [{"name": "conn.", "sentiment": "none"}, {"name": "connecticut", "sentiment": "none"}], "organizations": [{"name": "connecticut water service inc", "sentiment": "negative"}, {"name": "announces new direct stock purchase program", "sentiment": "negative"}, {"name": "connecticut water service inc.", "sentiment": "negative"}, {"name": "connecticut water", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CLINTON, Conn., Jan. 22, 2018 (GLOBE NEWSWIRE) -- Connecticut Water Service Inc. (Nasdaq: CTWS) today announced that its board of directors declared a quarterly cash dividend of $0.2975 per common share payable on March 15, 2018, for shareholders of record as of March 1, 2018. This quarterly dividend remains unchanged from the previous quarter and represents an annualized dividend of $1.19 per share. The company’s annual dividend yield at the stock market closing price on Jan. 19, 2018, was 2.2 percent. Connecticut Water has paid quarterly dividends on its common stock since its founding in 1956 without interruption or reduction and has increased dividend payments for each of the past 48 years.\nConnecticut Water’s board of directors also declared a quarterly cash dividend of $0.20 per share on Preferred A shares (CTWSO) payable on April 16, 2018, for shareholders of record as of April 2, 2018, and a quarterly cash dividend of $0.225 on Preferred 90 shares (CTWSP) payable on May 4, 2018, for shareholders of record as of April 20, 2018.\nNew direct stock purchase program\nThe company is also pleased to announce that it has adopted a new direct stock purchase program. The program enables stockholders and new investors to purchase shares of CTWS common stock directly from CTWS. Previously, only customers of CTWS’s water utility subsidiaries and employees were able to purchase common shares directly from the company.\nThe new program is a component of CTWS’s existing dividend reinvestment and direct stock purchase plan. Broadridge Financial Solutions Inc., CTWS’s transfer agent and registrar, is the administrator of the plan. Stockholders and new investors may obtain a copy of the plan, the plan prospectus, enrollment information and forms at http://shareholder.broadridge.com/ctwater/ . All stockholders and new investors considering enrollment in the plan should carefully review the terms of the plan; the plan prospectus, including the investment objectives, business strategies and risks described therein; and CTWS’s periodic filings made with the SEC and should also consult with their advisers as to the implications of enrollment in the plan.\nAnnual Meeting of Shareholders\nThe board also announced the date of the 2018 Annual Meeting of Shareholders. The Annual Meeting will be held on Thursday, May 10, 2018, at 2 p.m. at the Madison Beach Hotel in Madison, Conn.\nThis press release does not constitute an offer to sell or the solicitation of an offer to buy, nor will there be any sale of the shares referred to in this press release in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of such state or jurisdiction.\nAbout CTWS\nThrough its regulated water utility subsidiaries, CTWS serves more than 134,000 water customers, or more than 425,000 people, in 80 communities across the states of Connecticut and Maine, and 3,000 wastewater customers in Southbury, Conn. It is New England’s largest publicly traded water and wastewater utility. Since January 2012, CTWS has grown its customer base by more than 45 percent, or more than 44,000 customers, primarily through large acquisitions in Maine in 2012 and Heritage Village Water Company and Avon Water Company in Connecticut in 2017.\nThis news release may contain certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 regarding the company’s results of operations, financial position and long-term strategy. These forward-looking statements are based on current information and expectations, and are subject to risks and uncertainties discussed in our filings with the Securities and Exchange Commission, which could cause the company’s actual results to differ materially from expected results. We undertake no obligation to update or revise forward-looking statements, whether as a result of new information, future events or otherwise.\nNews media contact: Daniel J. Meaney, APR Director of Corporate Communications Connecticut Water Service Inc. 93 West Main St., Clinton, CT 06413-1600 (860) 664-6016\nSource:Connecticut Water Service, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/d0e21322-1d70-4337-aef8-8eee8f6b8dff", "https://www.globenewswire.com/Tracker?data=fll42lhmdCRLk-hoto-D_EL0Ra1FAfBHw_VBSu3J6hZ0Mn_Yv33yJzcd8G67KetFyocSDybUmVIKxBMmqjx4Dp7xEnCUzryzWzndb-kQV4roEeTQ4UE-lAaRjdTJY0e_WCUUHEA8ZFmBvrbPMjLbfDDcapTJfbn5kqWa8Xy58tE=", "http://shareholder.broadridge.com/ctwater/"], "published": "2018-01-22T17:29:00.000+02:00", "crawled": "2018-01-22T20:23:00.038+02:00", "highlightTitle": ""}