{"organizations": [], "uuid": "d5f8e06ff192802bfcea63aefc3ab714c084cb82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 140}, "facebook": {"likes": 280, "shares": 280, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/21/104911414-GettyImages-890387088-bitcoin.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/19/overstock-mixed-up-bitcoin-and-bitcoin-cash.html", "country": "US", "domain_rank": 767, "title": "Overstock mixed up bitcoin and bitcoin cash", "performance_score": 2, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T22:46:00.000+02:00", "replies_count": 0, "uuid": "d5f8e06ff192802bfcea63aefc3ab714c084cb82"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/overstock-mixed-up-bitcoin-and-bitcoin-cash.html", "ord_in_thread": 0, "title": "Overstock mixed up bitcoin and bitcoin cash", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Julkaistu: tammikuu 19, 2018 10:46 pmTagit: Kategoriat: Uutiset englanniksi Tämä uutinen on julkaistu alunperin täällä \nA serious payment glitch on retail website Overstock.com , which sells everything from furniture to diamond rings, allowed customers to pay with either bitcoin or bitcoin cash interchangeably. It’s a problem because the two cryptocurrencies, which split off from one another last August , have wildly different valuations. \nAccording to CoinMarketCap , one bitcoin is currently worth $13,880, while a single unit of bitcoin cash is valued at $2,355, meaning those who paid with bitcoin cash could buy an item for a fraction of the asking price. Worse still, if a customer paid in bitcoin cash and wanted a refund, Overstock’s system would refund the customer in bitcoin, giving the user more money than they initially paid. It’s not clear how many customers may have taken advantage of this error. \nThe glitch was first reported by independent journalist Brian Krebs of KrebsOnSecurity . \nWhen Krebs purchased solar lights worth $78.27 from the site, Overstock instructed him to send 0.00475574 in bitcoin to their address. Instead of sending bitcoins, Krebs sent 0.00475574 in bitcoin cash, which Overstock accepted. This meant he paid only $12.02 for the lights. \nHe requested a refund, which Overstock gave back in bitcoin worth $77.80 and not bitcoin cash. ”A dishonest customer could have used this bug to make ridiculous sums of bitcoin in a very short period of time,” Krebs wrote. \nIn a statement to Krebs, Overstock said: \n”We were made aware of an issue affecting cryptocurrency transactions and refunds by an independent researcher. After working with the researcher to confirm the finding, that method of payment was disabled while we worked with our cryptocurrency integration partner, Coinbase, to ensure they resolved the issue. We have since confirmed that the issue described in the finding has been resolved, and the cryptocurrency payment option has been re-enabled.” \nCoinbase said the issue was ”caused by the merchant partner improperly using the return values in our merchant integration API,” and noted that no other Coinbase customer had this problem. Bitcoin experienced a meteoric rise in 2017, rocketing to valuations of more than $20,000 after starting the year at $800, though it remains extremely volatile . ", "external_links": [], "published": "2018-01-19T22:46:00.000+02:00", "crawled": "2018-01-20T00:12:50.012+02:00", "highlightTitle": ""}