{"organizations": [], "uuid": "a4a4d3197cce849a71a8d7301db6f4cf626c922a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/gm-selfdriving/no-pedal-to-the-metal-in-gms-planned-self-driving-cruise-av-car-idUSL1N1P61N5", "country": "US", "domain_rank": 408, "title": "No pedal to the metal in GM's planned self-driving Cruise AV car", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T13:00:00.000+02:00", "replies_count": 0, "uuid": "a4a4d3197cce849a71a8d7301db6f4cf626c922a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/gm-selfdriving/no-pedal-to-the-metal-in-gms-planned-self-driving-cruise-av-car-idUSL1N1P61N5", "ord_in_thread": 0, "title": "No pedal to the metal in GM's planned self-driving Cruise AV car", "locations": [], "entities": {"persons": [{"name": "dan ammann", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "gm", "sentiment": "negative"}, {"name": "general motors co", "sentiment": "negative"}, {"name": "bolt ev", "sentiment": "none"}, {"name": "cruise av", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT, Jan 12 (Reuters) - General Motors Co is seeking U.S. government approval for a fully autonomous car - one without a steering wheel, brake pedal or accelerator pedal - to enter the automaker’s first commercial ride-sharing fleet in 2019, executives said.\nFor passengers who cannot open doors, the Cruise AV - a rebranded version of GM’s Chevrolet Bolt EV - has even been designed to perform that task. It will have other accommodations for hearing and visually impaired customers.\nThis will be one of the first self-driving vehicles in commercial passenger service and among the first to do away with manual controls for steering, brakes and throttle. What is the driver’s seat in the Bolt EV will become the front left passenger seat in the Cruise AV, GM said.\nCompany President Dan Ammann told reporters GM had filed on Thursday for government approval to deploy the “first production-ready vehicle designed from the start without a steering wheel, pedals or other unnecessary manual controls.”\nGM is part of a growing throng of vehicle manufacturers, technology companies and tech startups seeking to develop so-called robo-taxis over the next three years in North America, Europe and Asia. Most of those companies have one or more partners.\nFord Motor Co said on Tuesday it will partner with delivery service Postmates Inc as the automaker starts testing ways to transport people, food and packages this spring in its self-driving cars, which are being developed by Ford’s Argo unit.\nOther companies, from Uber Technologies Inc to Alphabet Inc’s Waymo, have been testing self-driving vehicle prototypes in limited ride sharing applications, but have been less explicit than GM in announcing plans for commercial robo-taxi services.\nGM executives said the automaker has asked the National Highway Traffic Safety Administration to allow 16 alterations to existing vehicle safety rules - such as having an airbag in what would normally be the driver’s seat, but without a steering wheel - to enable the deployment of the Cruise AV.\nThe automaker would then need to obtain similar approval from individual U.S. states. GM executives said seven U.S. states already allow the alterations sought by the automaker. In other states - including those that stipulate a car must have a licensed human driver - GM will work with regulators to change or get a waiver from existing rules.\nThe company declined to identify the first states in which it plans to launch the vehicle or say when it would begin testing.\nGM wants to control its own self-driving fleet partly because of the tremendous revenue potential it sees in selling related services, from e-commerce to infotainment, to consumers riding in those vehicles.\nAt a Nov. 30 briefing in San Francisco, GM’s Ammann told investors the lifetime revenue generation of one of its self-driving cars could eventually be “several hundred thousands of dollars.” That compares with the $30,000 on average that GM collects today for one of its vehicles, mostly derived from the initial sale.\nGM’s Cruise AV is equipped with the automaker’s fourth-generation self-driving software and hardware, including 21 radars, 16 cameras and five lidars - sensing devices that use laser light to help autonomous cars “see” nearby objects and obstacles.\nThe Cruise AV will be able to operate in hands-free mode only in premapped urban areas.\nGM’s prototype self-driving vehicles have been developed in San Francisco by Cruise Automation, the onetime startup that GM acquired in March 2016 for a reported $1 billion. (Reporting by Paul Lienert and Nick Carey in Detroit; Editing by Matthew Lewis)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T13:00:00.000+02:00", "crawled": "2018-01-13T14:41:50.009+02:00", "highlightTitle": ""}