{"organizations": [], "uuid": "642d535a07d6516727f9340f29c12c05d00b1193", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/f02covpromo.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/18/job-market-hiring-retaining-talent/", "country": "US", "domain_rank": 1196, "title": "How to Keep a Headhunter From Poaching Your Best Talent | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.217, "site_type": "news", "published": "2018-01-18T02:00:00.000+02:00", "replies_count": 0, "uuid": "642d535a07d6516727f9340f29c12c05d00b1193"}, "author": "Clifton Leaf", "url": "http://fortune.com/2018/01/18/job-market-hiring-retaining-talent/", "ord_in_thread": 0, "title": "How to Keep a Headhunter From Poaching Your Best Talent | Fortune", "locations": [], "entities": {"persons": [{"name": "clifton leaf january", "sentiment": "neutral"}, {"name": "geoff colvin", "sentiment": "none"}, {"name": "ellen mcgirt", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Clifton Leaf January 18, 2018 \nYou may have noticed a change in your colleagues: the guy who always wears jeans shows up at work in a sports coat and tie. Another is having hushed cell phone conversations on the far side of the office. A third asks you, offhandedly, what a “senior manager of X” ought to make and if you happen to have any extra ecru-colored stationery lying around. \nAs Fortune senior editor-at-large Geoff Colvin writes in our cover package (see “ How to Profit from the Ultra-Tight Job Market Right Now ”), the job market is heating up fast. Some 6 million openings are now waiting for the right individuals to fill them. The unemployment rate is a rock-bottom 4.1%—and much lower than that in many industries. \nFor would-be job-seekers, of course, that’s a welcome trend. As senior writer Ellen McGirt explains in her eye-opening feature, “ How Your Life Experience Could Help You Land a Great Job ”, it has also unleashed a new market force: This electrified employment market is placing fresh value on life experiences and personal qualities—like fortitude, adaptability, and creative problem-solving—that seldom enriched résumés before. \nBut for bosses and managers trying to keep their best talent from jumping ship, well, it’s a far more challenging time, even a frightening one. So what are companies doing to keep their rising stars in house, you ask? Not as much as you might think—and that’s giving a huge opening to the competition. \nVeteran executive recruiter Karl Alleman, managing partner of Egon Zehnder’s U.S. practice, has a particularly good vantage point on this. The Chicago-based recruiter spends much of his time, after all, pulling talent out of companies—and his job is much easier when those companies don’t do everything they can to retain their best performers. Fortune's Feb. 1, 2018 cover. \nOn this front, companies tend to fall short in two key ways, he says—and, surprisingly, it often has little to do with pay. “First of all, they need to do a better job of recognizing who their top talents are and then telling them that they’re top talents,” says Alleman. Companies will often identify the people who have the ability to grow and thrive—but then, he says, bosses “don’t do a good job of communicating to that individual that they see such potential and that they have a plan to help them fully realize it.” Some managers fear that word will get out that one employee is being favored, and that will risk ostracizing others on the team—or they don’t want to set expectations with the top performer that perhaps he or she can’t meet. “But if you have somebody who really is that good, you ought to let them know,” says Alleman. “Because if they don’t know that, they might not feel valued, and they might leave.” \nSecond, the majority of companies, he says, do a poor job of laying out an attractive career path for their people—a career path that will foster growth and learning. One good way is through a job-rotation program. “If you can paint a picture for them on how you’re going to help them fully realize their potential by moving them through different jobs—jobs in different geographies, or in different business units, or maybe even in different functions—to help round out their skills, that is really valuable,” he says. \nOther options are to give the standout performer a so-called stretch assignment that truly tests her—or to put her on a strategic project. \nIt requires leadership from the top to foster such employee growth. But it really motivates high-performing staffers, he says, “and it sparks their curiosity.” And in this age of business disruption, says Alleman, “if there’s one character trait that people truly need, it’s curiosity: the desire to look around corners, to think about what the competition might be doing differently or what the customer might want.” \nIn the end, sparking your colleagues’ curiosity may have another benefit, too: It just might help you keep them when the headhunter comes around. \nA version of this article appears in the Feb. 1, 2018 issue of Fortune with the headline “Make Them Want to Stay.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-18T02:00:00.000+02:00", "crawled": "2018-01-19T21:06:42.018+02:00", "highlightTitle": ""}