{"organizations": [], "uuid": "44eef91845334d4fa97630a74bc5efa6dcd0e948", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226690890&w=1200&r=LYNXMPEE0T1EL", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-football-nfl-superbowl-phi-ertz/ertzs-soccer-world-champion-wife-in-the-spotlight-ahead-of-super-bowl-idUSKBN1FJ2P0", "country": "US", "domain_rank": 408, "title": "Ertz's soccer world champion wife in the spotlight ahead of Super Bowl", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T21:12:00.000+02:00", "replies_count": 0, "uuid": "44eef91845334d4fa97630a74bc5efa6dcd0e948"}, "author": "", "url": "https://www.reuters.com/article/us-football-nfl-superbowl-phi-ertz/ertzs-soccer-world-champion-wife-in-the-spotlight-ahead-of-super-bowl-idUSKBN1FJ2P0", "ord_in_thread": 0, "title": "Ertz's soccer world champion wife in the spotlight ahead of Super Bowl", "locations": [], "entities": {"persons": [{"name": "ertz", "sentiment": "neutral"}, {"name": "zach ertz", "sentiment": "none"}, {"name": "julie", "sentiment": "none"}, {"name": "julie ertz", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "minneapolis", "sentiment": "none"}, {"name": "super bowl", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "ertz", "sentiment": "neutral"}, {"name": "super bowl frank pingue", "sentiment": "none"}, {"name": "eagles", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "philadelphia eagles", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS (Reuters) - Julie Ertz has won a World Cup with the U.S. women’s national soccer team and now is at the Super Bowl where she hopes to see her husband, Zach Ertz of the Philadelphia Eagles, reach the pinnacle of his sport.\nJulie, wearing a green and white Eagles sweater and holding a USA Soccer microphone, attended Super Bowl Opening Night on Monday to ask her husband questions but could not help but find plenty of attention thrown her way.\n”It’s crazy. I am here as a wife, I‘m here as a fan and I‘m here to support him in any way that’s possible,“ she told a small group of reporters. ”I came here just to interview him and now I have all these things (microphones) in my face right now.\n”This is his moment, this is his game.\n“My family, his family, we are here to support him and all of his hard work and his team and what this team has done together and for the city of Philadelphia.”\nJulie, a midfielder in the U.S. squad who won the Women’s World Cup in 2015, made headlines this month when her tearful reaction to Zach earning his first trip to the NFL’s championship game was caught on video.\nJan 13, 2018; Philadelphia, PA, USA; Philadelphia Eagles tight end Zach Ertz (86) celebrates after beating the Atlanta Falcons in the NFC Divisional playoff game at Lincoln Financial Field. Mandatory Credit: Bill Streicher-USA TODAY Sports At the time, the 25-year-old was playing for her country in a friendly against Denmark in San Diego and was unable to watch the Eagles beat the visiting Minnesota Vikings in the NFC Championship game.\nWhen she found out the news after the final whistle in her match, the video of her tearful reaction on the soccer field quickly went viral.\nWith her husband now one win away from earning the biggest prize his sport has to offer, Julie was naturally asked which was bigger, a Super Bowl title or a World Cup.\n“Two different sports. That’s the biggest stage on each side. They are both big,” she said. “It’s as far as you can go in your sport and that’s massive, that’s huge, that’s an amazing accomplishment.”\nWhen she finally got around to her husband’s podium to ask a question among the throngs of reporters, Julie asked Zach which of her meals he prefers the most.\n“Favorite meal that Julie makes... she makes unbelievable tacos. That would be my answer,” said Zach. “She doesn’t make them all the time, so I‘m kind of upset about it but when she does, they’re off the chain.”\nEditing by Christian Radnedge\n ", "external_links": [], "published": "2018-01-30T21:12:00.000+02:00", "crawled": "2018-01-30T21:28:20.005+02:00", "highlightTitle": ""}