{"organizations": [], "uuid": "c8fe449b0d7b7370ae4fa9251dd654ff9e15e29d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-precious/precious-gold-steady-on-weak-dollar-stocks-surge-as-us-govt-shutdown-ends-idUSL4N1PI13W", "country": "US", "domain_rank": 408, "title": "PRECIOUS-Gold steady on weak dollar; stocks surge as US govt shutdown ends", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T09:31:00.000+02:00", "replies_count": 0, "uuid": "c8fe449b0d7b7370ae4fa9251dd654ff9e15e29d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-precious/precious-gold-steady-on-weak-dollar-stocks-surge-as-us-govt-shutdown-ends-idUSL4N1PI13W", "ord_in_thread": 0, "title": "PRECIOUS-Gold steady on weak dollar; stocks surge as US govt shutdown ends", "locations": [], "entities": {"persons": [], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "european central bank", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 23 (Reuters) - Gold prices held steady on Tuesday, as the dollar pared some losses but remained near a 3-year low amid a surge in global equities after a U.S. government shutdown came to an end. FUNDAMENTALS * Spot gold was little changed at $1,334.36 an ounce by 0111 GMT. * U.S. gold futures were up 0.2 percent at $1,333.90. * Congress voted on Monday to end a three-day U.S. government shutdown, approving another short-term funding bill as Democrats accepted promises from Republicans for a broad debate later on the future of young illegal immigrants. * Asian stocks advanced on Tuesday after U.S. senators struck a deal to end the government shutdown, sending Wall Street's main indexes to record highs. * Market participants await the outcome of the European Central Bank's meeting on Thursday for possible clues to future shifts in the bank's monetary policy. * The ECB is unlikely to ditch a pledge to keep buying bonds as rate setters need more time to assess the outlook for the economy and the euro, three sources close to the matter have said. * Investors also await a Bank of Japan policy announcement on Tuesday. Analysts do not expect Japan to signal any policy shift. * The idea of other major central banks moving closer to more normal policies has been a key headwind for the dollar. * Such moves would change the interest rate dynamics of the past few years, when the U.S. Federal Reserve was the only central bank raising rates. * The dollar's index against a basket of major currencies stood at 90.322, not far off its three-year low of 90.113 touched on Jan. 17. * Spot gold has risen about $100 from nearly five-month lows hit in mid-December, mainly due to weakness in the U.S. dollar. Analysts have warned that the dollar weakness could have been overdone, which could lead to short-term correction in gold. * A stronger greenback makes dollar-denominated gold more expensive for holders of other currencies. * Russia raised gold holdings in December, according to IMF data. * Swiss-based commodities fund Tiberius Group plans to make a foray into cryptocurrencies with the launch of what may be the first digital money underpinned by physically deliverable metals including industrials such as aluminium and copper. * The World Gold Council (WGC) is studying the creation of a global standard for gold kilobars so they can be deployed as collateral in futures markets and potentially encourage demand, sources close to the matter said. DATA AHEAD (IN GMT) 1000 Germany ZEW economic sentiment Jan 1500 U.S. Richmond Fed composite index Jan 1500 Euro zone Consumer confidence flash Jan (Reporting by Nallur Sethuraman in Bengaluru; editing by Richard Pullin)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T09:31:00.000+02:00", "crawled": "2018-01-23T17:48:47.002+02:00", "highlightTitle": ""}