{"organizations": [], "uuid": "82e6fe615d049e6a4a3060f6b971176626f44cdb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222423019&w=1200&r=LYNXMPEE0F0VD", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-anglo-debeers-blockchain/de-beers-turns-to-blockchain-to-guarantee-diamond-purity-idUKKBN1F51JT", "country": "US", "domain_rank": 408, "title": "De Beers turns to blockchain to guarantee diamond purity", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T15:11:00.000+02:00", "replies_count": 0, "uuid": "82e6fe615d049e6a4a3060f6b971176626f44cdb"}, "author": "", "url": "https://uk.reuters.com/article/uk-anglo-debeers-blockchain/de-beers-turns-to-blockchain-to-guarantee-diamond-purity-idUKKBN1F51JT", "ord_in_thread": 0, "title": "De Beers turns to blockchain to guarantee diamond purity", "locations": [], "entities": {"persons": [{"name": "barbara lew", "sentiment": "negative"}, {"name": "bruce cleaver", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "de beers", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 10 PM / Updated 25 minutes ago De Beers turns to blockchain to guarantee diamond purity Barbara Lewis 3 Min Read \nLONDON (Reuters) - Anglo American’s ( AAL.L ) diamond unit De Beers aims to launch the first industry-wide blockchain this year to track gems each time they change hands starting from the moment they are dug from the ground, its chief executive said on Tuesday. FILE PHOTO: Bruce Cleaver, CEO of De Beers, poses in Hong Kong, China September 14, 2016. Picture taken September 14, 2016. REUTERS/Bobby Yip/File Photo \nDe Beers, the world’s biggest diamond producer by the value of its gems, has led industry efforts to verify the authenticity of diamonds and ensure they are not from conflict zones where gems could be used to finance violence. \nFor De Beers, cast-iron guarantees its stones are ethically sourced are vital to maintaining consumer confidence. It sells technology across the industry to help prevent anyone trying to pass off synthetic stones as natural. \nThe firm also works with the rest of the industry and governments to support the Kimberley Process set up in 2003 to increase transparency and eliminate trade in conflict diamonds. \nThe firm says blockchain, the technology underpinning cryptocurrencies such as bitcoin, complements its existing methods. It offers a secure way to track diamonds and can provide a digital record they are conflict-free, it says. \n“It’s a huge public ledger as immutable as anything invented,” CEO Bruce Cleaver told Reuters in reference to blockchain. “It’s a much more un-hackable system than anything on a single server.” \nBlockchain is a shared database of transactions maintained by a network of computers on the internet that is best known as the system underpinning bitcoin. \nThe diamond blockchain, which De Beers says will be the first to span the entire value chain, would be open to everyone in the industry and would offer the potential for monitoring each stone. \n“It has the ability to be very significant for the industry,” Cleaver said in a telephone interview, adding it could reassure banks financing the industry and would make the mining supply chain more efficient and transparent. \nBlockchain could also help guarantee the ethical origins of other minerals, such as those used in electric vehicles. \nStartup firm Everledger, which uses emerging technology to eliminate fraud and other corporate risks, said it had been using blockchain to track the provenance of diamonds since 2015. \nDe Beers began its pilot project this month after several months of research, responding to a rising number of customers wanting guarantees diamonds had not been used to fund conflicts. \n“It’s a bold step going public with a pilot, but we’re going public because we’re interested in the entire industry participating,” Cleaver said. \nHe declined to name those taking part in the pilot, saying only that they included De Beers sightholders, the term used for its accredited diamond buyers. \nCleaver said the problems associated with using blockchain for bitcoin, such as excessive energy use, need not impact other applications as new technology was more energy efficient. Additional reporting by Arathy S Nair in Bengaluru; Editing by Edmund Blair", "external_links": [], "published": "2018-01-16T15:11:00.000+02:00", "crawled": "2018-01-16T15:34:18.010+02:00", "highlightTitle": ""}