{"organizations": [], "uuid": "a7c303b97d3c491b1c2c609160d15e527411e036", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224389056&w=1200&r=LYNXMPEE0M0CK", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-sky-m-a-fox/fox-buying-sky-not-in-public-interest-offers-remedies-uk-regulator-idUSKBN1FC0NH", "country": "US", "domain_rank": 408, "title": "Fox buying Sky not in public interest, offers remedies-UK regulator", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T09:14:00.000+02:00", "replies_count": 0, "uuid": "a7c303b97d3c491b1c2c609160d15e527411e036"}, "author": "", "url": "https://www.reuters.com/article/us-sky-m-a-fox/fox-buying-sky-not-in-public-interest-offers-remedies-uk-regulator-idUSKBN1FC0NH", "ord_in_thread": 0, "title": "Fox buying Sky not in public interest, offers remedies-UK regulator", "locations": [], "entities": {"persons": [{"name": "fox", "sentiment": "negative"}, {"name": "paul sandle", "sentiment": "none"}, {"name": "murdoch", "sentiment": "none"}, {"name": "kate holton", "sentiment": "none"}, {"name": "rupert murdoch", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "disney", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "competition and markets authority", "sentiment": "none"}, {"name": "twenty-first century fox", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "sky news", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Rupert Murdoch’s $15.7 billion takeover of European broadcaster Sky should be blocked unless a way is found to prevent the media tycoon from influencing the network’s news output, Britain’s competition regulator said.\nThe initial ruling complicates a separate plan by Walt Disney Co to buy the majority of Murdoch’s assets, including Sky. Disney had hoped Murdoch would own 100 percent of the company by the time it completed its takeover.\nShares in Sky rose on Tuesday as investors said concerns about Murdoch’s influence could still be overcome, for example by spinning off Sky News, Britain’s first 24-hour news channel. The regulator also indicated it would not object to Disney owning Sky eventually.\n“It’s good news today that the regulator isn’t going to block the deal outright,” said Michael Wegener, managing director at Case Equity Partners, a Sky shareholder.\n“The Murdochs will come up with remedies that work around Sky News.”\nMurdoch’s Twenty-First Century Fox agreed to buy the 61 percent of Sky it did not already own in December 2016, re-igniting a political row in Britain about the influence he wields through his ownership of newspapers the Sun and the Times and his stake in Sky, the biggest pay-TV platform.\nCritics of the deal argue that Murdoch could hold sway over the editorial output of Sky’s loss making news channel. Sky warned that were the deal to be rejected because of Sky News, it could shut the channel itself.\nThe British government, which will take the final decision on the deal, asked the Competition and Markets Authority (CMA) to judge if Murdoch had too much influence in Britain and would uphold broadcasting standards.\n“We have provisionally found that if the Fox/Sky merger went ahead as proposed, it would be against the public interest,” the CMA’s Anne Lambert said on Tuesday.\n“It would result in the Murdoch family having too much control over news providers in the UK, and too much influence over public opinion and the political agenda.”\nA WAY OUT? Murdoch’s news outlets are watched, read or heard by nearly a third of Britons and have a combined share of public news consumption that is significantly greater than all other news providers, except the BBC and commercial TV news provider ITN.\nPossible ways to resolve concerns about Murdoch’s influence in Britain could include spinning off or divesting Sky News, or insulating Sky News from Fox’s influence, the CMA said. A third option is to block the deal outright.\nOn the issue of broadcasting standards, the regulator cleared Murdoch, saying that recent allegations of sexual harassment at his Fox News network in the United States did not call into question his commitment to standards in Britain.\nAn objection on broadcasting standards would have likely sounded the death knell for the deal.\n“Broadcasting standards is not an issue anymore,” said one hedge fund manager that holds Sky shares. “That’s a pretty big positive.” The manager cautioned however that it was unclear how motivated the Murdochs were to secure the deal, seeing as they have already agreed to offload it to Disney.\nFILE PHOTO: The Twenty-First Century Fox Studios flag flies over the company building in Los Angeles, California U.S. on November 6, 2017. REUTERS/Lucy Nicholson/File Photo Shares in Sky, which also has major operations in Germany and Italy, rose 2.3 percent to 10.26 pounds by 1335 GMT. Fox agreed to pay 10.75 pounds in cash for each Sky share in December 2016.\nTOUGH LANGUAGE “The initial reaction would be to suggest there is an easy fix in that Sky News could be disposed of, either by sale or closure or some other form,” said broker Liberum, which downgraded Sky to hold from buy.\n“However, the language of the CMA in its provisional findings suggests they are more minded to blocking the deal as a way of addressing concerns.”\nFox has already offered up remedies to protect the independence of Sky News including the establishment of a Sky News Editorial Board.\nBut the CMA said media regulator Ofcom had received complaints suggesting that previous attempts by Murdoch to guarantee the editorial independence of the Times newspapers in Britain and the Dow Jones company had proved ineffective.\nSlideshow (2 Images) The CMA said a “comprehensive solution” to the questions posed by the deal would be simply to block it.\nFox said it was disappointed about the provisional judgment, although it welcomed the decision that it had a genuine commitment to broadcasting standards.\nIt said it would continue to engage with the CMA ahead of the final report in May, and it anticipated approval of the deal by June 30.\nBritain’s newly appointed Media Secretary Matt Hancock said on Tuesday he would decide on the deal by 14 June, 30 working days after he is due to receive the CMA’s final report.\nDISNEY OPTION An eventual rejection would be a personal blow to Murdoch, who has spent decades building ties with prime ministers and politicians in Britain. His son James oversaw Sky’s growth as chief executive and currently chairs the broadcaster.\nThe 86-year-old tycoon sought to buy Sky in 2010, but a phone-hacking scandal at his News of the World tabloid forced him to drop the bid. Since then he has split his companies into two to separate the newspapers from the TV businesses.\nIf Fox is eventually blocked, Disney could buy the rest of Sky itself at a later date, and it would face fewer regulatory objections than the Murdochs.\n“On the face of it, these concerns would fall away if the Disney/Fox transaction went ahead as announced,” the CMA said.\nDisney will buy Fox’s 39 percent Sky stake in its $52.4 billion purchase of Fox assets, a deal that faces its own lengthy regulatory process in the United States.\nThat level of ownership would normally require an owner to bid for the whole company, but Disney has asked regulators to allow it leeway to decide whether to bid or not.\nAdditional reporting by Maiya Keidan, Editing by Guy Faulconbridge and Keith Weir\n ", "external_links": [], "published": "2018-01-23T09:14:00.000+02:00", "crawled": "2018-01-23T09:24:17.003+02:00", "highlightTitle": ""}