{"organizations": [], "uuid": "847aa1b0efbccbaa898f155c9d708657ca4adacf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-athletics-world-oregon/iaaf-wants-to-link-oregon-meet-to-la-olympics-to-grow-sport-idUSKBN1F635I", "country": "US", "domain_rank": 408, "title": "IAAF wants to link Oregon meet to LA Olympics to grow sport", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.37, "site_type": "news", "published": "2018-01-18T07:59:00.000+02:00", "replies_count": 0, "uuid": "847aa1b0efbccbaa898f155c9d708657ca4adacf"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-athletics-world-oregon/iaaf-wants-to-link-oregon-meet-to-la-olympics-to-grow-sport-idUSKBN1F635I", "ord_in_thread": 0, "title": "IAAF wants to link Oregon meet to LA Olympics to grow sport", "locations": [], "entities": {"persons": [{"name": "olivier gers", "sentiment": "none"}, {"name": "eugene", "sentiment": "none"}, {"name": "gers", "sentiment": "none"}], "locations": [{"name": "oregon", "sentiment": "none"}, {"name": "la", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "iaaf", "sentiment": "negative"}, {"name": "international association of athletics federations", "sentiment": "none"}, {"name": "la olympics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Global athletics is hoping to link the 2021 world championships in Oregon to the 2028 Los Angeles Olympics in a bid to maximize interest in the sport in the United States, the International Association of Athletics Federations (IAAF) chief executive told Reuters on Wednesday.\nThe United States track and field team ranks as the best in the world but American spectator interest is relatively low.\n“We are starting to think about the wrap up in the U.S. to LA 2028,” Olivier Gers said in a telephone interview from Eugene, Oregon where he is on a site visit for the 2021 championships, the first to be held in the United States.\n“How do we work with the organizing committee of the LA Olympics to maximize the awareness of the sport at the local level?,” Gers said.\n“We need to use Eugene and LA to bring the sport to a top four positioning on a global basis.”\nHe said one of the challenges of the IAAF, especially in America “is to make the sport more accessible for the casual fans, the ones who get passionate around the Olympics and then forget it”.\nGers said he had found plenty of passionate fans in Oregon as the IAAF delegation works with local organizers to accommodate an event of this magnitude.\n“The challenge is the size. It’s a monster,” he said of what will be the largest sporting event in the world in 2021 with 2,000 athletes and 200 countries with federations and their delegations and thousands of spectators.\nAlthough Eugene ranks as the track capital of the United States, its population of 157,000 is relatively small on a global scale as are its airport and available accommodation.\nThat’s why employing Oregon’s largest city of Portland, which is two hours away, and the entire state in hosting the championships will be key, Gers said of the event which has been rebranded Oregon 2021 and is expected to be a major economic boost for the region.\nBut much remains to be accomplished.\nOrganizers promised in their bid to double the iconic Hayward Field track stadium to 30,000 seats,\nBut construction, originally scheduled to be well under way, has not begun, and Gers said he had not seen final plans or been given a timetable for the work.\nThat, however, is not a concern to the IAAF at present.\n“We are comfortable with everybody’s ability here to get this delivered ahead of time. ... I am not worried at all,” he said.\nPaul Weinhold, chief executive officer of the University of Oregon Foundation, which is spearheading the stadium renovation, later told Reuters the project was a go.\n“We are going to be starting this summer and it is going to be ready definitely in time for the championships,” Weinhold said by telephone.\nLodging and transportation issues remain.\n“We don’t know what the plans are. We are building the plans together,” Gers said.\nWork also is under way to make the championships more spectator friendly and Gers said organizers were planning a few surprises, including a proposed 4x400 meters mixed relay.\nReporting by Gene Cherry in Salvo, North Carolina, editing by Ed Osmond\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T07:59:00.000+02:00", "crawled": "2018-01-18T02:29:33.000+02:00", "highlightTitle": ""}