{"organizations": [], "uuid": "70182ae6209fde49c4908b3552c4399609d4bebc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219350348&w=1200&r=LYNXMPEE03100", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-austria-politics/austrias-new-government-plans-to-cut-child-benefits-abroad-idUSKBN1ET1RB", "country": "US", "domain_rank": 408, "title": "Austria's new government plans to cut child benefits abroad", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T17:30:00.000+02:00", "replies_count": 0, "uuid": "70182ae6209fde49c4908b3552c4399609d4bebc"}, "author": "", "url": "https://www.reuters.com/article/us-austria-politics/austrias-new-government-plans-to-cut-child-benefits-abroad-idUSKBN1ET1RB", "ord_in_thread": 0, "title": "Austria's new government plans to cut child benefits abroad", "locations": [], "entities": {"persons": [{"name": "kurz", "sentiment": "none"}, {"name": "sebastian kurz", "sentiment": "none"}], "locations": [{"name": "austria", "sentiment": "none"}, {"name": "slovenia", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "freedom party", "sentiment": "none"}, {"name": "fpo", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "people’s party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 3:30 PM / Updated 4 minutes ago Austria's new government plans to cut child benefits abroad Reuters Staff 3 Min Read \nSEGGAU, Austria (Reuters) - Austria’s ruling coalition of conservatives and the far right plans to cut benefit payments for children living abroad, it said on Thursday, adding that it believes the move does not break European Union rules banning discrimination. \nChancellor Sebastian Kurz’s cabinet was sworn in on Dec. 18, two months after his conservative People’s Party won the parliamentary election. It struck a coalition deal with the anti-immigration Freedom Party (FPO), making Austria the only western European country with a far-right party in government. \nThe FPO controls the interior, foreign, defense and social affairs ministries, among others. \nAt the start of a two-day cabinet meeting in a castle near Slovenia, Kurz said the government would cut benefits for Austrian residents’ children who live in a country where the cost of living is lower. \n“It is an unfairness built into the system that, for two children who do not even live in Austria but in Romania, roughly 300 euros a month are transferred to Romania and that is almost the average income there,” Kurz told reporters standing alongside Freedom Party leader Heinz-Christian Strache. \nPayments vary depending on children’s age and number but start around 114 euros ($138) a month for an only child. \n“We will reach a decision in cabinet here so that child benefit payments are not made abroad to the same extent as before,” Kurz said, adding that adjusting payments to the local cost of living would save “more than 100 million euros (a year)”. A general view of a two-day cabinet meeting in Seggau, Austria, January 4, 2018. REUTERS/Heinz-Peter Bader \nThat pales in comparison with the 2.5 billion euros in savings the government aims to make this year. Kurz said the move was being made so quickly because it was one of the easiest to prepare. \nThe plan is part of a broader government agenda that includes cutting taxes, reducing benefits for refugees and restricting new immigrants’ access to many social services for five years. \nAustria borders eight countries, including the Czech Republic, Slovakia, Hungary and Slovenia, where wages are significantly lower. Eastern Europeans make up a large part of its workforce in sectors including healthcare and construction. Slideshow (6 Images) \nIn 2016 Austria transferred 273 million euros abroad to EU and European Economic Area countries in benefit payments for 132,000 children. \nThe European Commission criticized Germany last year for a similar plan to cut child benefits, which was later abandoned. It gave a guarded reaction on Thursday. \n“We take note and we will examine the laws with regard to their compatibility with EU law if and once adopted,” a Commission spokeswoman said. \nKurz said a legal paper commissioned by the government “clearly shows that it is legally possible to take these measures”, adding: “We have prepared this well.” \n($1 = 0.8289 euros) Reporting by Francois Murphy; Additional reporting by Shadia Nasralla in Vienna and Robert-Jan Bartunek in Brussels Editing by Jeremy Gaunt", "external_links": [], "published": "2018-01-04T17:30:00.000+02:00", "crawled": "2018-01-04T17:43:24.017+02:00", "highlightTitle": ""}