{"organizations": [], "uuid": "2b71040c7981b29d9ad8dc13fa78ce437843920f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/14/104899083-shopping.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/16/ulta-among-retailers-poised-to-gain-from-tax-cuts-wells-fargo-says.html", "country": "US", "domain_rank": 767, "title": "Ulta among retailers poised to gain from tax cuts, Wells Fargo says", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T01:00:00.000+02:00", "replies_count": 0, "uuid": "2b71040c7981b29d9ad8dc13fa78ce437843920f"}, "author": "Kellie Ell", "url": "https://www.cnbc.com/2018/01/16/ulta-among-retailers-poised-to-gain-from-tax-cuts-wells-fargo-says.html", "ord_in_thread": 0, "title": "Ulta among retailers poised to gain from tax cuts, Wells Fargo says", "locations": [], "entities": {"persons": [{"name": "boruchow", "sentiment": "none"}, {"name": "ike boruchow", "sentiment": "none"}], "locations": [], "organizations": [{"name": "ulta", "sentiment": "negative"}, {"name": "wells fargo", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "ulta beauty", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "7 Hours Ago | 03:51 \nAmid widespread store closures in the retail sphere, some companies have reason to be optimistic. \nFor one, fundamentals in the sector are improving, Wells Fargo retail analyst Ike Boruchow told CNBC on Tuesday. \n\"We are talking about baby steps,\" he said in an interview with \" Power Lunch .\" \"Comps for the space have gotten gradually better. Store traffic has gotten gradually better basically throughout the end of last year.\" \nOn top of that, the slashing of the corporate tax rate from 35 percent to 21 percent should also give U.S.-based retailers a boost, he added. \nBoruchow believes the best way to play that combination is Ulta Beauty . \nWells Fargo upgraded Ulta to a valued stock earlier this month. The American cosmetics company is known for allowing shoppers to try on makeup, return used products and even have their eyebrows plucked or hair done in store. \n\"This is a name that lagged all of last year, but has some of the best growth prospects in retail,\" Boruchow said. \"You've got a stock that's trading at recession multiples, tax-adjusted with some of the best fundamentals in retail.\" \nThe cosmetics chain opened 100 stores in 2017 and has earnings per share that are expected to rise more than $2 with the new tax plan, Boruchow said. Wells Fargo assigned a price target of $275 on the retail stock, which represents a 20 percent growth potential. \nWhile retail stocks lagged last year, that trend appears to be turning around. The S&P 500 retail index has risen nearly 20 percent in the last three months. \nUlta isn't the only name Boruchow thinks will benefit from the new tax rate. His other top picks include the PVH Corp. , parent of the brands Calvin Klein and Tommy Hilfiger; the Coach parent company, Tapestry Inc. , which also owns Kate Spade and Stuart Weitzman, and Adidas AG . \nThe new corporate tax rate is \"going to put us in an upward revision cycle for retail, and we haven't seen that in about two years,\" he said. \"That's why the space has lagged so much.\" Kellie Ell News Associate for CNBC Related Securities", "external_links": [], "published": "2018-01-17T01:00:00.000+02:00", "crawled": "2018-01-17T01:10:51.005+02:00", "highlightTitle": ""}