{"organizations": [], "uuid": "439df8a5204b63e5528d07c401f3ea5c88a19e84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-eagle-bancorp-montana-earns-553000-in-the-fourth-quarter-and-4-point-1-million-for-2017-following-write-down-of-deferred.html", "country": "US", "domain_rank": 767, "title": "Eagle Bancorp Montana Earns $553,000 in the Fourth Quarter and $4.1 Million for 2017 Following Write Down of Deferred Tax Asset; Declares Regular Quarterly Cash Dividend of $0.09 per Share", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T20:00:00.000+02:00", "replies_count": 0, "uuid": "439df8a5204b63e5528d07c401f3ea5c88a19e84"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-eagle-bancorp-montana-earns-553000-in-the-fourth-quarter-and-4-point-1-million-for-2017-following-write-down-of-deferred.html", "ord_in_thread": 0, "title": "Eagle Bancorp Montana Earns $553,000 in the Fourth Quarter and $4.1 Million for 2017 Following Write Down of Deferred Tax Asset; Declares Regular Quarterly Cash Dividend of $0.09 per Share", "locations": [], "entities": {"persons": [], "locations": [{"name": "share helena", "sentiment": "none"}, {"name": "fourth quarter", "sentiment": "none"}, {"name": "mont.", "sentiment": "none"}], "organizations": [{"name": "eagle bancorp montana, inc.", "sentiment": "neutral"}, {"name": "eagle bancorp montana", "sentiment": "neutral"}, {"name": "opportunity bank of montana", "sentiment": "none"}, {"name": "eagle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HELENA, Mont., Jan. 29, 2018 (GLOBE NEWSWIRE) -- Eagle Bancorp Montana, Inc. (NASDAQ:EBMT), (the “Company,” “Eagle”), the holding company of Opportunity Bank of Montana, today reported that following a writedown of its deferred tax asset, which resulted in an additional tax expense of $715,000, or $0.15 per diluted share, net income was $553,000, or $0.11 per diluted share in the fourth quarter of 2017. This compares with net income of $1.7 million, or $0.45 per diluted share, in the preceding quarter and $1.4 million, or $0.37 per diluted share, in the fourth quarter a year ago. The current quarter results were also impacted by $400,000 of acquisition-related expenses which, net of tax benefit, reduced net income by $0.08 per diluted share. The results of the preceding quarter included $276,000 of acquisition expenses, while operating results in the fourth quarter a year ago included no acquisition expenses.\nFor the year 2017, Eagle’s net income was $4.1 million, or $0.99 per diluted share, compared to $5.1 million, or $1.32 per diluted share, in 2016.\nAdditionally, Eagle’s board of directors declared its regular quarterly cash dividend of $0.09 per share. The dividend will be payable March 1, 2018 to shareholders of record February 9, 2018. The current annualized yield is 1.71% based on recent market prices.\n“Strong loan growth, improved operating efficiencies and a stable net interest margin fueled our earnings during the quarter,” said Peter J. Johnson, President and CEO. “With our growing revenues, coupled with the Ruby Valley Bank transaction and other strategic initiatives, we believe Eagle is well positioned for continued profitability improvements.\n“Our previously announced definitive merger agreement to acquire Ruby Valley Bank, Twin Bridges, Montana is still on track to close later this month,” Johnson continued. “We are excited about the opportunity this transaction will offer to our company, and the transaction fits well into our strategy of further expanding our presence in the state of Montana. The combination of our two organizations will provide the ability to create revenue and cost synergies while offering Ruby Valley Bank customers a broader product offering, increased lending limits, and an expanded branch delivery system that stretches throughout the state. We expect the acquisition will provide substantial EPS accretion in the first full year, and we will continue to look for additional opportunities to expand our brand of community banking.”\nThe acquisition of $90 million Ruby Valley Bank will make Opportunity Bank the fifth largest Montana-based bank with approximately $800 million in assets. Ruby Valley Bank, headquartered in Twin Bridges, Montana, currently operates 2 branches in Twin Bridges and Sheridan and will add approximately $90 million in assets, $78 million in deposits, and $55 million in gross loans to Opportunity Bank.\nFourth Quarter 2017 Highlights (at or for the three-month period ended December 31, 2017, except where noted)\nNet income was $553,000, or $0.11 per diluted share. Acquisition costs were $400,000 in the fourth quarter. Net interest margin was 3.78% in the fourth quarter, a 17 basis point improvement compared to 3.61% in the fourth quarter a year ago. Revenues (net interest income before the provision for loan losses, plus non-interest income) were $9.8 million, compared to $10.2 million in the fourth quarter a year ago. Total loans increased 10.1% to $513.2 million at December 31, 2017, compared to $466.2 million a year earlier. Commercial real estate loans increased 13.9% to $244.8 million, or 47.7% of total loans at December 31, 2017, compared to $214.9 million, or 46.1% of total loans a year earlier. Capital ratios remain strong with a tangible common shareholders’ equity ratio of 10.76% at December 31, 2017. Declared quarterly cash dividend of $0.09 per share.\nAs a result of the Tax Cuts and Job Act enacted December 22, 2017, Eagle revalued its deferred tax assets and liabilities to account for the future impact of lower corporate tax rates and other provisions of the legislation. Based on its preliminary analysis, Eagle recorded a one-time net tax charge of $715,000, or $0.15 per share, primarily related to the revaluation of these deferred tax items. This increase in income tax expense was reflected in Eagle’s operating results for the fourth quarter of 2017 and was in addition to the normal provision for income tax related to pre-tax net operating income.\n“The effective tax rate for the current year was 22.7% (excluding the 4Q17 DTA charge). We believe our effective tax rate will decline to approximately 18.3% in 2018, including estimated impact of the upcoming acquisition. We plan to invest a portion of our 2018 tax savings into expansion opportunities and other corporate purposes,” added Johnson.\nBalance Sheet Results\n“While the loan portfolio increased modestly compared to the preceding quarter end, Eagle had another quarter of double digit year-over-year loan growth, with the largest increase generated in the commercial real estate loan category,” said Johnson. Total loans were $513.2 million at December 31, 2017, compared to $510.2 million three months earlier and increased 10.1% compared to $466.2 million a year earlier.\nEagle originated $75.9 million in new residential mortgages during the quarter, excluding construction loans, and sold $73.2 million in residential mortgages, with an average gross margin on sale of mortgage loans of approximately 2.92%. This production compares to residential mortgage originations of $84.9 million in the preceding quarter with sales of $85.3 million.\nCommercial real estate loans increased 13.9% to $244.8 million at December 31, 2017, compared to $214.9 million a year earlier, while residential mortgage loans decreased 3.0% to $109.9 million compared to $113.3 million a year earlier. Commercial loans increased 20.4% to $65.9 million, home equity loans increased 7.5% to $52.7 million and construction loans increased 23.2% to $25.3 million, compared to a year ago.\nEagle’s total deposits were $520.6 million at December 31, 2017, compared to $525.2 million at September 30, 2017 and increased 1.5% compared to $512.8 million a year ago. As of year-end, checking and money market accounts represent 55.5%, savings accounts represent 17.0%, and CDs comprise 27.5% of the total deposit portfolio.\nTotal assets increased 6.4% to $716.8 million at December 31, 2017, compared to $673.9 million a year earlier and increased 2.0% compared to $702.6 million at September 30, 2017. Shareholders’ equity increased 32.0% to $83.6 million at December 31, 2017, compared to $63.3 million three months earlier and increased 40.6% compared to $59.5 million one year earlier. Tangible book value improved to $15.22 per share at December 31, 2017, compared to $14.70 per share at September 30, 2017, and $13.65 per share a year earlier.\nOperating Results\n“While the net interest margin contracted two basis points compared to the preceding quarter, it expanded 17 basis points compared to the year ago quarter, largely due to improved yields and loan growth,” Johnson said. Eagle’s net interest margin was 3.78% in the fourth quarter, compared to 3.80% in the preceding quarter, and 3.61% in the fourth quarter a year ago. For the full year, Eagle’s net interest margin improved 25 basis points to 3.71% compared to 3.46% in 2016. The investment securities portfolio increased to $132.0 million at December 31, 2017, compared to $128.4 million a year ago, which had a negative impact on the average yields on earning assets.\nEagle’s fourth quarter revenues were $9.8 million, compared to $10.1 million in the preceding quarter and $10.2 million in the fourth quarter a year ago. For the full year 2017, revenues increased 3.6% to $38.1 million compared to $36.8 million in 2016. Net interest income before the provision for loan loss increased 12.3% to $6.2 million in the fourth quarter compared to $5.6 million in the fourth quarter one year ago, and was unchanged when compared to the preceding quarter. For the year, net interest income increased 14.3% to $23.8 million, compared to $20.8 million in 2016.\nNoninterest income decreased 22.5% to $3.6 million in the fourth quarter, compared to $4.6 million in the fourth quarter a year ago, and decreased 10.6% compared to $4.0 million in the preceding quarter. The net gain on sale of mortgage loans totaled $2.1 million in the fourth quarter, compared to $2.6 million in the preceding quarter and $3.0 million in the fourth quarter a year ago. In 2017, noninterest income decreased to $14.3 million compared to $16.0 million in 2016, reflecting lower gains from sale of mortgage loans over the past 12 months.\nEagle’s fourth quarter noninterest expenses were $8.0 million compared to $7.6 million in both the preceding quarter and the year ago quarter. For 2017, noninterest expenses totaled $30.6 million compared to $28.0 million in 2016. Acquisition costs totaled $400,000 for the current quarter and $676,000 for the year.\nCredit Quality\nFourth quarter provision for loan losses was $294,000, compared to $331,000 in the preceding quarter and $452,000 in the fourth quarter a year ago. The allowance for loan losses represented 588.5% of nonperforming loans at December 31, 2017, compared to 394.0% three months earlier and 414.1% a year earlier.\nEagle’s nonperforming loans (NPLs) were $977,000 at the end of the fourth quarter, which was down 30.0% compared to $1.4 million three months earlier, and down 15.2% compared to $1.2 million a year earlier.\nNet charge-offs were $44,000 in the fourth quarter, compared to $56,000 in the preceding quarter and $332,000 in the fourth quarter a year ago. The allowance for loan losses was $5.8 million, or 1.12% of total loans at December 31, 2017, compared to $5.5 million, or 1.08% of total loans at September 30, 2017 and $4.8 million, or 1.02% of total loans a year ago.\nTotal OREO and other repossessed assets was $525,000 at December 31, 2017, compared to $527,000 at September 30, 2017 and $825,000 a year ago. Nonperforming assets (NPAs), consisting of nonperforming loans, OREO and other repossessed assets, loans delinquent 90 days or more, and restructured loans, decreased 21.9% to $1.5 million at December 31, 2017 or 0.21% of total assets, compared to $1.9 million, or 0.27% of total assets three months earlier and decreased 24.0% compared to $2.0 million, or 0.29% of total assets a year earlier.\nCapital Management\nEagle Bancorp Montana continues to be well capitalized with the ratio of tangible common shareholders’ equity to tangible asset of 10.76% at December 31, 2017. (Shareholders’ equity, less goodwill and core deposit intangible to tangible assets).\nOn October 13, 2017, Eagle successfully completed a public offering of its common stock, and issued 1,189,041 shares and received approximately $20.1 million in net cash proceeds.\nOn February 13, 2017, the Company completed the issuance of $10 million of senior unsecured debt. The net proceeds of $9.8 million was used as capital contribution to its bank subsidiary to support growth.\nAbout the Company\nEagle Bancorp Montana, Inc. is a bank holding company headquartered in Helena, Montana and is the holding company of Opportunity Bank, a community bank established in 1922 that serves consumers and small businesses in Montana through 14 banking offices. Additional information is available on the bank’s website at www.opportunitybank.com . The shares of Eagle Bancorp Montana, Inc. are traded on the Nasdaq Global Market under the symbol “EBMT.”\nForward Looking Statements\nThis release may contain certain \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, and may be identified by the use of such words as \"believe,\" “will”’ \"expect,\" \"anticipate,\" \"should,\" \"planned,\" \"estimated,\" and \"potential.\" These forward-looking statements include, but are not limited to statements of our goals, intentions and expectations; statements regarding our business plans, prospects, merger with Ruby Valley Bank, growth and operating strategies; statements regarding the asset quality of our loan and investment portfolios; and estimates of our risks and future costs and benefits. These forward-looking statements are based on current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are beyond our control. In addition, these forward-looking statements are subject to assumptions with respect to future business strategies and decisions that are subject to change. These factors include, but are not limited to, changes in laws or government regulations or policies affecting financial institutions, including changes in regulatory fees and capital requirements; general economic conditions, either nationally or in our market areas, that are worse than expected; competition among depository and other financial institutions; loan demand or residential and commercial real estate values in Montana; our ability to continue to increase and manage our commercial real estate and commercial business loans; inflation and changes in the interest rate environment that reduce our margins or reduce the fair value of financial instruments; adverse changes in the securities markets; other economic, governmental, competitive, regulatory and technological factors that may affect our operations; the effect of our pending acquisition of TwinCo, Inc. including the failure to achieve expected revenue growth and/or expense savings, the failure to effectively integrate their operations and the diversion of management time on issues related to the proposed merger. Because of these and other uncertainties, our actual future results may be materially different from the results indicated by these forward-looking statements. All information set forth in this press release is current as of the date of this release and the company undertakes no duty or obligation to update this information.\nBalance Sheet (Unaudited) (Unaudited) (Audited) (Dollars in thousands, except per share data) December 31, September 30, December 31, 2017\n2017\n2016\nAssets: Cash and due from banks $ 5,517 $ 7,371 $ 6,531 Interest-bearing deposits with banks 1,920 784 787 Total cash and cash equivalents 7,437 8,155 7,318 Securities available-for-sale, at market value 132,044 120,767 128,436 FHLB stock, at cost 4,086 4,121 4,012 FRB stock 1,465 871 871 Investment in Eagle Bancorp Statutory Trust I 155 155 155 Loans held-for-sale 8,949 9,606 18,230 Loans: Residential mortgage (1-4 family) 109,911 109,250 113,262 Commercial loans 65,863 58,554 54,706 Commercial real estate 244,783 247,501 214,927 Construction loans 25,306 29,760 20,540 Consumer loans 15,712 14,696 14,800 Home equity 52,672 51,450 49,018 Unearned loan fees (1,093 ) (1,027 ) (1,092 ) Total loans 513,154 510,184 466,161 Allowance for loan losses (5,750 ) (5,500 ) (4,770 ) Net loans 507,404 504,684 461,391 Accrued interest and dividends receivable 2,555 2,269 2,123 Mortgage servicing rights, net 6,578 6,398 5,853 Premises and equipment, net 21,958 20,860 19,393 Cash surrender value of life insurance 14,481 14,385 14,095 Real estate and other assets acquired in settlement of loans, net 525 527 825 Goodwill 7,034 7,034 7,034 Core deposit intangible 273 300 384 Deferred tax asset, net 1,360 1,349 1,965 Other assets 478 1,089 1,840 Total assets $ 716,782 $ 702,570 $ 673,925 Liabilities: Deposit accounts: Noninterest bearing 99,799 104,866 82,877 Interest bearing 420,765 420,301 429,918 Total deposits 520,564 525,167 512,795 Accrued expense and other liabilities 4,822 5,426 4,291 FHLB advances and other borrowings 82,969 83,836 82,413 Other long-term debt, net 24,811 24,795 14,970 Total liabilities 633,166 639,224 614,469 Shareholders' Equity: Preferred stock (par value $0.01; 1,000,000 shares authorized; no shares issued or outstanding) - - - Common stock (par value $0.01; 8,000,000 shares authorized; 5,272,168, 4,083,127 and 4,083,127 shares issued; 5,013,678, 3,811,409 and 3,811,409 shares outstanding at December 31, 2017, September 30, 2017 and December 31, 2016, respectively) 53 41 41 Additional paid-in capital 42,780 22,477 22,366 Unallocated common stock held by employee stock ownership plan (ESOP) (643 ) (684 ) (809 ) Treasury stock, at cost (258,490, 271,718 and 271,718 shares at December 31, 2017, September 30, 2017 and December 31, 2016, respectively) (2,826 ) (2,971 ) (2,971 ) Retained earnings 43,939 43,837 41,240 Accumulated other comprehensive income (loss) 313 646 (411 ) Total shareholders' equity 83,616 63,346 59,456 Total liabilities and shareholders' equity $ 716,782 $ 702,570 $ 673,925\nIncome Statement (Unaudited) (Unaudited) (Audited) (Dollars in thousands, except per share data) Three Months Ended Years Ended December 31, September 30, December 31, December 31, 2017\n2017 2016 2017\n2016 Interest and dividend Income: Interest and fees on loans $ 6,554 $ 6,478 $ 5,589 $ 24,776 $ 20,842 Securities available-for-sale 762 693 721 2,898 2,917 FRB and FHLB dividends 46 48 39 170 142 Interest on deposits with banks 4 2 - 7 1 Other interest income 1 3 2 5 6 Total interest and dividend income 7,367 7,224 6,351 27,856 23,908 Interest Expense: Interest expense on deposits 411 386 399 1,553 1,518 FHLB advances and other borrowings 361 329 193 1,217 815 Other long-term debt 351 350 198 1,320 782 Total interest expense 1,123 1,065 790 4,090 3,115 Net interest income 6,244 6,159 5,561 23,766 20,793 Loan loss provision 294 331 452 1,228 1,833 Net interest income after loan loss provision 5,950 5,828 5,109 22,538 18,960 Noninterest income: Service charges on deposit accounts 233 250 226 954 865 Net gain on sale of loans 2,141 2,574 3,026 8,803 10,346 Mortgage loan servicing fees 546 525 568 2,127 1,835 Wealth management income 161 142 140 624 601 Interchange and ATM fees 208 214 221 856 873 Appreciation in cash surrender value of life insurance 125 125 126 500 484 Net gain on sale of available-for-sale securities 51 - 55 37 249 Net (loss) gain on sale of real estate owned and other repossessed property (4 ) - - (29 ) 10 Other noninterest income 104 158 237 459 727 Total noninterest income 3,565 3,988 4,599 14,331 15,990 Noninterest expense: Salaries and employee benefits 4,530 4,331 4,503 17,880 16,286 Occupancy and equipment expense 665 680 657 2,734 2,815 Data processing 567 563 513 2,263 1,980 Advertising 253 255 166 966 696 Amortization of mortgage servicing fees 274 288 410 1,086 1,249 Amortization of core deposit intangible and tax credits 105 107 110 426 445 Federal insurance premiums 86 78 99 284 404 Postage 46 48 46 193 194 Legal, accounting and examination fees 183 107 115 575 394 Consulting fees 58 14 41 180 202 Acquisition costs 400 276 - 676 - Write-down on real estate owned and other repossessed property - - - 45 - Other noninterest expense 855 810 966 3,330 3,354 Total noninterest expense 8,022 7,557 7,626 30,638 28,019 Income before income taxes 1,493 2,259 2,082 6,231 6,931 Income tax expense 940 538 633 2,128 1,799 Net income $ 553 $ 1,721 $ 1,449 $ 4,103 $ 5,132 Basic earnings per share $ 0.11 $ 0.45 $ 0.39 $ 1.01 $ 1.36 Diluted earnings per share $ 0.11 $ 0.45 $ 0.37 $ 0.99 $ 1.32 Weighted average shares outstanding (basic EPS) 4,854,128 3,811,409 3,800,645 4,074,231 3,784,788 Weighted average shares outstanding (diluted EPS) 4,912,701 3,863,656 3,874,833 4,132,590 3,873,589\nFinancial Ratios and Other Data (Unaudited) (Dolla rs in thousands, except per share data) December 31, September 30, December 31, 2017\n2017\n2016\nAsset Quality: Nonaccrual loans $ 977 $ 1,396 $ 614 Loans 90 days past due - - 495 Restructured loans, net - - 43 Total nonperforming loans 977 1,396 1,152 Other real estate owned and other repossessed assets 525 527 825 Total nonperforming assets $ 1,502 $ 1,923 $ 1,977 Nonperforming loans / portfolio loans 0.19 % 0.27 % 0.25 % Nonperforming assets / assets 0.21 % 0.27 % 0.29 % Allowance for loan losses / portfolio loans 1.12 % 1.08 % 1.02 % Allowance / nonperforming loans 588.54 % 393.98 % 414.06 % Gross loan charge-offs for the quarter $ 53 $ 60 $ 338 Gross loan recoveries for the quarter $ 9 $ 4 $ 6 Net loan charge-offs for the quarter $ 44 $ 56 $ 332 Capital Data (At quarter end): Tangible book value per share $ 15.22 $ 14.70 $ 13.65 Shares outstanding 5,013,678 3,811,409 3,811,409 Tangible Common Equity to Tangible Assets 10.76 % 8.06 % 7.81 % Profitability Ratios (For the quarter): Efficiency ratio* 80.71 % 73.42 % 73.98 % Return on average assets 0.31 % 0.98 % 0.86 % Return on average equity 2.72 % 10.87 % 9.57 % Net interest margin 3.78 % 3.80 % 3.61 % Profitability Ratios (Year-to-date): Efficiency ratio * 79.30 % 78.81 % 74.96 % Return on average assets 0.59 % 0.69 % 0.78 % Return on average equity 6.20 % 7.75 % 8.73 % Net interest margin 3.71 % 3.68 % 3.46 % Other Information Average total assets for the quarter $ 714,832 $ 704,336 $ 670,469 Average total assets year to date $ 696,835 $ 690,112 $ 654,811 Average earning assets for the quarter $ 660,442 $ 648,385 $ 615,539 Average earning assets year to date $ 641,141 $ 634,365 $ 601,824 Average loans for the quarter ** $ 524,057 $ 520,603 $ 479,229 Average loans year to date ** $ 507,980 $ 502,563 $ 456,808 Average equity for the quarter $ 81,415 $ 63,315 $ 60,544 Average equity year to date $ 66,200 $ 61,096 $ 58,754 Average deposits for the quarter $ 523,866 $ 517,660 $ 515,771 Average deposits year to date $ 518,638 $ 516,194 $ 498,224 * The efficiency ratio is a non-GAAP ratio that is calculated by dividing non-interest expense, exclusive of intangible asset amortization, by the sum of net interest income and non-interest income. ** includes loans held for sale\nUse of Non-GAAP Financial Measures\nIn addition to results presented in accordance with generally accepted accounting principles utilized in the United States, or GAAP, the Financial Ratios and Other Data contains our efficiency ratio and tangible book value per share, which are non-GAAP financial measures. The numerator for the efficiency ratio is calculated by subtracting intangible asset amortization from noninterest expense. Tangible assets and tangible common shareholders’ equity are calculated by excluding intangible assets from assets and shareholders’ equity, respectively. For these financial measures, our intangible assets consist of goodwill and core deposit intangible. Tangible book value per share is calculated by dividing tangible common shareholders’ equity by the number of common shares outstanding. We believe that this measure is consistent with the capital treatment by our bank regulatory agencies, which exclude intangible assets from the calculation of risk-based capital ratios, and present this measure to facilitate the comparison of the quality and composition of our capital over time and in comparison to our competitors.\nNon-GAAP financial measures have inherent limitations, are not required to be uniformly applied, and are not audited. Further, the non-GAAP financial measure of tangible book value per share should not be considered in isolation or as a substitute for book value per share or total shareholders’ equity determined in accordance with GAAP, and may not be comparable to a similarly titled measure reported by other companies. Reconciliation of the GAAP and non-GAAP financial measures are presented below.\nEfficiency Ratio (Unaudited) (Unaudited) (Dollars in thousands, except per share data) Three Months Ended Year Ended December 31, September 30, December 31, December 31, 2017\n2017\n2016\n2017\n2016\nCalculation of Efficiency Ratio: Noninterest expense $ 8,022 $ 7,557 $ 7,626 $ 30,638 $ 28,019 Intangible asset amortization (105 ) (107 ) (110 ) (426 ) (445 ) Efficiency ratio numerator 7,917 7,450 7,516 30,212 27,574 Net interest income 6,244 6,159 5,561 23,766 20,793 Noninterest income 3,565 3,988 4,599 14,331 15,990 Efficiency ratio denominator 9,809 10,147 10,160 38,097 36,783 Efficiency ratio 80.71 % 73.42 % 73.98 % 79.30 % 74.96 %\nTangible Book Value and Tangible Assets (Unaudited) (Dollars in thousands, except per share data) December 31, September 30, December 31, 2017\n2017\n2016\nTangible Book Value: Shareholders' equity $ 83,616 $ 63,346 $ 59,456 Goodwill and core deposit intangible, net (7,307 ) (7,334 ) (7,418 ) Tangible common shareholders' equity $ 76,309 $ 56,012 $ 52,038 Common shares outstanding at end of period 5,013,678 3,811,409 3,811,409 Common shareholders' equity (book value) per share (GAAP) $ 16.68 $ 16.62 $ 15.60 Tangible common shareholders' equity (tangible book value) per share (non-GAAP) $ 15.22 $ 14.70 $ 13.65 Tangible Assets: Total assets $ 716,782 $ 702,570 $ 673,925 Goodwill and core deposit intangible, net (7,307 ) (7,334 ) (7,418 ) Tangible assets (non-GAAP) $ 709,475 $ 695,236 $ 666,507 Tangible common shareholders' equity to tangible assets (non-GAAP) 10.76 % 8.06 % 7.81 %\nContacts:\nPeter J. Johnson, President and CEO\n(406) 457-4006\nLaura F. Clark, SVP and CFO\n(406) 457-4007\nSource:Eagle Bancorp Montana, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=9fUZmyKPCzFK5A3ZGdMCF3OzeGkzU1xicMSdn-HlCnXp8Dq-PQCZUvdckmZNd8JjGpDan7sGB2lb_fLrKh3md0UclHK1CnR-YngYRhWPuqE=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/76453ea6-0f49-45d4-af2a-509fb1eeaf30"], "published": "2018-01-29T20:00:00.000+02:00", "crawled": "2018-01-29T20:55:24.025+02:00", "highlightTitle": ""}