{"organizations": [], "uuid": "010aa55a9f1457eae2911c81fcbbf613706a5fbb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-abivax-appoints-carol-l-brosgart-m-d-to-its-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "ABIVAX Appoints Carol L. Brosgart, M.D. to its Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T10:00:00.000+02:00", "replies_count": 0, "uuid": "010aa55a9f1457eae2911c81fcbbf613706a5fbb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-abivax-appoints-carol-l-brosgart-m-d-to-its-board-of-directors.html", "ord_in_thread": 0, "title": "ABIVAX Appoints Carol L. Brosgart, M.D. to its Board of Directors", "locations": [], "entities": {"persons": [{"name": "carol l. brosgart", "sentiment": "negative"}, {"name": "carol", "sentiment": "none"}, {"name": "philippe pouletty", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "epidemiology and biostatistics, institute for global health", "sentiment": "none"}, {"name": "department of medicine", "sentiment": "none"}, {"name": "university of california", "sentiment": "none"}, {"name": "abivax", "sentiment": "none"}, {"name": "hbv", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Seasoned veteran with decades of infectious diseases experience, specifically in HIV clinical research and development\nPARIS--(BUSINESS WIRE)-- Regulatory News:\nABIVAX (Paris:ABVX) (Euronext Paris: FR0012333284 – ABVX), a biotechnology company harnessing the immune system to develop a functional cure for HIV and treatments for inflammatory/autoimmune diseases and cancer, today announces the appointment as of January 22 , 2018, of Dr. Carol L. Brosgart, Clinical Professor of Medicine, Epidemiology and Biostatistics, Institute for Global Health, Department of Medicine, University of California, San Francisco, CA, to its Board of Directors as an independent director.\n“We are very pleased to have Carol join our Board as she will be a tremendous asset for us,” said Dr. Philippe Pouletty, M.D., Ph.D., Chairman of ABIVAX . “She brings outstanding expertise in international clinical drug development in infectious diseases, particularly in HIV and HBV, in addition to her deep industry knowledge and clinical development experience. Her capabilities and insights will be invaluable to ABIVAX as we progress our clinical programs through development and bring them to the U.S. later this year.”\nDr. Brosgart has served as an independent director on the Boards of both public and privately-held biotechnology companies, as a member of the Federal US CDC/HRSA Advisory Committee on HIV, Viral Hepatitis, and STD Prevention and Treatment, and was the Senior Advisor on Science and Policy to the Division of Viral Hepatitis at the CDC. She has held numerous senior management positions within biotechnology and health care. Dr. Brosgart was the Chief Medical Officer for Alios BioPharma (now Johnson & Johnson), a biotech company developing therapies to treat viral diseases. Dr. Brosgart joined Alios from Children’s Hospital & Research Center in Oakland, California, where she served as Senior Vice President and Chief Medical Officer. For eleven years Dr. Brosgart held a number of senior management positions at Gilead Sciences. While Vice President of Clinical Research at Gilead she was responsible for the clinical development and approval by the FDA and by regulatory authorities worldwide of two antiviral therapies – Viread® for the treatment of HIV, and Hepsera® for the treatment of chronic hepatitis B.\nPrior to Gilead, Dr. Brosgart worked for more than 20 years in public health, clinical care, research, and teaching. She was among the first physicians in the United States to recognize and treat patients with HIV/AIDS. Dr. Brosgart was the founding Medical Director of the East Bay AIDS Center. She led NIH clinical trials as a member of the Community Programs for Clinical Research on AIDS (CPCRA), chaired the CPCRA Scientific Advisory Committee, and contributed to HIV antiretroviral drug development, and to the development of prophylactic and treatment agents for opportunistic and malignant complications of HIV.\nDr. Brosgart received her B.S. in community medicine from the University of California, Berkeley (UCB), her M.D. from the University of California, San Francisco (UCSF), and her residency training in Pediatrics (UCSF) and Public Health and Preventive Medicine (UCB). She has published extensively in the areas of infectious diseases, focusing on antiviral therapy for HIV, HBV, CMV, and related public health policy.\n“I am pleased to join this dynamic and forward-thinking group,” said Dr. Brosgart . “ABIVAX is a very promising company with exciting opportunities, as they work to bring HIV therapy to the next level, which is the reduction and ultimately eradication of the HIV reservoir in patients. I look forward to seeing this therapy meaningfully change patients’ lives.”\nDr. Brosgart was initially introduced to ABIVAX through LifeSci Advisors’ Board Placement Initiative (BPI) , which seeks to help companies in the life sciences industry strengthen and diversify their corporate boards.\nAbout ABIVAX ( www.abivax.com/en ) .\nABIVAX is mobilizing the body’s natural immune machinery to treat patients with viral infections, autoimmune diseases and cancer. A clinical-stage company, ABIVAX leverages its antiviral and immune enhancing platforms to optimize candidates to cure HIV and treat inflammatory bowel diseases and liver cancer. ABIVAX is listed on Euronext compartment B (ISIN: FR0012333284 – Mnémo: ABVX). More information on the company is available at www.abivax.com/en .\nFollow us on Twitter @ABIVAX_\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180128005049/en/\nABIVAX\nFinance\nDidier Blondel, +33 1 53 83 08 41\ndidier.blondel@abivax.com\nor\nMedia France\nALIZE RP\nCaroline Carmagnol/Aurore Gangloff\n+33 6 64 18 99 59 / +33 1 44 54 36 66\nabivax@alizerp.com\nor\nInvestors Relation\nLifeSci Advisors\nChris Maggos, +41 79 367 6254\nchris@lifesciadvisors.com\nor\nMedia USA\nLifeSci Public Relations\nMatt Middleman, M.D., +1 646 627 8384\nmatt@lifescipublicrelations.com\nSource: ABIVAX", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.abivax.com%2Fen%2Fabout%2Fboard-of-directors.html&esheet=51749871&newsitemid=20180128005049&lan=en-US&anchor=Board+of+Directors&index=1&md5=87363456bcc3acf1da94e977f65cc444", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.lifesciadvisors.com%2Fdiversity%2Fboard-diversity-initiatives%2F&esheet=51749871&newsitemid=20180128005049&lan=en-US&anchor=Board+Placement+Initiative+%28BPI%29&index=3&md5=501dba674901389255f25b135c6f08ca", "http://www.businesswire.com/news/home/20180128005049/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.abivax.com%2Fen&esheet=51749871&newsitemid=20180128005049&lan=en-US&anchor=www.abivax.com%2Fen&index=5&md5=72fec2700316a63abe31f2144676cbd5", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.lifesciadvisors.com%2F&esheet=51749871&newsitemid=20180128005049&lan=en-US&anchor=LifeSci+Advisors%27&index=2&md5=e1df0b8078b10cdcc5cf4dca4021a8e7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.abivax.com%2Fen&esheet=51749871&newsitemid=20180128005049&lan=en-US&anchor=www.abivax.com%2Fen&index=4&md5=c61db870f8e666663188182944ba6e4e"], "published": "2018-01-29T10:00:00.000+02:00", "crawled": "2018-01-29T10:28:20.000+02:00", "highlightTitle": ""}