{"organizations": [], "uuid": "8348d4ded939962ab9be45d3696577346df399fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-soundexchange-board-of-directors-extends-contract-of-president-and-ceo-michael-huppe.html", "country": "US", "domain_rank": 767, "title": "SoundExchange Board of Directors Extends Contract of President and CEO Michael Huppe", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T17:30:00.000+02:00", "replies_count": 0, "uuid": "8348d4ded939962ab9be45d3696577346df399fc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-soundexchange-board-of-directors-extends-contract-of-president-and-ceo-michael-huppe.html", "ord_in_thread": 0, "title": "SoundExchange Board of Directors Extends Contract of President and CEO Michael Huppe", "locations": [], "entities": {"persons": [{"name": "michael huppe", "sentiment": "negative"}, {"name": "mike", "sentiment": "none"}, {"name": "huppe", "sentiment": "none"}, {"name": "cary sherman", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "soundexchange", "sentiment": "none"}], "organizations": [{"name": "soundexchange board", "sentiment": "negative"}, {"name": "riaa", "sentiment": "none"}, {"name": "soundexchange board of directors", "sentiment": "none"}, {"name": "recording industry association of america", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan. 10, 2018 /PRNewswire/ -- SoundExchange President and CEO Michael Huppe will continue to lead the company through 2021, the organization's Board of Directors announced today.\nHuppe took the helm at SoundExchange in 2011. Since that time, annual collections have increased by more than 150 percent and the company has successfully diversified its offerings to include administration of direct licenses and distribution of settlement monies for third parties. SoundExchange moved into music publisher administration with its acquisition of Canadian mechanical rights society CMRRA in May 2017. SoundExchange has distributed nearly $5 billion in digital performance royalties to artists and rights owners since it was formed.\n\"Mike's vision and energy have driven SoundExchange through a remarkable period of growth and diversification, resulting in one of the most effective, efficient and transparent organizations in the industry today,\" said Cary Sherman, chairman and CEO, Recording Industry Association of America (RIAA), and a member of the SoundExchange Board of Directors. \"Mike has identified and executed on opportunities to redefine service and efficiency. Moreover, he has guided the expansion of our business beyond its initial core to include administration of direct licenses for sound recordings and brought the company into the music publisher services sector through the acquisition of CMRRA. He is a tireless advocate for musicians and the industry, and I'm thrilled he will be at SoundExchange's helm for another term.\"\nSoundExchange Board member and founding member of The Talking Heads, David Byrne, added \"Mike has the tricky job of navigating the interests of the various SoundExchange board members, myself included – interests which often converge, but often after a process, which Mike skillfully takes us through. The music business is never smooth sailing, to continue the metaphor, but with Mike as our captain we'll adapt, prosper and grow. Mike is great at seeing the larger picture and has been adept at making SoundExchange a unique and trusted (trust, in the music business!) name in our world. I for one am happy to have him continue… everyone on the board seems to be thrilled to extend his contract and continue to work together.\"\nDedicated to advocating for all creators of music, Huppe led the organization's successful efforts before the Copyright Royalty Board, resulting in royalty rates for webcasters and satellite radio more than doubling since he became president and CEO in 2011. At the same time, the company delivered new services to the market including direct license administration and the distribution of settlement monies to artists including the recording industry's settlement of litigation around pre-72 sound recordings. The company also developed and rolled out SoundExchange Direct, providing a new level of access and transparency in royalty reporting as well as the industry's first publicly accessible International Standard Recording Code (ISRC) database. SoundExchange also powers the official ISRC database for the global International Federation of the Phonographic Industry (IFPI).\nIn May 2017, SoundExchange acquired the Canadian Musical Reproduction Rights Agency Ltd., which licenses and administers more than 85 percent of mechanical royalties for music publishers in Canada. Huppe is the Chairman of the Board of SXWorks, a subsidiary of SoundExchange which holds the CMRRA acquisition and provides administration services to music publishers around the world.\nHuppe also serves on the Executive Committee of industry lobbying organization musicFIRST and the Community Advisory Board for the Kennedy Center for the Performing Arts. He is an Adjunct Professor at Georgetown University School of Law. He is a graduate of the University of Virginia and Harvard Law School.\nAbout SoundExchange\nSoundExchange develops business solutions to benefit the entire music industry. The organization collects and distributes digital performance royalties on behalf of more than 155,000 recording artists and master rights owners accounts and administers direct agreements on behalf of rights owners and licensees. To date, SoundExchange has paid out nearly $5 billion in royalties. SXWorks, a SoundExchange subsidiary created with the acquisition of the Canadian Musical Reproduction Rights Agency Ltd. (CMRRA), provides global administration and support services to music publishers for multiple licensing activities. For more information, visit www.SoundExchange.com or http://sx-works.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/soundexchange-board-of-directors-extends-contract-of-president-and-ceo-michael-huppe-300580625.html\nSOURCE SoundExchange", "external_links": ["http://sx-works.com/", "http://www.prnewswire.com/news-releases/soundexchange-board-of-directors-extends-contract-of-president-and-ceo-michael-huppe-300580625.html", "http://www.soundexchange.com/"], "published": "2018-01-10T17:30:00.000+02:00", "crawled": "2018-01-10T18:40:44.019+02:00", "highlightTitle": ""}