{"organizations": [], "uuid": "83c49ac6173d34bd973df12a35b4ce3c43ac3ded", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-schwab-fourth-quarter-net-income-of-597amillion-caps-record-year.html", "country": "US", "domain_rank": 767, "title": "Schwab Fourth Quarter Net Income of $597 Million Caps Record Year", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T16:45:00.000+02:00", "replies_count": 0, "uuid": "83c49ac6173d34bd973df12a35b4ce3c43ac3ded"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-schwab-fourth-quarter-net-income-of-597amillion-caps-record-year.html", "ord_in_thread": 0, "title": "Schwab Fourth Quarter Net Income of $597 Million Caps Record Year", "locations": [], "entities": {"persons": [], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "both records core net", "sentiment": "negative"}, {"name": "charles schwab corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "2017 Revenues Rise 15% to $8.6 Billion, Net Income Grows 25% to $2.4 Billion, Both Records\nCore Net New Assets Rise 58% to a Record $198.6 Billion for the Year\nSAN FRANCISCO--(BUSINESS WIRE)-- The Charles Schwab Corporation announced today that its net income for the fourth quarter of 2017 was $597 million, up 14% from $522 million for the fourth quarter of 2016. Net income for the twelve months ended December 31, 2017 was nearly $2.4 billion, up 25% year-over-year. The company’s financial results for the fourth quarter and full-year 2017 were impacted by the tax reform legislation signed in December − a one-time tax expense of approximately $46 million decreased earnings per share by $0.03.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180117005476/en/\nThree Months Ended\nDecember 31,\n% Twelve Months Ended\nDecember 31,\n% Financial Highlights 2017 (1) 2016 Change 2017 (1) 2016 (2) Change Net revenues (in millions) $ 2,242 $ 1,972 14% $ 8,618 $ 7,478 15% Net income (in millions) $ 597 $ 522 14% $ 2,354 $ 1,889 25% Diluted earnings per common share $ .41 $ .36 14% $ 1.61 $ 1.31 23% Pre-tax profit margin 42.5 % 41.8 % 42.4 % 40.0 % Return on average common stockholders’ equity (annualized) 14 % 14 % 15 % 14 % Note: All per-share results are rounded to the nearest cent, based on weighted-average diluted common shares outstanding. (1) Effective January 1, 2017, a new accounting standard prospectively changed the treatment of a portion of the tax deductions relating to equity compensation. These deductions were previously reflected in additional paid-in capital, a component of stockholders’ equity, and are now included in taxes on income, a component of net income. The company’s tax expense for the fourth quarter and full year 2017 decreased by approximately $40 million and $87 million, respectively, as a result of this change. Future effects will depend on the company’s share price, restricted stock vesting, and the volume of equity incentive options exercised. (2) Reflects net litigation proceeds of $16 million in 2016, relating to the company’s non-agency residential mortgage-backed securities (RMBS) portfolio, which are included in Other revenue. CEO Walt Bettinger said, “Our steady focus on operating ‘through clients’ eyes’ has been a driving force in helping Schwab achieve another record year. In 2017, clients opened 1.4 million accounts, and households new to Schwab’s Retail business rose by 49% versus 2016; 54% of these households were age 40 or younger. In addition, clients trusted Schwab with a record $198.6 billion of core net new assets, up 58% from 2016 and marking a 7% organic growth rate. Both of our primary businesses attracted record inflows, with Retail and Advisor Services net new assets rising 57% and 59%, respectively, year-over-year. This impressive asset gathering was helped by a 75% increase in net transfers of assets from other firms, reflecting our strengthened competitive position. Our success with clients was bolstered by strength in the equity markets − the S&P 500 ® Index finished 2017 up 19%. In this environment, investor sentiment reached highs not seen in almost two decades, and clients actively engaged in the markets.”\nMr. Bettinger continued, “With a second straight top ranking in J.D. Power’s U.S. Full-Service Investor Satisfaction Survey*, we believe that the range of planning and advice solutions available through our modern approach to wealth management continues to resonate with clients. Assets enrolled in one of our retail or other advisory solutions continued to grow faster than client assets overall, reaching a record $268.7 billion at year-end, up 24%. In addition, our digital advisory solutions (Schwab Intelligent Portfolios ® , Institutional Intelligent Portfolios ® , and Schwab Intelligent Advisory ® ) have surpassed $27 billion in client assets with 223,000 active accounts. Total client assets as of December 31 st were a record $3.36 trillion, up 21% year-over-year. We ended 2017 serving 10.8 million active brokerage accounts, 1.2 million banking accounts, and 1.6 million retirement plan participants.”\nMr. Bettinger noted, “In 2017, we continued to build Schwab through our ‘Virtuous Cycle’ approach: we challenged the status quo to benefit investors, resulting in clients entrusting us with record assets, which helped lead to record financial results. We achieved record annual net revenues for the fifth straight year, reaching $8.6 billion, up 15% from 2016. At the same time, we increased project spending, hired more client-facing employees, and made ongoing investments to support the growth we’ve achieved and to help meet client service expectations. By once again effectively balancing near-term profitability and reinvestment for long-term growth, we were able to deliver a fourth consecutive year of record net income, up 25% to almost $2.4 billion. We recognize that these results are made possible by our employees’ passion for serving our clients every day, and in the fourth quarter we rewarded about 9,000 of our non-executive staff with a one-time ‘Through Clients’ Eyes’ award, totaling $9 million overall.”\nMr. Bettinger added, “When Chuck Schwab started the company over 40 years ago, he sought to level the playing field for all investors. Last year, we continued to deliver on that vision by pursuing our goal of a ‘no trade-offs’ combination of value, service, transparency, and trust. We shared the benefits of scale with our clients by announcing nearly $400 million in annualized price reductions. In February, we lowered equity and options trade commissions from $8.95 to $4.95 and dropped the per contract option fee to $0.65. We also reduced the operating expense ratios on our market cap-weighted index mutual funds to align with their ETF equivalents. Additionally and perhaps more importantly, we eliminated investment minimums and multiple share classes for both fundamental and market cap-weighted index funds, offering our best pricing to every investor, from the smallest to the largest. At the same time, we introduced a broad-reaching Satisfaction Guarantee, unique for our industry.** In the fourth quarter, we streamlined share classes and decreased operating expense ratios on our money market funds, enhancing the net yields available to our clients. Also during the year, we started an industry-first national advertising campaign on behalf of the RIAs that we serve and we rolled-out Schwab Advisor StreetSmart Edge ® , providing advisors with streaming of real-time Quote: s, advanced charting, and additional trading capabilities. We continued to enhance our product offerings during 2017, adding 34 ETFs to Schwab ETF OneSource ™ – investors and advisors can now buy and sell 242 ETFs covering 69 Morningstar categories. Later in the year we initiated the Schwab 1000 Index ® ETF – a new low-cost way to gain exposure to America’s largest 1,000 stocks. Additionally, we launched three index mutual funds: Schwab ® U.S. Large-Cap Value Index Fund, Schwab ® U.S. Large-Cap Growth Index Fund, and Schwab ® U.S. Mid-Cap Index Fund. On the technology front, we released a new account summary page, allowing clients to aggregate their non-Schwab account informati", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sipc.org&esheet=51744376&newsitemid=20180117005476&lan=en-US&anchor=http%3A%2F%2Fwww.sipc.org&index=5&md5=4be2687dcd7968a12db86aeb330324b1", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fschwabevents.com%2Fcorporation&esheet=51744376&newsitemid=20180117005476&lan=en-US&anchor=http%3A%2F%2Fschwabevents.com%2Fcorporation&index=4&md5=3112a301579d4a45166a5106bc8b9ae2", "http://schwabevents.com/corporation", "http://www.aboutschwab.com/investor-relations/cfo-commentary", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.schwab.com&esheet=51744376&newsitemid=20180117005476&lan=en-US&anchor=www.schwab.com&index=6&md5=3324116253b5e770517309c1d706d586", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.aboutschwab.com%2Finvestor-relations%2Ffinancial-reports&esheet=51744376&newsitemid=20180117005476&lan=en-US&anchor=http%3A%2F%2Fwww.aboutschwab.com%2Finvestor-relations%2Ffinancial-reports&index=1&md5=1fa2a741b909b9d40d872f3f8728a042", "http://www.aboutschwab.com/investor-relations/financial-reports", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.aboutschwab.com&esheet=51744376&newsitemid=20180117005476&lan=en-US&anchor=www.aboutschwab.com&index=7&md5=532a45e257f3d09e6b2428532d1ed9a6", "http://www.businesswire.com/news/home/20180117005476/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.aboutschwab.com%2Finvestor-relations%2Fcfo-commentary&esheet=51744376&newsitemid=20180117005476&lan=en-US&anchor=http%3A%2F%2Fwww.aboutschwab.com%2Finvestor-relations%2Fcfo-commentary&index=3&md5=b0880a93ad2896a84f9623536832bde5", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fjdpower.com&esheet=51744376&newsitemid=20180117005476&lan=en-US&anchor=jdpower.com&index=2&md5=d8d5d01142df134220c158d25467f689"], "published": "2018-01-17T16:45:00.000+02:00", "crawled": "2018-01-17T19:00:43.011+02:00", "highlightTitle": ""}