{"organizations": [], "uuid": "73d1f2956e2e1d02ea324749f5f0eedf28a7566b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 9}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-515107696.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/29/the-post-shows-how-newspapers-ruled-in-the-days-of-molten-lead/", "country": "US", "domain_rank": 1196, "title": "The Post Movie Shows How Newspapers Once Ruled | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.874, "site_type": "news", "published": "2018-01-29T10:35:00.000+02:00", "replies_count": 0, "uuid": "73d1f2956e2e1d02ea324749f5f0eedf28a7566b"}, "author": "Adam Lashinsky", "url": "http://fortune.com/2018/01/29/the-post-shows-how-newspapers-ruled-in-the-days-of-molten-lead/", "ord_in_thread": 0, "title": "The Post Movie Shows How Newspapers Once Ruled | Fortune", "locations": [], "entities": {"persons": [{"name": "katherine graham", "sentiment": "negative"}, {"name": "ben bradlee", "sentiment": "none"}, {"name": "klaus schwab", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "steven spielberg", "sentiment": "none"}, {"name": "manohla dargis", "sentiment": "none"}, {"name": "adam lashinsky", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}], "organizations": [{"name": "new york times", "sentiment": "none"}, {"name": "post", "sentiment": "none"}, {"name": "fortune", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'The Post\" Shows How Newspapers Ruled in the Days of Molten Lead Katherine Graham, publisher of Washington Post, and Ben Bradlee, editor of the same, are shown. Bettmann Archive By Adam Lashinsky 8:35 AM EST \nThis article first appeared in Data Sheet, Fortune’s daily newsletter on the top tech news. Sign up here . \nI had two favorite moments in The Post , the star-studded Steven Spielberg flick about the Pentagon Papers, which I finally saw this weekend. Before I get to them, I highly recommend this movie, and not just because it’s about the media (Manohla Dargis astutely relates in her New York Times review that the film “is about a subject that’s dear to the heart of journalists: themselves!”) or because it is a rousing defense of freedom of the press. (Confession: I was among those hissing in Davos Friday when first Klaus Schwab and then Donald Trump insulted the media.) It is also a well-told tale about speaking truth to power. And the outfits, rotary phones, and vintage televisions will bring a nostalgic smile to the face of anyone who remembers the early 1970s. \nMy first favorite moment has to do with technology. As the high and mighty as well as workaday hacks discuss whether The Washington Post should publish the documents it has acquired—spoiler alert: it does—men working on the actual printing presses prepare the molten led cast into letters using a process popularly known as “hot type.” The irony is dramatic: In a day of laughably old technology, newspapers ruled. Later computers took over, vastly reducing expenses for papers right up until those same computers effectively put them out of business. \nI also relished a line uttered by Tom Hanks in his role as Ben Bradlee, the legendary Post editor. Told that publishing could endanger the entire company, including the television stations The Post owns, he barks: “I don’t give a shit about the TV stations.” It’s a line anyone who has worked for one part of a company forced to care about another part of the company can relate to. (Not for nothing, my company, once famous for its fiefdoms, is about to be sold .) \n*** \nThe proxy war between Alibaba (baba) and Tencent (tcehy) continues to heat up. Alibaba is taking a stake in the Chinese electric car company Xiaopeng Motors. Tencent also owns stakes in other auto concerns, including Tesla. \n*** \nIn the weekend reading department, I enjoyed this take on Jim Kim , president of the World Bank and, as the Times article accurately portrays, a ubiquitous presence in Davos last week. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-29T10:35:00.000+02:00", "crawled": "2018-01-29T17:45:23.028+02:00", "highlightTitle": ""}