{"organizations": [], "uuid": "aadb1e080c9ffc485d9abc121d899a88890c6d22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-doj-veteran-claiborne-clay-w-porter-joins-navigantas-global-investigations-practice.html", "country": "US", "domain_rank": 767, "title": "DOJ Veteran Claiborne (Clay) W. Porter Joins Navigant’s Global Investigations Practice", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:30:00.000+02:00", "replies_count": 0, "uuid": "aadb1e080c9ffc485d9abc121d899a88890c6d22"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-doj-veteran-claiborne-clay-w-porter-joins-navigantas-global-investigations-practice.html", "ord_in_thread": 0, "title": "DOJ Veteran Claiborne (Clay) W. Porter Joins Navigant’s Global Investigations Practice", "locations": [], "entities": {"persons": [{"name": "claiborne", "sentiment": "negative"}, {"name": "w. porter", "sentiment": "negative"}, {"name": "porter", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "fatca", "sentiment": "none"}], "organizations": [{"name": "navigant", "sentiment": "negative"}, {"name": "doj", "sentiment": "negative"}, {"name": "gic", "sentiment": "none"}, {"name": "nci", "sentiment": "none"}, {"name": "asset recovery section", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "u. s. department of justice", "sentiment": "none"}, {"name": "dodd-frank", "sentiment": "none"}, {"name": "navigant consulting, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Financial crime specialist offers expertise to financial institutions and corporations\nCHICAGO--(BUSINESS WIRE)-- Navigant Consulting, Inc. (NYSE: NCI) has expanded its global investigations and compliance practice (GIC) with the addition of Claiborne “Clay” W. Porter, a former supervisor and trial attorney with the U. S. Department of Justice’s (DOJ) Money Laundering and Asset Recovery Section, the company announced today.\nPorter has been named managing director and head of investigations. Navigant’s GIC practice combines industry experience, forensic accounting, and an investigative approach to help financial institutions and companies effectively respond to inquiries and government investigations, and navigate compliance. The practice produces strategies and programs related to anti-money laundering, anti-bribery and corruption, Dodd-Frank compliance, FATCA, accounting, and financial fraud.\nPorter’s responsibilities will include oversight of Navigant’s anti-bribery and corruption compliance, and forensic accounting and financial investigations teams, and he will also work on anti-money laundering and economic sanctions matters, including issues related to asset tracing and recovery.\n“During his 16 years as a white-collar defense attorney, state prosecutor, and most recently as a federal prosecutor, Clay handled complex international investigations and prosecutions related to white-collar crime,” said Ellen Zimiles, managing director and leader of Financial Services Advisory and Compliance. “His work with U.S. and foreign regulators and law enforcement has given him a unique and valuable perspective into the government’s expectations as to what constitutes an effective and comprehensive compliance program for financial institutions and multinational corporations.”\nPorter previously served as the acting principal deputy chief of the DOJ’s Money Laundering and Asset Recovery Section and as chief of the Bank Integrity Unit. In those roles, he supervised approximately 150 attorneys and staff, in addition to managing complex financial investigations and prosecutions conducted in partnership with U.S. Attorneys’ offices across the country. He has been involved in almost every significant Bank Secrecy Act and sanctions prosecution of a financial institution during the last seven years.\nPrior to his supervisory roles, he led teams of prosecutors in investigations of financial institutions of all kinds. Before joining the DOJ, he was an associate with two international law firms. He also served as an examining attorney for the New York City Mayor’s Commission to Combat Police Corruption and an assistant district attorney in Brooklyn, NY, prosecuting violent crime.\nNavigant's Financial Services Advisory and Compliance practice advises with banking, insurance, and investment management firms to enhance and streamline compliance, manage risk, safeguard reputations, and create competitive advantage. Navigant helps clients address issues related to regulatory compliance, risk management, process improvement, business model transformation, information technology, and outsourcing.\nAbout Navigant\nNavigant Consulting, Inc. (NYSE: NCI) is a specialized, global professional services firm that helps clients take control of their future. Navigant’s professionals apply deep industry knowledge, substantive technical expertise, and an enterprising approach to help clients build, manage, and/or protect their business interests. With a focus on markets and clients facing transformational change and significant regulatory or legal pressures, the firm primarily serves clients in the healthcare, energy, and financial services industries. Across a range of advisory, consulting, outsourcing, and technology/analytics services, Navigant’s practitioners bring sharp insight that pinpoints opportunities and delivers powerful results. More information about Navigant can be found at navigant.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108005523/en/\nNavigant Investor Relations\nKyle Bland\n312.573.5624\nkyle.bland@navigant.com\nor\nNavigant Corporate Communications\nBelia Ortega\n312.583.2640\nbelia.ortega@navigant.com\nSource: Navigant Consulting, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.navigant.com%2Fcapabilities%2Findustries%2Ffinancial-services&esheet=51739158&newsitemid=20180108005523&lan=en-US&anchor=Navigant%27s+Financial+Services+Advisory+and+Compliance&index=1&md5=2ee8ea2af481a405948587a619b3cb7d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fnavigant.com%2F&esheet=51739158&newsitemid=20180108005523&lan=en-US&anchor=navigant.com&index=2&md5=5e3907232d25b34a56257ff73b2656e1", "http://www.businesswire.com/news/home/20180108005523/en/"], "published": "2018-01-08T15:30:00.000+02:00", "crawled": "2018-01-08T19:21:27.015+02:00", "highlightTitle": ""}