{"organizations": [], "uuid": "9cf7d03902fc59511dd6a3ae3e6159d04cb9a1a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/21/reuters-america-update-10-government-still-shut-down-on-monday-as-u-s-senate-fails-to-clinch-deal.html", "country": "US", "domain_rank": 767, "title": "UPDATE 10-Government still shut down on Monday as U.S. Senate fails to clinch deal", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T06:45:00.000+02:00", "replies_count": 0, "uuid": "9cf7d03902fc59511dd6a3ae3e6159d04cb9a1a3"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/21/reuters-america-update-10-government-still-shut-down-on-monday-as-u-s-senate-fails-to-clinch-deal.html", "ord_in_thread": 0, "title": "UPDATE 10-Government still shut down on Monday as U.S. Senate fails to clinch deal", "locations": [], "entities": {"persons": [{"name": "barack obama", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "u.s. senate", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "deferred action for childhood arrivals", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "deal@ (New throughout with no deal on Sunday)\nWASHINGTON, Jan 21 (Reuters) - A U.S. government shutdown will enter its third day on Monday as Senate negotiators failed to reach agreement late on Sunday to restore federal spending authority and deal with demands from Democrats that young \"Dreamers\" be protected from deportation.\nThe Senate set a vote for 12 p.m. (1700 GMT) on Monday on advancing a measure to provide temporary government funding through Feb. 8, end the shutdown and allow hundreds of thousands of federal employees to return to work.\nSenate Majority Leader Mitch McConnell offered an olive branch to Democrats late on Sunday, pledging on the Senate floor to bring immigration legislation up for debate in February if the issue is still unresolved by then.\nAt the core of Democrats' demands is the fate of young people, known as Dreamers, who were brought to the country illegally as children. Former Democratic President Barack Obama's Deferred Action for Childhood Arrivals (DACA) program extended legal protections to about 700,000 of them, shielding them from being deported.\n\"It would be my intention to proceed to legislation that would address DACA, border security and related issues,\" McConnell said, adding: \"It is also my intention take up legislation on increased defense spending, disaster relief and other important matters\" then.\nIt was unclear whether there would be enough Democratic votes on Monday to advance a temporary spending bill.\nFunding for federal agencies ran out at midnight on Friday amid an impasse between President Donald Trump, congressional Republicans and Democrats over DACA and other immigration issues.\nDemocrats want Trump, who last year ordered an end to DACA in March, to live up to an earlier agreement to protect the Dreamers. Democrats refused last week to support another short-term government funding extension.\nRepublican Senator Jeff Flake, part of a bipartisan working group pushing for legislation to replace DACA, told reporters that McConnell was still six or seven Democratic votes short of breaking the impasse that led to the shutdown.\nFlake said negotiations would resume early on Monday leading up to the midday vote on the Senate floor.\n'BITE PRETTY HARD'\nWhile public reaction to the shutdown may have been muted over the weekend, Flake said Republicans would suffer politically in the long run. \"If it comes back to bite, it comes back to bite pretty hard,\" the Arizona senator predicted.\nSenate Democratic leader Chuck Schumer objected to a move by McConnell to speed up the vote on a temporary funding bill that had been set for 1 a.m. (0600 GMT) on Monday, signaling that a deal was still not in hand.\nIn vowing to bring immigration legislation to the Senate floor next month, McConnell shifted from an earlier position, saying earlier he would do that this month only if there were a bipartisan deal backed by Trump.\nThe Republican president has vacillated on what sort of legislation he supports and McConnell now seems willing to let the Senate craft a deal on legal protections for Dreamers and beefing up immigration enforcement at U.S. borders.\nThe hope is that if the Senate passes an immigration bill, Trump would not only support it but help sell it to the more conservative House of Representatives.\n\"We will not negotiate on the status of unlawful immigrants while Senator Schumer and the Democrats hold the government for millions of Americans and our troops hostage,\" White House press secretary Sarah Sanders said.\nDespite that statement, it was clear that senators were seeking paths both to reopen the government and address border security and the Dreamers.\nLast September, Trump said he was terminating DACA and challenged Congress to come up with a legislative replacement by March 5. If Congress fails, the Dreamers, many from Mexico and Central America, could face deportation. Many have spent most of their lives in the United States.\nFIRST SHUTDOWN SINCE 2013\nThe shutdown is the first since a 16-day closure in October 2013 and its effects will be more visible on Monday, when financial markets and federal offices open.\nThe White House said Trump's planned trip to the World Economic Forum in Davos, Switzerland, this week was in flux because of the standoff on Capitol Hill.\nWith elections set for November for a third of U.S. Senate seats and the entire House of Representatives, both sides are maneuvering to blame the other for the shutdown.\nIn a Senate floor speech on Sunday, McConnell accused Schumer of imperiling children's healthcare, military training, veterans' care and other programs.\nSchumer and his colleagues accused Trump of being an unreliable negotiating partner, saying the two sides came close to a deal on immigration several times, only to have Trump back out under pressure from anti-immigration conservatives.\nSince Democratic votes are needed in the Senate to pass spending bills, they are in a position to make demands on immigration before signing off on such a spending increase.\n(Additional reporting by Susan Cornwell, Howard Schneider, Patrick Rucker and Makini Brice in Washington and Megan Davies in New York; Writing by Warren Strobel, Matt Spetalnick and Richard Cowan; Editing by Kevin Drawbaugh and Peter Cooney)", "external_links": [], "published": "2018-01-22T06:45:00.000+02:00", "crawled": "2018-01-22T17:07:03.005+02:00", "highlightTitle": ""}