{"organizations": [], "uuid": "596e2490bc2e28b0ed34f3ff8dd28dab92874de2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-this-mornings-research-reports-on-gas-utilities-stocks--national-grid-clean-energy-fuels-oneok-and-centerpoint-energy.html", "country": "US", "domain_rank": 767, "title": "This Morning's Research Reports on Gas Utilities Stocks -- National Grid, Clean Energy Fuels, ONEOK, and CenterPoint Energy", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.377, "site_type": "news", "published": "2018-01-04T14:40:00.000+02:00", "replies_count": 0, "uuid": "596e2490bc2e28b0ed34f3ff8dd28dab92874de2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-this-mornings-research-reports-on-gas-utilities-stocks--national-grid-clean-energy-fuels-oneok-and-centerpoint-energy.html", "ord_in_thread": 0, "title": "This Morning's Research Reports on Gas Utilities Stocks -- National Grid, Clean Energy Fuels, ONEOK, and CenterPoint Energy", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "centerpoint energy", "sentiment": "neutral"}, {"name": "oneok", "sentiment": "neutral"}, {"name": "research reports on gas utilities stocks", "sentiment": "neutral"}, {"name": "national grid plc", "sentiment": "none"}, {"name": "cnp", "sentiment": "none"}, {"name": "national grid london", "sentiment": "none"}, {"name": "clean energy fuels corp.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "centerpoint energy inc.", "sentiment": "none"}, {"name": "oneok inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 4, 2018 /PRNewswire/ -- WallStEquities.com strives to bring the best free research to the investment community. Today we are offering reports on NGG, CLNE, OKE, and CNP which can be accessed for free by signing up to www.wallstequities.com/registration . WallStEquities.com scans the following stocks: National Grid PLC (NYSE: NGG), Clean Energy Fuels Corp. (NASDAQ: CLNE), ONEOK Inc. (NYSE: OKE), and CenterPoint Energy Inc. (NYSE: CNP). The Natural Gas Utility industry includes domestic companies that provide distribution service to residential, commercial, and industrial customers. Although company-specific issues influence operating results, wide variations in weather and swings in the economy also have an impact. All you have to do is sign up today for this free limited time offer by clicking the link below.\nwww.wallstequities.com/registration\nNational Grid\nLondon, the UK headquartered National Grid PLC's stock finished Wednesday's session 2.01% lower at $57.66. A total volume of 713,477 shares was traded, which was above their three months average volume of 529,170 shares. The Company's shares are trading 3.32% below their 50-day moving average. Additionally, shares of National Grid, which transmits and distributes electricity and natural gas, have a Relative Strength Index (RSI) of 35.14.\nOn December 19 th , 2017, research firm Macquarie upgraded the Company's stock rating from 'Neutral' to 'Outperform'. Get the full research report on NGG for free by clicking below at:\nwww.wallstequities.com/registration/?symbol=NGG\nClean Energy Fuels\nOn Wednesday, shares in Newport Beach, California headquartered Clean Energy Fuels Corp. recorded a trading volume of 887,413 shares. The stock ended the session 1.40% lower at $2.11. The Company's shares have advanced 1.93% since the last one week. The stock is trading 1.84% below its 50-day moving average. Moreover, shares of the Company, which provides natural gas as an alternative fuel for vehicle fleets in the US and Canada, have an RSI of 47.78.\nOn December 14 th , 2017, Clean Energy Fuels (CLNE) announced that it has been awarded a $3-million design, build, operation, and maintenance contract for a new, compressed natural gas (CNG) fueling station, which will serve both public and private customers. The City of Santa Fe, New Mexico has contracted with CLNE to build a CNG fueling station for its transit and refuse fleets as well as offering access to the public. Download our actionable research report on CLNE at:\nwww.wallstequities.com/registration/?symbol=CLNE\nONEOK\nTulsa, Oklahoma headquartered ONEOK Inc.'s shares closed the day 1.63% higher at $55.54. The stock recorded a trading volume of 2.54 million shares, which was higher than its three months average volume of 2.42 million shares. The Company's shares have gained 6.58% in the last month. The stock is trading 5.57% and 4.63% above its 50-day and 200-day moving averages, respectively. Additionally, shares of ONEOK, which engages in the gathering, processing, storage, and transportation of natural gas in the US, have an RSI of 70.86. Register for your free report coverage on OKE at:\nwww.wallstequities.com/registration/?symbol=OKE\nCenterPoint Energy\nShares in Houston, Texas-based CenterPoint Energy Inc. finished 0.21% lower at $27.96. The stock recorded a trading volume of 3.32 million shares, which was higher than its three months average volume of 2.62 million shares. The Company's shares have advanced 13.70% over the past one year. The stock is trading below its 200-day moving average by 2.37%. Furthermore, shares of the Company, which operates as a public utility holding company in the US, have an RSI of 37.26.\nOn December 04 th , 2017, research firm Guggenheim downgraded the Company's stock rating from 'Buy' to 'Neutral'.\nOn December 13 th , 2017, CenterPoint Energy announced that its Board of Directors declared a regular quarterly cash dividend of $0.2775 per share of common stock, payable on March 08 th , 2018, to shareholders of record at the close of business on February 15 th , 2018. This represents approximately a 4% increase from the previous quarterly dividend of $0.2675 and, if annualized, would equate to $1.11 per share. Get the free research report on CNP at:\nwww.wallstequities.com/registration/?symbol=CNP\n--\nWall St. Equities :\nWall St. Equities (WSE) produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. WSE has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below.\nWSE has not been compensated; directly or indirectly; for producing or publishing this document.\nPRESS RELEASE PROCEDURES :\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third-party research service company (the \"Reviewer\") represented by a credentialed financial analyst [for further information on analyst credentials, please email info@wallstequities.com . Rohit Tuli, a CFA® charterholder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on publicly available information which is believed to be reliable. Content is researched, written and reviewed on a reasonable-effort basis. The Reviewer has not performed any independent investigations or forensic audits to validate the information herein. The Reviewer has only independently reviewed the information provided by the Author according to the procedures outlined by WSE. WSE is not entitled to veto or interfere in the application of such procedures by the third-party research service company to the articles, documents or reports, as the case may be. Unless otherwise noted, any content outside of this document has no association with the Author or the Reviewer in any way.\nNO WARRANTY\nWSE, the Author, and the Reviewer are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted whatsoever for any direct, indirect or consequential loss arising from the use of this document. WSE, the Author, and the Reviewer expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in this document. Additionally, WSE, the Author, and the Reviewer do not (1) guarantee the accuracy, timeliness, completeness or correct sequencing of the information, or (2) warrant any results from use of the information. The included information is subject to change without notice.\nNOT AN OFFERING\nThis document is not intended as an offering, recommendation, or a solicitation of an offer to buy or sell the securities mentioned or discussed, and is to be used for informational purposes only. Please read all associated disclosures and ", "external_links": ["http://www.wallstequities.com/registration/?symbol=CLNE", "https://wallstequities.com/legal-disclaimer/", "http://www.wallstequities.com/registration/?symbol=CNP", "http://www.prnewswire.com/news-releases/this-mornings-research-reports-on-gas-utilities-stocks----national-grid-clean-energy-fuels-oneok-and-centerpoint-energy-300577504.html", "http://www.wallstequities.com/registration/?symbol=OKE", "http://www.wallstequities.com/registration/?symbol=NGG", "http://www.wallstequities.com/registration"], "published": "2018-01-04T14:40:00.000+02:00", "crawled": "2018-01-04T14:01:23.003+02:00", "highlightTitle": ""}