{"organizations": [], "uuid": "638cbd20bd3a0b85ea6ee5caf92455fd5fde1d6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 10, "shares": 10, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/06/22/102777308-GettyImages-495406485.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/after-hours-buzz-amd-ea-more.html", "country": "US", "domain_rank": 767, "title": "After-hours buzz: AMD, EA & more", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.996, "site_type": "news", "published": "2018-01-31T00:21:00.000+02:00", "replies_count": 0, "uuid": "638cbd20bd3a0b85ea6ee5caf92455fd5fde1d6a"}, "author": "Chloe Aiello", "url": "https://www.cnbc.com/2018/01/30/after-hours-buzz-amd-ea-more.html", "ord_in_thread": 0, "title": "After-hours buzz: AMD, EA & more", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Check out the companies making headlines after the bell Tuesday :\nAdvanced Micro Devices shares wobbled after the bell, plunging 6 percent before settling slightly up. The chipmaker reported fourth quarter financial results that beat analyst expectations on top and bottom lines, and also reported strong guidance. Where other companies have had to pay fees for tax reform, AMD said it received a one-time tax credit of $18 million.\nShares of AMD are up more than 25 percent year-to-date.\nShares of Electronic Arts jumped more than 6 percent in after hours trading. The video game company reported third quarter revenue of $1.97 billion, just missing analyst projections of $2.01 billion and also reported a one-time $176 million expense, due to tax reform. Despite the revenue miss, EA reported fourth quarter guidance that beat analyst expectations.\nShares of Illumina edged up about 1 percent in the extended session, after the the biotech company reported fourth quarter and fiscal 2017 financial results. Fourth quarter revenue increased by 26 percent year-over-year, and full year revenue by 17 percent, according to a filing.\nJuniper Networks stock fell more than 7 percent in extended trading. The networking hardware company reported fourth quarter earnings of $0.53 per share on revenue of $1.24 billion, just beating analyst expectations of $0.52 EPS on revenue of $1.23 billion.\nshow chapters Juniper shares slide on weak Q1 guidance 23 Hours Ago | 00:37 Juniper also released weak first quarter earnings and revenue guidance, attributing the disappointing outlook to reduced volume from product delays for its large cloud customers, according to a company filing.\nShares of Stryker lost more than 3 percent after the bell. The medical technology firm reported a fourth quarter loss, despite profitability in the year-ago quarter.\nShares of Stryker are up 8.7 percent year to date and 37.4 percent in the last 12 months.", "external_links": [], "published": "2018-01-31T00:21:00.000+02:00", "crawled": "2018-01-31T00:21:03.005+02:00", "highlightTitle": ""}