{"organizations": [], "uuid": "03940d6f7bcbda21a9af8483cfd7dcf83e233071", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-world-acceptance-corporation-names-jim-wanserski-interim-president-and-ceo.html", "country": "US", "domain_rank": 767, "title": "World Acceptance Corporation Names Jim Wanserski Interim President and CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T01:18:00.000+02:00", "replies_count": 0, "uuid": "03940d6f7bcbda21a9af8483cfd7dcf83e233071"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-world-acceptance-corporation-names-jim-wanserski-interim-president-and-ceo.html", "ord_in_thread": 0, "title": "World Acceptance Corporation Names Jim Wanserski Interim President and CEO", "locations": [], "entities": {"persons": [{"name": "wanserski", "sentiment": "none"}, {"name": "janet lewis matricciani", "sentiment": "none"}, {"name": "jim wanserski", "sentiment": "none"}, {"name": "ken bramlett", "sentiment": "none"}, {"name": "jim", "sentiment": "none"}], "locations": [{"name": "s.c.", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "greenville", "sentiment": "none"}], "organizations": [{"name": "world acceptance corporation names jim wanserski interim president", "sentiment": "negative"}, {"name": "world acceptance corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Accomplished executive with nearly four decades of leadership experience to serve company through transition\nGREENVILLE, S.C.--(BUSINESS WIRE)-- World Acceptance Corporation (NASDAQ: WRLD), one of the largest small-loan consumer finance companies in North America, today announced that its board of directors has appointed Jim Wanserski as interim president and chief executive officer effective immediately. Wanserski’s hiring follows an agreement between Janet Lewis Matricciani and the company that her role as president and CEO would terminate effective January 22, 2018 and she would resign as a board member on the same date. The board has initiated a search to identify a permanent replacement.\n“Jim has nearly four decades of executive leadership experience and we are grateful for his willingness to step in and provide us with a seamless transition until a permanent replacement is hired,” said Board Chair Ken Bramlett, Jr. “His business acumen, impeccable reputation and substantial experience in business transitions are attributes that will help us as we strive to enhance operational efficiencies and increase shareholder value.”\nThroughout his career, Wanserski has worked in telecommunications, technology and other industries. He served in executive, operations, regulatory and finance positions with MCI, Telecom*USA and Sprint. Prior to launching his consulting firm, Wanserski & Associates, he worked for a specialty telecom division within Arthur Andersen Business Consulting and a consulting firm, Morris-Anderson & Associates, Ltd.\n“I look forward to working closely with the board and World’s nearly 5,000 employees to assure our customers continue to receive the first-class loan experiences they expect and deserve,” said Wanserski. “My priority is to build upon the company’s recent successes and ongoing positive programs, while working with the board to identify and engage the best candidate.”\nWanserski’s interim executive engagements have included serving as chief operating officer in a project for a regional cellular firm preparing for a strategic sale; chief financial officer for a manufacturing company transitioning to a new owner; and senior vice president for a $1 billion division of a national telecom company. As an industry leading consultant, he has also worked with numerous clients, alliance partners and professional services firms throughout the country in directing and executing significant projects and executive assignments.\nAbout World Acceptance Corporation\nWorld Acceptance Corporation (NASDAQ: WRLD) is one of the largest small-loan consumer finance companies, operating 1,331 offices in 15 U.S. states and Mexico. For more information, visit www.loansbyworld.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006621/en/\nCookerly Public Relations\nCory Stewart, 404-816-2037\ncory@cookerly.com\nSource: World Acceptance Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.loansbyworld.com&esheet=51747182&newsitemid=20180122006621&lan=en-US&anchor=www.loansbyworld.com&index=1&md5=0d77dfc09ec8a885eca5878dccc4a771", "http://www.businesswire.com/news/home/20180122006621/en/"], "published": "2018-01-23T01:18:00.000+02:00", "crawled": "2018-01-23T02:15:17.009+02:00", "highlightTitle": ""}