{"organizations": [], "uuid": "609a441542dd5a0d669342b86edd8ef1e78f4bc2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219176501&w=1200&r=LYNXMPEE021BQ", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-ars-che-wilshere/wenger-happy-to-see-wilshere-proving-critics-wrong-idUKKBN1ES26R", "country": "US", "domain_rank": 408, "title": "Wenger happy to see Wilshere proving critics wrong", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T01:53:00.000+02:00", "replies_count": 0, "uuid": "609a441542dd5a0d669342b86edd8ef1e78f4bc2"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-ars-che-wilshere/wenger-happy-to-see-wilshere-proving-critics-wrong-idUKKBN1ES26R", "ord_in_thread": 0, "title": "Wenger happy to see Wilshere proving critics wrong", "locations": [], "entities": {"persons": [{"name": "wilshere", "sentiment": "positive"}, {"name": "wenger", "sentiment": "positive"}, {"name": "martyn herman", "sentiment": "none"}, {"name": "thibaut courtois", "sentiment": "none"}, {"name": "jack wilshere", "sentiment": "none"}, {"name": "arsene wenger", "sentiment": "none"}], "locations": [{"name": "bournemouth", "sentiment": "none"}, {"name": "chelsea - emirates stadium", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}], "organizations": [{"name": "reuters/john sibley", "sentiment": "none"}, {"name": "arsenal", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 57 PM / Updated an hour ago Wenger happy to see Wilshere proving critics wrong Martyn Herman 3 Min Read \nLONDON (Reuters) - Jack Wilshere can reclaim his place in the England squad for this year’s World Cup, Arsenal manager Arsene Wenger said after the midfielder ended a more than two-year wait for a top-flight goal on Wednesday. Soccer Football - Premier League - Arsenal vs Chelsea - Emirates Stadium, London, Britain - January 3, 2018 Arsenal's Jack Wilshere applauds fans after the match Action Images via Reuters/John Sibley \nThe injury-plagued 26-year-old midfielder, who last played for England in the humiliating defeat by Iceland at Euro 2016 and was loaned out to Bournemouth last season, opened the scoring in the 2-2 draw with Chelsea. \nHis finish, a thumping left-foot effort that flew past Thibaut Courtois and in off the post in the 63rd minute, continued a return to form for Wilshere whose last Premier League goal was in May ,2015. \nWilshere suffered a broken leg playing for Bournemouth in April and was a fringe player at Arsenal this season after recovering, but has started the last five league games. \n“I think he is at the level now where not many people expected him to be,” Wenger, who recently said he would allow Wilshere to leave to gain first-team football, told reporters. \n”When was the last time he played for England? Exactly, against Iceland (at Euro 2016), he came on. Since he has not played for England and I would say that means that everybody had given up on him. Soccer Football - Premier League - Arsenal vs Chelsea - Emirates Stadium, London, Britain - January 3, 2018 Arsenal manager Arsene Wenger reacts Action Images via Reuters/John Sibley \n“Today, nobody would be surprised if he was selected again. I think first of all he deserves a great credit for remarkable strength and we do as well.” \nWilsheres’s goal ended a 43-match run of Premier League games without one, although he was perhaps lucky to still be on the pitch after escaping a second yellow card for an apparent dive in the second half. \n“Fair to say I enjoyed that!” Wilshere said on Twitter and judging by the Arsenal fans’ reaction they also are delighted to see a player who was once tipped for the very top back to something approaching his best form. \nThe key now for Wilshere is to maintain his form for Arsenal and, most importantly, stay injury-free in a bid to convince England manager Gareth Southgate that he is worthy of seat on the plane to Russia in the summer. \nAlthough his priority is trying to get Arsenal back into the top four having slipped to sixth. \n“I’ve just got to keep working and take each game as they come I‘m happy and I’ve said it before, I just want to be playing games, I missed it so much going out on loan, I just want to be an Arsenal player,” Wilshere said. Reporting by Martyn Herman, editing by Ed Osmond", "external_links": [], "published": "2018-01-04T01:53:00.000+02:00", "crawled": "2018-01-04T02:21:23.011+02:00", "highlightTitle": ""}