{"organizations": [], "uuid": "3d98208096f2e3fce52d30ad4747bdcb447e695a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-icon-issues-financial-guidance-for-full-year-2018.html", "country": "US", "domain_rank": 767, "title": "ICON Issues Financial Guidance for Full Year 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-09T14:00:00.000+02:00", "replies_count": 0, "uuid": "3d98208096f2e3fce52d30ad4747bdcb447e695a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-icon-issues-financial-guidance-for-full-year-2018.html", "ord_in_thread": 0, "title": "ICON Issues Financial Guidance for Full Year 2018", "locations": [], "entities": {"persons": [{"name": "steve cutler", "sentiment": "none"}], "locations": [{"name": "dublin", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Highlights\nFull Year 2018 Revenue guidance in the range of $1,870 - $1,930 million, representing growth of 7 - 10%. Full Year 2018 Earnings per share guidance in the range of $5.89 - $6.09, representing growth of 10 – 13%.\nDUBLIN--(BUSINESS WIRE)-- ICON plc (NASDAQ: ICLR), a global provider of drug development solutions and services to the pharmaceutical, biotechnology and medical device industries, today announced its financial guidance for the year ended December 31, 2018. For the full year 2018 revenue will be in the range of $1,870 - $1,930 million, representing growth of 7 - 10% and earnings per share will be in the range of $5.89 - $6.09, representing growth of 10 - 13%.\nCEO Steve Cutler commented “We expect 2018 to be another strong year of revenue and earnings progression for ICON. The momentum created by our positive business win trends has helped diversify our business by adding new sponsors and partnerships across all customer segments. Consequently we expect revenue to grow by 7 - 10% to a range of $1,870 - $1,930 million whilst reducing our full year concentration of our largest customer to circa 12 – 14%. Furthermore, by leveraging our support infrastructure, we aim to continue our best in industry cost management approach and expect earnings per share to increase by 10 – 13% to a range of $5.89 - $6.09. In addition to this organic growth, we will continue to focus on deploying capital to maximise shareholder value through a combination of M&A and share repurchases.”\nThe full year 2018 financial guidance assumes:\nTop customer concentration to reduce to circa 12 - 14% of revenue from circa 18% in 2017. US dollar to Euro exchange rate of $1.20 (constant currency revenue growth of circa 7%). An effective tax rate of circa 12%. Circa $360 million of free cash flow and capital expenditures of circa $50 million. $25 million worth of shares repurchased in Q4 2017 from current up to $400 million repurchase programme contributing circa 3c to 2018 earnings. Remaining authorisation of up to $157 million to be executed opportunistically during 2018 depending on cash commitments to support M&A pipeline, no additional earnings benefit included in guidance.\nWith respect to 2017, the company confirmed its current guidance, of revenue in the range of $1,740 – $1,770 million and earnings in the range of $5.30 - $5.40.\nICON will be presenting at the JP Morgan Healthcare Conference on January 9 th at 9:30am PT (12:30pm EST, 5:30pm Ireland & UK). This presentation and follow-on Q&A can be accessed live from the ICON website at http://investor.iconplc.com . A recording will also be available on the website for 90 days following the call.\nThis press release contains forward-looking statements. These statements are based on management's current expectations and information currently available, including current economic and industry conditions. These statements are not guarantees of future performance or actual results, and actual results, developments and business decisions may differ from those stated in this press release. The forward-looking statements are subject to future events, risks, uncertainties and other factors that could cause actual results to differ materially from those projected in the statements, including, but not limited to, the ability to enter into new contracts, maintain client relationships, manage the opening of new offices and offering of new services, the integration of new business mergers and acquisitions, as well as economic and global market conditions and other risks and uncertainties detailed from time to time in SEC reports filed by ICON, all of which are difficult to predict and some of which are beyond our control. For these reasons, you should not place undue reliance on these forward-looking statements when making investment decisions. The word \"expected\" and variations of such words and similar expressions are intended to identify forward-looking statements. Forward-looking statements are only as of the date they are made and we do not undertake any obligation to update publicly any forward-looking statement, either as a result of new information, future events or otherwise. More information about the risks and uncertainties relating to these forward-looking statements may be found in SEC reports filed by ICON, including its Form 20-F, F-1, S-8 and F-3, which are available on the SEC's website at http://www.sec.gov .\nICON plc is a global provider of drug development solutions and services to the pharmaceutical, biotechnology and medical device industries. The company specialises in the strategic development, management and analysis of programs that support clinical development - from compound selection to Phase I-IV clinical studies. With headquarters in Dublin, Ireland, ICON currently, operates from 97 locations in 38 countries and has approximately 13,100 employees. Further information is available at www.iconplc.com .\nICON/ICLR-F\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180109005839/en/\nICON plc\nInvestor Relations\n1-888-381-7923\nor\nBrendan Brennan\nChief Financial Officer\n+ 353 –1-291-2000\nor\nJonathan Curtain\nVice President Corporate Finance and Investor Relations\n+1 215-616-3000\nSource: ICON plc", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov%2F&esheet=51739725&newsitemid=20180109005839&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=3&md5=b5ec0110c2cc4abd87cfabecc5864c0a", "http://www.businesswire.com/news/home/20180109005839/en/"], "published": "2018-01-09T14:00:00.000+02:00", "crawled": "2018-01-09T15:38:16.029+02:00", "highlightTitle": ""}