{"organizations": [], "uuid": "dc785048dd2d462a766dd58199b577767d4907d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221844918&w=1200&r=LYNXMPEE0D03L", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-federer/federer-says-he-should-not-be-favorite-at-36-idUSKBN1F305D", "country": "US", "domain_rank": 408, "title": "Federer says he should not be favorite at 36", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T07:29:00.000+02:00", "replies_count": 0, "uuid": "dc785048dd2d462a766dd58199b577767d4907d6"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-federer/federer-says-he-should-not-be-favorite-at-36-idUSKBN1F305D", "ord_in_thread": 0, "title": "Federer says he should not be favorite at 36", "locations": [], "entities": {"persons": [{"name": "mart", "sentiment": "negative"}, {"name": "federer", "sentiment": "negative"}, {"name": "aljaz bedene", "sentiment": "none"}, {"name": "herman", "sentiment": "none"}, {"name": "rafa nadal", "sentiment": "none"}, {"name": "roger federer", "sentiment": "none"}], "locations": [{"name": "slovenia", "sentiment": "none"}], "organizations": [{"name": "min read  melbourne", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 5:33 AM / Updated 16 hours ago Federer says he should not be favorite at 36 Martyn Herman 3 Min Read \nMELBOURNE (Reuters) - Roger Federer says a 36-year-old should not really be considered a favorite for the Australian Open, although when the man in question is himself, no one was taking him seriously. \nThe Swiss breezed through his media duties on Sunday with the same swagger he will take on court against Slovenia’s Aljaz Bedene on Tuesday, when he kicks off the defense of the title he won against great rival Rafa Nadal last year. \nThat unforgettable triumph ended a five-year hiatus in Federer’s grand slam collection and a few months later, he took his tally to a record-extending 19 by winning Wimbledon. \nFew would bet against him becoming only the fourth tennis player to reach 20 in two weeks time, although Federer was reluctant to accept the favorite’s tag. \n“With age, I feel like I play down my chances just because I don’t think a 36-year-old should be a favorite of a tournament, it should not be the case,” he told reporters. \n“That’s why I see things more relaxed, you know, at a later stage of my career.” \nFederer says the likes of six-times champion Novak Djokovic and Stan Wawrinka, both returning after lengthy injury breaks, could benefit from the same mindset he arrived with in Melbourne last year, when he was just back from a six-month hiatus. \n“This year I hope to win the first few rounds and get rolling, whereas last year it was more of a ‘let’s see what happens’ kind of tournament,” Federer, who is seeded second behind world number one Nadal, said. \n”Maybe similar to what Novak or Stan or others are going through this year. It’s like, let’s just see what happens. If you’re in the draw, you give yourself a chance. \n“That’s what happened for me last year. All ended up way better than I thought it would. Having no expectations was so nice after all these years always having expectations.” \nDespite being a year older Federer has higher expectations this year and says his build-up has been ‘perfect’. \nHe won all his four singles matches as he and Belinda Bencic helped Switzerland lift the Hopman Cup in Perth. \n“It was a great preparation last year. I think it’s going to be helpful again for me this year because the court plays exactly the same in Perth and here in Melbourne,” he said. \nFederer is bidding to win successive Australian Opens for the first time since 2006-07. Reporting by Martyn Herman; Editing by John O'Brien", "external_links": [], "published": "2018-01-14T07:29:00.000+02:00", "crawled": "2018-01-14T07:47:05.003+02:00", "highlightTitle": ""}