{"organizations": [], "uuid": "931709d3e57d3434cb67dabba168a0c5bebd9f0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/26/104799260-GettyImages-865248270.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/24/japan-tells-un-of-north-korean-tanker-suspected-of-sanctions-busting.html", "country": "US", "domain_rank": 767, "title": "Japan tells UN of North Korean tanker suspected of sanctions busting", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.019, "site_type": "news", "published": "2018-01-24T17:19:00.000+02:00", "replies_count": 0, "uuid": "931709d3e57d3434cb67dabba168a0c5bebd9f0e"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/24/japan-tells-un-of-north-korean-tanker-suspected-of-sanctions-busting.html", "ord_in_thread": 0, "title": "Japan tells UN of North Korean tanker suspected of sanctions busting", "locations": [], "entities": {"persons": [], "locations": [{"name": "east china sea", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "united nations", "sentiment": "negative"}, {"name": "un", "sentiment": "negative"}, {"name": "u.n. security council", "sentiment": "none"}, {"name": "foreign ministry", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}, {"name": "u.s. department of the treasury's office of foreign assets cont", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Taxes Japan tells UN of North Korean tanker suspected of sanctions busting Japan has told the United Nations about a North Korean tanker spotted in the East China Sea that it suspects was engaged in a transfer of goods with another tanker in defiance of U.N. sanctions, the Foreign Ministry said on Wednesday. The U.N. Security Council in December unanimously imposed new sanctions on North Korea for a recent intercontinental ballistic missile test, seeking to further limit its access to refined petroleum products and crude oil. Published 5 Hours Ago Kiyoshi Ota | Bloomberg | Getty Images Shinzo Abe, Japan's prime minister and president of the ruling Liberal Democratic Party (LDP). \nJapan has told the United Nations about a North Korean tanker spotted in the East China Sea that it suspects was engaged in a transfer of goods with another tanker in defiance of U.N. sanctions, the Foreign Ministry said on Wednesday. \nNorth Korea 's development of nuclear weapons and missiles capable of hitting the United States has spurred deepening U.N. Security Council sanctions and stoked fears of a military conflict. \nAccording to a statement issued by the Foreign Ministry, the North Korean-flagged tanker \"Rye Song Gang 1\" - blacklisted by the United Nations last month for carrying banned cargo - was spotted by a Japanese Maritime Self Defence Force patrol plane with the Dominican-flagged tanker \"Yuk Tung\" tied up beside it in the East China Sea on Saturday. \nThe two boats were lit up and some kind of activity was taking place, the Foreign Ministry said, adding that the Japanese government strongly suspected them of transferring goods in violation of the U.N. sanctions. Reuters A combination of photos, released by the U.S. Department of the Treasury's Office of Foreign Assets Control (OFAC), show what they describe as an attempt by North Korean ship Rye Song Gang 1 to conduct a ship-to-ship transfer, possibly of oil, in an effort to evade sanctions on October 19, 2017, in this pictures released in Washington, DC, U.S. on November 21, 2017. \nIt did not specify what goods it suspected were being transferred. The U.N. Security Council in December unanimously imposed new sanctions on North Korea for a recent intercontinental ballistic missile test, seeking to further limit its access to refined petroleum products and crude oil. \nThe ministry also said it appeared that the North Korean-flagged vessel, one of four additional vessels recently denied international port access by the United Nations for breaching sanctions, had disguised its name so that it read \"Song Hae.\" \n\"We have reported this to the U.N. and also given this information to other nations involved, including those connected to the Dominican tanker, expressing our concern,\" the ministry added. \nDiplomats from Dominica, a tiny Carribean island which suffered widespread damage in a hurricane in September, were not immediately available for comment. \nNorth Korea is developing missile and nuclear technology in defiance of international condemnation amid regular threats to destroy the United States, Japan and South Korea. \nBut tensions have eased with North Korea agreeing to take part in the Winter Olympics in the South next month. ", "external_links": [], "published": "2018-01-24T17:19:00.000+02:00", "crawled": "2018-01-24T19:02:52.023+02:00", "highlightTitle": ""}