{"organizations": [], "uuid": "31dfc7b089cc770e456c9266ecb1f09492a2566b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-enbridge-inc-to-host-a-joint-webcast-with-enbridge-income-fund-holdings-inc-enbridge-energy-partners-l-p-spectra-energy.html", "country": "US", "domain_rank": 767, "title": "Enbridge Inc. to Host a Joint Webcast with Enbridge Income Fund Holdings Inc., Enbridge Energy Partners, L.P. & Spectra Energy Partners, LP to Discuss 2017 Fourth Quarter and Year End Financial Results on February 16", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T00:38:00.000+02:00", "replies_count": 0, "uuid": "31dfc7b089cc770e456c9266ecb1f09492a2566b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-enbridge-inc-to-host-a-joint-webcast-with-enbridge-income-fund-holdings-inc-enbridge-energy-partners-l-p-spectra-energy.html", "ord_in_thread": 0, "title": "Enbridge Inc. to Host a Joint Webcast with Enbridge Income Fund Holdings Inc., Enbridge Energy Partners, L.P. & Spectra Energy Partners, LP to Discuss 2017 Fourth Quarter and Year End Financial Results on February 16", "locations": [], "entities": {"persons": [], "locations": [{"name": "calgary", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "enbridge inc.", "sentiment": "neutral"}, {"name": "enbridge", "sentiment": "neutral"}, {"name": "tsx", "sentiment": "neutral"}, {"name": "host", "sentiment": "neutral"}, {"name": "enbridge energy partners, l.p. & spectra energy partners", "sentiment": "neutral"}, {"name": "enbridge income fund holdings inc.", "sentiment": "neutral"}, {"name": "eep", "sentiment": "none"}, {"name": "l.p.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "spectra energy partners", "sentiment": "none"}, {"name": "enbridge energy partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CALGARY, Jan. 22, 2018 /PRNewswire/ - Enbridge Inc. (TSX, NYSE: ENB) (Enbridge) will host a joint conference call and webcast with Enbridge Income Fund Holdings Inc. (TSX: ENF), Enbridge Energy Partners, L.P. (NYSE: EEP) and Spectra Energy Partners, LP (NYSE: SEP) to provide an enterprise-wide business update and review 2017 fourth quarter and year end financial results on February 16, 2018 at 7:00 a.m. MT (9:00 a.m. ET).\nEnbridge and Enbridge Income Fund Holdings Inc. will announce fourth quarter earnings results before markets open on February 16, 2018, while Enbridge Energy Partners, L.P. and Spectra Energy Partners, LP will announce fourth quarter earnings results after markets close on February 15, 2018.\n2017 Fourth Quarter and Year End Earnings Webcast and Conference Call\nWhen:\nFriday, February 16, 2018\n7:00 a.m. MT (9:00 a.m. ET)\nWebcast:\nSign-up\nCall:\nDial-in # (Audio only – please dial in 10 minutes ahead):\nNorth America Toll Free:\n1 (877) 930-8043\nOutside North America:\n1 (253) 336-7522\nParticipant Passcode:\n4939158\nA webcast replay and podcast will be available approximately two hours after the conclusion of the event and a transcript will be posted to the company websites within approximately 24 hours after the event.\nReplay:\nAudio Replay # (Available for 7 days after call):\nNorth America Toll Free:\n1 (855) 859-2056\nOutside North America:\n1 (404) 537-3406\nReplay Passcode:\n4939158\nThe conference call format will include prepared remarks from the executive team followed by a question and answer session for the analyst and investor community only. Enbridge's media and investor relations teams will be available after the call for any additional questions.\nForward-Looking Statements Advisory\nThe conference call will cover each of Enbridge Inc., Enbridge Income Fund Holdings Inc., Enbridge Energy Partners, L.P. and Spectra Energy Partners, LP's (collectively, the Entities) most recent financial results and may contain forward-looking statements. When used in the call, words such as \"anticipate\", \"expect\", \"project\", and similar expressions are intended to identify such forward-looking statements. Although each of the Entities believes that its respective statements are or will be based on information and assumptions which are current, reasonable and complete, these statements are necessarily subject to a variety of risks and uncertainties pertaining to operating performance, regulatory parameters, economic conditions, commodity prices and other matters. You can find a discussion of those assumptions, risks and uncertainties in the Canadian securities law and/or American SEC filings for the applicable Entity. While each Entity makes its respective forward-looking statements in good faith, should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary significantly from those expected. Except as may be required by applicable securities laws, no Entity assumes any obligation to publicly update or revise any forward-looking statements made herein, on the call or otherwise, whether as a result of new information, future events or otherwise.\nAbout Enbridge Inc.\nEnbridge Inc. is North America's premier energy infrastructure company with strategic business platforms that include an extensive network of crude oil, liquids and natural gas pipelines, regulated natural gas distribution utilities and renewable power generation. The Company safely delivers an average of 2.8 million barrels of crude oil each day through its Mainline and Express Pipeline, and accounts for nearly 65% of U.S.-bound Canadian crude oil production, and moves approximately 20% of all natural gas consumed in the U.S. serving key supply basins and demand markets. The Company's regulated utilities serve approximately 3.5 million retail customers in Ontario, Quebec, New Brunswick and New York State. Enbridge also has interests in more than 2,500 MW of net renewable generating capacity, and an expanding offshore wind portfolio in Europe. The Company has ranked on the Global 100 Most Sustainable Corporations index for the past eight years; its common shares trade on the Toronto and New York stock exchanges under the symbol ENB.\nLife takes energy and Enbridge exists to fuel people's quality of life. For more information, visit www.enbridge.com .\nAbout Enbridge Income Fund Holdings Inc.\nEnbridge Income Fund Holdings Inc., through its investment in Enbridge Income Fund, indirectly holds high quality, low-risk energy infrastructure assets. Enbridge Income Fund's assets consist of a portfolio of Canadian liquids transportation and storage businesses, including the Canadian Mainline, the Regional Oil Sands System, the Canadian segment of the Southern Lights Pipeline, Class A units entitling the holder to receive defined cash flows from the US segment of the Southern Lights Pipeline, a 50 percent interest in the Alliance Pipeline, which transports natural gas from Canada to the U.S., and interests in more than 1,400 MW of renewable and alternative power generation assets. Enbridge Income Fund Holdings Inc. is a publicly traded corporation on the Toronto stock exchange under the symbol ENF; information about the company is available on its website at www.enbridgeincomefund.com .\nAbout Enbridge Energy Partners, L.P.\nEnbridge Energy Partners, L.P. owns and operates a diversified portfolio of crude oil transportation systems in the United States. Its principal crude oil system is the largest pipeline transporter of growing oil production from western Canada and the North Dakota Bakken formation. The system's deliveries to refining centers and connected carriers in the United States account for approximately 23 percent of total U.S. oil imports. Enbridge Energy Partners, L.P. is traded on the New York stock exchange under the symbol EEP; information about the company is available on its website at www.enbridgepartners.com .\nAbout Spectra Energy Partners, LP\nSpectra Energy Partners, LP is one of the largest pipeline master limited partnerships in the United States and connects growing supply areas to high-demand markets for natural gas and crude oil. These assets include more than 15,000 miles of transmission pipelines, approximately 170 billion cubic feet of natural gas storage, and approximately 5.6 million barrels of crude oil storage. Spectra Energy Partners, LP is traded on the New York stock exchange under the symbol SEP; information about the company is available on its website at www.spectraenergypartners.com .\nFOR FURTHER INFORMATION PLEASE CONTACT:\nMedia:\nSuzanne Wilton\nToll Free: (888) 992-0997\nEmail: suzanne.wilton@enbridge.com\nInvestment Community:\nEnbridge Inc.\nJonathan Gould\nToll Free: (800) 481-2804\nEmail: investor.relations@enbridge.com\nEnbridge Income Fund Holdings Inc. & Enbridge Energy Partners, L.P.\nAdam McKnight\nToll Free: (800) 481-2804\nEmail: investor.relations@enbridge.com\nSpectra Energy Partners, LP\nRoni Cappadonna\nToll Free: (800) 481-2804\nEmail: investor.relations@enbridge.com\nSOURCE Enbridge Inc.", "external_links": ["http://www.spectraenergypartners.com/", "http://www.enbridge.com/", "http://www.enbridgeincomefund.com/", "http://www.enbridgepartners.com/", "https://secure-web.cisco.com/1dKozvJdc4IfIkPmX_GCJRgCLVN-lYQvG1fiYamKQ3D8a3Vg5gYLNSOmLcM_WihxOvRnPP-z5k8_K-SxvAXoUA8REOy5u6ct92EvGbSVKTKQeaFpFuD2rlaTQEVvgb6pKjUyDQBsLe8B8fV8mzhS-NznNDvh-Vw73BhC-jkOqYhq-mItKGucnaq606pRTeNEaaXO3Roq6OE-LcX-lmWL-8yCEruvhfPvVzm543KFcrRsNTlyLZsz46AuiES_V_1uasTypQWBkwZ3F9n0EZA3sWazaF9uaRYXSHF1ZfP4HLfDZbLZRwPiuqQEXtwJJg7H2KB5R1Iea-yTHdJr9TGhA7g/https%3A%2F%2Fedge.media-server.com%2Fm6%2Fp%2Frudushbf"], "published": "2018-01-23T00:38:00.000+02:00", "crawled": "2018-01-23T02:18:56.012+02:00", "highlightTitle": ""}