{"organizations": [], "uuid": "c980a29334cd6a9a1daae3868de86a8654108af4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-lcg-elects-emerson-to-board.html", "country": "US", "domain_rank": 767, "title": "LCG Elects Emerson to Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.342, "site_type": "news", "published": "2018-01-31T17:30:00.000+02:00", "replies_count": 0, "uuid": "c980a29334cd6a9a1daae3868de86a8654108af4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-lcg-elects-emerson-to-board.html", "ord_in_thread": 0, "title": "LCG Elects Emerson to Board", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 31, 2018 /PRNewswire/ -- LCG Associates, Inc. a national, institutional investment consulting firm, elected David R. Emerson, CFA, CAIA to the firm's Board of Directors. Emerson has been with LCG since 2003.\n\"Dave's election to the Board is a reflection of his hard work, leadership, willingness to help others and dedication to our company,\" said Ed Johnson, President and CEO.\nEmerson is a Senior Vice President, Principal based in LCG's Seattle office. His responsibilities include lead client relationships with corporations, healthcare organizations, endowments and foundations. Emerson also conducts capital market and asset class research as well as investment manager due diligence. Additionally, Emerson serves on LCG's team focused on Nuclear Decommissioning Trusts (NDTs), which has developed proprietary modeling software that demonstrates the effects of different capital market, tax rate, and spending assumptions.\nPrior to joining LCG, Emerson worked in the investment consulting industry in a variety of roles from manager research to Consultant. Emerson is a CFA charterholder. He is an active member of the CFA Institute and CFA Society Seattle. He is also a Chartered Alternative Investment Analyst (CAIA) Charterholder. Emerson holds an M.B.A. in Finance from the Smith School of Business at the University of Maryland. He graduated from the University of Michigan with an A.B. in Political Science.\nAbout LCG Associates\nFounded in 1973, LCG Associates is a national, employee-owned investment consulting firm. As an independent company, the firm provides proactive, value-added consulting services and research to institutional and private clients. LCG is headquartered in Atlanta, Georgia with offices in Dallas, Texas and Seattle, Washington. For more information on LCG, please visit www.lcgassociates.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/lcg-elects-emerson-to-board-300590749.html\nSOURCE LCG Associates, Inc.", "external_links": ["http://www.lcgassociates.com/", "http://www.prnewswire.com/news-releases/lcg-elects-emerson-to-board-300590749.html"], "published": "2018-01-31T17:30:00.000+02:00", "crawled": "2018-01-31T18:48:46.000+02:00", "highlightTitle": ""}