{"organizations": [], "uuid": "23d2f1148f367bf8d3d5f7c98659c94fde957e63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-southern-company-announces-quarterly-dividend.html", "country": "US", "domain_rank": 767, "title": "Southern Company announces quarterly dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T22:35:00.000+02:00", "replies_count": 0, "uuid": "23d2f1148f367bf8d3d5f7c98659c94fde957e63"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-southern-company-announces-quarterly-dividend.html", "ord_in_thread": 0, "title": "Southern Company announces quarterly dividend", "locations": [], "entities": {"persons": [], "locations": [{"name": "atlanta", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "southern company", "sentiment": "negative"}, {"name": "nyse", "sentiment": "none"}, {"name": "about southern company southern company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 19, 2018 /PRNewswire/ -- Southern Company today announced a regular quarterly dividend of 58 cents per share on the company's common stock, payable March 6, 2018, to shareholders of record as of February 20, 2018. This marks 281 consecutive quarters – dating back to 1948 – that Southern Company will have paid a dividend to its shareholders that is equal to or greater than the previous quarter.\nAbout Southern Company\nSouthern Company (NYSE: SO) is America's premier energy company, with 46,000 megawatts of generating capacity and 1,500 billion cubic feet of combined natural gas consumption and throughput volume serving 9 million customers through its subsidiaries. The company provides clean, safe, reliable and affordable energy through electric operating companies in four states, natural gas distribution companies in seven states, a competitive generation company serving wholesale customers across America and a nationally recognized provider of customized energy solutions, as well as fiber optics and wireless communications. Southern Company brands are known for excellent customer service, high reliability and affordable prices that are below the national average. Through an industry-leading commitment to innovation, Southern Company and its subsidiaries are inventing America's energy future by developing the full portfolio of energy resources, including carbon-free nuclear, 21st century coal, natural gas, renewables and energy efficiency, and creating new products and services for the benefit of customers. Southern Company has been named by the U.S. Department of Defense and G.I. Jobs magazine as a top military employer, recognized among the Top 50 Companies for Diversity by DiversityInc, listed by Black Enterprise magazine as one of the 40 Best Companies for Diversity and designated a Top Employer for Hispanics by Hispanic Network. The company has earned a National Award of Nuclear Science and History from the National Atomic Museum Foundation for its leadership and commitment to nuclear development and is continually ranked among the top energy companies in Fortune's annual World's Most Admired Electric and Gas Utility rankings. Visit our website at www.southerncompany.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/southern-company-announces-quarterly-dividend-300585404.html\nSOURCE Southern Company", "external_links": ["http://www.prnewswire.com/news-releases/southern-company-announces-quarterly-dividend-300585404.html", "http://www.southerncompany.com/"], "published": "2018-01-19T22:35:00.000+02:00", "crawled": "2018-01-20T00:53:06.017+02:00", "highlightTitle": ""}