{"organizations": [], "uuid": "54f2bc3ae64f32d19ee75292b2e839003b9cbfa9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WU719_WORKFA_SOC_20180102074256.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7201.xml", "section_title": "WSJ.com: Lifestyle", "url": "https://www.wsj.com/articles/even-if-your-brand-new-job-is-a-bad-fit-dont-quit-1514906394", "country": "US", "domain_rank": 387, "title": "Even If Your Brand-New Job Is A Bad Fit, Don’t Quit", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T17:19:00.000+02:00", "replies_count": 0, "uuid": "54f2bc3ae64f32d19ee75292b2e839003b9cbfa9"}, "author": "Sue Shellenbarger", "url": "https://www.wsj.com/articles/even-if-your-brand-new-job-is-a-bad-fit-dont-quit-1514906394", "ord_in_thread": 0, "title": "Even If Your Brand-New Job Is A Bad Fit, Don’t Quit", "locations": [], "entities": {"persons": [{"name": "lori cheek", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "careerbuilder", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS You’re psyched for your first day on a new job—until you arrive and find your new colleagues miserable, the atmosphere stifling or the boss overbearing and obnoxious. \nIs it ever OK to quit on your first day ? Making a wise decision requires pausing for a moment. The key is to distinguish between challenges you should try to overcome and fundamental problems that are true deal breakers.\nMore new hires are heading for the exits fast, employers and career coaches say. Two-thirds of employees have taken a job only to realize later that it was a bad fit, and half of those employees quit within six months , says a recent CareerBuilder survey of 3,697 U.S. employees. Many young workers have two or three jobs listed on their résumés by age 30 and leave out those that lasted fewer than a few weeks.\nLori Cheek quit after a few days on a furniture-sales job several years ago. She was exhausted by dragging a suitcase loaded with heavy product manuals around New York City all day on the subway to meet with customers, then continuing to work at the office until 8 p.m. She snapped up what looked like a better sales job at a showroom nearby, selling stylish designer furnishings.\n“It was the worst decision ever,” Ms. Cheek says. Her supervisor on the first job, who had spent time training her, was deeply disappointed, and one manager on her new job pained her even more. “At first sight he could not stand the way I dressed. He wanted an Ann Taylor look, and I’m more Gwen Stefani, edgy,” Ms. Cheek says. She grudgingly toned down her jewelry, makeup and hair. To avoid earning a reputation as a job-hopper, however, she stuck with the new position for almost a year. Looking back, Ms. Cheek, owner of a free mobile dating app called Cheekd, wishes she’d stayed on the first job and tried to negotiate better terms and conditions.\nQuiz: Is Your Job an Instant Disaster? Photo: ISTOCK \nStarting a new job can be overwhelming. People under stress in situations that are uncertain or ambiguous tend to make decisions that are risky or unwise, according to a 2016 study by German researchers. \nQuitting abruptly risks earning bad references from former bosses and their contacts. It also may mean living without a paycheck for a while. \nRob Hill was dismayed two years ago to learn that he was expected as a manager of a new manufacturing plant to work the 5 a.m.-to-5 p.m. shift, plus several more hours—a fact he says hadn’t been clear to him during interviews. He quit after two days. After working long hours on similar jobs in the past, “I just didn’t want to hurt like that anymore,” Mr. Hill says. He had to live on his savings for a month, but he landed a more fulfilling position, as director of operations for a Denver community foundation.\nBefore resigning abruptly, new hires should ask themselves if they’re giving the job a fair chance. New employees’ behavior helps determine the amount of support they receive, according to a 2017 study of 273 new hires and 203 managers. Those who seem committed to the job and ask questions get more help from managers, says Allison Marie Ellis, the study’s lead author and an assistant professor of management and human resources at California Polytechnic State University in San Luis Obispo.\nHaving a new hire quit is costly for employers. It forces them to restart the hiring process and damages morale. Several people Julie Jansen hired and trained as recruiters on a previous job years ago quit after only one day. “It was devastating. You think you know if someone is a fit, and then they just disappear,” says Ms. Jansen, author of “I Don’t Know What I Want, But I Know It’s Not This,” a best-selling career book.\nIt isn’t wise to exit just because you don’t like the person next to you or have to do grunt work all day. If the boss is abrasive, push back a bit. One intern at a Wall Street financial-services firm whose boss seemed unduly brusque asked him, “Are you just having a bad day, or are you always like this?” says Rebecca Zucker, a career and executive coach at Next Step Partners in San Francisco. The intern not only survived the exchange but earned better treatment from the boss, Ms. Zucker says.\nQuitting early may be warranted if an employer tries a bait-and-switch—promising one job and assigning you to a different one, or violating other agreed-upon terms, says Chicago career coach Jody Michael. “If you’re told you’ll be reporting to the CEO, but in actuality there’s someone positioned between you and the CEO, that’s a problem,” Ms. Michael says.\nOne manager learned on his first day at an automotive company that his base pay would be cut in half under a new company compensation plan, says Carlos Kingwergs, Latin America regional director for AutoKineto, an international executive-search firm based in Columbia, S.C. The employer increased his bonus to make up for it, Mr. Kingwergs says, but the new hire quit, saying, “That’s not what I signed on for.”\nOther job seekers take a position because it’s their only offer, then exit after receiving an offer for their dream job that requires them to start right away, Ms. Michael says. That’s not an ideal path, but some opportunities are simply too good to refuse.\nWhatever the reason, it’s important to leave on as positive a note as possible, says Jill Tipograph, co-founder of Early Stage Careers, a New York City coaching service for recent college grads. Most employers won’t want to keep a new hire around if he or she gives two weeks’ notice right away. But ask if you can help with the transition in other ways, such as leaving notes on any work you’ve done. “First and last impressions are what people remember,” she says.\nMore From Work & Family \nWhen Your Child Won’t Hug the Relatives December 26, 2017 Sexual-Harassment Training Gets a Revamp December 19, 2017 The Tough Job of Playing Well With Colleagues November 28, 2017 Step Away From Your Over-Scheduled High School Student November 21, 2017 When Your Company Makes You Queasy November 14, 2017 Write to Sue Shellenbarger at sue.shellenbarger@wsj.com", "external_links": [], "published": "2018-01-02T17:19:00.000+02:00", "crawled": "2018-01-02T17:37:58.007+02:00", "highlightTitle": ""}