{"organizations": [], "uuid": "8593c4d6ce89dea27f1625a23938bb05c9485fb4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XB932_3myX0_TOP_20180119151420.jpg", "site_section": "http://online.wsj.com/xml/rss/3_7031.xml", "section_title": "WSJ.com: Markets", "url": "https://www.wsj.com/articles/why-retailers-dont-mind-bigger-wage-bills-1516546800", "country": "US", "domain_rank": 387, "title": "Why Retailers Don’t Mind Bigger Wage Bills", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T17:00:00.000+02:00", "replies_count": 0, "uuid": "8593c4d6ce89dea27f1625a23938bb05c9485fb4"}, "author": "Elizabeth Winkler", "url": "https://www.wsj.com/articles/why-retailers-dont-mind-bigger-wage-bills-1516546800", "ord_in_thread": 0, "title": "Why Retailers Don’t Mind Bigger Wage Bills", "locations": [], "entities": {"persons": [], "locations": [{"name": "america", "sentiment": "none"}], "organizations": [{"name": "walmart", "sentiment": "negative"}, {"name": "bank of america", "sentiment": "none"}, {"name": "american airlines", "sentiment": "none"}, {"name": "at&t", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "3 COMMENTS Last week, Walmart , WMT 0.28% America’s largest employer, announced plans to increase its minimum wage to $11 and provide a one-time cash bonus of $1,000 to eligible employees. It is one of nearly 200 companies, including major employers like American Airlines, AT&T , and Bank of America , to have given such bonuses, citing the lift from tax cuts.\nOne reason stocks have done so well during a fairly ho-hum economic expansion is that wages have risen only modestly relative to profits. When a business as labor-intensive as retail becomes more generous, investors might have cause for alarm.\nBut they can rest easy. Retailers, and certain ones in particular, are positioned to benefit from middle-class consumers with thicker wallets. On Thursday, Goldman Sachs upgraded its rating on Walmart to buy from neutral and added the company to its list of favorite stocks.\nAlthough the White House has praised the retailer’s generosity, the value of the tax cut to Walmart will be passed overwhelmingly to shareholders. According to Walmart, the total value of the bonuses will be $400 million. The company had pre-tax profits of $20.5 billion in fiscal 2017, with a tax rate of 30%. The new corporate tax rate of 21% means the bonuses amount to around 2% of the total value of the tax cut to Walmart over the next decade.\nIn terms of costs, though, wage pressures may be more substantial than bonuses in the long run. They aren’t so much a product of tax reform as a necessity of an increasingly tight market for unskilled labor. Despite a supposed retail apocalypse, demand for retail workers is high. As of November 2017, there were 711,000 such job openings—the highest number since the data was first collected in 2000, according to the National Retail Federation.\n“We’ve been waiting for a wage increase as the unemployment rate has come down,” says Jack Kleinhenz, chief economist of the National Retail Federation. “It’s probably just starting to percolate up.”\nTarget last fall announced it was raising its minimum wage to $11, with plans to establish a $15 minimum by 2020. Some cities and states have raised their minimum wages by law, taking the decision out of companies’ hands.\nThe net benefit of bigger paychecks and higher costs may be greatest for retailers like Walmart and Target and less so for, say, dollar stores or high-end shops. Companies may paint the bonuses and wage hikes as a boon for U.S. workers, but the real beneficiaries will be their shareholders.", "external_links": [], "published": "2018-01-21T17:00:00.000+02:00", "crawled": "2018-01-21T17:36:53.042+02:00", "highlightTitle": ""}