{"organizations": [], "uuid": "e33618e571ae81124a4723be7c25c349962048fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-five-oaks-investment-corp-announces-first-quarter-2018-common-stock-dividend-rate-of-0-point-0333-per-share-for-january.html", "country": "US", "domain_rank": 767, "title": "Five Oaks Investment Corp. Announces First 2018 Common Stock Dividend Rate of $0.0333 Per Share for January, February and March 2018 and Preferred Stock Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T00:30:00.000+02:00", "replies_count": 0, "uuid": "e33618e571ae81124a4723be7c25c349962048fa"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-five-oaks-investment-corp-announces-first-quarter-2018-common-stock-dividend-rate-of-0-point-0333-per-share-for-january.html", "ord_in_thread": 0, "title": "Five Oaks Investment Corp. Announces First 2018 Common Stock Dividend Rate of $0.0333 Per Share for January, February and March 2018 and Preferred Stock Dividend", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "five oaks investment corp.", "sentiment": "neutral"}, {"name": "five oaks investment corp", "sentiment": "neutral"}, {"name": "nyse", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 5, 2018 /PRNewswire/ -- Five Oaks Investment Corp. (NYSE: OAKS) (the \"Company\") today announced that its board of directors has declared monthly cash dividend rates for the first quarter of 2018 of $0.0333 per share of common stock for the months of January, February and March.\nFirst Quarter 2018 Common Stock Dividends\nMonth\nDividend\nRecord Date\nPayment Date\nJanuary 2018\n$0.0333\nJanuary 16, 2018\nJanuary 30, 2018\nFebruary 2018\n$0.0333\nFebruary 15, 2018\nFebruary 27, 2018\nMarch 2018\n$0.0333\nMarch 15, 2018\nMarch 29, 2018\nIn accordance with the terms of the 8.75% Cumulative Redeemable Preferred Stock (\"Series A Preferred Stock\") of the Company, the board of directors has also declared monthly cash dividend rates for the first quarter of 2018 of $0.1823 per share of Series A Preferred Stock:\nFirst Quarter 2018 Series A Preferred Stock Dividends\nMonth\nDividend\nRecord Date\nPayment Date\nJanuary 2018\n$0.1823\nJanuary 16, 2018\nJanuary 26, 2018\nFebruary 2018\n$0.1823\nFebruary 15, 2018\nFebruary 27, 2018\nMarch 2018\n$0.1823\nMarch 15, 2018\nMarch 27, 2018\nFive Oaks Investment Corp.\nFive Oaks Investment Corp. is a real estate investment trust focused with its subsidiaries on investing on a leveraged basis in mortgage and other real estate-related assets, particularly mortgage-backed securities and mortgage servicing rights. The Company's objective is to deliver attractive cash flow returns over time to its investors, primarily through dividends and secondarily through capital appreciation.\nFive Oaks Investment Corp. is externally managed and advised by Oak Circle Capital Partners LLC.\nForward-Looking Statements\nThis press release includes \"forward-looking statements\" within the meaning of the U.S. securities laws that are subject to risks and uncertainties. These forward-looking statements include information about possible or assumed future results of the Company's business, financial condition, liquidity, results of operations, plans and objectives. You can identify forward-looking statements by use of words such as \"believe,\" \"expect,\" \"anticipate,\" \"estimate,\" \"plan,\" \"continue,\" \"intend,\" \"should,\" \"may\" or similar expressions or other comparable terms, or by discussions of strategy, plans or intentions. Statements regarding the following subjects, among others, may be forward-looking: the return on equity; the yield on investments; the ability to borrow to finance assets; and risks associated with investing in real estate assets, including changes in business conditions and the general economy. Forward-looking statements are based on the Company's beliefs, assumptions and expectations of its future performance, taking into account all information currently available to the Company. Actual results may differ from expectations, estimates and projections and, consequently, you should not rely on these forward looking statements as predictions of future events. Forward-looking statements are subject to substantial risks and uncertainties, many of which are difficult to predict and are generally beyond the Company's control. Additional information concerning these and other risk factors are contained in the Company's most recent filings with the Securities and Exchange Commission, which are available on the Securities and Exchange Commission's website at www.sec.gov .\nAll subsequent written and oral forward-looking statements that the Company makes, or that are attributable to the Company, are expressly qualified in their entirety by this cautionary notice. Any forward-looking statement speaks only as of the date on which it is made. Except as required by law, the Company is not obligated to, and does not intend to, update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.\nAdditional Information and Where to Find It\nInvestors, security holders and other interested persons may find additional information regarding the Company at the SEC's Internet site at http://www.sec.gov/ or the Company website www.fiveoaksinvestment.com or by directing requests to: Five Oaks Investment Corp., 540 Madison Avenue, 19 th Floor, New York, NY 10022, Attention: Investor Relations.\nView original content with multimedia: http://www.prnewswire.com/news-releases/five-oaks-investment-corp-announces-first-quarter-2018-common-stock-dividend-rate-of-00333-per-share-for-january-february-and-march-2018-and-preferred-stock-dividend-300578202.html\nSOURCE Five Oaks Investment Corp.", "external_links": ["http://www.sec.gov/", "http://www.prnewswire.com/news-releases/five-oaks-investment-corp-announces-first-quarter-2018-common-stock-dividend-rate-of-00333-per-share-for-january-february-and-march-2018-and-preferred-stock-dividend-300578202.html", "http://www.fiveoaksinvestment.com/"], "published": "2018-01-06T00:30:00.000+02:00", "crawled": "2018-01-06T00:54:34.016+02:00", "highlightTitle": ""}