{"organizations": [], "uuid": "45af3de3354fc343510f2dab9e3c4207c7ea8d49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222122867&w=1200&r=LYNXMPEE0E0NX", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-spain-politics-catalonia/madrid-to-keep-direct-rule-of-catalonia-if-former-leader-reelected-pm-idUKKBN1F41B9", "country": "US", "domain_rank": 408, "title": "Madrid to keep direct rule of Catalonia if former leader reelected - PM", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T13:22:00.000+02:00", "replies_count": 0, "uuid": "45af3de3354fc343510f2dab9e3c4207c7ea8d49"}, "author": "", "url": "https://uk.reuters.com/article/uk-spain-politics-catalonia/madrid-to-keep-direct-rule-of-catalonia-if-former-leader-reelected-pm-idUKKBN1F41B9", "ord_in_thread": 0, "title": "Madrid to keep direct rule of Catalonia if former leader reelected - PM", "locations": [], "entities": {"persons": [{"name": "reuters/remo casilli", "sentiment": "none"}, {"name": "carles puigdemont", "sentiment": "none"}, {"name": "mariano rajoy", "sentiment": "none"}, {"name": "rajoy", "sentiment": "none"}, {"name": "paul day", "sentiment": "none"}, {"name": "sonya dowsett", "sentiment": "none"}], "locations": [{"name": "catalonia", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 11:24 AM / Updated an hour ago Madrid to maintain direct rule if self-exiled Catalan separatist reelected - PM Reuters Staff 3 Min Read \nMADRID (Reuters) - Spain rejected as absurd suggestions that Catalan separatist Carles Puigdemont could lead the region from exile if elected president by the new Catalan parliament, and said if he were chosen Madrid would maintain direct central rule. \nPuigdemont fled to Brussels in October after Prime Minister Mariano Rajoy fired him as Catalonia’s leader for declaring an independent republic following an illegal referendum. He faces arrest and possibly decades in jail if he returns to Spain. \nWith only days before Catalonia’s parliament convenes to elect a new regional government, separatists said Puigdemont was their candidate to lead the region again. \nThey are exploring the possibility he could do so by video link from Brussels. \nBut Rajoy, in a speech at his centre-right People’s Party (PP) Madrid headquarters, derided the idea and the Catalan parliament’s own legal advisory body said it was not possible without changing the law. \n“It’s absurd that someone aspires to be president of the Catalan regional government as a fugitive in Brussels - it’s a case of common sense,” Rajoy said Spanish Prime Minister Mariano Rajoy speaks during a southern European Union nations meeting in Rome, Italy January 10, 2018. REUTERS/Remo Casilli \nIf Puigdemont tried to attend the parliamentary vote for a new head of region from Brussels, the Spanish government would challenge his appearance immediately in the courts, he said. \nRajoy said if Puigdemont were re-elected, constitutional powers invoked by the government in October to impose direct rule on the region would continue to apply. \nRajoy called regional elections in December to try and resolve the political crisis that led to an exodus of companies from the region. \nHowever, the election returned a slim majority to parties favouring independence, raising the possibility of a renewed push for a split from Spain this year. \nThe parliament will meet for the first time on Jan. 17 to choose the committee that rules its day-to-day activities. A new leader could be voted in by parliament as early as Jan. 31. \nIts advisory body said in a non-binding report on Monday that parliament’s rules allowed a president to be appointed without them being present only in the event of “hospitalization, serious illness or an extended disability”. \nAny other reason would require a legal reform to parliament’s laws, it said. Reporting by Sonya Dowsett; Editing by Ingrid Melander and Ralph Boulton", "external_links": [], "published": "2018-01-15T13:22:00.000+02:00", "crawled": "2018-01-15T13:51:06.010+02:00", "highlightTitle": ""}