{"organizations": [], "uuid": "fc2f36a0f0a18379ea8f200fcfaa4fdc7e067d02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-majestic-oil-gas-announces-restructuring-initiative-to-accelerate-transformation.html", "country": "US", "domain_rank": 767, "title": "Majestic Oil & Gas Announces Restructuring Initiative to Accelerate Transformation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-19T16:13:00.000+02:00", "replies_count": 0, "uuid": "fc2f36a0f0a18379ea8f200fcfaa4fdc7e067d02"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-majestic-oil-gas-announces-restructuring-initiative-to-accelerate-transformation.html", "ord_in_thread": 0, "title": "Majestic Oil & Gas Announces Restructuring Initiative to Accelerate Transformation", "locations": [], "entities": {"persons": [{"name": "erwin vahlsing", "sentiment": "none"}], "locations": [{"name": "fl", "sentiment": "none"}, {"name": "bay harbor island", "sentiment": "none"}], "organizations": [{"name": "mjog", "sentiment": "none"}, {"name": "mj holdings group, inc.", "sentiment": "none"}, {"name": "majestic oil & gas, inc.", "sentiment": "none"}, {"name": "bakken acquisition", "sentiment": "none"}, {"name": "mj biotech, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bay Harbor Island, FL, Jan. 19, 2018 (GLOBE NEWSWIRE) -- Majestic Oil & Gas (MJOG OTC: Pink) today announced it is transitioning from a wholly owned oil and gas company to a holding group which will accommodate new acquisitions being completed. This restructuring initiative will accelerate its evolution from just an Oil company to a diversified holding group. Majestic Oil & Gas, Inc. (“MJOG”), with the completion of the acquisitions of Bakken Acquisition, MJ Holdings Group, Inc. and its wholly owned subsidiary MJ Biotech, Inc., has planned for its strategic growth into new and exciting market segments. In addition, in the coming weeks, Majestic will be filing for a name change to better reflect their mission and corporate objectives.\nWhile making the company more efficient, MJOG plans to increase investments in products and technologies that will fuel revenue growth, and drive more profitability for all its subsidiaries and businesses. Through this comprehensive initiative, the company plans to increase investments in its distribution of Dora™ .\nErwin Vahlsing, CEO, stated, “These actions will drive long-term change to further establish a strong revenue base, and increase shareholder value. I am confident that we’ll emerge as a more productive company with broader reach, and sharper execution. While making the company more efficient, MJOG plans to increase investments in the products and technologies that that will fuel revenue growth, and drive more profit from all its subsidiaries, and businesses. Through this comprehensive initiative, the company plans to increase investments in its distribution of Dora™ , as well.”\nDora™\nBakken Acquisition & Investments Corporation (Bakken) is pleased to announce DORA™ (Dissolved Oxygen Releasing Agent).\nDORA™ is one of the most effective yet economical bioremediation products for delivering dissolved oxygen (DO) to contaminated groundwater systems. DORA™ stimulates native heterotrophic bacteria to metabolize environmental contaminants such as gasoline, diesel, fuel oil, and certain organic solvents. During metabolism, such contaminants are ultimately transformed to carbon dioxide, water and microbial biomass. DORA™ is formulated to release DO slowly over 6 months or longer, and is economical relative to similar commercially available products.\nAbout MJ HOLDINGS GROUP INC .\nWith demand rising and the industry booming, legal marijuana operators and companies in the burgeoning cannabis industry are racing to develop new products and services, as well as acquiring land and other assets to enable the enhancement of drastically increasing revenue streams and production capabilities. MJ Holdings Group Inc. founded in 2013, was created to assist such companies as a management group and consulting firm helping growers as they rapidly expanded their operations into the hemp, cannabis and cannabinoid (CBD) sectors across the US.\nCBD is revolutionizing the global chronic pain management market and we have determined we can utilize our experience and market knowledge to take a leading market position in multiple countries as well. Given current marketplace dynamics, existing customer base and technology that we have access to, we plan to immediately roll out several new hemp and CBD initiatives. Additionally, it's important for our investors to know that we are diversified and not totally dependent on the cannabis space but have multiple complimentary revenue verticals.\nWe will be providing Turnkey Real-Estate Solutions for marijuana growers. We will also be providing turnkey operations for management and technology solutions.\nAbout MJ BIOTECH INC .\nWith CBD revolutionizing the global chronic pain management market, we have determined we can utilize our experience and market knowledge to take a leading market position in multiple countries.\nMJ Biotech (“MJB”) is a cure development company. Dedicated to unlocking the power of cannabinoid as a means to treat serious neurological and inflammatory disorders, MJB will be partnering with a major University to develop research for proprietary cannabinoid pharmaceuticals for treatment of serious disease and/or disorders in both human and animals which includes both neurological and inflammatory disorders, and to set up human clinical testing for THC, and other Cannabinoids. MJB will target pro drug technology that enables delivery of cannabinoids to the site of disease, and with documented studies on plant based THC.\nAbout ATC Holding, Inc.\nATC was established in January 2013, as a Florida based company founded from the legacy of the Staples Brothers, who from 1976 specialized in maximizing the holding capacity of a wide range of industrial vessels through recovery, recycling, or cleaning. These concepts were applied to other holding areas, such as industrial ponds and lagoons. Our patented machinery, equipment, tooling, and accessories have made us unique in the industry. ATC will take their proven techniques and equipment and make them even more effective and safer with the latest robotic and cobotic technologies. The Company was originally focused in the Southeast U.S. to serve the Pulp and Paper Industries. ATC are experts in providing problem-solving technologies and solutions for ponds and lagoons of all types, specializing in removal of dense and viscous material not easily removed by conventional methods. ATC has expanded its services to include working with industrial storage tank cleaning problems, particularly the removal of heavy residue from large diameter vessels. We have cleaning systems that can be used while the tank is still in operation, without the necessity for tank entry. Our patented “Soap Recovery Bucket” is the only portable system on the market capable of removing the valuable soap, and restoring lost capacity in a cost-effective manner. This creates a safer, more cost-effective solids removal. During outages, we provide equipment that slurries the sludge to return to use. We also grind up the material and send it down a vacuum system, to a waiting truck. For ATC to continue its profitability and growth, we will develop new markets and expand manufacturing and service capabilities over the next five years.\nSafe Harbor Statement:\nThe information posted in this release may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. You can identify these statements by use of the words \"may,\" \"will,\" \"should,\" \"plans,\" \"explores,\" \"expects,\" \"anticipates,\" \"continue,\" \"estimate,\" \"project,\" \"intend,\" and similar expressions. Forward-looking statements involve risks and uncertainties that could cause actual results to differ materially from those projected or anticipated. These risks and uncertainties include, but are not limited to, general economic and business conditions, effects of continued geopolitical unrest and regional conflicts, competition, changes in technology and methods of marketing, and various other factors beyond the Company's control.\nErwin Vahlsing, Jr. 888-808-4677 infomjog@otcopubco.com\nSource:Majestic Oil & Gas, Inc.", "external_links": [], "published": "2018-01-19T16:13:00.000+02:00", "crawled": "2018-01-19T18:20:42.000+02:00", "highlightTitle": ""}