{"organizations": [], "uuid": "1120efe523afe0bc19a0564f45e35d84ee827a7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219706955&w=1200&r=LYNXMPEE041AN", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-saudi-decree-economy/saudi-king-orders-new-monthly-payments-to-offset-cost-of-living-rise-state-tv-idUSKBN1EU254", "country": "US", "domain_rank": 408, "title": "Saudi king orders new monthly payments to offset cost of living rise: state TV", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T00:40:00.000+02:00", "replies_count": 0, "uuid": "1120efe523afe0bc19a0564f45e35d84ee827a7e"}, "author": "", "url": "https://www.reuters.com/article/us-saudi-decree-economy/saudi-king-orders-new-monthly-payments-to-offset-cost-of-living-rise-state-tv-idUSKBN1EU254", "ord_in_thread": 0, "title": "Saudi king orders new monthly payments to offset cost of living rise: state TV", "locations": [], "entities": {"persons": [{"name": "salman", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "yemen", "sentiment": "none"}], "organizations": [{"name": "state tv reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RIYADH (Reuters) - Saudi Arabia’s King Salman on Saturday ordered a monthly payment of 1,000 riyals ($267) to state employees over the next year in compensation for rising cost of living after the government hiked domestic gas prices and introduced value-added tax (VAT).\nIn a royal decree published by state news media, the king also ordered the payment of 5,000 riyals to military personnel serving at the front lines with Yemen where the kingdom is fighting a nearly three-year-old war.\nSaudi Arabia, the world’s top oil exporter, roughly doubled gasoline prices on Monday as part of a broad reform initiative aimed at diversifying its economy. A 5 percent VAT on a broad range of goods and services came into effect on the same day.\nThe new payment orders were an acknowledgment of “the increased burdens for some segments of the population following from the necessary measures which the state took to restructure the economy,” according to the decree.\nKing Salman directed the state to bear the burden of VAT in some situations, including special health and education services as well as the first purchase of a house that is valued at up to 850,000 riyals ($226,660). Allowances for students, retirees and social security recipients were also boosted.\nThe decree did not reveal the total cost of the new allowances, but it appeared to be considerably smaller than some past handouts by Saudi kings, and therefore unlikely to have much impact on economic growth or the state budget deficit.\nAbout 1.18 million Saudis are employed in the government sector and there are more than 1.23 million pensioners and beneficiaries of pension payments, the central bank says. That suggests a total package cost of about 23 billion riyals, according to Reuters calculations.\nThat compares to a projected 2018 deficit of 195 billion riyals, according to a budget plan released last month. A package of handouts marking King Salman’s accession to the throne in early 2015 was estimated to cost more than 100 billion riyals.\nSaudi Arabia will slow plans to eliminate subsidies for a wide range of energy products, according to a new long-term fiscal plan in the 2018 state budget.\n(This version of the story was refiled to add dropped budget deficit figure; paragraph 8)\nReporting by Stephen Kalin and Andrew Torchia; Editing by Chris Reese and Clarence Fernandez\n ", "external_links": [], "published": "2018-01-06T00:40:00.000+02:00", "crawled": "2018-01-06T00:53:25.003+02:00", "highlightTitle": ""}