{"organizations": [], "uuid": "146650e5a741fc3736cec0e5252e6b7fca3aa611", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219304494&w=1200&r=LYNXMPEE030OG", "site_section": "http://feeds.reuters.com/reuters/topNews\r", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-trump-welfare/trump-push-to-scale-back-welfare-programs-has-u-s-republicans-on-edge-idUSKBN1ET1AG", "country": "US", "domain_rank": 408, "title": "Trump push to scale back welfare programs has Republicans on edge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T14:09:00.000+02:00", "replies_count": 0, "uuid": "146650e5a741fc3736cec0e5252e6b7fca3aa611"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-welfare/trump-push-to-scale-back-welfare-programs-has-u-s-republicans-on-edge-idUSKBN1ET1AG", "ord_in_thread": 0, "title": "Trump push to scale back welfare programs has Republicans on edge", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "neutral"}, {"name": "richard cowan", "sentiment": "none"}, {"name": "susan cornwell", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}, {"name": "paul ryan", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - Emboldened by his victory in the passage of the biggest U.S. tax overhaul in decades, President Donald Trump now wants to rein in social welfare programs even though some Republicans are wary of tackling the volatile issue in a congressional election year.\nA White House-led drive to downsize government aid programs such as food stamps and housing subsidies would energize conservative campaign donors whose support Republicans are counting on ahead of the November elections where the party will fight to keep control of Congress.\nWhite House aides say Trump is eager to take on welfare. He has a willing partner in House of Representatives Speaker Paul Ryan, who has long had an interest in the issue.\nBut some Republicans believe Senate Majority Leader Mitch McConnell is lukewarm on the drive for revising welfare, which might face a difficult sell in the Senate where Republicans hold only a razor-thin 51-49 majority.\nDemocrats already are attacking Trump for identifying welfare changes as his top 2018 goal, saying they are designed to help pay for tax cuts whose benefits are skewed toward corporations and wealthy individuals and which will add an estimated $1.5 trillion to the debt over 10 years.\nTrump has summoned Republican congressional leaders to the Camp David presidential retreat in Maryland this weekend to discuss 2018 priorities, including welfare and a planned effort on infrastructure investment.\nConservative House Republicans are especially enthusiastic about a welfare overhaul. Freedom Caucus leader Mark Meadows and the caucus’ former leader, U.S. Representative Jim Jordan, have discussed it with Trump and are confident the Republican president backs their ideas, such as strengthening work requirements for food stamps.\n“He definitely gets it,” Jordan said.\nBut Republicans may need to tread carefully in seeking to reduce government aid programs that benefit some of Trump’s core supporters in poor, rural regions of the country.\nRepublican Representative Tom Cole said Congress had a lot on its plate in the early months of 2018, including must-pass budget legislation and he was unsure there would be the time - or political will in the Senate - to pass welfare legislation.\n“First things first,” Cole said, adding it might be better to lay the groundwork for debate over the issue than to try enacting changes this year.\nMeadows said he believed a welfare overhaul had strong support among Republican lawmakers but that “convincing Mitch McConnell and the Democrats are Herculean tasks.”\nFILE PHOTO: U.S. President Donald Trump arrives with Vice President Mike Pence and House Speaker Paul Ryan prior to celebrating with Congressional Republicans after the U.S. Congress passed sweeping tax overhaul legislation on the South Lawn of the White House in Washington, U.S., December 20, 2017. REUTERS/Carlos Barria/File Photo Other Republicans and interest groups such as the U.S. Chamber of Commerce and National Association of Manufacturers think 2018 would be better spent on infrastructure.\nTOUGHER THAN TAXES? Trump’s first major legislative victory - the tax bill - took until the end of 2017. But handing out tax breaks might be far easier than revamping welfare assistance that benefits millions of American families.\nLast year, there were more than 42 million people in nearly 21 million U.S. households receiving Supplemental Nutrition Assistance Program, or SNAP, benefits, which are known as food stamps, according to the U.S. Department of Agriculture.\nFILE PHOTO: U.S. President Donald Trump celebrates with Congressional Republicans after the U.S. Congress passed sweeping tax overhaul legislation, on the South Lawn of the White House in Washington, U.S., December 20, 2017. REUTERS/Carlos Barria/File Photo They cost taxpayers about $58 billion.\nTrump’s budget proposal last year called for cutting more than $192 billion from SNAP over a decade.\nThe president also proposed deep cuts to Temporary Assistance for Needy Families, which last year provided aid to 1.1 million families.\nDemocratic strategist Doug Thornell said a push on welfare could trigger a political backlash for Republicans from elderly and blue-collar voters in the November congressional elections.\nThornell said it may appeal to Trump’s political base “but few else. And the irony here is that it will be Trump’s base who will feel the brunt of these cuts.”\nRobert Doar, a poverty specialist at the conservative-leaning American Enterprise Institute who has been in contact with Trump administration officials about policy ideas, urged an incremental approach.\nAlthough Doar said he did not know what policies the administration would ultimately back, he said Trump could encourage people to get jobs by reducing the length of their qualification for government aid and imposing stricter reviews of their efforts to find work.\nHe said Congress could pass legislation cutting benefits for people who fail to make enough effort to find jobs or do volunteer work.\nSome have argued that food stamp beneficiaries, for example, already include a high rate of people who hold jobs but are unable to make ends meet.\nReporting by Richard Cowan and Susan Cornwell; Additional reporting by James Oliphant and Steve Holland; Editing by Peter Cooney\n ", "external_links": [], "published": "2018-01-04T14:09:00.000+02:00", "crawled": "2018-01-04T14:21:39.006+02:00", "highlightTitle": ""}