{"organizations": [], "uuid": "cd61f30972f5a35af2619d295a9d0dad66c31be2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180110.html", "section_title": "Archive News &amp; Video for Wednesday, 10 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-slavery-jeans-study/jeans-made-by-kids-people-forget-facts-when-buying-unethical-products-idUSKBN1EZ2I0", "country": "US", "domain_rank": 408, "title": "Jeans made by kids? People 'forget' facts when buying unethical products", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T02:57:00.000+02:00", "replies_count": 0, "uuid": "cd61f30972f5a35af2619d295a9d0dad66c31be2"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-slavery-jeans-study/jeans-made-by-kids-people-forget-facts-when-buying-unethical-products-idUSKBN1EZ2I0", "ord_in_thread": 0, "title": "Jeans made by kids? People 'forget' facts when buying unethical products", "locations": [], "entities": {"persons": [{"name": "rebecca reczek", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "neutral"}, {"name": "osu", "sentiment": "none"}, {"name": "ohio state university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Thomson Reuters Foundation) - Consumers who knowingly buy products that have been made unethically - using child labor or endangered trees - may cope by forgetting the truth about their origins, researchers said.\nIn an online study by Ohio State University (OSU) in the United States, people who were asked to put together an outfit with jeans made by children were much less likely to remember their origin than those who saw ethically sourced jeans.\n“It’s not necessarily a conscious decision by consumers to forget what they don’t want to know,” said Rebecca Reczek, the study’s co-author and associate professor of marketing at OSU.\n“It is a learned coping mechanism to tune out uncomfortable information because it makes their lives easier.”\nWith modern slavery in the global spotlight, retailers are coming under increasing regulatory and consumer pressure to ensure that products ranging from smartphones to cosmetics are free from exploitation.\nIn another study, OSU asked about 240 students to memorize the quality, price and source of six desks. They quickly forgot the origin of desks made from endangered rainforests, but not that of those produced from sustainable tree farms, it found.\n“You need to realize that this memory bias exists,” study co-author Daniel Zane said in a statement.\n“Don’t put something in your online shopping cart that you know was made unethically and say you’ll think about it. By the time you come back, there is a good chance you will have forgotten what troubled you in the first place.”\nStamping out slavery in supply chains is difficult, with multiple layers across various nations that source raw materials or create the final product, making it hard to spot abuse.\n“Consumers often don’t realize that convenient low-cost products such as fast-fashion garments are cheap for a reason,” Peter McAllister, head of the UK-based Ethical Trading Initiative (ETI), told the Thomson Reuters Foundation.\n“Too often, the savings come at the expense of workers making the product.”\nAn estimated 24.9 million people are victims of forced labor globally, and nearly one in 10 children around the world are victims of child labor, according to the International Labour Organization (ILO) and rights group Walk Free Foundation.\nHowever, the blame does not lie solely with consumers, said Caroline Robinson, head of Focus on Labour Exploitation (FLEX).\n“It is ultimately the responsibility of companies to know their supply chains, and to root out illegal and exploitative practices such as forced labor and modern slavery,” she said.\nReporting By Varsha Saraogi, Editing by Kieran Guilbert and Katy Migiro. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T02:57:00.000+02:00", "crawled": "2018-01-11T12:19:10.013+02:00", "highlightTitle": ""}