{"organizations": [], "uuid": "90bee5352e9e7cfe11d7d3efc32a6dccdd4264c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-wistron-india-apple/apple-supplier-wistron-nears-land-deal-in-india-sources-idUSKBN1FK13Y", "country": "US", "domain_rank": 408, "title": "Apple supplier Wistron nears land deal in India - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T11:41:00.000+02:00", "replies_count": 0, "uuid": "90bee5352e9e7cfe11d7d3efc32a6dccdd4264c1"}, "author": "", "url": "https://www.reuters.com/article/us-wistron-india-apple/apple-supplier-wistron-nears-land-deal-in-india-sources-idUSKBN1FK13Y", "ord_in_thread": 0, "title": "Apple supplier Wistron nears land deal in India - sources", "locations": [], "entities": {"persons": [], "locations": [{"name": "india", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}, {"name": "karnataka", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "wistron", "sentiment": "negative"}, {"name": "ict service management solutions", "sentiment": "none"}, {"name": "wistron corp", "sentiment": "none"}, {"name": "min read  mumbai", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI (Reuters) - Apple’s Taiwanese contract manufacturer Wistron Corp is close to finalizing a land deal in India’s tech hub of Bengaluru and the firm is likely to invest about $157 million to develop the site, two government officials told Reuters.\nICT Service Management Solutions, Wistron’s unit that assembles Apple’s low-cost iPhone SE in India, has been scouting for some 100 acres in and around Bengaluru, capital of the southern Indian state of Karnataka, said the sources, who are familiar with the matter but asked not to be named as they are not authorized to publicly discuss the plans.\nApple and Wistron declined requests for comment.\nSome of Wistron’s global executives and its India head met with the industries minister of Karnataka earlier this month and a deal on the land lease may be struck in a few weeks, said one of the officials.\nA Karnataka government body that deals with investment proposals did not immediately respond to requests for comment.\nWistron is likely to use at least a part of this land to set up new assembly lines for Apple, the sources said.\nA third source said Apple was likely to start assembling its iPhone 6s models in India via Wistron soon, as it looks to cut costs and diversify its production base beyond greater China.\nThe 6s models, launched more than two years ago, remain popular in emerging markets such as India as they are cheaper versus Apple’s newer iPhone 8 and iPhone X devices.\nICT has recently won federal approval to import machinery from China into India which may be used to set up fresh assembly lines for iPhones, the third source added.\nThe assembly of iPhone SE in India was a pilot to test waters and it is only logical the line would be expanded, a fourth source said, without giving any details.\nLocal assembly could help Apple save on import taxes, price phones cheaper and potentially widen its customer base in India, one of the world’s fastest growing smartphone markets, from just under 3 percent now.\nLast month, India raised import taxes on products like mobile phones and TVs, forcing Apple to raise prices for most iPhone models except SE. The move to make electronic imports more expensive is part of Prime Minister Narendra Modi’s ‘Make in India’ push to shore up local manufacturing and create jobs for millions. Ramping up local assembly or manufacturing will also help Apple cut escalating labor costs in China, where its biggest contract manufacturer Hon Hai Precision Industry Co, widely known as Foxconn, makes a bulk of iPhones and iPads.\nApple has been in talks with Indian government for months, seeking tax breaks and incentives to expand operations in the country.\nThe government has so far made no exceptions for Apple, but a rule easing foreign investment norms earlier this month makes it easier for the Cupertino, California-based company to open its flagship stores in India, analysts say.\nIndia is key to Apple’s ambitions for a bigger global market share as smartphone sales have slowed in more mature markets.\nReporting by Sankalp Phartiyal; Editing by Euan Rocha and Himani Sarkar\n ", "external_links": [], "published": "2018-01-31T11:41:00.000+02:00", "crawled": "2018-01-31T12:02:19.010+02:00", "highlightTitle": ""}