{"organizations": [], "uuid": "903b781f61de8f5b401caed3f0f28ed29518defc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets/asia", "section_title": "Asian Stock Market News | Reuters.com", "url": "https://www.reuters.com/article/china-stocks-midday/china-stocks-extend-rally-hong-kong-also-up-idUSL4N1OY1HN", "country": "US", "domain_rank": 408, "title": "China stocks extend rally; Hong Kong also up", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T12:19:00.000+02:00", "replies_count": 0, "uuid": "903b781f61de8f5b401caed3f0f28ed29518defc"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/china-stocks-midday/china-stocks-extend-rally-hong-kong-also-up-idUSL4N1OY1HN", "ord_in_thread": 0, "title": "China stocks extend rally; Hong Kong also up", "locations": [], "entities": {"persons": [], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "shenzhen", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "bbmg corp", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}, {"name": "tianjin capital environmental protection group", "sentiment": "none"}, {"name": "anhui leimingkehua co ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 4:19 AM / Updated 26 minutes ago China stocks extend rally; Hong Kong also up Reuters Staff 3 Min Read \nSHANGHAI, Jan 3 (Reuters) - China and Hong Kong stocks rose further on Wednesday. \n** At 04:02 GMT, the Shanghai Composite index was up 30.46 points or 0.91 percent at 3,378.79. ** China’s blue-chip CSI300 index was up 1.24 percent. The financial sector sub-index was 1.1 percent higher, the consumer staples sector was up 1.67 percent, the real estate index was up 1.69 percent and healthcare sub-index was up 0.77 percent. ** Chinese H-shares listed in Hong Kong rose 0.5 percent at 12,129.07, while the Hang Seng Index was up 0.33 percent at 30,615.75. ** The smaller Shenzhen index was up 0.85 percent and the start-up board ChiNext Composite index was 1.11 percent higher. ** Around the region, MSCI’s Asia ex-Japan stock index was up 0.37 percent, while Japan’s Nikkei index was down 0.08 percent . ** The yuan was quoted at 6.5057 per dollar, 0.17 percent weaker than the previous close of 6.4949. ** The largest percentage gainers in the main Shanghai Composite index were Anhui Leimingkehua Co Ltd, up 10.03 percent, followed by Bbmg Corp, and Tianjin Capital Environmental Protection Group Co Ltd, which were both up by 10.02 percent. ** The largest percentage losses in the Shanghai index were registed by Jiangsu Protruly Vision Technology Group Co Ltd ,down 5.01 percent, followed by BOCO Inter-Telecom Co Ltd , which lost 4.98 percent. ** The top gainers among H-shares were Byd Co Ltd, which was up 2.8 percent, while China Pacific Insurance Group Co Ltd gained 2.08 percent and China Communications Construction Co Ltd rose 1.98 percent. ** The three biggest H-shares percentage decliners were PetroChina Co Ltd, which fell 1.25 percent, Guangzhou Automobile Group Co Ltd, down 1.1 percent, and Dongfeng Motor Group Co Ltd, which was down 1.0 percent. ** About 13.01 billion shares have traded so far on the Shanghai exchange, roughly 85.4 percent of the market’s 30-day moving average of 15.25 billion shares a day. The volume traded was 20.23 billion during the last full trading day. ** As of 04:02 GMT, China’s A-shares were trading at a premium of 28.99 percent over the Hong Kong-listed H-shares. ** The Shanghai stock index is above its 50-day moving average and above its 200-day moving average. ** The price-to-earnings ratio of the Shanghai index was 15.07 as of the last full trading day while the dividend yield was 1.9 percent. ** So far this week, the market capitalisation of the Shanghai stock index has risen by 1.40 percent to 29.30 trillion yuan. ** In Hong Kong, the sub-index for energy shares on the Hang Seng rose 0.1 percent while the IT sector rose 1.4 percent. The top gainer on Hang Seng was Hengan International Group Company Ltd with a rise of 3.17 percent, while the biggest loser was Want Want China Holdings Ltd which was down 1.87 percent. Reporting by Samuel Shen and John Ruwitch; Editing by Simon Cameron-Moore", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-03T12:19:00.000+02:00", "crawled": "2018-01-03T06:44:49.008+02:00", "highlightTitle": ""}