{"organizations": [], "uuid": "056fc72ddf9e89ee5c9f297e7fbdc0f571a90b25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INcricketNews", "section_title": "Reuters: Cricket News", "url": "https://in.reuters.com/article/cricket-test-zaf-ind/cricket-wasteful-india-let-proteas-off-the-hook-in-second-test-idINL3N1P908B", "country": "US", "domain_rank": 408, "title": "Cricket-Wasteful India let Proteas off the hook in second test", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T12:22:00.000+02:00", "replies_count": 0, "uuid": "056fc72ddf9e89ee5c9f297e7fbdc0f571a90b25"}, "author": "", "url": "https://in.reuters.com/article/cricket-test-zaf-ind/cricket-wasteful-india-let-proteas-off-the-hook-in-second-test-idINL3N1P908B", "ord_in_thread": 0, "title": "Cricket-Wasteful India let Proteas off the hook in second test", "locations": [], "entities": {"persons": [{"name": "faf du plessis", "sentiment": "none"}, {"name": "lokesh rahul", "sentiment": "none"}, {"name": "murali vijay", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "wasteful india", "sentiment": "none"}, {"name": "pretoria", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "pretoria", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 10:25 AM / in 3 hours Cricket-Wasteful India let Proteas off the hook in second test Reuters Staff 3 Min Read \nPRETORIA, Jan 14 (Reuters) - Wasteful India laboured in the field on the second morning of the second test against South Africa before bowling out their hosts for 335 just before lunch in Pretoria on Sunday. \nThe tourists faced a single over before the break and came through unscathed at four without loss for what they will consider a satisfactory session that might have brought much more reward. \nOpeners Murali Vijay (four) and Lokesh Rahul will resume in the afternoon on a slow wicket that is uncharacteristic of the venue, but will provide bounce and is likely to quicken up over the next two days. \nAfter South Africa resumed their innings on 269-6, India dropped four catches, including captain Faf du Plessis (63), letting the home side off the hook and allowing them to post a respectable first innings score. \nAs on day one, India’s tight lines in the opening hour made scoring difficult for the batsmen as South Africa managed just 23 runs in that period. \nKeshav Maharaj (18) was the first out when he edged Mohammed Shami to wicketkeeper Parthiv Patel, the 100th wicket in test cricket for the seamer. \nKagiso Rabada (11) then hung around for almost 12 overs with Du Plessis, adding 42 for the eighth wicket. \nHowever, India will be frustrated at four spurned chances to end the partnership early, including the rarity of three dropped catches in two balls, all off spinner Ravichandran Ashwin (4-113). \nRabada was missed by India skipper Virat Kohli at slip, and the next ball spooned a simple chance to point. \nHardik Pandya was put off by an onrushing Shami from short third-man though, and spilled the effort onto the latter, who also had a bite at the ball before it dropped to the floor. \nAshwin then induced a thin edge off Du Plessis that was spilled by Parthiv as the frustration grew for the visitors. \nSouth Africa profited with what could be crucial first innings runs through this period, before Rabada was superbly caught by, ironically, Pandya at deep mid-wicket as he attempted a hook off the excellent Ishant Sharma (3-46). \nFrom then on India were efficient in wrapping up the innings as Ishant bowled Du Plessis when the South African skipper looked to attack a straight delivery, before Ashwin had Morne Morkel (6) caught at deep cover by Vijay off Ashwin. \nSouth Africa lead the three-test series 1-0 after a 72-run victory in Cape Town in the opening fixture. (Reporting By Nick Said; Editing by John O‘Brien)", "external_links": [], "published": "2018-01-14T12:22:00.000+02:00", "crawled": "2018-01-14T16:02:35.009+02:00", "highlightTitle": ""}