{"organizations": [], "uuid": "9eeef995737d437ce5d685fdddcb3638b29a7b77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-axcella-announces-appointment-of-david-epstein-former-ceo-of-novartis-pharmaceuticals-as-chairman-of-its-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Axcella Announces Appointment of David Epstein, Former CEO of Novartis Pharmaceuticals, as Chairman of its Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T15:30:00.000+02:00", "replies_count": 0, "uuid": "9eeef995737d437ce5d685fdddcb3638b29a7b77"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-axcella-announces-appointment-of-david-epstein-former-ceo-of-novartis-pharmaceuticals-as-chairman-of-its-board-of-directors.html", "ord_in_thread": 0, "title": "Axcella Announces Appointment of David Epstein, Former CEO of Novartis Pharmaceuticals, as Chairman of its Board of Directors", "locations": [], "entities": {"persons": [{"name": "david epstein", "sentiment": "negative"}, {"name": "axcella", "sentiment": "negative"}, {"name": "david r. epstein", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "epstein", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "san francisco cambridge", "sentiment": "none"}], "organizations": [{"name": "novartis pharmaceuticals", "sentiment": "negative"}, {"name": "j.p. morgan healthcare conference", "sentiment": "negative"}, {"name": "axcella health", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Axcella also to present a corporate update at the 36 th Annual J.P. Morgan Healthcare Conference in San Francisco\nCAMBRIDGE, Mass.--(BUSINESS WIRE)-- Axcella Health , a biotechnology company pioneering Designed Amino Acid Compositions (DAAC™) as therapeutics across a range of important diseases, announced today that David R. Epstein has been elected as Chairman of its Board of Directors. Mr. Epstein is an Executive Partner at Flagship Pioneering. Axcella also announced today that the company will be presenting a corporate update at the 36 th Annual J.P. Morgan Healthcare Conference, January 8-11, 2018 in San Francisco, CA. The presentation will take place on Tuesday, January 9 at 9:30 AM PT.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180103005550/en/\nDavid R. Epstein (Photo: Business Wire)\n“David is a tremendous and very timely addition to our Board of Directors, bringing over 25 years of drug development and commercialization experience from one of the world’s most successful pharmaceutical companies,” commented Dr. Noubar Afeyan, outgoing Chairman and Co-Founder of Axcella and CEO of Flagship Pioneering. “I look forward to working closely with David and the Axcella team on this truly pioneering platform with the potential to impact so many lives.”\n“Axcella has made impressive progress advancing its DAAC candidates for the multifunctional modulation of essential biological pathways into the clinic and is ready to enter an accelerated growth phase,” commented David Epstein. “I look forward to being part of the effort in making this new class of innovative medicines available to patients.”\nRobert Connelly, CEO of Axcella commented, “Our Axcellerator™ platform has produced a robust pipeline of DAAC candidates that address multiple indications, including liver, muscle and CNS diseases. David’s leadership will help us to advance our pipeline and prioritize the wealth of additional program opportunities the Axcellerator platform offers. I am very grateful for Noubar’s board leadership, and look forward to his continued contributions to Axcella, especially through the Board’s Science and Technology committee.”\nDavid R. Epstein is executive partner at Flagship Pioneering and executive chairman of Flagship-founded Rubius Therapeutics. Most recently, he served as chief executive officer of Novartis Pharmaceuticals, a division of Novartis AG, from 2010 to mid-2016. Previously, David started up and led Novartis’ Oncology and Molecular Diagnostic units. Under his leadership the company’s oncology business grew to the second largest in the world. David has more than 25 years of extensive global-scale drug development, deal making, commercialization and leadership experience. Over the course of his career he led the development and commercialization of over 30 new molecular entities, including major breakthroughs such as Glivec®, Tasigna®, Gilenya®, Cosentyx® and Entresto®. He was recently named by FierceBiotech as one of the “25 most influential people in biopharma.”\nAdditional details of the J.P. Morgan Healthcare Conference presentation are as follows:\nPresenter:\nRobert Connelly, President and CEO, Axcella Health Room Location:\nElizabethan D Date/Time:\nTuesday, January 9, 2018, 9:30 – 10:00 AM PT About Axcella Health\nAxcella has pioneered a new therapeutic class – Designed Amino Acid Compositions (DAAC™) based on the recognition that complicated multifactorial diseases, where numerous cellular networks are involved, require multifunctional treatments. Our DAAC Therapeutics leverage the diversity and synergy of amino acid biology to restore health across a network of dysregulated pathways, and provide a differentiated tolerability profile for patients with complex disease. With our Axcellerator™ platform, we are transforming traditional drug discovery and development by generating patient data in less than a year from indication selection. This platform has already produced a rich pipeline of product candidates in programs that include liver, muscle, CNS and other target indications. The company was originated within Flagship’s VentureLabs® innovation foundry and has been financed with $139 million to date. www.axcellahealth.com\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180103005550/en/\nMedia Contact\nMacDougall Biomedical Communications\nStefanie Tuck, 781-235-3060\nstuck@macbiocom.com\nor\nCompany Contact\nAxcella Health\nIvana Magovčević-Liebisch, 857-320-2204\niliebisch@axcellahealth.com\nSource: Axcella Health", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.axcellahealth.com%2F&esheet=51736900&newsitemid=20180103005550&lan=en-US&anchor=Axcella+Health&index=1&md5=a4b385a080ebd466cf84c534b3161b96", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.axcellahealth.com&esheet=51736900&newsitemid=20180103005550&lan=en-US&anchor=www.axcellahealth.com&index=2&md5=4e4b63bc8ee68f70bf115f422fcb22d9", "http://www.businesswire.com/news/home/20180103005550/en/"], "published": "2018-01-03T15:30:00.000+02:00", "crawled": "2018-01-03T17:08:45.025+02:00", "highlightTitle": ""}