{"organizations": [], "uuid": "d1945f6cdc4e4f3acfce47b746076f30b61ceace", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2012/02/11/5288938-gold-bars-nuggets2-ap.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/22/gold-focuses-on-weak-dollar-stocks-surge-as-us-government-shutdown-ends.html", "country": "US", "domain_rank": 767, "title": "Gold focuses on weak dollar; stocks surge as US government shutdown ends", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T04:38:00.000+02:00", "replies_count": 0, "uuid": "d1945f6cdc4e4f3acfce47b746076f30b61ceace"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/22/gold-focuses-on-weak-dollar-stocks-surge-as-us-government-shutdown-ends.html", "ord_in_thread": 0, "title": "Gold focuses on weak dollar; stocks surge as US government shutdown ends", "locations": [], "entities": {"persons": [], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "european central bank", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "jp morgan asset management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Gold prices rose on Tuesday as the dollar weakened to near three-year lows, but an end to the uncertainty created by a three-day U.S. government shutdown capped gains.\nGold was mostly unaffected by the shutdown in the previous session, trading in a tight range. Spot gold rose 0.48 percent to a near one-week high of $1,340.08 per ounce at 3:29 EST, while U.S. gold futures for February delivery climbed 0.59 percent to $1,339.80 per ounce.\n\"Dollar is mostly weakening and that has continued to be the number one supporter of gold,\" FOREX.com analyst Fawad Razaqzada said, adding that the robust performance of the euro and the pound had pushed gold higher in recent weeks.\nshow chapters JP Morgan Asset Management: Bigger shift in monetary policy this year will come from the ECB 7:24 AM ET Mon, 22 Jan 2018 | 01:26 The U.S. government shutdown had impacted the dollar , but was largely ignored by gold, Razaqzada said. The dollar index , which measures the greenback against a basket of six major currencies, marginally lower and near a three-year low hit last week. A weaker greenback makes dollar-denominated assets such as gold cheaper for holders of other currencies.\nThe U.S. Senate voted on Monday to pass a temporary spending plan through Feb. 8 to end the government shutdown. Equity markets have since gained, with Wall Street's main indexes surging to record highs.\nGold should see a first support level of $1,331 an ounce, with initial resistance expected at the recent highs of $1,343 and closely followed by the psychological $1,350 mark, said MKS PAMP Group trader Tim Brown in note. \"A consolidation above that level could be the signal for a push higher,\" he said.\nThe market is also keeping an eye on an expected interest rate increase in March, which could present risk to gold. \"The anticipation of a March hike could act as additional weight for gold, although given this is now largely anticipated, the downside risks should be limited and gold's reaction function is likely to be asymmetric,\" UBS said in a note.\nThe U.S. economy is likely to grow in 2018 at its fastest pace in three years, fueled by the biggest tax overhaul since the 1980s, according to a Reuters poll of more than 100 economists indicated. Economic growth in the world's largest economy would increase the likelihood of interest rate increase and dent the appeal of non-interest yielding bullion.\nPlatinum recovered up 1.01 percent to $1,005 per ounce after falling from a more than four-month high touched in the previous session.\nIn other precious metals, silver rose 0.2 percent to $17.04 per ounce. Palladium was down 0.5 percent at $1,092.70 per ounce.", "external_links": [], "published": "2018-01-23T04:38:00.000+02:00", "crawled": "2018-01-23T06:03:13.088+02:00", "highlightTitle": ""}