{"organizations": [], "uuid": "e48f437da2e00526a718e6a26113e35ce1aaebef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/africa-factors/african-markets-factors-to-watch-on-jan-23-idUSL4N1PI2TU", "country": "US", "domain_rank": 408, "title": "African Markets - Factors to watch on Jan. 23", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.984, "site_type": "news", "published": "2018-01-23T14:46:00.000+02:00", "replies_count": 0, "uuid": "e48f437da2e00526a718e6a26113e35ce1aaebef"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/africa-factors/african-markets-factors-to-watch-on-jan-23-idUSL4N1PI2TU", "ord_in_thread": 0, "title": "African Markets - Factors to watch on Jan. 23", "locations": [], "entities": {"persons": [{"name": "oando", "sentiment": "none"}, {"name": "jacob zuma", "sentiment": "none"}], "locations": [{"name": "nigeria", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "bank of japan", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The following company announcements, scheduled economic indicators, debt and currency market moves and political events may affect African markets on Tuesday. - - - - - GLOBAL MARKETS Asian stocks advanced on Tuesday after U.S. senators struck a deal to end a three-day government shutdown, sending Wall Street's main indexes to record highs, while the dollar inched down against the yen after the Bank of Japan kept policy steady. WORLD OIL PRICES Oil prices rose on Tuesday, lifted by healthy economic growth as well as the ongoing supply restraint by a group of exporters around OPEC and Russia. EMERGING MARKETS For the top emerging markets news, double click on AFRICA STOCKS For the latest news on African stocks, click on SOUTH AFRICA MARKETS South Africa's rand rose to its highest in more than two years on Monday amid growing expectations that scandal-tarnished President Jacob Zuma would soon be ousted, while emerging-market equities pushed to another near-decade high. NIGERIA OIL Nigerian oil company Oando said on Monday it had settled a squabble with a key shareholder and was working on resolving remaining shareholder disputes and getting a suspension of its shares lifted. NIGERIA CURRENCY Nigeria's central bank said on Monday it had injected $210 million into the interbank foreign exchange market, extending efforts to boost liquidity and alleviate dollar shortages. KENYA MARKETS The Kenyan shilling was stable against the dollar on Monday after the central bank held the key lending rate at 10 percent. KENYA SUPERMARKET A Kenyan court on Monday granted Nakumatt Supermarkets protection from its creditors, allowing what was once Kenya's biggest retailer to go into voluntary administration. LIBERIA POLITICS George Weah, the former international soccer star who won the presidency of Liberia last month, promised a crackdown on endemic corruption as he was sworn in on Monday in the country's first peaceful change of power in seven decades. SOUTH AFRICA ESKOM South Africa's Eskom will ask local banks to reopen lending facilities that were suspended last year, its spokesman said on Monday, as the state utility seeks to drag itself out of a crisis that poses a risk to the country's financial stability. ANGOLA CURRENCY Angola's central bank may begin the process of fully floating its kwanza currency in three months' time, the bank's governor Jose Massano said, according to daily O Pais on Monday. For the latest precious metals report click on For the latest base metals report click on For the latest crude oil report click on\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T14:46:00.000+02:00", "crawled": "2018-01-24T15:24:34.008+02:00", "highlightTitle": ""}