{"organizations": [], "uuid": "632d605f3f5cba13f3fce48be9786cd689c10c28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/30/104977897-GettyImages-810277250.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/uk-prime-minister-theresa-may-says-wants-free-trade-deal-with-china.html", "country": "US", "domain_rank": 767, "title": "UK Prime Minister Theresa May says wants free trade deal with China", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.029, "site_type": "news", "published": "2018-01-31T03:43:00.000+02:00", "replies_count": 0, "uuid": "632d605f3f5cba13f3fce48be9786cd689c10c28"}, "author": "Matt Cardy", "url": "https://www.cnbc.com/2018/01/30/uk-prime-minister-theresa-may-says-wants-free-trade-deal-with-china.html", "ord_in_thread": 0, "title": "UK Prime Minister Theresa May says wants free trade deal with China", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "xi jinping", "sentiment": "none"}, {"name": "matt cardy", "sentiment": "none"}], "locations": [{"name": "china the united kingdom", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "wuhan", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "royal air force", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GDP outlook Theresa May says she wants a free trade deal with China The United Kingdom is seeking a free trade agreement with China, Prime Minister Theresa May said as she flew to the country for talks with Chinese leaders, adding that more should be done immediately to open up market access for British firms \"China is a country that we want to do a trade deal with,\" May told reporters aboard her Royal Air Force jet on the way to Wuhan — a university city where she will announce half a billion pounds worth of education deals Published 18 Hours Ago SHARES Matt Cardy | Getty Images British Prime Minister Theresa May with Chinese President Xi Jinping at a bilateral meeting during the G20 summit on July 7, 2017. \nBritain is seeking a free trade agreement with China , Prime Minister Theresa May said on Wednesday as she flew to the country for talks with Chinese leaders, adding that more should be done immediately to open up market access for British firms. \nThe ambitious long-term goal of securing a free trade deal with the world's second-largest economy comes as May begins a three-day visit to China accompanied by businesses from sectors where Britain feels it can capitalize on China's growing middle class consumers and rapidly expanding services sector. \n\"China is a country that we want to do a trade deal with,\" May told reporters aboard her Royal Air Force jet on the way to Wuhan — a university city where she will announce half a billion pounds worth of education deals. \n\"But, I think that there is more we can be doing in the interim ... in terms of looking at potential barriers to trade and the opening up of markets to ensure ... British businesses able to do good trade into China.\" \nAsked about President Xi Jinping's flagship Belt and Road Initiative — a trillion-dollar infrastructure-led push to build a modern silk road — May said it had huge potential, but cautioned that the project had to be carried out in the proper way. \n\"What I would like to see is ensuring that we have transparency and international standards being adhered to, and I will be discussing that with my Chinese interlocutors,\" she said. \nMay also said she would raise the future of Hong Kong in her meetings with Xi, underlining Britain's commitment to the \"one country, two systems\" rule in the former British colony. \nBritain's last governor in Hong Kong before it was handed back to the Chinese, Chris Patten, had written to May on Monday urging her to raise concerns over the \"increasing threats to the basic freedoms, human rights and autonomy\" in the territory. \n\"We believe that the future of Hong Kong, that one country, two systems future is important. We are committed to that,\" May said. \n\"I've raised this in the past with President Xi, and he's shown commitment to that but I will continue to raise it with him.\" ", "external_links": [], "published": "2018-01-31T03:43:00.000+02:00", "crawled": "2018-01-31T03:43:28.020+02:00", "highlightTitle": ""}