{"organizations": [], "uuid": "62b1970ab5375500415e05f222c5bce5a1de556d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223257369&w=1200&r=LYNXMPEE0I09I", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-india-investment-treaty/indias-proposed-investment-treaty-terms-leave-foreign-partners-cold-idUKKBN1F80I8", "country": "US", "domain_rank": 408, "title": "India's proposed investment treaty terms leave foreign partners cold", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T08:31:00.000+02:00", "replies_count": 0, "uuid": "62b1970ab5375500415e05f222c5bce5a1de556d"}, "author": "", "url": "https://uk.reuters.com/article/uk-india-investment-treaty/indias-proposed-investment-treaty-terms-leave-foreign-partners-cold-idUKKBN1F80I8", "ord_in_thread": 0, "title": "India's proposed investment treaty terms leave foreign partners cold", "locations": [], "entities": {"persons": [{"name": "aditi shah", "sentiment": "negative"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  India's proposed investment treaty terms leave foreign partners cold Aditi Shah 6 Min Read \nNEW DELHI (Reuters) - Having cancelled investment treaties with about 50 foreign governments last year, India is struggling to convince some to accept new terms that make it harder to seek international arbitration for disputes, sources familiar with the talks said. \nFrom New Delhi’s perspective those treaties, mainly struck in the 1990s when it was desperate for foreign capital, left it too exposed to potential claims awarded by international arbitrators. \nTo reduce that exposure, India has drafted a new model agreement that legal advisors say is similar to those used by other big emerging market economies like Brazil and Indonesia, but some of its foreign partners are baulking at the more restrictive approach. \n“India is getting nowhere with the negotiations,” said one of the sources, who is aware of the meetings with government officials over the past 10 months, but does not want to be named as the discussions are private. \nNegotiators from countries including Australia, Iran and the European Union have told the Indian side that investors are waiting to come in but the new treaty terms give too little protection, the source said. \nForemost among their concerns are a requirement for investors to fight any case in the Indian courts for at least five years before going for international arbitration, and other provisions narrowing the scope for companies to make claims, the source said. \nThe new model treaty also has no provision for investors to bring claims against India for any tax-related matters and for disputes arising due to actions taken by local governments. \nCurrently, India is entangled in more than 20 international arbitration cases, and could end up paying billions of dollars in damages if it loses. \nCompanies like Vodafone Group, Cairn Energy and Deutsche Telekom have initiated arbitration proceedings against India seeking to protect their investments against retrospective tax claims and cancellation of contracts. \nCovered by a bilateral trade and investment agreement between New Delhi and Tokyo, Japanese automaker Nissan is the latest company to sue India, claiming damages of over $770 million in unpaid tax incentives. \nWhile several countries limit the type of tax-related claims that can be made, lawyers say India’s step to omit all tax matters goes too far and could expose investors to sudden changes in tax rules or retrospective claims. NEGOTIATING POSITION FILE PHOTO: A company logo is seen on the newly-unveiled Nissan \"Terrano\" compact sport utility vehicle during a news conference in Mumbai, India August 20, 2013. REUTERS/Danish Siddiqui/File Photo \nThese days, India appears to be in a far stronger negotiating position than it was during the 1991 balance of payments crisis. Prime Minister Narendra Modi has a strong mandate and there is more confidence in the ability of his pro-business government to get the under-achieving economy moving than there has been in any of its predecessors. \nSince Modi came to power in 2014, annual foreign direct investment flows into India have doubled to $46 billion in 2016 from $22 billion in 2013. But the rate of growth in inflows is slowing, and the amount is lower than the $59 billion that a U.N. report says Brazil received in 2016. \nA European Commission official termed India’s unilateral decision to terminate treaties as “unfortunate” saying it discriminates between existing investors, who will continue to be protected by the old treaties for a few years after termination, and new ones who will have fewer safeguards. \nThe Commission is exploring ways to re-establish protection for European investors and resume negotiations on a free trade agreement with India that will include investment, the source said. \nCanada has been in talks with India since 2004 to sign its first treaty, but there has been little progress and its trade minister told Reuters in November that Canadian investors are holding back until there is one in place. \n“India needs further investments and Canada is willing, but we need a framework. What investors want is to have certainty, stability and predictability,” Francois-Philippe Champagne said in Mumbai during his visit to India as part of a trade mission. \nWhile the sources told Reuters that Australian and Iranian officials had raised concerns in private meetings with Indian counterparts, neither the Australian High Commission in New Delhi or Iran’s ministry of industry, mines and trade responded to emailed requests for comment. \nA spokesman at India’s ministry of external affairs also failed to respond to an email seeking comment. \nMeantime, some countries, especially those that receive more investment from India than they send, are more open to signing, said the first source. Israel, for instance, does not oppose some of the provisions and the two nations could soon sign an accord, Business Standard, an Indian newspaper, reported on Wednesday. \nAnd while India remains a capital deficient country, some of its biggest companies have made major investments overseas and would be reassured if there were bilateral treaties in place to protect their interests. \nFor now, the draft model treaty is a starting point for negotiations, the second source said, but India is in a good position to press for better terms. \n“India is finally flexing its muscles,” he said. Additional reporting by Phil Blenkinsop in Brussels, Bozorg Sharafedin in London and Colin Packham in Sydney; Editing by Euan Rocha and Simon Cameron-Moore", "external_links": [], "published": "2018-01-19T08:31:00.000+02:00", "crawled": "2018-01-19T08:52:25.001+02:00", "highlightTitle": ""}