{"organizations": [], "uuid": "c17a91efd4aad95faf0c903d058b71d319be363b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/germany-politics/left-wing-german-social-democrats-lobby-against-merkel-alliance-idUSL8N1P809G", "country": "US", "domain_rank": 408, "title": "Left-wing German Social Democrats lobby against Merkel alliance", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.011, "site_type": "news", "published": "2018-01-13T21:08:00.000+02:00", "replies_count": 0, "uuid": "c17a91efd4aad95faf0c903d058b71d319be363b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/germany-politics/left-wing-german-social-democrats-lobby-against-merkel-alliance-idUSL8N1P809G", "ord_in_thread": 0, "title": "Left-wing German Social Democrats lobby against Merkel alliance", "locations": [], "entities": {"persons": [{"name": "merkel", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "hilde mattheis", "sentiment": "none"}, {"name": "kevin kuehnert", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "jusos", "sentiment": "none"}, {"name": "spd", "sentiment": "none"}, {"name": "social democratic party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN, Jan 13 (Reuters) - Left-wing German Social Democrats lobbied party members on Saturday against joining Chancellor Angela Merkel’s conservatives in a re-run of their 2013-2017 alliance, a week before delegates are asked to back a coalition blueprint.\nThe push-back from the left wing of the Social Democratic Party (SPD) came a day after its leaders urged members to swallow their doubts and endorse a deal to renew a “grand coalition” with Merkel’s conservatives for another four years.\nThe SPD leaders face a tough task to convince members to approve the deal at a Jan. 21 party congress and again in a postal vote at the conclusion of formal coalition negotiations.\nThe leader of the SPD’s Jusos youth branch, Kevin Kuehnert, began a Germany-wide ‘No-GroKo’ tour to lobby party delegates to vote against the grand coalition. Others on the party’s left took to the airwaves to criticise the coalition blueprint.\n“A general change in policy is not happening, and a strengthening of the right wing must be avoided,” Hilde Mattheis, who leads the left-wing DL21 SPD group, told Deutschland funk radio.\nMany in the SPD rank-and-file are worried about allowing the far-right Alternative for Germany (AfD) party to become the largest opposition party in parliament - a scenario that would unfold if their party joins the conservatives in coalition.\n“The SPD would always be a bulwark against the right,” said Mattheis.\nTo win over the SPD, Merkel agreed in the coalition blueprint to 5.95 billion euros ($7.26 billion) of investment in education, research and digitalisation by 2021, expanded child care rights, and a pledge to strengthen Europe’s cohesion with increased German contributions to the EU budget.\nBut some Social Democrats believe the deal lacked sufficient concessions to their party. They also fear a new grand coalition would further diminish the identity of the SPD, which suffered its worst result in the September election since 1933.\nEven some senior party figures were not completely sold.\n“There is a great deal of scepticism in the SPD about another grand coalition,” said Manuela Schwesig, SPD state premier in the northeastern state of Mecklenburg-Vorpommern.\n“For me, the scepticism is not completely gone either. But you have to face reality now,” she told NDR Info radio.\nShould SPD delegates reject a tie-up with Merkel’s conservatives, she could try to form a minority government or Germany could face new elections.\nPresident Frank-Walter Steinmeier, who wants a stable coalition soon to end the political uncertainty hanging over Germany, expressed scepticism about a minority government, which would be a first in the post-war era.\nHe said there was “rightly” criticism of whether such a scenario was appropriate to overcome “the European crisis”.\n“In the end, we should not forget that no one can be forced - including not by the president - to lead a minority government,” Steinmeier told Focus magazine.\nMerkel has said she would favour new elections. ($1 = 0.8201 euros)\nWriting by Paul Carrel; Editing by Ros Russell\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-13T21:08:00.000+02:00", "crawled": "2018-01-13T19:38:53.007+02:00", "highlightTitle": ""}