{"organizations": [], "uuid": "b3554a2378313a96bac5376026fae79c21365751", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://goldreview.com/?feed=linkfeed&category=category-slug", "section_title": "Gold Review » Gold Review", "url": "https://uk.reuters.com/article/global-precious/precious-gold-inches-higher-as-dollar-pares-gains-idUKL3N1PD3NO", "country": "US", "domain_rank": 408, "title": "Gold rebounds from low as dollar weakens", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T18:25:00.000+02:00", "replies_count": 0, "uuid": "b3554a2378313a96bac5376026fae79c21365751"}, "author": "cmullen", "url": "https://uk.reuters.com/article/global-precious/precious-gold-inches-higher-as-dollar-pares-gains-idUKL3N1PD3NO", "ord_in_thread": 0, "title": "Gold rebounds from low as dollar weakens", "locations": [], "entities": {"persons": [{"name": "carsten menke", "sentiment": "none"}, {"name": "eric onstad", "sentiment": "none"}, {"name": "julius baer", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "zurich", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 11:19 AM / Updated 2 hours ago PRECIOUS-Gold flat but under pressure as U.S. Treasury yields rise Reuters Staff 4 Min Read * Spot gold could fall to $1,250 by mid year -Julius Baer * Falling digital currencies could support gold -analysts * Spot gold vs bitcoin: reut.rs/2DgiRiK * 10-year U.S. Treasury yields at highest since March (New throughout, updates prices, market activity and comments, adds second byline and NEW YORK dateline) By Renita D. Young NEW YORK/LONDON, Jan 18 (Reuters) - Gold was flat in a narrow range on Thursday, first dipping as the dollar rose and then rising as the dollar moved lower, but bullion's gains were limited by higher U.S. Treasury yields. Financial market players were concerned about a possible U.S. government shutdown, but this did not move gold very much. Spot gold was unchanged at $1,327.61 an ounce by 1:49 p.m. EST (1849 GMT). Earlier in the session, it touched its lowest since Jan. 12 at $1,323.70. U.S. gold futures for February delivery settled down $12, or 0.9 percent, at $1,327.20 per ounce. In the previous session, spot gold fell 0.8 percent, its biggest daily percentage decline since Dec. 7 as the U.S. dollar bounced from three-year lows. \"We’ve seen the relationship between dollar and gold hold pretty steady,\" said Chris Gaffney president of world markets at St. Louis-based EverBank. In early trade, the U.S. dollar index fell on worries over a possible U.S. government shutdown as global investors sought to diversify their holdings into other currencies. Shortly after, the greenback recovered some of the losses. The 10-year U.S. Treasury yield hit its highest since March 2017 at 2.61 percent in European trade, pushing euro zone counterparts higher. Gold is a non-yielding asset so rising yields on the bond market pressure its price. \"I think you'll also see yields rising with interest rates,\" pressuring gold, added Mike O’Donnell, market strategist RJO Futures in Chicago. Spot gold is expected to fall to $1,311 per ounce, as it has broken a support at $1,329, according to Reuters technical analyst Wang Tao. Some analysts said gold could draw some support from the current correction in digital currencies. \"Brokers in Europe report investors have increasingly been asking about switching from cryptocurrencies into gold,\" ANZ analysts said in a research note. Bitcoin fell as much as 20 percent on Wednesday, dropping below $10,000 due to investor fears that regulators could clamp down. In other precious metals, silver gained 0.3 percent at $16.96 per ounce and palladium shed 1.2 percent at $1,101.99. Platinum added 0.57 percent at $1,002.40 per ounce, after touching its highest since Sept. 8 at $1,007.60 in the previous session. Over the past 15 years, platinum has largely moved higher in January and February due to seasonally weaker supply from top producer South Africa, Menke said. \"This seasonal rebound is playing out. And there is also some more room from short covering from the futures market.\" (Additional reporting by Nallur Sethuraman and Nithin Prasad in Bengaluru; Editing by David Gregorio and Jane Merriman)", "external_links": [], "published": "2018-01-18T18:25:00.000+02:00", "crawled": "2018-01-18T20:15:51.008+02:00", "highlightTitle": ""}