{"organizations": [], "uuid": "88dd152cdf3031b8823133db00da6fef174a3050", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-aztecs-and-stellar-telecom-announce-merger.html", "country": "US", "domain_rank": 767, "title": "Aztecs and Stellar Telecom Announce Merger", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-10T18:07:00.000+02:00", "replies_count": 0, "uuid": "88dd152cdf3031b8823133db00da6fef174a3050"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-aztecs-and-stellar-telecom-announce-merger.html", "ord_in_thread": 0, "title": "Aztecs and Stellar Telecom Announce Merger", "locations": [], "entities": {"persons": [{"name": "robert lopez", "sentiment": "none"}, {"name": "kelly foster", "sentiment": "none"}, {"name": "jerry long", "sentiment": "none"}, {"name": "kelly", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}, {"name": "aztecs", "sentiment": "none"}], "organizations": [{"name": "stellar telecom, inc", "sentiment": "neutral"}, {"name": "aztecs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IRVINE, Calif., - Aztecs ( www.aztecs.net/news) and Stellar Telecom, Inc. (\"Stellar\") today announced the closing of a transaction whereby Aztecs purchased the holdings of Stellar co-founder and president Jerry Long, and subsequently merged the Stellar organization with and into Aztecs.\nRobert Lopez, Aztecs' founder, president, and chief executive officer will continue to serve as president and chief executive officer, and Kelly Foster, Stellar's co-founder and vice president, will become Aztecs' new chief operating officer.\n\"Kelly and I share a vision of an innovative workforce, steeped in capability, who will stop at nothing to drive successful outcomes for our customers. This transaction is an important part of Aztecs' growth plan, combining Stellar's many years of operational excellence with Aztecs' automated services management system. Together, we have the ability to quickly scale in size according to market demands, while maintaining the highest level of quality and responsiveness. Our industry is in a transformative age in which both skills and efficiency are critical to remaining competitive, and Aztecs will continually strive to provide the very best of both,\" said Lopez.\nFoster added, \"This merger brings together two like-minded companies, leaders, and their employees. The teams have known and respected each other for many years, and together we will be able to continue providing the highest level of service, while simultaneously improving our operational efficiency, expanding our service offering, and developing new markets. I could not be prouder of what Jerry and I built in Stellar, nor could I be more excited now about Stellar joining the Aztecs' team. We've known Robert for over 20 years and he's proven he's a leader that never stops short of doing amazing things.\"\nAdvisors\nJames A. Hayes, Jr. of Newport Beach, CA served as legal counsel to Aztecs. Addison Adams served as legal counsel to Stellar. Ed Fazio with Windes, a leading California accounting and advisory firm, consulted on the transaction.\nAbout Aztecs\nAztecs combines the deepest experience levels in the industry with the most innovative minds to provide a modern, scalable, network deployment system that maximizes value and consistency through automation and efficiency. Aztecs' fully integrated system seamlessly handles virtually any network deployment project type, enabling Aztecs to offer end-to-end integration and maintenance services ( www.aztecs.net/vast ). For additional information, please visit us online at www.aztecs.net .\nAbout Stellar\nStellar Telecom, Inc., located in Corona, California, has been providing solutions to a continually evolving wireless communications marketplace for over 17 years. The company's reputation is built on its commitment to quality and responsiveness. Its service offering includes a comprehensive portfolio of wireless network design and integration services, including: RF design, network design, civil construction, eNodeB installations, microwave design and installation, antenna and line installations, power systems, fiber optics, DAS installation and integration, and virtually every other aspect of designing, building, commissioning, and optimizing commercial wireless networks.\nView original content with multimedia: http://www.prnewswire.com/news-releases/aztecs-and-stellar-telecom-announce-merger-300580539.html\nSOURCE Aztecs", "external_links": ["http://www.aztecs.net/vast", "http://www.aztecs.net/", "http://www.prnewswire.com/news-releases/aztecs-and-stellar-telecom-announce-merger-300580539.html"], "published": "2018-01-10T18:07:00.000+02:00", "crawled": "2018-01-10T18:40:31.016+02:00", "highlightTitle": ""}