{"organizations": [], "uuid": "05dbb95593695d3294b0261b821c6a81a153a508", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/emerging-markets-latam/emerging-markets-brazil-stocks-hit-record-high-on-election-optimism-idUSL1N1P31KR", "country": "US", "domain_rank": 408, "title": "EMERGING MARKETS-Brazil stocks hit record high on election optimism", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.833, "site_type": "news", "published": "2018-01-09T07:40:00.000+02:00", "replies_count": 0, "uuid": "05dbb95593695d3294b0261b821c6a81a153a508"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/emerging-markets-latam/emerging-markets-brazil-stocks-hit-record-high-on-election-optimism-idUSL1N1P31KR", "ord_in_thread": 0, "title": "EMERGING MARKETS-Brazil stocks hit record high on election optimism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Updates prices throughout) By Bruno Federowski SAO PAULO, Jan 8 (Reuters) - Brazilian stocks edged higher to mark a record close on Monday, underpinned by optimism over the nation's fiscal outlook as well as a strong flow of international investment. The benchmark Bovespa stock index continued its climb following a seven-day string of gains. The rally in Brazilian stocks has been supported by investor betting on a market-friendly winner in this year's presidential elections, who would advance President Michel Temer's austerity platform. Former President Luiz Inácio Lula da Silva, who has railed against Temer's policies, is leading opinion polls, but he could be barred from running if a conviction for corruption is upheld by a higher court on Jan. 24. Signs that an economic recovery is picking up steam have also supported demand for Brazilian stocks, which should see earnings growth as Latin America's largest economy regains a solid footing. \"Inflows from foreign investors remain substantial and the pipeline looks strong,\" analysts at the Magliano brokerage wrote in a report. The Brazilian real and Mexican peso ticked downward, roughly in line with major Latin American currencies, except for the Chilean peso, which rose slightly. Analysts warned the Mexican peso may continue to weaken ahead of talks later this month in Montreal on the future of the North American Free Trade Agreement (NAFTA), which U.S. President Donald Trump has threatened to scrap. Mexico's benchmark index S&P/BMV IPC climbed 0.22 percent, reaching its highest level since Oct. 20. Bottler and retailer Fomento Economico Mexicano, or FEMSA, pushed gains, with shares climbing 1.42 percent. Traders in emerging markets have been closely following U.S. economic indicators and remarks by policymakers for hints over the pace of interest rate hikes in the United States, particularly after a mixed jobs report last week. Higher U.S. rates could dampen demand for emerging markets, which offer higher yields. Key Latin American stock indexes and currencies at 2140 GMT: Stock indexes Latest Daily YTD pct pct change change MSCI Emerging Markets 1,206.86 0.49 4.18 MSCI LatAm 2,981.63 0.42 5.43 Brazil Bovespa 79,378.54 0.39 3.90 Mexico IPC 49,995.57 0.22 1.30 Chile IPSA 5,705.61 0.18 2.53 Chile IGPA 28,696.76 0.21 2.56 Argentina MerVal 32,351.20 0.5 7.60 Colombia IGBC 11,853.55 1.1 4.25 Venezuela IBC 1,270.56 0.55 0.59 Currencies Latest Daily YTD pct pct change change Brazil real 3.2406 -0.15 2.24 Mexico peso 19.2290 -0.30 2.44 Chile peso 605.38 0.07 1.53 Colombia peso 2,906.3 -0.03 2.60 Peru sol 3.215 -0.09 0.68 Argentina peso (interbank) 19.0100 -0.58 -2.16 Argentina peso (parallel) 19.53 -0.41 -1.54 (Reporting by Bruno Federowski; Additional reporting by Flavia Bohone and Daina Beth Solomon; Editing by Jonathan Oatis and Rosalba O'Brien)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T07:40:00.000+02:00", "crawled": "2018-01-09T09:40:37.374+02:00", "highlightTitle": ""}