{"organizations": [], "uuid": "0b69e4c836ccc4f8cebfd703cf97a1c383277f17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/anz-bank-strategy/anz-drops-quarterly-earnings-updates-amid-debate-over-their-worth-idUSL3N1PB5RS", "country": "US", "domain_rank": 408, "title": "ANZ drops quarterly earnings updates amid debate over their worth", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T09:49:00.000+02:00", "replies_count": 0, "uuid": "0b69e4c836ccc4f8cebfd703cf97a1c383277f17"}, "author": "", "url": "https://www.reuters.com/article/anz-bank-strategy/anz-drops-quarterly-earnings-updates-amid-debate-over-their-worth-idUSL3N1PB5RS", "ord_in_thread": 0, "title": "ANZ drops quarterly earnings updates amid debate over their worth", "locations": [], "entities": {"persons": [{"name": "pau", "sentiment": "negative"}, {"name": "lina duran", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "anz", "sentiment": "negative"}, {"name": "westpac banking corp", "sentiment": "none"}, {"name": "commonwealth bank of australia", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "new zealand banking group", "sentiment": "none"}, {"name": "national australia bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 49 AM / Updated 5 minutes ago ANZ drops quarterly earnings updates amid debate over their worth Paulina Duran 4 Min Read \nSYDNEY, Jan 17 (Reuters) - Australia and New Zealand Banking Group said it will stop reporting quarterly earnings figures in a decision that has surprised many analysts and reignited a debate over the value and cost of the updates. \nIt is the second major Australian bank to do so after Westpac Banking Corp ended the practice in 2012 and the move comes as some countries look at dropping requirements for quarterly reporting, with Singapore launching a consultation on the matter last week. \nThe country’s lenders are also on the back foot, about to face a powerful government enquiry following a string of scandals, and forgoing the updates could save costs as well as reduce pressure on management. \nSome analysts believe it will only be a matter of time before the other two big banks, Commonwealth Bank of Australia and National Australia Bank, follow suit. \nANZ told Reuters in an emailed statement that it had received “strong feedback” and had “unanimous” support from the investment community for the move. \n“These updates were helpful during the global financial crisis, but as the world’s economy settled down they have become less and less useful,” it said. \nBut seven out of 13 analysts contacted by Reuters said they had not heard of the reporting changes. Four said the bank had ongoing discussions with analysts regarding disclosures and two said they had known about the bank’s intentions for the current quarter. \nANZ had been expected to provide its next quarterly update next month. It will still report earnings on a half-year and annual basis. Regulations also require banks to report capital levels and risk exposure every quarter. \nRepresentatives for CBA and NAB did not immediately respond to requests for comment on whether they too plan to drop their quarterly earnings releases. \nThe value of quarterly reporting has long been the subject of fierce debate with investors and management split over whether the frequent updates provide valuable information or simply encourage a short-term mindset among investors. \nOmkar Joshi, a portfolio manager at Regal Funds Management, which owns shares in Australian banks, said he understood ANZ’s move given the bank’s need for time to show its sales of non-core assets are helping profits. \n“Maybe it’s a little bit cynical but it’s possible that the next quarter wouldn’t look so great after all that change, and trying to explain it in a few pages would potentially create noise,” he said. \nU.S. companies publish quarterly updates but the European Union dropped the requirement in 2014. \nCredit Suisse banking analyst Jarrod Martin said that ANZ would still need to comply with rules requiring it to keep investors informed to help manage earnings expectations. \n“There has been discussion among a number of the banks about the use of the quarterly updates and whether they create noise,” Martin said. \n“They were very valid during the period of the financial crisis and directly afterwards when earnings were moving around, but I don’t think they are as relevant today as they were in the past.” (Reporting by Paulina Duran; Editing by Jennifer Hughes and Edwina Gibbs)", "external_links": [], "published": "2018-01-17T09:49:00.000+02:00", "crawled": "2018-01-17T09:54:49.027+02:00", "highlightTitle": ""}