{"organizations": [], "uuid": "04c78c986b5e785aafc91abc6efe2fad76e7311e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-mid-southern-savings-bank-fsb-to-conduct-second-step-conversion--announces-adoption-of-plan-of-conversion-and-reorganization.html", "country": "US", "domain_rank": 767, "title": "Mid-Southern Savings Bank, FSB to Conduct Second Step Conversion - Announces Adoption of Plan of Conversion and Reorganization", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T01:00:00.000+02:00", "replies_count": 0, "uuid": "04c78c986b5e785aafc91abc6efe2fad76e7311e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-mid-southern-savings-bank-fsb-to-conduct-second-step-conversion--announces-adoption-of-plan-of-conversion-and-reorganization.html", "ord_in_thread": 0, "title": "Mid-Southern Savings Bank, FSB to Conduct Second Step Conversion - Announces Adoption of Plan of Conversion and Reorganization", "locations": [], "entities": {"persons": [], "locations": [{"name": "reorganization salem", "sentiment": "none"}, {"name": "ind.", "sentiment": "none"}, {"name": "mid-southern", "sentiment": "none"}], "organizations": [{"name": "fsb", "sentiment": "neutral"}, {"name": "mid-southern savings bank", "sentiment": "neutral"}, {"name": "bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SALEM, Ind.--(BUSINESS WIRE)-- Mid-Southern Savings Bank, FSB (the “Bank”) (OTCBB:MSVB), today announced that the Board of Directors has unanimously adopted a Plan of Conversion and Reorganization pursuant to which the Bank will reorganize from the mutual holding company structure to the stock holding company structure and will undertake a “second-step” stock offering of shares of common stock of a new state chartered corporation formed in connection with the conversion.\nMid-Southern, M.H.C. (the “MHC”), which owns approximately 71% of the outstanding common stock of the Bank, will be merged with and into the new holding company as part of the reorganization and its shares in the Bank will be retired. The new holding company will offer and sell shares of common stock in an amount representing the percentage ownership interest currently held by the MHC, to be based on an appraisal of the Bank, as converted, which will be performed by an independent appraiser. The new holding company will offer shares of its common stock for sale to the Bank’s eligible account holders and certain borrowers and to members of the general public in a subscription and community offering in the manner and subject to the priorities set forth in the Plan of Conversion and Reorganization. Existing shareholders of the Bank, other than the MHC, will receive shares of common stock of the new holding company pursuant to an exchange ratio based on their aggregate percentage ownership interest and reflecting certain assets held by the MHC. The exchange ratio will be determined based upon the appraisal and the results of the offering.\nThe conversion and reorganization will be subject to approval of the Bank’s depositors, certain borrowers and shareholders (including the approval of a majority of the shares held by persons other than the MHC) and the Board of Governors of the Federal Reserve System.\nMid-Southern, M.H.C. is the mutual holding company for Mid-Southern Savings Bank, FSB a federal savings bank headquartered in Salem, Indiana with branches in nearby communities of Orleans and Mitchell and a loan production office in New Albany. The Bank has served the financial needs of Southern Indiana since 1886.\nThis release is neither an offer to sell nor a solicitation of an offer to buy common stock. The offer is made only by the prospectus when accompanied by a stock order form. The shares of common stock of the new holding company are not savings accounts or savings deposits, may lose value, and are not insured by the Federal Deposit Insurance Corporation or any other government agency.\nThis press release contains certain forward-looking statements about the conversion and reorganization. Forward-looking statements include statements regarding anticipated future events and can be identified by the fact that they do not relate strictly to historical or current facts. They often include words such as “believe,” “expect,” “anticipate,” “estimate,” and “intend” or future or conditional verbs such as “will,” “would,” “should,” “could,” or “may.” Forward-looking statements, by their nature, are subject to risks and uncertainties. Certain factors that could cause actual results to differ materially from expected results include delays in consummation of the Plan of Conversion and Reorganization, difficulties in selling the conversion stock or in selling the conversion stock within the expected time frame, increased competitive pressures, changes in the interest rate environment, general economic conditions or conditions within the securities markets, and legislative and regulatory changes that could adversely affect the business in which the MHC and Bank are engaged.\n //www.businesswire.com/news/home/20180124006274/en/\nMid-Southern Savings Bank, FSB\nAlexander G. Babey, 812-883-2639 Ext 2101\nPresident and Chief Executive Officer\nSource: Mid-Southern Savings Bank, FSB", "external_links": ["http://www.businesswire.com/news/home/20180124006274/en/"], "published": "2018-01-25T01:00:00.000+02:00", "crawled": "2018-01-25T01:49:52.014+02:00", "highlightTitle": ""}