{"organizations": [], "uuid": "664bd5e82cbf0dd00a0ede532d3348699b2dc163", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-juniper-networks-announces-increased-quarterly-cash-dividend-and-expansion-of-capital-return-plan.html", "country": "US", "domain_rank": 767, "title": "Juniper Networks Announces Increased Quarterly Cash Dividend and Expansion of Capital Return Plan", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.423, "site_type": "news", "published": "2018-01-31T00:15:00.000+02:00", "replies_count": 0, "uuid": "664bd5e82cbf0dd00a0ede532d3348699b2dc163"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-juniper-networks-announces-increased-quarterly-cash-dividend-and-expansion-of-capital-return-plan.html", "ord_in_thread": 0, "title": "Juniper Networks Announces Increased Quarterly Cash Dividend and Expansion of Capital Return Plan", "locations": [], "entities": {"persons": [{"name": "juniper", "sentiment": "none"}, {"name": "ken miller", "sentiment": "none"}], "locations": [{"name": "sunnyvale", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "company’s board of directors", "sentiment": "none"}, {"name": "juniper networks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SUNNYVALE, Calif., Jan. 30, 2018 (GLOBE NEWSWIRE) -- Juniper Networks (NYSE:JNPR), an industry leader in automated, scalable and secure networks, today announced an expansion of its capital return plan. Juniper today announced that its Board of Directors has declared an increase of its quarterly cash dividend to $0.18 per share to be paid on March 22, 2018 to shareholders of record as of the close of business on March 1, 2018. This reflects an increase of 80% compared to previous quarterly dividends. The Company intends to grow its dividend over time.\nAdditionally, the Company’s Board of Directors has approved a new $2 billion buyback authorization, which replaces the existing authorization. Juniper plans to enter into a $750 million accelerated share repurchase program in the first quarter of this year, and intends to be opportunistic with its share repurchases thereafter.\n“Our expanded capital return program reinforces our ongoing commitment to delivering total shareholder value,” said Ken Miller, chief financial officer, Juniper Networks. “The new buyback authorization, anticipated ASR program and increased dividend announced today reflect our confidence in Juniper’s long-term strategy.”\nIn fiscal year 2017, Juniper repurchased $720 million worth of shares, including $330 million worth of shares in the fourth quarter, and paid $150 million in dividends.\nJuniper will continue to review its capital return policy over time, subject to capital availability, company financial performance, economic outlook and other relevant considerations. Additional details of the new capital return program will be discussed during Juniper’s fourth quarter earnings call today, January 30, 2018, at 2:00 pm PT.\nJuniper today also reported preliminary financial results for the three months and twelve months ended December 31, 2017 and provided its outlook for the three months ending March 31, 2018. Additional details can be found in the Investor Relations section of the Company's website at http://investor.juniper.net/investor-relations/default.aspx .\nAbout Juniper Networks\nJuniper Networks (NYSE:JNPR) challenges the status quo with products, solutions and services that transform the economics of networking. Our team co-innovates with our customers and partners to deliver automated, scalable and secure networks with agility, performance and value. Additional information can be found at Juniper Networks ( www.juniper.net ) or connect with Juniper on Twitter and Facebook .\nInvestors and others should note that the Company announces material financial and operational information to its investors using its Investor Relations website, press releases, SEC filings and public conference calls and webcasts. The Company also intends to use the Twitter account @JuniperNetworks and the Company’s blogs as a means of disclosing information about the Company and for complying with its disclosure obligations under Regulation FD. The social media channels that the Company intends to use as a means of disclosing information described above may be updated from time to time as listed on the Company’s Investor Relations website.\nJuniper Networks, the Juniper Networks logo, Juniper, and Junos are registered trademarks of Juniper Networks, Inc. and/or its affiliates in the United States and other countries. Other names may be trademarks of their respective owners.\nSafe Harbor\nStatements in this release concerning Juniper Networks’ business outlook, economic and market outlook, execution of our capital return program, including the initiation of an accelerated share repurchase program and intention to increase our dividend over time and our overall future prospects are within the meaning of the Private Securities Litigation Reform Act that involve a number of uncertainties and risks. Actual results or events could differ anticipated in those as a result of several factors, including: general economic and political conditions globally or regionally; business and economic conditions in the networking industry; changes in overall technology spending by our customers and spending by communication service providers and major customers, including Cloud providers; the network capacity requirements of our customers and, in particular, cloud and communication service providers; contractual terms that may result in the deferral of revenue; increases in and the effect of competition; the timing of orders and their fulfillment; manufacturing and supply chain constraints, changes or disruptions; availability of key product components; ability to establish and maintain relationships with distributors, resellers and other partners; variations in the expected mix of products sold; changes in customer mix; changes in geography mix; customer and industry analyst perceptions of Juniper Networks and its technology, products and future prospects; delays in scheduled product availability; market acceptance of Juniper Networks products and services; rapid technological and market change; adoption of regulations or standards affecting Juniper Networks products, services or the networking industry; the ability to successfully acquire, integrate and manage businesses and technologies; product defects, returns or vulnerabilities; the ability to recruit and retain key personnel; significant effects of tax legislation, including the Tax Cuts and Jobs Act, and judicial or administrative interpretation of tax regulations; currency fluctuations; litigation settlements and resolutions; the potential impact of activities related to the execution of capital return, restructurings and product rationalization; and other factors listed in Juniper Networks’ most recent report on Form 10-Q or 10-K filed with the Securities and Exchange Commission. All statements made in this press release are made only as of the date set forth at the beginning of this release. Juniper Networks undertakes no obligation to update the information made in this release in the event facts or circumstances subsequently change after the date of this press release.\nInvestor Relations:\nJess Lubert\nJuniper Networks\n(408) 936-3734\njlubert@juniper.net\nMedia Relations:\nLeslie Moore\nJuniper Networks\n(408) 936-5767\nllmoore@juniper.net\nSource:Juniper Networks", "external_links": ["http://www.facebook.com/JuniperNetworks", "http://twitter.com/JuniperNetworks", "http://investor.juniper.net/investor-relations/default.aspx"], "published": "2018-01-31T00:15:00.000+02:00", "crawled": "2018-01-31T02:50:53.000+02:00", "highlightTitle": ""}