{"organizations": [], "uuid": "b0bf9e8ae8a00b08a74aa421b79094957b6ec0e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/cnbc-excerpts-cnbcs-squawk-box-broadcasts-live-from-the-world-economic-forum-in-davos-today-tuesday-january-23.html", "country": "US", "domain_rank": 767, "title": "CNBC EXCERPTS: CNBC’S “SQUAWK BOX” BROADCASTS LIVE FROM THE WORLD ECONOMIC FORUM IN DAVOS TODAY, TUESDAY, JANUARY 23", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T08:00:00.000+02:00", "replies_count": 0, "uuid": "b0bf9e8ae8a00b08a74aa421b79094957b6ec0e8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/cnbc-excerpts-cnbcs-squawk-box-broadcasts-live-from-the-world-economic-forum-in-davos-today-tuesday-january-23.html", "ord_in_thread": 0, "title": "CNBC EXCERPTS: CNBC’S “SQUAWK BOX” BROADCASTS LIVE FROM THE WORLD ECONOMIC FORUM IN DAVOS TODAY, TUESDAY, JANUARY 23", "locations": [], "entities": {"persons": [{"name": "michael corbat", "sentiment": "none"}, {"name": "wilbur ross", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "south koreans", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "ibm", "sentiment": "none"}, {"name": "department of commerce", "sentiment": "none"}, {"name": "citi", "sentiment": "none"}, {"name": "u.s. department of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WHEN: Today, Wednesday, January 24, 2018\nWHERE: CNBC's \"Squawk Box\" – Live from the World Economic Forum in Davos, Switzerland\nFollowing are excerpts from the unofficial transcript of CNBC interviews on CNBC's \"Squawk Box\" this morning live from the World Economic Forum in Davos, Switzerland, including: U.S. Department of Commerce Secretary Wilbur Ross, Citi CEO Michael Corbat , and IBM Chairman & CEO Virginia \"Ginni\" Rometty .\nFor a roundup of all the interviews on CNBC's \"Squawk Box\" today, go to davos.cnbc.com.\nAll references must be sourced to CNBC.\nWilbur Ross, U.S. Department of Commerce Secretary\nVideos from CNBC: https://www.cnbc.com/video/2018/01/24/secretary-wilbur-ross-were-all-in-favor-of-open-borders-but-it-has-to-be-a-two-way-street.html?play=1 & https://www.cnbc.com/video/2018/01/24/commerce-secretary-wilbur-ross-the-us-is-not-abandoning-its-strong-dollar-policy.html?play=1 .\nWilbur Ross on tariffs:\nI DON'T THINK IT SYMBOLIZES ANYTHING THOSE CASES HAVE BEEN ONGOING FOR QUITE A WHILE, AND I DON'T THINK IT SHOULD COME AS A SHOCK TO ANYBODY, LEAST OF ALL THE SOUTH KOREANS OR THE CHINESE.\nWilbur Ross on trade:\nI THINK WE'RE ALL IN FAVOR OF OPEN BORDERS, BUT IT HAS TO BE A TWO-WAY STREET. IT CAN'T BE JUST A ONE-WAY STREET AND WHOEVER GOES ON THE TWO-WAY STREET HAS TO GO BY THE LAWS, THE RULES OF THE ROAD. THOSE ARE THE THINGS WERE OBJECTING TO, AND THAT'S WHY WE BROUGHT 84 TRADE CASES LAST YEAR UP FROM 52 THE YEAR -- LAST YEAR OF OBAMA WE DIDN'T INVENT NEW TRADE INFRACTIONS, THEY WERE THERE. JUST WE'RE NOW TRYING TO DEAL WITH THEM.\nWilbur Ross on NAFTA:\nI THINK THERE'S A GOOD CHANCE OF IT. I THINK EVERYBODY WOULD PREFER TO HAVE IT BE A SATISFACTORY DEAL FOR ALL THREE PARTIES, BUT THE PRESIDENT HAS MADE IT CLEAR THAT IF IT'S NOT A DEAL THAT HE LIKES, HE WON'T DO IT.\nWilbur Ross on NAFTA 2:\nCHINA AND OTHER SOUTHEAST ASIAN NATIONS - THINK ABOUT IT, THE CONCEPT OF THE TRADE AGREEMENT IS TO PROTECT THOSE INSIDE SOMEWHAT FROM THE PEOPLE OUTSIDE AND FACILITATE TRANSFERS AMONG THE THREE PARTIES. SOMETHING THAT INSTEAD IS VERY POROUS AND LETS A LOT OF MATERIAL IN FROM OUTSIDE NAFTA, IT GOES AGAINST THE VERY CONCEPT OF AN AGREEMENT.\nWilbur Ross on Trump speech:\nIT WILL BE LARGELY CONSISTENT WITH POSITIONS THAT HE'S ALREADY TAKEN, AS IT SHOULD BE, BUT I THINK THE MAIN PURPOSE OF THE VISIT IS MORE TO COMMUNICATE WITH A BROADER CONSTITUENCY OVER HERE. THERE'S A LOT OF PEOPLE THERE THAT DON'T HAVE VERY MUCH DIRECT ACCESS TO WASHINGTON, BUT, SECOND, THERE WILL BE UNDOUBTEDLY SOME BILATERALS AT THE OUTSKIRTS OF THE SESSION SO THAT'S ALWAYS A USEFUL THING.\nWilbur Ross on President's support:\nTHE PRESIDENT RESPONDED VERY EXPLICITLY THAT HE WAS 100% IN SUPPORT SO I'D LIKE YOU TO COMPARE WHAT HE SAYS TO ANONYMOUS SOURCES, FORMER ADMINISTRATION PEOPLE. THOSE TO ME ARE NOT VERY MUCH THE SAME QUALITY SOURCE.\nWilbur Ross on Mnuchin comments:\nROSS: I WAS THERE WHEN HE SAID WHAT HE SAID I DON'T THINK THATS EXACTLY WHAT HE SAID I THINK WHAT HE EXACTLY SAID IS THE DOLLAR JUST LIKE THE TREASURY BOND MARKET IS A HUGE MARKET, VERY LIQUID MARKET ITS NOT SOMETHING WE WORRY A LOT ABOUT DAY BY DAY I THINK THATS REALLY THE INTENTION THAT HE WANTED.\nBECKY QUICK: SO HE WAS NOT ADVOCATING A WEAKER DOLLAR IN ANY WAY, SHAPE OR FORM?\nROSS: NO. HE WASN'T ADVOCATING ANYTHING. HE WAS SIMPLY SAYING IT'S NOT THE WORLD'S BIGGEST CONCERN TO US RIGHT NOW.\nMichael Corbat, Citigroup CEO\nVideos from CNBC: https://www.cnbc.com/video/2018/01/24/citigroup-ceo-im-not-a-believer-in-trade-wars.html?play=1 & https://www.cnbc.com/video/2018/01/24/citigroup-ceo.html?play=1 .\nMichael Corbat on growth in Europe:\nI THINK A LITTLE BIT OF THE STORY TODAY MAY BE A EUROPE THAT'S PERFORMED BETTER THAN EXPECTATIONS IN TERMS OF GROWTH AND THEREFORE MAY BE GIVING THE ECB THE CHANCE TO START TO RENORMALIZE MONETARY POLICY, AND MOVE RATES SOONER THAN WE'D EXPECTED. AND PEOPLE ARE ALSO, BY THE WAY, SAYING THAT MAYBE JAPAN IS NOT FAR OUT THERE EITHER. AND SO IF THE DOLLAR IS ADJUSTING BECAUSE OF THAT, I THINK IT'S FINE.\nMichael Corbat on a weaker dollar:\nWELCOME A WEAKER DOLLAR, AND AGAIN, IF— PROVIDED THE WEAKER DOLLAR IS HAPPENING FOR THE RIGHT REASONS, MAKES MANUFACTURING, MAKES EXPORTS, MAKES THE U.S. ECONOMY MORE COMPETITIVE. AND WE KNOW DURING THE STRONGER DOLLAR, WE SAW THE PAINS THAT IT CAUSED SOME OF OUR COMPANIES IN TERMS OF THEIR NUMBERS AND THE FOREIGN EXCHANGE AND SOME OF FRICTIONS THAT CAME AS PART OF THAT. THE SECOND PIECE OF IT, OR THE SECOND SIDE OF IT OR THE OTHER SIDE OF THE STORY, POTENTIALLY IS, IS IT COMING FROM FEARS OF PROTECTIONISM, IS IT COMING FROM FEARS OF PENDING OR LOOMING TRADE WARS? AND I THINK THAT WOULD BE MUCH MORE CONCERNING IF THAT'S THE REASON THAT THE DOLLAR IS UNDERPERFORMING.\nMichael Corbat on Trump trade:\nTHE ADMINISTRATION IS NOT ANTI-TRADE, IT'S ANTI MULTILATERAL TRADE. IT'S PRO BILATERAL TRADE. AND WHAT WE'VE SEEN, WE'VE SEEN THAT WITH NAFTA, IN TERMS OF WANTING TO HAVE VERY DIRECT CONVERSATIONS RATHER THAN WITH CANADA AND MEXICO AS A UNION, BUT EACH BILATERALLY WITH THOSE, I THINK WEVE SEEN THAT AS A PRECURSOR TO CONVERSATIONS THAT ARE LIKELY COMING IN CHINA AND OTHER PLACES.\nMichael Corbat on trade war:\nI'M NOT A BELIEVER TODAY IN TRADE WAR. I THINK WHEN YOU LOOK AT TRADE, AND LOOK AT TRADE IMBALANCES, FOR EXAMPLE WHEN YOU LOOK AT MEXICO AND WHEN WE LOOK AT SOUTH KOREA, YOU CAN SPECIFICALLY POINT TO VERYCONTAINED AREAS WHERE THOSE TRADE IMBALANCES COME FROM,\nMichael Corbat on China strategy:\nYOU CAN ALWAYS BE TOUGHER. I THINK WE NEED TO BE SMART ABOUT WHERE AND HOW WE USE THOSE POWERS OR HOW WE NEGOTIATE THOSE\nBUT I THINK YOU CAN ALWAYS BE TOUGHER AROUND CERTAIN ASPECTS. AND AGAIN I DONT THINK OF THIS AS BEING A BROAD BRUSH.\nMichael Corbat on tax benefits:\nWE THINK THIS IS GOING TO BE A CATALYST FOR SPENDING, INVESTMENT. I THINK PEOPLE ARE UNDERESTIMATING THE IMPACT OF REPATRIATION AND NOT JUST MONEY COMING BACK BUT MONEY MOVING AROUND THE WORLD AND HOW THAT'S GOING TO BE PUT TO WORK, WHAT IT MEANS TO OUR CONSUMER BANK AND THE CONSUMER WALLET AND THE FACT THAT PEOPLE ARE GOING TO HAVE A BIT MORE IN TAKE HOME. AND WE'VE SEEN A CONSUMER THAT'S IN PRETTY GOOD SHAPE.\nMichael Corbat on tax benefits 2:\nWE REALLY GET A BENEFIT IN TWO DIFFERENT WAYS. ONE, LIKE EVERYBODY ELSE, WE BENEFIT FRP, A TAX RATE GOING FROM 35% TO 21% AND BANKS ARE HISTORICALLY HIGH TAX PAYERS. AND CITI HISTORICALLY HAS BEEN A HIGH TAXPAYER AND WILL GET THE BENEFIT OF THAT AS WE GET TO TAKE MORE OF OUR EBIT TO NET INCOME. THE SECOND PIECE IS A LEGACY OF THE CRISIS, WE HAD THIS LARGE DEFERRED TAX ASSET, WHICH WAS A TAX CREDIT FROM SOME OF THE LOSSES WE TOOK DURING THE CRISIS AND AS AN ADJUSTMENT TO THE REDUCTION IN TAXES, THAT GOES AWAY AND WE GET A BENEFIT FROM CAPITAL THAT ACTUALLY GETS RELEASED AS A FUNCTION OF THAT AND INCREASE TOP LINE.\nMichael Corbat on dividends and buybacks:\nIN 2017 WE RETURNED ABOUT $17 BILLION TO OUR SHAREHOLDERS IN THE FORM OF DIVIDENDS AND BUYBACKS. WE REDUCED SHARE COUNT BY ABOUT 200 MILLION SHARES, ON A BASE OF ABOUT JUST UNDER 3 BILLION. AND AS WE STATED, IT'S OUR INTENTION TO CONTINUE. WE BELIEVE WE'VE GOT THE CAPITAL RETURN CAPABILITY OF RETURNING SOMEWHERE AT LEAST 20 BILLION IN EACH OF THE NEXT TWO YEARS.\nMichael Corbat on bitcoin:\nI THINK WE'LL BE TALKING ABOUT DIGITAL CURRENCIES, I'M NOT SURE WE'LL BE TALKING ABOUT BITCOIN.... ...I DON'T SEE IT AS A CURRENCY, I SEE IT AS A SPECULATIVE INVESTMENT. AND I DON'T UNDERSTAND THE UNDERLYING FUNDAMENTALS OF THE INVESTMENT.\nGinni Rometty, IBM Chairman & CEO\nVideo from CNBC: https://www.cnbc.com/video/2018/01/24/ibm-ceo-im-a-big-fan-of-tax-reform-and-repatriation.html?play=1 .\nGinni Rometty on cloud margins:\nTHE CLOUD FOR US, WHICH WE HAD GREAT GROWTH, YOU SAW IT, 30%, 17 BILLION. THINK OF THIS, WHEN YOU DO SOMETHING STANDARD VERSUS CUSTOM, THERE'S MORE MARGIN IN IT. SO THE MORE WE SHIFT TO THE CLOUD WITH US IS ACTUALLY ACCRETIVE TO OUR MARGINS. AND THE OTHER PIECE IS, THE NEW AREAS WE'VE GONE INTO, THEYRE ALL SOFTWARE AS A SERVICE, THEY'RE CLOUD. THEY HAVE HIGHER MARGIN AS THEY SCALE.\nGinni Rometty on tax reform:\nI'M A BIG FAN OF TAX REFORM AND REPATRIATION. GIVEN THE WAY WE'VE BEEN SET UP AND SORT OF OUR LENGTH OF TIME BEING IN BUSINESS, 106 YEARS, WE'VE BEEN ABLE TO MOVE OUR MONIES AROUND PRETTY FREELY AS WE'VE NEEDED AND WE'VE JUST PAID THE TAX. SO WE'VE BEEN A STRONG PROPONENT. WHILE IN THE SHORT RUN IT'S A BIT OF A HEADWIND FOR US ON RATE, IN THE LONG RUN IT WILL BE A GOOD THING.\nGinni Rometty on modernizing trade:\nMANY OF THESE TRADE AGREEMENTS THOUGH, THEY DID NEED MODERNIZATION. THERE REALLY WAS NOTHING LIKE A DIGITAL CHAPTER IN THEM, NOTHING TO PROTECT I.P., NOTHING TO LET DATA FLOW. SO THEY ABSOLUTELY NEED TO BE MODERNIZED. I MEAN SO MY HOPE IS ON A NAFTA THAT THESE DO FIND A COMMON GROUND AND THAT THEY GET MODERNIZED, WHICH IS WHAT THEY NEED.\nGinni Rometty on sexual harassment and #MeToo:\nHASHTAG METOO. THERE'S NOTHING TO THINK POSITIVE ABOUT ANY KIND OF DISCRIMINATION, ANY KIND OF HARASSMENT, AT ALL, PERIOD, POINT BLANK. I'M FORTUNATE TO BE IN A COMPANY THAT HAS FOR DECADES HAS HELD THAT. THAT TO ME, IS JUST, POINT BLANK, THAT'S IT.\nFor more information contact:\nJennifer Dauble\nCNBC\nt: 201.735.4721\nm: 201.615.2787\ne: jennifer.dauble@nbcuni.com\nEmma Martin\nCNBC\nt: 201.735.4713\ne: emma.martin@nbcuni.com\nAbout CNBC:\nWith CNBC in the U.S., CNBC in Asia Pacific, CNBC in Europe, Middle East and Africa, and CNBC World, CNBC is the recognized world leader in business news and provides real-time financial market coverage and business information to more than 409 million homes worldwide, including more than 91 million households in the United States and Canada. CNBC also provides daily business updates to 400 million households across China. The network's 15 live hours a day of business programming in North America (weekdays from 4:00 a.m. - 7:00 p.m. ET) is produced at CNBC's global headquarters in Englewood Cliffs, N.J., and includes reports from CNBC News bureaus worldwide. CNBC at night features a mix of new reality programming, CNBC's highly successful series produced exclusively for CNBC and a number of distinctive in-house documentaries.\nCNBC also has a vast portfolio of digital products which deliver real-time financial market news and information across a variety of platforms including: CNBC.com; CNBC PRO, the premium, integrated desktop/mobile service that provides live access to CNBC programming, exclusive video content and global market data and analysis; a suite of CNBC mobile products including the CNBC Apps for iOS, Android and Windows devices; and additional products such as the CNBC App for the Apple Watch and Apple TV.\nMembers of the media can receive more information about CNBC and its programming on the NBCUniversal Media Village Web site at http://www.nbcumv.com/programming/cnbc .\nFor more information about NBCUniversal, please visit http://www.NBCUniversal.com .", "external_links": ["https://wpyadmin.ne.cision.com/l/yarkqigy/wpyadmin.ne.cision.com/l/rqiiofgz/www.cnbc.com/squawk-box-us", "http://www.nbcumv.com/programming/cnbc"], "published": "2018-01-24T08:00:00.000+02:00", "crawled": "2018-01-25T20:33:45.005+02:00", "highlightTitle": ""}