{"organizations": [], "uuid": "f534e6bdd062a0c6dfdc82ee6c0f7b7365c2e767", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/business-wire-owens-minor-announces-updates-on-pending-acquisition-of-halyard-healthas-sip-business.html", "country": "US", "domain_rank": 767, "title": "Owens & Minor Announces Updates on Pending Acquisition of Halyard Health’s S&IP Business", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T15:30:00.000+02:00", "replies_count": 0, "uuid": "f534e6bdd062a0c6dfdc82ee6c0f7b7365c2e767"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/business-wire-owens-minor-announces-updates-on-pending-acquisition-of-halyard-healthas-sip-business.html", "ord_in_thread": 0, "title": "Owens & Minor Announces Updates on Pending Acquisition of Halyard Health’s S&IP Business", "locations": [], "entities": {"persons": [{"name": "owens", "sentiment": "negative"}, {"name": "chris lowery", "sentiment": "negative"}], "locations": [{"name": "o&m", "sentiment": "none"}, {"name": "richmond", "sentiment": "none"}, {"name": "va.", "sentiment": "none"}], "organizations": [{"name": "global products", "sentiment": "negative"}, {"name": "owens & minor announces updates on pending acquisition of halyard health", "sentiment": "negative"}, {"name": "global solutions sbu", "sentiment": "none"}, {"name": "halyard health, inc.’s surgical & infection prevention", "sentiment": "none"}, {"name": "owens & minor", "sentiment": "none"}, {"name": "stuart morris-hipkins & nicholas j. pace", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Former Halyard COO Chris Lowery joins Owens & Minor as President, Global Products;\nO&M also promotes executives Stuart Morris-Hipkins & Nicholas J. Pace to strategic leadership positions\nRICHMOND, Va.--(BUSINESS WIRE)-- Owens & Minor (NYSE: OMI) today announced organizational updates relating to its pending acquisition of Halyard Health, Inc.’s Surgical & Infection Prevention (S&IP) business, which was announced on November 1, 2017. As part of the integration plan for the S&IP business, Owens & Minor anticipates it will organize into two strategic business units (SBUs): Global Solutions and Global Products. The Global Solutions SBU will contain the majority of Owens & Minor’s legacy business and will focus on distribution, logistics, inventory management, and other value-added solutions. The Global Products SBU will contain the S&IP business along with Owens & Minor’s Proprietary Products business segment. Subsequent to announcing the acquisition, Owens & Minor received notice of early termination of the Hart-Scott-Rodino waiting period on November 29, 2017, and expects the transaction to close in the first quarter of 2018.\nChris Lowery, who served as Senior Vice President & Chief Operating Officer of Halyard Health, Inc. from its spin-off from Kimberly-Clark in November 2014, until December 31, 2017, joined Owens & Minor effective January 3, 2018, as its President, Global Products. During his tenure at Halyard, Lowery was responsible for leading worldwide sales and marketing, research and development, quality assurance, regulatory, and clinical affairs. In anticipation of closing the S&IP transaction, Lowery will initially assist Owens & Minor with integration planning, including establishing the Global Products SBU, which will include the Proprietary Products business. Prior to serving as Halyard Health’s COO, Lowery served as Vice President of Sales and Marketing at Kimberly-Clark Health Care, and before that held several senior marketing and sales roles at Covidien, a global health care products company.\nThe company also announced that Stuart Morris-Hipkins, who has served as Executive Vice President of Owens & Minor’s Global Manufacturer Services since joining the company in March 2017, has been promoted to President, Global Solutions for Owens & Minor. A senior executive with more than 20 years of global leadership experience, Stuart previously worked for Smith and Nephew, PLC, where he served from 2014 to 2017 as Senior Vice President and General Manager.\n“Our integration planning process has been moving swiftly and we look forward to closing the transaction, so that we can hit the ground running,” said P. Cody Phipps, Chairman, President & Chief Executive Officer of Owens & Minor. “We believe that Owens & Minor has a compelling path to growth through the S&IP transaction and the ongoing execution of our strategy. Owens & Minor will benefit from the deep healthcare industry experience and expertise of both Chris and Stuart.”\nIn other actions, the company also announced that Nicholas J. Pace has been promoted to Executive Vice President, General Counsel, Corporate Secretary and Communications. Pace, who joined Owens & Minor in 2016, previously served as Senior Vice President & General Counsel at Owens & Minor.\nAbout Owens & Minor, Inc.\nOwens & Minor, Inc. (NYSE: OMI) is a global healthcare solutions company dedicated to Connecting the World of Medical Products to the Point of Care SM by providing vital supply chain services to healthcare providers and manufacturers of healthcare products. Owens & Minor provides logistics services across the spectrum of medical products from disposable medical supplies to devices and implants. With logistics platforms strategically located in the United States and Europe, Owens & Minor serves markets where three quarters of global healthcare spending occurs. Owens & Minor’s customers span the healthcare market from independent hospitals to large integrated healthcare networks, as well as group purchasing organizations, healthcare products manufacturers, the federal government, and healthcare patients at home through its Byram Healthcare subsidiary. A FORTUNE 500 company, Owens & Minor is headquartered in Richmond, Virginia, and has annualized revenues exceeding $9 billion. For more information about Owens & Minor, visit owens-minor.com , follow @Owens_Minor on Twitter , and connect on LinkedIn at www.linkedin.com/company/owens-&-minor .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180105005101/en/\nOwens & Minor, Inc.\nTruitt Allcott, 804-723-7555\nDirector, Investor & Media Relations\ntruitt.allcott@owens-minor.com\nor\nChuck Graves, 804-723-7556\nDirector, Finance & Investor Relations\nchuck.graves@owens-minor.com\nSource: Owens & Minor, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.owens-minor.com&esheet=51738210&newsitemid=20180105005101&lan=en-US&anchor=owens-minor.com&index=1&md5=2a13ebb849a3989cf0a57f4503159afa", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fowens-%26-minor&esheet=51738210&newsitemid=20180105005101&lan=en-US&anchor=www.linkedin.com%2Fcompany%2Fowens-%26-minor&index=3&md5=146025b639c9148634763cf1a72c60b4", "http://www.businesswire.com/news/home/20180105005101/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2FOwens_Minor&esheet=51738210&newsitemid=20180105005101&lan=en-US&anchor=%40Owens_Minor+on+Twitter&index=2&md5=e133805e2e1364579c82295f392ce2ae"], "published": "2018-01-05T15:30:00.000+02:00", "crawled": "2018-01-05T18:03:28.000+02:00", "highlightTitle": ""}