{"organizations": [], "uuid": "6a75e2234fb9da233c2ba39f441177f9175c7f09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-centerpoint-energy-2017-earnings-expected-to-increase-as-a-result-of-tax-cuts-and-jobs-act.html", "country": "US", "domain_rank": 767, "title": "CenterPoint Energy 2017 earnings expected to increase as a result of Tax Cuts and Jobs Act", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.92, "site_type": "news", "published": "2018-01-04T14:30:00.000+02:00", "replies_count": 0, "uuid": "6a75e2234fb9da233c2ba39f441177f9175c7f09"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-centerpoint-energy-2017-earnings-expected-to-increase-as-a-result-of-tax-cuts-and-jobs-act.html", "ord_in_thread": 0, "title": "CenterPoint Energy 2017 earnings expected to increase as a result of Tax Cuts and Jobs Act", "locations": [], "entities": {"persons": [], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "cnp", "sentiment": "negative"}, {"name": "centerpoint energy", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "centerpoint energy, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 4, 2018 /PRNewswire/ -- CenterPoint Energy, Inc. (NYSE: CNP) today announced expected earnings on a guidance basis for 2017 will incorporate a re-measurement of deferred tax liabilities and a credit to income tax expense. As a result, earnings are expected to exceed the previously provided $1.25 to $1.33 guidance range. Absent these adjustments, earnings are anticipated to be at or near the high end of the $1.25 to $1.33 range.\nCenterPoint Energy's management will host an earnings call at 11:00 a.m. Eastern time on Thursday, Feb. 22, 2018, and will provide dial-in instructions at a later date. Company executives plan to discuss 2017 earnings results, 2018 earnings guidance, long-term growth drivers, and the impact of the Tax Cuts and Jobs Act.\nEarnings Guidance Variables and Assumptions\nGuidance for 2017 considers utility operations performance to date and certain significant variables that may impact earnings, such as weather, regulatory and judicial proceedings, throughput, commodity prices, anticipated effective tax rates, and financing activities. In providing this guidance, the company uses a non-GAAP measure of adjusted diluted earnings per share that does not consider other potential impacts, such as changes in accounting standards or unusual items, earnings or losses from the change in the value of the ZENS securities and the related stocks, or the timing effects of mark-to-market accounting in the company's Energy Services business.\nIn providing guidance, the company assumes for midstream investments a limited partner ownership interest in Enable Midstream averaging 54.1 percent for 2017 and includes the amortization of CenterPoint Energy's basis difference in Enable Midstream. CenterPoint Energy's guidance takes into account such factors as Enable Midstream's most recent public outlook for 2017 provided on Nov. 1, 2017, and anticipated effective tax rates. The company does not include other potential impacts such as any changes in accounting standards or Enable Midstream's unusual items.\nAbout CenterPoint Energy\nCenterPoint Energy, Inc., headquartered in Houston, Texas, is a domestic energy delivery company that includes electric transmission & distribution, natural gas distribution and energy services operations. The company serves more than five million metered customers primarily in Arkansas, Louisiana, Minnesota, Mississippi, Oklahoma, and Texas. The company also owns a 54.1 percent limited partner interest in Enable Midstream Partners, a publicly traded master limited partnership it jointly controls with OGE Energy Corp., which owns, operates and develops natural gas and crude oil infrastructure assets. With more than 7,700 employees, CenterPoint Energy and its predecessor companies have been in business for more than 150 years. , visit the website at www.CenterPointEnergy.com .\nForward Looking Statements\nThis news release includes within the meaning of the Private Securities Litigation Reform Act of 1995. These based upon assumptions of management which are believed to be reasonable at the time made and are subject to significant risks and uncertainties. You are cautioned not to place undue reliance on any . Actual events and results may differ materially from those expressed or implied by these . Any statements in this news release regarding future earnings guidance and earnings and any other statements that are not historical facts are . Each forward-looking statement contained in this news release speaks only as of the date of this release. Factors that could affect actual results include (1) the performance of Enable Midstream Partners, LP (Enable), the amount of cash distributions CenterPoint Energy receives from Enable, Enable's ability to redeem the Series A Preferred Units in certain circumstances and the value of CenterPoint Energy's interest in Enable, and factors that may have a material impact on such performance, cash distributions and value, including factors such as: (A) competitive conditions in the midstream industry, and actions taken by Enable's customers and competitors, including the extent and timing of the entry of additional competition in the markets served by Enable; (B) the timing and extent of changes in the supply of natural gas and associated commodity prices, particularly prices of natural gas and natural gas liquids (NGLs), the competitive effects of the available pipeline capacity in the regions served by Enable, and the effects of geographic and seasonal commodity price differentials, including the effects of these circumstances on re-contracting available capacity on Enable's interstate pipelines; (C) the demand for crude oil, natural gas, NGLs and transportation and storage services; (D) environmental and other governmental regulations, including the availability of drilling permits and the regulation of hydraulic fracturing; (E) recording of non-cash goodwill, long-lived asset or other than temporary impairment charges by or related to Enable; (F) changes in tax status; (G) access to debt and equity capital; and (H) the availability and prices of raw materials and services for current and future construction projects; (2) industrial, commercial and residential growth in CenterPoint Energy's service territories and changes in market demand, including the effects of energy efficiency measures and demographic patterns; (3) timely and appropriate rate actions that allow recovery of costs and a reasonable return on investment; (4) future economic conditions in regional and national markets and their effect on sales, prices and costs; (5) weather variations and other natural phenomena, including the impact of severe weather events on operations and capital; (6) state and federal legislative and regulatory actions or developments affecting various aspects of CenterPoint Energy's and Enable's businesses, including, among others, energy deregulation or re-regulation, pipeline integrity and safety and changes in regulation and legislation pertaining to trade, health care, finance and actions regarding the rates charged by our regulated businesses; (7) tax reform and legislation, including the effects of the Tax Cuts and Jobs Act; (8) CenterPoint Energy's ability to mitigate weather impacts through normalization or rate mechanisms, and the effectiveness of such mechanisms; (9) the timing and extent of changes in commodity prices, particularly natural gas, and the effects of geographic and seasonal commodity price differentials; (10) problems with regulatory approval, construction, implementation of necessary technology or other issues with respect to major capital projects that result in delays or in cost overruns that cannot be recouped in rates; (11) local, state and federal legislative and regulatory actions or developments relating to the environment, including those related to global climate change; (12) the impact of unplanned facility outages; (13) any direct or indirect effects on CenterPoint Energy's facilities, operations and financial condition resulting from terrorism, cyber-attacks, data security breaches or other attempts to disrupt CenterPoint Energy's businesses or the businesses of third parties, or other catastrophic events such as fires, earthquakes, explosions, leaks, floods, droughts, hurricanes, pandemic health events or other occurrences; (14) CenterPoint Energy's ability to invest planned capital and the timely recovery of Cent", "external_links": ["http://www.centerpointenergy.com/", "http://www.prnewswire.com/news-releases/centerpoint-energy-2017-earnings-expected-to-increase-as-a-result-of-tax-cuts-and-jobs-act-300577436.html"], "published": "2018-01-04T14:30:00.000+02:00", "crawled": "2018-01-04T13:59:55.005+02:00", "highlightTitle": ""}