{"organizations": [], "uuid": "8d591e3696222ca6f84153fb67da8eb673cd91dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/01/gettyimages-453965585.jpg", "site_section": "http://airlinenewswire.com/feed/rss/", "section_title": "Airline Newswire .com", "url": "http://fortune.com/2018/01/18/airbus-a380-emirates-order-deal/", "country": "US", "domain_rank": 1196, "title": "How Emirates Airline Just Singlehandedly Saved the Airbus A380", "performance_score": 0, "site": "fortune.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T02:16:00.000+02:00", "replies_count": 0, "uuid": "8d591e3696222ca6f84153fb67da8eb673cd91dc"}, "author": "\"airline OR airlines OR airways\" - Google News", "url": "http://fortune.com/2018/01/18/airbus-a380-emirates-order-deal/", "ord_in_thread": 0, "title": "How Emirates Airline Just Singlehandedly Saved the Airbus A380", "locations": [], "entities": {"persons": [{"name": "david meyer", "sentiment": "negative"}, {"name": "john leahy", "sentiment": "none"}], "locations": [{"name": "emirates", "sentiment": "none"}], "organizations": [{"name": "emirates airline", "sentiment": "negative"}, {"name": "airbus", "sentiment": "none"}, {"name": "boeing", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By David Meyer January 18, 2018 \nEmirates Airline has pledged to order up to 36 extra Airbus A380s, and, in doing so, has essentially saved the European firm’s flagship commercial plane from the scrapheap. \nThe double-decker A380 is very expensive to run, and only really makes commercial sense on fully-booked flights. Airbus has only delivered 222 of them since they entered service in 2007 and, just a few days ago, the company warned it may have to end production unless a big new order came in soon. \n“We are still talking to Emirates but quite honestly they are the only one that has the ability in the marketplace to take a minimum of six a year for a period of eight to 10 years,” Airbus’s top salesperson, John Leahy, said during an in-house webinar . \nAirbus needs to make at least six A380s a year in order to maintain an efficient production line, he said, and no orders came in during 2017. By way of comparison, Boeing’s rival 787 Dreamliner had 94 orders last year. \nWell, Emirates has now flown in to the rescue. \nIt and Airbus said Thursday that the Dubai-based carrier would definitely buy 20 of the planes, and retained an option to take 16 more. Deliveries will start in 2020 and the value of the deal is $16 billion at current list prices. \n“Some of the new A380s we’ve just ordered will be used as fleet replacements. This order will provide stability to the A380 production line,” said Emirates chief Sheikh Ahmed bin Saeed Al Maktoum. \n“We will continue to work closely with Airbus to further enhance the aircraft and onboard product, so as to offer our passengers the best possible experience. The beauty of this aircraft is that the technology and real estate on board gives us plenty of room to do something different with the interiors.” \nLeahy said the deal underscored Airbus’s commitment to make the A380 for the next decade at least. “I’m personally convinced more orders will follow Emirates’ example and that this great aircraft will be built well into the 2030s,” he added. \nEmirates also ordered 40 Dreamliners in November last year, in a deal worth just over $15 billion. Days later, Airbus revealed an enormous 430-jet, $50 billion order from private equity firm Indigo Partners, which will distribute the planes among its low-cost airlines. However, those were all for smaller jets than the A380. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-19T02:16:00.000+02:00", "crawled": "2018-01-19T09:08:51.005+02:00", "highlightTitle": ""}