{"organizations": [], "uuid": "6b9c93b90b7a411713a668a0804cc8a335671276", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221127399&w=1200&r=LYNXMPEE0A0WL", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-m-s-outlook-breakingviews/breakingviews-ms-held-back-by-dowdy-online-look-idUSKBN1F01KD", "country": "US", "domain_rank": 408, "title": "M&S held back by dowdy online look", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T20:51:00.000+02:00", "replies_count": 0, "uuid": "6b9c93b90b7a411713a668a0804cc8a335671276"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-m-s-outlook-breakingviews/breakingviews-ms-held-back-by-dowdy-online-look-idUSKBN1F01KD", "ord_in_thread": 0, "title": "M&S held back by dowdy online look", "locations": [], "entities": {"persons": [{"name": "steve rowe", "sentiment": "none"}, {"name": "archie norman", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}], "organizations": [{"name": "london marks & spencer", "sentiment": "negative"}, {"name": "m&s", "sentiment": "negative"}, {"name": "office for national statistics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON Marks & Spencer is looking a bit dowdy. The high street retailer’s food and clothing arms met quarterly forecasts, but both have strategic issues. This wouldn’t matter if M&S was seeing 25 percent growth in online sales, like jazzier rival Boohoo. But a 5 percent share dip on Jan. 11 can partly be attributed to the fact it isn’t.\nLike-for-like sales in M&S’s food and clothing divisions compared to the same third-quarter period last year fell 0.4 percent and 2.8 percent respectively. The lacklustre performance, while slightly better than analysts expected, isn’t new. The latest of M&S’s many strategic overhauls is already in hand, with Chief Executive Steve Rowe and new Chairman Archie Norman trying to boost the amount of clothing that is sold at full price and refreshing the flagging food business.\nNow the online business looks off too. Web sales increased just 3 percent in the 13 weeks to Dec. 30, less than a third the current growth rate of Britain’s online retail market, data from the Office for National Statistics shows. And M&S is, if anything, losing the hang of selling online. In the same quarter two years ago, the retailer’s web sales increased by 21 percent year-on-year.\nThere are reasons why Rowe probably can’t match the double-digit revenue growth seen at online rivals like ASOS or Boohoo.com. First, he’s saddled with an older customer base that buys less on a laptop or smartphone than millennial shoppers. And with a roughly 10 percent share of the British clothing market already, there’s less room for M&S to grow than smaller competitors.\nWhile UK rival Next makes 45 percent of its sales online, M&S manages only 18 percent online for non-food. During 2008-16 the value of UK retail sales in physical stores increased by 27.3 billion pounds according to the ONS. The value of online sales grew by a more impressive 37.6 billion pounds. M&S’s enterprise value is under six times its expected EBITDA, compared to 7.2 for Tesco and 9.4 for Next, according to Eikon. Unless it joins the online party, M&S will struggle to close the gap.\n ", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-11T20:51:00.000+02:00", "crawled": "2018-01-11T17:02:11.001+02:00", "highlightTitle": ""}