{"organizations": [], "uuid": "9503edbde37659bfec7c5a1fd98649bafc9c0ba3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104934599-GettyImages-163775787.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/bull-market-still-has-years-left-raymond-james-jeffrey-saut.html", "country": "US", "domain_rank": 767, "title": "Bull market still has 'years left,' Raymond James Jeffrey Saut", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.155, "site_type": "news", "published": "2018-01-31T15:30:00.000+02:00", "replies_count": 0, "uuid": "9503edbde37659bfec7c5a1fd98649bafc9c0ba3"}, "author": "Matthew J. Belvedere", "url": "https://www.cnbc.com/2018/01/31/bull-market-still-has-years-left-raymond-james-jeffrey-saut.html", "ord_in_thread": 0, "title": "Bull market still has 'years left,' Raymond James Jeffrey Saut", "locations": [], "entities": {"persons": [{"name": "raymond james jeffrey saut", "sentiment": "negative"}, {"name": "jeffrey saut", "sentiment": "none"}, {"name": "raymond james", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The worst two-day decline for the Dow Jones industrial average since September 2016 was not the beginning of the end of the bull market, the chief investment strategist at Raymond James told CNBC on Wednesday.\nThe U.S. futures were pointing to a rebound at the open on Wednesday after sharp losses on Monday and Tuesday.\n\"We actually think the secular bull market began in October 2008. That's when the majority of stocks bottomed,\" Wall Street veteran Jeffrey Saut said on \"Squawk Box.\"\nSaut's timetable for the start of the bull market after the Great Recession is about five months ahead of when the Dow and S&P 500 hit bottom in March 2009.\nEither way, the market has been generally moving higher for about nine years, the second oldest bull market on record without at least a 20 percent drop in the S&P. During that time, the indexes have gained around 300 percent, not including dividends.\nSaut, who has been in finance for nearly 50 years, said his long-term model has been positive since October 2008, but short-term there were some signals of \"potential downside vulnerability\" in February. Saut's modeling has been pretty accurate over the years.\n\"Sentiment got too optimistic,\" he said. \"So over the past few weeks, we pulled in our horns a little bit, but it's just in the context of a secular bull market … that has years left to run.\"\nThe term secular bull market is financial-speak for a bull market trend that's happening over time.\n\"These things tend to last 14-plus years. So we're nine years into this one. I think you've got at least another five, six, seven years left in this thing, and not many people believe it,\" Saut said.\nKatie Stockton, chief technical analyst at BTIG who tends to look at shorter-term trends, said the greatest risk of the \"shallow pullback\" of the past two sessions is market sentiment turning too negative.\n\"I think we need several more percent to the downside,\" Stockton told CNBC in an interview along with Saut. \"That would help work off those sentiment excesses that the market has. And, of course, it would be associated with market volatility. But it should be very short-lived.\"\nBut Stockton, whose calls on the market have been quite accurate lately , said she does not believe stocks are in for a major correction, which is defined as a 10 percent decline from recent highs.\nThe latest leg of the long-running stock bull market kicked into high gear after the November 2016 election of Donald Trump as president. Since then, the Dow and the Nasdaq have gained more than 40 percent each, while the S&P 500 has advanced more than 30 percent.\nMorning Squawk: CNBC's before the bell news roundup Sign up to get Morning Squawk each weekday\nJob Industry Advertising/Marketing Automotive Communications/PR Construction/Manufacturing Education Finance/Banking/Insurance Legal Media/Entertainment Medical/Health Care Mining/Oil/Gas/Utilities Gov't/Non-Profit Real Estate Retail Technology/IT Transportation/Shipping Travel/Hospitality Other Get this delivered to your inbox, and more info about about our products and service. Privacy Policy . Submit Please enter a valid email address Disclaimer", "external_links": [], "published": "2018-01-31T15:30:00.000+02:00", "crawled": "2018-01-31T15:34:51.025+02:00", "highlightTitle": ""}