{"organizations": [], "uuid": "da571f00058634759d513f9629b834284cce687e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/16/104947582-Shah_Rukh_Khan_.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/24/shah-rukh-khan-every-world-leader-should-promote-the-metoo-movement.html", "country": "US", "domain_rank": 767, "title": "Shah Rukh Khan: Every world leader should promote the MeToo movement", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.369, "site_type": "news", "published": "2018-01-24T15:24:00.000+02:00", "replies_count": 0, "uuid": "da571f00058634759d513f9629b834284cce687e"}, "author": "Tania Bryer", "url": "https://www.cnbc.com/2018/01/24/shah-rukh-khan-every-world-leader-should-promote-the-metoo-movement.html", "ord_in_thread": 0, "title": "Shah Rukh Khan: Every world leader should promote the MeToo movement", "locations": [], "entities": {"persons": [{"name": "shah rukh khan", "sentiment": "negative"}, {"name": "bryer", "sentiment": "none"}, {"name": "khan", "sentiment": "none"}, {"name": "tania bryer", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "meer foundation", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bollywood star Shah Rukh Khan has urged world leaders to support the MeToo movement at the World Economic Forum (WEF) in Davos, Switzerland.\n\"This uprising that is happening in America, which is spreading all over the world, with the hashtag MeToo, is actually a sign of (the) times, it is what is the truth, what is happening, and I think every leader in the world should understand, respect and perhaps help promote it, help take care of women,\" he told CNBC's Tania Bryer on Tuesday.\nKhan, star of more than 80 Bollywood films, was given a WEF Crystal award on Monday night for his work with female acid attack victims, as part of his non-profit Meer Foundation. The actor urged society to understand that women are equals.\n\"What we need to do is look at ourselves as a society and each amongst us, our children, men, boys, we need to take a new look at ourselves ... Not only in acid attack crimes, the other crimes against women too, we need to realize that when a woman has a choice, we need to make it as much as we (men) have the right to choose,\" he told Bryer.\nshow chapters Shah Rukh Khan: Society needs to educate men on gender equality 2:13 PM ET Tue, 23 Jan 2018 | 05:28 He dismissed any different treatment of men and women as primitive. \"Just because we are biologically different, we are going to have a different set of rules, I think that itself is a stupid primitive thought in itself. And now if somebody was to tell me that a leader of the world or anyone is saying something anti-women, I completely disagree with him.\"\nKhan wouldn't give a specific message about equality to President Donald Trump, who is due to address WEF on Friday, but made a general comment that it is unacceptable for someone not to believe in gender parity. \"The bottom line is, you cannot misbehave on any front, with a woman, with any excuse,\" he added.\nThe MeToo movement is something those in the Indian movie industry are aware of, Khan said. \"This could be happening here (in Bollywood), we need to take care of it, and all the people, which includes me too, who kind of run the film industry … I think we are all extremely aware of it. And I'm sure it (sexual harassment) must have happened, but we will make sure it doesn't happen in the future.\"", "external_links": [], "published": "2018-01-24T15:24:00.000+02:00", "crawled": "2018-01-24T14:43:24.000+02:00", "highlightTitle": ""}