{"organizations": [], "uuid": "256b2e4aa07eb92e522a1616cdb71cc6d70c1ea2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-tuesday-morning-corporation-reports-sales-results-for-the-second-quarter-fiscal-2018.html", "country": "US", "domain_rank": 767, "title": "Tuesday Morning Corporation Reports Sales Results for the Second Quarter Fiscal 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T17:00:00.000+02:00", "replies_count": 0, "uuid": "256b2e4aa07eb92e522a1616cdb71cc6d70c1ea2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-tuesday-morning-corporation-reports-sales-results-for-the-second-quarter-fiscal-2018.html", "ord_in_thread": 0, "title": "Tuesday Morning Corporation Reports Sales Results for the Second Quarter Fiscal 2018", "locations": [], "entities": {"persons": [{"name": "steve becker", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Net sales increased 1.7% to $334 million; Comparable store sales increased 1.6% Reaffirms fiscal 2018 comp sales guidance of 2% - 5%\nDALLAS, Jan. 08, 2018 (GLOBE NEWSWIRE) -- Tuesday Morning Corporation (NASDAQ:TUES), one of the original off-price retailers with over 720 stores across the United States specializing in name-brand, high quality products for the home, selling luxury textiles, furnishings, housewares and seasonal decor, today reported sales results for the second quarter ended December 31, 2017. Net sales were $334 million with a comparable store sales increase of 1.6%, which was comprised of a 1.7% increase in customer transactions, slightly offset by a 0.1% decrease in average ticket.\nSteve Becker, Chief Executive Officer said, “We delivered a 1.6% comp for our second fiscal quarter and a 2.4% comp for the six months ending in December. Throughout the peak season, we experienced significant improvement in our supply chain operations, benefiting from the management, personnel, systems and process changes that we have made. We continued to effectively manage our working capital, reducing our overall inventory balance by approximately $30 million or 12% versus December quarter end last year and we ended the quarter with no outstanding balances under our revolving line of credit. As is typical, we will begin to use our line again during the March quarter as our inventories build. We are pleased with our inventory composition and are well positioned for a positive spring season with the freshness and quality of inventory, especially relative to the challenges faced last spring in the aftermath of the Phoenix distribution center opening. We remain comfortable with our previously provided outlook for a 2% to 5% comp sales increase and a significant improvement in Adjusted EBITDA for fiscal 2018, which includes a material increase in gross margins in the spring season reflecting reduced distribution costs. We are focused on opportunities to improve our sales and profitability, including continued improvement in inventory levels in subsets of our store base.”\nThe Company will report complete financial results for the second quarter on Thursday, February 1, 2018.\nAbout Tuesday Morning\nTuesday Morning Corporation (NASDAQ:TUES) is one of the original off-price retailers specializing in name-brand, high quality products for the home, selling luxury textiles, furnishings, housewares and seasonal decor. Based in Dallas, Texas, the Company opened its first store in 1974 and operates over 720 stores in 40 states. More information and a list of store locations may be found on the Company’s website at www.tuesdaymorning.com .\nCautionary Statement Regarding Forward-Looking Statements\nThis press release contains forward-looking statements, which are based on management’s current expectations, estimates and projections. Forward-looking statements in this press release include, but are not limited to, statements of management’s current plans and expectations in this press release, including statements regarding management’s financial outlook for fiscal year 2018, merchandising and marketing strategies and inventory levels.\nReference is hereby made to the Company’s filings with the Securities and Exchange Commission, including, but not limited to, \"Cautionary Statement Regarding Forward-Looking Statements\" and \"Item 1A. Risk Factors\" of the Company's Annual Report on Form 10-K for the fiscal year ended June 30, 2017, for examples of risks, uncertainties and events that could cause our actual results to differ materially from the expectations expressed in our forward-looking statements. These risks, uncertainties and events also include, but are not limited to, the following: our ability to successfully implement our long-term business strategy; changes in economic and political conditions which may adversely affect consumer spending; our failure to identify and respond to changes in consumer trends and preferences; our ability to continuously attract buying opportunities for off-price merchandise and anticipate consumer demand; our ability to successfully manage our inventory balances profitably; our ability to effectively manage our supply chain operations; loss of, disruption in operations, or increased costs in the operation of our distribution center facilities; unplanned loss or departure of one or more members of our senior management or other key management; increased or new competition; our ability to successfully execute our strategy of opening new stores and relocating and expanding existing stores; increases in fuel prices and changes in transportation industry regulations or conditions; our ability to generate strong cash flows from operations and to continue to access credit markets; increases in the cost or a disruption in the flow of our imported products; changes in federal tax policy; the success of our marketing, advertising and promotional efforts; our ability to attract, train and retain quality employees in appropriate numbers, including key employees and management; increased variability due to seasonal and quarterly fluctuations; our ability to maintain and protect our information technology systems and technologies and related improvements to support our growth; our ability to protect the security of information about our business and our customers, suppliers, business partners and employees; our ability to comply with existing, changing, and new government regulations; our ability to manage litigation risks from our customers, employees and other third parties; our ability to manage risks associated with product liability claims and product recalls; the impact of adverse local conditions, natural disasters and other events; our ability to manage the negative effects of inventory shrinkage; our ability to manage exposure to unexpected costs related to our insurance programs; our ability to mitigate reductions of customer traffic in shopping centers where our stores are located; and increased costs or exposure to fraud or theft resulting from payment card industry related risk and regulations. The Company’s filings with the SEC are available at the SEC’s web site at www.sec.gov .\nThe forward-looking statements made in this press release relate only to events as of the date on which the statements were made. Except as may be required by law, the Company disclaims obligations to update any forward-looking statements to reflect events and circumstances after the date on which the statements were made or to reflect the occurrence of unanticipated events. Investors are cautioned not to place undue reliance on any forward-looking statements.\nINVESTOR RELATIONS:\nFarah Soi / Caitlin Morahan\nICR\n203-682-8200\nFarah.Soi@icrinc.com\nCaitlin.Morahan@icrinc.com\nMEDIA:\nBlynn Austin\nPerry Street Communications\n214-965-9955\nBAustin@perryst.com\nSource:Tuesday Morning Corp.", "external_links": ["https://www.globenewswire.com/Tracker?data=Uj3qXGrP5ZYgfvH1bTvwwIOPpaJaRsQFywh5vtATD-nF6TjlJf4jHPmfba0aMs1fi2AHkhywWL4RioW0S_brQW9gE9_YDuppzZfh_xYZ3B6XmCP1muAisMv1pIQlbs6K", "https://www.globenewswire.com/Tracker?data=6ZDcmPhY-YnF8hlEf_S0TzXdxiQEYwSAJyqJJjr06sV3eVFsQNER1USyajg9DBsphdHOqj81_i4rFcOvlCB7jRiAi3TE40ZdDdM6fdJ-caE=", "https://www.globenewswire.com/Tracker?data=XsZGZL5xZC6ZSAQJ_vclFdDtnYqaxajuiSWSBH7gQdObuUfKDOwkAVHoDaWbavCH6BtkSuaJHYrYdVRd85N6HR764o6QIBQlfAN_ImhO9tk=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/284f04b3-649b-4881-88bc-8a8862c474e6", "https://www.globenewswire.com/Tracker?data=ZWgeYsNS5CX5GxH89whTyTyZEq0GasbRgyDKKqHwFMEGhOPyAk8_obfC9OLy1zfeVCfFpsC5W0L2p6vQ6iTjT8rEfbq6WDra__TxGG4Zimo="], "published": "2018-01-08T17:00:00.000+02:00", "crawled": "2018-01-08T19:07:17.106+02:00", "highlightTitle": ""}