{"organizations": [], "uuid": "bd4767aedf400c2b4b908852a4824d350a85f22c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222365371&w=1200&r=LYNXMPEE0F0I7", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/us-britain-eu-johnson/uks-saving-after-brexit-even-bigger-than-350-million-pounds-johnson-says-idUKKBN1F50T3", "country": "US", "domain_rank": 408, "title": "UK's saving after Brexit even bigger than 350 million pounds, Johnson says", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T16:20:00.000+02:00", "replies_count": 0, "uuid": "bd4767aedf400c2b4b908852a4824d350a85f22c"}, "author": "", "url": "https://uk.reuters.com/article/us-britain-eu-johnson/uks-saving-after-brexit-even-bigger-than-350-million-pounds-johnson-says-idUKKBN1F50T3", "ord_in_thread": 0, "title": "UK's saving after Brexit even bigger than 350 million pounds, Johnson says", "locations": [], "entities": {"persons": [{"name": "johnson", "sentiment": "neutral"}, {"name": "brexiteers", "sentiment": "none"}, {"name": "reuters/simon dawson", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "neutral"}, {"name": "eu", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "houses of parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 8:41 AM / Updated 5 hours ago UK's saving after Brexit even bigger than 350 million pounds, Johnson says Reuters Staff 3 Min Read \nLONDON (Reuters) - Britain will have even more money to spend on public services than the disputed 350 million pounds a week Brexiteers promised after the country leaves the European Union, Foreign Secretary Boris Johnson said in an interview published on Tuesday. Anti-Brexit protesters demonstrate outside the Houses of Parliament in London, Britain, December 13, 2017. REUTERS/Simon Dawson \nThe 350 million pound ($482 million) figure was a central and controversial part of the pro-Leave campaign’s “Take back control” message in the runup to the 2016 referendum. Last September government statisticians accused Johnson of misusing state data by repeating it. \nBritain’s theoretical gross contribution to the EU in 2016 was 18.9 billion pounds - more than 360 million per week - but this was automatically lowered to 13.9 billion pounds by a rebate arrangement that has been in place since 1984. \nThe government received a further 4.4 billion pounds back to spend mostly on farm subsidies and infrastructure in poorer regions. Overall, Britain’s net payment to the EU worked out at 181 million pounds a week. \nBrexit opponents say Johnson and other pro-Leave campaigners deliberately misled the public by saying 350 million pounds a week could be spent on the state-run National Health Service (NHS), a claim famously emblazoned on a campaign bus, and it has become symbolic of the divisions caused by the referendum. \nBut in the interview with the Guardian newspaper, Johnson said the UK’s weekly gross contribution to the EU would rise to 438 million pounds by the time Britain left the bloc. \n“There was an error on the side of the bus,” Johnson said. “We grossly underestimated the sum over which we would be able to take back control. As and when the cash becomes available – and it won’t until we leave – the NHS should be at the very top of the list.” \nJohnson has previously said the 350 million pound figure on the bus referred to gross payments to the EU, rather than the net amount. \nThe opposition Labour Party said it had written to the chairman of the UK Statistics Authority, asking it to make a statement about the accuracy of Johnson’s latest remarks. \nIn the last week, several senior Brexit campaigners such as Nigel Farage, the former head of the UK Independence Party (UKIP), suggested there needed to be another referendum to reaffirm the 2016 result of 52-48 percent in favor of leaving the EU. \nPrime Minister Theresa May has ruled out a re-run of the vote. Reporting by Michael Holden; Editing by Stephen Addison", "external_links": [], "published": "2018-01-16T16:20:00.000+02:00", "crawled": "2018-01-16T18:01:07.007+02:00", "highlightTitle": ""}