{"organizations": [], "uuid": "0e6f79b903386e05ac25fcd512b1c1a0eeb3fcdb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218878383&w=1200&r=LYNXMPEE010WL", "site_section": "http://feeds.reuters.com/reuters/domesticNews/", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-railroads-safety/u-s-urges-railroads-to-quickly-install-anti-crash-safety-system-idUSKBN1ER1O7", "country": "US", "domain_rank": 408, "title": "U.S. urges railroads to quickly install anti-crash safety system", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T22:10:00.000+02:00", "replies_count": 0, "uuid": "0e6f79b903386e05ac25fcd512b1c1a0eeb3fcdb"}, "author": "", "url": "https://www.reuters.com/article/us-usa-railroads-safety/u-s-urges-railroads-to-quickly-install-anti-crash-safety-system-idUSKBN1ER1O7", "ord_in_thread": 0, "title": "U.S. urges railroads to quickly install anti-crash safety system", "locations": [], "entities": {"persons": [{"name": "chao", "sentiment": "none"}, {"name": "david shepardson", "sentiment": "none"}, {"name": "tom brown", "sentiment": "none"}, {"name": "elaine chao", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "seattle", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "amtrak", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 8:11 PM / Updated 6 minutes ago U.S. urges railroads to quickly install anti-crash safety system David Shepardson 3 Min Read \nWASHINGTON (Reuters) - U.S. Transportation Secretary Elaine Chao urged the nation’s railroads and transit agencies to take all possible measures to meet deadlines to install a safety system called positive train control (PTC) to prevent crashes. \nLetters dated Dec. 27, which were made public on Tuesday, said Chao wanted railroads to “greatly accelerate” efforts to meet congressional deadlines. A deadly Amtrak crash last month near Seattle that killed three occurred on a section of track that did not have the PTC system operating. \nThe system is designed to prevent derailments caused by excessive speed. Investigators have said several deadly U.S. train crashes in recent years could have been prevented if the system was in place. \nIn 2008, Congress mandated the implementation of PTC nationwide by the end of 2015, then extended that deadline until the end of 2018 when its installation became more complex than anticipated. The government can extend the deadline to 2020 to complete some aspects of the system. \nThe National Transportation Safety Board said last month the Amtrak train that derailed onto a highway near Seattle was going 78 miles per hour (125.5 km per hour) in a 30-mph zone. \nThe letters went to the chief executives of railroads, including Amtrak, BNSF Railway Co, Canadian National Railway ( CNR.TO ), CSX Corp ( CSX.O ), Norfolk Southern Corp ( NSC.N ), Union Pacific Corp ( UNP.N ) and transit systems in Chicago, Boston, New York, Boston, Newark, Seattle and Los Angeles. \nAmtrak said last month it was “imperative that the rail industry urgently work together to get PTC activated on the national network as soon as possible - and certainly by the December 2018 federal deadline, if not before.” \nThe Transportation Department said 12 of 41 railroads covered by the requirements report having installed less than 50 percent of the hardware required for their PTC systems as of Sept. 30. The government said the systems are in operation on 45 percent of route miles owned by freight railroads and just 24 percent of passenger railroads \nChao’s letter said the Federal Railroad Administration (FRA) leadership plans to work with railroads “to help create an increased level of urgency to underscore the imperative of meeting existing timeline expectations for rolling out this critical rail-safety technology.” \nThe Association of American Railroads said on Tuesday that railroads are making progress on installing and testing PTC technology and freight railroads are on track to meet the deadlines established by Congress. \nSeparately, the Transportation Department wrote to U.S. senators on Tuesday asking them to approve the nomination of Ronald Batory to head the FRA. Batory, a former Conrail president, was approved unanimously by a committee but has been held up due to a dispute over a New York area infrastructure project. Reporting by David Shepardson; Editing by Tom Brown and Susan Thomas", "external_links": [], "published": "2018-01-02T22:10:00.000+02:00", "crawled": "2018-01-02T22:31:44.007+02:00", "highlightTitle": ""}