{"organizations": [], "uuid": "3e585db48d81885d6ae4855fca91a31652b2781b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/06/11/101749038-sainsbury.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/10/j-sainsbury-says-its-had-a-record-christmas-week-driven-by-excellent-operations-across-the-group.html", "country": "US", "domain_rank": 767, "title": "UK grocer Sainsbury's has record Christmas week as online sales grow", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T10:52:00.000+02:00", "replies_count": 0, "uuid": "3e585db48d81885d6ae4855fca91a31652b2781b"}, "author": "Silvia Amaro", "url": "https://www.cnbc.com/2018/01/10/j-sainsbury-says-its-had-a-record-christmas-week-driven-by-excellent-operations-across-the-group.html", "ord_in_thread": 0, "title": "UK grocer Sainsbury's has record Christmas week as online sales grow", "locations": [], "entities": {"persons": [{"name": "argos", "sentiment": "none"}, {"name": "mike coupe", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "sainsbury", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.K. grocer Sainsbury 's says it has experienced a record week of trading during the Christmas period with \"excellent\" operations across the whole group.\n\"We think it's a good performance in what of course continues to be a challenging market,\" Mike Coupe, chief executive officer of Sainsbury's, told CNBC Wednesday.\nThe second largest U.K. grocer reported an increase in like-for-like sales of 1.1 percent during its third quarter, which includes the Christmas period. Analysts had forecast a 0.9 percent increase, according to Reuters.\nA key contributor to these results was Argos, the electricals retailer it acquired in 2016 and now has located within its stores. The number of collections using its fast track service, which allows customers to get their items within four hours of purchasing them, rose by 39 percent and deliveries rose by 25 percent in the three-month period.\nSainsbury's said in a statement that such services \"were particularly popular\" during Black Friday and the last few days leading up to Christmas.\nshow chapters Sainsbury’s Argos acquisition makes Amazon much bigger competitor: Pro 12 Hours Ago | 02:08 \"We are actually over-delivering against the synergies that we promised the markets when we actually acquired the Argos business,\" Coupe told CNBC.\n\"The Argos business really sets us up for our future, because one of the big stories of this Christmas is how much more growth has been online and as we see here today something like 20 percent of Sainsbury's sales are now online, a big part of that is Argos,\" he added.\nHowever, the retailer warned that market conditions remain challenging due to an increase in inflation.\n\"We've seen a rise in inflation in the U.K. over the last year or so on the back of the Brexit vote and on the back of the devaluation of the pound and that means that customers' disposable income has, at its best, flattened and probably slightly declining and that has an effect on deferral purchases,\" Coupe explained.\nScott Barbour, Getty Images News, Getty Images The grocer has so far covered this impact of inflation itself, according to the CEO, and said it will do what it can to reduce the impact of higher prices on its customers.\n\"We are, broadly speaking, covering the cost of inflation in our business with our own efficiency initiatives,\" he said.\nCoupe also told CNBC that he expects shareholder dividends to continue to rise slightly year-after-year.\nshow chapters Sainsbury’s CEO: Customer income at best flat, at worst falling 11 Hours Ago | 03:07", "external_links": [], "published": "2018-01-10T10:52:00.000+02:00", "crawled": "2018-01-10T10:23:53.012+02:00", "highlightTitle": ""}