{"organizations": [], "uuid": "e7c69a39ed7dc1c96d99189aa8c24f32e39f75e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-matt-kurucz-joins-crow-holdings-industrial-in-chicago.html", "country": "US", "domain_rank": 767, "title": "Matt Kurucz Joins Crow Holdings Industrial in Chicago", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T18:00:00.000+02:00", "replies_count": 0, "uuid": "e7c69a39ed7dc1c96d99189aa8c24f32e39f75e2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-matt-kurucz-joins-crow-holdings-industrial-in-chicago.html", "ord_in_thread": 0, "title": "Matt Kurucz Joins Crow Holdings Industrial in Chicago", "locations": [], "entities": {"persons": [{"name": "matt kurucz", "sentiment": "negative"}, {"name": "matt", "sentiment": "none"}, {"name": "kurucz", "sentiment": "none"}, {"name": "ken valach", "sentiment": "none"}], "locations": [{"name": "chicago dallas", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}], "organizations": [{"name": "chi", "sentiment": "none"}, {"name": "opus group", "sentiment": "none"}, {"name": "real estate development", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 30, 2018 /PRNewswire/ -- Crow Holdings Industrial (CHI), the industrial development affiliate of Dallas‐based Crow Holdings, today announced that Matt Kurucz has joined the firm as Managing Director and will lead a new office based in Chicago, Illinois. Mr. Kurucz joins CHI from The Opus Group, where he served as Director of Real Estate Development, and was responsible for the leasing and development of more than 3.7 million square feet of industrial product in the Chicago market.\n\"We have long-aspired to return to the Chicago market because of its prominence as a strategic, national distribution hub,\" said Ken Valach, CHI's CEO. \"Matt shares this passion for the region and brings to our organization strong market acumen, deep experience, and a broad industry network. The Crow family has deep roots in the industrial development business and building our presence in Chicago is an important next step. We look forward to having Matt lead our efforts in the region.\"\nMr. Kurucz added, \"I am grateful and honored to join Crow Holdings Industrial and to become part of the Crow Holdings platform, which has maintained its reputation as one of the preeminent developers in this country for more than 70 years. This team benefits from an entrepreneurial energy and focus along with the expertise of the national Crow Holdings platform. I look forward to leading our efforts in the region, to contributing to the growth of this business, and to honoring the Crow family's legacy in industrial development.\"\nPrior to Opus, Matt worked as a Development Manager at IDI, Inc. (now IDI Logistics) where he was responsible for sourcing and executing on new industrial development opportunities in multiple submarkets. Mr. Kurucz earned a Bachelor of Science in Finance from the University of Colorado and a dual Master of Business and Master of Science in Real Estate and Construction Management from the University of Denver.\nABOUT CHI AND CROW HOLDINGS\nAs part of the Crow Holdings platform, CHI is a nationally focused developer of warehouse, distribution and fulfillment properties in major markets across the country. In addition to pursuing industrial and multi-family real estate development activities through CHI and Trammel Crow Residential, Crow Holdings is a real estate investor and owner with over six decades of continuous operating history. Crow Holdings Capital, the firm's fund management business, pursues value-add real estate investments across all sectors in a range of defined fund strategies. Additionally, the firm's approach to building longstanding industry partnerships extends to a global multi-asset investment platform that complements and informs its core real estate businesses. Crow Holdings also owns a portfolio of signature properties, including its Dallas headquarters at Old Parkland.\nMEDIA CONTACTS:\nMr. Jonathan Morgan\nPerry Street Communications\n(O) 214-965-9955\njmorgan@perryst.com\nMs. Natalie Brandt\nPerry Street Communications\n(O) 214-965-9966\nnbrandt@perryst.com\nView original content: http://www.prnewswire.com/news-releases/matt-kurucz-joins-crow-holdings-industrial-in-chicago-300590090.html\nSOURCE Crow Holdings Industrial", "external_links": ["http://www.prnewswire.com/news-releases/matt-kurucz-joins-crow-holdings-industrial-in-chicago-300590090.html", "http://crowholdingsindustrial.com/"], "published": "2018-01-30T18:00:00.000+02:00", "crawled": "2018-01-30T18:33:21.014+02:00", "highlightTitle": ""}