{"organizations": [], "uuid": "b55ab548ad89ce7bb459dbf73b0674c9487d6208", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222796366&w=1200&r=LYNXMPEE0G1HC", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-ge-stocks/ges-2018-gains-wiped-out-as-worries-about-turnaround-plan-persist-idUSKBN1F62FV", "country": "US", "domain_rank": 408, "title": "GE's 2018 gains wiped out as worries about turnaround plan persist", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T20:18:00.000+02:00", "replies_count": 0, "uuid": "b55ab548ad89ce7bb459dbf73b0674c9487d6208"}, "author": "", "url": "https://www.reuters.com/article/us-ge-stocks/ges-2018-gains-wiped-out-as-worries-about-turnaround-plan-persist-idUSKBN1F62FV", "ord_in_thread": 0, "title": "GE's 2018 gains wiped out as worries about turnaround plan persist", "locations": [], "entities": {"persons": [{"name": "ankit ajmera", "sentiment": "none"}, {"name": "john flannery", "sentiment": "none"}, {"name": "alwyn scott", "sentiment": "none"}, {"name": "stephen tusa", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "ge", "sentiment": "negative"}, {"name": "general electric co", "sentiment": "none"}, {"name": "jp morgan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 6:20 PM / Updated an hour ago GE's 2018 gains wiped out as worries about turnaround plan persist Ankit Ajmera , Alwyn Scott 3 Min Read \n(Reuters) - Shares of General Electric Co ( GE.N ) continued its slide on Wednesday and wiped out all its gains in 2018, a day after the U.S. industrial conglomerate announced more than $11 billion in charges and hinted about a potential breakup. \nGE dropped as much as 5.1 percent to $17.28, adding to the about 42 percent decline in the past 12 months. \nAnalysts said the surprise charges announced by GE had hurt the company’s credibility with investors as it comes just two months after Chief Executive John Flannery issued a detailed plan to reset the company’s financial targets. \n“With the collapsing nature of almost everything in question around quality of earnings and free cash flow, we now scratch our heads as to how much of the ‘system’ is enabling a mitigation of what we think should be more of a hard landing,” JP Morgan analyst Stephen Tusa said in a note. \nGE’s decision to keep aside $15 billion in reserves to cover potential payouts on policies dating back decades represents about 7 percent of the company’s “incremental standing equity value,” Tusa said. \nThe charges were several times larger than the amount GE had forewarned investors. Analysts said GE’s move to suspend dividends paid by GE Capital to the parent company would reduce the value of the business in the conglomerate’s portfolio. \nGE said the dividend from its financial arm, which totaled $20 billion in 2016, is suspended “for the foreseeable future”. \n“If that cash stream is zero, then it has pretty dire consequences on a sum-of-the-parts basis,” said Deane Dray, analyst at RBC Capital Markets. \nOn Tuesday, Flannery hinted that GE could be looking closely at breaking itself to maximize the value of GE’s power, aviation and healthcare units. \nBut analysts wondered about the feasibility of such a plan for the 125-year-old conglomerate. \n“In the end, it all adds up to one EBITDA, a third of which is severely challenged, with an increasingly higher debt load and cash calls - facts that don’t change in whatever form the company takes going forward,” Tusa said. Reporting by Ankit Ajmera in Bengaluru and Alwyn Scott in New York; Editing by Arun Koyyur", "external_links": [], "published": "2018-01-17T20:18:00.000+02:00", "crawled": "2018-01-17T20:51:52.018+02:00", "highlightTitle": ""}