{"organizations": [], "uuid": "dab0de61efe0220aa63af1800e6a6eba1582bdb8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-payrailz-taps-frank-chan-as-security-and-compliance-officer.html", "country": "US", "domain_rank": 767, "title": "Payrailz Taps Frank Chan as Security and Compliance Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-30T16:00:00.000+02:00", "replies_count": 0, "uuid": "dab0de61efe0220aa63af1800e6a6eba1582bdb8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-payrailz-taps-frank-chan-as-security-and-compliance-officer.html", "ord_in_thread": 0, "title": "Payrailz Taps Frank Chan as Security and Compliance Officer", "locations": [], "entities": {"persons": [{"name": "frank chan", "sentiment": "negative"}, {"name": "chan", "sentiment": "none"}, {"name": "payrailz", "sentiment": "none"}], "locations": [{"name": "glastonbury", "sentiment": "none"}, {"name": "conn", "sentiment": "none"}], "organizations": [{"name": "bisys", "sentiment": "none"}, {"name": "fiserv", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Accomplished information security industry veteran joins digital payments company\nGLASTONBURY, Conn.--(BUSINESS WIRE)-- Payrailz, a digital payments company offering smarter, more engaging and secure bill payment and money transfer solutions to banks and credit unions, has named Frank Chan as its security and compliance officer.\nIn his new position, Chan will execute a risk-based compliance strategy and oversee all security, risk and audit activities for Payrailz. Chan has more than twenty years of experience managing complex information security, risk and compliance programs. He also brings extensive insight into audit and regulatory compliance from his experience at fintech companies and government agencies.\nHe joins Payrailz from D+H (now a part of Finastra), where he was senior director of regulatory services for managing complex federal IT examinations across all functional areas of the company. He spent nine years as vice president of information security at FISERV (formally Open Solutions). He also spent nine years as director of IT audit with BISYS (which was acquired by Open Solutions), and six years with the Office of the Comptroller of the Currency (OCC) as a bank IT examiner.\n“I am delighted to join the Payrailz team and to share my knowledge of the regulatory environment to help the company develop secure, compliant payments innovations,” Chan said. “It is impressive to see the organizations’ commitment to security. Payrailz offers a unique, smart driven and highly secure solution to its customers, and I look forward to helping ensure that compliance strategy is a top priority.”\nIn the new era driven by the “Do it For Me” phenomenon, Payrailz was founded to help financial institutions succeed by offering a smarter, secure and more engaging payment experience that surpasses the current solutions available in the market.\n“Financial institutions must ensure their partners and third-party vendors provide secure and compliant solutions; those are two important factors on which we will never compromise,” said Fran Duggan, CEO of Payrailz. “We want to offer banks and credit unions a smarter and more engaging alternative to outdated payment user experiences. Frank’s unprecedented knowledge and experience in all facets of information security from identifying complex issues to turning those issues into actionable items made him an ideal fit for Payrailz. Together, we can bring next generation, innovative, compliant payment system to market.”\nChan earned a bachelor’s degree in Finance from the University of Houston. He is a Certified Information Systems Auditor (CISA) and a Certified Information Systems Security Professional (CISSP).\nAbout Payrailz\nPayrailz is a digital payments company offering advanced bill payment and money transfer solutions to banks and credit unions. In a society that increasingly has become focused on a “do it for me” culture, Payrailz’s smart technology makes the difference. Payrailz creates smarter payment experiences for the financial services industry that are predictive and more engaging than currently available alternatives. Financial institutions can confidently embrace Payrailz’s cloud based technology engine, including AI, dynamic workflow, open data exchange, and a robust SDK to offer unique payment solutions to their customers. Payrailz helps FIs meet the payment expectations of today and the payment innovation needs of tomorrow. For more information, visit www.payrailz.com , or visit them on Twitter @payrailz , Facebook or LinkedIn , or contact Mickey Goldwasser at 860.430.9245.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130005218/en/\nWilliam Mills Agency\nDebbie Rayburn, 678-781-7220\ndeborah@williammills.com\nor\nPayrailz\nMickey Goldwasser, 860-430-9245\nmgoldwasser@payrailz.com\nSource: Payrailz", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Fpayrailz&esheet=51750507&newsitemid=20180130005218&lan=en-US&anchor=%40payrailz&index=2&md5=72abfcde5df6f913cac0ddb0a7327dc3", "http://www.businesswire.com/news/home/20180130005218/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2F11251422%2F&esheet=51750507&newsitemid=20180130005218&lan=en-US&anchor=LinkedIn&index=4&md5=c84b654a48a5c29bb8c1a9184a95ef93", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.facebook.com%2FPayrailz%2F&esheet=51750507&newsitemid=20180130005218&lan=en-US&anchor=Facebook&index=3&md5=68ea224058d34452dc9493dd0f5bc9a0", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.payrailz.com&esheet=51750507&newsitemid=20180130005218&lan=en-US&anchor=www.payrailz.com&index=1&md5=e7ff597df8cffa9da950ebd4821bf68c"], "published": "2018-01-30T16:00:00.000+02:00", "crawled": "2018-01-30T17:46:27.011+02:00", "highlightTitle": ""}