{"organizations": [], "uuid": "946a2fd2b62a8b0772a0e58b42c9dd809e067e4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 19, "shares": 19, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-floods-climatechange/warming-will-put-millions-more-at-flood-risk-in-next-20-years-scientists-idUSKBN1EZ2JE", "country": "US", "domain_rank": 408, "title": "Warming will put millions more at flood risk in next 20 years: scientists", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T03:07:00.000+02:00", "replies_count": 0, "uuid": "946a2fd2b62a8b0772a0e58b42c9dd809e067e4e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-floods-climatechange/warming-will-put-millions-more-at-flood-risk-in-next-20-years-scientists-idUSKBN1EZ2JE", "ord_in_thread": 0, "title": "Warming will put millions more at flood risk in next 20 years: scientists", "locations": [], "entities": {"persons": [], "locations": [{"name": "rome", "sentiment": "none"}, {"name": "south america", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "potsdam institute for climate impact research", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROME (Thomson Reuters Foundation) - Unless countries urgently boost their flood defenses, millions more people will be at risk from river flooding in the next 20 years as global warming increases the likelihood of severe rainfall, scientists said on Wednesday.\nIn Asia, the numbers at risk will more than double to 156 million, up from 70 million, with India, China and Indonesia among the worst-affected countries, according to a study by the Potsdam Institute for Climate Impact Research.\nThe numbers at risk in South America also will double, to 12 million, and Africa will see a rise to 34 million facing flooding threats, up from 25 million, the researchers said.\nHowever, the actual number of people at risk is likely to be higher than the scientists’ predictions, as the estimates do not take into account population growth or more people moving to areas at risk of flooding, scientists said.\nThe United States and parts of Europe also will need to make major investments in flood protection - such as improving river dykes, river management and building standards, or relocating people - to prevent a rise in the numbers of people facing flooding.\n“More than half of the United States must at least double their protection level within the next two decades if they want to avoid a dramatic increase in river flood risks,” Sven Willner, from the Germany-based Potsdam Institute, said in a statement.\nGlobal warming increases the risk of flooding because the amount of rain that can fall during an extreme downpour “increases exponentially” as temperatures rise, Anders Levermann, also of the Potsdam Institute, said in an interview.\nGlobal temperatures have already risen by more than 1 degree Celsius above pre-industrial levels, and are expected to continue rising.\nCountries committed in 2015 to try to hold global temperature rise to “well below” 2 degrees Celsius, but the world is currently on track for more than 3 degrees Celsius of warming, a level expected cause much more extreme and unpredictable weather, and to cause worsening crop failures and more migration.\n“This is already something we have caused ... and we have to adapt to now,” Levermann said. “Doing nothing will be dangerous.”\nAlthough river floods may seem less dramatic than hurricanes and cyclones, they can inflict serious damage. Last year, Peru experienced its worst flooding in decades, causing up to $9 billion in damage.\nSouth Asia in 2017 suffered its worst monsoon flooding in a decade, which killed more than 1,400 people, left hundreds of villages submerged and drove tens of thousands of people to relief camps.\nDisaster management officials in the region said although flooding is normal during the monsoon months, they received a whole year’s rain in just a few days.\nFLOODS AND FOOD But the question of how best to protect people from river floods is a complex one.\n“It’s not that straightforward to think if only we built dykes and levees along the rivers ... then the world will be a safe place,” said Richard Klein, a senior research fellow at the Stockholm Environment Institute.\nBuilding flood protection “will also have an effect on food production and it will increase the risk of particularly high magnitude events”, he told the Thomson Reuters Foundation.\nIn Bangladesh for example, regular and often predictable floods dump a fertile layer of river sediment on fields, one reason the country is self sufficient in rice, Klein said.\n“People tend to pick up their stuff, move to higher ground and come back when the water’s gone, and (they) benefit from the fertile soil that they have,” he said.\nBuilding infrastructure to contain floodwaters can also give people a false sense of security, so they are more likely to build in areas still at risk of flooding after a severe downpour.\n“That’s not to say one shouldn’t protect people, but ... simply protecting ... has consequences,” he said.\nReporting by Alex Whiting; editing by Laurie Goering :; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, climate change, resilience, women's rights, trafficking and property rights. Visit news.trust.org/climate\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://news.trust.org/climate"], "published": "2018-01-11T03:07:00.000+02:00", "crawled": "2018-01-11T03:49:30.020+02:00", "highlightTitle": ""}