{"organizations": [], "uuid": "7d5cfcae36b3e64849b1e5e4d2aa51d9ae111cb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-mellanox-achieves-record-quarterly-and-annual-revenues-forecasts-strong-2018.html", "country": "US", "domain_rank": 767, "title": "Mellanox Achieves Record Quarterly and Annual Revenues; Forecasts Strong 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T00:05:00.000+02:00", "replies_count": 0, "uuid": "7d5cfcae36b3e64849b1e5e4d2aa51d9ae111cb9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-mellanox-achieves-record-quarterly-and-annual-revenues-forecasts-strong-2018.html", "ord_in_thread": 0, "title": "Mellanox Achieves Record Quarterly and Annual Revenues; Forecasts Strong 2018", "locations": [], "entities": {"persons": [{"name": "eyal waldman", "sentiment": "none"}], "locations": [{"name": "yokneam", "sentiment": "none"}, {"name": "sunnyvale", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "cost rationalization builds foundation", "sentiment": "none"}, {"name": "mellanox ® technologies, ltd.", "sentiment": "none"}, {"name": "mellanox technologies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Quarterly Revenue Record of $238 Million, Up 5 Percent Sequentially and 7 Percent Year Over Year\n2017 Ethernet Revenues Up 26 Percent and 25/50/100 Gigabit Revenues Up 156 Percent Year-Over-Year\nRevenue Growth and Cost Rationalization Builds Foundation for Expanding Operating Leverage\nSUNNYVALE, Calif. & YOKNEAM, Israel--(BUSINESS WIRE)-- Mellanox ® Technologies, Ltd. (NASDAQ: MLNX) today announced financial results for its fourth quarter and full year 2017 ended December 31, 2017.\n“We are pleased to achieve record quarterly and full year revenues,” said Eyal Waldman, President and CEO of Mellanox Technologies. “2017 represented a year of investment and product transitions for Mellanox. Fourth quarter Ethernet revenues increased 11 percent sequentially, due to expanding customer adoption of our 25 gigabit per second and above Ethernet products across all geographies. We are encouraged by the acceleration of our 25 gigabit per second and above Ethernet switch business, which grew 41 percent sequentially, with broad based growth across OEM, hyperscale, tier-2, cloud, financial services and channel customers. During the fourth quarter, InfiniBand revenues grew 2 percent sequentially, driven by growth from our high-performance computing and artificial intelligence customers. For the full fiscal 2017, our revenues from the high performance computing market grew 13 percent year over year. Our 2017 results demonstrate the successful execution of our multi-year revenue diversification strategy, and our leadership position in 25 gigabit per second and above Ethernet adapters.”\nFourth Quarter 2017 - Highlights\nRevenues were $237.6 million in the fourth quarter, and $863.9 million in fiscal year 2017. GAAP gross margins were 64.1 percent in the fourth quarter, and 65.2 percent in fiscal year 2017. Non-GAAP gross margins were 68.8 percent in the fourth quarter, and 70.4 percent in fiscal year 2017. GAAP operating loss was $(6.7) million, or (2.8) percent of revenue, in the fourth quarter, and was $(17.1) million, or (2.0) percent of revenue, in fiscal year 2017. Non-GAAP operating income was $38.0 million, or 16.0 percent of revenue, in the fourth quarter, and $118.7 million, or 13.7 percent of revenue, in fiscal year 2017. GAAP net loss was $(2.6) million in the fourth quarter, and was $(19.4) million in fiscal year 2017. Non-GAAP net income was $42.9 million in the fourth quarter, and $116.6 million in fiscal year 2017. GAAP net loss per diluted share was $(0.05) in the fourth quarter, and $(0.39) in fiscal year 2017. Non-GAAP net income per diluted share was $0.82 in the fourth quarter, and $2.28 in fiscal year 2017. $66.9 million in cash was provided by operating activities during the fourth quarter. $161.3 million in cash was provided by operating activities during fiscal year 2017. Cash and investments totaled $273.8 million at December 31, 2017.\nMr. Waldman continued, “As we enter 2018, we expect to build on our momentum in Ethernet and InfiniBand. With the recent release of our BlueField system-on-chip, and the future introduction of our 200 gigabit per second InfiniBand and Ethernet products, Mellanox is well positioned to begin reaping the benefits from prior investments. Looking ahead, we anticipate seeing acceleration of revenue growth, while delivering on our commitment to more efficiently manage costs and achieve fiscal 2018 non-GAAP operating margins of 18 to 19 percent. We continue to drive improvements in profitability and identify further efficiencies that can be realized as our prior investments begin to yield positive results and we transition towards new product introductions in 2018 and beyond.”\nFirst Quarter 2018 Outlook\nWe currently project:\nQuarterly revenues of $222 million to $232 million Non-GAAP gross margins of 68.5 percent to 69.5 percent Non-GAAP operating expenses of $120 million to $122 million Share-based compensation expense of $16.3 million to $16.8 million Non-GAAP diluted share count of 52.4 million to 52.9 million\nFull Year 2018 Outlook\nWe currently project:\nRevenues of $970 million to $990 million Non-GAAP gross margins of 68.0 percent to 69.0 percent Non-GAAP operating margin of 18.0 percent to 19.0 percent Non-GAAP operating margin of more than 20.0 percent exiting 2018\nRecent Mellanox Press Release Highlights\n• January 16, 2018 Mellanox ConnectX®-5 Ethernet Adapter Wins Linley Group Analyst Choice Award for Best Networking Chip • January 9, 2018 Mellanox Discontinuing 1550nm Silicon Photonics Development Activities • January 4, 2018 Mellanox Ships BlueField™ System-on-Chip Platforms and SmartNIC Adapters to Leading OEMs and Hyperscale Customers • December 18, 2017 Meituan.com Selects Mellanox Interconnect Solutions to Accelerate its Artificial Intelligence, Big Data and Cloud Data Centers • December 12, 2017 Mellanox Interconnect Solutions Accelerate Tencent Cloud High-Performance Computing and Artificial Intelligence Infrastructure • December 4, 2017 Mellanox and NEC Partner to Deliver Innovative High-Performance and Artificial Intelligence Platforms • November 14, 2017 Mellanox Propels NetApp to New Heights with 100Gb/s InfiniBand Connectivity • November 13, 2017 Deployment Collaboration with Lenovo will Power Canada’s Largest Supercomputer Centre with Leading Performance, Scalability for High Performance Computing Applications • November 13, 2017 Mellanox InfiniBand Solutions to Accelerate the World’s Next Fastest Supercomputers • November 13, 2017 Mellanox InfiniBand to Accelerate Japan's Fastest Supercomputer for Artificial Intelligence Applications • November 13, 2017 InfiniBand Accelerates 77 Percent of New High-Performance Computing Systems on TOP500 Supercomputer List Conference Call\nMellanox will hold its fourth quarter and fiscal year 2017 financial results conference call today, at 2 p.m. Pacific Time, to discuss the company’s financial results. To listen to the call, dial 1-800-459-5343, or for investors outside the U.S., +1-203-518-9553, approximately 10 minutes prior to the start time.\nThe Mellanox financial results conference call will be available via live webcast on the investor relations section of the Mellanox website at: http://ir.mellanox.com . Access the webcast 15 minutes prior to the start of the call to download and install any necessary audio software. A replay of the webcast will also be available on the Mellanox website.\nAbout Mellanox\nMellanox Technologies is a leading supplier of end-to-end InfiniBand and Ethernet interconnect solutions and services for servers and storage. Mellanox interconnect solutions increase data center efficiency by providing the highest throughput and lowest latency, delivering data faster to applications and unlocking system performance capability. Mellanox offers a choice of fast interconnect products: adapters, switches, software, cables and silicon that accelerate application runtime and maximize business results for a wide range of markets including high-performance computing, enterprise data centers, Web 2.0, cloud, storage and financial services. More information is available at: www.mellanox.com .\nGAAP to Non-GAAP Reconciliation\nTo supplement our consolidated financial statements presented in accord", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.mellanox.com&esheet=51745569&newsitemid=20180118006295&lan=en-US&anchor=www.mellanox.com&index=2&md5=4fe6676256a1ad29a978aa1309385375", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fir.mellanox.com&esheet=51745569&newsitemid=20180118006295&lan=en-US&anchor=http%3A%2F%2Fir.mellanox.com&index=1&md5=8f3cb5e8e52dc3ca4bebe76f51863897", "http://www.businesswire.com/news/home/20180118006295/en/"], "published": "2018-01-19T00:05:00.000+02:00", "crawled": "2018-01-19T00:19:32.004+02:00", "highlightTitle": ""}