{"organizations": [], "uuid": "39f10be8ec811434902ccdbd213f09386e42ff2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/business-wire-standard-diversified-opportunities-inc-closes-acquisition-of-maidstone-insurance-company.html", "country": "US", "domain_rank": 767, "title": "Standard Diversified Opportunities Inc. Closes Acquisition of Maidstone Insurance Company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.044, "site_type": "news", "published": "2018-01-03T00:34:00.000+02:00", "replies_count": 0, "uuid": "39f10be8ec811434902ccdbd213f09386e42ff2f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/business-wire-standard-diversified-opportunities-inc-closes-acquisition-of-maidstone-insurance-company.html", "ord_in_thread": 0, "title": "Standard Diversified Opportunities Inc. Closes Acquisition of Maidstone Insurance Company", "locations": [], "entities": {"persons": [{"name": "contri", "sentiment": "negative"}, {"name": "ian estus", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "del.", "sentiment": "none"}, {"name": "maidstone", "sentiment": "none"}, {"name": "wilmington", "sentiment": "none"}], "organizations": [{"name": "closes acquisition of maidstone insurance company plans to utilize insurance platform", "sentiment": "negative"}, {"name": "standard diversified opportunities inc", "sentiment": "neutral"}, {"name": "maidstone insurance company", "sentiment": "none"}, {"name": "standard diversified opportunities inc.", "sentiment": "none"}, {"name": "standard diversified", "sentiment": "none"}, {"name": "holdings", "sentiment": "none"}, {"name": "sdoia", "sentiment": "none"}, {"name": "interboro llc", "sentiment": "none"}, {"name": "interboro holdings", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Plans to Utilize Insurance Platform to Maximize Long-term Book Value Appreciation; Company to Contribute $10 Million in Connection with the Transaction\nWILMINGTON, Del.--(BUSINESS WIRE)-- Standard Diversified Opportunities Inc. (“Standard Diversified” or the “Company”) (OTCQB: SDOIA) announced today that it has successfully completed its acquisition of the parent entity of Maidstone Insurance Company.\nIn November 2016, Standard Diversified entered into a Stock Purchase Agreement (the “Stock Purchase Agreement”) with Interboro LLC to acquire all of the outstanding capital stock of Interboro Holdings (“Holdings”) for a cash purchase price of $2.5 million, subject to adjustment as provided in the Stock Purchase Agreement. The Company has also agreed to contribute $10 million of new capital in connection with the closing of the transaction.\nThrough its wholly-owned subsidiary, Maidstone Insurance Company, Holdings offers personal automobile insurance, primarily in the State of New York. Maidstone is licensed to write personal property and/or automobile insurance in 24 states.\nIan Estus, President and CEO of the Company, stated, “The closing of the Maidstone acquisition completes the first step in the planned buildout of our insurance platform, Pillar General. Pillar General is focused on building a property & casualty insurance business that is designed to achieve favorable returns and consistent book value appreciation.\"\nDebevoise & Plimpton LLP and Morgan, Lewis & Bockius LLP served as Standard Diversified’s legal counsel. Nixon Peabody LLP served as Interboro LLC’s legal counsel and Stonybrook Capital served as the exclusive financial adviser to Interboro LLC.\nAbout Standard Diversified Opportunities Inc.\nStandard Diversified Opportunities Inc. is a holding company that owns and operates subsidiaries in a variety of industries, including other tobacco products, outdoor advertising and insurance.\nCautionary Statement Regarding Forward-Looking Statements\nThis press release contains “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. All statements, other than statements of historical facts, are forward-looking statements. These forward-looking statements address, among other things activities, events or developments that the Company expects, believes or anticipates will or may occur in the future, including the Company’s statements relating to the anticipated buildout of its insurance platform, the performance of the insurance business, the impact of the insurance business on book value appreciation and the Company’s expected acquisition activity. These forward-looking statements are subject to a number of risks that could cause actual results to differ materially from those contained in the forward-looking statements, including those risks described in Part II, Item 5 of the Company’s Quarterly Reports on Form 10-Q for the quarters ended June 30, 2017 and September 30, 2017, as filed with the Securities and Exchange Commission.\nCurrently unknown or unanticipated risks, or risks that emerge in the future, could cause actual results to differ materially from those described in forward-looking statements, and it is not possible for the Company to predict all such risks, or the extent to which this may cause actual results to differ from those contained in any forward-looking statement. Except as required by law, the Company assumes no obligation to update publicly any such forward-looking statements, whether as a result of new information, future events, or otherwise.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180102005868/en/\nThe Equity Group Inc.\nAdam Prior, 212-836-9606\naprior@equityny.com\nSource: Standard Diversified Opportunities Inc.", "external_links": ["http://www.businesswire.com/news/home/20180102005868/en/"], "published": "2018-01-03T00:34:00.000+02:00", "crawled": "2018-01-03T02:10:02.005+02:00", "highlightTitle": ""}