{"organizations": [], "uuid": "2d10a283f7630516bcd847b4f314420ac8582c9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226506055&w=1200&r=LYNXMPEE0T08W", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-china-pollution-coal/chinas-shanxi-province-asks-coal-miners-to-cut-or-shorten-holidays-document-idUSKBN1FJ0EY", "country": "US", "domain_rank": 408, "title": "China's No. 2 coal region asks miners to cancel or shorten holidays", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T12:19:00.000+02:00", "replies_count": 0, "uuid": "2d10a283f7630516bcd847b4f314420ac8582c9f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-china-pollution-coal/chinas-shanxi-province-asks-coal-miners-to-cut-or-shorten-holidays-document-idUSKBN1FJ0EY", "ord_in_thread": 0, "title": "China's No. 2 coal region asks miners to cancel or shorten holidays", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "shanxi", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - China’s No. 2 coal producing province has asked coal miners to shorten or cancel staff holidays during upcoming Spring Festival celebrations, as authorities rush to avoid a potential power crisis during the nation’s most important break.\nIn the document reviewed by Reuters, the Shanxi provincial coal administration told city authorities and state-owned coal companies it wants to tame a price rally and ensure fuel supplies.\nAn official at the provincial coal administration confirmed its authenticity.\n“We are asking big state-owned coal miners to stagger maintenance and increase coal supplies during the Spring Festival, but of course under the basis of ensuring safety,” the official told Reuters over the phone.\nShanxi’s request follows a Reuters report on Jan. 26 that four of China’s top utilities warned of heating and electricity shortages as China’s worst blizzards this winter snarled railroads and highways, cutting off critical supplies of the fuel ahead of and during the Spring Festival holiday.\nThe holiday, also known as the Lunar New Year, will start on Feb. 15 this year, with when hundreds of millions of people traveling vast distances to celebrate with their families.\nShanxi produced 845 million tonnes of coal last year, up 5 percent from 2016 and a quarter of the national total.\nIt’s not unusual for miners to reduce leave during the Lunar New Year holiday. Last year, some slashed leave and raised pay to cash in on high prices.\nBut the intervention of the provincial government illustrates growing concern about higher-than-usual heating demand due to the current cold wave, which is expected to last until Feb. 5.\nFILE PHOTO: A worker loads coal onto a cart at a coal mine in Taiyuan, Shanxi province, China November 4, 2010. REUTERS/Stringer/File Photo Maintaining stability is a main priority for the Communist Party, particularly ahead of and during Spring Festival.\nThe authorities want to avoid a repeat of December’s chaos, which saw serious gas supply shortages across the north after millions of homes were converted to gas or electric heating from coal as part of Beijing’s war on smog.\nThe push to boost output temporarily also highlights the complexity of carrying out Beijing’s orders to get rid of excess in its bloated heavy industry.\nThis month, Shanxi has announced a series of measures to cut coal capacity by 23 million tonnes this year and close small mines as part of its efforts to streamline the sector.\nPRICES FALLING, BUT FOR HOW LONG? On Tuesday, thermal coal futures on China’s Zhengzhou Commodity Exchange were down 1.4 percent at 666.8 yuan ($105.26) per tonne, on track for their biggest one-day drop in a month as worries about tight supplies of China’s favorite fuel waned as snowstorms eased.\nStill, data shows daily demand from utilities remained near record seasonal highs and stockpiles at power plants continued to fall. Coal-fired power accounts for the majority of China’s power generation.\nAnalysts say the drop may be shortlived as power producers will need to restock to shore up supplies for the busy holiday period. That usually starts a week before the holiday, which would be around Feb. 8.\nPrices have gain 10 percent this year and risen 74 percent from a year ago amid resurgent demand for coal due to a particularly cold spell.\nReporting by Muyu Xu and Josephine Mason; Editing by Christian Schmollinger and Joseph Radford\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T12:19:00.000+02:00", "crawled": "2018-01-30T16:30:20.005+02:00", "highlightTitle": ""}