{"organizations": [], "uuid": "676f60a1ee77fdd96d5cf971112a7370a56f3d8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/29/104975111-GettyImages-904054602.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/asia-markets-dollar-and-us-yields-in-focus.html", "country": "US", "domain_rank": 767, "title": "Asia markets: Dollar and US yields in focus", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.23, "site_type": "news", "published": "2018-01-30T01:43:00.000+02:00", "replies_count": 0, "uuid": "676f60a1ee77fdd96d5cf971112a7370a56f3d8a"}, "author": "Cheang Ming", "url": "https://www.cnbc.com/2018/01/29/asia-markets-dollar-and-us-yields-in-focus.html", "ord_in_thread": 0, "title": "Asia markets: Dollar and US yields in focus", "locations": [], "entities": {"persons": [], "locations": [{"name": "asia pacific", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "osaka", "sentiment": "none"}, {"name": "u.s. west texas intermediate", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "asx", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "hong kong-listed ping an insurance", "sentiment": "none"}, {"name": "hong kong exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Asian indexes traded lower Tuesday, tracking declines seen on Wall Street in the previous session.\nTokyo's benchmark Nikkei 225 index fell 1.43 percent, or 337.37 points, to close at 23,291.97. Early gains seen in automaker stocks were erased as the session wore on: Toyota finished the session off by 0.18 percent and Honda declined 0.56 percent by the end of the day.\nTechnology names closed mostly lower, with heavyweight SoftBank Group falling 1.48 percent and Sony losing 1.93 percent. Trading houses and energy-related names also traded in negative territory, although several manufacturing names proved to be bright spots: Komatsu and Hitachi Construction Machinery were up 1.67 percent and 7.02 percent, respectively.\nSymbol Name Price Change %Change NIKKEI --- HSI --- ASX 200 --- SHANGHAI --- KOSPI --- CNBC 100 --- Data released earlier in the day showed that retail sales last month rose 3.6 percent compared to one year ago, above the 1.8 percent median projected rise, Reuters said. Retail stocks were lower, with heavyweight Fast Retailing declining 2.25 percent by the end of the day.\nApple suppliers under pressure Apple suppliers in the region took a hit following the tech giant's overnight tumble, which came on the back of a Nikkei report about a reported reduction in iPhone X production . In Japan, Japan Display closed lower by 0.83 percent although Sharp held above the flat line, gaining 0.25 percent. At 2:33 p.m. HK/SIN, Hong Kong's AAC Technologies and Sunny Optical were down 2.21 percent and 1.59 percent, respectively.\nOver in Seoul, the Kospi declined 1.17 percent to close at 2,567.74 after rising nearly 1 percent and notching a record close in the previous session. Technology stocks traded lower, weighing on the broader index. Blue chip Samsung Electronics sank 2.77 percent ahead of its earnings report due Wednesday and SK Hynix declined 2.92 percent.\nDown Under, the S&P/ASX 200 finished the session lower by 0.87 percent at 6,022.8 on broad-based weakness across sectors. The heavily-weighted financials sector closed lower by 0.58 percent and major mining stocks were mostly lower, with BHP falling by 1.27 percent.\nGold producers were mixed after several names reported production numbers for the second quarter. Newcrest Mining declined 1.83 percent and Evolution Mining reversed early losses to edge up by 0.36 percent by the end of the day.\nGreater China markets also traded lower after sliding in the afternoon in the previous session on profit taking. Hong Kong's Hang Seng Index fell 1.05 percent in late afternoon trade.\nOn the mainland, the Shanghai composite closed down 34.81 points, or 0.99 percent, at 3,488.18, and the Shenzhen composite fell 10.23 points, or 0.53 percent, to 1,909.57.\nU.S. stocks closed lower , with the Dow Jones industrial average declining 177.23 points to close at 26,439.48. That came as the yield on the 10-year Treasury note rose above 2.7 percent, its highest levels since April 2014. The rise in bond rates this year has been driven by concerns over higher inflation.\n\"There were no major news behind the move higher in yields, but given the recent break of key resistance levels, core yields now have more freedom to move higher,\" Rodrigo Catril, senior FX strategist at National Australia Bank, wrote in a morning note.\nMajor indexes stateside had closed at record highs last week on the back of upbeat corporate earnings. As of Monday morning, 78 percent of S&P 500 companies that have announced results have topped earnings expectations, according to FactSet.\nDollar decline pauses The dollar was edged up against a basket currencies following the rise in bond yields overnight. The dollar index traded at 89.553 3:15 p.m. HK/SIN, climbing from an earlier low of 89.312. Against the yen , the U.S. currency traded at 108.73 after earlier climbing as high as 109.20.\nThe euro edged lower to trade at $1.2355, falling from an earlier high of $1.2388.\nOn the commodities front, oil prices declined further after settling lower on Monday on the firmer dollar. U.S. West Texas Intermediate crude slid 1.02 percent to trade at $64.89 per barrel. Brent crude futures shed 0.71 percent to trade at $68.97.\nCorporate news Shares of Wanda Hotel Development surged 26.67 percent. The move higher came after news that several investors, including Tencent , are preparing to buy a 14 percent stake in a commercial real estate unit of Dalian Wanda Group, Reuters reported.\nHong Kong-listed Ping An Insurance announced in a Monday filing that its application to spin-off its health care and technology unit had been approved by the Hong Kong Exchange. The company said the application proof of the unit's prospectus will be made available Jan. 30. Shares of Ping An were off by 0.66 percent.\n— CNBC's Fred Imbert contributed to this report.", "external_links": [], "published": "2018-01-30T01:43:00.000+02:00", "crawled": "2018-01-30T01:45:54.004+02:00", "highlightTitle": ""}