{"organizations": [], "uuid": "7ea757cc70bd618825739b3d64e9c176203e9745", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/2017_12_18_wag-132retouched.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/30/dog-walking-app-wag-softbank-vision-fund/", "country": "US", "domain_rank": 1196, "title": "SoftBank Vision Fund Invests $300M in Dog Walking App Wag | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.022, "site_type": "news", "published": "2018-01-20T02:00:00.000+02:00", "replies_count": 0, "uuid": "7ea757cc70bd618825739b3d64e9c176203e9745"}, "author": "Rachel King", "url": "http://fortune.com/2018/01/30/dog-walking-app-wag-softbank-vision-fund/", "ord_in_thread": 0, "title": "SoftBank Vision Fund Invests $300M in Dog Walking App Wag | Fortune", "locations": [], "entities": {"persons": [{"name": "schneider", "sentiment": "none"}, {"name": "hilary schneider", "sentiment": "none"}, {"name": "josh viner", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}], "organizations": [{"name": "softbank vision fund invests", "sentiment": "negative"}, {"name": "symantec", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "softbank", "sentiment": "none"}, {"name": "vision fund", "sentiment": "none"}, {"name": "yahoo americas", "sentiment": "none"}, {"name": "softbank vision fund", "sentiment": "none"}, {"name": "lifelock", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Rachel King January 30, 2018 \nWag, the nation’s largest on-demand mobile dog walking and care app , is taking some major steps forward with a new chief executive and a fresh infusion of cash from the SoftBank Vision Fund . \nSoftBank’s Vision Fund, the world’s largest private equity fund that counts Apple and Saudi Arabia’s main sovereign wealth fund among its investors , has committed $300 million to the Los Angeles-based tech startup. That would provide SoftBank with a roughly 45% stake in the company, according to Recode . \nWag also announced on Tuesday that it has hired tech industry veteran Hilary Schneider to join the company as its new chief executive officer. Schneider is replacing Josh Viner, one of the company’s co-founding brothers. Both of the co-founders are expected to remain with the company in undisclosed senior roles. \nSchneider previously served as CEO of identity theft protection firm LifeLock, through the company’s sale to Symantec for $2.3 billion in March 2017. Prior to LifeLock, Schneider also served as executive vice president at both Yahoo Americas and at Knight Ridder, once the second-largest newspaper publisher in the United States. (Schneider also has two dogs of her own: a pair of Russian Black Terriers named Sadie and Zoe.) \nAlong with the major financial stake, SoftBank is installing some more new leadership of its own. Under the deal, SoftBank Investment Advisers Managing Partner Jeffrey Housenbold will become chairman of Wag’s board of directors. Ted Fike, a senior investor at SoftBank Investment Advisers, will also join the board. \nWag’s services range from providing on-demand walks to overnight boarding, with services available 24 hours per day, seven days per week. The company has expanded considerably since launching in 2015 from Los Angeles and New York City to more than 100 cities nationwide. \nPrior to the Vision Fund’s investment, Wag said it had already generated approximately $68 million during previous fundraising rounds. Investors include Battery Ventures, General Catalyst, Sherpa Capital, Bullpen Capital, and Freestyle Capital. More recently, Battery led a previous $40 million round in April 2017. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-20T02:00:00.000+02:00", "crawled": "2018-01-31T15:34:50.089+02:00", "highlightTitle": ""}