{"organizations": [], "uuid": "2967da2cf15abb965038a8c54972a4f41cfda1a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-ameriserv-financial-reports-earnings-for-the-fourth-quarter-and-full-year-of-2017.html", "country": "US", "domain_rank": 767, "title": "AmeriServ Financial Reports Earnings For The Fourth Quarter And Full Year Of 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.071, "site_type": "news", "published": "2018-01-23T16:00:00.000+02:00", "replies_count": 0, "uuid": "2967da2cf15abb965038a8c54972a4f41cfda1a9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-ameriserv-financial-reports-earnings-for-the-fourth-quarter-and-full-year-of-2017.html", "ord_in_thread": 0, "title": "AmeriServ Financial Reports Earnings For The Fourth Quarter And Full Year Of 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "johnstown", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}], "organizations": [{"name": "ameriserv", "sentiment": "negative"}, {"name": "ameriserv financial, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JOHNSTOWN, Pa., Jan. 23, 2018 /PRNewswire/ -- AmeriServ Financial, Inc. (NASDAQ: ASRV) reported a fourth quarter 2017 net loss available to common shareholders of $995,000, or ($0.05) per diluted common share, due to the enactment into law of \"H.R.1.\", known as the \"Tax Cuts and Jobs Act\", which necessitated the revaluation of the Company's deferred tax asset because of the new lower corporate tax rate. This revaluation required that the Company recognize additional income tax expense of $2.6 million, which is consistent with the information previously disclosed in an 8-K filed on January 11, 2018. In the fourth quarter of 2016, net income available to common shareholders totaled $1,150,000, or $0.06 per diluted common share. For the year ended December 31, 2017, the Company reported net income available to common shareholders of $3,293,000, or $0.18 per diluted common share. This represents an improvement of $998,000 from the full year of 2016 where net income available to common shareholders totaled $2,295,000, or $0.12 per diluted common share. The additional income tax expense negatively impacted diluted earnings per share by $0.14 for both the fourth quarter and full year of 2017. The following table highlights the Company's financial performance for both the three month and twelve month periods ended December 31, 2017 and 2016:\nFourth Quarter\n2017\nFourth Quarter\n2016\nYear Ended\nDecember 31, 2017\nYear Ended\nDecember 31, 2016\nNet income (loss)\n($995,000)\n$1,150,000\n$3,293,000\n$2,310,000\nNet income (loss)\navailable to common\nshareholders\n($995,000)\n$1,150,000\n$3,293,000\n$2,295,000\nDiluted earnings per\nshare\n($ 0.05)\n$ 0.06\n$ 0.18\n$ 0.12\nJeffrey A. Stopko, President and Chief Executive Officer, commented on the 2017 financial results: \"I was particularly pleased with our quarterly trend of increasing pre-tax income and strong capital returns to our shareholders in 2017. The growth in earnings resulted from a favorable combination of increased revenue, reduced non-interest expense and a lower loan loss provision due to good asset quality. We are entering 2018 with good momentum in our community banking and wealth management businesses. When this positive business momentum is combined with an improving economy and a lower effective corporate tax rate, we believe AmeriServ Financial is well positioned to achieve meaningful earnings growth in 2018.\"\nThe Company's net interest income in the fourth quarter of 2017 increased by $420,000, or 4.9%, from the prior year's fourth quarter and for the full year of 2017 increased by $1.4 million, or 4.2%, when compared to the full year of 2016. The Company's net interest margin was 3.31% for the quarter and 3.32% for the full year of 2017 representing an improvement of 13 basis points from the prior year's fourth quarter and a six basis point improvement from the full year of 2016. The 2017 increase in net interest income is a result of a higher level of total earning assets and favorable balance sheet positioning which has contributed to the improved net interest margin performance. The Company continues to grow earning assets while also limiting increases in its cost of funds through disciplined deposit pricing. Specifically, for the quarter, the earning asset growth occurred in both the loan and investment securities portfolios. Total investment securities averaged $175 million in the fourth quarter of 2017 which is $21 million, or 13.7%, higher than the $154 million average for the fourth quarter of 2016. Investment securities have also averaged $173 million for the full year of 2017 which is $25.3 million, or 17.2%, higher than the full year 2016 average. Total loans averaged $894 million for the full year 2017 which is $6.2 million, or 0.7%, higher than the 2016 full year average.\nThe growth in the investment securities portfolio is the result of management electing to diversify the mix of the investment securities portfolio through purchases of high quality corporate and taxable municipal securities. This revised strategy for securities purchases was facilitated by the increase in national interest rates that resulted in improved opportunities to purchase additional securities and grow the portfolio. As a result, interest on investments increased between the fourth quarter of 2017 and the fourth quarter of 2016 by $285,000 or 27.0% and increased for the full year of 2017 from 2016 by $1,131,000 or 28.2%. Even though loan production slowed somewhat during the fourth quarter because of the uncertainty in the market from potential borrowers of the timing that corporate tax reform would be enacted, the loan portfolio still demonstrated an increase for both time periods. This increase was the result of the successful results of the Company's business development efforts, with an emphasis on generating all types of commercial business loans particularly through its loan production offices. Loan interest income increased by $503,000, or 5.3%, between the fourth quarter of 2017 and the fourth quarter of 2016 and also increased by $1,356,000, or 3.6%, for the full year of 2017 when compared to last year. The higher loan interest income also results from new loans originating at higher yields due to the higher interest rates and also reflects the upward repricing of certain loans tied to LIBOR or the prime rate as both of these indices have moved up with the Federal Reserve's decision to increase the target federal funds interest rate by 25 basis points three times in 2017. Overall, total interest income increased by $2.5 million, or 5.9%, for the full year of 2017.\nTotal interest expense for the fourth quarter of 2017 increased by $368,000, or 18.4%, and increased by $1,060,000, or 13.7%, for the full year of 2017 when compared to 2016, due to higher levels of both deposit and borrowing interest expense. The Company experienced growth in deposits which we believe reflects the loyalty of our core deposit base that provides a strong foundation upon which this growth builds. Management's ability to acquire new core deposit funding from outside of our traditional market areas as well as our ongoing efforts to offer new loan customers deposit products were the primary reasons for this growth. Specifically, total deposits averaged $976 million for the full year of 2017 which is $20.8 million, or 2.2%, higher than the $956 million average for the full year of 2016. Deposit interest expense in 2017 increased by $855,000, or 15.8%, due to the higher balance of deposits along with certain indexed money market accounts repricing upward after the Federal Reserve interest rate increases. As a result of the solid deposit growth, the Company's loan to deposit ratio averaged 91.5% in 2017 which we believe indicates that the Company has ample capacity to further grow its loan portfolio. The Company experienced a $205,000 increase in the interest cost for borrowings in 2017 primarily due to the immediate impact that the increases in the Federal Funds Rate had on the cost of overnight borrowed funds. For the full year of 2017, total average FHLB borrowed funds of $62.6 million, increased by $4.9 million, or 8.4%.\nThe Company recorded a $50,000 provision for loan losses in the fourth quarter of 2017 compared to a $300,000 provision for loan losses in the fourth quarter of 2016. The lower provision during the fourth quarter of 2017 reflects the payoff of one large criticized commercial real estate credit exposure that had exhibited chronic delinquency. For the full year of 2017, the Company recorded an $800,000 provision for loan losses compared to a $3,950,000 provision for loan losses in 2016 or a decrease of $3.2 million between years. Both, the loan loss provision and net charge-offs were at more typical levels this year than the substantially higher levels that were necessary early last year to resolve a troubled loan exposure to the energy industry. The provision recorded in 2017 supported commercial loan growth and more than covered the low level of net loan charge-offs in 2017. The Company experienced net loan charge-offs of $518,000, or 0.06% of total loans in 2017 compared to net loan charge-offs of $3.9 million, or 0.44%, of total loans in 2016. Overall, the Company continued to maintain strong asset quality as its nonperforming assets declined during the fourth quarter and totaled $3.0 million, or 0.34%, of total loans, at December 31, 2017. In summary, the allowance for loan losses provided 337% coverage of non-performing loans, and 1.14% of total loans, at December 30, 2017, compared to 612% coverage of non-performing loans, and 1.12% of total loans, at December 31, 2016.\nTotal non-interest income in the fourth quarter of 2017 decreased by $99,000, or 2.6%, from the prior year's fourth quarter, and for the full year of 2017 was relatively consistent with last year, increasing slightly by $7,000. For the fourth quarter of 2017, the decrease was due to lower revenue from residential mortgage loan sales into the secondary market ($170,000) and mortgage related fee income ($16,000) as a result of reduced residential mortgage refinance activity and a lower level of residential mortgage production. The reduced mortgage related revenue more than offset a greater level of revenue, primarily from our trust and wealth management company, by $125,000 as this area benefitted from increasing market values for assets under management in 2017. Non-interest income for the full year of 2017 was also positively impacted by higher revenue from our wealth management operation including a $294,000 increase in financial services revenue, and a greater level of trust and investment advisory fees by $129,000. Wealth management continues to be an important strategic focus as it contributes to non-interest revenue comprising over 29% of the Company's total revenue in 2017. There was also a $62,000 increase in revenue from bank owned life insurance in 2017 due to the second quarter receipt of a death claim. These favorable items more than offset lower levels of service charges on deposits by $93,000, reduced mortgage related fees and residential mortgage loan sale gains by $287,000, and fewer gains realized from security sales by $62,000 in 2017.\nThe Company's total non-interest expense in the fourth quarter of 2017 decreased by $259,000, or 2.5%, when compared to the fourth quarter of 2016, and for the full year of 2017 decreased by $849,000, or 2.0%. The $849,000 full year decrease in non-interest expense was attributable to the Company's ongoing efforts to control costs. Specifically, a branch consolidation and closure of an unprofitable loan production office were the primary reasons for occupancy expense decreasing by $182,000, or 6.5%, and equipment costs declining by $103,000. Other expense is lower by $354,000 while professional fees declined by $222,000 due to lower legal fees and litigation costs, the non-recurrence of costs related to resolving a trust operations trading error in 2016, and declines in several other expense categories. Reduced FDIC insurance by $81,000 also contributed to the favorable full year expense comparison. Additionally, this ongoing cost control focus limited the full year increase in salary and employee benefits expense to $93,000, or 0.4%, despite additional investment in talent, particularly in our wealth management division. Similar trends were apparent in the previously noted decline in non-interest expense for the fourth quarter of 2017. Overall, the Company's full year efficiency ratio improved from 85.27% in 2016 to 81.13% in 2017 due to increased total revenue and reduced non-interest expenses.\nFinally, the Company recorded an income tax expense of $5.3 million, or an effective tax rate of 61.9%, in 2017. The higher income tax expense results from the impact of the additional income tax charge of $2.6 million recorded in the fourth quarter and is related to corporate income tax reform which is described in the beginning of this press release. Without this charge, the Company's effective tax rate would have approximated 31.5% in 2017. In 2016, income tax expense totaled $897,000, or an effective tax rate of 28.0%. Beginning in 2018, we expect a reduction in the Company's effective tax rate to approximately 20% which we believe will provide a meaningful boost to future earnings.\nThe Company had total assets of $1.17 billion, shareholders' equity of $95.1 million, a book value of $5.25 per common share and a tangible book value of $4.59 per common share at December 31, 2017. The additional income tax expense negatively impacted both book value per common share and tangible book value per common share by $0.14. In accordance with the common stock buyback program announced on January 24, 2017, the Company returned $3.4 million of capital to its shareholders through the repurchase of 839,337 shares of its common stock in 2017. This represents approximately 89% of the authorized common stock repurchase program. The Company continued to maintain strong capital ratios that exceed the regulatory defined well capitalized status.\nThis news release may contain forward-looking statements that involve risks and uncertainties, as defined in the Private Securities Litigation Reform Act of 1995, including the risks detailed in the Company's Annual Report and Form 10-K to the Securities and Exchange Commission. Actual results may differ materially.\nNASDAQ: ASRV\nSUPPLEMENTAL FINANCIAL PERFORMANCE DATA\nDecember 31, 2017\n(Dollars in thousands, except per share and ratio data)\n(Unaudited)\n2017\n1QTR\n2QTR\n3QTR\n4QTR**\nYEAR\nTO DATE\nPERFORMANCE DATA FOR THE PERIOD:\nNet income\n1,348\n1,389\n1,551\n(955)\n3,293\nNet income available to common shareholders\n1,348\n1,389\n1,551\n(955)\n3,293\nPERFORMANCE PERCENTAGES (annualized):\nReturn on average assets\n0.47%\n0.48%\n0.53%\n(0.34%)\n0.28%\nReturn on average equity\n5.74\n5.81\n6.37\n(4.07)\n3.42\nNet interest margin\n3.27\n3.27\n3.28\n3.31\n3.32\nNet charge-offs as a percentage of average loans\n0.04\n0.01\n0.11\n0.08\n0.06\nLoan loss provision as a percentage of average loans\n0.10\n0.14\n0.09\n0.02\n0.09\nEfficiency ratio\n82.04\n81.47\n80.42\n80.63\n81.13\nPER COMMON SHARE:\nNet income:\nBasic\n0.07\n0.07\n0.08\n(0.05)\n0.18\nAverage number of common shares outstanding\n18,814\n18,580\n18,380\n18,226\n18,498\nDiluted\n0.07\n0.07\n0.08\n(0.05)\n0.18\nAverage number of common shares outstanding\n18,922\n18,699\n18,481\n18,226\n18,600\nCash dividends declared\n0.015\n0.015\n0.015\n0.015\n0.060\n2016\n1QTR\n2QTR\n3QTR\n4QTR\nYEAR\nTO DATE\nPERFORMANCE DATA FOR THE PERIOD:\nNet income (loss)\n(1,267)\n1,362\n1,065\n1,150\n2,310\nNet income (loss) available to common shareholders\n(1,282)\n1,362\n1,065\n1,150\n2,295\nPERFORMANCE PERCENTAGES (annualized):\nReturn on average assets\n(0.45%)\n0.48%\n0.37%\n0.40%\n0.20%\nReturn on average equity\n(4.86)\n5.60\n4.27\n4.58\n2.30\nNet interest margin\n3.30\n3.23\n3.15\n3.18\n3.26\nNet charge-offs as a percentage of average loans\n1.60\n0.01\n0.14\n0.04\n0.44\nLoan loss provision as a percentage of average loans\n1.42\n0.11\n0.13\n0.13\n0.44\nEfficiency ratio\n89.24\n82.05\n85.07\n84.82\n85.27\nPER COMMON SHARE:\nNet income (loss):\nBasic\n(0.07)\n0.07\n0.06\n0.06\n0.12\nAverage number of common shares outstanding\n18,884\n18,897\n18,899\n18,903\n18,896\nDiluted\n(0.07)\n0.07\n0.06\n0.06\n0.12\nAverage number of common shares outstanding\n18,884\n18,948\n18,957\n18,990\n18,955\nCash dividends declared\n0.01\n0.01\n0.015\n0.015\n0.050\n** - The fourth quarter 2017 results were impacted by a $2.6 million increase of tax expense because of the new tax law that caused\nthe revaluation of the Company's deferred tax assets from 34% to 21%.\nAMERISERV FINANCIAL, INC.\n(Dollars in thousands, except per share, statistical, and ratio data)\n(Unaudited)\n2017\n1QTR\n2QTR\n3QTR\n4QTR\nFINANCIAL CONDITION DATA AT PERIOD END:\nAssets\n1,172,127\n1,171,962\n1,170,916\n1,167,655\nShort-term investments/overnight funds\n8,320\n8,389\n8,408\n7,954\nInvestment securities\n165,781\n168,367\n168,443\n167,890\nLoans and loans held for sale\n899,456\n897,876\n897,990\n892,758\nAllowance for loan losses\n10,080\n10,391\n10,346\n10,214\nGoodwill\n11,944\n11,944\n11,944\n11,944\nDeposits\n964,776\n956,375\n966,921\n947,945\nFHLB borrowings\n79,718\n87,143\n77,635\n95,313\nSubordinated debt, net\n7,447\n7,453\n7,459\n7,465\nShareholders' equity\n95,604\n96,277\n97,110\n95,102\nNon-performing assets\n1,488\n2,362\n5,372\n3,034\nTangible common equity ratio\n7.21\n7.27\n7.35\n7.20\nTotal capital (to risk weighted assets) ratio\n13.03\n13.13\n13.08\n13.21\nPER COMMON SHARE:\nBook value\n5.12\n5.21\n5.31\n5.25\nTangible book value\n4.48\n4.57\n4.66\n4.59\nMarket value\n3.75\n4.15\n4.00\n4.15\nTrust assets - fair market value (A)\n2,025,304\n2,070,212\n2,119,371\n2,186,393\nSTATISTICAL DATA AT PERIOD END:\nFull-time equivalent employees\n307\n308\n307\n302\nBranch locations\n16\n16\n16\n15\nCommon shares outstanding\n18,666,520\n18,461,628\n18,281,224\n18,128,247\n2016\n1QTR\n2QTR\n3QTR\n4QTR\nFINANCIAL CONDITION DATA AT PERIOD END:\nAssets\n1,121,701\n1,142,492\n1,145,655\n1,153,780\nShort-term investments/overnight funds\n5,556\n6,836\n8,279\n8,966\nInvestment securities\n139,000\n145,753\n145,609\n157,742\nLoans and loans held for sale\n882,410\n895,513\n896,301\n886,858\nAllowance for loan losses\n9,520\n9,746\n9,726\n9,932\nGoodwill\n11,944\n11,944\n11,944\n11,944\nDeposits\n906,773\n940,931\n962,736\n967,786\nFHLB borrowings\n88,952\n72,617\n56,943\n58,296\nSubordinated debt, net\n7,424\n7,430\n7,435\n7,441\nShareholders' equity\n97,589\n99,232\n100,044\n95,395\nNon-performing assets\n3,007\n2,230\n1,907\n1,624\nTangible common equity ratio\n7.72\n7.72\n7.77\n7.31\nTotal capital (to risk weighted assets) ratio\n13.11\n13.04\n13.17\n13.15\nPER COMMON SHARE:\nBook value\n5.16\n5.25\n5.29\n5.05\nTangible book value\n4.53\n4.62\n4.66\n4.41\nMarket value\n2.99\n3.02\n3.32\n3.70\nTrust assets - fair market value (A)\n1,974,180\n1,982,868\n2,011,344\n1,992,978\nSTATISTICAL DATA AT PERIOD END:\nFull-time equivalent employees\n317\n311\n310\n305\nBranch locations\n16\n16\n16\n16\nCommon shares outstanding\n18,894,561\n18,896,876\n18,903,472\n18,903,472\nNote:\n(A) Not recognized on the consolidated balance sheets.\nAMERISERV FINANCIAL, INC.\nCONSOLIDATED STATEMENT OF INCOME\n(Dollars in thousands)\n(Unaudited)\n2017\n1QTR\n2QTR\n3QTR\n4QTR\nYEAR\nTO DATE\nINTEREST INCOME\nInterest and fees on loans\n9,556\n9,778\n9,855\n10,028\n39,217\nInterest on investments\n1,192\n1,273\n1,332\n1,342\n5,139\nTotal Interest Income\n10,748\n11,051\n11,187\n11,370\n44,356\nINTEREST EXPENSE\nDeposits\n1,436\n1,504\n1,618\n1,697\n6,255\nAll borrowings\n591\n648\n632\n669\n2,540\nTotal Interest Expense\n2,027\n2,152\n2,250\n2,366\n8,795\nNET INTEREST INCOME\n8,721\n8,899\n8,937\n9,004\n35,561\nProvision for loan losses\n225\n325\n200\n50\n800\nNET INTEREST INCOME AFTER PROVISION\nFOR LOAN LOSSES\n8,496\n8,574\n8,737\n8,954\n34,761\nNON-INTEREST INCOME\nTrust and investment advisory fees\n2,166\n2,081\n2,045\n2,170\n8,462\nService charges on deposit accounts\n374\n385\n409\n413\n1,581\nNet realized gains on loans held for sale\n114\n186\n217\n162\n679\nMortgage related fees\n75\n83\n69\n58\n285\nNet realized gains on investment securities\n27\n32\n56\n-\n115\nBank owned life insurance\n141\n310\n143\n143\n737\nOther income\n665\n678\n690\n753\n2,786\nTotal Non-Interest Income\n3,562\n3,755\n3,629\n3,699\n14,645\nNON-INTEREST EXPENSE\nSalaries and employee benefits\n6,010\n5,979\n6,005\n6,133\n24,127\nNet occupancy expense\n674\n639\n634\n653\n2,600\nEquipment expense\n419\n434\n343\n389\n1,585\nProfessional fees\n1,200\n1,415\n1,213\n1,230\n5,058\nFDIC deposit insurance expense\n160\n152\n156\n160\n628\nOther expenses\n1,622\n1,698\n1,763\n1,685\n6,768\nTotal Non-Interest Expense\n10,085\n10,317\n10,114\n10,250\n40,766\nPRETAX INCOME\n1,973\n2,012\n2,252\n2,403\n8,640\nIncome tax expense\n625\n623\n701\n3,398\n5,347\nNET INCOME AVAILABLE TO COMMON SHAREHOLDERS\n1,348\n1,389\n1,551\n(995)\n3,293\n2016\n1QTR\n2QTR\n3QTR\n4QTR\nYEAR\nTO DATE\nINTEREST INCOME\nInterest and fees on loans\n9,465\n9,409\n9,462\n9,525\n37,861\nInterest on investments\n957\n980\n1,014\n1,057\n4,008\nTotal Interest Income\n10,422\n10,389\n10,476\n10,582\n41,869\nINTEREST EXPENSE\nDeposits\n1,254\n1,330\n1,391\n1,425\n5,400\nAll borrowings\n610\n573\n579\n573\n2,335\nTotal Interest Expense\n1,864\n1,903\n1,970\n1,998\n7,735\nNET INTEREST INCOME\n8,558\n8,486\n8,506\n8,584\n34,134\nProvision for loan losses\n3,100\n250\n300\n300\n3,950\nNET INTEREST INCOME AFTER PROVISION\nFOR LOAN LOSSES\n5,458\n8,236\n8,206\n8,284\n30,184\nNON-INTEREST INCOME\nTrust and investment advisory fees\n2,075\n2,124\n2,035\n2,099\n8,333\nService charges on deposit accounts\n415\n404\n433\n422\n1,674\nNet realized gains on loans held for sale\n107\n185\n260\n332\n884\nMortgage related fees\n63\n98\n132\n74\n367\nNet realized gains on investment securities\n57\n60\n60\n-\n177\nBank owned life insurance\n167\n169\n169\n170\n675\nOther income\n553\n702\n572\n701\n2,528\nTotal Non-Interest Income\n3,437\n3,742\n3,661\n3,798\n14,638\nNON-INTEREST EXPENSE\nSalaries and employee benefits\n6,166\n5,868\n5,901\n6,099\n24,034\nNet occupancy expense\n737\n690\n656\n699\n2,782\nEquipment expense\n436\n409\n419\n424\n1,688\nProfessional fees\n1,465\n1,192\n1,330\n1,293\n5,280\nFDIC deposit insurance expense\n179\n188\n189\n153\n709\nOther expenses\n1,728\n1,692\n1,861\n1,841\n7,122\nTotal Non-Interest Expense\n10,711\n10,039\n10,356\n10,509\n41,615\nPRETAX INCOME (LOSS)\n(1,816)\n1,939\n1,511\n1,573\n3,207\nIncome tax expense (benefit)\n(549)\n577\n446\n423\n897\nNET INCOME (LOSS)\n(1,267)\n1,362\n1,065\n1,150\n2,310\nPreferred stock dividends\n15\n-\n-\n-\n15\nNET INCOME (LOSS) AVAILABLE TO COMMON SHAREHOLDERS\n(1,282)\n1,362\n1,065\n1,150\n2,295\nAMERISERV FINANCIAL, INC.\nAVERAGE BALANCE SHEET DATA\n(Dollars in thousands)\n(Unaudited)\n2017\n2016\n4QTR\nTWELVE\n4QTR\nTWELVE\nMONTHS\nMONTHS\nInterest earning assets:\nLoans and loans held for sale, net of unearned income\n893,134\n893,849\n887,671\n887,679\nShort-term investment in money market funds\n7,839\n7,996\n21,663\n15,156\nDeposits with banks\n1,025\n1,028\n1,059\n1,668\nTotal investment securities\n174,507\n172,615\n153,539\n147,279\nTotal interest earning assets\n1,076,505\n1,075,488\n1,063,932\n1,051,782\nNon-interest earning assets:\nCash and due from banks\n22,931\n22,393\n22,854\n20,626\nPremises and equipment\n12,806\n12,273\n11,772\n11,930\nOther assets\n66,352\n67,169\n67,137\n68,046\nAllowance for loan losses\n(10,430)\n(10,241)\n(9,829)\n(9,790)\nTotal assets\n1,168,164\n1,167,082\n1,155,866\n1,142,594\nInterest bearing liabilities:\nInterest bearing deposits:\nInterest bearing demand\n128,589\n129,589\n112,451\n108,350\nSavings\n96,064\n97,405\n95,494\n95,986\nMoney market\n271,672\n275,636\n286,187\n277,967\nOther time\n294,099\n291,475\n301,555\n290,612\nTotal interest bearing deposits\n790,424\n794,105\n795,687\n772,915\nBorrowings:\nFederal funds purchased and other short-term borrowings\n21,719\n16,972\n1,685\n9,030\nAdvances from Federal Home Loan Bank\n45,273\n45,657\n46,810\n48,720\nGuaranteed junior subordinated deferrable interest debentures\n13,085\n13,085\n13,085\n13,085\nSubordinated debt\n7,650\n7,650\n7,650\n7,650\nTotal interest bearing liabilities\n878,151\n877,469\n864,917\n851,400\nNon-interest bearing liabilities:\nDemand deposits\n183,430\n182,301\n184,920\n182,732\nOther liabilities\n9,591\n11,119\n6,241\n8,074\nShareholders' equity\n96,992\n96,193\n99,788\n100,388\nTotal liabilities and shareholders' equity\n1,168,164\n1,167,082\n1,155,866\n1,142,594\nView original content with multimedia: http://www.prnewswire.com/news-releases/ameriserv-financial-reports-earnings-for-the-fourth-quarter-and-full-year-of-2017-300586589.html\nSOURCE AmeriServ Financial, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/ameriserv-financial-reports-earnings-for-the-fourth-quarter-and-full-year-of-2017-300586589.html"], "published": "2018-01-23T16:00:00.000+02:00", "crawled": "2018-01-23T18:43:06.001+02:00", "highlightTitle": ""}