{"organizations": [], "uuid": "6468695733190fb0d2eede507c946e3ebbb73faf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-formfast-appoints-art-nicholas-as-chief-revenue-officer.html", "country": "US", "domain_rank": 767, "title": "FormFast Appoints Art Nicholas as Chief Revenue Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.878, "site_type": "news", "published": "2018-01-16T15:07:00.000+02:00", "replies_count": 0, "uuid": "6468695733190fb0d2eede507c946e3ebbb73faf"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-formfast-appoints-art-nicholas-as-chief-revenue-officer.html", "ord_in_thread": 0, "title": "FormFast Appoints Art Nicholas as Chief Revenue Officer", "locations": [], "entities": {"persons": [{"name": "nicholas", "sentiment": "negative"}, {"name": "art nicholas", "sentiment": "none"}], "locations": [{"name": "st. louis", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ST. LOUIS, Jan. 16, 2018 /PRNewswire/ -- FormFast, the leading provider of electronic forms and workflow solutions for the healthcare industry, today announced Art Nicholas has joined the organization as Chief Revenue Officer. In the newly created position, Nicholas drives FormFast's go-to-market function and leads FormFast's sales and marketing organizations. He will continue to expand FormFast's client base by reaching new market segments and growing partner sales channels.\nNicholas brings a long track record of success in sales management, team building, and partner development to FormFast. He joins FormFast after several years of experience selling into the out-patient and physician practice space with NoteSwift as VP of Sales and Business Development.\n\"Art's expertise complements FormFast's trajectory and vision and will help current and future FormFast clients realize new strategic growth opportunities with our solutions. His impressive track record of successfully bringing solutions to the healthcare market will be incredibly valuable as we move forward with our strategy in what is a very dynamic and challenging, yet rewarding industry,\" said FormFast President, Randy Campbell.\nWith a diverse background in working for start-ups as well as multi-billion-dollar companies such as Xerox and Nuance Communication, Nicholas has established key partnerships with companies such as GE Healthcare, Allscripts, McKesson, Microsoft, and IBM over the course of his career. Well over 10 million people use Nuance products due to partnerships Nicholas established while at Nuance Communications where he led a team of over 100 sales and service professionals.\n\"FormFast is in a truly unique position in the healthcare market as they are equipped with a deep base of loyal customers, yet they have continued to create modern, cutting-edge solutions that address healthcare's ever-evolving needs. Their market presence reflects not only a meaningful proof of success; but also, their flexibility and nimbleness to proactively help clients with new challenges. I am excited to join an organization poised for such incredible growth,\" said Nicholas.\nAbout FormFast\nWith 25 years exclusively focused on healthcare needs and over 1,100 hospital clients, FormFast is recognized as an industry leader in electronic forms and document workflow technology. FormFast's enterprise software platform integrates with EHRs and other core systems to automate required documents, capturing data and accelerating workflows associated with them. By using FormFast, healthcare organizations achieve new levels of standardization and operational efficiency, allowing them to focus on their core mission – delivering quality care. Learn more about FormFast .\nMedia Contact:\nLauren Ziegler\n314-677-3765\nlziegler@formfast.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/formfast-appoints-art-nicholas-as-chief-revenue-officer-300582730.html\nSOURCE FormFast", "external_links": ["http://formfast.com/", "http://www.prnewswire.com/news-releases/formfast-appoints-art-nicholas-as-chief-revenue-officer-300582730.html"], "published": "2018-01-16T15:07:00.000+02:00", "crawled": "2018-01-16T16:54:33.010+02:00", "highlightTitle": ""}