{"organizations": [], "uuid": "5fab17d19254f7f443a0e4c56519c40b00cb0b46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-harris-corporation-reports-solid-fiscal-2018-second-quarter-results-with-strong-revenue-growth.html", "country": "US", "domain_rank": 767, "title": "Harris Corporation Reports Solid Fiscal 2018 Second Quarter Results with Strong Revenue Growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.054, "site_type": "news", "published": "2018-01-30T14:30:00.000+02:00", "replies_count": 0, "uuid": "5fab17d19254f7f443a0e4c56519c40b00cb0b46"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-harris-corporation-reports-solid-fiscal-2018-second-quarter-results-with-strong-revenue-growth.html", "ord_in_thread": 0, "title": "Harris Corporation Reports Solid Fiscal 2018 Second Quarter Results with Strong Revenue Growth", "locations": [], "entities": {"persons": [], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "harris corporation reports solid fiscal", "sentiment": "negative"}, {"name": "gaap", "sentiment": "none"}, {"name": "harris corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "2Q18 revenue up 6% to $1.5 billion; orders up 13% 2Q18 EPS from continuing operations down 12% to $1.15 GAAP; up 21% to $1.67 non-GAAP 2Q18 results impacted by $52 million one-time, non-cash write-down of deferred tax assets and $26 million lower tax rate benefit from enactment of Tax Cuts and Job Act of 2017 1H18 revenue up 3% to $2.9 billion; EPS from continuing operations up 3% to $2.52 GAAP and up 15% to $3.05 non-GAAP 1H18 operating cash flow up 26% to $373 million; free cash flow up 34% to $330 million Solid operating performance plus tax reform resulting in increased EPS guidance for fiscal 2018\nMELBOURNE, Fla.--(BUSINESS WIRE)-- Harris Corporation (NYSE:HRS) reported fiscal 2018 second quarter revenue of $1.54 billion, up 6% compared with the prior year. Earnings per diluted share from continuing operations was $1.15 (GAAP) and $1.67 (non-GAAP 1 ), compared with $1.30 (GAAP) and $1.38 (non-GAAP 1 ) in the prior year. Operating cash flow was $278 million and free cash flow was $258 million compared with operating cash flow of $252 million and free cash flow of $224 million in the prior year.\n\"We generated solid results in the second quarter driven by the strongest revenue growth we have achieved in more than seven years, including a 26% increase in tactical radio sales,\" said William M. Brown, chairman, president and chief executive officer. “In the first half, revenue and orders were up in all segments, and company book-to-bill was a robust 1.3. As a result of our strong performance and improved revenue outlook despite a lengthened continuing resolution, as well as benefits from tax reform, we have increased EPS guidance for the fiscal year.\"\nSummary Financial Results\n($ millions, except per share data) Second Quarter First Half FY 2018 FY 2017 Change FY 2018 FY 2017 Change Orders $ 1,390 $ 1,234 13 % $ 3,695 $ 2,973 24 % Revenue $ 1,535 $ 1,449 6 % $ 2,948 $ 2,869 3 % (GAAP comparison) Operating income $ 272 $ 277 (2 )% $ 544 $ 523 4 % Operating margin 17.7 % 19.1 % (140)bps 18.5 % 18.2 % 30bps Earnings per share $ 1.15 $ 1.30 (12 )% $ 2.52 $ 2.45 3 % (Non-GAAP comparison) Operating income* $ 284 $ 290 (2 )% $ 556 $ 553 1 % Operating margin* 18.5 % 20.0 % (150)bps 18.9 % 19.3 % (40)bps Earnings per share* $ 1.67 $ 1.38 21 % $ 3.05 $ 2.66 15 % *Reconciliations of GAAP to non-GAAP financial measures are provided in the attached tables. Second quarter revenue increased 6%, with growth in Communication Systems and Electronic Systems partially offset by a slight decline in Space and Intelligence Systems. The decrease in GAAP EPS was primarily due to non-cash charges in the second quarter of fiscal 2018 from a $52 million one-time write-down of deferred tax assets and from an adjustment for deferred compensation, partially offset by the absence of Exelis acquisition-related charges incurred in the second quarter of fiscal 2017. Non-GAAP EPS increased by $.29, which includes $.21 of benefit from tax reform and $.08 from higher volume, operational excellence, higher pension income and a lower share count, partially offset by the absence of a $22 million favorable contract adjustment incurred in the second quarter of fiscal 2017. Non-GAAP operating margin remained strong at 18.5%. Orders increased 13% to $1.4 billion.\nFirst half revenue increased 3%, with growth across all three segments. GAAP EPS was up 3% due to the absence of Exelis acquisition-related charges incurred in the first half of fiscal 2017, partially offset by the non-cash charges incurred in the second quarter of fiscal 2018. Non-GAAP EPS was up 15% on increased volume, benefit from tax reform, higher pension income, strong program execution and year-over-year integration synergy savings, partially offset by a $36 million unfavorable impact from the ADS-B program. Non-GAAP operating margin was strong at 18.9%. Orders grew 24%, resulting in a book-to-bill of 1.3.\nCommunication Systems\n($ millions) Second Quarter First Half FY 2018 FY 2017 Change FY 2018 FY 2017 Change Revenue $ 489 $ 413 18 % $ 899 $ 843 7 % Operating income $ 144 $ 121 19 % $ 262 $ 239 10 % Operating margin 29.5 % 29.3 % 20bps 29.1 % 28.4 % 70bps The 18% increase in second quarter segment revenue was primarily due to a 56% increase in DoD Tactical revenue driven by readiness demand across all the Services and a 9% increase in International Tactical revenue from strong growth in the Middle East. Operating income grew 19% on increased volume and operational efficiencies.\nDoD Tactical momentum continued in the second quarter, with both ground tactical and airborne awards:\n$765 million ceiling, 5-year, single-award IDIQ contract with the U.S. Navy to provide tactical radios and ancillary devices $71 million contract modification from the U.S. Army for single-channel ground and airborne radio systems (SINCGARS) $60 million order from the U.S. Air Force for Falcon III ® tactical radios $42 million order from the U.S. Army for the Security Force Assistance Brigade for Falcon III ® tactical radios and waveforms\nInternational Tactical received several key orders for modernization programs and ongoing counter-terrorism support:\n$45 million from Iraq for security forces modernization $18 million from Afghanistan to provide sustainment services to its security forces $10 million from the Royal Danish Army for tactical vehicular radio systems\nElectronic Systems\n($ millions) Second Quarter First Half FY 2018 FY 2017 Change FY 2018 FY 2017 Change Revenue $ 584 $ 570 2 % $ 1,124 $ 1,107 2 % Operating income $ 101 $ 134 (25 )% $ 210 $ 245 (14 )% Operating margin 17.3 % 23.5 % (620)bps 18.7 % 22.1 % (340)bps The 2% increase in second quarter segment revenue reflected higher volume in Avionics, with growth on the F-35 and several other platforms, and in C4ISR from the ramp of the UAE battle management system and U.K. robotics programs, partially offset by contract adjustments in Mission Networks, including the absence of the favorable prior-year adjustment on the ADS-B program. Operating income declined 25% as strong performance on Electronic Warfare (EW) programs and the benefit of higher volume in Avionics were more than offset by the contract adjustments in Mission Networks, higher R&D expenses and unfavorable mix.\nNew awards continued to strengthen the company's strategic position in Avionics on both domestic and international large platforms. Domestic awards included a $93 million contract for F-35 LRIP 11 release systems and a $48 million, 5-year block buy contract for LRIP 12-14 in support of the F-35 antenna production program. International awards included a $25 million contract for release systems to support Qatar F-15s and a development contract for release systems on the Korean Next Generation Indigenous Fighter with significant follow-on potential.\nSpace and Intelligence Systems\n($ millions) Second Quarter First Half FY 2018 FY 2017 Change FY 2018 FY 2017 Change Revenue $ 465 $ 468 (1 )% $ 931 $ 921 1 % Operating income $ 81 $ 76 7 % $ 168 $ 155 8 % Operating margin 17.4 % 16.2 % 120bps 18.0 % 16.8 % 120bps Second quarter segment revenue declined slightly as higher revenue from Classified programs was more than offset by lower revenue from environmental programs. Operating income increased 7% to $81 million on productivity and incremental pension income.\nOrder momentum continued in Classified programs as further progress on investments in innovative ground processing capabilities and small satellite technology resulted in additional funding for an award announced in the first quarter of fiscal 2018 and in a multi-million dollar, multi-year award in ground processing for next generation operational software. The segment also received additional funding from the National Geospatial-Intelligence Agency for an IDIQ contract received in the third quarter of fiscal 2017 to perform search and retrieval services for geospatial products.\nAdditionally, funding support continued for key environmental programs, including a $25 million award for GOES-R program sustainment and two new awards totaling up to $95 million to monitor weather satellite transmission interference for the U.S. Department of Commerce and to provide satellite ground capabilities for the U.S. Air Force weather satellite recapitalization effort.\nCash and Capital Deployment\n($ millions) Second Quarter First Half FY 2018 FY 2017 Change FY 2018 FY 2017 Change Net cash provided by operating activities $ 278 $ 252 $ 26 $ 373 $ 295 $ 78 Free cash flow* $ 258 $ 224 $ 34 $ 330 $ 246 $ 84 *Reconciliations of GAAP to non-GAAP financial measures are provided in the attached tables. In the first half of fiscal 2018, Harris generated free cash flow of $330 million and returned $287 million to shareholders through dividends and share repurchases, ending the period with $422 million of cash.\nGuidance\nAs a result of the company's strong first half performance and benefits from tax reform, Harris updated its guidance for fiscal 2018 to the following:\nRevenue in a range of $6.08 - 6.14 billion, up 3 - 4% from fiscal 2017 (tightened from previous guidance of $6.02 - 6.14 billion, up 2 - 4%) GAAP EPS from continuing operations in a range of $5.78 - $5.98 and non-GAAP EPS 2 from continuing operations in a range of $6.30 - $6.50 (an increase from previous guidance of $5.85 - $6.05 GAAP and non-GAAP) Free cash flow of approximately $900 million (tightened from previous guidance of $850 - 900 million) Share repurchases of $200 million (up $50 million from previous guidance) Tax rate of approximately 28% GAAP; 23% non-GAAP (a decrease from approximately 28.5% previously, including a half-year benefit of 5 percentage points from tax reform)\nConference Call and Webcast\nHarris will host a conference call today, January 30, at 8:30 a.m. Eastern Time (ET) to discuss its fiscal 2018 second quarter financial results. The dial-in numbers for the teleconference are (U.S.) (877) 407-6184 and (International) (201) 389-0877, and participants will be directed to an operator. Please allow at least 10 minutes before the scheduled start time to connect to the teleconference. Participants are encouraged to listen via live webcast and view management’s supporting slide presentation at https://www.harris.com/investors/financial-reports . A recording of the call will be available on the Harris website beginning at approximately 12 p.m. ET on January 30.\nAbout Harris Corporation\nHarris Corporation is a leading technology innovator, solving customers’ toughest mission-critical challenges by providing solutions that connect, inform and protect. Harris supports government and commercial customers in more than 100 countries and has approximately $6 billion in annual revenue. The company is organized into three business segments: Communication Systems, Electronic Systems and Space and Intelligence Systems. Learn more at harris.com .\nNon-GAAP Financial Measures\nThis press release contains non-GAAP financial measures within the meaning of Regulation G promulgated by the Securities and Exchange Commission (“SEC”), including operating income, operating margin and earnings per diluted share from continuing operations for the second quarter and first half of fiscal 2018 and expected earnings per diluted share from continuing operations for fiscal 2018, in each case excluding non-cash charges in the second quarter of fiscal 2018 from a one-time write-down of deferred tax assets and from an adjustment for deferred compensation; operating income, operating margin and earnings per diluted share from continuing operations for the second quarter and first half of fiscal 2017, in each case excluding acquisition-related charges; and free cash flow for the second quarter and first half of fiscal 2018 and the second quarter and first half of fiscal 2017 and expected free cash flow for fiscal 2018, in each case excluding cash flow for net capital expenditures. A “non-GAAP financial measure” is generally defined as a numerical measure of a company’s historical or future performance that excludes or includes amounts, or is subject to adjustments, so as to be different from the most directly comparable measure calculated and presented in accordance with generally accepted accounting principles (“GAAP”). Harris management believes that these non-GAAP financial measures, when considered together with the GAAP financial measures, provide information that is useful to investors in understanding period-over-period operating results separate and apart from items that may, or could, have a disproportionately positive or negative impact on results in any particular period. Harris management also believes that these non-GAAP financial measures enhance the ability of investors to analyze Harris business trends and to understand Harris performance. In addition, Harris may utilize non-GAAP financial measures as guides in forecasting, budgeting and long-term planning processes and to measure operating performance for some management compensation purposes. Non-GAAP financial measures should be considered in addition to, and not as a substitute for, or superior to, financial measures presented in accordance with GAAP.\nAttachments: Financial statements (8 tables)\nForward-Looking Statements\nStatements in this press release that are not historical facts are forward-looking statements that reflect management's current expectations, assumptions and estimates of future performance and economic conditions. Such statements are made in reliance on the safe harbor provisions of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements in this release include but are not limited to: earnings, revenue, free cash flow, share repurchase and tax rate guidance for fiscal 2018; changes in earnings guidance for fiscal 2018; potential contract opportunities and awards; the potential value of contract awards; and other statements regarding outlook or that are not historical facts. The company cautions investors that any forward-looking statements are subject to risks and uncertainties that may cause actual results and future trends to differ materially from those matters expressed in or implied by such forward-looking statements. The company's consolidated results, future trends and forward-looking statements could be affected by many factors, risks and uncertainties, including but not limited to: the loss of the company's relationship with the U.S. Government or a change or reduction in U.S. Government funding; potential changes in U.S. Government or customer priorities and requirements (including potential deferrals of awards, terminations, reductions of expenditures, changes to respond to the priorities of Congress and the Administration, budgetary constraints, debt ceiling implications, sequestration and cost-cutting initiatives); a security breach, through cyber attack or otherwise, or other significant disruptions of the company's IT networks and systems or those the company operates for customers; the level of returns on defined benefit plan assets and changes in interest rates; risks inherent with large long-term fixed-price contracts, particularly the ability to contain cost overruns; changes in estimates used in accounting for the company’s programs; financial and government and regulatory risks relating to international sales and operations; effects of any non-compliance with laws; the company's ability to continue to develop new products that achieve market acceptance; the consequences of uncertain economic conditions and future geo-political events; strategic acquisitions and divestitures and the risks and uncertainties related thereto, including the company's ability to manage and integrate acquired businesses and realize expected benefits and the potential disruption to relationships with employees, suppliers and customers, including the U.S. Government, and to the company's business generally; performance of the company's subcontractors and suppliers; potential claims related to infringement of intellectual property rights or environmental remediation or other contingencies, litigation and legal matters and the ultimate outcome thereof; risks inherent in developing new and complex technologies and/or that may not be covered adequately by insurance or indemnity; changes in the company's effective tax rate; significant indebtedness and unfunded pension liability and potential downgrades in the company's credit ratings; unforeseen environmental issues; natural disasters or other disruptions affecting the company's operations; changes in future business or other market conditions that could cause business investments and/or recorded goodwill or other long-term assets to become impaired; the company's ability to attract and retain key employees, maintain reasonable relationships with unionized employees and manage escalating costs of providing employee health care; or potential tax, indemnification and other liabilities and exposures related to Exelis' spin-off of Vectrus, Inc. and Exelis' spin-off from ITT Corporation. Further information relating to these and other factors that may impact the company's results, future trends and forward-looking statements are disclosed in the company's filings with the SEC. The forward-looking statements contained in this release are made as of the date of this release, and the company disclaims any intention or obligation, other than imposed by law, to update or revise any forward-looking statements, whether as a result of new information, future event, or otherwise.\n1 Non-GAAP earnings per diluted share from continuing operations for fiscal 2018 second quarter excludes non-cash charges from a one-time write-down of deferred tax assets and from an adjustment for deferred compensation and for fiscal 2017 second quarter excludes Exelis acquisition-related charges. Reconciliations of GAAP to non-GAAP financial measures are provided in the attached tables.\n2 Non-GAAP EPS from continuing operations guidance excludes non-cash charges in the second quarter of fiscal 2018 from a one-time write-down of deferred tax assets and from an adjustment for deferred compensation. Reconciliations of GAAP to non-GAAP financial measures are provided in the attached tables.\nTable 1 HARRIS CORPORATION FY '18 Second Quarter Summary CONDENSED CONSOLIDATED STATEMENT OF INCOME (Unaudited) Quarter Ended Two Quarters Ended December 29,\n2017\nDecember 30,\n2016 (A)\nDecember 29,\n2017\nDecember 30,\n2016 (A)\n(In millions, except per share amounts) Revenue from product sales and services $ 1,535 $ 1,449 $ 2,948 $ 2,869 Cost of product sales and services (999 ) (920 ) (1,897 ) (1,817 ) Engineering, selling and administrative expenses (264 ) (252 ) (507 ) (529 ) Operating income 272 277 544 523 Non-operating income (loss) (2 ) 1 (2 ) 2 Interest income 1 1 1 1 Interest expense (42 ) (44 ) (83 ) (88 ) Income from continuing operations before income taxes 229 235 460 438 Income taxes (90 ) (72 ) (154 ) (130 ) Income from continuing operations 139 163 306 308 Discontinued operations, net of income taxes — 14 (6 ) 29 Net income $ 139 $ 177 $ 300 $ 337 Net income per common share Basic Continuing operations $ 1.17 $ 1.32 $ 2.57 $ 2.49 Discontinued operations — 0.10 (0.05 ) 0.22 $ 1.17 $ 1.42 $ 2.52 $ 2.71 Diluted Continuing operations $ 1.15 $ 1.30 $ 2.52 $ 2.45 Discontinued operations — 0.10 (0.05 ) 0.23 $ 1.15 $ 1.40 $ 2.47 $ 2.68 Cash dividends paid per common share $ 0.57 $ 0.53 $ 1.14 $ 1.06 Basic weighted average common shares outstanding 118.5 123.7 118.8 123.8 Diluted weighted average common shares outstanding 120.9 125.4 121.1 125.5 (A) Certain amounts reclassified to conform with current period presentation\nTable 2 HARRIS CORPORATION FY '18 Second Quarter Summary BUSINESS SEGMENT INFORMATION (Unaudited) Quarter Ended Two Quarters Ended December 29,\n2017\nDecember 30,\n2016 (A)\nDecember 29,\n2017\nDecember 30,\n2016 (A)\n(In millions) Revenue Communication Systems $ 489 $ 413 $ 899 $ 843 Electronic Systems 584 570 1,124 1,107 Space and Intelligence Systems 465 468 931 921 Corporate eliminations (3 ) (2 ) (6 ) (2 ) $ 1,535 $ 1,449 $ 2,948 $ 2,869 Income From Continuing Operations Before Income Taxes Segment Operating Income:\nCommunication Systems $ 144 $ 121 $ 262 $ 239 Electronic Systems 101 134 210 245 Space and Intelligence Systems 81 76 168 155 Unallocated corporate expense (55 ) (53 ) (96 ) (114 ) Corporate eliminations, net 1 (1 ) — (2 ) Non-operating income (loss) (2 ) 1 (2 ) 2 Net interest expense (41 ) (43 ) (82 ) (87 ) $ 229 $ 235 $ 460 $ 438 (A) Certain amounts reclassified to conform with current period presentation of our former government IT services business as discontinued operations, including reallocation of stranded costs and Financial Accounting Standards pension income previously reported as part of our Critical Networks segment.\nTable 3 HARRIS CORPORATION FY '18 Second Quarter Summary CONDENSED CONSOLIDATED STATEMENT OF CASH FLOWS (Unaudited) Two Quarters Ended December 29, 2017\nDecember 30, 2016 (A) (In millions) Operating Activities Net income $ 300 $ 337 Adjustments to reconcile net income to net cash provided by operating activities: Depreciation and amortization 80 101 Amortization of intangible assets from Exelis Inc. acquisition 50 66 Share-based compensation 24 22 Qualified pension plan contributions — (103 ) Pension income (68 ) (49 ) (Increase) decrease in: Accounts receivable (19 ) 125 Inventories (102 ) (50 ) Increase (decrease) in: Accounts payable (78 ) (47 ) Advance payments and unearned income 38 (58 ) Other 148 (49 ) Net cash provided by operating activities 373 295 Investing Activities Additions of property, plant and equipment (43 ) (49 ) Adjustments to proceeds from sales of businesses (2 ) (25 ) Net cash used in investing activities (45 ) (74 ) Financing Activities Net proceeds from borrowings 248 185 Repayments of borrowings (363 ) (300 ) Proceeds from exercises of employee stock options 18 27 Repurchases of common stock (150 ) (100 ) Cash dividends (137 ) (134 ) Other financing activities (10 ) (19 ) Net cash used in financing activities (394 ) (341 ) Effect of exchange rate changes on cash and cash equivalents 4 (6 ) Net decrease in cash and cash equivalents (62 ) (126 ) Cash and cash equivalents, beginning of year 484 487 Cash and cash equivalents, end of quarter $ 422 $ 361 (A) Certain amounts reclassified to conform with current period presentation\nTable 4 HARRIS CORPORATION FY '18 Second Quarter Summary CONDENSED CONSOLIDATED BALANCE SHEET (Unaudited) December 29, 2017 June 30, 2017 (In millions) Assets Cash and cash equivalents $ 422 $ 484 Receivables 642 623 Inventories 942 841 Property, plant and equipment 878 904 Goodwill 5,374 5,366 Other intangible assets 1,048 1,104 Other assets 550 768 $ 9,856 $ 10,090 Liabilities and Equity Short-term debt $ 5 $ 80 Accounts payable 462 540 Compensation and benefits 120 140 Advance payments and unearned income 290 252 Current portion of long-term debt 523 554 Defined benefit plans 1,202 1,278 Long-term debt, net 3,391 3,396 Other liabilities 869 922 Equity 2,994 2,928 $ 9,856 $ 10,090 HARRIS CORPORATION\nFY '18 Second Quarter Summary\nRECONCILIATION OF NON-GAAP FINANCIAL MEASURES AND REGULATION G DISCLOSURE\nTo supplement our condensed consolidated financial statements presented in accordance with U.S. generally accepted accounting principles (GAAP), we provide additional measures of income from continuing operations per diluted common share, operating income, operating margin and net cash provided by operating activities, adjusted to exclude certain costs, charges, expenses and losses or other amounts. Harris management believes that these non-GAAP financial measures, when considered together with the GAAP financial measures, provide information that is useful to investors in understanding period-over-period operating results separate and apart from items that may, or could, have a disproportionately positive or negative impact on results in any particular period. Harris management also believes that these non-GAAP financial measures enhance the ability of investors to analyze Harris’ business trends and to understand Harris’ performance. In addition, Harris may utilize non-GAAP financial measures as guides in its forecasting, budgeting, and long-term planning processes and to measure operating performance for some management compensation purposes. Any analysis of non-GAAP financial measures should be used only in conjunction with results presented in accordance with GAAP. A reconciliation of these non-GAAP financial measures with the most directly comparable financial measures calculated in accordance with GAAP follows:\nTable 5 HARRIS CORPORATION FY '18 Second Quarter Summary RECONCILIATION OF NON-GAAP FINANCIAL MEASURES Income from Continuing Operations per Diluted Common Share (Unaudited) Quarter Ended Two Quarters Ended December 29,\n2017\nDecember 30,\n2016 (A)\nDecember 29,\n2017\nDecember 30,\n2016 (A)\nGAAP income from continuing operations per diluted common share $ 1.15 $ 1.30 $ 2.52 $ 2.45 Adjustment for one-time non-cash charge from a write-down of deferred tax assets 0.43 — 0.43 — Adjustment for one-time non-cash charge from an adjustment for deferred compensation 0.09 — 0.10 — Adjustment for Exelis Inc. acquisition-related charges — 0.08 — 0.21 Non-GAAP income from continuing operations per diluted common share $ 1.67 $ 1.38 $ 3.05 $ 2.66 (A) Certain amounts reclassified to conform with current period presentation of our former government IT services business as discontinued operations\nTable 6 HARRIS CORPORATION FY '18 Second Quarter Summary RECONCILIATION OF NON-GAAP FINANCIAL MEASURES Operating Income and Operating Margin (Unaudited) Quarter Ended Two Quarters Ended December 29, 2017 December 29, 2017 As Reported Adjustment (B) Non-GAAP As Reported Adjustment (B) Non-GAAP (In millions) Revenue $ 1,535 $ — $ 1,535 $ 2,948 $ — $ 2,948 Operating income $ 272 $ 12 $ 284 $ 544 $ 12 $ 556 Operating margin 17.7 % 18.5 % 18.5 % 18.9 % Quarter Ended Two Quarters Ended December 30, 2016 (A) December 30, 2016 (A) As Reported Adjustment (C) Non-GAAP As Reported Adjustment (C) Non-GAAP (In millions) Revenue $ 1,449 $ — $ 1,449 $ 2,869 $ — $ 2,869 Operating income $ 277 $ 13 $ 290 $ 523 $ 30 $ 553 Operating margin 19.1 % 20.0 % 18.2 % 19.3 % (A) Certain amounts reclassified to conform with current period presentation of our former government IT services business as discontinued operations\n(B) Adjustment for a non-cash charge from an adjustment for deferred compensation\n(C) Adjustments for Exelis Inc. acquisition-related charges\nTable 7 HARRIS CORPORATION FY '18 Second Quarter Summary RECONCILIATION OF NON-GAAP FINANCIAL MEASURES Free Cash Flow (Unaudited) Quarter Ended Two Quarters Ended December 29,\n2017\nDecember 30,\n2016\nDecember 29,\n2017\nDecember 30,\n2016\nFiscal Year 2018\n(Guidance)\n(In millions) Net cash provided by operating activities $ 278 $ 252 $ 373 $ 295 ~$1,030 Less capital expenditures (20 ) (28 ) (43 ) (49 ) (130) Free cash flow $ 258 $ 224 $ 330 $ 246 ~$900 Table 8 HARRIS CORPORATION FY '18 Second Quarter Summary RECONCILIATION OF NON-GAAP FINANCIAL MEASURES Reconciliation of Guidance for FY '18 Income from Continuing Operations per Diluted Common Share to FY '18 Non-GAAP Income from Continuing Operations per Diluted Common Share (Unaudited) 2018 (Guidance) GAAP income from continuing operations per diluted common share $5.78 to $5.98 Estimated net impact of one-time non-cash charges associated with tax reform and other items $.52 Non-GAAP income from continuing operations per diluted common share $6.30 to $6.50\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130005648/en/\nHarris Corporation\nInvestor Relations Contact:\nAnurag Maheshwari, 321-727-9383\nanurag.maheshwari@harris.com\nor\nMedia Relations Contact:\nJim Burke, 321-727-9131\njim.burke@harris.com\nSource: Harris Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.harris.com%2Fsites%2Fdefault%2Ffiles%2Fharris-q2-2018-tables.pdf&esheet=51750618&newsitemid=20180130005648&lan=en-US&anchor=Financial+statements+%288+tables%29&index=3&md5=daf935bec20d207fe122e57da15510ed", "http://www.businesswire.com/news/home/20180130005648/en/", "https://www.harris.com/investors/financial-reports", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.harris.com%2F&esheet=51750618&newsitemid=20180130005648&lan=en-US&anchor=harris.com&index=2&md5=ceb1747ef1560a92fe44b15c4f941968", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.harris.com%2Finvestors%2Ffinancial-reports&esheet=51750618&newsitemid=20180130005648&lan=en-US&anchor=https%3A%2F%2Fwww.harris.com%2Finvestors%2Ffinancial-reports&index=1&md5=b169ec6d425ae6d5a7c3b76a554edc60"], "published": "2018-01-30T14:30:00.000+02:00", "crawled": "2018-01-30T15:32:05.003+02:00", "highlightTitle": ""}