{"organizations": [], "uuid": "38d6e84455e31af920bf5cd2057200053a3841bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/europe-funds-lipper/european-funds-industry-adds-1-trillion-euros-in-2017-lipper-idUSL8N1PO41H", "country": "US", "domain_rank": 408, "title": "European funds industry adds 1 trillion euros in 2017 - Lipper", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T15:45:00.000+02:00", "replies_count": 0, "uuid": "38d6e84455e31af920bf5cd2057200053a3841bf"}, "author": "", "url": "https://www.reuters.com/article/europe-funds-lipper/european-funds-industry-adds-1-trillion-euros-in-2017-lipper-idUSL8N1PO41H", "ord_in_thread": 0, "title": "European funds industry adds 1 trillion euros in 2017 - Lipper", "locations": [], "entities": {"persons": [{"name": "simon jessop", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "lipper reuters", "sentiment": "negative"}, {"name": "lipper", "sentiment": "negative"}, {"name": "thomson reuters lipper", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 1:46 PM / in an hour European funds industry adds 1 trillion euros in 2017 - Lipper Reuters Staff \n* Europe industry assets at 10.4 trln euros at end-Dec \n* Bond funds most in-demand, add 289.4 bln euros \n* 97 funds closed over year; more to come in 2018 \nBy Simon Jessop \nLONDON, Jan 29 (Reuters) - Europe’s mutual fund industry assets rose by 1 trillion euros ($1.24 trillion) in 2017 after record inflows of investor cash and market gains. \nTotal assets at the end of December were 10.4 trillion euros, up from 9.4 trillion, data from Thomson Reuters Lipper showed, with net inflows of 756.9 billion euros more than double that seen in 2016. The balance came from investment gains. \nEquity funds were the favoured home for the majority of the assets, with managers in charge of a collective 3.9 trillion euros. Bond funds managed a total 2.6 trillion euros and mixed asset funds 1.7 trillion euros. \nBond funds were particularly in demand, adding 289.4 billion euros over the year, Lipper said, while mult-asset funds saw the greatest number of launches at 743. \nDemand for passive investments using exchange-traded funds rose for the fifth-straight year, taking assets in this category to 633.9 billion euros from 514.5 billion. \nAmong fund managers, BlackRock remained the region’s biggest, running 755.9 billion euros, followed by Amundi . BlackRock also had the strongest sales, at 101.1 billion euros, Lipper said. \nAgainst a backdrop of increased mergers and acquisitions in the European fund industry, amid rising costs and increased regulation, the number of funds across the region fell by 97 to chalk up the seventh consecutive year of net closures. \n“The main reasons for the mergers and liquidations at the fund level were mergers of fund managers as well as restructurings of the general product offerings,” Detlef Glow, Head of EMEA Research at Thomson Reuters Lipper, said. \n“Since implementation of new regulations, currently MiFID II, increases the cost of maintaining a fund, we expect the trend of mergers and liquidations of small funds will continue in 2018,” he said, referring to the European Union’s new market transparency rules, which went live on Jan. 3. ($1 = 0.8077 euros) (Reporting by Simon Jessop. Editing by Jane Merriman)", "external_links": [], "published": "2018-01-29T15:45:00.000+02:00", "crawled": "2018-01-29T16:04:18.009+02:00", "highlightTitle": ""}