{"organizations": [], "uuid": "9342f5d434e92c055ddd34d9fd74419424a6a660", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-standex-reports-second-quarter-2018-financial-results.html", "country": "US", "domain_rank": 767, "title": "Standex Reports Second-Quarter 2018 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.217, "site_type": "news", "published": "2018-01-30T16:51:00.000+02:00", "replies_count": 0, "uuid": "9342f5d434e92c055ddd34d9fd74419424a6a660"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-standex-reports-second-quarter-2018-financial-results.html", "ord_in_thread": 0, "title": "Standex Reports Second-Quarter 2018 Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.h.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "standex", "sentiment": "negative"}, {"name": "standex international corporation", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Achieves 20.6% Sales Increase and 8.8% Organic Increase\nGAAP Operating Income Increases 37.4% and Non-GAAP Operating Income Grows 19.2%\nGAAP EPS loss of $0.22 Reflects Tax Law Reform Impact while Non-GAAP EPS Increases 8.7%\nSALEM, N.H.--(BUSINESS WIRE)-- Standex International Corporation (NYSE:SXI) today reported financial results for its fiscal year 2018 second quarter ended December 31, 2017.\nSecond-Quarter Fiscal 2018 Results\nNet sales increased 20.6% year over year to $209.8 million with organic sales up 8.8%. Acquisitions contributed a positive 10.0% to growth and foreign exchange had a positive effect of 1.8%. Net income from continuing operations was a loss of $2.8 million, or $0.22 per share, reflecting the Company’s assessment to date of the impact of the new U.S. tax legislation that was signed into law in late December. This quarter’s net income included tax-effected $0.5 million of acquisition-related costs, $1.5 million of restructuring charges, and $15.0 million of discrete tax items. This compares with second-quarter fiscal 2017 net income from continuing operations of $10.4 million, or $0.82 per diluted share, including tax-effected $1.1 million of acquisition-related costs, $1.2 million of restructuring charges, $0.8 million of purchase accounting and $0.5 million of tax gains from discrete items. Excluding the aforementioned items from both periods, non-GAAP net income from continuing operations was $14.2 million, or $1.12 per diluted share, up from $13.1 million, or $1.03 per diluted share, in the prior-year period. The second quarter of fiscal 2017 results include $0.2 million of tax benefit from the adoption of ASU 2016-09. Net working capital (defined as accounts receivable plus inventories less accounts payable) was $169.3 million at the end of the second quarter of fiscal 2018, compared with $150.0 million a year earlier. Working capital turns improved to 5.0 in the second quarter of fiscal 2018 versus 4.6 in the year-earlier quarter primarily due to higher Accounts Payable. The Company closed the quarter with net debt (defined as debt less cash) of $106.8 million, compared with a net debt position of $3.0 million a year ago.\nA reconciliation of net income, earnings per share and net income from continuing operations from reported GAAP amounts to non-GAAP amounts is included later in this release.\nImpact of New Tax Regulations\nThe Company has evaluated the major changes of the new U.S. tax legislation that was signed into law in late December 2017. Based on the Company’s preliminary evaluation, a provisional estimate for two non-recurring charges of $13.8 million related to tax on foreign earnings and $1.2 million for the revaluation of deferred taxes due to the federal rate changes were included in second-quarter results. Over the long run, given that Standex generates a majority of its income overseas, management expects the tax law change to be a relatively neutral event for the Company that will marginally decrease its effective tax rate.\nManagement Comments\n“We delivered another quarter of topline growth across all five business segments and all regions,” said President and Chief Executive Officer David Dunbar. “In addition, our three recent acquisitions have continued to contribute positively to sales and margins.”\nSegment Review\nFood Service Equipment sales increased 5.4% year over year. Operating income on a GAAP basis increased by 8.8%, and decreased 5.4% on an adjusted basis due to $1.1 million of purchase accounting in the prior year.\n“Strong sales in Scientific, Refrigeration and Specialty Solutions were partially offset by lower Cooking sales. Operating income was positively impacted by an increased mix of differentiated products, but were more than offset by the weakness in standard products,” said Dunbar.\n“We have made meaningful progress with the restructuring of our standard products businesses,” Dunbar continued. “This includes implementing several lean manufacturing and operational programs that we expect will yield margin improvements in the second half of the year. In addition, we have implemented focused manufacturing footprint activities to consolidate our cabinet business in Refrigeration and we expect to benefit from those actions as early as the end of the fiscal year.”\n“Looking ahead, we remain focused on advancing our strategy to grow differentiated products through expanded market tests and growth laneways.”\nEngraving sales increased 31.0% year over year. Operating income was up 4.4% compared to last year.\n“Mold texturizing sales were once again up in all regions as we continued to capitalize on automotive OEM new model introductions and a strong contribution from the Piazza Rosa acquisition,” said Dunbar. “Our efforts to develop growth laneways in Engraving have continued to be very successful with new technology sales from Architexture, laser, tool finishing and nickel shell up $3.1 million. In addition, we have a rich funnel of growth opportunities that are being explored through market tests.”\n“Engraving margins were negatively impacted by implementation of growth initiatives as well as integration costs associated with the Piazza Rosa acquisition. We expect continued growth from new technologies and our Piazza Rosa acquisition.”\nEngineering Technologies sales increased 18.2% year over year, and operating income declined 18.6%.\n“Sales growth in Engineering Technologies was led by strength in Aviation sales,” said Dunbar. “However, margins were negatively impacted by large development programs in Space and Aviation. Legacy aviation pricing pressures continued to affect margins in the current quarter.”\n“Going forward, we remain focused on completing key Space and Aviation development programs, and ramping up to deliver on long-term Aviation programs for next-generation aircraft.”\nElectronics sales were up 61.5% year over year. Operating income was up 67.8%.\n“The year-over-year sales increase in Electronics was driven by double-digit organic growth in all regions, as well as strong contributions from Standex Electronics Japan. This acquisition continues to perform very well and deliver meaningful cost and sales synergies,” said Dunbar.\n“Looking ahead, we are focused on capitalizing on increased market demand, developing market tests for new sensor technologies, and expanding growth laneways.”\nHydraulics reported a 22.2% year-over-year sales increase while operating income increased 52.8%.\n“Hydraulics sales growth was primarily driven by strength in refuse as well as the recovery in the dump truck and trailer markets,” said Dunbar. “Backlog remained solid and our project pipeline remains strong. As a result, we remain optimistic about this segment for the remainder of fiscal 2018.”\nBusiness Outlook\n“Looking ahead, we expect strong sales momentum to continue in Engraving, Electronics, Engineering Technologies and Hydraulics,” said Dunbar. “In Food Service Equipment, we are confident that the operational improvements we are implementing will deliver higher margins. Our acquisition pipeline is robust, and our balance sheet is poised to fund future growth. With a focus on deploying the Standex Value Creation System across all businesses, we continue to position Standex to fulfill our mission to become a best-in-class operating company serving attractive, differentiated markets with solid growth prospects.”\nConference Call Details\nStandex will host a conference call for investors today, January 30, 2018 at 10:00 a.m. ET. On the call, David Dunbar, President and CEO, and Thomas DeByle, CFO, will review the Company’s financial results and business and operating highlights. Investors interested in listening to the webcast and viewing the slide presentation should log on to the “Investors” section of Standex’s website under the subheading, “Webcasts and Presentations”, located at www.standex.com . A replay of the webcast will also be available on the Company’s web site shortly after the conclusion of the presentation through February 13, 2018. To listen to the playback, please dial (800) 585-8367 in the U.S. or (404) 537-3406 internationally; the passcode is 8878539. The webcast replay also can be accessed in the “Investor Relations” section of the Company’s website, located at www.standex.com .\nUse of Non-GAAP Financial Measures\nIn addition to the financial measures prepared in accordance with generally accepted accounting principles (“GAAP”), the Company uses certain non-GAAP financial measures, including non-GAAP income from operations, non-GAAP net income from continuing operations, free operating cash flow, EBITDA (earnings before interest, taxes, depreciation and amortization) and adjusted earnings per share. The attached financial tables reconcile non-GAAP measures used in this press release to the most directly comparable GAAP measures. The Company believes that the use of non-GAAP measures including the impact of restructuring charges, purchase accounting, discrete tax events, and acquisition costs help investors to obtain a better understanding of our operating results and future prospects, consistent with how management measures and forecasts the Company's performance, especially when comparing such results to previous periods. An understanding of the impact in a particular quarter of specific restructuring costs, acquisition expenses, or other gains and losses, on net income (absolute as well as on a per-share basis), operating income or EBITDA can give management and investors additional insight into core financial performance, especially when compared to quarters in which such items had a greater or lesser effect, or no effect. Non-GAAP measures should be considered in addition to, and not as a replacement for, the corresponding GAAP measures, and may not be comparable to similarly titled measures reported by other companies.\nAbout Standex\nStandex International Corporation is a multi-industry manufacturer in five broad business segments: Food Service Equipment, Engraving, Engineering Technologies, Electronics, and Hydraulics with operations in the United States, Europe, Canada, Japan, Australia, Singapore, Mexico, Brazil, Argentina, Turkey, South Africa, India and China. For additional information, visit the Company's website at http://standex.com/ .\nStandex International Corporation Consolidated Statement of Operations (Unaudited) Three Months Ended Six Months Ended December 31, December 31, (In thousands, except share data) 2017 2016 2017 2016 Net sales $ 209,751 $ 173,854 $ 424,130 $ 353,454 Cost of sales 138,225 116,960 278,423 234,784 Gross profit 71,526 56,894 145,707 118,670 Selling, general and administrative expenses 50,679 40,493 100,705 82,105 Restructuring costs 1,966 1,664 4,970 2,058 Acquisition related costs 703 1,503 1,708 1,503 Income from operations 18,178 13,234 38,324 33,004 Interest expense 1,793 850 3,514 1,547 Other (income) expense, net (453) (332) (1,058) (766) Total 1,340 518 2,456 781 Income from continuing operations before income taxes 16,838 12,716 35,868 32,223 Provision for income taxes 19,642 2,274 24,672 7,437 Net income (loss) from continuing operations (2,804) 10,442 11,196 24,786 Income (loss) from discontinued operations, net of tax (3) 6 (2) (44) Net income (loss) $ (2,807) $ 10,448 $ 11,194 $ 24,742 Basic earnings per share: Income (loss) from continuing operations $ (0.22) $ 0.82 $ 0.88 $ 1.96 Income (loss) from discontinued operations - - - - Total $ (0.22) $ 0.82 $ 0.88 $ 1.96 Diluted earnings per share: Income (loss) from continuing operations $ (0.22) $ 0.82 $ 0.88 $ 1.94 Income (loss) from discontinued operations - - - - Total $ (0.22) $ 0.82 $\n0.88 $\n1.94 Average Shares Outstanding Basic 12,704 12,659 12,689 12,668 Diluted 12,704 12,761 12,778 12,778 As required, the fiscal results for the three and six months ended December 31, 2016 have been recast to include a tax benefit of $0.2 million and $0.6 million, respectively, from the adoption of Accounting Standards Update (ASU) 2016-09, Improvements to Employee Share-Based Payment Accounting. In addition, the ASU requires a prospective update to the treasury method of calculating weighted average diluted shares outstanding resulting in the inclusion of additional shares in our fiscal 2017 diluted EPS calculations.\nStandex International Corporation Condensed Consolidated Balance Sheets (Unaudited) December 31, June 30, (In thousands) 2017 2017 ASSETS Current assets: Cash and cash equivalents $ 109,389 $ 88,566 Accounts receivable, net 131,584 127,060 Inventories 130,715 119,401 Prepaid expenses and other current assets 9,604 8,397 Income taxes receivable 1,012 2,469 Deferred tax asset - 14,991 Total current assets 382,304 360,884 Property, plant, equipment, net 144,610 133,160 Intangible assets, net 102,216 102,503 Goodwill 249,685 242,690 Deferred tax asset 10,699 1,135 Other non-current assets 27,156 27,304 Total non-current assets 534,366 506,792 Total assets $ 916,670 $ 867,676 LIABILITIES AND STOCKHOLDERS' EQUITY Current liabilities: Accounts payable $ 93,049 $ 96,487 Accrued liabilities 63,985 58,694 Income taxes payable 6,685 4,783 Total current liabilities 163,719 159,964 Long-term debt 216,157 191,976 Accrued pension and other non-current liabilities 115,862 107,072 Total non-current liabilities 332,019 299,048 Stockholders' equity: Common stock 41,976 41,976 Additional paid-in capital 59,016 56,783 Retained earnings 723,435 716,605 Accumulated other comprehensive loss (112,075) (115,938) Treasury shares (291,420) (290,762) Total stockholders' equity 420,932 408,664 Total liabilities and stockholders' equity $ 916,670 $ 867,676 The condensed consolidated balance sheet at June 30, 2017 was derived from audited financial statements, but does not include all disclosures required by accounting principles generally accepted in the United States of America.\nStandex International Corporation and Subsidiaries Statements of Consolidated Cash Flows (Unaudited) Six Months Ended December 31, (In thousands) 2017 2016 Cash Flows from Operating Activities Net income $ 11,193 $ 24,742 Loss from discontinued operations 2 44 Income from continuing operations 11,195 24,786 Adjustments to reconcile net income to net cash provided by operating activities: Depreciation and amortization 14,052 9,044 Stock-based compensation 2,877 2,843 Non-cash portion of restructuring charge 664 42 Contributions to defined benefit plans (530) (624) Net changes in operating assets and liabilities (2,592) (15,248) Net cash provided by operating activities - continuing operations 25,666 20,843 Net cash (used in) operating activities - discontinued operations (45) (227) Net cash provided by operating activities 25,621 20,616 Cash Flows from Investing Activities Expenditures for property, plant and equipment (15,683) (13,029) Expenditures for acquisitions, net of cash acquired (10,397) (24,660) Proceeds from life insurance policies 2,217 24 Other investing activities 1,093 652 Net cash (used in) investing activities (22,770) (37,013) Cash Flows from Financing Activities Proceeds from borrowings 108,500 73,000 Payments of debt (87,288) (41,000) Activity under share-based payment plans 622 618 Purchase of treasury stock (1,924) (6,905) Cash dividends paid (4,312) (3,798) Net cash provided by financing activities 15,598 21,915 Effect of exchange rate changes on cash 2,374 (6,205) Net changes in cash and cash equivalents 20,823 (687) Cash and cash equivalents at beginning of year 88,566 121,988 Cash and cash equivalents at end of period $ 109,389 $ 121,301 As required, the fiscal results for the three and six months ended December 31, 2016 have been recast to include a tax benefit of $0.2 million and $0.6 million, respectively, from the adoption of Accounting Standards Update (ASU) 2016-09, Improvements to Employee Share-Based Payment Accounting.\nStandex International Corporation Selected Segment Data (Unaudited) Three Months Ended Six Months Ended December 31, December 31, (In thousands) 2017 2016 2017 2016 Net Sales\nFood Service Equipment $ 97,222 $ 92,200 $ 200,287 $ 184,852 Engraving 33,879 25,861 66,708 52,591 Engineering Technologies 21,928 18,549 42,195 37,269 Electronics 46,035 28,497 92,850 59,148 Hydraulics 10,687 8,747 22,090 19,594 Total $ 209,751 $ 173,854 $ 424,130 $ 353,454\nIncome from operations\nFood Service Equipment $ 7,841 $ 7,206 $ 18,266 $ 16,694 Engraving 6,796 6,510 14,216 13,907 Engineering Technologies 1,529 1,877 2,695 3,372 Electronics 10,221 6,091 20,457 12,565 Hydraulics 1,496 979 3,348 3,108 Restructuring (1,966) (1,664) (4,970) (2,058) Acquisition related costs (703) (1,503) (1,708) (1,503) Corporate (7,036) (6,262) (13,980) (13,081) Total $ 18,178 $ 13,234 $ 38,324 $ 33,004 Standex International Corporation Reconciliation of GAAP to Non-GAAP Financial Measures (Unaudited) Three Months Ended Six Months Ended December 31, December 31, (In thousands, except percentages) 2017\n2016\n%\nChange\n2017\n2016\n%\nChange\nAdjusted income from operations and adjusted net income from continuing operations: Income from operations, as reported $ 18,178 $ 13,234 37.4% $ 38,324 $ 33,004 16.1% Adjustments: Restructuring charges 1,966 1,664 4,970 2,058 Acquisition-related costs 703 1,503 1,708 1,503 Purchase accounting - 1,086 205 1,086 Adjusted income from operations $ 20,847 $ 17,487 19.2% $ 45,207 $ 37,651 20.1% Interest and other income (expense), net (1,340) (518) (2,456) (781) Provision for income taxes (19,642) (2,274) (24,672) (7,437) Discrete and other tax items 15,016 (467) 15,016 (467) Tax impact of above adjustments (678) (1,114) (1,748) (1,218) Net income from continuing operations, as adjusted $\n14,203 $ 13,114 8.3% $ 31,347 $ 27,748 13.0% EBITDA and Adjusted EBITDA: Net income from continuing operations, as reported $ (2,804) $ 10,442 $ 11,196 $ 24,786 Add back: Provision for Income Taxes 19,642 2,274 24,672 7,437 Interest expense 1,793 850 3,514 1,547 Depreciation and amortization 7,183 4,671 14,052 9,044 EBITDA $ 25,814 $ 18,237 41.5% $ 53,434 $ 42,814 24.8% Adjustments: Restructuring charges 1,966 1,664 4,970 2,058 Acquisition-related costs 703 1,503 1,708 1,503 Purchase accounting - 1,086 205 1,086 Adjusted EBITDA $ 28,483 $ 22,490 26.6% $ 60,317 $ 47,461 27.1% Free operating cash flow: Net cash provided by operating activities - continuing operations, as reported $ 31,121 $ 19,394 $ 25,666 $ 20,843 Less: Capital expenditures (6,827) (5,908) (15,683) (13,029) Free operating cash flow $ 24,294 $ 13,486 $ 9,983 $ 7,814 Net income from continuing operations (2,804) 10,442 11,194 24,786 Discrete tax item - tax on foreign cash 15,016 - 15,016 - Adjusted net income 12,212 10,442 26,210 24,786 Conversion of free operating cash flow 198.9% 129.2% 38.1% 31.5% Standex International Corporation Reconciliation of GAAP to Non-GAAP Financial Measures (Unaudited) Three Months Ended Six Months Ended December 31, December 31, Adjusted earnings per share from continuing operations\n2017 2016 %\nChange\n2017 2016 %\nChange\nDiluted earnings per share from continuing operations, as reported $ (0.22) $ 0.82 (126.8%) $ 0.88 $ 1.94 (54.6%) Adjustments: Restructuring charges 0.12 0.10 0.29 0.12 Acquisition-related costs 0.04 0.09 0.10 0.09 Discrete Tax Items 1.18 (0.04) 1.18 (0.04) Purchase accounting expenses - 0.06 0.01 0.06 Diluted earnings per share from continuing operations, as adjusted $ 1.12 $ 1.03 8.7% $ 2.46 $ 2.17 13.4% Safe Harbor Language\nStatements in this news release include, or may be based upon, management's current expectations, estimates and/or projections about Standex's markets and industries. These statements are forward-looking statements within the meaning of The Private Securities Litigation Reform Act of 1995. Actual results may materially differ from those indicated by such forward-looking statements as a result of certain risks, uncertainties and assumptions that are difficult to predict. Among the factors that could cause actual results to differ are the impact of implementation of government regulations and programs affecting our businesses, unanticipated legal judgments, fines or settlements, uncertainty in conditions in the financial and banking markets, general domestic and international economic conditions in the markets we serve, the impact of foreign exchange, increases in raw material costs, the ability to substitute less expensive alternative raw materials, changes in the heavy construction vehicle market, the ability to continue to successfully implement productivity improvements, market acceptance of our products, our ability to design, introduce and sell new products and related product components, the ability to redesign certain of our products to continue meeting evolving regulatory requirements, the impact of delays initiated by our customers, our ability to increase manufacturing production to meet demand, increase market share, access new markets, introduce new products, enhance our presence in strategic channels, the successful expansion and automation of manufacturing capabilities and diversification efforts in emerging markets, the ability to continue to achieve cost savings through lean manufacturing, cost reduction activities, and low cost sourcing, effective completion of plant consolidations, successful completion and integration of acquisitions, changes in pension funding requirements, the impact of recently passed tax reform legislation in the United States and the other factors discussed in the Annual Report of Standex on Form 10-K for the fiscal year ending June 30, 2017, which is on file with the Securities and Exchange Commission, and any subsequent periodic reports filed by the Company with the Securities and Exchange Commission. In addition, any forward-looking statements represent management's estimates only as of the day made and should not be relied upon as representing management's estimates as of any subsequent date. While the Company may elect to update forward-looking statements at some point in the future, the Company and management specifically disclaim any obligation to do so, even if management's estimates change.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130005770/en/\nStandex International Corporation\nThomas DeByle, 603-893-9701\nCFO\nInvestorRelations@Standex.com\nSource: Standex International Corporation", "external_links": ["http://www.businesswire.com/news/home/20180130005770/en/", "http://standex.com/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fstandex.com%2F&esheet=51750779&newsitemid=20180130005770&lan=en-US&anchor=http%3A%2F%2Fstandex.com%2F&index=3&md5=669957f77d454b619b091f5b59d1eeab", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.standex.com&esheet=51750779&newsitemid=20180130005770&lan=en-US&anchor=www.standex.com&index=1&md5=6d3434b88484fe08196b714ab3a5c6dc", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.standex.com&esheet=51750779&newsitemid=20180130005770&lan=en-US&anchor=www.standex.com&index=2&md5=49cd6e80668648b2fc4e9954a54b36dd"], "published": "2018-01-30T16:51:00.000+02:00", "crawled": "2018-01-30T18:30:07.000+02:00", "highlightTitle": ""}