{"organizations": [], "uuid": "4c68b09974c18fc7b82984e98dcc7b873cbab53b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221470042&w=1200&r=LYNXMPEE0B12U", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-global-economy-outlook/year-of-policy-tightening-set-for-early-canadian-test-idUKKBN1F11SW", "country": "US", "domain_rank": 408, "title": "Year of policy tightening set for early Canadian test", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T16:48:00.000+02:00", "replies_count": 0, "uuid": "4c68b09974c18fc7b82984e98dcc7b873cbab53b"}, "author": "", "url": "https://uk.reuters.com/article/uk-global-economy-outlook/year-of-policy-tightening-set-for-early-canadian-test-idUKKBN1F11SW", "ord_in_thread": 0, "title": "Year of policy tightening set for early Canadian test", "locations": [], "entities": {"persons": [{"name": "padraic halpin", "sentiment": "negative"}, {"name": "stephen poloz", "sentiment": "none"}, {"name": "carolyn wilkins", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "ottawa", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}], "organizations": [{"name": "bank of canada", "sentiment": "none"}, {"name": "boc", "sentiment": "none"}, {"name": "cibc economics", "sentiment": "none"}, {"name": "min read  dublin", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 2:49 PM / Updated 34 minutes ago Year of policy tightening set for early Canadian test Padraic Halpin 5 Min Read \nDUBLIN (Reuters) - The Bank of Canada will get the first crack in the coming week at demonstrating whether, as many expect, monetary policy among the world’s major economies is set to tighten more in 2018 than in any year since the crisis. FILE PHOTO: Bank of Canada Governor Stephen Poloz (R) and Senior Deputy Governor Carolyn Wilkins walk to a news conference in Ottawa, Ontario, Canada, July 12, 2017. REUTERS/Chris Wattie/File Photo \nYet when policymakers gather in Ottawa on Wednesday, there is an outside chance they instead provide a warning that a gradual move away from a decade of massive stimulus will not be straightforward in these more politically unpredictable times. \nExpectations that the BoC will boost interest rates for the third time since July had surged in the run up to the meeting when blowout jobs data and a more positive business outlook added to momentum in the G7-member’s economy. \nCIBC Economics called the Jan 8 business survey - which showed signs of capacity pressures and labour shortages picking up - “the last key piece of the puzzle for a rate hike.” \nHowever, a Reuters report two days later that Canada was increasingly convinced Donald Trump would soon announce the United States intends to pull out of the North American Free Trade Agreement (NAFTA) sent the Canadian dollar to its lowest level against the greenback in 2018. \nWhile that initially tempered bets that rates were set to go up, a 25 basis point hike was nearly fully priced into the market on Friday. The overnight index swaps market showed a 95 percent probability rates will go up to 1.25 percent. [BOCWATCH] \n“We expect the BoC to continue to increase its key interest rates, but not until the March meeting,” Commerzbank’s Thu Lan Nguyen said, noting the extra time would also allow policymakers ensure that the upward trend in inflation - currently at the middle of the 1 to 3 percent target range - is sustainable. \nNext week’s decision is still likely to be a very close one, she added. \nLast year’s two rate rises - the BoC’s first in seven years - came alongside a quickening pace of hikes in the United States as improving economic growth allows major central banks to raise rate and no longer feel the need to expand their balance sheets. \nIn recent days the Japanese central bank’s scaling back of bond purchases sparked a global bond market selloff while the minutes from the European Central Bank’s last meeting suggested policymakers could soon start preparing markets for the end of their 2.55 trillion euro stimulus scheme. \n(Graphic for Canada's rates, click reut.rs/2DqxoZW ) FILE PHOTO: Bank of Canada Governor Stephen Poloz takes part in a news conference in Ottawa, Ontario, Canada, October 25, 2017. REUTERS/Chris Wattie/File Photo ALL EYES ON INFLATION \nThe ECB minutes also made clear that any material shift this year will depend on data showing a sustainable pick-up in inflation and council members will get their hands on the final estimates of euro area inflation for December on Wednesday. \nInflation slowed a touch as expected last month to 1.4 percent, according to flash estimates, even as consumer price growth in Germany hit a five-year high of 1.6 percent, creeping close to the ECB’s target of below, but close to 2 percent. \nFinal inflation figures for Germany and Italy are also due next week while the ECB holds its next policy meeting on Jan 25. \nIn Britain - where the economy looks set for a subdued run-up to Brexit, according to a range of indicators - policymakers face a different inflationary issue on the back of the pound’s plunge following the June 2016 vote to leave the European Union. \nInflation hit its highest level in nearly six years in November at 3.1 percent. The BoE and many economists think that will prove to be the peak, giving some relief to households that have seen the value of their earnings eroded by rising prices. \nThat theory will be tested with the release of December’s inflation data on Tuesday with retail sales figures later in the week offering a snapshot of how confident consumers felt over the Christmas period. \n“At this time of year, UK retail sales figures are ‘noisy’,” Investec economist Victoria Clarke cautioned, citing past volatility in the numbers depending on which day Christmas falls and more recently the difficulty in fully adjusting the series for the seasonal trends related to November Black Friday sales. \n“As such, we await the full retail sales data for the months November to January, to judge how consumer spending has fared through the crucial seasonal period, amidst the ongoing household cash squeeze.” \nThe big data point of the week will arrive on Thursday with a flurry of releases from China including fourth quarter GDP and December industrial, retail sales and house price numbers. \nChina’s Premier Li Keqiang has said the economy is expected to have grown around 6.9 percent last year, beating the government’s target of about 6.5 percent and accelerating from a 26-year low the year before. Additional reporting by Leah Schnurr in Ottawa; Editing by Toby Chopra", "external_links": [], "published": "2018-01-12T16:48:00.000+02:00", "crawled": "2018-01-12T17:16:07.014+02:00", "highlightTitle": ""}