{"organizations": [], "uuid": "7ae947b2bb3b71f8b6f2599f697e886c0014be77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222048748&w=1200&r=LYNXMPEE0E06I", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/global-oil/oil-near-three-year-highs-on-output-cuts-despite-rising-north-american-rig-count-idINKBN1F40C0", "country": "US", "domain_rank": 408, "title": "Oil near three-year highs on output cuts despite rising North American rig count", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T06:25:00.000+02:00", "replies_count": 0, "uuid": "7ae947b2bb3b71f8b6f2599f697e886c0014be77"}, "author": "", "url": "https://in.reuters.com/article/global-oil/oil-near-three-year-highs-on-output-cuts-despite-rising-north-american-rig-count-idINKBN1F40C0", "ord_in_thread": 0, "title": "Oil near three-year highs on output cuts despite rising North American rig count", "locations": [], "entities": {"persons": [{"name": "henning gloystein", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "kawasaki", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "min read  singapore", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "organization of the petrol", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "anz", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Oil hovered below a three-year high near $70 a barrel on Monday on signs that production cuts by OPEC and Russia are tightening supplies, but analysts warned of “red flags” due to surging U.S. production.\nA flame shoots out of a chimney at a petro-industrial factory in Kawasaki near Tokyo December 18, 2014. REUTERS/Thomas Peter/Files International benchmark Brent crude futures were trading 12 cents lower at $69.75 by 1330 GMT, having risen above $70 earlier in the session.\nU.S. West Texas Intermediate (WTI) crude futures were unchanged at $64.30 a barrel. Trading was relatively slow due to a national holiday in the United States.\nA production-cutting pact between the Organization of the Petroleum Exporting Countries, Russia and other producers has given a strong tailwind to oil prices, with both benchmarks last week hitting levels not seen since December 2014.\nGrowing signs of a tightening market after a three-year rout have bolstered confidence among traders and analysts that prices can be sustained near current levels.\nBank of America Merrill Lynch on Monday raised its 2018 Brent price forecast to $64 a barrel from $56, forecasting a deficit of 430,000 barrels per day (bpd) in oil production compared to demand this year.\nOther factors, including political risk, have also supported crude.\n“Tighter fundamentals are (the) main driver to the rally in prices, but geopolitical risk and currency moves along with speculative money in tandem have exacerbated the move,” U.S. bank JPMorgan said in a note.\nRED FLAGS Still, a number of analysts have warned that the 13 percent rally since the start of the year could peter out in the short term due to global refinery maintenance and rising North American production.\nU.S. energy companies added 10 oil rigs in the week to Jan. 12, taking the number to 752, energy service firm Baker Hughes said on Friday.\nThat was the biggest increase since June 2017.\nIn Canada, energy firms almost doubled the number of rigs drilling for oil last week to 185, the highest level in 10 months.\nVienna-based consultancy JBC Energy expects U.S. production to grow by 600,000 bpd in the first quarter of 2018 compared to a year earlier.\n“From a fundamental perspective, the surge in U.S. managed money raises a clear red flag for us. We see the U.S. complex as decidedly bearish over the next two months.”\nThe surplus in crude is expected “to widen to levels that will overwhelm the market”, JBC said in a note. Seasonal refinery maintenance will further limit demand for crude, it added.\nAdditional reporting by Henning Gloystein in Singapore; Editing by Dale Hudson and Louise Heavens\n ", "external_links": [], "published": "2018-01-15T06:25:00.000+02:00", "crawled": "2018-01-15T06:43:56.006+02:00", "highlightTitle": ""}