{"organizations": [], "uuid": "8a414d84961c31a6b394ddb81c33302c2264821d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-griffon-corporation-schedules-conference-call-to-discuss-first-quarter-2018-financial-results.html", "country": "US", "domain_rank": 767, "title": "Griffon Corporation Schedules Conference Call To Discuss First Quarter 2018 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.013, "site_type": "news", "published": "2018-01-25T00:05:00.000+02:00", "replies_count": 0, "uuid": "8a414d84961c31a6b394ddb81c33302c2264821d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-griffon-corporation-schedules-conference-call-to-discuss-first-quarter-2018-financial-results.html", "ord_in_thread": 0, "title": "Griffon Corporation Schedules Conference Call To Discuss First Quarter 2018 Financial Results", "locations": [], "entities": {"persons": [{"name": "griffon", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "griffon corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "griffon corporation griffon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Griffon Corporation (NYSE:GFF) announced today that it will release the Company’s fiscal first quarter financial results Wednesday, January 31, 2018, followed by a conference call at 8:30 AM ET.\nThe call can be accessed by dialing 1-888-378-4439 (U.S. participants) or 1-323-794-2149 (International participants). Callers should ask to be connected to the Griffon Corporation teleconference or provide conference ID number 2623292.\nA replay of the call will be available starting on Wednesday, January 31, 2018 at 11:30 AM ET by dialing 1-844-512-2921 (U.S.) or 1-412-317-6671 (International), and entering the conference ID number: 2623292. The replay will be available through Wednesday, February 14, 2018 at 11:59 PM ET.\nAbout Griffon Corporation\nGriffon is a diversified management and holding company that conducts business through wholly-owned subsidiaries. Griffon oversees the operations of its subsidiaries, allocates resources among them and manages their capital structures. Griffon provides direction and assistance to its subsidiaries in connection with acquisition and growth opportunities as well as in connection with divestitures. In order to further diversify, Griffon also seeks out, evaluates and, when appropriate, will acquire additional businesses that offer potentially attractive returns on capital.\nHeadquartered in New York, N.Y., the Company was founded in 1959 and is incorporated in Delaware. Griffon is listed on the New York Stock Exchange and trades under the symbol GFF.\nGriffon currently conducts its operations through two reportable segments:\nHome & Building Products consists of three companies, The AMES Companies, Inc. (“AMES”), Clopay Building Products Company, Inc. (“CBP”) and ClosetMaid LLC (“ClosetMaid”): AMES, founded in 1774, is the leading U.S. manufacturer and a global provider of long-handled tools and landscaping products for homeowners and professionals. CBP, since 1964, is a leading manufacturer and marketer of residential and commercial garage doors and sells to professional dealers and some of the largest home center retail chains in North America. ClosetMaid, founded in 1965, is a leading North American manufacturer and marketer of closet organization, home storage, and garage storage products, and sells to some of the largest home center retail chains, mass merchandisers, and direct-to-builder professional installers. Telephonics, founded in 1933, is recognized globally as a leading provider of highly sophisticated intelligence, surveillance and communications solutions for defense, aerospace and commercial customers.\nClassified as a discontinued operation, Clopay Plastic Products Company, Inc., incorporated in 1934, is a global leader in the development and production of embossed, laminated and printed specialty plastic films for hygienic, health-care and industrial products and sells to some of the world's largest consumer products companies.\nFor more information on Griffon and its operating subsidiaries, please see the Company’s website at www.griffon.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124006072/en/\nGriffon Corporation:\nBrian G. Harris, 212-957-5000\nSVP & Chief Financial Officer\nor\nInvestor Relations:\nMichael Callahan, 203-682-8311\nSenior Vice President, ICR Inc.\nSource: Griffon Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.griffon.com&esheet=51748457&newsitemid=20180124006072&lan=en-US&anchor=www.griffon.com&index=1&md5=949ca2e7bd01a99bfe2361e9c45cfaf5", "http://www.businesswire.com/news/home/20180124006072/en/"], "published": "2018-01-25T00:05:00.000+02:00", "crawled": "2018-01-25T02:34:29.005+02:00", "highlightTitle": ""}