{"organizations": [], "uuid": "a2723a72f29c87760e9be6c763c0e894c4a22199", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-heitman-redeems-om-asset-managements-interest-in-firm.html", "country": "US", "domain_rank": 767, "title": "Heitman Redeems OM Asset Management's Interest in Firm", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:30:00.000+02:00", "replies_count": 0, "uuid": "a2723a72f29c87760e9be6c763c0e894c4a22199"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-heitman-redeems-om-asset-managements-interest-in-firm.html", "ord_in_thread": 0, "title": "Heitman Redeems OM Asset Management's Interest in Firm", "locations": [], "entities": {"persons": [{"name": "heitman", "sentiment": "none"}, {"name": "maury r. tognarelli", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "heitman", "sentiment": "none"}], "organizations": [{"name": "heitman llc", "sentiment": "negative"}, {"name": "heitman redeems om asset management", "sentiment": "negative"}, {"name": "om asset management plc", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "heitman", "sentiment": "none"}, {"name": "omam", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 8, 2018 /PRNewswire/ -- Heitman LLC (\"Heitman\"), a global real estate investment management firm, today announced that it redeemed OM Asset Management plc's (NYSE: OMAM) ownership interest in Heitman for $110 million in a transaction that closed on January 5, 2018.\nSubsequent to the transaction, Heitman, which was previously 50 percent owned and controlled by senior professionals of the firm and 50 percent by an entity controlled by OMAM, is now 100 percent owned and controlled by its senior officers, who will continue in their roles and responsibilities for creating and executing annual business plans, day-to-day operations, the investment and client management process, and setting firm-wide strategy.\n\"The acquisition of OMAM's interest in Heitman represents another significant milestone for the firm in our ongoing mission to be one of the leading real estate investment management firms,\" said Maury R. Tognarelli, Heitman CEO. \"The consolidation of the firm's ownership is indicative of the confidence we have in ourselves and further aligns our interests with those of our clients.\"\nHeitman's employee ownership and control is an important differentiator. At present, 40 senior professionals from across the firm's business and support operations share in the ownership. Heitman has approximately $39 billion in assets under management with operations across North America, Europe, and Asia-Pacific. The firm is headquartered in Chicago, with offices in Los Angeles, London, Luxembourg, Frankfurt, Munich, Warsaw, Hong Kong, Seoul, Tokyo, and Melbourne.\n\"We are acutely aware that we are in the position to redeem OMAM's interest in our firm as a result of the support and confidence our clients place in us at Heitman, each and every day. All of us understand the profound responsibilities we accept when engaged by our clients and we are committed to rewarding the trust placed in us by serving them and meeting or exceeding their real estate investment objectives,\" said Tognarelli.\nAbout Heitman\nFounded in 1966, Heitman LLC is a global real estate investment management firm with approximately $39 billion in assets under management. Heitman's real estate investment strategies include direct investments in the equity or debt capitalization of a property or in the securities of listed and publicly traded real estate companies. Heitman serves a global client base with clients from North American, European, Middle Eastern and Asia-Pacific institutions, pension plans, foundations and corporations and individual investors. Headquartered in Chicago, with offices in Los Angeles, London, Luxembourg, Frankfurt, Munich, Warsaw, Hong Kong, Seoul, Tokyo, and Melbourne, Heitman's more than 360 employees offer specialized expertise – from a specific discipline to local insight.\nView original content with multimedia: http://www.prnewswire.com/news-releases/heitman-redeems-om-asset-managements-interest-in-firm-300578311.html\nSOURCE Heitman LLC", "external_links": ["http://www.prnewswire.com/news-releases/heitman-redeems-om-asset-managements-interest-in-firm-300578311.html"], "published": "2018-01-08T16:30:00.000+02:00", "crawled": "2018-01-08T19:40:05.030+02:00", "highlightTitle": ""}