{"organizations": [], "uuid": "21b8067d2b4891b3450dda9d3af9eb5414dcf66f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-orrstown-financial-services-inc-reports-fourth-quarter-and-full-year-2017-net-income-impact-of-tax-law-changes-and.html", "country": "US", "domain_rank": 767, "title": "Orrstown Financial Services, Inc. Reports Fourth Quarter and Full Year 2017 Net Income, Impact of Tax Law Changes and Quarterly Dividend of $0.12 per Share", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:20:00.000+02:00", "replies_count": 0, "uuid": "21b8067d2b4891b3450dda9d3af9eb5414dcf66f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-orrstown-financial-services-inc-reports-fourth-quarter-and-full-year-2017-net-income-impact-of-tax-law-changes-and.html", "ord_in_thread": 0, "title": "Orrstown Financial Services, Inc. Reports Fourth Quarter and Full Year 2017 Net Income, Impact of Tax Law Changes and Quarterly Dividend of $0.12 per Share", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "orrstown financial services, inc", "sentiment": "neutral"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Net income for the quarter ended December 31, 2017 totaled $6 thousand, or $0.00 per diluted share, compared with $1.9 million, or $0.24 per diluted share, for the same period in 2016. The fourth quarter of 2017 included a tax expense charge of $2.65 million for revaluation of certain net deferred tax assets related to the corporate income tax rate change enacted in the fourth quarter as part of the Tax Cuts and Jobs Act. Net income for the 2017 totaled $8.1 million, or $0.98 per diluted share, compared with $6.6 million, or $0.81 per diluted share, for the same period in 2016. The tax expense charge impacted both the quarter and 2017, by $0.32 per diluted share.\nEarnings Per Share Three Months Twelve Months Ended December 31, 2017 Reported $ 0.00 $ 0.98 Adjusted (Non-GAAP) (a) $ 0.32 $ 1.30 (a) Excludes revaluation of certain net deferred tax assets resulting from federal tax legislation; see the GAAP to Non-GAAP Reconciliation included later in this release. Gross loans outstanding at December 31, 2017, excluding loans held for sale, totaled $1.0 billion, an increase of $126.6 million, or 14.3%, compared with the balance of $883.4 million at December 31, 2016. Deposits totaled $1.22 billion at December 31, 2017, growing 5.8% compared with the $1.15 billion balance at December 31, 2016. Net interest income for the quarter ended December 31, 2017 totaled $11.3 million, an increase of 16.7% over the quarter ended December 31, 2016, of $9.7 million, with net interest margin, on a taxable-equivalent basis, increasing from 3.20% to 3.27% for the respective periods. Net interest income totaled $43.4 million for the 2017, an 18.7% increase compared with $36.5 million for the 2016. Net interest margin, on a taxable-equivalent basis, increased from 3.14% in 2016 to 3.32% in 2017. The Board of Directors declared a cash dividend of $0.12 per common share, payable February 9, 2018, to shareholders of record as of February 3, 2018, a 20.0% increase over the dividend declared in the first quarter of 2017.\nSHIPPENSBURG, Pa., Jan. 24, 2018 (GLOBE NEWSWIRE) -- Orrstown Financial Services, Inc. (the “Company”) (NASDAQ:ORRF), the parent company of Orrstown Bank (the “Bank”) and Wheatland Advisors, Inc. (\"Wheatland\"), announced earnings for the quarter and 2017. Net income totaled $6 thousand for the quarter ended December 31, 2017, compared with $1.9 million for the same period in 2016. For the 2017, net income totaled $8.1 million, compared with $6.6 million for 2016. Diluted earnings per share totaled $0.00 and $0.98 for the quarter and 2017, respectively, compared with $0.24 and $0.81 for the same 2016 periods. Earnings in 2017 reflected increased interest income from expanding loan and investment portfolios and an increased rate environment, but were negatively impacted by a $2.65 million tax expense to revalue certain of the Company's net deferred tax assets in the fourth quarter upon enactment of the Tax Cuts and Jobs Act (the \"Tax Act\"). Excluding the Tax Act expense charge, earnings per diluted share totaled $0.32 and $1.30 for the quarter and 2017, respectively.\nThomas R. Quinn, Jr., President and Chief Executive Officer, commented, “Our fourth quarter results continue to validate our strategic plan. Net income, absent the effects of the Tax Act expense charge, increased more than 60% year-over-year, supported by sustained double-digit loan growth as well as year-over-year margin expansion. Our newest Lancaster County branch, opened in late August in New Holland, is our third full service location in this vibrant market and all three continue to outperform expectations. I’m pleased to announce that plans are well underway for three additional Lancaster County locations in 2018 and we are also exploring opportunities for growth in other contiguous markets.”\nOPERATING RESULTS\nNet Interest Income\nNet interest income totaled $11.3 million for the quarter ended December 31, 2017, a 16.7% increase compared with the same period in 2016. For the 2017, net interest income totaled $43.4 million, an 18.7% increase compared with 2016. Net interest margin on a taxable-equivalent basis totaled 3.27% for the quarter and 3.32% for the 2017, compared with 3.20% and 3.14% for 2016.\nThroughout 2017, increased yields on loans and investments reflected a higher interest rate environment compared with 2016. Tax-exempt securities with taxable-equivalent yields higher than the portfolio average, added to the portfolio in late 2016 and early 2017, also contributed to increased investment yields. The cost of interest-bearing liabilities increased at a slower pace than the yields earned on interest-earning assets in 2017, as the market for interest-bearing liabilities was initially slower to respond to interest rate changes. Yields earned on interest-earning assets increased each quarter in 2017, but the net interest margin of 3.27% in the fourth quarter of 2017 was 4 basis points less than the 3.31% experienced in the third quarter of 2017, and 8 basis points lower than each of the first two quarters of 2017, principally due to increases in costs of interest-bearing liabilities.\nProvision for Loan Losses\nThe Company recorded an $800 thousand provision for loan losses for the quarter ended December 31, 2017 compared with $0 in the same period in 2016. For the 2017, the provision for loan losses totaled $1.0 million compared with $250 thousand in 2016. The provision expense in the fourth quarter of 2017 principally reflected a charge-off on one commercial loan that was downgraded to nonaccrual status. In calculating the required provision for loan losses, both quantitative and qualitative factors are considered in the determination of the adequacy of the allowance for loan losses. The Company has experienced the benefit of favorable historical charge-off data and generally stable economic and market conditions for the last few years. These factors have contributed in the determination that a provision for loan losses that offset net charge-offs in the fourth quarter of 2017 was required to maintain an adequate allowance for loan losses.\nThe growth the Company has experienced in its loan portfolio is one factor that may result in the need for a determination of additional provisions for loan losses in future quarters.\nNoninterest Income\nNoninterest income for the quarter ended December 31, 2017, excluding securities gains, totaled $5.2 million compared with $5.0 million in 2016. For the 2017, noninterest income, excluding securities gains, totaled $19.2 million, an $878 thousand, or 4.8%, increase compared with 2016.\nTrust, investment management and brokerage income increased $499 thousand and $1.3 million in comparing the quarter and year ended December 31 from 2016 to 2017. Wheatland Advisors, Inc., acquired in December 2016, has been a significant contributor to the increases in 2017. Trust department fees have also increased as additional revenues have been generated from favorable market conditions and the addition of an office in Berks County, Pennsylvania.\nMortgage banking income decreased $225 thousand in comparing the fourth quarter of 2017 with 2016, and decreased $493 thousand in comparing the 2017 with 2016. The comparisons reflect decreased refinance activity as interest rates have increased, some slight compression in profit margins, as well as the effect of retaining a portion of mortgage production for the loan portfolio in 2017 over 2016.\nInvestment securities gains totaled $0 and $1.2 million for the quarter and 2017, compared with $0 and $1.4 million for the same periods in 2016. At times, the Company may accelerate earnings on securities through gains as market conditions present opportunities to reposition part of its investment portfolio to improve responsiveness of the portfolio to increases in Fed Funds rates, or to act on asset/liability management strategies and interest rate conditions, while also meeting the funding requirements of anticipated lending activity.\nNoninterest Expenses\nNoninterest expenses totaled $12.7 million and $50.3 million for the quarter and 2017, compared with $12.5 million and $48.1 million for the corresponding 2016 periods.\nThe principal drivers of noninterest expenses in comparing the 2017 with 2016 were salaries and employee benefits, occupancy, furniture and equipment costs and professional services. As noted in the past several quarters, increases for salaries and benefits include previously disclosed market expansion actions by the Company as it has added new, primarily customer-facing, employees and facilities, principally in Berks, Cumberland, Dauphin and Lancaster counties. In the third quarter of 2017, the Company also expanded its lending activities in York County, Pennsylvania, with the addition of two lenders focused in this region.\nSalaries and employee benefits totaled $7.8 million and $30.1 million for the quarter and 2017, compared with $7.1 million and $26.4 million for the same periods in 2016. Higher expenses throughout 2017 have been incurred for the aforementioned additional employees, merit increases and increased incentive compensation, increased health care costs, and incremental expense for additional share-based awards granted in 2017.\nProfessional services expenses totaled $435 thousand and $2.4 million for the quarter and 2017, compared with $507 thousand and $2.2 million for the same periods in 2016. Generally, professional fees in 2017 have been lower than in 2016, when additional costs for outstanding litigation against the Company and administrative proceedings by the Securities and Exchange Commission were incurred. In the third quarter of 2017, the Company did incur $508 thousand of fees due to indemnification costs to several professional service providers in connection with previously disclosed outstanding litigation against the Company.\nNoninterest expenses for 2016 included a regulatory settlement expense of $1.0 million paid to the Securities and Exchange Commission to settle previously disclosed administrative proceedings.\nOther operating expenses totaled $1.3 million and $6.0 million for the quarter and 2017, compared with $1.6 million and $6.6 million for the same periods in 2016. A principal contributor to the reduction year over year was a decrease in expense for off-balance sheet commitment reserve requirements.\nOther line items within noninterest expenses showed fluctuations attributable to normal business operations between 2017 and 2016.\nIncome Taxes\nIncome tax expense totaled $3.0 million and $4.3 million for the quarter and 2017, compared with $275 thousand and $1.3 million for the same periods in 2016. In the fourth quarter of 2017, the Tax Act, a principal provision of which will lower the Company's marginal federal corporate income tax rate from 34% to 21% beginning January 1, 2018, was enacted. In accordance with accounting principles generally accepted in the United States of America (GAAP), the Company revalued certain of its net deferred tax assets to reflect the lower corporate income tax rate and recognized a net $2.65 million expense in the fourth quarter. The Company's deferred tax assets related to low-income housing credit and alternative minimum tax credit carryforwards were not impacted by the change in tax rate, as they are treated as payments on future federal income taxes due and are not subject to revaluation at the new Tax Act rate.\nFINANCIAL CONDITION\nAssets totaled $1.56 billion at December 31, 2017, an increase of $144.3 million from $1.41 billion at December 31, 2016. Loans, which are summarized below, were the principal driver for the growth in total assets at December 31, 2017 from December 31, 2016. Securities available for sale increased modestly from $400.2 million in 2016 to $415.3 million in 2017. Deposit growth of $67.1 million and an overall increase in borrowings of $65.4 million in 2017 were the primary sources of funding for growth in loans and securities.\nGross loans, excluding those held for sale, totaled $1.0 billion at December 31, 2017, increasing $126.6 million, or 14.3%, from $883.4 million at December 31, 2016.\nThe following table presents loan balances, by loan class within segments, at December 31, 2017 and December 31, 2016.\n(Dollars in thousands) December 31, 2017 December 31, 2016 Commercial real estate: Owner occupied $ 116,811 $ 112,295 Non-owner occupied 244,491 206,358 Multi-family 53,634 47,681 Non-owner occupied residential 77,980 62,533 Acquisition and development: 1-4 family residential construction 11,730 4,663 Commercial and land development 19,251 26,085 Commercial and industrial 115,663 88,465 Municipal 42,065 53,741 Residential mortgage: First lien 162,509 139,851 Home equity – term 11,784 14,248 Home equity – lines of credit 132,192 120,353 Installment and other loans 21,902 7,118 $ 1,010,012 $ 883,391 Growth was experienced in nearly all loan segments from December 31, 2016 to December 31, 2017, with the largest dollar increase in the commercial real estate segment, which grew by $64.0 million, or 14.9%, representing approximately one-half of the dollar portfolio growth for the period. The residential mortgage and commercial and industrial segments also showed substantial growth of $32.0 million, or 11.7%, and $27.2 million, or 30.7%, respectively, during this period. The Company continues to grow in both core markets and new markets through continued expansion of its sales force and from its efforts to capitalize on market disruption caused by the acquisition of some of our competitors by larger institutions in the recent past. The Company placed additional emphasis on growing commercial and industrial loans in 2017 to increase diversification of its loan portfolio. In the fourth quarter of 2017, the Company also continued to increase diversification of its loan portfolio with the purchase of an additional $10 million of automobile financing loans at returns higher than comparable cash flows in the investment portfolio. These purchased loans are included in installment and other loans and bring total purchased loans in 2017 to approximately $15 million.\nTotal deposits grew 5.8% from $1.15 billion at December 31, 2016 to $1.22 billion at December 31, 2017 due principally to growth in interest-bearing accounts. The Company continued to increase both noninterest-bearing and interest-bearing deposit relationships in 2017 from enhanced cash management offerings delivered by its expanded sales force.\nShareholders’ Equity\nShareholders’ equity totaled $144.8 million at December 31, 2017, an increase of $9.9 million, or 7.3%, from $134.9 million at December 31, 2016. Equity increased principally from 2017 net income totaling $8.1 million coupled with an increase in accumulated other comprehensive income (loss), net of tax, and was reduced by dividends declared on common stock.\nAsset Quality\nThe allowance for loan losses balance totaled $12.8 million at December 31, 2017 and December 31, 2016. Management believes the allowance for loan losses to total loans ratio remains adequate at 1.27% at December 31, 2017. Favorable historical charge-off data and management's emphasis on loan quality have been significant contributors to the determination that a relatively stable allowance for loan losses balance is adequate even as the loan portfolio has been increasing.\nNonperforming and other risk assets, defined as nonaccrual loans, restructured loans still accruing, loans past due 90 days or more and still accruing, and other real estate owned totaled $12.0 million at December 31, 2017, an increase of $3.7 million, or 44.1%, from $8.3 million at December 31, 2016. Nonaccrual loans increased $2.8 million from December 31, 2016 to December 31, 2017 and principally reflects the addition of one commercial loan downgraded to nonaccrual status in the fourth quarter of 2017.\nThe allowance for loan losses to nonperforming loans totaled 130.0% at December 31, 2017 compared with 181.4% at December 31, 2016, reflecting the fourth quarter 2017 increase in nonaccrual loans. The allowance for loan losses to nonperforming and restructured loans still accruing totaled 116.1% at December 31, 2017, compared with 160.2% at December 31, 2016.\nClassified loans, or loans rated substandard, doubtful or loss, totaled $20.0 million at December 31, 2017 (2.0% of total loans), compared with $22.9 million (2.6% of total loans) at December 31, 2016.\nUse of Non-GAAP Financial Measure\nAdjusted earnings per share is a non-GAAP financial measure included in this release. Adjusted earnings per share is earnings per share calculated in accordance with GAAP and adjusted for the impact of the Tax Cuts and Jobs Act on deferred tax assets representing a one-time, non-cash charge. Reconciliation of adjusted earnings per share to earnings per share is included later in this release. This information supplements our results as reported in accordance with GAAP and should not be viewed in isolation from, or as a substitute for, our GAAP results. We believe that this information and the related reconciliation may be useful to investors, analysts, regulators and others to help understand and evaluate our financial results, and with respect to the adjusted financial measure, because we believe such measure better reflects the ongoing financial results and trends of our business and increases comparability of period-to-period results.\nORRSTOWN FINANCIAL SERVICES, INC. Operating Highlights (Unaudited) Three Months Ended Twelve Months Ended December 31, December 31, December 31, December 31, (Dollars in thousands, except per share information) 2017 2016 2017 2016 Net income $ 6 $ 1,928 $ 8,090 $ 6,628 Diluted earnings per share $ 0.00 $ 0.24 $ 0.98 $ 0.81 Dividends per share $ 0.12 $ 0.09 $ 0.42 $ 0.35 Return on average assets 0.00 % 0.56 % 0.54 % 0.50 % Return on average equity 0.01 % 5.58 % 5.73 % 4.80 % Net interest income $ 11,335 $ 9,710 $ 43,371 $ 36,545 Net interest margin 3.27 % 3.20 % 3.32 % 3.14 %\nORRSTOWN FINANCIAL SERVICES, INC. Balance Sheet Highlights (Unaudited) December 31, December 31, (Dollars in thousands, except per share information) 2017 2016 Assets $ 1,558,849 $ 1,414,504 Loans, gross 1,010,012 883,391 Allowance for loan losses (12,796 ) (12,775 ) Deposits 1,219,515 1,152,452 Shareholders' equity 144,765 134,859 Book value per share 17.34 16.28\nORRSTOWN FINANCIAL SERVICES, INC. CONDENSED CONSOLIDATED BALANCE SHEETS (Unaudited) December 31, December 31, (Dollars in thousands) 2017 2016 Assets Cash and cash equivalents $ 29,807 $ 30,273 Securities available for sale 415,308 400,154 Loans held for sale 6,089 2,768 Loans 1,010,012 883,391 Less: Allowance for loan losses (12,796 ) (12,775 ) Net loans 997,216 870,616 Premises and equipment, net 34,809 34,871 Other assets 75,620 75,822 Total assets $ 1,558,849 $ 1,414,504 Liabilities Deposits: Noninterest-bearing $ 162,343 $ 150,747 Interest-bearing 1,057,172 1,001,705 Total deposits 1,219,515 1,152,452 Borrowings 177,391 112,027 Accrued interest and other liabilities 17,178 15,166 Total liabilities 1,414,084 1,279,645 Shareholders' Equity Total shareholders' equity 144,765 134,859 Total liabilities and shareholders' equity $ 1,558,849 $ 1,414,504\nORRSTOWN FINANCIAL SERVICES, INC. CONDENSED CONSOLIDATED STATEMENTS OF INCOME (Unaudited) Three Months Ended Twelve Months Ended December 31, December 31, December 31, December 31, (Dollars in thousands, except per share information) 2017 2016 2017 2016 Interest and dividend income Interest and fees on loans $ 10,793 $ 8,910 $ 40,185 $ 33,916 Interest and dividends on investment securities 2,826 2,165 10,830 8,046 Total interest and dividend income 13,619 11,075 51,015 41,962 Interest expense Interest on deposits 1,705 1,186 6,134 4,811 Interest on borrowings 579 179 1,510 606 Total interest expense 2,284 1,365 7,644 5,417 Net interest income 11,335 9,710 43,371 36,545 Provision for loan losses 800 0 1,000 250 Net interest income after provision for loan losses 10,535 9,710 42,371 36,295 Noninterest income Service charges on deposit accounts 1,451 1,400 5,675 5,445 Trust, investment management and brokerage income 2,267 1,768 8,296 7,024 Mortgage banking activities 806 1,031 2,919 3,412 Other income 649 770 2,307 2,438 Investment securities gains 0 0 1,190 1,420 Total noninterest income 5,173 4,969 20,387 19,739 Noninterest expenses Salaries and employee benefits 7,779 7,052 30,145 26,370 Occupancy, furniture and equipment 1,640 1,709 6,240 5,826 Data processing 569 692 2,271 2,378 Advertising and bank promotions 497 473 1,600 1,717 FDIC insurance 152 177 606 775 Professional services 435 507 2,373 2,182 Collection and problem loan 52 51 186 238 Real estate owned 20 44 69 239 Taxes other than income 207 173 866 767 Regulatory settlement 0 0 0 1,000 Other operating expenses 1,329 1,598 5,974 6,648 Total noninterest expenses 12,680 12,476 50,330 48,140 Income before income tax expense 3,028 2,203 12,428 7,894 Income tax expense 3,022 275 4,338 1,266 Net income $ 6 $ 1,928 $ 8,090 $ 6,628 Per share information: Basic earnings per share $ 0.00 $ 0.24 $ 1.00 $ 0.82 Diluted earnings per share 0.00 0.24 0.98 0.81 Dividends per share 0.12 0.09 0.42 0.35 Weighted-average shares outstanding - diluted 8,259,041 8,157,164 8,226,261 8,145,456\nORRSTOWN FINANCIAL SERVICES, INC. ANALYSIS OF NET INTEREST INCOME Average Balances and Interest Rates, Taxable-Equivalent Basis (Unaudited) Three Months Ended December 31, 2017 December 31, 2016 Taxable- Taxable- Taxable- Taxable- Average Equivalent Equivalent Average Equivalent Equivalent (Dollars in thousands) Balance Interest Rate Balance Interest Rate Assets Federal funds sold & interest-bearing bank balances $ 21,267 $ 76 1.42 % $ 9,081 $ 22 0.96 % Securities 427,967 3,157 2.93 388,289 2,404 2.46 Loans 997,162 10,982 4.37 868,222 9,133 4.18 Total interest-earning assets 1,446,396 14,215 3.90 1,265,592 11,559 3.63 Other assets 107,790 104,726 Total $ 1,554,186 $ 1,370,318 Liabilities and Shareholders' Equity Interest-bearing demand deposits $ 680,629 $ 700 0.41 $ 613,587 $ 333 0.22 Savings deposits 94,255 38 0.16 91,238 37 0.16 Time deposits 281,192 967 1.36 274,525 816 1.18 Short-term borrowings 102,568 241 0.93 67,607 75 0.44 Long-term debt 69,778 338 1.92 24,211 104 1.71 Total interest-bearing liabilities 1,228,422 2,284 0.74 1,071,168 1,365 0.51 Noninterest-bearing demand deposits 164,518 148,403 Other 16,132 13,357 Total Liabilities 1,409,072 1,232,928 Shareholders' Equity 145,114 137,390 Total $ 1,554,186 $ 1,370,318 Taxable-equivalent net interest income / net interest spread 11,931 3.16 % 10,194 3.12 % Taxable-equivalent net interest margin 3.27 % 3.20 % Taxable-equivalent adjustment (596 ) (484 ) Net interest income $ 11,335 $ 9,710 NOTES: (1) Yields and interest income on tax-exempt assets have been computed on a taxable-equivalent basis assuming a 34% tax rate. (2) For yield calculation purposes, nonaccruing loans are included in the average loan balance.\nORRSTOWN FINANCIAL SERVICES, INC. ANALYSIS OF NET INTEREST INCOME Average Balances and Interest Rates, Taxable-Equivalent Basis (Unaudited) Twelve Months Ended December 31, 2017 December 31, 2016 Taxable- Taxable- Taxable- Taxable- Average Equivalent Equivalent Average Equivalent Equivalent (Dollars in thousands) Balance Interest Rate Balance Interest Rate Assets Federal funds sold & interest-bearing bank balances $ 15,487 $ 218 1.41 % $ 31,452 $ 208 0.66 % Securities 420,583 12,226 2.91 360,355 8,779 2.44 Loans 944,352 41,018 4.34 833,265 34,884 4.19 Total interest-earning assets 1,380,422 53,462 3.87 1,225,072 43,871 3.58 Other assets 108,001 100,078 Total $ 1,488,423 $ 1,325,150 Liabilities and Shareholders' Equity Interest-bearing demand deposits $ 648,174 $ 2,148 0.33 $ 565,524 $ 1,195 0.21 Savings deposits 94,815 150 0.16 90,272 144 0.16 Time deposits 292,616 3,836 1.31 289,574 3,472 1.20 Short-term borrowings 97,814 784 0.80 56,387 187 0.33 Long-term debt 36,336 726 2.00 24,335 419 1.72 Total interest-bearing liabilities 1,169,755 7,644 0.65 1,026,092 5,417 0.53 Noninterest-bearing demand deposits 161,917 147,473 Other 15,450 13,612 Total Liabilities 1,347,122 1,187,177 Shareholders' Equity 141,301 137,973 Total $ 1,488,423 $ 1,325,150 Taxable-equivalent net interest income / net interest spread 45,818 3.22 % 38,454 3.05 % Taxable-equivalent net interest margin 3.32 % 3.14 % Taxable-equivalent adjustment (2,447 ) (1,909 ) Net interest income $ 43,371 $ 36,545 NOTES: (1) Yields and interest income on tax-exempt assets have been computed on a taxable-equivalent basis assuming a 34% tax rate. (2) For yield calculation purposes, nonaccruing loans are included in the average loan balance.\nORRSTOWN FINANCIAL SERVICES, INC. Nonperforming Assets / Risk Elements (Unaudited) December 31, September 30, December 31, (Dollars in thousands) 2017 2017 2016 Nonaccrual loans (cash basis) $ 9,843 $ 5,249 $ 7,043 Other real estate (OREO) 961 1,258 346 Total nonperforming assets 10,804 6,507 7,389 Restructured loans still accruing 1,183 1,192 930 Loans past due 90 days or more and still accruing 0 0 0 Total nonperforming and other risk assets $ 11,987 $ 7,699 $ 8,319 Loans 30-89 days past due $ 5,277 $ 914 $ 1,218 Asset quality ratios: Total nonperforming loans to total loans 0.97 % 0.53 % 0.80 % Total nonperforming assets to total assets 0.69 % 0.42 % 0.52 % Total nonperforming assets to total loans and OREO 1.07 % 0.66 % 0.84 % Total risk assets to total loans and OREO 1.19 % 0.78 % 0.94 % Total risk assets to total assets 0.77 % 0.50 % 0.59 % Allowance for loan losses to total loans 1.27 % 1.30 % 1.45 % Allowance for loan losses to nonperforming loans 130.00 % 243.30 % 181.39 % Allowance for loan losses to nonperforming and restructured loans still accruing 116.05 % 198.28 % 160.23 %\nAllowance for Loan Losses Activity (Unaudited) Three Months Ended Twelve Months Ended December 31, December 31, December 31, December 31, (Dollars in thousands) 2017 2016 2017 2016 Balance, beginning of period $ 12,771 $ 13,850 $ 12,775 $ 13,568 Provision for loan losses 800 0 1,000 250 Recoveries 149 60 287 679 Charge-offs (924 ) (1,135 ) (1,266 ) (1,722 ) Balance, end of period $ 12,796 $ 12,775 $ 12,796 $ 12,775\nORRSTOWN FINANCIAL SERVICES, INC. GAAP to Non-GAAP Reconciliation (unaudited) Three Months Ended Twelve Months Ended December 31, December 31, December 31, December 31, (Dollars in thousands, except per share information) 2017 2016 2017 2016 Net income excluding effect of revaluation of certain net deferred tax assets Net income as reported (GAAP) $ 6 $ 1,928 $ 8,090 $ 6,628 Plus: Effect of revaluation of certain net deferred tax assets on net income 2,635 0 2,635 0 Net income (non-GAAP) $ 2,641 $ 1,928 $ 10,725 $ 6,628 Diluted earnings per common share (EPS) excluding effect of revaluation of certain net deferred tax assets Diluted EPS as reported (GAAP) $ 0.00 $ 0.24 $ 0.98 $ 0.81 Plus: Effect of revaluation of certain net deferred tax assets on a per share basis 0.32 0.00 0.32 0.00 Adjusted diluted EPS (excluding effect of revaluation of certain net deferred tax assets) (non-GAAP) $ 0.32 $ 0.24 $ 1.30 $ 0.81 About the Company\nWith over $1.5 billion in assets, Orrstown Financial Services, Inc. and its wholly-owned subsidiaries, Orrstown Bank and Wheatland Advisors, Inc., provide a wide range of consumer and business financial services through banking and financial advisory offices in Berks, Cumberland, Dauphin, Franklin, Lancaster and Perry Counties, Pennsylvania and Washington County, Maryland. Orrstown Bank is an Equal Housing Lender and its deposits are insured up to the legal maximum by the FDIC. Orrstown Financial Services, Inc.’s common stock is traded on Nasdaq (ORRF). For more information about Orrstown Financial Services, Inc. and Orrstown Bank, visit www.orrstown.com . For more information about Wheatland Advisors, Inc., visit www.wheatlandadvisors.com .\nCautionary Note Regarding Forward-looking Statements:\nThis release may contain forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995, which are subject to risks and uncertainties. The forward-looking statements, which are based on currently available information, typically contain words such as “believe,” “expect,” “estimate,” “anticipate,” “intend,” “plan,” “aim,” “will,” “may,” “should,” “could,” “would,” and similar expressions. Forward-looking statements are subject to numerous assumptions, risks and uncertainties, which change over time. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date on which they are made.\nActual results and trends could differ materially from those set forth in such statements and there can be no assurances that the Company will be able to continue to successfully execute on our strategic expansion into Dauphin, Lancaster and Berks counties, take advantage of market disruption, and experience sustained growth in loans and deposits or maintain the momentum experienced to date from these actions. Factors that could cause actual results to differ from those expressed or implied by the forward looking statements include, but are not limited to: ineffectiveness of the Company's business strategy due to changes in current or future market conditions; the effects of competition, including industry consolidation and development of competing financial products and services; changes in laws and regulations, including the Dodd-Frank Wall Street Reform and Consumer Protection Act; interest rate movements; changes in credit quality; inability to raise capital, if necessary, under favorable conditions; volatilities in the securities markets; deteriorating economic conditions; the integration of the Company's strategic acquisitions; expenses associated with pending litigation and legal proceedings; and other risks and uncertainties, including those detailed in Orrstown Financial Services, Inc.'s Annual Report on Form 10-K for the 2016 and Form 10-Q for the quarters ended March 31, 2017, June 30, 2017, and September 30, 2017, under the headings “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and “Risk Factors” and in other filings made Commission. The statements are valid only as of the date hereof and Orrstown Financial Services, Inc. disclaims any obligation to update this information.\nThe review period for subsequent events extends up to and includes the filing date of a public company’s financial statements, when filed Commission. Accordingly, the consolidated financial information presented in this announcement is subject to change.\nContact:\nDavid P. Boyle\nExecutive Vice President & CFO\nPhone 717.530.2294\n77 East King Street | Shippensburg PA\nSource:Orrstown Financial Services, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/1b503c91-b069-4f0a-98aa-581035bb7226"], "published": "2018-01-25T00:20:00.000+02:00", "crawled": "2018-01-25T01:35:44.001+02:00", "highlightTitle": ""}