{"organizations": [], "uuid": "8a29846b885d8744bf357e15ed18a59349a8e363", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/20/104909144-RTX3VOJ6.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/gop-tax-bill-faces-a-hard-sell-to-voters-after-tough-road-to-passage.html", "country": "US", "domain_rank": 767, "title": "GOP tax bill faces a hard sell to voters after tough road to passage", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.04, "site_type": "news", "published": "2018-01-08T14:00:00.000+02:00", "replies_count": 0, "uuid": "8a29846b885d8744bf357e15ed18a59349a8e363"}, "author": "Ylan Mui", "url": "https://www.cnbc.com/2018/01/08/gop-tax-bill-faces-a-hard-sell-to-voters-after-tough-road-to-passage.html", "ord_in_thread": 0, "title": "GOP tax bill faces a hard sell to voters after tough road to passage", "locations": [], "entities": {"persons": [{"name": "mitch mcconnell", "sentiment": "none"}, {"name": "koch", "sentiment": "none"}, {"name": "aaron p. bernstein", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "u.s. capitol", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "gop", "sentiment": "negative"}, {"name": "reuters senate", "sentiment": "none"}, {"name": "republican conference", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Taxes GOP tax bill faces a hard sell to voters after tough road to passage Pro and anti-tax reform advocates are gearing up for a massive public relations blitz ahead of the 2018 midterm elections. One right-leaning group is committed to spending at least $10 million, and a group aligned with the Koch brothers also planning a multimillion-dollar campaign. \"If we can't sell this to the American people, we ought to go into another line of work,\" Sen. Mitch McConnell told fellow Republicans last month. SHARES Aaron P. Bernstein | Reuters Senate Majority Leader Mitch McConnell, accompanied by members of the Republican Conference, speaks at a news conference about the passage of the Tax Cuts and Jobs Acts at the U.S. Capitol in Washington, U.S., December 20, 2017. \nRepublicans scored a major legislative victory by passing their sweeping overhaul of the tax code in record time. Now, they face a task that could be just as daunting: selling the law to the American people. \nAfter spending millions of dollars last year to advance the legislation, GOP advocacy groups are unleashing millions more to ensure Republicans' hard-won policy triumph translates into a political win in time for the 2018 midterm elections. \nAhead of the Nov. 6 elections, the American Action Network is committing at least $10 million to tout the merits of the new law, starting with a $2 million TV and digital ad campaign in 23 key congressional districts. \nMeanwhile, the network of advocacy groups with ties to the billionaire Koch brothers is pledging a multimillion-dollar campaign that combines paid advertising with town halls, phone banks and grassroots actions. \n\"There's a lot of work to be done educating Americans about [tax reform's] benefits,\" said James Davis, executive vice president of Freedom Partners. \"We will make a massive push to show how pro-growth policies can revitalize the economy and open the floodgates to new opportunity, innovation and prosperity.\" \nOne PAC that's supportive of President Donald Trump is taking a more unconventional approach to winning over voters. The 45Committee, founded by wealthy Trump confidantes Sheldon Adelson and Todd Ricketts, sponsored an ad during the college football TaxSlayer Bowl that dubbed Senate Majority Leader Mitch McConnell \"the real tax slayer\" for shepherding the legislation through the narrow majority in his chamber. 'Keep it right there' \nRepublicans are counting on the rewrite of the tax code to maintain their control of Congress during this year's midterm elections. Yet the law remains deeply unpopular among the public, with many households skeptical that any benefits will trickle down to them. \nJust about a third of Americans support the new law, according to a USA Today/Suffolk University poll last month. The survey also found about half of Americans did not believe they would enjoy a tax break under the new law. Other recent independent polls show similar results. \n\"We're going to make sure we keep it right there,\" Nicole Gill, executive director of Tax March, said of the weak poll numbers. \nTax March, part of a coalition of groups that initially organized to block the Republican tax bill, is now hoping to capitalize on the overhaul's unpopularity. Under the banner Not One Penny, it kicked off a cross-country tour on Saturday in Kansas — a state that was forced to roll back aggressive tax cuts amid steep budget shortfalls and widespread tax dodging. \"What we learned from the [2017] campaign is once people find out what's in the bill, they hate it.\" -Nicole Gill, executive director, Tax March \nThe campaign is also planning stops in contested red states with Democratic representatives, such as West Virginia, along with vulnerable blue districts like Missouri. The tour, titled \"Repeal the Trump tax,\" will include town halls and events with local officials and small-business owners. It will culminate in Washington on April 15. \nAccording to planning documents obtained by CNBC, the groups are planning to spend at least $10 million on the effort. \n\"What we learned from the [2017] campaign is once people find out what's in the bill, they hate it,\" Gill said. \nThe effort could also draw some national firepower. In a letter last week, House Minority Leader Nancy Pelosi urged Democrats to stage teach-ins on the tax bill on Saturday, tying the campaign to the Rev. Martin Luther King's message of \"fairness and equality.\" \n\"The Republican-controlled House, Senate and White House squandered 2017 by stacking the deck for [the] privileged, the powerful and special interests and against America's middle-class families,\" the letter stated. \nThe nonpartisan Tax Policy Center recently estimated that the average tax cut for all households this year will be about $1,200, a substantial number but lower than the projected $2,059 figure that Republicans typically cite. \nThe center also found that a tax break for the top 20 percent of earners is nearly twice as large as the one for the middle class: Wealthier filers receive a 2.9 percent increase in after-tax income versus 1.6 percent for those in the middle. In addition, the tax cuts for individuals expire after 2025 under the new law, while the lower rate for corporations is permanent. Kevin Lamarque | Reuters President Donald Trump speaks during a meeting with Republican members of the Senate at the White House in Washington, January 4, 2018. \nRepublicans argue that reducing rates for businesses will help spur a faster economy, job creation and wage growth that are not fully captured by many independent projections. And over the past few weeks, companies have provided plenty of anecdotal evidence to back up that claim. \nMore than 100 companies have announced they will pay out bonuses, raise wages, increase retirement contributions or expand their operations as a result of the new law, according to a list compiled by Americans for Tax Reform, a vocal advocate for the plan. The group estimates more than a million workers will be affected. \nIn a statement Friday, the White House cast the moves by businesses as a \"Trump Bonus\" and said the president had long argued that lowering taxes \"would be the fuel that propels our economy to new heights.\" \nThe statement added: \"The preliminary results show that the president is right, and American workers and families are the big winners.\" \nUltimately, Republicans are banking that the new tax law will not only pay for itself, but also sell itself: Americans will come around once they have more money in their pockets. \n\"My view is this,\" McConnell said on the floor moments after the Senate passed the tax law last month. \"If we can't sell this to the American people, we ought to go into another line of work.\"", "external_links": [], "published": "2018-01-08T14:00:00.000+02:00", "crawled": "2018-01-08T14:00:56.003+02:00", "highlightTitle": ""}