{"organizations": [], "uuid": "96aab184fd9f5df5d76f6c482924909e28167b20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-quake-research/scientists-to-map-quake-prone-asian-region-in-hope-of-mitigating-disaster-idUSKBN1ET142", "country": "US", "domain_rank": 408, "title": "Scientists to map quake-prone Asian region in hope of mitigating disaster", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-04T18:52:00.000+02:00", "replies_count": 0, "uuid": "96aab184fd9f5df5d76f6c482924909e28167b20"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-quake-research/scientists-to-map-quake-prone-asian-region-in-hope-of-mitigating-disaster-idUSKBN1ET142", "ord_in_thread": 0, "title": "Scientists to map quake-prone Asian region in hope of mitigating disaster", "locations": [], "entities": {"persons": [{"name": "michael steckler", "sentiment": "none"}, {"name": "steckler", "sentiment": "none"}], "locations": [{"name": "myanmar", "sentiment": "none"}, {"name": "bangladesh", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "columbia university’s lamont-doherty earth observatory", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KUALA LUMPUR (Thomson Reuters Foundation) - An international team of scientists is set to begin a four-year project this month that will map, image and monitor an earthquake-prone area that encompasses some of the most remote and densely populated parts of Asia.\nThe $7 million project is partly led by Michael Steckler, a professor at Columbia University’s Lamont-Doherty Earth Observatory. It will involve three teams planting sophisticated global positioning system stations, and more than 100 seismometers that detect tremors in Bangladesh and western Myanmar, along the so-called IndoBurma subduction zone.\nA team in India will also begin work in the part of the zone that extends into the northeastern part of that country.\n“This particular area has never been (mapped) before in anything close to this scale,” Steckler told the Thomson Reuters Foundation on Thursday. “We know so little about what the geometry of the fault is under there that it is very hard to make accurate assessments.”\nMore than 30 researchers from at least six countries will create a detailed image of the onshore subduction zone, which is also home to the world’s largest delta system. It spans an area of about 700 km (435 miles) and is an extension of the zone that caused the tsunami of 2004 in the Indian Ocean, which killed more than 200,000 people.\nAny future earthquake in the research and surrounding areas could impact 140 million people - many of whom are among the world’s poorest - and cause the collapse of thousands badly maintained or constructed buildings, researchers said.\nSteckler cited the Rana Plaza disaster in Bangladesh, which killed more than 1,100 factory workers in 2013, as an example of the potential risks that an earthquake would pose.\n“A year and a half ago we published a paper saying that there was the potential for a large earthquake in this area,” he added.\nFollowing preliminary work carried out late last year, Steckler and his team will move a shipment of more than 1 ton of equipment and instruments to a base outside Bangladesh’s capital, Dhaka, later this month. Work will then be carried out in the northeast of Bangladesh. Teams in both India and Myanmar are due to begin work in March.\nIn addition to planting seismometers, researchers will conduct various studies, and collect and study rock samples across the three countries, with the aim of better understanding and minimizing the risks that any future mega-earthquake would have for the area.\nIt is also hoped that the studies will enable authorities to raise earthquake awareness and develop the most cost effective ways to keep buildings and communities safer, said Steckler.\nSuch initiatives are desperately needed in the region, which is one of the poorest and most densely populated in the world, according to Vineet Gahalaut, director of the National Center for Seismology in New Delhi, who heads the Indian research team.\n“Vulnerability is very high because the structures, conditions and preparations are poor, and awareness is less,” he said.\n(Corrects word in paragraphs 2 and 10 to “seismometers,” not “speedometers.”)\nReporting by Michael Taylor, Editing by Jared Ferrie; Please credit Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women’s rights, trafficking, property rights, and climate change. Visit www.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-04T18:52:00.000+02:00", "crawled": "2018-01-09T16:50:52.002+02:00", "highlightTitle": ""}