{"organizations": [], "uuid": "308de49239caa851c619c2fdae658bd2a4d38890", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180111.html", "section_title": "Archive News &amp; Video for Thursday, 11 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-macedonia-politics/macedonias-parliament-approves-law-on-wider-use-of-albanian-language-idUSKBN1F028Q", "country": "US", "domain_rank": 408, "title": "Macedonia's parliament approves law on wider use of Albanian language", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-12T00:49:00.000+02:00", "replies_count": 0, "uuid": "308de49239caa851c619c2fdae658bd2a4d38890"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-macedonia-politics/macedonias-parliament-approves-law-on-wider-use-of-albanian-language-idUSKBN1F028Q", "ord_in_thread": 0, "title": "Macedonia's parliament approves law on wider use of Albanian language", "locations": [], "entities": {"persons": [{"name": "artan grubi", "sentiment": "none"}], "locations": [{"name": "macedonia", "sentiment": "none"}, {"name": "skopje", "sentiment": "none"}, {"name": "balkan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "social democrats", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SKOPJE (Reuters) - Macedonia’s parliament on Thursday passed a law allowing wider official use of the Albanian language, fiercely opposed by nationalists who say it will lead to further ethnic division of the Balkan country.\nThe law is key part of a coalition deal between the ruling Social Democrats and their junior coalition partners, parties representing ethnic Albanians who make up nearly a third of the 2 million population.\nSixty-nine deputies in the 120-seat parliament voted for the law that would allow, among other things, a parliament speaker to chair a session in Albanian.\nAlso from now on the citizens will be able to seek official documents such as birth and death certificate in Albanian throughout the country not only in municipalities with ethnic Albanian majority. The Albanian language is unrelated to the Slavic language spoken by the country’s majority.\n“With today’s vote on the law on languages we finalised the normative part of the peace deal that ended the 2001 conflict,” Artan Grubi, a lawmaker from the ethnic Albanian DUI party, told journalists.\nAn insurgency among Macedonia’s large ethnic Albanian minority almost tore the country apart in 2001 before it was ended by an internationally brokered peace deal.\nThe ethnic Macedonian nationalist VMRO-DPMNE party, which ruled the country until 2016 parliamentary elections and which is now the biggest single party in the parliament, said in a statement that the law “deepens the differences and damages the homogeneity of Macedonian society.”\n“The bilingualism will create chaos in the legal order, it will create inefficient institutions,” it said.\nVMRO-DPMNR deputies did not attend the parliament session on Thursday in protest against the arrest of high ranking party officials over their role in a wiretapping scandal.\nMacedonia was thrown into political turmoil in 2015 when opposition parties accused then-Prime Minister Nikola Gruevski and his counter-intelligence chief of orchestrating the wiretapping of more than 20,000 people.\nThe crisis culminated last April when nationalists stormed the parliament building and assaulted Prime Minister Zoran Zaev in a protest against the election of an ethnic Albanian as parliament speaker. [nL8N1HZ9VJ]\nMacedonia has made little progress towards EU and NATO membership due to a long-running dispute with Greece, which says Macedonia’s name represents a territorial claim to a Greek province with the same name.\nZaev has pledged to resolve the name issue and accelerate the country’s accession to NATO and the EU.\nReporting by Kole Casule; Writing by Ivana Sekularac\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T00:49:00.000+02:00", "crawled": "2018-01-12T18:26:14.000+02:00", "highlightTitle": ""}