{"organizations": [], "uuid": "7f596fba441e34ad392db7250ea3cfa80c6ea969", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-carillion-restructuring-factbox/factbox-ripples-from-carillions-collapse-hit-contractors-partners-idUSKBN1F41KE", "country": "US", "domain_rank": 408, "title": "Factbox: Ripples from Carillion's collapse hit contractor's partners", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T20:44:00.000+02:00", "replies_count": 0, "uuid": "7f596fba441e34ad392db7250ea3cfa80c6ea969"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-carillion-restructuring-factbox/factbox-ripples-from-carillions-collapse-hit-contractors-partners-idUSKBN1F41KE", "ord_in_thread": 0, "title": "Factbox: Ripples from Carillion's collapse hit contractor's partners", "locations": [], "entities": {"persons": [{"name": "balfour beatty", "sentiment": "none"}, {"name": "carilli", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "aberdeen", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "galliford", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "carillion", "sentiment": "negative"}, {"name": "galliford try", "sentiment": "none"}, {"name": "aberdeen western peripheral route", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Britain’s Carillion collapsed on Monday after its banks lost faith in the construction and services company, forcing the government to step in to guarantee major public works contracts.\nBelow is a list of some of the companies affected by the compulsory liquidation of the major infrastructure contractor, which operated in joint ventures with a number of other firms.\nGALLIFORD TRY Builder Galliford Try said it estimated it would need an extra 60-80 million pounds ($110.25 million) to complete work on its joint venture with Carillion on a road contract around Aberdeen in western Scotland.\n“The terms of the contract are such that the remaining joint venture members, Balfour Beatty and Galliford Try, are obliged to complete the contract,” Galliford Try said in a statement. The contract is worth 550 million pounds in total.\nShares in Galliford Try were down 2.4 percent on Monday. The company said it had “no other significant contracts or projects with Carillion.”\nBALFOUR BEATTY In addition to the Aberdeen Western Peripheral Route, Balfour Beatty was working with Carillion on two other projects - the A14 in Cambridgeshire and a motorway contract near Manchester in north-west England.\n“The cash impact to Balfour Beatty is likely to be an outflow in the range of 35 million pounds to 45 million pounds in 2018,” the company said in a statement.\n“Balfour Beatty will continue to work with its customers and will meet its contractual commitments.”\nShares turned sharply lower after the firm made its statement, and were last down 2.7 percent.\nKIER GROUP Kier was working with Carillion on the high-profile HS2 rail contract in a joint venture with France’s Eiffage, awarded last July.\nKier said there were contingency plans in place and they were not expecting an adverse financial impact from the collapse of Carillion. Eiffage could not immediately be reached for comment.\nKier also operated the Highways England smart motorways program with Carillion.\nIts share price opened lower on Monday but was up 1.6 percent in early afternoon trade, joining a rally in some competitors of Carillion as investors bet there would be more contracts for others following the company’s demise.\nSPEEDY HIRE Shares in industrial equipment rental company Speedy Hire fell sharply on Monday, down 7 percent and set for its biggest one-day fall since September 2015.\nCarillion had been one of Speedy Hire’s largest clients, broker Liberum said, adding that the share price reaction was nevertheless likely to be overdone.\nTCLARKE Building services firm TClarke said it did not expect any adverse financial impact on the group as a result of direct exposure to Carillion.\n“TClarke is engaged as a Sub Contactor on a Carillion joint venture project with KBR as part of the Aspire Defence Contract at Tidworth, Bulford and Perham Down,” the company said in a statement.\n”We have been advised by the joint venture partner that there will be a transition for this contract and that we can expect “business as usual”.\nIts share price was down 0.7 percent in early afternoon trade.\nReporting by Alistair Smout; Editing by Gareth Jones\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T20:44:00.000+02:00", "crawled": "2018-01-16T13:27:36.020+02:00", "highlightTitle": ""}