{"organizations": [], "uuid": "3df28dc5fbc6f489251d6cc3df8466b638070959", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-first-reliance-bancshares-inc-and-independence-bancshares-inc-receive-all-required-regulatory-and-shareholder-approvals-for.html", "country": "US", "domain_rank": 767, "title": "First Reliance Bancshares, Inc. and Independence Bancshares, Inc. Receive All Required Regulatory and Shareholder Approvals for Pending Merger", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T14:00:00.000+02:00", "replies_count": 0, "uuid": "3df28dc5fbc6f489251d6cc3df8466b638070959"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-first-reliance-bancshares-inc-and-independence-bancshares-inc-receive-all-required-regulatory-and-shareholder-approvals-for.html", "ord_in_thread": 0, "title": "First Reliance Bancshares, Inc. and Independence Bancshares, Inc. Receive All Required Regulatory and Shareholder Approvals for Pending Merger", "locations": [], "entities": {"persons": [], "locations": [{"name": "s.c.", "sentiment": "none"}, {"name": "florence", "sentiment": "none"}, {"name": "greenville", "sentiment": "none"}], "organizations": [{"name": "first reliance bancshares, inc.", "sentiment": "neutral"}, {"name": "independence bancshares, inc", "sentiment": "neutral"}, {"name": "south carolina board of financial institutions", "sentiment": "none"}, {"name": "independence bancshares, inc.", "sentiment": "none"}, {"name": "federal deposit insurance corporation", "sentiment": "none"}, {"name": "first reliance bank", "sentiment": "none"}, {"name": "first reliance and independence", "sentiment": "none"}, {"name": "first reliance", "sentiment": "none"}, {"name": "independence national bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FLORENCE, S.C. and GREENVILLE, S.C., Jan. First Reliance Bancshares, Inc. (OTC Pink: FSRL) (\"First Reliance\" or the \"Company\") today announced that the Federal Deposit Insurance Corporation and the South Carolina Board of Financial Institutions have granted the regulatory approvals necessary for the pending mergers of Independence Bancshares, Inc. (\"Independence\") and its wholly-owned subsidiary, Independence National Bank, with and into First Reliance and its subsidiary, First Reliance Bank. The merger is expected to close on January 19, 2018, with full conversion of the banks' operating systems scheduled for March 5, 2018. Additionally, First Reliance and Independence announces that the merger received the necessary approval from the shareholders of Independence at a special meeting on January 9, 2018. The merger does not require approval from the shareholders of First Reliance.\nUnder terms of the merger agreement, holders of Independence common stock will receive $0.125 per share, and holders of its convertible preferred stock will receive the redemption price of $1,000 per share. The total transaction value is approximately $11.0 million. First Reliance also expects to recover Independence's deferred tax assets and other related tax benefits totaling approximately $1.9 million. The transaction is expected to be slightly dilutive to First Reliance's 2018 tangible book value per share, including one-time transaction costs, and accretive to First Reliance's fully diluted earnings per share for 2018.\nThe combined company is expected to have approximately $532.9 million in assets, $369.3 million in gross loans, $432.4 million in deposits, 11 banking offices in South Carolina, including a branch in Myrtle Beach, South Carolina expected to open in February 2018, and a loan production office in Winston Salem, North Carolina.\nAbout First Reliance Bancshares, Inc.\nFirst Reliance Bancshares, Inc. is the holding company for First Reliance Bank, a South Carolina-chartered bank. The bank was founded in 1999, employs approximately 140 associates and serves the Columbia, Lexington, Charleston, Mount Pleasant, Summerville, Loris, North Myrtle Beach, and Florence markets in South Carolina and the Triad North Carolina market from its loan production office in Winston-Salem. First Reliance Bank offers several unique customer programs which include a Hometown Heroes package of benefits for those who are serving our communities, Check 'N Save, a community outreach program for the unbanked or under-banked, a Moms First program, and an iMatter program targeted to young people. The bank also offers a Customer Service Guaranty, a Mortgage Service Guaranty, FREE Coin Machines for customers to use, Mobile Banking, Mobile mortgage applications, and is open on most traditional bank holidays. Its commitment to making customers' lives better and the idea that \"There's More to Banking Than Money\" has earned the Bank a customer satisfaction rating of 95%. The common stock of First Reliance Bancshares, Inc. is traded under the symbol FSRL.OB. Additional information about the Company is available on the Company's web site at www.firstreliance.com .\nImportant Information\nThis press release does not constitute an offer to sell, or the solicitation of an offer to buy, any securities. The securities sold in the offering have not been registered under the Securities Act of 1933, as amended (the \"Securities Act\"), or the securities laws of any other jurisdiction and may not be offered or sold absent registration or an applicable exemption from the registration requirements under the Securities Act..\nCautionary Statement Regarding Forward-Looking Statements\nThis press release contains, among other things, certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including, without limitation, statements preceded by, followed by, or that include the words \"may,\" \"could,\" \"should,\" \"would,\" \"believe,\" \"anticipate,\" \"estimate,\" \"expect,\" \"intend,\" \"plan,\" \"projects,\" \"outlook\" or similar expressions. These statements are based upon the current belief and expectations of the Company's management team and are subject to significant risks and uncertainties that are subject to change based on various factors (many of which are beyond the Company's control). Although the Company believes that the assumptions underlying the forward-looking statements are reasonable, any of the assumptions could prove to be inaccurate. Therefore, the Company can give no assurance that the results contemplated in the forward-looking statements will be realized. The inclusion of this forward-looking information should not be construed as a representation by the Company or any person that the future events, plans, or expectations contemplated by the Company will be achieved. All subsequent written and oral forward-looking statements attributable to the Company or any person acting on its behalf are expressly qualified in their entirety by the cautionary statements above. The Company does not undertake any obligation to update any forward-looking statement to reflect circumstances or events that occur after the date the forward-looking statements are made, except as required by law.\nMember FDIC\nFor more information:\nJeffrey A. Paolucci\nExecutive Vice President and Chief Financial Officer\n(888) 543-5510\njpaolucci@firstreliance.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/first-reliance-bancshares-inc-and-independence-bancshares-inc-receive-all-required-regulatory-and-shareholder-approvals-for-pending-merger-300581099.html\nSOURCE First Reliance Bancshares, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/first-reliance-bancshares-inc-and-independence-bancshares-inc-receive-all-required-regulatory-and-shareholder-approvals-for-pending-merger-300581099.html", "http://www.firstreliance.com/"], "published": "2018-01-11T14:00:00.000+02:00", "crawled": "2018-01-11T15:13:15.000+02:00", "highlightTitle": ""}