{"organizations": [], "uuid": "b6085febd7ea29eab966671cb6edc1976befdb84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-markwins-beauty-brands-announces-the-appointment-of-new-global-president-stefano-curti.html", "country": "US", "domain_rank": 767, "title": "Markwins Beauty Brands Announces the Appointment of New Global President, Stefano Curti", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T19:13:00.000+02:00", "replies_count": 0, "uuid": "b6085febd7ea29eab966671cb6edc1976befdb84"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-markwins-beauty-brands-announces-the-appointment-of-new-global-president-stefano-curti.html", "ord_in_thread": 0, "title": "Markwins Beauty Brands Announces the Appointment of New Global President, Stefano Curti", "locations": [], "entities": {"persons": [{"name": "stefano curti", "sentiment": "negative"}, {"name": "curti", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "bill george", "sentiment": "none"}, {"name": "markwins", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "markwins beauty brands", "sentiment": "negative"}, {"name": "neutrogena", "sentiment": "none"}, {"name": "j&j consumer usa", "sentiment": "none"}, {"name": "j&j", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CITY OF INDUSTRY, Calif., Jan. 9, 2018 /PRNewswire/ -- Markwins Beauty Brands announced today that Stefano Curti has been selected to assume the role of Global President of Markwins Beauty Brands, effective January 3, 2018. This is concurrent with the announcement that Bill George, President and COO of North America, will shift from the day-to-day management of Markwins' brands, working with the new Global President through April 2018, and thereafter assume a role as part of the company's advisory board.\nStefano Curti is an accomplished executive with 27 years of experience in beauty and personal care with both large, global consumer products companies as well as smaller, private equity and venture capital-backed start-ups serving as Global President or CEO. Mr. Curti spent 22 years, from 1990 to 2012, with global personal care leader Johnson & Johnson where he led J&J beauty to skincare market leadership in the US. He served as Global President of the Beauty and Baby divisions (Johnson's Baby, Neutrogena, Aveeno, Clean & Clear, Lubriderm, among others); President, J&J Consumer USA and General Manager, Neutrogena. He was also Managing Director for J&J in Europe, and Marketing Director, Europe, Africa and Middle East.\n\"Stefano's appointment and this transition are exciting milestones in a succession plan that we have been pursuing for some time. This appointment is a clear affirmation of Markwins' commitment to the future,\" said Eric Chen, CEO and founder. \"We believe Stefano's people-focused leadership style, beauty industry expertise, and brand understanding will build on the success Bill George has helped Markwins to achieve. Markwins, after another strong year of growth and successful initiatives, is poised for dynamic expansion both domestically and globally, and we are confident in Stefano's experience and vison to lead this charge.\"\nDuring his Markwins career, Mr. George has excelled in various leadership roles, leading Markwins' growth in the beauty industry. His rise through the ranks at the company for the past 17 years has been fueled by his passion and ability to seize growth opportunities. Mr. George played a major role in the company's prior brand acquisitions including Physicians Formula®, Bonne Bell® / Lip Smacker® and wet n wild®/ Black Radiance®.\n\"Bill's leadership has paved an excellent path for us to follow and grow,\" says Mr. Curti. \"I look forward to working with Bill to ensure the Company is positioned for continued success through a robust transition plan. We will continue to build upon, add and strengthen a great North American momentum, and at the same time look to accelerate the meteoric growth of our world-class brands around the globe.\"\nAbout Markwins Beauty Brands\nMarkwins Beauty Brands is a global leader in beauty and cosmetics. The company, founded in 1984 by CEO Eric Chen, is distinguished by groundbreaking product innovation, reimagined go-to-market strategies, and leading-edge supply-chain dynamics. From humble, disruptive origins, the company - famous early as the pioneer of compact palettes and gift sets - stands today as one of beauty's largest privately-held firms and is recognized within the industry as top \"brand builder.\"\nWith a brand portfolio that includes wet n wild®, Physicians Formula®, Black Radiance®, Lip Smacker®, Bonne Bell®, The Color Workshop®, The Color Institute®, and POP® the company commands a 10+ share in units, and 6-7 share in dollars (US FDM) - with sustained growth vastly outpacing the industry. With distribution in over 70,000 doors and 80 countries, Markwins Beauty Brands can be found in the world's leading retailers including Department, Specialty, Mass, Drug, and Food stores.\nView original content with multimedia: http://www.prnewswire.com/news-releases/markwins-beauty-brands-announces-the-appointment-of-new-global-president-stefano-curti-300580038.html\nSOURCE Markwins Beauty Brands", "external_links": ["http://www.prnewswire.com/news-releases/markwins-beauty-brands-announces-the-appointment-of-new-global-president-stefano-curti-300580038.html"], "published": "2018-01-09T19:13:00.000+02:00", "crawled": "2018-01-09T21:32:30.002+02:00", "highlightTitle": ""}