{"organizations": [], "uuid": "2390126a19c1ea58d25f3180221e863804d9b2be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/eurozone-germany/update-1-germany-demands-clarity-on-risk-reduction-for-banking-union-idUSL8N1PC4YG", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Germany demands clarity on risk reduction for banking union", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T18:58:00.000+02:00", "replies_count": 0, "uuid": "2390126a19c1ea58d25f3180221e863804d9b2be"}, "author": "", "url": "https://www.reuters.com/article/eurozone-germany/update-1-germany-demands-clarity-on-risk-reduction-for-banking-union-idUSL8N1PC4YG", "ord_in_thread": 0, "title": "UPDATE 1-Germany demands clarity on risk reduction for banking union", "locations": [], "entities": {"persons": [{"name": "centeno", "sentiment": "none"}, {"name": "joseph nasr", "sentiment": "none"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "peter altmaier", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}, {"name": "michael nienaber", "sentiment": "none"}, {"name": "mari", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "altmaier", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 4:59 PM / Updated 24 minutes ago UPDATE 1-Germany demands clarity on risk reduction for banking union Reuters Staff 5 Min Read \n* Altmaier: No fixed date for deposit insurance scheme \n* Eurogroup head Centeno rejects idea of transfer union (Adds more comments from Altmaier and Centeno, background) \nBy Joseph Nasr and Michael Nienaber \nBERLIN, Jan 17 (Reuters) - Germany said on Wednesday that euro zone members should first agree on clear parameters for reducing risks in the banking sector before progress can be made toward completing a banking union through a deposit insurance scheme in the currency bloc. \nReforming the euro zone has become a key priority since the election last year of French President Emmanuel Macron, who is hoping Chancellor Angela Merkel will have a government in place by the end of March to forge ahead with his ambition vision. \nGermany’s acting finance minister, Peter Altmaier, played up the chances of progress toward a banking union that’s considered necessary to shield the euro zone from future crises after a meeting with Eurogroup head Mario Centeno of Portugal in Berlin. \nBut Altmaier declined to give a timeline, saying that Germany wanted clarity on what risk-sharing will look like and how risk reduction would be implemented. \n“In the last two Eurogroup meetings, we agreed to try to come to a common understanding over the next few weeks about what we mean by risk-reduction and what steps are needed for this,” said Altmaier, a confidante of Merkel. \nThe European Commission late last year offered a watered-down plan to decrease risks in the banking sector, in a bid to break a years-long stalemate over the plan that was fiercely opposed by Germany’s former Finance Minister Wolfgang Schaeuble. \nBut with Schaeuble gone after an election in September that weakened Merkel’s conservatives, new momentum for euro zone reforms is building up, especially as the chancellor seeks a coalition with the anti-austerity Social Democrats (SPD). \nThe Commission’s so-called European deposit insurance scheme (EDIS) is meant to cover insured savers (up to 100,000 euros) in case of a bank failure. \nIt said the scheme should be introduced more gradually than initially planned and discarded initial plans for a full sharing of depositor protection. \nThe plan faces opposition from Germany, where the government fears having to foot the bill for banks in other countries, such as Italy, that are burdened with high levels of non-performing loans. RISK REDUCTION \nAsked about when EDIS would be introduced, Altmaier said: “We first must reduce risks before there can be risk-sharing. Therefore, from our point of view and from today’s perspective, there cannot be a fixed date.” \nCenteno said the banking union was one of many defences to shield the euro zone from future crisis. He said the currency bloc should not become a transfer union in which richer member states are asked to bankroll poorer peers. \nCenteno rejected an expert proposal to replace the euro zone’s current fiscal rules, which focus on the structural deficit of member states, with an anti-cyclical expenditure rule and a long-term debt-reduction target. \n“That’s not under discussion,” Centeno said when asked whether he regarded the euro zone’s current budget deficit rule as outdated. \nLeading economists from France and Germany earlier on Wednesday weighed in on the politically heated debate about making the euro zone more resilient by calling for new fiscal rules and the creation of a virtual euro-area “safe asset”. \nThe proposals are meant to bridge German demands for more fiscal discipline and France’s insistence on more risk-sharing as the euro zone’s two largest economies try to inject new momentum into their stalled efforts to reform the bloc . \nAltmaier will also discuss how to improve governance of the 19-member single currency bloc with his French counterpart, Bruno Le Maire, on Thursday in Paris. \nMerkel will meet IMF chief Christine Lagarde on Friday in Berlin before travelling to Paris where she is expected to discuss euro zone reforms with Macron. \nMerkel’s conservatives and the SPD last week agreed on the blueprint for a governing coalition. \nThe draft raised the prospect of an “investment budget” for the single currency bloc, a nod to Macron’s call for a budget to help the euro zone cope with external economic shocks. \nIt also calls for the ESM bailout mechanism to be turned into a full-blown European Monetary Fund under parliamentary control and anchored in EU law. \nSPD delegates will on Sunday vote on whether party leaders should proceed to formal negotiations with the conservatives on forming a coalition government that will secure her a fourth term. (Reporting by Joseph Nasr, Michael Nienaber and Gernot Heller; Editing by Alison Williams, Larry King)", "external_links": [], "published": "2018-01-17T18:58:00.000+02:00", "crawled": "2018-01-17T19:28:18.005+02:00", "highlightTitle": ""}