{"organizations": [], "uuid": "cc0ce8bcb81c16d5a21461454b5e4a8ce4fd5b31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/china", "section_title": "China | Reuters.com", "url": "https://www.reuters.com/article/us-china-harassment/china-revokes-academic-title-of-professor-accused-of-sexual-harassment-idUSKBN1F30I4", "country": "US", "domain_rank": 408, "title": "China revokes academic title of professor accused of sexual harassment", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T20:14:00.000+02:00", "replies_count": 0, "uuid": "cc0ce8bcb81c16d5a21461454b5e4a8ce4fd5b31"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-china-harassment/china-revokes-academic-title-of-professor-accused-of-sexual-harassment-idUSKBN1F30I4", "ord_in_thread": 0, "title": "China revokes academic title of professor accused of sexual harassment", "locations": [], "entities": {"persons": [{"name": "luo xixi", "sentiment": "none"}, {"name": "chen xiaowu", "sentiment": "none"}, {"name": "chen", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "yangtze river scholar", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "education ministry", "sentiment": "negative"}, {"name": "beijing youth daily", "sentiment": "none"}, {"name": "beihang university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - China’s Education Ministry on Sunday revoked the prestigious academic title of a university professor accused of sexually harassing students, state media said, in a case that has sparked national media coverage and a nascent #MeToo movement in the country.\nBeihang University in Beijing said last week that it removed Chen Xiaowu from his teaching posts after an investigation found he had engaged in “sexual harassment behaviour” that seriously violated professional ethics and the school’s code of conduct.\nThe Beijing Youth Daily had previously reported Chen saying he had done “nothing illegal”, but Reuters was unable to reach him for comment as the university declined to provide Chen’s telephone number and said he was refusing interviews.\nThe university’s investigation was launched after former Beihang student Luo Xixi publicly accused Chen of sexually harassing her 13 years ago in an online blog that promptly went viral after it was posted on Jan. 1.\n“The ministry decided to revoke Chen Xiaowu’s status as a Yangtze River Scholar,” Chinese state radio said, referring to an academic award given to individuals in higher education.\nThe ministry also authorized the university to relieve Chen of his appointment and took back his award funding, it said. It did not give further details.\nIn her post, Luo said Chen made an unwanted sexual advance after luring her to his sister’s house, and that he relented only after she burst into tears and said she was a virgin. Luo also accused Chen of harassing several other students.\nLuo, who now lives in the United States, said she was inspired by the #MeToo social media movement that started in October in the wake of sexual misconduct allegations in the U.S. entertainment industry, and encouraged others to come forward and share their own experiences under the hashtag.\nLuo’s allegations, combined with another public post from a Peking University graduate, have inspired students from more than 50 universities to issue open letters demanding more effective oversight and a reporting system to deal with sexual harassment on their campuses.\nBut unlike #MeToo in the United States, the campaign has mostly been spread by word of mouth and has struggled to gain traction on social media, in part because Chinese internet censors have been swift to take down the open letters.\nReporting by Michael Martina; Editing by Dale Hudson\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-14T20:14:00.000+02:00", "crawled": "2018-01-14T20:54:08.000+02:00", "highlightTitle": ""}