{"organizations": [], "uuid": "575b7cce2ee4a43e2ca825ef6fae60ff72615392", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226604402&w=1200&r=LYNXMPEE0T0VY", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/bp-spending/bp-vows-to-be-tight-fisted-despite-oil-price-rally-idINKBN1FJ1RU", "country": "US", "domain_rank": 408, "title": "BP vows to be tight-fisted despite oil price rally", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T15:14:00.000+02:00", "replies_count": 0, "uuid": "575b7cce2ee4a43e2ca825ef6fae60ff72615392"}, "author": "", "url": "https://in.reuters.com/article/bp-spending/bp-vows-to-be-tight-fisted-despite-oil-price-rally-idINKBN1FJ1RU", "ord_in_thread": 0, "title": "BP vows to be tight-fisted despite oil price rally", "locations": [], "entities": {"persons": [{"name": "irishman looney", "sentiment": "none"}, {"name": "looney", "sentiment": "none"}, {"name": "bob dudley", "sentiment": "none"}, {"name": "ron bousso", "sentiment": "none"}, {"name": "bernard looney", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}, {"name": "florence", "sentiment": "none"}], "organizations": [{"name": "bp", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 1:16 PM / Updated 41 minutes ago BP vows to be tight-fisted despite oil price rally Ron Bousso 3 Min Read \nFLORENCE, Italy (Reuters) - BP will not change its spending plans because of rising global oil prices and is preparing to approve projects this year that can make money with prices below $40 a barrel, the head of its oil and gas division Bernard Looney told Reuters. \nIrishman Looney, 46, is seen across the industry as one of the strongest candidates inside BP to succeed Chief Executive Bob Dudley, 62, who is expected to serve at least a few more years in the job. \nLike its rivals, BP is set to enjoy a strong increase in revenue from the 50 percent rise in oil prices since the middle of last year to around $70 a barrel. \nBut Looney, in a rare interview, said the British company would retain the spending discipline it achieved through deep cost cuts and more efficient work patterns during the three-year downturn from 2014. BP said last year it would have annual capital expenditure of $15-17 billion until 2021. \n“Discipline has to remain the word and we shouldn’t be seduced by the oil price,” Looney told Reuters on the sidelines of the Baker Hughes conference in Florence. \n“We’re not going to say that now that the oil prices are back up, let’s do more, let’s spend more,” Looney said. The logo of BP is seen at a petrol station in Kloten, Switzerland October 3, 2017. REUTERS/Arnd Wiegmann/Files \nThe company, which still faces billions in penalties over the deadly 2010 Deepwater Horizon spill, is now able to generate profit with oil prices in the $50s per barrel, halving the break-even from earlier in the decade. \nBP will approve more new projects this year, which will all generate profits at oil prices far lower than current levels, Looney said. \n“You’ll see us continue to invest, but we will always do that when the project meets our threshold and we believe it is the best it can be,” he added. “It has to be resilient in what is a different world and it has got to be built to make money at less than $40 a barrel for sure.” \nHe did not specify how many projects would be given the green light this year, or where. However analysts at Macquarie said the company was likely to approve fields in Mauritania, Angola and India. \nBeyond the development of new fields, Looney said BP was able to increase production by drilling new wells at existing offshore fields, a process that requires far less spending because much of the infrastructure is already in place. \n“Drilling an infill well has enormous value,” he said, adding that the relatively short time required to drill makes it competitive even with fast-cycle U. S. shale. \nTogether with the start-up of seven oil and gas fields in 2017, and five set to start in 2018, BP plans to boost its production by 800,000 barrels per day (bpd) by 2020, which will be mostly gas. It produced around 3.5 million bpd last year. Reporting by Ron Bousso; Editing by Pravin Char", "external_links": [], "published": "2018-01-30T15:14:00.000+02:00", "crawled": "2018-01-30T15:29:00.113+02:00", "highlightTitle": ""}