{"organizations": [], "uuid": "2187e1f98639b5a905f62386f8eb8dbaa9f47ceb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-report-passive-investors-see-engagement-as-missing-link-in-board-directors-job.html", "country": "US", "domain_rank": 767, "title": "Report: Passive Investors See Engagement as Missing Link in Board Director's Job", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T21:40:00.000+02:00", "replies_count": 0, "uuid": "2187e1f98639b5a905f62386f8eb8dbaa9f47ceb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-report-passive-investors-see-engagement-as-missing-link-in-board-directors-job.html", "ord_in_thread": 0, "title": "Report: Passive Investors See Engagement as Missing Link in Board Director's Job", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "conference board's governance center", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 4, 2018 /PRNewswire/ -- Today, The Conference Board's Governance Center released a report detailing the role and expectations of corporate directors through the eyes of passive investors. In the report, Just What is the Corporate Director's Job? , the viewpoints featured result from a panel discussion with large passive institutional investors and interviews with representatives of that cohort.\nAs the report highlights, large passive investors are believed to have one of the most vested stakes in the success of directors at their portfolio companies. It features several insights that include but are not limited to the following:\nShareholder engagement: the missing link. The interviewed passive investors believe engagement has been the missing link in the corporate governance debate, which has traditionally focused on the primacy of shareholders versus directors. The largest passive investors have not only greatly increased their engagement with directors over the past two years. Moreover, they have adopted investor stewardship principles that focus on board composition, governance structures, and director knowledge.\nKnowledge of environmental, social, and governance criteria. Three of the largest passive investors interviewed want directors who are knowledgeable about environmental, social, and governance criteria. One participant, State Street Global Advisors, emphasized their focus on board oversight of environmental and social sustainability in areas including climate change, water management, supply chain management, safety issues, workplace diversity, and talent development. Some or all of these issues may affect long-term value.\nDisseminating management's information. Through the lens of passive investors, disseminating management's information is a vital part of a director's job. The investors interviewed focused on directors' ability to supplement information they receive from management to avoid asymmetric information risk. One investor said the best way to supplement management information is to formally and informally meet with employees a few levels down from the c-suite.\n\"Large passive investors differ from other stakeholders in that they get to engage with directors and management due to their sheer size in the marketplace,\" said Gary Larkin, report author and Research Associate at The Conference Board. \"These stakeholders may have the best chance at influencing how future public boards are composed, how they act, and how they disclose those actions, such as CEO succession planning and overseeing company strategy.\"\n\"We have seen a transformational shift of equity ownership in the U.S. securities markets to a small number of asset managers with indexed or 'passive' investment strategies,\" said Doug Chia, Executive Director of the Governance Center at The Conference Board. \"The expectations these asset managers have of public company boards are changing the job of independent directors.\"\nThe report marks the fourth of several Governance Center reports that feature insights from boardroom stakeholders about the role of the corporate director. In addition to highlights from conversations and interviews with passive investors, the report includes information about large institutional investors' director engagement in 2017, highlights of letters from those investors to directors, and investor proxy voting guidelines for director elections.\nMembers of the press can e-mail Joseph DiBlasi or Carol Courter for a copy of the new report .\nLearn more about The Conference Board's Governance Center here . The conversation continues on Twitter: @TCBCorpGov I @ConferenceBoard\nAbout The Conference Board's Governance Center\nThe Conference Board's Governance Center draws upon authoritative research from The Conference Board. Our mission is to work in the public interest to provide knowledge and thought leadership on global corporate governance issues for boards and c-suite leaders, investors, and other leading organizations.\nAbout The Conference Board\nThe Conference Board is a global, independent business membership and research association working in the public interest. Our mission is unique: To provide the world's leading organizations with the practical knowledge they need to improve their performance and better serve society. The Conference Board is a non-advocacy, not-for-profit entity holding 501 (c) (3) tax-exempt status in the United States.\nView original content with multimedia: http://www.prnewswire.com/news-releases/report-passive-investors-see-engagement-as-missing-link-in-board-directors-job-300577800.html\nSOURCE The Conference Board", "external_links": ["https://www.conference-board.org/publications/publicationdetail.cfm?publicationid=7654", "http://www.prnewswire.com/news-releases/report-passive-investors-see-engagement-as-missing-link-in-board-directors-job-300577800.html", "https://twitter.com/tcbcorpgov", "https://www.conference-board.org/centers/centerdetails.cfm?centerid=5", "https://twitter.com/Conferenceboard"], "published": "2018-01-04T21:40:00.000+02:00", "crawled": "2018-01-04T22:53:20.000+02:00", "highlightTitle": ""}