{"organizations": [], "uuid": "f5bf0fcf9a7f6ecf729208ec14704667b74bcbbc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-schmitt-industries-inc-announces-appointment-of-david-case-as-president-and-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "Schmitt Industries, Inc. Announces Appointment of David Case as President and Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T00:45:00.000+02:00", "replies_count": 0, "uuid": "f5bf0fcf9a7f6ecf729208ec14704667b74bcbbc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-schmitt-industries-inc-announces-appointment-of-david-case-as-president-and-chief-executive-officer.html", "ord_in_thread": 0, "title": "Schmitt Industries, Inc. Announces Appointment of David Case as President and Chief Executive Officer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PORTLAND, Ore., Jan. 08, 2018 (GLOBE NEWSWIRE) -- Schmitt Industries, Inc. (NASDAQ:SMIT) (the \"Company\") announced today that David W. Case has assumed the role of President and Chief Executive Officer of the Company, effective as of January 5, 2018 and that David M. Hudson, has resigned as President and Chief Executive Officer and remains a Director of the Company.\nDavid Case was previously the Vice President of Operations and General Manager of the Company’s largest product line, Schmitt Dynamic Balancing Systems. Mr. Case has been with the Company for over 30 years and has served in a variety of roles of increasing responsibility. He is intimately familiar with all of Schmitt's products and markets throughout the world. Mr. Case has also been appointed as a member of the Company’s Board of Directors.\nDave Hudson became Interim President and CEO on January 6, 2016, and subsequently assumed the role on a non-interim basis, successfully leading the Company through a number of milestones. Mr. Hudson will continue to guide the Company as a Director following the transition.\n“The Board of Directors welcomes David Case to his new role within the Company and on the Board,” said Michael J. Ellsworth, Chairman of the Board of the Directors. “The Board also wishes to thank Dave Hudson for his leadership over the past two years, and we look forward to his continued contribution as a Director,” Mr. Ellsworth concluded.\nAbout Schmitt Industries\nSchmitt Industries, Inc., an Oregon corporation, designs, manufactures and sells high precision test and measurement products for two main business segments: the Balancer Segment and the Measurement Segment. For the Balancer Segment, the Company designs, manufactures and sells computer-controlled vibration detection, balancing and process control systems for the worldwide machine tool industry, particularly for grinding machines. For the Measurement Segment, the Company designs, manufactures and sells laser and white light sensors for distance, dimensional and area measurement for a wide variety of commercial applications and measurement products that accurately measure the fill levels of tanks holding propane, diesel and other tank-based liquids and transmit that data via satellite to a secure web site for display. The Company also provides sales and service for Europe and Asia through its wholly owned subsidiary, Schmitt Europe Limited (SEL), located in Coventry, England and through its sales representative office located in Shanghai, China.\nCORPORATE OFFICE:\n2765 NW NICOLAI ST.● PORTLAND, OREGON 97210 ● 503/227-7908 ● FAX 503/223-1258\nSource:Schmitt Industries, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/a07d87bb-ffee-4590-80cc-43b85e4cf254"], "published": "2018-01-09T00:45:00.000+02:00", "crawled": "2018-01-09T09:40:16.327+02:00", "highlightTitle": ""}