{"organizations": [], "uuid": "045bb2424f4531e7f188ac1ead08024b9f483af5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-rogers-communications-reports-fourth-quarter-and-full-year-2017-results-announces-2018-financial-guidance.html", "country": "US", "domain_rank": 767, "title": "Rogers Communications Reports Fourth Quarter and Full-Year 2017 Results; Announces 2018 Financial Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T15:00:00.000+02:00", "replies_count": 0, "uuid": "045bb2424f4531e7f188ac1ead08024b9f483af5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-rogers-communications-reports-fourth-quarter-and-full-year-2017-results-announces-2018-financial-guidance.html", "ord_in_thread": 0, "title": "Rogers Communications Reports Fourth Quarter and Full-Year 2017 Results; Announces 2018 Financial Guidance", "locations": [], "entities": {"persons": [], "locations": [{"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "rogers communications reports fourth quarter", "sentiment": "negative"}, {"name": "rogers communications inc.", "sentiment": "none"}, {"name": "aop", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Excellent financial and subscriber performance in full-year 2017, largely driven by Wireless Wireless service revenue growth of 7% and AOP growth of 8% - the highest since 2009 Wireless postpaid net additions of 354,000 and churn of 1.20% - the best results since 2010\nStrong financial performance in the fourth quarter 2017 Total service revenue growth of 4% and adjusted operating profit (AOP) growth of 6% Wireless service revenue growth of 7% and AOP growth of 9%; AOP margin up 60 basis points Postpaid net additions of 72,000 and churn of 1.48% Cable revenue growth of 2% and AOP growth of 3%; AOP margin up 80 basis points Internet revenue growth of 9% and net additions of 17,000\n2018 guidance reflects accelerated growth in adjusted EBITDA and free cash flow Growth in revenue of 3% to 5%, adjusted EBITDA of 5% to 7%, and free cash flow of 3% to 5%; capex of $2.65 to $2.85 billion, focused on network investments\nTORONTO, Jan. 25, 2018 /PRNewswire/ - Rogers Communications Inc. today announced its unaudited financial and operating results for the fourth quarter ended December 31, 2017.\nConsolidated Financial Highlights\nThree months ended December 31\nTwelve months ended December 31\n(In millions of Canadian dollars, except per share\namounts, unaudited)\n2017\n2016\n% Chg\n2017\n2016\n% Chg\nTotal revenue\n3,632\n3,510\n3\n14,143\n13,702\n3\nTotal service revenue 1\n3,430\n3,306\n4\n13,560\n13,027\n4\nAdjusted operating profit 2\n1,340\n1,259\n6\n5,379\n5,092\n6\nNet income (loss)\n419\n(9)\nn/m\n1,711\n835\n105\nAdjusted net income 2\n455\n382\n19\n1,821\n1,481\n23\nBasic earnings (loss) per share\n$0.81\n($0.02)\nn/m\n$3.32\n$1.62\n105\nAdjusted basic earnings per share 2\n$0.88\n$0.74\n19\n$3.54\n$2.88\n23\nCash provided by operating activities\n1,142\n1,053\n8\n3,938\n3,957\n—\nFree cash flow 2\n244\n392\n(38)\n1,746\n1,705\n2\nn/m - not meaningful\n1 As defined. See \"Key Performance Indicators\".\n2 As defined. See \"Non-GAAP Measures\". These measures should not be considered substitutes or alternatives for GAAP measures. These are not defined terms under IFRS and do not have standard meanings, so may not be a reliable way to compare us to other companies.\n\"We delivered excellent results in 2017, with the best financial and subscriber performance in many years,\" said Joe Natale, President and CEO. \"We also reported strong financial results in the fourth quarter, including growth in revenue, adjusted operating profit and margins. Our 2018 guidance reflects accelerated growth in profit and free cash flow along with well-timed, strategic investments in our networks. We enter 2018 bullish about the growth in our core business and with a clear plan focused on enhancing our customers' experience and capturing cost efficiencies to drive sustainable growth.\"\nKey Financial Highlights\nHigher revenue\nRevenue increased 3% this quarter, largely driven by Wireless service revenue growth of 7% as a result of subscriber growth and a greater number of subscribers on higher-rate plans from our various brands, including Rogers Share Everything plans.\nCable revenue increased 2% this quarter due to continued strong Internet revenue growth of 9%.\nMedia revenue decreased 4% this quarter primarily as a result of lower revenue from the Toronto Blue Jays, primarily due to the postseason success in 2016, and lower publishing-related revenue due to the strategic shift to digital media announced last year, partially offset by higher Sportsnet revenue and increased sales at Today's Shopping Choice (TSC).\nHigher adjusted operating profit and margins\nAdjusted operating profit increased 6% this quarter, primarily as a result of Wireless adjusted operating profit growth of 9% due to the strong flow-through of service revenue growth described above and various cost efficiencies.\nCable adjusted operating profit increased 3% this quarter as a result of strong Internet revenue growth, the ongoing product mix shift to higher-margin Internet services, and various cost efficiencies.\nMedia adjusted operating profit decreased 20% this quarter primarily as a result of lower revenue from the Toronto Blue Jays, as discussed above, and lower publishing-related revenue due to the strategic shift to digital media announced late last year, partially offset by higher Sportsnet revenue.\nOur adjusted operating profit margin increased to 36.9% this quarter, an expansion of 100 basis points. This increase was primarily driven by Wireless, with a 60 basis point expansion to 43.2%, and Cable, with an 80 basis point expansion to 51.5%.\nHigher net income and adjusted net income\nNet income increased this quarter as a result of losses incurred last year related to the discontinuation of the development of our legacy IPTV product and higher adjusted operating profit. Adjusted net income increased 19% this quarter primarily due to higher adjusted operating profit and lower depreciation and amortization.\nSubstantial free cash flow affords financial flexibility\nThis quarter, we continued to generate substantial cash flow from operating activities and free cash flow of $1,142 million and $244 million, respectively. Free cash flow decreased as a result of greater capital expenditures this quarter compared to last year.\nWe ended the fourth quarter with a debt leverage ratio (adjusted net debt / adjusted operating profit) of 2.8, which improved from a ratio of 3.0 as at the end of the same period last year. See \"Managing our Liquidity and Financial Resources\" for more information.\nOur solid financial results enabled us to continue to make investments in our network and still return substantial dividends to shareholders. We paid $247 million in dividends this quarter.\nAchieved 2017 Guidance\nThe following table outlines guidance ranges that we had previously provided and our actual results and achievements for the selected full-year 2017 financial metrics.\n(In millions of dollars, except percentages)\n2016\nActual\n2017\nGuidance Ranges\n2017\nActual\nAchievement\nConsolidated Guidance 1\nRevenue\n13,702\nIncrease of 3%\nto\n5%\n14,143\n3.2%\n√\nAdjusted operating profit 2\n5,092\nIncrease of 5%\nto\n6%\n5,379\n5.6%\n√\nAdditions to property, plant and equipment, net 3\n2,352\n2,350\nto\n2,450\n2,436\nn/m\n√\nFree cash flow 2\n1,705\nIncrease of 2%\nto\n4%\n1,746\n2.4%\n√\n1\nThe table outlines guidance ranges for selected full-year 2017 consolidated financial metrics provided in our January 26, 2017 earnings release and subsequently updated on October 19, 2017. Guidance ranges presented as percentages reflect percentage increases over 2016 actual results.\n2\nAdjusted operating profit and free cash flow are non-GAAP measures and should not be considered substitutes or alternatives for GAAP measures. These are not defined terms under IFRS and do not have standard meanings, so may not be a reliable way to compare us to other companies. See \"Non-GAAP Measures\" for information about these measures, including how we calculate them.\n3\nIncludes additions to property, plant and equipment net of proceeds on disposition, but does not include expenditures for spectrum licences.\n2018 Outlook\nFor the full-year 2018, we expect steady growth in revenue and adjusted EBITDA to drive higher free cash flow, despite higher net additions to property, plant and equipment. In 2018, we expect to have the financial flexibility to maintain our network advantages, to further reduce debt, and to continue to return cash to shareholders.\nEffective January 1, 2018, the Company will commence using adjusted earnings before interest, tax, depreciation, and amortization (adjusted EBITDA) as the key measure of profit for the purpose of assessing performance for each segment and to make decisions about the allocation of resources. As such, we plan to introduce adjusted EBITDA as a new non-GAAP measure in our financial reports commencing January 1, 2018. This measure will replace our existing adjusted operating profit non-GAAP measure. We believe adjusted EBITDA better reflects segment and consolidated profitability. The difference between adjusted operating profit and adjusted EBITDA is that adjusted EBITDA will include stock-based compensation expense. We also believe that our decision-making processes will not be significantly affected through the use of adjusted EBITDA. Additionally, use of this measure will change our current definition of free cash flow. For detailed reconciliations, please see \"Non-GAAP Measures\".\n(In millions of dollars, except percentages)\n2017\nActuals\n2018 Guidance Ranges based on\na comparable basis prior to the\nadoption of IFRS 15 1\nConsolidated Guidance\nRevenue\n14,143\nIncrease of 3%\nto\n5%\nAdjusted EBITDA 2\n5,318\nIncrease of 5%\nto\n7%\nAdditions to property, plant and equipment, net 3\n2,436\n2,650\nto\n2,850\nFree cash flow 2\n1,685\nIncrease of 3%\nto\n5%\n1\nGuidance ranges presented as percentages reflect percentage increases over full-year 2017 results. 2018 amounts for purposes of assessing our performance against guidance will be calculated consistently with revenue recognition accounting policies prior to adopting IFRS 15, Revenue from contracts with customers.\n2\nEffective January 1, 2018, free cash flow will be calculated using adjusted EBITDA as a result of our adoption of this profit measure instead of adjusted operating profit. Free cash flow presented above reflects this change. The difference between adjusted EBITDA and adjusted operating profit is that adjusted EBITDA will include stock-based compensation expense. Adjusted EBITDA and free cash flow are non-GAAP measures and should not be considered substitutes or alternatives for GAAP measures. These are not defined terms under IFRS and do not have standard meanings, so may not be a reliable way to compare us to other companies. See \"Non-GAAP Measures\" for information about these measures, including how we calculate them\n3\nIncludes additions to property, plant and equipment net of proceeds on disposition, but does not include expenditures for spectrum licences.\nThe above table outlines guidance ranges for selected full-year 2018 consolidated financial metrics. These ranges take into consideration our current outlook and our 2017 results and are not expected to be impacted by the adoption of IFRS 15 on January 1, 2018. The purpose of the financial outlook is to assist investors, shareholders, and others in understanding certain financial metrics relating to expected 2018 financial results for evaluating the performance of our business. This information may not be appropriate for other purposes. Information about our guidance, including the various assumptions underlying it, is forward-looking and should be read in conjunction with \"About Forward-Looking Information\" (including the material assumptions listed under the heading \"Key assumptions underlying our 2018 guidance\") and the related disclosure and information about various economic, competitive, and regulatory assumptions, factors, and risks that may cause our actual future financial and operating results to differ from what we currently expect.\nWe provide annual guidance ranges on a consolidated full-year basis that are consistent with annual full-year Board of Directors-approved plans. Any updates to our full-year financial guidance over the course of the year would only be made to the consolidated guidance ranges that appear above.\nAbout Rogers\nRogers is a leading diversified Canadian communications and media company that's working to deliver a great experience to our customers every day. We are Canada's largest provider of wireless communications services and one of Canada's leading providers of cable television, high-speed Internet, information technology, and telephony services to consumers and businesses. Through Rogers Media, we are engaged in radio and television broadcasting, sports, televised and online shopping, magazines, and digital media. Our shares are publicly traded on the Toronto Stock Exchange (TSX: RCI.A and RCI.B) and on the New York Stock Exchange (NYSE: RCI).\nQuarterly Investment Community Teleconference\nOur fourth quarter 2017 results teleconference with the investment community will be held on:\nJanuary 25, 2018 8:00 a.m. Eastern Time webcast available at investors.rogers.com media are welcome to participate on a listen-only basis\nA rebroadcast will be available at investors.rogers.com for at least two weeks following the teleconference. Additionally, investors should note that from time to time, Rogers' management presents at brokerage-sponsored investor conferences. Most often, but not always, these conferences are webcast by the hosting brokerage firm, and when they are webcast, links are made available on Rogers' website at investors.rogers.com .\nFor More Information\nYou can find more information relating to us on our website ( investors.rogers.com ), on SEDAR ( sedar.com ), and on EDGAR ( sec.gov ), or you can e-mail us at investor.relations@rci.rogers.com . Information on or connected to these and any other websites referenced in this earnings release is not part of, or incorporated into, this earnings release.\nYou can also go to investors.rogers.com for information about our governance practices, corporate social responsibility reporting, a glossary of communications and media industry terms, and additional information about our business.\nAbout this Earnings Release\nThis earnings release contains important information about our business and our performance for the three and twelve months ended December 31, 2017, as well as forward-looking information about future periods. This earnings release should be used as preparation for reading our forthcoming Management's Discussion and Analysis (MD&A) and Audited Consolidated Financial Statements for the year ended December 31, 2017, which we intend to file with securities regulators in Canada and the US in the coming weeks. These statements will be made available on the investors.rogers.com , sedar.com , and sec.gov websites or mailed upon request.\nThe financial information contained in this earnings release is prepared using International Financial Reporting Standards (IFRS) as issued by the International Accounting Standards Board. This earnings release should be read in conjunction with our 2016 Annual MD&A, our 2016 Audited Consolidated Financial Statements, our 2017 First, Second, and Third Quarter MD&A and Interim Condensed Consolidated Financial Statements, and our other recent filings with Canadian and US securities regulatory authorities, which are available on SEDAR at sedar.com or EDGAR at sec.gov , respectively.\nAll dollar amounts are in Canadian dollars unless otherwise stated and are unaudited. All percentage changes are calculated using the rounded numbers as they appear in the tables. Information is current as at January 25, 2018 and was approved by our Board of Directors (Board). This earnings release includes and assumptions. See \"About Forward-Looking Information\" for more information.\nWe, us, our, Rogers, Rogers Communications, and the Company refer to Rogers Communications Inc. and its subsidiaries. RCI refers to the legal entity Rogers Communications Inc., not including its subsidiaries. Rogers also holds interests in various investments and ventures.\nIn this earnings release, this quarter, the quarter, or the fourth quarter refer to the three months ended December 31, 2017, the first quarter refers to the three months ended March 31, 2017, the second quarter refers to the three months ended June 30, 2017, the third quarter refers to the three months ended September 30, 2017, and year to date or full-year refer to the twelve months ended December 31, 2017. All results commentary is compared to the equivalent periods in 2016 or as at December 31, 2016, as applicable, unless otherwise indicated.\nReporting Segments\nWe report our results of operations in four reporting segments. Each segment and the nature of its business is as follows:\nSegment\nPrincipal activities\nWireless\nWireless telecommunications operations for Canadian consumers and businesses.\nCable\nCable telecommunications operations, including Internet, television, and telephony (phone) services for Canadian consumers and businesses.\nBusiness Solutions\nNetwork connectivity through our fibre network and data centre assets to support a range of voice, data, networking, hosting, and cloud-based services for the enterprise, public sector, and carrier wholesale markets.\nMedia\nA diversified portfolio of media properties, including sports media and entertainment, television and radio broadcasting, specialty channels, multi-platform shopping, digital media, and publishing.\nWireless, Cable, and Business Solutions are operated by our wholly-owned subsidiary, Rogers Communications Canada Inc. (RCCI), and certain of our other wholly-owned subsidiaries. Media is operated by our wholly-owned subsidiary, Rogers Media Inc., and its subsidiaries.\nWe intend to redefine our reporting segments effective January 1, 2018 as a result of technological evolution and the increased overlap between the various product offerings within our Cable and Business Solutions reporting segments, as well as how we allocate resources amongst, and the general management of, our reporting segments. Effective January 1, 2018, the results of our existing Cable segment, Business Solutions segment, and our Smart Home Monitoring products will be presented within a redefined Cable segment. Financial results related to our Smart Home Monitoring product are currently reported within Corporate items and intercompany eliminations. We will retrospectively amend our 2017 comparative segment results in 2018 to account for this redefinition.\nSummary of Consolidated Financial Results\nThree months ended December 31\nTwelve months ended December 31\n(In millions of dollars, except margins and per share\namounts)\n2017\n2016\n% Chg\n2017\n2016\n% Chg\nRevenue\nWireless\n2,189\n2,058\n6\n8,343\n7,916\n5\nCable\n871\n858\n2\n3,466\n3,449\n—\nBusiness Solutions\n99\n96\n3\n387\n384\n1\nMedia\n526\n550\n(4)\n2,153\n2,146\n—\nCorporate items and intercompany eliminations\n(53)\n(52)\n2\n(206)\n(193)\n7\nRevenue\n3,632\n3,510\n3\n14,143\n13,702\n3\nTotal service revenue 1\n3,430\n3,306\n4\n13,560\n13,027\n4\nAdjusted operating profit\nWireless\n860\n792\n9\n3,561\n3,285\n8\nCable\n449\n435\n3\n1,709\n1,674\n2\nBusiness Solutions\n32\n30\n7\n128\n123\n4\nMedia\n39\n49\n(20)\n139\n169\n(18)\nCorporate items and intercompany eliminations\n(40)\n(47)\n(15)\n(158)\n(159)\n(1)\nAdjusted operating profit 2\n1,340\n1,259\n6\n5,379\n5,092\n6\nAdjusted operating profit margin 2\n36.9%\n35.9%\n1.0 pts\n38.0%\n37.2%\n0.8 pts\nNet income (loss)\n419\n(9)\nn/m\n1,711\n835\n105\nBasic earnings (loss) per share\n$0.81\n($0.02)\nn/m\n$3.32\n$1.62\n105\nDiluted earnings (loss) per share\n$0.81\n($0.04)\nn/m\n$3.31\n$1.62\n104\nAdjusted net income 2\n455\n382\n19\n1,821\n1,481\n23\nAdjusted basic earnings per share 2\n$0.88\n$0.74\n19\n$3.54\n$2.88\n23\nAdjusted diluted earnings per share 2\n$0.88\n$0.74\n19\n$3.52\n$2.86\n23\nAdditions to property, plant and equipment, net\n841\n604\n39\n2,436\n2,352\n4\nCash provided by operating activities\n1,142\n1,053\n8\n3,938\n3,957\n—\nFree cash flow 2\n244\n392\n(38)\n1,746\n1,705\n2\n1\nAs defined. See \"Key Performance Indicators\".\n2\nAdjusted operating profit, adjusted operating profit margin, adjusted net income, adjusted basic and diluted earnings per share, and free cash flow are non-GAAP measures and should not be considered substitutes or alternatives for GAAP measures. These are not defined terms under IFRS and do not have standard meanings, so may not be a reliable way to compare us to other companies. See \"Non-GAAP Measures\" for information about these measures, including how we calculate them.\nResults of our Reporting Segments\nWIRELESS\nWireless Financial Results\nThree months ended December 31\nTwelve months ended December 31\n(In millions of dollars, except margins)\n2017\n2016\n% Chg\n2017\n2016\n% Chg\nRevenue\nService revenue\n1,990\n1,858\n7\n7,775\n7,258\n7\nEquipment revenue\n199\n200\n(1)\n568\n658\n(14)\nRevenue\n2,189\n2,058\n6\n8,343\n7,916\n5\nOperating expenses\nCost of equipment\n648\n584\n11\n2,033\n1,947\n4\nOther operating expenses\n681\n682\n—\n2,749\n2,684\n2\nOperating expenses\n1,329\n1,266\n5\n4,782\n4,631\n3\nAdjusted operating profit\n860\n792\n9\n3,561\n3,285\n8\nAdjusted operating profit margin as a % of service revenue\n43.2%\n42.6%\n0.6 pts\n45.8%\n45.3%\n0.5 pts\nAdditions to property, plant and equipment\n269\n153\n76\n806\n702\n15\nWireless Subscriber Results 1\nThree months ended December 31\nTwelve months ended December 31\n(In thousands, except churn, postpaid ARPA, and\nblended ARPU)\n2017\n2016\nChg\n2017\n2016\nChg\nPostpaid 2\nGross additions\n456\n436\n20\n1,599\n1,521\n78\nNet additions\n72\n93\n(21)\n354\n286\n68\nTotal postpaid subscribers 3\n8,704\n8,557\n147\n8,704\n8,557\n147\nChurn (monthly)\n1.48%\n1.35%\n0.13 pts\n1.20%\n1.23%\n(0.03 pts)\nARPA (monthly)\n$126.54\n$119.90\n$6.64\n$124.75\n$117.37\n$7.38\nPrepaid\nGross additions\n165\n172\n(7)\n782\n761\n21\nNet (losses) additions\n(8)\n38\n(46)\n61\n111\n(50)\nTotal prepaid subscribers 3\n1,778\n1,717\n61\n1,778\n1,717\n61\nChurn (monthly)\n3.22%\n2.62%\n0.60 pts\n3.48%\n3.32%\n0.16 pts\nBlended ARPU (monthly) 2\n$63.46\n$60.72\n$2.74\n$62.31\n$60.42\n$1.89\n1\nSubscriber counts, subscriber churn, postpaid ARPA, and blended ARPU are key performance indicators. See \"Key Performance Indicators\".\n2\nEffective October 1, 2017, and on a prospective basis, we reduced our Wireless postpaid subscriber base by 207,000 subscribers to remove a low-ARPU public services customer that is in the process of migrating to another service provider. We believe adjusting our base for a customer of this size that migrates off our network provides a more meaningful reflection of the underlying organic performance of our Wireless business.\n3\nAs at end of period.\nService revenue\nThe 7% increase in service revenue this quarter was a result of:\nhigher blended ARPU, primarily as a result of the increased mix of subscribers on higher-rate plans from our various brands, which includes the customer-friendly Rogers Share Everything plans, and increased data usage. Our higher-rate plans typically generate higher ARPU, may allow users to pool and manage their data usage across multiple devices, and provide access to some of our other offerings, such as Roam Like Home, Fido Roam, Rogers NHL LIVE, Fido Data Bytes, and Spotify; and larger postpaid and prepaid subscriber bases.\nThe 6% increase in postpaid ARPA this quarter was primarily a result of the continued adoption of Rogers Share Everything plans and the increasing number of lines per customer account. Customers on Share Everything plans have increasingly utilized the advantages of premium offerings and access their shareable plans with multiple devices on the same account.\nThe 5% increase in blended ARPU this quarter was a result of the increased service revenue, as discussed above, and the adjustment to our postpaid subscriber base pertaining to the migration of a public services customer.\nThe increase in postpaid churn this quarter was primarily a result of heightened competitive intensity, particularly during the holiday season.\nEquipment revenue\nThe 1% decrease in equipment revenue this quarter was a result of:\nlarger average investments in higher-blended-ARPU-generating customers who purchased devices under term contracts, in part due to the heightened competitive intensity this quarter; partially offset by a 7% increase in device upgrades by existing subscribers; and higher postpaid gross additions.\nOperating expenses\nCost of equipment\nThe 11% increase in the cost of equipment this quarter was a result of:\na continued shift in the product mix of device sales towards higher-cost smartphones as more devices launched and we continue to invest in higher-blended-ARPU-generating customers; the increase in device upgrades by existing subscribers as discussed above; and higher postpaid gross additions.\nOther operating expenses\nOther operating expenses were stable this quarter as a result of:\nvarious cost efficiencies and productivity initiatives; offset by higher costs related to increased revenue, as discussed above.\nAdjusted operating profit\nThe 9% increase in adjusted operating profit this quarter was a result of the strong flow-through of service revenue growth discussed above.\nCABLE\nCable Financial Results\nThree months ended December 31\nTwelve months ended December 31\n(In millions of dollars, except margins)\n2017\n2016\n% Chg\n2017\n2016\n% Chg\nRevenue\nInternet\n413\n378\n9\n1,606\n1,495\n7\nTelevision\n372\n386\n(4)\n1,501\n1,562\n(4)\nPhone\n84\n93\n(10)\n353\n386\n(9)\nService revenue\n869\n857\n1\n3,460\n3,443\n—\nEquipment revenue\n2\n1\n100\n6\n6\n—\nRevenue\n871\n858\n2\n3,466\n3,449\n—\nOperating expenses\nCost of equipment\n—\n1\nn/m\n2\n3\n(33)\nOther operating expenses\n422\n422\n—\n1,755\n1,772\n(1)\nOperating expenses\n422\n423\n—\n1,757\n1,775\n(1)\nAdjusted operating profit\n449\n435\n3\n1,709\n1,674\n2\nAdjusted operating profit margin\n51.5%\n50.7%\n0.8 pts\n49.3%\n48.5%\n0.8 pts\nAdditions to property, plant and equipment\n379\n284\n33\n1,172\n1,085\n8\nCable Subscriber Results 1\nThree months ended December 31\nTwelve months ended December 31\n(In thousands)\n2017\n2016\nChg\n2017\n2016\nChg\nInternet\nNet additions\n17\n30\n(13)\n85\n97\n(12)\nTotal Internet subscribers 2\n2,230\n2,145\n85\n2,230\n2,145\n85\nTelevision\nNet losses\n(13)\n(13)\n—\n(80)\n(76)\n(4)\nTotal Television subscribers 2\n1,740\n1,820\n(80)\n1,740\n1,820\n(80)\nPhone\nNet additions\n9\n4\n5\n14\n4\n10\nTotal Phone subscribers 2\n1,108\n1,094\n14\n1,108\n1,094\n14\nCable homes passed 2\n4,307\n4,241\n66\n4,307\n4,241\n66\nTotal service units 3\nNet additions\n13\n21\n(8)\n19\n25\n(6)\nTotal service units 2\n5,078\n5,059\n19\n5,078\n5,059\n19\n1\nSubscriber counts are key performance indicators. See \"Key Performance Indicators\".\n2\nAs at end of period.\n3\nIncludes Internet, Television, and Phone subscribers.\nRevenue\nThe 2% increase in revenue this quarter was a result of:\nthe movement of Internet customers to higher speed and usage tiers; and the impact of service pricing changes; partially offset by a lower subscriber base for our Television products.\nInternet revenue\nThe 9% increase in Internet revenue this quarter was a result of:\ngeneral movement of customers to higher speed and usage tiers of our Internet offerings, with 54% of our residential Internet base on plans of 100 megabits per second or higher (2016 - 46%); a larger Internet subscriber base; and the impact of Internet service pricing changes; partially offset by more promotional pricing provided to subscribers.\nTelevision revenue\nThe 4% decrease in Television revenue this quarter was a result of:\nthe decline in Television subscribers over the past year; partially offset by the impact of Television service pricing changes, net of discounts.\nPhone revenue\nThe 10% decrease in Phone revenue this quarter was a result of the impact of pricing.\nOperating expenses\nOperating expenses were stable this quarter as a result of:\nvarious cost efficiencies and productivity initiatives; offset by higher costs related to increased revenue, as discussed above.\nAdjusted operating profit\nThe 3% increase in adjusted operating profit this quarter was a result of the revenue changes discussed above.\nBUSINESS SOLUTIONS\nBusiness Solutions Financial Results\nThree months ended December 31\nTwelve months ended December 31\n(In millions of dollars, except margins)\n2017\n2016\n% Chg\n2017\n2016\n% Chg\nRevenue\nNext generation\n84\n77\n9\n322\n307\n5\nLegacy\n14\n17\n(18)\n58\n71\n(18)\nService revenue\n98\n94\n4\n380\n378\n1\nEquipment revenue\n1\n2\n(50)\n7\n6\n17\nRevenue\n99\n96\n3\n387\n384\n1\nOperating expenses\n67\n66\n2\n259\n261\n(1)\nAdjusted operating profit\n32\n30\n7\n128\n123\n4\nAdjusted operating profit margin\n32.3%\n31.3%\n1.0 pts\n33.1%\n32.0%\n1.1 pts\nAdditions to property, plant and equipment\n40\n37\n8\n131\n146\n(10)\nRevenue\nThe 4% increase in service revenue this quarter was a result of the increase in higher-margin, next generation on-net and near-net IP-based services revenue, partially offset by the continued decline in our legacy and off-net voice business.\nWe expect legacy service revenue will continue to decrease as we focus on migrating customers to more advanced, cost-effective IP-based services and solutions. Next generation services, which include our data centre operations, represented 86% of service revenue in the quarter (2016 - 82%).\nOperating expenses\nOperating expenses this quarter were in line with fourth quarter operating expenses of 2016.\nAdjusted operating profit\nThe 7% increase in adjusted operating profit this quarter was a result of the revenue and expense changes discussed above.\nMEDIA\nMedia Financial Results\nThree months ended December 31\nTwelve months ended December 31\n(In millions of dollars, except margins)\n2017\n2016\n% Chg\n2017\n2016\n% Chg\nRevenue\n526\n550\n(4)\n2,153\n2,146\n—\nOperating expenses\n487\n501\n(3)\n2,014\n1,977\n2\nAdjusted operating profit\n39\n49\n(20)\n139\n169\n(18)\nAdjusted operating profit margin\n7.4%\n8.9%\n(1.5 pts)\n6.5%\n7.9%\n(1.4 pts)\nAdditions to property, plant and equipment\n39\n19\n105\n83\n62\n34\nRevenue\nThe 4% decrease in revenue this quarter was a result of:\nlower revenue at the Toronto Blue Jays due to the postseason in 2016; and lower publishing-related revenue as a result of the strategic shift to digital media announced last year; partially offset by higher Sportsnet revenue; and higher TSC merchandise sales.\nOperating expenses\nThe 3% decrease in operating expenses this quarter was a result of:\nlower publishing-related costs as a result of the strategic shift described above; and lower Toronto Blue Jays costs due to costs associated with the 2016 postseason; partially offset by higher TSC merchandise costs.\nAdjusted operating profit\nThe 20% decrease in adjusted operating profit this quarter was a result of the revenue and expense changes discussed above.\nADDITIONS TO PROPERTY, PLANT AND EQUIPMENT, NET\nThree months ended December 31\nTwelve months ended December 31\n(In millions of dollars, except capital intensity)\n2017\n2016\n% Chg\n2017\n2016\n% Chg\nAdditions to property, plant and equipment\nWireless\n269\n153\n76\n806\n702\n15\nCable\n379\n284\n33\n1,172\n1,085\n8\nBusiness Solutions\n40\n37\n8\n131\n146\n(10)\nMedia\n39\n19\n105\n83\n62\n34\nCorporate\n114\n111\n3\n318\n357\n(11)\nTotal additions to property, plant and equipment 1\n841\n604\n39\n2,510\n2,352\n7\nProceeds from disposition of property, plant and\nequipment\n—\n—\nn/m\n(74)\n—\nn/m\nTotal additions to property, plant and equipment, net\n841\n604\n39\n2,436\n2,352\n4\nCapital intensity 2\n23.2%\n17.2%\n6.0 pts\n17.2%\n17.2%\n— pts\n1\nAdditions to property, plant and equipment do not include expenditures for spectrum licences.\n2\nAs defined. See \"Key Performance Indicators\".\nWireless\nThe increase in additions to property, plant and equipment in Wireless this quarter was a result of investments made to upgrade our wireless network to continue delivering worry-free, reliable performance for our customers. We are augmenting our existing LTE network with 4.5G technology investments that are also designed to migrate to a 5G environment. This quarter, we began upgrading our radio infrastructure and made investments to activate the AWS-1 spectrum licence acquired earlier in 2017.\nCable\nThe increase in additions to property, plant and equipment in Cable this quarter was a result of higher investments in network and information technology infrastructure, partially related to our forthcoming Ignite TV product (previously referred to as the X1 IP-based video platform), and to enhance the quality of our cable network. This quarter, we began upgrading our hybrid fibre-coaxial infrastructure with additional fibre deployments and further DOCSIS technology enhancements. These deployments and enhancements will lower the number of homes passed per node and incorporate the latest technologies to help deliver more bandwidth and an even more reliable customer experience.\nBusiness Solutions\nThe increase in additions to property, plant and equipment in Business Solutions this quarter was a result of higher investments in network infrastructure.\nMedia\nThe increase in additions to property, plant and equipment this quarter reflect higher investments in our broadcast infrastructure and the Rogers Centre.\nCorporate\nThe increase in additions to property, plant and equipment in Corporate this quarter was a result of higher investments in premise improvements.\nCapital intensity\nCapital intensity increased this quarter as a result of higher net additions to property, plant and equipment as discussed above, partially offset by higher total revenue.\nReview of Consolidated Performance\nThis section discusses our consolidated net income and other income and expenses that do not form part of the segment discussions above.\nThree months ended December 31\nTwelve months ended December 31\n(In millions of dollars)\n2017\n2016\n% Chg\n2017\n2016\n% Chg\nAdjusted operating profit 1\n1,340\n1,259\n6\n5,379\n5,092\n6\nDeduct (add):\nStock-based compensation\n14\n16\n(13)\n61\n61\n—\nDepreciation and amortization\n531\n555\n(4)\n2,142\n2,276\n(6)\nGain on disposition of property, plant\nand equipment\n—\n—\nn/m\n(49)\n—\nn/m\nRestructuring, acquisition and other\n31\n518\n(94)\n152\n644\n(76)\nFinance costs\n184\n188\n(2)\n746\n761\n(2)\nOther expense (income)\n3\n(4)\nn/m\n(19)\n191\nn/m\nIncome tax expense (recovery)\n158\n(5)\nn/m\n635\n324\n96\nNet income (loss)\n419\n(9)\nn/m\n1,711\n835\n105\n1\nAdjusted operating profit is a non-GAAP measure and should not be considered a substitute or alternative for GAAP measures. It is not a defined term under IFRS and does not have a standard meaning, so may not be a reliable way to compare us to other companies. See \"Non-GAAP Measures\" for information about this measure, including how we calculate it.\nStock-based compensation\nOur stock-based compensation, which includes stock options (with stock appreciation rights), restricted share units, and deferred share units, is generally driven by:\nthe vesting of stock options and share units; and changes in the market price of RCI Class B shares; offset by the impact of certain equity derivative instruments designed to hedge a portion of the stock price appreciation risk for our stock-based compensation programs. See \"Financial Risk Management\" for more information about equity derivatives.\nThree months ended December 31\nTwelve months ended December 31\n(In millions of dollars)\n2017\n2016\n2017\n2016\nImpact of vesting\n13\n19\n61\n70\nImpact of change in price\n2\n(22)\n74\n24\nEquity derivatives, net of interest receipt\n(1)\n19\n(74)\n(33)\nTotal stock-based compensation\n14\n16\n61\n61\nDepreciation and amortization\nThree months ended December 31\nTwelve months ended December 31\n(In millions of dollars)\n2017\n2016\n% Chg\n2017\n2016\n% Chg\nDepreciation\n518\n538\n(4)\n2,087\n2,183\n(4)\nAmortization\n13\n17\n(24)\n55\n93\n(41)\nTotal depreciation and amortization\n531\n555\n(4)\n2,142\n2,276\n(6)\nTotal depreciation and amortization decreased this quarter primarily as a result of certain assets becoming fully amortized.\nRestructuring, acquisition and other\nThis quarter, we incurred $31 million (2016 - $518 million) in restructuring, acquisition and other expenses. The costs this quarter were primarily a result of severance costs associated with the targeted restructuring of our employee base and certain contract termination costs. In 2016, these costs were primarily a result of the $484 million charge for asset impairment and related onerous contracts related to our legacy IPTV product. In 2017, this charge has been reported within restructuring, acquisition and other compared to a separate classification as impairment of assets and related onerous contract charges reported in 2016.\nFinance costs\nThree months ended December 31\nTwelve months ended December 31\n(In millions of dollars)\n2017\n2016\n% Chg\n2017\n2016\n% Chg\nInterest on borrowings 1\n184\n185\n(1)\n740\n758\n(2)\nInterest on post-employment benefits liability\n3\n2\n50\n12\n9\n33\nLoss (gain) on foreign exchange\n8\n32\n(75)\n(107)\n13\nn/m\nChange in fair value of derivatives\n(10)\n(34)\n(71)\n99\n(16)\nn/m\nCapitalized interest\n(5)\n(3)\n67\n(18)\n(18)\n—\nOther\n4\n6\n(33)\n20\n15\n33\nTotal finance costs\n184\n188\n(2)\n746\n761\n(2)\n1 Interest on borrowings includes interest on short-term borrowings and on long-term debt.\nInterest on borrowings\nInterest on borrowings decreased this quarter as a result of a marginally lower weighted average cost of financing on a lower average debt balance. See \"Managing our Liquidity and Financial Resources\" and \"Financial Condition\" for more information about our debt and related finance costs.\nIncome tax expense (recovery)\nThree months ended December 31\nTwelve months ended December 31\n(In millions of dollars, except tax rates)\n2017\n2016\n2017\n2016\nStatutory income tax rate\n26.7%\n26.6%\n26.7%\n26.6%\nIncome (loss) before income tax expense (recovery)\n577\n(14)\n2,346\n1,159\nComputed income tax expense (recovery)\n154\n(4)\n626\n308\nIncrease (decrease) in income tax expense resulting from:\nNon-(taxable) deductible stock-based compensation\n—\n(2)\n9\n5\nNon-deductible portion of equity losses\n2\n2\n—\n18\nNon-deductible loss on available-for-sale investments\n—\n—\n7\n—\nIncome tax adjustment, legislative tax change\n2\n—\n2\n3\nNon-taxable portion of capital gain\n—\n—\n(10)\n(7)\nOther items\n—\n(1)\n1\n(3)\nTotal income tax expense (recovery)\n158\n(5)\n635\n324\nEffective income tax rate\n27.4%\n35.7%\n27.1%\n28.0%\nCash income taxes paid\n76\n81\n475\n295\nThe effective income tax rate for the quarter was higher than the statutory tax rate primarily as a result of non-deductible equity losses recognized on certain of our investments and an increase in income tax expense as a result of a legislative tax change.\nCash income taxes paid decreased this quarter as a result of the timing of installment payments.\nNet income (loss)\nThree months ended December 31\nTwelve months ended December 31\n(In millions of dollars, except per share amounts)\n2017\n2016\n% Chg\n2017\n2016\n% Chg\nNet income (loss)\n419\n(9)\nn/m\n1,711\n835\n105\nBasic earnings (loss) per share\n$0.81\n($0.02)\nn/m\n$3.32\n$1.62\n105\nDiluted earnings (loss) per share\n$0.81\n($0.04)\nn/m\n$3.31\n$1.62\n104\nAdjusted net income\nWe calculate adjusted net income from adjusted operating profit as follows:\nThree months ended December 31\nTwelve months ended December 31\n(In millions of dollars, except per share amounts)\n2017\n2016\n% Chg\n2017\n2016\n% Chg\nAdjusted operating profit 1\n1,340\n1,259\n6\n5,379\n5,092\n6\nDeduct:\nDepreciation and amortization\n531\n555\n(4)\n2,142\n2,276\n(6)\nFinance costs\n184\n188\n(2)\n746\n761\n(2)\nOther expense (income) 2\n3\n(4)\nn/m\n1\n40\n(98)\nIncome tax expense 3\n167\n138\n21\n669\n534\n25\nAdjusted net income 1\n455\n382\n19\n1,821\n1,481\n23\nAdjusted basic earnings per share 1\n$0.88\n$0.74\n19\n$3.54\n$2.88\n23\nAdjusted diluted earnings per share 1\n$0.88\n$0.74\n19\n$3.52\n$2.86\n23\n1\nAdjusted operating profit, adjusted net income, and adjusted basic and diluted earnings per share are non-GAAP measures and should not be considered substitutes or alternatives for GAAP measures. These are not defined terms under IFRS and do not have standard meanings, so may not be a reliable way to compare us to other companies. See \"Non-GAAP Measures\" for information about these measures, including how we calculate them.\n2\nOther income for the twelve months ended December 31, 2017 excludes a $20 million provision reversal on the wind down of shomi. Other expense for the twelve months ended December 31, 2016 excludes an $11 million net loss on divestitures pertaining to investments and a $140 million loss on the wind down of our shomi joint venture.\n3\nIncome tax expense excludes an $11 million recovery (2016 - $143 million recovery) for the quarter and a $36 million recovery (2016 - $213 million recovery) for the year to date related to the income tax impact for adjusted items. Income tax expense also excludes expenses as a result of legislative tax changes of $2 million (2016 - nil) for the quarter and $2 million (2016 - $3 million) for the year to date.\nManaging our Liquidity and Financial Resources\nOperating, investing, and financing activities\nThree months ended December 31\nTwelve months ended December 31\n(In millions of dollars)\n2017\n2016\n2017\n2016\nCash provided by operating activities before changes in non-\ncash working capital items, income taxes paid, and interest paid\n1,358\n1,276\n5,302\n4,994\nChange in non-cash operating working capital items\n(15)\n(18)\n(154)\n14\nCash provided by operating activities before income taxes paid\nand interest paid\n1,343\n1,258\n5,148\n5,008\nIncome taxes paid\n(76)\n(81)\n(475)\n(295)\nInterest paid\n(125)\n(124)\n(735)\n(756)\nCash provided by operating activities\n1,142\n1,053\n3,938\n3,957\nInvesting activities:\nAdditions to property, plant and equipment, net\n(841)\n(604)\n(2,436)\n(2,352)\nAdditions to program rights\n(21)\n(3)\n(59)\n(46)\nChanges in non-cash working capital related to property,\nplant and equipment and intangible assets\n101\n44\n109\n(103)\nAcquisitions and other strategic transactions, net of cash acquired\n—\n—\n(184)\n—\nOther\n21\n49\n(60)\n45\nCash used in investing activities\n(740)\n(514)\n(2,630)\n(2,456)\nFinancing activities:\nNet (repayment of) proceeds received on short-term borrowings\n(163)\n(250)\n858\n—\nNet repayment of long-term debt\n(3)\n(57)\n(1,034)\n(538)\nNet proceeds (payments) on settlement of debt derivatives\nand forward contracts\n40\n(28)\n(79)\n(45)\nTransaction costs incurred\n—\n(17)\n—\n(17)\nDividends paid\n(247)\n(247)\n(988)\n(988)\nOther\n—\n—\n—\n5\nCash used in financing activities\n(373)\n(599)\n(1,243)\n(1,583)\nChange in cash and cash equivalents\n29\n(60)\n65\n(82)\n(Bank advances) cash and cash equivalents, beginning of period\n(35)\n(11)\n(71)\n11\nBank advances, end of period\n(6)\n(71)\n(6)\n(71)\nOperating activities\nThe 8% increase in cash provided by operating activities this quarter was primarily a result of higher net income.\nInvesting activities\nAdditions to property, plant and equipment, net\nWe spent $841 million this quarter on net additions to property, plant and equipment, before changes in non-cash working capital items, which was higher than the same period in 2016. See \"Additions to Property, Plant and Equipment, net\" for more information.\nFinancing activities\nDuring the quarter, we repaid net amounts of $126 million (2016 - $335 million) on our short-term borrowings, long-term debt, and related derivatives. See \"Financial Risk Management\" for more information on the cash flows relating to our derivative instruments.\nShort-term borrowings\nOur short-term borrowings consist of amounts outstanding under our accounts receivable securitization program and under our US dollar-denominated commercial paper (US CP) program. Below is a summary of our short-term borrowings as at December 31, 2017 and 2016.\nAs at\nDecember 31\nAs at\nDecember 31\n(In millions of dollars)\n2017\n2016\nAccounts receivable securitization program\n650\n800\nUS commercial paper program\n935\n—\nTotal short-term borrowings\n1,585\n800\nBelow is a summary of the activity relating to our short-term borrowings for the three and twelve months ended December 31, 2017 and 2016.\nThree months ended\nDecember 31, 2017\nTwelve months ended\nDecember 31, 2017\nNotional\nExchange\nNotional\nNotional\nExchange\nNotional\n(In millions of dollars, except exchange rates)\n(US$)\nrate\n(Cdn$)\n(US$)\nrate\n(Cdn$)\nProceeds received from accounts receivable securitization\n—\n530\nRepayment of accounts receivable securitization\n(390)\n(680)\nNet repayment of accounts receivable securitization\n(390)\n(150)\nProceeds received from US commercial paper\n2,142\n1.2750\n2,731\n8,267\n1.2958\n10,712\nRepayment of US commercial paper\n(1,958)\n1.2789\n(2,504)\n(7,530)\n1.2887\n(9,704)\nNet proceeds received from US commercial paper\n227\n1,008\nNet (repayment of) proceeds received on short-term\nborrowings\n(163)\n858\nThree months ended\nDecember 31, 2016\nTwelve months ended\nDecember 31, 2016\nNotional\nExchange\nNotional\nNotional\nExchange\nNotional\n(In millions of dollars, except exchange rates)\n(US$)\nrate\n(Cdn$)\n(US$)\nrate\n(Cdn$)\nProceeds received from accounts receivable securitization\n—\n295\nRepayment of accounts receivable securitization\n(250)\n(295)\nNet repayment of accounts receivable securitization\n(250)\n—\nNet repayment of short-term borrowings\n(250)\n—\nIn March 2017, we entered into a US CP program that allowed us to issue up to a maximum aggregate principal amount of US$1 billion. In December 2017, we increased the maximum aggregate principal amount allowed under our US CP program to US$1.5 billion. Funds can be borrowed under this program with terms to maturity ranging from 1 to 397 days, subject to ongoing market conditions. Any issuances made under the US CP program will be issued at a discount. See \"Financial Condition\" for more information.\nConcurrent with our US CP issuances, we entered into debt derivatives to hedge the foreign currency risk associated with the principal and interest components of the borrowings under the US CP program. See \"Financial Risk Management\" for more information.\nLong-term debt\nOur long-term debt consists of amounts outstanding under our bank credit facilities and letter of credit facilities and the senior notes and debentures we have issued. Below is a summary of the activity relating to our long-term debt for the three and twelve months ended December 31, 2017 and 2016.\nThree months ended\nDecember 31, 2017\nTwelve months ended\nDecember 31, 2017\n(In millions of dollars, except exchange rates)\nNotional\nExchange\nNotional\nNotional\nExchange\nNotional\n(US$)\nrate\n(Cdn$)\n(US$)\nrate\n(Cdn$)\nCredit facility borrowings (Cdn$)\n—\n1,730\nCredit facility borrowings (US$)\n100\n1.25\n125\n960\n1.32\n1,269\nTotal credit facility borrowings\n125\n2,999\nCredit facility repayments (Cdn$)\n—\n(1,830)\nCredit facility repayments (US$)\n(100)\n1.28\n(128)\n(1,110)\n1.31\n(1,453)\nTotal credit facility repayments\n(128)\n(3,283)\nNet repayments under credit facilities\n(3)\n(284)\nSenior note repayments (Cdn$)\n—\n(750)\nNet repayment of long-term debt\n(3)\n(1,034)\nThree months ended\nDecember 31, 2016\nTwelve months ended\nDecember 31, 2016\n(In millions of dollars, except exchange rates)\nNotional\nExchange\nNotional\nNotional\nExchange\nNotional\n(US$)\nrate\n(Cdn$)\n(US$)\nrate\n(Cdn$)\nCredit facility borrowings (Cdn$)\n325\n1,140\nCredit facility borrowings (US$)\n303\n1.31\n398\n2,188\n1.31\n2,877\nTotal credit facility borrowings\n723\n4,017\nCredit facility repayments (Cdn$)\n(225)\n(1,540)\nCredit facility repayments (US$)\n(914)\n1.34\n(1,226)\n(2,038)\n1.32\n(2,686)\nTotal credit facility repayments\n(1,451)\n(4,226)\nNet repayments under credit facilities\n(728)\n(209)\nSenior note issuances (US$)\n500\n1.34\n671\n500\n1.34\n671\nSenior note repayments (Cdn$)\n—\n(1,000)\nNet issuance (repayment) of senior notes\n671\n(329)\nNet repayment of long-term debt\n(57)\n(538)\nThree months ended December 31\nTwelve months ended December 31\n(In millions of dollars)\n2017\n2016\n2017\n2016\nLong-term debt net of transaction costs, beginning of\nperiod\n14,402\n15,927\n16,080\n16,870\nNet repayment of long-term debt\n(3)\n(57)\n(1,034)\n(538)\nLoss (gain) on foreign exchange\n46\n224\n(608)\n(245)\nDeferred transaction costs incurred\n—\n(17)\n(3)\n(12)\nAmortization of deferred transaction costs\n3\n3\n13\n5\nLong-term debt net of transaction costs, end of period\n14,448\n16,080\n14,448\n16,080\nCertain funds were borrowed under our revolving and non-revolving credit facilities in US dollars to take advantage of a favourable interest rate spread; we have entered into debt derivatives related to these borrowings to convert all the interest and principal payment obligations to Canadian dollars. See \"Financial Risk Management\" for more information.\nDividends\nBelow is a summary of the dividends we declared and paid on our outstanding Class A Voting and Class B Non-Voting shares in 2017 and 2016.\nDeclaration date\nRecord date\nPayment date\nDividend per\nshare (dollars)\nDividends paid\n(in millions of dollars)\nJanuary 26, 2017\nMarch 13, 2017\nApril 3, 2017\n0.48\n247\nApril 18, 2017\nJune 12, 2017\nJuly 4, 2017\n0.48\n247\nAugust 17, 2017\nSeptember 15, 2017\nOctober 3, 2017\n0.48\n247\nOctober 19, 2017\nDecember 11, 2017\nJanuary 2, 2018\n0.48\n247\nJanuary 27, 2016\nMarch 13, 2016\nApril 1, 2016\n0.48\n247\nApril 18, 2016\nJune 12, 2016\nJuly 4, 2016\n0.48\n247\nAugust 11, 2016\nSeptember 11, 2016\nOctober 3, 2016\n0.48\n247\nOctober 20, 2016\nDecember 12, 2016\nJanuary 3, 2017\n0.48\n247\nFree cash flow\nThree months ended December 31\nTwelve months ended December 31\n(In millions of dollars)\n2017\n2016\n% Chg\n2017\n2016\n% Chg\nAdjusted operating profit 1\n1,340\n1,259\n6\n5,379\n5,092\n6\nDeduct:\nAdditions to property, plant and equipment, net 2\n841\n604\n39\n2,436\n2,352\n4\nInterest on borrowings, net of capitalized interest\n179\n182\n(2)\n722\n740\n(2)\nCash income taxes 3\n76\n81\n(6)\n475\n295\n61\nFree cash flow 1\n244\n392\n(38)\n1,746\n1,705\n2\n1\nAdjusted operating profit and free cash flow are non-GAAP measures and should not be considered substitutes or alternatives for GAAP measures. These are not defined terms under IFRS and do not have standard meanings, so may not be a reliable way to compare us to other companies. See \"Non-GAAP Measures\" for information about these measures, including how we calculate them.\n2\nAdditions to property, plant and equipment, net do not include expenditures for spectrum licences.\n3\nCash income taxes are net of refunds received.\nThe 38% decrease in free cash flow this quarter was a result of higher net additions to property, plant and equipment, partially offset by higher adjusted operating profit.\nFinancial Condition\nBelow is a summary of our total available liquidity under our bank credit facilities, letters of credit facilities, and short-term borrowings.\nAs at December 31, 2017\nTotal available\nDrawn\nLetters of credit\nUS CP program\nNet available\n(In millions of dollars)\nBank credit facilities:\nRevolving\n3,200\n—\n9\n935\n2,256\nOutstanding letters of credit\n87\n—\n87\n—\n—\nBank advances\n—\n6\n—\n—\n(6)\nTotal bank credit facilities\n3,287\n6\n96\n935\n2,250\nAccounts receivable securitization\n1,050\n650\n—\n—\n400\nTotal\n4,337\n656\n96\n935\n2,650\nAs at December 31, 2016\nTotal available\nDrawn\nLetters of credit\nNet available\n(In millions of dollars)\nBank credit facilities:\nRevolving\n2,500\n—\n9\n2,491\nNon-revolving\n301\n301\n—\n—\nOutstanding letters of credit\n59\n—\n59\n—\nBank advances\n—\n71\n—\n(71)\nTotal bank credit facilities\n2,860\n372\n68\n2,420\nAccounts receivable securitization\n1,050\n800\n—\n250\nTotal\n3,910\n1,172\n68\n2,670\nIn addition to the sources of available liquidity noted above, we held $1,465 million of marketable securities in publicly-traded companies as at December 31, 2017 (December 31, 2016 - $1,047 million).\nWeighted average cost of borrowings\nOur borrowings had a weighted average cost of 4.70% as at December 31, 2017 (December 31, 2016 - 4.72%) and a weighted average term to maturity of 9.9 years (December 31, 2016 - 10.6 years).\nBelow is a summary of the credit ratings on RCI's outstanding senior notes and debentures (long-term) and US CP (short-term) as at December 31, 2017.\nIssuance\nStandard & Poor's\nMoody's\nFitch\nCorporate credit issuer default rating 1\nBBB+ with a stable outlook\nBaa1 with a stable outlook\nBBB+ with a stable outlook\nSenior unsecured debt 1\nBBB+ with a stable outlook\nBaa1 with a stable outlook\nBBB+ with a stable outlook\nUS commercial paper 1\nA-2\nP-2\nN/A 2\n1\nUnchanged in the quarter.\n2\nWe did not seek a rating from Fitch for our short-term obligations in 2017.\nFinancial Risk Management\nThis section should be read in conjunction with \"Financial Risk Management\" in our 2016 Annual MD&A. We use derivative instruments to manage financial risks related to our business activities. We only use derivatives to manage risk and not for speculative purposes. We also manage our exposure to both fixed and fluctuating interest rates and had fixed the interest rate on 89.5% of our outstanding debt, including short-term borrowings, as at December 31, 2017 (December 31, 2016 - 91.2%).\nDebt derivatives\nWe use cross-currency interest exchange agreements (debt derivatives) to manage risks from fluctuations in foreign exchange rates associated with our US dollar-denominated senior notes and debentures, credit facility borrowings, and US CP borrowings. We designate the debt derivatives related to our senior notes and debentures as hedges for accounting purposes against the foreign exchange risk associated with specific debt instruments. Debt derivatives related to our credit facility and US CP borrowings have not been designated as hedges for accounting purposes.\nBelow is a summary of the debt derivatives we entered into and settled related to our credit facility borrowings and US CP program during the three and twelve months ended December 31, 2017 and 2016.\nThree months ended\nDecember 31, 2017\nTwelve months ended\nDecember 31, 2017\n(In millions of dollars, except exchange rates)\nNotional\n(US$)\nExchange rate\nNotional\n(Cdn$)\nNotional\n(US$)\nExchange\nrate\nNotional\n(Cdn$)\nCredit facilities\nDebt derivatives entered\n100\n1.25\n125\n1,610\n1.32\n2,126\nDebt derivatives settled\n100\n1.25\n125\n1,760\n1.32\n2,327\nNet cash received (paid)\n4\n(17)\nCommercial paper program\nDebt derivatives entered\n2,140\n1.28\n2,732\n8,266\n1.30\n10,711\nDebt derivatives settled\n1,955\n1.28\n2,500\n7,521\n1.29\n9,692\nNet cash received (paid)\n36\n(62)\nThree months ended\nDecember 31, 2016\nTwelve months ended\nDecember 31, 2016\n(In millions of dollars, except exchange rates)\nNotional\n(US$)\nExchange rate\nNotional (Cdn$)\nNotional\n(US$)\nExchange\nrate\nNotional\n(Cdn$)\nCredit facilities\nDebt derivatives entered\n1,947\n1.33\n2,583\n8,683\n1.31\n11,360\nDebt derivatives settled\n2,558\n1.32\n3,385\n8,533\n1.31\n11,159\nNet cash received\n25\n8\nAs at December 31, 2017, we had nil and US$746 million of debt derivatives outstanding relating to our credit facility borrowings and US CP program (December 31, 2016 - US$150 million and nil), respectively.\nSenior notes\nDuring this quarter, we did not enter into or settle any debt derivatives related to senior notes.\nBond forwards\nDuring this quarter, we did not enter into or settle any bond forwards.\nOn November 4, 2016, we exercised a $500 million notional bond forward due January 4, 2017 in relation to the issuance of the US$500 million senior notes due 2026 and paid $53 million to settle the derivative. The amount paid represents the fair value of the bond forward at the time of settlement and will be reclassified into finance costs from the hedging reserve using the effective interest rate method over the life of the US$500 million senior notes due 2026.\nExpenditure derivatives\nBelow is a summary of the expenditure derivatives we entered into and settled during the three and twelve months ended December 31, 2017 and 2016.\nThree months ended December 31, 2017\nTwelve months ended December 31, 2017\n(In millions of dollars, except exchange rates)\nNotional\n(US$)\nExchange rate\nNotional\n(Cdn$)\nNotional\n(US$)\nExchange\nrate\nNotional\n(Cdn$)\nExpenditure derivatives entered\n—\n—\n—\n840\n1.27\n1,070\nExpenditure derivatives settled\n225\n1.33\n300\n930\n1.33\n1,240\nThree months ended December 31, 2016\nTwelve months ended December 31, 2016\n(In millions of dollars, except exchange rates)\nNotional\n(US$)\nExchange rate\nNotional\n(Cdn$)\nNotional\n(US$)\nExchange\nrate\nNotional\n(Cdn$)\nExpenditure derivatives entered\n240\n1.32\n316\n990\n1.33\n1,318\nExpenditure derivatives settled\n210\n1.21\n255\n840\n1.22\n1,025\nAs at December 31, 2017, we had US$1,200 million of expenditure derivatives outstanding (December 31, 2016 - US$1,290 million) with terms to maturity ranging from January 2018 to December 2019 (December 31, 2016 - January 2017 to December 2018), at an average rate of $1.28/US$ (December 31, 2016 - $1.32/US$).\nSee \"Mark-to-market value\" for more information about our expenditure derivatives.\nEquity derivatives\nAs at December 31, 2017, we had equity derivatives outstanding for 5.4 million (December 31, 2016 - 5.4 million) RCI Class B shares with a weighted average price of $51.44 (December 31, 2016 - $50.30).\nWe did not enter into or settle any equity derivatives during the quarter. We have executed extension agreements for the remaining equity derivative contracts under substantially the same terms and conditions with revised expiry dates to April 2018 (from April 2017).\nSee \"Mark-to-market value\" for more information about our equity derivatives.\nMark-to-market value\nWe record our derivatives using an estimated credit-adjusted, mark-to-market valuation, calculated in accordance with IFRS.\nAs at December 31, 2017\n(In millions of dollars, except exchange rates)\nNotional\namount\n(US$)\nExchange\nrate\nNotional\namount\n(Cdn$)\nFair value\n(Cdn$)\nDebt derivatives accounted for as cash flow hedges:\nAs assets\n5,200\n1.0401\n5,409\n1,301\nAs liabilities\n1,500\n1.3388\n2,008\n(149)\nShort-term debt derivatives not accounted for as hedges:\nAs liabilities\n746\n1.2869\n960\n(23)\nNet mark-to-market debt derivative asset\n1,129\nBond forwards accounted for as cash flow hedges:\nAs liabilities\n—\n—\n900\n(64)\nExpenditure derivatives accounted for as cash flow hedges:\nAs assets\n240\n1.2239\n294\n5\nAs liabilities\n960\n1.2953\n1,243\n(44)\nNet mark-to-market expenditure derivative liability\n(39)\nEquity derivatives not accounted for as hedges:\nAs assets\n—\n—\n276\n68\nNet mark-to-market asset\n1,094\nAs at December 31, 2016\n(In millions of dollars, except exchange rates)\nNotional\namount\n(US$)\nExchange\nrate\nNotional\namount\n(Cdn$)\nFair value\n(Cdn$)\nDebt derivatives accounted for as cash flow hedges:\nAs assets\n5,200\n1.0401\n5,409\n1,751\nAs liabilities\n1,500\n1.3388\n2,008\n(68)\nShort-term debt derivatives not accounted for as hedges:\nAs liabilities\n150\n1.3407\n201\n—\nNet mark-to-market debt derivative asset\n1,683\nBond forwards accounted for as cash flow hedges:\nAs liabilities\n—\n—\n900\n(51)\nExpenditure derivatives accounted for as cash flow hedges:\nAs assets\n990\n1.2967\n1,284\n40\nAs liabilities\n300\n1.4129\n424\n(21)\nNet mark-to-market expenditure derivative asset\n19\nEquity derivatives not accounted for as hedges:\nAs assets\n—\n—\n270\n8\nNet mark-to-market asset\n1,659\nAdjusted net debt and debt leverage ratio\nWe use adjusted net debt and debt leverage ratio to conduct valuation-related analysis and make capital structure-related decisions. Adjusted net debt includes long-term debt, net debt derivative assets or liabilities, short-term borrowings, and cash and cash equivalents or bank advances.\nAs at\nDecember 31\nAs at\nDecember 31\n(In millions of dollars, except ratios)\n2017\n2016\nLong-term debt 1\n14,555\n16,197\nNet debt derivative assets valued without any adjustment for credit risk 2\n(1,146)\n(1,740)\nShort-term borrowings\n1,585\n800\nBank advances\n6\n71\nAdjusted net debt 3\n15,000\n15,328\nDebt leverage ratio 3,4\n2.8\n3.0\n1\nIncludes current and long-term portion of long-term debt before deferred transaction costs and discounts. See \"Reconciliation of adjusted net debt\" in the section \"Non-GAAP Measures\" for the calculation of this amount.\n2\nFor purposes of calculating adjusted net debt and debt leverage ratio, we believe including debt derivatives valued without adjustment for credit risk is commonly used to evaluate debt leverage and for market valuation and transactional purposes.\n3\nAdjusted net debt and debt leverage ratio are non-GAAP measures and should not be considered substitutes or alternatives for GAAP measures. These are not defined terms under IFRS and do not have standard meanings, so may not be a reliable way to compare us to other companies. See \"Non-GAAP Measures\" for information about these measures, including how we calculate them.\n4\nDebt leverage ratio is measured using adjusted operating profit for the last twelve consecutive months.\nIn addition, we held $1,465 million of marketable securities in publicly-traded companies as at December 31, 2017 (December 31, 2016 - $1,047 million).\nOur adjusted net debt decreased by $328 million from December 31, 2016 primarily as a result of a decrease in our outstanding long-term debt, partially offset by an increase in our short-term borrowings and reduction in the fair value of our net debt derivative asset.\nOutstanding common shares\nAs at\nDecember 31\nAs at\nDecember 31\n2017\n2016\nCommon shares outstanding 1\nClass A Voting\n112,407,192\n112,411,992\nClass B Non-Voting\n402,403,433\n402,396,133\nTotal common shares\n514,810,625\n514,808,125\nOptions to purchase Class B Non-Voting shares\nOutstanding options\n2,637,890\n3,732,524\nOutstanding options exercisable\n924,562\n1,770,784\n1\nHolders of our Class B Non-Voting shares are entitled to receive notice of and to attend shareholder meetings; however, they are not entitled to vote at these meetings except as required by law or stipulated by stock exchanges. If an offer is made to purchase outstanding Class A Voting shares, there is no requirement under applicable law or our constating documents that an offer be made for the outstanding Class B Non-Voting shares, and there is no other protection available to shareholders under our constating documents. If an offer is made to purchase both classes of shares, the offer for the Class A Voting shares may be made on different terms than the offer for the Class B Non-Voting shares.\nKey Performance Indicators\nWe measure the success of our strategy using a number of key performance indicators that are defined and discussed in our 2016 Annual MD&A and this earnings release. We believe these key performance indicators allow us to appropriately measure our performance against our operating strategy as well as against the results of our peers and competitors. The following key performance indicators are not measurements in accordance with IFRS and should not be considered an alternative to net income or any other measure of performance under IFRS. They include:\nSubscriber counts; Subscriber churn (churn); Postpaid average revenue per account (ARPA); Blended average revenue per user (ARPU); Capital intensity; and Total service revenue.\nNon-GAAP Measures\nWe use the following non-GAAP measures. These are reviewed regularly by management and our Board in assessing our performance and making decisions regarding the ongoing operations of our business and its ability to generate cash flows. Some or all of these measures may also be used by investors, lending institutions, and credit rating agencies as indicators of our operating performance, of our ability to incur and service debt, and as measurements to value companies in the telecommunications sector. These are not recognized measures under GAAP and do not have standard meanings under IFRS, so may not be reliable ways to compare us to other companies.\nEffective January 1, 2018, we will commence using adjusted EBITDA as the key measure of profit for the purpose of assessing performance for each segment and to make decisions about the allocation of resources. As such, we plan to introduce adjusted EBITDA as a new non-GAAP measures in our financial reports commencing January 1, 2018. This measure will replace our existing adjusted operating profit non-GAAP measure. We believe adjusted EBITDA more fully reflects segment and consolidated profitability. The difference between adjusted operating profit and adjusted EBITDA is that adjusted EBITDA will include stock-based compensation expense. We also believe that our decision-making processes will not be significantly affected through the use of adjusted EBITDA. Additionally, use of this measure will change our current definition of free cash flow.\nNon-GAAP measure\nWhy we use it\nHow we calculate it\nMost\ncomparable\nIFRS financial\nmeasure\nAdjusted\noperating profit\nAdjusted\noperating profit\nmargin\nTo evaluate the performance of our businesses, and when making decisions about the ongoing operations of the business and our ability to generate cash flows.\nWe believe that certain investors and analysts use adjusted operating profit to measure our ability to service debt and to meet other payment obligations.\nWe also use it as one component in determining short-term incentive compensation for all management employees. Adjusted operating profit:\nNet income\nadd (deduct)\nincome tax expense (recovery); other expense (income); finance costs; restructuring, acquisition and other; loss (gain) on disposition of property, plant and equipment; depreciation and amortization; and stock-based compensation.\nAdjusted operating profit margin:\nAdjusted operating profit\ndivided by\nrevenue (service revenue for Wireless).\nNet income\nAdjusted net\nincome\nAdjusted basic\nand diluted\nearnings per\nshare\nTo assess the performance of our businesses before the effects of the noted items, because they affect the comparability of our financial results and could potentially distort the analysis of trends in business performance. Excluding these items does not imply that they are non-recurring. Adjusted net income:\nNet income\nadd (deduct)\nstock-based compensation; restructuring, acquisition and other; loss (recovery) on sale or wind down of investments; loss (gain) on disposition of property, plant and equipment; (gain) on acquisitions; loss on non-controlling interest purchase obligations; loss on repayment of long-term debt; and income tax adjustments on these items, including adjustments as a result of legislative changes.\nAdjusted basic and diluted earnings per share:\nAdjusted net income\ndivided by\nbasic and diluted weighted average shares outstanding.\nNet income\nBasic and\ndiluted\nearnings per\nshare\nFree cash flow\nTo show how much cash we have available to repay debt and reinvest in our company, which is an important indicator of our financial strength and performance.\nWe believe that some investors and analysts use free cash flow to value a business and its underlying assets.\nAdjusted operating profit\ndeduct\nadditions to property, plant and equipment net of proceeds on disposition; interest on borrowings net of capitalized interest; and cash income taxes.\nCash provided\nby operating\nactivities\nAdjusted net\ndebt\nTo conduct valuation-related analysis and make decisions about capital structure.\nWe believe this helps investors and analysts analyze our enterprise and equity value and assess our leverage. Total long-term debt\nadd (deduct)\ncurrent portion of long-term debt; deferred transaction costs and discounts; net debt derivative (assets) liabilities; credit risk adjustment related to net debt derivatives; bank advances (cash and cash equivalents); and short-term borrowings.\nLong-term\ndebt\nAdjusted net\ndebt / adjusted\noperating profit (debt leverage ratio)\nTo conduct valuation-related analysis and make decisions about capital structure.\nWe believe this helps investors and analysts analyze our enterprise and equity value and assess our leverage Adjusted net debt (defined above)\ndivided by\n12-month trailing adjusted operating profit (defined above).\nLong-term debt\ndivided by net\nincome\nReconciliation of adjusted operating profit\nThree months ended December 31\nTwelve months ended December 31\n(In millions of dollars)\n2017\n2016\n2017\n2016\nNet income (loss)\n419\n(9)\n1,711\n835\nAdd (deduct):\nIncome tax expense (recovery)\n158\n(5)\n635\n324\nOther expense (income)\n3\n(4)\n(19)\n191\nFinance costs\n184\n188\n746\n761\nRestructuring, acquisition and other\n31\n518\n152\n644\nGain on disposition of property, plant and equipment\n—\n—\n(49)\n—\nDepreciation and amortization\n531\n555\n2,142\n2,276\nStock-based compensation\n14\n16\n61\n61\nAdjusted operating profit\n1,340\n1,259\n5,379\n5,092\nReconciliation of adjusted operating profit margin\nThree months ended December 31\nTwelve months ended December 31\n(In millions of dollars, except percentages)\n2017\n2016\n2017\n2016\nAdjusted operating profit margin:\nAdjusted operating profit\n1,340\n1,259\n5,379\n5,092\nDivided by: total revenue\n3,632\n3,510\n14,143\n13,702\nAdjusted operating profit margin\n36.9%\n35.9%\n38.0%\n37.2%\nReconciliation of adjusted net income\nThree months ended December 31\nTwelve months ended December 31\n(In millions of dollars)\n2017\n2016\n2017\n2016\nNet income (loss)\n419\n(9)\n1,711\n835\nAdd (deduct):\nStock-based compensation\n14\n16\n61\n61\nRestructuring, acquisition and other\n31\n518\n152\n644\nNet loss on divestitures pertaining to investments\n—\n—\n—\n11\n(Recovery) loss on wind down of shomi\n—\n—\n(20)\n140\nGain on disposition of property, plant and equipment\n—\n—\n(49)\n—\nIncome tax impact of above items\n(11)\n(143)\n(36)\n(213)\nIncome tax adjustment, legislative tax change\n2\n—\n2\n3\nAdjusted net income\n455\n382\n1,821\n1,481\nReconciliation of adjusted earnings per share\n(In millions of dollars, except per share amounts; number of\nshares outstanding in millions)\nThree months ended December 31\nTwelve months ended December 31\n2017\n2016\n2017\n2016\nAdjusted basic earnings per share:\nAdjusted net income\n455\n382\n1,821\n1,481\nDivided by:\nWeighted average number of shares outstanding\n515\n515\n515\n515\nAdjusted basic earnings per share\n$0.88\n$0.74\n$3.54\n$2.88\nAdjusted diluted earnings per share:\nAdjusted net income\n455\n382\n1,821\n1,481\nDivided by:\nDiluted weighted average number of shares outstanding\n517\n517\n517\n517\nAdjusted diluted earnings per share\n$0.88\n$0.74\n$3.52\n$2.86\nReconciliation of free cash flow\nThree months ended December 31\nTwelve months ended December 31\n(In millions of dollars)\n2017\n2016\n2017\n2016\nCash provided by operating activities\n1,142\n1,053\n3,938\n3,957\nAdd (deduct):\nAdditions to property, plant and equipment, net\n(841)\n(604)\n(2,436)\n(2,352)\nInterest on borrowings, net of capitalized interest\n(179)\n(182)\n(722)\n(740)\nRestructuring, acquisition and other\n31\n518\n152\n644\nImpairment of assets and related onerous contract charges\n—\n(484)\n—\n(484)\nInterest paid\n125\n124\n735\n756\nChange in non-cash operating working capital items\n15\n18\n154\n(14)\nOther adjustments\n(49)\n(51)\n(75)\n(62)\nFree cash flow\n244\n392\n1,746\n1,705\nReconciliation of adjusted net debt and debt leverage ratio\nAs at\nDecember 31\nAs at\nDecember 31\n(In millions of dollars)\n2017\n2016\nCurrent portion of long-term debt\n1,756\n750\nLong-term debt\n12,692\n15,330\nDeferred transaction costs and discounts\n107\n117\n14,555\n16,197\nAdd (deduct):\nNet debt derivative assets\n(1,129)\n(1,683)\nCredit risk adjustment related to net debt derivative assets\n(17)\n(57)\nShort-term borrowings\n1,585\n800\nBank advances\n6\n71\nAdjusted net debt\n15,000\n15,328\nAs at\nDecember 31\nAs at\nDecember 31\n(In millions of dollars, except ratios)\n2017\n2016\nDebt leverage ratio\nAdjusted net debt\n15,000\n15,328\nDivided by: trailing 12-month adjusted operating profit\n5,379\n5,092\nDebt leverage ratio\n2.8\n3.0\nReconciliation of EBITDA and adjusted EBITDA (with respect to \"2018 Outlook\")\nTwelve months ended December 31\n(In millions of dollars)\n2017\n2016\n% Chg\nNet income\n1,711\n835\n105\nAdd:\nIncome tax expense\n635\n324\n96\nFinance costs\n746\n761\n(2)\nDepreciation and amortization\n2,142\n2,276\n(6)\nEBITDA\n5,234\n4,196\n25\nAdd (deduct):\nOther (income) expense\n(19)\n191\nn/m\nRestructuring, acquisition and other\n152\n644\n(76)\nGain on disposition of property, plant and equipment\n(49)\n—\nn/m\nAdjusted EBITDA\n5,318\n5,031\n6\nAdd:\nStock-based compensation\n61\n61\n—\nAdjusted operating profit\n5,379\n5,092\n6\nReconciliation of free cash flow (with respect to \"2018 Outlook\")\nTwelve months ended December 31\n(In millions of dollars)\n2017\n2016\n% Chg\nFree cash flow as reported\n1,746\n1,705\n2\nLess: Stock-based compensation\n61\n61\n—\nFree cash flow calculated with adjusted EBITDA\n1,685\n1,644\n2\nOther Information\nConsolidated financial results - quarterly summary\nBelow is a summary of our consolidated results for the past eight quarters.\n2017\n2016\n(In millions of dollars, except per share amounts)\nQ4\nQ3\nQ2\nQ1\nQ4\nQ3\nQ2\nQ1\nRevenue\nWireless\n2,189\n2,138\n2,048\n1,968\n2,058\n2,037\n1,931\n1,890\nCable\n871\n870\n870\n855\n858\n865\n870\n856\nBusiness Solutions\n99\n97\n96\n95\n96\n95\n97\n96\nMedia\n526\n516\n637\n474\n550\n533\n615\n448\nCorporate items and intercompany eliminations\n(53)\n(40)\n(59)\n(54)\n(52)\n(38)\n(58)\n(45)\nTotal revenue\n3,632\n3,581\n3,592\n3,338\n3,510\n3,492\n3,455\n3,245\nTotal service revenue 1\n3,430\n3,450\n3,466\n3,214\n3,306\n3,328\n3,308\n3,085\nAdjusted operating profit (loss)\nWireless\n860\n964\n924\n813\n792\n884\n846\n763\nCable\n449\n440\n428\n392\n435\n431\n415\n393\nBusiness Solutions\n32\n33\n32\n31\n30\n31\n31\n31\nMedia\n39\n65\n63\n(28)\n49\n79\n90\n(49)\nCorporate items and intercompany eliminations\n(40)\n(39)\n(37)\n(42)\n(47)\n(40)\n(35)\n(37)\nAdjusted operating profit 2\n1,340\n1,463\n1,410\n1,166\n1,259\n1,385\n1,347\n1,101\nDeduct (add):\nStock-based compensation\n14\n15\n19\n13\n16\n18\n15\n12\nDepreciation and amortization\n531\n531\n535\n545\n555\n575\n572\n574\nGain on disposition of property, plant and equipment\n—\n—\n(49)\n—\n—\n—\n—\n—\nRestructuring, acquisition and other\n31\n59\n34\n28\n518\n55\n27\n44\nFinance costs\n184\n183\n189\n190\n188\n188\n189\n196\nOther expense (income)\n3\n20\n(31)\n(11)\n(4)\n220\n9\n(34)\nNet income (loss) before income tax expense (recovery)\n577\n655\n713\n401\n(14)\n329\n535\n309\nIncome tax expense (recovery)\n158\n188\n182\n107\n(5)\n109\n141\n79\nNet income (loss)\n419\n467\n531\n294\n(9)\n220\n394\n230\nEarnings (loss) per share:\nBasic\n$0.81\n$0.91\n$1.03\n$0.57\n($0.02)\n$0.43\n$0.77\n$0.45\nDiluted\n$0.81\n$0.91\n$1.03\n$0.57\n($0.04)\n$0.43\n$0.76\n$0.44\nNet income (loss)\n419\n467\n531\n294\n(9)\n220\n394\n230\nAdd (deduct):\nStock-based compensation\n14\n15\n19\n13\n16\n18\n15\n12\nRestructuring, acquisition and other\n31\n59\n34\n28\n518\n55\n27\n44\n(Recovery) loss on wind down of shomi\n—\n—\n(20)\n—\n—\n140\n—\n—\nNet loss (gain) on divestitures pertaining to investments\n—\n—\n—\n—\n—\n50\n—\n(39)\nGain on disposition of property, plant and equipment\n—\n—\n(49)\n—\n—\n—\n—\n—\nIncome tax impact of above items\n(11)\n(18)\n(1)\n(6)\n(143)\n(56)\n(9)\n(5)\nIncome tax adjustment, legislative tax change\n2\n—\n—\n—\n—\n—\n—\n3\nAdjusted net income 2\n455\n523\n514\n329\n382\n427\n427\n245\nAdjusted earnings per share 2 :\nBasic\n$0.88\n$1.02\n$1.00\n$0.64\n$0.74\n$0.83\n$0.83\n$0.48\nDiluted\n$0.88\n$1.01\n$1.00\n$0.64\n$0.74\n$0.83\n$0.83\n$0.47\nAdditions to property, plant and equipment, net\n841\n658\n451\n486\n604\n549\n647\n552\nCash provided by operating activities\n1,142\n1,377\n823\n596\n1,053\n1,185\n1,121\n598\nFree cash flow 2\n244\n538\n626\n338\n392\n598\n495\n220\n1\nAs defined. See \"Key Performance Indicators\".\n2\nAdjusted operating profit, adjusted net income, adjusted basic and diluted earnings per share, and free cash flow are non-GAAP measures and should not be considered substitutes or alternatives for GAAP measures. These are not defined terms under IFRS and do not have standard meanings, so may not be a reliable way to compare us to other companies. See \"Non-GAAP Measures\" for information about these measures, including how we calculate them.\nSupplementary Information\nRogers Communications Inc.\nInterim Condensed Consolidated Statements of Income\n(In millions of dollars, except for per share amounts, unaudited)\nThree months ended December 31\nTwelve months ended December 31\n2017\n2016\n2017\n2016\nRevenue\n3,632\n3,510\n14,143\n13,702\nOperating expenses:\nOperating costs\n2,306\n2,267\n8,825\n8,671\nDepreciation and amortization\n531\n555\n2,142\n2,276\nGain on disposition of property, plant and equipment\n—\n—\n(49)\n—\nRestructuring, acquisition and other\n31\n518\n152\n644\nFinance costs\n184\n188\n746\n761\nOther expense (income)\n3\n(4)\n(19)\n191\nIncome (loss) before income tax expense (recovery)\n577\n(14)\n2,346\n1,159\nIncome tax expense (recovery)\n158\n(5)\n635\n324\nNet income (loss) for the period\n419\n(9)\n1,711\n835\nEarnings (loss) per share:\nBasic\n$0.81\n($0.02)\n$3.32\n$1.62\nDiluted\n$0.81\n($0.04)\n$3.31\n$1.62\nRogers Communications Inc.\nInterim Condensed Consolidated Statements of Financial Position\n(In millions of dollars, unaudited)\nAs at\nDecember 31\nAs at\nDecember 31\n2017\n2016\nAssets\nCurrent assets:\nAccounts receivable\n2,041\n1,949\nInventories\n313\n315\nOther current assets\n197\n215\nCurrent portion of derivative instruments\n421\n91\nTotal current assets\n2,972\n2,570\nProperty, plant and equipment\n11,143\n10,749\nIntangible assets\n7,244\n7,130\nInvestments\n2,561\n2,174\nDerivative instruments\n953\n1,708\nOther long-term assets\n82\n98\nDeferred tax assets\n3\n8\nGoodwill\n3,905\n3,905\nTotal assets\n28,863\n28,342\nLiabilities and shareholders' equity\nCurrent liabilities:\nBank advances\n6\n71\nShort-term borrowings\n1,585\n800\nAccounts payable and accrued liabilities\n2,931\n2,783\nIncome tax payable\n62\n186\nCurrent portion of provisions\n4\n134\nUnearned revenue\n346\n367\nCurrent portion of long-term debt\n1,756\n750\nCurrent portion of derivative instruments\n133\n22\nTotal current liabilities\n6,823\n5,113\nProvisions\n35\n33\nLong-term debt\n12,692\n15,330\nDerivative instruments\n147\n118\nOther long-term liabilities\n613\n562\nDeferred tax liabilities\n2,206\n1,917\nTotal liabilities\n22,516\n23,073\nShareholders' equity\n6,347\n5,269\nTotal liabilities and shareholders' equity\n28,863\n28,342\nRogers Communications Inc.\nInterim Condensed Consolidated Statements of Cash Flows\n(In millions of dollars, unaudited)\nThree months ended December 31\nTwelve months ended December 31\n2017\n2016\n2017\n2016\nOperating activities:\nNet income (loss) for the period\n419\n(9)\n1,711\n835\nAdjustments to reconcile net income to cash provided by operating activities:\nDepreciation and amortization\n531\n555\n2,142\n2,276\nProgram rights amortization\n15\n17\n64\n71\nFinance costs\n184\n188\n746\n761\nIncome tax expense (recovery)\n158\n(5)\n635\n324\nStock-based compensation\n14\n16\n61\n61\nPost-employment benefits contributions, net of expense\n28\n28\n4\n(3)\nNet loss on divestitures pertaining to investments\n—\n—\n—\n11\nGain on disposition of property, plant and equipment\n—\n—\n(49)\n—\n(Recovery) loss on wind down of shomi\n—\n—\n(20)\n140\nImpairment of assets and related onerous contract charges\n—\n484\n—\n484\nOther\n9\n2\n8\n34\nCash provided by operating activities before changes in non-cash working\ncapital items, income taxes paid, and interest paid\n1,358\n1,276\n5,302\n4,994\nChange in non-cash operating working capital items\n(15)\n(18)\n(154)\n14\nCash provided by operating activities before income taxes paid and interest\npaid\n1,343\n1,258\n5,148\n5,008\nIncome taxes paid\n(76)\n(81)\n(475)\n(295)\nInterest paid\n(125)\n(124)\n(735)\n(756)\nCash provided by operating activities\n1,142\n1,053\n3,938\n3,957\nInvesting activities:\nAdditions to property, plant and equipment, net\n(841)\n(604)\n(2,436)\n(2,352)\nAdditions to program rights\n(21)\n(3)\n(59)\n(46)\nChanges in non-cash working capital related to property, plant and equipment\nand intangible assets\n101\n44\n109\n(103)\nAcquisitions and other strategic transactions, net of cash acquired\n—\n—\n(184)\n—\nOther\n21\n49\n(60)\n45\nCash used in investing activities\n(740)\n(514)\n(2,630)\n(2,456)\nFinancing activities:\nNet (repayment of) proceeds received on short-term borrowings\n(163)\n(250)\n858\n—\nNet repayment of long-term debt\n(3)\n(57)\n(1,034)\n(538)\nNet proceeds (payments) on settlement of debt derivatives and forward contracts\n40\n(28)\n(79)\n(45)\nTransaction costs incurred\n—\n(17)\n—\n(17)\nDividends paid\n(247)\n(247)\n(988)\n(988)\nOther\n—\n—\n—\n5\nCash used in financing activities\n(373)\n(599)\n(1,243)\n(1,583)\nChange in cash and cash equivalents\n29\n(60)\n65\n(82)\n(Bank advances) cash and cash equivalents, beginning of period\n(35)\n(11)\n(71)\n11\nBank advances, end of period\n(6)\n(71)\n(6)\n(71)\nInvestments\nAs at\nDecember 31\nAs at\nDecember 31\n(In millions of dollars)\n2017\n2016\nInvestments in:\nPublicly traded companies\n1,465\n1,047\nPrivate companies\n167\n169\nInvestments, available-for-sale\n1,632\n1,216\nInvestments, associates and joint ventures\n929\n958\nTotal investments\n2,561\n2,174\nLong-Term Debt\nPrincipal\namount\nInterest\nrate\nAs at\nDecember 31\nAs at\nDecember 31\n(In millions of dollars, except interest rates)\nDue date\n2017\n2016\nBank credit facilities\nFloating\n—\n100\nBank credit facilities\nUS\nrevolving\nFloating\n—\n201\nSenior notes\n2017\n250\nFloating\n—\n250\nSenior notes\n2017\n500\n3.000%\n—\n500\nSenior notes\n2018\nUS\n1,400\n6.800%\n1,756\n1,880\nSenior notes\n2019\n400\n2.800%\n400\n400\nSenior notes\n2019\n500\n5.380%\n500\n500\nSenior notes\n2020\n900\n4.700%\n900\n900\nSenior notes\n2021\n1,450\n5.340%\n1,450\n1,450\nSenior notes\n2022\n600\n4.000%\n600\n600\nSenior notes\n2023\nUS\n500\n3.000%\n627\n671\nSenior notes\n2023\nUS\n850\n4.100%\n1,066\n1,141\nSenior notes\n2024\n600\n4.000%\n600\n600\nSenior notes\n2025\nUS\n700\n3.625%\n878\n940\nSenior notes\n2026\nUS\n500\n2.900%\n627\n671\nSenior debentures 1\n2032\nUS\n200\n8.750%\n251\n269\nSenior notes\n2038\nUS\n350\n7.500%\n439\n470\nSenior notes\n2039\n500\n6.680%\n500\n500\nSenior notes\n2040\n800\n6.110%\n800\n800\nSenior notes\n2041\n400\n6.560%\n400\n400\nSenior notes\n2043\nUS\n500\n4.500%\n627\n671\nSenior notes\n2043\nUS\n650\n5.450%\n816\n873\nSenior notes\n2044\nUS\n1,050\n5.000%\n1,318\n1,410\n14,555\n16,197\nDeferred transaction costs and discounts\n(107)\n(117)\nLess current portion\n(1,756)\n(750)\nTotal long-term debt\n12,692\n15,330\n1 Senior debentures originally issued by Rogers Cable Inc. which are unsecured obligations of RCI and for which RCCI was an unsecured guarantor as at December 31, 2017 and 2016.\nAbout Forward-Looking Information\nThis earnings release includes \"forward-looking information\" and \" \" within the meaning of applicable securities laws (collectively, \"forward-looking information\"), and assumptions about, among other things, our business, operations, and financial performance and condition approved by our management on the date of this earnings release. This forward-looking information and these assumptions include, but are not limited to, statements about our objectives and strategies to achieve those objectives, and about our beliefs, plans, expectations, anticipations, estimates, or intentions.\nForward-looking information:\ntypically includes words like could, expect, may, anticipate, assume, believe, intend, estimate, plan, project, guidance, outlook, target, and similar expressions, although not all forward-looking information includes them; includes conclusions, forecasts, and projections that are based on our current objectives and strategies and on estimates, expectations, assumptions, and other factors, most of which are confidential and proprietary and that we believe to have been reasonable at the time they were applied but may prove to be incorrect; and was approved by our management on the date of this earnings release.\nOur forward-looking information includes forecasts and projections related to the following items, some of which are non-GAAP measures (see \"Non-GAAP Measures\"), among others:\nrevenue; adjusted operating profit; additions to property, plant and equipment, net; cash income tax payments; free cash flow; dividend payments; the growth of new products and services; expected growth in subscribers and the services to which they subscribe; the cost of acquiring and retaining subscribers and deployment of new services; continued cost reductions and efficiency improvements; and all other statements that are not historical facts.\nSpecific forward-looking information included or incorporated in this document includes, but is not limited to, our information and statements under \"2018 Outlook\" relating to our 2018 consolidated guidance on revenue, adjusted EBITDA, additions to property, plant and equipment, net, and free cash flow. All other statements that are not historical facts are .\nWe base our conclusions, forecasts, and projections on the following factors, among others:\ngeneral economic and industry growth rates; currency exchange rates and interest rates; product pricing levels and competitive intensity; subscriber growth; pricing, usage, and churn rates; changes in government regulation; technology deployment; availability of devices; timing of new product launches; content and equipment costs; the integration of acquisitions; and industry structure and stability.\nExcept as otherwise indicated, this earnings release and our forward-looking information do not reflect the potential impact of any non-recurring or other special items or of any dispositions, monetizations, mergers, acquisitions, other business combinations, or other transactions that may be considered or announced or may occur after the date on which the statement containing the forward-looking information is made.\nRisks and uncertainties\nActual events and results can be substantially different from what is expressed or implied by forward-looking information as a result of risks, uncertainties, and other factors, many of which are beyond our control, including, but not limited to:\nregulatory changes; technological changes; economic conditions; unanticipated changes in content or equipment costs; changing conditions in the entertainment, information, and communications industries; the integration of acquisitions; litigation and tax matters; the level of competitive intensity; the emergence of new opportunities; and new interpretations and new accounting standards from accounting standards bodies.\nThese factors can also affect our objectives, strategies, and intentions. Many of these factors are beyond our control or our current expectations or knowledge. Should one or more of these risks, uncertainties, or other factors materialize, our objectives, strategies, or intentions change, or any other factors or assumptions underlying the forward-looking information prove incorrect, our actual results and our plans could vary significantly from what we currently foresee.\nAccordingly, we warn investors to exercise caution when considering statements containing forward-looking information and caution them that it would be unreasonable to rely on such statements as creating legal rights regarding our future results or plans. We are under no obligation (and we expressly disclaim any such obligation) to update or alter any statements containing forward-looking information or the factors or assumptions underlying them, whether as a result of new information, future events, or otherwise, except as required by law. All of the forward-looking information in this earnings release is qualified by the cautionary statements herein.\nKey assumptions underlying our 2018 guidance\nOur 2018 guidance ranges under \"2018 Outlook\" are based on many assumptions including, but not limited to, the following material assumptions for the full-year 2018:\ncontinued intense competition in all segments in which we operate, consistent with our experience during the full-year 2017; a substantial portion of our US dollar-denominated expenditures for 2018 is hedged at an average exchange rate of $1.30/US$; key interest rates remain relatively stable throughout 2018; no significant additional legal or regulatory developments, shifts in economic conditions, or macro changes in the competitive environment affecting our business activities. We note that regulatory decisions expected during 2018 could materially alter underlying assumptions around our 2018 Wireless, Cable, and/or Media results in the current and future years, the impacts of which are currently unknown and not factored into our guidance; Wireless customers continue to adopt, and upgrade to, higher-value smartphones at similar rates in 2018 compared to 2017 and a similar proportion of customers remain on term contracts; overall wireless market penetration in Canada grows in 2018 at a similar rate as in 2017; our relative market share in Wireless and Cable is not negatively impacted by changing competitive dynamics; continued subscriber growth in Wireless and Cable Internet; a decline in Cable Television subscribers; and a relatively stable Phone subscriber base; Ignite TV launches in 2018; in Media, continued growth in sports and declines in our traditional media businesses, including our print publishing offerings; and with respect to the increase in net additions to property, plant and equipment: we continue to invest appropriately to ensure we have competitive wireless and cable networks through (i) building a 4.5G to 5G wireless network and (ii) upgrading our hybrid fibre-coaxial network to lower the number of homes passed per node, utilize the latest technologies, and deliver an even more reliable customer experience; and we continue to make expenditures related to the launch of Ignite TV in 2018.\nBefore making an investment decision\nBefore making any investment decisions and for a detailed discussion of the risks, uncertainties, and environment associated with our business, fully review the sections in our 2016 Annual MD&A entitled \"Regulation in Our Industry\" and \"Governance and Risk Management\", as well as our various other filings with Canadian and US securities regulators, which can be found at sedar.com and sec.gov , respectively. Information on or connected to our website is not part of or incorporated into this earnings release.\nSOURCE Rogers Communications Canada Inc. - English", "external_links": [], "published": "2018-01-25T15:00:00.000+02:00", "crawled": "2018-01-25T16:26:34.005+02:00", "highlightTitle": ""}