{"organizations": [], "uuid": "7fb7089e19ec9712d955c8b788a0f275c99149f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 115}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/03/09/103456299-RTSA1TM.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/expedia-is-planting-seeds-for-faster-growth-in-overseas-hotels-morgan-stanley-upgrades.html", "country": "US", "domain_rank": 767, "title": "Expedia is 'planting seeds for faster growth' in overseas hotels, Morgan Stanley upgrades", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-11T16:05:00.000+02:00", "replies_count": 0, "uuid": "7fb7089e19ec9712d955c8b788a0f275c99149f7"}, "author": "Thomas Franck", "url": "https://www.cnbc.com/2018/01/11/expedia-is-planting-seeds-for-faster-growth-in-overseas-hotels-morgan-stanley-upgrades.html", "ord_in_thread": 0, "title": "Expedia is 'planting seeds for faster growth' in overseas hotels, Morgan Stanley upgrades", "locations": [], "entities": {"persons": [{"name": "brian nowak", "sentiment": "none"}, {"name": "fabrizio bensch", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "expedia", "sentiment": "negative"}, {"name": "morgan stanley", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fabrizio Bensch | Retuers Visitors browse at the display of Expedia during the International Tourism Trade Fair in Berlin. \nExpedia is \"planting seeds for faster growth,\" snapping up international hotels in Europe and Asia as a way to boost profits, according to one Wall Street firm. \nMorgan Stanley upgraded shares of Expedia to overweight, arguing that the company's focus on expanding its overseas properties beyond the largest hotels should offer a better selection of lodging choices. \nAnd that, coupled with Expedia's online travel platform, could spell upside for investors, according to analyst Brian Nowak. \n\"We are bullish about Expedia's recent strategic investments to increase its global property supply,\" Nowak wrote in a note Wednesday. \"We are particularly positive on Expedia's more refined hotel supply strategy given we believe Expedia's non-vacation rental supply count is still roughly 50 percent of Priceline's ... and increased selection should lead to higher conversion and an increased ability to bid on Google keywords to drive traffic and user growth.\" \nThe analyst's $160 price target is 26 percent higher than Wednesday's closing price. Shares of Expedia gained 1.7 percent Thursday. They have risen 8.3 percent during the past 12 months. \nNowak also highlighted Expedia's HomeAway platform, a purchase the company made in 2015 to capitalize on the budding vacation rental industry, previously dominated by Airbnb. \n\"HomeAway is making progress on integrating more supply onto the Expedia platform (95k listings) and increasing its supply of instantly bookable properties (500k listings),\" Nowak said. \"We see Expedia.com/Hotels.com's leading offering of hotel and alternative accommodation offering as being well positioned to drive the online travel and online alternative accommodation space.\" \nAccording to the analyst's modeling, HomeAway should generate 27 percent room night growth — a key industry metric — in 2018. \nThough the analyst cautioned that 2018 is an \"investment year,\" he did argue that the company could see pretax earnings climb 9 percent and 16 percent in 2018 and 2019, respectively. \n—CNBC's Michael Bloom contributed to this report.", "external_links": [], "published": "2018-01-11T16:05:00.000+02:00", "crawled": "2018-01-11T16:12:24.011+02:00", "highlightTitle": ""}