{"organizations": [], "uuid": "328bffaa431d935c4089f82a3775545476441c9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-stellar-biotechnologies-appoints-pharma-licensing-expert-to-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Stellar Biotechnologies Appoints Pharma Licensing Expert to Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T16:30:00.000+02:00", "replies_count": 0, "uuid": "328bffaa431d935c4089f82a3775545476441c9c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-stellar-biotechnologies-appoints-pharma-licensing-expert-to-board-of-directors.html", "ord_in_thread": 0, "title": "Stellar Biotechnologies Appoints Pharma Licensing Expert to Board of Directors", "locations": [], "entities": {"persons": [{"name": "frank oakes", "sentiment": "none"}, {"name": "deborah", "sentiment": "none"}, {"name": "deborah f. aghib", "sentiment": "none"}, {"name": "aghib", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "klh", "sentiment": "none"}], "organizations": [{"name": "stellar biotechnologies, inc.", "sentiment": "neutral"}, {"name": "stellar board", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 25, 2018 /PRNewswire/ -- Stellar Biotechnologies, Inc. (Nasdaq: SBOT), a leading manufacturer of a key protein utilized in multiple immunotherapy development pipelines targeting Alzheimer's, diabetes, lupus and cancers, among other diseases, today announced the appointment of Deborah F. Aghib, Ph.D. to the company's Board of Directors.\n\"Deborah will bring to the company significant international experience in developing technology licensing and business development strategies for life science companies as well as an in-depth understanding of the KLH business. I'm confident she will be a strong addition to the Stellar Board,\" said Frank Oakes, Stellar's Chairman, President and Chief Executive Officer.\n\"It is my pleasure to join Stellar's Board of Directors. I have watched Stellar grow its capabilities over the years, and I am looking forward as a member of the Board to guiding the company as it approaches some exciting inflection points in the KLH market,\" said Dr. Aghib.\nDr. Aghib has more than 24 years of executive and consulting experience for biotechnology and healthcare-related companies and organizations. She is currently an advisor to the management for a number of life science companies for business and corporate development, including CellPly, BrainDTech, Sanipedia and Neuro-Zone. Previously, she was a private equity consultant for CRG LP, a healthcare-focused investment firm, and a business development and strategy consultant for Numerate, Theravance and Stellar. In addition to her professional roles, Dr. Aghib serves on the Advisory Board of Open Common Consortium, a cloud computing and data commons infrastructure that supports cancer medical research from the University of Chicago. She holds a Ph.D. in Molecular and Cellular Biology from the University of Milan and a Ph.D. in Human Genetics from the University of Pavia.\nAbout Stellar Biotechnologies\nStellar Biotechnologies, Inc. (Nasdaq: SBOT) is the leader in sustainable manufacture of Keyhole Limpet Hemocyanin (KLH) , an important immune-stimulating protein used in wide-ranging therapeutic and diagnostic markets. KLH is both a key pharmaceutical ingredient in many new immunotherapies (targeting cancer, immune disorders, Alzheimer's and inflammatory diseases) as well as a finished product for measuring immune status. Stellar is unique in its proprietary methods, facilities, and KLH technology. The company is committed to meeting the growing demand for commercial-scale supplies of GMP grade KLH, ensuring environmentally sound KLH production, and developing KLH-based active immunotherapies. Stellar KLH is a trademark of Stellar Biotechnologies.\nFollow Stellar: LinkedIn | Twitter | Facebook | Google+\nStellar Forward-Looking Statements\nThis press release may contain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Forward-looking statements may be identified by the use of words such as \"anticipate,\" \"believe,\" \"plan,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"will,\" \"would,\" \"could,\" \"should,\" \"might,\" \"potential,\" or \"continue\" and variations or similar expressions. Readers should not unduly rely on these forward-looking statements, which are not a guarantee of future performance. There can be no assurance that forward-looking statements will prove to be accurate, as all such forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause actual results or future events to differ materially from the forward-looking statements. Such risks include, but may not be limited to: general economic and business conditions; technology changes; competition; changes in strategy or development plans; availability of funds and resources; anticipated requirements for operating capital; governmental regulations and the ability or failure to comply with governmental regulations; changes in trade policy and international law; the timing of Stellar's or its partners' anticipated results, including in connection with clinical trials; the ability to meet the goals of Stellar's joint ventures and strategic partnerships; and other factors referenced in Stellar's filings with securities regulators. For a discussion of further risks and uncertainties related to the Stellar's business, please refer to Stellar's public company reports filed with the U.S. Securities and Exchange Commission and the British Columbia Securities Commission. All forward-looking statements are made as of the date hereof and are subject to change. Except as required by law, Stellar assumes no obligation to update such statements. This press release does not constitute an offer or solicitation of an offer for sale of any securities in any jurisdiction, including the United States.\nView original content: http://www.prnewswire.com/news-releases/stellar-biotechnologies-appoints-pharma-licensing-expert-to-board-of-directors-300587914.html\nSOURCE Stellar Biotechnologies, Inc.", "external_links": ["https://plus.google.com/+StellarBiotech", "https://www.linkedin.com/company/2671646", "http://www.klhsite.com/", "http://www.prnewswire.com/news-releases/stellar-biotechnologies-appoints-pharma-licensing-expert-to-board-of-directors-300587914.html", "http://www.stellarbiotech.com/", "https://www.facebook.com/StellarBiotech", "https://twitter.com/stellarbiotech"], "published": "2018-01-25T16:30:00.000+02:00", "crawled": "2018-01-25T17:18:13.000+02:00", "highlightTitle": ""}