{"organizations": [], "uuid": "9650ad3315618a98c3f356fd4830dbff25b2ddf2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/news/media", "section_title": "Media | Reuters.com", "url": "https://www.reuters.com/article/iran-rallies-strategy/iran-treads-cautiously-as-protests-spread-idUSL4N1OW151", "country": "US", "domain_rank": 408, "title": "Iran treads cautiously as protests spread", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-02T00:13:00.000+02:00", "replies_count": 0, "uuid": "9650ad3315618a98c3f356fd4830dbff25b2ddf2"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/iran-rallies-strategy/iran-treads-cautiously-as-protests-spread-idUSL4N1OW151", "ord_in_thread": 0, "title": "Iran treads cautiously as protests spread", "locations": [], "entities": {"persons": [{"name": "michael georgy dubai", "sentiment": "none"}, {"name": "neda agha-soltan", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Lack of tactics in worst unrest since 2009\n* Spontaneous protests pose serious challenge to state\n* Moderates and hardliners divided over demonstrations\nBy Michael Georgy\nDUBAI, Jan 1 (Reuters) - Iranian authorities are treading cautiously in the face of mass protests, eager to take control but worried a crackdown could plunge the country into a crisis similar to the pro-reform unrest of 2009.\nIn June that year as Iranians seethed across the nation, a video showing protester Neda Agha-Soltan’s last moments after being shot in the chest made her an icon of the opposition movement.\nThis time, Iranian moderates are appealing for caution even though some hardliners are calling for an iron fist to crush one of the gravest threats to Iran’s clerical leaders, who came to power in the 1979 Islamic revolution.\nThose divisions are making it hard for the authorities to defuse spontaneous demonstration, especially as there are no apparent protest leaders who can be identified and rounded up.\nVideos on the internet showed the difficulties the Iranian authorities are facing in controlling the protests, in contrast to 2009 when the opposition had a clear hierarchy.\nFootage carried on several semi-official websites showed men in white hooded coats who were described as the protest leaders. Red arrows on the screen identified them as they led attacks on police and buildings.\nIn 2009, the “Green Movement” accused of stoking months of mass protests had two clear figureheads. Both have been under house arrest since 2011 though neither has been formally charged or appeared in court.\nTEN KILLED The latest unrest began on Thursday when hundreds of people took to the streets of Iran’s second city Mashhad to protest against economic hardships and alleged corruption.\nBut in a rare political challenge, they were soon calling for clerical leaders including the ultimate authority in Iran’s cumbersome system of dual clerical and republican rule - Supreme Leader Ayatollah Ali Khamenei - to step down.\nSince Thursday, tens of thousands of people have taken to the streets across Iran, alarming the government and the clerical leadership.\nTen people were killed during protests on Sunday, state television reported, as unsigned statements posted on social media sites called for new demonstrations in the capital Tehran and 50 other cities.\nIn a ratcheting up of tensions, protesters tried to take over some military bases and police stations but were pushed back by security forces, state TV said without elaborating.\nPresident Hassan Rouhani struck a conciliatory tone as demonstrators widened their targets from police vehicles and banks to seminaries in a direct challenge to the country’s religious establishment.\n“What has happened in the past few days may appear as a threat but we have to turn it into an opportunity and see what the problem is,” ISNA news agency Quote: d Rouhani as saying on Sunday.\nHe even contradicted the usual conspiracy theories that blame Western powers and Israel for Iran’s woes, stressing the need to get to the root causes of the problem.\n“All these people are not getting orders from abroad, and some have gone out to the streets because of their feelings and problems,” he said.\nLawmaker Jorjik Abramian was also measured in his response to growing frustrations with unemployment that hit 28.8 percent last year and alleged graft that prompted some Iranians to describe their government as thieves.\n“The recent events are due to an accumulation of people’s demands that have been ignored,” ILNA news agency Quote: d him as saying. “We must restore the trust of the people in the authorities. If this happens, no foreign agent can carry out his aims in the country.”\nThe 2009 protests following the disputed re-election of hardline President Mahmoud Ahmadinejad were eventually crushed by the state security apparatus, headed by the Islamic Revolutionary Guard Corps (IRGC) and its affiliated Basij militia volunteers.\nILNA said Abramian warned against any “repeat of Kahrizak” -a reference to an infamous detention centre outside Tehran where three detainees were killed and many tortured in 2009, according to human rights campaigners.\nAVOIDING FLASHPOINTS Protesters, for their part, also don’t seem to have a clear plan, other than defying the security forces and even the elite Revolutionary Guards.\nThe security forces may be showing restraint this time to avoid bloodshed that could galvanise and embolden protesters. But that has not stopped leading conservatives calling for tough measures.\n“Those who commit sabotage and spread unrest should be dealt with and dealt with firmly,” judiciary chief Ayatollah Sadeq Larijani said in remarks carried on state television.\nWith few options at hand, some Iranian leaders lashed out again at the United States. A top military official said support for the protesters expressed by U.S. President Trump and other U.S. officials showed Washington had ulterior motives.\n“The involvement of top U.S. leaders along with other states and media outlets ... suggest that America is planning to launch a new sedition in Iran,” armed forces spokesman Masoud Jazayeri, who is also a Revolutionary Guards commander, was Quote: d as saying by the state broadcaster IRIB’s website.\nBut that has failed so far to divert the attention of Iranians away from their problems at home.\nIran’s leaders believe they can count on support from many of the generation that took part in the 1979 revolution because of their ideological commitment and the economic gains they have made under the Islamic government, analysts say.\nBut the growing number of youths taking to the streets suggests the old guard may have to compromise and give in to some of their demands, analysts say.\nReporting by Dubai newsroom; editing by David Clarke\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-02T00:13:00.000+02:00", "crawled": "2018-01-02T05:29:26.033+02:00", "highlightTitle": ""}