{"organizations": [], "uuid": "a6863ed03268c65e999893faa4bbfeb6a0d4c443", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223010562&w=1200&r=LYNXMPEE0H0RP", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-britain-projects-breakingviews/breakingviews-carillion-mess-puts-corbyn-a-step-closer-to-power-idUSKBN1F719G", "country": "US", "domain_rank": 408, "title": "Breakingviews - Carillion mess puts Corbyn a step closer to power", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-18T18:57:00.000+02:00", "replies_count": 0, "uuid": "a6863ed03268c65e999893faa4bbfeb6a0d4c443"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-britain-projects-breakingviews/breakingviews-carillion-mess-puts-corbyn-a-step-closer-to-power-idUSKBN1F719G", "ord_in_thread": 0, "title": "Breakingviews - Carillion mess puts Corbyn a step closer to power", "locations": [], "entities": {"persons": [{"name": "corbyn", "sentiment": "negative"}, {"name": "carillion", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "reuters breakingviews", "sentiment": "negative"}, {"name": "national audit office", "sentiment": "none"}, {"name": "pfi", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "nao", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters Breakingviews) - Carillion’s demise isn’t good for many people, but it will likely help Jeremy Corbyn. Since his election in 2015, the leader of the UK opposition Labour party has long called for state investment in public infrastructure. The Carillion mess and ongoing work from the National Audit Office will give him momentum.\nThe NAO’s report, published on Thursday, develops a theme it had already examined three years ago. The returns earned by debt and equity investors provided through the so-called Private Finance Initiative – in which Carillion was a key player – are 2 to 5 percentage points more expensive than the cost of government borrowing. This has been hiding in plain sight: Carillion’s cost of capital was around 9 percent, and the government’s finance costs are generally only around 3 percent.\nThe only point of PFI – besides a sly ability for successive UK governments to keep essential public works off-balance sheet – was therefore operational efficiency. In the provision of hospitals, the NAO found these to be a mirage. The 25-year PFI contracts are also tough to get out of. The NAO reckons interest-rate swaps connected to the bank debt that financed the deals would cost the state an average of 2 billion pounds on the biggest deals, because interest rates are lower than pre-2008. Carillion’s demise finally explodes the myth – its implosion means problem contracts are back in the public’s lap anyway. And in the turmoil many jobs are likely to be lost.\nIf Corbyn wanted to be smart, he could use the NAO findings and Carillion to advance his agenda. He could legitimately argue that had Carillion been a public sector vehicle rather than a private company, it would not have been obliged to pay 79 million pounds in dividends in 2016, thus hastening its cash crunch.\nUnderlying such a strategy would be an assumption that the UK public would vote for a party that wants to pay for public works itself, and pay out lower fees to private companies. For the last 25 years the political imperative to avoid raising the necessary taxes to finance investment has put the UK public in the position of a homeowner paying a much more expensive mortgage than necessary. The main beneficiary of the Carillion-fuelled light-bulb moment could be Corbyn.\nBreakingviews Reuters Breakingviews is the world's leading source of agenda-setting financial insight. As the Reuters brand for financial commentary, we dissect the big business and economic stories as they break around the world every day. A global team of about 30 correspondents in New York, London, Hong Kong and other major cities provides expert analysis in real time.\nSign up for a free trial of our full service at https://www.breakingviews.com/trial and follow us on Twitter @Breakingviews and at www.breakingviews.com . All opinions expressed are those of the authors.", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-18T18:57:00.000+02:00", "crawled": "2018-01-19T12:14:07.000+02:00", "highlightTitle": ""}