{"organizations": [], "uuid": "88f5e2d28076427fbc5ec8858ff17f0e90e119e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/28/pr-newswire-hydro-one-announces-appointment-of-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "Hydro One announces appointment of Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-29T07:00:00.000+02:00", "replies_count": 0, "uuid": "88f5e2d28076427fbc5ec8858ff17f0e90e119e2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/28/pr-newswire-hydro-one-announces-appointment-of-chief-financial-officer.html", "ord_in_thread": 0, "title": "Hydro One announces appointment of Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "paul", "sentiment": "none"}, {"name": "mayo schmidt", "sentiment": "none"}, {"name": "paul dobson", "sentiment": "none"}, {"name": "dobson", "sentiment": "none"}], "locations": [{"name": "toronto", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "hydro one limited", "sentiment": "negative"}, {"name": "direct energy", "sentiment": "none"}, {"name": "cfo for direct energy ltd.", "sentiment": "none"}, {"name": "centrica group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO, Jan. 28, 2018 /PRNewswire/ - Hydro One Limited (Hydro One) is pleased to announce the appointment of Paul Dobson as Chief Financial Officer (CFO) effective March 1, 2018.\nMr. Dobson was most recently CFO for Direct Energy Ltd. (Direct Energy), Houston, Texas, where he was responsible for overall financial leadership of a $15 billion revenue business with three million customers in Canada and the U.S. Since 2003, Mr. Dobson has held leadership positions in finance, operations and customer service across the Centrica Group, the parent company of Direct Energy. He also has considerable experience pursuing acquisitions and integrating acquired companies across North America and in the United Kingdom.\n\"I am very pleased that through our extensive North American search, we have attracted a high calibre leader with significant financial expertise and deep experience in the utility sector to join Hydro One,\" said Mayo Schmidt, President and CEO, Hydro One Limited. \"Paul's strong track record of proven success in leading teams to deliver financial success as well as leading productivity programs and improved customer satisfaction will build on our progress towards becoming North America's leading utility.\"\nMr. Dobson is recognized as a measured and well-rounded finance executive. At Hydro One, he will assume responsibility for finance, treasury, controller, audit, technology and regulation.\n\"I am excited to join Hydro One as it transforms into a performance-driven utility that is well-positioned for the future,\" said Mr. Dobson. \"I am excited to come home to Ontario and I look forward to delivering value for Hydro One's customers, employees, shareholders and communities.\"\nMr. Dobson is a dual Canadian-U.S. citizen who holds an honours bachelor's degree from the University of Waterloo as well as an MBA from the University of Western Ontario and is a CPA, CMA.\nAbout Hydro One Limited\nWe are Ontario's largest electricity transmission and distribution provider with more than 1.3 million valued customers, $25 billion in assets and annual revenues of over $6.5 billion. Our team of 5,500 skilled and dedicated employees proudly and safely serves suburban, rural and remote communities across Ontario through our 30,000 circuit km high-voltage transmission and 123,000 circuit km primary distribution networks. Hydro One is committed to the communities we serve, and has been rated as the top utility in Canada for its corporate citizenship, sustainability, and diversity initiatives. We are one of only five utility companies in Canada to achieve the Sustainable Electricity Company designation from the Canadian Electricity Association. We also provide advanced broadband telecommunications services on a wholesale basis utilizing our extensive fibre optic network. Hydro One Limited's common shares are listed on the Toronto Stock Exchange (TSX: H).\nForward-Looking Statements and Information\nThis press release may contain \"forward-looking information\" within the meaning of applicable securities laws. Words such as \"expect,\" \"anticipate,\" \"intend,\" \"attempt,\" \"may,\" \"plan,\" \"will\", \"can\", \"believe,\" \"seek,\" \"estimate,\" and variations of such words and similar expressions are intended to identify such forward-looking information. These statements are not guarantees of future performance or actions and involve assumptions and risks and uncertainties that are difficult to predict. Therefore, actual outcomes and results may differ materially from what is expressed, implied or forecasted in such forward-looking information. Some of the factors that could cause actual results or outcomes to differ materially from the results expressed, implied or forecasted by such forward-looking information, including some of the assumptions used in making such statements, are discussed more fully in Hydro One's filings with the securities regulatory authorities in Canada, which are available on SEDAR at www.sedar.com . Hydro One does not intend, and it disclaims any obligation, to update any forward-looking information, except as required by law.\nSOURCE Hydro One Limited", "external_links": [], "published": "2018-01-29T07:00:00.000+02:00", "crawled": "2018-01-29T07:04:11.003+02:00", "highlightTitle": ""}