{"organizations": [], "uuid": "a4893f214a06b1cbba4f3e85c4788c8169a21c20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-new-ciox-hires-bring-decades-of-industry-leadership.html", "country": "US", "domain_rank": 767, "title": "New Ciox Hires Bring Decades of Industry Leadership", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T18:54:00.000+02:00", "replies_count": 0, "uuid": "a4893f214a06b1cbba4f3e85c4788c8169a21c20"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-new-ciox-hires-bring-decades-of-industry-leadership.html", "ord_in_thread": 0, "title": "New Ciox Hires Bring Decades of Industry Leadership", "locations": [], "entities": {"persons": [{"name": "lynn howard", "sentiment": "none"}, {"name": "paul roma", "sentiment": "none"}, {"name": "mike connolly", "sentiment": "none"}, {"name": "adeleke", "sentiment": "none"}, {"name": "leke” adesida", "sentiment": "none"}, {"name": "ciox", "sentiment": "none"}, {"name": "connolly", "sentiment": "none"}], "locations": [], "organizations": [{"name": "anthem", "sentiment": "negative"}, {"name": "industry leadership top executives", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Top Executives Offer Experience at Anthem, PwC, and Other Major Organizations\nATLANTA--(BUSINESS WIRE)-- Ciox , a technology-driven healthcare company, announces new hires who will deepen its leadership roster and guide the company into 2018. These executives include Mike Connolly, president, retrieval services; Lynn Howard, chief human resources officer; and Adeleke “Leke” Adesida, senior vice president & chief compliance officer.\nThe new hires bring significant industry experience to Ciox, and they will help lead the company as it adapts a technology-based platform over 2018.\n“Our new executives understand the inner workings of healthcare, technology and related industries, and their experiences will deepen Ciox’s capabilities and expertise,” says Ciox CEO Paul Roma. “They’ll also help us as we implement digital solutions, which will bring further detail and insight to our processes.”\nConnolly will play a key role with Ciox in its position at the crossroads of healthcare, technology, business and compliance. He brings deep executive experience and comes to Ciox from PwC, where he led Global Platforms and drove multi-disciplinary growth businesses. He has also served on the Board of Directors and Executive Committee of Booz & Co., and he is former chief technology officer/deputy chief information officer for Aetna.\nHoward has years of experience developing scalable human resources functions in rapidly growing organizations in the healthcare industry. Most recently, she was senior vice president of human resources at ABILITY Network. Her expertise is in developing and implementing programs that leverage human capital to drive business results.\nAdesida comes to Ciox with years of compliance experience. He was most recently at Anthem Inc., where as deputy chief information security officer and staff vice president he helped Anthem attain HITRUST certification. He has a long record in developing security and compliance solutions for companies such as Terem Corporation, Protiviti, Inc., and Arthur Andersen.\nAs Ciox implements more digital solutions, the new set of executives will help push the company forward while ensuring its core values stand firm as ever. With new leaders in place, Ciox is ideally positioned to remain a healthcare leader in 2018 and beyond.\n“We never lose sight of the larger context of our industry,” Roma says. “We’re proud to hire executives who are both excited for our future yet remain focused on Ciox’s core value: Every record represents a real person.”\nAbout Ciox Health\nCiox, a technology-driven healthcare company, is dedicated to improving U.S. health decisions by ensuring vital health information is quickly and securely codified, abstracted and shared with the right people at the right time during the healthcare continuum. Through our expertise in release of information, record retrieval, clinical coding and abstraction, we improve the management and sharing of health information by modernizing workflows, facilitating access to clinical data, and improving the accuracy and flow of health information. With strong relationships and specialized expertise, we deliver the highest level of quality and process optimization to our partners, including three out of five U.S. hospitals, 140 health plans, and 16,000+ physician practices nationwide. Learn more about Ciox and our unique solutions by visiting www.cioxhealth.com . Ciox is also on Twitter and LinkedIn .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006144/en/\nTrevelino/Keller\nLauren Shankman, 404-214-0722 x121\nlshankman@trevelinokeller.com\nSource: Ciox Health", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fcioxhealth&esheet=51746718&newsitemid=20180122006144&lan=en-US&anchor=LinkedIn&index=4&md5=f959c397d151b983dcff65c122abff96", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cioxhealth.com%2F&esheet=51746718&newsitemid=20180122006144&lan=en-US&anchor=Ciox&index=1&md5=12b83e987ad4b4585d69a8ad0bda819f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Fcioxhealth&esheet=51746718&newsitemid=20180122006144&lan=en-US&anchor=Twitter&index=3&md5=ecbec956dcec95f38d4c37022c20848a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.cioxhealth.com%2F&esheet=51746718&newsitemid=20180122006144&lan=en-US&anchor=www.cioxhealth.com&index=2&md5=47f3d68fa85059fb243bf90915aae0e2", "http://www.businesswire.com/news/home/20180122006144/en/"], "published": "2018-01-22T18:54:00.000+02:00", "crawled": "2018-01-22T20:10:59.025+02:00", "highlightTitle": ""}