{"organizations": [], "uuid": "100f97a307ac6c6c914fb580b6ffa686d14d285e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-840660082.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/04/north-korea-failed-missile-test/", "country": "US", "domain_rank": 1196, "title": "North Korea Failed Missile Test Reportedly Hit Tokchon | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.155, "site_type": "news", "published": "2018-01-04T02:00:00.000+02:00", "replies_count": 0, "uuid": "100f97a307ac6c6c914fb580b6ffa686d14d285e"}, "author": "Emma Hinchliffe", "url": "http://fortune.com/2018/01/04/north-korea-failed-missile-test/", "ord_in_thread": 0, "title": "North Korea Failed Missile Test Reportedly Hit Tokchon | Fortune", "locations": [], "entities": {"persons": [{"name": "emma hinchliffe", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}], "locations": [{"name": "north korea", "sentiment": "none"}, {"name": "south pyongan province", "sentiment": "none"}, {"name": "tokchon", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "pukchang airfield", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "north kore", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Emma Hinchliffe January 4, 2018 \nPresident Donald Trump’s tweets have everyone worried about a missile from North Korea reaching the United States. But a North Korea failed missile test that crashed in Tokchon, a North Korean city, reveals the roadblocks the country faces as it tries to develop a serious weapons program. \nNorth Korea launched a Hwasong-12/KN17 intermediate-range ballistic missile on April 28 last year from Pukchang Airfield in South Pyongan Province, The Diplomat reported Wednesday . The missile crashed soon after launch because of engine failure and landed in a complex of either industrial or agricultural buildings in Tokchon, about 40 miles away. \nThe missile only flew for one minute, never higher than about 43 miles. This was North Korea’s third test of the Hwasong-12, before ultimately completing a successful test of the missile on May 14. The Diplomat report cited a U.S. government source with knowledge of North Korea’s weapons program. \nThis particular missile test had already been reported on, but not the fact that it crashed in a small populated North Korean city. And this missile is one Kim Jong-un has bragged about — remember the military parade with missiles ushered down the streets of Pyongyang in April? Korean People's Army (KPA) tanks are displayed on Kim Il-Sung square during a military parade marking the 105th anniversary of the birth of late North Korean leader Kim Il-Sung in Pyongyang on April 15, 2017. North Korean leader Kim Jong-Un on April 15 saluted as ranks of goose-stepping soldiers followed by tanks and other military hardware paraded in Pyongyang for a show of strength with tensions mounting over his nuclear ambitions. Ed Jones/AFP/Getty Images \nThe Hwasong-12 is a liquid fuel missile that uses a combination of hypergolic propellant and oxidizer. The mixture is volatile and can produce giant explosions upon failure. The missile didn’t explode in the air, so the explosion probably happened on the ground in Tokchon. \nThe intermediate-range ballistic missile, or IRBM, is capable of reaching the U.S. territory of Guam. The missile could have been intended to reach the Sea of Japan near the Russian coast during its test, The Diplomat speculated. \nNorth Korea used technology from the Hwasong-12 to develop the intercontinental ballistic missile Hwasong-14 and the Hwasong-15 later in the year. That weapon, North Korea claims, is capable of reaching the U.S. mainland. \nDeveloping that weapons technology comes with serious risks — including the risk of a missile exploding in a city of your own people. Although the crash location showed a complex of industrial buildings that likely didn’t have people inside, the complex was within city limits with civilians nearby. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-04T02:00:00.000+02:00", "crawled": "2018-01-05T09:03:15.023+02:00", "highlightTitle": ""}