{"organizations": [], "uuid": "5620a609602609e77c1a483a34b514f843b3e5fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/britain-companies-pay-ceo/fat-cat-thursday-sees-pay-of-top-uk-ceos-already-pass-annual-average-for-workers-idUSL8N1OY3FA", "country": "US", "domain_rank": 408, "title": "'Fat Cat Thursday' sees pay of top UK CEOs already pass annual average for workers", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T02:01:00.000+02:00", "replies_count": 0, "uuid": "5620a609602609e77c1a483a34b514f843b3e5fc"}, "author": "", "url": "https://www.reuters.com/article/britain-companies-pay-ceo/fat-cat-thursday-sees-pay-of-top-uk-ceos-already-pass-annual-average-for-workers-idUSL8N1OY3FA", "ord_in_thread": 0, "title": "'Fat Cat Thursday' sees pay of top UK CEOs already pass annual average for workers", "locations": [], "entities": {"persons": [{"name": "simon jessop", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "'fat cat", "sentiment": "neutral"}, {"name": "chartered institute of personnel and development", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 12:01 AM / Updated 20 minutes ago 'Fat Cat Thursday' sees pay of top UK CEOs already pass annual average for workers Reuters Staff \n* Average FTSE 100 CEO has already earned 28,758 pounds \n* Figure marks what typical worker earns in year \n* Issue likely to be in focus in 2018 AGM season \nBy Simon Jessop \nLONDON, Jan 4 (Reuters) - The average boss of one of Britain’s top companies will on Thursday have earned the same as the typical worker will make in the entire year, according to a new report, stepping up pressure on companies ahead of the annual reporting season. \nJust three working days into 2018, pay for the average FTSE 100 chief executive will pass the median worker salary of 28,758 pounds ($38,855), the report by the Chartered Institute of Personnel and Development (CIPD) and pressure group the High Pay Centre showed. \nAnd that is despite the mean pay of FTSE 100 CEOs falling by about 17 percent in 2017 to 4.5 million pounds amid pressure from investors, the government and wider society for excessive pay to be reined in. \nEven with that pay cut, the ratio of CEO pay to the pay of the average full-time worker is still 120:1, the report on “Fat Cat Thursday” showed, with the best-paid boss - advertising company WPP’s Martin Sorrell - on 48.2 million pounds. \n“The drop in pay in the last year is welcome, although relatively marginal, and will have largely been driven by the growing public and shareholder concerns and the Prime Minister’s stronger focus on boardroom excess and plans to reform corporate governance,” CIPD Chief Executive Peter Cheese said. \nAfter a high-profile government review of the UK Corporate Governance Code in 2017, Britain’s leading companies will now be forced to disclose the pay ratio between the CEO and average worker, a move welcomed by the High Pay Centre’s Stefan Stern. \n“Publishing pay ratios will force boards to acknowledge these gaps. We look forward to working with business and government to make this new disclosure requirement work as effectively as possible,” he said. \nLuke Hildyard, Stewardship and Corporate Governance Policy Lead at the Pensions and Lifetime Savings Association, said just 7 percent of FTSE 100 annual reports detailed the difference between the CEO’s pay and that of the wider workforce. \n“Huge pay differences between executives and the wider workforce symbolise how too many companies fail to understand or appreciate the value of their workers,” he said. $1 = 0.7401 pounds Reporting by Simon Jessop; Editing by Mark Potter", "external_links": [], "published": "2018-01-04T02:01:00.000+02:00", "crawled": "2018-01-04T02:30:31.005+02:00", "highlightTitle": ""}