{"organizations": [], "uuid": "0e26781e00e54044d77fbc7f32f68cdce221a16b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/cnbc-interview-with-italian-prime-minister-paolo-gentiloni-from-the-world-economic-forum-2018.html", "country": "US", "domain_rank": 767, "title": "CNBC Interview with Italian Prime Minister, Paolo Gentiloni, from the World Economic Forum 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T12:28:00.000+02:00", "replies_count": 0, "uuid": "0e26781e00e54044d77fbc7f32f68cdce221a16b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/cnbc-interview-with-italian-prime-minister-paolo-gentiloni-from-the-world-economic-forum-2018.html", "ord_in_thread": 0, "title": "CNBC Interview with Italian Prime Minister, Paolo Gentiloni, from the World Economic Forum 2018", "locations": [], "entities": {"persons": [{"name": "paolo gentiloni", "sentiment": "negative"}, {"name": "geoff cutmore", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}], "organizations": [{"name": "cnbc interview", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Following are excerpts from a CNBC interview with Italian Prime Minister Paolo Gentiloni and CNBC's Geoff Cutmore from the World Economic Forum 2018.\nGC: Mr. Prime Minister. The indications in the polls, at the moment, suggest that we might end up with a hung parliament in the Italian election. How problematic an outcome would that be for the progress that Italy is making?\nPG: Well, obviously, we hope-, we hope that this will not be the case, and that the Centre Left, that I represent, will have a majority. In any case, I think we will be the pillar of a possible coalition in our country. We have a certain expertise in flexibility in politics in my country, so I think that, what is clear is, one, that the populist, anti-EU position will not prevail, and second, that Italy will keep its stability. You know, we've had frequent change around in governments in my country, but if you look to fundamentals of our foreign policy, of our economy, we are a very, very stable country, and we will remain so.\nGC: You talked about the positive momentum, and we see it internationally, in the growth rates, and we see the momentum starting to build, at the moment, in Italy. Is it your sense that this election, in particular, could be a key moment for the country to decide which direction it wants to go in? That there is a hand of history on your shoulder moment, if I can put it that way?\nPG: Well, from-, you could say that we are exactly on the right track, because the economy is back on growth. I remember that, just one year ago, IMF had a forecast for 2017 of a 0.7% growth in my country, and the IMF assessment for the same year, 2017, is now 1.6%. So, more than doubled. And all the other relevant numbers are positive. But as we all know, the fact that we have positive numbers doesn't mean automatically that we've solved our social and political problems. So, we have to be very careful, with this election, not to disrupt the result and the reforms that we realized in the last five years, with an effort of all the Italian community. Workers, enterprises, families. To disrupt this would be really not serious, but I am confident that we will not.\nGC: Given there's so much at stake, if the Centre Right wins, the coalition of Mr. Berlusconi, but they need you to form a government, would you be willing to do that?\nPG: Well, you know, to this direct question, the answer is no. But the fact is that the Centre Right coalition in Italy is a coalition among very different positions. So, we have two parts of this coalition. One is a Conservative party, and the other one-, the other two, are populist anti-EU parties. I think that this coalition will not stay in place.\nGC: The business community that we've spoken to here, and back in Italy, all praise you individually. Whilst, of course, Mr. Renzi is the head of the party, people, I think, personally like you, and the business community likes you, and the stability you appear to bring. If there is a form of coalition that would leave you in position as Prime Minister, would you be willing to take on that responsibility?\nPG: Well, you know, this is something not for me to decide, it's something that, due to our electoral law, will be decided, one, obviously, by electoral results, because the elections are always fundamental. You can't discuss a government before the elections with this kind of law. We have a mostly proportional law, and then, after the election, we will need, and we will have a government. Our President of the Republic will evaluate the situation, and decide what to do. Obviously, I am in charge now, but I am-, I have nothing in my mind for the future. It is our vote, and our President of the Republic that will decide for the future.\nGC: Let me just be very clear on this, because I think it's very important. I'm not asking you to prejudge the Italian election outcome. You can't do that, and it wouldn't be right for you to do that. But, what I do need to ask you is, is there any reason that you would be unwilling to serve, if the outcome required you to remain in office, or indeed, any coalition invited you to remain in office? Is there any reason that you would not accept that responsibility?\nPG: I am in good health, but, my commitment was 13 months ago, to-, to try to bring the country to the end of our legislature, continuing reforms, and addressing a couple of very serious crises, on migration, on the banking system. This was my commitment, and the commitment ends with the elections. After the elections, we will see.\nGC: Okay. Well, I-, I read that as a, 'No, I don't rule it out, but we will wait and see what the ultimate outcome is-,'\nPG: Correct.\nGC: And I-, and I am very positive on the fact that you have good health, and you have the stamina to continue leading. [Laughter]. Why is the Democratic party not garnering much stronger support at the moment? You know, this has been a positive period for Italy, and yet it seems to be trailing somewhat, in the latest polling. Does that suggest, perhaps, that-, that Mr. Renzi is, perhaps, not the right man to be leading the party? I mean, what-, how would you assess the-, the lagging in popularity that the party is experiencing?\nPG: I think that Matteo Renzi was enactor of a fundamental process of reforms, in the almost three years he was in power. Then, we lost a political challenge, that was a referendum, and you know that losing referendum is always a complicated thing, in Europe, and in the world. But, as a matter of fact, my idea is that we are in face of the problem that governing in such complicated times is not easy. So, you should be aware of the fact that, even if you have reforms, even if you have growth, 1 million more jobs, the fact is that we have inequalities growing, and social unrest. We are very open on migration, we are saving lives at sea. We were able to reduce the migration flows, but we cannot underestimate the fact that even migration creates a lot of discussion, and if there is a political offer about anger, fear, a short-term solution, this is, in any case, dangerous. So, I think that, at the end, we will recover in this campaign, and we will be the pillar of a new government, our party. But, sure, we have some difficulties connected to the role of government, in our contemporary societies.\nGC: As you say, this is an opportunity for a new chapter, and for a new period of-, of political power. What do you think the key priorities of a new government in Italy should be, then, from day one?\nPG: Well, I think we have, mostly, two or three main issues. One is to use the fact that we have economic growth, not to disrupt the fundamental of our system, I mean, pensions, I mean we have to continue in our fiscal responsibility, and reducing gradually the debt. But, to promote more jobs, and more social justice. Our wages are too low, we have too many differences between north and south, men and women. So, the main-, the first message is to use good weather to bring more social justice to the country. We need the fact that the middle class feels the fact that the economy is doing better. If the fact that the economy is doing better is only something for the stock market, our stock market is booming, or for the richer part of the country, we will never be able to continue the process. So, we need social responsibility, first of all, so jobs and less inequalities. And second, we need to continue our effort to stabilize the Mediterranean, and to tackle the migration crisis, inside general policies towards Africa. It is interesting to note, from my point of view, that Italy was, in 2016, the third global investor in Africa. The third global investor in Africa. And the first-, the first in Europe. This means that we are aware of the necessity to tackle our crisis, or problems of the day, with a medium and long-term strategy. We will never have stability in the Mediterranean and in Africa without development. So, this is our second priority. Stability, and managing of the crisis, and also transforming migration from a criminal business to something that we can manage, gradually, regularly. It also brings many things to our economy, if it is regulated.\nGC: The period we've experienced in Europe has brought extremes. It has also brought political extremists support. If we look at Italy, the Five Star Movement potentially still could be the largest party, in electoral terms. What would that actually mean for the political system of the country, given that we've already seen how Five Star have managed Rome, for example, or other parts of the country?\nPG: Well, I think that the Five Star Movement is frequently raising the right questions, but giving horribly wrong answers. So, I-, I have respect for those voting them, because it is, in some way, a form of reaction to corruption, to inequalities. A, sort of, demand for more democracy. But the answers are not only wrong, but even dangerous, because the idea of disrupting the framework we have gradually built in our country is very dangerous. But make no mistake, our electoral system will not allow-, well, voters have the right to decide anything, but, with the numbers that we have now, and with the idea of this movement, to have a government on its own, we will never have this kind of government. This is why I think we have to concentrate on our programs, and to give the right answer to the questions that are raised.\nGC: You've brought up the migration issue a number of times. It's disappointing, is it not, that this has become a bit of a political football, in Italy, with extremist comments about the growing number of migrants that are arriving on Italian shores. I mean, as you look at this crisis, who should take responsibility? The EU? Have they been active enough, do you think? I mean, it's just unfortunate that this has become, as you say, an ugly, political football in the campaigning.\nPG: Yes. Well, I think it is totally wrong, and not responsible, from political parties, to use the issues of migration for a diffusion of anger, fear and division. I think, also, that we cannot underestimate this, so we have to be very careful in multiplying our efforts to reduce migration flows, and to transform them from totally irregular to regular. This is obviously, also, in the interest of refugees and migrants, because in a totally irregular and criminal-managed traffic, they risk their lives. And if we reduce flows, we also reduce the numbers of people dying at sea, and this is what has happened, due to our intervention, in the last months. Then, the EU. Well, I think that there is a non-sufficient commitment from all the 28 countries on this issue. I think the Commission was very courageous in many initiatives, the European Commission. There are a few number of countries, not only Mediterranean, but also Germany, for example, that give a good example, or Sweden, on migration, but there are many other countries refusing their contribution to solidarity, in this sense. And this creates a weak overall European standing. This is why Italy, at the end, decided to move-, to move a little bit on our own, to have a direct dynamic with the fragile Libyan authorities, to build their capacity to control their coast, and I am very happy that our move, national move, was supported by the European Commission, and several European countries. But it is not yet a sufficient European policy.\nGC: On so many issues, it seems that the man or woman on the street in Italy has reason to be unhappy with some of the pronouncements from Brussels, not least on migration, but also on fiscal budgets, on the evolution of the banking system, and so on and so forth. Do you think if there was a Brexit referendum in Italy tomorrow, that actually, Italy would be on its way out of the EU?\nPG: We have to be very cautious with a referendum. The Italian Constitution doesn't allow referendum on international treaties, and this is-, then I am confident on the common sense of our citizens. Yes, there is a mood to blame Brussels for several things. In many cases, it is also justified, because there are rules that are changed from year to year, and difficulties in many sectors, but, at the end of the day, I think that Italian citizens are, and they are, since 60 years, fundamentally pro-European, and I have also to add, sadly, that the example of the British decision to leave EU is an example in the opposite sense. So, you-, you see what happened to-, what is happening to the UK, and I totally respect, obviously, the British people's decision, but I-, I think it is evident, at least for the Italian public opinion, that it was not a good choice for UK. The choice is taken, we respect, we cooperate, but the crisis of EU was in 2016. Now we are in 2018, and I think 2018 could be a year of the relaunch of the EU, not of the crisis of the EU.\nGC: You've met President Trump. You lobbied him on the American position, or at least his position, on migration in to the United States. Are you, personally, disappointed with the President's attitude on this issue?\nPG: Well, we have different points of view on this issue, and, by the way, not only on this issue, also on other issues, on-, on climate change, for example. I think that what is-, what is key is, one, that we have always to remember that we have-, we, the Italians, have always cooperated with the US, and with Regan, and Carter, and Nixon, and Clinton, Bush, and Obama. And Trump, Trump is the American elected President. So, cooperation is there. My messages are, one, we need multilateral and Trans-Atlantic cooperation, because it worked, and to weaken this cooperation would be a mistake. And second is a message not to America, but to Europe. The problem, frequently, is not what the American administration believes, or thinks, but what are we doing? Because, are we doing enough from the geopolitical point of view, in our region? I mean, in the Mediterranean, in the Balkan, in the Middle East? We are not doing enough. This is why I am-, I am saying that 2018 could be a-, an interesting year for Europe to relaunch our role. Also, our geopolitical role, not only the common market, because we need this. In several areas, Europe, I mean, EU, looks like an economic giant and a political dwarf. This is what we used to say a few decades ago about a single country. But we are the main partners of-, economic and trade partners of almost all the countries in the region we are in, but, frequently, we are not able to face the influence of other external powers, because we are not sufficiently integrated, in defense policy, in foreign policy, and, even, on trade policies. So, it is time to-, to have steps forward, for Europe.\nGC: So, let me just be clear. On President Trump, then, your view would be you don't have to like him, you may not agree with his migration issues or his trade policies, but we do have to deal with the man.\nPG: Absolutely. And I totally respect the fact that he was elected with the idea of putting America first, and he is trying to deliver in this direction. But, we, the European, we, the Italians, have to stress the fact that respecting and protecting the interest of the US citizens, which is correct, cannot mean that we discuss the framework of the internationals trade relations, for example, that demonstrated to be so useful for growth. First of all, for US, and then for all our rich countries. So, we have to mix, obviously, free trade and fair trade, as the definition goes, we have to discuss of dumping policies from this country, or another country. This is all an open discussion. But the framework of this discussion should remain the support for openness, for free trade, for agreements, and not protectionism. In the G7, that I had the honor to Chair in Sicily, a few months ago, we found several points of common view, or compromise, if you want, on these issues. The only one we were not able to-, to find a common language, was climate change. So, I hope that, respecting totally what the American President thinks is useful for his country, but we need to maintain our framework of openness and free trade. This is in the interest of all our countries, including the US.\nGC: And that requires a more robust response from the European community-,\nPG: Obviously. Obviously. This is time for Europe to, if there are gaps, to fill the gaps. I, personally, strongly support the fact that this is time to conclude the negotiations with Latin America, with Mercosur, that are going on since a certain amount of time, and it will be a-, a good message. We had a good agreement with Canada, we are concluding our trade agreement with Japan, so this is, for Europe, the moment to say, not against someone, absolutely, but to say, 'We are one of the pillars, and perhaps one of the main pillars-,' not perhaps, for sure, one of the main pillars, 'Of the international framework based on free trade. We can't-, we can't put at risk what we reached. If we-, the sentiment I feel here in Davos is a sentiment of a synchronic, good moment for growth, but this moment should continue, and to continue it, we have to, obviously, work on what is not functioning, but maintain the fundamentals of our system, which is based on openness and free trade, and tackle the issue of social injustice, which is absolutely key. Because the risk we are facing is that the social injustice, the social unrest, is addressed against foreign countries. So, you have your lower-middle class living in a difficult situation, and you blame your neighbor, you blame another country, and you recreate the fundamentals for conflicts, tensions. This is what Europe was able to avoid in the last 60 years, and we have to continue.\nGC: Let me finish with one final question on the Italian economy. We have watched the restructuring of the Italian banking system with interest. The markets, though, still have questions about the credibility of the reforms, and the credibility of the reduction of debt stock in Italy. What commitments, or promises, can you make at this point, to help the markets understand that in, say, technical, or technological terms, Italy is moving to a new model? It is, if you like, going 2.0. Italy, now, has a new reason for-, for being an attractive destination for capital?\nPG: Well, in fact, we had in the last two or three years, a very large amount of foreign investments in Italy. We could even improve them. Why did we have them, even in a more difficult economic situation than the situation we have now? Because we are an open market, with some difficulties with bureaucracy, that everybody knows, but stable and open to foreign investment, since decades, and this means that investors are confident. What are we doing? I think, on the public debt, we have to gradually, and with sustainability, decrease this public debt. It is, already, very, very slightly decreasing. Our fiscal policy is fundamentally very, very appreciated, because we reduce our deficit from 3% to 1.6% in four years. The banking system, the problem for the Italian banking system, perhaps, was that we addressed the crisis of our-, of some of our banks, later than other European countries, for example, Germany or the Netherlands addressed the crisis of their banks two or three years before, and unfortunately with different European rules. So, when we addressed, we were in a deeper crisis, and we addressed the crisis after the European rules had changed, and the-, so, if you look to the spending of the Italian state to save our banks, it is incredibly lower than the spending of other European countries, to save their banks. I think we spent, perhaps, one tenth of what Germany spent to save their banks, and, perhaps, one fifth of what the Netherlands spent to save their banks. So, while it's not something I am proud of, but because of the deep crisis, we were late in addressing the banking crisis, and the rules were, in the meanwhile, changed. Now, we've solved the main banking crisis, I think we've solved the banking crisis, because the consolidation will go on, in Italy and other countries. We have, still, an amount of non-performing loans, but what is crucial is the trend. The reduction of non-performing loans in the last 12 months was 26% in Italy. So, what is crucial, I think, to understand, is that the system is functioning, the economy is going, we have a private debt, the lowest private debt in the rich world, so we have a lot of savings in the families, in the life insurances. A lot of potentiality in our market. We should avoid, but I am sure that the financial, European authorities, will do this. We should avoid to take measures that create problems, instead of solving problems. So, everything should be gradual, and very reasonable, because we are going towards good weather, and we have-, we have no interest to create problems in a situation like this. All European countries, from Greece to Finland, are now in a good position, and the task of the financial authorities is to help this, and not to invent something that could create problems to this trend.\nGC: Sir, thank you very much for your time-,\nPG: Thank you.\nGC: You've been very generous with us-,\nPG: Thank you very much.\nGC: And it's been a great conversation. Good.\nPG: Thank you.\nGC: Thank you so much.\nENDS", "external_links": [], "published": "2018-01-24T12:28:00.000+02:00", "crawled": "2018-01-24T15:08:29.085+02:00", "highlightTitle": ""}