{"organizations": [], "uuid": "6ec3462d242367ca9cbca43a3f369911d16836e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/oil-prices-kemp/column-peak-oil-demand-and-its-implications-for-prices-kemp-idUSL8N1PE387", "country": "US", "domain_rank": 408, "title": "COLUMN-Peak oil demand and its implications for prices: Kemp", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T21:30:00.000+02:00", "replies_count": 0, "uuid": "6ec3462d242367ca9cbca43a3f369911d16836e9"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/oil-prices-kemp/column-peak-oil-demand-and-its-implications-for-prices-kemp-idUSL8N1PE387", "ord_in_thread": 0, "title": "COLUMN-Peak oil demand and its implications for prices: Kemp", "locations": [], "entities": {"persons": [{"name": "john kemp", "sentiment": "negative"}, {"name": "kemp", "sentiment": "negative"}, {"name": "spencer dale", "sentiment": "none"}, {"name": "bassam fattouh", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "oxford institute for energy studies", "sentiment": "none"}, {"name": "bp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(John Kemp is a Reuters market analyst. The views expressed are his own)\nBy John Kemp\nLONDON, Jan 19 (Reuters) - Even if oil consumption reaches a peak and then starts to fall, the world will still need large quantities of oil for many decades to come.\nThe prediction is contained in a thoughtful paper co-authored by Spencer Dale, chief economist of BP, and Bassam Fattouh, director of the Oxford Institute for Energy Studies.\n“Global oil demand is likely to continue growing for a period, driven by rising prosperity in fast-growing developing economies,” they wrote in a paper published on Monday.\n“But that pace of growth is likely to slow over time and eventually plateau, as efficiency improvements accelerate and a combination of technology advances, policy measures and changing social preferences lead to an increasing penetration of other fuels in the transportation sector.”\nThe implication is that consumption is likely to reach a maximum at some point and then start to fall, though the timing and magnitude of the peak are highly uncertain and very sensitive to assumptions.\nAnd even once demand has peaked, consumption is unlikely to drop sharply, the authors argue, given the inherent advantages of oil as an energy source, particularly its energy density.\n“Peaking oil demand is not expected to trigger a significant discontinuity or sharp fall in demand,” they wrote (“Peak oil demand and long-run oil prices”, OIES, Jan. 2018).\nUnder most scenarios, the world will still be consuming tens of millions of barrels of oil per day through the middle of the century.\nThere are sufficient known oil resources to meet all the world’s oil demand through 2050 twice over, according to BP estimates (“BP Energy Outlook”, 2017).\nBut given the natural decline in output from existing fields, substantial investment will be needed to turn those resources into reserves and produce them.\nABUNDANCE The predicted peaking of consumption, coupled with vast resources, and new production made possible by hydraulic fracturing and horizontal drilling have transformed the long-term outlook for the oil industry.\nThe dominant narrative, which before 2008 was characterised by fears about future scarcity and oil supplies running out, has been transformed into one about future abundance.\nSome now worry that many of those resources will never be needed and may become stranded assets - a welcome development for climate campaigners but a potential problem for oil producers.\nPeak oil demand signals “a shift in paradigm: from an age of scarcity (or more accurately perceived scarcity) to an age of abundance, with potentially profound implications for oil markets”, according to Dale and Fattouh.\nIn an era of abundance, oil markets are likely to become increasingly competitive, as resource owners compete to secure market share and produce their reserves rather than risk them being left in the ground.\n“Faced with the possibility that significant amounts of recoverable oil may never be extracted, low-cost producers have a strong incentive to use their comparative advantage to squeeze out high-cost producers and gain market share.”\nBetter to have money in the bank than leave oil in the ground.\nAs the oil market becomes more competitive, low-cost producers will find it more profitable to switch to a high-volume, lower price strategy – in contrast to the old strategy of restricting volumes and raising prices.\nThe authors do not name any countries but the argument applies especially to Saudi Arabia, Kuwait and Abu Dhabi, and to a lesser extent to other major producers in the Middle East and North Africa.\nThe implication is that many producing countries will see revenues and formerly high resource rents decline, to the benefit of consumers.\nSOCIAL COSTS In theory, competition for market share should drive oil prices down to the marginal cost of extraction, which the authors suggest could be lower than $10 per barrel for the major Middle East producers.\nBut these countries rely heavily on oil revenues to fund government operations, defence, healthcare, education and social safety nets. They need prices well above the marginal cost of extraction to maintain their economic, social and political systems.\nTo be sustainable, oil prices must be high enough to cover these “social costs” as well as the much lower costs of physical extraction.\nThe authors cite fiscal breakeven prices as a proxy for social costs and say breakevens for five major Middle Eastern producers averaged $60 per barrel in 2016 compared with a physical cost of production of just $10.\nMany low-cost producers recognise the need to diversify their economies away from dependence on oil but experience suggests such transitions take decades to complete.\nIn the meantime, the authors argue, many low-cost producers will try to resist the shift to a higher-volume, lower price strategy while they try to make progress with the transition.\nTRANSITION The problem with this argument is that it makes oil prices a function of social costs. In reality, it is the other way around - price drives social spending.\nThe social structures of the major oil-producing countries were shaped by the enormous influx of petroleum revenues during the 1970s and again in the 2000s. Efforts at social reform and economic diversification have come when prices and revenues fell, during the 1990s and again since 2014.\nDale and Fattouh argue that “it is likely that many low-cost producers will delay adopting a more competitive strategy until they have made significant progress in reforming their economies. This is likely to slow the speed at which the new competitive oil market emerges.”\n“The shift to a more competitive oil market environment won’t just happen on its own accord, it requires a critical mass of low-cost producers both to recognise the need to adopt a more competitive strategy and, more importantly, to have reformed their economies sufficiently for them to be able to adopt such a strategy sustainably.”\nIf social costs in many low-cost producing countries remain high, according to Dale and Fattouh, that is likely to slow the pace at which a more competitive market takes hold, until they can reduce them.\n”It seems likely that the average level of oil prices over the next 20 or 30 years will depend more on developments in the social cost of production across the major oil-producing economies in the world than on the physical cost of extraction,” they conclude.\nMARKET POWER Fattouh and Dale assume that Saudi Arabia and the other low-cost Middle East oil producers can successfully exercise market power, restricting production to keep prices high.\nBut they are probably overstating OPEC’s market power. Experience suggests Saudi Arabia and OPEC can wield significant market power in the short term but have struggled to control prices in the longer term.\nIn the 1980s, OPEC’s market power was broken by the emergence of rival oil supplies from the North Sea as well as Russia, Alaska and China.\nIn the 2010s, its market power was hit by the emergence of U.S. shale, Canadian heavy oil and deepwater projects.\nIn practi", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T21:30:00.000+02:00", "crawled": "2018-01-20T17:30:36.000+02:00", "highlightTitle": ""}