{"organizations": [], "uuid": "71a40325ba2c369a4bd912b0ae7e0dfac0831a55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/business-wire-condor-hospitality-trust-closes-acquisition-of-the-towneplace-suites-austin-north-tech-ridge.html", "country": "US", "domain_rank": 767, "title": "Condor Hospitality Trust Closes Acquisition of the TownePlace Suites Austin North Tech Ridge", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T17:00:00.000+02:00", "replies_count": 0, "uuid": "71a40325ba2c369a4bd912b0ae7e0dfac0831a55"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/business-wire-condor-hospitality-trust-closes-acquisition-of-the-towneplace-suites-austin-north-tech-ridge.html", "ord_in_thread": 0, "title": "Condor Hospitality Trust Closes Acquisition of the TownePlace Suites Austin North Tech Ridge", "locations": [], "entities": {"persons": [], "locations": [{"name": "md.", "sentiment": "none"}, {"name": "austin north tech ridge bethesda", "sentiment": "none"}, {"name": "north tech ridge", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}], "organizations": [{"name": "condor hospitality trust closes acquisition", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "condor hospitality trust, inc.", "sentiment": "neutral"}, {"name": "aimbridge hospitality", "sentiment": "none"}, {"name": "dell", "sentiment": "none"}, {"name": "general motors", "sentiment": "none"}, {"name": "towneplace suites austin north tech ridge", "sentiment": "none"}, {"name": "samsung", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BETHESDA, Md.--(BUSINESS WIRE)-- Condor Hospitality Trust, Inc. (NYSE American: CDOR), a hotel-focused real estate investment trust (REIT) headquartered and incorporated in the state of Maryland, today announced that it has closed on its previously-announced agreement to purchase the 122-room TownePlace Suites located in the North Tech Ridge submarket of Austin, Texas. The hotel was purchased for $19.75 million and will continue to be managed by Aimbridge Hospitality.\n“With the closing of the TownePlace Suites Austin North Tech Ridge, we have added another young, high-quality select-service asset into our growing portfolio of new investment platform hotels. The TownePlace Suites represents the youngest select-service product in the North Tech Ridge submarket, which has numerous and diverse local demand drivers, including Dell’s corporate campus, Samsung’s semiconductor Facility, and General Motors’ IT innovation facility. As the 31 st largest MSA by population, Austin grew faster than all other large metro areas in the United States over the last five years. This new asset fits perfectly within our acquisition strategy of acquiring newer select-service hotels in fast-growing, top-100 MSAs,” stated Bill Blackham, Condor’s Chief Executive Officer.\n“Assuming the closing of the Home2 Suites Summerville, which is currently under contract, we will have closed approximately $276 million of acquisitions since the fourth quarter of 2015, representing fourteen high-quality premium-branded select-service hotels flagged under the leading Marriott, Hilton, and IHG hotel brands,” added Mr. Blackham.\nRefer to the Company’s Form 8-K to be filed with the Securities and Exchange Commission for a further description of the terms of the transaction.\nAbout Condor Hospitality Trust, Inc.\nCondor Hospitality Trust, Inc. (NYSE American: CDOR), is a self-administered real estate investment trust incorporated in the state of Maryland that specializes in the investment and ownership of upper midscale and upscale, premium-branded select-service, extended stay and limited-service hotels. The Company currently owns 19 hotels in 9 states. Condor’s hotels are franchised by a number of the industry’s most well-regarded brand families including Hilton, Marriott, and InterContinental Hotels Group. For more information or to make a hotel reservation, visit www.condorhospitality.com .\nForward-Looking Information\nCertain matters within this press release are discussed using forward-looking language as specified in the Private Securities Litigation Reform Act of 1995, and, as such, including the use of “fits perfectly” and “assuming”, may involve known and unknown risks, uncertainties and other factors that may cause the actual events, results or performance to differ from those presented in the forward-looking statement. These forward-looking statements are based on assumptions that management has made in light of experience in the business in which the Company operates, as well as other factors management believes to be appropriate under the circumstances. As you read and consider this release, you should understand that these statements are not guarantees of events, performance or results. They involve risks, uncertainties (some of which are beyond the Company’s control) and assumptions. Although management believes that these forward-looking statements are based on reasonable assumptions, you should be aware that many factors could affect events, performance or results and cause them to differ materially from those anticipated in the forward-looking statements. These factors include among other things, risk factors described from time to time in the Company’s filings with the Securities and Exchange Commission. The Company cautions that any forward-looking statement included in this press release is made as of the date of this press release and the Company does not undertake to update any forward-looking statement.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180119005132/en/\nCondor Hospitality Trust, Inc.\nJonathan J. Gantt, 301-861-3305\nChief Financial Officer & Senior Vice President\njgantt@trustcondor.com\nSource: Condor Hospitality Trust, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.condorhospitality.com&esheet=51745683&newsitemid=20180119005132&lan=en-US&anchor=www.condorhospitality.com&index=1&md5=a08a30e8d38b196fc4c5317e6cf20dff", "http://www.businesswire.com/news/home/20180119005132/en/"], "published": "2018-01-19T17:00:00.000+02:00", "crawled": "2018-01-19T21:02:11.000+02:00", "highlightTitle": ""}