{"organizations": [], "uuid": "f672b0922b7856c8520385ace965f0044b5419bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222751937&w=1200&r=LYNXMPEE0G0N7", "site_section": "http://www.reuters.com/resources/archive/us/20180117.html", "section_title": "Archive News &amp; Video for Wednesday, 17 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-tennis-ausopen-kyrgios/kyrgios-keeps-cool-to-storm-into-third-round-idUSKBN1F617U", "country": "US", "domain_rank": 408, "title": "Kyrgios keeps calm and carries on into third round", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T18:53:00.000+02:00", "replies_count": 0, "uuid": "f672b0922b7856c8520385ace965f0044b5419bf"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-tennis-ausopen-kyrgios/kyrgios-keeps-cool-to-storm-into-third-round-idUSKBN1F617U", "ord_in_thread": 0, "title": "Kyrgios keeps calm and carries on into third round", "locations": [], "entities": {"persons": [{"name": "kyrgios", "sentiment": "negative"}, {"name": "nick kyrgios", "sentiment": "negative"}, {"name": "viktor troicki", "sentiment": "none"}, {"name": "troicki", "sentiment": "none"}, {"name": "mark edmondson", "sentiment": "none"}, {"name": "andreas seppi", "sentiment": "none"}, {"name": "jo-wilfried tsonga", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "serbia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "kyrgios", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE (Reuters) - Nick Kyrgios’s new-found calm remained intact despite a night of bizarre distractions as the fiery home favorite outplayed Serbia’s Viktor Troicki to reach the Australian Open third round without conceding a set on Wednesday.\nThe 17th seed dealt with a heckling spectator, a malfunctioning umpire’s microphone and was even distracted by a helicopter hovering overhead but remained in control to claim an impressive 7-5 6-4 7-6(2) victory.\nA year after the 22-year-old was jeered by home fans after surrendering a two-set lead against Italian Andreas Seppi to crash out in the second round, he produced more evidence that a run deep into the second week is possible.\nHis idol, Frenchman Jo-Wilfried Tsonga, the 2008 Australian Open runner-up, is next up for Kyrgios who is trying to become the first home men’s champion since Mark Edmondson in 1976.\nThe 31-year-old Troicki provided a useful gauge of Kyrgios’s form and fitness, but it was the Australian’s relative calmness in the face of chaos that stood out.\nHe was already a set in front when a fan decided to make a name for himself by standing up in the front row in the Hisense Arena and began bellowing “Oh Yea ” while filming himself before being ejected.\nA couple of games later a red helicopter hovered above the court, drowning out the sound of the ball being struck.\nAll that on top of the umpire’s microphone making strange noises which prompted Kyrgios to describe events as “a circus”.\nThere was plenty of chuntering from Kyrgios but apart from “freaking out” after a late lapse when he dropped serve at 5-4 in the third, he stuck diligently to his task.\nODD INCIDENTS\nAustralian Open - Hisense Arena, Melbourne, Australia, January 17, 2018. Nick Kyrgios of Australia shakes hands with Viktor Troicki of Serbia after Kyrgios won their match. REUTERS/Thomas Peter ”I think obviously it’s pretty easy to think, ‘Why me?'“ Kyrgios said of the odd incidents. ”The guy in the crowd was crazy. I didn’t really know what was going on.\n“The helicopter, that’s when I was thinking like, of course, it’s at my match. It’s just hovering there. Of course, it is.”\n“Hearing the ball actually come off the racket is a pretty big thing. I missed four returns. I‘m blaming the helicopter.”\nTold that the fan had posted his puerile stunt on social media, Kyrgios, who was fined for swearing at a fan on Monday, said: “Good on him. Little claim to fame. Let him have it.”\nKyrgios got a helping hand at 5-5 when Troicki served two consecutive double faults to go 0-40 down and he rifled away a backhand winner after a ferocious baseline exchange.\nTwo unforced errors from Troicki gifted Kyrgios a break at the start of the second set and he then dipped into his bag of dinks and chips and slapped winners to take a two-set lead.\nKyrgios broke in the third game of the third set but nothing is ever routine with him and out of nowhere, he was broken himself when serving for the match at 5-4.\n“I started freaking out a little bit,” Kyrgios said.\nTroicki saved one match point at 1-6 in the tiebreak with a deft volley but Kyrgios struck a backhand into the corner a point later to complete a good night’s work and supply further evidence that he is harnessing his unique talent.\n“I think last year, the year before, I probably would have been probably still out on the court right now, could be losing that match,” Kyrgios said.\nReporting by Martyn Herman; Editing by Christian Radnedge and Ken Ferris\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T18:53:00.000+02:00", "crawled": "2018-01-18T16:13:18.023+02:00", "highlightTitle": ""}