{"organizations": [], "uuid": "3e6dc62546783889c13c4fad35fdbb4d2914788c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-koerber-ag-m-a-sale/ugg-sale-highlights-still-strong-chinese-appetite-for-european-technology-idUSKBN1EZ1HC", "country": "US", "domain_rank": 408, "title": "UGG sale highlights still strong Chinese appetite for European technology", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T14:54:00.000+02:00", "replies_count": 0, "uuid": "3e6dc62546783889c13c4fad35fdbb4d2914788c"}, "author": "", "url": "https://www.reuters.com/article/us-koerber-ag-m-a-sale/ugg-sale-highlights-still-strong-chinese-appetite-for-european-technology-idUSKBN1EZ1HC", "ord_in_thread": 0, "title": "UGG sale highlights still strong Chinese appetite for European technology", "locations": [], "entities": {"persons": [{"name": "arno schuetze", "sentiment": "none"}, {"name": "koerber", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "ugg", "sentiment": "negative"}, {"name": "min read  frankfurt", "sentiment": "none"}, {"name": "united grinding group", "sentiment": "none"}, {"name": "koerber ag", "sentiment": "none"}, {"name": "jic", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "cic", "sentiment": "none"}, {"name": "carlyle ( cg.o", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKFURT (Reuters) - Two Chinese groups have reached the final round of bidding for Swiss-German machine tool maker United Grinding Group (UGG), people close to the matter said, signaling still strong Chinese appetite for manufacturing technology deals in Europe.\nBern-based UGG, owned by Germany’s industrial holding Koerber AG, makes tools to grind surfaces and small workpieces, and is seen fetching around 600 million euros ($720 million), the two sources said.\nAt least four groups made it to the final round of bidding and they include Chinese sovereign wealth fund CIC’s arm China Jianyin Investment (JIC), and a joint bid by Chinese machinery maker Sinomach ( 600444.SS ) and investor Sino-Ceef.\nTwo others are private equity firm Carlyle ( CG.O ) and an unnamed Western industrial group, the sources said, and final bids must be submitted by the end of this month.\nKoerber and the bidders declined to comment or were not immediately available for comment on their interest in UGG.\nThe Chinese interest is the latest sign of unabated demand for deals seen as strategic for the country, which are exempted from a state clampdown on Chinese foreign investment.\nThat policy reduced Chinese outbound mergers and acquisitions by a third last year to $140 billion, according to ThomsonReuters data. Mergers and acquisitions experts, however, expect that Chinese guidelines issued in November will help drive a rebound in outbound deals in 2018.\nThe acquisition of German high-tech robot maker Kuka by China’s Midea ( 000333.SZ ) in 2016 sparked criticism in Germany that key technologies were falling into foreign hands just as China protects its own companies against foreign takeovers, and Germany’s takeover code has since been tightened.\nWhile intensified scrutiny, including that of U.S. regulators, has derailed deals such as the sale of German chip maker Aixtron to a Chinese company, deals not touching on security issues are seen as unproblematic, dealmakers have said.\nKoerber is separately examining a possible Swiss stock market flotation of UGG, sources told Reuters last month. UGG expects earnings before interest, tax, depreciation and amortization of around 80 million euros this year and of slightly less than that in 2019, according to people familiar with the matter.\nFirst round bids came in at 7-7.5 times UGG’s expected 2018 core earnings, the sources said.\n($1 = 0.8333 euros)\nAdditional reporting by Kane Wu; Editing by Susan Fenton\n ", "external_links": [], "published": "2018-01-10T14:54:00.000+02:00", "crawled": "2018-01-10T15:11:36.005+02:00", "highlightTitle": ""}