{"organizations": [], "uuid": "7927c3230a35fcae3ca7320915283735ed0b558c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221969746&w=1200&r=LYNXMPEE0D0HV", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-germany-france-eurozone/berlin-and-paris-step-up-push-for-euro-zone-reform-deal-idUKKBN1F30SF", "country": "US", "domain_rank": 408, "title": "Berlin and Paris step up push for euro zone reform deal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T22:10:00.000+02:00", "replies_count": 0, "uuid": "7927c3230a35fcae3ca7320915283735ed0b558c"}, "author": "", "url": "https://uk.reuters.com/article/uk-germany-france-eurozone/berlin-and-paris-step-up-push-for-euro-zone-reform-deal-idUKKBN1F30SF", "ord_in_thread": 0, "title": "Berlin and Paris step up push for euro zone reform deal", "locations": [], "entities": {"persons": [{"name": "angela merkel", "sentiment": "none"}, {"name": "merkel", "sentiment": "none"}, {"name": "noah barkin", "sentiment": "none"}, {"name": "richard lough", "sentiment": "none"}, {"name": "reuters/fabrizio bensch  peter altmaier", "sentiment": "none"}, {"name": "bruno le maire", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "cdu", "sentiment": "none"}, {"name": "spd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 5:06 PM / Updated 4 hours ago Berlin and Paris step up push for euro zone reform deal Noah Barkin , Richard Lough 4 Min Read \nBERLIN/PARIS (Reuters) - Emboldened by a preliminary coalition deal between Chancellor Angela Merkel and   (SPD), Germany and France will try to inject new momentum into their stalled EU reform efforts this week when their finance ministers meet in Paris. Acting   Merkel (CDU) speaks during a press conference after exploratory talks about forming a new coalition government at the SPD headquarters in Berlin, Germany, January 12, 2018. REUTERS/Fabrizio Bensch \nPeter Altmaier, one of Merkel’s closest party allies, will pay a visit to his French counterpart Bruno Le Maire on Thursday, a day after leading French and German economists unveil new recommendations for a reform of the euro zone. \nThe meeting is a sign that Berlin is prepared to negotiate with Paris in parallel to Merkel’s coalition talks with the SPD, which could begin later this month if members of the centre-left party give a green light at a party congress next Sunday. \n“We have an acting government which can act and must continue to work,” Achim Post, deputy leader for the SPD in parliament, told Reuters. He said the coalition blueprint clinched on Friday would pave the way for a “paradigm shift” on Europe away from austerity and towards more investment and jobs. \nThe 28-page document was also welcomed by French President Emmanuel Macron, whose plans for an ambitious reform of the EU, including an overhaul of euro zone governance, were dealt a blow by an inconclusive German election in September and the political limbo that followed. \nThe draft, which could form the basis for Merkel’s third“grand coalition” government since taking power in 2005, raises the prospect of an “investment budget” for the single currency bloc, a nod to Macron’s call for a budget to help the euro zone cope with external economic shocks. \nIt also calls for the ESM bailout mechanism to be turned into a full-blown European Monetary Fund under parliamentary control and anchored in EU law. \nIn a sign of lingering divisions between Berlin and Paris, Macron on Friday questioned the logic of such a fund and stressed the need to complete the EU’s “banking union”, a vital project designed to sever the link between troubled banks and sovereign lenders. Berlin has been reluctant to move to the final stage by establishing a common deposit insurance scheme. \n“CRUNCH YEAR” \nAs Merkel was celebrating her deal with the SPD on Friday, Paris was rolling out the red carpet for Mario Centeno, the new president of the Eurogroup forum of euro zone finance ministers, in a signal to other countries that Macron means business. \n“It’s not insignificant and certainly not innocent in terms of the message,” a French finance ministry source said of the visit by Centeno, who met with Macron, Le Maire and Prime Minister Edouard Philippe. \nBerlin and Paris now face a race against time to reconcile differences over how to make the euro zone crisis-proof after years of financial trauma that nearly tore the 19-nation bloc apart. Merkel and Macron have promised to come up with a joint position by March. \n“2018 is a crunch year,” said the French source. “You’re moving into the European election period from early 2019 and onwards so the objective is to have something to show people.” \nTo help break the deadlock, a group of 14 economists, including Clemens Fuest, president of the Ifo Institute, and Jean Pisani-Ferry, a former adviser to Macron, will unveil new proposals on Wednesday that attempt to bridge German demands for more discipline and France’s insistence on more risk-sharing. \nTheir paper calls for an overhaul of euro area fiscal rules, which they call “complex and unreliable”, the creation of an independent fiscal watchdog, and a synthetic euro area “safe asset” that offers investors an alternative to sovereign bonds. Writing by Noah Barkin, editing by David Evans", "external_links": [], "published": "2018-01-14T22:10:00.000+02:00", "crawled": "2018-01-15T01:44:00.013+02:00", "highlightTitle": ""}