{"organizations": [], "uuid": "e0163b74b07ebc39c5ec73e4e2fb321e0e4ec769", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-intellicheck-appoints-new-board-member.html", "country": "US", "domain_rank": 767, "title": "Intellicheck Appoints New Board Member", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T16:13:00.000+02:00", "replies_count": 0, "uuid": "e0163b74b07ebc39c5ec73e4e2fb321e0e4ec769"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-intellicheck-appoints-new-board-member.html", "ord_in_thread": 0, "title": "Intellicheck Appoints New Board Member", "locations": [], "entities": {"persons": [{"name": "michael malone", "sentiment": "none"}, {"name": "intellicheck", "sentiment": "none"}, {"name": "ullman", "sentiment": "none"}, {"name": "david e. ullman", "sentiment": "none"}, {"name": "dave", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "jericho", "sentiment": "none"}], "organizations": [{"name": "idn", "sentiment": "negative"}, {"name": "intellicheck appoints new board", "sentiment": "negative"}, {"name": "intellicheck", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "jos. a. bank clothiers", "sentiment": "none"}, {"name": "men’s wearhouse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JERICHO, N.Y.--(BUSINESS WIRE)-- Intellicheck (NYSE AMERICAN: IDN), a trusted industry leader in real time identification authentication and threat identification technology solutions, today announced that David E. Ullman has been appointed to the Company’s board of directors.\n“Dave brings broad experience in retail and financial services. His skill set perfectly compliments Intellicheck’s vision for growth,” said Intellicheck Chairman of the Board Michael Malone.\nUllman has extensive business expertise with a strong focus on retail, strategic planning and growth, as well as mergers and acquisitions. A seasoned retail executive, he spent nearly twenty years as Executive Vice President and Chief Financial Officer for billion-dollar retailer, manufacturer and e-commerce company, Jos. A. Bank Clothiers. Ullman had an instrumental role in strategic planning and growth initiatives as well as mergers and acquisitions, which led to more than a decade of sustained profitable growth and a six-fold increase in sales. The iconic retailer was acquired by Men’s Wearhouse in 2014 for $1.8 billion.\nUllman has also held executive positions with Arthur Andersen and $750 million catalogue company Hanover Direct. Most recently, Ullman has served as Chief Operating Officer, Chief Financial Officer and minority owner of Paul Fredrick Menstyle, a private retail company focused on designer and direct-to-consumer men’s apparel and related accessories.\n“I am honored to join the Intellicheck board and work with this outstanding team,” Ullman said. “I look forward to sharing my experiences and contributing to the future direction and growth of this industry leader.”\nIntellicheck’s technology solutions read, analyze and process the encoded information on driver licenses and other government issued IDs. The cutting-edge products make it possible for clients to increase revenues, enhance the safety and awareness of their facilities and people, improve customer service, and increase operational efficiencies. Founded in 1994, Intellicheck has grown to serve dozens of Fortune 500 companies including financial industry, retail and other business clients, police departments, national defense clients at agencies, major seaports, and military bases, and diverse state and federal government agencies.\nAbout Intellicheck NYSE American: IDN Intellicheck is a trusted industry leader in technology solutions that provide real-time identification authentication and threat identification. Our technology solutions read, analyze and process the encoded information on driver licenses and other government issued IDs. The state-of-the-art products achieve a critical balance of efficacy and ease of adoption and use with real-time response and a 99.9% accuracy rate. We make it possible for our clients to increase revenues, enhance the safety and awareness of their facilities and people, improve customer service, and increase operational efficiencies. Founded in 1994, Intellicheck has grown to serve dozens of Fortune 500 companies including financial industry and business clients, police departments, national defense clients at agencies, major seaports, and military bases, and diverse state and federal government agencies. The Company holds 25 patents including many patents pertaining to identification technology. For more information on Intellicheck, visit http://www.intellicheck.com/ and follow Intellicheck on Twitter @IntellicheckIDN , on Instagram @IntellicheckIDN , on LinkedIn https://www.linkedin.com/company/intellicheck-inc- , on Facebook https://www.facebook.com/intellicheckidn/ , on YouTube https://www.youtube.com/user/ICMOBIL , and read Intellicheck’s latest blog post at http://intellicheckidn.com/ .\nSafe Harbor Statement\nStatements in this news release about Intellicheck’s future expectations, including: the advantages of our products, future demand for Intellicheck’s existing and future products, whether revenue and other financial metrics will improve in future periods, whether Intellicheck will be able to execute its turn-around plan or whether successful execution of the plan will result in increased revenues, whether sales of our products will continue at historic levels or increase, whether brand value and market awareness will grow, whether the Company can leverage existing partnerships or enter into new ones, and all other statements in this release, other than historical facts, are “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995 (PSLRA). These statements, which express management’s current views concerning future events, trends, contingencies or results, appear at various places in this website and use words like “anticipate,” “assume,” “believe,” “continue,” “estimate,” “expect,” “forecast,” “future,” “intend,” “plan,” “potential,” “predict,” “project,” “strategy,” “target” and similar terms, and future or conditional tense verbs like “could,” “may,” “might,” “should,” “will” and “would” are forward-looking statements within the meaning of the PSLRA. This statement is included for the express purpose of availing Intellicheck, Inc. of the protections of the safe harbor provisions of the PSLRA. It is important to note that actual results and ultimate corporate actions could differ materially from those in such forward-looking statements based on such factors as market acceptance of Intellicheck’s products and the presently anticipated growth in the commercial adoption of the Company’s products and services, changing levels of demand for Intellicheck’s current and future products, Intellicheck’s ability to reduce or maintain expenses while increasing sales, customer results achieved using our products in both the short and long term, success of future research and development activities, Intellicheck’s ability to successfully manufacture, market and sell its products, Intellicheck’s ability to manufacture its products in sufficient quantities to meet demand within required delivery time periods while meeting its quality control standards, any delays or difficulties in the Company’s supply chain, the success of the Company’s sales and marketing efforts coupled with the typically long sales and implementation cycle for its products, Intellicheck’s ability to enforce its intellectual property rights, changes in laws and regulations applicable to the Company’s products, the Company’s continued ability to access government-provided data, the risks inherent in doing business with the government including audits and contract cancellations, liability resulting from any security breaches or product failure, and other risks detailed from time to time in Intellicheck’s reports filed with the SEC. We do not assume any obligation to update the forward-looking information.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180118005102/en/\nIntellicheck\nMedia and Public Relations:\nSharon Schultz, 302-539-3747\nor\nInvestor Relations:\nGar Jackson, 949-873-2789\nSource: Intellicheck", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.facebook.com%2Fintellicheckidn%2F&esheet=51744792&newsitemid=20180118005102&lan=en-US&anchor=https%3A%2F%2Fwww.facebook.com%2Fintellicheckidn%2F&index=7&md5=ebb4ee2686b72744f240b7224f695a0d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2FIntellicheckIDN%2F&esheet=51744792&newsitemid=20180118005102&lan=en-US&anchor=%40IntellicheckIDN&index=4&md5=8652e7f6a11a20e30dce8a2e5fb9ff92", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.instagram.com%2Fintellicheckidn%2F&esheet=51744792&newsitemid=20180118005102&lan=en-US&anchor=%40IntellicheckIDN&index=5&md5=a726ce9a62b05174b6799c1a3894c3da", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2FIntellicheckIDN%2F&esheet=51744792&newsitemid=20180118005102&lan=en-US&anchor=Twitter&index=3&md5=6d25b011d23fc2c1487c8974e33fe913", "http://intellicheckidn.com/", "http://www.businesswire.com/news/home/20180118005102/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fintellicheckidn.com%2F&esheet=51744792&newsitemid=20180118005102&lan=en-US&anchor=http%3A%2F%2Fintellicheckidn.com%2F&index=9&md5=85964a89d2317f9d67d449f46cce43ad", "https://www.facebook.com/intellicheckidn/", "https://www.youtube.com/user/ICMOBIL", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.youtube.com%2Fuser%2FICMOBIL&esheet=51744792&newsitemid=20180118005102&lan=en-US&anchor=https%3A%2F%2Fwww.youtube.com%2Fuser%2FICMOBIL&index=8&md5=4412dea583bafef49cb3dabcd6f44601", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.intellicheck.com%2F&esheet=51744792&newsitemid=20180118005102&lan=en-US&anchor=http%3A%2F%2Fwww.intellicheck.com%2F&index=2&md5=bddb1db795ce3daa65c26d1423c5041a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fintellicheck-inc-&esheet=51744792&newsitemid=20180118005102&lan=en-US&anchor=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fintellicheck-inc-&index=6&md5=abeffca0c304b11b14c718cc68fdcc85", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.intellicheck.com%2F&esheet=51744792&newsitemid=20180118005102&lan=en-US&anchor=Intellicheck&index=1&md5=763967864f8a70ac4455ddfe2ce1e759", "https://www.linkedin.com/company/intellicheck-inc-", "http://www.intellicheck.com/"], "published": "2018-01-18T16:13:00.000+02:00", "crawled": "2018-01-18T16:34:02.004+02:00", "highlightTitle": ""}