{"organizations": [], "uuid": "71d0400a590eac0000fa6eee4e07a9f915705154", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-veracyte-announces-strategic-realignment-and-new-appointments-to-advance-commercial-growth.html", "country": "US", "domain_rank": 767, "title": "Veracyte Announces Strategic Realignment and New Appointments to Advance Commercial Growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.047, "site_type": "news", "published": "2018-01-08T15:30:00.000+02:00", "replies_count": 0, "uuid": "71d0400a590eac0000fa6eee4e07a9f915705154"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-veracyte-announces-strategic-realignment-and-new-appointments-to-advance-commercial-growth.html", "ord_in_thread": 0, "title": "Veracyte Announces Strategic Realignment and New Appointments to Advance Commercial Growth", "locations": [], "entities": {"persons": [{"name": "jessica meng", "sentiment": "none"}, {"name": "john hanna", "sentiment": "none"}, {"name": "giulia c. kennedy", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Company Reiterates 2017 Revenue and Cash Burn Guidance\nSOUTH SAN FRANCISCO, Calif.--(BUSINESS WIRE)-- Veracyte, Inc. (NASDAQ: VCYT) today announced key business initiatives, including strategic realignments to its corporate structure and new appointments, to advance commercial growth of its three market-leading genomic tests. The company also reiterated its previous 2017 revenue and cash burn guidance.\nVeracyte is consolidating its clinical, medical and research and development functions into one department to ensure a strong, consistent focus on addressing unmet customer needs and supporting the sales and marketing team. The new scientific, clinical and medical affairs department will be headed by Giulia C. Kennedy, Ph.D., who has served as chief scientific officer since the company’s founding in 2008. Veracyte has also expanded its sales team to 73 specialists under the direction of eight regional sales directors who will report directly to John Hanna, the company’s chief commercial officer. In addition, the company has appointed Jessica Meng as vice president of marketing. Ms. Meng comes to Veracyte from Genentech where she led marketing for Avastin ® in oncology.\n“Our company is at a unique moment in time, in which we have market-leading and first-to-market tests in three largely untapped clinical markets,” said Bonnie Anderson, chairman and chief executive officer of Veracyte. “We believe these strategic realignments and new appointments will enable us to more actively manage the dynamics of our business and focus our investments to optimize these significant commercial opportunities.”\nVeracyte is reiterating its previous 2017 annual revenue guidance of $71 million to $72 million and its annual cash burn guidance of $25 million to $26 million. The annual cash burn guidance excludes the $1.5 million exit fee for the refinance of its senior secured credit facility. Cash burn is defined as the sum of net cash used in operating activities and net capital expenditures. The company also announced that it expects fourth quarter 2017 reported genomic test volume for its Afirma ® and Percepta ® classifiers to be approximately 7,100 tests – a 12.5% increase compared to the fourth quarter of 2016.\nAfirma and Percepta are used to improve the diagnosis of thyroid cancer and lung cancer, respectively, without the need for invasive, risky and expensive surgery. The company’s third product – the Envisia™ Genomic Classifier – is positioned to gain Medicare coverage in 2018 and is similarly used to improve the diagnosis of idiopathic pulmonary fibrosis.\nAbout Veracyte\nVeracyte (NASDAQ: VCYT) is a leading genomic diagnostics company that is providing trustworthy and actionable answers that fundamentally improve patient care when current diagnostic tests are uncertain. The company's products uniquely combine genomic technology, clinical science and machine learning to provide answers that give physicians and patients a clear path forward without risky, costly surgery that is often unnecessary. Since its founding in 2008, Veracyte has commercialized three genomic tests, which are transforming the diagnosis of thyroid cancer, lung cancer and idiopathic pulmonary fibrosis and collectively target a $2 billion market opportunity. Veracyte is based in South San Francisco, California. For more information, please visit www.veracyte.com and follow the company on Twitter (@veracyte).\nCautionary Note Regarding Forward-Looking Statements\nThis press release contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by words such as: \"anticipate,\" \"intend,\" \"plan,\" \"expect,\" \"believe,\" \"should,\" \"may,\" \"will\" and similar references to future periods. Examples of forward-looking statements include, among others, our 2017 revenue and cash burn guidance and expected genomic test volume, our ability to manage our future business and optimize our commercial opportunities, and the expected utility and benefits of our tests, including our belief that the use of our tests will enable the diagnosis of disease without the need for invasive, risky and expensive surgical procedure. Forward-looking statements are neither historical facts nor assurances of future performance. Instead, they are based only on our current beliefs, expectations and assumptions regarding the future of our business, future plans and strategies, anticipated events and trends, the economy and other future conditions. Forward-looking statements involve risks and uncertainties, which could cause actual results to differ materially, and reported results should not be considered as an indication of future performance. These risks and uncertainties include, but are not limited to: the benefits of our tests, the applicability of clinical results to actual outcomes; laws and regulations applicable to our business, including potential regulation by the Food and Drug Administration or other regulatory bodies; our ability to successfully achieve and maintain adoption of and reimbursement for our products; the amount by which use of our products is able to reduce invasive procedures and misdiagnosis, and reduce healthcare costs; the occurrence and outcomes of clinical studies; and other risks set forth in the company's filings with the Securities and Exchange Commission, including the risks set forth in the company's Quarterly Report on Form 10-Q for the quarter ended September 30, 2017. These forward-looking statements speak only as of the date hereof and Veracyte specifically disclaims any obligation to update these forward-looking statements or reasons why actual results might differ, whether as a result of new information, future events or otherwise, except as required by law.\nVeracyte, Afirma, Percepta, Envisia, the Veracyte logo, and the Afirma logo are trademarks of Veracyte, Inc.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108005607/en/\nVeracyte\nMedia:\nTracy Morris, 650-380-4413\ntracy.morris@veracyte.com\nor\nInvestors:\nJackie Cossmon, 650-243-6371\njackie@veracyte.com\nSource: Veracyte", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.veracyte.com&esheet=51739204&newsitemid=20180108005607&lan=en-US&anchor=www.veracyte.com&index=2&md5=865c61361ae4a66d4868719495372922", "http://www.businesswire.com/news/home/20180108005607/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.veracyte.com%2F&esheet=51739204&newsitemid=20180108005607&lan=en-US&anchor=Veracyte%2C+Inc.&index=1&md5=914ee60167fa0f19720e0ef40e0b20a3"], "published": "2018-01-08T15:30:00.000+02:00", "crawled": "2018-01-08T19:20:55.007+02:00", "highlightTitle": ""}