{"organizations": [], "uuid": "caa7318cde9eb359245b8f8d7ba414a9703c9d5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-houlihan-lokey-reports-third-quarter-fiscal-2018-financial-results.html", "country": "US", "domain_rank": 767, "title": "Houlihan Lokey Reports Third Quarter Fiscal 2018 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.013, "site_type": "news", "published": "2018-01-30T00:15:00.000+02:00", "replies_count": 0, "uuid": "caa7318cde9eb359245b8f8d7ba414a9703c9d5b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-houlihan-lokey-reports-third-quarter-fiscal-2018-financial-results.html", "ord_in_thread": 0, "title": "Houlihan Lokey Reports Third Quarter Fiscal 2018 Financial Results", "locations": [], "entities": {"persons": [{"name": "houlihan lokey", "sentiment": "negative"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "– Record Third Quarter Fiscal 2018 Revenue of $259 million, up 5% Year-Over-Year –\n– Third Quarter Fiscal 2018 Diluted EPS of $0.93, up 82% Year-Over-Year –\n– Adjusted Third Quarter Fiscal 2018 Diluted EPS of $0.69, up 21% Year-Over-Year –\n– Announces Dividend of $0.20 per Share for Fourth Quarter Fiscal 2018 –\nLOS ANGELES & NEW YORK--(BUSINESS WIRE)-- Houlihan Lokey, Inc. (NYSE:HLI) (“Houlihan Lokey”, the “Company”), the global investment bank, today reported financial results for its third quarter ended December 31, 2017. For the third quarter, total revenue grew 5% to a record $259 million, compared with $248 million for the third quarter ended December 31, 2016.\nNet income grew 81% to $62 million, or $0.93 per diluted share, for the third quarter ended December 31, 2017, compared with $34 million, or $0.51 per diluted share, for the third quarter ended December 31, 2016. Adjusted net income for the third quarter ended December 31, 2017 grew 20% to $46 million, or $0.69 per diluted share, compared with $38 million, or $0.57 per diluted share, for the third quarter ended December 31, 2016.\n\"We are pleased to report the highest quarterly revenues in our firm's history. This was achieved with all three of our business segments reporting an increase in quarterly revenues when compared to the same period last year. In calendar 2017, we were once again ranked as the #1 M&A advisor for all U.S. transactions under $1 billion and the #1 global financial restructuring advisor both in terms of number of transactions and value. We are optimistic about the current business climate and the opportunities that exist for the firm. We believe that tax reform will be net positive for our clients, our business and our shareholders,” stated Scott Beiser, Chief Executive Officer of Houlihan Lokey.\nSelected Financial Data\n(Unaudited and in thousands, except per share data)\nU.S. GAAP Three Months Ended\nDecember 31, Nine Months Ended\nDecember 31, 2017 2016 2017 2016 Fee revenue $258,937 $247,680 $718,611 $614,991 Operating expenses: Employee compensation and benefits 174,308 164,971 481,112 411,677 Non-compensation expenses 30,144 25,886 82,815 78,653 Total operating expenses 204,452 190,857 563,927 490,330 Operating income 54,485 56,823 154,684 124,661 Other (income) expense, net (632 ) 1,084 (2,338 ) 2,741 Income before provision for income taxes 55,117 55,739 157,022 121,920 Provision/(benefit) for income taxes (6,466 ) 21,759 22,838 47,653 Net income attributable to Houlihan Lokey, Inc. $61,583 $33,980 $134,184 $74,267 Diluted net income per share of common stock $0.93 $0.51 $2.02 $1.11 Revenues\nFor the third quarter ended December 31, 2017, total fee revenue grew 5% to $259 million from $248 million for the third quarter ended December 31, 2016. For the quarter, Corporate Finance (\"CF\") revenues increased 5%, Financial Restructuring (\"FR\") revenues increased 4%, and Financial Advisory Services (\"FAS\") revenues increased 4% when compared with the third quarter ended December 31, 2016.\nExpenses\nThe Company’s employee compensation and benefits and non-compensation expenses during the periods presented and described below are on a GAAP, an adjusted, and an adjusted awarded basis, as appropriate.\n(Unaudited and in thousands)\nThree Months Ended December 31, U.S. GAAP Adjusted (Non-GAAP)* 2017 2016 2017 2016 Expenses: Employee compensation and benefits $174,308 $164,971 $164,423 $158,516 % of Revenues 67.3 % 66.6 % 63.5 % 64.0 % Non-compensation expenses $30,144 $25,886 $28,869 $25,886 % of Revenues 11.6 % 10.5 % 11.1 % 10.5 % Total operating expenses $204,452 $190,857 $193,292 $184,402 % of Revenues 79.0 % 77.1 % 74.6 % 74.5 % Adjusted awarded employee compensation and benefits $168,307 $162,233 % of Revenues 65.0 % 65.5 % (Unaudited and in thousands)\nNine Months Ended December 31,\nU.S. GAAP Adjusted (Non-GAAP)* 2017 2016 2017 2016 Expenses: Employee compensation and benefits $481,112 $411,677 $458,615 $392,216 % of Revenues 67.0 % 66.9 % 63.8 % 63.8 % Non-compensation expenses $82,815 $78,653 $81,540 $78,653 % of Revenues 11.5 % 12.8 % 11.3 % 12.8 % Total operating expenses $563,927 $490,330 $540,155 $470,869 % of Revenues 78.5 % 79.7 % 75.2 % 76.6 % Adjusted awarded employee compensation and benefits $469,393 $401,900 % of Revenues 65.3 % 65.4 % *Note: The adjusted and adjusted awarded figures represent non-GAAP information. See “Non-GAAP Financial Measures” and the tables at the end of this release for an explanation of the adjustments and reconciliations to the comparable GAAP numbers.\nTotal operating expenses were $204 million for the third quarter ended December 31, 2017, an increase of 7% when compared with $191 million in operating expenses for the third quarter ended December 31, 2016. Employee compensation and benefits expenses were $174 million for the third quarter ended December 31, 2017, compared with $165 million for the third quarter ended December 31, 2016. The increase in employee compensation and benefits expenses was primarily a result of the growth in revenues for the quarter.\nTotal adjusted operating expenses were $193 million for the third quarter ended December 31, 2017, an increase of 5% when compared with $184 million in adjusted operating expenses for the third quarter ended December 31, 2016. Adjusted employee compensation and benefits expenses were $164 million for the third quarter ended December 31, 2017, compared with $159 million for the third quarter ended December 31, 2016. The increase in adjusted employee compensation and benefits expenses were primarily a result of the growth in revenues for the quarter. This resulted in an adjusted compensation ratio of 63.5% for the third quarter ended December 31, 2017, compared with 64.0% for the third quarter ended December 31, 2016.\nNon-compensation expenses were $30 million for the third quarter ended December 31, 2017, compared with $26 million for the third quarter ended December 31, 2016, an increase of 16%. Non-compensation expenses increased primarily as a result of higher general operating expenses during the third quarter ended December 31, 2017. Adjusted non-compensation expenses were $29 million for the third quarter ended December 31, 2017, compared with $26 million for the third quarter ended December 31, 2016, an increase of 12%. Adjusted non-compensation expenses increased primarily as a result of higher general operating expenses during the third quarter ended December 31, 2017.\nThe provision/(benefit) for income taxes was $(6) million, representing an effective tax rate of (12)% for the third quarter ended December 31, 2017, compared with $22 million, representing an effective tax rate of 39% for the third quarter ended December 31, 2016. The significant decrease in the effective tax rate was a result of (i) the Tax Cuts and Jobs Acts (the \"Tax Act\") that was enacted into law in December 2017 that resulted in a lower effective federal tax rate; the re-measurement of deferred tax assets and liabilities based on the new tax rate; and a one-time deemed repatriation tax on foreign earnings, and (ii) the positive difference between the price of the stock at the time of vesting in October 2017 (accelerated from April/May 2018) and our stock price at the time of grant for the shares that vested. The adjusted provision for income taxes was $21 million, representing an adjusted effective tax rate of 31% for the third quarter ended December 31, 2017, compared with $24 million, representing an adjusted effective tax rate of 39% for the third quarter ended December 31, 2016. The decrease in the adjusted effective tax rate was a result of a lower statutory federal tax rate per the Tax Act.\nSegment Reporting for the Third Quarter\nFor the third quarter ended December 31, 2017, Corporate Finance revenue grew 5% to $129 million, compared with $123 million during the third quarter ended December 31, 2016. The growth in revenues was driven by an increase in the number of closed transactions. CF closed 54 transactions in the third quarter ended December 31, 2017, versus 50 transactions in the third quarter ended December 31, 2016. Segment profit equaled $34 million for the third quarter ended December 31, 2017, compared with $40 million for the third quarter ended December 31, 2016. Segment profitability decreased primarily as a result of higher employee compensation and benefits as a percentage of revenues when compared to the same quarter of the prior year.\n(Unaudited and $ in thousands)\nThree Months Ended\nDecember 31, Nine Months Ended\nDecember 31, 2017 2016 2017 2016 Corporate Finance Revenues $129,002 $123,240 $398,822 $319,483 Segment Profit¹ 33,903 40,423 129,689 91,517 # of MDs 95 90 95 90 # of Closed Transactions 54 50 170 154 For the third quarter ended December 31, 2017, Financial Restructuring revenue grew 4% to $94 million, compared with $90 million during the third quarter ended December 31, 2016. The growth in revenues was driven primarily by a significant increase in the average transaction fee per closed transaction. FR closed 19 transactions in the third quarter ended December 31, 2017, versus 23 transactions in the third quarter ended December 31, 2016. Segment profit was $33 million for the third quarter ended December 31, 2017, compared with $25 million for the third quarter ended December 31, 2016, an increase of 33%. The increase in profitability was primarily a result of lower employee compensation and benefits expenses as a percentage of revenues when compared to the same quarter last year.\n(Unaudited and $ in thousands)\nThree Months Ended\nDecember 31, Nine Months Ended\nDecember 31, 2017 2016 2017 2016 Financial Restructuring Revenues $94,160 $90,180 $216,470 $203,372 Segment Profit¹ 32,777 24,664 51,352 55,542 # of MDs 42 42 42 42 # of Closed Transactions 19 23 51 45 For the third quarter ended December 31, 2017, Financial Advisory Services revenue grew 4% to $36 million, compared with $34 million in the third quarter ended December 31, 2016. Revenues for FAS increased primarily as a result of strong performance by our transaction advisory and portfolio valuation businesses, and our intellectual property business continues to grow. Segment profit was $6 million for the third quarter ended December 31, 2017, compared with $9 million for the third quarter ended December 31, 2016. Segment profitability decreased primarily as a result of higher employee compensation and benefits and increased non-compensation expenses when compared to the same quarter last year.\n(Unaudited and $ in thousands)\nThree Months Ended\nDecember 31, Nine Months Ended\nDecember 31, 2017 2016 2017 2016 Financial Advisory Services Revenues $35,774 $34,260 $103,319 $92,136 Segment Profit¹ 5,585 8,506 20,777 21,776 # of MDs 37 34 37 34 # of Fee Events 2 537 517 1,071 950 1. We adjust the compensation expense for a business segment in situations where an employee residing in one business segment is performing work in another business segment where the revenues are accrued. We account for the compensation expense in the business segment where the employee resides.\n2. A Fee Event includes any engagement that involves revenue activity during the measurement period based on a revenue minimum of $1,000 (one thousand dollars).\nBalance Sheet and Capital Allocation\nThe Board of Directors of the Company declared a regular quarterly cash dividend of $0.20 per share of Class A and Class B common stock. The dividend will be payable on March 15, 2018 to stockholders of record as of the close of business on March 2, 2018.\nDuring the third quarter ended December 31, 2017, the Company accelerated the vesting of 1.7 million shares of common stock, and as a result of tax withholding associated with this acceleration, the Company retired 806,248 shares of common stock at an average price of $41.28 per share for a total cost of $33.3 million.\nAs of December 31, 2017, the Company had $330 million of cash and cash equivalents and investment securities, and loans payable aggregating $12 million.\nInvestor Conference Call and Webcast\nThe Company will host a conference call and live webcast at 5:00 p.m. Eastern Daylight Time on Monday, January 29, 2018, to discuss its third quarter fiscal year 2018 results. The number to call is 1-800-239-9838 (domestic) or 1-323-794-2551 (international). A live webcast will be available in the Investor Relations section of the Company’s website. A replay of the conference call will be available on January 29, 2018 through February 5, 2018, by dialing 1-844-512-2921 (domestic) or 1-412-317-6671 (international) and entering the passcode 7775356#. A replay of the webcast will be archived and available on the Company’s website.\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of the federal securities laws. You can identify these statements by our use of the words “assumes,” “believes,” “estimates,” “expects,” “guidance,” “intends,” “plans,” “projects,” and similar expressions that do not relate to historical matters. You should exercise caution in interpreting and relying on forward-looking statements because they involve known and unknown risks, uncertainties, and other factors which are, in some cases, beyond the Company’s control and could materially affect actual results, performance, or achievements. For a further description of such factors, you should read the Company’s filings with the Securities and Exchange Commission. The Company does not undertake any obligation to update or revise any forward-looking statement, whether as a result of new information, future events, or otherwise.\nNon-GAAP Financial Measures\nAdjusted net income, total and on a per share basis, and adjusted operating expenses are presented and discussed in this earnings press release and are non-GAAP measures that management believes, when presented together with comparable GAAP measures, are useful to investors in understanding the Company’s operating results. Adjusted net income and adjusted operating expenses remove the significant accounting impact of one-time charges associated with the Company’s IPO and other matters, as set forth in the tables at the end of this release.\nAdjusted net income and adjusted operating expenses as calculated by the Company are not necessarily comparable to similarly titled measures reported by other companies. Additionally, adjusted net income is not a measurement of financial performance or liquidity under GAAP and should not be considered as an alternative to the Company’s financial information determined under GAAP. For a description of the Company’s use of adjusted net income and a reconciliation with net income, as well as a reconciliation of the specific line items in adjusted operating expenses, see the section of this press release titled “Reconciliation of GAAP to Adjusted Financial Information.” Please refer to our financial statements, prepared in accordance with GAAP, for purposes of evaluating our financial condition, results of operations, and cash flows.\nAbout Houlihan Lokey\nHoulihan Lokey (NYSE:HLI) is a global investment bank with expertise in mergers and acquisitions, capital markets, financial restructuring, valuation, and strategic consulting. The firm serves corporations, institutions, and governments worldwide with offices in the United States, Europe, the Middle East, and the Asia-Pacific region. Independent advice and intellectual rigor are hallmarks of the firm's commitment to client success across its advisory services. Houlihan Lokey is ranked as the No. 1 M&A advisor for all U.S. transactions, the No. 1 global restructuring advisor, and the No. 1 global M&A fairness opinion advisor over the past 20 years, according to Thomson Reuters. For more information, please visit www.HL.com .\nAppendix\nConsolidated Balance Sheet (Unaudited)\nConsolidated Statement of Income (Unaudited)\nReconciliation of GAAP to Adjusted Financial Information (Unaudited)\nHoulihan Lokey, Inc.\nConsolidated Balance Sheet\n(In thousands, except share data and par value)\nDecember 31,\n2017 March 31,\n2017 (unaudited) (audited) Assets: Cash and cash equivalents $197,178 $300,314 Restricted cash — 192,372 Investment securities 132,835 — Accounts receivable, net of allowance for doubtful accounts 33,543 60,718 Unbilled work in process 41,528 57,682 Income taxes receivable 12,492 — Receivable from affiliates 7,108 10,913 Property and equipment, net of accumulated depreciation 32,171 30,416 Goodwill and other intangibles 721,689 715,343 Other assets 19,074 17,949 Total assets $1,197,618 $1,385,707 Liabilities and Stockholders' Equity Liabilities: Accrued salaries and bonuses 281,080 336,465 Accounts payable and accrued liabilities 36,717 41,655 Deferred income 3,790 3,717 Income taxes payable — 4,937 Deferred income taxes 25,918 31,196 Forward repurchase liability — 192,372 Loan payable to affiliate — 15,000 Loans payable to former shareholders 3,422 5,482 Loan payable to non-affiliate 8,787 12,080 Other liabilities 9,293 12,348 Total liabilities 369,007 655,252 Redeemable Non-Controlling Interest 4,714 3,838 Shareholders' Equity: Class A common stock, $0.001 par value. Authorized 1,000,000,000 shares; issued and\noutstanding 26,599,555 and 22,026,811 shares as of December 31, 2017 and March 31, 2017, respectively\n27 22 Class B common stock, $0.001 par value. Authorized 1,000,000,000 shares; issued and\noutstanding 39,291,756 and 50,883,299 shares as of December 31, 2017 and March 31, 2017, respectively\n39 51 Treasury stock, at cost; 0 and 6,900,000 shares as of December 31, 2017 and March 31, 2017, respectively — (193,572 ) Additional paid-in capital 655,108 854,750 Retained earnings 181,999 87,407 Accumulated other comprehensive loss (13,276 ) (21,917 ) Stock subscription receivable — (124 ) Total shareholders' equity 823,897 726,617 Total liabilities and shareholders' equity $1,197,618 $1,385,707 Houlihan Lokey, Inc.\nConsolidated Statement of Income\n(Unaudited and in thousands, except share and per share data)\nThree Months Ended\nDecember 31,\nNine Months Ended\nDecember 31, 2017 2016 2017 2016 Fee revenue $258,937 $247,680 $718,611 $614,991 Operating expenses: Employee compensation and benefits 174,308 164,971 481,112 411,677 Travel, meals, and entertainment 8,034 4,782 19,941 15,927 Rent 7,159 7,012 21,308 20,748 Depreciation and amortization 1,971 2,277 6,120 6,898 Information technology and communications 4,424 4,631 13,666 13,482 Professional fees 4,484 2,783 10,242 8,214 Other operating expenses 3,538 3,401 10,025 10,940 Provision for bad debt 534 1,000 1,513 2,444 Total operating expenses 204,452 190,857 563,927 490,330 Operating income 54,485 56,823 154,684 124,661 Other (income) expense, net (632 ) 1,084 (2,338 ) 2,741 Income before provision for income taxes 55,117 55,739 157,022 121,920 Provision/(benefit) for income taxes (6,466 ) 21,759 22,838 47,653 Net income attributable to Houlihan Lokey, Inc. $61,583 $33,980 $134,184 $74,267 Weighted average shares of common stock outstanding: Basic 62,552,777 61,104,822 62,338,102 60,941,996 Fully Diluted 66,122,939 66,692,326 66,467,378 66,619,214 Net income per share of common stock: Basic $0.98 $0.56 $2.15 $1.22 Fully Diluted $0.93 $0.51 $2.02 $1.11 Houlihan Lokey, Inc.\nReconciliation of GAAP to Adjusted Financial Information\n(Unaudited and in thousands, except per share data)\nThree Months Ended\nDecember 31, Nine Months Ended\nDecember 31, 2017 2016 2017 2016 Fee revenue $258,937 $247,680 $718,611 $614,991 Employee Compensation and Benefits Employee Compensation and Benefits (GAAP) $174,308 $164,971 $481,112 $411,677 Less/Plus: Adjustments 1 (9,885 ) (6,455 ) (22,497 ) (19,461 ) Employee Compensation and Benefits (Adjusted) 164,423 158,516 458,615 392,216 Less/Plus: Adjustments 2 3,884 3,717 10,778 9,684 Employee Compensation and Benefits (Adjusted Awarded) 168,307 162,233 469,393 401,900 Non-Compensation Expenses Non-Compensation Expenses (GAAP) $30,144 $25,886 $82,815 $— $78,653 Less/Plus: Adjustments 3 (1,275 ) — (1,275 ) — Non-Compensation Expenses (Adjusted) 28,869 25,886 81,540 — 78,653 Operating Income Operating Income (GAAP) $54,485 $56,823 $154,684 $124,661 Less/Plus: Adjustments 4 11,160 6,455 23,772 19,461 Operating Income (Adjusted) 65,645 63,278 178,456 144,122 Other (Income) Expenses, net Other (Income) Expenses, net (GAAP) ($632 ) $1,084 ($2,338 ) $2,741 Less/Plus: Adjustments 5 — — 1,552 — Other (Income) Expenses, net (Adjusted) (632 ) 1,084 (786 ) 2,741 Provision/(benefit) for Income Taxes Provision/(benefit) for Income Taxes (GAAP) ($6,466 ) $21,759 $22,838 $47,653 Less/Plus: Adjustments 6 27,163 2,520 40,767 7,631 Provision for Income Taxes (Adjusted) 20,697 24,279 63,605 55,284 Net Income Net Income (GAAP) $61,583 $33,980 $134,184 $74,267 Less/Plus: Adjustments 7 (16,003 ) 3,935 (18,547 ) 11,830 Net Income (Adjusted) 45,580 37,915 115,637 86,097 Diluted adjusted net income per share of common stock $0.69 $0.57 $1.74 $1.29", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.HL.com&esheet=51750441&newsitemid=20180129006098&lan=en-US&anchor=www.HL.com&index=1&md5=61046815e80f62f21e4e750e200ce833"], "published": "2018-01-30T00:15:00.000+02:00", "crawled": "2018-01-30T03:40:10.023+02:00", "highlightTitle": ""}