{"organizations": [], "uuid": "03eb5f8ca99e077724022734a6d0d84504816482", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/20/104539833-GettyImages-493893250-elon-musk-tesla.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/tesla-updates-elon-musk-confirmed-via-twitter.html", "country": "US", "domain_rank": 767, "title": "Tesla updates Elon Musk confirmed via Twitter", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-16T20:18:00.000+02:00", "replies_count": 0, "uuid": "03eb5f8ca99e077724022734a6d0d84504816482"}, "author": "Catherine Clifford", "url": "https://www.cnbc.com/2018/01/16/tesla-updates-elon-musk-confirmed-via-twitter.html", "ord_in_thread": 0, "title": "Tesla updates Elon Musk confirmed via Twitter", "locations": [], "entities": {"persons": [{"name": "tesla", "sentiment": "negative"}, {"name": "elon musk", "sentiment": "negative"}, {"name": "musk", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "tesla motors", "sentiment": "negative"}, {"name": "getty images elon musk", "sentiment": "negative"}, {"name": "twitter cnbc.com vcg", "sentiment": "negative"}, {"name": "spacex", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Billionaire tech entrepreneur Elon Musk is pretty active on Twitter, making time to respond to consumer feedback. And lately he's also been dropping hints about what to expect in future Tesla models.\nAs CEO of electric vehicle company Tesla and aerospace company SpaceX, Musk's interaction with consumers is not only smart leadership , but it's also won him praise from his fan base .\nHere are a handful of the updates Musk has made in recent weeks.\n1. Automatic heated steering wheel can you please make the heated steering wheel automatically turn back on when I start my car up...if it was on the last time I was in the car...like the heated front seats. \n2. Ability to operate \"pretty much anything\" with voice command Definitely. You will be able to do pretty much anything via voice command. Software team is focused on core Model 3 functionality right now, but that will be done soon, then we will add a lot more features \n3. Digital trophy for visiting Tesla charging station set up like an old school movie drive-in At the beginning of last week, Musk tweeted that he would build a Tesla charging station modeled after an old-school movie drive in.\nThat sounds cool. Will do. \n4. Windshield wipers that don't start until you're in the car   Fixed in next release \n5. Windshield wipers that automatically adjust based on how hard it's raining Simple one — windshield wipers on @Tesla that automatically change speed based on how much rain there is \n6. Camera that automatically starts recording if a car is broken into It would be great if the cameras would switch on and record if the car is been broken in to. So if the window is smashed in, the cameras could activate and record. \nWhile the updates may be exciting, Tesla has been facing production delays. In January, Tesla released Model 3 delivery numbers that fell short of expectations.\nAnalysts who cover the company fret about the slow pace of delivery and the rapid pace at which Tesla is burning through cash trying to deliver.\nSee also: \nElon Musk says he'll build a Tesla charging station in LA that is set up like 'an old school drive-in' \nWith one simple tweet, Elon Musk shows a masterful lesson in leadership \nBillionaire Elon Musk responds to unhappy Tesla customer on a Friday night, teaching a brilliant lesson in customer service \nshow chapters Billionaire Elon Musk responds to unhappy Tesla customer      1:59 PM ET Mon, 18 Sept 2017 | 00:50 Like this story? Like CNBC Make It on Facebook", "external_links": [], "published": "2018-01-16T20:18:00.000+02:00", "crawled": "2018-01-16T20:36:47.010+02:00", "highlightTitle": ""}