{"organizations": [], "uuid": "41456baaed008e136b33275466161433345dcba3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/rtx474ne.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/17/central-bank-forecasts/", "country": "US", "domain_rank": 1196, "title": "Which Central Bank Is the Most Accurate Forecaster? | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.637, "site_type": "news", "published": "2018-01-17T13:44:00.000+02:00", "replies_count": 0, "uuid": "41456baaed008e136b33275466161433345dcba3"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/17/central-bank-forecasts/", "ord_in_thread": 0, "title": "Which Central Bank Is the Most Accurate Forecaster? | Fortune", "locations": [], "entities": {"persons": [{"name": "mark carney", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "bank", "sentiment": "neutral"}, {"name": "european central bank", "sentiment": "none"}, {"name": "bank of canada", "sentiment": "none"}, {"name": "u.s. federal reserve", "sentiment": "none"}, {"name": "boe", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 11:44 AM EST \nNo central bank is perfect but for forecasting its key metric, the Bank of England is at the bottom of the pile. \nThe three-century-old institution has the worst track record for predicting inflation in its home economy, according to the latest Bloomberg ranking of Group of Seven central banks. The Bank of Canada has the best. \nUnlike its major peers, the European Central Bank and the U.S. Federal Reserve, the BOE tends to undershoot on its consumer-price forecasts, although that seems to be changing. Its prediction for inflation two years ahead was lower than the eventual outcome in each of the eight years through 2013, with an average undershoot of 1.3 percentage points. Since then, it’s gone the other way, with an overshoot of about 1.1 percentage points. \nForecasting is a critical concern for central-bank credibility as it provides the basis for monetary-policy decisions that affect the companies and households of the real economy. At the BOE, Governor Mark Carney and his fellow policy makers have just raised their benchmark interest rate for the first time in more than a decade, citing the outlook for inflation. \nProjections that don’t come to pass are one more stick to use to beat central banks and the unelected technocrats who run them. Monetary institutions have come under increased fire since the financial crisis for measures like quantitative easing and negative interest rates that some say have fueled inequality. \nTo compile its results, Bloomberg looked at inflation projections two years ahead and gross domestic product estimates one year ahead, and compared them with annual results from 2006-2016. The overall score reflects a Taylor Rule approach that gives equal weight to growth and inflation. \nOn the overall measure, the Fed ranked first, despite being too bullish on growth for 10 of 11 years of the study, while the Bank of Japan was last. \nOn estimates for economic growth alone, the BOE shot to the top of the rankings, even though it, too, has been consistently overly optimistic. That’s ironic, given that Carney has repeatedly been castigated by some British lawmakers and media for being too downbeat on the nation’s prospects before and after 2016’s vote to leave the European Union. \nAndy Haldane, BOE Chief Economist, said in 2017 it was a “fair cop” that the bank — in common with almost all mainstream forecasters — expected a sharper slowdown than the U.K. has seen since the Brexit decision. He also said his profession has a lot of work to do if it is to recover from its failure to predict the global financial crisis and its aftermath. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-17T13:44:00.000+02:00", "crawled": "2018-01-17T23:13:16.002+02:00", "highlightTitle": ""}