{"organizations": [], "uuid": "cbaf2f661c0377e3299d67dd936ee3b5f586403b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-breasts-implants-cancer/breast-implants-tied-to-increased-risk-of-rare-blood-cancer-idUKKBN1FF2AT", "country": "US", "domain_rank": 408, "title": "Breast implants tied to increased risk of rare blood cancer", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T19:13:00.000+02:00", "replies_count": 0, "uuid": "cbaf2f661c0377e3299d67dd936ee3b5f586403b"}, "author": "", "url": "https://uk.reuters.com/article/us-health-breasts-implants-cancer/breast-implants-tied-to-increased-risk-of-rare-blood-cancer-idUKKBN1FF2AT", "ord_in_thread": 0, "title": "Breast implants tied to increased risk of rare blood cancer", "locations": [], "entities": {"persons": [{"name": "lisa rapaport", "sentiment": "none"}, {"name": "non-hodgkin", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "jama oncology", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 5:14 PM / Updated 3 hours ago Breast implants tied to increased risk of rare blood cancer Lisa Rapaport 4 Min Read \n(Reuters Health) - Women who get breast implants may be more likely to develop a rare type of cancer known as anaplastic large cell lymphoma, a small Dutch study suggests. \nAnaplastic large-cell lymphoma is an aggressive form of non-Hodgkin lymphoma, a white blood cell cancer that typically affects older adults and is more common in men than in women. In recent years, the number of women diagnosed with anaplastic large-cell lymphoma in the breast has increased, raising concerns that implants might cause malignancies, researchers note in JAMA Oncology. \nFor the current study, researchers examined data on patients with non-Hodgkin lymphoma of the breast who were added to a Dutch cancer registry between 1990 and 2016. Among 43 patients with breast anaplastic large-cell lymphoma, 32 had breast implants, compared with just one woman among the 146 patients in the study who had other types of breast lymphomas. \nThis suggests that women with breast implants are 421 times more likely to develop breast anaplastic large-cell lymphoma. But the absolute risk is low: by age 75, only one in every 6,920 women with implants will develop this type of cancer. \n“It is important for women to be informed about their risk of anaplastic large-cell lymphoma when considering implants so that they can make a well-founded choice,” said senior study author Dr. Daphne de Jong of the VU University Medical Center in Amsterdam. \n“Women who have implants should be aware of the signs and symptoms so that they can consult their doctors in time when they notice enlargement of the breast or a lump,” de Jong said by email. \nWhile it’s not clear exactly why implants might lead to an increased risk of this rare form of cancer, it’s possible that it might be due to an immune system response or an inflammatory reaction to bacteria on the surface of the implants, de Jong said. \nIn particular, so-called macrotextured implants may pose a bigger risk. \nAmong 28 cases of anaplastic large-cell lymphoma in women with a known type of implant, 23 had macrotextured implants, the study found. \nEven though this type of implant accounted for 82 percent of the anaplastic large-cell lymphoma cases, these implants had only a 45 percent market share in the Netherlands during the study period, researchers note. \nBy contrast, microtextured implants made up 54 percent of the Dutch market but accounted for only 18 percent of the anaplastic large-cell lymphoma cases in the study. \nThe study wasn’t a controlled experiment designed to prove whether or how implants in general or certain types of implants might cause breast lymphomas. \nAnother limitation of the study is that it included too few patients for researchers to calculate how factors like the duration of implant use or the type of implant might alter the odds of developing breast lymphomas. \nEven though the risk of anaplastic large-cell lymphoma is rare, women should still discuss this with their doctors when they’re considering implants and discussing what type of implant to get, said Dr. Colleen McCarthy, author of an accompanying editorial and a researcher at Memorial Sloan-Kettering Cancer Center in New York City. \n“There is high-quality evidence which suggests breast implants can be effective in improving a woman’s body image, psychosocial wellbeing and overall quality of life,” McCarthy said by email. \n“Breast implants remain among the most studied medical devices available in the world, and breast implant-associated anaplastic large-cell lymphoma is an extremely rare and highly treatable form of lymphoma,” McCarthy added. “For women considering breast implant surgery, the advantages and disadvantages to textured versus smooth shelled implants should be explored.” \nSOURCE: bit.ly/2GkiA0n JAMA Oncology, online January 4, 2018.", "external_links": [], "published": "2018-01-26T19:13:00.000+02:00", "crawled": "2018-01-26T21:14:11.016+02:00", "highlightTitle": ""}