{"organizations": [], "uuid": "73ef9716d3cce663c77f75e9741a70906821d70e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-670675850-1.jpg", "site_section": "http://feeds.feedburner.com/google/rzcU", "section_title": "china news - Google News", "url": "http://fortune.com/2018/01/17/china-space-lasers/", "country": "US", "domain_rank": 1196, "title": "What Goes Into Orbit Could Be Zapped With Lasers Before It Comes Down, Say Chinese Scientists - Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T18:58:00.000+02:00", "replies_count": 0, "uuid": "73ef9716d3cce663c77f75e9741a70906821d70e"}, "author": "", "url": "http://fortune.com/2018/01/17/china-space-lasers/", "ord_in_thread": 0, "title": "What Goes Into Orbit Could Be Zapped With Lasers Before It Comes Down, Say Chinese Scientists - Fortune", "locations": [], "entities": {"persons": [], "locations": [{"name": "fortune china", "sentiment": "none"}, {"name": "earth", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "shenzhou", "sentiment": "none"}], "organizations": [{"name": "international journal for light and electron optics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "China wants to blast space debris with giant lasers . \nA paper published by researchers at the Air Force Engineering University in China describes how zapping space junk with lasers could break it apart into smaller, less-harmful pieces. \nThe paper, which lays out the theoretical argument for blasting space debris into harmless pieces, was published in the International Journal for Light and Electron Optics . Floating fragments of failed satellite launches and other debris have been a major concern for the international space community for years. \nThe Chinese, in particular, have a very pressing reason to be concerned about space debris. The Tiangong-1, their oldest space station, will be “de-orbiting” or falling to Earth later this year. China’s deputy director of the manned space program first announced that the station would break apart and re-enter the atmosphere some time “ in the latter half of 2017 .” \nIt still hasn’t fallen and scientists say it could fall anywhere on Earth at any time . Scientists look at the screen showing the Shenzhou X manned spacecraft conducting docking with the orbiting Tiangong-1 space module at Beijing Aerospace Control Center on June 13, 2013 in Beijing, China. VCG/VCG via Getty Images \nAs alarming as that sounds, experts said Tiangong-1 posed a relatively low threat — not much more serious than debris from an airplane falling from the sky. Still, China has been intent on assuring the world that it can control where the space station will crash land . \nAside from the Tiangong-1, NASA has been worried about what to do with the more than 500,000 pieces of man-made materials that have been released into Earth’s orbit. Experts at the European Space Agency called it a “ deadly cascade .” \nAbout 21,000 of those objects are larger than 10 centimeters and travel at speeds up to 18,000 miles per hour , posing a serious threat to the safety of astronauts and satellites. \nIn 2014, Lockheed Martin found that there were around 200 threats to orbiting satellites each day . Having trouble picturing that? NASA created an animation of all the debris surrounding the planet to help explain what the Earth is dealing with. \nChina is one of the biggest contributors to the massive amount of space junk. A single anti-satellite test in 2007 , which intentionally destroyed a weather satellite, created nearly 1,000 pieces of dangerous debris. \nPlans to deal with the space pollution include sweeping it away with large nets, moving it with magnets , and destroying it with lasers. \nNASA began researching how to move space junk with lasers in 2011 . The proposed process would slow galactic garbage enough for it to hopefully burn up in Earth’s atmosphere. \nBut some people are skeptical of China’s intentions for building a laser to blast debris out of space. Gen. John Hyten told CNN in March that the development of this technology was meant to challenge the U.S. and change “the balance of power in the world.” SPONSORED FINANCIAL CONTENT", "external_links": [], "published": "2018-01-17T18:58:00.000+02:00", "crawled": "2018-01-17T22:25:46.010+02:00", "highlightTitle": ""}