{"organizations": [], "uuid": "8db944a3166c4e84c8f2948884e95b7cde246eae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226856511&w=1200&r=LYNXMPEE0U0BW", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-thailand-oil-shell-pttep/shell-says-to-sell-its-stake-in-thai-bongkot-fields-to-pttep-for-750-million-idUSKBN1FK0P0", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Shell says to sell its stake in Thai Bongkot fields to PTTEP for $750 mln", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T10:22:00.000+02:00", "replies_count": 0, "uuid": "8db944a3166c4e84c8f2948884e95b7cde246eae"}, "author": "", "url": "https://www.reuters.com/article/us-thailand-oil-shell-pttep/shell-says-to-sell-its-stake-in-thai-bongkot-fields-to-pttep-for-750-million-idUSKBN1FK0P0", "ord_in_thread": 0, "title": "UPDATE 2-Shell says to sell its stake in Thai Bongkot fields to PTTEP for $750 mln", "locations": [], "entities": {"persons": [], "locations": [{"name": "florence", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}, {"name": "kuwait", "sentiment": "none"}], "organizations": [{"name": "shell", "sentiment": "negative"}, {"name": "pttep", "sentiment": "negative"}, {"name": "reuters) - royal dutch shell", "sentiment": "none"}, {"name": "ptt exploration & production pcl", "sentiment": "none"}, {"name": "kufpec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BANGKOK/SINGAPORE (Reuters) - Royal Dutch Shell said on Wednesday that it will sell its stake in the Bongkot gas field and adjoining acreage offshore Thailand to PTT Exploration & Production PCL for $750 million before tax.\nThe deal with PTTEP comes after Shell in October canceled a $900 million agreement to sell the same gas field stakes to Kuwait Foreign Petroleum Exploration Company (KUFPEC).\n“The two deal values are not comparable and we will not comment further on any commercial terms,” a Shell spokeswoman said in an e-mail when asked about the discrepancy between the price tags in the two sale accords.\nIn a statement, Shell said, “This sale takes Shell a step closer to its divestment target of $30 billion” of non-core assets. The transaction is expected to be completed in the second quarter, both companies said.\nPTTEP is the upstream arm of oil giant PTT Pcl and currently operates the Bongkot field, which produces about 860 million cubic feet per day of natural gas and 26,000 barrels per day of condensate.\nThe acquisition is in line with PTTEP’s strategy of adding producing assets or those which are in the final stage of development, located in Southeast Asia where PTTEP has experience, Chief Executive Officer Somporn Vongvuthipornchai said in a statement.\nPTTEP is keen to continue as the field’s operator and plans to participate in a bidding round for the Bongkot concession which expires in 2022-2023 to maintain Thailand’s energy security, Somporn said.\nAndrew Harwood, research director of Asia Pacific upstream oil and gas at ‎Wood Mackenzie, said the lower sale price for the asset probably reflects PTTEP taking on a larger share of future decommissioning liabilities.\n“The deal also puts PTTEP in a stronger position ahead the bidding round, expected to launch by mid-2018,” he said.\nThe sales agreement covers Shell’s 22.2 percent stake in Blocks 15, 16 and 17 and Block G12/48, the companies said. PTTEP’s stake will increase to 66.7 percent after the purchase, with the remaining 33.3 percent held by France’s Total, they said.\nThe deal will increase PTTEP’s sales volume by about 35,000 barrels of oil equivalent per day.\nIn the bidding round set for mid-2018, over 650 million barrels of oil equivalent of resource will be up for grabs in Thailand, including both the expiring Bongkot concession and areas licensed to Chevron Corp.\nChevron operates the nearby Erawan field under a concession set to expire in 2022.\nThe fields have a combined output of 2.2 billion cubic feet a day, making up about 76 percent of the Gulf of Thailand’s output.\nReporting by Florence Tan in SINGAPORE and Chayut Setboonsarng in BANGKOK; Editing by Kenneth Maxwell and Richard Pullin\n ", "external_links": [], "published": "2018-01-31T10:22:00.000+02:00", "crawled": "2018-01-31T10:38:24.010+02:00", "highlightTitle": ""}