{"organizations": [], "uuid": "10c33b208071e00cddd3fc61919f8c2e7a2c9474", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221250783&w=1200&r=LYNXMPEE0A1VA", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-northkorea-missiles-trump-interview/trump-says-probably-has-a-good-relationship-with-north-koreas-kim-wsj-idUKKBN1F02YB", "country": "US", "domain_rank": 408, "title": "Trump says 'probably' has a good relationship with North Korea's Kim -WSJ", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T23:41:00.000+02:00", "replies_count": 0, "uuid": "10c33b208071e00cddd3fc61919f8c2e7a2c9474"}, "author": "", "url": "https://uk.reuters.com/article/uk-northkorea-missiles-trump-interview/trump-says-probably-has-a-good-relationship-with-north-koreas-kim-wsj-idUKKBN1F02YB", "ord_in_thread": 0, "title": "Trump says 'probably' has a good relationship with North Korea's Kim -WSJ", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 9:43 PM / Updated 4 minutes ago Trump says 'probably' has a good relationship with North Korea's Kim - WSJ Reuters Staff 3 Min Read \nWASHINGTON (Reuters) - U.S.   said on Thursday he “probably” has a very good relationship with North Korean leader Kim Jong Un, a change in tone for Trump after exchanging insults with Kim over Pyongyang’s nuclear and missile programs. U.S.   attends a signing ceremony for the Interdict Act into law, to provide Customs and Border Protection agents with the latest screening technology on the fight against the opioid crisis, in the Oval Office of the White House in Washington D.C., U.S., January 10, 2018. REUTERS/Carlos Barria \nTrump has derided the North Korean leader as a “maniac” and referred to him as “little rocket man.” Kim has responded by calling the U.S. president a “mentally deranged U.S. dotard.” \n“I probably have a very good relationship with Kim Jong Un,” Trump said in an interview with The Wall Street Journal. “I have relationships with people. I think you people are surprised.” \nKim has warned the United States that he intends to build a nuclear arsenal capable of hitting the United States, prompting threats of military action by Washington. \nAsked whether he has spoken with the North Korean leader, Trump told the newspaper: “I don’t want to comment on it. I‘m not saying I have or haven‘t. I just don’t want to comment.” \nIn November, Trump said while on a trip to Vietnam that becoming friends with Kim “might be a strange thing to happen but it’s a possibility.” \nKim, in a speech last week, said the “nuclear button is always on my desk,” prompting Trump to respond in a tweet that his nuclear button is “a much bigger & more powerful one than his, and my Button works!” \nIn the Journal interview, Trump suggested his combative tweets are part of a broader strategy. \n“You’ll see that a lot with me,” he said, “and then all of the sudden somebody’s my best friend. I could give you 20 examples. You could give me 30. I’m a very flexible person.” \nTrump told the newspaper a decision by the United States and South Korea to postpone military exercises until after next month’s Winter Olympics in South Korea “sends a good message to North Korea.” \nNorth and South Korea held their first talks in two years on Tuesday. Trump told a news conference in Washington on Wednesday the United States would be willing to speak to Pyongyang “under the right circumstances.” Reporting by Makini Brice; Writing by Katanga Johnson; Editing by Tim Ahmann and Leslie Adler", "external_links": [], "published": "2018-01-11T23:41:00.000+02:00", "crawled": "2018-01-12T00:10:38.000+02:00", "highlightTitle": ""}