{"organizations": [], "uuid": "2160ff9109274b30befd7e4bd6f62e8648a3fc43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/9", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-ablynx-strongly-believes-unsolicited-conditional-proposal-from-novo-nordisk-fundamentally-undervalues-the-company-and-its.html", "country": "US", "domain_rank": 767, "title": "ABLYNX STRONGLY BELIEVES UNSOLICITED CONDITIONAL PROPOSAL FROM NOVO NORDISK FUNDAMENTALLY UNDERVALUES THE COMPANY AND ITS FUTURE PROSPECTS", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:26:00.000+02:00", "replies_count": 0, "uuid": "2160ff9109274b30befd7e4bd6f62e8648a3fc43"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-ablynx-strongly-believes-unsolicited-conditional-proposal-from-novo-nordisk-fundamentally-undervalues-the-company-and-its.html", "ord_in_thread": 0, "title": "ABLYNX STRONGLY BELIEVES UNSOLICITED CONDITIONAL PROPOSAL FROM NOVO NORDISK FUNDAMENTALLY UNDERVALUES THE COMPANY AND ITS FUTURE PROSPECTS", "locations": [], "entities": {"persons": [{"name": "ablynx", "sentiment": "none"}], "locations": [{"name": "ghent", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}], "organizations": [{"name": "novo nordisk", "sentiment": "negative"}, {"name": "contingent value right", "sentiment": "none"}, {"name": "novo nordisk a/s", "sentiment": "none"}, {"name": "ablynx board", "sentiment": "none"}, {"name": "ablynx", "sentiment": "none"}, {"name": "cvr", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FOR IMMEDIATE RELEASE\nREGULATED INFORMATION - INSIDE INFORMATION\nGHENT, Belgium, 8 January 2018 - Ablynx NV (Euronext Brussels and Nasdaq: ABLX) (\"Ablynx\" or the \"Company\") today confirmed that on December 22, 2017 it received an unsolicited conditional proposal from Novo Nordisk A/S (CSE: NOVO B) (NYSE:NVO) (\"Novo Nordisk\") to acquire all of the outstanding shares of Ablynx for €28.00 (or approximately $33.66 [1] ) per share in cash and one Contingent Value Right (CVR) linked to two upcoming material events with total potential cash payments over time of up to €2.50 (or approximately $3.01) per share.\nThe Ablynx Board, with the assistance of financial and legal advisors, and taking into account the interests of all its stakeholders, unanimously concluded that the proposal fundamentally undervalues Ablynx and its strong prospects for continued growth and value creation as it implements its long-term strategic plan of becoming a fully integrated biopharmaceutical company.\nAblynx also confirms that on December 7, 2017, Novo Nordisk made an unsolicited, non-binding and conditional proposal (the \"December 7 proposal\") to acquire all outstanding shares of Ablynx for €26.75 (or approximately $31.57 [2] ) per share in cash. Following careful consideration, the Ablynx Board unanimously concluded that the December 7 proposal fundamentally undervalues the Company and its future prospects. Despite this, on December 19, 2017, Novo Nordisk reiterated its commitment to the December 7 proposal.\n\"After careful consideration, the Ablynx Board of Directors unanimously determined that Novo Nordisk's proposal is not in the best interests of the Company and its shareholders as it fundamentally undervalues caplacizumab, the Ablynx pipeline, platform, technology, people, and know how. The Board sees no merit in ceding control of its assets without full upfront value recognition for shareholders and believes the proposed consideration and a complex instrument like a CVR does not constitute a basis for further discussions at this time,\" said Dr. Edwin Moses, Chief Executive Officer of Ablynx .\nDr. Moses continued , \"With Ablynx's enormous upside, we are focused on executing on opportunities that have the potential to deliver long-term growth and returns and are confident in our ability to create significant value. The very positive results from our HERCULES Phase III study and our two ongoing Phase II studies validate our ability to execute on our plan to deliver meaningful products to patients that address unmet medical needs where there are currently limited or no therapeutic options. In addition to developing our proprietary pipeline, including preparing for the commercial launch of caplacizumab, we are engaged in a number of exciting strategic collaborations with major pharma companies, further validating the potential of our Nanobody platform. We firmly believe the continued execution of this strategic plan will deliver substantially more value to Ablynx shareholders than Novo Nordisk's proposal.\"\nJ.P. Morgan is serving as financial advisor to Ablynx and Goodwin Procter LLP and Eubelius CVBA/SCRL are serving as legal counsel.\nAbout Ablynx\nAblynx is a biopharmaceutical company engaged in the development of Nanobodies , proprietary therapeutic proteins based on single-domain antibody fragments, which combine the advantages of conventional antibody drugs with some of the features of small-molecule drugs. Ablynx is dedicated to creating new medicines which will make a real difference to society. Today, the Company has more than 45 proprietary and partnered programmes in development in various therapeutic areas including inflammation, haematology, immuno-oncology, oncology and respiratory disease. The Company has collaborations with multiple pharmaceutical companies including AbbVie; Boehringer Ingelheim; Eddingpharm; Merck & Co., Inc., Kenilworth, New Jersey, USA; Merck KGaA; Novartis; Novo Nordisk; Sanofi and Taisho Pharmaceuticals. The Company is headquartered in Ghent, Belgium. More information can be found on www.ablynx.com .\nFor more information, please contact\nAblynx:\nDr Edwin Moses\nCEO\nt: +32 (0)9 262 00 07\nm: +32 (0)473 39 50 68\ne: edwin.moses@ablynx.com\nLies Vanneste\nDirector Investor Relations\nt: +32 (0)9 262 01 37\nm: +32 (0)498 05 35 79\ne: lies.vanneste@ablynx.com\nFollow us on Twitter @AblynxABLX\nAblynx media relations:\nConsilium Strategic Communications\nMary-Jane Elliott, Philippa Gardner, Sukaina Virji\nt: +44 (0)20 3709 5700\ne: ablynx@consilium-comms.com\nJoele Frank, Wilkinson Brimmer Katcher\nDan Katcher or Joseph Sala\nt: +1 212-355-4449\nDisclaimer\nCertain statements, beliefs and opinions in this press release are forward-looking, which reflect the Company or, as appropriate, the Company directors' current expectations and projections about future events. By their nature, forward-looking statements involve a number of risks, uncertainties and assumptions that could cause actual results or events to differ materially from those expressed or implied by the forward-looking statements. These risks, uncertainties and assumptions could adversely affect the outcome and financial effects of the plans and events described herein. A multitude of factors including, but not limited to, changes in demand, competition and technology, can cause actual events, performance or results to differ significantly from any anticipated development. Forward looking statements contained in this press release regarding past trends or activities should not be taken as a representation that such trends or activities will continue in the future. As a result, the Company expressly disclaims any obligation or undertaking to release any update or revisions to any forward-looking statements in this press release as a result of any change in expectations or any change in events, conditions, assumptions or circumstances on which these forward-looking statements are based. Neither the Company nor its advisers or representatives nor any of its parent or subsidiary undertakings or any such person's officers or employees guarantees that the assumptions underlying such forward-looking statements are free from errors nor does either accept any responsibility for the future accuracy of the forward-looking statements contained in this press release or the actual occurrence of the forecasted developments. You should not place undue reliance on forward-looking statements, which speak only as of the date of this press release.\nA Dutch translation of the press release will be communicated shortly\n[1] Based on EUR / USD exchange rate of 1.202 on January 8, 2018\n[2] Based on EUR / USD exchange rate of 1.180 on December 7, 2017\nAttachments:\nhttp://www.globenewswire.com/NewsRoom/AttachmentNg/50b70864-8dbc-4d3c-a1ae-8550636c8307\nSource:Ablynx NV", "external_links": ["https://www.globenewswire.com/Tracker?data=P53LS5JGS1eQuOlxT2cBCzwI9pLN98kHFs5B6avPQCuRyEEllNX_M_fFpJiRHXF4tIpZlfLjcpWPyX8crq7J7HCnUECjDeS1eCrhIUw-6fNHNYdULXgyUNC74GznTZu5-QUJaZqQPIVFp2QJESa8IWj4zlqLd8YWUX2WYhUrpd_G2LL5-WoLB-A8UOQciNOpkM0wp6vQchWWj9n4f48QTUe7KIE-pgHiREHHSe_zJBB2vepSXIDIvoDwYgo3Eu3XqYxjcJuCAhUBw1qTZCcDxw==", "https://www.globenewswire.com/Tracker?data=pVWdf7JktrtCjK-h-vV8dyRi_TkMOOvtd9MlarOpMJhNqU9ys1DYUhz3OAJsahkb47LXUWjceCLblXgQ7aKifCACIxGuE2y6GK9g7YKoieE=", "https://www.globenewswire.com/Tracker?data=J7pXbQIzV3GRrO07YxCUjGiOYXVJItfnH7ZuXDPnIHsyHqazWfVu_2uL36CbJp6jT0eI7fdQoRE6JqucBC3nMOxM79sjSB39zuycb14dmC2LOLO9P9-iQUUmLHj2XK6B_WhWRfqlbIzTbjvoDgsH0w==", "https://www.globenewswire.com/Tracker?data=KQTrkw4kYPPpxPXflMu0eKIx2vvboo_cNXTjuX8s9B37zrOjSikFKisd_R9jZKFfGhfTWATZh5XQv0r7RucKMw==", "http://www.globenewswire.com/NewsRoom/AttachmentNg/50b70864-8dbc-4d3c-a1ae-8550636c8307", "https://www.globenewswire.com/Tracker?data=m8FKsboTn0MiohenI-JHIc4FciHAapJ9kMj72AEu4e4a3Gih8kFIUNySwg96rScwQi7VNk06wSmfzMFxMgvMng==", "https://www.globenewswire.com/Tracker?data=Dyu60W2AmP3pJ3pzqbvjT3Jvw_YavC4SvMTRc98e1lPlap71qqdqO_SG47KxqJT0cXrqFszmKIduJzTURzwrWQbtyNrEan6Qnni6ly1iVso=", "https://www.globenewswire.com/Tracker?data=595yL2N69jyTzhJssOFkIwXLlWOsPR0MpOByL-erpEozhnMoaUm_CAX8YplOPVXdKMx6J0ZKRM8t_tqvRZBxMhPhSwLJ5iF4ATCi1OzMSjPsfoRqfhjsy2dPECd--n0o_JAOczfeNK7GvYtdD0dFpQ==", "https://www.globenewswire.com/Tracker?data=TmD2YrCFODcAylXs80mQAgbRtRVYu-CbBofUItEb0OP7EMBTbT7pIshRYR1KGrUYfMWFuLei4F5rkDdRCfdY0thY0BNVTphMPqWPydmrJxY=", "https://www.globenewswire.com/Tracker?data=QjTreRPe9BEBuRAi4rJmaX2zTSVv5qRdwkHU3hUO5_6MCmVQSoNHHewJMg0_-L4MwjJhzAihjmCnIoeQpYC5DfJZXJUEqjD7N0klS5PuGnTt5tsLTedU2SUJMIGA33ph"], "published": "2018-01-08T15:26:00.000+02:00", "crawled": "2018-01-08T17:12:49.008+02:00", "highlightTitle": ""}