{"organizations": [], "uuid": "0a6179b6efff96e5f00580106c3a97a3a0c3c5a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/01/reuters-america-oil-marks-highest-january-opening-price-since-2014.html", "country": "US", "domain_rank": 767, "title": "Oil marks highest January opening price since 2014", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T03:22:00.000+02:00", "replies_count": 0, "uuid": "0a6179b6efff96e5f00580106c3a97a3a0c3c5a4"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/01/reuters-america-oil-marks-highest-january-opening-price-since-2014.html", "ord_in_thread": 0, "title": "Oil marks highest January opening price since 2014", "locations": [], "entities": {"persons": [{"name": "rystad", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "neutral"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Brent, WTI crude begin year above $60, 1st time since 2014\n* Ongoing OPEC supply cuts have lifted crude prices\n* Strong demand also supports, despite rising U.S. output\n* U.S. production capacity has reached 10 mln bpd - Rystad\nSINGAPORE, Jan 2 (Reuters) - Oil prices had their highest January opening since 2014 on Tuesday, supported by ongoing supply cuts led by OPEC and Russia as well as strong demand.\nOnly rising U.S. production, which is on the verge of breaking through 10 million barrels per day (bpd), is somewhat hampering the outlook into 2018.\nU.S. West Texas Intermediate (WTI) crude futures were at $60.29 a barrel at 0119 GMT, down 13 cents, or 0.2 percent, from their last settlement of 2017, but starting the year above $60 a barrel for the first time since 2014.\nBrent crude futures - the international benchmark for oil prices - were at $66.79 a barrel, down 8 cents, or 0.1 percent, since their last close of 2017. It is also the first time since 2014 that Brent opened a year above $60 a barrel.\nTraders said Tuesday's prices dips were due to the full return of the 450,000 bpd capacity Forties pipeline system in the North Sea, as well as ongoing repairs at a Libyan pipeline, which had cut output there by 70,000 bpd to 100,000 bpd.\nGlobal oil markets have been supported by a year of production cuts led by the Middle East-dominated Organization of the Petroleum Exporting Countries (OPEC) and Russia. The cuts started in January 2017 and are scheduled to cover all of 2018.\nStrong demand growth, especially from China, has also been supporting crude.\n\"Oil inventories have been declining since March 2017 and OPEC have agreed to extend production cuts until the end of 2018 so it is probably uncontroversial to say that the fundamental outlook for oil has improved since the beginning of 2017,\" said William O'Loughlin, investment analyst at Australia's Rivkin Securities.\n\"On the other hand, the higher prices are expected to stoke U.S. shale output,\" he said.\nU.S. commercial crude oil inventories have fallen by almost 20 percent from their historic highs last March, to 431.9 million barrels.\nU.S. oil production <C-OUT-T-EIA> has risen by almost 16 percent since mid-2016, to 9.75 million bpd at the end of last year.\nHowever, consultancy Rystad Energy said \"U.S. crude oil production capacity has reached 10 million barrels per day.\"\n(Reporting by Henning Gloystein; editing by Richard Pullin)", "external_links": [], "published": "2018-01-02T03:22:00.000+02:00", "crawled": "2018-01-03T04:33:45.030+02:00", "highlightTitle": ""}