{"organizations": [], "uuid": "7df75855a2274859e1af742078f3b25958d6c37e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180117.html", "section_title": "Archive News &amp; Video for Wednesday, 17 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/boe-banks-consumercredit/update-1-boe-says-bank-boards-need-more-detail-on-consumer-credit-risks-idUSL8N1PC2KR", "country": "US", "domain_rank": 408, "title": "UPDATE 1-BoE says bank boards need more detail on consumer credit risks", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.99, "site_type": "news", "published": "2018-01-17T19:42:00.000+02:00", "replies_count": 0, "uuid": "7df75855a2274859e1af742078f3b25958d6c37e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/boe-banks-consumercredit/update-1-boe-says-bank-boards-need-more-detail-on-consumer-credit-risks-idUSL8N1PC2KR", "ord_in_thread": 0, "title": "UPDATE 1-BoE says bank boards need more detail on consumer credit risks", "locations": [], "entities": {"persons": [{"name": "huw jones", "sentiment": "negative"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "prudential regulation authority", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "pra", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds more detail)\nBy Huw Jones\nLONDON, Jan 17 (Reuters) - Bank boards in Britain are not getting enough detailed information about risks from consumer loans to spot potential losses early enough, the Bank of England said on Wednesday.\nThe BoE’s Prudential Regulation Authority (PRA) published a letter to chairs of the deposit-taking banks it supervises, setting out findings from a review last year of how banks were managing risks from strong growth in consumer credit at that time.\n“Some board risk committees do not routinely receive sufficient standardised management information on consumer credit to recognise when a shift in asset quality or portfolio performance is taking place,” the letter said.\nMost firms showed they understood the risks from consumer credit to their business, it added.\n“We have also seen some early indications of firms tightening underwriting standards in 2017, such as raising scorecard cutoffs or reducing zero percent credit card periods, though risks remain elevated and continued vigilance is required by lenders and the PRA alike,” the letter said.\nConsumer borrowing grew at an annual rate of more than 10 percent in 2017, while the household savings rate hit an all-time low, raising concerns that some Britons are overstretched and may struggle to make repayments as interest rates begin to rise.\nThe BoE told banks in July they must apply credit rules prudently and made the boards of lenders directly responsible for acting on its recommendations.\nIn September it told banks to collectively hold an extra 10 billion pounds in capital to guard against increased risks from rapidly rising unsecured consumer lending.\n“There are some early signs that some of the heat is coming out of that market,” BoE Deputy Governor and PRA CEO Sam Woods told British lawmakers on Tuesday.\nSECOND-HAND MOTOR The BoE said it would look at the resilience of banks’ consumer credit books, including car loans, in this year’s annual stress test of lenders.\nThe PRA had also asked lenders to estimate how a fall in used car prices would hit their financial performance and capital buffers, and found that banks were generally prudent in estimating the future value of cars.\nBanks, however, seemed to underestimate how a structural change in the car market, where most people buy cars through personal contract purchase (PCP) deals, could amplify price movements.\nPCPs are typically offered by carmakers or dealers who are not regulated by the PRA, rather than banks, with payments linked to depreciation.\nThe PRA said banks may also be underestimating the impact of changing attitudes to diesel. Sales in the sector have fallen sharply due to pollution concerns.\nStresses in car prices will be looked at in this year’s annual stress test of lenders. (Additional reporting by David Milliken,; Editing by Gareth Jones)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T19:42:00.000+02:00", "crawled": "2018-01-18T16:27:05.011+02:00", "highlightTitle": ""}