{"organizations": [], "uuid": "93d4b6526583c83aa81bfe4f3a5cf4fed187d1c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180106&t=2&i=1219757323&w=1200&r=LYNXMPEE0504C", "site_section": "http://feeds.reuters.com/reuters/INentertainmentNews\r", "section_title": "Reuters: Entertainment News", "url": "https://in.reuters.com/article/usa-lottery/lottery-fever-u-s-powerball-and-mega-millions-jackpots-top-1-billion-idINKBN1EV051", "country": "US", "domain_rank": 408, "title": "Lottery fever: U.S. Powerball and Mega Millions jackpots top $1 billion", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T06:17:00.000+02:00", "replies_count": 0, "uuid": "93d4b6526583c83aa81bfe4f3a5cf4fed187d1c9"}, "author": "", "url": "https://in.reuters.com/article/usa-lottery/lottery-fever-u-s-powerball-and-mega-millions-jackpots-top-1-billion-idINKBN1EV051", "ord_in_thread": 0, "title": "Lottery fever: U.S. Powerball and Mega Millions jackpots top $1 billion", "locations": [], "entities": {"persons": [{"name": "chris kenning", "sentiment": "none"}, {"name": "jeff", "sentiment": "none"}, {"name": "reuters/mike segar", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "midtown manhattan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "min read  chicago", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 6, 2018 / 4:21 AM / Updated 9 hours ago One winning ticket in Florida for Mega Millions jackpot, Powerball up next Chris Kenning 3 Min Read \nCHICAGO (Reuters) - One ticket matching all six numbers was sold in Florida in the Mega Millions lottery jackpot of an estimated $450 million, the fourth largest in the game’s history, the lottery said after Friday’s drawing. A vendor sells lottery tickets for the Powerball and Mega Millions draw at a news stand in midtown Manhattan in New York City, New York, U.S., January 5, 2018. REUTERS/Mike Segar \nThe numbers drawn were 28, 30, 39, 59, 70 and 10. \nThe identity of the ticket holder or holders was not announced by lottery officials. The Mega Millions drawing has a $281-million payout if the winner selects a lump-sum payment. \nU.S. lottery players will get another shot at becoming super rich on Saturday night, when numbers are drawn for the Powerball jackpot of an estimated $570 million, the fifth largest in the game’s history. \nThe two jackpots together topped $1 billion after going months without a winner. \nSaturday’s 10:59 p.m. EST Powerball drawing has an estimated $358.5-million lump-sum payment, according to organizers. \nThe total of the two lotteries is the third largest in the history of the games. \nLong odds have not halted the spread of “lottery fever”, with people lining up to buy the $2-tickets at retailers, said Jeff Lenard, spokesman for the National Association of Convenience Stores, whose members sell about 60 percent of the nation’s lottery tickets. A Powerball sign is pictured in a store in New York City, New York, U.S., January 5, 2018. REUTERS/Carlo Allegri \n“There’s definitely more traffic,” Lenard said. \nAmericans spent $80.5 billion on lottery games last year, according to the North American Association of State and Provincial Lotteries. Slideshow (2 Images) \nPowerball tickets are sold in 44 states, and Washington, D.C., Puerto Rico and the U.S. Virgin Islands. Mega Millions tickets are offered in the same locations, excluding Puerto Rico. \nThe largest Powerball jackpot was a $1.6-billion payout split among winners in California, Florida and Tennessee in January 2016, the association said. The largest Mega Millions jackpot of $656 million was won in 2012. \nThe totals have ballooned as no one has hit either jackpot since October. On Wednesday, there was no winner of the Powerball jackpot, worth an estimated $460 million. A day earlier, no one had matched all six numbers in a Mega Millions drawing, lottery officials said. \nThe estimated totals are before tax. \nThe odds of a single ticket hitting all six numbers in the Powerball are 292 million to 1, the Multi-State Lottery Association says. The odds of picking the right six numbers for the Mega Millions jackpot are 303 million to 1, the game said. \n“When the jackpots reach these levels, everyone starts to daydream about what they would do if they won,” Gordon Medenica, Mega Millions lead director, said in a statement. Reporting by Chris Kenning in Chicago; Additional reporting by Rich McKay in Atlanta; Editing by Lisa Shumaker, Clarence Fernandez and Mark Potter", "external_links": [], "published": "2018-01-06T06:17:00.000+02:00", "crawled": "2018-01-06T06:50:13.000+02:00", "highlightTitle": ""}