{"organizations": [], "uuid": "81c95f41965eb40382458fdb08950908a0200ee6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/18/reuters-america-update-2-transcanada-lines-up-enough-shippers-to-take-keystone-xl-forward.html", "country": "US", "domain_rank": 767, "title": "UPDATE 2-TransCanada lines up enough shippers to take Keystone XL forward", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T18:03:00.000+02:00", "replies_count": 0, "uuid": "81c95f41965eb40382458fdb08950908a0200ee6"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/18/reuters-america-update-2-transcanada-lines-up-enough-shippers-to-take-keystone-xl-forward.html", "ord_in_thread": 0, "title": "UPDATE 2-TransCanada lines up enough shippers to take Keystone XL forward", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds details on Keystone XL, company comment and background)\nJan 18 (Reuters) - TransCanada Corp said it received enough interest from clients for its $8 billion Keystone XL oil pipeline, bringing it closer to a final decision on when it will start work on the project.\nThe controversial pipeline has pitted environmentalists worried about spills and global warming against business advocates who say the project will shore up discounted Canadian oil prices and attract investment.\nThe company said on Thursday it had secured firm, 20-year commitments for about 500,000 barrels per day for the project as it concluded its open season that allowed shippers to commit to space in the pipeline.\n\"We are progressing towards final investment decision of this project. Having route approval in Nebraska and the necessary commercial support for KXL brings us closer to a final investment decision,\" TransCanada spokesman Terry Cunha said in an email.\nWhen completed, the Keystone XL will run about 1,180 miles (1,899 km) from Hardisty, Alberta, to Steele City, Nebraska, linking crude from the oil-rich but landlocked Canadian province with U.S. refineries.\nPrimary construction is expected to begin in 2019, TransCanada said.\nLast year, the Donald Trump administration granted the company a federal permit, reversing a decision by former President Barack Obama to reject the project on environmental grounds.\nThe project cleared its final hurdle in November when Nebraska approved a path for the project through the state.\n\"Interest in the project remains strong and TransCanada will look to continue to secure additional long-term contracted volumes,\" the company said in a statement.\nToronto-listed shares of the company were trading down 0.3 percent at C$59.63. (Reporting by Nivedita Bhattacharjee; Editing by Saumyadeb Chakrabarty)", "external_links": [], "published": "2018-01-18T18:03:00.000+02:00", "crawled": "2018-01-19T03:20:02.024+02:00", "highlightTitle": ""}