{"organizations": [], "uuid": "6e1f3dc544ddecc1fe7346f0a6547fb63e8374a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-elizabeth-christian-public-relations-acquires-wyatt-brand.html", "country": "US", "domain_rank": 767, "title": "Elizabeth Christian Public Relations acquires Wyatt Brand", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-25T17:55:00.000+02:00", "replies_count": 0, "uuid": "6e1f3dc544ddecc1fe7346f0a6547fb63e8374a3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-elizabeth-christian-public-relations-acquires-wyatt-brand.html", "ord_in_thread": 0, "title": "Elizabeth Christian Public Relations acquires Wyatt Brand", "locations": [], "entities": {"persons": [{"name": "elizabeth christian", "sentiment": "none"}, {"name": "christian", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "kristin marcum", "sentiment": "none"}, {"name": "marcum", "sentiment": "none"}, {"name": "rachel wyatt", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "wyatt brand austin", "sentiment": "none"}, {"name": "central texas", "sentiment": "none"}], "organizations": [{"name": "elizabeth christian public relations", "sentiment": "negative"}, {"name": "ecpr", "sentiment": "negative"}, {"name": "wyatt brand, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas, Jan. 25, 2018 /PRNewswire/ -- Elizabeth Christian Public Relations (ECPR) has acquired Wyatt Brand, Inc., creating one of the largest independent public relations agencies in Central Texas and extensively broadening the firm's capabilities, client roster and geographic footprint.\nThis announcement is coupled with news that Kristin Marcum has been named president of ECPR. Marcum, who joined the firm in 2003 and who has served in increasingly significant roles, most recently was ECPR's chief operating officer. She is a shareholder in the firm.\nElizabeth Christian will remain at the helm as chief executive officer.\n\"Since ECPR was founded in 1995, this agency has stood for the integrity of public relations, a reverence for journalism and storytelling in ever-expanding forms, including the development of video production, digital media strategy and event production,\" Christian said. \"Acquiring Wyatt Brand—bringing David and Rachel Wyatt's unique expertise and sterling reputations into the fold—will allow us to grow and to serve our clients more robustly than ever before.\"\nWyatt Brand co-founder David Wyatt will join ECPR's senior leadership team as a director and co-founder Rachel Wyatt will be ECPR's creative director.\n\"Kristin Marcum is the most talented public relations leader imaginable,\" Christian said. \"As we build the quintessential 21 st Century PR firm, she is the ideal person to serve as president,\" Christian said. \"She and I are great partners and great friends.\"\nThe powerhouse agency—which represents regional and national brands including Google, St. David's HealthCare, Texas Mutual Insurance Company, Precourt Sports Ventures (owner of Major League Soccer's Columbus Crew SC), Orangetheory Fitness, SouthWest Water Company and the Austin Board of Realtors, among others—is expanding service categories with the acquisition of Wyatt Brand.\n\"Too many communication agencies are eager to sell companies' stories,\" David Wyatt said. \"Elizabeth Christian Public Relations is best equipped—now more than ever—to tell the broadest and most engaging story about how brands behave, look and interact and what they mean to their stakeholders. We couldn't be more excited.\"\nWyatt Brand's clients have included H-E-B, Thirteenth Floor Entertainment Group, UNESCO, Israel, the City of Marfa, Long Center, the University of Texas at Austin and California Polytechnic State University. Comprehensive brand development, art direction and publication design, as well as cultural and cause-centric public relations, will become important service offerings of ECPR.\n\"In my 20 years in public relations I've realized the only constant is change,\" Marcum said. \"Fortunately, I've had the best teacher in Elizabeth (Christian) and feel prepared and privileged to take on this leadership role as we expand our scope to provide an even more comprehensive suite of services to our clients.\"\nAbout Elizabeth Christian Public Relations\nElizabeth Christian Public Relations (ECPR) is a public relations firm specializing in projects involving media relations, video production, legislative and grassroots efforts, social media planning and execution, business development, event planning and crisis communications. The firm is dedicated to developing and delivering measurable communication strategies that align with clients' business objectives. For more information, please visit echristianpr.com or follow @ECPRaustin.\nContact: LINDSAY KETCHUM, 512-494-2874\nlketchum@echristianpr.com\nView original content: http://www.prnewswire.com/news-releases/elizabeth-christian-public-relations-acquires-wyatt-brand-300588262.html\nSOURCE Elizabeth Christian Public Relations (ECPR)", "external_links": ["http://www.echristianpr.com/", "http://www.echristianpr.com/staffmembers/kristin-marcum", "http://www.prnewswire.com/news-releases/elizabeth-christian-public-relations-acquires-wyatt-brand-300588262.html", "http://www.echristianpr.com/staffmembers/rachel-wyatt", "http://www.echristianpr.com/staffmembers/david-wyatt", "http://www.echristianpr.com/clients", "http://www.echristianpr.com/staffmembers/elizabeth-christian"], "published": "2018-01-25T17:55:00.000+02:00", "crawled": "2018-01-25T20:33:55.003+02:00", "highlightTitle": ""}