{"organizations": [], "uuid": "4cde892d72cf61cfd6682407ff77514383329c85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2015/06/wal06-15_mcmillon_2015.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/12/walmart-tax-cut/", "country": "US", "domain_rank": 1196, "title": "How Walmart Is Responding to the Corporate Tax Cut | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.644, "site_type": "news", "published": "2018-01-12T07:30:00.000+02:00", "replies_count": 0, "uuid": "4cde892d72cf61cfd6682407ff77514383329c85"}, "author": "Alan Murray", "url": "http://fortune.com/2018/01/12/walmart-tax-cut/", "ord_in_thread": 0, "title": "How Walmart Is Responding to the Corporate Tax Cut | Fortune", "locations": [], "entities": {"persons": [{"name": "alan murray", "sentiment": "negative"}, {"name": "doug mcmillon", "sentiment": "none"}, {"name": "mcmillon", "sentiment": "none"}, {"name": "sam", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "walmart", "sentiment": "negative"}, {"name": "economic club", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Alan Murray 5:30 AM EST \nWalmart announced yesterday it will raise starting wages for hourly workers to $11 beginning next month, and will give some of its workers one-time bonuses of as much as $1,000. More than a million employees could benefit. CEO Doug McMillon said the move was a response to the tax cut. \nThat won’t placate labor unions advocating a $15 minimum, and it comes at a time when labor markets are tightening anyway. Moreover, the announcement was accompanied by news that Sam’s Club is closing 63 stores and that Walmart is expanding cashier-free checkout . Nevertheless, the move is further evidence that the company—which used to be as ruthless about holding down wages as it is about negotiating supplier prices—is rethinking the way it treats associates. Walmart previously raised the starting wage in 2015 and 2016 to $9 and $10, respectively. \nI talked with CEO Doug McMillon about this change when I interviewed him at the Economic Club of New York in November. You can watch that interview here. But I came away convinced that McMillon, in partnership with Walmart chairman Greg Penner, has adopted a significantly different approach to worker pay than his predecessors. \nUltimately, of course, the real test of tax cuts will be whether they convince companies to invest and create jobs in the U.S. I was chastised yesterday by one reader—initials H.B.—for praising a column by Robert Pozen, former chairman of MFS Investment, and Bob Steel, former Treasury undersecretary, that called on public company CEOs to invest their tax windfalls in plants, people, research and technology, rather than in dividends and share buybacks. \nH. B.’s response: “Management teams often destroy value by ‘investing’ low cost capital in low or negative return investments. If a company can invest the capital at a high rate of return, great. If they can’t, they should either ‘invest’ in market share through lower pricing, ‘invest’ in upgrading their labor productivity with higher wages, or return the capital to investors through buybacks/dividends.” \nH.B.’s argument would make sense in a world where capital markets operate efficiently. But if you believe, as I do, that today’s markets put an excess premium on the short-term returns that buybacks and dividends can generate, then some leaning against the wind is welcome. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-12T07:30:00.000+02:00", "crawled": "2018-01-12T16:58:47.016+02:00", "highlightTitle": ""}