{"organizations": [], "uuid": "e601797c787f2167537f97c1e355b9dcaae3b8fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-wal-mart-stores-inc-announces-early-participation-results-for-its-cash-tender-offers.html", "country": "US", "domain_rank": 767, "title": "Wal-Mart Stores, Inc. Announces Early Participation Results for its Cash Tender Offers", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T05:14:00.000+02:00", "replies_count": 0, "uuid": "e601797c787f2167537f97c1e355b9dcaae3b8fb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-wal-mart-stores-inc-announces-early-participation-results-for-its-cash-tender-offers.html", "ord_in_thread": 0, "title": "Wal-Mart Stores, Inc. Announces Early Participation Results for its Cash Tender Offers", "locations": [], "entities": {"persons": [], "locations": [{"name": "bentonville", "sentiment": "none"}, {"name": "ark.", "sentiment": "none"}], "organizations": [{"name": "wal-mart stores, inc", "sentiment": "neutral"}, {"name": "walmart", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "wal-mart stores, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NOT FOR RELEASE, PUBLICATION OR DISTRIBUTION IN OR INTO, OR TO ANY PERSON LOCATED OR RESIDENT IN, ANY JURISDICTION WHERE IT IS UNLAWFUL TO RELEASE, PUBLISH OR DISTRIBUTE THIS DOCUMENT. PERSONS INTO WHOSE POSSESSION THIS DOCUMENT COMES ARE REQUIRED BY THE COMPANY, THE DEALER-MANAGERS AND THE INFORMATION AGENT TO INFORM THEMSELVES ABOUT, AND TO OBSERVE, ANY SUCH RESTRICTIONS.\nBENTONVILLE, Ark.--(BUSINESS WIRE)-- Wal-Mart Stores, Inc. (NYSE: WMT) (“Walmart” or the “Company”) announced today results as of the Early Participation Date (as defined below) for its previously announced offer to purchase the Company’s 7.55% Notes due 2030, 6.750% Debentures due 2023, 4.250% Notes due 2021, 3.250% Notes due 2020, 1.950% Notes due 2018, 6.500% Notes due 2037, 6.200% Notes due 2038, 5.625% Notes due 2041, 5.625% Notes due 2040, 5.25% Notes due 2035, 5.000% Notes due 2040, 4.875% Notes due 2040, 4.750% Notes due 2043, 5.875% Notes due 2027, 4.300% Notes due 2044, 4.000% Notes due 2043, 4.125% Notes due 2019 and 3.625% Notes due 2020 (collectively, the “Dollar Securities”) (such offer to purchase, the “Dollar Tender Offer”) and its previously announced offer to purchase the Company’s 4.875% Notes due 2039, 5.250% Notes due 2035 and 5.750% Notes due 2030 (collectively, the “Sterling Securities” and together with the Dollar Securities, the “Securities”) (such offer to purchase, the “Sterling Tender Offer” and together with the Dollar Tender Offer, the “Tender Offers”). Each Tender Offer will expire at 11:59 p.m., New York City time, on February 6, 2018, unless, subject to applicable law, such deadline is extended by the Company in respect of one or both of the Tender Offers or one or both of the Tender Offers is earlier terminated by the Company, in each case, in the Company’s sole and absolute discretion (such date and time, as the same may be extended or earlier terminated in respect of one or both Tender Offers, the “Expiration Date”).\nAs previously announced, the Early Participation Date for the Tender Offers was 5:00 p.m., New York City time, on January 23, 2018, unless extended (the “Early Participation Date”). The Early Participation Date was not extended, and the withdrawal rights for each Tender Offer expired at 5:00 p.m., New York City time, on January 23, 2018. Subject to the satisfaction or waiver of the conditions to the Tender Offers, the Early Payment Date for each Tender Offer will be promptly following the Early Participation Date and is expected to be on or about January 25, 2018.\nEach of the Tender Offers is made upon the terms and subject to the conditions set forth in the Offer to Purchase dated January 9, 2018 (as it may be amended or supplemented from time to time, the “Offer to Purchase”) and in the related Letter of Transmittal (as it may be amended or supplemented from time to time, the “Letter of Transmittal” and, together with the Offer to Purchase, the “Offer Documents”). Consummation of each Tender Offer is subject to certain conditions as described in the Offer to Purchase. Copies of the Offer Documents are available from the Information Agent as set forth below. Capitalized terms used in this announcement but not defined herein have the meanings given to them in the Offer to Purchase.\nSubject to the satisfaction or waiver of the conditions to the Dollar Tender Offer, the Company intends to accept for purchase Dollar Securities validly tendered in the Dollar Tender Offer and not validly withdrawn at or prior to the Early Participation Date for an aggregate Total Consideration equal to the Maximum Dollar Amount of $4,000,000,000.\nSubject to the satisfaction or waiver of the conditions to the Sterling Tender Offer, the Company intends to accept for purchase Sterling Securities validly tendered in the Sterling Tender Offer and not validly withdrawn at or prior to the Early Participation Date for an aggregate Total Consideration equal to the Maximum Sterling Amount of £650,000,000.\nThe applicable “Reference Yield” and resulting “Total Consideration” payable per $1,000 principal amount for each series of Dollar Securities expected to be purchased in the Dollar Tender Offer will be determined with respect to such series of Dollar Securities, and the applicable “Reference Yield” and resulting “Total Consideration” payable per £1,000 principal amount for the series of Sterling Securities expected to be purchased in the Sterling Tender Offer will be determined with respect to such series of Sterling Securities, at 10:00 a.m., New York City time, on January 24, 2018. See the Offer to Purchase for additional information.\nThe aggregate principal amount of the 7.55% Notes due 2030, 6.750% Debentures due 2023, 4.250% Notes due 2021, 3.250% Notes due 2020, 1.950% Notes due 2018, 6.500% Notes due 2037, 6.200% Notes due 2038, 5.625% Notes due 2041, 5.625% Notes due 2040, 5.25% Notes due 2035, 5.000% Notes due 2040, 4.875% Notes due 2040, 4.750% Notes due 2043, 5.875% Notes due 2027, 4.300% Notes due 2044, 4.000% Notes due 2043, 4.125% Notes due 2019 and 3.625% Notes due 2020 that were validly tendered and not validly withdrawn in the Dollar Tender Offer at or prior to the Early Participation Date is set forth in Table I below.\nTABLE I: DOLLAR SECURITIES SUBJECT TO THE DOLLAR TENDER OFFER Title of Security Security Identifiers Applicable\nMaturity Date\n/Par Call Date\nPrincipal\nAmount\nOutstanding\n(millions)\nAcceptance\nPriority Level\nAggregate Principal\nAmount Tendered\nas of the\nEarly Participation Date\nPercent of Amount\nOutstanding Tendered\nas of the\nEarly Participation Date\n7.55% Notes\ndue 2030\nCUSIP: 931142 BF9\nISIN: US931142BF98\nFebruary 15, 2030 $1,000 1 $411,527,000 41.15% 6.750%\nDebentures\ndue 2023\nCUSIP: 931142 AU7\nISIN: US931142AU74\nOctober 15, 2023 $250 2 $97,816,000 39.13% 4.250% Notes\ndue 2021\nCUSIP: 931142 DD2\nISIN: US931142DD23\nApril 15, 2021 $1,000 3 $491,120,000 49.11% 3.250% Notes\ndue 2020\nCUSIP: 931142 CZ4\nISIN: US931142CZ44\nOctober 25, 2020 $1,750 4 $552,991,000 31.60% 1.950% Notes\ndue 2018\nCUSIP: 931142 DJ9\nISIN: US931142DJ92\nDecember 15, 2018 $1,000 5 $276,198,000 27.62% 6.500% Notes\ndue 2037\nCUSIP: 931142 CK7\nISIN US931142CK74\nAugust 15, 2037 $1,451 6 $151,354,000 10.43% 6.200% Notes\ndue 2038\nCUSIP: 931142 CM3\nISIN: US931142CM31\nApril 15, 2038 $1,113 7 $193,227,000 17.36% 5.625% Notes\ndue 2041\nCUSIP: 931142 DB6\nISIN: US931142DB66\nApril 15, 2041 $1,320 8 $401,954,000 30.45% 5.625% Notes\ndue 2040\nCUSIP: 931142 CS0\nISIN: US931142CS01\nApril 1, 2040 $868 9 $116,227,000 13.39% 5.25% Notes\ndue 2035\nCUSIP: 931142 CB7\nISIN: US931142CB75\nSeptember 1, 2035 $2,093 10 $125,069,000 5.98% 5.000% Notes\ndue 2040\nCUSIP: 931142 CY7\nISIN: US931142CY78\nOctober 25, 2040 $645 11 $126,329,000 19.59% 4.875% Notes\ndue 2040\nCUSIP: 931142 CV3\nISIN: US931142CV30\nJuly 8, 2040 $473 12 $95,333,000 20.15% 4.750% Notes\ndue 2043 (1)\nCUSIP: 931142 DK6\nISIN: US931142DK65\nOctober 2, 2043/\nApril 2, 2043\n$433 13 $163,229,000 37.70% 5.875% Notes\ndue 2027\nCUSIP: 931142 CH4\nISIN: US931142CH46\nApril 5, 2027 $543 14 $60,149,000 11.08% 4.300% Notes\ndue 2044 (1)\nCUSIP: 931142 DQ3\nISIN: US931142DQ36\nApril 22, 2044/\nOctober 22, 2043\n$531 15 $116,199,000 21.88% 4.000% Notes\ndue 2043 (1)\nCUSIP: 931142 DG5\nISIN: US931142DG53\nApril 11, 2043/\nOctober 11, 2042\n$709 16 $169,421,000 23.90% 4.125% Notes\ndue 2019\nCUSIP: 931142 CP6\nISIN: US931142CP61\nFebruary 1, 2019 $364 17 $12,160,000 3.34% 3.625% Notes\ndue 2020\nCUSIP: 931142 CU5\nISIN: US931142CU56\nJuly 8, 2020 $839 18 $67,151,000 8.00% (1)\nFor such series of Securities, the calculation of the applicable Total Consideration will be performed taking into account the par call date. An overview of the calculation of the Total Consideration (including the par call detail) is set forth as Schedule A to the Offer to Purchase.\nThe aggregate principal amount of the 4.875% Notes due 2039, 5.250% Notes due 2035 and 5.750% Notes due 2030 that were validly tendered and not validly withdrawn in the Sterling Tender Offer at or prior to the Early Participation Date is set forth in Table II below.\nTABLE II: STERLING SECURITIES SUBJECT TO THE STERLING TENDER OFFER Title of Security Security Identifier Applicable\nMaturity Date\nPrincipal\nAmount\nOutstanding\n(millions)\nAcceptance\nPriority Level\nAggregate Principal\nAmount Tendered\nas of the\nEarly Participation Date\nPercent of Amount\nOutstanding Tendered\nas of the\nEarly Participation Date\n4.875% Notes\ndue 2039*\nISIN: XS0279211832 January 19, 2039 £645.063 1 £275,427,000 42.70% 5.250% Notes\ndue 2035*\nISIN: XS0202077953 September 28, 2035 £1,000 2 £414,630,000 41.46% 5.750% Notes\ndue 2030**\nISIN: XS0121617517 December 19, 2030 £500 3 £195,093,000 39.02% * Admitted to trading on the Main Securities Market of the Irish Stock Exchange. ** Admitted to trading on the regulated market of the Luxembourg Stock Exchange. Copies of all announcements, press releases and notices can also be obtained from the Information Agent (as defined below), the contact details for whom are set out below. Significant delays may be experienced where notices are delivered to the Clearing Systems and holders are urged to contact the Information Agent for the relevant announcements relating to the Tender Offers.\nHolders are advised to read carefully the Offer Documents for full details of and information on the procedures for participating in the Tender Offers.\nBofA Merrill Lynch, HSBC Securities (USA) Inc. and J.P. Morgan Securities LLC (such banks, the “Pricing Joint Lead Dealer-Managers”), BNP Paribas Securities Corp., Credit Suisse Securities (USA) LLC and Wells Fargo Securities, LLC are acting as joint lead dealer-managers (such banks, together with the Pricing Joint Lead Dealer-Managers, the “Joint Lead Dealer-Managers”), Barclays Capital Inc., Citigroup Global Markets Inc., Goldman Sachs & Co. LLC, Mizuho Securities USA LLC, Morgan Stanley & Co. LLC, MUFG Securities Americas Inc. and U.S. Bancorp Investments, Inc. are acting as senior co-dealer-managers (the “Senior Co-Dealer-Managers”), and BBVA Securities Inc., RBS Securities Inc. (marketing name “NatWest Markets”), Santander Investment Securities Inc., Scotia Capital (USA) Inc., Standard Chartered Bank and TD Securities (USA) LLC are acting as co-dealer managers (collectively with the Joint Lead Dealer-Managers and the Senior Co-Dealer-Managers, the “Dealer-Managers”) in connection with the Tender Offers. Global Bondholder Services Corporation is acting as information agent (the “Information Agent”) and depositary (the “Depositary”) in connection with the Tender Offers.\nQuestions concerning the terms of the Tender Offers may be directed to any of the Pricing Joint Lead Dealer-Managers (or their respective affiliates) at their addresses and telephone numbers set forth below:\nBofA Merrill Lynch\nHSBC Securities (USA) Inc.\nJ.P. Morgan Securities LLC 214 North Tryon Street, 14 th Floor\n452 Fifth Avenue\n383 Madison Avenue\nCharlotte, North Carolina 28255\nNew York, New York 10018\nNew York, New York 10179\nAttn: Liability Management Group\nAttn: Liability Management Group\nAttn: Liability Management Group\nU.S. Toll Free: (888) 292-0070\nU.S. Toll Free: (888) HSBC-4LM\nU.S. Toll Free: (866) 834-4666\nCollect: (980) 387-3907\nCollect: (212) 525-5552\nCollect: (212) 834-4811\nEmail: Liability.Management@hsbcib.com\nMerrill Lynch International\nHSBC Bank plc J.P. Morgan Securities plc 2 King Edward Street\n8 Canada Square\n25 Bank Street, Canary Wharf\nLondon EC1A 1HQ\nLondon E14 5HQ\nLondon, E14 5JP\nUnited Kingdom\nUnited Kingdom\nUnited Kingdom\nAttn: Liability Management Group\nAttn: Liability Management Group\nAttn: Liability Management Group\nTelephone: +44 20 7996 5420\nTelephone: +44 20 7992 6237\nTelephone: +44 20 7134 2468\nEmail: DG.LM_EMEA@baml.com\nEmail: LM_EMEA@hsbc.com\nQuestions and requests for assistance in connection with the delivery of Tender Instructions may be directed to the Information Agent at the address, email, website and telephone numbers set forth below: Global Bondholder Services Corporation\n65 Broadway, Suite 404 New York, New York 10006 Attention: Corporate Actions Email: contact@gbsc-usa.com\nhttp://www.gbsc-usa.com/Wal-Mart/\nBanks and Brokers call: (212) 430-3774 U.S. Toll Free: (866) 924-2200 International call: 001-212-430-3774 DISCLAIMER This announcement must be read in conjunction with the Offer Documents. This announcement and the Offer Documents contain important information which should be read carefully before any decision is made with respect to either of the Tender Offers. If you are in any doubt as to the contents of this announcement or the Offer Documents or the action you should take, you are recommended to seek your own financial and legal advice, including as to any tax consequences, immediately from your broker, bank manager, solicitor, accountant or other independent financial or legal adviser. Any individual or company whose Securities are held on its behalf by a broker, dealer, bank, custodian, trust company or other nominee or intermediary must contact such entity if it wishes to participate in either of the Tender Offers. None of the Dealer-Managers, the Information Agent, the Depositary or the Company makes any recommendation as to whether holders should tender their Securities for purchase pursuant to either of the Tender Offers.\nNone of the Dealer-Managers, the Information Agent, the Depositary or any of their respective directors, officers, employees, agents or affiliates assumes any responsibility for the accuracy or completeness of the information concerning the Company, the Securities or the Tender Offers contained in this announcement or in the Offer Documents. None of the Dealer-Managers, the Information Agent, the Depositary or any of their respective directors, officers, employees, agents or affiliates is acting for any holder, or will be responsible to any holder for providing any protections which would be afforded to its clients or for providing advice in relation to either of the Tender Offers, and accordingly none of the Dealer-Managers, the Information Agent, the Depositary or any of their respective directors, officers, employees, agents or affiliates assumes any responsibility for any failure by the Company to disclose information with regard to the Company or Securities which is material in the context of either of the Tender Offers and which is not otherwise publicly available.\nOFFER AND DISTRIBUTION RESTRICTIONS\nNeither this announcement nor the Offer to Purchase constitutes an offer or an invitation to participate in a Tender Offer in any jurisdiction in which, or to any person to or from whom, it is unlawful to make such offer or invitation or for there to be such participation under applicable laws. The distribution of this announcement and the Offer Documents in certain jurisdictions may be restricted by law. Persons into whose possession this announcement or the Offer Documents comes are required by each of the Company, the Dealer-Managers, the Information Agent and the Depositary to inform themselves about and to observe any such restrictions.\nUnited Kingdom\nThe communication of this announcement, the Offer Documents and any other documents or materials relating to the Tender Offers is not being made by, and such documents and/or materials have not been approved by, an authorized person for the purposes of section 21 of the Financial Services and Markets Act 2000, as amended. Accordingly, such documents and/or materials are not being distributed to, and must not be passed on to, the general public in the United Kingdom. The communication of such documents and/or materials as a financial promotion is only being made to, and may only be acted upon by, those persons in the United Kingdom falling within the definition of investment professionals (as defined in Article 19(5) of the Financial Services and Markets Act 2000 (Financial Promotion) Order 2005, as amended (the “Financial Promotion Order”)), or persons who are within Article 43 of the Financial Promotion Order, or to any other persons to whom it may otherwise lawfully be made under the Financial Promotion Order (such persons together being “Relevant Persons”).\nIreland\nThe Tender Offers are not being made, directly or indirectly, to the public in Ireland and no offers, issuances, placements or sales of any notes or securities under or in connection with the Tender Offers may be effected and the Offer Documents may not be distributed in Ireland except in conformity with the provisions of Irish law including (i) the Companies Act 2014 (as amended, the “Companies Act”), (ii) the Prospectus (Directive 2003/71/EC) Regulations 2005 (as amended) and any rules issued under Section 1363 of the Companies Act by the Central Bank of Ireland (the “Central Bank”), (iii) the European Communities (Markets in Financial Instruments) Regulations 2017 (as amended, the “MiFID II Regulations”), including, without limitation, Regulation 5 (Requirement for authorisation (and certain provisions concerning MTFs and OTFs)) thereof or any codes of conduct made under the MiFID II Regulations, and the provisions of the Investor Compensation Act 1998 (as amended), (iv) the Market Abuse Regulation (EU 596/2014) and any rules and guidance issued by the Central Bank under Section 1370 of the Companies Act, and (v) the Central Bank Acts 1942 to 2015 and any codes of conduct rules made under Section 117(1) of the Central Bank Act 1989 (as amended).\nFrance\nThe Tender Offers are not being made, directly or indirectly, to the public in France. Neither this announcement, the Offer to Purchase nor any other documents or marketing, or offering materials relating to the Tender Offers, has been or shall be distributed or caused to be distributed to the public in France and only (i) qualified investors (investisseurs qualifiés) acting for their own account, other than individuals, and/or (ii) providers of the investment service of portfolio management for the account of third parties (personnes fournissant le service d’investissement de gestion de portefeuille pour le compte de tiers) all as defined in, and in accordance with, Articles L.411-1, L.411-2, L.744-1, L.754-1, L.764-1, D.411-1, D.744-1, D.754-1 and D.764-1 of the French Code monétaire et financier, are eligible to participate in the Tender Offers. This Offer to Purchase has not been submitted to the clearance procedures (visa) of the Autorité des marchés financiers.\nBelgium\nThe Tender Offers do not constitute a public offering within the meaning of Articles 3, §1, 1° and 6, §1, of the Belgian Takeover Law. The Tender Offers are exclusively conducted under applicable private placement exemptions and have therefore not been, and will not be, notified to, and neither this announcement, the Offer to Purchase nor any other document or material relating to the Tender Offers has been, or will be, approved by the Belgian Financial Services and Markets Authority (Autorité des Services et Marchés Financiers/Autoriteit voor Financiële Diensten en Markten). Accordingly, the Tender Offers, this announcement, the Offer to Purchase, any memorandum, information circular, brochure or any similar documents relating to the Tender Offers may not be advertised, offered, distributed, or made available, directly or indirectly, to any person located and/or resident in Belgium other than to persons who qualify as “Qualified Investors” in the meaning of Article 10, §1, of the Belgian Prospectus Law, as referred to in Article 6, §3, 1° of the Belgian Takeover Law, and who is acting for its own account (and without prejudice to the application of Article 6, §4 of the Belgian Takeover Law), or in other circumstances which do not constitute a public offering in Belgium pursuant to the Belgian Takeover Law. The Offer to Purchase has been issued only for the personal use of the above Qualified Investors and exclusively for the purpose of the Tender Offers. Accordingly, the information contained therein may not be used for any other purpose or disclosed to any other person in Belgium (without prejudice to the application of Article 6, §4 of the Belgian Takeover Law).\nLuxembourg\nThe terms and conditions relating to this announcement, the Offer Documents and any other documents or materials relating to the Tender Offers have not been approved by and will not be submitted for approval to the Luxembourg Financial Services Authority (Commission de Surveillance du Secteur Financier) for purposes of public offering in the Grand Duchy of Luxembourg (“Luxembourg”). Accordingly, the Tender Offers may not be made to the public in Luxembourg, directly or indirectly, and none of this announcement, the Offer Documents or any other documents or materials relating to the Tender Offers or any other prospectus, form of application, advertisement or other material may be distributed, or otherwise made available in or from, or published in, Luxembourg except in circumstances which do not constitute a public offer of securities to the public, subject to prospectus requirements, in accordance with the Luxembourg law of July 10, 2005 on prospectuses for securities, as amended.\nItaly\nNeither of the Tender Offers, the Offer to Purchase nor any other documents or materials relating to the Tender Offers has been or will be submitted to the clearance procedure of the CONSOB, pursuant to applicable Italian laws and regulations.\nThe Tender Offers are being carried out in Italy as an exempted offer pursuant to article 101-bis, paragraph 3-bis of the Financial Services Act and article 35-bis, paragraph 4 of CONSOB Regulation No. 11971 of May 14, 1999, as amended.\nHolders or beneficial owners of the Securities that are located in Italy can tender the Securities for purchase through authorized persons (such as investment firms, banks or financial intermediaries permitted to conduct such activities in Italy in accordance with the Financial Services Act, CONSOB Regulation No. 16190 of October 29, 2007, as amended, and Legislative Decree No. 385 of September 1, 1993, as amended) and in compliance with applicable laws and regulations and with any requirements imposed by CONSOB or any other Italian authority.\nEach intermediary must comply with the applicable laws and regulations concerning information duties vis-à-vis its clients in connection with the Securities, the Tender Offers and/or the Offer to Purchase.\nSwitzerland\nNeither this announcement, the Offer Documents, any other documents or materials relating to the Tender Offers nor any other offering or marketing material relating to the Securities constitutes a prospectus as such term is understood pursuant to Article 652a or Article 1156 of the Swiss Federal Code of Obligations or a listing prospectus within the meaning of the listing rules of the SIX Swiss Exchange. Accordingly, the investor protection rules otherwise applicable to investors in Switzerland do not apply to the Tender Offers. When in doubt, investors based in Switzerland are recommended to contact their legal, financial or tax adviser with respect to the Tender Offers.\nSpain\nNeither the Tender Offers nor any other documents or materials relating to the Tender Offers have been or will be submitted for approval of or recognition by the Spanish Securities Market Commission (Comisión Nacional del Mercado de Valores) as the Tender Offers are not subject to such approval or recognition given that it is not being made in the Kingdom of Spain by way of a public offering of securities in accordance with article 35 of the Securities Market Act (Real Decreto Legislativo 4/2015, de 23 de octubre, por el que se aprueba el texto refundido de la Ley del Mercado de Valores), as amended and restated, or pursuant to an exemption from registration in accordance with Royal Decree 1310/2005 as amended (Real Decreto 1310/2005, de 4 de noviembre, por el que se desarrolla parcialmente la Ley 24/1988, de 28 de julio, del Mercado de Valores, en materia de admisión a negociación de valores en mercados secundarios oficiales, de ofertas públicas de venta o suscripción y del folleto exigible a tales efectos), and any regulations developing it which may be in force from time to time.\nThe Netherlands\nThe Tender Offers are not being made, directly or indirectly, to the public in The Netherlands. Neither this announcement, the Offer to Purchase nor any other document or material relating to the Tender Offers has been or shall be distributed to the public in The Netherlands and only (i) persons or entities which are qualified investors (gekwalificeerde beleggers) (as defined in the Dutch Financial Supervision Act (Wet op het financieel toezicht), as amended) in the Netherlands, (ii) standard logo and exemption wording is disclosed, as required by article 5:20(5) of the Dutch Financial Supervision Act (Wet op het financieel toezicht), or such offer is otherwise made in circumstances in which article 5:20(5) of the FSA is not applicable are eligible to participate in the Tender Offers.\nGermany\nNeither the Tender Offers nor the Offer to Purchase constitutes an offer of securities or the solicitation of an offer of securities to the public in Germany under the Securities Prospectus Act (Wertpapierprospektgesetz). Accordingly, the Offer to Purchase has not been submitted for approval and has not been approved by the German Federal Financial Supervisory Authority (Bundesanstalt für Finanzdienstleistungsaufsicht - BaFin) or any other German public authority.\nGeneral\nNone of this announcement, the Offer Documents or the electronic transmission of this announcement or the Offer Documents constitutes an offer to buy or the solicitation of an offer to sell Securities (and tenders of Securities for purchase pursuant to the Tender Offers will not be accepted from holders) in any circumstances in which such offer or solicitation is unlawful. The Company is not aware of any jurisdiction where the making of one or both of the Tender Offers is not in compliance with the laws of such jurisdiction. If the Company becomes aware of any jurisdiction where the making of the Tender Offers would not be in compliance with such laws, the Company will make a good faith effort to comply with any such laws or may seek to have such laws declared inapplicable to such Tender Offers. If, after such good faith effort, the Company cannot comply with any such applicable laws, the Tender Offers will not be made to the holders of Securities residing in each such jurisdiction.\nIn any jurisdictions where the securities, blue sky or other laws require the Tender Offers to be made by a licensed broker or dealer and any of the Dealer-Managers or, where the context so requires, their respective affiliates is such a licensed broker or dealer in any such jurisdiction, the Tender Offers shall be deemed to be made on behalf of the Company by such Dealer-Manager or such affiliate (as the case may be) or one or more registered brokers or dealers licensed in such jurisdiction.\nBy tendering your securities, or instructing your intermediary to tender your securities, pursuant to a Tender Offer, you are representing and warranting that you are not a person to whom it is unlawful to make an invitation to tender pursuant to such Tender Offer under applicable law, and you have observed (and will observe) all laws of relevant jurisdictions in connection with your tender. Each holder participating in a Tender Offer will be deemed to give certain representations in respect of the jurisdictions referred to above and generally as set out in the Offer to Purchase under the heading “The Tender Offers―Procedures for Tendering Securities.” If you are unable to make these representations, your tender of Securities for purchase may be rejected. Each of the Company, the Dealer-Managers, the Information Agent and the Depositary reserves the right, in their absolute discretion, to investigate, in relation to any tender of Securities for purchase pursuant to a Tender Offer, whether any such representation given by a holder is correct and, if such investigation is undertaken and as a result the Company determines (for any reason) that such representation is not correct, such tender or submission may be rejected.\nAbout Walmart\nWal-Mart Stores, Inc. (NYSE: WMT) helps people around the world save money and live better - anytime and anywhere - in retail stores, online, and through their mobile devices. Each week, over 260 million customers and members visit our more than 11,600 stores under nearly 59 banners in 28 countries and eCommerce websites. With fiscal year 2017 revenue of $485.9 billion, Walmart employs approximately 2.3 million associates worldwide. Walmart continues to be a leader in sustainability, corporate philanthropy and employment opportunity.\nForward-Looking Statements\nThis press release contains a number of . Words, and variations of words, such as “will,” “expect,” “may,” “estimate,” “deliver” and “target” and similar expressions are intended to identify the Company’s , including, but not limited to, statements about the expected timing, size or other terms of the Tender Offers and the Company’s ability to complete the Tender Offers. These are subject to a number of risks and uncertainties, many of which are beyond the Company’s control, which could cause the Company’s actual results to differ materially from those indicated in the Company’s . Please see the Cautionary Statement Regarding Forward-Looking Statements in the Offer to Purchase, as well as the Company’s risk factors, as they may be amended from time to time, set forth in its filings with the U.S. Securities and Exchange Commission, including the Company’s Annual Report on Form 10-K for the year ended January 31, 2017, and the Company’s subsequently filed Quarterly Reports on Form 10-Q and Current Reports on Form 8-K. Wal-Mart Stores, Inc. disclaims and does not undertake any obligation to update or revise any forward-looking statement in this press release, except as required by applicable law or regulation.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006648/en/\nWal-Mart Stores, Inc.\nMedia Relations Contact\nRandy Hargrove, 800-331-0085\nor\nInvestor Relations Contact\nSteve Schmitt, 479-258-7172\nSource: Wal-Mart Stores, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.gbsc-usa.com%2FWal-Mart%2F&esheet=51747947&newsitemid=20180123006648&lan=en-US&anchor=http%3A%2F%2Fwww.gbsc-usa.com%2FWal-Mart%2F&index=1&md5=842ee72ac0240a5c3d2a37ef2c406be1", "http://www.gbsc-usa.com/Wal-Mart/", "http://www.businesswire.com/news/home/20180123006648/en/"], "published": "2018-01-24T05:14:00.000+02:00", "crawled": "2018-01-24T06:04:35.016+02:00", "highlightTitle": ""}