{"organizations": [], "uuid": "94e70a97f544ffd85136a6629b521e0c6bb760ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/buffett-successors.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/10/warren-buffett-berkshire-hathaway-gregory-abel-ajit-jain/", "country": "US", "domain_rank": 1196, "title": "Warren Buffett Just Took a Big Step Toward Naming His Successor | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.931, "site_type": "news", "published": "2018-01-10T10:50:00.000+02:00", "replies_count": 0, "uuid": "94e70a97f544ffd85136a6629b521e0c6bb760ed"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/10/warren-buffett-berkshire-hathaway-gregory-abel-ajit-jain/", "ord_in_thread": 0, "title": "Warren Buffett Just Took a Big Step Toward Naming His Successor | Fortune", "locations": [], "entities": {"persons": [{"name": "warren buffett", "sentiment": "negative"}, {"name": "gregory e. abel", "sentiment": "negative"}, {"name": "abel", "sentiment": "none"}, {"name": "charles t. munger", "sentiment": "none"}, {"name": "buffett", "sentiment": "none"}, {"name": "berkshire hathaway", "sentiment": "none"}, {"name": "jain", "sentiment": "none"}], "locations": [], "organizations": [{"name": "bloomberg 8:50 am est  berkshire hathaway", "sentiment": "neutral"}, {"name": "berkshire hathaway", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 8:50 AM EST \nBerkshire Hathaway is adding two senior executives — Gregory E. Abel and Ajit Jain — to its board as speculation grows about who will replace the company’s 87-year-old chief executive officer, Warren Buffett , atop one of the world’s largest companies. \nAbel, 55, will be vice chairman of the non-insurance business, while Jain, 66, will be vice chairman of the insurance operations, the company said in a statement Wednesday. Buffett and Charles T. Munger, 94, Berkshire Hathaway’s vice chairman, will continue in their current positions, including being responsible for significant capital allocation decisions and investment activities. \nRead: Warren Buffett’s Berkshire Hathaway Could Make $37 Billion from Trump’s Tax Cut \nAbel and Jain are both long-time contenders to succeed Buffett, whose five-decade tenure running the company helped him amass a fortune. He has said he wants his successor to be drawn from the company’s ranks, relatively young and unmotivated by ego. Abel is viewed as the favorite to succeed the CEO at present. \nJain and Abel each fit many aspects of Buffett’s carefully tailored job description. They’re deeply committed to Berkshire’s culture, which prizes efficiency and long-term thinking. Neither has outward character flaws that would immediately be disqualifying. And each has built large businesses for Buffett. \nJain runs the company’s namesake reinsurance operation, which for decades has provided Berkshire with billions of premium dollars for investments and acquisitions. Buffett has repeatedly said that Jain has probably made more money for shareholders than he has. In 2011 he said the board would make Jain CEO if he wanted the job. \nRead: Warren Buffett Just Won a $1 Million Bet \nAbel has steadily expanded Berkshire Hathaway Energy, a utility holding company based in Iowa, into a colossus in the energy industry. It runs several power companies throughout North America and the U.K., interstate natural gas pipelines, and giant wind and solar farms. It’s a big part of Berkshire that stands to get only bigger, Buffett said in May at the company’s annual shareholder meeting, adding that it’s “hard to imagine a better-run operation.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-10T10:50:00.000+02:00", "crawled": "2018-01-10T17:36:04.019+02:00", "highlightTitle": ""}