{"organizations": [], "uuid": "7269e9f75165269af4e2b149b7cb75c24a4a2408", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224083868&w=1200&r=LYNXMPEE0L0J6", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-cricket-australia-review/world-champions-australia-to-review-woeful-one-day-form-idUKKBN1FB0RN", "country": "US", "domain_rank": 408, "title": "World champions Australia to review woeful one-day form", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T10:00:00.000+02:00", "replies_count": 0, "uuid": "7269e9f75165269af4e2b149b7cb75c24a4a2408"}, "author": "", "url": "https://uk.reuters.com/article/uk-cricket-australia-review/world-champions-australia-to-review-woeful-one-day-form-idUKKBN1FB0RN", "ord_in_thread": 0, "title": "World champions Australia to review woeful one-day form", "locations": [], "entities": {"persons": [{"name": "steve smith", "sentiment": "none"}, {"name": "hohns", "sentiment": "none"}, {"name": "trevor hohns", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 8:02 AM / Updated 16 minutes ago World champions Australia to review woeful one-day form Reuters Staff 3 Min Read \nSYDNEY (Reuters) - Australia’s world champion one-day team could face a major overhaul after they slumped to a 10th loss in 11 games, according to chairman of selectors Trevor Hohns. \nSteve Smith’s side were beaten by 16 runs by England in Sydney on Sunday to give the tourists an unassailable 3-0 lead in the five-match series. \nIt is the first home series loss for Australia since 2010 and they have won just 26 of their 50 completed matches since they beat New Zealand at the Melbourne Cricket Ground by seven wickets in 2015 to clinch their fifth global title. \n“With what’s happened recently we are reviewing how we’re actually playing the game and type of player that’s required in the one-day format,” Hohns told reporters in Sydney on Monday. \n“We haven’t played well in this series, we don’t seem to have been able to put it all together on the one day, there has been something lacking.” \nAustralia’s struggles in the 50-over format has not gone un-noticed in the cricketing world, with the New Zealand Herald newspaper asking if the side were “the worst world champions?”. \nA statistical breakdown of previous world champions’ winning percentages, showed that only the 1983 Indian team had a worse success rate between tournaments. \nIndia won 44 percent of their games between 1983 and 1987. \nSmith’s side have also been far from settled. \nFour of the 2015 World Cup winners -- captain Michael Clarke, wicketkeeper Brad Haddin, pace bowler Mitchell Johnson and all-rounder Shane Watson -- have retired from international cricket. Since that victory, selectors have also given 18 players debuts in one-day international cricket. \nIn an era when run rates are pushed consistently past six an over, Australia have also only scored more than 300 on 13 occasions in 50 completed matches since the World Cup. They lost three of those games. \nHohns said the selectors may need to look at a different type of player for their side, with a focus on hard-hitting middle order players and specialist limited-overs bowlers as they look ahead to the 2019 World Cup in England. \n“With the World Cup in 2019 there is a lot of one-day cricket to be played between now and then,” he said. “We will be trying very soon to get together the main nucleus of our squad so they can play together for some time.” Reporting by Greg Stutchbury in Wellington; Editing by John O'Brien", "external_links": [], "published": "2018-01-22T10:00:00.000+02:00", "crawled": "2018-01-22T10:14:54.000+02:00", "highlightTitle": ""}