{"organizations": [], "uuid": "50989405d06b246a96ec492b5097db2b9c291aa4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-southern-europe-bonds-on-a-roll-spain-german-yield-gap-tightest-since-2010-idUSL8N1PI26I", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Southern Europe bonds on a roll: Spain/German yield gap tightest since 2010", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T19:46:00.000+02:00", "replies_count": 0, "uuid": "50989405d06b246a96ec492b5097db2b9c291aa4"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-southern-europe-bonds-on-a-roll-spain-german-yield-gap-tightest-since-2010-idUSL8N1PI26I", "ord_in_thread": 0, "title": "UPDATE 2-Southern Europe bonds on a roll: Spain/German yield gap tightest since 2010", "locations": [], "entities": {"persons": [{"name": "fanny potkin", "sentiment": "none"}, {"name": "dhara ranasinghe", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "southern europe", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Spain bond yields hit 7-month low\n* Over 43 bln euros in demand for Spain’s new 10-year bond\n* Gap over German Bunds tightest since 2010\n* Portuguese 10-year yields lowest since April 2015\n* Euro zone periphery govt bond yields tmsnrt.rs/2ii2Bqr (Updates prices)\nBy Fanny Potkin and Dhara Ranasinghe\nLONDON, Jan 23 (Reuters) - The premium investors’ demand for holding Spanish bonds over benchmark German peers fell to its lowest level since 2010 on Tuesday as recent ratings upgrades for Spain and Greece, and solid demand at Spanish bond sale, bolstered sentiment.\nSpanish bonds were in strong demand on Tuesday. The yield on Spain’s outstanding 10-year bond dropped to seven-month lows while there was over 43 billion euros of demand for a sale of new 10-year Spanish bonds in what is potentially the largest ever order book for a European bond sale.\nElsewhere in Southern Europe, Portuguese 10-year bond yields hit their lowest since 2015, Italian peers tumbled to one-month lows, and short-dated Greek bond yields hit record lows.\n“We’ve heard reports of considerable interest in the 10-year Spanish syndication, which means that even with this supply coming to the market, the fact it is being so well-received is seeing Spain’s spread over Germany tighten,” said Richard McGuire, head of rates strategy at Rabobank.\n“It’s a watershed moment for Spain, with 10-year Spanish bonds decisively blowing 100 bps, which is a resistance that’s held ever since 2014.”\nSpain’s 10-year bond yield hit a seven-month low of 1.34 percent, taking its falls over the past three sessions to 12 bps.\nThe premium investors demand for holding Spanish bonds over German peers fell to its lowest since April 2010 at around 79 bps, according to Reuters data.\nFitch upgraded Spain’s credit rating to “A-” with a stable outlook late on Friday, citing a broad-based economic recovery in the country’s first “A” rating from one of the top three ratings agencies since the euro zone debt crisis.\nPortuguese bond yields fell 6 bps, their lowest since April 2015 at 1.66 percent, while Italian 10-year bond yields hit a one-month low at 1.879 percent.\nThe Portugual-Germany 10-year bond yield spread was at its tightest since April 2010 at around 118 bps while Italian 10-year yields were at their tightest over German peers since mid-December at 139.5 bps.\nTwo and five-year bonds yields in Greece, which received its first ratings upgrade from Standard & Poor’s in two years on Friday, hit record lows at 1.21 percent and 2.73 percent respectively.\n“Concerns about Italy have died down, we’ve had the Spain upgrade, good news on Greece as well as a quite good economic environment, which is something that benefits the periphery,” said DZ Bank strategist Daniel Lenz.\nEuro zone finance ministers welcomed Greek progress in delivering reforms but said on Monday they would only disburse the next tranche of loans once all agreed actions are complete.\nOther euro zone bond yields were roughly unchanged after the Bank of Japan played down speculation that it was close to ending its stimulus, raising hopes that the European Central Bank may do the same when it meets later this week.\nRegional bond markets showed little immediate reaction to news of a deal to lift a three-day U.S. government shutdown. While U.S. Treasury yields rose on Monday, they were lower in European trade on Tuesday.\nReporting by Fanny Potkin & Dhara Ranasinghe; Editing by Richard Balmforth\n ", "external_links": ["http://tmsnrt.rs/2ii2Bqr", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T19:46:00.000+02:00", "crawled": "2018-01-23T20:40:00.005+02:00", "highlightTitle": ""}