{"organizations": [], "uuid": "eb6f78842ddf00c9014f9fe7f3b579c7b3a2375f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-voya-financial-prices-offering-of-350-million-of-junior-subordinated-notes.html", "country": "US", "domain_rank": 767, "title": "Voya Financial Prices Offering of $350 Million of Junior Subordinated Notes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-19T02:55:00.000+02:00", "replies_count": 0, "uuid": "eb6f78842ddf00c9014f9fe7f3b579c7b3a2375f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-voya-financial-prices-offering-of-350-million-of-junior-subordinated-notes.html", "ord_in_thread": 0, "title": "Voya Financial Prices Offering of $350 Million of Junior Subordinated Notes", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "voya", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "voya financial, inc.", "sentiment": "neutral"}, {"name": "voya holdings inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Voya Financial, Inc. (NYSE:VOYA) (“Voya” or the “Company”) today announced that it has priced a private placement (the “Offering”) of $350 million aggregate principal amount of 4.7% Fixed-to-Floating Rate Junior Subordinated Notes due 2048 (the “Notes”). The Notes will be guaranteed on an unsecured, junior subordinated basis by Voya Holdings Inc. (“Voya Holdings”), a wholly-owned subsidiary of Voya. The Offering is subject to customary closing conditions and is expected to close on January 23, 2018.\nAs previously announced, the Company intends to use the net proceeds from the Offering to repay at maturity our unsecured 2.9% senior notes due 2018 (the “Senior Notes due 2018”) and to pay accrued interest thereon. To the extent any proceeds remain after the repayment of the Senior Notes due 2018, we will use such proceeds for general corporate purposes.\nThe Notes and related guarantee have not been registered under the Securities Act of 1933, as amended (the “Securities Act”), or any state securities laws. Unless they are so registered, the Notes and related guarantee may not be offered or sold within the United States except pursuant to an exemption from, or in a transaction not subject to, the registration requirements of the Securities Act and applicable state securities law. The Notes and related guarantee will be offered only to persons reasonably believed to be “qualified institutional buyers” in compliance with Rule 144A under the Securities Act and outside the United States to non-U.S. persons in compliance with Regulation S under the Securities Act.\nThis press release is neither an offer to sell, nor a solicitation of an offer to buy the Notes, or any other securities, and shall not constitute an offer to sell, or a solicitation of an offer to buy, or a sale of, the Notes, or any other securities, in any jurisdiction in which such offer, solicitation or sale is unlawful. Any offers of the Notes will be made only by means of a private offering memorandum.\nCOMMENTARY REGARDING FORWARD-LOOKING STATEMENTS\nCertain statements in this press release, including those describing the closing of the Offering and the expected use of proceeds from the Offering, constitute forward looking statements. These statements are not historical facts but instead represent only Voya’s belief regarding future events, many of which, by their nature, are inherently uncertain and outside Voya’s control. It is possible that actual results will differ, possibly materially, from the anticipated results indicated in these statements. Factors that may cause actual results to differ from those in any forward-looking statement also include those described under “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Trends and Uncertainties” in Voya’s Annual Report on Form 10-K for the year ended December 31, 2016, filed with the Securities and Exchange Commission (“SEC”) on February 23, 2017, Voya’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2017, filed with the SEC on August 2, 2017, Voya’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2017, filed with the SEC on November 1, 2017, and the other filings Voya makes with the SEC.\nAbout Voya Financial ®\nVoya Financial, Inc. (NYSE:VOYA), helps Americans plan, invest and protect their savings — to get ready to retire better. Serving the financial needs of approximately 13.6 million individual and institutional customers in the United States, Voya is a Fortune 500 company that had $11 billion in revenue in 2016. The company had $541 billion in total assets under management and administration as of September 30, 2017. With a clear mission to make a secure financial future possible — one person, one family, one institution at a time — Voya’s vision is to be America’s Retirement Company ® . Certified as a “Great Place to Work” by the Great Place to Work ® Institute, Voya is equally committed to conducting business in a way that is socially, environmentally, economically and ethically responsible and has been recognized as one of the 2017 World’s Most Ethical Companies ® by the Ethisphere Institute, as well as one of the Top Green Companies in the U.S., by Newsweek magazine.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180118006503/en/\nVoya Financial, Inc.\nMedia:\nChristopher Breslin, 212-309-8941\nChristopher.Breslin@voya.com\nor\nInvestors:\nDarin Arita, 212-309-8999\nIR@voya.com\nSource: Voya Financial, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180118006503/en/"], "published": "2018-01-19T02:55:00.000+02:00", "crawled": "2018-01-19T05:16:39.000+02:00", "highlightTitle": ""}