{"organizations": [], "uuid": "ef33071ed21d32fbf9f06abe0d996c304c7f8cd9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000336/device/rss", "section_title": "Janet Yellen", "url": "https://www.cnbc.com/2018/01/23/the-associated-press-fed-nominee-goodfriend-grilled-by-democrats.html", "country": "US", "domain_rank": 767, "title": "Fed nominee Goodfriend grilled by Democrats", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T21:00:00.000+02:00", "replies_count": 0, "uuid": "ef33071ed21d32fbf9f06abe0d996c304c7f8cd9"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/23/the-associated-press-fed-nominee-goodfriend-grilled-by-democrats.html", "ord_in_thread": 0, "title": "Fed nominee Goodfriend grilled by Democrats", "locations": [], "entities": {"persons": [{"name": "goodfriend", "sentiment": "negative"}, {"name": "marvin goodfriend", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "robert menend", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "pittsburgh", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "federal reserve", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "senate banking committee", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "carnegie mellon university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — Federal Reserve board nominee Marvin Goodfriend said Tuesday he supports the Fed's political independence and its dual goals of achieving stable prices and low unemployment. But those assurances did not seem to satisfy Democrats who say Goodfriend's past policy positions are at odds with his current views.\nGoodfriend, an economics professor at Carnegie Mellon University in Pittsburgh, faced tough questioning from Democrats on the Senate Banking Committee during his confirmation hearing. He won the backing of Republicans who spoke favorably of his conservative views.\nUnder questioning, Goodfriend said he regretted calling the Fed's goal of low unemployment \"incoherent\" and said he supported the dual mandate Congress has given the Fed on inflation and unemployment. President Donald Trump nominated Goodfriend for a vacancy on the seven-member Fed board.\nUnder questioning, Goodfriend said he regretted calling the Fed's goal of low unemployment \"incoherent\" and that he supported the dual mandate Congress has given the Fed on inflation and unemployment.\nSen. Robert Menendez, D-New Jersey, said he was concerned that Goodfriend's rejection of previous positions could just be a \"confirmation conversion\" aimed at winning Senate approval for the Fed job.\nGoodfriend responded \"absolutely\" when asked by Sen. Elizabeth Warren, D-Massachusetts, if his forecasts had proven to be wrong when he warned back in 2011 that the Fed should be moving interest rates up more quickly to keep inflation under control.\nShe said that the Fed decision to ignore those warnings and keep rates low had resulted in millions more Americans getting jobs, with the unemployment rate currently at a 17-year low of 4.1 percent. She said despite the inflation threats that Goodfriend had warned about, inflation has remained below the Fed's 2 percent target.\nIn support of Goodfriend's past views, Sen. Patrick Toomey, R-Pennsylvania, said that no one can be certain that there are not currently asset bubbles in such areas as stock prices that could burst and cause real problems for the economy.\nTrump last year also nominated current Fed board member Jerome Powell to be the next chairman of the central bank after deciding against nominating current Chair Janet Yellen for a second term. The full Senate began debating that nomination on Tuesday with a vote expected later this week.\nThe president, who was often critical during the campaign of what he saw as over-zealous regulation of banks, will have the opportunity to remake the Fed board during his first term. In addition to Powell and Goodfriend, Trump has filled the Fed's key position of vice chairman for supervision with Utah financier Randal Quarles.\nAfter Yellen departs the Fed board next month, Trump will still have three vacancies to fill on the board including the position of Vice Chairman which has been vacant since Stanley Fischer departed last October.", "external_links": [], "published": "2018-01-23T21:00:00.000+02:00", "crawled": "2018-01-25T10:55:11.003+02:00", "highlightTitle": ""}