{"organizations": [], "uuid": "c0d8c756322367532aae7e5114e07cc23fed9929", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928138-Screen_Shot_2018-01-04_at_10.11.06_AM.1910x1000.png", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/03/great-lakes-ranch-owners-made-millions-raising-yaks-and-alpacas.html", "country": "US", "domain_rank": 767, "title": "Great Lakes Ranch owners made millions raising yaks and alpacas", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T16:41:00.000+02:00", "replies_count": 0, "uuid": "c0d8c756322367532aae7e5114e07cc23fed9929"}, "author": "Ali Montag", "url": "https://www.cnbc.com/2018/01/03/great-lakes-ranch-owners-made-millions-raising-yaks-and-alpacas.html", "ord_in_thread": 0, "title": "Great Lakes Ranch owners made millions raising yaks and alpacas", "locations": [], "entities": {"persons": [{"name": "jandy sprouse", "sentiment": "negative"}, {"name": "brad", "sentiment": "negative"}, {"name": "brad sprouse", "sentiment": "none"}], "locations": [{"name": "leelanau", "sentiment": "none"}, {"name": "great lakes ranch", "sentiment": "none"}, {"name": "great lakes ranch fiber", "sentiment": "none"}, {"name": "mich.", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "fashion store", "sentiment": "none"}, {"name": "cnbc | blue collar millionaires brad", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brad and Jandy Sprouse are the owners of Great Lakes Ranch , a sprawling homestead in Leelanau County, Mich., surrounded by thousands of acres of empty pine forests, lakes and rivers.\nThe couple's idyllic home is also the headquarters of the Sprouses' business: breeding Tibetan Yak .\n\"We get up in the morning and ... we take in the view with all the animals in front of us and the beautiful valley and have a cup of coffee before we head out to the barn,\" Jandy Sprouse says on CNBC's \" Blue Collar Millionaires .\"\nCNBC | Blue Collar Millionaires Brad and Jandy Sprouse In addition to the livestock, the couple also sells local yarns, fibers and cozy products from yak wool through their Great Lakes Ranch Fiber, Yarn and Fashion Store .\nBrad Sprouse got started in the business in 1981 raising llamas. In 1991, the ranch added Tibetan Yak, and in 1993 they began breeding Suri alpacas, according to the ranch's website . Today they focus only on yak. \nBut it's been lucrative.\nFor example, according to \"Blue Collar Millionaires,\" which aired in 2015, it cost the couple $350 per year to raise an alpaca, even \"with vet bills, grain, hay the whole works,\" says Jandy. Not bad, considering that they could sell the animals for $15,000 to $35,000 a head. Why? Many expensive suits and knits are made from alpaca.\n\"Alpacas will have a baby a year so a lot of times I'll describe them as dividends,\" Brad Sprouse says on the show. At the time, the ranch was averaging 20 babies a year, generating as much as $700,000 in sales.\nFor the yaks, which the Great Lakes Ranch still sells , there is also demand from consumers for protein. \n\"There is also the meat end of it, that has become crazy,\" she continues. \"There are way more customers for meat from the yak end of the business than there is product.\"\nThe business has brought in millions over the years. With the money they make, the couple travels the world. According to the show, their list of travels includes \"Peru, Ecuador, Argentina, Costa Rica, Europe, Belize, Tibet and Panama,\" just to name a few.\n\"We get up every morning and we love what we do. This is the American Dream,\" Jandy says. \"I don't see how life could get any better than that.\"\nDon't miss: This former Texas cop turned $5,000 into a multimillion-dollar business cleaning up crime scenes \nLike this story? Like CNBC Make It on Facebook \nshow chapters This man is making millions from cleaning radioactive waste and infectious fluids      11:50 AM ET Thu, 30 Nov 2017 | 01:15", "external_links": [], "published": "2018-01-04T16:41:00.000+02:00", "crawled": "2018-01-04T17:43:24.024+02:00", "highlightTitle": ""}