{"organizations": [], "uuid": "5dafbc6913c9701ed6f22f3c532b66b9de54c385", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-day-zimmermann-ecm-president-michael-mcmahon-named-one-of-safetyhealth-magazineas-ceos-who-aget-ita.html", "country": "US", "domain_rank": 767, "title": "Day & Zimmermann ECM President Michael McMahon Named One of Safety+Health Magazine’s CEOs Who “Get It”", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-29T23:03:00.000+02:00", "replies_count": 0, "uuid": "5dafbc6913c9701ed6f22f3c532b66b9de54c385"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-day-zimmermann-ecm-president-michael-mcmahon-named-one-of-safetyhealth-magazineas-ceos-who-aget-ita.html", "ord_in_thread": 0, "title": "Day & Zimmermann ECM President Michael McMahon Named One of Safety+Health Magazine’s CEOs Who “Get It”", "locations": [], "entities": {"persons": [{"name": "michael mcmahon", "sentiment": "negative"}, {"name": "zimmermann", "sentiment": "negative"}, {"name": "mcmahon", "sentiment": "none"}], "locations": [{"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "zimmermann ecm", "sentiment": "negative"}, {"name": "national safety council", "sentiment": "none"}, {"name": "engineering construction and maintenance", "sentiment": "none"}, {"name": "safety+health", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA, Jan. 29, 2018 (GLOBE NEWSWIRE) -- Day & Zimmermann (D&Z), the century-old, family-owned provider of construction and engineering, staffing and defense solutions for leading corporations and governments around the world, is proud to announce that Michael McMahon, President of the company’s Engineering Construction and Maintenance (ECM) division has been named to the Safety+Health’s 2018 list of CEOs Who “Get It.” According to the publication, the distinction recognizes “leaders whose actions demonstrate a personal commitment to creating and sustaining a culture of safety and health.” Safety+Health is the official magazine of the National Safety Council and this is the 16 th consecutive year it has compiled this list.\n“At Day & Zimmermann safety has always been our number one core value. I believe it’s not just something that you do, it’s got to be in your heart and a part of who you are,” said McMahon. “To receive this award is a true honor, but it is not an endpoint. I remain committed to driving injuries down to zero at Day & Zimmermann. There is nothing more important than the safety of our people.”\nUnder McMahon’s leadership, Day & Zimmermann has posted a stellar safety record and has continued to make significant improvements to its safety culture. Some of his most notable accomplishments include:\nCreation of a comprehensive Environmental Health & Safety Management program built on the Construction Industry Institute’s nine Zero Injury safety management techniques. Development of an Employee Concerns Program (ECP) to provide a confidential method for workers to report their concerns. Creation of the Environmental Health & Safety (EHS) Tool, a web-based, proprietary application developed to track, trend, and report on EHS performance across all its sites. Launch of the “Why Not Zero?®” safety campaign to promote and encourage safe behaviors among all employees.\nMcMahon has more than 35 years of experience in all phases of industrial plant maintenance and construction project execution. Prior to his current position, Mr. McMahon served as president of Day & Zimmermann's Power Services business. Earlier, he served as president of the company’s union operations.\nABOUT DAY & ZIMMERMANN\nFounded in 1901, Day & Zimmermann is a family-owned company with a workforce of over 42,000 specializing in construction & engineering, staffing and defense solutions for leading corporations and governments around the world. Operating from more than 150 worldwide locations with 2.4 Billion USD in revenue, Day & Zimmermann is currently ranked as one of the largest private companies in the U.S. by Forbes. Headquartered in Philadelphia, PA, our first work was to develop \"Betterment Reports\" that helped modernize American factories. Today, we are still in the business of betterment—maintaining the nation's power infrastructure, protecting American freedoms and driving technological advancements around the world. We do what we say. ® http://www.dayzim.com\nCompany Contact:\nSteve Wanczyk\nBraithwaite Communications\nDay & Zimmermann\n215-564-3200 ext. 114\nswanczyk@gobraithwaite.com\nSource: Day & Zimmermann", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/19bc3ae7-773f-413d-9cd7-7ebd22e868ce", "http://www.dayzim.com/"], "published": "2018-01-29T23:03:00.000+02:00", "crawled": "2018-01-30T00:27:16.002+02:00", "highlightTitle": ""}