{"organizations": [], "uuid": "58191f5ede5341c094642449752a7d7f174b6f73", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-shoes-for-crews-names-brian-bugara-executive-vice-president-sales-and-business-development.html", "country": "US", "domain_rank": 767, "title": "Shoes For Crews Names Brian Bugara Executive Vice President, Sales and Business Development", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.043, "site_type": "news", "published": "2018-01-24T20:57:00.000+02:00", "replies_count": 0, "uuid": "58191f5ede5341c094642449752a7d7f174b6f73"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-shoes-for-crews-names-brian-bugara-executive-vice-president-sales-and-business-development.html", "ord_in_thread": 0, "title": "Shoes For Crews Names Brian Bugara Executive Vice President, Sales and Business Development", "locations": [], "entities": {"persons": [{"name": "brian bugara", "sentiment": "negative"}, {"name": "don watros", "sentiment": "none"}, {"name": "brian", "sentiment": "none"}, {"name": "bugara", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}], "organizations": [{"name": "ua brands", "sentiment": "none"}, {"name": "payless shoesource", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WEST PALM BEACH, Fla.--(BUSINESS WIRE)-- Shoes For Crews, LLC (the “Company”), the global leader in slip-resistant footwear, today announced that it has named Brian Bugara as Executive Vice President, Sales and Business Development, effective immediately. He will report to President and Chief Executive Officer Don Watros.\nMr. Bugara has more than 20 years of experience in sales, marketing, new business development and sales operations with both business-to-business and business-to-consumer companies. He most recently served as Senior Vice President of UA Brands, which manufactures and sells uniforms for a variety of industries through retail locations, e-commerce and catalogs. Prior to that, from 2014 to early 2017, Mr. Bugara was Vice President and General Manager of safeTstep, an occupational footwear company that is a division of Payless ShoeSource, where he led the sales, marketing and operations teams and drove substantial sales growth.\n“Brian is a proven sales leader with a strong track record of helping companies achieve their growth objectives by working closely with his sales teams to strengthen customer relationships, launch creative strategic initiatives and improve sales operations,” said Mr. Watros. “He has a talent and a passion for developing and mentoring world-class sales organizations that are focused on exceeding customers’ expectations. He is a terrific addition to our leadership team and we are excited to welcome him to Shoes For Crews.”\nPrior to safeTstep, Mr. Bugara was a sales leader at Rentokil for more than five years and earlier in his career, he worked in a number of sales leadership roles for 17 years at Cintas Corporation.\nMr. Bugara holds a Master’s degree in Political Science and International Relations from Miami University and a Bachelor of Arts degree in Political Science and History from Hiram College.\nAbout Shoes For Crews\nShoes For Crews is a leading designer and manufacturer of slip resistant footwear worldwide. Headquartered in West Palm Beach, Florida, Shoes For Crews began producing slip-resistant footwear in 1984 with a mission to create a safer workplace in industries where floor hazards are a reality. Culinary footwear brand MOZO and work boot brand ACE are also part of the Shoes For Crews family of brands. The December 2016 acquisition of SureGrip has made it possible for Shoes For Crews to offer brands including New Balance and Dockers, and coming soon Johnston & Murphy. The design and development team based in Portland, OR and China focuses on delivering the ultimate in slip-resistant outsole technology, unmatched comfort and on-trend styling, through a complete line of slip resistant footwear designed to bring each employee home safely. For more information on Shoes For Crews, visit www.shoesforcrews.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124005969/en/\nMedia Inquiries\nSard Verbinnen & Co.\nAndrew Cole/Brooke Gordon/Hayley Cook\n212-687-8080\nccmp-svc@sardverb.com\nSource: Shoes For Crews, LLC", "external_links": ["http://www.businesswire.com/news/home/20180124005969/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.shoesforcrews.com&esheet=51748387&newsitemid=20180124005969&lan=en-US&anchor=www.shoesforcrews.com&index=1&md5=d4c3d20325973696ae06fbef889b88f3"], "published": "2018-01-24T20:57:00.000+02:00", "crawled": "2018-01-24T23:30:44.006+02:00", "highlightTitle": ""}