{"organizations": [], "uuid": "3836b0f9a9a86d0f5c3ab68ad529905e0b1d3ba6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/05/reuters-america-canada-fx-debt-c-posts-3-month-high-as-rate-hike-bets-jump-on-jobs-data.html", "country": "US", "domain_rank": 767, "title": "CANADA FX DEBT-C$ posts 3-month high as rate hike bets jump on jobs data", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T23:37:00.000+02:00", "replies_count": 0, "uuid": "3836b0f9a9a86d0f5c3ab68ad529905e0b1d3ba6"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/05/reuters-america-canada-fx-debt-c-posts-3-month-high-as-rate-hike-bets-jump-on-jobs-data.html", "ord_in_thread": 0, "title": "CANADA FX DEBT-C$ posts 3-month high as rate hike bets jump on jobs data", "locations": [], "entities": {"persons": [{"name": "amo sahota", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "cftc", "sentiment": "negative"}, {"name": "bank of canada", "sentiment": "none"}, {"name": "klarity fx", "sentiment": "none"}, {"name": "statistics canada", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds analyst quotes and details on CFTC data and market activity; updates prices)\n* Canadian dollar at C$1.2412, or 80.57 U.S. cents\n* Loonie touches its strongest since Sept. 27 at C$1.2355\n* Bond prices lower across the yield curve\n* Canada-U.S. 2-year spread narrows by 6.7 basis points\nTORONTO, Jan 5 (Reuters) - The Canadian dollar strengthened to a three-month high against its U.S. counterpart on Friday after stronger-than-expected domestic jobs data boosted expectations for a Bank of Canada interest rate hike this month. The Canadian economy added almost 80,000 jobs for the second month in a row in December and the jobless rate dipped to a 41-year low of 5.7 percent, Statistics Canada said. Analysts had expected a modest gain of 1,000 jobs. \"The market has got very excited about the potential for a January rate hike,\" said Amo Sahota, director at Klarity FX in San Francisco. Chances of a hike at the next rate decision on Jan. 17 nearly doubled after the jobs report to 68 percent, the overnight index swaps market indicated. In separate data, Canada's trade deficit in November widened to C$2.54 billion as both exports and imports benefited from increased activity in the automotive industry. Speculators have cut bullish bets on the Canadian dollar to the lowest since July, data from the U.S. Commodity Futures Trading Commission and Reuters calculations showed. As of Jan. 2, net long positions had fallen to 14,739 contracts from 17,346 a week earlier.\nAt 4 p.m. EST (2100 GMT), the Canadian dollar was \ntrading at C$1.2412 to the greenback, or 80.57 U.S. cents, up 0.6 percent. The currency touched its strongest since Sept. 27 at C$1.2355. \"We have pretty good sentiment in commodities and that has helped lend itself to some loonie strength over the holiday period and going into the new year,\" Sahota said. On Thursday, the price of oil, one of Canada's major exports, reached its highest since May 2015. Still, analysts in a Reuters poll say that an uncertain outlook for the North American Free Trade Agreement could weigh on the loonie over the coming months.\nThe U.S. dollar pared gains against a basket of major \ncurrencies on Friday after data showed the U.S. economy created fewer jobs than expected in December. Canadian government bond prices were lower across the yield\ncurve, with the two-year down 12.5 Canadian cents to yield 1.774 percent and the 10-year falling 56 \nCanadian cents to yield 2.152 percent. The two-year yield touched its highest intraday since June 2011 at 1.786 percent, while the gap between the two-year yield and its U.S. counterpart narrowed by 6.7 basis points to a spread of -18.6 basis points, its narrowest since Nov. 9.\n(Reporting by Fergal Smith; Editing by Andrew Hay and Tom Brown)", "external_links": [], "published": "2018-01-05T23:37:00.000+02:00", "crawled": "2018-01-07T03:41:45.026+02:00", "highlightTitle": ""}