{"organizations": [], "uuid": "30eb7e7c81ba2a345327ae4e5a1abfa168968657", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224091681&w=1200&r=LYNXMPEE0L0KR", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-spain-politics-catalonia-puigdemont/catalonias-puigdemont-arrives-in-denmark-without-being-detained-idUKKBN1FB0V4", "country": "US", "domain_rank": 408, "title": "Catalonia's Puigdemont arrives in Denmark without being detained", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T10:38:00.000+02:00", "replies_count": 0, "uuid": "30eb7e7c81ba2a345327ae4e5a1abfa168968657"}, "author": "", "url": "https://uk.reuters.com/article/uk-spain-politics-catalonia-puigdemont/catalonias-puigdemont-arrives-in-denmark-without-being-detained-idUKKBN1FB0V4", "ord_in_thread": 0, "title": "Catalonia's Puigdemont arrives in Denmark without being detained", "locations": [], "entities": {"persons": [{"name": "puigdemont", "sentiment": "negative"}, {"name": "carles puigdemont", "sentiment": "none"}], "locations": [{"name": "catalonia", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "copenhagen", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 8:42 AM / Updated 3 hours ago Catalan crisis rekindled as parliament proposes Puigdemont as leader Rodrigo De Miguel , Teis Jensen 4 Min Read \nMADRID/COPENHAGEN (Reuters) - Catalonia’s parliament nominated former leader Carles Puigdemont, sacked by Spain for unilaterally declaring independence, as candidate to rule the region again in a sign of defiance to Madrid and Prime Minister Mariano Rajoy’s government. \nPuigdemont and his suporters say he can rule from self-imposed exile in Belgium, where he fled to in October to avoid arrest for his part in organising a banned referendum on a split from Spain and the consequent declaration of independence. \nMadrid has rejected this possibility and said it will challenge any attempt by him to rule remotely in the courts. \nPuigdemont said on Monday the independence movement would not bow to Spanish authority in comments during a debate held in the University of Copenhagen. \n“We will not surrender to authoritarianism,” Puigdemont said at the event, which marked his first trip away from Belgium in three months. \nPuigdemont became the top candidate to lead the wealthy northeastern region again after elections in Catalonia last month gave secessionists a slim majority. \nThe 55-year old former journalist potentially faces decades of jail in Spain if he is convicted of the charges levelled against him, including rebellion and sedition, for organising the referendum and declaring Catalonia’s independence. \nRajoy and his ministers have said they would appeal to the courts and maintain Madrid’s direct rule of Catalonia if Puigdemont was elected while abroad. \nHowever, the Catalan parliament’s speaker said Puigdemont was the only candidate chosen by parliament to rule the region. FILE PHOTO: Former Catalan leader Carles Puigdemont poses with members of his party 'Junts per Catalunya' parliament group in Brussels, Belgium January 12, 2018. REUTERS/Francois Lenoir \n“I am conscious of the warnings that weigh upon him, but I am also conscious of his absolute legitimacy to be candidate,” Roger Torrent said. \nCatalonia’s parliament must hold its first vote of confidence on the new leader by Jan. 31. \nMeanwhile, Spain’s Supreme Court rejected on Monday a request from the state prosecutor to reactivate a European arrest warrant to detain Puigdemont while he is in Copenhagen. \nThe court said it was too early to do so while Catalonia’s newly-elected parliament was not back to normal yet. \nWhile at first glance a blow to Madrid’s efforts to have Puigdemont arrested, the court’s decision could also make it more difficult for the former Catalan leader to be allowed to vote. \nSpanish laws make it easier for someone in detention than for someone who is abroad to be granted a parliamentary proxy. \nIn Copenhagen, Puigdemont declined to comment any further on the day’s events. \nAfter weeks of uneasy calm, the political crisis triggered by Catalonia’s independence drive flared up again last week when the new regional parliament elected Torrent as speaker at its first sitting. \nDespite that tension, Spain’s borrowing costs fell to six-week lows on Monday after credit agency Fitch upgraded its sovereign rating to gave Spain its first “A-” grade since the euro zone debt crisis. \nAccording the Danish parliament’s diary, Puigdemont has also been invited to a meeting there on Tuesday by Magni Arge, a deputy representing the Faroe Islands, which have their own independence movement seeking secession from Denmark. Additional reporting by Stine Jacobsen in Copenhagen; Writing by Ingrid Melander and Sonya Dowsett; Editing by John Stonestreet", "external_links": [], "published": "2018-01-22T10:38:00.000+02:00", "crawled": "2018-01-22T11:06:27.121+02:00", "highlightTitle": ""}