{"organizations": [], "uuid": "1e7f29da943ccf3183a1d6f9f7f6a1608464ad29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/philippines-cenbank-inflation/update-1-philippine-c-bank-says-closely-monitoring-credit-growth-in-certain-sectors-idUSL4N1OZ2BQ", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Philippine c.bank says closely monitoring credit growth in certain sectors", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T10:56:00.000+02:00", "replies_count": 0, "uuid": "1e7f29da943ccf3183a1d6f9f7f6a1608464ad29"}, "author": "", "url": "https://www.reuters.com/article/philippines-cenbank-inflation/update-1-philippine-c-bank-says-closely-monitoring-credit-growth-in-certain-sectors-idUSL4N1OZ2BQ", "ord_in_thread": 0, "title": "UPDATE 1-Philippine c.bank says closely monitoring credit growth in certain sectors", "locations": [], "entities": {"persons": [{"name": "nestor espenilla", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "manila", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bangko sentral ng pilipinas", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 8:57 AM / Updated an hour ago UPDATE 1-Philippine c.bank says closely monitoring credit growth in certain sectors Reuters Staff \n* Philippines’ credit-to-GDP ratio still relatively low \n* Central bank closely monitoring property market, big firms \n* Central bank ready to deploy measures to prevent overheating (Adds quotes, more comments, background) \nMANILA, Jan 4 (Reuters) - The Philippine central bank is closely monitoring levels of credit and leverage especially in sectors where there could be pockets of “excessive” lending, as it seeks to keep the economy from overheating, its governor said on Thursday. \nNestor Espenilla, governor of the Bangko Sentral ng Pilipinas, however, said the overall assessment points to an economy still far from being overheated, with its credit-to-GDP ratio of around 63 percent still one of the lowest in Asia. \n“The question is how broad (credit growth) is, or is it just happening in certain parts,” he told reporters. “If that is the case, then we use finer instruments like regulatory policy.” \nAdjusting interest rates was not necessary in such a situation because its impact would be economy-wide and blunt, he said, after speaking on the domestic economy’s prospects in 2018 at a civic group meeting. \nThe central bank was keeping a close eye on the property market and large companies, in particular, he said. \nCommercial banks’ outstanding loans have been growing at a double-digit pace for several months now, exceeding 20 percent at some point, driven mainly by lending to the real estate sector, among industries, central bank data showed. \n“We stand prepared to deploy appropriate measures such as macroprudential policies to prevent economic overheating,” Espenilla said. \nBut while the central bank remains confident that inflation would be within the government’s 2-4 percent target this year until 2019, he said further crude oil price increases may result in inflation hovering in the upper bracket of that range. \nSome economists expect the central bank to start raising the key benchmark rate from 3 percent this year to tame price pressures that may arise from higher taxes, strong growth and a rise in oil prices. \n“You can count on us to timely adjust the monetary policy stance to ward off any threat to our inflation target,” Espenilla said. “We have enough instruments in our toolkit to address the challenges that could arise.” \nThe central bank has left policy setting unchanged since it raised interest rates by 25 basis points in September 2014. In June 2016, it set the main rate at 3 percent when it moved to an interest rate corridor framework. (Reporting by Enrico dela Cruz; Editing by Jacqueline Wong)", "external_links": [], "published": "2018-01-04T10:56:00.000+02:00", "crawled": "2018-01-04T11:37:42.005+02:00", "highlightTitle": ""}