{"organizations": [], "uuid": "9359b494ffc36f68521f8b48d71c5706400c3d30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-boehringer-ingelheim-announces-paul-fonteyne-to-retire-at-the-end-of-2018-wolfgang-baiker-appointed-u-s-president-ceo.html", "country": "US", "domain_rank": 767, "title": "Boehringer Ingelheim Announces Paul Fonteyne to Retire at the end of 2018. Wolfgang Baiker Appointed U.S. President & CEO Effective March 1, 2018.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-31T17:15:00.000+02:00", "replies_count": 0, "uuid": "9359b494ffc36f68521f8b48d71c5706400c3d30"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-boehringer-ingelheim-announces-paul-fonteyne-to-retire-at-the-end-of-2018-wolfgang-baiker-appointed-u-s-president-ceo.html", "ord_in_thread": 0, "title": "Boehringer Ingelheim Announces Paul Fonteyne to Retire at the end of 2018. Wolfgang Baiker Appointed U.S. President & CEO Effective March 1, 2018.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RIDGEFIELD, Conn., Jan. 31, 2018 /PRNewswire/ -- Boehringer Ingelheim announced today that Paul Fonteyne, U.S. President and CEO will retire after 15 years of committed service on December 31, 2018. Wolfgang Baiker, M.D, Ph.D, M.B.A., has been appointed to succeed him, effective March 1, 2018.\nDr. Baiker, currently Senior Vice President, Human Pharma Supply & Global Quality and Head of the Biopharma Business Unit, joined Boehringer Ingelheim in 1989 as Section Head for Clinical Development in Biberach, Germany. Since then, Dr. Baiker has served in a number of senior leadership roles across several critical business functions, including Head of International Project Management, Head of Global Development, Member of the Board of Managing Directors (BMD) responsible for Corporate Board Division Biopharmaceuticals and Operations and currently, as a key member of the worldwide Human Pharma Executive Committee. Dr. Baiker also has significant experience working in the U.S. gained during a seven-year assignment in Ridgefield, CT where he held several different leadership roles within Clinical Development and Clinical Research. Dr. Baiker completed his medical studies and doctorate at the Universities of Bochum, Berlin, Ulm, Munich and Sheffield and received his MBA from Pace University in New York.\n\"This is the perfect time for Wolfgang Baiker to become Boehringer Ingelheim's next U.S. President and CEO. Wolfgang is a strong and experienced leader and our U.S. business is in a great position, poised for continued growth,\" said Paul Fonteyne, U.S. President and CEO, Boehringer Ingelheim. \"Our industry and the U.S. market, in particular, is developing and changing at an incredible pace. Wolfgang has a unique ability to help the company anticipate and navigate this dynamic landscape. His strong track record in leading highly-successful teams makes him the perfect choice to continue the strong legacy of Boehringer Ingelheim in the United States.\"\n\"I am thrilled to return to the U.S. to lead this organization and to help us achieve our objectives of improving patients' lives each and every day. I joined this company nearly 30 years ago, and have been honored to be a part of the important clinical advancements that we have delivered to patients,\" said Dr. Wolfgang Baiker, incoming U.S. President and CEO. \"I look forward to our continued scientific advancements and leading our diverse and dynamic U.S. organization.\"\nMr. Fonteyne will now be turning his full attention for the remainder of the year to leading the U.S. Animal Health business, where he will continue to oversee the integration and normalizing of operations following the acquisition of Merial from Sanofi last year. He will also remain Chairman of the Boehringer Ingelheim USA Board.\nDuring his tenure at Boehringer Ingelheim, Paul Fonteyne oversaw a substantial increase in top line sales and the U.S. launch of Spiriva, the company's bestselling product to date. Prior to becoming U.S. President and CEO in 2012, Paul spent three years as head of Corporate Marketing in Ingelheim, Germany where he successfully launched Pradaxa and Tradjenta while continuing to grow the human pharmaceuticals portfolio globally. Over the last six years in his role as U.S. President and CEO, Paul has accomplished many things, including launching several products to help meet high unmet medical need for patients.\nAbout Boehringer Ingelheim\nBoehringer Ingelheim Pharmaceuticals, Inc., based in Ridgefield, CT, is the largest U.S. subsidiary of Boehringer Ingelheim Corporation.\nBoehringer Ingelheim is one of the world's top 20 pharmaceutical companies. Headquartered in Ingelheim, Germany, the company operates globally with approximately 50,000 employees. Since its founding in 1885, the company has remained family-owned and today creates value through innovation for three business areas including human pharmaceuticals, animal health and biopharmaceutical contract manufacturing.\nBoehringer Ingelheim is committed to improving lives and providing valuable services and support to patients and their families. Our employees create and engage in programs that strengthen our communities. Please visit our website to learn more about how we make more health for more people through our Corporate Social Responsibility initiatives.\nIn 2016, Boehringer Ingelheim achieved net sales of about $17.6 billion (15.9 billion euros). R&D expenditure corresponds to 19.6 percent of its net sales.\nFor more information please visit www.boehringer-ingelheim.us , or follow us on Twitter @BoehringerUS.\nMedia Contact: Erin Crew, erin.crew@boehringer-ingelheim.com\nView original content: http://www.prnewswire.com/news-releases/boehringer-ingelheim-announces-paul-fonteyne-to-retire-at-the-end-of-2018-wolfgang-baiker-appointed-us-president--ceo-effective-march-1-2018-300590977.html\nSOURCE Boehringer Ingelheim", "external_links": ["https://www.boehringer-ingelheim.us/sites/us/files/files/improving-lives.pdf", "http://www.prnewswire.com/news-releases/boehringer-ingelheim-announces-paul-fonteyne-to-retire-at-the-end-of-2018-wolfgang-baiker-appointed-us-president--ceo-effective-march-1-2018-300590977.html", "http://www.boehringer-ingelheim.us/"], "published": "2018-01-31T17:15:00.000+02:00", "crawled": "2018-01-31T18:48:44.008+02:00", "highlightTitle": ""}