{"organizations": [], "uuid": "aa0a355c2089074fedb6856cbbb7b1907eadd485", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225491354&w=1200&r=LYNXMPEE0P0UM", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-stsk-christie/christie-on-short-track-to-success-after-sochi-wipeout-idUKKBN1FF1RT", "country": "US", "domain_rank": 408, "title": "Christie on short track to success after Sochi wipeout", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T15:38:00.000+02:00", "replies_count": 0, "uuid": "aa0a355c2089074fedb6856cbbb7b1907eadd485"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-stsk-christie/christie-on-short-track-to-success-after-sochi-wipeout-idUKKBN1FF1RT", "ord_in_thread": 0, "title": "Christie on short track to success after Sochi wipeout", "locations": [], "entities": {"persons": [{"name": "christie", "sentiment": "negative"}, {"name": "scot", "sentiment": "none"}, {"name": "alan baldwin", "sentiment": "none"}, {"name": "elise christie", "sentiment": "none"}], "locations": [{"name": "sochi", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 1:38 PM / Updated 7 minutes ago Christie on short track to success after Sochi wipeout Alan Baldwin 5 Min Read \nLONDON (Reuters) - Elise Christie knows from bitter experience how fragile Olympic dreams can be in the rough, tough world of short-track speed skating but Britain’s golden hope goes to Pyeongchang with steely determination. \nIn Sochi four years ago, the Scot went into the 500, 1,000 and 1,500 meter races as a top contender only to suffer a failure that left her tormented by cyber bullying and death threats. \nDisqualified from all three, the then 23-year-old drew the ire of South Koreans who blamed her for collisions and crashes that dented the chances of some of that country’s leading skating hopes. \nThe abuse made Christie, who has also spoken about how she was bullied at school, question whether she wanted to stay in the sport she loved. \nNow in a much better place as she heads into what might be considered the lions’ den of South Korea, and boosted by winning three golds at last year’s world championships, she is open about the help she needed to turn things around. \n“Initially I tried to deal with it all on my own,” the 27-year-old, now a 10-times European champion with 29 major medals in her collection but none at an Olympics, told reporters last year. \n”Eventually, I went and asked for some help because I did struggle with the fact that my sport had led to death threats. \n“I couldn’t link how that worked. Why has something that I’d dreamed of doing since I was a kid, that I love doing, led to that?” \nChristie will give social media a wide berth in Pyeongchang, just in case there are any copycats around, but the fear of failing that beset her after 2014 has gone as she prepares for her third Olympics. \n“I think I’ve really, really changed since Sochi,” she explained. \n”I definitely take things a lot less seriously. The biggest thing is just that I’m confident, and I’m not desperate now. Almost I feel like I had to prove it to myself, before. I didn’t feel much self-belief on a daily basis. \n“Now...I believe in what I’m doing and I believe I can go out and win a gold medal. But I also know I’ll survive if I don’t.” TRIPLE GOLD \nTeam GB’s short-track speed skating performance director Stewart Laing told Reuters he had seen a transformation over the two years since he arrived to lead the program. \n“People have titled her ‘The Ice Queen’, the ‘Redemption Kid’, all these sorts of things, but I know she’s going out to Pyeongchang just focused on what she can do, with the knowledge and confidence of what she’s capable of doing,” he said. \n“To be the fastest woman on ice over 500 meters, and to be multiple world champion, has given her just the confidence she needs going into these Games.” \nApart from the three golds won in Rotterdam last March - the 1,000 and 1,500 titles as well as overall - Christie also holds the world record for the 500 meters. \nThe first non-Asian skater to take overall gold in 23 years, and first British woman to win a world championship title, Christie credits sports psychology with making the big difference. \n“It took two years,” she said. “I really felt like without doing that (seeing somebody) there was no way I was going to unlock my full potential. And I was sick of going to world championships and not winning.” \nShe now has to take on the heavily-fancied South Koreans on home ice but knows what to expect, having won a 500m World Cup event in Seoul last November and taken double gold at a Pyeongchang test event. \nThe local fans have also warmed to her. \n“I was thinking ‘Oh man, I’m going to get booed...’ I was preparing myself for the worst,” she said of her first trip to Korea after Sochi. \n”And then everyone ran at me. I couldn’t go in the stands to warm up. I think it was almost like they were embarrassed for the people who had done that (the social media attacks) and almost had the opposite reaction to it. \n“They get so excited, they just want to take pictures with you, touch you. It’s pretty crazy,” added Christie, whose Hungarian boyfriend Sandor Liu Shaolin is a former 500m world champion. \n“It’s nice that it’s obviously turned around. I wouldn’t want to go out there being hated, for sure.” Reporting by Alan Baldwin, editing by Ed Osmond", "external_links": [], "published": "2018-01-26T15:38:00.000+02:00", "crawled": "2018-01-26T15:49:27.037+02:00", "highlightTitle": ""}