{"organizations": [], "uuid": "a4421acf855ecf79fc0a02cd2e236fae50e8971d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-albemarle-announces-retirement-of-matt-juneau-executive-vice-president-corporate-strategy-investor-relations-names-eric-w.html", "country": "US", "domain_rank": 767, "title": "Albemarle Announces Retirement of Matt Juneau, Executive Vice President, Corporate Strategy & Investor Relations; Names Eric W. Norris As Successor", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T01:05:00.000+02:00", "replies_count": 0, "uuid": "a4421acf855ecf79fc0a02cd2e236fae50e8971d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-albemarle-announces-retirement-of-matt-juneau-executive-vice-president-corporate-strategy-investor-relations-names-eric-w.html", "ord_in_thread": 0, "title": "Albemarle Announces Retirement of Matt Juneau, Executive Vice President, Corporate Strategy & Investor Relations; Names Eric W. Norris As Successor", "locations": [], "entities": {"persons": [{"name": "eric w. norris", "sentiment": "neutral"}, {"name": "matt juneau", "sentiment": "neutral"}, {"name": "albemarle", "sentiment": "none"}, {"name": "norris", "sentiment": "none"}, {"name": "matt", "sentiment": "none"}, {"name": "luke kissam", "sentiment": "none"}], "locations": [{"name": "charlotte", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}, {"name": "albemarle", "sentiment": "none"}, {"name": "juneau", "sentiment": "none"}], "organizations": [{"name": "albemarle corporation", "sentiment": "neutral"}, {"name": "nyse", "sentiment": "neutral"}, {"name": "polymer solutions", "sentiment": "none"}, {"name": "global sales and services", "sentiment": "none"}, {"name": "ethyl corporation", "sentiment": "none"}, {"name": "performance chemicals", "sentiment": "none"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHARLOTTE, N.C., Jan. 18, 2018 /PRNewswire/ -- Albemarle Corporation (NYSE: ALB), a leader in the global specialty chemicals industry, announced today that Matt Juneau, executive vice president, Corporate Strategy & Investor Relations, is retiring from the company in March 2018 and that it has named Eric W. Norris as Albemarle's chief strategy officer, effective immediately. As chief strategy officer, Norris will be responsible for both Corporate Strategy and Investor Relations.\nJuneau will be retiring after more than 35 years with Albemarle Corporation and its predecessor, Ethyl Corporation. During his career at Albemarle, Juneau has served in positions of increasing responsibility, including senior vice president, president, Performance Chemicals, vice president, Polymer Solutions and vice president, Global Sales and Services. \"On behalf of the Board of Directors and the leadership team, we thank Matt for his many years of dedicated service to Albemarle,\" stated Albemarle Chairman, President and Chief Executive Officer Luke Kissam. \"We wish Matt the best in his retirement.\"\nNorris joins Albemarle as a seasoned executive with over 20 years of diverse experience in corporate development and business leadership. Prior to joining Albemarle, he served in several roles with FMC Corporation over a 15-year period. Most recently, he served as president, FMC Health and Nutrition, where he was responsible for leading a segment with over $750 million of revenue, 13 stand-alone plants and 12 globally dispersed R&D centers, and over 1,000 employees. Prior to taking on that role, Norris served for five years in FMC's Lithium segment, first as global commercial director before moving up to vice president and global business director. Other roles at FMC included director, Corporate Development, and in its BioPolymer segment, director, Healthcare Ventures.\n\"We are delighted to welcome Eric to Albemarle,\" stated Kissam. \"We look forward to the leadership and contributions his wealth of experience will bring to us. I am confident that his business experiences and insights, combined with his leadership skills, will allow him to make significant contributions to Albemarle's future success.\"\nAbout Albemarle\nAlbemarle Corporation (NYSE: ALB), headquartered in Charlotte, NC, is a global specialty chemicals company with leading positions in lithium, bromine and refining catalysts. We power the potential of companies in many of the world's largest and most critical industries, from energy and communications to transportation and electronics. Working side-by-side with our customers, we develop value-added, customized solutions that make them more competitive. Our solutions combine the finest technology and ingredients with the knowledge and know-how of our highly experienced and talented team of operators, scientists and engineers.\nDiscovering and implementing new and better performance-based sustainable solutions is what motivates all of us. We think beyond business-as-usual to drive innovations that create lasting value. Albemarle employs approximately 4,500 people and serves customers in approximately 100 countries. We regularly post information to www.albemarle.com , including notification of events, news, financial performance, investor presentations and webcasts, non-GAAP reconciliations, SEC filings and other information regarding our company, its businesses and the markets it serves.\n\"Safe Harbor\" Statement under the Private Securities Litigation Reform Act of 1995:\nStatements in this press release regarding Albemarle Corporation's business that are not historical facts are \"forward-looking statements\" that involve risks and uncertainties. For a discussion of such risks and uncertainties, which could cause actual results to differ from those contained in the forward-looking statements, see \"Risk Factors\" in the Company's Annual Report on Form 10-K.\nView original content with multimedia: http://www.prnewswire.com/news-releases/albemarle-announces-retirement-of-matt-juneau-executive-vice-president-corporate-strategy--investor-relations-names-eric-w-norris-as-successor-300584895.html\nSOURCE Albemarle Corporation", "external_links": ["http://www.prnewswire.com/news-releases/albemarle-announces-retirement-of-matt-juneau-executive-vice-president-corporate-strategy--investor-relations-names-eric-w-norris-as-successor-300584895.html", "http://www.albemarle.com/"], "published": "2018-01-19T01:05:00.000+02:00", "crawled": "2018-01-19T02:38:16.000+02:00", "highlightTitle": ""}