{"organizations": [], "uuid": "c217733a20b18a9f5b34b8939262729d13f30799", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/02/the-associated-press-trump-throws-full-us-support-behind-protesters-in-iran.html", "country": "US", "domain_rank": 767, "title": "Trump throws full US support behind protesters in Iran", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T19:39:00.000+02:00", "replies_count": 0, "uuid": "c217733a20b18a9f5b34b8939262729d13f30799"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/02/the-associated-press-trump-throws-full-us-support-behind-protesters-in-iran.html", "ord_in_thread": 0, "title": "Trump throws full US support behind protesters in Iran", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "haley", "sentiment": "none"}, {"name": "nikki haley", "sentiment": "none"}, {"name": "borrowin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "iran washington", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "islamic republic", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "security council", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — The Trump administration on Tuesday threw the weight of the U.S. government behind the protesters taking to the streets of Iran, rooting them on despite the risk of helping Iranian authorities dismiss a week of major demonstrations as the product of American instigation.\nAs Iran's supreme leader accused \"enemies of Iran\" of trying to destabilize his country, the State Department pressed Tehran to unblock social media sites used by the protesters. It even offered advice to tech-savvy Iranians on circumventing state internet controls.\n  declared it was \"time for change\" in Iran, and other officials floated the possibility of additional sanctions. At the United Nations, Ambassador Nikki Haley sought a Security Council meeting to show support for those protesting in the Islamic Republic.\n\"We want to help amplify the voices of the Iranian people,\" said Haley, who appeared before cameras to recite the chants of protesters across Iran. She said Iran's claim that other countries were fomenting the unrest was \"complete nonsense,\" describing the dissent as homegrown.\nBorrowing from a response playbook it has used before, Iran's government blamed the U.S., Saudi Arabia and Britain for the protests. Ayatollah Ali Khamenei, the 78-year-old supreme leader, said Iran's enemies were using money, weapons, politics and spies \"to create problems for the Islamic system, the Islamic Republic and the Islamic Revolution.\"\nTrump was undeterred, praising Iranians for \"finally acting against the brutal and corrupt Iranian regime.\" In an allusion to possible sanctions in response to human rights violations, Trump said the United States would closely monitor the situation.\n\"The U.S. is watching!\" the president tweeted.\nBeyond rhetoric, though, it wasn't clear what   could do substantively to empower the protesters, who are railing against corruption, mismanagement and economic woes including higher food prices. His support also sets up a potential test of his presidential leadership if the protests — already deadly — grow more violent.\nAt least 21 people have died and hundreds have been arrested over six days of demonstrations, the largest in Iran since the \"Green Movement\" that erupted in 2009 following a disputed presidential election. The new outbreak started in Mashhad, Iran's second-largest city, and has expanded to many others.\nIranian authorities have sought to suppress the protests in part by shutting down key social media sites protesters use to communicate, including Instagram, Facebook, Twitter and the messaging app Telegram. On Tuesday, Undersecretary of State Steve Goldstein urged Iran's government to unblock the sites.\n\"They are legitimate avenues for communication,\" Goldstein said. He said the U.S. has an \"obligation not to stand by.\"\nIranians seeking to evade the blocks can use virtual private networks, Goldstein said. Known as VPNs, the services create encrypted data \"tunnels\" between computers and can be used to access overseas websites blocked by the local government.\nThe primary U.S. goal is to ensure enough global attention to deter Iranian authorities from violently cracking down on protesters with impunity, said a senior State Department official involved in Iran policy. The official wasn't authorized to comment by name and demanded anonymity.\nFor Trump, the protests have served as an unexpected but welcome opportunity to rally the world against Iran, and U.S. officials said the administration was actively encouraging other countries to back the protests. Early U.S. attempts to get European allies to coordinate their messaging with the U.S. ran into obstacles, but several countries including France and Italy have joined in expressing concerns.\nIn the U.S., Trump's full-throated support for the protesters has renewed the debate about how best to encourage change in Iran, whose government Trump deems a top national security threat.\nUnder President Barack Obama, the U.S. took a more cautious approach during the last major wave of anti-government protests. It was concerned about enabling Iranian authorities to exploit longstanding suspicions of the U.S., dating back to American and British support for a 1953 coup toppling Iran's elected prime minister.\nBen Rhodes, Obama's former deputy national security adviser, said \"too much ownership\" of the protests by Trump would likely be counterproductive.\n\"I can't imagine that the people marching in the streets of Iran are looking to Donald Trump for inspiration or support,\" Rhodes said. \"I just don't think it helps things for the White House to make this into a U.S.-versus-the-Iranian-government circumstance.\"\nBut former Sen. Joe Lieberman, a staunch Iran critic, said it's a given Tehran will portray dissent as externally provoked.\n\"That's a very weak excuse for American inaction and inconsistency with our own interests and values. I'm glad President Trump is not following that advice,\" Lieberman said in an interview.\nIt wasn't immediately clear what effect Trump's support was having on the protests, although Iran's state TV reported his tweets and some Iranians shared them online.\nWhen it comes to supporting the Iranian aspirations, Trump's credibility may be dented by his hostility to the 2015 Iran nuclear agreement and his inclusion of Iranians in his travel bans.\nTrump's insistence in an October speech on using the term \"Arabian Gulf\" in place of the Persian Gulf also riled the Iranian public. There also was criticism of Secretary of State Rex Tillerson for saying America was working with people in Iran for a \"peaceful transition of that government.\"\nAssociated Press writer Jon Gambrell in Dubai, United Arab Emirates, contributed to this report.\nReach Josh Lederman on Twitter at http://twitter.com/joshledermanAP", "external_links": [], "published": "2018-01-02T19:39:00.000+02:00", "crawled": "2018-01-03T10:35:18.007+02:00", "highlightTitle": ""}