{"organizations": [], "uuid": "8b6b76ef44406d7a617b16c61d42d726a4bbbd6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-wyndham-worldwide-and-la-quinta-holdings-announce-acquisition-agreement.html", "country": "US", "domain_rank": 767, "title": "Wyndham Worldwide and La Quinta Holdings Announce Acquisition Agreement", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.026, "site_type": "news", "published": "2018-01-18T14:30:00.000+02:00", "replies_count": 0, "uuid": "8b6b76ef44406d7a617b16c61d42d726a4bbbd6a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-wyndham-worldwide-and-la-quinta-holdings-announce-acquisition-agreement.html", "ord_in_thread": 0, "title": "Wyndham Worldwide and La Quinta Holdings Announce Acquisition Agreement", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "parsippany", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "irving", "sentiment": "none"}, {"name": "la quinta", "sentiment": "none"}], "organizations": [{"name": "la quinta holdings", "sentiment": "negative"}, {"name": "wyndham worldwide", "sentiment": "negative"}, {"name": "wyndham worldwide corporation", "sentiment": "negative"}, {"name": "la quinta holdings inc.", "sentiment": "none"}, {"name": "la quinta", "sentiment": "none"}, {"name": "corepoint lodging", "sentiment": "none"}, {"name": "wyndham's hotel group", "sentiment": "none"}, {"name": "corepoint lodging inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARSIPPANY, N.J. and IRVING, Texas, Jan. 18, 2018 /PRNewswire/ -- Wyndham Worldwide Corporation (NYSE: WYN) and La Quinta Holdings Inc. (NYSE: LQ) announced today that they have entered into a definitive agreement under which Wyndham Worldwide will acquire La Quinta's hotel franchise and hotel management businesses for $1.95 billion in cash. The acquisition is expected to close in the second quarter of 2018.\nUnder the terms of the agreement, stockholders of La Quinta will receive $8.40 per share in cash (approximately $1.0 billion in aggregate), and Wyndham Worldwide will repay approximately $715 million of La Quinta debt net of cash and set aside a reserve of $240 million for estimated taxes expected to be incurred in connection with the taxable spin-off of La Quinta's owned real estate assets into CorePoint Lodging Inc. Immediately prior to the sale of La Quinta to Wyndham Worldwide, La Quinta will spin off its owned real estate assets into a publicly-traded real estate investment trust, CorePoint Lodging.\nWyndham's Hotel Group is the world's largest and most diverse hotel business based on number of properties. With the acquisition of La Quinta's asset-light, fee-for-service business consisting of nearly 900 managed and franchised hotels, Wyndham Hotel Group will span 21 brands and over 9,000 hotels across more than 75 countries.\nThe addition of La Quinta, one of the largest midscale brands in the industry, will build upon Wyndham Hotel Group's strong midscale presence, expand its reach further into the fast-growing upper-midscale segment, and position Wyndham Hotel Group to be the preferred partner and accommodations provider of developers and guests. The La Quinta Returns® loyalty program, with its 13 million enrolled members, will be combined with the award-winning Wyndham Rewards® program, with its 53 million enrolled members.\nStephen P. Holmes, Chairman and Chief Executive Officer of Wyndham Worldwide, said, \"This transaction builds on Wyndham Worldwide's proven track record of acquiring companies that are a strong strategic and cultural fit, add highly-regarded brands to our portfolio and offer clear opportunities to drive shareholder value through growth, shared best practices and sharp execution.\"\n\"La Quinta will immediately become one of our flagship brands,\" said Geoff Ballotti, President and Chief Executive Officer of Wyndham Hotel Group. \"It is an exceptionally strong brand that is led by service-minded associates who deliver some of the highest customer engagement levels in our industry. We expect that La Quinta guests and franchisees will benefit from our intense focus on product quality and our best-in-class technology, digital, loyalty and distribution platforms. This acquisition also significantly expands our hotel management business and provides us with substantial new opportunities to drive increased growth in our business.\"\nKeith Cline, President and Chief Executive Officer of La Quinta, added, \"As we anticipated, the separation of our businesses is enabling greater strategic clarity and allowing our company to take advantage of growth opportunities that naturally flow from each business model. To that end, we are excited to announce the addition of the La Quinta franchise and management businesses to Wyndham Hotel Group's portfolio. We believe that, under the management of Wyndham's seasoned team of executives, the La Quinta portfolio will grow and thrive, yielding long-term benefits to the stakeholders of both companies.\"\nThe transaction, which has been approved by the boards of directors of both companies, is expected to close upon the completion of the planned spin-off of La Quinta's owned real estate assets into the separate entity. Closing is subject to approval by La Quinta stockholders, regulatory and government approval and the satisfaction of other customary closing conditions. Additional information about the transaction will be available on the companies' investor relations websites, investor.wyndhamworldwide.com and ir.lq.com .\nLa Quinta also announced today that Keith A. Cline has been appointed President and Chief Executive Officer of CorePoint Lodging effective upon completion of the planned spin-off.\nWyndham Worldwide's planned spin-off of Wyndham Hotel Group remains on track for an expected distribution in the second quarter of 2018.\nBarclays is acting as exclusive financial advisor and Kirkland & Ellis LLP is acting as legal advisor to Wyndham Worldwide. Barclays and Deutsche Bank are providing committed financing to Wyndham Worldwide in connection with the transaction. J.P. Morgan is acting as exclusive financial advisor and Simpson Thacher & Bartlett LLP is acting as legal advisor to La Quinta. J.P. Morgan is providing committed financing to CorePoint Lodging in connection with the transaction.\nABOUT WYNDHAM WORLDWIDE\nWyndham Worldwide (NYSE: WYN) is one of the largest global hospitality companies, providing travelers with access to a collection of trusted hospitality brands in hotels, vacation ownership, and unique accommodations including vacation exchange, holiday parks, and managed home rentals. With a collective inventory of nearly 130,000 places to stay across more than 110 countries on six continents, Wyndham Worldwide and its 38,000 associates welcome people to experience travel the way they want. This is enhanced by Wyndham Rewards®, the Company's re-imagined guest loyalty program across its businesses, which is making it simpler for members to earn more rewards and redeem their points faster. For more information, please visit www.wyndhamworldwide.com .\nABOUT WYNDHAM HOTEL GROUP\nWyndham Hotel Group, the world's largest hotel company based on number of hotels, is one of three hospitality business units of Wyndham Worldwide. Driving the democratization of travel, Wyndham Hotel Group is elevating the experience of the everyday traveler. As both a leading hotel brand franchisor and hotel management services provider, the company's global network consists of approximately 8,350 hotels and over 720,100 rooms in more than 75 countries under the following brands: The Trademark Hotel Collection®, Dolce Hotels and Resorts®, Wyndham Grand®, Dazzler® Hotels, Esplendor® Boutique Hotels, Wyndham Hotels & Resorts®, Wyndham Garden® Hotels, TRYP by Wyndham®, Wingate by Wyndham®, Hawthorn Suites by Wyndham®, Microtel Inn & Suites by Wyndham®, Ramada®, Baymont Inn & Suites®, Days Inn®, Super 8®, Howard Johnson®, AmericInn®, Travelodge® and Knights Inn®. The Wyndham Rewards® program, named a best hotel rewards program for the past three years by U.S. News and World Report, offers more than 53 million enrolled members the opportunity to redeem points at more than 30,000 hotels, condos and homes globally. For more information, visit www.wyndhamhotels.com .\nABOUT LA QUINTA HOLDINGS INC.\nLa Quinta Holdings Inc. (LQ) is a leading owner, operator and franchisor of select-service hotels primarily serving the upper-midscale and midscale segments. The Company's owned and franchised portfolio consists of more than 890 properties representing approximately 87,500 rooms located in 48 states in the U.S. an", "external_links": ["http://www.wyndhamhotels.com/", "http://investor.wyndhamworldwide.com/", "http://www.wyndhamworldwide.com/", "http://www.sec.gov/", "http://ir.lq.com/", "http://www.lq.com/", "http://www.prnewswire.com/news-releases/wyndham-worldwide-and-la-quinta-holdings-announce-acquisition-agreement-300584502.html"], "published": "2018-01-18T14:30:00.000+02:00", "crawled": "2018-01-18T17:09:29.016+02:00", "highlightTitle": ""}