{"organizations": [], "uuid": "ad2fa223d1d683703fcf53ea6351d3b3b5b921fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-emerald-announces-closing-of-15-million-prospectus-sale.html", "country": "US", "domain_rank": 767, "title": "Emerald Announces Closing of $15 Million Prospectus Sale", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.091, "site_type": "news", "published": "2018-01-10T01:14:00.000+02:00", "replies_count": 0, "uuid": "ad2fa223d1d683703fcf53ea6351d3b3b5b921fb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-emerald-announces-closing-of-15-million-prospectus-sale.html", "ord_in_thread": 0, "title": "Emerald Announces Closing of $15 Million Prospectus Sale", "locations": [], "entities": {"persons": [], "locations": [{"name": "victoria", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}], "organizations": [{"name": "emerald health therapeutics, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "tsx venture exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VICTORIA, British Columbia, Jan. 09, 2018 (GLOBE NEWSWIRE) -- Emerald Health Therapeutics, Inc. (TSXV:EMH) (OTCQX:EMHTF) (\"Emerald\" or the “Company”) closed today its prospectus sale (the “Offering”) to a single Canadian institutional accredited investor (the “Investor”) announced on January 3, 2018. Pursuant to the Offering, the Company has issued 3,000,000 units (the “Units”) at a price per Unit of $5.00, for gross proceeds of $15,000,000.\nEach Unit consisted of one common share of the Company and one common share purchase warrant (a “Warrant”). Each Warrant will entitle the Investor to acquire one common share of the Company (a “Warrant Share”) at a price of $6.00 per Warrant Share for a period of 36 months following the closing of the Offering. In the event that the closing sale price of the Company’s common shares (the “Common Shares”) on the TSX Venture Exchange is greater than $8.00 per Common Share for a period of 10 consecutive trading days at any time after the closing of the Offering, the Company may accelerate the expiry date of the Warrants by giving notice to the Investor and in such case the Warrants will expire on the 30th day after the date on which such notice is given by the Company.\nThe Company intends to use the net proceeds of the Offering for its production and R&D-related growth plans, working capital and general corporate purposes.\nThe Units were offered by way of a shelf prospectus supplement filed in all of the provinces of Canada, except Quebec, pursuant to National Instrument 44-101 - Short Form Prospectus Distributions .\nThe previously announced purchase by the Investor of 2,000,000 Common Shares (the “Secondary Sale”) from Emerald Health Sciences Inc., a control person of the Company, at a price of $5.00 per share, is expected to close separately.\nAbout Emerald Health Therapeutics Inc.\nEmerald Health Therapeutics, Inc. (TSXV:EMH) (OTCQX:EMHTF) operates through Emerald Health Botanicals Inc. (\"Botanicals\"), a wholly owned subsidiary and Licensed Producer under Canada’s Access to Cannabis for Medical Purposes Regulations. Through Botanicals, Emerald is authorized to produce and sell dried medical cannabis flower and medical cannabis oil. It currently operates an indoor facility in Victoria, BC, and is building a 500,000 s.f. greenhouse on 32 acres in Metro Vancouver, with expansion potential to 1 million s.f. to serve the anticipated legal Canadian adult-use cannabis market starting in 2018. Emerald also owns 50% of Pure Sunfarms Inc., a partnership with Village Farms International Inc. that is converting an existing 1.1 million s.f. greenhouse in Delta, BC from growing tomatoes to growing cannabis. Emerald’s team is highly experienced in life sciences, product development and large-scale agribusiness. Emerald is part of the Emerald Health group , which is broadly focused on developing pharmaceutical, botanical and nutraceutical products designed to provide wellness and medical benefits by interacting with the human body’s endocannabinoid system.\nPlease visit www.emeraldhealth.ca for more information or contact:\nRobert Hill, CFO\n(800) 757 3536 Ext. #722\ninvest@emeraldhealth.ca\nCautionary Statements Regarding Forward Looking Information\nCertain statements in this press release constitute forward-looking statements, within the meaning of applicable securities laws. All statements that are not historical facts, including without limitation, statements regarding future estimates, plans, programs, forecasts, projections, objectives, assumptions, expectations or beliefs of future performance, are \"forward-looking statements\".\nWe caution you that such \"forward-looking statements\" involve known and unknown risks and uncertainties that could cause actual and future events to differ materially from those anticipated in such statements. Forward-looking statements include, but are not limited to, the use of proceeds from the Offering; the timing of the closing of the Secondary Sale, the development, expansion and conversion of greenhouse facilities; and the starting of adult-use cannabis market in 2018.\nEmerald Health Therapeutics Inc. does not intend, and does not assume any obligation, to update these forward-looking statements except as required by law. These forward-looking statements involve risks and uncertainties relating to, among other things, the ability of the Company to negotiate and complete future funding transactions; variations in market conditions; and other risk factors described in the Prospectus and the Company's other filings with the applicable Canadian securities regulators, which may be viewed at www.sedar.com . Actual results may differ materially from those expressed or implied by such forward-looking statements.\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\nSource:Emerald Health Therapeutics Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=Pfqc9OQfFDBi4izBbOv20PvFP8RDxx24jR-R2IvQDyuITDaSUr_Uzajd1r9_LVcA_3Tc6uHuhB2Ssbd5GsF1sTWLwdsDlluqqEVzaAOprV8=", "https://www.globenewswire.com/Tracker?data=97b3eACK5XTlXMYcM45asknjo9ItVNTt06FFjmT7HK56DArD6JSRJUFek0shTJnmc3U1raqey9B2z6ACw_D_K2SCPHjW-mQl9MP_A2mghmE=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/bc102817-e4d7-42c4-ba4c-b88a9aa9955d", "https://www.globenewswire.com/Tracker?data=hDIrcZ400b1SquGwLg8c3D6uXrGzWuD5eMvEJYNoDjose-lkiUmSO1dnxIdj-fUczcZKibAtlnCNWq_vRPmfW6VTZ9qinNqYvZnWNMLKP6c="], "published": "2018-01-10T01:14:00.000+02:00", "crawled": "2018-01-10T02:11:08.008+02:00", "highlightTitle": ""}