{"organizations": [], "uuid": "a399238b80a20232b6d58a2db8d85ef84ef3adc6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223892515&w=1200&r=LYNXMPEE0K0L9", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-libya-security-mines/mines-still-claim-legs-and-lives-in-libyas-benghazi-months-after-war-ceased-idUKKBN1FA0RP", "country": "US", "domain_rank": 408, "title": "Mines still claim legs and lives in Libya's Benghazi, months after war ceased", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T17:19:00.000+02:00", "replies_count": 0, "uuid": "a399238b80a20232b6d58a2db8d85ef84ef3adc6"}, "author": "", "url": "https://uk.reuters.com/article/uk-libya-security-mines/mines-still-claim-legs-and-lives-in-libyas-benghazi-months-after-war-ceased-idUKKBN1FA0RP", "ord_in_thread": 0, "title": "Mines still claim legs and lives in Libya's Benghazi, months after war ceased", "locations": [], "entities": {"persons": [{"name": "beng", "sentiment": "neutral"}, {"name": "ayman al-warfalli", "sentiment": "none"}], "locations": [{"name": "benghazi", "sentiment": "none"}, {"name": "libya", "sentiment": "none"}, {"name": "benghazi", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 3:21 PM / Updated 13 minutes ago Mines still claim legs and lives in Libya's Benghazi, months after war ceased Ayman al-Warfalli 3 Min Read \nBENGHAZI, Libya (Reuters) - As military deminers warily picked their way through streets wrecked by war in Benghazi, a loud blast rang out - a familiar sound in the Libyan city, areas of which are riddled with deadly explosives and booby traps. \nOn this occasion, it was a 27-year-old man returning to his home before it was declared safe to do so who had set off a mine. He died after both his legs were amputated in a vain attempt to save his life. \nMines planted during more than three years of war in Benghazi are taking a high toll on under-equipped deminers and residents trying to return to districts where protracted battles took place. \nMilitary engineers striving to clear the explosives lack mine detectors and are working with basic tools and their bare hands. Their task is painstaking and extremely dangerous: 50 have been killed and 60 wounded, according to a military source. \n“We were commissioned to clear all the main roads and thoroughfares in the areas of Benghazi where there was fighting,” said Tarek Farkash, one of the engineers on the demining expedition in Benghazi’s Souq al-Hout neighbourhood. \n“Some of the work has been completed and some has not, because of the circumstances and obstacles we face.” \nThe war in Benghazi erupted in 2014, when Libyan commander Khalifa Haftar began battling Islamists and other opponents, part of a broader conflict that spread in Libya after the fall of Muammar Gaddafi seven years ago. Members of the demining team of the Libyan National Army search for mines, in Benghazi, Libya January 14, 2018. Picture taken January 14, 2018. REUTERS/Ayman Alwrfaly \nHaftar’s Libyan National Army took a final holdout from its rivals in December, but demining can take months. Souq al-Hout came under the LNA’s control early last summer and is still far from being cleared. \nDespite warnings from the military and indications of mined areas scribbled on walls, some long-displaced residents impatient to rebuild their lives have gone home, with deadly consequences. A member of the demining team of the Libyan National Army dismantles a mine in Benghazi, Libya January 14, 2018. Picture taken January 14, 2018. REUTERS/Ayman Alwrfaly \nFarkash said at least 49 civilians had been killed and 38 injured, with the real number higher as not all cases had been accounted for. \nBenghazi’s Al Jalaa hospital has been dealing with such casualties since February 2016, when Haftar’s forces broke a military deadlock, taking control of the residential district of Laithi. The youngest casualty brought to Al Jalaa was three years old and the oldest 75, a hospital official said. \nOn Thursday, two brothers were killed by a mine as they returned to their home in the city centre. \nSouq al-Hout resident Mohamed al-Ruwayi, whose building had been cordoned off by the military because of the risk from mines, described how a university teacher had recently returned to visit her home with her husband and was killed by a mine as she walked back down the stairs. \n“Yesterday I was sitting in front of the family home just before noon and I heard two consecutive mine explosions,” Ruwayi said. “We didn’t know the cause. It could have been animals entering one of the homes.” Writing by Aidan Lewis; Editing by Robin Pomeroy", "external_links": [], "published": "2018-01-21T17:19:00.000+02:00", "crawled": "2018-01-21T17:40:20.058+02:00", "highlightTitle": ""}