{"organizations": [], "uuid": "70addffe7c548bec3a68eccfff2be3d4c2a1f860", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220289441&w=1200&r=LYNXMPEE070YJ", "site_section": "http://feeds.reuters.com/reuters/healthNews\r", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-india-tobacco/india-top-court-sets-aside-order-cancelling-bigger-tobacco-health-warnings-idUSKBN1EX1I7", "country": "US", "domain_rank": 408, "title": "India top court sets aside order cancelling bigger tobacco health warnings", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:57:00.000+02:00", "replies_count": 0, "uuid": "70addffe7c548bec3a68eccfff2be3d4c2a1f860"}, "author": "", "url": "https://www.reuters.com/article/us-india-tobacco/india-top-court-sets-aside-order-cancelling-bigger-tobacco-health-warnings-idUSKBN1EX1I7", "ord_in_thread": 0, "title": "India top court sets aside order cancelling bigger tobacco health warnings", "locations": [], "entities": {"persons": [{"name": "peter graff", "sentiment": "none"}, {"name": "aditya kalra", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "karnataka", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 2:55 PM / Updated 2 hours ago India top court sets aside order cancelling larger tobacco health warnings Aditya Kalra 3 Min Read \nNEW DELHI (Reuters) - India’s Supreme Court on Monday put on hold a lower court’s order that quashed federal rules mandating larger health warnings on tobacco packages, in a setback for the country’s $11 billion tobacco industry. \nThe High Court of southern Karnataka state last month struck down federal government rules requiring 85 percent of a tobacco pack’s surface to be covered in health warnings, up from 20 percent earlier. The rules had been in force since 2016. \nThe Supreme Court, which heard petitions brought forward by tobacco-control activists, stayed the Karnataka court’s order on Monday, citing the need to protect the health of citizens. \n“Health of a citizen has primacy and he or she should be aware of that which can affect or deteriorate the condition of health,” the Supreme Court said in its 13-page order. \n“Deterioration may be a milder word and, therefore, in all possibility the expression ‘destruction of health’ is apposite.” \nThe court’s decision comes as a relief for health advocates and federal health ministry who say bigger health warnings deter tobacco consumption. More than 900,000 people die each year in India due to tobacco-related illnesses, the government estimates. A man smokes a cigarette along a road in Mumbai, India, October 26, 2016. REUTERS/Danish Siddiqui/File Photo \nIndia’s tobacco packaging rules are among the world’s most stringent. A government survey last year found that 62 percent of cigarette smokers thought of quitting because of such warning labels on the packets. \nThe court's decision is a blow to cigarette makers such as India's ITC Ltd and Philip Morris International Inc's Indian partner, Godfrey Phillips India Ltd, whose representatives call the rules extreme. In protest at the health warning measures, the industry briefly shut its factories across the country in 2016 and filed dozens of legal cases. ( reut.rs/1Of3fKL ) FILE PHOTO: A television journalist sets his camera inside the premises of the Supreme Court in New Delhi, India, February 18, 2014. REUTERS/Anindito Mukherjee/File Photo \nOn Monday, both federal health ministry officials and tobacco industry executives were in attendance inside a packed courtroom to hear the proceedings which lasted for about 40 minutes. The three judges took time to look over examples of health warning pictures used on cigarette packs. \nKapil Sibal, a lawyer who argued for the industry, urged the court to reduce the size of tobacco pack warnings. At one point, he cited the absence of health warnings on a glass of whisky to argue against such displays on tobacco products. \nThe attorney general of India, K. K. Venugopal, defended the government’s stringent rules, saying they were “one of the most progressive” steps to protect the health of people. \nThe case will next be heard on March 12. Reporting by Aditya Kalra; Additional reporting by Suchitra Mohanty; Editing by Tom Lasseter and Richard Balmforth", "external_links": [], "published": "2018-01-08T16:57:00.000+02:00", "crawled": "2018-01-08T17:13:50.033+02:00", "highlightTitle": ""}