{"organizations": [], "uuid": "db51edf6721428cb9b73fea25afcfa2f4d90156c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-csra-schedules-third-quarter-fy-2018-earnings-release-and-conference-call.html", "country": "US", "domain_rank": 767, "title": "CSRA Schedules Third Quarter FY 2018 Earnings Release and Conference Call", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.041, "site_type": "news", "published": "2018-01-15T19:45:00.000+02:00", "replies_count": 0, "uuid": "db51edf6721428cb9b73fea25afcfa2f4d90156c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-csra-schedules-third-quarter-fy-2018-earnings-release-and-conference-call.html", "ord_in_thread": 0, "title": "CSRA Schedules Third Quarter FY 2018 Earnings Release and Conference Call", "locations": [], "entities": {"persons": [{"name": "next gen", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}], "organizations": [{"name": "csra", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "csra inc.", "sentiment": "negative"}, {"name": "csra inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FALLS CHURCH, Va., Jan. 15, 2018 /PRNewswire/ -- CSRA Inc. (NYSE: CSRA) today announced it will issue its third quarter fiscal year 2018 earnings press release after close of market on Wednesday, February 7, 2018. Members of CSRA's executive team will discuss financial results in a conference call beginning at 5:00 p.m. Eastern Time.\nAnalysts and institutional investors may participate in the conference call by dialing 1-877-883-0383 (domestic) or 1-412-902-6506 (international) and entering passcode 3778101. All other participants can join the conference webcast through this link on the Investor Relations section of the CSRA website. A replay of the conference call will be available on the company website approximately two hours after the conclusion of the call.\nAbout CSRA Inc.\nCSRA (NYSE: CSRA) solves our nation's hardest mission problems as a bridge from mission and enterprise IT to Next Gen, from government to technology partners, and from agency to agency. CSRA is tomorrow's thinking, today. For our customers, our partners, and ultimately, all the people our mission touches, CSRA is realizing the promise of technology to change the world through next-generation thinking and meaningful results. CSRA is driving towards achieving sustainable, industry-leading organic growth across federal and state/local markets through customer intimacy, rapid innovation and outcome-based experience. CSRA has over 18,000 employees and is headquartered in Falls Church, Virginia. To learn more about CSRA, visit www.csra.com . Think Next. Now.\nForward-looking Statements\nAll statements in this press release and in all future press releases that do not directly and exclusively relate to historical facts constitute \"forward-looking statements\" within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These statements represent CSRA's intentions, plans, expectations and beliefs. The forward-looking statements are subject to risks, uncertainties and other factors, many of which are outside the control of CSRA. These factors could cause actual results to differ materially from forward-looking statements. For a written description of these factors, see the sections titled \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in CSRA's most recent Annual Report on Form 10-K and any updating information in subsequent SEC filings. CSRA disclaims any intention or obligation to update these forward-looking statements whether as a result of subsequent event or otherwise.\nView original content with multimedia: http://www.prnewswire.com/news-releases/csra-schedules-third-quarter-fy-2018-earnings-release-and-conference-call-300582551.html\nSOURCE CSRA Inc.", "external_links": ["http://www.csra.com/", "https://services.choruscall.com/links/csra171107fJ3vrb1H.html", "https://www.csra.com/", "http://www.prnewswire.com/news-releases/csra-schedules-third-quarter-fy-2018-earnings-release-and-conference-call-300582551.html"], "published": "2018-01-15T19:45:00.000+02:00", "crawled": "2018-01-15T23:01:04.000+02:00", "highlightTitle": ""}