{"organizations": [], "uuid": "645c7d485432e270ac42648252cf5fdcc2fba834", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-bulletpreviews/bullet-point-previews-of-premier-league-matches-idUKKBN1F006U", "country": "US", "domain_rank": 408, "title": "Bullet point previews of Premier League matches", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T04:07:00.000+02:00", "replies_count": 0, "uuid": "645c7d485432e270ac42648252cf5fdcc2fba834"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-bulletpreviews/bullet-point-previews-of-premier-league-matches-idUKKBN1F006U", "ord_in_thread": 0, "title": "Bullet point previews of Premier League matches", "locations": [], "entities": {"persons": [{"name": "antonio conte", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "sean dyche", "sentiment": "none"}, {"name": "riyad mahrez", "sentiment": "none"}, {"name": "davide zappacosta", "sentiment": "none"}], "locations": [{"name": "leicester city", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "king power stadium", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "premier league", "sentiment": "negative"}, {"name": "crystal palace", "sentiment": "none"}, {"name": "leicester city", "sentiment": "none"}, {"name": "palace", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "burnley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 08 AM / Updated 19 minutes ago Bullet point previews of Premier League matches Reuters Staff 8 Min Read \n(Reuters) - Match-by-match facts and statistics ahead of round 23 of the Premier League on Jan. 13-Jan. 15 (games at 1500 GMT unless stated): \nSaturday, Jan. 13 \nChelsea v Leicester City \n*Chelsea have lost one of their last 11 Premier League matches against Leicester, a 2-1 defeat in Dec. 2015 at the King Power Stadium. \n*Since losing to leaders Manchester City in September, Antonio Conte’s Chelsea have won each of their last seven league matches at home, keeping five clean sheets in that time. \n*Leicester City’s Riyad Mahrez has scored seven goals and made seven assists in 22 league matches this season. \n*Davide Zappacosta has come off the bench to either score or assist a goal in each of his last two league appearances for Chelsea. \n*Chelsea are third in the league with 46 points and trail second-placed Manchester United by one point, while Leicester are currently eighth in the standings. \nCrystal Palace v Burnley \n*Sean Dyche’s Burnley have won their last three league matches against Palace. \n*Crystal Palace have gained 11 points from losing positions in the league this season, only less than Arsenal and Everton (12 each). \n*Palace have lost once in last 11 league matches (four wins and six draws) after losing nine of the opening 11 fixtures this season. \n*No player has won more penalties in the league this season than Palace’s Wilfried Zaha (3), while no player has conceded more spot-kicks than Burnley’s James Tarkowski (2). \n*Burnley have drawn five away matches in the league this season, with each of their last three games on the road ending level. \nHuddersfield Town v West Ham United \n*David Wagner’s Huddersfield are without a win in their last four league matches, after they lost at Leicester City in their last match following a run of three successive draws. \n*West Ham recorded a 2-0 win in the reverse fixture in Sept., but have never before won both league matches against Huddersfield in any of the previous 15 seasons they have played each other. \n*David Moyes’s West Ham have collected five points from their last three away fixtures, two more than they had earned in their opening nine matches on the road this season. \n*West Ham’s Marko Arnautovic has scored in his last two away league matches. Only five players have scored in three or more consecutive away matches for West Ham in the Premier League, most recently Diafra Sakho in Oct. 2014. \n*Excluding two own goals, only six different players have appeared on the scoresheet for Huddersfield in the league this season. \nNewcastle United v Swansea City \n*Basement club Swansea’s win at Watford in the league last month ended a run of seven consecutive defeats on the road. \n*Newcastle’s Jamaal Lascelles has scored in both of his league appearances against Swansea, including the winner in the reverse fixture in September. \n*Swansea City have Leroy Fer available for selection after the midfielder’s appeal against a red card was successful. \n*After scoring four in his first eight league games for Swansea this season, striker Tammy Abraham has failed to find the net in his last 12 league appearances. \n*Newcastle forward Ayoze Perez has scored three goals in his last two games in all competitions. \nWatford v Southampton \n*Watford’s only home Premier League victory against Southampton came in their first such meeting against them, a 3-2 win in Dec. 1999. \n*Mauricio Pellegrino’s Southampton are without a win in nine league matches, with only West Bromwich Albion on a longer current run (20). \n*Marco Silva’s Watford have won 48 percent of their Premier League points in home matches this season (12 out of 25), the lowest ratio in the competition. \n*Nathan Redmond has scored four goals and made one assist in his five league appearances against Watford. \n*Watford, currently 10th, have lost six of their last seven league matches, winning the other against Leicester 2-1. \nWest Bromwich Albion v Brighton and Hove Albion \n*West Brom have never lost a home league match against Brighton (five wins, four draws) in a run stretching between 1979 and 1993. \n*Brighton have won three of their last four league matches against West Brom, including a 3-1 victory at the Amex Stadium in the reverse fixture. \n*Chris Hughton has won three of his six Premier League meetings against West Brom as manager. \n*Brighton will be without loanee Izzy Brown, who has returned to his parent club Chelsea due to a knee ligament injury in the FA Cup earlier this week. \n*West Brom are on a 20-game winless streak in the league and are currently 19th in the standings. \nTottenham Hotspur v Everton (1730) \n*Spurs are unbeaten in their last 10 league matches against Everton (five wins, five draws). \n*Everton have managed 29.6 percent of their points this season away from home (eight out of 27), the lowest ratio in the competition. \n*Spurs striker Harry Kane has scored a brace in each of his last two appearances against Everton. \n*Everton have lost their last two league matches under manager Sam Allardyce after going unbeaten in his first six games in the competition. \n*Son Heung-min could become only the second Spurs player to score in five consecutive home Premier League matches after Jermain Defoe, who did so between Nov. and Dec. 2004. \nSunday, Jan. 14 \nBournemouth v Arsenal (1330) \n*Arsenal came back from three goals down to draw 3-3 in this fixture last season, the only time they have ever come back from such a deficit in the Premier League. \n*Bournemouth won their last home league match against Everton but have not managed consecutive league victories at the Vitality Stadium since March last year. \n*Eddie Howe’s Bournemouth have conceded in each of their last nine league matches, with only Stoke (12) on a longer current run coming into this weekend. \n*Arsenal have scored nine headed goals in the league this season, only less than Chelsea who have scored four more. \n*Bournemouth’s Jordon Ibe has recorded 10 shots on target without finding the net, more than any other player in the Premier League this season. \nLiverpool v Manchester City (1600) \n*Mohamed Salah, who has scored 17 Premier League goals this season, has returned to training after missing Liverpool’s last two matches with a groin injury. \n*Liverpool are unbeaten in their last 14 league home matches against City, winning the last four in a row. \n*Juergen Klopp’s Liverpool have conceded four goals and are unbeaten in their last 13 home league matches (seven wins, six draws), keeping nine clean sheets in that time. \n*City’s Sergio Aguero has netted six goals in 11 league appearances against Liverpool but is yet to score in five visits to Anfield. \n*Pep Guardiola’s City are 15 points clear at the top of the league table with 62 points, while Liverpool are fourth with 44 points from 22 matches. \nMonday, Jan. 15 \nManchester United v Stoke City \n*Stoke sacked their manager Mark Hughes after losing to Coventry City in the FA Cup third round last weekend. \n*United have won 25 of a possibl", "external_links": [], "published": "2018-01-11T04:07:00.000+02:00", "crawled": "2018-01-11T04:21:23.054+02:00", "highlightTitle": ""}