{"organizations": [], "uuid": "0c2dba63df7cce3bd5abd0da7e5277f4d84087a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.goldreview.com/?feed=linkfeed", "section_title": "Gold Review » Gold Review", "url": "https://uk.reuters.com/article/global-precious/precious-gold-prices-inch-up-as-dollar-hits-3-yr-lows-idUKL3N1PC1AC", "country": "US", "domain_rank": 408, "title": "Gold prices slip as dollar recovers from 3-yr low", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T16:03:00.000+02:00", "replies_count": 0, "uuid": "0c2dba63df7cce3bd5abd0da7e5277f4d84087a7"}, "author": "cmullen", "url": "https://uk.reuters.com/article/global-precious/precious-gold-prices-inch-up-as-dollar-hits-3-yr-lows-idUKL3N1PC1AC", "ord_in_thread": 0, "title": "Gold prices slip as dollar recovers from 3-yr low", "locations": [], "entities": {"persons": [{"name": "sethuraman n r jan", "sentiment": "none"}, {"name": "mark keenan", "sentiment": "none"}], "locations": [{"name": "asia-pacific", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "societe generale", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 3:42 AM / Updated 8 hours ago PRECIOUS-Gold prices slip as dollar recovers from 3-yr low Reuters Staff 4 Min Read * Spot gold to test $1,357.54/oz - technicals * Platinum hits highest since September (Updates prices) By Sethuraman N R Jan 17 (Reuters) - Gold prices reversed early gains to trade slightly lower on Wednesday as the U.S. dollar recovered from a three-year low against a basket of currencies. Spot gold was down 0.3 percent at $1,334.86 an ounce by 0641 GMT, after rising to $1,343.91 earlier in the session. It touched its strongest since Sept. 8 at $1,344.44 on Monday. U.S. gold futures were down 0.1 percent at $1,335.40 an ounce. The dollar index was up 0.3 percent at 90.684 , after dropping to its lowest since December, 2014 to 90.113 early in the session. \"Most of the move in gold has been dollar denominated ... We have seen very little change in ETF holdings. There is very little change in perception of gold in terms of safe haven demand,\" said Mark Keenan, global commodities strategist and head of research - Asia-Pacific at Societe Generale. \"The outlook for gold in our view is down due to the lack of physical demand in Asia and the outlook for rate hikes this year is a headwind for gold.\" The U.S. Federal Reserve is widely expected to raise interest rates multiple times this year, although at a gradual pace. Gold is highly sensitive to rising U.S. interest rates, as these increase the opportunity cost of holding non-yielding bullion, while boosting the dollar, in which it is priced. Asian stocks stepped back from a record high on Wednesday as the region's resource shares were hit by falling oil and commodity prices while digital currencies tumbled on worries about tighter regulations. \"While the U.S. dollar remains the most prominent driver of momentum, we cannot overlook the meltdown in Bitcoin on the back of regulatory oversight adding to the gold risk premium,\" said Stephen Innes, APAC head of trading at OANDA. Bitcoin extended its sharp tumble of the past 24 hours, skidding more than 7 percent on Wednesday in a rapid downturn in fortunes as investors were spooked by fears regulators might clamp down on an asset whose value has skyrocketed in the past year. Spot gold targets its Sept. 8, 2017 high of $1,357.54 per ounce, as suggested by its wave pattern and a retracement analysis, according to Reuters technical analyst Wang Tao. Among other precious metals, spot palladium was up 0.6 percent at $1,100 per ounce. The metal, which hit a record high of $1,138 an ounce on Monday, fell nearly 3 percent on Tuesday. Palladium has had a sustained rally as high demand in the auto industry fuelled supply concerns, sending Nymex palladium futures net long positions to record highs. Spot silver fell 0.3 percent to $17.15 per ounce. Spot platinum was mostly unchanged at $998, after touching its highest since Sept.8 at $1,006.60 (Reporting by Nallur Sethuraman in Bengaluru; editing by Biju Dwarakanath and Subhranshu Sahu)", "external_links": [], "published": "2018-01-17T16:03:00.000+02:00", "crawled": "2018-01-17T17:37:11.023+02:00", "highlightTitle": ""}