{"organizations": [], "uuid": "5add9269241e4a9cbb43d099003335a30b9c9f8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/business-wire-apollo-commercial-real-estate-finance-inc-announces-2017-dividend-income-tax-treatment.html", "country": "US", "domain_rank": 767, "title": "Apollo Commercial Real Estate Finance, Inc. 2017 Dividend Income Tax Treatment", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.98, "site_type": "news", "published": "2018-01-26T16:30:00.000+02:00", "replies_count": 0, "uuid": "5add9269241e4a9cbb43d099003335a30b9c9f8f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/business-wire-apollo-commercial-real-estate-finance-inc-announces-2017-dividend-income-tax-treatment.html", "ord_in_thread": 0, "title": "Apollo Commercial Real Estate Finance, Inc. 2017 Dividend Income Tax Treatment", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "apollo commercial real estate finance, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Apollo Commercial Real Estate Finance, Inc. (the “Company” or “ARI”) (NYSE:ARI) today announced the estimated federal income tax treatment of the Company’s 2017 distributions on its common stock (CUSIP #03762U105) and on its 8.625% Series A Cumulative Redeemable Perpetual Preferred Stock (CUSIP #03762U402), 8.00% Fixed-to-Floating Series B Cumulative Redeemable Perpetual Preferred Stock and 8.00% Series C Cumulative Redeemable Perpetual Preferred Stock (CUSIP #03763V201).\nThe federal income tax classification of the 2017 distributions on the Company’s common stock as it is expected to be reported on Form 1099-DIV is set forth in the following table:\nRecord\nDate\nPayable\nDate\nTotal\nDistribution\nPer Share\nOrdinary Income\nPer Share\nReturn of\nCapital Per\nShare\nCapital Gain\nPer Share\n12/30/2016 01/17/2017 $0.46 $0.3866 - - 03/31/2017 04/17/2017 $0.46 $0.46 - - 06/30/2017 07/17/2017 $0.46 $0.46 - - 09/29/2017 10/16/2017 $0.46 $0.46 - - 12/29/2017 (1) 01/16/2018 $0.46 $0.0389 - - (1) Pursuant to Section 857(b)(9) of the Internal Revenue Code of 1986, as amended, cash distributions made on January 16, 2018 to stockholders of record as of December 29, 2017, are treated, to the extent of the Company’s 2017 tax earnings and profits, as received by stockholders on December 29, 2017. Since the Company’s aggregate cash distributions exceeded its 2017 tax earnings and profits, a portion of the January 2018 cash distribution declared in the fourth quarter of 2017 will be treated as a 2018 distribution for federal income tax purposes and will not be included on the 2017 Form 1099-DIV.\nThe federal income tax classification of the 2017 distributions on the Company’s 8.625% Series A Cumulative Redeemable Perpetual Preferred stock as it is expected to be reported on Form 1099-DIV is set forth in the following table:\nRecord\nDate\nPayable\nDate\nTotal\nDistribution\nPer Share\nOrdinary Income\nPer Share\nReturn of\nCapital Per\nShare\nCapital Gain\nPer Share\n03/31/2017 04/17/2017 $0.5391 $0.5391 - - 06/30/2017 07/17/2017 $0.5391 $0.5391 - - 08/02/2017 08/02/2017 $0.1079 $0.1079 - - The federal income tax classification of the 2017 distributions on the Company’s 8.00% Fixed-to-Floating Series B Cumulative Redeemable Perpetual Preferred stock as it is expected to be reported on Form 1099-DIV is set forth in the following table:\nRecord\nDate\nPayable\nDate\nTotal\nDistribution\nPer Share\nOrdinary Income\nPer Share\nReturn of\nCapital Per\nShare\nCapital Gain\nPer Share\n03/31/2017 04/17/2017 $0.50 $0.50 - - 06/30/2017 07/17/2017 $0.50 $0.50 - - 09/29/2017 10/16/2017 $0.50 $0.50 - - 12/29/2017 01/16/2018 $0.50 $0.50 - - The federal income tax classification of the 2017 distributions on the Company’s 8.00% Series C Cumulative Redeemable Perpetual Preferred stock as it is expected to be reported on Form 1099-DIV is set forth in the following table:\nRecord\nDate\nPayable\nDate\nTotal\nDistribution\nPer Share\nOrdinary Income\nPer Share\nReturn of\nCapital\nPer Share\nCapital Gain\nPer Share\n03/31/2017 04/28/2017 $0.50 $0.50 - - 06/30/2017 07/31/2017 $0.50 $0.50 - - 09/29/2017 10/31/2017 $0.50 $0.50 - - 12/29/2017 01/31/2018 $0.50 $0.50 - - Stockholders are encouraged to consult with their own tax advisors as to their specific tax treatment of the Company's distributions.\nAbout Apollo Commercial Real Estate Finance, Inc.\nApollo Commercial Real Estate Finance, Inc. (NYSE: ARI) is a real estate investment trust that primarily originates, invests in, acquires and manages performing commercial real estate first mortgage loans, subordinate financings, and other commercial real estate-related debt investments. The Company is externally managed and advised by ACREFI Management, LLC, a Delaware limited liability company and an indirect subsidiary of Apollo Global Management, LLC, a leading global alternative investment manager with approximately $242 billion of assets under management as of September 30, 2017.\nAdditional information can be found on the Company's website at www.apolloreit.com .\nForward-Looking Statements\nCertain statements contained in this press release constitute forward-looking statements as such term is defined in Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, and such statements are intended to be covered by the safe harbor provided by the same. Forward-looking statements are subject to substantial risks and uncertainties, many of which are difficult to predict and are generally beyond the Company's control. These forward-looking statements include information about possible or assumed future results of the Company's business, financial condition, liquidity, results of operations, plans and objectives. When used in this release, the words \"believe,\" \"expect,\" \"anticipate,\" \"estimate,\" \"plan,\" \"continue,\" \"intend,\" \"should,\" \"may\" or similar expressions are intended to identify forward-looking statements. Statements regarding the following subjects, among others, may be forward-looking: the return on equity; the yield on investments; the ability to borrow to finance assets; and risks associated with investing in real estate assets, including changes in business conditions and the general economy. For a further list and description of such risks and uncertainties, see the reports filed by the Company with the Securities and Exchange Commission. The forward-looking statements, and other risks, uncertainties and factors are based on the Company's beliefs, assumptions and expectations of its future performance, taking into account all information currently available to the Company. Forward-looking statements are not predictions of future events. The Company disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180126005047/en/\nApollo Commercial Real Estate Finance, Inc.\nHilary Ginsberg, 212-822-0767\nInvestor Relations\nSource: Apollo Commercial Real Estate Finance, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.apolloreit.com&esheet=51749187&newsitemid=20180126005047&lan=en-US&anchor=www.apolloreit.com&index=1&md5=138de9d65728751a00828ca8405d8596", "http://www.businesswire.com/news/home/20180126005047/en/"], "published": "2018-01-26T16:30:00.000+02:00", "crawled": "2018-01-26T18:12:08.007+02:00", "highlightTitle": ""}