{"organizations": [], "uuid": "fab2c0aab4324bf16a61a784481f9cd1227817f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224092442&w=1200&r=LYNXMPEE0L0KX", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-philippines-economy-gdp-poll/philippines-economy-seen-ending-2017-on-high-note-as-fourth-quarter-growth-picks-up-reuters-poll-idUSKBN1FB0P0", "country": "US", "domain_rank": 408, "title": "Philippines economy seen ending 2017 on high note as fourth-quarter growth picks up: Reuters poll", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T16:46:00.000+02:00", "replies_count": 0, "uuid": "fab2c0aab4324bf16a61a784481f9cd1227817f9"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-philippines-economy-gdp-poll/philippines-economy-seen-ending-2017-on-high-note-as-fourth-quarter-growth-picks-up-reuters-poll-idUSKBN1FB0P0", "ord_in_thread": 0, "title": "Philippines economy seen ending 2017 on high note as fourth-quarter growth picks up: Reuters poll", "locations": [], "entities": {"persons": [{"name": "joey cuyegkeng", "sentiment": "none"}], "locations": [{"name": "philippines", "sentiment": "none"}, {"name": "manila", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ing", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MANILA (Reuters) - The Philippines’ economy was expected to have ended 2017 on a solid footing with growth in the last quarter gathering momentum from strong domestic demand, robust government spending, and a rebound in farm output.\nFourth-quarter data due on Tuesday is expected to show the Southeast Asian economy expanded 1.8 percent in October-December from the previous quarter, a Reuters poll found. It expanded 1.3 percent in the third quarter.\nCompared with a year earlier, growth was forecast at 6.7 percent, slower than the third quarter’s upwardly revised 7.0 percent, but still enviable by global standards.\nING economist Joey Cuyegkeng said a recovery in agriculture, strong government stimulus and an intensified infrastructure push had combined with upbeat business spending and resilient household consumption to produce vigorous growth.\nFarm output, which accounts for about a tenth of the Philippines’ gross domestic product, grew 4 percent in 2017, reversing the previous year’s 1.4 percent decline and boosting economic growth.\nThe Philippines has one of Asia’s fastest-growing economies and analysts expect the economy to sustain its brisk expansion this year, backed by higher infrastructure spending. Though that scenario could steer the central bank to raise interest rates, they note.\nPolicy settings have remained unchanged since the central bank raised interest rates by 25 basis points in September 2014.\nManila posted its biggest-ever trade deficit in November as imports of capital goods surged. While the deficit pointed to strong economic activity, the widening trade gap has added to worries the current account deficit could persist in 2018 and continue to pressure the peso.\n“The fact that the rise in imports is being driven by a surge in imports of capital goods, which is linked to the government’s infrastructure drive, rather than an unsustainable consumer boom, is encouraging,” Capital Economics said in a research note.\nSome economists have called for tighter monetary policy, warning that the economy runs the risk of overheating from double-digit credit growth, a rapid increase in investment, and the stellar pace of economic expansion.\nBut central bank governor Nestor Espenilla has downplayed those concerns, noting inflation was on track to meet the government’s 2-4 percent target this year and next.\nCapital Economics shares that view. “We think concerns that the Philippines is overheating are exaggerated. As a result, the risk that the central bank will suddenly need to put its foot on the brake and raise interest rates aggressively in order to clamp down on inflation is small,” it said.\nThe Philippines had a 6.5-7.5 percent growth target in 2017 year and aims at 7.0-8.0 percent this year.\nReporting by Karen Lema and Enrico dela Cruz; Editing by Eric Meijer\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T16:46:00.000+02:00", "crawled": "2018-01-23T18:11:26.013+02:00", "highlightTitle": ""}