{"organizations": [], "uuid": "c30a442a42ed2892f004270da7cd5ae47a906f33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-watchguard-technologies-acquires-percipient-networks-and-adds-security-at-the-dns-layer-to-companys-smb-security-platform.html", "country": "US", "domain_rank": 767, "title": "WatchGuard Technologies Acquires Percipient Networks and Adds Security at the DNS Layer to Company's SMB Security Platform", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T08:01:00.000+02:00", "replies_count": 0, "uuid": "c30a442a42ed2892f004270da7cd5ae47a906f33"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-watchguard-technologies-acquires-percipient-networks-and-adds-security-at-the-dns-layer-to-companys-smb-security-platform.html", "ord_in_thread": 0, "title": "WatchGuard Technologies Acquires Percipient Networks and Adds Security at the DNS Layer to Company's SMB Security Platform", "locations": [], "entities": {"persons": [], "locations": [{"name": "seattle", "sentiment": "none"}], "organizations": [{"name": "dns layer to company", "sentiment": "negative"}, {"name": "percipient networks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEATTLE, Jan. 17, 2018 /PRNewswire/ -- WatchGuard® Technologies , a leader in advanced network security solutions, today announced that it has acquired Percipient Networks, a developer of simple, affordable, automated security solutions for small and midsize organizations. Percipient Networks' flagship product, Strongarm, stops phishing and malware attacks by offering an easy-to-deploy, security-focused Domain Name System (DNS) service. Integrated into WatchGuard's security platform, Strongarm will further improve the security efficacy of existing malware protection techniques, increase the value of the company's popular Total Security Suite (TSS) advanced services bundle, and become a key element in the evolution of WatchGuard's cloud security offering.\nIn 2016, 76 percent of organizations reported falling victim to phishing 1 . Company size and vertical industry played no role in likelihood of an attack, making it critical for companies to have protections in place against phishing, happy clickers, and other web-based threats. The Strongarm service monitors outbound DNS requests and blocks traffic to websites based on a list of known malicious domains. Furthermore, by monitoring requests at the domain level, Strongarm's filtering capabilities extend to all ports and protocols. Integrating Strongarm into WatchGuard's comprehensive unified security platform, will provide customers with the strongest possible protection from the widest variety of threats.\n\"In a world of increasing and constantly changing security threats, there is no silver bullet when it comes to protection. Many organizations don't have the resources to research and deploy a long list of security point-solutions. As such, it is WatchGuard's mission to continually evolve our unified security platform to provide the best combination of security services in a simple package, making enterprise-grade security accessible to all. The addition of security at the DNS layer is just another example of execution of our mission,\" said Prakash Panjwani, CEO of WatchGuard. \"Based on years of research and development, the Percipient Networks team has developed a simple, enterprise-grade solution. We are excited to add the Strongarm solution to our platform and to welcome the teams behind developing and launching it to WatchGuard's ecosystem of rapidly growing partners, customers, and employees.\"\nIn addition to blocking traffic to dangerous sites, the Strongarm platform was architected to facilitate maximum user and IT admin education. Rather than just blocking traffic to potentially malicious sites, the service redirects users to a 'blackhole' where additional information about the attack is collected, and the user is presented with educational materials aimed at preventing future attacks. Percipient Networks also employs a threat analysis team who engages with the IT managers and managed service providers (MSPs) to provide additional insights into attacks and how to prevent them in the future. WatchGuard will continue investment in both areas.\n\"Phishing is one of the most common methods used to gain a first point of entry into an organization. It is one of the most effective tactics because it targets people. As such, organizations must employ a two-pronged approach to combat phishing – malware prevention services and employee education,\" said Todd O'Boyle, co-founder and CTO at Percipient Networks. \"By protecting users and using blocked attacks as an opportunity to educate we significantly reduce the odds of that employee making the same mistake a second time. We are delighted to continue development of the product and our threat research team under WatchGuard's leadership.\"\nWatchGuard partners and customers will be able to gain early access to the new DNS filtering service later this month when the product is released into Beta. The new service will be generally available as part of the company's all-in-one security package, Total Security Suite, shortly thereafter in an upcoming release of Fireware. All active Total Security Suite customers will gain immediate access to the new feature at no additional charge with the simple check of a box.\n\"We are extremely proud of what we have built with the Strongarm platform and this partnership with WatchGuard will put our award-winning technology and education tools into the hands of tens of thousands of organizations around the world almost immediately via WatchGuard's extensive VAR and MSP community,\" continued O'Boyle. \"We are also excited to extend WatchGuard's approach to total security to our customer base, expanding their protection to cover more threats, and to our partner community, who will gain immediate access to the award-winning WatchGuardONE program and full product portfolio.\"\nAbout WatchGuard Technologies, Inc.\nWatchGuard® Technologies, Inc. is a global leader in network security, providing best-in-class Unified Threat Management, Next Generation Firewall, secure Wi-Fi, and network intelligence products and services to more than 80,000 customers worldwide. The company's mission is to make enterprise-grade security accessible to companies of all types and sizes through simplicity, making WatchGuard an ideal solution for Distributed Enterprises and SMBs. WatchGuard is headquartered in Seattle, Washington, with offices throughout North America, Europe, Asia Pacific, and Latin America. To learn more, visit WatchGuard.com .\nFor additional information, promotions and updates, follow WatchGuard on Twitter, @WatchGuard on Facebook , or on the LinkedIn Company page. Also, visit our InfoSec blog, Secplicity, for real-time information about the latest threats and how to cope with them at www.secplicity.org .\nMedia Contacts:\nChris Warfield\nWatchGuard Technologies\n206.876.8380\nchris.warfield@watchguard.com\nAnthony Cogswell\nVoxus PR\n253.444.5980\nacogswell@voxuspr.com\n1 State of the Phish 2017 - https://www.wombatsecurity.com/state-of-the-phish\nView original content with multimedia: http://www.prnewswire.com/news-releases/watchguard-technologies-acquires-percipient-networks-and-adds-security-at-the-dns-layer-to-companys-smb-security-platform-300583673.html\nSOURCE WatchGuard Technologies, Inc.", "external_links": ["http://www.linkedin.com/company/watchguard-technologies", "https://www.facebook.com/watchguardtechnologies", "http://www.secplicity.org/", "https://www.wombatsecurity.com/state-of-the-phish", "https://twitter.com/watchguard", "http://www.watchguard.com/", "http://www.prnewswire.com/news-releases/watchguard-technologies-acquires-percipient-networks-and-adds-security-at-the-dns-layer-to-companys-smb-security-platform-300583673.html"], "published": "2018-01-17T08:01:00.000+02:00", "crawled": "2018-01-17T08:38:00.045+02:00", "highlightTitle": ""}