{"organizations": [], "uuid": "3fd760675defadaf46266619ad2967838ae64e50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-brinker-international-reports-second-quarter-results.html", "country": "US", "domain_rank": 767, "title": "Brinker International Reports Second Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.02, "site_type": "news", "published": "2018-01-30T14:45:00.000+02:00", "replies_count": 0, "uuid": "3fd760675defadaf46266619ad2967838ae64e50"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-brinker-international-reports-second-quarter-results.html", "ord_in_thread": 0, "title": "Brinker International Reports Second Quarter Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "brinker international, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 30, 2018 /PRNewswire/ -- Brinker International, Inc. (NYSE: EAT) today announced results for the fiscal second quarter ended Dec. 27, 2017.\nHighlights include the following:\nOn a GAAP basis, earnings per diluted share were $0.54 for the second quarter of fiscal 2018 representing a 21.7 percent decrease from $0.69 in the second quarter of fiscal 2017 Earnings per diluted share, excluding special items, were $0.87 for the second quarter of fiscal 2018 representing a 22.5 percent increase from $0.71 in the second quarter of fiscal 2017 (see non-GAAP reconciliation below) The Tax Cuts and Jobs Act of 2017 (the \"Tax Act\") negatively impacted GAAP net income by $3.9 million or $0.08 per diluted share, consisting of $8.7 million or $0.18 per diluted share for the revaluation of the Company's net deferred tax assets, partially offset by the impact from the decrease in the statutory tax rate of $4.8 million or $0.10 per diluted share for the second quarter of 2017 Brinker International's total revenues were $766.4 million in the second quarter of fiscal 2018 decreasing 0.6 percent compared to the second quarter of fiscal 2017, and company sales were $742.7 million in the second quarter of fiscal 2018 decreasing 0.8 percent compared to the second quarter of fiscal 2017 Chili's company-owned comparable restaurant sales decreased 1.5 percent in the second quarter of fiscal 2018 compared to the second quarter of fiscal 2017. Chili's U.S. franchise comparable restaurant sales decreased 1.7 percent in the second quarter of fiscal 2018 compared to the second quarter of fiscal 2017 Chili's international franchise comparable restaurant sales increased 0.1 percent in the second quarter of fiscal 2018 compared to the second quarter of fiscal 2017 Maggiano's comparable restaurant sales increased 1.8 percent in the second quarter of fiscal 2018 compared to the second quarter of fiscal 2017 Operating income, as a percent of total revenues, was 7.1 percent for the second quarter of fiscal 2018 compared to 8.0 percent for the second quarter of fiscal 2017 representing a decrease of approximately 90 basis points Restaurant operating margin, as a percent of company sales, was 14.9 percent for the second quarter of fiscal 2018 compared to 15.1 percent for the second quarter of fiscal 2017 representing a decrease of approximately 20 basis points (see non-GAAP reconciliation below) For the first six months of fiscal 2018, cash flows provided by operating activities were $119.7 million and capital expenditures totaled $48.6 million. Free cash flow was $71.1 million (see non-GAAP reconciliation below) The Company is updating its fiscal 2018 outlook and now estimates earnings per diluted share, excluding special items and the revaluation of the Company's deferred tax accounts, to be in the range of $3.42 to $3.52 for fiscal 2018\n\"Brinker saw performance improve across the business during the second quarter, especially related to our initiatives to change traffic trends at Chili's,\" said Wyman Roberts, chief executive officer and president. \"With this foundational strategy in place, we will focus on targeted segments of the business we believe will enhance the guest experience and drive traffic.\"\nTable 1: Q2 comparable restaurant sales 1\nCompany-owned, reported brands and franchise; percentage\nQ2 18\nQ2 17\nBrinker International\n(1.0)\n(2.9)\nChili's Company-Owned\nComparable Restaurant Sales\n(1.5)\n(3.3)\nPricing Impact\n2.3\n1.8\nMix-Shift 2\n0.6\n1.4\nTraffic\n(4.4)\n(6.5)\nMaggiano's\nComparable Restaurant Sales\n1.8\n(0.8)\nPricing Impact\n1.1\n2.6\nMix-Shift 2\n1.1\n(0.9)\nTraffic\n(0.4)\n(2.5)\nChili's Franchise 3\n(1.0)\n(3.5)\nU.S. Comparable Restaurant Sales\n(1.7)\n(3.0)\nInternational Comparable Restaurant Sales\n0.1\n(4.2)\nChili's Domestic 4\n(1.6)\n(3.2)\nSystem-wide 5\n(1.0)\n(3.1)\n1\nComparable restaurant sales includes all restaurants that have been in operation for more than 18 months.\n2\nMix-shift is calculated as the year-over-year percentage change in company sales resulting from the change in menu items ordered by guests.\n3\nRevenues generated by franchisees are not included in revenues on the consolidated statements of comprehensive income; however, we generate royalty revenue and advertising fees based on franchisee revenues, where applicable. We believe including franchise comparable restaurant sales provides investors information regarding brand performance that is relevant to current operations and may impact future restaurant development.\n4\nChili's Domestic comparable restaurant sales percentages are derived from sales generated by company-owned and franchise-operated Chili's restaurants in the United States.\n5\nSystem-wide comparable restaurant sales are derived from sales generated by company-owned Chili's and Maggiano's restaurants in addition to the sales generated at franchise-operated Chili's restaurants.\nQuarterly Operating Performance\nCHILI'S second quarter company sales decreased 1.3 percent to $623.6 million from $632.1 million in the prior year primarily due to a decline in comparable restaurant sales. As compared to the prior year, Chili's restaurant operating margin 1 declined. Restaurant labor, as a percent of company sales, increased compared to the prior year due to higher wage rates, partially offset by lower employee health insurance costs and incentive bonuses. Cost of sales, as a percent of company sales, increased slightly compared to the prior year due to unfavorable product mix on beef, ribs and chicken and unfavorable commodity pricing on produce, partially offset by increased menu pricing and favorable commodity pricing on beef. Restaurant expenses, as a percent of company sales, decreased due to lower advertising and repairs and maintenance expenses, partially offset by sales deleverage.\nMAGGIANO'S second quarter company sales increased 2.1 percent to $119.1 million from $116.6 million in the prior year primarily due to an increase in comparable restaurant sales. As compared to the prior year, Maggiano's restaurant operating margin 1 improved. Restaurant expenses, as a percent of company sales, decreased primarily due to sales leverage and lower property taxes, preopening and workers' compensation insurance expenses. Restaurant labor, as a percent of company sales, decreased compared to the prior year due to sales leverage and lower incentive bonuses, partially offset by higher wage rates. Cost of sales, as a percent of company sales, was negatively impacted by unfavorable commodity pricing, partially offset by increased menu pricing.\n1 Restaurant operating margin is defined as Company sales less Cost of sales, Restaurant labor and Restaurant expenses and excludes Depreciation and amortization expenses. (See non-GAAP reconciliation below)\nFRANCHISE AND OTHER revenues increased 6.3 percent to $23.7 million for the second quarter of fiscal 2018 compared to $22.3 million in the prior year second quarter primarily due to higher gift card-related revenues. Brinker franchisees generated approximately $324 million in sales 2 for the second quarter of fiscal 2018.\n2 Royalty revenues are recognized based on the sales generated and reported to the Company by franchisees.\nOther\nDepreciation and amortization expense decreased $1.7 million for the current quarter compared to the second quarter of fiscal 2017 primarily due to an increase in fully-depreciated assets and restaurant closures, partially offset by depreciation on asset replacements and new restaurant openings.\nGeneral and administrative expense decreased $0.5 million for the current quarter compared to the second quarter of fiscal 2017 primarily due to lower compensation-related expenses.\nIncome Taxes\nThe Tax Act was enacted on December 22, 2017 with an effective date of January 1, 2018. The enactment date occurred prior to the end of the second quarter of fiscal 2018 and therefore the federal statutory tax rate changes stipulated by the Tax Act were reflected in the current quarter. The Tax Act lowered the federal statutory tax rate from 35 percent to 21 percent effective January 1, 2018. Brinker's federal statutory tax rate for fiscal 2018 is now 28 percent, representing a blended tax rate for the current fiscal year based on the number of days in the fiscal year before and after the effective date. For subsequent years, our federal statutory tax rate will be 21%. We were also required to revalue our deferred tax accounts using the new federal statutory tax rate in the period in which the Tax Act was enacted. The Company's deferred tax position is a net asset and as a result, the reduction in the federal statutory tax rate resulted in a one-time non-cash adjustment to our net deferred tax balance of $8.7 million with a corresponding increase to the provision for income taxes in the second quarter of fiscal 2018.\nOn a GAAP basis, the effective income tax rate increased to 38.3 percent in the second quarter of fiscal 2018 from 28.2 percent in the second quarter of fiscal 2017. This increase was driven by the revaluation of the Company's deferred tax accounts pursuant to the Tax Act, partially offset by the positive impact of lowering the federal statutory tax rate and lower profits. Excluding the impact of special items and the revaluation of the Company's deferred tax accounts, the effective income tax rate decreased to 19.5 percent in the second quarter of fiscal 2018 compared to 28.1 percent in the second quarter of fiscal 2017 primarily due to the lower corporate tax rate and lower profits.\nFiscal 2018 Outlook Update\nThe Tax Act will have a material impact on the Company's effective tax rate for fiscal 2018. The Company estimates adjusted earnings per diluted share, excluding special items and the revaluation of the Company's deferred tax accounts, for fiscal 2018 will be in the range of $3.42 to $3.52 including the effective rate impact of the Tax Act. Previously, the Company expected the effective income tax rate excluding the impact of special items to be approximately 27 to 29 percent for fiscal 2018. The Company's effective tax rate excluding the impact of special items and the revaluation of the deferred tax accounts is now expected to be approximately 20 to 22 percent. The Company believes providing estimated fiscal 2018 earnings per diluted share guidance provides investors the appropriate insight into the Company's ongoing operating performance.\nGuidance Policy\nBrinker provides annual guidance as it relates to comparable restaurant sales, earnings per diluted share, excluding special items, and other key line items in the statements of comprehensive income and will only provide updates if there is a material change versus the original guidance. We are unable to reliably forecast special items such as restaurant impairments, restaurant closures, reorganization charges and legal settlements without unreasonable effort. As such, we do not present a reconciliation of forecasted non-GAAP measures to the corresponding GAAP measures. If special items are reported in the remainder of fiscal 2018, reconciliations to the appropriate GAAP measures will be provided.\nNon-GAAP Measures\nBrinker management uses certain non-GAAP measures in analyzing operating performance and believes that the presentation of these measures in this release provides investors with information that is beneficial to gaining an understanding of the Company's financial results. Non-GAAP disclosures should not be viewed as a substitute for financial results determined in accordance with GAAP, nor are they necessarily comparable to non-GAAP performance measures that may be presented by other companies. Reconciliations of these non-GAAP measures are included in the tables below.\nTable 2: Reconciliation of net income excluding special items\nQ2 18 and Q2 17; $ millions and $ per diluted share\nBrinker believes excluding special items from its financial results provides investors with a clearer perspective of the Company's ongoing operating performance and a more relevant comparison to prior period results.\nQ2 18\nEPS Q2 18\nQ2 17\nEPS Q2 17\nNet Income\n$\n25.4\n$\n0.54\n$\n34.6\n$\n0.69\nSpecial items 1\n9.3\n0.20\n1.3\n0.03\nIncome tax effect related to special items 2\n(2.4)\n(0.05)\n(0.3)\n(0.01)\nSpecial items, net of taxes\n6.9\n0.15\n1.0\n0.02\nAdjustment for tax items 3\n8.3\n0.18\n—\n—\nNet Income excluding special items\n$\n40.6\n$\n0.87\n$\n35.6\n$\n0.71\n1\nSee footnote \"b\" to the consolidated statements of comprehensive income for additional details on the composition of these amounts.\n2\nThe income tax effect related to special items is based on the statutory tax rate in effect at the end of each quarter presented. The tax rate used for Q2 fiscal 2018 is based on the tax rate stipulated by the Tax Act enacted on December 22, 2017.\n3\nAmounts represent the revaluation of our net deferred taxes using the new lower corporate tax rate pursuant to the Tax Act. Additionally, this amount includes $0.4 million of tax benefits from the settlement of stock-based compensation awards in the provision for income taxes.\nTable 3: Reconciliation of restaurant operating margin\nQ2 18 and Q2 17; $ millions\nRestaurant operating margin is not a measurement determined in accordance with GAAP and should not be considered in isolation, or as an alternative to operating income as an indicator of financial performance. Restaurant operating margin is widely regarded in the restaurant industry as a useful metric by which to evaluate restaurant-level operating efficiency and performance of ongoing restaurant-level operations. We define restaurant operating margin as Company sales less Company restaurant expenses, including Cost of sales, Restaurant labor and Restaurant expenses. Restaurant expenses includes advertising expense. We believe this metric provides a more useful comparison between periods and enables investors to focus on the performance of restaurant-level operations by excluding revenues not related to food and beverage sales at company-owned restaurants, corporate General and administrative expense, Depreciation and amortization, and Other gains and charges.\nRestaurant operating margin excludes Franchise and other revenues which are earned primarily from franchise royalties and other non-food and beverage revenue streams such as banquet service charges, digital entertainment revenues and gift card breakage. Depreciation and amortization expense, substantially all of which is related to restaurant-level assets, is excluded because such expenses represent historical costs which do not reflect current cash outlays for the restaurants. General and administrative expense includes primarily non-restaurant-level costs associated with support of the restaurants and other activities at our corporate offices and is therefore excluded. We believe that excluding special items, included within Other gains and charges, from restaurant operating margin provides investors with a clearer perspective of the Company's ongoing operating performance and a more useful comparison to prior period results. Restaurant operating margin as presented may not be comparable to other similarly titled measures of other companies in our industry.\nQ2 18\nQ2 17\nOperating income - GAAP\n$\n54.4\n$\n61.5\nOperating income as a percent of total revenues\n7.1\n%\n8.0\n%\nOperating income\n54.4\n61.5\nLess: Franchise and other revenues\n(23.7)\n(22.3)\nPlus: Depreciation and amortization\n37.7\n39.3\nGeneral and administrative\n33.1\n33.5\nOther gains and charges\n9.3\n1.3\nRestaurant operating margin - non-GAAP\n$\n110.8\n$\n113.3\nRestaurant operating margin as a percent of company sales\n14.9\n%\n15.1\n%\nTable 4: Reconciliation of free cash flow\nQ2 18; $ millions\nBrinker believes presenting free cash flow provides a useful measure to evaluate the cash flow available for reinvestment after considering the capital requirements of our business operations.\nTwenty-six Week Period\nEnded Dec. 27, 2017\nCash flows provided by operating activities - GAAP\n$\n119.7\nCapital expenditures\n(48.6)\nFree cash flow - non-GAAP\n$\n71.1\nWebcast Information\nInvestors and interested parties are invited to listen to today's conference call, as management will provide further details of the quarter. The call will broadcast live on Brinker's website at 9 a.m. CST today (Jan. 30) -\nhttp://investors.brinker.com/phoenix.zhtml?c=119205&p=irol-EventDetails&EventId=5266817\nFor those who are unable to listen to the live broadcast, a replay of the call will be available shortly thereafter and will remain on Brinker's website until the end of the day Feb. 27, 2018.\nAdditional financial information, including statements of income which detail operations excluding special items, franchise and other revenues, and comparable restaurant sales trends by brand, is also available on Brinker's website under the Financial Information section of the Investor tab.\nForward Calendar\n- SEC Form 10-Q for the second quarter of fiscal 2018 filing on or before Feb. 5, 2018; and\n- Third quarter earnings release, before market opens, May 1, 2018.\nAbout Brinker\nBrinker International, Inc. is one of the world's leading casual dining restaurant companies. Founded in 1975 and based in Dallas, Texas, as of December 27, 2017, Brinker owned, operated, or franchised 1,682 restaurants under the names Chili's ® Grill & Bar (1,630 restaurants) and Maggiano's Little Italy ® (52 restaurants).\nForward-Looking Statements\nThe statements contained in this release that are not historical facts are within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements are based on our current plans and expectations and involve risks and uncertainties which could our historical results or from those projected in . These risks and uncertainties are, in many instances, beyond our control. Such risks and uncertainties include, among other things, general business and economic conditions, financial and credit market conditions, litigation, reduced disposable income, the impact of competition, the impact of mergers, acquisitions, divestitures and other strategic transactions, franchisee success, the seasonality of the company's business, increased minimum wages, increased health care costs, adverse weather conditions, loss of key management personnel, product availability, actions of activist shareholders, terrorist acts, consumer perception of food safety, changes in consumer taste, health epidemics or pandemics, changes in demographic trends, availability of employees, unfavorable publicity, the company's ability to meet its business strategy plan, material weaknesses in internal control over financial reporting, governmental regulations, tax reform, inflation, technology failures, and failure to protect the security of data of our guests and teammates, as well as the risks described under the caption \"Risk Factors\" in our Annual Report on Form 10-K and future filings with the Securities and Exchange Commission.\nBRINKER INTERNATIONAL, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(In thousands, except per share amounts)\n(Unaudited)\nThirteen Week Periods Ended\nTwenty-Six Week Periods Ended\nDec. 27, 2017\nDec. 28, 2016\nDec. 27, 2017\nDec. 28, 2016\nRevenues:\nCompany sales\n$\n742,688\n$\n748,709\n$\n1,459,630\n$\n1,486,119\nFranchise and other revenues (a)\n23,712\n22,334\n46,160\n43,416\nTotal revenues\n766,400\n771,043\n1,505,790\n1,529,535\nOperating costs and expenses:\nCompany restaurants (excluding depreciation and amortization)\nCost of sales\n192,883\n193,537\n380,480\n385,839\nRestaurant labor\n250,416\n248,692\n501,491\n499,262\nRestaurant expenses\n188,649\n193,131\n376,778\n389,774\nCompany restaurant expenses\n631,948\n635,360\n1,258,749\n1,274,875\nDepreciation and amortization\n37,655\n39,305\n76,175\n78,191\nGeneral and administrative\n33,088\n33,546\n65,446\n66,083\nOther gains and charges (b)\n9,261\n1,306\n22,415\n7,384\nTotal operating costs and expenses\n711,952\n709,517\n1,422,785\n1,426,533\nOperating income\n54,448\n61,526\n83,005\n103,002\nInterest expense\n14,321\n13,641\n28,205\n22,450\nOther, net\n(1,015)\n(383)\n(1,491)\n(682)\nIncome before provision for income taxes\n41,142\n48,268\n56,291\n81,234\nProvision for income taxes\n15,776\n13,631\n21,048\n23,364\nNet income\n$\n25,366\n$\n34,637\n$\n35,243\n$\n57,870\nBasic net income per share\n$\n0.55\n$\n0.70\n$\n0.74\n$\n1.11\nDiluted net income per share\n$\n0.54\n$\n0.69\n$\n0.74\n$\n1.09\nBasic weighted average shares outstanding\n46,432\n49,833\n47,362\n52,339\nDiluted weighted average shares outstanding\n46,880\n50,480\n47,806\n53,028\nOther comprehensive income (loss):\nForeign currency translation adjustment (c)\n$\n(198)\n$\n(1,664)\n$\n820\n$\n(2,145)\nOther comprehensive income (loss)\n(198)\n(1,664)\n820\n(2,145)\nComprehensive income\n$\n25,168\n$\n32,973\n$\n36,063\n$\n55,725\n(a)\nFranchise and other revenues primarily includes royalties, development fees, franchise fees, Maggiano's banquet service charge income, gift card breakage and discounts, digital entertainment revenue, Chili's retail food product royalties and delivery fee income.\n(b)\nOther gains and charges include:\nThirteen Week Periods Ended\nTwenty-Six Week Periods Ended\nDec. 27, 2017\nDec. 28, 2016\nDec. 27, 2017\nDec. 28, 2016\nRestaurant closure charges\n$\n4,306\n$\n321\n$\n4,544\n$\n2,827\nRestaurant impairment charges\n1,974\n1,851\n9,133\n1,851\nLease guarantee charges\n1,433\n—\n1,433\n—\nForeign currency transaction loss\n882\n—\n882\n—\nHurricane-related costs\n572\n—\n5,220\n—\nAccelerated depreciation\n483\n—\n966\n—\nGain on the sale of assets, net\n(348)\n(2,569)\n(303)\n(2,569)\nInformation technology restructuring\n—\n209\n—\n2,700\nSeverance\n—\n—\n—\n293\nOther\n(41)\n1,494\n540\n2,282\n$\n9,261\n$\n1,306\n$\n22,415\n$\n7,384\n(c)\nThe foreign currency translation adjustment included in comprehensive income on the consolidated statements of comprehensive income represents the unrealized impact of translating the financial statements of the Canadian restaurants and the Mexican joint venture (prior to divestiture) from their respective functional currencies to U.S. dollars. This amount is not included in net income and would only be realized upon disposition of the businesses.\nBRINKER INTERNATIONAL, INC.\nCONDENSED CONSOLIDATED BALANCE SHEETS\n(In thousands)\n(Unaudited)\nDec. 27, 2017\nJune 28, 2017\nASSETS\nCurrent assets\n$\n194,474\n$\n144,325\nNet property and equipment (a)\n958,084\n1,000,614\nTotal other assets\n247,987\n258,694\nTotal assets\n$\n1,400,545\n$\n1,403,633\nLIABILITIES AND SHAREHOLDERS' DEFICIT\nCurrent installments of long-term debt\n$\n8,265\n$\n9,649\nOther current liabilities\n443,611\n426,712\nLong-term debt, less current installments\n1,365,255\n1,319,829\nOther liabilities\n136,274\n141,124\nTotal shareholders' deficit\n(552,860)\n(493,681)\nTotal liabilities and shareholders' deficit\n$\n1,400,545\n$\n1,403,633\n(a)\nAt Dec. 27, 2017, the Company owned the land and buildings for 190 of the 997 company-owned restaurants. The net book values of the land totaled $143.2 million and the buildings totaled $91.7 million associated with these restaurants.\nBRINKER INTERNATIONAL, INC.\nCONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS\n(In thousands)\n(Unaudited)\nTwenty-Six Week Periods Ended\nDec. 27, 2017\nDec. 28, 2016\nCash Flows From Operating Activities:\nNet income\n$\n35,243\n$\n57,870\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization\n76,175\n78,191\nStock-based compensation\n6,287\n8,152\nRestructure charges and other impairments\n14,457\n8,000\nNet loss (gain) on disposal of assets\n1,294\n(811)\nChanges in assets and liabilities\n(13,747)\n(8,578)\nNet cash provided by operating activities\n119,709\n142,824\nCash Flows from Investing Activities:\nPayments for property and equipment\n(48,559)\n(60,055)\nProceeds from sale of assets\n325\n3,022\nInsurance recoveries\n1,000\n—\nProceeds from note receivable\n480\n—\nNet cash used in investing activities\n(46,754)\n(57,033)\nCash Flows from Financing Activities:\nBorrowings on revolving credit facility\n320,000\n100,000\nPayments on revolving credit facility\n(276,000)\n(138,000)\nPurchases of treasury stock\n(71,792)\n(349,994)\nPayments of dividends\n(35,445)\n(36,944)\nPayments on long-term debt\n(5,091)\n(1,862)\nProceeds from issuances of treasury stock\n1,042\n3,837\nProceeds from issuance of long-term debt\n—\n350,000\nPayments for debt issuance costs\n—\n(10,216)\nNet cash used in financing activities\n(67,286)\n(83,179)\nNet change in cash and cash equivalents\n5,669\n2,612\nCash and cash equivalents at beginning of period\n9,064\n31,446\nCash and cash equivalents at end of period\n$\n14,733\n$\n34,058\nBRINKER INTERNATIONAL, INC.\nRESTAURANT SUMMARY\nSecond Quarter\nOpenings\nFiscal 2018\nTotal Restaurants\nDec. 27, 2017\nProjected\nOpenings\nFiscal 2018\nCompany-owned restaurants:\nChili's domestic\n3\n940\n5-6\nChili's international\n—\n5\n—\nMaggiano's\n—\n52\n1\nTotal company-owned\n3\n997\n6-7\nFranchise restaurants:\nChili's domestic\n1\n316\n5-7\nChili's international\n9\n369\n38-43\nTotal franchise\n10\n685\n43-50\nTotal restaurants:\nChili's domestic\n4\n1,256\n10-13\nChili's international\n9\n374\n38-43\nMaggiano's\n—\n52\n1\nGrand total\n13\n1,682\n49-57\nView original content: http://www.prnewswire.com/news-releases/brinker-international-reports-second-quarter-results-300589882.html\nSOURCE Brinker International, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/brinker-international-reports-second-quarter-results-300589882.html", "http://investors.brinker.com/phoenix.zhtml?c=119205&p=irol-EventDetails&EventId=5266817", "https://c212.net/c/link/?t=0&l=en&o=2043996-1&h=3667464238&u=http%3A%2F%2Finvestors.brinker.com%2Fphoenix.zhtml%3Fc%3D119205%26p%3Dirol-EventDetails%26EventId%3D5266817&a=http%3A%2F%2Finvestors.brinker.com%2Fphoenix.zhtml%3Fc%3D119205%26p%3Dirol-EventDetails%26EventId%3D5266817"], "published": "2018-01-30T14:45:00.000+02:00", "crawled": "2018-01-30T15:36:20.085+02:00", "highlightTitle": ""}