{"organizations": [], "uuid": "1e8e95fbd9a58f23757302bd6856ed6dc494b40c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/global-markets-realyields/column-policy-tightening-its-real-rates-that-matter-for-markets-mcgeever-idUSL8N1P03NO", "country": "US", "domain_rank": 408, "title": "COLUMN-Policy tightening? It's real rates that matter for markets: McGeever", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T19:11:00.000+02:00", "replies_count": 0, "uuid": "1e8e95fbd9a58f23757302bd6856ed6dc494b40c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets-realyields/column-policy-tightening-its-real-rates-that-matter-for-markets-mcgeever-idUSL8N1P03NO", "ord_in_thread": 0, "title": "COLUMN-Policy tightening? It's real rates that matter for markets: McGeever", "locations": [], "entities": {"persons": [{"name": "mcgeever", "sentiment": "neutral"}, {"name": "jamie mcgeever lo", "sentiment": "neutral"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}, {"name": "ndon", "sentiment": "none"}, {"name": "european central bank", "sentiment": "none"}, {"name": "fed", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(The opinions expressed here are those of the author, a columnist for Reuters.)\nBy Jamie McGeever\nLONDON, Jan 9 (Reuters) - U.S. and UK interest rates are rising, the European Central Bank is cutting back its bond purchases and even the Bank of Japan is hinting it will turn off the stimulus taps one day.\nWith rates rising and central banks no longer expanding their balance sheets, monetary policy around the world will tighten more in 2018 than any year since the crisis.\nYet the real cost of borrowing, taking inflation into account, remains low historically and perhaps dangerously low. Real interest rates across the developed world have been negative since October 2016, and look set to remain so for some time.\nThis is music to investors’ ears. Negative real rates and yields play a huge part in keeping broader financial conditions loose, which in turn is powering the “melt up” in financial assets.\nAccording to Goldman Sachs, financial conditions in the United States are looser now than when the Federal Reserve started raising rates in December 2015.\nDespite the Fed’s five rate hikes in the last two years, real U.S. interest rates remain negative. Depending on which measure of inflation you use, real rates are as low as -0.5 percent.\nCountrary to the popular perception, Japanese real rates are the highest of all G4 central banks, while real 10-year bond yields in Britain are around the lowest they’ve been for six years.\nNegative real borrowing costs add fuel to markets that are already on fire, limiting the downward pressure on bonds, keeping corporate spreads on the tight side and pushing stocks to new high after new high.\nBut when compared with real yields, stocks aren’t “particularly expensive”, according to the Bank for International Settlements. The slump in real yields since the crisis means the S&P 500’s near 2.5 percent dividend yield remains tempting to investors.\nExchange rates should also be viewed through the prism of real, not nominal, rates and yields. They help explain why the yen has held up well despite the BOJ’s aggressive easing and why sterling is still down more than 10 percent since the 2016 Brexit referendum even though UK rates are rising.\nBOOM TIME The problem with negative real rates at this current juncture is obvious - the world economy and financial markets are booming. Is that an environment that warrants negative interest rates?\nAsset price inflation is everywhere but consumer price inflation is pretty much nowhere to be seen, which is why central banks feel comfortable tightening policy so slowly.\nEven though the global economy is roaring, scars from 2007-09 still run deep, and there’s a clear inclination among policymakers to go slowly and gradually with any rate hikes.\nThis understandable caution is reinforced by the rapid rise in global debt. According to the Institute of International Finance, global debt now exceeds $230 trillion, higher than it was before the crisis and a new all-time high.\nRising debt necessitates lower real borrowing costs for consumers to sustain consumption and living standards. But higher interest rates could make high debt levels unsustainable.\nFor investors, it’s a chicken and egg scenario. They’re crying out for policy “normalization” - higher rates and less central bank “interference” in markets - but are enjoying the asset price boom that’s in large part a direct consequence of central bank largesse.\nIt’s clear that a corner has been turned, however, and that the global tightening shift is underway and some increase in real rates is expected, especially if strong growth continues. But it’s hard to see them getting much above zero, especially in the euro zone and Britain.\nWhile this remains the case, borrowing will continue to rise and the day of reckoning will inch closer. But as long as investors believe that day is far enough in the future distance, world markets may continue to boom.\nReporting by Jamie McGeever; Graphics by Saikat Chaterjee Editing by Jeremy Gaunt\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T19:11:00.000+02:00", "crawled": "2018-01-09T14:58:20.003+02:00", "highlightTitle": ""}