{"organizations": [], "uuid": "01ed269a62c1413e473a1ccd962d49f262be6c52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-immigration-asylum/u-s-immigration-agency-to-review-newest-asylum-cases-first-in-bid-to-deter-fraud-idUSKBN1FK2Y5", "country": "US", "domain_rank": 408, "title": "U.S. immigration agency to review newest asylum cases first in bid to deter fraud", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T22:03:00.000+02:00", "replies_count": 0, "uuid": "01ed269a62c1413e473a1ccd962d49f262be6c52"}, "author": "", "url": "https://www.reuters.com/article/us-usa-immigration-asylum/u-s-immigration-agency-to-review-newest-asylum-cases-first-in-bid-to-deter-fraud-idUSKBN1FK2Y5", "ord_in_thread": 0, "title": "U.S. immigration agency to review newest asylum cases first in bid to deter fraud", "locations": [], "entities": {"persons": [{"name": "obama", "sentiment": "none"}, {"name": "yeganeh torbati", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "u.s. citizenship and immigration services", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "uscis", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - The U.S. immigration agency has changed its handling of asylum cases so more recent claims are judged first, officials said on Wednesday, a shift they said would improve the system by deterring frivolous claims and increasing efficiency.\nAsylum seekers regularly wait five years or more for their cases to be heard, and U.S. Citizenship and Immigration Services had a backlog of 311,000 pending asylum cases as of Jan. 21.\nThis was in part a result of a surge of people in recent years claiming asylum at the U.S. southern border, starting in 2012. The asylum backlog has grown by 1750 percent over the last five years, according to USCIS.\nThe agency will now schedule asylum interviews for more recent applicants ahead of older applications, returning to the system in place until December 2014, when the Obama administration decided to prioritize the oldest cases first.\nTrump administration officials contend that the years-long waits encourage fraudulent claims. By judging new claims first, officials want to discourage applications by people who have no legitimate claim but hope to take advantage of the backlog to work legally in the United States for a few years while their applications work their way through the system.\n“Delays in the timely processing of asylum applications are detrimental to legitimate asylum seekers,” said Francis Cissna, the USCIS director, in a statement. “Lingering backlogs can be exploited and used to undermine national security and the integrity of the asylum system.”\nImmigrant advocates agree that the asylum backlogs harm those seeking protection from persecution or violence abroad but said the Trump administration’s decision would push those people into an even longer wait.\n“Asylum seekers already waiting in the backlog will be severely disadvantaged - and even be sent wrongfully back to violent life-threatening conditions - because their cases will be further delayed and they will have even more difficulty getting witnesses and evidence to support their claims,” said Greg Chen, director of government relations at the American Immigration Lawyers Association.\nThe Trump administration has sought to change the U.S. immigration system to limit both legal and illegal immigration, arguing that unfettered immigration to the United States presents both a national security and economic risk to the country.\nReporting by Yeganeh Torbati; Editing by Cynthia Osterman\n ", "external_links": [], "published": "2018-01-31T22:03:00.000+02:00", "crawled": "2018-01-31T22:18:19.000+02:00", "highlightTitle": ""}