{"organizations": [], "uuid": "f0b83d061871caaef3a709fb2c1a450c28e17c68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/05/104930916-wedding_couple.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/05/why-suze-orman-says-every-millennial-should-have-a-wedding-budget.html", "country": "US", "domain_rank": 767, "title": "Why Suze Orman says every millennial should have a wedding budget", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-05T23:13:00.000+02:00", "replies_count": 0, "uuid": "f0b83d061871caaef3a709fb2c1a450c28e17c68"}, "author": "Emmie Martin", "url": "https://www.cnbc.com/2018/01/05/why-suze-orman-says-every-millennial-should-have-a-wedding-budget.html", "ord_in_thread": 0, "title": "Why Suze Orman says every millennial should have a wedding budget", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "suze orman", "sentiment": "negative"}, {"name": "american express", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Even if you're not getting married this year, you're probably planning to attend at least one wedding. For millennials, that average is closer to three.\nAlthough wedding season doesn't kick off until June, you should create a wedding budget now as you map our your big picture goals for the year, says financial expert and former CNBC host Suze Orman.\nThat's because, even if you're not the one saying \"I do,\" weddings are still a major money suck.\nshow chapters Suze Orman explains how much money you'll need to have when an emergency happens      12:46 PM ET Thu, 15 June 2017 | 01:01 A 2016 survey from American Express found that millennials spend an average of $893 per wedding they attend as a guest. When they're in the wedding party, that spending rises to $928. That means between airfare, gifts and other expenses, young people are shelling out an average of $2,679 per year to celebrate the nuptials of friends and family.\nBut, as Orman points out , most twenty- and early-thirtysomethings are also working toward other financial goals that are arguably more pressing.\n\"I bet plenty of millennials are the same people who are trying to juggle the rent and stay current on their student loans,\" Orman writes in a 2017 blog post . \"And I know plenty of millennials are still working to get their emergency fund going, let alone have at least eight months of living costs saved up.\"\nshow chapters Suze Orman reveals her biggest money mistake — and what you can learn from it      11:21 AM ET Wed, 28 June 2017 | 01:03 You don't have to skip your college roommate's big day in order to bulk up your emergency fund, but you shouldn't be letting one-time events like weddings impede other financial priorities, either. Start saving up now for the multitude of purchases you have to make when wedding season gets into full swing. And sort your priorities.\n\"You need to be smart about this,\" Orman writes. \"You may want a new outfit for each event, but you sure don't need one. You may want to give the couple an expensive gift, but you don't need to. A heartfelt gift — yes, homemade! — is going to be even more special.\"\nAnd, if you have any destination weddings on the horizon, make a plan well beforehand and stick to it. \"Your goal is to cut back your regular spending the second you get the 'save the date' notice,\" Orman says.\nDon't miss: \nSuze Orman: One question about your car will show whether you're good with money Suze Orman says this mental shift is the key to saving money Suze Orman: Most people miss out on a simple way to save up to $100,000 on a home Like this story? Like CNBC Make It on Facebook ! \nshow chapters Suze Orman shares the one thing you should do right now to retire a millionaire      8:12 AM ET Fri, 21 July 2017 | 01:04", "external_links": ["https://www.suzeorman.com/blog/how-not-to-let-runaway-wedding-costs-derail-your-financial-plan/", "http://about.americanexpress.com/news/sst/report/2016-04_Spend-and-Save-Tracker.pdf", "http://www.redbookmag.com/love-sex/relationships/a49747/most-popular-wedding-month/", "https://www.facebook.com/CNBCMakeIt/"], "published": "2018-01-05T23:13:00.000+02:00", "crawled": "2018-01-05T22:30:19.024+02:00", "highlightTitle": ""}