{"organizations": [], "uuid": "66d74f6b3d04b0c6dd45679311de0d6dfbaa4478", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-avicanna-completes-2nd-equity-financing-welcomes-new-strategic-shareholder.html", "country": "US", "domain_rank": 767, "title": "Avicanna Completes 2nd Equity Financing & Welcomes New Strategic Shareholder", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.067, "site_type": "news", "published": "2018-01-29T16:00:00.000+02:00", "replies_count": 0, "uuid": "66d74f6b3d04b0c6dd45679311de0d6dfbaa4478"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-avicanna-completes-2nd-equity-financing-welcomes-new-strategic-shareholder.html", "ord_in_thread": 0, "title": "Avicanna Completes 2nd Equity Financing & Welcomes New Strategic Shareholder", "locations": [], "entities": {"persons": [{"name": "avicanna", "sentiment": "none"}], "locations": [{"name": "toronto", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "avicanna", "sentiment": "none"}], "organizations": [{"name": "avicanna inc.", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO, Jan. 29, 2018 /PRNewswire/ - Avicanna Inc., (\" Avicanna \") is pleased to announce the completion of its second non-brokered private placement offering (the \" Offering \") for units in Avicanna (each a \" Unit \"). Each Unit consists of one common share in the capital of Avicanna (a \" Common Share \") and one half of one Common Share purchase warrant (a \" Warrant \") with each whole Warrant entitling the holders thereof to purchase one Common Share in the capital of the Corporation (a \" Warrant Share \") at a price of $2.50 per Common Share. The Warrants must be exercised on the earlier of eighteen (18) months after the closing of the Offering and three (3) months after the date that Avicanna completes an initial public offering and listing on a recognized stock exchange in Canada.\nAvicanna sought to raise $2 million. Due to significant interest in the Offering, Avicanna oversubscribed resulting in a $4.75 million closing. Avicanna intends to use the proceeds of the Offering for the purposes of continuing research and development, clinical development of existing and future product lines, and to fund its phase one build-out of a production facility in Santa Marta, Colombia. Avicanna will also allocate some of the funds raised to build-out product licensing and sales models in both Canada and the United States of America.\n\"We are thrilled to see the level of support and interest that we have received from our subscribers, and we are equally excited to develop meaningful and prosperous relationships with our new strategic shareholders. The funds raised will allow Avicanna to continue to excel and provides our team with the opportunity to focus on the execution of our multi-vertical business model in Canada and around the world.\"\n-Aras Azadian, CEO\nThe oversubscription comes well received by Avicanna as it opened the doors to accept new strategic investors such as a top Canadian Financial Institution and other key individual investors. Notably, Avicanna welcomes Anand \"Andy\" Khubani who brings a wealth of experience in high volume mass distribution through his well-established network of the largest retailers in the United States of America.\nAbout Avicanna\nAvicanna Inc. is a biotechnology company focused on innovative product development and advanced clinical research in the medical cannabis industry. With headquarters based out of JLABS @ Toronto (Canada), Avicanna is the first cannabinoid-related company to be integrated into a Johnson & Johnson Innovation centre. Capitalizing on the progressive development of its proprietary brand Pura Elements™, Avicanna is focused on building an international distribution network through the use of strategic licensing models. Utilizing the experience of its senior scientists and executive board, and the support of its clinical and academic partners in the University of Toronto and the University Health Network, Avicanna strives to be at the forefront of advancements in the global medical cannabis industry. Avicanna is focused on providing cannabinoid-based therapies that are both clinically supported and medically approved.\nAbout Anand \"Andy\" Khubani\nChairman, CEO, and founder of IdeaVillage Products Corp., Anand \"Andy\" Khubani is the master marketer behind today's top-selling TV products and brands. Bringing new products to market or catapulting existing products in the marketplace, Mr. Khubani's prowess has been successfully demonstrated in such well-known products as Copper Fit, Finishing Touch Flawless, HD Vision, Micro Touch, Yoshi, Snackeez and more.\nKhubani is responsible for the Company's product development, corporate strategy and marketing. His relentless search of voids in the marketplace is his primary business strategy; identifying consumer trends before other companies are aware of these opportunities and capitalizing on these trends through innovative product solutions.\nForward-Looking Information\nThis news release contains certain \"forward-looking information\" within the meaning of applicable Canadian securities law. Forward-looking information is frequently characterized by words such as \"plan\", \"continue\", \"expect\", \"project\", \"intend\", \"believe\", \"anticipate\", \"estimate\", \"may\", \"will\", \"potential\", \"proposed\" and other similar words, or information that certain events or conditions \"may\" or \"will\" occur. This information is only a prediction. Various assumptions were used in drawing the conclusions or making the projections contained in the forward-looking information throughout this news release. Forward-looking information includes, but is not limited to: (i) the ability to consummate transactions which are currently in discussions, (ii) requirements to obtain additional financing, (iii) timeliness of government approvals for granting of permits and licenses, including licenses to cultivate cannabis, (iv) completion of local growing facilities, where applicable, (v) actual operating performance of the facilities, (vi) regulatory or political change in Colombia, Latin America, United States of America or Canada, (vii) competition and other risks affecting Avicanna, in particular, and the medical cannabis industry generally. Forward-looking information is based on the opinions and estimates of management at the date the information is made, and is subject to a variety of risks and uncertainties and other factors that could cause actual events or results to differ materially from those projected in the forward-looking information. Avicanna is under no obligation, and expressly disclaims any intention or obligation, to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, except as expressly required by applicable law.\nSOURCE Avicanna Inc.", "external_links": [], "published": "2018-01-29T16:00:00.000+02:00", "crawled": "2018-01-29T19:59:37.011+02:00", "highlightTitle": ""}