{"organizations": [], "uuid": "81c17e49a39fd439e2cea8fa563bf5b348faa390", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/china", "section_title": "China | Reuters.com", "url": "https://www.reuters.com/article/us-asia-cities-china/china-infrastructure-plan-can-help-asias-growing-cities-expert-idUSKBN1F50T1", "country": "US", "domain_rank": 408, "title": "China infrastructure plan can help Asia's growing cities: expert", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T16:45:00.000+02:00", "replies_count": 0, "uuid": "81c17e49a39fd439e2cea8fa563bf5b348faa390"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-asia-cities-china/china-infrastructure-plan-can-help-asias-growing-cities-expert-idUSKBN1F50T1", "ord_in_thread": 0, "title": "China infrastructure plan can help Asia's growing cities: expert", "locations": [], "entities": {"persons": [{"name": "lauren sorkin", "sentiment": "none"}, {"name": "asia-pacif", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "asia pacific", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "kuala lumpur", "sentiment": "negative"}, {"name": "rockefeller foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KUALA LUMPUR (Thomson Reuters Foundation) - China’s landmark “Belt and Road” scheme, which is ploughing billions of dollars into global infrastructure projects, could work hand-in-hand with efforts to help Asian cities meet the needs of their exploding populations, a regional resilience expert said.\nMany Asia-Pacific cities, including the 23 that are part of the 100 Resilient Cities (100RC) network backed by The Rockefeller Foundation, have been held back by a deficit in infrastructure.\nBut that could change with China’s new drive to invest, said Lauren Sorkin, regional director for Asia Pacific at 100RC.\n“The proposed investments in port and rail infrastructure are staggering - what is done in connection with those investments is terribly important,” she said, highlighting the need to consider issues beyond economic growth, such as the environment.\n“We have to look at what are going to be the benefits to the communities and cities around them,” she told the Thomson Reuters Foundation, which partners with The Rockefeller Foundation on resilience coverage.\nA failure by many Asia-Pacific cities to plan well and invest in the infrastructure required to keep pace with rapid urbanization has had a detrimental impact on millions of people, experts say.\nThe Asian Development Bank (ADB) forecasts that the region needs to spend $1.7 trillion per year from now until 2030 to meet its infrastructure needs.\nBeijing’s so-called “Belt and Road” initiative aims to recreate the old “Silk Road” with massive infrastructure projects to connect China by land and sea to Southeast, South and Central Asia, and beyond to the Middle East, Europe and Africa.\nFour Chinese cities are taking part in the 100RC initiative to bolster cities to deal with modern-day shocks and stresses: Deyang, Haiyan, Huangshi and Yiwu.\nThey have spent the past year selecting and training senior officials to fill the role of chief resilience officer.\nDeyang is set to become the first 100RC member in China to publish its resilience strategy in May, coinciding with the tenth anniversary of a devastating earthquake that hit the city.\nWhile there is still far to go to raise adequate finance for infrastructure in Asian cities, Sorkin said money was available for those in the 100RC group to “get the work done”.\nSorkin, who previously worked at the ADB, said 100RC’s Asia-Pacific members aimed to switch from planning to implementing their resilience strategies in 2018.\n“This year is about action,” she added in a telephone interview.\nSince 100RC - backed by $164 million from The Rockefeller Foundation - was established in 2013, its member cities have set priorities to build their resilience in consultation with academics, urban planners, business leaders, civil society and government agencies.\nSorkin pinpointed mobility and water management as the top two issues facing Asian cities.\nBangkok and Jakarta, for example, struggle with regular flooding and traffic gridlock that can make even the shortest journeys last for hours.\n“Changing the paradigm in terms of how our cities live and build with water - as they’re also facing a changing climate - is the number one challenge,” Sorkin said.\n“Providing adequate transport in rapidly growing cities is the biggest challenge next to water,” she added.\nReporting by Michael Taylor, editing by Megan Rowling; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T16:45:00.000+02:00", "crawled": "2018-01-16T23:08:20.004+02:00", "highlightTitle": ""}