{"organizations": [], "uuid": "a0b830333d48ee5666958de17dc791ada6bae825", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219048559&w=1200&r=LYNXMPEE020O5", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-facup/liverpools-van-dijk-primed-for-derby-debut-in-cup-idUKKBN1ES10W", "country": "US", "domain_rank": 408, "title": "Liverpool's Van Dijk primed for derby debut in cup", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T15:08:00.000+02:00", "replies_count": 0, "uuid": "a0b830333d48ee5666958de17dc791ada6bae825"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-facup/liverpools-van-dijk-primed-for-derby-debut-in-cup-idUKKBN1ES10W", "ord_in_thread": 0, "title": "Liverpool's Van Dijk primed for derby debut in cup", "locations": [], "entities": {"persons": [{"name": "neil robinson", "sentiment": "neutral"}, {"name": "van dijk", "sentiment": "neutral"}, {"name": "philippe coutinho", "sentiment": "none"}, {"name": "juergen klopp", "sentiment": "none"}, {"name": "klopp", "sentiment": "none"}, {"name": "sadio mane", "sentiment": "none"}, {"name": "virgil van dijk", "sentiment": "none"}, {"name": "mo salah", "sentiment": "none"}], "locations": [{"name": "southampton", "sentiment": "none"}, {"name": "leicester city - anfield", "sentiment": "none"}, {"name": "anfield", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "liverpool", "sentiment": "neutral"}, {"name": "barcelona", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "everton", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 11 PM / Updated 10 minutes ago Liverpool's Van Dijk primed for derby debut in cup Neil Robinson 5 Min Read \n(Reuters) - Virgil van Dijk, the world’s most expensive defender, could make his Liverpool debut against local rivals Everton at Anfield in Friday night’s opening FA Cup third-round clash. FILE PHOTO - Soccer Football - Premier League - Liverpool vs Leicester City - Anfield, Liverpool, Britain - December 30, 2017 Former Liverpool defender Virgil van Dijk before the match REUTERS/Phil Noble \nThe centre back is eligible to play after his registration was finalised following his protracted 75 million pound move from Southampton. \nManager Juergen Klopp has yet to say whether he intends to plunge the Dutchman straight into action, particularly in such a high-profile game, but Van Dijk is likely to feature at least on the bench. \nThe shape of Klopp’s team is further complicated by British media reports that Barcelona are about to table a bid for Brazilian midfielder Philippe Coutinho. Meanwhile, Mo Salah and Sadio Mane may not feature in Friday’s game after the German agreed to allow them to attend the African Footballer of the Year awards in Ghana on Thursday. \nA private plane will fly them back with Klopp seemingly relaxed about the unusual arrangements. “We have two of the three best African players in our squad. We have to show them respect. We are going to sleep in a hotel the night before the match, they are going to sleep on a plane. That is the only difference,” he said. \nWith Manchester City so far ahead in the Premier League, the FA Cup, which Liverpool last won in 2006, may represent Klopp’s best chance of winning his first trophy at the club, although Everton always represent a formidable barrier. Last month they drew 1-1 at Anfield and have never lost a cup tie against their neighbours there. \nAll four previous Anfield derbies in the FA Cup, stretching back 116 years, have been drawn, most recently 1-1 in 2009 when Everton won the replay. VAR TECHNOLOGY \nFriday’s other tie pits 2016 champions Manchester United against Derby County, who are second in the Championship, while neighbours City play Burnley on Saturday. \nTo the dismay of purists, the draw has been staggered over four days with Monday’s final game between Brighton & Hove Albion and Crystal Palace marking the first time video assistant referee (VAR) will be used in a major English game. \nThe technology will be restricted to three “game-changing” situations -- goals, penalties and straight red cards -- at a time when referees have been criticised for getting high-profile decisions wrong. \nLast week in the league, Arsenal were on the wrong end of a harsh handball penalty decision which led to a late equaliser for West Bromwich Albion. The FA Cup holders will be hoping for better luck when they begin their defence of a competition they have won three times in the past four years at managerless Nottingham Forest on Sunday. \nShrewsbury are among the lower division teams scenting a traditional third-round upset against higher-ranked opponents. The Shrews, who sit second in the third-tier League One, face a West Ham United side prioritising top-tier survival and playing their third game in six days. \nAnother Premier League struggler, West Brom, may be troubled at League Two side Exeter City while last season’s losing finalists Chelsea travel to Norwich City from the Championship. \nUnusually, no non-league teams have made it through to the third round but the draw has pitted several players against their former teams. \nThe best known is Leicester City’s Jamie Vardy, who returns to Fleetwood Town, who were a non-league side when the striker left them in 2012 after scoring 31 goals in 36 games. \nFleetwood, who are now managed by former Manchester City striker Uwe Rosler, have progressed in his absence and are now 12th in League One. \nPerhaps the third-round’s biggest cheer will be heard at Brentford’s Griffin Park where Republic of Ireland international Alan Judge is slated for his first game in 21 months, against his former side Notts County. \nThe midfielder has not played since breaking his leg in three places against Ipswich Town in April 2016 but has been told by manager Dean Smith that, after appearing on the Brentford bench for a couple of games, he will play on Saturday. \nJudge’s horrific injury required two operations to heal and deprived the 29-year-old of the chance to appear at Euro 2016 and a likely Premier League move. \n“I didn’t watch football for a year,” he said ahead of his comeback. “I watched little bits here or there, but I didn’t watch Brentford play for over a year, until I knew I was getting fit and I knew I was getting back”. \nOn Saturday, the long wait will be over. Reporting by Neil Robinson; Editing by Christian Radnedge", "external_links": [], "published": "2018-01-03T15:08:00.000+02:00", "crawled": "2018-01-03T15:27:30.009+02:00", "highlightTitle": ""}