{"organizations": [], "uuid": "5cb4ffef98832240e9a58e5db3062ee01c98afa4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224110302&w=1200&r=LYNXMPEE0L0QP", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-golf-woods-return/dont-expect-miracles-from-woods-in-2018-say-experts-idUSKBN1FB13O", "country": "US", "domain_rank": 408, "title": "Don't expect miracles from Woods in 2018, say experts", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T12:04:00.000+02:00", "replies_count": 0, "uuid": "5cb4ffef98832240e9a58e5db3062ee01c98afa4"}, "author": "", "url": "https://www.reuters.com/article/us-golf-woods-return/dont-expect-miracles-from-woods-in-2018-say-experts-idUSKBN1FB13O", "ord_in_thread": 0, "title": "Don't expect miracles from Woods in 2018, say experts", "locations": [], "entities": {"persons": [{"name": "chamblee", "sentiment": "none"}, {"name": "bill mallon", "sentiment": "none"}, {"name": "brandel chamblee", "sentiment": "none"}, {"name": "woods", "sentiment": "none"}, {"name": "mallon", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "torrey pines", "sentiment": "none"}, {"name": "bahamas", "sentiment": "none"}], "organizations": [{"name": "pga tour", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 10:05 AM / in 8 hours Don't expect miracles from Woods in 2018, say experts Andrew Both 4 Min Read \n(Reuters) - As anticipation builds over Tiger Woods’s official comeback after nearly a year rehabilitating from a spinal fusion, two former professionals have offered a tempered view of what to expect from the 14-times major champion in 2018 and beyond. \nWoods completed 72 holes for the first time in three years when he finished equal ninth of 18 players at the Hero World Challenge in the Bahamas in December -- an unofficial event on the PGA Tour. \nThat was an appetizer before he continues his return at this week’s Farmers Insurance Open at Torrey Pines in southern California. \nWoods, however, faces at least one immovable obstruction, based on historical precedent, according to Brandel Chamblee and Bill Mallon. \nChamblee, now a forthright Golf Channel analyst, says Woods appears to have solved his body and swing issues, but “chipping yips” and age make it nearly impossible to imagine him recapturing his old magic. \nMallon agrees: “He was so good once I think it would be hard to dismiss him, but coming back after four back surgeries and multiple left knee surgeries -- I’m sure he’s got arthritis -- I think it will be tough,” the golf and Olympic historian told Reuters in a telephone interview. \n“At that level, the slightest incremental deterioration physically, even though golf is not football, it still has huge physical demands to do it without pain.” \nChamblee says it would be a Herculean achievement for Woods, who has won 79 times on the PGA Tour, to surpass Sam Snead’s record 82 victories. \n“Looking at a 42-year-old, all things being equal, if Tiger was to win once it would be extraordinary, twice would be mind blowing. If he wins four times it would be one of the greatest things ever done in golf,” he said. \nChamblee pointed out that behind Snead and Woods, the next 10 most prolific winners on tour -- a list that includes Jack Nicklaus, Ben Hogan and Arnold Palmer -- claimed only 14 victories between them after turning 40. \nAnd those players did not have the chipping yips, something that Chamblee believes has afflicted Woods for three years and will continue to do so. \n“WALL OF DOUBT” \nChamblee expects Woods’s long game to be fine at Torrey Pines, but suggests keeping a close eye on his work around the greens. \n“It’s not a matter of reps,” Chamblee said, disagreeing with a suggestion that Woods is likely to improve his short game once he gets multiple tournaments under his belt. \n“The yips start with bad technique and then it becomes a mental issue. Combination of the two is devastating. \n“You’re alone in the jungle and there’s no path out. Nobody has ever overcome the chipping yips. Before every single chip he’s going to hit this year he’s going to have to chisel his way through a wall of doubt.” \nChamblee said that Woods’s chipping had been the worst of anyone in the field at the Hero in December, and counted seven times that he needed two chips to get the ball onto the green. Even before that, his chipping had been mediocre, he added. \nYet if Woods somehow replicated the greatness of his halcyon years, Chamblee does not think that today’s top players would be able to compete. \n“Tiger was the best of all time, by a mile,” Chamblee said. \n“Tiger (at his best) would annihilate all the best players. If Tiger played the same golf he played in 2013 (when he won five times) he’d still beat them all. \n“If he played the same golf as 2007, every one of them would spend hundreds of thousands of dollars on sports psychologists. \n“I say this with due respect. Nobody thinks more of Rory McIlroy or Dustin Johnson than me. \n“There’s been a lot of great writers but there’s only one Shakespeare, and Tiger is golf’s Shakespeare. \n“In 500 years golf fans will still be talking about Tiger Woods.” Reporting by Andrew Both in Cary, North Carolina; Editing by Toby Davis", "external_links": [], "published": "2018-01-22T12:04:00.000+02:00", "crawled": "2018-01-22T12:21:05.012+02:00", "highlightTitle": ""}