{"organizations": [], "uuid": "8d24262befb99684e83043661867bb39661f9460", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 270, "shares": 270, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226747559&w=1200&r=LYNXMPEE0T1LX", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-trump-russia-bannon/bannon-will-not-testify-before-u-s-house-intel-panel-on-wednesday-idUSKBN1FJ347", "country": "US", "domain_rank": 408, "title": "Bannon will not testify before U.S. House intel panel on Wednesday", "performance_score": 2, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T01:18:00.000+02:00", "replies_count": 0, "uuid": "8d24262befb99684e83043661867bb39661f9460"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-russia-bannon/bannon-will-not-testify-before-u-s-house-intel-panel-on-wednesday-idUSKBN1FJ347", "ord_in_thread": 0, "title": "Bannon will not testify before U.S. House intel panel on Wednesday", "locations": [], "entities": {"persons": [{"name": "bannon", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "schiff", "sentiment": "none"}, {"name": "steve bannon", "sentiment": "none"}, {"name": "adam schiff", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "u.s. house", "sentiment": "negative"}, {"name": "former white house", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "u.s. house intelligence committee", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " Former White House strategist Steve Bannon’s return to the U.S. House Intelligence Committee will not take place on Wednesday as expected, Representative Adam Schiff, the panel’s top Democrat said on Tuesday.\nBannon had been expected to speak to the House of Representatives committee again on Wednesday as part of investigation of allegations that Russia sought to influence the 2016 U.S. election, to follow up on his Jan. 16 appearance, which failed to satisfy some members of the panel.\nMoscow denies election meddling, and President Donald Trump has denied any collusion between his associates and Russia.\nA source familiar with the issue said Bannon’s appearance was canceled because the White House and the committee had yet to agree on matters of executive privilege, by which the president can resist congressional requests for information if he deems it in the public interest.\nAsked for comment, Schiff told Reuters there could have been many reasons. A spokesman for the committee’s Republican chairman, Representative Devin Nunes, did not immediately respond to a request for comment.\nAgainst the wishes of Democrats, the Republican majority on the intelligence committee has been pushing for the release of a classified memo commissioned by Nunes that alleged surveillance abuse by the Federal Bureau of Investigation and Department of Justice. The committee voted along party lines to release the memo on Monday, leaving it to Trump to decide.\nDemocrats have criticized the memo as partisan talking points intended to cast doubt on the investigation.\nThe House intelligence panel is one of three congressional committees, along with Department of Justice Special Counsel Robert Mueller, investigating the matter.\nDuring his Jan. 16 appearance, Bannon refused to answer questions about his time in Trump’s administration or the post-election presidential transition, committee members said.\nThe White House and the House committee have so far not even begun to discuss the executive privilege issue, the source said. Bannon also has not received documents to review from the White House or Trump’s presidential transition office, the source said.\nWhite House communications director Hope Hicks, who also has been asked to appear before House Intelligence, is dealing with similar executive privilege issues, according to another person familiar with the matter.\nReporting by Karen Freifeld, Mark Hosenball and Patricia Zengerle; Writing by David Alexander and Patricia Zengerle; Editing by James Dalgleish\n ", "external_links": [], "published": "2018-01-31T01:18:00.000+02:00", "crawled": "2018-01-31T01:28:48.000+02:00", "highlightTitle": ""}