{"organizations": [], "uuid": "b6fa96d048e04de314a5ad7e2a7e43faf7d7121a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/03/104445470-GettyImages-663644740.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/25/argentina-needs-to-grow-out-of-boom-bust-cycles-treasury-minister.html", "country": "US", "domain_rank": 767, "title": "Argentina needs to grow out of boom, bust cycles: Treasury minister", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-25T10:00:00.000+02:00", "replies_count": 0, "uuid": "b6fa96d048e04de314a5ad7e2a7e43faf7d7121a"}, "author": "Holly Ellyatt", "url": "https://www.cnbc.com/2018/01/25/argentina-needs-to-grow-out-of-boom-bust-cycles-treasury-minister.html", "ord_in_thread": 0, "title": "Argentina needs to grow out of boom, bust cycles: Treasury minister", "locations": [], "entities": {"persons": [{"name": "nicolas dujo", "sentiment": "neutral"}, {"name": "mauricio macri", "sentiment": "none"}, {"name": "dujovne", "sentiment": "none"}], "locations": [{"name": "argentina", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "treasury", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Argentina will address the future of work, infrastructure and food security, President Mauricio Macri said Thursday.\nThe South American country has long suffered the consequences of a fractured world, Macri said at the World Economic Forum (WEF) in Davos, Switzerland.\n\"The decades we have been isolated from the world but Argentina is now entering a new phase and we are now in the position to play a significant role on the international stage,\" he said.\n\"In the last two years, we put in order our economy and the country back on track. Argentina is on a sustainable and steady path of inclusive growth — every day we make decisions that drive us towards our primary goal of reducing poverty.\"\nArgentina's economy started its recovery under the leadership of President Mauricio Macri, a former real estate developer who took office in 2015 just as the country was heading into a recession. It exited its recession in the second half of 2016.\nToday, the stock market is booming but the wider economy still faces challenges . Argentina's central bank is trying to tame high inflation, of almost 25 percent, but revised its interest rate target higher to 15 percent Tuesday, giving it room to continue to slowly lower interest rates that are currently around 27 percent. The central bank expects the interest rate to go down to 5 percent in 2019.\nEconomic transformation Argentina's economy is undergoing a transformation although inflation remains high.\nEarlier on Thursday, Nicolas Dujovne, the nation's treasury minister, told CNBC that the country was working to get out of a cycle of booms and busts.\n\"Typically, Argentina has experienced boom-bust cycles and we're trying to get out of that,\" Dujovne said at WEF.\n\"In 2017, Argentina grew close to 3 percent and we think that this year we'll be growing close to 3.5 percent,\" he said.\nDujovne said the country was trying to grow out of a series of booms and busts with the aim of putting Argentina back into the \"club of developed nations.\"\n\"Macroeconomic policy is directed towards correcting imbalances and that's how we will not repeat these boom-bust stories of Argentina,\" he said\nDujovne said that reforms instigated by Macri were bearing fruit and boosting investor confidence.\n\"Valuations were really depressed under the previous administration and there was no respect for the rule of law, (there was) an economy that was totally stagnant and high inflation and a high fiscal deficit, and no plans to tackle the problems,\" he said.\n\"But since Mr Macri has taken office, Argentina has embarked on a program of reforms to restore macroeconomic stability to Argentina and to restore the possibility of having growth for many, many years. so the markets are discounting the success of the reforms.\"", "external_links": ["http://www.bcra.gob.ar/PoliticaMonetaria/Politica_Monetaria_i.asp#a"], "published": "2018-01-25T10:00:00.000+02:00", "crawled": "2018-01-25T12:15:24.013+02:00", "highlightTitle": ""}