{"organizations": [], "uuid": "5ce5589381ed07289c188ead1736680f0a41ea50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221419018&w=1200&r=LYNXMPEE0B0OD", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-indonesia-quake-planning/u-n-indonesia-earthquake-plan-foresees-47-million-affected-10000-dead-idUKKBN1F117C", "country": "US", "domain_rank": 408, "title": "U.N. Indonesia earthquake plan foresees 47 million affected, 10,000 dead", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T13:15:00.000+02:00", "replies_count": 0, "uuid": "5ce5589381ed07289c188ead1736680f0a41ea50"}, "author": "", "url": "https://uk.reuters.com/article/uk-indonesia-quake-planning/u-n-indonesia-earthquake-plan-foresees-47-million-affected-10000-dead-idUKKBN1F117C", "ord_in_thread": 0, "title": "U.N. Indonesia earthquake plan foresees 47 million affected, 10,000 dead", "locations": [], "entities": {"persons": [{"name": "tom miles", "sentiment": "none"}], "locations": [{"name": "u.n. indonesia", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}, {"name": "jakarta", "sentiment": "none"}, {"name": "sunda strait", "sentiment": "none"}, {"name": "aceh", "sentiment": "none"}, {"name": "caribbean", "sentiment": "none"}], "organizations": [{"name": "u.n.", "sentiment": "negative"}, {"name": "pidie jaya", "sentiment": "none"}, {"name": "min read  geneva", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 11:19 AM / Updated 33 minutes ago U.N. Indonesia earthquake plan foresees 47 million affected, 10,000 dead Tom Miles 3 Min Read \nGENEVA (Reuters) - A U.N. contingency plan for an earthquake in Indonesia foresees a scenario where 10,000 people would die within 24 hours with 47 million more affected, according to emergency response planning documents. FILE PHOTO - Men look for items to salvage from a building which collapsed following a strong earthquake in Pidie Jaya, Aceh province, Indonesia December 10, 2016. REUTERS/Darren Whiteside \nThe U.N.-led exercise to prepare for disaster in one of the world’s most quake-prone regions, is based on a magnitude 7.8 quake in the Sunda Strait, close to the capital Jakarta, similar in size to one that struck the Caribbean this week. \n“Within the first 24 hours, approximately 10,000 deaths with a substantial number of missing people is reported,” said the contingency plan based on a worst-case scenario. \nA further 60,000 people would be seriously injured and 200,000 lightly injured, while 9.6 million would be temporarily displaced. Although 2.5 million people would need immediate help, fewer than one in 10 would get it. \nElectricity and telephone networks would go down for as long as two weeks, and large scale oil and chemical spills would cause fires and disrupt fuel supplies for a week after the quake. There would be major disruption to air and sea ports. \nIn 2004 the Indian Ocean tsunami killed 226,000 people in 13 countries, including more than 120,000 in Indonesia. Since then, a culture of disaster prevention has spread around the world, said Denis McClean, spokesman for the U.N. Office for Disaster Risk Reduction. \nIndonesia has established disaster management agencies at national and local levels and a tsunami warning system, he said. But as in most earthquake-prone countries, it needed to improve building regulations. \n“It is buildings which kill in earthquakes,” McClean said. \nThe scenario, which assumes an earthquake affecting west Java and Sumatra with no tsunami, was developed by Indonesia’s geophysics and meteorological agency BMKG, based on a huge 1699 earthquake in Batavia, the location of modern-day Jakarta. \nFurther scenario modelling should look into multiple disasters such as a tsunami or flooding in a big city, bringing in more accurate data on damaged buildings and infrastructure, the documents said. \nThe World Bank reckons natural disasters cost Indonesia 0.3 percent of its GDP annually, but a 2015 report on disaster risk management prepared by Indonesia’s government said a major earthquake, occurring once every 250 years, could cause losses in excess of $30 billion, or 3 percent of GDP. \nIn December a 6.5 magnitude quake killed at least three people when it hit Java, Indonesia’s most densely populated island, at a depth of 92 km (57 miles), and buildings in Jakarta swayed for several seconds. Reporting by Tom Miles; Editing by Robin Pomeroy", "external_links": [], "published": "2018-01-12T13:15:00.000+02:00", "crawled": "2018-01-12T13:45:24.017+02:00", "highlightTitle": ""}