{"organizations": [], "uuid": "01c0d7ef9a52370a6731c90565887aadadc898d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/idUSL1N1P31JC", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Group says Venezuela bonds should trade minus interest", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T06:19:00.000+02:00", "replies_count": 0, "uuid": "01c0d7ef9a52370a6731c90565887aadadc898d6"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/idUSL1N1P31JC", "ord_in_thread": 0, "title": "UPDATE 1-Group says Venezuela bonds should trade minus interest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(UPDATES throughout)\nBy Paul Kilby\nNEW YORK, Jan 8 (IFR) - Emerging markets trade group EMTA on Monday recommended that Venezuela’s sovereign bonds be traded flat or without accrued interest, the way bonds in default are typically traded.\nThe move comes after S&P last week downgraded Venezuela’s 2018s to D from CC after the country missed a payment on that particular bond.\nLate last year, EMTA reiterated its recommendation to trade Venezuela bonds with accrued interest amid uncertainty over whether coupon payments would eventually reach investors or not.\nWhile the Venezuelan government has vowed to stay current on its debt, it has also deferred payments into grace periods and beyond - and blamed US sanctions for the delays.\nBetween its sovereign bonds and the debt of state-owned oil company PDVSA, the country is late on about US$1.629bn in payments, with a good portion of it falling outside the grace periods, according to Nomura.\nEven so, Monday’s recommendation just targets sovereign bonds, failing to mention debt issued by state-owned oil company PDVSA.\nThat may be because the government appears to have shown a preference for paying PDVSA over sovereign bonds, say some market participants.\n“There has been no official communication on the specific sovereign coupons while PDVSA continues to make delayed coupon payments,” Siobhan Morden, head of Latin America strategy at Nomura, wrote last week.\nWhen bonds trade flat, the buyer no longer pays for any accrued interest owed since the last payment.\nThis could encourage more trading in Venezuela sovereign debt, said one investor.\n“It may unlock and increase trading volumes,” the investor said.\n“For distressed hedge funds to pay interest and not expect to receive it is sacrilege. If they don’t have to pay accrued interest, they may be more inclined to buy.” (Reporting by Paul Kilby; Editing by Marc Carnegie)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T06:19:00.000+02:00", "crawled": "2018-01-09T09:36:46.927+02:00", "highlightTitle": ""}