{"organizations": [], "uuid": "6828bef07f4f89095f731b53406b2fa0d540f83d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-bridge-bancorp-inc-reports-fourth-quarter-and-year-end-2017-results-with-record-revenues.html", "country": "US", "domain_rank": 767, "title": "Bridge Bancorp, Inc. Reports Fourth Quarter and Year End 2017 Results With Record Revenues", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T00:15:00.000+02:00", "replies_count": 0, "uuid": "6828bef07f4f89095f731b53406b2fa0d540f83d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-bridge-bancorp-inc-reports-fourth-quarter-and-year-end-2017-results-with-record-revenues.html", "ord_in_thread": 0, "title": "Bridge Bancorp, Inc. Reports Fourth Quarter and Year End 2017 Results With Record Revenues", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "bridgehampton", "sentiment": "none"}], "organizations": [{"name": "bridge bancorp, inc.", "sentiment": "neutral"}, {"name": "bridge bancorp, inc", "sentiment": "neutral"}, {"name": "bnb bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRIDGEHAMPTON, N.Y., Jan. 29, 2018 (GLOBE NEWSWIRE) -- Bridge Bancorp, Inc. (NASDAQ:BDGE), (the “Company”), the parent company of BNB Bank (“BNB”), today announced fourth quarter and year end results for 2017.\nThe Company's fourth quarter and full year 2017 financial results included:\n• Net loss for the 2017 fourth quarter of $6.9 million, or $0.35 per diluted share. Inclusive of:\nCharge of $7.6 million, or $0.39 per share, from the reduction to net deferred tax assets related to the Tax Cuts and Jobs Act (“Tax Act”). Charge of $5.2 million, after tax, or $0.26 per share, from restructuring costs.\n• Excluding the impact related to the Tax Act and restructuring costs, net income for the 2017 fourth quarter, was $5.9 million, or $0.30 per diluted share.\n• Net income for the full year 2017 was $20.5 million, or $1.04 per diluted share, compared to $35.5 million, or $2.00 per diluted share, for the full year 2016.\n• Net income for the full year 2017, excluding the impact related to the Tax Act and restructuring costs, was $33.3 million, or $1.68 per diluted share.\n• Net interest income for the 2017 fourth quarter increased $3.4 million over 2016 to $33.6 million, with a net interest margin of 3.36%.\n• Total assets of $4.4 billion at December 31, 2017, 3% higher than September 30, 2017 and 9% higher than December 31, 2016.\n• Loan growth of $502 million, or 19%, compared to December 31, 2016, and $181 million, or 25% annualized, from September 30, 2017.\n• Deposit growth of $409 million, or 14%, compared to December 31, 2016, and $131 million, or 16% annualized, from September 30, 2017.\n• Non-public, non-brokered deposit growth of $384 million, or 18%, compared to December 31, 2016.\n• Continued solid asset quality metrics and reserve coverage.\n• All capital ratios exceed the fully phased in requirements of Basel III rules.\n• Declared a dividend of $0.23 during the quarter.\nCommenting on the fourth quarter results, Kevin O’Connor, President and CEO said, “The reported financial results for 2017 and the quarter reflect declines from the previous year due primarily to the Tax Act, our previously announced branch network streamlining, and increased credit costs. However, when adjusted for these items, the Company’s underlying trends are favorable. Loan and deposit growth continued the positive momentum we have experienced during 2017, and the fourth quarter showed the highest increase in both dollars and rate of growth for the year. Net interest income and margin improved in the quarter and for the year, which coupled with the 13% year over year increase in non-interest income, contributed to record revenues of $145 million. Our expense metrics continued to reflect constructive progress on expense control as we continually strive for improvements in operating leverage. Finally, coincident with the change in our charter from a national bank to a New York chartered commercial bank, we rebranded the Bank officially as BNB Bank . These achievements, dampened somewhat by the factors discussed above, were extremely encouraging, and we look forward to building on the many positive strides taken in 2017.”\nNet Interest Income\nInterest income was $40.0 million in fourth quarter 2017, an increase of $1.5 million compared with third quarter 2017, driven primarily by organic growth in loans and partially offset by a decrease in the average securities portfolio. Interest expense was $6.4 million in fourth quarter 2017, an increase of $0.3 million compared with third quarter 2017, due to increases in average interest bearing liabilities and average cost of deposits.\n“Although the net interest margin declined versus 2016, our reported net interest margin has improved over the last two quarters. Our asset yields have stabilized and are beginning to trend higher while we have been able to minimize the impact of rising rates on our funding costs. Our success in growing deposits and maintaining our DDA percentage at 40% enables us to maintain low funding costs and grow the net interest margin,” stated Mr. O’Connor.\n“Over the course of 2017, the Federal Reserve rate increases have failed to generate corresponding rate increases in the longer end of the yield curve. However, beginning at December 31, 2017, longer-term treasury rates have risen. This could signal greater optimism in the economy, attributable to several factors, including the recently passed tax cuts,” noted Mr. O’Connor.\nProvision for Loan Losses\nProvision for loan losses was $10.4 million for the 2017 fourth quarter, $9.0 million higher than the 2016 fourth quarter, and $14.1 million for the full year 2017, $8.5 million higher than the full year 2016. The Company recognized net charge-offs of $8.0 million in the 2017 fourth quarter, compared to net recoveries of $0.2 million for the 2016 fourth quarter. The Company recognized net charge-offs of $8.2 million for the full year 2017, compared to net charge-offs of $0.4 million for the full year 2016. “This quarter’s elevated credit costs resulted primarily from the charge-off of loans and specific reserves associated with two specific relationships, coupled with the need to provide coverage for the sizable fourth quarter loan growth. In analyzing this quarter’s charge-offs, we believe there are factors, both internal and external to these borrowers, which were unique to the relationships. We consider the losses incurred as isolated and not indicative of any negative trends within either the borrowers’ industries or the Company’s overall credit profile,” commented Mr. O’Connor.\nNon-Interest Income\nNon-interest income was $4.5 million for the fourth quarter 2017, $0.8 million higher than fourth quarter 2016, driven primarily by higher other operating income and service charges and other fees, partially offset by net securities losses and lower gain on sale of Small Business Administration (“SBA”) loans. Non-interest income was $18.1 million for the full year 2017, $2.1 million higher than full year 2016, primarily due to higher gain on sale of SBA loans, service charges and other fees, and title fee income.\nNon-Interest Expense\nNon-interest expense for the 2017 fourth quarter increased to $29.2 million from $18.5 million in 2016 fourth quarter. Non-interest expense for the full year 2017 increased to $91.7 million from $77.1 million in full year 2016. The increases in the fourth quarter and full year are primarily due to restructuring costs related to branch restructuring and charter conversion, and growth in salaries and employee benefits expense, partially offset by a decrease in amortization of other intangible assets. Excluding the impact of these restructuring costs, total non-interest expense in the fourth quarter 2017 would have been $21.1 million. Mr. O’Connor commented, “This quarter we executed on two major initiatives, identifying and executing a branch rationalization strategy and the finalization of our charter conversion from a national bank to a New York chartered commercial bank. While each had a different rationale, together they create a bank better prepared for 2018 and beyond. The fourth quarter results reflected a restructuring charge of $8.0 million to account for costs associated with these items, with $7.7 million attributable to the branches. The projected 2018 pre-tax cost savings of $4 million should result in an expected payback period of no more than 24 months.”\nIncome Tax Expense\nIncome tax expense was $5.4 million in fourth quarter 2017, and $18.9 million in full year 2017, which included a $7.6 million charge to write-down the Company’s deferred tax assets due to the enactment of the Tax Act in fourth quarter 2017. The Company estimates it will record income tax at an effective tax rate of approximately 23% in 2018.\nBalance Sheet and Asset Quality\nTotal assets were $4.4 billion at December 31, 2017, $145.7 million higher than September 30, 2017 and $375.4 million higher than December 31, 2016. Total loans at December 31, 2017 of $3.1 billion reflect growth of $502.3 million, or 19%, over December 31, 2016. Deposits totaled $3.3 billion at December 31, 2017, an increase of $408.5 million over December 31, 2016. Demand deposits increased $187.4 million year-over-year to $1.3 billion at December 31, 2017, representing 40% of total deposits.\nAsset quality measures remained solid, as non-performing assets, comprised exclusively of non-performing loans, were $7.0 million, or 0.16% of total assets, and 0.22% of total loans at December 31, 2017, compared to $1.2 million, or 0.03% of total assets, and 0.05% of total loans at December 31, 2016. Loans 30 to 89 days past due increased $1.5 million to $3.6 million at December 31, 2017, with $2.4 million representing acquired loans. Loans past due 90 days and still accruing at December 31, 2017 and 2016 were comprised of acquired loans of $1.8 million and $1.0 million, respectively.\nThe allowance for loan losses increased $5.8 million to $31.7 million at December 31, 2017 from $25.9 million as of December 31, 2016. The allowance as a percentage of loans was 1.02% at December 31, 2017, compared to 1.00% at December 31, 2016. The increase in the allowance for loan losses is primarily due to portfolio growth, and the impact of fourth quarter 2017 charge-offs and specific reserves.\nStockholders’ equity grew $21.2 million to $429.2 million at December 31, 2017, compared to $408.0 million at December 31, 2016. The growth reflects earnings, conversions of trust preferred securities to shares of common stock and the dividend reinvestment plan, partially offset by shareholders' dividends and a decrease in the fair value of available for sale investment securities. Tangible book value per share increased $0.63 to $16.14 at December 31, 2017, compared to $15.51 at December 31, 2016. The Company's capital ratios exceed all fully phased in capital requirements under the Basel III rules and the Bank remains classified as well capitalized.\nAbout Bridge Bancorp, Inc.\nBridge Bancorp, Inc. is a bank holding company engaged in commercial banking and financial services through its wholly owned subsidiary, BNB Bank, formerly known as The Bridgehampton National Bank. Established in 1910, BNB, with assets of approximately $4.4 billion, operates 44 retail branch locations serving Long Island and the greater New York metropolitan area. In addition, BNB operates one loan production office in Manhattan. Through its branch network and its electronic delivery channels, BNB provides deposit and loan products and financial services to local businesses, consumers and municipalities. Title insurance services are offered through BNB's wholly owned subsidiary, Bridge Abstract. Bridge Financial Services, Inc., a wholly owned subsidiary of BNB, offers financial planning and investment consultation. For more information visit www.bnbbank.com .\nBNB also has a rich tradition of involvement in the community, supporting programs and initiatives that promote local business, the environment, education, healthcare, social services and the arts.\nPlease see the attached tables for selected financial information.\nThis report may contain statements relating to the future results of the Company (including certain projections and business trends) that are considered “forward-looking statements” as defined in the Private Securities Litigation Reform Act of 1995 (the “PSLRA”). Such forward-looking statements, in addition to historical information, involve risk and uncertainties, and are based on the beliefs, assumptions and expectations of management of the Company. Words such as “expects,” “believes,” “should,” “plans,” “anticipates,” “will,” “potential,” “could,” “intend,” “may,” “outlook,” “predict,” “project,” “would,” “estimated,” “assumes,” “likely,” and variation of such similar expressions are intended to identify such forward-looking statements. Examples of forward-looking statements include, but are not limited to, possible or assumed estimates with respect to the financial condition, expected or anticipated revenue, and results of operations and business of the Company, including earnings growth; revenue growth in retail banking lending and other areas; origination volume in the consumer, commercial and other lending businesses; current and future capital management programs; non-interest income levels, including fees from the title abstract subsidiary and banking services as well as product sales; tangible capital generation; market share; expense levels; and other business operations and strategies. The Company claims the protection of the safe harbor for forward-looking statements contained in the PSLRA.\nFactors that could cause future results to vary from current management expectations include, but are not limited to, changing economic conditions; legislative and regulatory changes, including increases in FDIC insurance rates; monetary and fiscal policies of the federal government; changes in tax policies; rates and regulations of federal, state and local tax authorities; changes in interest rates; deposit flows; the cost of funds; demands for loan products; demand for financial services; competition; changes in the quality and composition of BNB’s loan and investment portfolios; changes in management’s business strategies; changes in accounting principles, policies or guidelines; changes in real estate values; an unexpected increase in operating costs; expanded regulatory requirements as a result of the Dodd-Frank Act; and other risk factors discussed elsewhere, and in our reports filed with the Securities and Exchange Commission. The forward-looking statements are made as of the date of this report, and the Company assumes no obligation to update the forward-looking statements or to update the reasons why actual results could differ from those projected in the forward-looking statements.\nContact: John M. McCaffery\nExecutive Vice President\nChief Financial Officer\n(631) 537-1001, ext. 7290\nBRIDGE BANCORP, INC. AND SUBSIDIARIES Condensed Consolidated Statements of Condition (unaudited) (In thousands, except per share amounts and financial ratios) December 31, September 30, December 31, 2017 2017 2016 ASSETS Cash and due from banks $ 76,614 $ 57,915 $ 102,280 Interest earning deposits with banks 18,133 29,038 11,558 Total cash and cash equivalents 94,747 86,953 113,838 Securities available for sale, at fair value 759,916 792,058 819,722 Securities held to maturity 180,866 189,603 223,237 Total securities 940,782 981,661 1,042,959 Securities, restricted 35,349 34,234 34,743 Loans held for investment 3,102,752 2,921,705 2,600,440 Allowance for loan losses (31,707 ) (29,273 ) (25,904 ) Loans, net 3,071,045 2,892,432 2,574,536 Premises and equipment, net 33,505 35,000 35,263 Goodwill and other intangible assets 111,164 111,170 111,774 Accrued interest receivable and other assets 143,410 142,828 141,457 Total assets $ 4,430,002 $ 4,284,278 $ 4,054,570 LIABILITIES AND STOCKHOLDERS' EQUITY Demand deposits $ 1,338,701 $ 1,194,819 $ 1,151,268 Savings, NOW and money market deposits 1,773,478 1,785,184 1,568,009 Certificates of deposit of $100,000 or more 158,584 159,511 126,198 Other time deposits 63,780 63,794 80,534 Total deposits 3,334,543 3,203,308 2,926,009 Federal funds purchased and repurchase agreements 50,877 50,846 100,674 Federal Home Loan Bank advances 501,374 476,674 496,684 Subordinated debentures, net 78,641 78,606 78,502 Junior subordinated debentures, net - - 15,244 Other liabilities and accrued expenses 35,367 32,905 29,470 Total liabilities 4,000,802 3,842,339 3,646,583 Total stockholders' equity 429,200 441,939 407,987 Total liabilities and stockholders' equity $ 4,430,002 $ 4,284,278 $ 4,054,570\nBRIDGE BANCORP, INC. AND SUBSIDIARIES Condensed Consolidated Statements of Income (unaudited) (In thousands, except per share amounts and financial ratios) Three Months Ended Year Ended Dec. 31, Sept. 30, Dec. 31, Dec. 31, Dec. 31, 2017 2017 2016 2017 2016 Interest income $ 39,960 $ 38,438 $ 34,615 $ 149,849 $ 137,716 Interest expense 6,399 6,093 4,450 22,689 16,845 Net interest income 33,561 32,345 30,165 127,160 120,871 Provision for loan losses 10,400 1,900 1,400 14,050 5,550 Net interest income after provision for loan losses 23,161 30,445 28,765 113,110 115,321 Non-interest income: Service charges and other fees 2,334 2,392 1,970 8,996 8,407 Title fee income 546 757 481 2,394 1,833 Net securities (losses) gains (222 ) 260 - 38 449 Gain on sale of Small Business Administration loans 247 100 427 1,689 1,097 BOLI income 560 563 571 2,250 1,929 Other operating income 1,034 900 299 2,735 2,331 Total non-interest income 4,499 4,972 3,748 18,102 16,046 Non-interest expense: Salaries and employee benefits 11,299 11,766 9,430 45,766 40,913 Occupancy and equipment 3,647 3,514 3,359 13,998 12,798 Restructuring costs 8,020 - - 8,020 - Acquisition costs - - (650 ) - (920 ) Amortization of other intangible assets 247 247 827 1,047 2,637 Other operating expenses 5,941 5,744 5,563 22,896 21,653 Total non-interest expense 29,154 21,271 18,529 91,727 77,081 (Loss) income before income taxes (1,494 ) 14,146 13,984 39,485 54,286 Income tax expense 5,422 4,703 4,824 18,946 18,795 Net (loss) income $ (6,916 ) $ 9,443 $ 9,160 $ 20,539 $ 35,491 Basic (loss) earnings per share $ (0.35 ) $ 0.48 $ 0.50 $ 1.04 $ 2.01 Diluted (loss) earnings per share $ (0.35 ) $ 0.48 $ 0.50 $ 1.04 $ 2.00 Weighted average common and equivalent shares 19,419 19,405 18,336 19,379 17,851\nBRIDGE BANCORP, INC. AND SUBSIDIARIES Consolidated Financial Highlights (unaudited) (In thousands, except per share amounts and financial ratios) Three Months Ended Year Ended Dec. 31, Sept. 30, Dec. 31, Dec. 31, Dec. 31, 2017 2017 2016 2017 2016 Selected Financial Data: Return on average total assets (0.63 )% 0.88 % 0.93 % 0.49 % 0.92 % Adjusted return on average total assets (1) 0.53 % 0.88 % 0.92 % 0.79 % 0.93 % Return on average stockholders' equity (6.07 )% 8.41 % 9.50 % 4.64 % 9.82 % Adjusted return on average stockholders' equity (1) 5.15 % 8.41 % 9.43 % 7.53 % 9.87 % Return on average tangible common equity (1) (2) (8.04 )% 11.21 % 13.43 % 6.21 % 14.21 % Adjusted return on average tangible common equity (1) (2) 7.01 % 11.40 % 13.60 % 10.28 % 14.57 % Net interest margin, tax equivalent basis (1) 3.36 % 3.33 % 3.41 % 3.34 % 3.48 % Adjusted net interest margin (1) 3.14 % 3.14 % 3.09 % 3.13 % 3.20 % Efficiency ratio 76.60 % 57.00 % 54.64 % 63.15 % 56.30 % Adjusted efficiency ratio (1) 54.08 % 56.22 % 53.57 % 56.39 % 54.92 % Operating expense/average assets 2.65 % 1.99 % 1.88 % 2.18 % 2.00 % Adjusted operating expense/average assets (1) 1.90 % 1.96 % 1.87 % 1.97 % 1.97 % (1) See reconciliation of this non-GAAP financial measure provided elsewhere herein. (2) Average tangible common equity represents a non-GAAP financial measure calculated as average total stockholders' equity less average goodwill and intangible assets. Dec. 31, 2017 Sept. 30, 2017 Dec. 31, 2016 Selected Financial Data: Book value per share $ 21.78 $ 22.43 $ 21.36 Tangible book value per share (1) $ 16.14 $ 16.78 $ 15.51 Common shares outstanding 19,709 19,707 19,100 Capital Ratios: Total capital to risk weighted assets 13.3 % 14.2 % 15.0 % Tier 1 capital to risk weighted assets 10.0 % 10.8 % 11.3 % Common equity Tier 1 capital to risk weighted assets 10.0 % 10.8 % 10.8 % Tier 1 capital to average assets 7.9 % 8.3 % 8.6 % Tangible common equity to tangible assets (1) (2) 7.4 % 7.9 % 7.5 % Tier 1 capital to average assets (Bank) 9.6 % 9.9 % 9.9 % Asset Quality: Loans 30-89 days past due $ 3,614 $ 3,755 $ 2,156 Loans 90 days past due and accruing (3) $ 1,834 $ 2,444 $ 1,027 Non-performing loans $ 6,955 $ 7,451 $ 1,241 Non-performing assets $ 6,955 $ 7,451 $ 1,241 Non-performing loans/total loans 0.22 % 0.26 % 0.05 % Non-performing assets/total assets 0.16 % 0.17 % 0.03 % Allowance/non-performing loans 455.89 % 392.87 % 2087.35 % Allowance/total loans 1.02 % 1.00 % 1.00 % (1) Tangible common equity represents a non-GAAP financial measure calculated as total stockholders' equity less goodwill and intangible assets. (2) Tangible assets represents a non-GAAP financial measure calculated as total assets less goodwill and intangible assets. (3) Represents loans acquired in connection with the Community National Bank, FNBNY Bancorp, Inc., and Hamptons State Bank acquisitions.\nBRIDGE BANCORP, INC. AND SUBSIDIARIES Supplemental Financial Information Condensed Consolidated Average Balance Sheets And Average Rate Data (unaudited) (Dollars in thousands) Three Months Ended December 31, Three Months Ended September 30, Three Months Ended December 31, 2017 2017 2016 Average Average Average Average Yield/ Average Yield/ Average Yield/ Balance Interest Cost Balance Interest Cost Balance Interest Cost Interest earning assets: Loans, net (including loan fee income) (1) $ 2,984,476 $ 34,309 4.56 % $ 2,817,775 $ 32,667 4.60 % $ 2,551,589 $ 29,691 4.63 % Securities (1) 997,762 5,918 2.35 % 1,050,811 6,019 2.27 % 987,195 5,236 2.11 % Deposits with banks 21,638 70 1.28 % 26,243 91 1.38 % 23,735 32 0.54 % Total interest earning assets (1) 4,003,876 40,297 3.99 % 3,894,829 38,777 3.95 % 3,562,519 34,959 3.90 % Non interest earning assets: Other assets 359,460 354,215 350,803 Total assets $ 4,363,336 $ 4,249,044 $ 3,913,322 Interest bearing liabilities: Deposits $ 1,996,584 $ 3,044 0.60 % $ 1,977,119 $ 2,852 0.57 % $ 1,792,260 $ 1,913 0.42 % Federal funds purchased and repurchase agreements 142,923 498 1.38 % 118,499 402 1.35 % 179,307 296 0.66 % Federal Home Loan Bank advances 401,155 1,723 1.70 % 398,234 1,704 1.70 % 307,669 768 0.99 % Subordinated debentures 78,618 1,134 5.72 % 78,583 1,135 5.73 % 78,479 1,135 5.75 % Junior subordinated debentures - - - - - - 15,334 338 8.77 % Total interest bearing liabilities 2,619,280 6,399 0.97 % 2,572,435 6,093 0.94 % 2,373,049 4,450 0.75 % Non interest bearing liabilities: Demand deposits 1,255,110 1,196,179 1,122,378 Other liabilities 36,689 34,875 34,238 Total liabilities 3,911,079 3,803,489 3,529,665 Stockholders' equity 452,257 445,555 383,657 Total liabilities and stockholders' equity $ 4,363,336 $ 4,249,044 $ 3,913,322 Net interest income/interest rate spread (1) 33,898 3.02 % 32,684 3.01 % 30,509 3.15 % Net interest earning assets/net interest margin (1) $ 1,384,596 3.36 % $ 1,322,394 3.33 % $ 1,189,470 3.41 % Tax equivalent adjustment (337 ) (0.03 )% (339 ) (0.04 )% (344 ) (0.04 )% Net interest income/net interest margin $ 33,561 3.33 % $ 32,345 3.29 % $ 30,165 3.37 % (1) Presented on a non-GAAP tax equivalent basis.\nBRIDGE BANCORP, INC. AND SUBSIDIARIES Supplemental Financial Information Condensed Consolidated Average Balance Sheets And Average Rate Data (unaudited) (Dollars in thousands) Year Ended December 31, 2017 2016 Average Average Average Yield/ Average Yield/ Balance Interest Cost Balance Interest Cost Interest Earning Assets: Loans, net (including loan fee income) (1) $ 2,774,422 $ 126,802 4.57 % $ 2,494,750 $ 117,114 4.69 % Securities (1) 1,048,033 24,140 2.30 % 984,625 21,785 2.21 % Deposits with banks 24,554 278 1.13 % 29,054 147 0.51 % Total interest earning assets (1) 3,847,009 151,220 3.93 % 3,508,429 139,046 3.96 % Non interest earning assets: Other assets 354,019 341,131 Total assets $ 4,201,028 $ 3,849,560 Interest bearing liabilities: Deposits $ 1,937,445 $ 10,426 0.54 % $ 1,808,904 $ 6,866 0.38 % Federal funds purchased and repurchase agreements 132,514 1,571 1.19 % 162,118 1,075 0.66 % Federal Home Loan Bank advances 401,258 6,105 1.52 % 275,591 3,001 1.09 % Subordinated debentures 78,566 4,539 5.78 % 78,427 4,539 5.79 % Junior subordinated debentures 668 48 7.19 % 15,620 1,364 8.73 % Total interest bearing liabilities 2,550,451 22,689 0.89 % 2,340,660 16,845 0.72 % Non interest bearing liabilities: Demand deposits 1,174,840 1,110,824 Other liabilities 33,465 36,839 Total liabilities 3,758,756 3,488,323 Stockholders' equity 442,272 361,237 Total liabilities and stockholders' equity $ 4,201,028 $ 3,849,560 Net interest income/interest rate spread (1) 128,531 3.04 % 122,201 3.24 % Net interest earning assets/net interest margin (1) $ 1,296,558 3.34 % $ 1,167,769 3.48 % Tax equivalent adjustment (1,371 ) (0.03 )% (1,330 ) (0.03 )% Net interest income/net interest margin $ 127,160 3.31 % $ 120,871 3.45 % (1) Presented on a non-GAAP tax equivalent basis.\nBRIDGE BANCORP, INC. AND SUBSIDIARIES Non-GAAP Financial Measures (unaudited) Reconciliation of as reported (GAAP) and non-GAAP financial measures The tables below provide a reconciliation of generally accepted accounting principles (\"GAAP\") (as reported) and non-GAAP financial measures. A non-GAAP financial measure is a numerical measure of historical or future financial performance, financial position or cash flows that excludes or includes amounts that are required to be disclosed in the most directly comparable measure calculated and presented in accordance with GAAP in the United States. The Company’s management believes the presentation of non-GAAP financial measures provide investors with a greater understanding of the Company’s operating results in addition to the results measured in accordance with GAAP. While management uses these non-GAAP measures in its analysis of the Company’s performance, this information should not be viewed as a substitute for financial results determined in accordance with GAAP, or considered to be more important than financial results determined in accordance with GAAP. Three Months Ended Year Ended Dec. 31, Sept. 30, Dec. 31, Dec. 31, Dec. 31, 2017 2017 2016 2017 2016 Return on average total assets - as reported (0.63 )% 0.88 % 0.93 % 0.49 % 0.92 % Restructuring costs 0.73 % 0.00 % 0.00 % 0.19 % 0.00 % Acquisition costs 0.00 % 0.00 % (0.07 )% 0.00 % (0.02 )% Amortization of non compete agreement 0.00 % 0.00 % 0.06 % 0.00 % 0.04 % Measurement period fixed asset adjustment (1) 0.00 % 0.00 % 0.00 % 0.00 % (0.01 )% Income tax effect of adjustments above (0.26 )% 0.00 % 0.00 % (0.07 )% 0.00 % Deferred tax asset re-measurement 0.69 % 0.00 % 0.00 % 0.18 % 0.00 % Adjusted return on average total assets (non-GAAP) 0.53 % 0.88 % 0.92 % 0.79 % 0.93 % Return on average stockholders' equity - as reported (6.07 )% 8.41 % 9.50 % 4.64 % 9.82 % Restructuring costs 7.04 % 0.00 % 0.00 % 1.81 % 0.00 % Acquisition costs 0.00 % 0.00 % (0.67 )% 0.00 % (0.25 )% Amortization of non compete agreement 0.00 % 0.00 % 0.57 % 0.00 % 0.40 % Measurement period fixed asset adjustment (1) 0.00 % 0.00 % 0.00 % 0.00 % (0.09 )% Income tax effect of adjustments above (2.46 )% 0.00 % 0.03 % (0.63 )% (0.01 )% Deferred tax asset re-measurement 6.64 % 0.00 % 0.00 % 1.71 % 0.00 % Adjusted return on average stockholders' equity (non-GAAP) 5.15 % 8.41 % 9.43 % 7.53 % 9.87 % Return on average tangible common equity - as reported (8.04 )% 11.21 % 13.43 % 6.21 % 14.21 % Restructuring costs 9.32 % 0.00 % 0.00 % 2.42 % 0.00 % Acquisition costs 0.00 % 0.00 % (0.95 )% 0.00 % (0.37 )% Amortization of other intangible assets 0.29 % 0.29 % 1.21 % 0.32 % 1.06 % Measurement period fixed asset adjustment (1) 0.00 % 0.00 % 0.00 % 0.00 % (0.12 )% Income tax effect of adjustments above (3.36 )% (0.10 )% (0.09 )% (0.96 )% (0.21 )% Deferred tax asset re-measurement 8.80 % 0.00 % 0.00 % 2.29 % 0.00 % Adjusted return on average tangible common equity (non-GAAP) 7.01 % 11.40 % 13.60 % 10.28 % 14.57 % (1) A fixed asset measurement period adjustment for $0.3 million was recorded in 2016 related to the recovery of depreciation expense recorded in 2015.\nBRIDGE BANCORP, INC. AND SUBSIDIARIES Non-GAAP Financial Measures (unaudited) The following table presents a reconciliation of net (loss) income and diluted (loss) earnings per share (as reported) to adjusted net income and adjusted diluted earnings per share excluding restructuring costs, acquisition costs, amortization of non compete agreement, measurement period fixed asset adjustment and deferred tax asset remeasurement : Three Months Ended Year Ended Dec. 31, Sept. 30, Dec. 31, Dec. 31, Dec. 31, (Dollars in thousands, except per share amounts) 2017 2017 2016 2017 2016 Net (loss) income - as reported $ (6,916 ) $ 9,443 $ 9,160 $ 20,539 $ 35,491 Adjustments: Restructuring costs 8,020 - - 8,020 - Acquisition costs - - (650 ) - (920 ) Amortization of non compete agreement - - 547 - 1,459 Measurement period fixed asset adjustment (1) - - - - (309 ) Income tax effect of adjustments above (2,807 ) - 36 (2,807 ) (80 ) Deferred tax asset remeasurement 7,572 - - 7,572 - Adjusted net income (non-GAAP) $ 5,869 $ 9,443 $ 9,093 $ 33,324 $ 35,641 Diluted (loss) earnings per share - as reported $ (0.35 ) $ 0.48 $ 0.50 $ 1.04 $ 2.00 Adjustments: Restructuring costs 0.40 - - 0.40 - Acquisition costs - - (0.03 ) - (0.05 ) Amortization of non compete agreement - - 0.03 - 0.08 Measurement period fixed asset adjustment (1) - - - - (0.02 ) Income tax effect of adjustments above (0.14 ) - - (0.15 ) (0.01 ) Deferred tax asset remeasurement 0.39 - - 0.39 - Adjusted diluted earnings per share (non-GAAP) $ 0.30 $ 0.48 $ 0.50 $ 1.68 $ 2.00 The following table presents a reconciliation of efficiency ratio (as reported) and adjusted efficiency ratio (non-GAAP) : Efficiency ratio - as reported 76.60 % 57.00 % 54.64 % 63.15 % 56.30 % Non-interest expense - as reported $ 29,154 $ 21,271 $ 18,529 $ 91,727 $ 77,081 Less: Restructuring costs (8,020 ) - - (8,020 ) - Less: Acquisition costs - - 650 - 920 Less: Amortization of intangible assets (247 ) (247 ) (827 ) (1,047 ) (2,637 ) Less: Measurement period fixed asset adjustment (1) - - - - 309 Adjusted non-interest expense (non-GAAP) $ 20,887 $ 21,024 $ 18,352 $ 82,660 $ 75,673 Net interest income - as reported $ 33,561 $ 32,345 $ 30,165 $ 127,160 $ 120,871 Tax equivalent adjustment 337 339 344 1,371 1,330 Net interest income, tax-equivalent basis (non-GAAP) $ 33,898 $ 32,684 $ 30,509 $ 128,531 $ 122,201 Non-interest income - as reported $ 4,499 $ 4,972 $ 3,748 $ 18,102 $ 16,046 Less: Net securities losses (gains) 222 (260 ) - (38 ) (449 ) Adjusted non-interest income (non-GAAP) $ 4,721 $ 4,712 $ 3,748 $ 18,064 $ 15,597 Adjusted total revenues for adjusted efficiency ratio (non-GAAP) $ 38,619 $ 37,396 $ 34,257 $ 146,595 $ 137,798 Adjusted efficiency ratio (non-GAAP) (2) 54.08 % 56.22 % 53.57 % 56.39 % 54.92 % The following table presents a reconciliation of operating expense as a percentage of average assets (as reported) and adjusted operating expense as a percentage of average assets (non-GAAP) : Three Months Ended Year Ended Dec. 31, Sept. 30, Dec. 31, Dec. 31, Dec. 31, 2017 2017 2016 2017 2016 Operating expense as a % of average assets - as reported 2.65 % 1.99 % 1.88 % 2.18 % 2.00 % Restructuring costs (0.73 )% 0.00 % 0.00 % (0.19 )% 0.00 % Acquisition costs 0.00 % 0.00 % 0.07 % 0.00 % 0.02 % Amortization of other intangible assets (0.02 )% (0.03 )% (0.08 )% (0.02 )% (0.06 )% Measurement period fixed asset adjustment (1) 0.00 % 0.00 % 0.00 % 0.00 % 0.01 % Adjusted operating expense as a % of average assets (non-GAAP) 1.90 % 1.96 % 1.87 % 1.97 % 1.97 % (1) A fixed asset measurement period adjustment for $0.3 million was recorded in 2016 related to the recovery of depreciation expense recorded in 2015. (2) Adjusted efficiency ratio is calculated by dividing adjusted non-interest expense by the sum of net interest income on a tax-equivalent basis and adjusted non-interest income.\nBRIDGE BANCORP, INC. AND SUBSIDIARIES Non-GAAP Financial Measures (unaudited) The following table reconciles net interest margin (as reported) to adjusted net interest margin on a tax equivalent basis, excluding accretion income and average purchase accounting adjustments on acquired loans (non-GAAP) : Three Months Ended Year Ended Dec. 31, Sept. 30, Dec. 31, Dec. 31, Dec. 31, (Dollars in thousands) 2017 2017 2016 2017 2016 Net interest income - as reported $ 33,561 $ 32,345 $ 30,165 $ 127,160 $ 120,871 Tax equivalent adjustment 337 339 344 1,371 1,330 Net interest income, tax-equivalent basis (non-GAAP) $ 33,898 $ 32,684 $ 30,509 $ 128,531 $ 122,201 Adjustment: Less: Accretion income on acquired loans (2,072 ) (1,738 ) (2,579 ) (7,558 ) (9,050 ) Adjusted net interest income, tax-equivalent basis (non-GAAP) $ 31,826 $ 30,946 $ 27,930 $ 120,973 $ 113,151 Average interest earning assets - as reported $ 4,003,876 $ 3,894,829 $ 3,562,519 $ 3,847,009 $ 3,508,429 Adjustment: Average purchase accounting adjustments on acquired loans 14,309 16,077 21,828 16,716 24,792 Adjusted average interest earning assets (non-GAAP) $ 4,018,185 $ 3,910,906 $ 3,584,347 $ 3,863,725 $ 3,533,221 Net interest margin - as reported (1) 3.33 % 3.29 % 3.37 % 3.31 % 3.45 % Tax equivalent adjustment 0.03 % 0.04 % 0.04 % 0.03 % 0.03 % Net interest margin, tax-equivalent basis (non-GAAP) (2) 3.36 % 3.33 % 3.41 % 3.34 % 3.48 % Adjustment: Purchase accounting adjustments on acquired loans (0.22 )% (0.19 )% (0.32 )% (0.21 )% (0.28 )% Adjusted net interest margin (non-GAAP) (3) 3.14 % 3.14 % 3.09 % 3.13 % 3.20 % (1) Net interest margin represents net interest income divided by average interest earning assets. (2) Net interest margin, tax equivalent basis represents net interest income on a tax equivalent basis divided by average interest earning assets. (3) Adjusted net interest margin represents adjusted net interest income, tax equivalent basis divided by adjusted average interest earning assets. The following table presents the tangible common equity to tangible assets calculation (non-GAAP) : Dec. 31, Sept. 30, Dec. 31, (Dollars in thousands) 2017 2017 2016 Total assets - as reported $ 4,430,002 $ 4,284,278 $ 4,054,570 Less: Goodwill and other intangible assets - as reported (111,164 ) (111,170 ) (111,774 ) Tangible assets (non-GAAP) $ 4,318,838 $ 4,173,108 $ 3,942,796 Total stockholders' equity - as reported $ 429,200 $ 441,939 $ 407,987 Less: Goodwill and other intangible assets - as reported (111,164 ) (111,170 ) (111,774 ) Tangible common equity (non-GAAP) $ 318,036 $ 330,769 $ 296,213 Tangible common equity to tangible assets (non-GAAP) (1) 7.4 % 7.9 % 7.5 % (1) Calculated by dividing tangible common equity by tangible assets.\nSource:Bridge Bancorp, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/7a084bed-f047-4819-a0e3-d571505613cc"], "published": "2018-01-30T00:15:00.000+02:00", "crawled": "2018-01-30T03:39:38.003+02:00", "highlightTitle": ""}