{"organizations": [], "uuid": "de3aec3af523ab2d6d901abed186ffcd4cf93f98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-godaddy-to-acquire-main-street-hub-to-help-small-businesses-boost-social-media-engagement.html", "country": "US", "domain_rank": 767, "title": "GoDaddy To Acquire Main Street Hub To Help Small Businesses Boost Social Media Engagement", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T00:05:00.000+02:00", "replies_count": 0, "uuid": "de3aec3af523ab2d6d901abed186ffcd4cf93f98"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-godaddy-to-acquire-main-street-hub-to-help-small-businesses-boost-social-media-engagement.html", "ord_in_thread": 0, "title": "GoDaddy To Acquire Main Street Hub To Help Small Businesses Boost Social Media Engagement", "locations": [], "entities": {"persons": [], "locations": [{"name": "scottsdale", "sentiment": "none"}, {"name": "ariz.", "sentiment": "none"}], "organizations": [{"name": "godaddy inc.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "godaddy", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SCOTTSDALE, Ariz., Jan. 23, 2018 /PRNewswire/ -- GoDaddy Inc. (NYSE: GDDY), the world's largest cloud platform dedicated to small, independent ventures, today announced it has entered into a definitive agreement to acquire Main Street Hub for approximately $125 million in cash plus up to $50 million in potential future earnouts. The transaction has been approved by the GoDaddy board of directors and is expected to close late in the second quarter of 2018, subject to customary regulatory and other closing requirements. GoDaddy is not changing its previously issued 2018 guidance in connection with the announced acquisition of Main Street Hub.\nMain Street Hub provides small businesses with a complete \"do-it-for-me\" service for managing engagement on the most popular social networks. Main Street Hub combines dedicated teams of branding experts – photographers, writers, designers, marketers – with proprietary technology to manage activity on Facebook, Instagram, Twitter, and Yelp, among others, to help small businesses acquire new customers and build stronger relationships with existing customers. Today, more than 10,000 small businesses rely on Main Street Hub to optimize their social media engagement.\nThe acquisition furthers GoDaddy's professional services strategy for small business owners who prefer to have dedicated experts build their online presence and manage it for them to accelerate growth and achieve their goals. GoDaddy will offer customers a complete suite of \"do-it-for-me\" capabilities for building a powerful online presence that can be delivered by either GoDaddy small business experts or, for more advanced features and functionality, GoDaddy's community of web professionals.\n\"GoDaddy's 17 million small business customers come to us because they know their online presence can help them reach their customers and grow their businesses, but even with the right tools, customers struggle to find the time or know-how to effectively manage their social media presence,\" said Lauren Antonoff, Senior Vice President of Presence and Commerce, GoDaddy. \"Joining forces with Main Street Hub better enables us to help our customers reach their goals, while saving them time and offering peace of mind.\"\n\"Main Street Hub and GoDaddy both share the same unrelenting passion for helping small businesses succeed,\" said Matt Stuart, co-CEO and co-founder, Main Street Hub. \"We complement each other strategically, culturally and across our products and services. We now have the scale and resources to help millions more business owners realize the value of having an optimized social media presence – our team can't wait to get started.\"\nMain Street Hub co-CEOs and co-founders Matt Stuart and Andrew Allison will join GoDaddy in leadership positions within GoDaddy's Presence and Commerce business unit.\nGoDaddy will maintain Main Street Hub's offices in Austin, Texas.\nForward-Looking Statements\nThis press release contains forward-looking statements which are subject to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These statements are based on information and estimates available to us at the time of this press release and are not guarantees of future performance. Statements which may be considered forward-looking within the meaning of the U.S. federal securities laws include statements regarding the acquisition of Main Street Hub, the time frame in which this will occur, the expected benefits to GoDaddy from completing the acquisition, including benefits to customers and the introduction of new features and solutions and any statements regarding future financial results. These statements are subject to known and unknown risks, uncertainties and other factors that may cause our actual results, performance or achievements to differ materially from results expressed or implied in this press release. Such risk factors include those related to: required regulatory approvals and the satisfaction of other closing conditions; the potential impact on the businesses of GoDaddy and Main Street Hub due to uncertainties regarding the acquisition; the retention of customers and employees of Main Street Hub and the ability of GoDaddy to successfully integrate Main Street Hub and to achieve expected benefits; general economic conditions; and the timing and market acceptance of new features and solutions and the degree to which these features and solutions gain market acceptance. Actual results may differ materially from those contained in the forward-looking statements in this press release.\nAdditional risks and uncertainties that could affect GoDaddy's financial results are included in the other filings we make with the SEC from time to time, including the risks described under the captions \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations,\" in the Company's Annual Report on Form 10-K for the year ended December 31, 2016 and the risk factors described the Company's Current Report on Form 8-K filed May 3, 2017, which are available on the Company's website at https://investors.godaddy.net and on the SEC's website at www.sec.gov . Additional information will also be set forth in other filings that the Company makes with the SEC from time to time. All forward-looking statements in this press release are based on information available to the Company as of the date hereof. GoDaddy does not assume any obligation to update the forward-looking statements provided to reflect events that occur or circumstances that exist after the date on which they were made.\nAbout GoDaddy\nGoDaddy powers the world's largest cloud platform dedicated to small, independent ventures. With more than 17 million customers worldwide and nearly 73 million domain names under management, GoDaddy is the place people come to name their idea, build a professional website, attract customers and manage their work. Our mission is to give our customers the tools, insights and the people to transform their ideas and personal initiative into success.\nSource: GoDaddy Inc.\nView original content with multimedia:", "external_links": [], "published": "2018-01-24T00:05:00.000+02:00", "crawled": "2018-01-24T00:56:55.000+02:00", "highlightTitle": ""}