{"organizations": [], "uuid": "6ad10d4007838635a88c5773c82b9d577b2d1ee8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/22/104726108-RTX3H4OM-tim-cook-apple.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/apple-amazon-and-nvidia-could-drive-the-market-to-more-records.html", "country": "US", "domain_rank": 767, "title": "Apple, Amazon and Nvidia could drive the market to more records", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-04T19:29:00.000+02:00", "replies_count": 0, "uuid": "6ad10d4007838635a88c5773c82b9d577b2d1ee8"}, "author": "Heidi Chung", "url": "https://www.cnbc.com/2018/01/04/apple-amazon-and-nvidia-could-drive-the-market-to-more-records.html", "ord_in_thread": 0, "title": "Apple, Amazon and Nvidia could drive the market to more records", "locations": [], "entities": {"persons": [{"name": "rich ross", "sentiment": "none"}, {"name": "ross", "sentiment": "none"}], "locations": [{"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "nvidia", "sentiment": "negative"}, {"name": "evercore isi", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The major indexes are soaring to record highs to start the year and breaching major milestones. The Dow soared past 25,000, the S&P 500 cracked 2,700 and the Nasdaq closed above 7,000 for the first time ever.\nAs tech continues to drive the market, one technician has three mega-cap tech stocks that could pave the way to more record highs.\n\"The calendar has changed, but the game remains the same. The name of the game is to buy big-cap technology,\" Rich Ross, head of technical analysis at Evercore ISI, said Wednesday on CNBC's \" Trading Nation .\"\nFirst, Ross looked at the best-performing stock over the last 12 months: Nvidia .\nThe chip rip Shares of Nvidia, which have more than doubled in the last 12 months, are trading within a hair of their all-time high, and Ross says the charts show that the stock is poised for an explosive breakout.\n\"We set it up last week ... you had a 15 percent pullback, but importantly, now we have tested and held key support [above the 100-day moving average].\"\nFurthermore, Ross said that Nvidia's chart has formed a strong base of support for about one month, and on Wednesday, the stock jumped more than 6 percent and claimed the key 50-day moving average.\n\"That has set Nvidia up for a breakout to a new high here ... we're talking about $250 with potential upside to $300 over time,\" Ross said.\nNvidia stock is trading about 2 percent from its all-time high.\nKing of the jungle Next, Ross pointed to Amazon .\nLooking at a chart of the e-commerce giant, Ross illustrated that the stock has formed a bull-flag continuation pattern. Bull-flag patterns are often looked at by technicians as a bullish sign of a continued uptrend. \"I think the stock gets up to $1,250 and as high as $1,400.\"\nShares of Amazon hit an all-time high Thursday and were trading in the $1,208.50 range at midday.\nThe big Apple \"Finally, we finish with the big boy here. I'm still beating the drum here for Apple ,\" Ross said.\nAccording to Ross, the stock has set up for a big breakout with a multibase of support and has also formed a bull-flag pattern. \"Buy this stock in anticipation of earnings in the first week of February.\"\n\"I think this stock breaks out here and tests that $195, $200 [level], and that gets you to that trillion-dollar market cap,\" he added.\nAnalysts polled by FactSet are expecting Apple to report earnings of $3.78 per share on $86 billion in revenue.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nDisclaimer", "external_links": [], "published": "2018-01-04T19:29:00.000+02:00", "crawled": "2018-01-04T19:30:49.013+02:00", "highlightTitle": ""}