{"organizations": [], "uuid": "d50258520f7d0a120ba758b331b456f96c7a3a92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218862160&w=1200&r=LYNXMPEE010TM", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-congo-protests/congos-top-catholic-slams-states-barbarism-after-deadly-protests-idUSKBN1ER1IW", "country": "US", "domain_rank": 408, "title": "Congo's top Catholic slams state's 'barbarism' after deadly protests", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T20:25:00.000+02:00", "replies_count": 0, "uuid": "d50258520f7d0a120ba758b331b456f96c7a3a92"}, "author": "", "url": "https://www.reuters.com/article/us-congo-protests/congos-top-catholic-slams-states-barbarism-after-deadly-protests-idUSKBN1ER1IW", "ord_in_thread": 0, "title": "Congo's top Catholic slams state's 'barbarism' after deadly protests", "locations": [], "entities": {"persons": [{"name": "laurent monsengwo", "sentiment": "none"}, {"name": "ligodi", "sentiment": "none"}, {"name": "kabila", "sentiment": "none"}, {"name": "amedee mwarabu", "sentiment": "none"}, {"name": "pierrot mwanamputu", "sentiment": "none"}, {"name": "joseph kabila", "sentiment": "none"}], "locations": [{"name": "congo", "sentiment": "none"}, {"name": "kinshasa", "sentiment": "none"}, {"name": "democratic republic of congo", "sentiment": "none"}, {"name": "kinshasa", "sentiment": "none"}], "organizations": [{"name": "catholic", "sentiment": "negative"}, {"name": "roman catholic church", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 6:26 PM / Updated an hour ago Congo's top Catholic slams state's 'barbarism' after deadly protests Patient Ligodi , Amedee Mwarabu 3 Min Read \nKINSHASA (Reuters) - The head of the Roman Catholic Church in Congo on Tuesday condemned a crackdown on protests against President Joseph Kabila as “barbarism”, escalating a confrontation between the government and one of the country’s most powerful institutions. \nSecurity forces in Democratic Republic of Congo killed at least seven people in the capital, Kinshasa, on Sunday during demonstrations that Catholic activists organized to protest Kabila’s refusal to step down from office, according to the United Nations. \nPolice spokesman Pierrot Mwanamputu, however, said on Tuesday that five people, including one police officer, had died in Sunday’s violence and that the police had acted justifiably in each case against militants and gangsters. \nIn a rare appearance before the media, Cardinal Laurent Monsengwo, wearing a red prayer cap and gold cross, accused security forces of opening fire on peaceful protesters and desecrating places of worship. \n“We can only denounce, condemn and stigmatize the actions of the supposedly valiant men in uniform, which are, unfortunately, nothing more, nothing less than barbarism,” Monsengwo told reporters in the capital Kinshasa. \n“How can we trust leaders incapable of protecting the population, of guaranteeing peace, justice and love of people?” he said. \nThe Catholic Church is one of the few institutions in Congo to enjoy broad credibility. Some 40 percent of the population identifies as Catholic and the Church has long filled voids in education, healthcare and other services left by an absent state. \nIts bishops have frequently spoken out against human rights abuses by the government and alleged plans by Kabila to remove term limits that forbid him to run for re-election. \nHowever, it reverted to a more neutral posture as Kabila’s mandate expired in December 2016 in order to broker a deal between the ruling coalition and opposition leaders. \nUnder the Dec. 31 agreement, Kabila was permitted to stay in office beyond the expiry of his mandate but required to step down after an election to be held in 2017. \nInstead, Congo’s electoral commission said later that the election could not be organized until December 2018, reviving suspicions that Kabila intends to cling to power. Kabila denies those charges and blames the delays on a slow voter registration process. \nDozens have died in protests over Kabila’s future in the past two years and militia violence across the country has also risen, stoking fears the country will slide back into the kind of civil war that killed millions at the turn of the century. Writing by Aaron Ross, editing by Larry King", "external_links": [], "published": "2018-01-02T20:25:00.000+02:00", "crawled": "2018-01-02T20:39:27.012+02:00", "highlightTitle": ""}