{"organizations": [], "uuid": "cdf5c371acebbe2ae5dabb5fb3e26e470e34993a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-dst-systems-inc-announces-notification-of-fourth-quarter-2017-earnings-release-date.html", "country": "US", "domain_rank": 767, "title": "DST Systems, Inc. Notification Of Fourth Quarter 2017 Earnings Release Date", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:06:00.000+02:00", "replies_count": 0, "uuid": "cdf5c371acebbe2ae5dabb5fb3e26e470e34993a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-dst-systems-inc-announces-notification-of-fourth-quarter-2017-earnings-release-date.html", "ord_in_thread": 0, "title": "DST Systems, Inc. Notification Of Fourth Quarter 2017 Earnings Release Date", "locations": [], "entities": {"persons": [], "locations": [{"name": "kansas city", "sentiment": "none"}, {"name": "mo.", "sentiment": "none"}], "organizations": [{"name": "dst", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "dst systems, inc", "sentiment": "neutral"}, {"name": "dst systems, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "dst systems dst systems, inc.", "sentiment": "none"}, {"name": "ss&c technologies, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KANSAS CITY, Mo., Jan. 24, 2018 /PRNewswire/ -- DST Systems, Inc. (NYSE: DST) will release its financial results for the fourth quarter ended December 31, 2017 before markets open on Monday, January 29, 2018.\nAs previously announced, DST entered into an agreement to be acquired by SS&C Technologies, Inc. for $84 per share in cash. The Company expects to complete the transaction by the third quarter 2018, subject to regulatory approvals and other customary closing conditions. Due to the pending transaction, the Company will not be hosting a conference call to discuss its results.\nAbout DST Systems\nDST Systems, Inc. is a leading provider of specialized technology, strategic advisory, and business operations outsourcing to the financial and healthcare industries. We assist clients in transforming complexity into strategic advantage by providing tools and services to help them stay ahead of and capitalize on ever-changing customer, business and regulatory requirements in the world's most demanding industries. For more information, visit the DST website at www.dstsystems.com .\nContact:\nGregg Wm. Givens\nSenior Vice President, Chief Financial Officer and Treasurer\nDST Systems, Inc.\n333 West 11 th Street\nKansas City, MO 64105-1594\n+1 816 435 5503\nLegend for Rule 14a-12 Soliciting Material Filings\nImportant Additional Information and Where to Find It\nIn connection with the proposed merger, DST Systems, Inc. (the \"Company\") intends to file relevant materials Commission (the \"SEC\"), including a preliminary proxy statement on Schedule 14A. Following the filing of the definitive proxy statement with the SEC, the Company will mail the definitive proxy statement and a proxy card to each stockholder entitled to vote at the special meeting relating to the proposed merger. STOCKHOLDERS ARE URGED TO CAREFULLY READ THESE MATERIALS IN THEIR ENTIRETY (INCLUDING ANY AMENDMENTS OR SUPPLEMENTS THERETO) AND ANY OTHER RELEVANT DOCUMENTS THAT THE COMPANY WILL FILE WITH THE SEC WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION. The proxy statement and other relevant materials (when available), and any and all documents filed by the Company with the SEC, may be obtained for free at the SEC's website at www.sec.gov . In addition, stockholders may obtain free copies of the documents filed with the SEC by the Company via the Company's Investor Relations section of its website at www.dstsystems.com or by contacting Investor Relations by directing a request to the Company, Attention: Investor Relations.\nParticipants in the Merger Solicitation\nThis document does not constitute a solicitation of proxy, an offer to purchase or a solicitation of an offer to sell any securities, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. No offer of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the Securities Act of 1933, as amended. the Company, its directors, executive officers and certain employees may be deemed to be participants in the solicitation of proxies from the stockholders of the Company in connection with the proposed merger. Information about the persons who may, under the rules of the SEC, be considered to be participants in the solicitation of the Company's stockholders in connection with the proposed merger, and any interest they have in the proposed merger, will be set forth in the definitive proxy statement when it is filed with the SEC. Additional information regarding these individuals is set forth in the Company's proxy statement for its 2017 Annual Meeting of Stockholders, which was filed with the SEC on March 24, 2017, and its Annual Report on Form 10-K for the fiscal year ended December 31, 2016, which was filed with the SEC on February 28, 2017. These documents may be obtained for free at the SEC's website at www.sec.gov , and via the Company's Investor Relations section of its website at www.dstsystems.com .\nCautionary Statement Regarding Forward-Looking Statements\nThis document may include \"forward-looking\" statements within the meaning of the Private 1995, including, without limitation, statements relating to the completion of the merger. In this context, often address expected future business and financial performance and financial condition, and often contain words such as \"expect,\" \"anticipate,\" \"intend,\" \"plan,\" \"believe,\" \"seek,\" \"see,\" \"will,\" \"would,\" \"target,\" similar expressions, and variations or negatives of these words. Forward-looking statements by their nature address matters that are, to different degrees, uncertain, such as statements about the consummation of the proposed merger and the anticipated benefits thereof. These and other are not guarantees of future results and are subject to risks, uncertainties and assumptions that could cause actual results to differ materially from those expressed in any , including the failure to consummate the proposed merger or to make any filing or take other action required to consummate such merger in a timely matter or at all. The inclusion of such statements should not be regarded as a representation that any plans, estimates or expectations will be achieved. You should not place undue reliance on such statements. Important factors that could cause actual results to differ materially from such plans, estimates or expectations include, among others, that: (1) the Company may be unable to obtain stockholder approval as required for the merger; (2) conditions to the closing of the merger, including obtaining required regulatory approvals, may not be satisfied or waived on a timely basis or otherwise; (3) a governmental entity or a regulatory body may prohibit, delay or refuse to grant approval for the consummation of the merger and may require conditions, limitations or restrictions in connection with such approvals that can adversely affect the anticipated benefits of the proposed merger or cause the parties to abandon the proposed merger; (4) the merger may involve unexpected costs, liabilities or delays; (5) the business of the Company may suffer as a result of uncertainty surrounding the merger or the potential adverse changes to business relationships resulting from the proposed merger; (6) legal proceedings may be initiated related to the merger and the outcome of any legal proceedings related to the merger may be adverse to the Company; (7) the Company may be adversely affected by other general industry, economic, business, and/or competitive factors; (8) there may be unforeseen events, changes or other circumstances that could give rise to the termination of the merger agreement or affect the ability to recognize benefits of the merger; (9) risks that the proposed merger may disrupt current plans and operations and present potential difficulties in employee retention as a result of the merger; (10) there may be other risks to consummation of the merger, including the risk that the merger will not be consummated within the expected time period or at all; and (11) the risks described from time to time in the Company's reports filed with the SEC under the heading \"Risk Factors,\" including the Annual Report on Form 10-K for the fiscal year ended December 31, 2016, Quarterly Reports on Form 10-Q and Current Reports on Form 8-K and in other of the Company's filings with the SEC. Such risks include, without limitation: the effects of competition in the businesses in which the Company operates; changes in customer demand and the Company's ability to provide products and services on terms that are favorable to it; and the impacts of breaches or potential breaches of network, information technology or data security, natural disasters, terrorist attacks or acts of war or significant litigation and any resulting financial impact not covered by insurance. Consequences of material differences in results as compared with those anticipated in the could include, among other things, business disruption, operational problems, financial loss, legal liability to third parties and similar risks, any of which could have a material adverse effect on the Company's financial condition, results of operations, credit rating or liquidity. These risks, as well as other risks associated with the proposed merger, will be more fully discussed in the proxy statement that will be filed with the SEC in connection with the proposed merger. There can be no assurance that the merger will be completed, or if it is completed, that it will close within the anticipated time period or that the expected benefits of the merger will be realized. Readers are cautioned not to place undue reliance on these , which speak only as of the date on which such statements were made. Except as required by applicable law, the Company undertakes no obligation to update to reflect events or circumstances arising after such date.\nView original content with multimedia: http://www.prnewswire.com/news-releases/dst-systems-inc-announces-notification-of-fourth-quarter-2017-earnings-release-date-300587820.html\nSOURCE DST Systems, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/dst-systems-inc-announces-notification-of-fourth-quarter-2017-earnings-release-date-300587820.html", "http://www.dstsystems.com/?utm_campaign=DST2016-DST-Public-Relations-1116&utm_source=newswire&utm_medium=pressrelease"], "published": "2018-01-25T00:06:00.000+02:00", "crawled": "2018-01-25T02:35:33.000+02:00", "highlightTitle": ""}