{"organizations": [], "uuid": "78b380000d39d7d43493b9f491682447624c7262", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222609469&w=1200&r=LYNXMPEE0G05T", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-japan-economy-boj/japan-central-bank-to-keep-policy-on-hold-offer-upbeat-inflation-view-idUSKBN1F60BJ", "country": "US", "domain_rank": 408, "title": "Japan central bank to keep policy on hold, offer upbeat inflation view", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T05:22:00.000+02:00", "replies_count": 0, "uuid": "78b380000d39d7d43493b9f491682447624c7262"}, "author": "", "url": "https://www.reuters.com/article/us-japan-economy-boj/japan-central-bank-to-keep-policy-on-hold-offer-upbeat-inflation-view-idUSKBN1F60BJ", "ord_in_thread": 0, "title": "Japan central bank to keep policy on hold, offer upbeat inflation view", "locations": [], "entities": {"persons": [{"name": "haruhiko kuroda", "sentiment": "none"}, {"name": "kuroda", "sentiment": "none"}, {"name": "leika kihara", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "bank of japan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "boj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 3:24 AM / in 7 hours Japan central bank to keep policy on hold, offer upbeat inflation view Leika Kihara 4 Min Read \nTOKYO (Reuters) - Japan’s central bank is set to maintain upbeat price forecasts next week and paint a slightly better picture of the economy than it did three months ago, signaling its conviction the country is making slow but steady progress in eradicating deflation. \nBank of Japan Governor Haruhiko Kuroda will likely remind markets at his post-meeting briefing that an exit from ultra-easy policy will be some time away, with inflation still distant from its 2 percent target. \nBut Kuroda may struggle to convince investors, who have become sensitive to even subtle signs the BOJ may follow the footsteps of its U.S. and European counterparts in dialing back crisis-mode stimulus, analysts say. \nWith no change to monetary policy expected at next week’s rate review, markets will focus on Kuroda’s comments and the BOJ’s new quarterly forecasts for clues on how quickly the central bank could start whittling down monetary support. \n“BOJ policymakers have become more vocal on the cost of prolonged easing, probably to see how markets react. They can afford to do this as the economy is doing well,” said Yoshiki Shinke, chief economist at Dai-ichi Life Research Institute. \n“The key would be yen moves. The BOJ could start normalizing policy this year if they are convinced such a move won’t trigger an unwelcome yen spike,” he said. \nThe BOJ got a taste of the communication challenge when a slight cut in its bond buying pushed up global bond yields, and Kuroda’s positive remarks on the economy drove the yen to a four-month high. BRIGHTENING PROSPECTS \nAt the two-day meeting ending on Tuesday, the BOJ is seen maintaining a pledge to guide short-term interest rates at minus 0.1 percent and 10-year bond yields around zero percent. \nIt will also likely keep intact a loose pledge to buy government bonds so its holdings increase roughly at an annual pace of 80 trillion yen ($724 billion). \nWith exports booming from robust global demand, the BOJ is seen slightly raising its growth forecast for the fiscal year beginning in April from a projection of 1.4 percent made three months ago, according to sources familiar with its thinking. \nIn the quarterly review, the central bank will roughly maintain its price forecasts for coming years and stick to its view that inflation will hit 2 percent by March 2020, they say. \nSources say the nine-member board may also debate offering a slightly brighter view on inflation expectations than the existing assessment, which currently describes expectations as being “on a weak note.” \nBut policymakers see little to cheer about with inflation still well below the central bank’s target, and feel that markets are over-pricing the chance of a near-term interest rate hike, they say. \n“The market is clearly over-reacting. There’s really no need to change much the BOJ’s key message that it will maintain its massive stimulus for now,” said one of the sources. \nIn forecasts made in October, the BOJ expects core consumer inflation to hit 1.4 percent in the year beginning in April and accelerate to 1.8 percent the following year. Many private analysts do not see inflation exceeding 1 percent for both years. \nJapan’s economy grew an annualized 2.5 percent in July-September to mark a seventh straight quarter of growth thanks to robust exports and capital expenditure. \nBut core consumer prices in November rose just 0.9 percent from a year earlier, still far from the BOJ’s target, as firms remain wary of hiking prices for fear of scaring away cost-sensitive consumers. \n($1 = 110.4900 yen)", "external_links": [], "published": "2018-01-17T05:22:00.000+02:00", "crawled": "2018-01-17T05:36:11.038+02:00", "highlightTitle": ""}