{"organizations": [], "uuid": "2a2da0892b87295f9e0ad6fdf4105a6777768fe0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222941835&w=1200&r=LYNXMPEE0H0BN", "site_section": "http://feeds.reuters.com/reuters/UKEntertainment", "section_title": "Reuters: Entertainment News", "url": "https://uk.reuters.com/article/uk-amazon-com-films-exclusive/exclusive-amazon-studios-to-cut-back-on-indie-films-in-programming-shift-sources-idUKKBN1F70K0", "country": "US", "domain_rank": 408, "title": "Exclusive: Amazon Studios to cut back on indie films in programming shift - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T08:20:00.000+02:00", "replies_count": 0, "uuid": "2a2da0892b87295f9e0ad6fdf4105a6777768fe0"}, "author": "", "url": "https://uk.reuters.com/article/uk-amazon-com-films-exclusive/exclusive-amazon-studios-to-cut-back-on-indie-films-in-programming-shift-sources-idUKKBN1F70K0", "ord_in_thread": 0, "title": "Exclusive: Amazon Studios to cut back on indie films in programming shift - sources", "locations": [], "entities": {"persons": [{"name": "jessica toonkel", "sentiment": "none"}, {"name": "jeffrey dastin", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}], "organizations": [{"name": "amazon studios", "sentiment": "negative"}, {"name": "amazon.com inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "san francisco/new york", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 6:23 AM / Updated 3 hours ago Exclusive: Amazon Studios to cut back on indie films in programming shift - sources Jeffrey Dastin , Jessica Toonkel 4 Min Read \nSAN FRANCISCO/NEW YORK (Reuters) - Amazon.com Inc, which has made waves in recent years buying art-house movies at the Sundance Film Festival, is heading to the prestigious event this week with a long-term change in the works: It plans to shift resources from independent films to more commercial projects, people familiar with the matter told Reuters. \nThe move reflects a new phase in the online retailer’s entertainment strategy. Initially, Amazon worked on high-brow movies that would win awards, put it on the map in Hollywood and help it attract top talent. \nNow, Amazon wants programming aimed at a far wider audience as it pursues its central business goal: persuading more people to join its video streaming service and shopping club Prime. \nThe change in the movie strategy parallels a similar shift in Amazon Studios’ TV operation, which is also moving to bigger-budget fare. \nAmazon expects to go after films with budgets in the $50 million (£36 million) range at the expense of indie projects costing around $5 million, one person familiar with the plans said on the condition of anonymity. Another person confirmed the overall strategy, adding that the Culver City, California, studio is still working out the details on how much of its film budget will go to these bigger releases. \nAmazon declined to comment. \nThe course change comes after Roy Price, who led Amazon Studios from its inception in 2010 and was a champion of projects with awards potential, resigned in October. Albert Cheng, the studio’s chief operating officer, has stepped in as interim head and is in charge of television projects, while Vice President Jason Ropell runs the film division. Both report to Jeff Blackburn, a Seattle-based senior vice president who wields broad authority at the company. \nIt is unclear who will permanently replace Price. \nOn the film side, Amazon is not moving all the way into blockbuster territory. The TV group had offered $250 million just for the rights to a fantasy prequel series of “The Lord of the Rings,” according to people familiar with the matter. That is a far more expensive project, representing a bigger change in direction than what the movie division is considering, one source said. \nNor is Amazon abandoning indie films entirely. But industry sources are unsure how active the company will be at Sundance this year. The festival’s lineup is not believed to have a standout like “Manchester by the Sea,” which Amazon bought at Sundance for $10 million and which went on to win two Oscars. Amazon and rival Netflix Inc in general have pushed up prices for such prestige fare. \nJeff Bezos, Amazon’s chief executive, recently told at least one industry executive that it is business as usual at the movie studio, a person familiar with the matter said. At Sundance, that could mean multi-million-dollar deals for films destined for theatres, as well as small deals by a separate team - Amazon Video Direct - that offers more modest payments for a project’s online streaming rights. \nStill, several filmmakers were surprised recently when the studio turned away a handful of projects with budgets up to $6 million, which they believed fit the mould of Amazon’s 2017 hit “The Big Sick,” another person familiar with the matter said. \nIt was not immediately clear if their rejection was due to Amazon’s new priorities. Reporting by Jeffrey Dastin in San Francisco and Jessica Toonkel in New York; Additional reporting by Lisa Richwine and Piya Sinha Roy in Los Angeles; Editing by Jonathan Weber and Leslie Adler", "external_links": [], "published": "2018-01-18T08:20:00.000+02:00", "crawled": "2018-01-18T09:03:20.015+02:00", "highlightTitle": ""}