{"organizations": [], "uuid": "cd4e351aecde009e09266fbd7f9ef7650a997280", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-global-partner-acquisition-corp-and-purple-innovation-llc-announce-definitive-agreement-with-investors-for-25-million-of.html", "country": "US", "domain_rank": 767, "title": "Global Partner Acquisition Corp. And Purple Innovation, LLC Announce Definitive Agreement With Investors For $25 Million Of Committed Equity Investments", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T22:38:00.000+02:00", "replies_count": 0, "uuid": "cd4e351aecde009e09266fbd7f9ef7650a997280"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-global-partner-acquisition-corp-and-purple-innovation-llc-announce-definitive-agreement-with-investors-for-25-million-of.html", "ord_in_thread": 0, "title": "Global Partner Acquisition Corp. And Purple Innovation, LLC Announce Definitive Agreement With Investors For $25 Million Of Committed Equity Investments", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}], "organizations": [{"name": "global partner acquisition corp.", "sentiment": "negative"}, {"name": "committed equity investments alpine", "sentiment": "negative"}, {"name": "global partner acquisition corp", "sentiment": "negative"}, {"name": "global partner sponsor i llc", "sentiment": "none"}, {"name": "gpac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ALPINE, Utah and NEW YORK, Jan. 30, 2018 /PRNewswire/ -- Global Partner Acquisition Corp. (\"GPAC\") (NASDAQ: GPAC, GPACU, GPACW) and Purple Innovation, LLC (\"Purple\") today announced that GPAC has entered into a definitive agreement with a consortium of investors who have agreed to acquire an aggregate of $25 million of shares of common stock of GPAC through open market purchases, private purchases and private placements. In connection with these investments, Global Partner Sponsor I LLC, the sponsor of GPAC (the \"Sponsor\"), has agreed to assign to the investors an aggregate of 3,750,000 warrants that were issued to the Sponsor in a private placement in August 2015. GPAC is currently engaged in discussions with other investors in connection with additional investments of up to $65 million. Any such additional investments will be subject to the execution and delivery of definitive agreements.\nGPAC will hold a special meeting of its stockholders (the \"Special Meeting\") on Friday, February 2, 2018 at 10:00 a.m. Eastern Time, at which GPAC's stockholders will be asked to consider and vote on a proposal to approve the previously announced merger of a subsidiary of GPAC with and into Purple, with Purple surviving such merger, and related proposals. The record date for determination of stockholders entitled to vote at the Special Meeting was January 10, 2018. GPAC and Purple anticipate completing the proposed business combination following the Special Meeting on February 2, 2018. Upon the completion of the proposed business combination, GPAC will change its corporate name to Purple Innovation, Inc.\nAbout Purple\nPurple is a leading comfort technology company with a vision to improve how people sleep, sit and stand. Purple offers a range of mattress, bedding and cushioning products. Purple's products are the result of over 20 years of innovation and investment by the founders in proprietary and patented comfort technologies and the development of its own manufacturing processes. Purple's Hyper-Elastic Polymer® technology underpins many of its comfort products and provides a range of benefits that differentiate its offerings from other competitors' products.\nPurple has core competencies in design, development and manufacturing, with decades of accumulated knowledge that enables it to create all aspects of its innovative products. Purple has vertically integrated its operations including research and development, marketing and manufacturing, resulting in an ability to rapidly test, learn, adapt and scale product offerings. Purple's combination of patents and intellectual property, proprietary and patented manufacturing equipment, production processes and decades of acquired knowledge create a distinct advantage over competitors that rely on commoditized technologies and outsourced manufacturing.\nPurple has not only developed transformative products and technologies, but also a brand that drives high customer engagement. To date, Purple's videos have been seen more than 950 million times across Facebook and YouTube alone with over 600,000 fans and subscribers across social media.\nAbout Global Partner Acquisition Corp.\nGlobal Partner Acquisition Corp. is a special purpose acquisition company formed for the purpose of effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination. GPAC's units began trading on The NASDAQ Capital Market on July 30, 2015 and its securities trade on NASDAQ under the ticker symbols GPAC, GPACW and GPACU.\nForward Looking Statements\nCertain statements made in this release are \"forward looking statements\" within the meaning of the \"safe harbor\" provisions of the United States Private Securities Litigation Reform Act of 1995. When used in this press release, the words \"estimates,\" \"projected,\" \"expects,\" \"anticipates,\" \"forecasts,\" \"plans,\" \"intends,\" \"believes,\" \"seeks,\" \"may,\" \"will,\" \"should,\" \"future,\" \"propose\" and variations of these words or similar expressions (or the negative versions of such words or expressions) are intended to identify forward-looking statements. These forward-looking statements include, but are not limited to, statements regarding arrangements with investors or potential investors or purchasers of securities of the Company, the execution of definitive or other agreements or letters of intent, whether the transactions contemplated by any definitive or other agreements or letters of intent will be consummated, and whether the terms of the final arrangements will be consistent with any such definitive or other agreements or letters of intent, the timing of the special meeting of GPAC's stockholders and the timing of the consummation of the business combination. These forward-looking statements are not guarantees of future performance, conditions or results, and involve a number of known and unknown risks, uncertainties, assumptions and other important factors, many of which are outside GPAC's or Purple's control, that could cause actual results or outcomes to differ materially from those discussed in the forward-looking statements. Important factors, among others, that may affect actual results or outcomes include: the inability to obtain stockholder approval of the merger, the inability to have the minimum cash to close the merger following redemptions by GPAC stockholders, the inability to complete the transaction contemplated by the merger agreement because of failure of closing conditions or other reasons; the inability to recognize the anticipated benefits of the proposed business combination, which may be affected by, among other things, the amount of cash available following any redemptions by GPAC stockholders and a lack of confirmed market acceptance of Purple's products; the ability to meet NASDAQ's listing standards following the consummation of the transactions contemplated by the proposed business combination; costs related to the proposed business combination; Purple's ability to manage growth; Purple's ability to execute its plans to develop and market new products and the timing and costs of these development programs; Purple's estimates of the size of the markets for its products; the rate and degree of market acceptance of Purple's products; the success of other competing cushioning and bedding technologies that exist or may become available; Purple's ability to identify and integrate acquisitions; the performance of Purple's products; rising costs adversely affecting Purple's profitability; potential litigation involving GPAC or Purple or the validity or enforceability of Purple's intellectual property; and general economic and market conditions impacting demand for Purple's products. See the risk factors disclosed in the proxy statement of the Company dated January 16, 2018, and any supplemental or other filings by the Company with the SEC, for information regarding additional risks associated with the merger and the related transactions. Neither GPAC nor Purple undertakes any obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\nAdditional Information about the Transaction and Where to Find It\nIn connection with the proposed business combination, GPAC has filed a definitive proxy statement with the SEC in connection with the special meeting of the stockholders of GPAC called to consider and vote on the merger and related matters. GPAC has mailed a definitive proxy statement and other relevant documents to its stockholders in connection with the meeting. Investors and security holders of GPAC are advised to read the proxy statement, and any amendments thereto, and any other filings by the Company with the SEC, which will contain important information about the proposed business combination and the parties to it. The definitive proxy statement was mailed to stockholders of GPAC as of January 10, 2018, the record date established for voting on the proposed merger and related matters. Stockholders may also obtain copies of the proxy statement, without charge, at the SEC's website at www.sec.gov or by directing a request to: Global Partner Acquisition Corp., c/o Andrew Cook, 1 Rockefeller Plaza, 11th Floor New York, New York 10020 , e-mail: info@globalpartnerac.com .\nParticipants in the Solicitation\nGPAC, Purple, and their respective directors, executive officers and other members of their management and employees, under SEC rules, may be deemed to be participants in the solicitation of proxies of GPAC stockholders in connection with the proposed business combination. Information concerning the interests of GPAC's and Purple's participants in the solicitation, which may, in some cases, be different than those of GPAC's and Purple's equity holders generally, is available in the definitive proxy statement filed by GPAC with the SEC on January 16, 2018.\nDisclaimer\nThis release shall neither constitute an offer to sell or the solicitation of an offer to buy any securities, nor shall there be any sale of securities in any jurisdiction in which the offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such jurisdiction.\nContact information\nGlobal Partner Acquisition Corp.\nPaul Zepf\nChief Executive Officer\npzepf@globalpartnerac.com\n917-244-4880\nPurple Innovation, LLC\nFor information regarding the transaction, please contact Bill Harrison:\nBill Harrison\nHead of Consumer Investment Banking, Headwaters MB LLC\nwharrison@headwatersmb.com\n917-596-5533\nFor information regarding Purple products, please contact Savannah Turk:\nSavannah Turk\nDirector of Purple Communications\nsavannah@purple.com\nFor investors, media and general inquires:\nBrendon Frey\nbrendon.frey@icrinc.com\n203-682-8216\nAlecia Pulman/Kate Kohlbrenner\npurplePR@icrinc.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/global-partner-acquisition-corp-and-purple-innovation-llc-announce-definitive-agreement-with-investors-for-25-million-of-committed-equity-investments-300590536.html\nSOURCE Purple Innovation, LLC", "external_links": ["http://www.sec.gov/", "https://maps.google.com/?q=1+Rockefeller+Plaza,+11th+Floor+New+York,+New+York+10020&entry=gmail&source=g", "http://www.prnewswire.com/news-releases/global-partner-acquisition-corp-and-purple-innovation-llc-announce-definitive-agreement-with-investors-for-25-million-of-committed-equity-investments-300590536.html"], "published": "2018-01-30T22:38:00.000+02:00", "crawled": "2018-01-31T00:39:09.021+02:00", "highlightTitle": ""}