{"organizations": [], "uuid": "5298148add9e9370eb7329f5e9ef35f649b0db3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180113&t=2&i=1221745156&w=1200&r=LYNXMPEE0C0IW", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-chile-worldbank/chile-slams-world-bank-for-bias-in-competitiveness-rankings-idUSKBN1F20SN", "country": "US", "domain_rank": 408, "title": "Chile slams World Bank for bias in competitiveness rankings", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-14T02:30:00.000+02:00", "replies_count": 0, "uuid": "5298148add9e9370eb7329f5e9ef35f649b0db3f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-chile-worldbank/chile-slams-world-bank-for-bias-in-competitiveness-rankings-idUSKBN1F20SN", "ord_in_thread": 0, "title": "Chile slams World Bank for bias in competitiveness rankings", "locations": [], "entities": {"persons": [{"name": "michelle bachelet", "sentiment": "none"}, {"name": "bachelet", "sentiment": "none"}, {"name": "paul romer", "sentiment": "none"}], "locations": [{"name": "santiago", "sentiment": "none"}, {"name": "chile", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "world bank", "sentiment": "negative"}, {"name": "wall street journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sat Jan 13, 2018 / 2:43 PM EST Chile slams World Bank for bias in competitiveness rankings Reuters Staff Chile's President Michelle Bachelet speaks during the opening of a business forum in Havana, Cuba January 8, 2018. Reuters/Stringer \nSANTIAGO (Reuters) - Chilean officials on Saturday criticized the World Bank, saying it treated the South American country unfairly in its closely watched annual \"Doing Business\" competitiveness rankings. \n\"What happened with the World Bank's competitiveness rankings is very concerning,\" socialist President Michelle Bachelet, whose four-year term ends in March, wrote on Twitter after the World Bank's chief economist apologized for Chile's slippage in the rankings under her tenure. \n\"Rankings that international institutions conduct should be trustworthy, since they impact investment and countries' development,\" Bachelet wrote, adding that the government would formally request a complete investigation from the World Bank. \nIn an interview with The Wall Street Journal published on Friday, World Bank Chief Economist Paul Romer apologized to Chile for changes to the report's methodology that he said \"conveyed the wrong impression\" about the business environment under Bachelet. ADVERTISEMENT \nChile currently ranks 55th out of 190 countries on the list, down from 34th in 2014, the year Bachelet took office. Its ranking declined to 41st in 2015, 48th in 2016, and 57th in 2017, the World Bank's reports show. \nRomer told the newspaper the decline resulted from methodological changes, rather than a deterioration of Chile's business environment, and may have been the result of the World Bank staff's political motivations. He told the newspaper he would revise the reports. \nIn a statement on Saturday, the World Bank said it would \"conduct an external review\" of Chile's indicators in light of Romer's concerns. It said any changes to its methodology undergo \"a rigorous consultative process\" and that the indicators are based on \"hard data\" like tax rates and legislation passed. \n\"The Doing Business indicators and methodology are designed with no single country in mind,\" it said. \"Objective data is not subject to political influence.\" \nChile is one of Latin America's wealthiest and most stable countries. While Bachelet introduced progressive tax and labor reforms that the country's business community said crimped investment, she has not fundamentally altered the country's longstanding free-market model. \nEconomic growth decelerated under her watch in large part due to low prices for copper, the country's main export. \nIn presidential elections last month, conservative billionaire and former President Sebastian Pinera trounced Bachelet's preferred candidate, Alejandro Guillier, in part on promises to slash red tape and boost investment. ADVERTISEMENT \nPinera presided over a booming economy from 2010-2014 amid high copper prices. He had succeeded Bachelet, who served her first term from 2006-2010. Chile's constitution prohibits consecutive re-election. \nThe World Bank's Doing Business ranking weighs factors such as the ease of starting a business, obtaining credit, paying taxes and getting construction permits. \n\"It is rare to see an action this immoral,\" Economy Minister Jorge Rodriguez Grossi said in a statement. \"We hope it is corrected quickly, but the damage is done.\" \n(Reporting by Antonio de la Jara; Additional reporting and writing by Luc Cohen; Editing by David Gregorio) ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-14T02:30:00.000+02:00", "crawled": "2018-01-14T00:04:58.005+02:00", "highlightTitle": ""}