{"organizations": [], "uuid": "e14ef869fd1a6f8024257021a7a6ded5c631e3af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/26/104731974-Rocket_Lab_Lift_off_Mahia_Peninsula_2017.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/21/rocket-labs-still-testing-orbital-launch-succeeds.html", "country": "US", "domain_rank": 767, "title": "Rocket Lab’s Still Testing orbital launch succeeds", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.155, "site_type": "news", "published": "2018-01-21T17:49:00.000+02:00", "replies_count": 0, "uuid": "e14ef869fd1a6f8024257021a7a6ded5c631e3af"}, "author": "Michael Sheetz", "url": "https://www.cnbc.com/2018/01/21/rocket-labs-still-testing-orbital-launch-succeeds.html", "ord_in_thread": 0, "title": "Rocket Lab’s Still Testing orbital launch succeeds", "locations": [], "entities": {"persons": [{"name": "peter beck", "sentiment": "none"}, {"name": "beck", "sentiment": "none"}], "locations": [{"name": "new zealand", "sentiment": "none"}, {"name": "ia peninsula", "sentiment": "none"}, {"name": "mahia peninsula", "sentiment": "none"}], "organizations": [{"name": "shares rocket lab rocket lab", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "electron", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Rocket Lab blasted off into space on Saturday, taking a major step toward opening low-cost access for a new generation of satellites.\nThe rocket builder's Electron vehicle reached orbit for the first time, deploying a payload of micro-satellites after launching from the company's complex on New Zealand's Mahia Peninsula.\nThis was the first time Electron's orbital deployment systems were tested, something CEO Peter Beck said was \"the next crucial step\" Rocket lab was \"eager to test.\"\n\"It's not like we're looking to build one or two vehicles this year. We're really looking to kick it into an unprecedented flight rate\" after testing is complete, Beck told CNBC. \nThe mission, titled \"Still Testing,\" deployed three satellites. One was an Earth-imaging Dove satellites built by Planet, and the other were Lemur-2 satellites that monitor weather and track ships, built by Spire. \n\"This is the first test carrying customer payloads and we'll be monitoring everything closely as we attempt to reach orbit,\" Beck said. \"This is not just about getting to orbit. We're really looking to get all the data we can.\"\nIn December, Electron missed its 10-day window after delays from weather and a last second abort. Rocket Lab had counted all the way down to T-minus 2 seconds, when Beck says Electron automatically aborted.\n\"The engines ignited but a couple engines didn't like the temperature of the liquid oxygen, so it automatically shut down,\" Beck said. \nRocket Lab had at least one more chance at launching in December, but Beck says \"the weather didn't look good enough.\" \nElectron's success comes at a critical time, as Rocket Lab has contracted to launch five rockets for lunar mining company Moon Express as early as next spring.\nRocket Lab said previously that the results of the \"Still Testing\" launch, if the rocket \"performs nominally,\" may cause the company to accelerate the Electron program into commercial use.\n\"There's a tremendous number of things in place that enables us to ramp up production that way,\" Beck said. \nThis was the second of three planned test launches. In May, the first Electron vehicle failed to reach orbit. CEO Peter Beck said at the time the problems involved \"third-party error\" and were fixed. No major change was made to Electron's hardware between the tests.\nBeck says the company will continue to base launches out of New Zealand, saying \"right now we have all the capacity we need.\" As launches increase, Beck says that talks are ongoing with several spaceports and launch locations around the United States for future Rocket Lab flights.\n\"We're talking to Cape Canaveral, Kodiak in Alaska, and have a great relationship with Wallops,\" Beck said. \nThe launch was also the first to be livestreamed by Rocket Lab, a trend among private companies made popular by Elon Musk's SpaceX over the past decade.", "external_links": [], "published": "2018-01-21T17:49:00.000+02:00", "crawled": "2018-01-21T17:49:35.018+02:00", "highlightTitle": ""}