{"organizations": [], "uuid": "90bbba8e84620ec57a22432e5984236b1302615c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/business-wire-itron-completes-acquisition-of-silver-spring-networks-to-drive-innovation-and-growth-in-iot.html", "country": "US", "domain_rank": 767, "title": "Itron Completes Acquisition of Silver Spring Networks to Drive Innovation and Growth in IoT", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T19:00:00.000+02:00", "replies_count": 0, "uuid": "90bbba8e84620ec57a22432e5984236b1302615c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/business-wire-itron-completes-acquisition-of-silver-spring-networks-to-drive-innovation-and-growth-in-iot.html", "ord_in_thread": 0, "title": "Itron Completes Acquisition of Silver Spring Networks to Drive Innovation and Growth in IoT", "locations": [], "entities": {"persons": [{"name": "philip mezey", "sentiment": "none"}], "locations": [{"name": "wash.", "sentiment": "none"}, {"name": "liberty lake", "sentiment": "none"}], "organizations": [{"name": "itron completes acquisition of silver spring networks", "sentiment": "negative"}, {"name": "itri", "sentiment": "none"}, {"name": "silver spring networks, inc", "sentiment": "none"}, {"name": "itron, inc.", "sentiment": "none"}, {"name": "itron", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Industry-defining acquisition advances ability to deliver more value-added services and outcomes-based solutions to utilities and smart cities worldwide\nLIBERTY LAKE, Wash.--(BUSINESS WIRE)-- Itron, Inc. (NASDAQ: ITRI), a world-leading technology and services company dedicated to the resourceful use of energy and water, announced today that it has completed its acquisition of Silver Spring Networks, Inc.\nWith this acquisition, Itron strengthens its ability to deliver a broader set of solutions, increase the pace of growth and innovation in the smart city and industrial IoT markets, and provide customers with greater choice and flexibility when deploying technology to improve their operations and services.\n“The addition of Silver Spring Networks comes at a time when industry dynamics are changing: utilities and cities want to invest in IoT and connectivity to modernize critical infrastructure to reduce operating expenses, enhance services and create new revenue opportunities,” said Philip Mezey, Itron’s president and chief executive officer. “This acquisition enhances Itron’s capabilities and advances our strategy of delivering highly-secure, value-generating solutions for utilities, smart cities and the broader industrial IoT sector.”\nBy integrating Silver Spring Networks’ platform and solutions, including its smart street light offering, into Itron’s broad portfolio, the combined expertise in delivering smart utility, smart city and industrial IoT solutions provides the industry with an unparalleled offering. With a focus on open-standards platform development for connectivity and automation, alongside a robust partner ecosystem, Itron is ideally positioned to promote a path for adoption of IoT technology and to more reliably, efficiently and securely connect devices that matter.\n“This is a tremendous step forward for Itron and our growth as a company,” continued Mezey. “Bringing together our two companies ties directly to Itron’s strategy to deliver valuable outcomes to our customers as they manage the world’s energy and water resources—and build the cities of tomorrow. Together, our strong engineering talent, leading technology and deep domain expertise will unlock incredible innovation, choice and value for customers around the world.”\nThe legacy Silver Spring Networks business is now a wholly-owned subsidiary of Itron, Inc. and will be integrated and reported as a new business segment, Itron Networked Solutions.\nItron will provide total consolidated company revenue and non-GAAP earnings per share guidance for full-year 2018, inclusive of the addition of Silver Spring Networks, in conjunction with its fourth quarter and full-year 2017 financial results.\nAbout Itron\nItron is a world-leading technology and services company dedicated to the resourceful use of energy and water. We provide comprehensive solutions that measure, manage and analyze energy and water. Our broad product portfolio includes electricity, gas, water and thermal energy measurement devices and control technology; communications systems; software; as well as managed and consulting services. With thousands of employees supporting nearly 8,000 customers in more than 100 countries, Itron applies knowledge and technology to better manage energy and water resources. Together, we can create a more resourceful world. Join us: www.itron.com .\nItron ® is a registered trademark of Itron, Inc. All third-party trademarks are property of their respective owners and any usage herein does not suggest or imply any relationship between Itron and the third party unless expressly stated.\nForward-Looking Statements\nThis release contains forward-looking statements within in the meaning of the Private Securities Litigation Reform Act of 1995. These statements relate to our expectations about revenues, operations, financial performance, earnings, earnings per share and cash flows, as well as the integration of Silver Spring Networks. Although we believe the estimates and assumptions upon which these forward-looking statements are based are reasonable, any of these estimates or assumptions could prove to be inaccurate and the forward-looking statements based on these estimates and assumptions could be incorrect. Our operations involve risks and uncertainties, many of which are outside our control, and any one of which, or a combination of which, could materially affect our results of operations and whether the forward-looking statements ultimately prove to be correct. Actual results and trends in the future may differ materially from those suggested or implied by the forward-looking statements depending on a variety of factors. Some of the factors that we believe could affect our results include our ability to achieve estimated cost savings, the rate and timing of customer demand for our products, rescheduling of current customer orders, changes in estimated liabilities for product warranties, adverse impacts of litigation, changes in laws and regulations, our dependence on new product development and intellectual property, future acquisitions, changes in estimates for stock-based and bonus compensation, increasing volatility in foreign exchange rates, international business risks and other factors that are more fully described in our Annual Report on Form 10-K for the year ended December 31, 2016 and other reports on file with the Securities and Exchange Commission. Itron undertakes no obligation to update or revise any information in this press release.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180105005560/en/\nItron, Inc.\nBarbara Doyle, 509-891-3443\nVice President, Investor Relations\nbarbara.doyle@itron.com\nor\nAngela Lockwood, 509-891-3816\nDirector, Public Relations\nangela.lockwood@itron.com\nSource: Itron, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180105005560/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.itron.com%2F&esheet=51737695&newsitemid=20180105005560&lan=en-US&anchor=www.itron.com&index=1&md5=0e77258df9753074717b5fcf687d77da"], "published": "2018-01-05T19:00:00.000+02:00", "crawled": "2018-01-05T20:24:07.010+02:00", "highlightTitle": ""}