{"organizations": [], "uuid": "0dca2b7851f96ce1007d2c19f45c114fc04a907e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-rises-but-set-for-big-monthly-drop-euro-falls-idUSL8N1PO3W5", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar rises but set for big monthly drop; euro falls", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-29T23:53:00.000+02:00", "replies_count": 0, "uuid": "0dca2b7851f96ce1007d2c19f45c114fc04a907e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-rises-but-set-for-big-monthly-drop-euro-falls-idUSL8N1PO3W5", "ord_in_thread": 0, "title": "FOREX-Dollar rises but set for big monthly drop; euro falls", "locations": [], "entities": {"persons": [{"name": "borthwick", "sentiment": "none"}, {"name": "douglas borthwick", "sentiment": "none"}, {"name": "stephanie kelly", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "chapdelaine foreign exchange", "sentiment": "none"}, {"name": "fx", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar rises but set to decline 3 percent on a monthly basis\n* Traders face Fed meeting, jobs report later in week\n* Euro, pound broadly down (Updates to U.S. market open; changes byline, dateline, previously LONDON)\nBy Stephanie Kelly\nNEW YORK, Jan 29 (Reuters) - The dollar rose on Monday against a basket of currencies as U.S. bond yields climbed and traders waited for a Federal Reserve meeting and a U.S. jobs report later in the week, while the euro and pound were both broadly down.\nAgainst a basket of currencies, the dollar index rose 0.36 percent to 89.389 after scoring six consecutive weeks of losses.\nOn a monthly basis it is set to fall 3 percent.\nAs the greenback rose, the euro fell 0.43 percent, while the British pound decreased 0.61 percent.\n“Most market players are long euro right now, short dollar across the board,” said Douglas Borthwick, a managing director and head of FX at Chapdelaine Foreign Exchange in New York. “Overnight we saw profit-taking. Not on the back of any news, but just on the back of folks having sizeable positions already in place.”\nBorthwick added that traders are feeling some uncertainty going into this week’s Fed meeting.\n“Depending on the new Fed leadership, which is being run now by (Jerome) Powell, the market is concerned about whether we’re going to see continued rate rises at the current velocity that’s expected or whether it’s going to be increased somewhat,” he said.\nReuters data points to market expectations of about three more Fed rate hikes this year, starting in March, although some analysts, including at Goldman Sachs and JP Morgan Asset Management, expect the Fed to raise four times.\nTraders also are awaiting a U.S. Department of Labor report, set to be released on Friday, that will include data on nonfarm payrolls, average hourly earnings and the unemployment rate.\nOn Monday a Commerce Department report said U.S. consumer spending rose solidly in December, but savings dropped to a 10-year low. The dollar increased marginally after the report.\nData on Friday showed U.S economic growth accelerated to 2.3 percent in 2017, faster than the 1.5 percent logged in 2016, although growth in the December quarter slowed on a sequential basis and was below market expectations.\nTreasury Secretary Steven Mnuchin gave U.S. currency bears a major boost last week with a tacit endorsement of a weak dollar. While U.S. President Donald Trump, who has advocated a strong dollar, tried to minimize those comments, the remarks had already made an impact and the greenback’s downturn since November showed little sign of abating.\nU.S. Treasury yields surged to more than three-year highs on Monday after comments from a European Central Bank official added to expectations that central banks globally will reduce stimulus as the economic outlook improves. The 10-year yield rose to 2.71 percent, its highest since early 2014.\nReporting by Stephanie Kelly; Additional reporting by Saikat Chatterjee; Editing by Frances Kerry\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-29T23:53:00.000+02:00", "crawled": "2018-01-30T03:22:49.001+02:00", "highlightTitle": ""}