{"organizations": [], "uuid": "440fa60ef2bb6667002eac5099fcbffab3790f07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-pacira-pharmaceuticals-reports-preliminary-2017-revenues-of-286-point-6-million.html", "country": "US", "domain_rank": 767, "title": "Pacira Pharmaceuticals Reports Preliminary 2017 Revenues of $286.6 Million", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.99, "site_type": "news", "published": "2018-01-04T15:30:00.000+02:00", "replies_count": 0, "uuid": "440fa60ef2bb6667002eac5099fcbffab3790f07"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-pacira-pharmaceuticals-reports-preliminary-2017-revenues-of-286-point-6-million.html", "ord_in_thread": 0, "title": "Pacira Pharmaceuticals Reports Preliminary 2017 Revenues of $286.6 Million", "locations": [], "entities": {"persons": [{"name": "dave stack", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "arsippany", "sentiment": "none"}], "organizations": [{"name": "exparel", "sentiment": "negative"}, {"name": "pillar", "sentiment": "none"}, {"name": "pacira pharmaceuticals, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "-- EXPAREL sales of $282.9 million driven by Phase 4 data, education and strategic partnerships --\nPARSIPPANY, N.J., Jan. 04, 2018 (GLOBE NEWSWIRE) -- Pacira Pharmaceuticals, Inc. (NASDAQ:PCRX) today reported preliminary unaudited total revenues and EXPAREL® (bupivacaine liposome injectable suspension) net product sales for the fourth quarter and full-year 2017.\n“2017 was an exciting year marked by solid revenue growth and multiple major milestones that support our mission of improving patient care with EXPAREL, our opioid-free alternative for prolonged postsurgical pain control,” said Dave Stack, chairman and chief executive officer of Pacira Pharmaceuticals, Inc. “Our Phase 4 PILLAR study unequivocally demonstrated that EXPAREL is significantly better than bupivacaine at reducing or eliminating opioids while successfully managing postsurgical pain. Our regulatory activities to expand the EXPAREL label to include nerve block are advancing on track. We’re also continuing to promote education and awareness around opioid-sparing strategies while building a robust network of partners who share in our commitment to reducing the role of the operating room as the gateway to opioid use and abuse.”\nPreliminary 2017 Revenues:\nNet EXPAREL sales of $78.7 million for the fourth quarter of 2017 and $282.9 million for the full-year, compared to $71.4 million and $265.8 million for the prior year, respectively. Full year sales were impacted by two fewer selling days in 2017 compared to 2016. Total revenues of $79.1 million for the fourth quarter of 2017 and $286.6 million for the full-year, compared to $72.9 million and $276.4 million for the prior year, respectively.\n“Our strategic partnership with Johnson & Johnson to co-promote EXPAREL across a broad range of orthopedic surgical settings continues to gain traction and helped accelerate EXPAREL daily growth to 10.0 percent for the fourth quarter and 13.5 percent for the month of December. We are highly encouraged with the success of this partnership and we look forward to the continued growth trajectory for EXPAREL in 2018 and beyond,” continued Mr. Stack.\nThis financial information is unaudited and subject to adjustment. Pacira expects to report its complete financial results for 2017, along with financial guidance for 2018, in its fourth quarter and year-end conference call scheduled for the first quarter of 2018.\nAbout Pacira\nPacira Pharmaceuticals, Inc. (NASDAQ:PCRX) is a specialty pharmaceutical company dedicated to advancing and improving postsurgical outcomes for acute care practitioners and their patients. The company’s flagship product, EXPAREL® (bupivacaine liposome injectable suspension) was commercially launched in the United States in April 2012. EXPAREL utilizes DepoFoam®, a unique and proprietary product delivery technology that encapsulates drugs without altering their molecular structure, and releases them over a desired period of time. To learn more about Pacira, including the corporate mission to reduce overreliance on opioids, visit www.pacira.com .\nAbout EXPAREL®\nEXPAREL (bupivacaine liposome injectable suspension) is currently indicated for single-dose infiltration into the surgical site to produce postsurgical analgesia. The product combines bupivacaine with DepoFoam®, a proven product delivery technology that delivers medication over a desired time period. EXPAREL represents the first and only multivesicular liposome local anesthetic that can be utilized in the peri- or postsurgical setting. By utilizing the DepoFoam platform, a single dose of EXPAREL delivers bupivacaine over time, providing significant reductions in cumulative pain score with up to a 45 percent decrease in opioid consumption; the clinical benefit of the opioid reduction was not demonstrated. Additional information is available at www.EXPAREL.com .\nImportant Safety Information\nEXPAREL is contraindicated in obstetrical paracervical block anesthesia. In clinical trials, the most common adverse reactions (incidence ≥10%) following EXPAREL administration were nausea, constipation, and vomiting. EXPAREL is not recommended to be used in the following patient population: patients <18 years old and/or pregnant patients. Because amide-type local anesthetics, such as bupivacaine, are metabolized by the liver, EXPAREL should be used cautiously in patients with hepatic disease. Patients with severe hepatic disease, because of their inability to metabolize local anesthetics normally, are at a greater risk of developing toxic plasma concentrations. EXPAREL is not recommended for the following types or routes of administration: epidural, intrathecal, regional nerve blocks, or intravascular or intra-articular use. Non-bupivacaine-based local anesthetics, including lidocaine, may cause an immediate release of bupivacaine from EXPAREL if administered together locally. The administration of EXPAREL may follow the administration of lidocaine after a delay of 20 minutes or more. Formulations of bupivacaine other than EXPAREL should not be administered within 96 hours following administration of EXPAREL. Central Nervous System (CNS) Reactions: There have been reports of adverse neurologic reactions with the use of local anesthetics. These include persistent anesthesia and paresthesias. CNS reactions are characterized by excitation and/or depression. Cardiovascular System Reactions: Toxic blood concentrations depress cardiac conductivity and excitability which may lead to dysrhythmias sometimes leading to death. Allergic Reactions: Allergic-type reactions (eg, anaphylaxis and angioedema) are rare and may occur as a result of hypersensitivity to the local anesthetic or to other formulation ingredients. Chondrolysis: There have been reports of chondrolysis (mostly in the shoulder joint) following intra-articular infusion of local anesthetics, which is an unapproved use.\nForward Looking Statements\nAny statements in this press release about the company’s future expectations, plans, outlook and prospects, and other statements containing the words “believes,” “anticipates,” “plans,” “estimates,” “expects,” “intends,” “may” and similar expressions, constitute forward-looking statements within the meaning of The Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by such forward-looking statements as a result of various important factors, including risks relating to: the success of the company’s sales and manufacturing efforts in support of the commercialization of EXPAREL; the rate and degree of market acceptance of EXPAREL and the company’s other products; the size and growth of the potential markets for EXPAREL and the company’s ability to serve those markets; the company’s plans to expand the use of EXPAREL to additional indications and opportunities, and the timing and success of any related clinical trials; the related timing and success of United States Food and Drug Administration supplemental New Drug Applications; the outcome of the U.S. Departm", "external_links": ["https://www.globenewswire.com/Tracker?data=O_IY4d_iiQ-P5VdrxAC8BU15A4o9kX0mKwt_8C9XxcUAS4ThnU93h2whmhd8hhb5O46-Om6RRFgveYjinfy0GQ==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/9c81787b-97b6-495f-bbcc-40bac7583313", "https://www.globenewswire.com/Tracker?data=8eOej7gBHmi6ppaRrCHOY0HWHqMo9XsQdG-jKq1YUWi_iwwPgxbXjxSE2BLUONuW8mGAi3MPNvGYQcJZaOSf8g=="], "published": "2018-01-04T15:30:00.000+02:00", "crawled": "2018-01-04T20:05:15.015+02:00", "highlightTitle": ""}