{"organizations": [], "uuid": "4152bb5304ccfca906ce5792af4e2133ca40631b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/kohls.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/11/kohls-holidays/", "country": "US", "domain_rank": 1196, "title": "Kohl's CEO Will Rely on New Tech to Continue the Retailer's Momentum | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.52, "site_type": "news", "published": "2018-01-12T16:01:00.000+02:00", "replies_count": 0, "uuid": "4152bb5304ccfca906ce5792af4e2133ca40631b"}, "author": "Phil Wahba", "url": "http://fortune.com/2018/01/11/kohls-holidays/", "ord_in_thread": 0, "title": "Kohl's CEO Will Rely on New Tech to Continue the Retailer's Momentum | Fortune", "locations": [], "entities": {"persons": [{"name": "phil wahba", "sentiment": "negative"}, {"name": "kohl", "sentiment": "negative"}, {"name": "j.c. penney", "sentiment": "none"}, {"name": "macy", "sentiment": "none"}], "locations": [], "organizations": [{"name": "apple", "sentiment": "none"}, {"name": "amazon.com", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Phil Wahba January 11, 2018 \nKohl’s (kss) gave convincing proof this week that its efforts to get back on track are starting to pay off when it reported stellar holiday season sales numbers. \nThe retailer said on Monday that comparable sales had risen 6.9% in November and December, outperforming the overall industry and close competitors like Macy’s (m) , J.C. Penney (jcp) and Target . (tgt) \nThe results were the fruit of years of heavy investments in Kohl’s tech, particularly fuller integration of stores and e-commerce, improvements to its private brands, better use of store space, and bringing in brands such as Under Armour in 2017 and Apple and Fitbit earlier into its stores. Indeed, stores filled 38% of items ordered online, making more efficient use of inventory, and Kohl’s bet on activewear paid huge dividends with sales there rising 30%. \nKohl’s has made it Priority No. 1 to get more people into its stores, going so far as to test out a deep partnership with Amazon.com (amzn) that includes handling returns for its online rival and showcasing some of its products. The strong holiday season came after years of stagnation from Kohl’s as it leaned on a playbook heavily focused on opening big box stores for years. \nBut now comes the even hard part: keeping that momentum going. Kevin Mansell, who is stepping down as CEO in May after a decade at the helm, says the Christmas period was very strong but believes that the company’s moves in the last few years plus the constant innovation it is pursues will keep Kohl’s turnaround in good stead in the coming years and able to win back market share from competitors. \n“We’ve done pretty well comparatively so to me that gap is company specific,” Mansell told Fortune earlier this week. “Kohl’s is doing some things better.” \nThe company, which operates some 1,160 stores, has benefited from seemingly straightforward but crucial steps such as improving the search capability of its web site so it more accurately reflect a customer’s prior purchases. That kind of personalization is also improving Kohl’s marketing in a big way, and Mansell thinks that will be a bigger factor next holiday season. \nUnder incoming CEO, Michelle Gass, who currently serves as Chief Merchandising and Customer Officer, Kohl’s will likely continue to push lining up new merchandise by national brands but also continue to speed up lead times on its own brands, which remain a more challenged part of its business. Indeed, some of Kohl’s improvements have come from removing some of its own products at stores where they were not catching on, rather than imposing a one-size-fits-all approach on its stores, something that is easier now with stronger inventory management firepower. \nOn the tech side, Mansell thinks the next steps potentially include features like the “Smart Cart” where a retailer offers online shoppers a discount if they go fetch an order in a store. (This is something Walmart’s jet.com pioneered and that is likely to become a norm in retail.) Better tech is something that has enabled Kohl’s to get its app to help shoppers navigate the deals and discounts that are a Kohl’s fixture so that customers know what an item’s price ends up being more easily. Mansell told the ICR conference this week that he thinks this “Your price” feature was behind 30% of online sales growth at the chain during the holidays. Kohl’s may also decentralize some decision-making by giving individual stores better told to manage merchandise and payroll more efficient. \nFor now, Kohl’s continues to use a small group of stores to pilot and test things to put the company at the vanguard of retail tech, and not ever have to play catch up again as it did for a few years not that long ago. \n“We’re still focused on innovation,” says Mansell. “Our business is getting a lot better.” It will up to him for the next four months and then Gass after that, to continue to lead that. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-12T16:01:00.000+02:00", "crawled": "2018-01-12T01:50:10.003+02:00", "highlightTitle": ""}