{"organizations": [], "uuid": "fa30221782ee58dbec21a9b864dbc1ebea484444", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WX313_esport_SOC_20180109102148.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7014.xml", "section_title": "WSJ.com: US Business", "url": "https://www.wsj.com/articles/overwatch-leagues-launch-tests-videogames-as-franchise-sport-1515589200", "country": "US", "domain_rank": 387, "title": "Overwatch League’s Launch Tests Videogames as Franchise Sport", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T15:00:00.000+02:00", "replies_count": 0, "uuid": "fa30221782ee58dbec21a9b864dbc1ebea484444"}, "author": "Sarah E. Needleman", "url": "https://www.wsj.com/articles/overwatch-leagues-launch-tests-videogames-as-franchise-sport-1515589200", "ord_in_thread": 0, "title": "Overwatch League’s Launch Tests Videogames as Franchise Sport", "locations": [], "entities": {"persons": [{"name": "evan wingren", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "activision blizzard inc.", "sentiment": "negative"}, {"name": "keybanc capital markets inc", "sentiment": "none"}, {"name": "national football league", "sentiment": "none"}, {"name": "activision blizzard", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "3 COMMENTS Activision Blizzard Inc.’s ATVI 0.23% “Overwatch” videogame league launches Wednesday, a crucial test of whether esports can join their traditional counterparts in the quest for eyeballs and advertising dollars.\nBy wrapping videogame contests in a format sports fans appreciate—city-based teams backed by familiar names from major U.S. organizations such as the National Football League —the company hopes it eventually can build a franchise that mirrors the success of professional athletics.\nEsports Eyeballs The number of people who watch esports at least once a month Wall Street analysts, though, think Activision Blizzard faces significant challenges in converting casual players into dedicated spectators.\n“Overwatch,” a cartoonish shooter game, is more difficult to follow than football or basketball, said Evan Wingren, an analyst at KeyBanc Capital Markets Inc. There is no ball to track, for example, and a dozen characters with unique abilities battle across numerous maps rather than a consistent field such as a baseball diamond, he said.\nActivision Blizzard said it has taken steps to make competitions watchable, including hiring broadcasters, some from traditional sports, to explain the on-screen action.\nEsports are beginning to look a lot like real sports. We go inside this explosive industry and take a look at why future Olympic athletes might compete from behind a keyboard. Photo: Steve Strait for The Wall Street Journal If the closely watched Overwatch League fizzles, it could rattle other esports endeavors. Take-Two Interactive Software Inc. is building a pro league for its NBA 2K series in partnership with the National Basketball Association. It is expected to start later this year, with 17 teams fielding squads, including the defending NBA champion Golden State Warriors.\nAlso at stake is a growth streak that has helped Activision Blizzard’s stock price more than triple in the past three years.\n“There is some value built into Activision’s stock for esports,” said Cowen & Co. analyst Doug Creutz. “If people think the Overwatch League is a failure, the stock will trade off on that.”\nActivision Blizzard, the largest videogame publisher in the U.S. by market value, said “Overwatch” has 35 million players. For its league to succeed, it will need to convince those gamers and beyond to watch others play.\nIn an age of cord-cutters, though, the company doesn’t necessarily need to conquer traditional media, analysts say. Much of the growth in viewership is online, fueled by platforms such as Amazon.com Inc.’s Twitch and Alphabet Inc.’s YouTube.\nKristian Keller of the Boston Uprising, who goes by the name \"Kellex,\" greeted fans before a preseason Overwatch League match in December. Photo: Activision Blizzard An estimated 191 million spectators world-wide watch esports competitions at least once a month, more than double the number from 2012, according to Newzoo BV. Revenue from sponsorships, media rights, ticket sales and other sources is expected to eclipse $1 billion by 2019, it estimates.\nOn Tuesday, Activision Blizzard announced a two-year deal to stream Overwatch League matches on Twitch. The first matches begin streaming there at 7 p.m. ET. Some league content also will air on Activision Blizzard’s Major League Gaming platform.\nFor now, the matches will take place at the former “Tonight Show” studio in Burbank, Calif., while the teams work to secure their own facilities for home games. Still, Activision Blizzard is convinced it can fill seats in its league’s respective cities.\n“It will be just as common in the future to take your family to an ‘Overwatch’ game as it is to a Major League Baseball game,” Nate Nanzer, commissioner of the Overwatch League, said in an interview.\nWrite to Sarah E. Needleman at sarah.needleman@wsj.com", "external_links": [], "published": "2018-01-10T15:00:00.000+02:00", "crawled": "2018-01-10T15:57:27.021+02:00", "highlightTitle": ""}