{"organizations": [], "uuid": "62d0de4ee0c87a082119d2e4a8b36ac87f054466", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-merck-co-study/mercks-keytruda-succeeds-in-key-lung-cancer-trial-idUSKBN1F51D8", "country": "US", "domain_rank": 408, "title": "Merck's Keytruda succeeds in key lung cancer trial", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T13:59:00.000+02:00", "replies_count": 0, "uuid": "62d0de4ee0c87a082119d2e4a8b36ac87f054466"}, "author": "", "url": "https://www.reuters.com/article/us-merck-co-study/mercks-keytruda-succeeds-in-key-lung-cancer-trial-idUSKBN1F51D8", "ord_in_thread": 0, "title": "Merck's Keytruda succeeds in key lung cancer trial", "locations": [], "entities": {"persons": [{"name": "keytruda", "sentiment": "negative"}, {"name": "tamara mathias", "sentiment": "none"}], "locations": [{"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "merck", "sentiment": "negative"}, {"name": "reuters) - merck & co inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Positive lung cancer results for Merck & Co Inc’s blockbuster drug Keytruda assuaged investor concerns about delays in testing and the withdrawal of an application for European use of the drug, sending the drugmaker’s shares up more than 6 percent.\nA cocktail of immunotherapy Keytruda and two chemotherapy medicines helped lung cancer patients live longer and stopped the disease from advancing, early results from a study showed, Merck said. The results will be presented at an upcoming medical meeting whose date and location were not announced.\nAn earlier trial in similar patients indicated that initial treatment with Keytruda and chemotherapy improves survival, but the trial was too small to be definitive.\nThe latest results cement Merck’s position as a front-runner in the race to develop drugs that can be used as the initial or first-line treatment for patients with a common type of lung cancer.\nShares of Merck fell around 10 percent last year after the company said in October that it would make survival a main goal of the lung cancer trial and extended the study by up to a year. Tuesday’s gains bring its shares back in line with where they were trading before the delay.\nThe results “will allow for Merck to extend their leadership position in 1st line non-small cell lung cancer where they are already dominating in the 25-30 percent of patients” whose tumors have high levels of PDL1, a protein targeted by the drug, Credit Suisse analyst Vamil Divan said in a research note.\nThey also increase the chances of a European regulatory approval, after Merck withdrew an application when regulators asked for more data, several analysts said.\nMerck has already secured U.S. regulatory approval for its combination based on positive results from the earlier trial.\nSwiss drugmaker Roche, Anglo-Swedish drug company AstraZeneca Plc and Merck’s U.S. rival Bristol-Myers Squibb Co are developing combination lung cancer treatments of their own.\nLung cancer is a lucrative oncology market and a first-line approval makes a drug available to the most patients.\nKeytruda brought Merck more than $1 billion in sales in the third quarter and analysts expect the drug to generate peak annual sales of about $8.2 billion by 2020.\nBut Merck will have to rely heavily on Keytruda’s use as a first-line lung cancer treatment to achieve that milestone, analysts said.\nMerck shares were up $3.67 at $62.39 in late morning trading. Roche’s shares were off 3.5 percent, while shares of Bristol-Myers and AstraZeneca were down 3.8 percent and 1.8 percent, respectively.\nReporting by Tamara Mathias in Bengaluru and Michael Erman in New York; editing by Sai Sachin Ravikumar and Steve Orlofsky\n ", "external_links": [], "published": "2018-01-16T13:59:00.000+02:00", "crawled": "2018-01-16T14:21:18.005+02:00", "highlightTitle": ""}