{"organizations": [], "uuid": "1ba1945fc6bd43e45e695ff3166d8a138617b897", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226561194&w=1200&r=LYNXMPEE0T0JZ", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/brunei-politics/brunei-ruler-replaces-top-ministers-in-surprise-cabinet-reshuffle-idINKBN1FJ19R", "country": "US", "domain_rank": 408, "title": "Brunei ruler replaces top ministers in surprise cabinet reshuffle", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T12:16:00.000+02:00", "replies_count": 0, "uuid": "1ba1945fc6bd43e45e695ff3166d8a138617b897"}, "author": "", "url": "https://in.reuters.com/article/brunei-politics/brunei-ruler-replaces-top-ministers-in-surprise-cabinet-reshuffle-idINKBN1FJ19R", "ord_in_thread": 0, "title": "Brunei ruler replaces top ministers in surprise cabinet reshuffle", "locations": [], "entities": {"persons": [{"name": "reu", "sentiment": "negative"}, {"name": "hassanal bolkiah", "sentiment": "none"}, {"name": "bandar seri begawan", "sentiment": "none"}], "locations": [{"name": "brunei", "sentiment": "none"}, {"name": "borneo", "sentiment": "none"}], "organizations": [{"name": "am / updated", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 21 AM / Updated 3 minutes ago Brunei ruler replaces top ministers in surprise cabinet reshuffle Reuters Staff 2 Min Read \nBANDAR SERI BEGAWAN (Reuters) - Brunei’s ruler announced a major shake-up of his cabinet on Tuesday, replacing six top ministers just over a couple of years after they were appointed. \nThe tiny former British protectorate, nestled between two Malaysian states on the island of Borneo, relies on oil and gas exports, but is having to grapple with shrinking state revenue as global energy prices have tumbled over the last few years.“I myself am of the opinion that the time has come for a cabinet reshuffle,” Sultan Hassanal Bolkiah, 71, said in a televised address from his palace. \n“I have decided to announce new appointments and changes to the cabinet.” \nNo immediate reason was given for the first cabinet reshuffle since October 2015. It follows the surprise dismissal of the health minister last December. \nCabinet reshuffles typically only happen every five years, but Tuesday’s announcement saw several long-serving cabinet members replaced mid-term, including Second Minister of Foreign Affairs and Trade Lim Jock Seng, Energy and Industry Minister Yasmin Umar, and Second Finance Minister Rahman Ibrahim. \nOther ministers replaced include the education, development and communications ministers. \nTwo women promoted to deputy ministers in the cabinet took on positions in the prime minister’s office and the education ministry. \nThe sultan, the world’s second-longest reigning monarch, retained the key portfolios of prime minister, defence minister, finance minister and the minister of foreign affairs and trade. \nOnce declared the world’s richest man, the sultan has a firm grip on power in the Muslim-majority country of 400,000 people. \nBrunei does not hold elections but any discontent is assuaged with generous government polices, including zero taxes, subsidised housing and free healthcare and education. \nThe cabinet reshuffle comes ahead of Brunei’s annual parliamentary session, held every March. Reporting by Ain Bandial; Editing by Praveen Menon and Clarence Fernandez", "external_links": [], "published": "2018-01-30T12:16:00.000+02:00", "crawled": "2018-01-30T12:41:52.018+02:00", "highlightTitle": ""}