{"organizations": [], "uuid": "e7f791bbbd6ec57e20931bc148750d18247dceed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-eagle-bancorp-inc-announces-15-point-6-million-in-earnings-with-a-continuing-trend-of-record-operating-earnings-of-30-point.html", "country": "US", "domain_rank": 767, "title": "Eagle Bancorp, Inc. Announces $15.6 Million in Earnings With a Continuing Trend of Record Operating Earnings of $30.2 Million for the Fourth Quarter 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T06:04:00.000+02:00", "replies_count": 0, "uuid": "e7f791bbbd6ec57e20931bc148750d18247dceed"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-eagle-bancorp-inc-announces-15-point-6-million-in-earnings-with-a-continuing-trend-of-record-operating-earnings-of-30-point.html", "ord_in_thread": 0, "title": "Eagle Bancorp, Inc. Announces $15.6 Million in Earnings With a Continuing Trend of Record Operating Earnings of $30.2 Million for the Fourth Quarter 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "md.", "sentiment": "none"}, {"name": "bethesda", "sentiment": "none"}], "organizations": [{"name": "eagle bancorp, inc.", "sentiment": "neutral"}, {"name": "eagle bancorp, inc", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}, {"name": "eaglebank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BETHESDA, Md., Jan. 17, 2018 (GLOBE NEWSWIRE) -- Eagle Bancorp, Inc. (the “Company”) (NASDAQ:EGBN), the parent company of EagleBank, today announced quarterly net income of $15.6 million ($30.2 million on an operating basis) for the three months ended December 31, 2017, a 39% decrease on a net income basis (and a 17% increase on an operating basis) over the $25.7 million net income for the three months ended December 31, 2016. Quarterly income on an operating basis continued a 36 quarter trend of record earnings.\nFor the fourth quarter and full year 2017, operating earnings exclude one time charges to reduce the carrying value of deferred tax assets by $14.6 million, required as a result of the reduction in corporate income tax rates to 21% in the Tax Cuts and Jobs act of 2017 (“Tax Reform”). Tax Reform was enacted in late December and is further discussed below. Where appropriate, parenthetical references refer to operating earnings, which the Company believes are more relevant comparisons to prior period results of operations. Reconciliations of GAAP earnings to operating earnings are contained in the tables that follow.\nNet income for the three months ended December 31, 2017 was $0.46 per basic and $0.45 per diluted common share ($0.88 per basic and diluted common share on an operating basis), as compared to $0.76 per basic common share and $0.75 per diluted common share for the same period in 2016.\nFor the year ended December 31, 2017, the Company’s net income was $100.2 million ($114.8 million on an operating basis), a 3% increase (18% increase on an operating basis) over the $97.7 million for the year ended December 31, 2016.\nNet income was $2.94 per basic common share and $2.92 per diluted common share for the year ended December 31, 2017 ($3.36 per basic common share and $3.35 per diluted common share on an operating basis), as compared to $2.91 per basic common share and $2.86 per diluted common share for 2016.\n“We are very pleased to report a continued trend of balanced and consistently strong financial performance,” noted Ronald D. Paul, Chairman and Chief Executive Officer of Eagle Bancorp, Inc. “Our net income in the fourth quarter (excluding the adjustment reflecting the impact of Tax Reform) represents 36 consecutive quarters of increasing operating earnings dating back to the first quarter of 2009. This strong financial performance has resulted from a combination of steady average balance sheet growth and related revenue growth, coupled with a strong net interest margin. Additionally, we have sustained very solid asset quality over an extended period along with favorable operating leverage.” Loan balances increased 5% in the fourth quarter while deposit balances decreased by 1% from September 30, 2017. Mr. Paul added, “While we experienced declines in deposit balances late in 2017, we consider average balances more indicative of our growth performance, since maintaining favorable averages translates to improved revenue. During the fourth quarter of 2017, average deposits increased 5% over the third quarter and average loans increased 4%. Average growth in our balance sheet combined with a continuing favorable net interest margin contributed to revenue growth increases of 15% in the fourth quarter 2017 over the fourth quarter of 2016 and by 8% over the third quarter of 2017. For the full year 2017 over 2016, revenue growth was 10%. The net interest margin in the fourth quarter was stable at 4.13% and favorable as compared to peer banking companies. The loan pipeline remains strong, and the yield on the loan portfolio in the fourth quarter was 2 basis points higher at 5.21% versus 5.19% for the third quarter, as the Company’s loan portfolio yield continues to benefit from both higher general market interest rates and disciplined loan pricing. Importantly, our credit quality remained very strong in the fourth quarter as the level of nonperforming assets was just 0.19% of total assets at December 31, 2017. Mr. Paul added, “the Company’s operating efficiency, another key driver of financial performance, improved even further in the fourth quarter from a strong position. Noninterest expense in the fourth quarter of 2017 was less than 1% over the same period in 2016 while total revenue increased by 15% resulting in a continued favorable efficiency ratio.” For the fourth quarter in 2017, the efficiency ratio was 35.12%, as compared to 37.49% in the third quarter of 2017 and 40.22% for the fourth quarter of 2016. Mr. Paul added, “The Company remains committed to cost management measures and strong productivity.”\nPre-tax, pre-provision income was $55.1 million for the fourth quarter of 2017 a 24% increase over $44.3 million for the fourth quarter of 2016 and a 12% increase over the $49.2 million for the third quarter of 2017.\nThe annualized return on average assets (“ROAA”) was 0.82% (1.60% on an operating basis) for the fourth quarter of 2017 and 1.41% (1.62% on an operating basis) for the twelve months ended December 31, 2017. The annualized return on average common equity (“ROACE”) was 6.49% (12.57% on an operating basis) for the fourth quarter of 2017 and 11.06% (12.67% on an operating basis) for the year ended December 31, 2017.\nFor the full year 2017, loans grew 13% and averaged 11% higher. For the full year 2017, deposits increased 2% and averaged 8% higher. For the full year 2017, total revenue increased by 10% while total noninterest expenses increased 3%.\nPre-tax, pre-provision income was $194.7 million for the full year 2017 as compared to $170.4 million for the full year 2016, a 14% increase.\nFor the fourth quarter of 2017, the net interest margin was 4.13%, as compared to 4.14% for the third quarter of 2017 and 3.95% for the fourth quarter of 2016. The average liquidity position was higher in the fourth quarter due to higher average deposit growth than loan growth and contributed to the 1 basis point decline in the net interest margin quarter over quarter.\nFor the full year of 2017, the net interest margin was 4.15% as compared to 4.16% for the year ended December 31, 2016. Higher short and intermediate term market interest rates during 2017 resulted in higher yields on loans and investments and higher funding costs. These interest rate moves also validated the Company’s strategy of balanced interest rate risk management. Mr. Paul noted, “In the current environment, the Company has continued its emphasis on disciplined pricing for both new loans and funding sources, which has resulted in the Company maintaining a superior net interest margin.”\nAsset quality measures improved further in the fourth quarter of 2017 from an already solid position. At December 31, 2017, the Company’s nonperforming loans amounted to $13.2 million (0.21% of total loans) as compared to $16.6 million (0.27% of total loans) at September 30, 2017 and $17.9 million (0.31% of total loans) at December 31, 2016. Nonperforming assets amounted to $14.6 million (0.19% of total assets) at December 31, 2017 compared to $18.0 million (0.24% of total assets) at September 30, 2", "external_links": ["https://www.globenewswire.com/Tracker?data=z7zodcMNXnunmCnNwlsa3R2OtRr7TT39gF4dPGSoDew9qIE9FMreExJmahF_rr5_NGh3TCQ6Sv4flyGOjAGK_6xLOq8OjQLWo2NgsP5oDLA=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/dac9b96c-51f9-4d1f-93ab-4ae766fb4bc8"], "published": "2018-01-18T06:04:00.000+02:00", "crawled": "2018-01-18T08:20:08.056+02:00", "highlightTitle": ""}