{"organizations": [], "uuid": "0a6d03172edb37b869a14194a284ba8d0bada61c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/australia-stocks-midday/australia-shares-flat-in-low-volume-trade-nz-shut-for-holiday-idUSL4N1OX04Y", "country": "US", "domain_rank": 408, "title": "Australia shares flat in low-volume trade; NZ shut for holiday", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T03:18:00.000+02:00", "replies_count": 0, "uuid": "0a6d03172edb37b869a14194a284ba8d0bada61c"}, "author": "", "url": "https://www.reuters.com/article/australia-stocks-midday/australia-shares-flat-in-low-volume-trade-nz-shut-for-holiday-idUSL4N1OX04Y", "ord_in_thread": 0, "title": "Australia shares flat in low-volume trade; NZ shut for holiday", "locations": [], "entities": {"persons": [{"name": "chris weston", "sentiment": "none"}, {"name": "chris thomas", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "nz", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "rio tinto", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "bhp billiton", "sentiment": "none"}, {"name": "s&p/asx", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 1:18 AM / in 6 hours Australia shares flat in low-volume trade; NZ shut for holiday Chris Thomas 3 Min Read \nJan 2 (Reuters) - Australian shares were little changed on their first day of trade in 2018 on Tuesday, struggling for cues as major financial markets worldwide remained shut for the New Year’s holiday. \nThe S&P/ASX 200 index was marginally higher at 0028 GMT. The benchmark fell 0.4 percent on the last trading day of 2017, but logged a 7 percent gain for the year. \n“We had anticipated the market to be down a bit more than where we are...there’s a bit of buying coming back in, but the volumes are non-existent,” said Chris Weston, institutional dealer at IG Markets. \n“Everyone’s looking ahead and trying to find out what the trends are going to be... the immediate catalysts are probably going to come from European and U.S. data.” \nMaterial stocks accounted for most the gains on the index, with iron ore miners BHP Billiton and Rio Tinto edging up 0.4 percent each. \nRio touched its highest since Aug. 2011, and was set for its 10th straight session of gains, while BHP headed for its sixth session on top. \n“If you look at the last three months or so, materials and energy stocks were the place to be, and it looks like that’s spilling over into the new year,” said Weston. \nChinese iron ore futures jumped nearly 3 percent on Friday as investors bet steel mills in the world’s top buyer of the ore will restock the raw material ahead of an expected end in March to steel production curbs imposed to cut pollution. \nGold miners also enjoyed modest gains as the metal touched a three-month high on Friday thanks to a weak dollar, political tensions and receding concerns over the impact of U.S. interest rate hikes. \nNewcrest Mining was among the best performers on the index, climbing as much as 1.5 percent. \nShares of Brambles rose 1.8 percent in their biggest single-day spike in almost six weeks after the pallets and container company said it estimates a $125 million to $155 million one-time benefit due to the passing of new U.S. tax laws. \nNew Zealand is closed for a public holiday, with the financial market reopening for trade on Wednesday. The NZ benchmark S&P/NZX 50 index gained 22 percent in 2017 and extended its annual winning streak to a sixth consecutive year. Reporting by Chris Thomas in Bengaluru; Editing by Sam Holmes", "external_links": [], "published": "2018-01-02T03:18:00.000+02:00", "crawled": "2018-01-02T03:47:27.017+02:00", "highlightTitle": ""}