{"organizations": [], "uuid": "2ec9ec5ebbc553b92e89cce3bdaa158e3827c522", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219564784&w=1200&r=LYNXMPEE040IQ", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-orsted-lawsuit/orsted-versus-orsted-scientists-descendants-to-sue-company-over-name-idUKKBN1EU0X0", "country": "US", "domain_rank": 408, "title": "Orsted versus Orsted - scientist's descendants to sue company over name", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T12:13:00.000+02:00", "replies_count": 0, "uuid": "2ec9ec5ebbc553b92e89cce3bdaa158e3827c522"}, "author": "", "url": "https://uk.reuters.com/article/us-orsted-lawsuit/orsted-versus-orsted-scientists-descendants-to-sue-company-over-name-idUKKBN1EU0X0", "ord_in_thread": 0, "title": "Orsted versus Orsted - scientist's descendants to sue company over name", "locations": [], "entities": {"persons": [{"name": "dong", "sentiment": "none"}, {"name": "henrik poulsen", "sentiment": "none"}, {"name": "hans christian orsted", "sentiment": "none"}], "locations": [{"name": "copenhagen", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "gentofte", "sentiment": "none"}], "organizations": [{"name": "reuters tv united", "sentiment": "negative"}, {"name": "danish maritime", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "commercial high court", "sentiment": "none"}, {"name": "dong energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Reuters TV United States January 5, 2018 / 10:19 AM / a few seconds ago Orsted versus Orsted: scientist's descendants to sue company over name Reuters Staff 3 Min Read \nCOPENHAGEN (Reuters) - The descendants of Danish scientist Hans Christian Orsted will take legal action on Friday against one of Denmark’s biggest companies over its decision to change its name to Orsted ( ORSTED.CO ), their lawyer said. FILE PHOTO: DONG CEO Henrik Poulsen speaks to employees after revealing the company's new name Orsted at its headquarters in Gentofte, Denmark October 2, 2017. REUTERS/Stine Jacobsen/File Photo \nDONG Energy, the world’s largest developer of offshore wind farms, in October renamed itself Orsted as part of its shift to renewable energy from oil and gas. DONG was short for Danish Oil and Natural Gas. \nIt said the new name, chosen from more than 3,000 alternatives, was inspired by 19th century Danish physicist Hans Christian Orsted, who discovered electromagnetism. \nBut three direct descendants of Orsted will file a writ of summons with the Danish Maritime and Commercial High Court on Friday, Jens Jakob Bugge, the lawyer for H.C. Orsted’s great-great-great-grandchild Soren Peter Orsted told Reuters. \nOrsted’s descendants believe that the company is in breach of the Danish companies act by using a family name. \nSoren Peter Orsted told Danish newspaper Berlingske that the name change was a “provocation” and insulting to scientist Orsted who had always made an effort to stay independent and out of commercial business. \n“The law must apply for both big and small and since we think we have a good case and that the law speaks to our advantage, I see a scenario where they would have to change the name,” Orsted told Berlingske. \nOrsted, Denmark’s fourth-largest company by market value, said it was confident of its right to use the name and had used the name H.C. Orsted for one of its power stations in Copenhagen for more than 100 years. \n“We have conducted a very thorough legal investigation before we chose the name, and in this context we are fully confident that we have the right to use the name Orsted,” communications director Martin Barlebo said in a written comment. \n“We see our choice of name as tribute to H.C. Orsted and we have greatly emphasized using the name in a respectful way in relation to the scientist,” he added. \nAccording to Statistics Denmark around 400 people in Denmark have Orsted as a surname. Reporting by Stine Jacobsen. Editing by Jane Merriman", "external_links": [], "published": "2018-01-05T12:13:00.000+02:00", "crawled": "2018-01-05T12:28:23.000+02:00", "highlightTitle": ""}