{"organizations": [], "uuid": "5bd73ae8bac2f4aa71f5e9bfe699c4ee24163410", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-909977892.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/26/netflix-david-wain-a-stupid-and-futile-gesture/", "country": "US", "domain_rank": 1196, "title": "David Wain on Netflix, New Film 'A Futile and Stupid Gesture' | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-26T12:59:00.000+02:00", "replies_count": 0, "uuid": "5bd73ae8bac2f4aa71f5e9bfe699c4ee24163410"}, "author": "Tom Huddleston Jr.", "url": "http://fortune.com/2018/01/26/netflix-david-wain-a-stupid-and-futile-gesture/", "ord_in_thread": 0, "title": "David Wain on Netflix, New Film 'A Futile and Stupid Gesture' | Fortune", "locations": [], "entities": {"persons": [{"name": "david wain", "sentiment": "negative"}, {"name": "wain", "sentiment": "none"}, {"name": "john belushi", "sentiment": "none"}, {"name": "gilda radner", "sentiment": "none"}, {"name": "doug kenney", "sentiment": "none"}, {"name": "harold ramis", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}], "organizations": [{"name": "netflix", "sentiment": "negative"}, {"name": "national lampoon", "sentiment": "none"}, {"name": "harvard", "sentiment": "none"}, {"name": "mtv", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "10:59 AM EST \nDavid Wain is no stranger to an underdog story. \nThe director has spent his career creating lower-budget, indie films and TV shows that defied the odds to become cult hits that eventually found large audiences, from MTV’s sketch comedy show The State to the Wet Hot American Summer movie and subsequent TV series . Wain’s latest project is A Futile and Stupid Gesture , a biopic about Doug Kenney, a lesser-known but influential comedy writer who co-founded National Lampoon magazine in the 1970s. The film, which follows the origin story of a magazine that started as a collegiate publication at Harvard and went on to help launch the Hollywood careers of comedians like John Belushi, Gilda Radner, and Harold Ramis, among many others. \nThe movie premieres on Netflix on Friday. \nGet Data Sheet , Fortune’s technology newsletter. \nA Futile and Stupid Gesture is only David Wain’s latest collaboration with Netflix, as the subversive director has found a new home with the streaming giant after creating two seasons of a TV series spin-off from Wet Hot American Summer for Netflix over the past three years. \nWain talked to Fortune about how filmmaking has changed in recent years with the explosion of streaming services commissioning and acquiring digital programming. “It’s an interesting time right now to be a creator, because there is just so much content out there,” he said. “Obviously, it’s good, because that means there’s more platforms and more opportunity to make things and, perhaps, get paid to make things. But, because there’s so much, it makes it hard to stand out.” \nUnlike Wain’s past films, A Futile and Stupid Gesture will forego a traditional theatrical release to stream directly online (which is the norm for many Netflix original films). The director joked that such a release strategy used to be “the kiss of death” for movies looking to make a profit. “But, now it’s really the standard, particularly for this kind of medium-budget, non-tentpole kind of film,” he said. \nMost importantly, having Netflix as the film’s distributor means the movie will have the potential to be seen, instantly, by a massive audience worldwide, including many of viewers who have already watched Wain’s other Netflix titles on the service. “The Netflix release is going to make it be seen by millions of people around the world in a way that an independent theatrical release never would have done in the past,” Wain said. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-26T12:59:00.000+02:00", "crawled": "2018-01-26T19:11:27.001+02:00", "highlightTitle": ""}