{"organizations": [], "uuid": "d34474cff462b6762d7c6de67f91b6cccb5162e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219571438&w=1200&r=LYNXMPEE040K8", "site_section": "http://feeds.reuters.com/reuters/INtopNews", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/us-usa-weather/u-s-northeast-digs-out-of-blizzard-as-brutal-cold-bears-down-idINKBN1EU0YA", "country": "US", "domain_rank": 408, "title": "U.S. Northeast digs out of blizzard as brutal cold bears down", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T13:20:00.000+02:00", "replies_count": 0, "uuid": "d34474cff462b6762d7c6de67f91b6cccb5162e1"}, "author": "", "url": "https://in.reuters.com/article/us-usa-weather/u-s-northeast-digs-out-of-blizzard-as-brutal-cold-bears-down-idINKBN1EU0YA", "ord_in_thread": 0, "title": "U.S. Northeast digs out of blizzard as brutal cold bears down", "locations": [], "entities": {"persons": [{"name": "reuters/shannon stapleton  from baltimore", "sentiment": "none"}, {"name": "scott malone", "sentiment": "none"}, {"name": "jonathan allen", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "long beach", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "east", "sentiment": "none"}], "organizations": [{"name": "u.s. northeast", "sentiment": "negative"}, {"name": "national weather service", "sentiment": "none"}, {"name": "min read  boston/new york", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON/NEW YORK (Reuters) - Street crews in the U.S. Northeast raced through the night into Friday to clear snow-clogged streets after a powerful blizzard and restore power to homes ahead of a brutal cold spell that has killed more than a dozen people.\nFrom Baltimore to Caribou, Maine, efforts were under way to clear roadways of ice and snow as wind chill temperatures were to plunge during the day, reaching -40 F (-40 C) in some parts after sundown, according to the National Weather Service.\nThe brutal cold was forecast to reach from New England across to the Midwest and down to the Carolinas, forecasters warned, adding that low-temperature records could be broken across the broad region in the coming days.\n“In a lot of New England, the highs will be in the single digits and the teens today, with intense wind chills,” said Dan Pydynowski, a meteorologist with private forecasting service Accuweather. The cold will extend down to the mid-Atlantic states, he said.\n“It can be very dangerous,” Pydynowski said. “Any kind of exposed skin can freeze in a couple of minutes.”\nThe cold also raised the risk that road salt would not work to melt ice, possibly leaving highway crews to shift over to sanding roads to improve traction, Massachusetts transportation officials said.\nUtility companies across the East worked to repair downed power lines early on Friday as about 31,000 customers remained without electricity, down from almost 80,000 the day before, and issued warnings that temperatures may become dangerously low.\n“If the temperature in your home begins to fall, we recommend taking shelter elsewhere until service can be restored,” National Grid power company, which serves Massachusetts, said on Twitter. “You can find warming centers by contacting local authorities.”\n17 DEATHS A pedestrian walks through blinding snow across the Brooklyn Bridge in New York City. REUTERS/Darren Ornitz The storm, with winds gusts of more than 70 miles per hour (113 kph), dumped a foot (30 cm) or more of snow throughout the region, including Boston and parts New Jersey and Maine, where heavy snow continued to fall early on Friday.\nThe wintry weather has been blamed for at least 17 deaths in the past few days, including three in North Carolina traffic accidents and three in Texas because of the cold.\nSchools in Boston and Baltimore canceled classes Friday while New York was open and Newark, New Jersey, schools were to open two hours late.\nSlideshow (21 Images) Commuter railways serving New York and Boston’s suburbs were reporting extensive delays, as they worked to repair frozen equipment and clear snow-covered tracks.\nThe storm on Thursday caused a 3-foot (0.9-metre) tidal surge that flooded the area around Boston’s historic Long Wharf with icy seawater. Firefighters used an inflatable raft to rescue one motorist from a car submerged in water up to its door handles, Boston Fire Commissioner Joseph Finn told reporters.\nCommunities outside Boston, including Scituate, also saw extensive flooding, with parking lots filled with water damaging unoccupied vehicles.\nNew York’s John F. Kennedy and LaGuardia airports resumed flights on Friday after closing in whiteout conditions a day earlier. More than 1,000 U.S. flights had been canceled early on Friday with New York’s three major airports and Boston Logan International Airport seeing the most cancellations.\nThe storm was powered by a rapid plunge in barometric pressure that some weather forecasters called a bombogenesis, or a “bomb cyclone.” It brought high winds and swift, heavy snowfall.\nNearly 500 members of the National Guard were activated along the East Coast to assist with emergency response, including 200 in New York state, the U.S. Department of Defense said in a statement.\nOfficials reported traffic accidents throughout the Northeast and the storm’s reach extended to eastern Canada.\nAdditonal reporting by Brendan O'Brien; Editing by Richard Balmforth and Bill Trott\n ", "external_links": [], "published": "2018-01-05T13:20:00.000+02:00", "crawled": "2018-01-05T13:38:22.022+02:00", "highlightTitle": ""}