{"organizations": [], "uuid": "16aabe3ae0de743ea0a4a54a82c159e28c9bbeb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224108054&w=1200&r=LYNXMPEE0L0PM", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-india-padmaavat-release/two-indian-states-urge-top-court-to-permit-ban-on-screening-of-controversial-film-idUSKBN1FB12F", "country": "US", "domain_rank": 408, "title": "Two Indian states urge top court to permit ban on screening of controversial film", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T11:53:00.000+02:00", "replies_count": 0, "uuid": "16aabe3ae0de743ea0a4a54a82c159e28c9bbeb9"}, "author": "", "url": "https://www.reuters.com/article/us-india-padmaavat-release/two-indian-states-urge-top-court-to-permit-ban-on-screening-of-controversial-film-idUSKBN1FB12F", "ord_in_thread": 0, "title": "Two Indian states urge top court to permit ban on screening of controversial film", "locations": [], "entities": {"persons": [{"name": "narendra modi", "sentiment": "none"}, {"name": "padmavati", "sentiment": "none"}, {"name": "sanjay leela bhansali", "sentiment": "none"}], "locations": [{"name": "madhya pradesh", "sentiment": "none"}, {"name": "rajasthan", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "bharatiya janata party", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "bjp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW DELHI (Reuters) - India’s Supreme Court will hear an appeal on Tuesday against a controversial Bollywood film, for the second time in as many weeks, as two states seek to re-impose a ban on the movie, based on an epic poem about a 14th-century queen.\nThe film “Padmaavat” ran into trouble after groups critical of the project accused its director, Sanjay Leela Bhansali, of distorting history by portraying a Muslim ruler as the “lover” of Queen Padmavati of the Hindu Rajput warrior clan.\nMonday’s action comes after the Supreme Court last week cleared the way for the film’s release and blocked state governments from imposing bans on it, saying it had been cleared for release by India’s censor panel.\nThe central state of Madhya Pradesh and the northwestern state of Rajasthan, both ruled by Prime Minister Narendra Modi’s Bharatiya Janata Party (BJP), asked the court to modify its order for nationwide release of the film.\n“We will hear the pleas tomorrow,” Chief Justice Dipak Misra, who is heading a panel of three supreme court judges that will hear the case, said on Monday.\nIn its request to the court, the government of Rajasthan cited the need to prevent public unrest, in view of sentiment among the Rajput community.\nThe states’ move comes against a backdrop of continued protests by right-wing groups, such as the Shri Rajput Karni Sena, which blocked traffic in parts of northern India on Sunday and shouted slogans demanding for a complete ban on the film.\nMembers of a Rajput community group called the Sarwa Kshatriya Mahasabha in the central state of Chhattisgarh have also threatened to disrupt screenings in theatres there.\nThe group plans to hold a protest meeting on Monday in Raipur, the state capital, to warn cinema owners, and will organize a human chain on Wednesday to demand a complete ban.\n“We have already told the cinema-halls not to screen the film,” Rakesh Singh Bais, the group’s president, told Reuters. “If any one does, he will be responsible for the consequences.”\nReporting by Suchitra Mohanty and Jatindra Dash; Writing by Swati Bhat; Editing by Clarence Fernandez\n ", "external_links": [], "published": "2018-01-22T11:53:00.000+02:00", "crawled": "2018-01-22T12:11:48.023+02:00", "highlightTitle": ""}