{"organizations": [], "uuid": "f4c26cf9f4dd48b9bca9b6e9dc80d10b78b4a004", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-zs-acquires-bases-pharmaceutical-forecasting-assets.html", "country": "US", "domain_rank": 767, "title": "ZS Acquires BASES Pharmaceutical Forecasting Assets", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-02T19:02:00.000+02:00", "replies_count": 0, "uuid": "f4c26cf9f4dd48b9bca9b6e9dc80d10b78b4a004"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-zs-acquires-bases-pharmaceutical-forecasting-assets.html", "ord_in_thread": 0, "title": "ZS Acquires BASES Pharmaceutical Forecasting Assets", "locations": [], "entities": {"persons": [{"name": "alex fuchs", "sentiment": "none"}, {"name": "nielsen", "sentiment": "none"}], "locations": [{"name": "ill.", "sentiment": "none"}, {"name": "evanston", "sentiment": "none"}, {"name": "zs", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "EVANSTON, Ill., Jan. 2, 2018 /PRNewswire/ -- ZS today announced it has acquired the assets of BASES Pharmaceutical Forecasting from Nielsen.\nThe transaction brings BASES's pharmaceutical launch product and direct-to-consumer forecasting tools, proprietary normative databases, and strong and long-standing reputation into ZS's forecasting practice—already one of the largest and most renowned in the industry. Nielsen will continue to provide all other BASES products and services outside of BASES pharmaceutical forecasting.\nZS looks forward to providing clients with a consolidated offering that covers both long-term and short-term forecasts. With comprehensive benchmarks of pre-launch pharmaceutical prescription products, ZS will now offer more robust pre-launch forecasts. In addition, these tools provide more direct links between an organization's promotional plan and sales results.\n\"These new assets and expertise complement the rest of our forecasting offerings, giving us great new ways to help clients prepare for a product launch,\" said Alex Fuchs, managing principal of ZS's Forecasting Practice . \"We see a tremendous opportunity to leverage the historical norms with our own launch planning frameworks to add even more insight into the success drivers behind each product launch and new direct-to-consumer campaigns.\"\nZS will integrate BASES Pharmaceutical Forecasting into its existing pharmaceutical forecasting offerings. With these new assets in its toolkit, ZS will bridge long-term strategic and in-line forecasting with an approach that is designed to help clients during the most critical moments of their product lifecycles. And, pharmaceutical forecasts will now be informed by several decades of data and validation.\nZS is committed to supporting BASES pharmaceutical clients through this transition and continuing to offer best-in-class service across the pharmaceutical industry.\nAbout ZS\nZS is the world's largest firm focused exclusively on helping companies improve overall performance and grow revenue and market share through end-to-end sales and marketing solutions—from customer insights and strategy to analytics, operations and technology. More than 5,000 ZS professionals in 22 offices worldwide draw on deep industry and domain expertise to deliver impact for clients across multiple industries. To learn more, visit www.zs.com or the Life at ZS blog .\nContact: Jessica Moran, jmoran@golin.com\nView original content: http://www.prnewswire.com/news-releases/zs-acquires-bases-pharmaceutical-forecasting-assets-300576464.html\nSOURCE ZS", "external_links": ["http://info.zs.com/lifeatzs", "https://www.zs.com/", "https://www.zs.com/solutions/expertise/marketing/forecasting.aspx#Business-Issues", "http://www.zs.com/", "http://www.prnewswire.com/news-releases/zs-acquires-bases-pharmaceutical-forecasting-assets-300576464.html"], "published": "2018-01-02T19:02:00.000+02:00", "crawled": "2018-01-02T19:09:59.000+02:00", "highlightTitle": ""}