{"organizations": [], "uuid": "cc0d488484b47b3f87821a36098eb7925e4bad5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-a10-networks-announces-postponement-of-2017-fourth-quarter-and-full-year-earnings-release-and-conference-call.html", "country": "US", "domain_rank": 767, "title": "A10 Networks Announces Postponement of 2017 Fourth Quarter and Full Year Earnings Release and Conference Call", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T00:15:00.000+02:00", "replies_count": 0, "uuid": "cc0d488484b47b3f87821a36098eb7925e4bad5b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-a10-networks-announces-postponement-of-2017-fourth-quarter-and-full-year-earnings-release-and-conference-call.html", "ord_in_thread": 0, "title": "A10 Networks Announces Postponement of 2017 Fourth Quarter and Full Year Earnings Release and Conference Call", "locations": [], "entities": {"persons": [], "locations": [{"name": "san jose", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "aten", "sentiment": "neutral"}, {"name": "nyse", "sentiment": "neutral"}, {"name": "audit committee", "sentiment": "none"}, {"name": "company's audit committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN JOSE, Calif.--(BUSINESS WIRE)-- A10 Networks, Inc. (NYSE:ATEN) (the \" Company \"), a Secure Application Services™ company, today announced that it is postponing its 2017 fourth quarter and full year earnings announcement and conference call, originally scheduled for Feb. 8, 2018.\nIn the fourth quarter of 2017, the Company determined that a mid-level employee within its finance department had violated the Company's Insider Trading Policy and Code of Conduct. As a result, the Company, with the assistance of outside counsel, conducted an email review and additional procedures to ensure the accuracy of its reporting of financial information for 2017. Such review and procedures did not identify matters that required material adjustments to be made. Nonetheless, the Company's Audit Committee determined that further review and procedures relating to certain accounting and internal control matters should be undertaken. The Audit Committee's investigation, which is being conducted with the assistance of outside counsel, is principally focused on certain revenue recognition matters from the fourth quarter of 2015 through the fourth quarter of 2017 inclusive.\nThe investigation is in its early stages. The Company is not able to provide a date as to when it will be completed, nor provide any assurance that the Company will not determine that material adjustments to its past financial statements are appropriate.\nAt the conclusion of the Audit Committee's investigation, the Company will announce the scheduling of a conference call to discuss full financial results for the 2017 fourth quarter and full year.\nSafe Harbor Statement\nThis press release contains within the meaning of the federal securities laws. You can identify these statements by our use of such words as \"will,\" \"expects,\" \"plans,\" \"intends,\" \"believes,\" and similar expressions that do not relate to historical matters. Forward-looking statements in this press release include, but are not limited to, statements, inferences, beliefs or expectations regarding: the pending investigation, including its timing and results; consequences and/or effects of the investigation, including on previously announced Company financial results and any adjustments thereto; timing of completion of the investigation or the announcement of the Company's 2017 fourth quarter and full year financial results; and the Company's plans, objectives and intentions that are not historical facts generally.\nThese statements reflect the current intent, beliefs and expectations of the Company's management. They involve known and unknown risks, uncertainties and other factors that may cause future events, including the Company's performance and results to differ expressed or implied by the . Factors that may cause actual future events to differ from those in the include the outcome of the pending investigation and the possibility of adjustments, including material adjustments, to the Company's financial statements as the investigation progresses. See also the factors described under the heading \"Item 1A -- Risk Factors\" in our Annual Report on Form 10-K for the year ended December 31, 2016, and in our Quarterly Report on Form 10-Q for the quarter ended September 30, 2017, or as otherwise described in our other public filings. The Company's results may also be affected by factors of which the Company is not currently aware. The Company may not update these , even though its situation may change in the future, unless it has obligations under the federal securities laws to update and disclose material developments related to previously disclosed information.\nAbout A10 Networks\nA10 Networks (NYSE:ATEN) is a Secure Application Services™ company, providing a range of high-performance application networking solutions that help organizations ensure that their data center applications and networks remain highly available, accelerated and secure. Founded in 2004, A10 Networks is based in San Jose, Calif., and serves customers globally with offices worldwide. For more information, visit: www.a10networks.com and @A10Networks .\nThe A10 logo, A10 Networks, A10 Harmony, Thunder and A10 Lightning and Secure Application Services are trademarks or registered trademarks of A10 Networks, Inc. in the United States and other countries. All other trademarks are the property of their respective owners.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130006226/en/\nInvestor Contact:\nThe Blueshirt Group\nMaria Riley & Chelsea Lish, 415-217-7722\ninvestors@a10networks.com\nSource: A10 Networks, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Fa10networks&esheet=51751064&newsitemid=20180130006226&lan=en-US&anchor=%40A10Networks&index=2&md5=75e5eb536ac6de7184c586617d6e1f23", "http://www.businesswire.com/news/home/20180130006226/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.a10networks.com&esheet=51751064&newsitemid=20180130006226&lan=en-US&anchor=www.a10networks.com&index=1&md5=c9e4a88b612e29181c4c3cdf812180b8"], "published": "2018-01-31T00:15:00.000+02:00", "crawled": "2018-01-31T03:09:36.003+02:00", "highlightTitle": ""}