{"organizations": [], "uuid": "7eee2c8ec15324ba79912c6eb9cd89cd63da778d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222685438&w=1200&r=LYNXMPEE0G0JV", "site_section": "https://www.reuters.com/finance/currencies", "section_title": "Currency Converter, Currencies News | Reuters.com", "url": "https://www.reuters.com/article/uk-britain-sterling/sterling-pauses-after-rally-as-traders-watch-brexit-developments-idUSKBN1F612L", "country": "US", "domain_rank": 408, "title": "Sterling pauses after rally as traders watch Brexit developments", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-17T17:57:00.000+02:00", "replies_count": 0, "uuid": "7eee2c8ec15324ba79912c6eb9cd89cd63da778d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-britain-sterling/sterling-pauses-after-rally-as-traders-watch-brexit-developments-idUSKBN1F612L", "ord_in_thread": 0, "title": "Sterling pauses after rally as traders watch Brexit developments", "locations": [], "entities": {"persons": [{"name": "jean-claude juncker", "sentiment": "none"}, {"name": "hewson", "sentiment": "none"}, {"name": "michael hewson", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "eu commission", "sentiment": "none"}, {"name": "cmc markets", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 9:57 AM / in an hour Sterling pauses after rally as traders watch Brexit developments Tommy Wilkes , Jemima Kelly 3 Min Read \nLONDON (Reuters) - Sterling steadied close to its highest levels against the dollar since Britain’s vote to leave the European Union in 2016 on Wednesday, as traders took profits and awaited the latest developments in Brexit negotiations. \nThe pound reached as high as $1.3836 in Asian trading, its highest levels since June 24 2016, with the better-than-expected economic performance of the British economy and hopes that Britain will soon agree a transition deal with Brussels supporting sterling. \nBritish unemployment is likely to fall further than the Bank of England and most other economists expect this year, pushing pay growth to near its fastest rate since the financial crisis, BoE policymaker Michael Saunders said on Wednesday. \nSterling was trading around the $1.38 mark by 1450 GMT, flat on the day. \n“While the pound could venture higher in the near term, it must be kept in mind that the currency still remains highly sensitive to political and Brexit developments,” said FXTM research analyst Lukman Otunuga. \n“A decisive breakout above $1.3850 could invite an appreciation higher towards ... $1.40,” he added. \nThe BoE’s Saunders stuck close to existing BoE language that interest rates are likely to need to rise further over time in his speech, and that any increases would be “limited and gradual”. \nDespite Brexit uncertainty, and the prospect of interest rates remaining close to record lows for a sustained period of time, Michael Hewson, chief analyst at CMC Markets, is bullish on the pound. \nHe said the only event that could send sterling sharply lower was if talks with the EU broke down completely, which he said did not look likely as Brussels looked more amenable to negotiating with Britain. \nThe president of the EU Commission, Jean-Claude Juncker, said on Thursday Britain was welcome to rejoin the trading bloc after it has left next year. \nIn London, the European Union (Withdrawal) Bill is set to complete its first journey through parliament’s lower house some time after 1900 GMT, a milestone on the long road towards cementing the legal foundations of Brexit. \nAgainst the euro, sterling was up a third of a percent at 88.56 pence. \n“The talks about the transition period are due to start in late January, the negotiations on future trade relations following an EU summit at the end of March. Until a reversal of the plans is in sight, euro/sterling will continue to trade in a narrow range,” Commerzbank analysts wrote in a note. Reporting by Tommy Wilkes and Jemima Kelly; Editing by Richard Balmforth", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T17:57:00.000+02:00", "crawled": "2018-01-17T12:00:27.016+02:00", "highlightTitle": ""}