{"organizations": [], "uuid": "763a50b57d674f23575e8731ced6582d4b70aa9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226844184&w=1200&r=LYNXMPEE0U09O", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-rugby-union-bledisloe/all-blacks-take-bledisloe-cup-clash-to-japan-with-eye-on-2019-idUKKBN1FK0KM", "country": "US", "domain_rank": 408, "title": "All Blacks take Bledisloe Cup clash to Japan with eye on 2019", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T08:21:00.000+02:00", "replies_count": 0, "uuid": "763a50b57d674f23575e8731ced6582d4b70aa9c"}, "author": "", "url": "https://uk.reuters.com/article/uk-rugby-union-bledisloe/all-blacks-take-bledisloe-cup-clash-to-japan-with-eye-on-2019-idUKKBN1FK0KM", "ord_in_thread": 0, "title": "All Blacks take Bledisloe Cup clash to Japan with eye on 2019", "locations": [], "entities": {"persons": [{"name": "steve tew", "sentiment": "none"}, {"name": "gton", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "yokohama stadium", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "yokohama", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "national stadium", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "all blacks", "sentiment": "negative"}, {"name": "the all blacks", "sentiment": "none"}, {"name": "nzr", "sentiment": "none"}, {"name": "wallabies", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 6:26 AM / Updated 15 hours ago All Blacks take Bledisloe Cup clash to Japan with eye on 2019 Reuters Staff 3 Min Read \nWELLINGTON (Reuters) - New Zealand Rugby (NZR) have confirmed the third Bledisloe Cup clash with Australia later this year will be held in the Yokohama Stadium, the venue for the 2019 Rugby World Cup final. \nNZR had already signalled they were keen on taking the trans-Tasman clash to Japan after announcing in May that they would face the Brave Blossoms before heading to Europe for the end-of-year tour. \nThe world champion All Blacks face the Wallabies on Oct. 27 in Yokohama before they play Japan at the National Stadium in Tokyo on Nov. 3. \n“We’re delighted to confirm that a Bledisloe Cup test match will be played in Japan for the second time in the history of this great rivalry,” NZR chief executive Steve Tew said in a statement on Wednesday. \n”The last match in 2009 was a fantastic event but this year’s test at the 72,000-seat stadium in Yokohama will be at another level. \n“The All Blacks have huge support in Japan, so the Bledisloe Cup test will be important for the team as we build support ahead of Rugby World Cup 2019.” \nAll Blacks coach Steve Hansen said having two tests on consecutive weeks in Japan would also help the side acclimatise for the 2019 World Cup. \nHansen conducted a similar exercise in 2014 when he primed the All Blacks for their 2015 World Cup-winning campaign by replicating the final four weeks of the tournament on their end-of-season tour, with the team experiencing similar selections, tactics and preparation. \n“It will be great for the team to prepare in two of the Rugby World Cup cities and play at the same venues,” Hansen said of the two clashes in Japan. \n“As well as preparing for a huge Bledisloe Cup test and another important test against Japan, it’ll also give the team a chance to have a really good ‘dummy run’ of the facilities, and experience the unique Japanese culture.” \nThe All Blacks have held the Bledisloe Cup, the symbol of trans-Tasman supremacy, since 2003. \nThe first Bledisloe Cup test, which doubles as the opening clash of the Rugby Championship, is in Sydney on Aug. 18, with the second match at Auckland’s Eden Park on Aug. 25. \nAfter the Japan game, the All Blacks then face Eddie Jones’s England side at Twickenham on Nov. 10, before meeting Ireland in Dublin on Nov. 17. They conclude their tour against Italy on Nov. 24. Reporting by Greg Stutchbury; Editing by John O'Brien", "external_links": [], "published": "2018-01-31T08:21:00.000+02:00", "crawled": "2018-01-31T08:42:44.004+02:00", "highlightTitle": ""}