{"organizations": [], "uuid": "9d91c04e68f2f78f1f4fe02468bc833dc2532e3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226526460&w=1200&r=LYNXMPEE0T0DI", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-china-economy-gdp-provinces/chinese-provinces-with-gdp-of-six-australias-cut-2018-growth-targets-idUSKBN1FJ0V2", "country": "US", "domain_rank": 408, "title": "Chinese provinces with GDP of six Australias cut 2018 growth targets", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T09:35:00.000+02:00", "replies_count": 0, "uuid": "9d91c04e68f2f78f1f4fe02468bc833dc2532e3c"}, "author": "", "url": "https://www.reuters.com/article/us-china-economy-gdp-provinces/chinese-provinces-with-gdp-of-six-australias-cut-2018-growth-targets-idUSKBN1FJ0V2", "ord_in_thread": 0, "title": "Chinese provinces with GDP of six Australias cut 2018 growth targets", "locations": [], "entities": {"persons": [{"name": "australias", "sentiment": "negative"}, {"name": "stella qiu", "sentiment": "none"}, {"name": "ryan woo", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "min read  beijing", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - Seventeen Chinese provinces with combined economic output more than six times the size of Australia’s gross domestic product (GDP) have cut their 2018 growth targets as the world’s second-biggest economy pivots away from growth driven by polluting factories and risky lending.\nEconomists expect China’s overall GDP to grow at a slower pace this year after accelerating for the first time in six years in 2017 as Beijing extends its effort to curb financial risks, cut corporate debt and contain the liabilities of local governments.\nAn anti-pollution drive sweeping across the Asian economic powerhouse and a campaign to move up the value chain will also shutter traditional smokestack industries. A cooler real estate market will slow construction.\nTotal output of the 17 provinces was at $7.29 trillion in 2017, compared with around $1.21 trillion for Australia, a resource-rich economy highly reliant on China for growth.\nAmong the 17 provinces cutting targets are giant provincial economies such as Guangdong, Shandong and Zhejiang, according to a series of official data released in recent days.\nThe southern island province of Hainan has taken the extra step of removing targets for GDP, industrial output and fixed-asset investment for some local cities and towns.\nPresident Xi Jinping said at a twice-every-decade Communist Party Congress in October last year that China will strive for higher quality growth rather obsess over the pace of expansion.\nThe cut in targets is a firm sign local governments are heeding Xi’s call. In previous years, provinces had tended to set goals higher than the national target to showcase grand expansionary plans, economists say.\nFILR PHOTO: A welder works at the Heniu Shipyard in Yunyang county, Chongqing, China August 25, 2017. REUTERS/Stringer/File Photo But China is not about to dispense with targets.\n“Lowering growth targets does not represent no growth, and high-quality growth does not mean no growth,” according to a commentary in the official People’s Daily on Monday.\nPremier Li Keqiang will announce China’s overall economic growth target for 2018 in March. Policy sources previously told Reuters the target will be kept at “around 6.5 percent”, unchanged from last year. GDP expanded 6.9 percent last year.\nSlideshow (2 Images) Twelve out of China’s 31 provinces and municipalities including Beijing, Shanghai, Fujian and Sichuan are keeping their targets unchanged.\nSome economists say China’s push for high-quality growth may very well provide an opportunity for some local governments to straighten out their statistics.\nChinese provinces and cities have long been suspected of massaging numbers. The performance of local government officials is often assessed based on how well their respective economies fare.\nThe local governments of the northern municipality of Tianjin and top coal producing region Inner Mongolia recently admitted that some economic numbers for 2016 were overstated.\n“Cheating is unlikely to be restricted to these provinces,” said Brock Silvers, managing director at Kaiyuan Capital, a Shanghai-based multi-asset advisory firm.\n“Officials may now have an opening to confess prior accounting sins, and that would be a very welcome development, but the pressures leading to those false statistics may still remain.”\nReporting by Stella Qiu and Ryan Woo; Editing by Shri Navaratnam\n ", "external_links": [], "published": "2018-01-30T09:35:00.000+02:00", "crawled": "2018-01-30T10:17:52.000+02:00", "highlightTitle": ""}