{"organizations": [], "uuid": "6d078b9418af4a9f2640e0b6632a79f95a8ce166", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 285}, "facebook": {"likes": 50, "shares": 50, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XC812_39jRM_TOP_20180122191820.jpg", "site_section": "https://www.wsj.com/europe", "section_title": "The Wall Street Journal &amp; Breaking News, Business, Financial and Economic News, World News and Video", "url": "https://www.wsj.com/articles/netflix-says-catch-me-if-you-can-1516667208", "country": "US", "domain_rank": 387, "title": "Netflix Says Catch Me if You Can", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T03:26:00.000+02:00", "replies_count": 0, "uuid": "6d078b9418af4a9f2640e0b6632a79f95a8ce166"}, "author": "Elizabeth Winkler", "url": "https://www.wsj.com/articles/netflix-says-catch-me-if-you-can-1516667208", "ord_in_thread": 0, "title": "Netflix Says Catch Me if You Can", "locations": [], "entities": {"persons": [{"name": "rich greenfield", "sentiment": "none"}], "locations": [], "organizations": [{"name": "netflix", "sentiment": "neutral"}, {"name": "btig research", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "4 COMMENTS Netflix NFLX 10.18% is glowing. “We had a beautiful Q4,” the company preened in its letter to shareholders. It isn’t wrong.\nThe streaming service reported earnings per share of 41 cents, up from 15 cents a year ago, and revenue of $3.29 billion, slightly beating analysts’ estimates of $3.28 billion. Most impressively, it added 8.3 million subscribers globally—the highest in the company’s history—even as it raised its subscription price to $11 a month. That is an 18% year-over-year increase, exceeding the company’s own forecast of 6.3 million subscribers. Shares shot up 9% in after hours trading.\nLegacy media, says Rich Greenfield of BTIG Research, should “be afraid, be very afraid.” With hit content like “Stranger Things” and “The Crown,” Netflix has created a virtuous cycle: Subscribers keep joining at higher price points, allowing the company to spend more on content, which in turn allows them to draw in and retain more subscribers.\nOf the over 8 million new subscribers, 6.36 million came from international markets. They have finally made Netflix’s global segments profitable, delivering earnings of $227 million in 2017.\nWith an eye on competition, the company is accelerating its investments for 2018. It will raise marketing spending to $2 billion and spend $7.5 billion to $8 billion on new content, including 30 international original series in places like Poland, India, and Japan.\n“This is a land grab opportunity,” says Mr. Greenfield. “They see Disney , Apple , Amazon coming, and they’re trying to extend their lead as far as possible before the competition gets going.”\nNetflix is slated to have a long lead indeed. Disney, which hopes to break into international markets with its acquisition of assets from 21st Century Fox , will find that Netflix has already beaten them there. It also plans to launch its own Disney-branded streaming service . Yet this likely won’t happen before late 2019. Meanwhile, Hulu, in which Disney will have a 60% stake after the Fox deal, has added far fewer subscribers than Netflix even though it maintains a lower price.\nHit shows from HBO and Amazon will draw viewers. But content is unique, meaning streaming services can coexist comfortably. As long as Netflix continues producing such popular content, viewers will keep watching, and recently they are watching even more. In 2017, streaming hours per membership grew by 9% year-over-year.\nNetflix’s already ugly balance sheet will look even worse next year with negative free cash flow of $3 billion to $4 billion. The company expects to sell more high-yield bonds. None of that has mattered so far to its soaring stock price—its market cap hit $100 billion—or to its bonds. The company’s letter offers words of comfort to worried investors. “High yield has rarely seen an equity cushion so thick.”", "external_links": ["https://djcs-olympics.s3.amazonaws.com/custom-data-charts/custom-data-chart-wsj-0.8.29.min.js"], "published": "2018-01-23T03:26:00.000+02:00", "crawled": "2018-01-23T10:05:55.028+02:00", "highlightTitle": ""}