{"organizations": [], "uuid": "90a29b9c7511c368cd87e8c310dee8260583b1a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-lumos-data-centers-names-roddy-broadnax-as-senior-solutions-consultant.html", "country": "US", "domain_rank": 767, "title": "Lumos Data Centers Names Roddy Broadnax as Senior Solutions Consultant", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:30:00.000+02:00", "replies_count": 0, "uuid": "90a29b9c7511c368cd87e8c310dee8260583b1a8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-lumos-data-centers-names-roddy-broadnax-as-senior-solutions-consultant.html", "ord_in_thread": 0, "title": "Lumos Data Centers Names Roddy Broadnax as Senior Solutions Consultant", "locations": [], "entities": {"persons": [{"name": "roddy broadnax", "sentiment": "negative"}, {"name": "josh wolff", "sentiment": "none"}, {"name": "roddy", "sentiment": "none"}], "locations": [{"name": "charlotte", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}, {"name": "mid-atlantic", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}], "organizations": [{"name": "globe newswire", "sentiment": "negative"}, {"name": "lumos data centers", "sentiment": "negative"}, {"name": "spirt communications", "sentiment": "none"}, {"name": "sales for spirit communications", "sentiment": "none"}, {"name": "spirit communications", "sentiment": "none"}, {"name": "time warner", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHARLOTTE, N.C., Jan. 24, 2018 (GLOBE NEWSWIRE) -- Lumos Data Centers (“LDC”), a division of Lumos Networks and a leading co-location and data center solutions provider in the Mid-Atlantic, is pleased to name Roddy Broadnax as Senior Solutions Consultant.\nRoddy, who will be based at the LDC corporate headquarters in Charlotte, N.C., has a long and successful career in the Enterprise communications space, most recently as Director of Marketing at Spirit Communications from 2011-2017. Spirt Communications operates a 9,000+ mile fiber network with footprint focused in South Carolina, North Carolina and Georgia. Roddy previously held the positions of Regional Channel Manager at Time Warner Business Class from 2010 to 2011 and Director of Sales for Spirit Communications based out of Charlotte from 2008 to 2010.\n“Roddy brings a wealth of experience and local business relationships to our team,” said Josh Wolff, Senior Vice President of Lumos Data Centers. “Our sales pipeline continues to accelerate and Roddy will play a critical role in creating customized data center, co-location and enterprise infrastructure services and solutions for our customer base in the rapidly growing Charlotte metro market.”\n“I am excited to join the Lumos Data Centers team,” said Roddy Broadnax. “I believe strongly that our business has a long growth runway ahead of us and I look forward to working with new and existing customers to provide networking, co-location and infrastructure services.\nRoddy has long standing roots in the business and civic community in the Carolinas markets. Currently, he is on the Public Relations Advisory Committee for the South Carolina Chamber and is on the Board of Directors of The Charlotte Touchdown Club. Previously, Roddy was on the Board of Directors of Girls on the Run International and the Board of Advisors for the North Carolina Technology Association.\nAbout Lumos Data Centers\nLumos Data Centers (LDC) is a newly formed business unit within Lumos Networks, focusing exclusively on data center services. LDC offers high availability services out of three Tier III data centers in Charlotte, NC, and Colocation and Lumos Network services out of 11 facilities across Virginia, West Virginia, North Carolina, Pennsylvania, and North Carolina. The Tier III facilities are staffed 24/7/365, SSAE 16 SOC 2 Type II certified, and PCI DSS and HIPPA compliant. Enterprise services include Colocation, Infrastructure as a Service, Disaster Recovery as a Service, Storage as a Service, and Back Up and Recovery as a Service. LDC acts as a Carrier Hotel, with 12 of the largest carriers in Charlotte having fiber routes and / or Points of Presence (POP), allowing robust options for clients. With direct connectivity from the Lumos Networks fiber footprint, along with 12 options for connectivity, LDC is uniquely positioned to offer clients on-net data center and colocation services.\nAbout Lumos Networks\nLumos Networks is a leading fiber-based service provider in the Mid-Atlantic region serving Carrier, Enterprise and Data Center customers, offering end-to-end connectivity in 27 markets in Virginia, West Virginia, North Carolina, Pennsylvania, Maryland, Ohio and Kentucky. With a fiber network of 11,028 fiber route miles and 517,244 total fiber strand miles, Lumos Networks connects 1,310 unique Fiber to the Cell sites, 1,685 total FTTC connections, 2,230 on-net buildings and over 3,500 total on-net locations. The Company also connects 44 total data centers, including three data centers acquired from DC74 (now named Lumos Data Centers), two acquired from Clarity Communications and seven company owned co-location facilities. In 2016, Lumos Networks generated over $123 million in Data revenue over our fiber network. Detailed information about Lumos Networks is available at www.lumosnetworks.com .\nContact:\nWill Davis\nSenior Vice President of Marketing\nChief of Staff\nPhone: (c) 917-519-6994\nEmail: davisw@lumosnet.com\nSource:Lumos Networks Corp.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/2a4ac12b-52da-485d-aa31-2142938894ce", "https://www.globenewswire.com/Tracker?data=xGjfD5xwxQqBaoqXp7wbVJcnVgPYz-FtgzNJKfUDWnmovFg1q2eKaHATbR7BohZoa21teUDZGk0SDzuiWXzBe3ESf4boR-f91tN3S5Fic6g="], "published": "2018-01-24T16:30:00.000+02:00", "crawled": "2018-01-24T16:52:28.011+02:00", "highlightTitle": ""}