{"organizations": [], "uuid": "8cefd4999df546cb643638709f6b1ea69e6e6cfa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222456295&w=1200&r=LYNXMPEE0F13H", "site_section": "http://feeds.reuters.com/reuters/INformulaOne\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/india-israel/netanyahu-says-israel-india-both-face-threat-from-radical-islam-idINKBN1F51WM", "country": "US", "domain_rank": 408, "title": "Netanyahu says Israel, India both face threat from radical Islam", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T17:29:00.000+02:00", "replies_count": 0, "uuid": "8cefd4999df546cb643638709f6b1ea69e6e6cfa"}, "author": "", "url": "https://in.reuters.com/article/india-israel/netanyahu-says-israel-india-both-face-threat-from-radical-islam-idINKBN1F51WM", "ord_in_thread": 0, "title": "Netanyahu says Israel, India both face threat from radical Islam", "locations": [], "entities": {"persons": [{"name": "netanyahu", "sentiment": "negative"}, {"name": "narendra modi", "sentiment": "none"}, {"name": "modi", "sentiment": "none"}, {"name": "benjamin netanyahu", "sentiment": "none"}, {"name": "abidi  netanyahu", "sentiment": "none"}], "locations": [{"name": "israel", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}, {"name": "hyderabad house", "sentiment": "none"}], "organizations": [{"name": "islam sanjeev miglani", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "muslim", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW DELHI (Reuters) - Israeli Prime Minister Benjamin Netanyahu said on Tuesday he was discussing with India ways to strengthen security cooperation against the menace of Islamist extremism that both democracies faced.\nIsraeli Prime Minister Benjamin Netanyahu speaks as his Indian counterpart Narendra Modi looks on during a signing of agreements ceremony at Hyderabad House in New Delhi, India January 15, 2018. REUTERS/Adnan Abidi Netanyahu spoke while on a six-day tour of India, the first by an Israeli premier for 15 years, and is being feted by Indian counterpart Narendra Modi, whose Hindu nationalist party has long admired Israel for its tough posture against terrorism.\nIndia, wary of upsetting Arab nations on which it was dependent for oil, and heeding the sentiments of its own large Muslim minority, kept a distance from Israel for decades. But under Modi, the two sides have embraced a closer relationship based on security and economics.\nThe right-wing Netanyahu told a security conference that India and Israel were two democracies with a natural affinity, but their open and liberal societies faced risks.\n“Our way of life is being challenged, most notably, the quest for modernity, the quest for innovation (are) being challenged by radical Islam and its terrorist offshoots from a variety of corners,” he said.\nA man installs a hoarding ahead of the visit of Israeli Prime Minister Benjamin Netanyahu in Ahmedabad, India, January 16, 2018. REUTERS/Amit Dave Both Israel and India have long sought to counter militant Islamists - in Israel’s case, mainly from Gaza and Egypt’s Sinai region and, in India’s case, mainly from Pakistan. Away from the public eye, India and Israel have been cooperating against the threat through, in part, intelligence sharing, officials say.\n“We’ve discussed in this visit how we can strengthen our two nations in the civilian areas, in security areas, in every area,” Netanyahu told the conference.\nSlideshow (2 Images) His trip to India comes just six months after Modi made the first trip by an Indian prime minister to Israel, during which he did not go to Ramallah, seat of the self-ruling Palestinian Authority and a customary stop for leaders visiting the region.\nNetanyahu toured the Taj Mahal on Tuesday and will also visit Modi’s home state of Gujarat and India’s financial capital Mumbai.\nHe will join an 11-year-old Israeli boy, Moshe Holtzberg, whose parents were murdered by Pakistan-based militants in Mumbai in 2008, for a memorial event at Mumbai’s Jewish centre where the attack took place.\nThe boy, who lives with his grandparents in Israel, arrived on Tuesday as a guest of Modi.\nAdditional reporting by Neha Dasgupta; editing by Mark Heinrich\n ", "external_links": [], "published": "2018-01-16T17:29:00.000+02:00", "crawled": "2018-01-16T18:02:05.015+02:00", "highlightTitle": ""}