{"organizations": [], "uuid": "f034f5ad8f36e69fb71d5865a070ad1213ad6e1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/21/104601035-GettyImages-3459897.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/mueller-seeks-to-interview-trump-legal-teams-ex-spokesman-source.html", "country": "US", "domain_rank": 767, "title": "Mueller seeks to interview Trump legal team's ex-spokesman: Source", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.956, "site_type": "news", "published": "2018-01-31T16:49:00.000+02:00", "replies_count": 0, "uuid": "f034f5ad8f36e69fb71d5865a070ad1213ad6e1b"}, "author": "Getty Images", "url": "https://www.cnbc.com/2018/01/31/mueller-seeks-to-interview-trump-legal-teams-ex-spokesman-source.html", "ord_in_thread": 0, "title": "Mueller seeks to interview Trump legal team's ex-spokesman: Source", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "neutral"}, {"name": "mueller", "sentiment": "neutral"}, {"name": "donald trump", "sentiment": "none"}, {"name": "robert mueller", "sentiment": "none"}, {"name": "mark corallo", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters getty", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Special Counsel Robert Mueller is seeking to interview the former spokesman of President Donald Trump's legal team as part of an investigation into potential collusion between Russia and Trump's campaign to sway the 2016 U.S. presidential election, according to a source with knowledge of the matter.\nMark Corallo had represented Trump's outside lawyers amid the federal and congressional Russia inquiries until he resigned last summer.\nA source familiar with the matter, who spoke on condition of anonymity, said the interview was expected within two weeks.\nCorallo may be questioned about reports that Trump had dictated a misleading statement on a meeting in June 2016 that his son held with a group of Russians, the source said.\nU.S. intelligence agencies have determined that Moscow worked to sway last year's election towards Trump. Moscow has denied interference and Trump, a Republican, has said there was no collusion.\nMueller's team is investigating whether there was any collusion between Moscow and the Trump campaign, or attempts by members of the Trump team to obstruct the investigation.\nCorallo's departure in July came amid media reports that Trump's legal team was reorganizing and considering ways to limit Mueller's probe.\nCorallo did not want to engage in or be associated with White House attacks on Mueller and top Justice Department officials, according to a person familiar with the matter.\nIn a July interview with the New York Times, Trump lashed out at his attorney general, Jeff Sessions , for recusing himself from overseeing the Russia investigation, which led to the appointment of a special counsel. He also attacked Mueller's investigators as having conflicts of interest and expressed unhappiness with the deputy attorney general, Rod Rosenstein .\nMueller, a former FBI director, was appointed in May to lead the federal investigation, which so far has resulted in guilty pleas from former Trump national security adviser Michael Flynn and former campaign aide George Papadopoulos. Former campaign manager Paul Manafort and aide Richard Gates have pleaded not guilty to charges that include money laundering.\nU.S. Senator Dianne Feinstein , the top Democrat on the Senate Judiciary Committee, one of three congressional panels investigating Moscow's activities during the campaign, has asked Corallo for an interview next month.", "external_links": [], "published": "2018-01-31T16:49:00.000+02:00", "crawled": "2018-01-31T16:48:49.022+02:00", "highlightTitle": ""}