{"organizations": [], "uuid": "fdaf13584fb3ba07928c2a4be4ba36b82823ba47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-cydney-raisch-joins-bottle-rockets-brand-experiences-growth-strategies-practice.html", "country": "US", "domain_rank": 767, "title": "Cydney Raisch Joins Bottle Rocket's Brand Experiences & Growth Strategies Practice", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.086, "site_type": "news", "published": "2018-01-19T16:23:00.000+02:00", "replies_count": 0, "uuid": "fdaf13584fb3ba07928c2a4be4ba36b82823ba47"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-cydney-raisch-joins-bottle-rockets-brand-experiences-growth-strategies-practice.html", "ord_in_thread": 0, "title": "Cydney Raisch Joins Bottle Rocket's Brand Experiences & Growth Strategies Practice", "locations": [], "entities": {"persons": [{"name": "cydney raisch", "sentiment": "negative"}, {"name": "cydney", "sentiment": "none"}], "locations": [{"name": "dallas", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 18, 2018 /PRNewswire/ -- Bottle Rocket has been a thought leader in the world of technology and innovation since our inception in 2008. As an award-winning application design and development firm, Bottle Rocket has produced undeniable value for many of the world's most distinguished brands. Through its unique application of Design Thinking, coupled with its distinct understanding of complex consumer behavior, Bottle Rocket is reshaping how brands compete and connect in the marketplace.\nAs Bottle Rocket's Vice President of Brand Experiences & Growth Strategies, Cydney will partner with leading brands to develop and execute go-to-market strategies with an emphasis on speed-to-value and market impact. Additionally, Cydney will serve as a key partner to clients in re-envisioning their customer touchpoints to create highly-aligned, optimized, and user-centric digital ecosystems.\n\"In the Experience Economy, brands must be constantly evolving and ever re-imagining their business to compete. As an advocate for user-centricity and value creation for the clients we serve, I'm thrilled to join an organization with a proven history of delivering exceptional brand experiences in our always-on and connected world,\" remarks Cydney.\nFor the last 15 years, Cydney built upon her success as a strategic business development executive and business partner and has delivered exceptional results. She has worked closely with senior executives at Dell EMC, Charles Schwab, Capital One, Samsung, and many others, to create meaningful customer connections and relationships that accelerate business growth. Cydney is both a partner and a coach, with expertise that spans several industries, including retail, consumer packaged goods, travel and hospitality, financial services, healthcare, and real estate.\n\"With the addition of Cydney to our team, we are deepening our 'been-there-done-that' expertise as Bottle Rocket continues to drive bold, enduring change for our clients,\" Bottle Rocket's Founder and CEO, Calvin Carter, added. \"Cydney's experience and passion is a perfect match for Bottle Rocket and I couldn't be more excited about our path forward.\"\nAbout Bottle Rocket\nHeadquartered in Dallas, Bottle Rocket is a mobile/connected device specialist that uses applied innovation to define, design, and develop applications that connect future-focused brands to their customers and employees. Through sophisticated, yet simple, technology-enabled experiences, our partners strengthen their businesses through enhanced user and brand interactions. Bottle Rocket is a mobile specialist at the center of WPP, the world's largest communications and customer experience services group.\nCONTACT: Jana Boone, Bottle Rocket, jana.boone@bottlerocketstudios.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/cydney-raisch-joins-bottle-rockets-brand-experiences--growth-strategies-practice-300585224.html\nSOURCE Bottle Rocket", "external_links": ["http://www.prnewswire.com/news-releases/cydney-raisch-joins-bottle-rockets-brand-experiences--growth-strategies-practice-300585224.html"], "published": "2018-01-19T16:23:00.000+02:00", "crawled": "2018-01-19T18:20:24.055+02:00", "highlightTitle": ""}