{"organizations": [], "uuid": "c407226dc1ba3b298bad1e681a07e077f2838521", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/27/104612691-GettyImages-466156637.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/10/bonds-and-fixed-income-fed-speech-data-politics-on-the-agenda-for-investors.html", "country": "US", "domain_rank": 767, "title": "Bonds and fixed income: Fed speech, Data, politics, on the agenda for investors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T13:00:00.000+02:00", "replies_count": 0, "uuid": "c407226dc1ba3b298bad1e681a07e077f2838521"}, "author": "Alexandra Gibbs", "url": "https://www.cnbc.com/2018/01/10/bonds-and-fixed-income-fed-speech-data-politics-on-the-agenda-for-investors.html", "ord_in_thread": 0, "title": "Bonds and fixed income: Fed speech, Data, politics, on the agenda for investors", "locations": [], "entities": {"persons": [{"name": "bill gross", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "u.s. federal reserve", "sentiment": "none"}, {"name": "atlanta fed business infl", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. government debt prices fell and yields rose on Wednesday as investors reacted to a report that China may begin to halt its purchase of Treasurys.\nThe 2-year yield climbed as high as 1.985 percent, its highest level since Sep. 2008. The 10-year yield hit 2.597 percent at one point, its highest level since March. The benchmark 10-year yield was at 2.557 percent at 2:23 p.m. ET. The 30-year Treasury bond was higher at 2.902 percent. Bond yields move inversely to prices.\nUnnamed officials told Bloomberg that China may reconsider its purchasing of U.S. debt as trade tensions brew between the two countries. The two economic powerhouses have long maintained a debt-fueled trade policy, but with the U.S. debt expected to increase further, Beijing may be losing its appetite for Treasurys.\n\"On the margins, it's a shot across the bow, a reminder of the inter-relationships and support that are provided between countries for consumerism,\" said Robert Tipp, chief investment strategist at PGIM Fixed Income. \"The Chinese are nudging the U.S. and reminding them that we have some issues here.\"\nSymbol Yield Change %Change US 3-MO --- US 1-YR --- US 2-YR --- US 5-YR --- US 10-YR --- US 30-YR --- China remains the world's largest holder of international debt, with foreign-exchange reserves hitting $3.1 trillion in December.\nYields have been steadily rising since Republican lawmakers proposed tax cut legislation last fall, a plan many economists think will balloon debt further.\n\"We could be kind of at a taper tantrum point,\" Tipp added. \"The European Central Bank is tapering, the Bank of Japan is tapering, we've had sort of a half shot taken at the U.S. ... If you think back a year, the 10-year note was at the mid-ones and now in the mid-twos.\"\nUntil recently, the Federal Reserve had been responsible for mopping up the country's excess debt as the economy climbed its way out of the 2008 financial crisis. But with the central bank looking to normalize policy and reduce its balance sheet over the next several years, borrowing needs are likely to rise in tandem.\nCommenting on the fall in bond prices, bond guru Bill Gross said that the bond bear market is finally upon us after more than 25 years.\n\"I see nominal growth in the United States increasing from where it's been at 4 percent for the last four or 5 years to maybe 5 percent due to tax cuts and increasing deficit,\" he said on CNBC's \" Power Lunch \" on Wednesday. \"I see central banks – not just the Fed – cutting back on their quantitative easing. The ECB is cutting theirs in half and by the end of the year may entirely eliminate it. So a flush of money is being met with a flush of supply and that produces higher interest rates.\"\nThe Treasury Department auctioned $20 billion in 10-year notes at a high yield of 2.579 percent. The bid-to-cover ratio, an indicator of demand, was 2.69. Indirect bidders, which include major central banks, were awarded 71.4 percent. Direct bidders, which includes domestic money managers, bought 6.5 percent.\n\"In the context of a wild and messy few days in interest rates, the 10-year note auction was good,\" wrote Peter Boockvar, chief investment officer at Bleakley Advisory Group. \"The 10-year note is rallying in response with the yield at 2.57 percent vs 2.58 percent just prior to the results. As stated we know 2.63 percent is a key level for the sole reason as it would match the highest level since 2014.\"\nThe fall in U.S. bond prices was accompanied by a move in the currency markets, a shift PGIM's Tipp accredited to an attractive European economy. The euro briefly traded above $1.20 before edging down.\n\"Europe is looking much stronger not only as a reserve currency, but as a very serious competitor with the dollar over the very long run,\" Tipp explained.\n—CNBC's Gina Francolla contributed to this report.", "external_links": [], "published": "2018-01-10T13:00:00.000+02:00", "crawled": "2018-01-10T13:06:50.031+02:00", "highlightTitle": ""}