{"organizations": [], "uuid": "f332a5bd5c997998eeab0654a78088dd93b113d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/britain-stocks/update-1-britains-ftse-drops-to-5-week-low-as-financials-miners-fall-idUSL8N1PP6G7", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Britain's FTSE drops to 5-week low as financials, miners fall", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T18:59:00.000+02:00", "replies_count": 0, "uuid": "f332a5bd5c997998eeab0654a78088dd93b113d7"}, "author": "", "url": "https://www.reuters.com/article/britain-stocks/update-1-britains-ftse-drops-to-5-week-low-as-financials-miners-fall-idUSL8N1PP6G7", "ord_in_thread": 0, "title": "UPDATE 1-Britain's FTSE drops to 5-week low as financials, miners fall", "locations": [], "entities": {"persons": [{"name": "kit rees", "sentiment": "none"}, {"name": "ken odeluga", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "city index", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 5:00 PM / in an hour UPDATE 1-Britain's FTSE drops to 5-week low as financials, miners fall Reuters Staff \n* FTSE 100 down 1 pct \n* Cyclical stocks weigh \n* M&A, earnings in focus among mid caps (Adds closing prices, details) \nBy Kit Rees \nLONDON, Jan 30 (Reuters) - The UK’s top share index fell to five-week lows on Tuesday as investors took profits on miners and banks, so-called cyclical sectors which have enjoyed a strong start to 2018. \nThe blue chip FTSE 100 index ended down 1.1 percent at 7,587.98 points, in line with a broader slide among European markets. \nOver the past fortnight the rally that has seen the FTSE 100 hit a series of record highs has sputtered due to the index’s heavy weighting in stocks which are sensitive to the economic cycle, such as financials and commodities. \nWhile these sectors found favour with investors at the beginning of 2018, they have seen a retreat as investors have locked in profits. \n“We like this kind of pullback. It’s been on the cards for some time,” said Ken Odeluga, market analyst at City Index. \n“With a good ... return so far this month in the bag, it makes a lot of sense to take some money off the table,” Odeluga added. \nOn the day, financials took more than 26 points off the index, while materials and energy together sliced off around 32 points. \nShares in miner Anglo American fell 2.3 percent, while peers Antofagasta, Glencore and BHP Billiton were down between 1.7 percent to 1.9 percent. \nAmong banks, RBS and Barclays were both down 2.7 percent. \nMore defensive stocks were the biggest risers, with consumer goods group Reckitt Benckiser up 1.4 percent as a weaker pound helped big, international stocks gain ground. \nOutside the blue chips, earnings and deal-making were in focus. Shares in UBM rose 4.3 percent after Informa sealed its takeover of the conference organiser. Informa’s shares rose 0.8 percent. \nShares in Domino’s Pizza touched their highest level since March 2017 after its fourth quarter sales beat estimates. The pizza delivery firm said its annual pre-tax profit would be slightly ahead of market expectations. \n“(Domino‘s) update today shows good progress in Q4,” analysts at Stifel said in a note. \n“This demonstrates that Domino’s has regained its growth momentum following difficult trading conditions at the beginning of the year,” Stifel analysts added. \nIts shares ended up 1.4 percent, off earlier highs. Reporting by Kit Rees, additional reporting by Danilo Masoni; Editing by Andrew Heavens", "external_links": [], "published": "2018-01-30T18:59:00.000+02:00", "crawled": "2018-01-30T19:41:13.002+02:00", "highlightTitle": ""}