{"organizations": [], "uuid": "c336e49b59a692fdd45c99437c27a9e187472df6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180128.html", "section_title": "Archive News &amp; Video for Sunday, 28 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-asia-environment-aircon/shivering-in-the-tropics-southeast-asia-faces-cooling-crisis-idUSKBN1FI03A", "country": "US", "domain_rank": 408, "title": "Shivering in the tropics: Southeast Asia faces 'cooling crisis'", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-29T09:07:00.000+02:00", "replies_count": 0, "uuid": "c336e49b59a692fdd45c99437c27a9e187472df6"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-asia-environment-aircon/shivering-in-the-tropics-southeast-asia-faces-cooling-crisis-idUSKBN1FI03A", "ord_in_thread": 0, "title": "Shivering in the tropics: Southeast Asia faces 'cooling crisis'", "locations": [], "entities": {"persons": [{"name": "tim hill", "sentiment": "none"}], "locations": [{"name": "southeast asia", "sentiment": "none"}, {"name": "bangkok", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "kuala lumpur", "sentiment": "negative"}, {"name": "association of southeast asian nations", "sentiment": "none"}, {"name": "asean", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KUALA LUMPUR (Thomson Reuters Foundation) - Southeast Asia faces a “cooling crisis” as more and more people crank up inefficient air-conditioning to cope with rising temperatures and worsening air pollution, researchers said.\nMore than 420 managers and experts from government agencies and multinational companies in Indonesia, Malaysia, Singapore, Thailand, the Philippines and Vietnam took part in a survey on cooling systems and energy efficiency, conducted by Eco-Business and released at a Bangkok conference on Monday.\nEnergy demand from members of the Association of Southeast Asian Nations (ASEAN) climbed 70 percent from 2000 to 2016, with air-conditioning accounting for a large part of household electricity demand, the report said.\nThe trend is likely to continue as populations grow, cities expand and wealth levels increase.\n“The domestic aspect of electricity consumption has grown massively - more so than industry and the service sector in ASEAN - and as a result the air-conditioning bill is going through the roof,” said Tim Hill, research director at Eco-Business, a media organization covering sustainability in Asia.\nElectricity for the region’s air-conditioning units is largely provided by coal-fired power stations.\nThe report urged governments and businesses to adopt new policies and rules to help countries meet global targets to cut planet-warming emissions.\n“Governments need to drive this by putting in regulations that enforce more efficient forms of air-conditioning - making sure they’re not dumping grounds for old-fashioned products,” Hill told the Thomson Reuters Foundation.\nThe survey’s respondents said manufacturers and suppliers of air-conditioning should focus on producing more energy-efficient systems and educating customers better.\nExcessive cooling in public buildings - like offices, shopping centers and cinemas - must also be tackled, while public awareness campaigns would help promote energy efficiency.\nCinema-goers in some Southeast Asian cities bring socks to keep warm, while officer workers wear woolly hats and shoppers in malls can be seen wearing winter jackets to stop the shivers. At street level, air-conditioned shops often keep their doors open to entice buyers.\n“Air-con is designed to make people feel more comfortable but it’s actually doing completely the reverse - it’s making people feel more uncomfortable and making them more unproductive by freezing them,” Hill said.\nStricter government regulations that promote or enforce energy-efficient cooling systems, and financial incentives to install such systems in homes would help, the report said.\nConsumers, businesses and governments must also work together to manage electricity demand better, reduce emissions and pollutants, and move away from a reliance on coal-fired power stations, said Mark Radka, head of energy, climate and technology at UN Environment in Paris, who also worked on the report.\n“The ASEAN countries as a whole should try to up their game,” he added.\nReporting by Michael Taylor, editing by Megan Rowling; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-29T09:07:00.000+02:00", "crawled": "2018-01-29T21:54:18.003+02:00", "highlightTitle": ""}