{"organizations": [], "uuid": "6c75af3e3a51eed6eebcd890c92c79a0e83b3ebd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 91, "shares": 91, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219507790&w=1200&r=LYNXMPEE04092", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-economy/solid-u-s-job-growth-expected-in-december-wages-seen-rising-idUSKBN1EU0EF", "country": "US", "domain_rank": 408, "title": "WRAPUP 1-Solid U.S. job growth expected in December; wages seen rising", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T07:00:00.000+02:00", "replies_count": 0, "uuid": "6c75af3e3a51eed6eebcd890c92c79a0e83b3ebd"}, "author": "", "url": "https://www.reuters.com/article/us-usa-economy/solid-u-s-job-growth-expected-in-december-wages-seen-rising-idUSKBN1EU0EF", "ord_in_thread": 0, "title": "WRAPUP 1-Solid U.S. job growth expected in December; wages seen rising", "locations": [], "entities": {"persons": [{"name": "lucia mutikani", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "solid u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "labor department", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 5:05 AM / Updated 2 hours ago U.S. job growth cools as labor market nears full employment; wages up Lucia Mutikani 6 Min Read \nWASHINGTON (Reuters) - U.S. job growth slowed more than expected in December amid a decline in retail employment, but a pick-up in monthly wage gains pointed to labor market strength that could pave the way for the Federal Reserve to increase interest rates in March. \nNonfarm payrolls rose by 148,000 last month after a surge of 252,000 in November, the Labor Department said on Friday. Retail payrolls fell by 20,300 in December, the largest drop since March, despite reports of a strong holiday shopping season. \nThe unemployment rate was unchanged at a 17-year low of 4.1 percent. Economists polled by Reuters had forecast payrolls rising by 190,000 in December. The economy needs to create 75,000 to 100,000 jobs per month to keep up with growth in the working-age population. \n“We do not think that today’s employment report will keep the Federal Reserve from tightening again at the March policy meeting, given other strong recent economic data,” said David Berson, chief economist at Nationwide in Columbus, Ohio. \nJob growth surged in October and November after being held back in September by back-to-back hurricanes, which destroyed infrastructure and homes and temporarily dislocated some workers in Texas and Florida. \nTaking the sting out of the moderation in job gains, average hourly earnings rose 9 cents, or 0.3 percent, in December after a 0.1 percent gain in the prior month. That lifted the annual increase in wages to 2.5 percent, from 2.4 percent in November. \nPrices of U.S. Treasuries fell on the employment report while the dollar .DXY rose marginally against a basket of currencies. Stocks on Wall Street were trading higher. \nEmployment gains in December were below the monthly average of 204,000 over the past three months. Job growth is slowing as the labor market nears full employment, but could get a temporary boost from a $1.5 trillion package of tax cuts passed by the Republican-controlled U.S. Congress and signed into law by President Donald Trump last month. \nThe lift from the fiscal stimulus, which includes a sharp reduction in the corporate income tax rate to 21 percent from 35 percent, is likely to be modest as the stimulus is occurring with the economy operating almost at capacity. There are also concerns the economy could overheat. NEAR FULL EMPLOYMENT \nData ranging from housing to manufacturing and consumer spending have suggested solid economic growth in the fourth quarter, despite a widening of the trade deficit in both October and November, which could subtract from gross domestic product. \nIn a separate report on Friday, the Commerce Department said the trade gap widened 3.2 percent in November to $50.5 billion, the highest level since January 2012. \nThe deficit was boosted by record high imports, which offset the highest exports in three years. The economy grew at a 3.2 percent annualized rate in the third quarter. FILE PHOTO: Job seekers line up to apply during \"Amazon Jobs Day,\" a job fair being held at 10 fulfillment centers across the United States aimed at filling more than 50,000 jobs, at the Amazon.com Fulfillment Center in Fall River, Massachusetts, U.S., August 2, 2017. REUTERS/Brian Snyder/File Photo \nFor all of 2017, the economy created 2.1 million jobs, below the 2.2 million added in 2016. It was the seventh year in a row that the economy generated more than 2 million jobs. \nEconomists expect job growth this year to slow to well below the 2017 monthly average of 170,000 as the labor market hits full employment, which will likely boost wage growth as employers compete for workers. \n“Almost every person ready, able and willing to work now has a job,” said David Kelly, chief global strategist at JPM Asset Management in New York. “Meeting the labor demand of 2018 will require hiring those less willing, and enticing them into the labor market will probably require stronger wage growth.” \nEconomists are optimistic that annual wage growth will top 3.0 percent by the end of this year. The unemployment rate declined by seven-tenths of a percentage point last year. \nThe jobless rate for African-Americans fell to a record low of 6.8 percent in December. \nEconomists believe the overall unemployment rate could drop to 3.5 percent by the end of this year, which would be the lowest since the late 1960s. That could potentially unleash a faster pace of wage growth and translate into a much stronger increase in inflation than currently anticipated. \nThat, according to economists, would force the Fed to push through four interest rate increases this year instead of the three it has penciled in. The U.S. central bank raised borrowing costs three times in 2017. \nEmployment gains were largely broad-based in December. Construction payrolls increased by 30,000 jobs, the most since February, reflecting recent strong increases in homebuilding. Manufacturing employment increased by 25,000 jobs. \nManufacturing is being supported by a strengthening global economy and a weakening dollar. Employment in the utilities sector fell for a second straight month. \nGeneral merchandise stores payrolls tumbled by 27,300 in December, with employment at clothing stores dropping by 3,800 jobs. For all of 2017, retail employment dropped by 67,000 jobs after rising by 203,000 in 2016. \nFurther job losses are likely this year as major retailers, facing stiff competition from online sellers like Amazon.com Inc ( AMZN.O ), close stores. \nSears Holdings Corp ( SHLD.O ) said on Thursday it was shuttering 103 unprofitable Kmart and Sears stores. Macys Inc ( M.N ) also announced 11 store closures, which could leave 5,000 workers unemployed. \n“Employment in retail trade is now the lowest it has been in almost 50 years as a percentage of total employment, and there is nothing to suggest that trend will reverse,” said Eric Winograd, a senior economist at AllianceBernstein in New York. Reporting by Lucia Mutikani; Editing by Paul Simao", "external_links": [], "published": "2018-01-05T07:00:00.000+02:00", "crawled": "2018-01-05T07:14:13.013+02:00", "highlightTitle": ""}