{"organizations": [], "uuid": "60c2afc42f28c461501f1f5b0f5c406aeae6d315", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180111.html", "section_title": "Archive News &amp; Video for Thursday, 11 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-el-salvador-usa-immigration/forcing-salvadorans-out-of-u-s-carries-twin-risks-red-cross-idUSKBN1F028U", "country": "US", "domain_rank": 408, "title": "Forcing Salvadorans out of U.S. carries twin risks: Red Cross", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-12T00:53:00.000+02:00", "replies_count": 0, "uuid": "60c2afc42f28c461501f1f5b0f5c406aeae6d315"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-el-salvador-usa-immigration/forcing-salvadorans-out-of-u-s-carries-twin-risks-red-cross-idUSKBN1F028U", "ord_in_thread": 0, "title": "Forcing Salvadorans out of U.S. carries twin risks: Red Cross", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "walter cotte", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "tepic", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "el salvador", "sentiment": "none"}], "organizations": [{"name": "red cross", "sentiment": "negative"}, {"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "international federation of red cross and red crescent societies americas", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TEPIC, Mexico (Thomson Reuters Foundation) - Moves by the United States to expel 200,000 Salvadorans could rob families in El Salvador of vital overseas income and overwhelm the tiny country as people flood home in search of a new life, according to the Red Cross.\nThe 200,000 Salvadorans have been living in the United States since 2001 but now face the threat of deportation under President Donald Trump’s “America First” agenda.\nThe Red Cross said the fallout from such a “massive return” could be highly damaging - jobs and resources are already scarce - and predicted the country would struggle to cope.\n“This is going to create two effects: the reduction of money that is coming from the United States... secondly, the big amount of people coming back to the country without work,” said Walter Cotte, regional director of the International Federation of Red Cross and Red Crescent Societies Americas.\n“If you put the two effects together, you will have a big problem for the country and a very dangerous situation,” he told the Thomson Reuters Foundation in an interview this week.\nThe decision to expel the Salvadorans, announced on Monday, is part of the Trump administration’s broader push to tighten immigration laws. The move was heavily criticized by immigrant advocates who said it ignored violence in El Salvador and gave the Salvadorans few options but to go home or stay on illegally.\nHOMECOMING Their U.S. earnings will be sorely missed.\nSalvadorans working overseas sent $4.5 billion to their families in the 11 months to November, 10 percent more than the year before, with most of the money earned in the United States, according to figures from El Salvador’s Central Reserve Bank.\nRemittances are a major source of income in a country of just 6 million. For many families, help from relatives abroad is the lifeline that lets them put food on the table each day.\nThose who do return home will also struggle to find jobs, with younger workers especially hard hit in a country with a high rate of youth unemployment and a low growth rate.\nU.S. officials said on Monday the 200,000 will lose their temporary protected status (TPS) on Sept. 9, 2019, giving them 18 months to leave or seek lawful residency.\nThe status was granted in the wake of two earthquakes in 2001 that left hundreds of thousands in the country homeless.\nSome Salvadorans, whose children were U.S.-born and who have established a whole new life for themselves, say returning to their crime-ravaged homeland is not an option.\nViolence attributed to gangs - or “maras” - has turned the smallest country in Central America into one of the world’s deadliest, despite a government-touted 25 percent drop in murders last year.\nDeportations of alleged gang members from the United States to El Salvador rose 140 percent last year.\nHaitians and Nicaraguans will lose their protected status in 2019. Hondurans, the second largest group in the program after Salvadorans, could lose their rights later this year.\nA report by International Crisis Group, which studies vulnerable countries and conflicts globally, said El Salvador was ill-equipped to deal with such a mass influx of people.\n“El Salvador is simply unprepared, economically and institutionally, to receive such an influx, or to handle their 192,700 U.S. children, many of them at the perfect age for recruitment or victimization by gangs.”\n“At a time when levels of violence remain extraordinarily high, with exhaustion toward an unwinnable conflict voiced on both sides, the arrival of thousands of migrants back to their crime-affected homeland would impose huge strains.”\nReporting by Sophie Hares, Additional Reporting by Anastasia Moloney in Bogota, Editing by Lyndsay Griffiths\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T00:53:00.000+02:00", "crawled": "2018-01-12T18:34:11.007+02:00", "highlightTitle": ""}