{"organizations": [], "uuid": "7139dc7d642eec0467b6429abe94fb53ffc33e53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-metals/metals-copper-holds-ground-amid-persistent-dollar-weakness-idUSL4N1PI28P", "country": "US", "domain_rank": 408, "title": "METALS-Copper holds ground amid persistent dollar weakness", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T07:52:00.000+02:00", "replies_count": 0, "uuid": "7139dc7d642eec0467b6429abe94fb53ffc33e53"}, "author": "", "url": "https://www.reuters.com/article/global-metals/metals-copper-holds-ground-amid-persistent-dollar-weakness-idUSL4N1PI28P", "ord_in_thread": 0, "title": "METALS-Copper holds ground amid persistent dollar weakness", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "argonaut", "sentiment": "none"}, {"name": "argonaut securities", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 5:56 AM / Updated 27 minutes ago METALS-Shanghai copper edges up amid persistent dollar weakness Reuters Staff 5 Min Read (Recasts to lead with ShFE copper, updates prices) BEIJING, Jan 23 (Reuters) - Shanghai copper prices gained ground on Tuesday amid a persistent weak dollar, even as official data showed China churned out a record volume of refined copper in December, suggesting the world's biggest copper consumer is well supplied. A weak dollar makes metals cheaper for holders of other currencies and supports prices, and the greenback's dive as a result of the U.S. government shutdown had seen copper climb by 0.4 percent in both Shanghai and London on Monday. \"We think the recent copper price rebound is mostly driven by dollar weakness,\" Argonaut Securities wrote in a note. \"Any dollar weakness reversal may weigh down on copper prices, in our view.\" While China's refined copper output hit an all-time high in December, Argonaut noted that unwrought copper imports fell by 5 percent in 2017. \"The reduced import appetite reflects China's sluggish copper demand, especially in the power sector,\" it added. FUNDAMENTALS * SHFE COPPER: The most-traded March copper contract on the Shanghai Futures Exchange (ShFE) closed up 0.2 percent at 53,720 yuan ($8,395.06) a tonne. * LME COPPER: Three-month copper on the London Metal Exchange was down 0.3 percent at $7,044 a tonne, as of 0825 GMT, after rising as much as 0.4 percent earlier in the session. * NICKEL/LEAD: ShFE nickel and lead came alive after the mid-session interval, with nickel clocking a 1.7 percent rise to 99,720 yuan a tonne at the close, and lead gaining 1.9 percent amid tight stocks to end at 19,800 yuan a tonne, its highest close since Oct. 18. * NICKEL: SHFE nickel \"drifted in line with onshore weakness, but unlike iron ore it did find some regional physical demand into the morning sell-off, the uptrend remains in tact for now,\" Marex Spectron wrote in a note. * USD: The dollar index inched up 0.1 percent, with the currency remaining near three-year lows after a rally following the deal to re-open the U.S. government. * CHINA: China's refined copper output jumped by 16.7 percent year-on-year to a record high in December, as smelters looked to churn out as much metal as possible ahead of a fall in treatment charges for copper concentrate. * SCRAP: China's imports of scrap copper fell 19.8 percent in December from a year earlier, customs data showed on Tuesday, as the country continues a clampdown on taking foreign waste. * ALUMINIUM: China's central Henan province churned out more aluminium than neighbouring Shandong in 2017 for the first time in years, becoming the nation's top-producing region. * MONGOLIA: Global miner Rio Tinto, will set up a new office in the Mongolian capital, separate from its giant Oyu Tolgoi project, to focus on exploration and local ties, strengthening its commitment to one of the world's greatest copper prospects. * CRYPTOCURRENCIES: Swiss-based commodities fund Tiberius Group plans to make a foray into cryptocurrencies with the launch of what may be the first digital money underpinned by physically deliverable metals including industrials such as aluminium and copper. * For the top stories in metals and other news, click or MARKETS NEWS * Asian stocks advanced on Tuesday after U.S. senators struck a deal to end a government shutdown in a boost to Wall Street, while the dollar turned higher against the yen after Bank Of Japan's chief reiterated his support for quantitative easing. PRICES BASE METALS PRICES 0757 GMT Three month LME copper 7068 Most active ShFE copper 53710 Three month LME aluminium 2235 Most active ShFE aluminium 14650 Three month LME zinc 3420 Most active ShFE zinc 26215 Three month LME lead 2619.5 Most active ShFE lead 19785 Three month LME nickel 12825 Most active ShFE nickel 99720 Three month LME tin 20715 Most active ShFE tin 146900 BASE METALS ARBITRAGE LME/SHFE COPPER LMESHFCUc3 972.56 LME/SHFE ALUMINIUM LMESHFALc3 -1957.58 LME/SHFE ZINC LMESHFZNc3 314.87 LME/SHFE LEAD LMESHFPBc3 -496.51 LME/SHFE NICKEL LMESHFNIc3 1472.79 ($1 = 6.3990 Chinese yuan) (Reporting by Tom Daly, Editing by Gopakumar Warrier and Sherry Jacob-Phillips)", "external_links": [], "published": "2018-01-23T07:52:00.000+02:00", "crawled": "2018-01-23T08:33:05.000+02:00", "highlightTitle": ""}