{"organizations": [], "uuid": "4cf78d29a5c47883168eebc4634f84e23357fe32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1220983788&w=1200&r=LYNXMPEE0A02Q", "site_section": "http://feeds.reuters.com/reuters/environment", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-australia-cyclone-ironore/australias-port-hedland-says-clearing-port-due-to-cyclone-fears-idUSKBN1F0040", "country": "US", "domain_rank": 408, "title": "Australia's Port Hedland says clearing port due to cyclone fears", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T03:17:00.000+02:00", "replies_count": 0, "uuid": "4cf78d29a5c47883168eebc4634f84e23357fe32"}, "author": "", "url": "https://www.reuters.com/article/us-australia-cyclone-ironore/australias-port-hedland-says-clearing-port-due-to-cyclone-fears-idUSKBN1F0040", "ord_in_thread": 0, "title": "Australia's Port Hedland says clearing port due to cyclone fears", "locations": [], "entities": {"persons": [], "locations": [{"name": "port hedland", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "port of port hedland", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "pilbara ports authority", "sentiment": "none"}, {"name": "bureau of meteorology", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SYDNEY (Reuters) - Australia’s Port Hedland iron ore terminal expects to clear all remaining vessels from its harbor by 1030 GMT as a safety measure after a tropical cyclone intensified off the nation’s western coast on Thursday, Pilbara Ports Authority said.\nThe port’s biggest user, global mining giant BHP, said it was monitoring the progress of Cyclone Joyce amid forecasts it will reach Category 3 strength by early Friday morning, packing wind gusts of 165-224 km per hour.\n“All vessels are expected to be cleared from the port by 6.30 p.m (1030 GMT) tonight, at which time the port will be officially closed,” the authority said.\nThe port accounts for over half of Australia’s iron ore exports, handling more than a million tonnes a day from the Pilbara iron belt, the majority bound for Chinese steel mills.\nThe Bureau of Meteorology said earlier a tropical low had reached cyclone strength and would intensify overnight, affecting the Pilbara region on Friday or early Saturday.\nThe port is used by three of Australia’s top four iron ore miners, BHP, Fortescue Metals Group and Gina Rinehart’s Hancock Prospecting.\n“The safety of our people is our highest priority and we are closely monitoring conditions relating to the cyclone,” Fortescue Chief Executive Nev Power said in a statement emailed to Reuters.\nFILE PHOTO - Ships waiting to be loaded with iron ore are seen at the Fortescue loading dock located at Port Hedland, in the Pilbara region of Western Australia December 3, 2013. REUTERS/David Gray/File photo “We have detailed cyclone preparedness procedures in place at all our operations in the Pilbara,” Power said.\nAustralia’s top iron ore miner, Rio Tinto, uses the port of Dampier, 420 kilometers (260 miles) south of Port Hedland. A Rio spokesman said the company was keeping an eye on the cyclone’s path.\nPilbara Ports Authority said it was also monitoring weather conditions at the Dampier port.\nSlideshow (2 Images) Iron ore markets have been particularly sensitive to supply-side issues in recent months as China’s steelmakers increasingly turns to imported ore to supplement low-grade ore at home. [IRONORE/]\nAccording to commodities traders, a prolonged disruption to shipping from the port could lead to a scramble for available cargoes and lift prices.\nSpot iron ore traded between $53 and $95 a ton in 2017 and currently stands at $78.31 a ton.\nThe Pilbara region is home to many of the world’s largest iron ore mines, with Port Hedland last month accounting for over 41 million tonnes of exports.\nOn average, there are 10 to 13 tropical cyclones between November and April in the Australian region, four of which typically cross the coast, data from the bureau shows.\nReporting by James Regan; Editing by Kenneth Maxwell and Tom Hogue\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-11T03:17:00.000+02:00", "crawled": "2018-01-11T03:30:35.017+02:00", "highlightTitle": ""}