{"organizations": [], "uuid": "cccf89cd4c192b38fa5c9d902c19b4fad8e95a37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224452097&w=1200&r=LYNXMPEE0M0SY", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-fox-m-a-breakingviews/breakingviews-murdochs-sky-bid-will-ride-out-regulatory-storm-idUSKBN1FC1FN", "country": "US", "domain_rank": 408, "title": "Murdoch’s Sky bid will ride out regulatory storm", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T19:58:00.000+02:00", "replies_count": 0, "uuid": "cccf89cd4c192b38fa5c9d902c19b4fad8e95a37"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-fox-m-a-breakingviews/breakingviews-murdochs-sky-bid-will-ride-out-regulatory-storm-idUSKBN1FC1FN", "ord_in_thread": 0, "title": "Murdoch’s Sky bid will ride out regulatory storm", "locations": [], "entities": {"persons": [{"name": "murdoch", "sentiment": "negative"}, {"name": "rupert murdoch", "sentiment": "negative"}, {"name": "matt hancock", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}], "locations": [{"name": "london britain", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "news corp", "sentiment": "none"}, {"name": "competition and markets authority", "sentiment": "none"}, {"name": "cma", "sentiment": "none"}, {"name": "times and sun newspapers", "sentiment": "none"}, {"name": "twenty-first century fox", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON Britain’s competition regulator delivered a blow to Rupert Murdoch on Tuesday, but he’s still in the game. Twenty-First Century Fox’s 11.7 billion pound bid for Sky would give the 86-year-old mogul too much control over UK news, the antitrust authorities said. The deal could nevertheless go ahead.\nThe Competition and Markets Authority has been looking into Fox’s offer to buy the 61 percent it doesn’t own of the pay-TV group on two grounds: media plurality and commitment to broadcasting standards. On the former, it said the Murdoch family’s cross-shareholdings in Fox and News Corp, owner of the Times and Sun newspapers, would give it excessive influence over public opinion. On the latter, the deal was given a thumbs-up despite “serious failings” during a historic UK phone-hacking scandal. The CMA now has three options.\nFirst, it could call for Media Secretary Matt Hancock, who has the final say, to block the deal. However, that may be a step too far for an authority that is required to be proportionate. Relatively modest changes, such as an independent editorial board at Sky News, could reduce Murdoch’s clout. The CMA also pointed out that Walt Disney’s $52 billion December bid for Fox assets, including Sky, means its concerns may “fall away”. It’s hard to imagine Hancock blocking the deal when Sky News may eventually be owned by Disney, not the Murdochs.\nA second option is to demand Fox sells Sky News. But the loss-making channel may not find another buyer, and media plurality would scarcely be helped if an independent news outlet eventually collapsed. Fox could also sell Sky News to Disney before the wider tie-up, but Disney may not want this.\nA third alternative would be to ask for so-called behavioural remedies, such as setting up a firewall between the Murdochs and Sky News. Media watchdog Ofcom said last year that an independent editorial board and funding guarantees would mitigate concerns. True, responses to its consultation argued that similar commitments may have failed to prevent editorial interference at the Times and Dow Jones. But the concern seems less pressing now that Murdoch has signalled he wants out of Sky. His retreat may in the end rescue his bid for the broadcaster.\nBreakingviews Reuters Breakingviews is the world's leading source of agenda-setting financial insight. As the Reuters brand for financial commentary, we dissect the big business and economic stories as they break around the world every day. A global team of about 30 correspondents in New York, London, Hong Kong and other major cities provides expert analysis in real time.\nSign up for a free trial of our full service at https://www.breakingviews.com/trial and follow us on Twitter @Breakingviews and at www.breakingviews.com . All opinions expressed are those of the authors.", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-23T19:58:00.000+02:00", "crawled": "2018-01-23T20:42:18.020+02:00", "highlightTitle": ""}