{"organizations": [], "uuid": "39256d8a22ad319826039303af37af003f128ab9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226487557&w=1200&r=LYNXMPEE0T06G", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-indonesia-fintech/indonesias-fintech-lending-boom-exploits-shortfall-in-bank-loans-idUSKBN1FJ0F4", "country": "US", "domain_rank": 408, "title": "Indonesia's fintech lending boom exploits shortfall in bank loans", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T06:20:00.000+02:00", "replies_count": 0, "uuid": "39256d8a22ad319826039303af37af003f128ab9"}, "author": "", "url": "https://www.reuters.com/article/us-indonesia-fintech/indonesias-fintech-lending-boom-exploits-shortfall-in-bank-loans-idUSKBN1FJ0F4", "ord_in_thread": 0, "title": "Indonesia's fintech lending boom exploits shortfall in bank loans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "JAKARTA (Reuters) - Fintech firms, offering loans of as little as a few hundred dollars, are seeing a spike in lending in Indonesia where tens of millions of people have little or no access to bank credit - helping alleviate a financing shortfall estimated at more than $73 billion.\nThe emergence of these peer-to-peer (P2P) lending platforms has so far been welcomed by Indonesia’s financial regulators which see them as offering a much needed service to cash-strapped businesses and consumers at a time when Southeast Asia’s biggest economy has been hobbled by sluggish bank lending.\nWimboh Santoso, head of Indonesia’s financial regulator (OJK), said while the trend was still a drop in the ocean of overall lending, more than 250,000 people had taken out loans through fintech. Around 30 P2P firms had extended 2.6 trillion rupiah ($193.8 million) in lending as of January 2018, compared with just 247 billion rupiah of lending in December 2016. Another 36 more firms were waiting to be approved, he added.\nP2P lending has helped small businesses access capital.\n“It is so flexible. I don’t need collateral and I can submit my documents anytime of the day. There’s no bank like that,” said Siyono, a 51-year-old business owner in Jakarta, who stumbled on a P2P platform while browsing on his smartphone and took out a loan at around 16 percent annual interest.\nBank loan penetration in Indonesia, where only one in three adults have bank accounts, was around 34 percent of GDP in 2015, among the lowest of Asia Pacific countries. Loan growth has also fallen below 10 percent since the start of 2016, compared with more than 20 percent during the commodity boom years before that.\nWhile P2P platforms will help Indonesia progress toward a digital economy, some analysts warn that a more accurate credit assessment process must be developed.\n“Prudential principles that have been implemented by banks, have to be implemented by these firms too. They may have to be even more prudent, since the credit histories of their borrowers are unknown,” said Damhuri Nasution, an analyst with Danareksa Research Institute in Jakarta.\nSMARTPHONES BOOST Soaring smartphone ownership, with more than 100 million smartphones sold in the country of around 250 million people, has fueled the growth of P2P.\nChief executive officer of Sequoia Capital-backed Modalku, Reynold Widjaya, poses for a picture at Modalku's office in Jakarta, Indonesia, January 29, 2018. REUTERS/Beawiharta Financing demand had been “beyond expectation”, said Reynold Wijaya, co-founder and chief executive of Sequoia Capital-backed ModalKu, which has distributed more than 540 billion rupiah in financing to SMEs in Indonesia within two years of operation.\nModalKu accepts less than a fifth of loan applicants to curb the risk of fraud or default.\n“The biggest reason for default in Indonesia is actually not credit risks, but mostly fraud,” said Wijaya.\nOJK also wants P2P operators to expand financing to Indonesia’s 40 million farmers.\n“Agriculture is still also a segment that is underserved and a lot of them have to rely on ‘tengkulak’, and we’d like to change that,” said Benedicto Haryono, chief executive of KoinWorks, referring to middlemen who buy farmers’ produce and give out short-term loans, often at high interest rates.\nKoinworks, which aims to lift financing six- to seven-fold this year, is launching pilot agriculture loans this year, and Haryono said this could give farmers a credit history and make them more bankable.\nSuch platforms can also tap overseas funding. KoinWorks, where the minimum amount users can lend is 100,000 rupiah ($7.50), obtains funding from countries such as Germany, Singapore and Australia.\nNurhaida, deputy chairman of OJK, told reporters the regulator is working on a roadmap to “regulate and facilitate fintech development”.\nOperators, however, hope that any new rules will not be too onerous.\n“We are still start-ups, we can’t be too strictly regulated just yet,” said ModalKu’s Wijaya.\nAdditional reporting by Cindy Silviana; Editing by Ed Davies and Jacqueline Wong\n ", "external_links": [], "published": "2018-01-30T06:20:00.000+02:00", "crawled": "2018-01-30T07:10:15.401+02:00", "highlightTitle": ""}