{"organizations": [], "uuid": "a221ba878e2c424893372faab27ba345522130ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/safrica-disease/death-toll-in-s-africa-listeria-outbreak-jumps-to-61-idUSL8N1P31ZS", "country": "US", "domain_rank": 408, "title": "Death toll in S.Africa listeria outbreak jumps to 61", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-08T20:20:00.000+02:00", "replies_count": 0, "uuid": "a221ba878e2c424893372faab27ba345522130ce"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/safrica-disease/death-toll-in-s-africa-listeria-outbreak-jumps-to-61-idUSL8N1P31ZS", "ord_in_thread": 0, "title": "Death toll in S.Africa listeria outbreak jumps to 61", "locations": [], "entities": {"persons": [{"name": "lucia anelich", "sentiment": "none"}], "locations": [{"name": "johannesburg", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "pretoria", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "national institute of communicable diseases", "sentiment": "none"}, {"name": "department of health", "sentiment": "none"}, {"name": "nicd", "sentiment": "none"}, {"name": "sovereign foods", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JOHANNESBURG, Jan 8 (Reuters) - The death toll from an outbreak of listeria in South Africa has jumped beyond 60 in the past month, health authorities said on Monday, adding they had closed a poultry abattoir where the bug that causes the disease had been detected.\nSince monitoring of the outbreak began last January, 720 laboratory-confirmed cases of food poisoning due to the disease, also known as listeriosis, have been reported, the National Institute of Communicable Diseases (NICD) said.\nThat was up from 557 in December, since when recorded deaths had risen to 61 from 36.\nA food microbiologist said the “alarming” outbreak appeared to be the biggest ever recorded and could spread further if it was not tackled urgently.\n“Of the documented outbreaks globally that we know of... our numbers are way above any of those other cases,” said Dr Lucia Anelich, who runs her own food safety consultancy.\nThe Department of Health said it had closed a poultry abattoir operated by Sovereign Foods in the capital Pretoria after detecting listeria there, and had banned it from preparing food.\nThe department said it did not yet know whether this abattoir was the source of the outbreak, which the NICD said was still unknown.\nNo-one at Sovereign Foods, which delisted from the Johannesburg stock exchange in November, was immediately available for comment.\nListeria food poisoning is a bacterial infection that can be treated with antibiotics if diagnosed in time. The bacteria can be found in animal products including cold cut meats, poultry and unpasteurised milk, as well as fresh fruits and vegetables.\nThe disease can cause flu-like symptoms and diarrhoea, and in more severe cases spread from the intestine to the blood, causing bloodstream infections, or to the central nervous system, causing meningitis.\nAnelich said a listeriosis strain known as ST6 had been identified in nine out of 10 of the South African cases. That should make tracing the source easier, “because now we know that it probably originates from one processing facility”.\nA health department official said the strain was not drug-resistant and that the deaths were due to delays in diagnosis, meaning cases were not treated in time.\nReporting by Mfuneko Toyana; Editing by Kate Kelland and John Stonestreet\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T20:20:00.000+02:00", "crawled": "2018-01-09T17:09:04.043+02:00", "highlightTitle": ""}