{"organizations": [], "uuid": "5f7b3e2cce074f879631247fd358165668ca8679", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/19/104906899-GettyImages-894967674.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/trump-to-farmers-i-ended-the-regulatory-assault-on-your-way-of-life.html", "country": "US", "domain_rank": 767, "title": "Trump to farmers: I ended the 'regulatory assault on your way of life'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.615, "site_type": "news", "published": "2018-01-08T21:13:00.000+02:00", "replies_count": 0, "uuid": "5f7b3e2cce074f879631247fd358165668ca8679"}, "author": "Christina Wilkie", "url": "https://www.cnbc.com/2018/01/08/trump-to-farmers-i-ended-the-regulatory-assault-on-your-way-of-life.html", "ord_in_thread": 0, "title": "Trump to farmers: I ended the 'regulatory assault on your way of life'", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}], "locations": [{"name": "d.c.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "nashville tennessee", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "fda", "sentiment": "none"}, {"name": "american farm bureau", "sentiment": "none"}, {"name": "epa", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump will tell farmers on Monday his administration has cut their taxes and slashed regulations on agriculture and food processing that amounted to a \"regulatory assault on your way of life.\"\n\"For years, many of you have endured burdensome fines, inspections, paperwork and relentless intrusion from an army of regulators at the EPA, the FDA and countless other federal agencies,\" Trump will tell the annual convention of the American Farm Bureau in Nashville Tennessee, according to excerpts released Monday by the White House.\nTrump will go on to say he is \"proud to report that within our first 11 months, my administration has canceled or delayed over 1,500 planned regulatory actions — more than any president in history.\" The president will tout a figure of 22 regulations cut \"for every one new regulation.\"\nAmong the industries affected by this deregulation are agricultural biotech and forestry, Trump will say.\nBloomberg | Getty Images President Donald Trump at a national security strategy event on December 18, 2017 in Washington, D.C. \"We are streamlining regulations that have blocked cutting edge biotechnology –setting free our farmers to innovate, thrive and grow. We are removing harmful restrictions on forestry so you can log more timber, plant more trees and export more renewable resources to other countries,\" the president will say to the convention attendees.\nTrump also plans to take a victory lap following the passage late last year of massive Republican tax cuts for businesses, and more modest tax cuts for individuals.\nThe president will highlight recent announcements by a number of corporations that they plan to give out $1,000 bonuses to certain workers. Trump will claim that \"more than 1 million workers have already received a tax cut bonus,\" a figure that is impossible to verify.\nThe conservative group Americans for Tax Reform recently published a list of companies that have announced plans to give out such bonuses to some of their workers. The total number of employees that ATR predicted will get bonuses was 1,003,547.\nThe speech is the president's first major road trip address of 2018, and it is part of a broader effort to shore up voters and demographic groups that will be critical for Republicans to win over if they intend to keep their majorities in the House and Senate in the November midterm elections.\nIn 2016, Trump won rural voters by a nearly 2-to-1 margin over Democrat Hillary Clinton. Sixty-two percent of rural voters cast their ballots for Trump, while only 34 percent pulled the lever for Clinton.\nRural voters in such traditionally Democratic \"blue wall\" states as Michigan and Wisconsin were especially instrumental in helping Trump win the election.\nWATCH: Tough times for heartland farmers show chapters Times are tough for farmers in the heartland 4:31 PM ET Wed, 27 Dec 2017 | 00:54", "external_links": [], "published": "2018-01-08T21:13:00.000+02:00", "crawled": "2018-01-08T21:13:25.014+02:00", "highlightTitle": ""}