{"organizations": [], "uuid": "069304dc815f17578792b9d236dfffd53eca9003", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-espey-mfg-electronics-corp-announced-new-three-year-term-for-president-and-ceo.html", "country": "US", "domain_rank": 767, "title": "Espey Mfg. & Electronics Corp. announced new three year term for President and CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T00:20:00.000+02:00", "replies_count": 0, "uuid": "069304dc815f17578792b9d236dfffd53eca9003"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-espey-mfg-electronics-corp-announced-new-three-year-term-for-president-and-ceo.html", "ord_in_thread": 0, "title": "Espey Mfg. & Electronics Corp. announced new three year term for President and CEO", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SARATOGA SPRINGS, N.Y., Jan. 16, 2018 (GLOBE NEWSWIRE) -- Espey Mfg. & Electronics Corp. (NYSE MKT:ESP) announced that its Board of Directors has approved a new three year employment agreement for its President and Chief Executive Officer, Patrick T. Enright, Jr.\nMr. Enright was hired as Espey’s President and CEO in 2015. Prior to his employment with Espey, Mr. Enright was employed by DRS Technologies for five years and held the position of Vice President of Strategic Planning. He has held various positions in the power electronics and ship building industry for more than 25 years.\nHoward Pinsley, Chairman of the Board commented, “Pat has our full confidence. He has guided the company through a down period affecting one of the major markets we serve, and has developed a new strategic plan with a focus on diversifying our customer base, the results of which should be realized in the next several years. We wanted to show our commitment to Pat, and are very pleased that he has signed on for at least another three years. We trust the relationship extends beyond that.”\nEspey’s primary business is the development, design, and production of standard and specialized military and industrial power electronics, power supplies, transformers and contract manufacturing. The Company’s web site can be found on the Internet at www.espey.com .\nFor further information, contact Mr. David O'Neil at (518) 245-4400.\nCertain statements in this press release are \"forward-looking statements\" and are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements represent the Company's current expectations or beliefs concerning future events. The matters covered by these statements are subject to certain risks and uncertainties that could cause actual results set forth in the forward-looking statements. The Company wishes to caution readers not to place undue reliance on any such forward-looking statements, which speak only as of the date made.\nSource:Espey Mfg. & Electronics Corp.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/d9065053-6d54-4a9f-9296-5a3f2213a656"], "published": "2018-01-17T00:20:00.000+02:00", "crawled": "2018-01-17T00:04:15.008+02:00", "highlightTitle": ""}