{"organizations": [], "uuid": "5860eba65e7eee9bcc9df222e0efd2475e16dbf9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/02/mpw-revised-logo-2-42.png", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/30/state-of-the-union-joanne-lipman-wynn-resorts-broadsheet-for-jan-30/", "country": "US", "domain_rank": 1196, "title": "State of the Union, Joanne Lipman, Wynn Resorts: Broadsheet Jan 30 | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.238, "site_type": "news", "published": "2018-01-30T09:53:00.000+02:00", "replies_count": 0, "uuid": "5860eba65e7eee9bcc9df222e0efd2475e16dbf9"}, "author": "Kristen Bellstrom", "url": "http://fortune.com/2018/01/30/state-of-the-union-joanne-lipman-wynn-resorts-broadsheet-for-jan-30/", "ord_in_thread": 0, "title": "State of the Union, Joanne Lipman, Wynn Resorts: Broadsheet Jan 30 | Fortune", "locations": [], "entities": {"persons": [{"name": "joanne lipman", "sentiment": "negative"}, {"name": "wynn", "sentiment": "negative"}, {"name": "kristen bellstrom", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "wynn resorts", "sentiment": "negative"}, {"name": "gannett", "sentiment": "none"}, {"name": "usa today", "sentiment": "none"}, {"name": "eic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Kristen Bellstrom 7:53 AM EST \nGood morning, Broadsheet readers! Wynn Resorts stock is tanking, everyone is wondering who will show up for the State of the Union tonight, and Joanne Lipman has some tips for turning to your male co-workers into allies. Enjoy your Tuesday. EVERYONE'S TALKING \n• Talking the talk . Today’s essay comes from Joanne Lipman, the former chief content officer of Gannett and EIC of USA Today. Her new book, That’s What She Said: What Men Need to Know (And What Women Need to Tell Them) About Working Together , comes out today . \nHow do we close the gender gap at work? It starts with a missing ingredient: Men. \nWomen talk with one another all the time about the issues we face in our careers, from the daily frustrations of being overlooked and underpaid, to the extremes of sexual harassment and assault. \nBut women talking amongst ourselves is half a conversation, which can solve at best 50% of the problem. We need men to join us. For the past three years, I’ve searched out men across the country and globe who are trying to reach across the gender divide. In That’s What She Said, I tell their stories, backed by data and research, culminating in real-world actions we can all take to close the gap. \nFor women, here are a few takeaways to help convince men—the good guys, that majority of men who aren’t sexual predators—to join us in the quest for parity: \n1. Marshal the facts . Championing women should be a worthy goal in and of itself. But if that’s not enough, the economic argument is incontrovertible: Adding women makes work groups more creative. Companies with female CFOs make fewer, better acquisitions than those with male CFOs. Firms with the most female board members outperform those with the least by almost every financial measure. Mixed groups can even solve a murder more accurately than single-sex groups. \nIn short, equality is a business imperative. Want a recipe for success? Simply add women. \n2. Bring a man to your women’s meeting . Many companies now have employee groups for women, or at least the occasional all-hands for women. Why not invite men to your next meeting? \nI’ve spoken at a number of mixed-gender meetings, and the results are revelatory. When women talk about the daily challenges we face—being interrupted, overlooked, our work attributed to a man—there’s a familiar nod of recognition among other women. But for the men in the room, it can be a smack-the-forehead realization, a recognition of a phenomenon that they’ve never noticed before. And once they see it, they can’t unsee it—which means they are positioned to do something about it. \n3. Acknowledge your own biases. At least 20% of companies in the U.S. now offer unconscious bias training, intended to help us counter those prejudices buried so deeply inside of us that we don’t even realize they exist. That figure is expected to rise to as much as 50%. But plenty of men still feel like the training is another way of beating up on them. The message they take away: It’s all your fault! \nCopping to your own biases can help. I’ll often mention that I took the implicit bias test, and even I came out as “moderately” biased against working women. What’s more, research shows that these biases start early: moms like me routinely overestimate the crawling ability of their sons, while they underestimate that of their daughters. Parents of two-year-olds who ask Google “Is my child a genius?” are more than twice as likely to ask that of a boy than of a girl. \nAcknowledging our own biases helps eliminate the stigma of men admitting theirs—which in turn makes it more likely they will take steps to counteract them. \nTo read the rest of the Lipman’s tips, click here: Fortune ALSO IN THE HEADLINES \n• State of disunion . President Trump will deliver his first State of the Union address tonight—sparking lots of chatter about who will attend the remarks: Melania Trump , who has been largely out of sight since the Stormy Daniels allegations, will be there. Justice Ruth Bader Ginsburg , as well as Rep. Frederica Wilson (D-Fla.) and a host of other Democratic lawmakers say they will not. Members of the Congressional Black Caucus will attend wearing red pins that bear the name of Recy Taylor, the African American woman who was gang-raped after being abducted by six white men while walking home from church in 1944 and reported the crime to no avail. Evelyn Rodriguez, whose daughter Kayla Cuevas was killed by MS-13 gang members on Long Island in 2016, was invited by the White House to attend. \n• Wynn loses . File this with evidence that sexual harassment is bad for business: Fallout from the WSJ investigation into allegations against Steve Wynn continued yesterday, with shares of Wynn Resorts falling another 9%. In total, Wynn Resorts has shed about $3.5 billion in value since the story appeared on Friday. Fortune \n• Failing upwards . Dayan Candappa, a former top editor at Reuters, was fired in 2016 after a subordinate filed a complaint saying he repeatedly sexually harassed her—including making promises to further her career if she complied with his demands. Yet only a few months after his termination, Candappa was hired at Newsweek Media Group, where he is currently the global editor-in-chief of the International Business Times and chief content officer of Newsweek Media Group. Buzzfeed \n• Yassss, (medieval) kweens! Need a bit of uplifting news? Check out this delightful story about why Medieval Times—yes, the “G-rated Game of Thrones ” dinner theater where you watch jousting while chomping roast chicken with your hands—decided to replace all its kings with queens. New York Times IN CASE YOU MISSED IT \n• Sony slips up . Sony Music got heckled on Twitter after responding to Kesha’s thrilling Grammy performance of “Praying” with a congratulatory tweet. The reason for blowback: Fans accused Sony of failing to support Kesha in her legal battle with Dr. Luke. Fortune \n• Military cred . The New York Time s profiles Elaine Luria, Amy McGrath, and Mikie Sherrill—all Naval Academy graduates, all Democrats, and all running for Congress. While many women are making first-time bids this year, the NYT argues that Luria, McGrath, and Sherrill are “offering something that breaks through—the kind of military credentials and academy service that have propelled men to office since the founding of the country. And they are running in swing districts where military service is likely to resonate and where Democrats must win to wrest control of the House from Republicans.” New York Times \n• A brave tale . In her review of Brave , the new book by Rose McGowan, Michelle Goldberg writes: “Much of Brave reads like the diary of a woman driven half-mad by abusive men who assume no one will listen to her. In this case, the truth was finally—and, for McGowan, triumphantly—exposed, but reading Brave , I kept thinking about how many more women must be written off as crazy and crushed under the weight of secrets no one wants to hear.” ", "external_links": [], "published": "2018-01-30T09:53:00.000+02:00", "crawled": "2018-01-30T15:04:05.012+02:00", "highlightTitle": ""}