{"organizations": [], "uuid": "76ba476a94a44fbfbceaef756d8122e3c4d4f68d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/30/104977149-Untitled-1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/bezos-buffett-dimon-should-learn-from-past-health-cost-failure.html", "country": "US", "domain_rank": 767, "title": "Bezos, Buffett, Dimon should learn from past health cost failure", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.217, "site_type": "news", "published": "2018-01-30T22:34:00.000+02:00", "replies_count": 0, "uuid": "76ba476a94a44fbfbceaef756d8122e3c4d4f68d"}, "author": "Christina Farr", "url": "https://www.cnbc.com/2018/01/30/bezos-buffett-dimon-should-learn-from-past-health-cost-failure.html", "ord_in_thread": 0, "title": "Bezos, Buffett, Dimon should learn from past health cost failure", "locations": [], "entities": {"persons": [{"name": "buffett", "sentiment": "negative"}, {"name": "dimon", "sentiment": "negative"}, {"name": "warren buffett", "sentiment": "negative"}, {"name": "jeff bezos", "sentiment": "negative"}, {"name": "jamie dimon", "sentiment": "negative"}, {"name": "bezos", "sentiment": "negative"}, {"name": "berkshire hathaway", "sentiment": "negative"}, {"name": "david goldsmith", "sentiment": "none"}, {"name": "goldsmith", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "amazon", "sentiment": "negative"}, {"name": "walmart", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}, {"name": "at&t", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Amazon , Berkshire Hathaway and JPMorgan Chase aren't the first employers to join up and use their combined might to figure out how to crack down on health care costs .\nIn 2013, seasoned health executive David Goldsmith was named executive director for an employer consortium called Dossia , which counted AT&T , Applied Materials , Intel , and Walmart among its members. The group's mission is strikingly similar to the stated goals for Amazon and its partners: To improve health care in America while lowering costs for employers.\nThat effort, like many others before it, did not succeed. It shut down in 2016 after millions of dollars in investments and a decade of operations, Goldsmith told CNBC.\nHere are are some of the key insights Goldsmith would share with Jeff Bezos, Warren Buffett and Jamie Dimon as they move forward with their bold, but undeniably challenging, mission:\nPrivacy concerns are real Goldsmith said one of the biggest hurdles, and one that Amazon will need to confront, is privacy. In his experience, American workers were not all that comfortable with their employers taking such an active role in their health.\nThat's not an unreasonable position. Some employers, like Victoria Hospital in Texas, have stated that they won't even hire someone with a body mass index over a certain threshold (35, which is about 220 pounds for someone who is 5-foot-6), while others have been critiqued for introducing workplace wellness programs that tend to benefit those who are already fit while penalizing people with serious health conditions. That's particularly damaging for people who are juggling multiple jobs to support a family, or are just getting back into exercise after giving birth.\n\"Employees didn't like that feeling of being meddled with,\" said Goldsmith, who now works at Wego Health, a company that connects pharma companies with influential patients.\nTo ensure its workers are comfortable, Amazon and its partners will need to figure out a way to message to employees that they will still have the same freedoms and will not be unduly shamed or treated differently for their personal health choices.\nData is hard to come by and analyze The lack of available data has long prevented employers from figuring how where their biggest expenditures were coming from.\nWithout that, said Goldsmith, company benefits teams couldn't make substantive changes that would allow them to shave health costs while maintaining quality.\nThe companies that own data about health expenses, ranging from the health systems to health plans, haven't had much reason to share it with large self-insured employers. The health care system still operates in a so-called \"volume-based world\" that pays doctors for tests and procedures and not for overall health outcomes. There's little financial incentive for transparency.\nAs a result, Dossia focused on getting health information like labs, charts, procedures and so on, into the hands of the workers themselves, and providing them with a platform to make better choices based on that personal health information. Dossia also lobbied for better standards for data-sharing, which are now enabling companies like Apple to offer up health data to consumers right on the iPhone.\nThe good news is that health policy experts are pushing for new models of \"value-based\" care that give doctors more of an incentive to keep people healthy, rather than to treat the sick. Recent legislation like MACRA rewards clinicians for the quality of care they provide to Medicare patients.\nAmazon and its partners will have an easier time getting data than its predecessors, thanks to these recent policy changes. But accessing it and analyzing it to figure out how to help employees make meaningful changes still presents a formidable challenge, Goldsmith suggests.\n\"The big question is whether these companies will be able to compel the health plans or those who manage the big health systems to ensure that all of this data that is relevant to employees and their families will be readily available.\"", "external_links": [], "published": "2018-01-30T22:34:00.000+02:00", "crawled": "2018-01-30T22:39:02.010+02:00", "highlightTitle": ""}