{"organizations": [], "uuid": "7da88a31c253b3b120051eca685ae29e9da91ca9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-axiomsl-hires-harry-chopra-as-chief-client-officer-to-drive-growth.html", "country": "US", "domain_rank": 767, "title": "AxiomSL Hires Harry Chopra as Chief Client Officer to Drive Growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T13:00:00.000+02:00", "replies_count": 0, "uuid": "7da88a31c253b3b120051eca685ae29e9da91ca9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-axiomsl-hires-harry-chopra-as-chief-client-officer-to-drive-growth.html", "ord_in_thread": 0, "title": "AxiomSL Hires Harry Chopra as Chief Client Officer to Drive Growth", "locations": [], "entities": {"persons": [{"name": "harry chopra", "sentiment": "negative"}, {"name": "chopra", "sentiment": "none"}], "locations": [{"name": "medellin", "sentiment": "none"}], "organizations": [{"name": "new york & london & singapore", "sentiment": "negative"}, {"name": "s&p capital iq", "sentiment": "none"}, {"name": "axiomsl", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK & LONDON & SINGAPORE & MEDELLIN--(BUSINESS WIRE)-- AxiomSL , the leading global provider of regulatory reporting, risk and data management solutions, today announced the appointment of Harry Chopra as Chief Client Officer, effective immediately. In this role, Mr. Chopra will oversee AxiomSL’s global business development efforts, implement go-to-market strategies and build worldwide client-driven growth.\nMr. Chopra is a veteran in the space and brings more than 30 years of experience in global sales and financial services. Throughout his career, Mr. Chopra has pioneered a number of successful initiatives in the financial sector. Most recently, he was the Chief Commercial Officer at Credit Benchmark, where he developed the concept of consensus credit estimates by working with the Chief Risk Officer and Chief Credit Officer community at national, regional and global banks.\nIn his previous roles prior to joining Credit Benchmark, Mr. Chopra was the head of sales and client services for S&P Capital IQ, where he delivered impressive year-over-year revenue growth. Mr. Chopra also held leadership positions at Citigroup Asset Management as the Head of International Retail Distribution and the Head of Institutional Marketing.\n“I am delighted to welcome Harry to the AxiomSL team,” said Alex Tsigutkin, Founder and CEO of AxiomSL. “Harry comes with a remarkable financial services background and will oversee an important client-facing role globally. Along with his proven leadership skills and track record of financial success, Harry will play a fundamental role in achieving our growth targets and implementing AxiomSL’s go-to-market strategies. We are excited to have him join, as a key part of our management team to help fuel our long-term expansion.”\nOn his appointment, Mr. Chopra said, “I’m delighted to join the AxiomSL leadership team. One of my goals is to continue the immense growth AxiomSL has experienced, by driving demand generation and sales. I’ve spent the majority of my career in the financial sector and have followed AxiomSL with great interest. AxiomSL stands out as a leader in the risk and regulatory space, and I’m looking forward to my future at the company to help it grow and scale to meet its massive potential.”\nAbout AxiomSL:\nAxiomSL is the leading global provider of regulatory reporting, risk and data management solutions for financial services firms, including banks, broker dealers, asset managers and insurance companies. Its unique enterprise data management (EDM) platform delivers data lineage, risk aggregation, analytics, workflow automation, validation and audit functionality and disclosure. For more information, visit AxiomSL at www.axiomsl.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104005079/en/\nMedia:\nNew York\nWater & Wall Group\nDanielle Orsino, +1 646-343-9672\ndanielle@w.group\nor\nAxiomSL\nFrancine Gittins, +1 212-248-4188\nfgittins@axiomsl.com\nSource: AxiomSL", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.axiomsl.com&esheet=51737212&newsitemid=20180104005079&lan=en-US&anchor=AxiomSL&index=1&md5=ab9d748dfdf3b843c2dbdcc2fd15eae0", "http://www.businesswire.com/news/home/20180104005079/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.axiomsl.com&esheet=51737212&newsitemid=20180104005079&lan=en-US&anchor=www.axiomsl.com&index=2&md5=9dc557c267b86fa10305a9232502b67b"], "published": "2018-01-04T13:00:00.000+02:00", "crawled": "2018-01-04T14:13:00.034+02:00", "highlightTitle": ""}