{"organizations": [], "uuid": "62ebadb09cf16ff107918ec68af54130c5805bdf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-890897004.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/11/google-redux-speaker-acquisition/", "country": "US", "domain_rank": 1196, "title": "Google Acquires Redux in Smartphone Speaker Push | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.926, "site_type": "news", "published": "2018-01-11T02:00:00.000+02:00", "replies_count": 0, "uuid": "62ebadb09cf16ff107918ec68af54130c5805bdf"}, "author": "Don Reisinger", "url": "http://fortune.com/2018/01/11/google-redux-speaker-acquisition/", "ord_in_thread": 0, "title": "Google Acquires Redux in Smartphone Speaker Push | Fortune", "locations": [], "entities": {"persons": [{"name": "don reisinger", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "google", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Don Reisinger January 11, 2018 \nAlphabet’s Google has bought a U.K.-based startup that could dramatically change how you listen to music on your smartphones. \nThe company, called Redux, has created a technology that can turn smartphone screens into speakers, according to Bloomberg, which earlier reported on the acquisition. The feature would eliminate the need for separate speakers but still let users play audio, potentially creating opportunities for Google to develop new smartphone design concepts. \nLike other major technology companies, Google acquires small startups all the time. In some cases, those startups’ products are integrated into existing company products. In others, the company will acquire the startup for access to its talent or an underlying feature. Google, which hasn’t confirmed that it’s even acquired Redux, hasn’t said what it might have planned. \nGet Data Sheet , Fortune’s technology newsletter \nStill, companies big and small are eyeing ways to cram more into increasingly thin and streamlined smartphones. Google, itself, appears to be doubling down on smartphone design after it acquired HTC’s mobile division late last year . The company could conceivably use the HTC team’s expertise with Redux’s technology to reduce speakers, create more room inside its smartphone cases, and create different-looking devices. \nIt’s unclear from the report exactly when Google acquired Redux. Bloomberg said that an official transfer of shares from Redux to Google occurred in December. Crunchbase, a site that tracks startups, says the acquisition was completed in August. \nGoogle did not immediately respond to a Fortune request for comment and clarification about the apparent acquisition. SPONSORED FINANCIAL CONTENT", "external_links": [], "published": "2018-01-11T02:00:00.000+02:00", "crawled": "2018-01-12T02:40:21.004+02:00", "highlightTitle": ""}