{"organizations": [], "uuid": "be012df2c3e5526ea09840b9ee19c4554d9fb253", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/cnbc-transcript-blackstone-chairman-ceo-stephen-schwarzman-speaks-with-squawk-box-from-davos-today.html", "country": "US", "domain_rank": 767, "title": "CNBC TRANSCRIPT: BLACKSTONE CHAIRMAN & CEO STEPHEN SCHWARZMAN SPEAKS WITH SQUAWK BOX FROM DAVOS TODAY", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T23:10:00.000+02:00", "replies_count": 0, "uuid": "be012df2c3e5526ea09840b9ee19c4554d9fb253"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/cnbc-transcript-blackstone-chairman-ceo-stephen-schwarzman-speaks-with-squawk-box-from-davos-today.html", "ord_in_thread": 0, "title": "CNBC TRANSCRIPT: BLACKSTONE CHAIRMAN & CEO STEPHEN SCHWARZMAN SPEAKS WITH SQUAWK BOX FROM DAVOS TODAY", "locations": [], "entities": {"persons": [{"name": "stephen schwarzman", "sentiment": "negative"}, {"name": "joe kernen", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "stephen", "sentiment": "none"}, {"name": "steve schwarzman", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "blackstone", "sentiment": "negative"}, {"name": "united states", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WHEN: Today, Tuesday, January 23, 2018\nWHERE: CNBC's \"Squawk Box\" – Live from the World Economic Forum in Davos, Switzerland\nFollowing is the unofficial transcript of a CNBC interview with Blackstone Chairman & CEO Stephen Schwarzman on CNBC's \"Squawk Box\" (M-F 6AM-9AM) live from the World Economic Forum in Davos, Switzerland today, Tuesday, January 23rd. Following is a link to video from the interview on CNBC.com: https://www.cnbc.com/video/2018/01/23/blackstone-ceo-global-economy-expanding-despite-geopolitical-risk.html?play=1 .\nAll references must be sourced to CNBC.\nJOE KERNEN: GOVERNMENT SHUTDOWN AS YOU KNOW, IS OVER AND JOINING US NOW, STEVE SCHWARZMAN, HE'S CHAIRMAN AND CEO, CO-FOUNDER OF THE PRIVATE EQUITY FIRM BLACKSTONE. YOU MUST BE WATCHING EVENTS GLOBALLY BUT ALSO IN THE UNITED STATES, STEVE, JUST IN WONDER –WONDERMENT AND I GUESS A DEGREE OF SATISFACTION, YOU WERE AN EARLY SUPPORTER OF PRESIDENT TRUMP. DO YOU TIE SOME OF THE GDP, THE CONFIDENCE THAT WE'RE THAT SEEING IN BUSINESS LEADERS, THE STOCK MARKET, ANY OF THAT GET – TRACE IT'S BACK TO TRUMP AND HIS POLICY?\nSTEPHEN SCHWARZMAN: WELL, I THINK IT DOES. YOU STARTED SEEING THIS RIGHT AFTER THE ELECTION. AND THE MARKETS STARTED GOING UP ON ANTICIPATION OF SORT OF TAX REFORM OR TAX CUTS AND CHANGES IN REGULATION.AND THOSE THINGS, I THINK WE TALKED BEFORE IT LAST TIME, YOU KNOW, I WAS HERE, THOSE THINGS HAPPENED OR ARE HAPPENING. SO I THINK THEY'LL HAVE A SUBSTANTIAL IMPACT ON THE ECONOMY.\nKERNEN: ARE YOU – BEING AN INDIVIDUAL THAT WILL SOMEHOW DO BETTER WITH NONCORRELATION TO OVERALL EQUITY MARKETS, ALTERNATIVES, PEOPLE NEED THOSE WHEN THE MARKET'S GOING UP, IS IT BITTERSWEET TO SEE ETFs DOING BETTER THAN WHAT YOU CAN DO IN PRIVATE EQUITY?\nSCHWARZMAN WELL IT'S ACTUALLY FASCINATING. LIKE MOST CYCLICAL THINGS, IT'S PROBABLY RELATIVELY LIMITED. IT'S NICE TO SEE. IT'S GOOD FOR PENSION FUNDS, IT'S GOOD FOR ALL OF OUR PORTFOLIO COMPANIES, YOU KNOW, THEY BECOME WORTH MORE ALL THE TIME, AND SO IT'S NOT LIKE WE DON'T BENEFIT FROM THIS. IT'S GOOD FOR THE BASIC INVESTOR.\nKERNEN: GEOPOLITICAL RISK WAS THE ONE THING THAT YOU SAID COULD BE THE PROBLEM DOWN THE ROAD. I THINK YOU'RE -- I DON'T KNOW HOW MANY TIMES YOU WERE Quote: D YOU'RE NOT GOING TO BUY ANY OFFICE BUILDINGS IN SEOUL. THEY HAVE A JOINT OLYMPICS TEAM NOW. DO YOU FEEL BETTER ABOUT REAL ESTATE IN SOUTH KOREA?\nSCHWARZMAN: WELL, YOU MIGHT IN TERMS OF SKATING RINKS.\nKERNEN: RIGHT. BUT THINGS HAVE – THE GEOPOLITICAL RISK IS LESS THAN THREE MONTHS AGO PROBABLY.\nSCHWARZMAN: IT FEELS LESS THAN THREE MONTHS AGO BUT THAT DOESN'T STOP THE DEVELOPMENT OF NUCLEAR TECHNOLOGY AND BALLISTIC MISSILES, AND THINGS THAT WE'VE STOPPED THINKING ABOUT ON A SHORT-TERM BASIS. I LOOK AT SOME OF THE GEOPOLITICAL RISKS RATHER THAN THE ECONOMIC RICKS. ECONOMICALLY RIGHT THE WORLD IS EXPANDING ALMOST EVERY PLACE AND THINGS LOOK GOOD AND PROBABLY WILL CONTINUE TO STAY GOOD, ABSENT SORT OF ANY OF THESE UNPREDICTABLE BLACK SWANS.\nANDREW ROSS SORKIN: THE PRESIDENT IS GOING TO BE HERE ON FRIDAY AND IS GOING TO BE SPEAKING. THERE'S BEEN LOTS OF SPECULATION ABOUT WHAT HE WILL SAY. WHAT DO YOU THINK HE SHOULD SAY TO THIS GROUP IN PARTICULAR? CAN HE PURSUE AN AMERICA FIRST AGENDA HERE? DOES HE HAVE TO PIVOT AND GO IN ANOTHER DIRECTION? MODI WAS JUST SPEAKING THIS MORNING.\nSCHWARZMAN: WELL, I THINK THAT'S A GOOD QUESTION, ANDREW. I'VE BEEN TOLD IT'S A PRETTY GOOD SPEECH THAT'S BEEN WORKED ON A LONG TIME. SO WHATEVER IS GOING TO BE SAID IS PRETTY CONSIDERED. I WOULD EXPECT, AND I DON'T KNOW IT ALL, THAT IT WOULD BE SOME KIND OF MIX OF, YOU KNOW, PURSUING NATIONAL INTERESTS IS NOT A BAD THING BECAUSE LOOK WHAT'S HAPPENING TO COUNTRIES THAT DO THAT. THERE WILL BE SOME OTHER STUFF THAT WON'T BE QUITE AS HARSH AS SOME OF THE OTHER RHETORIC THAT YOU KNOW, GETS REPORTED ON ALMOST A DAILY BASIS.\nBECKY QUICK: WE DID JUST TALK ABOUT THE TRADE ACTIONS THAT TOOK PLACE THIS WEEK. THE ADMINISTRATION RAISING TARIFFS ON SOLAR PANELS AND ON WASHING MACHINES. IS THAT A PRECURSOR OF THINGS TO COME AND WHAT DOES THAT MEAN?\nSCHWARZMAN: IT'S HARD TO KNOW. THERE'S OBVIOUSLY FRICTION AND FRUSTRATION GIVEN THAT THE CHINESE TRADE SURPLUS WENT UP AGAIN. I THINK THE ADMINISTRATION'S LOOKING AROUND THINGS TO DO. ULTIMATELY, THAT'S GOING TO HAVE TO BE ADDRESSED BY BOTH COUNTRIES IF A COMPREHENSIVE WAY. INDIVIDUAL THINGS ARE, YOU KNOW, INDICATIVE, BUT WON'T CHANGE THE OVERALL BALANCE.\nSCHWARZMAN: WHAT DO YOU GOT – 90, 100 BILLION LYING AROUND RIGHT NOW? IS IT HARD TO DEPLOY BECAUSE OF THE MARKET? MAYBE PEOPLE NEED YOU NOW TO FIND YOUR VALUE, THAT WAY THE PRICE IS NOT FULLY REFLECTED IN THE MARKET.\nSCHWARZMAN: THAT'S THE BASIC ZONE, JOE.\nKERNEN: YOU HAVE SOME IDEAS.\nSCHWARZMAN: IT'S NICE TO HAVE THAT AROUND. YOU NEVER KNOW WHEN YOU MIGHT NEED IT. AND SO PRICES ARE HIGH FOR CERTAIN TYPES OF THINGS. GROWTH IS UP, SO YOU HAVE TO BE CAREFUL BUT WE ALWAYS TRY AND ONLY BUY THINGS WHERE WE CAN MAKE THEM BETTER.\nKERNEN: DIDN'T TAX REFORM OPEN UP A WHOLE NEW MIX OF COMPANIES THAT MIGHT NOT FULLY RECOGNIZE THE POSSIBILITIES NOW THAT –\nSCHWARZMAN: TAX REFORM WHERE IT HAS THE ABILITY TO HAVE 100% WRITE-OFFS OF CAPITAL EQUIPMENT, MAKE THOSE TYPES OF COMPANIES MUCH, MUCH MORE ATTRACTIVE.\nSORKIN: I KNOW I AM LOW ON TIME. TALK ABOUT MEGA FUNDS. WE'RE ONE OF THE EARLY MEGA FUNDS. MASA SON TALKS ABOUT WANTING TO CREATE $100 BILLION FUNDS REGULARLY. DOES THAT MAKE SENSE TO YOU? IS SIZE A FRIEND OR AN ENEMY OF THE INVESTOR?\nSCHWARZMAN: WELL, MASA'S A PRETTY UNUSUAL GUY, I MUST SAY. I KNOW HIM QUITE WELL. AND YOU KNOW, HE'S SUPPORTED OUR SCHWARZMAN SCHOLARS PROGRAM IN A GENEROUS WAY. AND YOU KNOW, I'VE BEEN WITH HIM IN SAUDI ARABIA. AND I SPENT A LOT OF TIME WITH MASA. HE'S GOT A PECULIAR KIND OF NICHE AT THE MOMENT, BECAUSE TECH IS WHERE THERE'S ENORMOUS EXPANSION. IT OFTEN COMES WITH NO EARNINGS. AND SO IF YOU'RE GOING TO FINANCE THE EXPANSION OF AN INDUSTRY THAT OFTEN DOESN'T EARN ANYTHING, YOU'RE GONNA NEED LARGE AMOUNTS OF MONEY TO THE EXTENT YOU'RE A BELIEVER THAT THOSE TYPES OF INVESTMENTS WILL TURN OUT TO BE INVOLVED WITH COMPANIES THAT MAKE MONEY. AND SO IT'S A UNIQUE MOMENT OF ENORMOUS POPULARITY, IF YOU WILL, OF TECH AT A TIME WHERE ONLY CERTAIN TECH COMPANIES REALLY MAKE MONEY. SO, TO EXPAND THEM, NEED A LOT OF MONEY. TO KEEP THEM ALIVE, NEED A LOT OF MONEY. AND SO I UNDERSTAND HOW HE'S IN A PARTICULAR PLACE.\nKERNEN: WELL, STEVE SCHWARZMAN, THANK YOU. WE'LL RUN INTO EACH OTHER AGAIN.\nFor more information contact:\nJennifer Dauble\nCNBC\nt: 201.735.4721\nm: 201.615.2787\ne: jennifer.dauble@nbcuni.com\nEmma Martin\nCNBC\nt: 201.735.4713\ne: emma.martin@nbcuni.com\nAbout CNBC:\nWith CNBC in the U.S., CNBC in Asia Pacific, CNBC in Europe, Middle East and Africa, and CNBC World, CNBC is the recognized world leader in business news and provides real-time financial market coverage and business information to more than 409 million homes worldwide, including more than 91 million households in the United States and Canada. CNBC also provides daily business updates to 400 million households across China. The network's 15 live hours a day of business programming in North America (weekdays from 4:00 a.m. - 7:00 p.m. ET) is produced at CNBC's global headquarters in Englewood Cliffs, N.J., and includes reports from CNBC News bureaus worldwide. CNBC at night features a mix of new reality programming, CNBC's highly successful series produced exclusively for CNBC and a number of distinctive in-house documentaries.\nCNBC also has a vast portfolio of digital products which deliver real-time financial market news and information across a variety of platforms including: CNBC.com; CNBC PRO, the premium, integrated desktop/mobile service that provides live access to CNBC programming, exclusive video content and global market data and analysis; a suite of CNBC mobile products including the CNBC Apps for iOS, Android and Windows devices; and additional products such as the CNBC App for the Apple Watch and Apple TV.\nMembers of the media can receive more information about CNBC and its programming on the NBCUniversal Media Village Web site at http://www.nbcumv.com/programming/cnbc .\nFor more information about NBCUniversal, please visit http://www.NBCUniversal.com .", "external_links": ["https://wpyadmin.ne.cision.com/l/ekzlkfiz/wpyadmin.ne.cision.com/l/kvqakfgz/www.cnbc.com/squawk-box-us", "http://www.nbcumv.com/programming/cnbc"], "published": "2018-01-23T23:10:00.000+02:00", "crawled": "2018-01-24T01:57:25.011+02:00", "highlightTitle": ""}