{"organizations": [], "uuid": "4d1d26be07621ea5a85e740acf7335f25a7494f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-immunocore-strengthens-its-board-with-appointments-of-laura-wade-gery-and-kristine-peterson-as-non-executive-directors.html", "country": "US", "domain_rank": 767, "title": "Immunocore Strengthens its Board with Appointments of Laura Wade-Gery and Kristine Peterson as Non-Executive Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T15:00:00.000+02:00", "replies_count": 0, "uuid": "4d1d26be07621ea5a85e740acf7335f25a7494f7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-immunocore-strengthens-its-board-with-appointments-of-laura-wade-gery-and-kristine-peterson-as-non-executive-directors.html", "ord_in_thread": 0, "title": "Immunocore Strengthens its Board with Appointments of Laura Wade-Gery and Kristine Peterson as Non-Executive Directors", "locations": [], "entities": {"persons": [{"name": "laura wade-gery", "sentiment": "negative"}, {"name": "kristine peterson", "sentiment": "negative"}, {"name": "kristine pet", "sentiment": "negative"}, {"name": "laura", "sentiment": "none"}], "locations": [{"name": "conshohocken", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "tesco", "sentiment": "none"}, {"name": "m&s", "sentiment": "none"}, {"name": "tesco.com", "sentiment": "none"}, {"name": "immunocore limited", "sentiment": "none"}, {"name": "marks & spencer group plc", "sentiment": "none"}, {"name": "oxford", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PRESS RELEASE\nImmunocore Strengthens its Board with Appointments of\nLaura Wade-Gery and Kristine Peterson as Non-Executive Directors\n(Oxford, UK and Conshohocken, US, 4 January 2018) Immunocore Limited, the world's leading TCR company focused on delivering first-in-class biologics that transform lives, today announces the appointment of Laura Wade-Gery and Kristine Peterson as Non-Executive Directors.\nLaura Wade-Gery has more than 20 years' executive experience within major publicly-listed companies. She most recently served as an Executive Director at Marks & Spencer Group plc (M&S) as Executive Director of Multi-Channel, with responsibility for both stores and online. During her five years at M&S, she successfully doubled online sales through the development and implementation of digital technology to transform its traditional business. Prior to M&S, Laura served at Tesco plc in several senior positions, most notably for seven years as Chief Executive Officer of the group's online business Tesco.com , taking it from early stage development to a profitable business of over £2 billion sales, making it the global leader in online grocery.\nLaura has also served on the Board of Trinity Mirror plc. She currently serves as a Non-Executive Director on the Boards of the John Lewis Partnership and British Land plc and is a member of the Government Digital Strategy Advisory Board.\nKristine Peterson has more than 30 years' experience in the global pharmaceutical and biotech industry. Her most recent role was as Chief Executive Officer for Valeritas, Inc., where she led the company's development from early stage R&D through to commercialisation, achieving approval by the US Food and Drug Administration (FDA) and European Medicines Agency (EMA) for the company's Type 2 diabetes drug-device. In addition, Kristine raised more than $200 million in equity financing and prepared the company for its public listing on NASDAQ. Prior to Valeritas, Kristine was Company Group Chair at Johnson & Johnson for their worldwide biotech and oncology groups, growing those businesses to more than $6 billion in sales, launching several new products, and re-establishing the foundation for oncology R&D. She was also President and Senior Vice President, Commercial Operations for Biovail Corporation with responsibility for the US and Canadian business units. Earlier in her career, Kristine spent 20 years at Bristol-Myers Squibb in a variety of senior roles, including running their cardiovascular and metabolics business unit.\nKristine continues to play a role on several other Boards of Directors at pharmaceutical and biotech companies including Amarin Corporation, Paratek Pharmaceuticals, Enanta Pharmaceutics, pSivida, and ImmunoGen. She is also a senior advisor to the Healthcare Businesswomen's Association and a former Member of the Biotechnology Industry Organization Board.\nJonathan Knowles, Chairman of Immunocore, said: \"I am very pleased to announce the appointments of Laura and Kristine. Laura brings a wealth of transferable experience in business and commerce and will build on the strength and breadth of the Immunocore Board. Kristine's experience in building and propelling a number of successful pharmaceutical businesses throughout her career will also be extremely valuable. Immunocore is now scaling up its commercial infrastructure as it prepares to advance its lead programme, IMCgp100, towards commercialisation. Both Laura and Kristine have significant commercial expertise that I know will prove beneficial to the Immunocore Board.\"\n- Ends -\nFor more information, please contact:\nImmunocore\nEva-Lotta Allan, Chief Business Officer\nT: +44 (0)1235 438600\nE: info@immunocore.com\nFollow on Twitter: @Immunocore\nConsilium Strategic Communications\nMary-Jane Elliott/Jessica Hodgson/Chris Welsh/Laura Thornton\nT: +44 (0)203 709 5700\nE: Immunocore@consilium-comms.com\nFollow on Twitter: @ConsiliumHC\nNotes for editors\nAbout Immunocore\nImmunocore, the world's leading TCR (T cell receptor) company, is focused on delivering first-in-class biologics that transform lives. The Company's therapeutics have broad applicability across a wide range of indications, including solid tumours and infectious diseases, and can access a far wider range of targets than typical antibody-based therapies. Immunocore has demonstrated compelling single-agent efficacy with its lead programme, IMCgp100, in a solid, 'cold', low mutation tumour of the kind which is challenging for most currently available immuno-oncology therapeutics to address. This programme is in pivotal clinical studies as a monotherapy for the treatment of patients with metastatic uveal melanoma. Immunocore also has a pipeline of wholly-owned and partnered products in development. Partners include Genentech, GlaxoSmithKline, AstraZeneca and Lilly. Immunocore is headquartered near Oxford, UK, with offices near Philadelphia, USA. The Company is privately held by a broad international and private investor base. For more information, please visit www.immunocore.com .\nSource:Immunocore Limited", "external_links": ["https://www.globenewswire.com/Tracker?data=AZgInLFy547BtArjpPbPcR-gfKdTfW_ux1E2B--ljUnS0RuUvzlO-r7L5sDLZqVXUIfYxXMnqxaOnQ9ca7pv0FiDJd1BzGI_iX5MEGryzRc=", "https://www.globenewswire.com/Tracker?data=rLwZthv8s7Q7pIr9XzxezRoS0JLb8kLUTvrBxEfeTfW1Vn3U21o4nd6KAUn31-QMWKiYde6xQZup9q2tHm73khWiQY4gN9nUnHeFGZ9JRQo="], "published": "2018-01-04T15:00:00.000+02:00", "crawled": "2018-01-04T19:34:07.017+02:00", "highlightTitle": ""}