{"organizations": [], "uuid": "4188b2e0fcf9d1c3c6667b8b5d55fd09cb5e9a20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/03/27/104366562-GettyImages-527558890-1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/what-uber-founder-travis-kalanick-could-do-with-his-1-point-4-billion.html", "country": "US", "domain_rank": 767, "title": "What Uber founder Travis Kalanick could do with his $1.4 billion", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T18:02:00.000+02:00", "replies_count": 0, "uuid": "4188b2e0fcf9d1c3c6667b8b5d55fd09cb5e9a20"}, "author": "Jonathan Blumberg", "url": "https://www.cnbc.com/2018/01/08/what-uber-founder-travis-kalanick-could-do-with-his-1-point-4-billion.html", "ord_in_thread": 0, "title": "What Uber founder Travis Kalanick could do with his $1.4 billion", "locations": [], "entities": {"persons": [{"name": "gabi holzwarth", "sentiment": "negative"}, {"name": "travis kalanick", "sentiment": "negative"}, {"name": "walser", "sentiment": "none"}, {"name": "kalanick", "sentiment": "none"}, {"name": "rebecca walser", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "irs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Travis Kalanick, the founder of Uber who resigned as CEO last summer, is reportedly planning to sell 29 percent of his stake in the company, which will make him about $1.4 billion.\nWhat does it mean to come into that kind of wealth? What is the smartest thing to do with the money, and what choices should a person avoid?\nRebecca Walser , a wealth management advisor who specializes in financial planning for high net worth individuals, tells CNBC Make It that the return on the sale will go into a brokerage account, where these kinds of stock equity transactions take place, and that it will immediately be taxed as a long term capital gain at the top rate of 20 percent.\nSo, once Kalanick sells his stock in Uber and deals with the IRS, he'll end up with about $1.1 billion. That is essentially cash that he can transfer into a personal bank account.\nFrom there, Walser suspects he will keep a significant portion invested in the market. \"Everyone is really bullish right now,\" she says, citing the fact that all three indexes — the DOW, NASDAQ and S&P 500 — are all hitting unprecedented highs. \"This is actually a phenomenon ... Psychologically, [people] think they're missing out, and they buy in when the market is hitting these top rates.\"\nshow chapters See how competition makes this $28 billion company president focused 1:45 PM ET Thu, 14 July 2016 | 02:00 That's not always wise, says Walser. \"The one conventional wisdom that I believe is 100 percent right is: Buy low, sell high.\"\nThe market may be overdue for a correction , meaning a slight drop of around 10 percent. She notes, however, that the correction could be put off by the recent tax reform because of its promise to repatriate, or return, several trillion dollars back to companies and thus into the market.\nStill, she says, Kalanick, and any beneficiary of a windfall, should be cautious. As one California man recently discovered, there are often downsides to receiving a sudden and unexpected fortune.\nLoren Krytzer went from living on $200 a month to raking in $1.5 million after selling an old family heirloom that turned out to be a Navajo blanket from the 1800s . Now his taxes are higher and family members are bothering him for a cut. It's not as though all of his problems have gone away. In fact, he finds he may have to move to Idaho, where life will be more affordable.\nshow chapters One man saved his own life by selling a rare $1.5 million blanket he'd thought was worthless 12:47 PM ET Fri, 29 Dec 2017 | 02:05 Kalanick, who will have a lot more money to play with, will probably mostly use it to take chances on new companies. Walser, who recently wrote \" Wealth Unbroken: Growing Wealth Uninterrupted By Market Crashes, Taxes, And Even Death ,\" says, \"A lot of these guys who've had this kind of success will go with venture capital groups, or find private opportunities with small companies that have yet to go public.\"\nKalanick could also invest in digital currency, which Walser, like many experts, believes is high-risk but also may become ubiquitous as more countries recognize it as a legal method of payment, as Japan and others have.\nGenerally, whether you have come into a billion dollars, $1.5 million or more like $10,000 , Walser says, the smart thing to do with your investments is diversify: \"Don't have 100 percent of your wealth exposed to the volatility of the market.\"\nBecause of the possibility of a correction, safe options outside the market include investing in commodities and treasury bonds. \"Obviously we're not going to get a lot of sexy growth here,\" she says. \"But it's a hedge against risk.\"\nReal estate offers another safe option , she says, being \"a great long-term investment and a protection against inflation.\"\nBut that advice may be overly conservative for Kalanick, after the success of Uber. Trying to find that next big idea might just be too tempting, says Walser: \"He's going to be super aggressive with his money. I'll tell you that.\"\nLike this story? Like CNBC Make It on Facebook !\nDon't miss: How this familiar stock outperformed Apple, Amazon, Google and Netflix over the past 7 years\nshow chapters How much do you spend on Uber each month? 8:57 AM ET Tue, 11 July 2017 | 01:59", "external_links": [], "published": "2018-01-08T18:02:00.000+02:00", "crawled": "2018-01-08T18:04:37.010+02:00", "highlightTitle": ""}