{"organizations": [], "uuid": "5e9f8689831c8c478cc59961f79d35819b5a6e19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/mideast-stocks/mideast-stocks-saudi-rises-as-government-winds-down-graft-purge-region-mostly-weak-idUSL8N1PP262", "country": "US", "domain_rank": 408, "title": "MIDEAST STOCKS-Saudi rises as government winds down graft purge, region mostly weak", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T16:02:00.000+02:00", "replies_count": 0, "uuid": "5e9f8689831c8c478cc59961f79d35819b5a6e19"}, "author": "", "url": "https://www.reuters.com/article/mideast-stocks/mideast-stocks-saudi-rises-as-government-winds-down-graft-purge-region-mostly-weak-idUSL8N1PP262", "ord_in_thread": 0, "title": "MIDEAST STOCKS-Saudi rises as government winds down graft purge, region mostly weak", "locations": [], "entities": {"persons": [{"name": "andrew torchia", "sentiment": "none"}], "locations": [{"name": "dubai", "sentiment": "none"}], "organizations": [{"name": "qatar commercial bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "dubai islamic bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 2:03 PM / in an hour MIDEAST STOCKS-Saudi rises as government winds down graft purge, region mostly weak Reuters Staff \n* Saudi crackdown on corruption had unsettled business community \n* Financial settlements could help it spend more this year \n* National Medical Care jumps after swinging to Q4 profit \n* Dubai Islamic Bank sinks on plans for new share issue \n* Qatar Commercial Bank outperforms after resuming cash dividend \nBy Andrew Torchia \nDUBAI, Jan 30 (Reuters) - Saudi Arabian stocks rose on Tuesday as the government indicated it was winding down its crackdown on corruption, while most other major Middle Eastern bourses were weak. \nThe Saudi stock index closed 0.8 percent higher on active volumes after the government’s announcement in late trade. The statement said 56 people were now detained in the purge, down from well over 100 at one stage, and that authorities had reached their target of securing $100 billion of financial settlements from suspects. \nIt is not clear that the government will get any quick infusion of cash: most of the settlements involve real estate or other illiquid assets. \nNevertheless, the settlements may give Riyadh more resources to spend on economic growth this year, and investors welcomed news that the purge, which unsettled the business community, appeared close to being concluded. \nAl Rajhi Bank, a top lender, rose 2.2 percent. National Medical Care jumped 5.7 percent after reporting fourth-quarter net profit of 30.7‍​ million riyals ($8.2 million), swinging from a year-earlier loss of 69.7 million riyals. \nInvestment firm Kingdom Holding, which had risen sharply in the previous two days after owner Prince Alwaleed bin Talal was released in the purge, fell back 1.9 percent. \nThe Dubai index slipped 0.4 percent as Dubai Islamic Bank tumbled 4.6 percent. Its board called an annual general meeting for Feb. 21 to approve a proposed capital increase via issuance of up to 1.65 billion new shares; the bank currently has 4.9 billion outstanding shares. \nBahrain’s Ithmaar Holding, which listed in Dubai on Monday, shot up by its 15 percent daily limit to 0.87 dirham in heavy trade. Its Bahrain-listed shares surged 10.3 percent to 21.5 U.S. cents, equivalent to 0.77 dirham. \nQatar’s index fell 1.3 percent and drilling rig provider Gulf International Services, which has risen sharply in the past two months on climbing oil prices, dropped 5 percent. \nBut Qatar Commercial Bank rose 0.7 percent to 28.40 riyals after reporting that annual net profit rose 21 percent. It proposed a one riyal per share dividend for 2017, compared to a 1-for-20 bonus share issue for 2016. \nQNB Financial Services kept its market perform rating on the stock with a target of 29.00 riyals, saying that while the cash dividend was a positive surprise, asset quality remained under pressure. HIGHLIGHTS \n* Index rose 0.8 percent to 7,631 points. DUBAI \n* Index fell 0.4 percent to 3,440 points. ABU DHABI \n* Index rose 0.3 percent to 4,639 points. QATAR \n* Index fell 1.3 percent to 9,328 points. EGYPT \n* Index fell 0.4 percent to 15,316 points. KUWAIT \n* Index edged down 0.1 percent to 6,664 points. BAHRAIN \n* Index rose 0.6 percent to 1,352 points. OMAN", "external_links": [], "published": "2018-01-30T16:02:00.000+02:00", "crawled": "2018-01-30T16:23:23.000+02:00", "highlightTitle": ""}