{"organizations": [], "uuid": "045ac89c89e758ce1767ea85c6f515614b91c060", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/29/104191958-GettyImages-72866342.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/03/cramer-reviews-the-dows-biggest-winners-and-losers-for-2017.html", "country": "US", "domain_rank": 767, "title": "Cramer reviews the Dow's biggest winners and losers for 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T01:24:00.000+02:00", "replies_count": 0, "uuid": "045ac89c89e758ce1767ea85c6f515614b91c060"}, "author": "Elizabeth Gurdus", "url": "https://www.cnbc.com/2018/01/03/cramer-reviews-the-dows-biggest-winners-and-losers-for-2017.html", "ord_in_thread": 0, "title": "Cramer reviews the Dow's biggest winners and losers for 2017", "locations": [], "entities": {"persons": [{"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "none"}], "locations": [], "organizations": [{"name": "dow", "sentiment": "negative"}, {"name": "boeing", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "boeing aerospace", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As much as some market-watchers may discredit the Dow Jones industrial average , the index has always been a trustworthy proxy for stock performance for CNBC's Jim Cramer.\n\"In fact, right now it's more important than it's been in a long time because its snapshot of 2017 gives you a terrific view of the winners and losers in classic big-cap names, with the overall score a very representative plus-25 percent,\" the \" Mad Money \" host said.\nTo get a better snapshot of what worked and what didn't in 2017, Cramer ran through the Dow's best and worst performers, starting with the average's top five winners.\nWinners 1. Boeing Aerospace giant Boeing ended 2017 as the Dow's No. 1 performer, up a whopping 89 percent for the year.\nEven after its monster run, Cramer argued that Boeing could still have another strong year, putting a $400 price target on the now-$297 stock.\n\"Why am I so confident? It's simple: because 2017 was the year that Boeing's stock became a new and different entity,\" Cramer said. \"It went from being a cyclical to a secular growth play.\"\nFor years, Boeing's stock success was tied to its planes: if analysts loved the latest model, they would raise the numbers; if they didn't, the stock would get slammed.\nBut in 2017, Boeing started to gain credit for its booming order books, its leading position in the secular trend of world travel , its innovative push into space travel and its scale .\n\"Everyone's waiting for a pullback, but the stock's only given you one 10-point reversal since 2015,\" Cramer said. \"That gentle, sloping stock is what you're always looking for. In short, Boeing's a buy.\"\n2. Caterpillar Caterpillar , the most heavily shorted stock in the Dow, snagged the index's second-best spot for 2017 with a 70 percent annual gain.\n\"Caterpillar's another stock that has transformed itself. Not that long ago, CAT was viewed as a total boom-and-bust play that depended on China,\" Cramer said.\nNow, with Asia only accounting for 22 percent of Caterpillar's business, the company has turned its focus to its U.S. business, making its manufacturing processes more efficient and fixing its once-nightmarish balance sheet, the \"Mad Money\" host said.\n\"Sure, Caterpillar is still a cyclical business. That hasn't changed. But right now, things are booming, and in this boom, the company is making a heck of a lot more money off of its earthmovers,\" Cramer said. \"I doubt CAT's stock can repeat its performance from last year, but with President Trump talking a big game about his infrastructure plans this year, there's more in the tank for this stock than for a lot of others out there.\"\n3. Visa Visa logged a 46 percent gain for 2017, securing the No. 3 spot in the Dow index. In 2017, Cramer watched the credit card giant become something of a go-to financial technology stock for investors who were hesitant to buy up bank stocks or more traditional financial names.\n\"Now, you might think the stock would stall out at these levels, but with the dollar diving, this company that gets 52 percent of its business from overseas has got a fabulous tailwind,\" Cramer said.\nBetter yet, Visa's new CEO, Al Kelly, could bring the company's $7.7 billion cash hoard back from overseas to continue the stock's rise, the \"Mad Money\" host added.\n4. Apple As controversial as its stock may be, Apple's 46.1 percent gain made it the fourth-best stock in the Dow for all of 2017. And Cramer wasn't convinced that its run would end anytime soon.\n\"I bet the company's service revenue continues to grow — Apple still, after two years, isn't getting enough credit for that one,\" Cramer said. \"While the stock may not be ready for a shortfall, we haven't heard enough negative things from worthwhile sources to make me want to give up on this one. No way.\"\nDespite concerns about the iPhone 10, Apple's battery issues and some bearish predictions for the stock, the \"Mad Money\" host said he would continue to back the consumer products giant.\n\"I'm sticking to my guns: you own Apple, you don't trade it,\" he said.\n5. Walmart With a 43 percent gain for 2017, Walmart finally saw the fruits of its e-commerce spending as Jet.com's offerings grew in breadth and popularity.\n\"Walmart's a much better company than it was a few years ago,\" Cramer said. \"They've spent heavily to be able to compete with Amazon , and unlike other brick-and-mortar retailers, their pockets are deep enough that the spending has actually been paying off. Fortunately, the Walton family's going with [CEO] Doug McMillon to make Doug McMillions.\"\nLosers Next, Cramer entered the Dow's house of pain to review its five worst-performing stocks, from the weakest of the bedraggled pack to the strongest.\n1. General Electric First and worst of all the Dow components was General Electric , down a staggering 45 percent after a rough 2017.\n\"It takes a special kind of industrial to lose that much value during the best economy in ages,\" Cramer said. \"GE refuses to be introspective about what went wrong. That's a bummer. I certainly hope that new CEO John Flannery explains why the company couldn't earn the $2 this year that it forecast at the end of 2016. If he walks us through it and takes the big write-down we've all been expecting, I think it'll be greeted positively.\"\nFlannery's laundry list of turnaround tasks includes stemming the losses from GE's many struggling divisions and selling assets to pay for the company's dividend.\n\"I can't believe that GE's truly as horrendous as the stock suggests, but I've been wrong all the way down,\" Cramer admitted. \"A fresh start with a recognition of the errors that were committed would go a long way toward establishing the credibility this company needs for its $18 stock to return to the $20s, where it probably belongs.\"\n2. IBM In a year that proved successful for so many different tech stocks, the Dow's surprising second-worst performer was computer play IBM , down more than 7 percent for 2017.\nBut IBM had a busy year. The company made a series of small acquisitions to build a position in the cloud analytics business, invested in strategic growth products as it phased out under-performing legacy businesses and brought in a new mainframe in order to boost earnings.\n\"IBM has reinvented itself many times in its long history. I bet they'll do it again, we just don't know how long it'll take, other than they're not doing it fast enough for many portfolio managers, including the legendary Warren Buffett , who's been jettisoning the stock in spectacular fashion,\" Cramer said. \"The stock's rally today shows this dog can still hunt. [With a] 3.78 percent yield for protection, I think IBM's a buy.\"\nBut considering IBM's run on Wednesday, Cramer suggested investors wait for Thursday's profit-taking to pull the trigger.\n3. Exxon Mobil Coming in third-to-last was oil and gas colossus Exxon Mobil , down 7 percent overall for 2017. Cramer noted that competing stocks like Chevron were up for the year, so Exxon's problems probably stretched beyo", "external_links": [], "published": "2018-01-04T01:24:00.000+02:00", "crawled": "2018-01-04T01:54:30.010+02:00", "highlightTitle": ""}