{"organizations": [], "uuid": "aafcb0183399ddca5012cf25f7296dde2a405a2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-extreme-reach-names-matt-timothy-chief-revenue-officer.html", "country": "US", "domain_rank": 767, "title": "Extreme Reach Names Matt Timothy Chief Revenue Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T16:30:00.000+02:00", "replies_count": 0, "uuid": "aafcb0183399ddca5012cf25f7296dde2a405a2f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-extreme-reach-names-matt-timothy-chief-revenue-officer.html", "ord_in_thread": 0, "title": "Extreme Reach Names Matt Timothy Chief Revenue Officer", "locations": [], "entities": {"persons": [{"name": "matt timothy", "sentiment": "negative"}, {"name": "matt", "sentiment": "none"}, {"name": "vindico", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "specific media", "sentiment": "none"}, {"name": "cbs", "sentiment": "none"}, {"name": "mrc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 16, 2018 /PRNewswire/ -- Extreme Reach, the cloud technology platform for TV and video ad workflow and Talent & Rights management, today announced that Matt Timothy has been named Chief Revenue Officer. Matt has been consulting with the company since June in a business development role during which time his strategic thinking, industry knowledge and management skills earned him widespread support. With decades of experience in digital and traditional media, he is now a member of the executive team and responsible for leading the entire sales operation.\nMatt helped launch Vindico, the first MRC accredited video ad server, which was acquired by Specific Media (now Viant) two years later. He led the company for six years in all, growing it to a market leader with over 40% share of the video market. Earlier in his career, Matt spent many years at CBS, where he was the network's first interactive sales hire and ultimately rose to the role of VP, General Manager of both CBS.com and CBSNews.com . He went on to serve as Senior Vice President of Advanced Advertising at National Cable Communications, where he oversaw the monetization of interactive and addressable capabilities for the set top box for multiple companies including Comcast, Time Warner, Cox and others. Most recently he served as CMO for Sorenson Media, the industry leader in leveraging data and targeting capabilities of Smart TVs.\n\"Matt's deep experience in video and TV advertising coupled with his passion for driving success for brand and agency clients, make him an excellent new addition to our executive team,\" said Tim Conley, President of Extreme Reach. \"He has honed his management skills based on experience in corporate sales as well as several years as an entrepreneur -- a combination well suited for the fast-moving, innovative culture of Extreme Reach.\"\n\"I've long been impressed with Extreme Reach's commitment to transforming and simplifying video advertising,\" said Matt. \"I couldn't be happier to join this team and help an even greater number of marketers and agencies successfully execute their cross screen campaigns with greater efficiency in this exciting and ever-changing industry.\"\nMatt is based in the company's New York City office.\nAbout Extreme Reach\nExtreme Reach offers the only enterprise technology designed distinctly to bring together the TV and video ad workflow and all aspects of Talent & Rights management in a single, easy-to-use cloud platform. One platform and one process make brand advertising easier, and analytics more insightful, with the assurance of rights compliance wherever ads play. Founded in 2008, Extreme Reach proudly serves the world's biggest brands, agencies, post-production houses, all media destinations, and the talent community, altogether simplifying the process for every team that touches an ad campaign from start to finish. Headquartered in Needham, MA, Extreme Reach has offices in 19 cities worldwide.\nPress Contact\nTess VandenDolder\nClarity PR for Extreme Reach\n188710@email4pr.com\n646.934.6924\nView original content with multimedia: http://www.prnewswire.com/news-releases/extreme-reach-names-matt-timothy-chief-revenue-officer-300582482.html\nSOURCE Extreme Reach", "external_links": ["http://www.prnewswire.com/news-releases/extreme-reach-names-matt-timothy-chief-revenue-officer-300582482.html", "http://extremereach.com/"], "published": "2018-01-16T16:30:00.000+02:00", "crawled": "2018-01-16T19:33:31.041+02:00", "highlightTitle": ""}