{"organizations": [], "uuid": "5be585cb4c5e72ef4cf151641e6b8db3d12808aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/04/09/102573878-466241304.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/jessica-simpson-jewel-duet-was-the-moment-she-felt-her-career-explode.html", "country": "US", "domain_rank": 767, "title": "Jessica Simpson: Jewel duet was the moment she felt her career explode", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.011, "site_type": "news", "published": "2018-01-30T18:51:00.000+02:00", "replies_count": 0, "uuid": "5be585cb4c5e72ef4cf151641e6b8db3d12808aa"}, "author": "Sarah Berger", "url": "https://www.cnbc.com/2018/01/30/jessica-simpson-jewel-duet-was-the-moment-she-felt-her-career-explode.html", "ord_in_thread": 0, "title": "Jessica Simpson: Jewel duet was the moment she felt her career explode", "locations": [], "entities": {"persons": [{"name": "jessica simpson", "sentiment": "negative"}, {"name": "noam galai", "sentiment": "negative"}, {"name": "simpson", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}], "organizations": [{"name": "teen vogue", "sentiment": "none"}, {"name": "forbes", "sentiment": "none"}, {"name": "10th annual fashion university at conde nast", "sentiment": "none"}, {"name": "rolling stone", "sentiment": "none"}, {"name": "jessica simpson collection", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "mtv", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Today, Jessica Simpson is a business mogul. In 2016, she sold a majority stake in her booming lifestyle brand, the Jessica Simpson Collection, which Forbes reported was then bringing in $1 billion annually, helping the star amass a net worth of $170 million.\nBefore that, she was a pop star with a slew of other successes: Her 2006 album \"A Public Affair\" sold over 100,000 copies in its first week, according to Rolling Stone , and singles like \"These Boots are Made for Walkin'\" and \"Come Over\" were hits. She's appeared in TV shows like MTV's Newlyweds (2003) and movies including \"The Dukes of Hazzard\" (2005) and \"Employee of the Month\" (2006).\nSo it can be easy to forget Simpson was once a struggling artist. But the celebrity entrepreneur and mom hasn't forgotten. Simpson recently shared a moment she felt was pivotal in her career. \nOn Wednesday, Simpson posted on Instagram a 2004 throwback video from ABC's now defunct \"The Nick & Jessica Variety Hour,\" which Simpson hosted with her then-husband, Nick Lachey. In her post, Simpson calls the duet of \"Who Will Save Your Soul \" with the song's original singer, Jewel, \"The moment I felt my career explode.\" \nThe post, which Simpson tagged #WCW (\"woman crush Wednesday\") garnered over 970,000 views and thousands of comments.\nThe moment was major for Simpson — on the show, she introduced Jewel as one of her favorite artists and called the single, which once hit number one and spent months on the Billboard charts , one of her \"all-time favorite\" songs.\nJewel is not the only person who has influenced Simpson's career. She credits Dolly Parton with giving her courage in the face of failure. When Simpson publicly botched Parton's song \"9 to 5\" during a tribute to the country singer at the Kennedy Center in 2006, Parton turned it into a learning experience. \n\"She said, 'Honey, don't worry about it. I wrote the song and I still can't even get the lyrics right!'…\" Simpson told Forbes . \"[Parton] really just empowered me to get back on stage, and she gave me the confidence that I needed in that moment.\" \nIn fact, it's one of the most important things Simpson has learned: \"I feel like the most empowering lesson that I have learned is failure is okay sometimes. And in that we grow, and we learn from that, and there is success around the corner,\" she told Forbes. \nWhen Simpson's career later shifted from being an entertainer to a businesswoman, she sought out industry leaders for mentorship. She teamed up with co-founder of shoe and accessories company Nine West, Vince Camuto, to launch her brand in 2005. When he passed away in 2015, Simpson posted a heartfelt message to Instagram. \n\n\"Thank you, Vince, for the humble power that has taken me everywhere. You are my mentor, my family, the creator of all my dreams. I will forever walk in your shoes…you made them,\" Simpson captioned the photo. \nIt's been almost a decade since her last album was released and nearly 13 years since she launched her brand. So where will Simpson be in the next five to 10 years? \n\"I always say, I'm ready for another billion,\" she told CNBC in 2016.\nDon't miss: Bethenny Frankel reveals how much money she made her first season of 'Housewives' \nshow chapters Jessica Simpson’s second career      4:44 PM ET Fri, 11 March 2016 Like this story? Like us on Facebook", "external_links": [], "published": "2018-01-30T18:51:00.000+02:00", "crawled": "2018-01-30T18:51:06.002+02:00", "highlightTitle": ""}