{"organizations": [], "uuid": "edf9ffb8e580b64fefe2f6fac9347ad93df94f65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225195853&w=1200&r=LYNXMPEE0O19T", "site_section": "http://feeds.reuters.com/reuters/environment/", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-wildlife-rhinos/one-in-20-of-south-africas-rhinos-slaughtered-in-2017-idUSKBN1FE2CA", "country": "US", "domain_rank": 408, "title": "One in 20 of South Africa's rhinos slaughtered in 2017", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:56:00.000+02:00", "replies_count": 0, "uuid": "edf9ffb8e580b64fefe2f6fac9347ad93df94f65"}, "author": "", "url": "https://www.reuters.com/article/us-wildlife-rhinos/one-in-20-of-south-africas-rhinos-slaughtered-in-2017-idUSKBN1FE2CA", "ord_in_thread": 0, "title": "One in 20 of South Africa's rhinos slaughtered in 2017", "locations": [], "entities": {"persons": [{"name": "heiberg", "sentiment": "none"}], "locations": [{"name": "south africa", "sentiment": "none"}, {"name": "johannesburg", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "kruger national park", "sentiment": "none"}], "organizations": [{"name": "environmental ministry", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JOHANNESBURG (Reuters) - South Africa’s efforts to stem the poaching of endangered rhinos for their horns failed to prevent another 5 percent of the population being slaughtered last year.\nSouth Africa has more than 80 percent of the world’s estimated population of just 25,000 rhinoceroses. A total of 1,028 were poached in 2017, just 26 fewer than the previous year, the Environmental Ministry said in a statement.\nDespite efforts to prevent poaching through patrols, electronic surveillance and monitoring of ports and borders, as well as raising awareness, arrests of suspected rhino poachers and traffickers fell by almost a quarter to 518 last year.\nDemand for rhino horn has surged in newly-affluent Asian countries such as Vietnam, where it is prized as an ingredient in traditional medicines; in 2014, a record 1,215 rhinos were poached in South Africa.\nPoaching in the Kruger National Park, which has traditionally borne the brunt of the slaughter, did fall by 24 percent last year, but was largely offset by poaching in other regions.\nFILE PHOTO: Rhinos are seen in the Pongola Nature Reserve in Jozini, South Africa, October 27, 2017. REUTERS/Rogan Ward/File Photo “The increases in other provinces, coupled with the sharp rise in elephant poaching, tell us that as we progress and evolve, so do the tactics and methods of the poachers,” the ministry said.\nTom Milliken, Rhino Programme Leader at the wildlife trade monitoring network TRAFFIC, noted that almost three rhinos were still being killed in South Africa every day.\nLast August, South Africa allowed its first legal auction of rhino horns after the owner of the world’s biggest private rhino herd won a court case against the government.\nAlthough global trade in rhino horn is banned, conservationists have expressed concerns that domestic buyers could supply Asian markets illicitly.\nWhile the Kruger reserve has had some success against rhino poaching, the killing of elephants for ivory, virtually unheard of a few years ago, is on the rise there. The government said 68 were poached in 2017, up almost 50 percent, all but one of them in the Kruger.\nReporting by Tanisha Heiberg; Editing by Kevin Liffey\n ", "external_links": [], "published": "2018-01-25T17:56:00.000+02:00", "crawled": "2018-01-25T18:08:56.019+02:00", "highlightTitle": ""}