{"organizations": [], "uuid": "9cb89202ca4a150db5749500eb0714f91f84a7f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-apache-updates-fourth-quarter-2017-guidance-plans-to-release-fourth-quarter-and-full-year-2017-results-feb-22.html", "country": "US", "domain_rank": 767, "title": "Apache Updates Fourth-Quarter 2017 Guidance; Plans to Release Fourth-Quarter and Full-Year 2017 Results Feb. 22", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T14:55:00.000+02:00", "replies_count": 0, "uuid": "9cb89202ca4a150db5749500eb0714f91f84a7f1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-apache-updates-fourth-quarter-2017-guidance-plans-to-release-fourth-quarter-and-full-year-2017-results-feb-22.html", "ord_in_thread": 0, "title": "Apache Updates Fourth-Quarter 2017 Guidance; Plans to Release Fourth-Quarter and Full-Year 2017 Results Feb. 22", "locations": [], "entities": {"persons": [{"name": "apa", "sentiment": "none"}, {"name": "john j. christmann", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}, {"name": "beryl", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "north sea", "sentiment": "none"}, {"name": "permian basin", "sentiment": "none"}], "organizations": [{"name": "apache corporation", "sentiment": "negative"}, {"name": "forties pipeline system", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 09, 2018 (GLOBE NEWSWIRE) -- Apache Corporation (NYSE:APA) (Nasdaq:APA) today provided an update to its fourth-quarter 2017 production outlook and certain other items.\nInternationally, the company revised its production outlook to reflect the impact of unscheduled downtime at the third-party operated Forties Pipeline System and the underperformance of recent wells in the Beryl area of the North Sea. Adjusted sales volumes were also lower in Egypt, primarily due to the impact of improving Brent oil prices on the cost recovery mechanisms in Apache’s production sharing contracts. As a result of these factors, the company expects fourth-quarter adjusted international production in the range of 138,000 to 140,000 barrels of oil equivalent (BOE) per day and base-level production volumes to be lower than planned going into 2018.\nIn the United States, fourth-quarter production is expected to be at the high end of the company’s guidance range of 218,000 to 224,000 per day BOE, driven primarily by strong quarter-over-quarter growth in the Permian Basin.\nJohn J. Christmann IV, Apache's chief executive officer and president, said, “Robust Brent crude prices enabled our international operations to generate strong free cash flow during the fourth quarter despite the reduction in production volumes. In the Permian, we delivered our second quarter in a row of strong oil production growth; and, at Alpine High, we achieved our production target of more than 25,000 BOE per day by the end of December.”\nTo further assist analysts with their fourth-quarter production and earnings models, the company is also providing the following estimates:\nRealized loss on oil and gas price derivatives (before tax): $49 million\nDry hole costs (before tax): $45 - $50 million\nEgypt tax barrels: 32,000 to 36,000 BOE per day\nFourth-quarter 2017 earnings call\nApache Corporation will release fourth-quarter and year-end results on its website at www.apachecorp.com and investor.apachecorp.com as well as on Twitter (@ApacheCorp) at 7 a.m. Central time Thursday, Feb. 22, 2018, followed by a conference call to discuss its results at 1 p.m. Central time.\nThe conference call will be webcast from Apache's website at www.apachecorp.com and investor.apachecorp.com , and the webcast replay will be archived there as well. The conference call will also be available for playback by telephone for one week beginning at approximately 4 p.m. Central time Feb. 23. To access the telephone playback, dial (855) 859-2056 or (404) 537-3406 for international calls. The conference access code is 5884904.\nForward-looking statements\nThis news release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. See “Risk Factors” in our 2016 Annual Report on Form 10-K, Quarterly Reports on Form 10-Q and other public filings and press releases. A number of factors could cause actual results to differ materially from the expectations presented. None of the information contained in this news release has been audited by any independent auditor. Apache may elect to modify the format or discontinue publication at any time, without notice to securities analysts or investors. Unless legally required, Apache assumes no duty to update any forward-looking statement as of any future date.\nAbout Apache\nApache Corporation is an oil and gas exploration and production company with operations in the United States, Egypt and the United Kingdom. Apache posts announcements, operational updates, investor information and press releases on its website, www.apachecorp.com , and on its Media and Investor Center mobile application, which is available for free download from the Apple App Store and the Google's Play store.\nContacts\nInvestor: (281) 302-2286 Gary Clark\nMedia: (713) 296-7189 Castlen Kennedy\nWebsite: www.apachecorp.com\nAPA-F\nSource:Apache Corporation", "external_links": ["https://www.globenewswire.com/Tracker?data=LYcJfpp_qXj3CX3V_H5V94fdOvNY7wN-mAE6KqHzwPZLJvdSyzaTlUtTYxBVBpS6WKV_KFb8ZjSopFCPNXY228k0f7wj45yg7cHiGnGUBOU=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/64255b5c-b0c1-452b-97cf-70d9d272066c"], "published": "2018-01-09T14:55:00.000+02:00", "crawled": "2018-01-09T15:42:34.003+02:00", "highlightTitle": ""}