{"organizations": [], "uuid": "26adbba90cc95ccf8aef67ab05fa21e305f972fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-sientra-announces-preliminary-unaudited-fourth-quarter-2017-revenue.html", "country": "US", "domain_rank": 767, "title": "Sientra Announces Preliminary Unaudited Fourth Quarter 2017 Revenue", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "26adbba90cc95ccf8aef67ab05fa21e305f972fa"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-sientra-announces-preliminary-unaudited-fourth-quarter-2017-revenue.html", "ord_in_thread": 0, "title": "Sientra Announces Preliminary Unaudited Fourth Quarter 2017 Revenue", "locations": [], "entities": {"persons": [{"name": "keith sullivan", "sentiment": "negative"}, {"name": "jeffrey m. nugent", "sentiment": "none"}], "locations": [{"name": "sientra", "sentiment": "none"}, {"name": "santa barbara", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "united states securities and exchange commission", "sentiment": "none"}, {"name": "sientra", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "miramar labs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Board Member Keith Sullivan Appointed Interim General Manager of miraDry\nMiramar Labs Officially Named miraDry, a Sientra Subsidiary\nUniversal Shelf Registration Filed on Form S-3\nSANTA BARBARA, Calif., Jan. 08, 2018 (GLOBE NEWSWIRE) -- Sientra, Inc. (NASDAQ:SIEN) (“Sientra” or the “Company”), a medical aesthetics company, today announced preliminary unaudited revenue for the fourth quarter 2017. In addition, the Company appointed Keith Sullivan as interim General Manager of miraDry, a Sientra subsidiary, (formerly Miramar Labs), effective January 1, 2018, and filed a universal shelf registration on Form S-3 with the United States Securities and Exchange Commission (“SEC”).\nJeffrey M. Nugent, Chairman and Chief Executive Officer of Sientra, said, “I am extremely proud of everything our team accomplished in 2017. We will look back on 2017 as one where we continued to show our resilience and put the building blocks in place to come back to the market as a stronger and better Sientra. Our Breast Products segment is in the final stages of ramping up for our relaunch back into the market with our newly U.S. sourced implants while our tissue expanders and bioCorneum scar management products continue to take market share.”\nMr. Nugent added, “We made further progress in 2017 in becoming a truly globally diversified aesthetic company with our acquisition of miraDry and continued to make progress in the fourth quarter to further optimize and integrate the miraDry business. As Keith takes on the role as interim General Manager of miraDry, we look forward to the opportunity to draw on his extensive commercial and leadership experience in the medical aesthetics industry as we search for a permanent General Manager. We saw lower than expected growth in the second half of 2017 due to our focused priorities during this period to optimize the organization and technology and to reposition the business for long term growth. We maintain our strong conviction that the miraDry business will be a significant revenue growth driver for us as we move into 2018 and beyond.”\nKeith Sullivan, interim General Manager of miraDry, commented, “I am extremely excited to take the lead of the Company’s miraDry subsidiary as our growing team continues to drive closer to fully optimizing this novel aesthetics technology and enhancing our global sales infrastructure. I have executed this playbook before and remain confident in what can be accomplished by putting the necessary people and treatment pieces in place to drive significant commercial adoption of a unique technology platform like miraDry. We have already met our preliminary hiring target for miraDry sales representatives, hired two experienced leaders to head our U.S. and international sales efforts, and we are now finalizing preparations to launch and train with an optimized miraDry treatment protocol at our upcoming national sales meeting this month for a first quarter market launch. In 2018, we look forward to expanding the miraDry marketing team and leveraging each of these initiatives to broaden adoption globally and grow miraDry sales significantly.”\nMr. Sullivan, a member of the Sientra Board of Directors and the miraDry Operating Committee, was most recently Chief Commercial Officer and President, North America of ZELTIQ Aesthetics, Inc., a medical technology company focused on developing and commercializing products utilizing its proprietary controlled-cooling technology platform under the Coolsculpting® brand. Mr. Sullivan led the restructuring of the global commercial organization resulting in a nearly 50% 4-year CAGR to $376 million in revenue leading to an acquisition by Allergan. Mr. Sullivan, has more than 30 years of senior sales leadership experience in the medical device industry.\nMr. Nugent concluded, “Today, we also filed a shelf registration to position us to raise capital, if needed, to continue to grow our miraDry business while expanding our breast implant franchise following the expected FDA approval of our U.S. manufacturing facility.”\nFourth Quarter 2017 Preliminary Revenue\nThe quarterly financial estimates included in this release are prior to the completion of review and audit procedures by Sientra’s external auditors and are therefore subject to adjustment.\nThe Company is reporting results in two segments, Breast Products and miraDry. The Breast Products segment will include the Company’s breast implant portfolio, tissue expander portfolio, and scar management products. The miraDry segment will include the miraDry business, the acquisition of which was completed on July 25, 2017. The Company is now consolidating financials from the miraDry segment.\nSientra anticipates total revenue for the fourth quarter 2017 to be approximately $11.4 million, compared to total revenue for the fourth quarter 2016 of $6.5 million. Fourth quarter 2017 revenue expectations include anticipated segmented Breast Product revenue of $8.2 million and miraDry revenue of $3.2 million.\nThe Company filed a universal shelf registration statement on Form S-3 with the SEC for up to an aggregate amount of $150 million. The shelf registration statement will allow the Company to provide more timely and efficient access to the capital markets should the Company decide to issue securities in the future, subject to market conditions.\nAbout Sientra\nHeadquartered in Santa Barbara, California, Sientra is a medical aesthetics company committed to making a difference in patients’ lives by enhancing their body image, growing their self-esteem and restoring their confidence. The Company was founded to provide greater choice to board-certified plastic surgeons and patients in need of medical aesthetics products. The Company has developed a broad portfolio of products with technologically differentiated characteristics, supported by independent laboratory testing and strong clinical trial outcomes. The Company sells its breast implants and breast tissue expanders exclusively to board-certified and board-admissible plastic surgeons and tailors its customer service offerings to their specific needs. The Company also offers a range of other aesthetic and specialty products including BIOCORNEUM®, the professional choice in scar management, and miraDry, the only FDA cleared device to reduce underarm sweat, odor and permanently reduce hair of all colors.\nForward Looking Statements\nThis press release contains “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, based on management’s current assumptions and expectations of future events and trends, which affect or may affect the Company’s business, strategy, operations or financial performance, and actual results may differ materially from those expressed or implied in such statements due to numerous risks and uncertainties. Forward-looking statements include, but are not limited to, statements regarding the timing of FDA approval of the Company’s new manufacturing facility, the expected benefits of the Miramar acquisition, the Company’s ability to become a world class, di", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/3d42c3fa-0850-4a26-bd85-40bafedbaecd", "https://www.globenewswire.com/Tracker?data=410y7pTB87oM1fX0OnKaxFrt0q0QP3GsSlD0X-6hAN_ssS3_RNNYL5tVnjXqWvQXL4lJcvoNR1x0_biu3tMOCQ==", "https://www.globenewswire.com/Tracker?data=r1iddgIiz1gL0hkIN9X3u6BbTuYjZ537mIAtbVW5oo0ADaEuzsOTY8WTYyZjMtd9hG1mgxhXtH9FK8hJ0lrwkdwIEpe_1ADh13uZ97gTjx9js-Ji-Tch5Jpb8dXKjqIW"], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:11:05.002+02:00", "highlightTitle": ""}