{"organizations": [], "uuid": "9d50c0d9946ac1d44442c3ad5a6678d66dd619a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218728981&w=1200&r=LYNXMPEE0104B", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-global-economy/asian-factories-end-2017-on-mixed-note-central-banks-seen-hiking-slowly-idUKKBN1ER07I", "country": "US", "domain_rank": 408, "title": "Asian factories end 2017 on mixed note; central banks seen hiking slowly", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T06:45:00.000+02:00", "replies_count": 0, "uuid": "9d50c0d9946ac1d44442c3ad5a6678d66dd619a7"}, "author": "", "url": "https://uk.reuters.com/article/us-global-economy/asian-factories-end-2017-on-mixed-note-central-banks-seen-hiking-slowly-idUKKBN1ER07I", "ord_in_thread": 0, "title": "Asian factories end 2017 on mixed note; central banks seen hiking slowly", "locations": [], "entities": {"persons": [{"name": "marius zaharia", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "kawasaki", "sentiment": "none"}], "organizations": [{"name": "keihin", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 4:49 AM / Updated 3 minutes ago Asian factories end robust 2017 on mixed note; central banks seen hiking slowly Marius Zaharia 5 Min Read \nHONG KONG (Reuters) - Asia’s factories ended a strong 2017 on a mixed note, with activity at multi-year highs in Taiwan and India and surprisingly picking up in China, but contracting in some places in a sign regional interest rate hikes likely will be gradual. FILE PHOTO: Workers walk at a factory at the Keihin industrial zone in Kawasaki, Japan February 28, 2017. REUTERS/Issei Kato/File Photo \nA trend of synchronised global growth that became apparent over the course of last year looked set to continue, with activity surveys in the euro zone and the United States later in the day expected to post strong readings. \n“Robust external demand and accommodative domestic monetary policy should help keep Asian manufacturing sectors in good shape,” said Krystal Tan, Asia economist at Capital Economics. \nIn China, manufacturing growth unexpectedly picked up to a four-month high in December amid a surge in new orders, suggesting continued strength in global trade. \nThe Caixin/Markit Manufacturing Purchasing Managers’ Index (PMI) rose to 51.5 last month, from 50.8 in November, and far outpaced economists’ expectations for a dip to 50.6. The 50-mark divides expansion from contraction on a monthly basis. \nTuesday’s survey, which pushed Asian shares .MIAPJ0000PUS to their highest in a decade, was somewhat at odds with a much larger official China PMI survey on Sunday. It showed a slowdown in growth amid a crackdown on pollution and measures to curb risky financing and cool the housing market. \nAnalysts say the difference stems from the fact that the Caixin/PMI index tracks smaller, private firms, more sensitive to exports. A CHINA SLOWDOWN? \nChina is expected to have grown by close to 7 percent in 2017, but the world’s second largest economy is likely to slow in the new year on the back of those measures, highlighted as policy priorities at October’s key Communist Party congress. \nBeijing is expected to target 2018 growth at around 6.5 percent. \n“We believe a moderate growth slowdown to be more visible in the first half of 2018, especially on the investment front, due mainly to the tight financial conditions and a cooldown of the property market,” BofA Merrill Lynch economists said. \nChina’s slowdown means that for the rest of Asia, the pace of rate increases is unlikely to match that of the U.S. Federal Reserve, which is seen hiking 2-3 times in 2018. \nThere will likely be “only a few rate hikes here and there across the region over the coming two years,” HSBC analysts said in a note, even as they expect Asian economies to keep chugging along in 2018, led by tech and trade. \nIn November, the Bank of Korea raised interest rates for the first time in more than six years, becoming the first major Asian central bank to hike since 2014. Malaysia and the Philippines could hike early this year, then Australia and New Zealand later on. RIDING A TECH BOOM \nOn Sunday, South Korea’s central bank chief said monetary policy should remain accommodative as inflationary pressures remained weak. Factory activity, which has been riding a global tech boom, contracted in December, dropping from a 4-1/2 year high in November, the Nikkei/Markit survey showed. \nAnother major tech producer, Taiwan, saw manufacturing activity hitting its highest since April 2011 at 56.6 last month, according to a December survey. \nSingapore on Tuesday posted slower economic growth in the fourth quarter than the third as manufacturing shrank 11.5 percent following an eye-popping 38 percent jump in the previous three months. \nHowever, full-year growth was still the fastest in three years at 3.5 percent, raising the possibility that the Monetary Authority of Singapore (MAS) could tighten its exchange rate-based monetary policy this year. \n“Given robust GDP growth and inflation upside risk, we think MAS will shift and tighten to a ‘mild appreciation bias’ at the April meeting,” Maybank Kim Eng economist Chua Hak Bin said. \nPMIs for Japan, which surpassed growth expectations in 2017 on the back of the surging tech and trade cycle globally, will be released on Thursday. \nThe Nikkei/Markit survey for India’s December factory activity showed it expanded at the fastest pace in five years, buoyed by a rise in output and new orders, which allowed firms to raise prices. The data firms up views that interest rates in Asia’s third-largest economy have probably bottomed. \nDecember factory activity accelerated in Vietnam, but shrank marginally in Malaysia and Indonesia. Reporting by Marius Zaharia; Editing by Richard Borsuk", "external_links": [], "published": "2018-01-02T06:45:00.000+02:00", "crawled": "2018-01-02T07:18:17.034+02:00", "highlightTitle": ""}