{"organizations": [], "uuid": "de6725395e8b99e530f822559609b1c62d6a7694", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/06/12/102755252-wingstop.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/wingstop-shares-rally-6-percent-on-strong-earnings-forecast.html", "country": "US", "domain_rank": 767, "title": "Wingstop shares rally 6% on strong earnings forecast", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-08T19:21:00.000+02:00", "replies_count": 0, "uuid": "de6725395e8b99e530f822559609b1c62d6a7694"}, "author": "Sarah Whitten", "url": "https://www.cnbc.com/2018/01/08/wingstop-shares-rally-6-percent-on-strong-earnings-forecast.html", "ord_in_thread": 0, "title": "Wingstop shares rally 6% on strong earnings forecast", "locations": [], "entities": {"persons": [{"name": "wingstop", "sentiment": "none"}], "locations": [], "organizations": [{"name": "wingstop", "sentiment": "negative"}, {"name": "wingstop  shares of wingstop", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Shares of Wingstop rallied more than 6 percent on Monday after the company said sales were strong in fiscal 2017.\nChicken-wing chains have struggled in the last year, as the cost of wings has grown and diners have had more food choices inside and outside of the restaurant industry. However, Wingstop seems to be the outlier.\nThe company was one of the top restaurant stocks in 2017, with shares jumping more than 31 percent during the year.\nWingstop said Monday it expects to report systemwide sales of $1.1 billion for the fiscal year, up 14 percent from last year.\nIn the fourth quarter, the company said systemwide sales are expected to be up 15.6 percent to $285 million. Same-store sales growth of 5.2 percent is expected across its more than 1,000 locations in the U.S., with its 23 company-owned stores growing 4.6 percent in the quarter.\nFor the full year, same-store sales are expected to be up 2.6 percent domestically, marking the 14th consecutive year with positive same-store sales growth.\n\"Overcoming the challenges that we faced in 2017, including record wing inflation over 40 percent and post-election consumer sentiment is a testament of the strength of our brand and business model,\" CEO Charlie Morrison said in a statement.\nIn addition, the company said that it had 45 net openings in the fourth quarter, raising its number of worldwide locations to 1,133, a 13.5 percent increase.\n\"Our achievements in 2017 reflect our focus on four key long-term growth strategies: national advertising, digital expansion, delivery and international development which we believe will position us to achieve our vision of becoming a top 10 global restaurant brand,\" Morrison said.\nWingstop will be speaking to investors Tuesday at the ICR Conference in Orlando.", "external_links": [], "published": "2018-01-08T19:21:00.000+02:00", "crawled": "2018-01-08T19:26:29.030+02:00", "highlightTitle": ""}