{"organizations": [], "uuid": "b8de44becd0ea42ee4dd3ccc79ff139e18c04380", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WW007_3jrNG_TOP_20180104200833.jpg", "site_section": "https://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/trucking-firms-boost-orders-for-new-vehicles-1515157200", "country": "US", "domain_rank": 387, "title": "Trucking Firms Boost Orders for New Vehicles", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T16:00:00.000+02:00", "replies_count": 0, "uuid": "b8de44becd0ea42ee4dd3ccc79ff139e18c04380"}, "author": "Erica E. Phillips", "url": "https://www.wsj.com/articles/trucking-firms-boost-orders-for-new-vehicles-1515157200", "ord_in_thread": 0, "title": "Trucking Firms Boost Orders for New Vehicles", "locations": [], "entities": {"persons": [{"name": "kenny vieth", "sentiment": "none"}], "locations": [], "organizations": [{"name": "act research", "sentiment": "none"}, {"name": "trucking industry worries new rule", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "2 COMMENTS Freight-hauling firms are loading up on new trucks to meet strong demand from shippers and to attract drivers.\nTrucking fleets ordered 37,500 Class 8 trucks, the kind used on long-haul routes, in December, according to ACT Research, which compiles industry statistics. That was up 76% from a year earlier, the strongest monthly demand for new trucks in three years.\nIn the last weeks of 2017 freight rates reached some of their highest levels in more than three years, as retailers scrambled to restock during the busy holiday season .\nMore Logistics\nTight Trucking Market Has Retailers, Manufacturers Paying Steep Prices January 5, 2018 Retailers Offer Myriad Returns Options to Retain Customers December 26, 2017 Slow Start for Truckers Under New Rule on Logging Hours December 21, 2017 Trucking Industry Worries New Rule Could Raise Costs December 15, 2017 “It’s been building,” said ACT analyst Kenny Vieth. “You typically expect a good year-end, but we did see a change in the pace of orders starting in October.” Soaring order activity in the last three months of 2017 led to annual growth of 59% over the prior year, Mr. Vieth said.\nAnd 2018 is expected to continue that trend. In a note to investors Thursday, analysts with Stifel said they expect even more orders this year, adding that “2018 will not represent the ’peak’ this cycle, which has become a concern among investors, as we believe 2019 will be stronger yet.”\nDecember’s new orders, which will be delivered over the next several months, are mostly replacing older vehicles in trucker fleets—providing firms with savings in fuel economy and insurance costs, while also serving as a way to recruit and retain drivers. “Drivers would rather drive new trucks than old trucks,” Mr. Vieth said.\nThat is crucial in today’s trucking market, where many fleets struggle to find drivers. An annual survey, released in October by the American Transportation Research Institute, found that “ driver shortage ” ranked as the trucking industry’s top concern for the first time since 2006.\nWrite to Erica E. Phillips at erica.phillips@wsj.com", "external_links": [], "published": "2018-01-05T16:00:00.000+02:00", "crawled": "2018-01-05T20:56:50.058+02:00", "highlightTitle": ""}