{"organizations": [], "uuid": "246db36175570674018f004270c8b333754c6116", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/18/104904728-GettyImages-894538032-bitcoin.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/21324812/device/rss/rss.html", "section_title": "Personal Finance", "url": "https://www.cnbc.com/2018/01/17/irs-steps-up-tax-enforcement-for-cryptocurrencies.html", "country": "US", "domain_rank": 767, "title": "IRS steps up tax enforcement for cryptocurrencies", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.979, "site_type": "news", "published": "2018-01-17T19:43:00.000+02:00", "replies_count": 0, "uuid": "246db36175570674018f004270c8b333754c6116"}, "author": "Annie Nova", "url": "https://www.cnbc.com/2018/01/17/irs-steps-up-tax-enforcement-for-cryptocurrencies.html", "ord_in_thread": 0, "title": "IRS steps up tax enforcement for cryptocurrencies", "locations": [], "entities": {"persons": [{"name": "reno", "sentiment": "negative"}, {"name": "cross", "sentiment": "none"}, {"name": "jeff bandman", "sentiment": "none"}], "locations": [{"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "tyson cross", "sentiment": "negative"}, {"name": "irs", "sentiment": "negative"}, {"name": "fintech", "sentiment": "none"}, {"name": "commodity futures trading commission", "sentiment": "none"}, {"name": "internal revenue service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Anthony Wallace | AFP | Getty Images A woman touches an ATM machine for digital currency Bitcoin in Hong Kong on December 18, 2017. \nBack in 2013, Tyson Cross, a tax attorney in Reno, Nevada, helped a few dozen of his clients report cryptocurrencies on their tax returns. \nToday, that business has mushroomed. \n\"I did close to 1,000 consultations last year where I talked to people who have income from cryptocurrencies and tax questions,\" Cross said. \"They realize the wild west days are coming to an end.\" \n\"The IRS knows many people have made tremendous wealth with cryptocurrencies,\" Cross said. \nIn 2014, the Internal Revenue Service issued guidance on how taxation should be applied to virtual currencies. For one, the government decided it was not actually a currency . \n\"They said, 'Yes people call them currencies, but we're not legally treating it as a currency because it's not issued by a sovereign',\" said Jeff Bandman, former FinTech advisor for the Commodity Futures Trading Commission. \"The IRS was relatively forward-thinking for a government body.\" \nToday there's a virtual currency team within the IRS. The agency also hired a cryptocurrency software company called Chainalysis to \"trace the movement of money through the bitcoin economy,\" according to a contract obtained by the Daily Beast. \nIn 2016, the agency summoned Coinbase, one of the most popular cryptocurrency exchanges, for data on U.S. taxpayers. As a result, Coinbase had to disclose information on more than 14,000 users. \"The IRS was relatively forward-thinking for a government body.\" -Jeff Bandman, former FinTech advisor for the Commodity Futures Trading Commission \nAs more people come to realize that virtual currency is on the minds of government officials, they're trying to figure out how to report cryptocurrency transactions on their tax returns. \nSince 2014, the IRS has not issued any more guidance. The American Institute of CPA's has written to the IRS, asking the agency to \"release additional, much needed, guidance on virtual currency.\" And the Treasury Department's Inspector General issued a report on virtual currencies, recommending that the IRS more clearly define its policy. \n\"The main question we're seeing is: How is bitcoin taxed?\" said Lisa Lewis, a CPA at TurboTax. For example, Lewis said: \"People don't understand that if you're holding bitcoin, you're not taxed.\" \nHere are some measures you can take to stay ahead of any tax problems. 1) Keep thorough records \nThe IRS has ruled that virtual currencies are property . That means that profits and losses are to be taxed at an individual's capital gains rate, which should be applied at every \"taxable event\" — when a person buys, sells or uses their cryptocurrency to make a purchase. \nUnlike other investment accounts, you may not get a Form 1099 summarizing those gains. \n\"That places a big burden on taxpayers,\" he said. \"Cryptocurrency investors can have tens of thousands of exchanges.\" \nBecause it can be close to impossible to count all of those events, Cross recommends people regularly download a transaction report from their cryptocurrency exchange. Most exchanges provide this option. If it does not, however, you'll have to personally record every transaction you make with cryptocurrency. show chapters 2 Hours Ago | 01:29 \nIn any case, that's probably a good idea. Cross said he's had clients who were unable to download their transaction reports because an exchange shut down. \n\"When you have lost records, it's your job as a taxpayer to reconstruct those records as best as possible,\" Cross said. 2) Calculate your gains and losses \nOnce you have all of your transactions recorded in one place, there's another challenge: how to calculate your gains or losses from each one. If you've held the cryptocurrencies less than a year, it's a short-term gain. More than a year, it's considered a long-term gain. \n\"It's no different than any other asset,\" said Jerry Brito, executive director of Coin Center, a cryptocurrency think tank. \"If you bought a currency and hold it more than a year, your tax rate is probably going to be less than you'd otherwise pay.\" \nCross recommends that investors use one of the software services that help people calculate their losses and gains. \nThose include Bitcoin.tax and Cointracking.info . \"We have no answers from the IRS on the finer details. \" -Tyson Cross , bitcoin tax lawyer \n\"It will calculate all of your capital gains, and then you can export that as a report and use it to file your taxes,\" Cross said. \nPeople can chose between the \"first-in, first-out\" method, by which gains are calculated from the first purchases or \"last-in, first-out,\" which calculates gains from the most recent purchases. \nAlthough the IRS has not offered any information on which method to use for cryptocurrencies, Cross recommends people select the former. \n\"When there's not a prescribed method, you have to use the method that is most reasonable,\" he said. \"First-in, first-out is certainly going to be considered reasonable; it's the most common method.\" \nThis transaction report then goes on Form 8949 of your tax return, which then becomes part of Schedule D . 3) Find an accountant who has cryptocurrency experience \n\"One issue people are having is that their CPA just doesn't know what to do,\" Cross said. \"They should find a tax preparer who is familiar with cryptocurrencies.\" \nBitcoin.tax maintains a directory of such accountants . 4) Check for more information \nThere are still a lot of big unanswered questions about taxes and crypotcurrency, Cross said. Pay attention to new developments. \n\"We have no answers from the IRS on the finer details,\" he said. \"People go to prison for not reporting their foreign bank accounts. We don't know if a cryptocurrency exchange is a foreign financial institution. The fact that the IRS hasn't said if people should be reporting these accounts is unfortunate, to say the least.\" \nMore from Personal Finance:", "external_links": ["https://www.irs.gov/pub/irs-drop/n-14-21.pdf", "https://www.documentcloud.org/documents/3935924-IRS-Chainalysis-Contract.html", "https://blog.coinbase.com/coinbase-obtains-partial-victory-over-irs-dac041db59a3", "https://www.irs.gov/pub/irs-pdf/f8949.pdf", "https://www.irs.gov/pub/irs-pdf/f1040sd.pdf", "https://www.treasury.gov/tigta/auditreports/2016reports/201630083fr.pdf", "https://bitcoin.tax/faq", "http://docplayer.net/43122378-June-10-internal-revenue-service-attn-cc-pa-lpd-pr-notice-room-5203-p-o-box-7604-ben-franklin-station-washington-dc-20044.html", "https://bitcoin.tax/", "https://cointracking.info/", "https://www.justice.gov/opa/pr/court-authorizes-service-john-doe-summons-seeking-identities-us-taxpayers-who-have-used", "https://www.chainalysis.com/"], "published": "2018-01-17T19:43:00.000+02:00", "crawled": "2018-01-17T18:45:23.005+02:00", "highlightTitle": ""}