{"organizations": [], "uuid": "7e8a50600653008669f24ac70692192cc26a1624", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/05/09/101658555-20140509-7381-624.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/25/harvard-professor-rogoff-predicts-inflation-will-finally-see-lift-off-this-year.html", "country": "US", "domain_rank": 767, "title": "Harvard professor Rogoff predicts inflation will finally see lift-off this year", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T18:53:00.000+02:00", "replies_count": 0, "uuid": "7e8a50600653008669f24ac70692192cc26a1624"}, "author": "Holly Ellyatt", "url": "https://www.cnbc.com/2018/01/25/harvard-professor-rogoff-predicts-inflation-will-finally-see-lift-off-this-year.html", "ord_in_thread": 0, "title": "Harvard professor Rogoff predicts inflation will finally see lift-off this year", "locations": [], "entities": {"persons": [{"name": "rogoff", "sentiment": "negative"}, {"name": "ken rogoff", "sentiment": "negative"}, {"name": "larry summers", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "harvard university", "sentiment": "negative"}, {"name": "harvard", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "u.s. federal reserve", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Sanctuary Harvard professor Rogoff predicts inflation will finally see lift-off this year \"I think this is the year when inflation in the U.S. goes over 2 percent,\" Rogoff told CNBC at the World Economic Forum in Davos, Switzerland. \"It's not that far off it now,\" Rogoff added. A 2 percent inflation rate is targeted by the U.S. Federal Reserve, although the bank has increased interest rates three times in 2017 as it seeks to normalize monetary policy after almost a decade of stimulus. 5 Hours Ago | 02:30 \nHarvard University professor and closely-watched economist Ken Rogoff told CNBC that 2018 could bring \"inflation in a way we haven't seen\" and could rise above 2 percent in the U.S. \n\"I think this is the year when inflation in the U.S. goes over 2 percent,\" Rogoff told CNBC at the World Economic Forum in Davos, Switzerland. \nInflation data released in mid-January showed that core CPI (consumer price index) in the U.S. increased 1.8 percent in the 12 months through December, picking up from 1.7 percent in November. It was the biggest gain seen in 11 months for the index. \n\"It's not that far off it now,\" Rogoff added. A 2 percent inflation rate is targeted by the U.S. Federal Reserve, although the bank has increased interest rates three times in 2017 as it seeks to normalize monetary policy after almost a decade of stimulus. \n\"Ten years past the financial crisis and we could see a period where, instead of talking about 'secular stagnation' as our mutual friend Larry Summers likes to do, we're going to be seeing growth upgrades that we haven't seen, we're going to see investment like we haven't seen and we might see inflation in a way we haven't seen,\" Rogoff said. \n\"And central bankers are going to have to ask themselves 'how long can we hold back?',\" he noted, adding that he would \"much rather see inflation overshoot\" than policymakers crush the recovery prematurely. Patrick Bucci | CNBC Ken Rogoff, Professor of Public Policy and Professor of Economics at Harvard University. \nRogoff said it was a \"mystery\" why inflation had remained low despite massive central bank stimulus. \"We don't completely know (why), ... But one of the ingredients is that maybe somehow technology and globalization is putting downward pressure on wages and prices and that's holding back inflation from competitive pressures but we're seeing global growth,\" he said. Economic growth usually leads to increasing prices. Where's the inflation? \nWhen central banks around the world introduced stimulus packages, known as quantitative easing (QE) in a bid to stimulate spending, investment and growth, a key focus was the rate of inflation. But inflation has remained in check, long enough to prompt central banks to keep interest rates lower for longer. The Federal Reserve and Bank of England have started slowly raising interest rates, the European Central Bank has yet to do so. \nDavid Lipton, the first deputy managing director at the International Monetary Fund (IMF), told CNBC that inflation was still lagging. \n\"Where's the inflation? We've had a long recovery and I think we're in the late stages of this cyclical recovery. There's still a lot of accommodation coming from monetary policy and in the U.S. now there's some fiscal support. I think the transmission of the monetary policy may be improving ... But the question is over the missing inflation,\" he said. \n\"It's hard to imagine a sudden spurt in inflation when wage developments are as moderated as they are,\" he said. Raising rates \nThe panel in Davos was held at the same time as the European Central Bank (ECB) announced its latest monetary policy decision, although the ECB left its benchmark interest rate unchanged, quashing heightened expectations of an immediate change to monetary policy in 2018. \nRogoff believed the European Central Bank (ECB) could start raising rates by the end of 2018. The ECB said headline inflation would be at 1.5 percent in 2017 and 1.2 percent in 2018, below its target of around 2 percent. \nRogoff said \"they (the ECB) shouldn't be raising rates, they don't have inflation so it's not justified,\" but he added that if growth continued to be good in the euro zone, it might be justified later this year.", "external_links": [], "published": "2018-01-25T18:53:00.000+02:00", "crawled": "2018-01-25T18:01:30.001+02:00", "highlightTitle": ""}