{"organizations": [], "uuid": "798e8a25d9e7ad53cabe4fe2a7e90215e852cae2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-ping-ans-global-voyager-fund-appoints-chief-operating-officer-and-chief-medical-officer-to-boost-leadership-team.html", "country": "US", "domain_rank": 767, "title": "Ping An's Global Voyager Fund Appoints Chief Operating Officer and Chief Medical Officer to Boost Leadership Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T12:34:00.000+02:00", "replies_count": 0, "uuid": "798e8a25d9e7ad53cabe4fe2a7e90215e852cae2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-ping-ans-global-voyager-fund-appoints-chief-operating-officer-and-chief-medical-officer-to-boost-leadership-team.html", "ord_in_thread": 0, "title": "Ping An's Global Voyager Fund Appoints Chief Operating Officer and Chief Medical Officer to Boost Leadership Team", "locations": [], "entities": {"persons": [{"name": "ping an", "sentiment": "negative"}, {"name": "donald e. lacey jr.", "sentiment": "none"}, {"name": "marco d. huesch", "sentiment": "none"}, {"name": "jonathan larsen", "sentiment": "none"}, {"name": "huesch", "sentiment": "none"}, {"name": "lacey", "sentiment": "none"}], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "asia pacific", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}], "organizations": [{"name": "ping an's group innovation office", "sentiment": "none"}, {"name": "group", "sentiment": "none"}, {"name": "citigroup", "sentiment": "none"}, {"name": "fintech", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG and SHANGHAI, Jan. 26, 2018 /PRNewswire/ -- The Ping An Global Voyager Fund has appointed Mr. Donald E. Lacey Jr. and Dr. Marco D. Huesch as Managing Director and Chief Operating Officer and Managing Director and Chief Medical Officer of the Ping An Global Voyager Fund and Ping An's Group Innovation Office respectively.\nMr. Lacey and Dr. Huesch will join the team led by Mr. Jonathan Larsen, the Chief Innovation Officer of the Group and Chairman and CEO of the Fund, to identify global FinTech and healthtech opportunities to accelerate Ping An's international growth.\nMr. Lacey strengthens the Fund's leadership team and joins from Citigroup's corporate and investment banking division, where he worked as a managing director in a variety of senior roles across Asia Pacific. As head of the firm's Asia insurance investment banking business, Mr. Lacey played a leading part in a number of landmark M&A transactions involving insurers, technology firms, and alternative distribution channels for financial services. Prior to moving to Asia in 2007, Mr. Lacey held various investment and management positions at Citigroup Global Markets and Goldman Sachs Asset Management in New York. He holds an SB from the Massachusetts Institute of Technology and a JD from Harvard Law School.\nResponsible for the Fund's digital health business development, from deal sourcing to value capture, Dr. Huesch brings nearly two decades' experience in clinical, academic and operational healthcare to the Group. Prior to joining the Fund, he was a Vice Chair of Research and an Associate professor at Penn State Hershey Medical Center in the US. He has published more than 45 peer-reviewed research papers including in JAMA and JAMA Internal Medicine, and been supported by grants from the US government and by contracts from Lockheed Martin. Earlier in his career, he spent more than half a dozen years in strategy consulting and business development. He holds MBBS degrees (equivalent to an MD) from the University of Sydney, Australia, an MBA with Distinction from INSEAD in France, and also earned a PhD and MA from UCLA.\nCommenting on the new appointments, Mr. Jonathan Larsen, Chief Innovation Officer of Ping An Insurance (Group) Company of China, Ltd. and Chairman and CEO of Ping An Global Voyager Fund, said, \"I am excited to welcome Don and Marco to the leadership team as the Group continues to build its presence in FinTech and HealthTech sectors. With their backgrounds in the financial and healthcare industries, they are excellent additions to help accelerate our access to global innovations in these areas.\"\nThe Ping An Global Voyager Fund was launched in 2017 with a mission to invest in world class FinTech and digital health capabilities. Ping An has seeded the fund with an initial US$1 billion in committed capital. The fund's investment areas include core banking, insurance and healthcare technologies, innovative digital business models, unique customer experiences, and AI. As a result of its tight affiliation with Ping An, the Global Voyager Fund is uniquely positioned to deliver scale access to the China market for portfolio companies.\nView original content: http://www.prnewswire.com/news-releases/ping-ans-global-voyager-fund-appoints-chief-operating-officer-and-chief-medical-officer-to-boost-leadership-team-300588742.html\nSOURCE Ping An Insurance (Group) Company of China, Ltd.", "external_links": ["http://www.prnewswire.com/news-releases/ping-ans-global-voyager-fund-appoints-chief-operating-officer-and-chief-medical-officer-to-boost-leadership-team-300588742.html"], "published": "2018-01-26T12:34:00.000+02:00", "crawled": "2018-01-26T12:36:56.035+02:00", "highlightTitle": ""}