{"organizations": [], "uuid": "24ecaf5b6ea2e3c31fe731d0b36c2fdfba370016", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-grant-thornton-names-diane-swonk-as-chief-economist.html", "country": "US", "domain_rank": 767, "title": "Grant Thornton names Diane Swonk as chief economist", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:00:00.000+02:00", "replies_count": 0, "uuid": "24ecaf5b6ea2e3c31fe731d0b36c2fdfba370016"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-grant-thornton-names-diane-swonk-as-chief-economist.html", "ord_in_thread": 0, "title": "Grant Thornton names Diane Swonk as chief economist", "locations": [], "entities": {"persons": [{"name": "grant thornton", "sentiment": "negative"}, {"name": "diane swonk", "sentiment": "negative"}, {"name": "swonk", "sentiment": "none"}, {"name": "mike mcguire", "sentiment": "none"}, {"name": "diane", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "business wire", "sentiment": "none"}, {"name": "ds economics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Renowned economic authority and thought leader bolsters the firm’s forecasting capabilities\nCHICAGO--(BUSINESS WIRE)-- Acclaimed economic advisor Diane Swonk has joined Grant Thornton LLP as chief economist, effective today. Based in the firm’s Chicago headquarters, Swonk will enhance client services with her economic forecasting acumen and significant experience advising U.S. policy makers, central banks, multinational corporations and C-suite teams.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180108005615/en/\nDiane Swonk has joined Grant Thornton LLP as chief economist. (Photo: Business Wire)\nSwonk has worked with a range of companies throughout her career, most recently with her private consulting firm, DS Economics. Swonk and her team have transitioned to Grant Thornton from DS Economics.\n“Businesses today are undergoing a huge amount of change,” said Grant Thornton CEO Mike McGuire. “Companies need sharp and timely economic insights to succeed – the very insights that have made Diane so well known. With her knowledge and experience across multiple sectors, including the high-growth middle market, Diane and her team complement our forward-thinking approach to solving clients’ problems.”\n“My team and I are excited to work with Grant Thornton. We are looking forward to collaborating with the firm’s industry and policy leaders to help Grant Thornton’s clients move forward with confidence,” said Swonk. “It’s an extraordinary opportunity to provide strategic advice and practical solutions to a spectrum of businesses in an increasingly complex economic environment.”\nThrough DS Economics, Swonk has advised clients from the Fortune 500 to small and midsize firms. Previously, she was Chief Economist at Mesirow Financial and Director of Economics for Bank One Corporation. She served two terms as an advisor to the nonpartisan Congressional Budget Office and Swonk advises the Federal Reserve. She is a distinguished Fellow and past-President of the National Association for Business Economics (NABE) and a member of the Council on Foreign Relations.\nSwonk serves on the Sitting Committee for the Booth School of Business at the University of Chicago and advises the Department of Economics at the University of Michigan. She sits on the NABE Statistics and Policy Committees as well as the board for the NABE Foundation. She is an active member of the board of the Posse Foundation in Chicago, a nonprofit dedicated to expanding access to higher education. She has also served on a number of other nonprofit boards including the Joffrey Ballet, as well as state and local advisory panels.\nSwonk received her bachelor’s and master’s degrees in economics from the University of Michigan. She received a master’s degree in business administration in finance from the University of Chicago.\nAbout Grant Thornton LLP\nFounded in Chicago in 1924, Grant Thornton LLP (Grant Thornton) is the U.S. member firm of Grant Thornton International Ltd, one of the world’s leading organizations of independent audit, tax and advisory firms. Grant Thornton, which has revenues in excess of $1.7 billion and operates 59 offices, works with a broad range of dynamic publicly and privately held companies, government agencies, financial institutions, and civic and religious organizations.\n“Grant Thornton” refers to Grant Thornton LLP, the U.S. member firm of Grant Thornton International Ltd (GTIL). GTIL and the member firms are not a worldwide partnership. Services are delivered by the member firms. GTIL and its member firms are not agents of, and do not obligate, one another and are not liable for one another’s acts or omissions. Please see grantthornton.com for further details.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108005615/en/\nGrant Thornton LLP\nKatharine Nichols, +1 312-602-8376\nkatharine.nichols@us.gt.com\ntwitter.com/grantthorntonus\nlinkd.in/grantthorntonus\nSource: Grant Thornton LLP", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Fgrantthorntonus&esheet=51739212&lan=en-US&anchor=twitter.com%2Fgrantthorntonus&index=2&md5=8d11d356a6a8cf6cba4ce268c8dd3b5c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2F2432%2F&esheet=51739212&lan=en-US&anchor=linkd.in%2Fgrantthorntonus&index=3&md5=d10c3c4986328cb4aac44e4c56a4573b", "http://www.businesswire.com/news/home/20180108005615/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.grantthornton.com%2F&esheet=51739212&newsitemid=20180108005615&lan=en-US&anchor=Grant+Thornton+LLP&index=1&md5=cf9b0c7571adb3d45f3a981e0fe04783"], "published": "2018-01-08T15:00:00.000+02:00", "crawled": "2018-01-08T15:33:01.025+02:00", "highlightTitle": ""}