{"organizations": [], "uuid": "ceac91a3eea0b02ee65d3b7046f38c8b7e8d3e37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-eu-markets-regulations/tradeweb-bond-volumes-spike-as-mifid-ii-sparks-electronic-trading-rush-idUSKBN1EZ21U", "country": "US", "domain_rank": 408, "title": "Tradeweb bond volumes spike as MiFID II sparks electronic trading rush", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T17:56:00.000+02:00", "replies_count": 0, "uuid": "ceac91a3eea0b02ee65d3b7046f38c8b7e8d3e37"}, "author": "", "url": "https://www.reuters.com/article/us-eu-markets-regulations/tradeweb-bond-volumes-spike-as-mifid-ii-sparks-electronic-trading-rush-idUSKBN1EZ21U", "ord_in_thread": 0, "title": "Tradeweb bond volumes spike as MiFID II sparks electronic trading rush", "locations": [], "entities": {"persons": [{"name": "tradeweb", "sentiment": "none"}, {"name": "abhinav ramnarayan", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "tradeweb", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 4:01 PM / Updated an hour ago Tradeweb bond volumes spike as MiFID II sparks electronic trading rush Abhinav Ramnarayan 3 Min Read \nLONDON (Reuters) - Bonds and interest rate swaps trading on Tradeweb’s multi-dealer platform have surged in early January as investors flock to electronic platforms to meet new, stricter regulations. \nIn the first five days of trading under the second version of the Markets in Financial Instruments Directive (MiFID II), Tradeweb said European credit market volumes surged 70 percent over the daily average in 2017. \nThe phrase “credit markets” is used in bond market circles to describe corporate and financial bonds. \nEven more noticeable was the surge in European interest rate swaps -- derivative instruments that allow investors to hedge against movements in rates -- which was up over 104 percent from the daily average volume in 2017. \nEuropean-listed exchange-traded fund (ETF) volumes were up 46 percent on the Tradeweb platform, the firm said in an email. \nTradeweb was unable to immediately disclose the size of the volumes in question. \n“We saw an increase in electronic trading of mandated products under MiFID II,” said Enrico Bruni, head of Europe and Asia business at Tradeweb. \n“While early days, we believe European clients have made a smooth transition to trading more business electronically.” \nTradeweb is owned by information provider Thomson Reuters, the parent company of Reuters News. \nThe new MiFID II regime is designed to shine a spotlight on the inner workings of stock, bond, commodity and derivatives markets by forcing banks, asset managers and traders to provide detailed information on trillions of euros in transactions. \nMany investors are moving to electronic platforms in a bid to meet the new reporting requirements. \nPreviously, a large chunk of bond and derivatives trade has been carried out “over the counter” -- ie, not via exchanges where transactions are recorded -- and a lot of deals have traditionally been made over the phone. By contrast, shares are largely traded on stock exchanges. \nOn the first day that the new regulations took effect, on Jan. 3, the EU’s markets watchdog said trade had been glitch-free. \nBut the European Securities and Markets Authority unexpectedly delayed until March the publication of data meant to specify which stocks will be subject to limits on trading in “dark pools”, meaning not on public exchanges. \nWhile forex trading volumes for January are not yet available, December trading volumes showed a spurt before the MiFID II regulations kicked in. \nCurrency trading on Thomson Reuters platforms in December topped $392 billion, the highest for that month since at least 2013, as trading in derivatives soared. Reporting by Abhinav Ramnarayan; Additional reporting by Saikat Chatterjee; Editing by Hugh Lawson", "external_links": [], "published": "2018-01-10T17:56:00.000+02:00", "crawled": "2018-01-10T18:18:14.002+02:00", "highlightTitle": ""}