{"organizations": [], "uuid": "2adb5586fe2189e4c050c3fdc0964339ab7ddc1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 13}, "facebook": {"likes": 36, "shares": 36, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219529175&w=1200&r=LYNXMPEE040CM", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-china-markets-hshares/hong-kong-stock-rally-gains-momentum-from-china-share-reform-idUSKBN1EU0KM", "country": "US", "domain_rank": 408, "title": "Hong Kong stock rally gains momentum from China share reform", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T09:00:00.000+02:00", "replies_count": 0, "uuid": "2adb5586fe2189e4c050c3fdc0964339ab7ddc1d"}, "author": "", "url": "https://www.reuters.com/article/us-china-markets-hshares/hong-kong-stock-rally-gains-momentum-from-china-share-reform-idUSKBN1EU0KM", "ord_in_thread": 0, "title": "Hong Kong stock rally gains momentum from China share reform", "locations": [], "entities": {"persons": [{"name": "michelle chen", "sentiment": "none"}, {"name": "ben kwong", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG (Reuters) - Chinese appetite for Hong Kong equities, ample cash supply and optimism over share reforms could propel the city’s benchmark stock index up as much as 15 percent this year, after an already bullish run in 2017, fund managers and analysts say.\nThe Hang Seng Index .HSI was the best performing stock index among major markets last year, surging 36 percent. It is now 4 percent away from a record high hit in October 2007.\nParticular focus is on moves by China to allow shareholders of mainland-incorporated firms listed in Hong Kong to release their locked-up shares and trade them in the open equity market .HSCE . Such reforms would boost share supply but could lead to improved corporate governance and valuations, analysts said.\n“In the first half of this year, the Hang Seng Index will continue to test record highs and will have the chance to rise to 34,000-35,000 points,” said Ben Kwong, chief operating officer at securities firm KGI Asia in Hong Kong.\nHowever, it may fall back to the 30,000-32,000 level in the second half as higher interest rates and an expected stronger U.S. dollar trigger profit-taking, Kwong added.\nMarket watchers expect regulators to be cautious on the pace of H-share reform to avoid the benchmark index - where valuations are still much cheaper than in mainland China - becoming too volatile.\nChina will initially select up to three companies in the H-share convertibility pilot scheme, but investors see the move as a positive step.\nOptimism over the scheme sent the benchmark index past the 30,000-mark to a decade high this week.\nThe convertibility reform is expected to align major shareholders’ interests with other stakeholders, paving the way for greater scrutiny over corporate governance which has dogged many Chinese companies amid a series of scandals.\n“Right now large shareholders’ shares cannot be traded, so the stock price move does not impact them...if their shares can be circulated, they should care about how investors think and then improve corporate governance,” said Victoria Mio, Asia Pacific equities co-head at asset manager Robeco. “2018 will be another bull market for the Hong Kong market.”\nCHINESE DEMAND Southbound fund flows have increased since the stock connect schemes that link Shanghai and Shenzhen to Hong Kong markets were launched in 2014 and 2016, respectively. Total net inflows to the Hong Kong market have climbed to around 12 percent of daily turnover.\n“We will probably see southbound trading reach more than 15 percent, or even 20 percent of Hong Kong’s market turnover in mid-2018,” said Ivan Li, a research director at DBS Vickers Securities.\nH-share reform is also expected to improve market liquidity and attract more foreign funds as major shareholders of Hong Kong-listed Chinese companies pay more attention.\n“Major shareholders will have more incentive to communicate with investors to boost their share price and market valuation as the reform is gradually implemented,” said Yang Delong, a managing director at First Seafront Fund in Shenzhen.\nYang said it was a good time to invest in Hong Kong stocks, which he forecast have at least a 10 percent upside.\n“A big risk in the second half is the yuan may depreciate, which will cause capital outflows. If that happens, Chinese regulators may take measures to avoid fund outflows and funds flowing into Hong Kong will fall,” said KGI Asia’s Kwong.\nEditing by Anne Marie Roantree and Jacqueline Wong\n ", "external_links": [], "published": "2018-01-05T09:00:00.000+02:00", "crawled": "2018-01-05T09:21:58.028+02:00", "highlightTitle": ""}