{"organizations": [], "uuid": "b0f1db28ef1efb4dcdfb3fbf1da3f9793f550a8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223334490&w=1200&r=LYNXMPEE0I0RO", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-czech-politics/czech-lower-house-votes-to-lift-immunity-of-prime-minister-idUSKBN1F81EH", "country": "US", "domain_rank": 408, "title": "Czech PM, blocked from forming government, loses immunity from fraud charge", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-19T20:51:00.000+02:00", "replies_count": 0, "uuid": "b0f1db28ef1efb4dcdfb3fbf1da3f9793f550a8f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-czech-politics/czech-lower-house-votes-to-lift-immunity-of-prime-minister-idUSKBN1F81EH", "ord_in_thread": 0, "title": "Czech PM, blocked from forming government, loses immunity from fraud charge", "locations": [], "entities": {"persons": [{"name": "andrej babis", "sentiment": "negative"}, {"name": "babis", "sentiment": "none"}, {"name": "jaroslav faltynek", "sentiment": "none"}], "locations": [{"name": "prague", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "czech television", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PRAGUE (Reuters) - The Czech parliament lifted Prime Minister Andrej Babis’ immunity on Friday, leaving him open to prosecution over accusations he fraudulently received European Union subsidies.\nThe threat of legal action has prevented Babis from creating a government as smaller parties have refused to back him while the charge remains.\nBabis, the country’s second richest person, denies hiding ownership of a farm and convention center to receive a 2 million euro ($2.5 million) subsidy a decade ago.\nLawmakers voted 111-69 to lift parliamentary immunity for Babis and Jaroslav Faltynek, the deputy chairman of Babis’ ANO party. Both deny wrongdoing.\nBabis, who remains popular among voters, has called the subsidy case a ploy by opponents to drive him out of politics.\n“We live in a country where you can order a prosecution of somebody and you can probably get somebody in jail,” Babis told parliament, drawing strong criticism from opposition parties.\nA police spokeswoman told Czech Television: “We reject that it would be possible to order prosecution.”\nBabis himself voted to lift his immunity.\nParliament had already taken away Babis’s immunity once, but he regained it in October when ANO won a national election, getting three times the votes of its nearest rival on pledges to fight corruption and run the state better. Opinion polls show ANO’s support continues to grow.\nBut the party created by Babis in 2011 only holds 78 of the 200 lower house seats and has not been able to form a coalition.\nOn Tuesday, Babis’s minority government lost a confidence vote in its first attempt. He will stay in office until a new administration is formed.\nBabis has raised the possibility he does not need to lead the next government, a condition of potential partners including the mainstream parties Civic Democrats, Social Democrats and Christian Democrats.\nDevelopments may also hinge on a tight presidential run-off vote on Jan. 26-27 between incumbent Milos Zeman, who backs Babis, and academic Jiri Drahos, who says it would be unacceptable to have a prime minister facing police charges.\nThe start of 2018 has seen increased political instability in eastern European Union countries. Romania got its third prime minister in a year and Bulgaria’s government faces a no-confidence vote over a lack of progress in tackling corruption.\nLast month, Poland re-shuffled its government amid disputes with the EU over a judicial overhaul. ($1 = 0.8169 euros)\nReporting by Jason Hovet and Robert Muller; Additional reporting by Petra Vodstrcilova; Editing by Larry King and Robin Pomeroy\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T20:51:00.000+02:00", "crawled": "2018-01-20T17:30:27.003+02:00", "highlightTitle": ""}