{"organizations": [], "uuid": "728d9f90944354f42805f12f4e4a1079d6b47ef4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-potlatch-corporation-reports-fourth-quarter-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "Potlatch Corporation Reports Fourth Quarter and Full Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T04:00:00.000+02:00", "replies_count": 0, "uuid": "728d9f90944354f42805f12f4e4a1079d6b47ef4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-potlatch-corporation-reports-fourth-quarter-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "Potlatch Corporation Reports Fourth Quarter and Full Year 2017 Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SPOKANE, Wash., Jan. 29, 2018 (GLOBE NEWSWIRE) -- Potlatch Corporation (Nasdaq:PCH) today reported net income of $11.6 million, or $0.28 per diluted share, on revenues of $175.2 million for the quarter ended December 31, 2017. Excluding after-tax special items, consisting primarily of a charge related to tax legislation and Deltic merger-related costs, adjusted net income was $25.7 million, or $0.62 per diluted share for the fourth quarter of 2017. Net income was $14.4 million, or $0.35 per diluted share, on revenues of $155.7 million in the quarter ended December 31, 2016.\nNet income for the full year of 2017 was $86.5 million, or $2.10 per diluted share, on revenues of $678.6 million. Excluding after-tax special items, consisting primarily of a charge related to tax legislation, Deltic merger-related costs and environmental charges for Avery Landing, adjusted net income was $103.6 million, or $2.51 per diluted share. Net income was $10.9 million, or $0.27 per diluted share for 2016. Excluding the after-tax loss on the sale of central Idaho acreage and environmental charges for Avery Landing, 2016 net income was $48.2 million, or $1.18 per diluted share.\n“Higher lumber prices and solid execution by each of our three businesses led to very strong financial results in 2017,” said Mike Covey, chairman and chief executive officer. “Operating income in both our Northern Resource business and Wood Products segments were at record levels. We increased our dividend by 7% in the fourth quarter at the same time we announced the merger with Deltic. We expect to close the merger by the end of February 2018,” stated Mr. Covey.\nFinancial Highlights (in millions, except per share data)\nQ4 2017 Q3 2017 Q4 2016 Revenues $ 175.2 $ 190.4 $ 155.7 Net income $ 11.6 $ 33.7 $ 14.4 Net income per diluted share $ 0.28 $ 0.82 $ 0.35 Distribution per share $ 0.40 $ 0.375 $ 0.375 Net cash from operations $ 33.3 $ 50.0 $ 27.7 Cash and cash equivalents $ 120.5 $ 116.8 $ 82.6 Business Performance: Q4 2017 vs. Q3 2017\nResource\nResource’s operating income was $29.9 million on revenues of $75.8 million in the fourth quarter, compared to operating income of $41.8 million on revenues of $94.7 million in the third quarter of 2017. Northern sawlog prices decreased 9% relative to the third quarter. Harvest volumes were seasonally lower in the North and the South.\nWood Products\nWood Products earned $19.5 million on revenues of $114.5 million in the fourth quarter, compared to operating income of $19.3 million on revenues of $116.5 million in the third quarter of 2017. Average lumber prices increased 4% and lumber shipments decreased 6% in the fourth quarter compared to the third quarter. The segment recorded a loss of $0.1 million in the fourth quarter and a loss of $2.1 million in the third quarter related to a lumber price swap.\nReal Estate\nReal Estate’s operating income was $2.8 million on revenues of $4.7 million in the fourth quarter, compared to operating income of $1.4 million on revenues of $3.3 million in the third quarter of 2017. More acres were sold in the fourth quarter compared to the third quarter.\nOutlook\n“We expect the U.S. housing market to continue its recovery and our 2018 outlook assumes that approximately 1.3 million housing units will be built in the U.S. this year. We also expect lumber prices to remain strong in 2018 in light of final duties on Canadian lumber shipments to the U.S. and an anticipated increase in lumber demand. Deltic and Potlatch shareholder votes related to the merger are scheduled on February 20, 2018 and we remain confident that the merger presents significant strategic and financial opportunities,” concluded Mr. Covey.\nReconciliation of Q4 and Full Year 2017 Earnings (in millions, except per share data)\nThree months ended Year ended December 31, 2017 December 31, 2017 Amount Per Share Amount Per Share Net income $ 11.6 $ 0.28 $ 86.5 $ 2.10 Impact of tax legislation 1 10.7 0.26 10.7 0.26 Deltic merger-related costs 2 3.4 0.08 3.4 0.08 Environmental charges for Avery Landing, net of taxes - - 3.0 0.07 Lumber price swap settlements, net of taxes 3 - - 0.7 0.02 Change in unrealized (gain) loss on lumber price swap, net of taxes 3 - - (0.7 ) (0.02 ) Adjusted net income 4 $ 25.7 $ 0.62 $ 103.6 $ 2.51 1 The Tax Cuts and Jobs Act was enacted on December 22, 2017 and lowers U.S. corporate income tax rates as of January 1, 2018. The impact of the tax legislation was an increase in income tax expense of $10.7 million due to the remeasurement of U.S. deferred tax assets at lower enacted corporate tax rates.\n2 The costs were incurred by our Real Estate Investment Trust (REIT), which generally is not subject to income taxes.\n3 Lumber price swap adjusted to exclude the change in unrealized (gain) loss and includes cash settlements during the period.\n4 Adjusted net income is a non-GAAP measure that management uses to evaluate the performance of the company. Adjusted net income should not be considered in isolation and is not intended to represent an alternative to our GAAP results. We believe that these non-GAAP measures, when read in conjunction with our GAAP financials, provide useful information to investors by facilitating the comparability of our ongoing operating results over the periods presented, the ability to identify trends in our underlying business and the comparison of our operating results against analyst financial models and operating results of other public companies that supplement their GAAP results with non-GAAP financial measures.\nPending Merger with Deltic Timber\nOn October 22, 2017, Potlatch and Deltic Timber entered into an Agreement and Plan of Merger. Our outlook does not consider any incremental operating results attributable to this pending merger.\nConference Call Information\nA live conference call and webcast will be held Tuesday, January 30, 2018, at 9:00 a.m. Pacific Time (12:00 p.m. Eastern Time). Investors may access the webcast at www.potlatchcorp.com by clicking on the Investor Resources link or by conference call at 1-866-393-8403 for U.S./Canada and 1-706-679-7929 for international callers. Participants will be asked to provide conference I.D. number 1157958. Supplemental materials that will be discussed during the call are available on the website.\nA replay of the conference call will be available two hours following the call until February 6, 2018 by calling 1-800-585-8367 for U.S./Canada or 1-404-537-3406 for international callers. Callers must enter conference I.D. number 1157958 to access the replay.\nAbout Potlatch\nPotlatch is a Real Estate Investment Trust (REIT) with approximately 1.4 million acres of timberland in Alabama, Arkansas, Idaho, Minnesota and Mississippi. Potlatch, a certified forest practices leader, is committed to providing superior returns to stockholders through long-term stewardship of its forest resources. The company also conducts a land sales and development business and operates wood products manufacturing facilities through its taxable REIT subsidiary. More information about Potlatch can be found on the company’s website at www.potlatchcorp.com .\nForward-Looking Statements\nThis press release contains certain forward-looking statements within the meaning of the Private Litigation Reform Act of 1995 as amended, including without limitation, our expectations regarding the U.S. housing market; strong repair and remodel market; lumber demand and pricing; increased capital investment in manufacturing in the U.S. South; the expected closing of the merger of Potlatch and Deltic; the proposed impact of the merger on Potlatch’s financial results; the estimated distribution of Deltic’s accumulated earnings and profits; and the integration of Deltic’s operations. You should carefully read forward-looking statements, including statements that contain these words, because they discuss the future expectations or state other “forward-looking” information about Potlatch. A number of important factors could cause actual results or events to differ materially from those indicated by such forward-looking statements, many of which are beyond Potlatch’s control, including the U.S. housing market; changes in timberland values; changes in timber harvest levels on the company's lands; changes in timber prices; changes in policy regarding governmental timber sales; availability of logging contractors and shipping capacity; changes in the United States and international economies; changes in interest rates; changes in the level of construction activity; changes in Asia demand; changes in tariffs, quotas and trade agreements involving wood products; currency fluctuation; changes in demand for our products; changes in production and production capacity in the forest products industry; competitive pricing pressures for our products; unanticipated manufacturing disruptions; changes in general and industry-specific environmental laws and regulations; unforeseen environmental liabilities or expenditures; weather conditions; restrictions on harvesting due to fire danger; changes in raw material, fuel and other costs; changes in share price; the successful execution of the company’s strategic plans; the company’s ability to consummate the merger with Deltic or satisfy the conditions to the completion of the transaction, including the receipt of stockholder approvals, the company’s ability to meet expectations regarding the timing, completion and accounting and tax treatments of the merger transaction; the possibility that any of the anticipated benefits of the proposed merger will not be realized or will not be realized within the expected time period; the risk that integration of Deltic’s operations with those of Potlatch will be materially delayed or will be more costly or difficult than expected; the failure of the proposed merger to close for any other reason; the effect of the announcement of the merger on customer relationships and operating results (including, without limitation, difficulties in maintaining relationships with employees or customers); dilution caused by Potlatch’s issuance of additional shares of its common stock in connection with the merger; the possibility that the merger may be more expensive to complete than anticipated, including as a result of unexpected factors or events, the diversion of management’s time on transaction related issues; the estimation of Deltic’s accumulated earnings and profits is preliminary and may change with further due diligence; and the other factors described in Potlatch’s Annual Report on Form 10-K and in the company’s other filings with the SEC, including the risks discussed in the definitive joint proxy statement/prospectus filed with the SEC on Form 424B3 on January 18, 2018 in connection with the proposed transaction with Deltic. Potlatch assumes no obligation to update the information in this communication, except as otherwise required by law. Readers are cautioned not to place undue reliance on these forward-looking statements, all of which speak only as of the date hereof.\nADDITIONAL INFORMATION\nThis communication is being made in respect of the proposed merger transaction involving Potlatch Corporation (“Potlatch”) and Deltic Timber Corporation (“Deltic”). This communication does not constitute an offer to sell or the solicitation of an offer to buy any securities or a solicitation of any vote or approval, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of such jurisdiction. In connection with the proposed merger, Potlatch and Deltic filed a registration statement on Form S-4 that was declared effective on January 17, 2018, and Potlatch filed a joint proxy statement/prospectus on Form 424B3 on January 18, 2018 that has been mailed to stockholders of Potlatch and Deltic. BEFORE MAKING ANY VOTING OR INVESTMENT DECISION, SECURITY HOLDERS OF POTLATCH AND DELTIC ARE URGED TO READ THE JOINT PROXY STATEMENT/PROSPECTUS FILED ON JANUARY 18, 2018 REGARDING THE PROPOSED TRANSACTION AND ANY OTHER RELEVANT DOCUMENTS CAREFULLY IN THEIR ENTIRETY BECAUSE THEY CONTAIN IMPORTANT INFORMATION ABOUT THE PROPOSED TRANSACTION. The joint proxy statement/prospectus, as well as other filings containing information about Potlatch and Deltic are available without charge, at the SEC’s Internet site ( http://www.sec.gov ). Copies of the joint proxy statement/prospectus and the filings with the SEC that are incorporated by reference in the joint proxy statement/prospectus can also be obtained, without charge, from Potlatch’s website at http://www.Potlatchcorp.com under the Investor Resources tab (in the case of documents filed by Potlatch) and on Deltic’s website at https://www.Deltic.com under the Investor Relations tab (in the case of documents filed by Deltic).\nPotlatch and Deltic, and certain of their respective directors, executive officers and other members of management and employees may be deemed to be participants in the solicitation of proxies from the stockholders of Deltic and Potlatch in respect of the proposed merger transaction. Certain information about the directors and executive officers of Potlatch is set forth in its Annual Report on Form 10-K for the year ended December 31, 2016, which was filed with the SEC on February 17, 2017, its proxy statement for its 2017 annual meeting of stockholders, which was filed with the SEC on April 3, 2017, its Current Report on Form 8-K, which was filed on May 1, 2017 and its joint proxy statement/prospectus which was filed with the SEC on Form 424B3 on January 18, 2018. Certain information about the directors and executive officers of Deltic is set forth in its Annual Report on Form 10-K for the year ended December 31, 2016, which was filed with the SEC on March 7, 2017, its proxy statement for its 2017 annual meeting of stockholders, which was filed with the SEC on March 20, 2017, its supplement to the proxy statement for its 2017 annual meeting of the stockholders, which was filed with the SEC on March 30, 2017 and its Current Reports on Form 8-K, which were filed with the SEC on September 1, 2017, May 2, 2017, March 8, 2017 and February 27, 2017. Other information regarding the participants in the proxy solicitations and a description of their direct and indirect interests, by security holdings or otherwise, are included in the joint proxy statement/prospectus filed on January 18, 2018 and other relevant documents filed with the SEC when they become available.\nPotlatch Corporation\nConsolidated Statements of Income\nUnaudited\nThree Months Ended Years Ended December 31, September 31, December 31, December 31, (Dollars in thousands, except per share amount) 2017 2017 2016 2017 2016 Revenues $ 175,244 $ 190,441 $ 155,681 $ 678,595 $ 599,099 Costs and expenses: Cost of goods sold 121,055 124,971 116,980 470,365 462,304 Selling, general and administrative expenses 13,662 14,592 12,985 55,408 51,697 Environmental charges for Avery Landing — 4,978 — 4,978 1,022 Deltic merger-related costs 3,382 27 — 3,409 — Loss (gain) on lumber price swap 97 2,080 — (1,088 ) — Loss on sale of central Idaho timber and timberlands 1 — — — — 48,522 138,196 146,648 129,965 533,072 563,545 Operating income 37,048 43,793 25,716 145,523 35,554 Interest expense, net (7,395 ) (7,336 ) (6,924 ) (27,049 ) (28,941 ) Income before income taxes 29,653 36,457 18,792 118,474 6,613 Income tax (provision) benefit (18,065 ) (2,757 ) (4,419 ) (32,021 ) 4,325 Net income $ 11,588 $ 33,700 $ 14,373 $ 86,453 $ 10,938 Net income per share: Basic $ 0.28 $ 0.83 $ 0.35 $ 2.12 $ 0.27 Diluted $ 0.28 $ 0.82 $ 0.35 $ 2.10 $ 0.27 Dividends per share $ 0.40 $ 0.375 $ 0.375 $ 1.525 $ 1.50 Weighted-average shares outstanding (in thousands): Basic 40,839 40,829 40,752 40,824 40,798 Diluted 41,301 41,250 41,069 41,227 41,033 1 In the second quarter of 2016, we sold approximately 172,000 acres of timberlands located in central Idaho for $114 million at a loss of $48.5 million before taxes.\nPotlatch Corporation\nCondensed Consolidated Balance Sheets\nUnaudited\nAt December 31, 2017 2016 ASSETS Current assets: Cash and cash equivalents $ 120,457 $ 82,584 Customer receivables, net 11,240 14,842 Inventories 50,132 52,622 Other current assets 11,478 13,597 Total current assets 193,307 163,645 Property, plant and equipment, net 77,229 72,820 Timber and timberlands, net 654,476 641,856 Deferred tax assets, net 19,796 42,051 Other long-term assets 8,271 7,309 Total assets $ 953,079 $ 927,681 LIABILITIES AND STOCKHOLDERS ’ EQUITY Current liabilities: Current portion of long-term debt $ 14,263 $ 11,032 Accounts payable and accrued liabilities 55,201 43,710 Current portion of pension and other postretirement employee benefits 15,417 5,839 Total current liabilities 84,881 60,581 Long-term debt 559,056 572,956 Pension and other postretirement employee benefits 93,441 123,284 Other long-term obligations 15,159 14,586 Total liabilities 752,537 771,407 Commitments and contingencies Stockholders’ equity: Common stock, $1 par value 40,612 40,519 Additional paid-in capital 359,144 355,274 Accumulated deficit (104,363 ) (128,775 ) Accumulated other comprehensive loss (94,851 ) (110,744 ) Total stockholders’ equity 200,542 156,274 Total liabilities and stockholders' equity $ 953,079 $ 927,681\nPotlatch Corporation\nCondensed Consolidated Statements of Cash Flows\nUnaudited\nFor the Years Ended December 31, 2017 2016 CASH FLOWS FROM OPERATING ACTIVITIES Net income $ 86,453 $ 10,938 Adjustments to reconcile net income to net cash from operating activities: Depreciation, depletion and amortization 29,912 34,190 Basis of real estate sold 6,827 8,011 Change in deferred taxes 15,364 1,853 Employee benefit plans 13,151 15,661 Equity-based compensation expense 4,722 4,390 Loss on sale of central Idaho timber and timberlands — 48,522 Other, net (1,872 ) (1,198 ) Change in: Receivables 3,602 (3,712 ) Inventories 2,490 (17,460 ) Other assets (15 ) (473 ) Accounts payable and accrued liabilities 11,591 7,232 Other liabilities (4,291 ) (4,537 ) Funding of qualified pension plans (5,275 ) (1,300 ) Net cash from operating activities 162,659 102,117 CASH FLOWS FROM INVESTING ACTIVITIES Change in short-term investments — — Transfer from company owned life insurance (COLI) 1,278 6,384 Transfer to COLI (1,324 ) (3,967 ) Purchase of property, plant and equipment (12,855 ) (5,866 ) Timberlands reforestation and roads (15,207 ) (13,422 ) Acquisition of timber and timberlands (22,043 ) (1,244 ) Net proceeds from sale of central Idaho timber and timberlands — 111,460 Other, net 131 6 Net cash from investing activities (50,020 ) 93,351 CASH FLOWS FROM FINANCING ACTIVITIES Dividends to common stockholders (61,931 ) (60,842 ) Revolving line of credit borrowings (repayment) — (30,000 ) Repayment of long-term debt (11,000 ) (113,335 ) Repurchase of common stock — (5,956 ) Proceeds from issuance of long-term debt — 93,235 Other, net (1,835 ) (3,911 ) Net cash from financing activities (74,766 ) (120,809 ) Change in cash and cash equivalents 37,873 74,659 Cash and cash equivalents at beginning of year 82,584 7,925 Cash and cash equivalents at end of year $ 120,457 $ 82,584\nPotlatch Corporation\nSegment Information\nUnaudited\nThree Months Ended Years Ended December 31, September 31, December 31, December 31, (Dollars in thousands) 2017 2017 2016 2017 2016 Revenues: Resource $ 75,802 $ 94,705 $ 66,805 $ 278,199 $ 256,163 Wood Products 114,549 116,487 95,644 441,157 367,426 Real Estate 4,733 3,282 8,658 30,655 32,604 195,084 214,474 171,107 750,011 656,193 Intersegment Resource revenues (19,840 ) (24,033 ) (15,426 ) (71,416 ) (57,094 ) Total consolidated revenues $ 175,244 $ 190,441 $ 155,681 $ 678,595 $ 599,099 Income before income taxes: Resource $ 29,860 $ 41,796 $ 22,736 $ 106,105 $ 81,918 Wood Products 19,496 19,281 8,279 72,166 24,587 Real Estate 2,739 1,469 5,974 18,576 (29,495 ) Eliminations and adjustments (1,676 ) (3,141 ) (1,551 ) (2,705 ) (3,001 ) 50,419 59,405 35,438 194,142 74,009 Corporate (13,371 ) (15,612 ) (9,722 ) (48,619 ) (38,455 ) Operating income 37,048 43,793 25,716 145,523 35,554 Interest expense, net (7,395 ) (7,336 ) (6,924 ) (27,049 ) (28,941 ) Income before income taxes $ 29,653 $ 36,457 $ 18,792 $ 118,474 $ 6,613 Depreciation, depletion and amortization: Resource $ 5,611 $ 6,207 $ 6,119 $ 20,476 $ 24,090 Wood Products 1,860 1,821 1,819 7,347 7,357 Real Estate 1 — 1 2 4 7,472 8,028 7,939 27,825 31,451 Corporate 164 168 152 607 760 Bond discounts and deferred loan fees 368 369 376 1,480 1,979 Total depreciation, depletion and amortization $ 8,004 $ 8,565 $ 8,467 $ 29,912 $ 34,190 Basis of real estate sold: Real Estate $ 640 $ 618 $ 1,400 $ 7,114 $ 8,518 Eliminations and adjustments (164 ) (39 ) (75 ) (287 ) (507 ) Total basis of real estate sold $ 476 $ 579 $ 1,325 $ 6,827 $ 8,011\nContact: (Investors) (Media) Jerry Richards Mark Benson 509.835.1521 509.835.1513\nSource:Potlatch Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/206f796d-7ccc-4616-ad05-d13825e05d38", "https://www.globenewswire.com/Tracker?data=7Q7nj94STtkHpT_GRPk4SKviUGoY1kHaj-Qq-exhW3ZWy39YSRWvGCuxuD_qntvq_1sHUCRNBosiVj6eu1MkWoZaV-e86g0up6undqFk1wA=", "https://www.globenewswire.com/Tracker?data=7Q7nj94STtkHpT_GRPk4SHTjSVlgrCTbtKqPvrjPspk5fkBTawKRs0W5_O6NjjQpLlHJdutBMDsWsH5Bmt3KwstyLvB2KXfhAhemrBmncfo="], "published": "2018-01-30T04:00:00.000+02:00", "crawled": "2018-01-30T07:10:08.970+02:00", "highlightTitle": ""}