{"organizations": [], "uuid": "90644d0f5a8d5ad357a56d1029db340e0de6dc10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104937101-GettyImages-901379908.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/09/olympic-ticket-sales-fall-short-for-pyeongchang-games.html", "country": "US", "domain_rank": 767, "title": "Olympic ticket sales fall short for Pyeongchang games", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T01:37:00.000+02:00", "replies_count": 0, "uuid": "90644d0f5a8d5ad357a56d1029db340e0de6dc10"}, "author": "Eric Chemi", "url": "https://www.cnbc.com/2018/01/09/olympic-ticket-sales-fall-short-for-pyeongchang-games.html", "ord_in_thread": 0, "title": "Olympic ticket sales fall short for Pyeongchang games", "locations": [], "entities": {"persons": [], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "We're just one month away from the Olympic opening ceremonies in Pyeongchang, South Korea . And for a lot of reasons, ticket sales are falling short of the pace they set at past games.\nTwo weeks ago the Pyeongchang organizing committee reported only 61 percent of all tickets have been sold. That's 655,000 out of 1.07 million total tickets. For popular sports such as figure skating and ice hockey, those numbers were even lower, coming in under 60 percent.\nTensions between North Korea and South Korea have dominated the news recently. But many locals speaking to CNBC explained that within South Korea citizens have grown accustomed to decades of such risks. Some suggested there were more concerns about safety at the 1988 Summer Games in Seoul.\nIn recent days the two countries reinstated a hotline phone to ease tensions, while the U.S. and South Korea said they would postpone military exercises until after the games end.\nTicket sales Other sports experts think the lack of ticket sales has more to do with the quality of the games and the athletes who will be there. One reason: The hockey tournament won't have many of its best athletes, because the NHL decided not to send its players. Collegiate hockey players don't have the same draw for fans.\nA second reason: the absence of Russia . The entire country was kicked out of the Olympics for a long track record of state-sponsored doping. Its citizens would have been a source of ticket sales.\nOthers have pointed to the location as being less than stellar for tourists. Pyeongchang isn't a household name like the hosts of past Winter Games, such as Vancouver and Turin.\nBut ticket sales aside, the Olympics are primarily a made-for-TV event. Millions of people in many different countries are expected to watch each day. The real challenge for European and North American viewers will be the time zone shift.\nVenues ready to go On the plus side, Pyeongchang officials say all 12 venues are ready to go. Organizers built six new venues and refurbished six existing facilities. That's a big positive compared with some past games when organizers had to scramble at the last minute to finish venues on time. All 12 sites are located within a half hour of each other, which should make it easy for people to get around.\nPyeongchang spent 18 years winning this bid, having lost past bids to Vancouver and Sochi. But now they plan to capitalize on this win, hoping to increase tourism to the region this year to 5 million people up from a typical 3 million. Many hotels and resorts around the area spent large amounts of money in renovations hoping to attract those tourists.\nBut the big question has been: If you build it, will they come?", "external_links": [], "published": "2018-01-10T01:37:00.000+02:00", "crawled": "2018-01-10T01:57:27.000+02:00", "highlightTitle": ""}