{"organizations": [], "uuid": "e0e6af5c0b32bc6afeb46beeb25d1682413ae6de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219330912&w=1200&r=LYNXMPEE030VD", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-climatechange-temperatures/2017-was-second-hottest-year-on-record-after-2016-european-data-idUKKBN1ET1L3", "country": "US", "domain_rank": 408, "title": "2017 was second hottest year on record, after 2016 - European data", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T16:11:00.000+02:00", "replies_count": 0, "uuid": "e0e6af5c0b32bc6afeb46beeb25d1682413ae6de"}, "author": "", "url": "https://uk.reuters.com/article/uk-climatechange-temperatures/2017-was-second-hottest-year-on-record-after-2016-european-data-idUKKBN1ET1L3", "ord_in_thread": 0, "title": "2017 was second hottest year on record, after 2016 - European data", "locations": [], "entities": {"persons": [{"name": "alister doyle", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "montecito", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "arctic", "sentiment": "none"}], "organizations": [{"name": "min read  oslo", "sentiment": "none"}, {"name": "copernicus climate change service", "sentiment": "none"}, {"name": "u.n. world meteorological organization", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 2:10 PM / Updated 8 minutes ago 2017 was second hottest year on record, after 2016 - European data Alister Doyle Environment Correspondent 3 Min Read \nOSLO (Reuters) - Last year was the second hottest worldwide on record, just behind a sweltering 2016 with signs of climate change ranging from wildfires to a thaw of Arctic ice, a European Union monitoring centre said on Thursday. FILE PHOTO: Firefighters keep watch on the Thomas wildfire in the hills and canyons outside Montecito, California, U.S., December 16, 2017. REUTERS/Gene Blevins/File Photo \nThe Copernicus Climate Change Service, the first major international weather agency to report global 2017 temperatures, said they averaged 14.7 degrees Celsius (58.46°F) or 1.2C (2.2F) above pre-industrial times. \nLast year was slightly “cooler than the warmest year on record, 2016, and warmer than the previous second warmest year, 2015,” the report said. Temperature records date back to the late 19th century. \nThe measurements back up a projection by the U.N. World Meteorological Organization (WMO) in November that 2017 would be second or third warmest behind 2016, as part of a long-term trend driven by man-made greenhouse gases. \nSweltering temperatures in 2016 were also boosted by a natural El Nino event that happens every few years and releases heat from the Pacific Ocean. \nLast year was the warmest year on record without the influence of an El Nino, according to Copernicus, run by the European Centre for Medium-Range Weather Forecasts. \nIn the Arctic, “sea-ice cover was ... below average, especially during the cooler months at the beginning and the end of the year,” it said. Children play at a fountain on a hot summer day in central Lviv, Ukraine, August 11, 2017. REUTERS/Gleb Garanich \n“Meanwhile, southern Europe was hit hard by prolonged dry conditions from late spring into the autumn months. The dry conditions led to water shortages in many areas and facilitated the spread of wildfires on the Iberian Peninsula,” it said. \nU.S. President Donald Trump, who doubts that climate change has a human cause, tweeted on Dec. 29 about bone-chilling cold in the United States and cast doubt on the need for action to limit emissions. \n“Perhaps we could use a little bit of that good old Global Warming that our Country, but not other countries, was going to pay TRILLIONS OF DOLLARS to protect against. Bundle up!” he wrote. \nTrump plans to quit the 2015 Paris Agreement, which has the backing of almost 200 nations and seeks to limit the rise in temperatures to “well below” 2 degrees Celsius (3.6 Fahrenheit) above pre-industrial times, ideally 1.5 (2.7F). \nEarlier on Thursday, German reinsurer Munich Re said insurers will have to pay claims of around $135 billion for 2017, the most ever, following a spate of hurricanes, earthquakes and fires in North America. \nIt said that total losses, including those not insured, were $330 billion, the second-worst in history after 2011 when an earthquake and tsunami wreaked havoc in Japan. \nThe WMO will publish its review of 2017 temperatures, also drawing on U.S., British and Japanese data, in about two weeks. Reporting By Alister Doyle, additional reporting by Tom Sims and Alexander Hubner in Germany; Editing by Robin Pomeroy", "external_links": [], "published": "2018-01-04T16:11:00.000+02:00", "crawled": "2018-01-04T16:21:50.021+02:00", "highlightTitle": ""}