{"organizations": [], "uuid": "9f4428a9c8a38860ba22f1da5b0276fbd6050685", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/25/reuters-america-column-what-does-looming-us-china-trade-showdown-mean-for-aluminium-andy-home.html", "country": "US", "domain_rank": 767, "title": "COLUMN-What does looming US-China trade showdown mean for aluminium? Andy Home", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:22:00.000+02:00", "replies_count": 0, "uuid": "9f4428a9c8a38860ba22f1da5b0276fbd6050685"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/25/reuters-america-column-what-does-looming-us-china-trade-showdown-mean-for-aluminium-andy-home.html", "ord_in_thread": 0, "title": "COLUMN-What does looming US-China trade showdown mean for aluminium? Andy Home", "locations": [], "entities": {"persons": [{"name": "andy home", "sentiment": "neutral"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}, {"name": "shanghai futures exchange", "sentiment": "none"}, {"name": "london metal exchange", "sentiment": "none"}, {"name": "lme", "sentiment": "none"}, {"name": "alcoa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Home@ (The opinions expressed here are those of the author, a columnist for Reuters.)\nLONDON, Jan 25 (Reuters) - China is awash with aluminium.\n\"Illegal\" capacity has been closed and smelters in the region around Beijing are, to varying extents, curtailing output to comply with the winter environmental restrictions.\nBut stocks registered with the Shanghai Futures Exchange (ShFE) continue to build. They surged by 653,411 tonnes last year and were up another 30,000 tonnes at a fresh record high of 783,759 tonnes as of last Friday.\nU.S. producer Alcoa told analysts on its Q1 conference call it is forecasting a 1.5-1.7 million tonne surplus in China this year, notwithstanding Beijing's efforts to restrain capacity.\nIt is also forecasting a bigger deficit of 2.0-2.2 million tonnes in the rest of the world, where visible stocks have been falling for many months.\nInventory registered with the London Metal Exchange (LME) is close to multi-year lows at just 840,000 tonnes, discounting metal awaiting physical load-out.\nUnsurprisingly, given such dynamics, the aluminium price in London has been outperforming that in Shanghai.\nEqually unsurprisingly, more Chinese aluminium, in the form of semi-manufactured products, has been starting to move through the arbitrage window. December's tally of 390,000 tonnes was the highest since June 2017.\nThis is how the global aluminium market has historically rebalanced itself, Chinese surplus leaking out as \"semis\".\nTRUMP'S TRADE GUNS\nBut this year could be very different.\nChina's aluminium sector has grown hugely over the last decade, its share of global production rising from 25 percent at the start of 2006 to over 50 percent now.\nThe rest of the world's push-back against this dominance has grown similarly, with the United States taking the lead.\nThe Barack Obama administration filed a formal complaint to the World Trade Organization (WTO) in its dying days, accusing China of subsidising \"certain producers of primary aluminium\".\nUnder the Donald Trump administration, things have accelerated.\nPreliminary duties on Chinese imports of foil were imposed in October last year, provoking a furious reaction from China, which has itself complained to the WTO. A final determination by the U.S. Commerce Department is scheduled for Feb. 23.\nIn November, the Commerce Department took the unusual step of self-initiating an investigation into imports of Chinese aluminium alloy sheet. A formal investigation has just been launched with the blessing of the U.S. International Trade Commission.\nAnd looming larger is the biggest trade gun of them all, the \"Section 232\" investigation into imports of aluminium on national security grounds.\nLaunched hot on the heels of a similar steel probe in May last year, the findings have just landed on the president's desk. He has 90 days to decide what, if any action, to take.\nWill there be tariffs? If so, on what? Ingot or semi-manufactured products? Against China, the largest supplier of semis to the United States? Or against China and others?\nThe jury is very much out.\nGoldman Sachs analysts believe that \"the odds are high for Section 232 to result in tariffs on aluminium imports\". (\"Metals Express\", Jan. 24, 2018)\nWood Mackenzie analysts, on the other hand, expect \"the Section 232 investigation to be shelved\". (\"Aluminium: 5 things to look for in 2018\", January, 2018)\nWood Mackenzie's big caveat, though, is that the foil and sheet anti-dumping cases will likely go ahead.\n\"This could considerably impact global premia and the direction of the flow of metal in the World ex-China,\" it said.\nActually, it may already have started.\nU.S. Imports of Plate, Sheet and Strip - top 10 suppliers:\nhttp://tmsnrt.rs/2p8lD2x\nCHANGING FLOWS\nU.S. imports of primary aluminium and alloy have been booming, up 16 percent at a record 4.52 million tonnes in January-November 2017, according to Wood Mackenzie.\nActing as a magnet is the steady rise in the U.S. Midwest physical premium relative to Europe.\nIn the bullish premium mix are higher freight rates, tax cuts and expectations of elevated defence and infrastructure spending.\nAnd now, what Wood Mackenzie calls a \"rising protectionist stance\" is causing \"traders to build anticipatory inventories\".\nIf imports of both Chinese sheet and foil are hit with penal duties, the knock-on effect could be to increase demand for primary metal in the rest of the world by 500,000 tonnes, the research house calculates.\nStarting with the United States itself, of course.\nChina has a particular problem if the United States slams the door on common alloy sheet, since it has already saturated many markets outside of the United States.\n\"It is unlikely that Chinese suppliers of (sheet) will be able to fully redirect export volumes lost due to the U.S. trade action,\" Wood Mackenzie notes.\nBad news, then, for Chinese sheet manufacturers, but good news for those everywhere else, and good news for those long of physical aluminium in the right place.\nWood Mackenzie expects \"U.S. premia will remain supported at over 10 cents/lb at least over the next six months with traders continuing to shift stocks away from Asian and European warehouses betting on further increases in the US premia ahead of looming duties\".\nRESTARTS?\nOf course, part of any tariff-induced hole in the U.S. aluminium supply chain could be filled by smelter restarts.\nA domestic plant being revived from the dead would, no doubt, be most welcome political news for the Trump administration.\nHowever, the heyday of the U.S. smelter sector is long gone. Power crises in 2001-2002 killed off many West Coast plants, while financial crisis in 2008-2009 did for many of the rest.\nThe number of those left standing continues to dwindle.\nLast month Alcoa announced the permanent closure of its Rockdale smelter in Texas, which had been idle since 2008.\nThe company reversed a similar decision on its Warrick smelter in Indiana last year, but the fact that it \"continues to market for sale more than 30,000 acres of land at the Rockdale site\" doesn't bode well for any last-minute stay of execution.\nThat leaves around 700,000 tonnes of capacity that could, on paper, at least, be reactivated.\nBut the price of power is as important for a restart as the price of aluminium, and that is down to individual smelters' relationship with their local utilities.\nWhile U.S. producers mull their options and Trump mulls the Section 232 report, primary metal trade flows are already starting to adjust.\nChina's exports of semis, meanwhile, are still running strong. But for how much longer?\n(Editing by Kevin Liffey)", "external_links": [], "published": "2018-01-25T17:22:00.000+02:00", "crawled": "2018-01-25T20:44:13.017+02:00", "highlightTitle": ""}