{"organizations": [], "uuid": "6736697a543f72c2114df829da80836139746116", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/04/28/104435340-GettyImages-103157600-copy.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/04/one-of-the-biggest-dow-dogs-of-2017-exxon-may-be-in-for-a-turnaround.html", "country": "US", "domain_rank": 767, "title": "One of the biggest Dow dogs of 2017, Exxon, may be in for a turnaround", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T20:58:00.000+02:00", "replies_count": 0, "uuid": "6736697a543f72c2114df829da80836139746116"}, "author": "Rebecca Ungarino", "url": "https://www.cnbc.com/2018/01/04/one-of-the-biggest-dow-dogs-of-2017-exxon-may-be-in-for-a-turnaround.html", "ord_in_thread": 0, "title": "One of the biggest Dow dogs of 2017, Exxon, may be in for a turnaround", "locations": [], "entities": {"persons": [{"name": "matt maley", "sentiment": "none"}, {"name": "maley", "sentiment": "none"}], "locations": [], "organizations": [{"name": "exxon", "sentiment": "negative"}, {"name": "miller tabak", "sentiment": "none"}, {"name": "exxon mobil", "sentiment": "none"}, {"name": "dow", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Some of the biggest Dow dogs are howling this year, and one market watcher sees further upside ahead for one name in particular: Exxon Mobil .\nAfter falling 7 in 2017, Exxon shares have rallied 4 percent this week. With a dividend yield of 3.54 percent, the stock is one of the biggest Dow dogs; the classic investing theory calls for buying the Dow stocks with the highest dividend yields. \nExxon was positive for the third straight day on Thursday; the energy space appears well-positioned on an intermediate- and long-term basis, said Matt Maley, equity strategist at Miller Tabak, though Exxon is overbought on a near-term basis.\nToward the end of last year, the stock was being \"held down\" by tax loss selling, Maley said, and now it has broken key resistance at $84 per share and has attracted new buyers.\n\"This strong rally has been due to a sudden lack of sellers, not a big influx of buyers. (This can be seen by the fact that volume in XOM has not been significant the past two days.) Since XOM is 22% of the XLE, its big rally of [late] has played an important role in the out-sized rally in the XLE,\" Maley wrote Thursday morning in a note to clients. XLE is a large energy-tracking ETF.\n\"However, we just worry that as the supply/demand equation for XOM normalizes, the rally in XOM & the XLE will subside ... especially since they both are getting over-bought near-term (just like WTI),\" he said.\nIndeed, Exxon is now the most overbought stock in the Dow, according to Bespoke Investment Group research. \nSentiment around energy stocks began turning late last year, said Stacey Gilbert, head of derivative strategy at Susquehanna. She holds a bullish view on the broader energy space.\n\"From a sentiment perspective, we did see investors start to dip their toe in late August, early September, but it really picked up momentum late November. December actually had energy ETFs topping U.S. sector inflows, so there was definitely a lot of positive money moving in in December. From an options perspective, we continue to see upside positioning, particularly in the XLE,\" Gilbert said Wednesday on CNBC's \" Trading Nation .\"\nFrom a fundamental perspective, companies that have exposure to U.S. land are attractive, Gilbert added.\nShares of Exxon were higher Thursday.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nDisclaimer", "external_links": [], "published": "2018-01-04T20:58:00.000+02:00", "crawled": "2018-01-04T20:23:44.009+02:00", "highlightTitle": ""}