{"organizations": [], "uuid": "a66e86537ded13caf9083d9f139562cc1a3a176f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/09/28/103976295-GettyImages-470976137r.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/if-the-markets-drop-turns-into-a-correction-history-says-hide-out-in-gold-bonds.html", "country": "US", "domain_rank": 767, "title": "If the market's drop turns into a correction, history says hide out in gold, bonds", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.023, "site_type": "news", "published": "2018-01-30T21:42:00.000+02:00", "replies_count": 0, "uuid": "a66e86537ded13caf9083d9f139562cc1a3a176f"}, "author": "Thomas Franck", "url": "https://www.cnbc.com/2018/01/30/if-the-markets-drop-turns-into-a-correction-history-says-hide-out-in-gold-bonds.html", "ord_in_thread": 0, "title": "If the market's drop turns into a correction, history says hide out in gold, bonds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "cboe volatility", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "spdr gold trust", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Venture Capital If the market's drop turns into a correction, history says hide out in gold, bonds CNBC looked at all the times in the last 10 years when the Cboe Volatility index jumped 5 points in five days to see which ETFs outperformed during this period. In such instances, the iShares 20+ Year Treasury Bond ETF (TLT) has averaged a 2.1 percent gain. Gold also tends to outperform in times of market anxiety. CNBC.com Gabriel Bouys | AFP | Getty Images \nWhen the market falls and volatility rises, investors should hide in bonds and gold, according to CNBC analysis using hedge fund analytics tool Kensho. \nCNBC found the exchange-traded funds that outperformed during periods when the Cboe Volatility index (VIX) – the market's fear gauge – jumped five points in five days. This kind of volatility surge (like the one beginning this week) has occurred 59 times the last 10 years. \nThe iShares 20+ Year Treasury Bond ETF (TLT) has averaged a 2.1 percent gain during such a move in the VIX, according to analysis using Kensho . \nInvestors may seek the safety of treasury bonds during times of stock market turmoil. \nThe findings also show gold outperformed in times of rising volatility. Both the iShares Gold Trust and the SPDR Gold Trust rose 0.9 percent on average during a five-point gain in the VIX in five days. show chapters 3 Hours Ago | 04:26 \nInvestors may start looking for safe havens if the stock market's drop Tuesday continues into the rest of the week. The Dow Jones industrial average fell as much as 400 points in its single-worst day (as measured in points) since June 2016; on a percent basis, the Dow was having its worst day since May. The S&P 500 fell 1 percent Tuesday. \nThe VIX peaked at 15.42 Tuesday, reaching its highest level since August. A move of 5 points would take it over the key 20 threshold watched by many traders. \nDisclosure: NBCUniversal, parent of CNBC, is a minority investor in Kensho.", "external_links": [], "published": "2018-01-30T21:42:00.000+02:00", "crawled": "2018-01-30T21:43:11.010+02:00", "highlightTitle": ""}