{"organizations": [], "uuid": "c1a0f802fd3a8377fb11bcae7af139e8113be0c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/15/104902081-RTX3MBBU.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/one-stock-analysts-10-trillion-bull-case-for-cryptocurrencies.html", "country": "US", "domain_rank": 767, "title": "One stock analyst's $10 trillion bull case for cryptocurrencies", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.781, "site_type": "news", "published": "2018-01-04T14:01:00.000+02:00", "replies_count": 0, "uuid": "c1a0f802fd3a8377fb11bcae7af139e8113be0c8"}, "author": "Evelyn Cheng", "url": "https://www.cnbc.com/2018/01/03/one-stock-analysts-10-trillion-bull-case-for-cryptocurrencies.html", "ord_in_thread": 0, "title": "One stock analyst's $10 trillion bull case for cryptocurrencies", "locations": [], "entities": {"persons": [{"name": "mitch steves", "sentiment": "none"}, {"name": "steves", "sentiment": "none"}], "locations": [{"name": "vilnius", "sentiment": "none"}, {"name": "lithuania", "sentiment": "none"}], "organizations": [{"name": "rbc", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "rbc capital markets", "sentiment": "none"}, {"name": "ints kalnins | reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Cryptocurrencies and the blockchain technology underlying them could become a $10 trillion market in 15 years, RBC Capital Markets analyst Mitch Steves says.\nThat's more than 13 times larger than the roughly $730 billion value of cryptocurrencies today, according to CoinMarketCap. \n\"By utilizing decentralized computing and opensource software, we see a multi-trillion dollar market emerging,\" Steves, who also covers semiconductor stocks for RBC, said in a Wednesday report.\nHe told CNBC in a phone interview that his $10 trillion estimate comes from taking one-third of the roughly $30 trillion in assets held in offshore funds and gold, as investors embrace digital currencies as a new store of value.\nMarket capitalization of all cryptocurrencies (2013 -2018) \n\nSource: CoinMarketCap \nThe most well-known digital currency today is bitcoin , which has grown rapidly over the last several months into a cryptocurrency with a market cap of more than $250 billion. Digital currency proponents say the greater potential lies in the blockchain technology behind bitcoin. Blockchain creates a rapid, permanent and open record of transactions between two parties, thereby eliminating the need for a central party, such as a bank. \nBitcoin became the first application of blockchain technology nearly a decade ago, and in the last several years developers have used the technology to create other digital coin systems. Some, like ethereum, allow other developers to easily create applications on the network. Other applications of blockchain technology create tokens that can be used to access the network's services, such as cloud storage or trading. \nAll these applications can create the next generation of the internet, or a \"world computer,\" the value of which could rise into the trillions of dollars, Steves said in the report. \nHowever, the growth of cryptocurrencies comes with very high risks. \nSteves pointed out in his report that many storage systems for bitcoin are hackable, and governments have no incentive to catch thieves of a currency not recognized as legal tender. Transactions are also often easily traceable. \n\nFinally, the RBC analyst noted that some cryptocurrencies as they exist today face challenges of being able to scale, and are subject to cyberattacks or manipulation.", "external_links": [], "published": "2018-01-04T14:01:00.000+02:00", "crawled": "2018-01-04T14:03:03.020+02:00", "highlightTitle": ""}