{"organizations": [], "uuid": "ba9d05b7ccc2602634152c3d9ab07822596bbdce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-children-takeaway-meals/regular-carry-out-meals-linked-to-higher-body-and-blood-fats-in-kids-idUKKBN1EQ17D", "country": "US", "domain_rank": 408, "title": "Regular carry-out meals linked to higher body and blood fats in kids", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T20:42:00.000+02:00", "replies_count": 0, "uuid": "ba9d05b7ccc2602634152c3d9ab07822596bbdce"}, "author": "", "url": "https://uk.reuters.com/article/us-health-children-takeaway-meals/regular-carry-out-meals-linked-to-higher-body-and-blood-fats-in-kids-idUKKBN1EQ17D", "ord_in_thread": 0, "title": "Regular carry-out meals linked to higher body and blood fats in kids", "locations": [], "entities": {"persons": [{"name": "donin", "sentiment": "none"}, {"name": "angela donin", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "archives of disease in childhood", "sentiment": "none"}, {"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "st. george", "sentiment": "none"}, {"name": "university of london", "sentiment": "none"}, {"name": "shereen lehman", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 1, 2018 / 6:43 PM / Updated 2 hours ago Regular carry-out meals linked to higher body and blood fats in kids Shereen Lehman 5 Min Read \n(Reuters Health) - Children who eat restaurant carry-out, or “takeaway,” meals once a week or more tend to have extra body fat and long-term risk factors for heart disease, suggests a UK study. \nIn the study of 9- and 10-year-olds, the kids who ate carry-out most often also consumed more calories but fewer vitamins and minerals compared with kids who rarely or never ate carry-out food, the authors report in Archives of Disease in Childhood. \n“Frequent consumption of takeaway foods could potentially be increasing children’s risk of future coronary heart disease and type 2 diabetes by increasing their LDL cholesterol and body fat,” lead author Angela Donin told Reuters Health in an email. \n“Takeaway outlets are increasing, as is consumption with more than half of teenagers reporting eating takeaways at least twice a week,” said Donin, a researcher at St. George’s, University of London. \nIn adults, regular consumption of carry-out meals is associated with higher risk of obesity, coronary heart disease and type 2 diabetes, but little is known about the effects it may be having on children’s health, Donin said. \n“We, therefore, wanted to see how much takeaway food children were eating and if there were any effects on their health.” \nThe researchers analyzed data from the Child Heart and Health Study in England, which looked at potential risk factors for heart disease and diabetes in pre-teens. Participants included about 2,000 kids aged 9 and 10 years at 85 primary schools in three cities: London, Birmingham and Leicester. \nThe children answered questions about their usual diets, including how often they ate carry-out meals purchased from restaurants. Foods purchased at convenience stores or grocery stores were not included in the category. Photos of common foods were provided to help the kids recall and estimate portion sizes. \nAbout one quarter of the children said they never or rarely ate carry-out meals and nearly half said they ate carry-out less than once per week. Just over one quarter said they ate these kinds of meals at least once per week. \nBoys were more frequent consumers of carry-out meals than girls, as were children from less affluent backgrounds. \nThe study team used the kids’ dietary responses to calculate calorie counts and nutrient intake. Among regular consumers of carry-out meals, the foods eaten were higher-calorie and higher-fat, while protein and starch intake was lower and intake of vitamin C, iron, calcium and folate was also lower compared with kids who didn’t eat these types of meals. \nResearchers also measured the children’s height, weight, waist circumference, skinfold thickness and body-fat composition. In addition, they measured blood pressure and took blood samples for cholesterol levels. \nThere were no differences in blood pressure or how well the kids’ bodies used insulin based on who regularly ate carry-out meals. But skinfold thickness, body fat composition and blood fats like LDL (bad) cholesterol all tended to be higher in regular consumers of carry-out meals. \n“Children who ate more takeaway meals had higher total and LDL cholesterol (both important risk factors for coronary heart disease) and body fat.,” Donin said. \n“Most people who order takeout usually purchase fast food, which is high in sodium, fat, and calories,” noted Sandra Arevalo, who wasn’t involved in the study. \n”Fast-food also has low nutritional value, which means it is low in vitamins, minerals, fiber and sometimes protein,” said Arevalo, a registered dietician who directs Nutrition Services and Community Outreach at Community Pediatrics, a program of Montefiore and The Children’s Health Fund, in New York. “If you eat these meals over a long period of time you can start seeing the health consequences associated with it.” \nArevalo recommends parents who need to bring home a meal, call the restaurant ahead of time to order salads, vegetables, brown rice, grilled meats and to provide a healthier meal for their children. \n“The price might be a deterrent but you can cut portions in half and get two meals out of one large one,” she said by email. Another idea is to learn to prepare quick and healthy meals. \n“For example, hummus, carrots, and crackers make a great lunch, as well as a tuna or turkey sandwich with lettuce and tomatoes. Eggs are an excellent source of protein, you can scramble an egg with spinach, onions, and tomatoes and have it with a toast,” she said. \nSOURCE: bit.ly/2BGZnnD Archives of Disease in Childhood, online December 3, 2017.", "external_links": [], "published": "2018-01-01T20:42:00.000+02:00", "crawled": "2018-01-01T21:13:44.021+02:00", "highlightTitle": ""}