{"organizations": [], "uuid": "bae79ab09e997416c078ff1b971a96e24f88e442", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-growprocess-announces-plan-to-launch-aphytocoina-cannabis-commodity-backed-initial-coin-offering-ico.html", "country": "US", "domain_rank": 767, "title": "Growprocess Announces Plan to Launch “Phytocoin”, Cannabis Commodity Backed Initial Coin Offering (ICO)", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.011, "site_type": "news", "published": "2018-01-25T19:57:00.000+02:00", "replies_count": 0, "uuid": "bae79ab09e997416c078ff1b971a96e24f88e442"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-growprocess-announces-plan-to-launch-aphytocoina-cannabis-commodity-backed-initial-coin-offering-ico.html", "ord_in_thread": 0, "title": "Growprocess Announces Plan to Launch “Phytocoin”, Cannabis Commodity Backed Initial Coin Offering (ICO)", "locations": [], "entities": {"persons": [{"name": "phytocoin", "sentiment": "none"}, {"name": "matt hrovat", "sentiment": "none"}, {"name": "growprocess", "sentiment": "none"}], "locations": [{"name": "ma", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "phytocoin", "sentiment": "none"}, {"name": "slovenia", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Company Looks to Raise up to $10 Million Through ICO\nBOSTON, MA, Jan. 25, 2018 (GLOBE NEWSWIRE) -- Growprocess, Inc. (\"Growprocess\" or \"the Company\"), a privately held Blockchain and cannabis compliance advisory firm, is pleased to announce that the company is preparing to launch its cannabis-derivative, commodity-backed token called Phytocoin. The Company looks to raise up to $10 Million through its Initial Coin Offering (ICO) anticipated to launch in early 2018. Unlike a conventional ICO token, Phytocoin will be backed by underlying assets in a strategy designed to cut down on the inherent volatility and risk of a non-collateralized token. According to the Company, a white paper detailing the investment parameters will be available online within the coming 45 days.\nMr. Matt Hrovat, Chief Executive Officer of Growprocess, commented, “As a company, we are moving rapidly to deploy our growth strategy for 2018. We are securing a ten-acre estate in Slovenia that currently has three acres of greenhouses. This facility will be used for commercial hemp production and is expected to be ready for the 2018 grow season commencing this spring. Production is anticipated to yield approximately ten tons of hemp flowers with a (B2C) value of $8-10 million dollars. This production, and the underlying CBD oil, will form the initial backbone of our tokenized offering. Moving ahead, we look to double production for 2019. Our European CBD production will then be combined with the anticipated license and future medical cannabis production from South Africa, where our partner, Protext Pharma, Inc. (TXTM), is operating, to further enhance the value of our tokens.”\nMr. Hrovat added, “For the past several years, I have been focused on building a successful CBD oil and edibles business including gourmet CBD-infused chocolates, all under the Papilo™ brand name. We are currently looking to potentially roll that business into Growprocess in order to fully integrate the business and use the Slovenia estate for full CBD production, including oil extraction and finished product, to supply the Company’s Papilo™ product line. Our goal for 2018-2019 is to expand our product offerings and sales while also vertically integrating all aspects of production to ensure quality and stability of supply for our customers. The ICO proceeds will be used to bring us into full production, from growing medical-grade hemp, to extraction, to finished goods manufacture and packaging. We will also be using a portion of the proceeds to fund the research and development of Protext Pharma, who will be finishing the development of a full-profile medical cannabis extract for pharmaceutical applications. This extract is expected to include the acid-form precursor cannabinoids THC-A and THC-B together with the CBD precursors in a non-psychoactive complex. Pending approval to commence operations from the South African government, this medical cannabis production should commence in the first part of 2018.”\nThe Company also released that, over the coming 30 days, they will be finalizing the legal and marketing components of the ICO while also building a team of ICO advisors to assist with the token launch. “We want this offering to be seamless,” Mr. Hrovat stated. “We believe strongly in the medical benefits of our product and want Phytocoin to be reflective of this dedication. For us, it is best to have all aspects of our operations and the ICO in place, then move forward decisively so that investors can have confidence in their management team and be assured that we take seriously our role as stewards of not only their investment but also the technology entrusted to our care. The Company is anticipating announcing some of its ICO advisors very soon, and next week I will be posting a video update on social media discussing our plans and expectations for the next 90 days, leading into our launch of Phytocoin.”\nAbout Growprocess:\nGrowprocess is developing a next generation of seed-to-sale Blockchain ledger platform for the legal cannabis industry, as well as a European-based CBD business. The Company’s platform will enable growers and dispensaries to streamline their operations and optimize their profit margins. Simultaneously, the Company seeks to produce pharmaceutical-grade cannabis products backed by clinical research.\nFor further information please visit: http://growprocess.co https://twitter.com/growprocessco\nAbout Protext Pharma, Inc.\nProtext Pharma operates two wholly owned subsidiaries; Plandai Biotechnology South Africa (Pty) Ltd. and Cannabis Biosciences, Inc. The Company is engaged in the research, clinical testing and commercialization of highly bioavailable botanical products—all-natural ingredients formulated for pharmaceutical applications and produced under pharma-grade conditions. Please visit http://www.protextm.co for further information.\nSafe Harbor Statement\nThis release contains forward-looking statements that are based upon current expectations or beliefs, as well as a number of assumptions about future events. Although we believe that the expectations reflected in the forward-looking statements and the assumptions upon which they are based are reasonable, we can give no assurance or guarantee that such expectations and assumptions will prove to have been correct. Forward-looking statements are generally identifiable by the use of words like \"may,\" \"will,\" \"should,\" \"could,\" \"expect,\" \"anticipate,\" \"estimate,\" \"believe,\" \"intend,\" or \"project\" or the negative of these words or other variations on these words or comparable terminology. The reader is cautioned not to put undue reliance on these forward-looking statements, as these statements are subject to numerous factors and uncertainties, including but not limited to: adverse economic conditions, competition, adverse federal, state and local government regulation, international governmental regulation, inadequate capital, inability to carry out research, development and commercialization plans, loss or retirement of key executives and other specific risks. To the extent that statements in this press release are not strictly historical, including statements as to revenue projections, business strategy, outlook, objectives, future milestones, plans, intentions, goals, future financial conditions, events conditioned on stockholder or other approval, or otherwise as to future events, such statements are forward-looking, and are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. The forward-looking statements contained in this release are subject to certain risks and uncertainties that could cause actual results to differ materially from the statements made. The company disclaims any obligation to update information contained in any forward-looking statement. This press release shall not be deemed a general solicitation.\nGrowprocess, Inc. info@growprocess.co\nSource:Growprocess, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=fPVtNw75cSsrhnSHaMqe_aJ_st9D6C9Q2i9OKD4Rgrhd6nkdz_jpxiV3cZPdA_TRDvw7bc0PYCjBTNczazcFUQoU_d_BszKJUu1bDUb_BFc=", "https://twitter.com/growprocessco"], "published": "2018-01-25T19:57:00.000+02:00", "crawled": "2018-01-25T20:37:24.000+02:00", "highlightTitle": ""}