{"organizations": [], "uuid": "88b3fb755787f8479ab7a9e9c7e0acba7ba3ce70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/business-wire-liberty-bancorp-inc-announces-agreement-to-acquire-lawson-financial-corp.html", "country": "US", "domain_rank": 767, "title": "Liberty Bancorp, Inc. Announces Agreement to Acquire Lawson Financial Corp.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.013, "site_type": "news", "published": "2018-01-13T00:00:00.000+02:00", "replies_count": 0, "uuid": "88b3fb755787f8479ab7a9e9c7e0acba7ba3ce70"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/business-wire-liberty-bancorp-inc-announces-agreement-to-acquire-lawson-financial-corp.html", "ord_in_thread": 0, "title": "Liberty Bancorp, Inc. Announces Agreement to Acquire Lawson Financial Corp.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KANSAS CITY, Mo. & LAWSON, Mo.--(BUSINESS WIRE)-- Liberty Bancorp, Inc. (OTC-Pink:LBCP), the holding company for BankLiberty, and Dr. Stephen McCray, Chairman of Lawson Financial Corp., reported an agreement whereby Liberty Bancorp, Inc. will purchase all the stock of Lawson Financial Corp. As a result of this agreement Lawson Bank will be merged into BankLiberty. Lawson Bank is headquartered in Lawson, Missouri, with branches in Kansas City, Excelsior Springs, and Gladstone, Missouri. Lawson Bank had total assets of $125.5 million as of September 30, 2017.\n“The decision to sell was not an easy one but I am pleased that our customers will continue to be served by a community bank that shares our passion for helping local households and businesses,” said McCray.\nEstablished in 1955, BankLiberty is a community bank with existing branches in Kansas City, Parkville, Liberty, North Kansas City, Riverside, Gladstone, Claycomo, Platte City, and Independence.\nBrent Giles, President and CEO of BankLiberty, stated, “BankLiberty is excited to be able to provide Lawson Bank’s customers with the friendly community bank service they expect along with cutting-edge services that make business and life easier. This move fits very well with our core growth and service throughout the Northland. We look forward to further executing our plan of building a financially strong bank through prudent and creative solutions for our customers.”\nLiberty Bancorp (LBCP) is the holding company for BankLiberty, which is a full-service community bank offering deposit and loan services for businesses, families and individuals. With assets of $452.3 million as of September 30, 2017, BankLiberty has recently been named one of the strongest midsize banks in Kansas City by the Kansas City Business Journal, and has a four-star rating from BauerFinancial.\n“We think this is going to be a wonderful combination of two well respected financial institutions. We look forward to working with the customers and staff of Lawson Bank,” said Giles.\nThe transaction is expected to close in the second quarter of 2018, subject to approval by bank regulatory authorities as well as the satisfaction of other customary closing conditions. Raymond James & Associates, Inc. is acting as financial advisor to Liberty Bancorp, Inc. and Stinson Leonard Street LLP is serving as its legal counsel. The Capital Corporation is acting as financial advisor to Lawson Financial Corp. and Lathrop Gage LLP is serving as its legal counsel.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180112005642/en/\nLiberty Bancorp, Inc.\nBrent M. Giles, 816-792-6610\nPresident and CEO\nBankLiberty\nbrent.giles@banklibertykc.com\nSource: Liberty Bancorp, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180112005642/en/"], "published": "2018-01-13T00:00:00.000+02:00", "crawled": "2018-01-13T02:07:33.064+02:00", "highlightTitle": ""}