{"organizations": [], "uuid": "4fadfbd3f46df0b796f6253eb986f16143ff921f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-lectra-lectra-appoints-akihiko-tanaka-as-managing-director-of-lectra-japan.html", "country": "US", "domain_rank": 767, "title": "LECTRA: Lectra appoints Akihiko Tanaka as Managing Director of Lectra Japan", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.042, "site_type": "news", "published": "2018-01-16T19:48:00.000+02:00", "replies_count": 0, "uuid": "4fadfbd3f46df0b796f6253eb986f16143ff921f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-lectra-lectra-appoints-akihiko-tanaka-as-managing-director-of-lectra-japan.html", "ord_in_thread": 0, "title": "LECTRA: Lectra appoints Akihiko Tanaka as Managing Director of Lectra Japan", "locations": [], "entities": {"persons": [{"name": "akihiko tanaka", "sentiment": "negative"}, {"name": "lectra japan akihiko ta", "sentiment": "negative"}], "locations": [{"name": "lectra japan", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "osaka", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "lectra", "sentiment": "none"}, {"name": "asean", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FOR IMMEDIATE RELEASE\nLectra appoints Akihiko Tanaka as Managing Director of Lectra Japan\nAkihiko Tanaka's role is to support Lectra's Japanese customers as they undergo the transformation towards Industry 4.0\nParis, January 16, 2018 - Lectra, the technological partner for companies using fabrics and leather, is pleased to announce the appointment of Akihiko Tanaka to the role of Managing Director, Lectra Japan. Based in Osaka, Akihiko Tanaka's role is to support Lectra's Japanese fashion & apparel and automotive customers as they undergo transformations related to Industry 4.0.\nFor over 30 years, Lectra has given prestigious names in the fashion industry in the archipelago and Original Equipment Manufacturers (OEMs) the means to meet their ambitions in global markets.\n\"Japan's automotive industry is one of the most important in the world: its ecosystem radiates internationally. I am proud to promote Lectra's solutions, designed to facilitate the co-ordination of all actors in the production chain, whether they are based in Japan, the ASEAN countries, Europe or North America,\" states Akihiko Tanaka. \"Japan is also a land of fashion, which benefits from an active local market and also has a strong position on the world stage. Our solutions, rooted at the heart of our customers' transformation, enable them to respond rapidly to both the digitalization of their respective industries and to their evolving relationships with consumers.\"\n\"Akihiko Tanaka's international experience, and his robust knowledge of technological professions, are a major asset to reinforce our value proposition,\" underlines Daniel Harari, Lectra Chairman and CEO. \"The major challenge facing our Japanese customers is accelerating development cycles for their products within a fast-evolving automotive market and a fashion industry on a quest for greater agility.\"\nAkihiko Tanaka has over 20 years of experience as a Sales Director in the automotive and electronic industries. From 1994 to 2000, he worked in France as Sales Director of Matsushita Electric Industrial (Panasonic) in charge of commercializing automation equipment to the automotive and electronic industries, and then went back to Japan in early 2000. In 2001, he joined INCS, a consulting and engineering company, to develop the footprint of a 3D CAD offer, initially within Japanese markets, then elsewhere in Asia, and Europe. In 2005, Akihiko Tanaka joined Dassault Systèmes where he successively held the roles of Business Developer for PLM solutions, then Sales and Marketing Director for the design solution 3D CATIA, and finally as Director, academic programs.\nAkihiko Tanaka has a bachelor's degree in sociology from Hitotsubashi in Japan. He also followed the Concordia program delivered by ESCP Europe.\nAbout Lectra\nFor companies that breathe life into our wardrobes, car interiors, furniture and more, Lectra is crafting the premium technologies that facilitate the digital transformation of their industry. Lectra's offer empowers brands and manufacturers from design to production, providing them with the market respect and peace of mind they deserve. Founded in 1973, today Lectra has 32 subsidiaries across the globe, serving customers in over 100 countries. With more than 1,600 employees, Lectra reported revenues of $288 million in 2016. Lectra is listed on Euronext (LSS).\nFor more information, please visit www.lectra.com\nContact - Lectra Headquarters / Press Dept.: Nathalie Fournier-Christol\nE-mail: n.fournier-christol@lectra.com\nTel.: +33 (0)1 53 64 42 37 - Fax: +33 (0)1 53 64 43 40\nAttachments:\nhttp://www.globenewswire.com/NewsRoom/AttachmentNg/8882226b-c42c-45fe-adcf-4138055f8c5c\nSource: LECTRA", "external_links": ["https://www.globenewswire.com/Tracker?data=0rrZdmdomtwYc74Q0CAm7Xe3BbqKaSelS-EEJwJC1PF5v_LJ_wPnNfKzW3JgtT_E2Aly633a4SHHlx9bBgIfAgiarshF0Fht30LnuVigq6s01wHJVvSDYrHjtrklVyC8", "http://www.globenewswire.com/NewsRoom/AttachmentNg/8882226b-c42c-45fe-adcf-4138055f8c5c", "https://www.globenewswire.com/Tracker?data=DzD_t8KX6szWWve90CvKAKs_16VRg_BdeTcIqtM63qWzwIYv1E3YGbWnRf-6ZIGksju6M_HJ49YTj-MLHaZzVVSCu66neG1rKSHANESW0ufRxTCZWy1ffZdIbovmCg0I-_LW7A82XFjwE-dY7BmfBalekQY5BYd6qDs5gChwNiI-5USMZzsf4IQwKbLpGmvB2UGfYerHe5iC2HP8jfDjWGupFeMimAgADVt2nsP1-1R8xK2gZCKEa6qg2f9Sd9zbrRD2vk5faoyBzH1CTotjEg==", "https://www.globenewswire.com/Tracker?data=LkeLLAejOmi3OUTN4TBKzsnbA4t4jPfjwH9JygtYp4f0PLQU6SlfBLGLbFzgkpJb5uZcuPXR8bNbuOLdIzqKQg=="], "published": "2018-01-16T19:48:00.000+02:00", "crawled": "2018-01-16T21:15:21.044+02:00", "highlightTitle": ""}