{"organizations": [], "uuid": "0c7f6d466434a46d8e3e4c6b6f6f34ccf9a4aa7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-midland-states-bancorp-announces-new-leadership-rebranding-and-expansion-of-its-equipment-leasing-business.html", "country": "US", "domain_rank": 767, "title": "Midland States Bancorp Announces New Leadership, Rebranding and Expansion of its Equipment Leasing Business", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.059, "site_type": "news", "published": "2018-01-09T00:05:00.000+02:00", "replies_count": 0, "uuid": "0c7f6d466434a46d8e3e4c6b6f6f34ccf9a4aa7c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-midland-states-bancorp-announces-new-leadership-rebranding-and-expansion-of-its-equipment-leasing-business.html", "ord_in_thread": 0, "title": "Midland States Bancorp Announces New Leadership, Rebranding and Expansion of its Equipment Leasing Business", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "EFFINGHAM, Ill., Jan. 08, 2018 (GLOBE NEWSWIRE) -- Midland States Bancorp, Inc. (NASDAQ:MSBI) announced today that Fred Van Etten has joined Midland as President of the Company’s equipment finance business. Mr. Van Etten joins Midland from Scottrade Financial Services, Inc., where he served as President of Scottrade Bank Equipment Finance. Midland also announced that Heartland Business Credit, its equipment leasing subsidiary, will be rebranded as Midland Equipment Finance and operated as a division of Midland States Bank.\nLeon J. Holschbach, Chief Executive Officer of the Company, said, “Since acquiring Heartland Business Credit as part of the Heartland Bank acquisition at the end of 2014, we have grown our leasing portfolio from approximately $115 million to more than $200 million today. Now we are ready to further expand our equipment financing business as we continue to manage the overall growth of our balance sheet. This expansion reflects our emphasis on the lending areas that generate the most attractive risk-adjusted returns.”\nMidland also expects to further its equipment finance team through the addition of a group of equipment finance professionals that worked with Mr. Van Etten at Scottrade. Midland Equipment Finance will be headquartered in Clayton, Missouri.\nHolschbach also said, “We are very pleased to welcome Fred and his group to Midland. Following the sale of Scottrade to TD Ameritrade, Fred and his team became available. Fred has a long track record of running highly productive equipment financing businesses. Not only will the size of our equipment financing team expand, but we will also expand our offerings to include loans, leases and hybrid products to better serve the needs of this market. And bringing our equipment financing operations more squarely into our banking footprint will allow our bankers to offer additional financing and leasing options to our business customers.”\nMr. Van Etten has more than 30 years of financial services industry experience. In 2012, Mr. Van Etten helped found Scottrade Bank Equipment Finance and served as President of that business until the sale of Scottrade to TD Ameritrade in September 2017. Prior to joining Scottrade, he held a number of other leadership positions in the equipment financing industry. He has received his M.B.A. from Pepperdine University, The George L. Graziadio School of Business and Management, and his bachelor’s degree in business administration from Arizona State University at the W.P. Carey School of Business.\nAbout Midland States Bancorp, Inc.\nMidland States Bancorp, Inc. is a community-based financial holding company headquartered in Effingham, Illinois, and is the sole shareholder of Midland States Bank. As of September 30, 2017, the Company had total assets of $4.3 billion and its Wealth Management Group had assets under administration of approximately $2.0 billion. Midland provides a full range of commercial and consumer banking products and services, merchant credit card services, trust and investment management, and insurance and financial planning services. In addition, commercial equipment financing is provided through Midland Equipment Finance, and multi-family and healthcare facility FHA financing is provided through Love Funding, Midland’s non-bank subsidiaries. For additional information, visit www.midlandsb.com or follow Midland on LinkedIn at https://www.linkedin.com/company/midland-states-bank .\nSpecial Note Concerning Forward-Looking Statements\nReaders should note that in addition to the historical information contained herein, this press release includes \"forward-looking statements,\" including but not limited to statements about the Company’s expected loan production, operating expenses and future earnings levels. These statements are subject to many risks and uncertainties, including changes in interest rates and other general economic, business and political conditions, including changes in the financial markets; changes in business plans as circumstances warrant; and other risks detailed from time to time in filings made by the Company with the Securities and Exchange Commission. Readers should note that the forward-looking statements included in this press release are not a guarantee of future events, and that actual events may differ materially from those made in or suggested by the forward-looking statements. Forward-looking statements generally can be identified by the use of forward-looking terminology such as \"will,\" \"propose,\" \"may,\" \"plan,\" \"seek,\" \"expect,\" \"intend,\" \"estimate,\" \"anticipate,\" \"believe\" or \"continue,\" or similar terminology. Any forward-looking statements presented herein are made only as of the date of this press release, and we do not undertake any obligation to update or revise any forward-looking statements to reflect changes in assumptions, the occurrence of unanticipated events, or otherwise.\nCONTACTS:\nDouglas J. Tucker, Sr. V.P., Corporate Counsel, at dtucker@midlandsb.com or (217) 342-7321\nSource:Midland States Bancorp, Inc.", "external_links": ["https://www.linkedin.com/company/midland-states-bank", "https://www.globenewswire.com/Tracker?data=pXwFVPEUd8H13oBOjp4y1N4vgtVDrXwjs9mN6i9Vbz-O0d55G9KaR1I340KNKmZm8SEQOKrsiwCrvSpWjbIB0xA8SAF5Hs6vwJ9v4C2Kg3s=", "https://www.globenewswire.com/Tracker?data=VPUEh2FJtGo_avQ3whxenzLC5QJX0li-6DV2gs7i0f7_CQrbTNZskRl3tdsRMshNrHhMMLcrChG1uWT6YAr6yQ==", "https://www.globenewswire.com/Tracker?data=jyfrsIIPYgZUGKL_qy1xChF4N7nXkzbbJCI87sG1_27uYPb6zCe1-YYhtS8Gvv2seWiYReAmigYa8NbIZKMqjgJjHi-5ODZK7Pms95gqD8C6F1lskUQAVq7u5q_5STuQIzdcXYgW6YLgjLxvRRN22UNsKsJBx989hTewtRZ5OmM=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/c23ea7fd-a346-4531-a814-5ff25e8f32d4"], "published": "2018-01-09T00:05:00.000+02:00", "crawled": "2018-01-09T09:40:29.365+02:00", "highlightTitle": ""}