{"organizations": [], "uuid": "bad642fcd1d879445a2565e223fe2c01c49a6cf7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/09/reuters-america-health-secretary-nominee-indicates-support-for-medicaid-overhaul.html", "country": "US", "domain_rank": 767, "title": "Health secretary nominee indicates support for Medicaid overhaul", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T21:44:00.000+02:00", "replies_count": 0, "uuid": "bad642fcd1d879445a2565e223fe2c01c49a6cf7"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/09/reuters-america-health-secretary-nominee-indicates-support-for-medicaid-overhaul.html", "ord_in_thread": 0, "title": "Health secretary nominee indicates support for Medicaid overhaul", "locations": [], "entities": {"persons": [{"name": "alex azar", "sentiment": "negative"}, {"name": "obamacare", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "azar", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "medicaid", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "senate finance committee", "sentiment": "none"}, {"name": "u.s. department of health and human services", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan 9 (Reuters) - Alex Azar, a former drug industry executive and lobbyist nominated to run the U.S. Department of Health and Human Services, indicated on Tuesday he supported a Republican bid to overhaul Medicaid and again vowed to tackle high drug prices.\nAzar appeared before the Senate Finance Committee on Tuesday, which will ultimately decide whether to move his nomination forward. Azar also vowed to uphold Obamacare as long as it remained the law but said that the program needed changes.\n\"I believe I have a very important obligation to make the program work as well as possible,\" Azar said during the wide-ranging hearing that lasted more than two hours. \"What we have now is not working for people.\"\nRepublicans have been trying to dismantle the 2010 Affordable Care Act, former President Barack Obama's signature domestic policy achievement. Repealing and replacing Obamacare was one of President Donald Trump's most frequently repeated campaign promises but Congress has repeatedly tried and failed to do so.\nAzar said he favored elements of a Republican Senate Obamacare repeal bill that failed to garner enough support last year, which would have fundamentally restructured Medicaid, the government insurance program for the poor and disabled.\nThe doomed measure proposed repealing enhanced federal funding for Medicaid under Obamacare and instead providing block grants to states based on the number of enrollees in each state. The block grants, coupled with the repeal of Medicaid expansion, would slash funding to the 31 states that expanded the government program under Obamacare.\nAzar said he supported that element of the legislation because it would provide states more flexibility in deciding how to run their Medicaid programs. Some Republican lawmakers have floated the idea of taking on Medicaid reform as a legislative priority this year.\nAzar spent about a decade at Eli Lilly & Co, including five years as president of its U.S. unit. Democrats on Tuesday pointed to a handful of Lilly drugs whose prices more than doubled under Azar's watch and fiercely questioned how seriously he would work to make prescription drugs more affordable.\nDuring the questioning, Azar did not dismiss the possibility of allowing Medicare, the government health program for the elderly, to negotiate drug prices, a favored proposal among Democrats.\nAzar vowed to work with Republicans and Democrats on his four top priorities: drug pricing, making healthcare more affordable and helping people who cannot purchase insurance on the Obamacare market, Medicare reform and the opioid epidemic.\nSenator Ron Wyden, the top-ranking Democrat on the committee, said Azar's promise to work on a bipartisan basis was a welcome change from the previous health secretary, Tom Price, who Wyden said did not work with Democrats.\nPrice, a former U.S. Republican Representative, resigned in September amid a furor over his use of expensive taxpayer-funded private charter jets for government travel. (Reporting by Yasmeen Abutaleb; Editing by Jeffrey Benkoe)", "external_links": [], "published": "2018-01-09T21:44:00.000+02:00", "crawled": "2018-01-09T22:17:57.011+02:00", "highlightTitle": ""}