{"organizations": [], "uuid": "9d3559babdcd5d5d451d1f5ff19497f1c2895d22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/06/104571171-GettyImages-588253844.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/after-500-million-japan-cryptocurrency-theft-heres-how-to-keep-yours-secure.html", "country": "US", "domain_rank": 767, "title": "After $500 million Japan cryptocurrency theft, here's how to keep yours secure", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.5, "site_type": "news", "published": "2018-01-29T16:28:00.000+02:00", "replies_count": 0, "uuid": "9d3559babdcd5d5d451d1f5ff19497f1c2895d22"}, "author": "Annie Nova", "url": "https://www.cnbc.com/2018/01/29/after-500-million-japan-cryptocurrency-theft-heres-how-to-keep-yours-secure.html", "ord_in_thread": 0, "title": "After $500 million Japan cryptocurrency theft, here's how to keep yours secure", "locations": [], "entities": {"persons": [{"name": "eric larcheveque", "sentiment": "none"}, {"name": "ledger wallet  bitcoin", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "mccann investigations", "sentiment": "none"}, {"name": "wallet recovery services", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hackers stole more than half a billion dollars in cryptocurrencies from Japanese exchange Coincheck last week — and experts say investors can expect more such attacks.\nIn the last month, hundreds of frantic people have called into McCann Investigations in Houston, Texas. Some have lost their cryptocurrencies. Others had them stolen.\nWallet Recovery Services, which helps people find their lost cryptocurrencies, warns web site visitors to expect a slow response time due to its \" high volume of new requests .\"\n\"All the hackers in the world are targeting cryptocurrencies.\" -Eric Larcheveque, CEO of cryptocurrency security company Ledger Wallet Bitcoin was born out of a distrust for traditional markets and a desire to establish a new system, free from brokers or bankers. But as the value of many cryptocurrencies rise, so does people's uneasiness with being the only one with access to their digital fortune.\nInvestors are finding that the system's high-security makes it easy for them to get locked out.\nCurrently there are more than 3 million bitcoins that have been lost, according to blockchain tracking company Chainalysis. Since bitcoin was created in a way that makes its supply finite, that means that 14 percent of the currency could be gone for good.\nChesnot | Getty Images Even more alarming: cryptocurrencies are a dream for cyber criminals.\n\"Let's say you manage to steal a Social Security number or banking information – that's not money, it's information,\" said Eric Larcheveque, CEO of cryptocurrency security company Ledger Wallet. \"You need to find a broker to sell the data.\"\nBitcoin is simpler.\n\"It's immediate. It's already cash,\" Larcheveque said. \"All the hackers in the world are targeting cryptocurrencies.\"\nJim Watson | AFP | Getty Images Hackers participate in the Wikimania Hackathon at George Washington University in Washington, D.C. At the blockchain security start-up Blockstream, people are working on ways to minimize these risks. The goal can be personal.\n\"There are people in my company who were involved very, very early in bitcoin,\" said Christopher Allen, principal architect at Blockstream. \"And because of a stupid mistake, they lost bitcoins that today would have been worth millions.\"\nHere are some tips from experts for holding on to your cryptocash.\n1) Be careful where you do business SusanneB | E+ | Getty Images Dorothy Flippov, a private investigator with McCann Investigations who specializes in cryptocurrencies, said many people say they've sent their cryptocurrencies to the wrong address. What really happened is probably more sinister.\n\"The possibility of actually sending the coin to the wrong address is infinitesimal,\" she said. \"It's as unlikely to be struck by lightening while being bitten by a snake while winning the lotto.\"\nThat's because people's keys are a long string of numbers and letters, and if you typed in one wrong character, it's unlikely that you actually found another key. In reality, the person was probably defrauded by whomever convinced them to send his or her coins.\n\"This is the newest rendition of fraud,\" Flippov said.\nSome cryptocurrency investors claim there have been a series of Ponzi Schemes.\nTweet 1\nAnd so Flippov said all investors should do their due diligence.\n\"How long have they been around? Who's the team behind it?\" she said. \"If they've been involved in a lawsuit, don't go with them.\"\nEven with your buying and selling transactions, stick to well-known exchanges like Coinbase.\n2) Store your virtual currency offline Amazon Last week, Japanese exchange Coincheck announced that 58 billion yen, or $534.8 million, had been directed to another account. The company said it had kept its cryptocurrencies on so-called hot storage, which means it was online at all times.\nIf you have a significant amount of cryptocurrencies, experts say you shouldn't store them on an exchange like Coinbase.\n\"We've seen a lot of sad stories of people having their cryptocurrencies on their PCs, and their daughter downloaded a game including a virus which sent their assets to a hacker,\" Larcheveque said. \"They lost everything.\"\nInstead, transfer your coins and private keys to a so-called hardware wallet. Popular ones include the Ledger Nano S and Trezor (prices range from $100-$200). The USB-looking device will keep your bitcoins or ripples off the Internet, where they are more vulnerable to hackers.\n\"If you buy physical gold, the first thing you will do is buy a safe,\" Larcheveque said. \"If you buy cryptocurrencies, very quickly you'll understand that you need to buy a digital safe.\"\nA hardware wallet just requires you set up an 8-digit PIN. Plus, the little computer provides you with a set of 24 words which you can use if you forget that PIN. But if you're depending on an online exchange and you lose your 64-character private key, you will have no other way to access your coins.\n3) Back up your backup Getty Images National Guard helicopters make water drop as the Thomas Fire approaches the Lake Casitas area on December 9, 2017 near Ojai, California. You can never be too secure with your cryptocurrenices, Allen said.\n\"You can't go to the bank and say, 'Oops, can you fix this?'\" he said.\nKeep those 24 words, which provide instant access to your cryptocurrencies, in a safe place. Allen recommends you enter those words into a cryptosteel , a device that can withstand temperatures up to 1500 degrees Celsius. Then put that in a fire-proof safe.\nLiving in California during the recent wildfires, he was glad to have these layers of security, he said.\n\"At least when the firemen are done with the hoses,\" Allen said. \"It'll still be there.\"\nMore from Personal Finance:\nBitcoin, once 'sketchy,' becomes more mainstream\nSome cryptocurrency-backed debit cards dropped from Visa network, leaving users scrambling\nBitcoin is too risky to treat as a 'serious' investment, financial advisers say", "external_links": [], "published": "2018-01-29T16:28:00.000+02:00", "crawled": "2018-01-29T16:28:23.008+02:00", "highlightTitle": ""}