{"organizations": [], "uuid": "581ef1bd0779887ebacfba42bce3baac33e3b87c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 28, "shares": 28, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/28/104972897-GettyImages-908996588.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/28/asia-markets-currencies-wynn-macau-in-focus.html", "country": "US", "domain_rank": 767, "title": "Asia markets: Currencies, Wynn Macau in focus", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T02:29:00.000+02:00", "replies_count": 0, "uuid": "581ef1bd0779887ebacfba42bce3baac33e3b87c"}, "author": "Cheang Ming", "url": "https://www.cnbc.com/2018/01/28/asia-markets-currencies-wynn-macau-in-focus.html", "ord_in_thread": 0, "title": "Asia markets: Currencies, Wynn Macau in focus", "locations": [], "entities": {"persons": [], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "wynn macau", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "asia pacific", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "asx", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Asian shares closed mixed on Monday after greater China markets gave up early gains to trade lower in the afternoon.\nJapan's Nikkei 225 reversed early gains to close nearly flat at 23,629.34, with energy-related stocks, trading houses and automakers mostly higher on the day. Toyota gained 0.46 percent by the end of the session. Meanwhile, other large caps closed mixed: Manufacturing company Fanuc rose 0.23 percent, Fast Retailing slipped 0.14 percent and SoftBank declined 0.2 percent.\nSouth Korea's benchmark Kospi index climbed 0.91 percent to end at 2,598.19. Samsung Electronics advanced 0.87 percent ahead of the announcement of its fourth-quarter results due later this week. Rival chipmaker SK Hynix gave up early gains to close lower by 0.26 percent.\nAutomakers and oil-related stocks finished the day in positive territory.\nSymbol Name Price Change %Change NIKKEI --- HSI --- ASX 200 --- SHANGHAI --- KOSPI --- CNBC 100 --- Over in Sydney, the S&P/ASX 200 edged up 0.42 percent to finish the session at 6,075.4 as markets resumed trade following a long weekend due to Australia Day last week. Gains were seen in most sectors apart from gold producers and real estate investment trusts.\nMeanwhile, energy-related stocks and telecommunications were among the top-performing sectors in the morning, with Santos up 0.96 percent on the day.\nChina markets turn lower Greater China markets, which had mostly traded higher in the morning, slipped into negative territory in afternoon trade. Earlier on Monday, an official on China's National Development and Reform Commission wrote in an op-ed that black swan (impossible to predict) or grey rhino (probably coming, yet ignored) high-impact events were likely to take place this year, Reuters reported.\nOn the mainland, the Shanghai composite lost 0.97 percent to close at 3,523.50 and the Shenzhen composite fell 1.56 percent to end at 1,919.80. The blue chip CSI 300 index lost 1.81 percent by the end of the day.\nHong Kong's Hang Seng Index declined 0.51 percent by 3:52 p.m. HK/SIN.\nThe fall was likely due to \"a bit of intra-day profit taking after such a great start to the year,\" said Andrew Clarke, director of trading at Mirabaud Asia.\nEnergy-related names traded mixed, with CNOOC lower by 0.96 percent and Sinopec rising 1.01 percent before the market close. Financials traded mixed, with HSBC lower by 0.58 percent in the afternoon. Property names were also largely in negative territory ahead of the close.\nShares of Hong Kong-listed Wynn Macau fell 5.83 percent by 3:56 p.m. HK/SIN following a Wall Street Journal report detailing sexual misconduct from casino magnate Steve Wynn. Shares of New York-listed Wynn Resorts tumbled more than 10 percent on Friday following the news. Other casino names recorded smaller losses, although Galaxy Entertainment bucked the trend to climb 0.83 percent.\nStateside, stocks were given a lift on Friday on the back of expectation-topping corporate results. As of Friday, 82 percent of companies that have announced fourth-quarter earnings have beaten expectations, according to Thomson Reuters I/B/E/S.\nThe Dow Jones industrial average rose 0.85 percent, or 223.92 points, to close at 26,616.71. The S&P 500 and Nasdaq composite both closed more than 1 percent higher on the day.\nMarkets stateside also digested fourth-quarter GDP numbers released Friday, which showed the U.S. economy expanded by 2.6 percent , short of the 3 percent forecast in a Reuters poll.\nDollar index firms Meanwhile, the dollar index , which tracks the U.S. currency against a basket of six peers, edged up to trade at 89.232 at 3:48 p.m. HK/SIN after falling below the 89 handle in the last session.\nThe greenback fell last week following comments from U.S. Treasury Secretary Steven Mnuchin about how a weaker currency benefits trade. The currency later edged up after President Donald Trump said Mnuchin had been misinterpreted , but subsequently resumed its slide.\nThe dollar firmed against the yen to trade at 108.97.\nThe Australian dollar , which closed above the $0.81 handle on the back of the softer dollar last week, slipped to trade at $0.8084 after rising as high as $0.8118 earlier.\nThe move lower in the Australian currency came as yields on U.S. Treasury notes edged up. The yield on the 10-year government note last stood at 2.68 percent after touching a high of 2.69 percent earlier in the day.\nCorporate news China's banking regulator issued fines on 12 banks amounting to 295 million yuan ($46.7 million), local media said on Saturday. The fines were issued due to illegal bill trading, although authorities did not specify what was unlawful about the trading, Reuters reported . Postal Savings Bank of China was among the banks fined.\nStock of Australia's AMA Group closed up 4.85 percent after the company earlier confirmed a report in the Australian Financial Review that it had received a proposal from Blackstone Private Equity.", "external_links": ["https://www.reuters.com/article/us-china-banking-fraud/china-fines-12-banks-over-illegal-bill-trading-fraud-idUSKBN1FG0Q1"], "published": "2018-01-29T02:29:00.000+02:00", "crawled": "2018-01-29T02:04:44.006+02:00", "highlightTitle": ""}