{"organizations": [], "uuid": "53b135ee67076b42eb94a5d1d6c66f974e7af4a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-preferred-apartment-communities-inc-announces-acquisition-of-a-265-unit-multifamily-community-in-jacksonville-florida.html", "country": "US", "domain_rank": 767, "title": "Preferred Apartment Communities, Inc. Announces Acquisition of a 265-Unit Multifamily Community in Jacksonville, Florida", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-10T00:20:00.000+02:00", "replies_count": 0, "uuid": "53b135ee67076b42eb94a5d1d6c66f974e7af4a0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-preferred-apartment-communities-inc-announces-acquisition-of-a-265-unit-multifamily-community-in-jacksonville-florida.html", "ord_in_thread": 0, "title": "Preferred Apartment Communities, Inc. Announces Acquisition of a 265-Unit Multifamily Community in Jacksonville, Florida", "locations": [], "entities": {"persons": [{"name": "jeff sherman", "sentiment": "none"}, {"name": "john a. williams", "sentiment": "none"}, {"name": "williams", "sentiment": "none"}, {"name": "lux", "sentiment": "none"}], "locations": [{"name": "florida atlanta", "sentiment": "none"}, {"name": "jacksonville", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "preferred apartment communities, inc.", "sentiment": "neutral"}, {"name": "preferred apartment communities, inc", "sentiment": "neutral"}, {"name": "pac", "sentiment": "none"}, {"name": "multifamily investments", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 9, 2018 /PRNewswire/ -- Preferred Apartment Communities, Inc. (NYSE: APTS) (\"PAC\" or the \"Company\") today announced the acquisition of Lux, a 265-unit Class A multifamily community in Jacksonville, Florida constructed in 2017. Lux is located adjacent to Sorrel, a Class A multifamily community that PAC acquired in 2016. \"This acquisition creates operational efficiencies across the two properties and grows our market presence in the highly desirable Intracoastal West area of Jacksonville to over 550 units,\" said John A. Williams, the Company's Chief Executive Officer. Mr. Williams added, \"The acquisition of Lux demonstrates our commitment to our strategy of adding newly constructed Class A multifamily communities to our portfolio, which we believe will translate into sustainable and growing cash flows.\"\nJeff Sherman, Executive Vice President of Multifamily Investments stated, \"The acquisition of Lux is a great start to 2018 after a highly successful 2017 in which PAC acquired 13 Class A multifamily and student housing communities totaling over 3,200 units and originated five real estate investment loans for the development of Class A multifamily and student housing communities totaling over 1,400 units.\" Mr. Sherman added, \"Our multifamily and student housing acquisition pipeline under our real estate loan investment program, which typically gives PAC the option to acquire Class A multifamily and student housing communities at pre-negotiated discounts, now aggregates 19 Class A multifamily and student housing communities representing over 5,000 units.\"\nPAC acquired this community through a wholly-owned subsidiary and financed the acquisition utilizing a non-recourse first mortgage loan from Nationwide Life Insurance Company. The principal balance on the first mortgage loan is approximately $31.5 million, bears interest at a fixed rate of 3.91% per annum, has a 12-year term and amortizes based on a 30-year schedule. There are no loan guaranties provided by PAC or our operating partnership.\nAbout Preferred Apartment Communities, Inc.\nPreferred Apartment Communities, Inc. is a Maryland corporation formed primarily to acquire and operate multifamily properties in select targeted markets throughout the United States. As part of our business strategy, we may enter into forward purchase contracts or purchase options for to-be-built multifamily communities and we may make real estate related loans, provide deposit arrangements, or provide performance assurances, as may be necessary or appropriate, in connection with the development of multifamily communities and other properties. As a secondary strategy, we may acquire or originate senior mortgage loans, subordinate loans or real estate loans secured by interests in multifamily properties, membership or partnership interests in multifamily properties and other multifamily related assets and invest a lesser portion of our assets in other real estate related investments, including other income-producing property types, senior mortgage loans, subordinate loans or real estate loans secured by interests in other income-producing property types, membership or partnership interests in other income-producing property types as determined by our manager as appropriate for us. At September 30, 2017, the Company was the approximate 97.5% owner of Preferred Apartment Communities Operating Partnership, L.P., the Company's operating partnership. Preferred Apartment Communities, Inc. has elected to be taxed as a real estate investment trust under the Internal Revenue Code of 1986, as amended, commencing with its tax year ended December 31, 2011. Learn more at www.pacapts.com .\nForward-Looking Statements\nThis press release may contain within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. These statements may be identified by the use of forward-looking terminology such as \"may\", \"trend\", \"will\", \"expects\", \"plans\", \"estimates\", \"anticipates\", \"projects\", \"intends\", \"believes\", \"goals\", \"objectives\", \"outlook\" and similar expressions. Because such statements include risks, uncertainties and contingencies, actual results may differ materially from the expectations, intentions, beliefs, plans or predictions of the future expressed or implied by such . These risks, uncertainties and contingencies include, but are not limited to, those disclosed in PAC's filings with the Securities and Exchange Commission. PAC undertakes no obligation to update these to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events, except as may be required by law.\nAdditional Information\nThe SEC has declared effective the registration statement (including prospectus) filed by the Company for each of the offerings to which this communication may relate. Before you invest, you should read the final prospectus, and any prospectus supplements, forming a part of the registration statement and other documents the Company has filed with the SEC for more complete information about the Company and the offering to which this communication may relate. In particular, you should carefully read the risk factors described in the final prospectus and in any related prospectus supplement and in the documents incorporated by reference in the final prospectus and any related prospectus supplement to which this communication may relate. You may obtain these documents for free by visiting EDGAR on the SEC website at www.sec.gov . Alternatively, the Company or its dealer manager, Preferred Capital Securities, LLC, with respect to PAC's mShares Redeemable Preferred Stock Offering and Series A Redeemable Preferred Stock and Warrant Unit Offering, and JonesTrading Institutional Services LLC, with respect to PAC's ATM Common Stock Offering, will arrange to send you a prospectus if you request it by calling Leonard A. Silverstein at (770) 818-4100, 3284 Northside Parkway NW, Suite 150, Atlanta, Georgia 30327.\nThe ATM Common Stock Offering prospectus supplement, dated July 10, 2017, including a base prospectus, dated May 17, 2016, can be accessed through the following link:\nhttps://www.sec.gov/Archives/edgar/data/1481832/000148183217000110/atmprospectusspring2017.htm\nThe mShares Redeemable Preferred Stock Offering prospectus, dated January 19, 2017, can be accessed through the following link:\nhttps://www.sec.gov/Archives/edgar/data/1481832/000148183217 8/a424prospectus-mshares1.htm\nThe Series A Redeemable Preferred Stock and Warrant Unit Offering prospectus, dated March 16, 2017, can be accessed through the following link:\nhttps://www.sec.gov/Archives/edgar/data/1481832/000148183217000061/a424prospectus-15bseriesar.htm\nView original content with multimedia: http://www.prnewswire.com/news-releases/preferred-apartment-communities-inc-announces-acquisition-of-a-265-unit-multifamily-community-in-jacksonville-florida-300580270.html\nSOURCE Preferred Apartment Communities, Inc.", "external_links": ["https://www.sec.gov/Archives/edgar/data/1481832/000148183217000008/a424prospectus-mshares1.htm", "https://www.sec.gov/Archives/edgar/data/1481832/000148183217000061/a424prospectus-15bseriesar.htm", "http://www.pacapts.com/", "http://www.prnewswire.com/news-releases/preferred-apartment-communities-inc-announces-acquisition-of-a-265-unit-multifamily-community-in-jacksonville-florida-300580270.html", "https://www.sec.gov/Archives/edgar/data/1481832/000148183217000110/atmprospectusspring2017.htm"], "published": "2018-01-10T00:20:00.000+02:00", "crawled": "2018-01-10T02:20:56.000+02:00", "highlightTitle": ""}