{"organizations": [], "uuid": "7302e6ab227b26d275e59a8a1fc5a5bb955bdc6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-826122142.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/08/trump-mueller-interview/", "country": "US", "domain_rank": 1196, "title": "Trump’s Lawyers Trying To Get Him Out for Mueller Interview | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.973, "site_type": "news", "published": "2018-01-08T14:23:00.000+02:00", "replies_count": 0, "uuid": "7302e6ab227b26d275e59a8a1fc5a5bb955bdc6a"}, "author": "Emma Hinchliffe", "url": "http://fortune.com/2018/01/08/trump-mueller-interview/", "ord_in_thread": 0, "title": "Trump’s Lawyers Trying To Get Him Out for Mueller Interview | Fortune", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "neutral"}, {"name": "emma hinchliffe", "sentiment": "neutral"}, {"name": "donald trump", "sentiment": "neutral"}, {"name": "mueller", "sentiment": "none"}, {"name": "robert mueller", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}], "organizations": [{"name": "nbc news", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Emma Hinchliffe 12:23 PM EST \nPresident Donald Trump’s legal team is getting ready for the next stage in special counsel Robert Mueller’s investigation into the Trump administration’s ties to Russia — and reportedly trying to help Trump avoid sitting down with the special counsel. \nThe former FBI director’s investigation has reached the stage at which an interview with the president himself is imminent. \nThe president’s team is negotiating over the potential Mueller interview, NBC News reported , citing three anonymous sources. The president’s lawyers are asking about providing written responses to questions instead of a sit-down, in-person interview and other compromises that could help them avoid putting Trump on the spot with the special counsel. \nOne source told NBC that the lawyers working on avoiding an interview floated the possibility of the president signing an affidavit saying he was “innocent of any wrongdoing” and denying any collusion. The affidavit, the lawyers proposed, would mean Trump wouldn’t have to do an interview at all. \nIf the interview must happen, the Trump team has questions about how. \nLawyers are asking whether Mueller would interview Trump himself, the location and length of an interview, the topics to be covered and “the legal standard for when a president can be interviewed.” \nThe White House legal team reportedly started examining whether Trump could avoid an interview altogether after former Trump campaign manager Paul Manafort was indicted over money laundering connected to business dealings in Ukraine in October. \nLegal experts told NBC that it was unlikely Mueller would give up on securing an actual interview with the president as part of the Russia investigation. \n“The odds of prosecutors agreeing to written responses are somewhere between infinitesimally small and zero,” Chuck Rosenberg, former U.S. attorney for the Eastern District of Virginia and former chief of staff to fired FBI Director James Comey, said. \nExperts agreed about this latest Trump news that from the Trump team’s perspective, an interview poses risks. \n“It very much depends on whether the president has things to hide. If there’s really nothing to hide, then I would think there’s no danger in him sitting down with anyone and speaking freely to them,” presidential historian Robert Dallek told NBC News. “But if there are things to hide, obviously there are risks.” \n", "external_links": [], "published": "2018-01-08T14:23:00.000+02:00", "crawled": "2018-01-08T20:40:18.052+02:00", "highlightTitle": ""}