{"organizations": [], "uuid": "aee3f1b03d9044e3b3354893f337af8961cea06f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219281243&w=1200&r=LYNXMPEE030IE", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-disaster-insurance/insured-losses-in-2017-most-ever-at-135-billion-after-hurricanes-idUSKBN1ET0ZT", "country": "US", "domain_rank": 408, "title": "Insured losses in 2017 most ever at $135 billion after hurricanes", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T12:00:00.000+02:00", "replies_count": 0, "uuid": "aee3f1b03d9044e3b3354893f337af8961cea06f"}, "author": "", "url": "https://www.reuters.com/article/us-disaster-insurance/insured-losses-in-2017-most-ever-at-135-billion-after-hurricanes-idUSKBN1ET0ZT", "ord_in_thread": 0, "title": "Insured losses in 2017 most ever at $135 billion after hurricanes", "locations": [], "entities": {"persons": [{"name": "ernst rauch", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "munich re’s corporate climate center", "sentiment": "none"}, {"name": "munich re", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKFURT/MUNICH (Reuters) - Insurers will have to pay claims of around $135 billion for 2017, the most ever, following a spate of hurricanes, earthquakes and fires in North America, according to a report published on Thursday.\nGerman reinsurer Munich Re ( MUVGn.DE ), in its annual natural catastrophe review, also said last year’s total losses, including those not insured, were $330 billion, the second-worst in history after 2011 when an earthquake and tsunami wreaked havoc in Japan.\nAlthough individual events could not be linked directly to climate change, global warming is playing a role, Munich Re said. It expected more frequent extreme events in future.\n“We have a new normal,” said Ernst Rauch, head of Munich Re’s Corporate Climate Center, which monitors climate change risks.\n“2017 was not an outlier,” he said, noting insured losses have surpassed $100 billion multiple times since 2005. “We must have on our radar the trend of new magnitudes.”\nLast year’s hurricanes Harvey, Irma and Maria in the United States and Caribbean, wildfires in California and earthquakes in Mexico destroyed homes, infrastructure and numerous lives.\nThe disasters also rocked global insurers. Munich Re and Hannover Re ( HNRGn.DE ) both issued profit warnings.\nThat dealt a blow to a sector already struggling with thin margins, stiff competition and falling prices.\nMunich Re’s tally for the industry comes on the back of other estimates that underscored the severity of 2017.\nIn December, Swiss Re ( SRENH.S ) estimated global insured losses from catastrophes would hit $136 billion in 2017, the third-highest on record for the sector, with the United States hardest hit. That figure is not directly comparable to Munich Re’s estimates as it includes man-made disasters.\nReinsurers, which are in the business of insuring insurance, are experts in managing risk and rarely get caught off guard. Analysts have said reinsurers may need to take a fresh look at their risk models as the planet warms and storms become more intense.\nA big question for the industry has been whether the run of catastrophes would allow them to achieve higher prices for their coverage, which have been in decline for years.\nEarly indications suggest modest increases. Global property reinsurance prices rose less than expected in the key Jan. 1 renewal season, with strong competition limiting increases to single digit percentages, brokers said this week.\nA turnaround in prices would be the first major reversal since Hurricane Katrina in 2005.\nEditing by Maria Sheahan and Mark Potter\n ", "external_links": [], "published": "2018-01-04T12:00:00.000+02:00", "crawled": "2018-01-04T12:32:11.004+02:00", "highlightTitle": ""}