{"organizations": [], "uuid": "aaaf81be1987c154315e3e6ba99e0cf335d52d5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://www.top10b.info/wp-content/uploads/2018/01/104340607-RTX30OJF.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/24/indias-reforms-government-to-inject-14-billion-into-20-public-sector-banks-by-march.html/", "country": "US", "domain_rank": 767, "title": "Government to inject $14 billion into 20 public sector banks by March - Top10 World", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-28T11:34:00.000+02:00", "replies_count": 0, "uuid": "aaaf81be1987c154315e3e6ba99e0cf335d52d5d"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/indias-reforms-government-to-inject-14-billion-into-20-public-sector-banks-by-march.html/", "ord_in_thread": 0, "title": "Government to inject $14 billion into 20 public sector banks by March - Top10 World", "locations": [], "entities": {"persons": [{"name": "rajeev kumar", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home / Politics / Government to inject $14 billion into 20 public sector banks by March Government to inject $14 billion into 20 public sector banks by March 1 min ago \nIndia desperately needs its lenders to get their bad debts off their books so they can start doling out credit again, after economic growth has slid in recent quarters. State-run lenders account for more than two-thirds of the country’s banking assets. \nBut the government on Wednesday said lenders must implement a series of reforms to get the funds, including improving their due diligence, allowing specialized monitoring for loans above 2.5 billion rupees, and limiting the number of lenders that can group together to dole out loans. \nAnalysts had said mandating reforms would be critical to prevent banks from engaging in the same indiscriminate lending that led to the current problems. \n“All public sector banks will be adequately capitalized and enabled to serve people and support inclusive growth,” Rajeev Kumar, India’s top banking bureaucrat, told a news conference. \n“Capitalization is dependent on the compliance of reforms.” \nOf the funds to be injected by March, the government will raise 800 billion rupees by issuing recapitalization bonds, which will not be tradeable in markets, and provide an additional 81.4 billion rupees from its budget. \nTotal recapitalization will cross 1 trillion rupees this year, including sales of shares to external investors, he added. \nThe capital allocation will boost state banks’ ability to dole out credit by 5 trillion rupees, Kumar said, while another official said the bonds will not add to the country’s fiscal deficit as they will be accounted for under a separate system. ", "external_links": [], "published": "2018-01-28T11:34:00.000+02:00", "crawled": "2018-01-28T11:39:43.062+02:00", "highlightTitle": ""}