{"organizations": [], "uuid": "cdba2e2623ed97f8133cba4ec63bc795316e0e04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 43}, "facebook": {"likes": 546, "shares": 546, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104929200-GettyImages-533676614.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/cryptocurrency-dogecoin-now-has-a-market-value-of-more-than-1-billion.html", "country": "US", "domain_rank": 767, "title": "Cryptocurrency Dogecoin now has a market value of more than 1 billion", "performance_score": 5, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-05T05:07:00.000+02:00", "replies_count": 0, "uuid": "cdba2e2623ed97f8133cba4ec63bc795316e0e04"}, "author": "Saheli Roy Choudhury", "url": "https://www.cnbc.com/2018/01/04/cryptocurrency-dogecoin-now-has-a-market-value-of-more-than-1-billion.html", "ord_in_thread": 0, "title": "Cryptocurrency Dogecoin now has a market value of more than 1 billion", "locations": [], "entities": {"persons": [{"name": "coinmarketcap  dogecoin", "sentiment": "none"}, {"name": "dogecoin", "sentiment": "none"}], "locations": [], "organizations": [{"name": "coinmarketcap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Let friends in your social network know what you are reading about Facebook Cryptocurrency created as a parody is now worth more than $1 billion Dogecoin, a cryptocurrency created as a parody after a popular internet meme, now has a market cap of more than $1.1 billion. Post to Facebook A link has been posted to your Facebook feed. 2 To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Cryptocurrency created as a parody is now worth more than $1 billion Saheli Roy Choudhury, CNBC Published 8:46 a.m. ET Jan. 5, 2018 CLOSE The Bitcoin phenomena experiences both record highs and lows this week, but…uhh, what the heck is it again? USA TODAY A screengrab from the dogecoin.com website. One of the Dogecoin founders told a cryptocurrency news site that the token's rise makes him worry about market excess. (Photo: dogecoin.com) CONNECT 2 COMMENT EMAIL MORE A cryptocurrency that was created as a parody and named after an Internet meme now has a market value of more than $1 billion. Data from CoinMarketCap showed dogecoin's current market value is about $1.17 billion — as of Jan. 4, 11:56 p.m. EST — and traded at $0.010360 per token. Last month, the virtual coin rose more than 400% and briefly topped $0.0107 in late December. Dogecoin is an example of an altcoin, which are peer-to-peer digital tokens that descended from bitcoin . The more popular ones include ethereum, which topped $1,000 for the first time on Thursday, and ripple, which saw a staggering 35,000% jump in its value last year . Dogecoin, for its part, was created in 2013 and its mascot is a Japanese shiba inu dog popularized by an Internet meme that dates back to 2010 . The creators of dogecoin positioned the virtual token as \"the Internet currency\" that can allow users to easily send money online. There are several ways to get dogecoins: Users can buy them at online exchanges, get tipped in the cryptocurrency and even mine them.", "external_links": [], "published": "2018-01-05T05:07:00.000+02:00", "crawled": "2018-01-05T05:27:09.047+02:00", "highlightTitle": ""}