{"organizations": [], "uuid": "ac87484535ebf9432b9a64830700a415111eec55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222471514&w=1200&r=LYNXMPEE0F16R", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/india-oil/indias-oil-imports-in-2017-surged-to-a-record-4-4-million-bpd-idINKBN1F5234", "country": "US", "domain_rank": 408, "title": "India's oil imports in 2017 surged to a record 4.4 million bpd", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T18:35:00.000+02:00", "replies_count": 0, "uuid": "ac87484535ebf9432b9a64830700a415111eec55"}, "author": "", "url": "https://in.reuters.com/article/india-oil/indias-oil-imports-in-2017-surged-to-a-record-4-4-million-bpd-idINKBN1F5234", "ord_in_thread": 0, "title": "India's oil imports in 2017 surged to a record 4.4 million bpd", "locations": [], "entities": {"persons": [], "locations": [{"name": "india", "sentiment": "none"}, {"name": "kolkata", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}], "organizations": [{"name": "thomson reuters oil research & forecasts", "sentiment": "none"}, {"name": "reliance industries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 4:39 PM / Updated 3 hours ago India's oil imports in 2017 surged to a record 4.4 million bpd Nidhi Verma 3 Min Read \n(Reuters) - India’s oil imports rose by about 1.8 percent in 2017 to a record 4.37 million barrels per day (bpd) as the country boosted purchases to feed its expanded refining capacity, ship-tracking data obtained from sources and data compiled by Thomson Reuters Oil Research & Forecasts showed. FILE PHOTO: Oil tankers are seen parked at a yard outside a fuel depot on the outskirts of Kolkata February 3, 2015. REUTERS/Rupak De Chowdhuri/File Photo \nTo meet its growing fuel demand India, the world’s third-biggest oil consumer, raised its refining capacity in the second half of 2017. \nIndia’s capacity expansion to about 5 million bpd was aided by Reliance Industries, owner of the world’s largest refining complex, declaring 30 percent higher capacity of its export-focused plant. \nIn December the country’s oil imports totalled 4.38 million bpd, a decline of about 6.4 percent from the previous month and about 2 percent from a year ago, the data showed. \nIn 2017 Iraq for the first time emerged as the top supplier to India on an annual basis while Saudi Arabia slipped to the second position, the data showed. \nIran was the third biggest oil supplier to India in 2017, replacing Venezuela. India’s imports from Iran in 2017 totalled about 471,000 bpd, marginally lower than a year ago, the data showed. \nIn April-December, the first nine months of this fiscal year, Iranian supplies to India averaged at about 437,000 bpd, a decline of about 18 percent from a year ago, the data showed. \nIndian state refiners plan to cut imports from Iran by about a fifth from a year over a dispute on the award of development rights of a giant gas field. \nIndia’s oil imports from Iran surged to the highest level in nine months in December. \nThe Middle East continued to be the biggest oil supplier to India, although the region’s share in imports declined to about 63 percent from about 64.5 percent a year ago. \nImports from the Middle East declined due to the narrowing price differential with Atlantic Basin oil tied to Brent. \nThe average premium for Brent eased against Dubai crude to about $2 a barrel in 2017 from around $3.5 in 2016. \nOil supplies from Africa rose marginally, accounting for about 16 percent of overall imports, while that from Latin America declined for a third year, with the region’s share shrinking to about 15 percent from 16 percent. \nThe opening of an arbitrage window due to a supply glut led to India buying more from central Asia and shipping in oil from the United States. Reporting by Nidhi Verma, editing by Louise Heavens", "external_links": [], "published": "2018-01-16T18:35:00.000+02:00", "crawled": "2018-01-16T18:53:28.000+02:00", "highlightTitle": ""}