{"organizations": [], "uuid": "12b7d291929919a41f342fd0d2cbdcd14a7f1d2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/03/reuters-america-update-3-tesla-pushes-back-model-3-production-target-again-despite-progress.html", "country": "US", "domain_rank": 767, "title": "UPDATE 3-Tesla pushes back Model 3 production target again, despite progress", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T01:07:00.000+02:00", "replies_count": 0, "uuid": "12b7d291929919a41f342fd0d2cbdcd14a7f1d2d"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/03/reuters-america-update-3-tesla-pushes-back-model-3-production-target-again-despite-progress.html", "ord_in_thread": 0, "title": "UPDATE 3-Tesla pushes back Model 3 production target again, despite progress", "locations": [], "entities": {"persons": [{"name": "tesla", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "palo alto", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "tesla inc", "sentiment": "negative"}, {"name": "elon musk", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds analyst quotes, background)\nSAN FRANCISCO, Jan 3 (Reuters) - Tesla Inc delayed a production target for its new Model 3 sedan for the second time on Wednesday, disappointing investors even as it claimed \"major progress\" overcoming manufacturing challenges that have hampered the vehicle's rollout.\nThe electric vehicle maker headed by Elon Musk said it would likely build about 2,500 Model 3s per week by the end of the first quarter, half the number it had earlier promised. Instead, Tesla said it now plans to reach its goal of 5,000 vehicles per week by the end of the second quarter.\nThe delay sent shares of the Palo Alto, California-based company down 2 percent in after-market trading.\nThe Model 3 is critical to Tesla's long-term success, as it is the most affordable of its cars to date and is the only one capable of transforming the niche automaker to a mass producer amid a sea of rivals entering the nascent electric vehicle market.\nBuilding the car efficiently and delivering it without delays to customers is also critical, as the money-losing company faces high cash burn. Delays increase the risk that reservation-holders will cancel orders.\n\"The further delay to (production volume) will leave analysts and investors focused on the implications for cash as we head through the first half of the year, Evercore analyst George Galliers told Reuters.\nThe company burned through $1.1 billion in capital expenditures in its third quarter and said in November that fourth-quarter capex would also be about $1.1 billion.\nRBC Capital Markets analyst Joseph Spak wrote in a note that he did not believe Tesla will be required to do a capital raise.\n\"We have them hovering about $1 billion in cash ... They don't have a ton of wiggle room though in our view,\" Spak said.\nIn delivering 1,550 of its new Model 3 electric vehicles in the fourth quarter, Tesla fell short of Wall Street expectations. Analysts had expected 4,100 Model 3 sedans to be delivered in the fourth quarter, according to financial data and analytics firm FactSet.\nThe estimates for Model 3 deliveries by different brokerages varied widely. While Evercore analysts estimated 5,800 deliveries, Cowen analysts expected just 2,250.\nTesla said 860 Model 3 vehicles were in transit to customers at the end of the fourth quarter.\nThe company said it delivered a total of 29,870 vehicles in the fourth quarter, including 15,200 Model S vehicles and 13,120 Model X cars. Analysts had expected total deliveries of about 30,000.\nPRODUCTION ACCELERATING\nTesla had initially predicted to reach the milestone of 5,000 vehicles per week in December, but in November deferred the target to the end of the first quarter.\nTesla said on Wednesday its production rate had increased significantly despite the delays.\n\"In the last seven working days of the quarter, we made 793 Model 3s, and in the last few days, we hit a production rate on each of our manufacturing lines that extrapolates to over 1,000 Model 3s per week,\" the company said in a statement.\nThat pace of production is still below that of many carmakers. A conventional car factory operating at full speed on two shifts can churn out nearly 1,000 vehicles a day.\nThe Model 3 - which starts at $35,000, or about half the price of its flagship Model S - was met with great enthusiasm when its prototype was first unveiled in early 2016. Tesla said in August it had about 500,000 reservations for the car and demand was not a constraint.\nProduction, however, hit snags during a period of \"manufacturing hell\" Musk first warned of in July. Among the issues Tesla faced was its battery module assembly line at its Nevada Gigafactory, which required a redesign.\nIn its third quarter, Tesla built just 260 Model 3s.\nAlthough bullish investors have generally waved off early Model 3 problems, instead focusing on the future prospects of Tesla, critics warn that Model 3 issues could sour demand for Tesla's mass-market vehicle, delay sorely needed revenue and compromise the company's ability to raise cash in the future.\nTesla shares, despite paring some gains from a high of $385 in September, still trade at 46 percent above their price a year ago. (Reporting by Alexandria Sage in San Francisco and Supantha Mukherjee in Bengaluru; Editing by Shounak Dasgupta and Tom Brown)", "external_links": [], "published": "2018-01-04T01:07:00.000+02:00", "crawled": "2018-01-04T02:44:59.009+02:00", "highlightTitle": ""}