{"organizations": [], "uuid": "261582427c0b017ff05242131170a12350f327e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-nabors-announces-offering-of-senior-unsecured-notes.html", "country": "US", "domain_rank": 767, "title": "Nabors Announces Offering of Senior Unsecured Notes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.085, "site_type": "news", "published": "2018-01-16T15:06:00.000+02:00", "replies_count": 0, "uuid": "261582427c0b017ff05242131170a12350f327e7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-nabors-announces-offering-of-senior-unsecured-notes.html", "ord_in_thread": 0, "title": "Nabors Announces Offering of Senior Unsecured Notes", "locations": [], "entities": {"persons": [], "locations": [{"name": "bermuda", "sentiment": "none"}], "organizations": [{"name": "nabors", "sentiment": "negative"}, {"name": "nabors industries ltd.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "nbr", "sentiment": "negative"}, {"name": "nabors industries, inc.", "sentiment": "none"}, {"name": "nii", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HAMILTON, Bermuda, Jan. 16, 2018 /PRNewswire/ -- Nabors Industries Ltd. (NYSE:NBR) (\"Nabors\") announced today that its wholly owned subsidiary, Nabors Industries, Inc. (\"NII\"), has commenced an offering of senior unsecured notes due 2025 (the \"notes\"). The notes will be fully and unconditionally guaranteed by Nabors.\nNabors intends to use the net proceeds from this offering to repay indebtedness of Nabors and its subsidiaries, including all of NII's outstanding 6.15% senior notes due February 2018. Nabors intends to initially use the net proceeds from this offering to prepay amounts currently outstanding under NII's unsecured revolving credit facility and subsequently draw on the unsecured revolving credit facility to pay NII's outstanding 6.15% senior notes due February 2018 at maturity. The revolving credit facility matures in 2020 and the weighted average interest rate on borrowing under the revolving credit facility was 2.59% as of September 30, 2017.\nThe notes will be offered and sold to qualified institutional buyers in accordance with Rule 144A under the Securities Act of 1933, as amended (the \"Securities Act\"), and to persons outside the United States in accordance with Regulation S under the Securities Act and applicable exemptions from registration, prospectus or like requirements under the laws and regulations of the relevant jurisdictions outside the United States. The notes will not be registered under the Securities Act and, unless so registered, may not be offered or sold in the United States except pursuant to an exemption from, or in a transaction not subject to, the registration requirements of the Securities Act and applicable state securities laws. The notes will also not be registered in any jurisdiction outside of the United States and no action or steps will be taken to permit the offer of the notes in any such jurisdiction where any registration or other action or steps would be required to permit an offer of the notes.\nThe notes will not be offered or sold in any such jurisdiction except pursuant to an exemption from, or in a transaction not subject to, the relevant requirements of laws and regulations of such jurisdictions.\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy the notes or any other securities of Nabors or NII, nor shall there be any offer, solicitation or sale of the notes in any state or jurisdiction in which such offer, solicitation or sale would be unlawful.\nThe information above includes forward-looking statements within the meaning of the Securities Act of 1933 and the Securities Exchange Act of 1934. Such forward-looking statements are subject to certain risks and uncertainties, as disclosed by Nabors from time to time in its filings with the Securities and Exchange Commission. As a result of these factors, Nabors' actual results may differ materially from those indicated or implied by such forward-looking statements. Nabors does not undertake to update these forward- looking statements.\nAbout Nabors Industries\nNabors Industries (NYSE: NBR) owns and operates one of the world's largest land-based drilling rig fleets and is a provider of offshore platform rigs in the United States and numerous international markets. Nabors also provides directional drilling services, performance tools, and innovative technologies for its own rig fleet and those of third parties. Leveraging our advanced drilling automation capabilities, Nabors highly skilled workforce continues to set new standards for operational excellence and transform our industry.\nMedia Contacts :\nFor further information regarding Nabors, please contact Dennis A. Smith, Vice President of Corporate Development & Investor Relations, +1 281-775-8038, or Nick Swyka, Director of Corporate Development & Investor Relations, +1 281-775-2407. To request investor materials, contact Nabors' corporate headquarters in Hamilton, Bermuda at + 441-292-1510 or via email at mark.andrews@nabors.com .\nView original content: http://www.prnewswire.com/news-releases/nabors-announces-offering-of-senior-unsecured-notes-300583055.html\nSOURCE Nabors Industries Ltd.", "external_links": ["http://www.prnewswire.com/news-releases/nabors-announces-offering-of-senior-unsecured-notes-300583055.html"], "published": "2018-01-16T15:06:00.000+02:00", "crawled": "2018-01-16T16:53:03.006+02:00", "highlightTitle": ""}