{"organizations": [], "uuid": "2f32bbf49db2945d11ccb6026db4be7f3b7b075f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222522123&w=1200&r=LYNXMPEE0F1E9", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-carillion-restructing-banks/carillion-rescue-hopes-were-undermined-by-british-banks-court-documents-show-idUSKBN1F52FQ", "country": "US", "domain_rank": 408, "title": "Britain's RBS pulled plug on Carillion days before collapse", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T02:55:00.000+02:00", "replies_count": 0, "uuid": "2f32bbf49db2945d11ccb6026db4be7f3b7b075f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-carillion-restructing-banks/carillion-rescue-hopes-were-undermined-by-british-banks-court-documents-show-idUSKBN1F52FQ", "ord_in_thread": 0, "title": "Britain's RBS pulled plug on Carillion days before collapse", "locations": [], "entities": {"persons": [{"name": "carillion", "sentiment": "none"}, {"name": "cochrane", "sentiment": "none"}, {"name": "keith cochrane", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "rbs", "sentiment": "negative"}, {"name": "royal bank of scotland", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "high court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Carillion collapsed only days after Royal Bank of Scotland (RBS)( RBS.L ), one of the British group’s main lenders, tightened the terms of its funding, court documents show.\nThe RBS decision three days before the collapse served to weaken attempts to protect Carillion’s cash position, the construction and services company’s interim CEO Keith Cochrane said in a statement submitted to the High Court in London.\nThe taxpayer-funded bank took “unilateral action, which in the company’s view undermined the group’s efforts to conserve cash”, Cochrane said.\nRBS said in a statement it judged Carillion’s restructuring plan was not viable and so it made the difficult decision not to make further funding available to the 200-year-old business.\nCarillion collapsed on Monday, throwing hundreds of large projects into doubt and forcing the government to step in to guarantee vital public services in one of Britain’s biggest corporate failures.\nThe company held about 450 government contracts helping to build roads, railways and schools and maintain hospitals before it collapsed under the weight of its debts after a series of construction projects ran into trouble.\nCochrane said the company’s cash position was eroded after RBS on Friday proposed that the company make payments to suppliers two days earlier than previously planned. This hit the company’s liquidity by between 2 million pounds ($2.75 million) and 20 million pounds, Cochrane added.\nRBS has in the past been heavily criticized for its treatment of distressed business customers, with the actions of its Global Restructuring Group the subject of parliamentary scrutiny and legal action.\nSantander ( SAN.MC ), another of Carillion’s largest lenders, was also singled out for criticism, with Cochrane alleging Santander had put the brakes on Carillion payments, although it later reversed its decision after talks.\nSantander said in a statement it was a prudent step and that it continuously reviews its lending to reduce exposure to losses.\nTalks between Carillion, the government and other stakeholders failed to reach agreement on a “bridging arrangement” last week, according to the documents, which provide a detailed account of the company’s six-month demise.\nAs a result, the stricken company wrote to the government on Saturday to make a final request for short-term funding that would give bosses time to implement a rescue plan.\nHowever, Carillion’s fate was sealed on Sunday when the government told directors it would “not be willing to provide such support to the company”.\nLast-ditch talks with key financial stakeholders also failed to reach a deal and the directors concluded the business was insolvent at a board meeting held the same day.\nCarillion owes almost 1.3 billion pounds to its lenders and had only 29 million pounds in cash reserves by Monday, the documents show.\nReporting by Andrew MacAskill and Ben Martin; Editing by David Goodman and Alexander Smith\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T02:55:00.000+02:00", "crawled": "2018-01-16T23:01:35.014+02:00", "highlightTitle": ""}