{"organizations": [], "uuid": "b03eea34572242762e056db5a68a2ed50301fb35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222109040&w=1200&r=LYNXMPEE0E0JB", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-nadal/nadal-charges-into-second-round-at-australian-open-idUKKBN1F412U", "country": "US", "domain_rank": 408, "title": "Nadal charges into second round at Australian Open", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T12:08:00.000+02:00", "replies_count": 0, "uuid": "b03eea34572242762e056db5a68a2ed50301fb35"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-nadal/nadal-charges-into-second-round-at-australian-open-idUKKBN1F412U", "ord_in_thread": 0, "title": "Nadal charges into second round at Australian Open", "locations": [], "entities": {"persons": [{"name": "nadal", "sentiment": "negative"}, {"name": "ian ra", "sentiment": "negative"}, {"name": "estrella burgos", "sentiment": "none"}, {"name": "victor estrella burgos", "sentiment": "none"}, {"name": "reuters/thomas peter", "sentiment": "none"}, {"name": "rafael nadal", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "rafa nadal", "sentiment": "none"}, {"name": "roger federer", "sentiment": "none"}], "locations": [{"name": "rod laver arena", "sentiment": "none"}, {"name": "dominican republic", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "min read  melbourne", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 10:10 AM / Updated 9 hours ago Nadal happy with rollicking start at Melbourne Park Ian Ransom 3 Min Read \nMELBOURNE (Reuters) - A ruthless Rafa Nadal preserved his creaky knees for tougher tests down the road by routing Dominican journeyman Victor Estrella Burgos 6-1 6-1 6-1 to sail into the second round of the Australian Open on Monday. Tennis - Australian Open - Rafael Nadal of Spain v Victor Estrella Burgos of Dominican Republic - Rod Laver Arena, Melbourne, Australia, January 15, 2018. Nadal celebrates after winning his match. REUTERS/Thomas Peter \nPlaying his first competitive match since pulling out of the ATP Tour Finals with knee trouble in November, the world number one showed no signs of early season rust as he tore through the evening match at Rod Laver Arena in one hour and 34 minutes. \n“Happy for the start, of course,” Nadal, who lost last year’s final in a five-set classic to Roger Federer, told reporters. \n”It’s a positive start with a good result. If I do months without playing an official match, it’s always a little bit more difficult. \n”But I started with positive feelings. That’s the most important thing for me now. Of course, there are things to improve. \n“But the thing that I need to improve, the matches will give me those things, no? Victories are the most important thing now.” Tennis - Australian Open - Rafael Nadal of Spain v Victor Estrella Burgos of Dominican Republic - Rod Laver Arena, Melbourne, Australia, January 15, 2018. Estrella reacts after breaking Nadal's serve. REUTERS/Thomas Peter \nVictory never appeared in doubt against 37-year-old Estrella Burgos who was thrilled just to win three games against the energetic Spaniard. \nNadal mowed through the first set in 23 minutes and appeared determined to keep the points short as he charged forward to win 21 of 24 points at the net. Slideshow (3 Images) \nThe 31-year-old raised three match points with a huge serve and completed the rout with another that Estrella Burgos could only send long in return. \nThe 2009 champion’s bid for a second Australian Open title and 17th grand slam win will continue with a step up in class against 52nd-ranked Argentine Leonardo Mayer, who gave him a four-set test in the U.S. Open second round on the way to winning the trophy. \nHaving warmly embraced Estrella Burgos after sealing the one-sided win, Nadal said he could not afford to underestimate any opponent. \n“I believe that the doubts are good because when you have doubts, it’s because you aren’t too arrogant, because you have respect for your opponent, because you have respect for the game and because you don’t consider yourself unbelievably good,” he said. Editing by Ed Osmond", "external_links": [], "published": "2018-01-15T12:08:00.000+02:00", "crawled": "2018-01-15T12:16:11.009+02:00", "highlightTitle": ""}