{"organizations": [], "uuid": "6d918c1458e66616c4f212537db935fed43e9279", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180110.html", "section_title": "Archive News &amp; Video for Wednesday, 10 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-treasury-auction/update-1-strong-10-year-auction-stabilizes-u-s-bond-market-idUSL1N1P51PD", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Strong 10-year auction stabilizes U.S. bond market", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T04:54:00.000+02:00", "replies_count": 0, "uuid": "6d918c1458e66616c4f212537db935fed43e9279"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-treasury-auction/update-1-strong-10-year-auction-stabilizes-u-s-bond-market-idUSL1N1P51PD", "ord_in_thread": 0, "title": "UPDATE 1-Strong 10-year auction stabilizes U.S. bond market", "locations": [], "entities": {"persons": [{"name": "aaron kohli", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "bmo capital markets", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "treasuries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Recasts first paragraph, adds comment) NEW YORK, Jan 10 (Reuters) - Strong demand at a $20 billion U.S. 10-year government note sale on Wednesday stabilized a bond market that was rattled by a Bloomberg report that said China may pare or stop buying Treasuries because it sees them as unattractive amid rising U.S.-China trade tension. China is the biggest foreigner holder of U.S. government debt, totaling $1.19 trillion at the end of October. The latest auction, however, did not quell worries of a renewed selloff that already pushed 10-year yields near 2.60 percent, which were their highest since March earlier Wednesday. \"It wasn't the blowout auction that might have been expected at such high yield levels but 10s did face the headwind of fairly negative momentum,\" BMO Capital Markets interest rates strategist Aaron Kohli wrote in a note on the auction. In addition to the report of possibly less Chinese buying, U.S. yields have been lifted by the Bank of Japan's move on Tuesday to reduce its bond purchases, which raised worries about growing debt supply on the open market globally. At Wednesday's auction, investors scooped up nearly 80 percent of the 10-year Treasury supply with fund mangers, foreign central banks and other indirect bidders accounting for their biggest purchase of this debt maturity since August 2016. The latest 10-year supply fetched a yield of 2.579 percent, which was the highest since July 2014, Treasury data showed. The ratio of bids to the amount of 10-year notes offered was 2.69, which was the strongest since June 2016. The gauge of overall auction demand was 2.37 at the previous 10-year note auction in December. The robust auction results kindled appetite for Treasuries on the market, sending their yields from their session peaks. At 3 p.m. (2000 GMT), the 10-year yield was 2.549 percent , up marginally from Tuesday, Reuters data showed. Some analysts reckoned the robust demand stemmed from buying to exit bearish bets against 10-year Treasuries, and the high cost of borrowing them in the repurchase agreement market, reducing the chances of a snapback to lower yields. The 10-year auction was the second leg of this week's three-part sales of coupon-bearing Treasury securities. The Treasury Department, which sold $24 billion of three-year notes on Tuesday, will auction $12 billion in 30-year bonds at 1 p.m. (1800 GMT) on Thursday. \"Auction color aside, we would be careful and not rush to judgment that this was another turning point and great buying opportunity,\" said George Goncalves, head of U.S. rates strategy at Nomura Securities International in New York. (Reporting by Richard Leong; Editing by Jonathan Oatis and Chizu Nomiyama)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T04:54:00.000+02:00", "crawled": "2018-01-11T12:47:23.022+02:00", "highlightTitle": ""}