{"organizations": [], "uuid": "16edf5d9560d42a87d9656bf37945a0c7960c6ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225430034&w=1200&r=LYNXMPEE0P0HH", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-davos-meeting-trump/trump-to-tell-davos-he-wont-tolerate-trade-abuses-ip-theft-idUKKBN1FF102", "country": "US", "domain_rank": 408, "title": "Trump to tell Davos he won't tolerate trade abuses, IP theft", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T11:23:00.000+02:00", "replies_count": 0, "uuid": "16edf5d9560d42a87d9656bf37945a0c7960c6ad"}, "author": "", "url": "https://uk.reuters.com/article/uk-davos-meeting-trump/trump-to-tell-davos-he-wont-tolerate-trade-abuses-ip-theft-idUKKBN1FF102", "ord_in_thread": 0, "title": "Trump to tell Davos he won't tolerate trade abuses, IP theft", "locations": [], "entities": {"persons": [{"name": "davos", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "steve ho", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "davos", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "america first", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 9:22 AM / Updated 18 minutes ago Trump warns Davos on unfair trade, says U.S. 'open for business' Steve Holland , Yara Bayoumy , Noah Barkin 6 Min Read \nDAVOS, Switzerland (Reuters) - U.S. President Donald Trump took his “America First” message to the world’s elite on Friday, telling a summit of business and political leaders that the United States would “no longer turn a blind eye” to what he described as unfair trade practices. \nTrump became the first sitting U.S. President to address the annual conclave of the rich and powerful at the Swiss ski resort of Davos for 18 years, closing the summit with a mostly upbeat speech that declared the United States “open for business”. \n“Now is the best time to bring your money, your jobs, your businesses to America,” he said, singling out tax cuts and curbs to regulation as boosting the investment climate. “The world is witnessing the resurgence of a strong and prosperous America.” \nHe said he would always promote “America First”, as he expected other world leaders to do on behalf of their own countries, but added: “America First does not mean America alone. When the United States grows so does the world.” \nBut he swiftly turned to a theme of demanding tougher enforcement of trade rules, accusing unidentified countries of unfair practices, including stealing intellectual property and providing state aid to industry. \n“We will enforce our trade laws and restore integrity to the trading system. Only by insisting on fair and reciprocal trade can we create a system that works not just for the United States but for all nations,” Trump said. \n“The United States will no longer turn a blind eye to unfair trade practices,” he said. “We cannot have free and open trade if some countries exploit the system at the expense of others.” \nHis speech was mostly met by polite applause, although he drew some jeers and whistles during a question and answer session, when he attacked the news media: “It wasn’t until I became a politician that I realised how nasty, how mean, how vicious and how fake the press can be,” he said. \nWhile he has a record of opposing trade agreements involving multiple countries, he said the United States would seek bilateral deals with individual states. That could include members of a Trans-Pacific trade agreement from which he has withdrawn, he said, adding he would consider negotiating with them collectively if it was in the U.S. interest. \nBefore his trip to Davos, Trump imposed 30 percent tariffs on imported solar panels, among the first unilateral trade restrictions made by the administration as part of a broader protectionist agenda. \nMNUCHIN “NOT TRYING TO TALK DOWN DOLLAR” U.S. President Donald Trump looks on during a meeting with President Alain Berset (not pictured) of Switzerland, as he attends the World Economic Forum (WEF) annual meeting in Davos, Switzerland January 26, 2018. REUTERS/Denis Balibouse \nThe Trump administration’s debut at Davos also caused a storm because of comments by Treasury Secretary Steven Mnuchin, who said earlier this week the United States benefited from a lower dollar, which would make its exports cheaper. \nThose remarks sent the U.S. currency tumbling and drew sharp rebukes from the European Central Bank chief and other figures, who view countries talking down their own currencies as a violation of unwritten rules to keep trade balanced. \nMnuchin told CNBC television on Friday he was “absolutely not trying to talk down the dollar” and that his remarks had been taken out of context. “What I said was actually very even-handed and consistent with what I said before.” \nOn Thursday, Trump said he ultimately wanted the dollar to be strong. U.S. officials said there was no disagreement between Trump and Mnuchin, and the Treasury Secretary had been making a factual observation about the impact of a lower dollar, not announcing a policy preference to drive it down. U.S. President Donald Trump arrives at the World Economic Forum (WEF) annual meeting in Davos, Switzerland January 26, 2018. REUTERS/Carlos Barria \nDespite Trump’s tough trade talk, those in the audience mostly noted the upbeat tone of his speech. \n“I think he came here to make not just American but global business comfortable about where America is now,” said IHS Markit’s chief economist, Nariman Behravesh. “He wasn’t trying to convert people to his own views, but saying we are a great economy, come and invest in the U.S.” \nAndrei Guryev, chief executive of Russian fertiliser giant Phosagro, said Trump had spoken “how big business people should be speaking at important road shows of their own companies”. \nThat did not please everyone. Winnie Byanyima, director of Oxfam International, said: “Trump’s boastful sales pitch was a victory lap for the trillions of tax cuts that the wealthy elites and corporations have clamoured for.” Related Coverage U.N.'s rights chief rejects Trump speech as 'script of the 20th century' \nStill, the reception was more polite than might have been expected, given the open anxiety with which the prospect of a Trump presidency was met at Davos a year ago. \nTrump’s questioning of trade, withdrawal from the Paris climate treaty and nationalist rhetoric sit uneasily at the quintessentially globalist event. Throughout the week, European leaders spoke with worry about the rise of populism. \nWithout mentioning Trump by name, German Chancellor Angela Merkel evoked the build-up to the two world wars. \nTrump hosted a dinner with business leaders on Thursday night. Two European executives told Reuters they stayed away because they did not want to shake his hand. One said he consulted his wife and children before deciding not to go. Additional reporting by Alessandra Galloni, Dmitry Zhdannikov, Silvia Aloisi and Simon Robinson; Writing by Peter Graff; Editing by Mark Bendeich", "external_links": [], "published": "2018-01-26T11:23:00.000+02:00", "crawled": "2018-01-26T11:34:58.008+02:00", "highlightTitle": ""}