{"organizations": [], "uuid": "f551e1bbb38d28ab85524f247228d1cb3a5c6771", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-butterfly-acquires-pacifico-aquaculture.html", "country": "US", "domain_rank": 767, "title": "Butterfly Acquires Pacifico Aquaculture", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.286, "site_type": "news", "published": "2018-01-09T16:30:00.000+02:00", "replies_count": 0, "uuid": "f551e1bbb38d28ab85524f247228d1cb3a5c6771"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-butterfly-acquires-pacifico-aquaculture.html", "ord_in_thread": 0, "title": "Butterfly Acquires Pacifico Aquaculture", "locations": [], "entities": {"persons": [{"name": "pacifico", "sentiment": "none"}, {"name": "omar alfi", "sentiment": "none"}, {"name": "daniel farag", "sentiment": "none"}], "locations": [{"name": "ensenada", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "baja california", "sentiment": "none"}, {"name": "pacifico", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "butterfly acquires pacifico aquaculture los angeles", "sentiment": "negative"}, {"name": "pacifico aquaculture", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES and ENSENADA, Mexico, Jan. 9, 2018 /PRNewswire/ -- Butterfly, a Los Angeles-based private equity firm specializing in the food sector, today announced it has acquired Pacifico Aquaculture (\"Pacifico\"), a leader in sustainable ocean-raised aquaculture. Terms of the transaction were not disclosed.\nFounded in 2010 and based in Baja California, Mexico, Pacifico is the world's first and only producer of ocean-raised striped bass. Pacifico's striped bass is prized by consumers and chefs for its premium quality, flavor and texture, and is sold through well-known distributors, food retailers and restaurants across North America.\n\"This is an exciting new chapter for Pacifico and we look forward to our partnership with the Butterfly team,\" said Omar Alfi and Daniel Farag, Co-CEOs of Pacifico. \"Butterfly understands our business well and shares our vision for the future, and we are excited to have a partner with deep industry expertise in the food sector.\"\n\"The future for sustainable ocean-raised aquaculture is extraordinarily bright and we are excited to back the Pacifico team to help expand their reach throughout North America and around the world,\" said Adam Waglay, who co-founded Butterfly alongside Dustin Beck. \"We love that Pacifico is committed to sustainable and responsible aquaculture practices and has received numerous sustainability certifications and awards, including the highest four-star designation from the Global Aquaculture Alliance's Best Aquaculture Practices (BAP) certification program earlier this year.\"\nMr. Beck added: \"Pacifico's unwavering commitment to innovation, quality and sustainability has created a unique offering that is positioned extremely well for growth. We are thrilled to partner with Omar, Daniel and the rest of the team to help them grow Pacifico into a world-class aquaculture platform.\"\nKirkland & Ellis acted as legal advisor to Butterfly. Jones Day acted as legal advisor to Pacifico.\nAbout Pacifico Aquaculture:\nFounded in 2010 and based in Ensenada, Baja California, Mexico, Pacifico Aquaculture is a leader in sustainable, ocean-raised aquaculture that produces premium ocean-raised striped bass. The Company is the world's first and only producer of ocean-raised striped bass. Pacifico's striped bass are sold through well-known distributors, food retailers and restaurants across North America. For more information, visit www.pacificoaquaculture.com .\nAbout Butterfly:\nButterfly Equity (\"Butterfly\") is a Los Angeles, California based private equity firm specializing in the food sector, spanning the entire food value chain from \"seed to fork\" via four target verticals: agriculture & aquaculture, food & beverage products, food distribution and foodservice. Butterfly aims to generate attractive investment returns through deep industry specialization, a unique approach to sourcing transactions, and leveraging an operations-focused and technology-driven approach to value creation.\nView original content with multimedia: http://www.prnewswire.com/news-releases/butterfly-acquires-pacifico-aquaculture-300579635.html\nSOURCE Butterfly", "external_links": ["http://www.pacificoaquaculture.com/", "http://www.prnewswire.com/news-releases/butterfly-acquires-pacifico-aquaculture-300579635.html"], "published": "2018-01-09T16:30:00.000+02:00", "crawled": "2018-01-09T17:39:30.014+02:00", "highlightTitle": ""}