{"organizations": [], "uuid": "bfecf494987a7da0bb4a4d77415473a9382c3bde", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104940900-guyatcomputer.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/12/student-loan-forgiveness-isnt-often-a-forgiving-process.html", "country": "US", "domain_rank": 767, "title": "Student loan forgiveness isn't often a forgiving process", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T18:40:00.000+02:00", "replies_count": 0, "uuid": "bfecf494987a7da0bb4a4d77415473a9382c3bde"}, "author": "Annie Nova", "url": "https://www.cnbc.com/2018/01/12/student-loan-forgiveness-isnt-often-a-forgiving-process.html", "ord_in_thread": 0, "title": "Student loan forgiveness isn't often a forgiving process", "locations": [], "entities": {"persons": [{"name": "nick rizzutti", "sentiment": "negative"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "rizzutti", "sentiment": "none"}], "locations": [{"name": "baltimore", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}], "organizations": [{"name": "johns hopkins bloomberg school of public health", "sentiment": "negative"}, {"name": "public service loan forgiveness", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "At the Johns Hopkins Bloomberg School of Public Health in Baltimore, Maryland, Nick Rizzutti spends his days researching how different environments affect the health of children.\nTo get there, he racked up more than $80,000 in student debt.\nSo Rizzutti, 28, was relieved to find out that he qualifies for Public Service Loan Forgiveness . That program, signed into law by President George W. Bush in 2007, allows certain members of the military , classroom teachers and social workers, as well as not-for-profit and government employees, to have certain loans eliminated after 10 years of on-time payments.\n(It's just one of several programs for loan forgiveness, cancellation and discharge for federal student loans.)\n\"Just the thought that I might not get forgiveness is scary. I'd be making payments for 30 years. It would delay my life.\" -Nick Rizzutti, Student loan borrower Unfortunately, after a year of chipping away at his student debt, Rizzutti learned during a phone call with a financial aid officer that not all loans are eligible for forgiveness — and some of his loans did not qualify.\nJust like that, he was back at square one.\n\"It was disappointing,\" said Rizzutti, who immediately moved his various loans into a direct consolidation loan, which does qualify for forgiveness.\nBut the experience left him on edge.\n\"Just the thought that I might not get forgiveness is scary,\" Rizzutti said. \"I'd be making payments for 30 years. It would delay my life.\"\nAs it turns out, plenty of people in public service jobs — some two-thirds of whom make less than $50,000 a year — believe they're paying their way to loan forgiveness yet actually don't qualify for one technical reason or another.\nEach year, more than 30 percent of people who file a so-called Employee Certification Form, which is supposed to confirm one's public service loan forgiveness status, are denied, according to the Department of Education. And this form is not mandatory for public service loan forgiveness, and so the total number of people denied is probably greater.\nThese problems are so common that the Consumer Financial Protection Bureau issued a report in June on the failures of the student loan industry to properly inform people about forgiveness requirements and rights.\n\"Borrowers have identified a range of student loan industry practices that delay, defer, or deny access to expected debt relief,\" according to the report.\nJay Fleischman, a student loan lawyer, said he's heard from people who were almost done with that decade of repayment when they first learned that none of those payments counted toward forgiveness.\n\"They call me up because they want me to help guide them through getting finalized,\" he said. \"And I'm the one who has to be the bearer of bad news: They're going to have to start from scratch. I have people cry on the phone.\"\nIt's imperative that people who believe they might qualify for forgiveness act fast to make sure they're doing everything right, said Miranda Marquit, a financial expert at Student Loan Hero, a website for managing debt.\n\"A lot of time you don't realize there's a problem until you actually apply for loan forgiveness,\" she said.\nHere's how to make sure you're on — and staying on — the right path.\n1) Make sure you have the right loans Like many former students, Rizzutti had a few different kinds of loans. His Federal Family Education Loan ( FFEL ) and his Perkins Loan did not qualify for loan forgiveness.\nThat's because only \"direct loans\" — which include direct subsidized and unsubsidized loans, direct PLUS loans and direct consolidation loans — are eligible under the Public Student Loan Forgiveness Program. (Other loan forgiveness programs have their own rules.)\n\"I'm the one who has to be the bearer of bad news: They're going to have to start from scratch.\" -Jay Fleischman, student loan lawyer Check to see if you can bundle your non-qualifying loans into a Direct Consolidation Loan. (Most federal loans are eligible ; private student loans are not.) Only once your loans are under this title will your student debt payments move you along the Public Student Loan Forgiveness 10-year timeline.\nIf you already have some direct loans you've made forgiveness-qualifying payments on, you might not want to consolidate those with the non-qualifying loans into one new debt. That restarts the clock on forgiveness.\nNot sure what kind of loans you have? Check your account at the Department of Education's Federal Student Aid site to find out the types of loans you have.\nYou also need to make sure that you're enrolled in the right type of repayment plan; for Public Student Loan Forgiveness, specifically, one of the income-based programs. Make sure you don't have a repayment plan that doesn't count toward forgiveness, such as an extended repayment plan.\nshow chapters Higher education students may face crippling tax hike with proposed GOP tax bill 8:29 PM ET Fri, 17 Nov 2017 | 04:33 2) Make sure you have the right employer Qualifying employers under the Public Student Loan Forgiveness program include government organizations (federal, state, local or tribal), not-for-profit organizations that are tax exempt under Section 501(c)(3) and some other not-for-profits that provide public service.\nAmeriCorps and Peace Corps volunteers also count as qualifying employment.\nAlthough you must work full time to be eligible, you can work part time for say, two qualifying employers, as long as you're working more than 30 hours a week in total.\nYour time with a qualifying employer doesn't need to be consecutive. You can work for two years at a qualifying not-for-profit, for example, and then pause your 10-year timeline to work for two years in the private sector. If you resume employment at a qualifying employer, the clock toward forgiveness will start ticking again.\n3) Confirm that you're on track Every year you should fill out the Employment Certification Form .\nOnce this form is submitted, all of your loans will be transferred to Fed Loan Servicing , the designated loan company for the Public Service Loan Forgiveness Program. Each year you will receive confirmation on the number of successful payments you've completed.\nBut even with filling out that form, Fleischman said he has still seen things go wrong. He advises people to keep a paper trail of their work history and any communication they have with their student loan provider.\n\"If there's a problem down the road, and you've thrown out your pay stubs, you have nothing to rely on,\" he said.\n4) Watch for new developments Students just starting to think about loan forgiveness have one more thing to worry about. In December, Rep. Virginia Foxx, R-N.C., chairwoman of the House Committee on Education and the Workforce, proposed a bill that would greatly reduce the Public Service Loan Forgiveness Program, by further narrowing eligibility.\n\"It removes the incentive to take a job that doesn't pay as much, but is in the public good,\" Marquit said. \"It might encourage more people to go into the private sector.\"\nBitcoin, once 'sketchy,' becomes more mainstream\nSome cryptocurrency-backed debit cards dropped from Visa network, leaving users scrambling\nBitcoin is too risky to treat as a 'serious' investment, financial advisers say", "external_links": [], "published": "2018-01-12T18:40:00.000+02:00", "crawled": "2018-01-12T18:52:22.003+02:00", "highlightTitle": ""}