{"organizations": [], "uuid": "ed9a2cd18df85a9d4090152d7775b961d580bed0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-stemline-therapeutics-announces-proposed-public-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "Stemline Therapeutics Announces Proposed Public Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T00:01:00.000+02:00", "replies_count": 0, "uuid": "ed9a2cd18df85a9d4090152d7775b961d580bed0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-stemline-therapeutics-announces-proposed-public-offering-of-common-stock.html", "ord_in_thread": 0, "title": "Stemline Therapeutics Announces Proposed Public Offering of Common Stock", "locations": [], "entities": {"persons": [{"name": "stemline", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "stemline therapeutics, inc.", "sentiment": "neutral"}, {"name": "llc", "sentiment": "none"}, {"name": "cowen and company", "sentiment": "none"}, {"name": "j.p. morgan securities llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 22, 2018 (GLOBE NEWSWIRE) -- Stemline Therapeutics, Inc. (Nasdaq:STML), a clinical-stage biopharmaceutical company developing novel oncology therapeutics, today announced that it intends to offer and sell, subject to market conditions, 3,700,000 shares of its common stock in an underwritten public offering. All of the shares to be sold in the offering will be offered by Stemline. In addition, Stemline intends to grant the underwriters a 30-day option to purchase up to an additional 555,000 shares of its common stock offered in the public offering.\nJ.P. Morgan Securities LLC and Cowen and Company, LLC are acting as joint book-running managers for the offering.\nStemline intends to use the net proceeds from this offering for (i) clinical, regulatory, manufacturing and, if and when approved, potential commercial activities of SL‑401; (ii) clinical development of SL‑801 and SL‑701; (iii) research and development activities; (iv) potential acquisitions and in-licensing; and (v) other general corporate purposes.\nStemline has filed a preliminary prospectus supplement to its shelf registration statement on Form S-3 (File No. 333-219794) with the U.S. Securities and Exchange Commission (“SEC”) for the proposed public offering of its common stock. The offering will be made only by means of a prospectus and a prospectus supplement, which will be available on the SEC's web site at www.sec.gov . Copies of the preliminary prospectus supplement and the accompanying prospectus relating to these securities may also be obtained, when available, by contacting J.P. Morgan Securities LLC, c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, New York 11717, Telephone: (866) 803-9204, or from Cowen and Company, LLC, c/o Broadridge Financial Services, 1155 Long Island Avenue, Edgewood, NY 11717, Attention: Prospectus Department or by telephone at (631) 274-2806.\nThe offering of these securities is being made under an effective shelf registration statement on file with the SEC. This press release shall not constitute an offer to sell or the solicitation of an offer to buy nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Stemline Therapeutics\nStemline Therapeutics, Inc. is a clinical-stage biopharmaceutical company developing novel oncology therapeutics. Stemline is developing three clinical stage product candidates, SL-401, SL-801, and SL-701. SL-401 is a targeted therapy directed to the interleukin-3 receptor (CD123) present on a wide range of malignancies. SL-401 has completed a pivotal trial in blastic plasmacytoid dendritic cell neoplasm (BPDCN), for which it was granted breakthrough therapy designation (BTD). SL-801 is a novel oral small molecule reversible inhibitor of XPO1 that is currently in a Phase 1 trial of patients with advanced solid tumors. SL-701, an immunotherapeutic, has completed a Phase 2 trial in patients with second-line glioblastoma and patients are being followed for long-term outcomes.\nForward-Looking Statements\nSome of the statements included in this press release may be forward-looking statements that involve a number of risks and uncertainties. For those statements, we claim the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. The factors that could cause our actual results to differ materially include: statements regarding the proposed public offering and the intended use of proceeds from the proposed offering; the success and timing of our clinical trials and preclinical studies for our product candidates, including site initiation, institutional review board approval, scientific review committee approval, patient accrual, safety, tolerability and efficacy data observed, and input from regulatory authorities including the risk that the FDA or other ex-U.S. national drug authority ultimately does not agree with our data, find our data supportive of approval, or approve any of our product candidates; our plans to develop and commercialize our product candidates; market acceptance of our products; reimbursement available for our products; our available cash and investments; our ability to obtain and maintain intellectual property protection for our product candidates; our ability to obtain and maintain intellectual property protection for our product candidates; our ability to manufacture; the performance of third-party manufacturers, clinical research organizations, clinical trial sponsors and clinical trial investigators; and other risk factors identified from time to time in our reports filed with the Securities and Exchange Commission. Any forward-looking statements set forth in this press release speak only as of the date of this press release. We do not intend to update any of these forward-looking statements to reflect events or circumstances that occur after the date hereof.\nContact\nInvestor Relations\nStemline Therapeutics, Inc.\n750 Lexington Avenue\nEleventh Floor\nNew York, NY 10022\nTel: 646-502-2307\nEmail: investorrelations@stemline.com\nSource:Stemline Therapeutics, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=OVGPfQEdjGbzDSYL0wr1NgTwhqVYUIBb0i8YnwLCOL0k-oF4iba3UwcgKmlQgOv7Nwl7-km84wX5QhviBfhXWw==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/44d891de-234b-4145-b2d5-7b863376c1b2", "https://www.globenewswire.com/Tracker?data=5G9wK1Q5LyNfqj7i6YBIzfJHN903XUIYgZ-22rCO2M4xa5Ai42u0LoNP1x4EkB1OCgx4S30rIHeMt-_ynCDQQR0tMBk-ZH-Ug9JRvyAakdEwF5kY5YZV8YmlL1X8AqNl"], "published": "2018-01-23T00:01:00.000+02:00", "crawled": "2018-01-23T02:17:08.008+02:00", "highlightTitle": ""}