{"organizations": [], "uuid": "5fa55c84b0ff91427e3d62916b1cc56aada46b68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/01/13/103301633-GettyImages-482963919-1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/us-oil-production-tops-10-million-barrels-a-day-for-first-time-since-1970.html", "country": "US", "domain_rank": 767, "title": "US oil production tops 10 million barrels a day for first time since 1970", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T20:22:00.000+02:00", "replies_count": 0, "uuid": "5fa55c84b0ff91427e3d62916b1cc56aada46b68"}, "author": "Patti Domm", "url": "https://www.cnbc.com/2018/01/31/us-oil-production-tops-10-million-barrels-a-day-for-first-time-since-1970.html", "ord_in_thread": 0, "title": "US oil production tops 10 million barrels a day for first time since 1970", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "More: Texas set for another oil boom The U.S. produced 10.038 million barrels a day in November, and produced 10.044 million in November, 1970. In weekly EIA data that will be revised, the U.S. produced 9.92 million barrels a day last week, up sharply from 8.9 million barrels a day a year ago. \"Just a decade ago, our net imports were 60% of total demand. Now, they're 20 percent,\" said Yergin. U.S. oil production, in fact, was half of what it is now a decade ago, during the financial crisis in 2008. But the high oil prices of 2008 were also the catalyst that propelled the U.S. shale industry, which has used evolving new technologies to extract oil from places once thought impossible. \"The U.S. could add upwards of 2 million barrels a day from where we are today by the end of 2019,\" said Yergin. CLOSE The Trump administration moved Thursday to vastly expand offshore drilling from the Atlantic to the Arctic oceans with a plan that would open up federal waters off California for the first time in more than three decades. (Jan. 4) AP The U.S., still an importer of crude, imported an average 8 million barrels a day over the past several weeks. The U.S. exported 1.77 million barrels of crude a day last week, and another 4.8 million barrels of refined products including gasoline, diesel and jet fuel. Harold Hamm, Continental Resources CEO, said on CNBC Wednesday that the U.S. could be a net exporter of oil by 2020. Critics of U.S. shale say the production is front-loaded with the biggest gains coming when wells are initially drilled, but the industry has continued to make itself more and more efficient, lowering its costs at the same time. Hamm said the Bakken, in North Dakota, still has a ways to run and its only the \"third inning\" in terms of development. \"The Bakken's demise was over exaggerated. The Bakken is back stronger than ever. The technology works better there than anywhere else,\" Hamm said. America's energy potential grew under the Obama administration, and the U.S. became a net exporter of natural gas, but the Trump administration has embraced energy as an economic force and has declared that the U.S. will be dominant, unlocking new sources of oil domestically. The Trump administration opened the door to more drilling, including offshore both coasts of the U.S. and Congress approved drilling in the Alaska National Wildlife Refuge as part of the tax package. It has also found the increase in U.S. oil prominence as a way to help its stated course of oil dominance. CLOSE 'White oil': Saudi Arabia seeks place on tourism map Video provided by AFP Newslook \"What's going to be very interesting is psychological when you hit that 10 million number, I think we've gone from energy dependence to self-sufficience to dominance,\" said Helima Croft, head of commodities strategy at RBC. \"When you think of yourself as dominant, that gives you the impetus for an even more active foreign policy.\" For instance, the U.S. could have more leverage in dealing with problematic countries. \"It gives them a freer hand to take a tougher line to deal with Venezuela…If we didn't have this abundant U.S. resource we 'd be worried about the energy implications of a Venezuela default,\" Croft said. Croft said when the U.S. was attacked by terrorists on Sept. 11, 2001, the worry was that oil disruptions from even minor producers could impact the U.S. supply and oil price. \"Just from a foreign policy perspective, so much of the discussion after 9/11 was we're supposed to be depending on this source of oil and what kind of bargains do we need to make with these producing countries,\" she said. \"Diversification in the post 9/11 period was about diversification of suppliers.\" Now, it's about where else can the U.S. find oil in America. © CNBC is a USA TODAY content partner offering financial news and commentary. Its content is produced independently of USA TODAY. CONNECT COMMENT EMAIL MORE", "external_links": [], "published": "2018-01-31T20:22:00.000+02:00", "crawled": "2018-01-31T20:31:41.677+02:00", "highlightTitle": ""}