{"organizations": [], "uuid": "9fedfcc93c57c30153fb792f03992b1d2ef4e905", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220474565&w=1200&r=LYNXMPEE0804J", "site_section": "http://feeds.reuters.com/reuters/UKStocksAndSharesNews/", "section_title": "Reuters: Stocks & Shares News", "url": "https://uk.reuters.com/article/uk-apple-shareholders-addiction-analysis/iphone-addiction-may-be-a-virtue-not-a-vice-for-investors-idUKKBN1EX2G6", "country": "US", "domain_rank": 408, "title": "IPhone addiction may be a virtue, not a vice for investors", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T09:55:00.000+02:00", "replies_count": 0, "uuid": "9fedfcc93c57c30153fb792f03992b1d2ef4e905"}, "author": "", "url": "https://uk.reuters.com/article/uk-apple-shareholders-addiction-analysis/iphone-addiction-may-be-a-virtue-not-a-vice-for-investors-idUKKBN1EX2G6", "ord_in_thread": 0, "title": "IPhone addiction may be a virtue, not a vice for investors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 11:20 PM / Updated 4 hours ago IPhone addiction may be a virtue, not a vice for investors Trevor Hunnicutt 6 Min Read \nNEW YORK (Reuters) - Apple Inc investors are shrugging off concerns raised by two shareholders about kids getting hooked on iPhones, saying that for now a little addiction might not be a bad thing for profits. FILE PHOTO: Boxes of iPhone X are pictured during its launch at the Apple store in Singapore, November 3, 2017. REUTERS/Edgar Su/File Photo \nHedge fund JANA Partners LLC and the California State Teachers’ Retirement System (CalSTRS) pension fund said on Saturday that iPhone overuse could be hurting children’s developing brains, an issue that may harm the company’s long-term market value. \nBut some investors said the habit-forming nature of gadgets and social media are one reason why companies like Apple, Google parent Alphabet Inc and Facebook Inc added $630 billion to their market value in 2017. \n“We invest in things that are addictive,” said Apple shareholder Ross Gerber, chief executive of Gerber Kawasaki Wealth and Investment Management. \nHe also owns stock in coffee retailer Starbucks Corp, casino operator MGM Resorts International and alcohol maker Constellation Brands Inc. \n“Addictive things are very profitable,” Gerber said. \nStill, the investment community is increasingly holding companies to higher social standards, and there is some concern that market-leading tech companies could draw attention from regulators much like alcohol, tobacco and gambling companies have in the past. \nAlphabet and Facebook could not immediately be reached for comment on Monday. Facebook has said social media can be beneficial if used appropriately. \nIn a statement to Reuters, Apple said it has offered a range of controls on iPhones since 2008 that allow parents to restrict content, including apps, movies, websites, songs and books, as well as cellular data, password settings and other features. \n“Effectively anything a child could download or access online can be easily blocked or restricted by a parent,” Apple said in the statement. \nApple shares fell marginally on Monday. CalSTRS holds $1.9 billion in Apple stock, a sliver of the company’s nearly $900 billion market value, while JANA declined to disclose the size of its smaller stake. \n“Before Apple speaks, I think it’s too early to change the narrative” for investors, said Peter Jones, vice president of research for Ferguson Wellman Capital Management, which has about 350,000 Apple shares. \nSocial media companies, not hardware makers, are more deserving of any addiction-related scrutiny, some said. \nJordan Waldrep, who invests in alcohol, tobacco and gambling stocks as manager of the USA Mutuals Vice Fund, said blaming Apple for its customers’ addiction was analogous to blaming makers of cigarette packs instead of tobacco companies. FILE PHOTO: A attendee uses a new iPhone X during a presentation for the media in Beijing, China October 31, 2017. REUTERS/Thomas Peter/File Photo \n“The social media, the cigarettes, are the addictive product,” he said. Waldrep’s Vice fund does not own Apple, but Waldrep said he would consider including social media companies. \nKim Forrest, senior portfolio manager and vice president at Fort Pitt Capital Group, agreed that companies like Facebook, Twitter Inc and Snap Inc might be more at risk than Apple if investors and regulators push back on how much time people spend on mobile devices. \n“Apple is just the delivery device,” said Forrest, who said Fort Pitt has limited Apple holdings. “It’s only compelling with software. Software is the dopamine releaser that keeps you coming back.” \nTwitter declined to comment and Snap could not immediately be reached. \nThe letter from JANA and CalSTRS recommends Apple set up a committee of child-development experts and make more new tools available to parents. \nIn its statement, Apple did not directly respond to the investors’ demands but said changes are in store for its parental controls. It did not provide details. \n“We are constantly looking for ways to make our experiences better,” Apple said. “We have new features and enhancements planned for the future, to add functionality and make these tools even more robust.” \nThe addiction issue gained notoriety when former Disney child star Selena Gomez said she cancelled a 2016 world tour to go to therapy for depression and low self-esteem, feelings she linked to a social media addiction. \nFears about smartphone addiction have already kicked off regulatory backlash. In December, the French education minister said mobile phones would be banned in schools, and draft legislation in France would require children under 16 to seek parental approval to open a Facebook account. \nEven tech insiders are among the vocal critics of social media and its addictive potential. \n“Apple Watches, Google Phones, Facebook, Twitter - they’ve gotten so good at getting us to go for another click, another dopamine hit,” said Tony Fadell, a former Apple executive, on Twitter. \nJohn Streur, chief executive of Calvert Research and Management, an Apple shareholder that focuses on social responsibility, said it is plausible that tech devices may some day be understood to hold risks we do not currently understand well. \nThat would hurt investors if evidence later emerged that companies intentionally built features that create dependency and had evidence that doing so was unsafe. \nFor the time being, John Carey, a portfolio manager at Amundi Pioneer Asset Management in Boston, said concerns over the human impacts from being glued to screens are not likely to cut into profits. The company holds Apple stock, but the funds Carey manages do not. \n“I doubt there will be any impact on the use of smartphones,” he said. “We’re already addicted to them.” Reporting by Trevor Hunnicutt; Additional reporting by Ross Kerber, April Joyner, Sinead Carew, David Ingram, Elizabeth Dilts and Stephen Nellis; Editing by Megan Davies, Meredith Mazzilli and Leslie Adler", "external_links": [], "published": "2018-01-09T09:55:00.000+02:00", "crawled": "2018-01-09T10:33:32.002+02:00", "highlightTitle": ""}