{"organizations": [], "uuid": "6b927bfceb8023a1195065524be9617419c540d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1220979061&w=1200&r=LYNXMPEE0A01Q", "site_section": "http://www.reuters.com/resources/archive/us/20180110.html", "section_title": "Archive News &amp; Video for Wednesday, 10 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-japan-economy-debt/japan-to-delay-budget-surplus-to-fiscal-year-2027-nikkei-idUSKBN1F001R", "country": "US", "domain_rank": 408, "title": "Japan to forecast delay in budget surplus to FY2027: Nikkei", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.175, "site_type": "news", "published": "2018-01-11T08:56:00.000+02:00", "replies_count": 0, "uuid": "6b927bfceb8023a1195065524be9617419c540d9"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-japan-economy-debt/japan-to-delay-budget-surplus-to-fiscal-year-2027-nikkei-idUSKBN1F001R", "ord_in_thread": 0, "title": "Japan to forecast delay in budget surplus to FY2027: Nikkei", "locations": [], "entities": {"persons": [{"name": "shinzo abe", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "cabinet office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO (Reuters) - Japan is set to push back its projections for achieving a primary budget surplus by two years to the 2027 fiscal year, the Nikkei business daily reported on Thursday, highlighting the difficulty of restoring fiscal health as spending grows.\nNew projections by the Cabinet Office will be presented to the government’s top economic policy council later this month, the Nikkei reported without citing sources. That would provide the basis for a new fiscal reform plan, to be drawn up by the government this summer.\nMarket participants are paying close attention to a new deadline the government will set for balancing the budget. Fiscal reform is a matter of urgency for Japan’s government saddled with the industrial world’s heaviest debt burden at more than twice the size of its economy.\nHowever, analysts say Prime Minister Shinzo Abe’s government has put fiscal reform on the back burner, as the economy recovers, tax revenue grows and the Bank of Japan prints money to buy debt under its aggressive monetary stimulus.\nThe government’s previous twice-yearly projections last July showed the budget balance -- which excludes debt servicing and new bond sales -- would swing to a surplus in the fiscal year ending in March 2026.\nIts original goal was to achieve the surplus in fiscal 2020. But Abe’s ruling Liberal Democratic Party omitted this deadline from its campaign platform for last October’s election and made spending on education and welfare a core of its campaign.\nAbe has expressed a desire to achieve the primary budget surplus as early as possible. But the premier remains hesitant to set a binding cap on spending, as he focuses more on growth than austerity to revive the economy and restore fiscal health.\nSome analysts are sceptical about the budget-balancing goal.\nIn recent years the government has compiled budgets in the way that counts on high growth and bullish tax revenue estimates while securing spending to a full, said Koya Miyamae, senior fiscal analyst at SMBC Nikko Securities.\n“If the government keeps compiling budgets this way, achieving a primary budget surplus will remain difficult. Aggressive steps are needed such as setting a strict ceiling on overall spending,” Miyamae said.\nAbe’s government last month compiled a 97.7 trillion yen ($875 billion) budget -- a record high for the sixth year -- for fiscal 2018, with bulging welfare spending due to an ageing population and the cost of servicing snowballing debt straining public finances.\n($1 = 111.5800 yen)\nReporting by Kaori Kaneko and Tetsushi Kajimoto; Editing by Richard Pullin and Sam Holmes\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T08:56:00.000+02:00", "crawled": "2018-01-11T12:21:58.016+02:00", "highlightTitle": ""}