{"organizations": [], "uuid": "6bcf95aa55d5e60a5d9590601d6d0defef1f2f45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-homology-medicines-appoints-matthew-r-patterson-to-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Homology Medicines Appoints Matthew R. Patterson to Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.971, "site_type": "news", "published": "2018-01-17T16:30:00.000+02:00", "replies_count": 0, "uuid": "6bcf95aa55d5e60a5d9590601d6d0defef1f2f45"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-homology-medicines-appoints-matthew-r-patterson-to-board-of-directors.html", "ord_in_thread": 0, "title": "Homology Medicines Appoints Matthew R. Patterson to Board of Directors", "locations": [], "entities": {"persons": [{"name": "matthew r. patterson", "sentiment": "negative"}, {"name": "matt", "sentiment": "none"}, {"name": "arthur tzianabos", "sentiment": "none"}, {"name": "patterson", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "bedford", "sentiment": "none"}], "organizations": [{"name": "board of directors", "sentiment": "negative"}, {"name": "homology medicines, inc.", "sentiment": "neutral"}, {"name": "audentes", "sentiment": "none"}, {"name": "alliance for regenerative medicine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEDFORD, Mass., Jan. 17, 2018 /PRNewswire/ -- Homology Medicines, Inc., a genetic medicines company, announced today the appointment of Matthew R. Patterson, Co-Founder, President and Chief Executive Officer of Audentes Therapeutics, to Homology's Board of Directors. Mr. Patterson is a biotech industry leader with more than 24 years of experience in research, development and commercialization of innovative treatments for rare diseases.\n\"We are pleased to welcome Matt whose operational, clinical, regulatory and commercial expertise in rare diseases and gene therapy, as well as his unwavering commitment to patients, will support Homology's mission,\" said Arthur Tzianabos, Ph.D., President and Chief Executive Officer of Homology Medicines. \"We look forward to his contributions as we continue to progress our gene editing and gene therapy platform to develop potentially curative treatments for patients with severe rare genetic diseases.\"\nIn addition to his role at Audentes, Mr. Patterson serves as Vice Chairman of the Alliance for Regenerative Medicine. Previously, Mr. Patterson held positions of senior management in both private and public biotechnology companies, including Genzyme Corporation, BioMarin Pharmaceutical and Amicus Therapeutics. Prior to Audentes he was an Entrepreneur-In-Residence with OrbiMed, the world's largest healthcare-dedicated investment firm.\n\"Homology is uniquely positioned in the genetic medicines space with an experienced and patient-focused management team and a proprietary, nuclease-free in vivo gene editing and gene therapy platform,\" said Mr. Patterson. \"I am excited to join the Board and work with the team to apply Homology's platform to rare diseases with the goal of providing transformational treatments to patients.\"\nAbout Homology Medicines, Inc.\nHomology Medicines is a genetic medicines company translating proprietary gene editing and gene therapy technologies into novel treatments for patients with rare diseases. The combination of a new multidimensional gene correction platform and a management team that has successfully developed and commercialized therapies for the treatment of rare diseases positions the Company to move beyond the current limitations of gene therapy and gene editing approaches to improve patient care. Homology Medicines has built foundational intellectual property on gene editing and gene therapy using vectors derived from naturally occurring human adeno-associated viruses (AAVs). The Company's technology is precise, on-target and highly efficient for in vivo editing of genetic mutations. The team and technology create a significant opportunity for Homology to rapidly advance a diverse pipeline of new medicines that address and potentially cure the underlying cause of genetic diseases. For more information, please visit www.homologymedicines.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/homology-medicines-appoints-matthew-r-patterson-to-board-of-directors-300583616.html\nSOURCE Homology Medicines, Inc.", "external_links": ["http://www.homologymedicines.com/", "http://www.prnewswire.com/news-releases/homology-medicines-appoints-matthew-r-patterson-to-board-of-directors-300583616.html"], "published": "2018-01-17T16:30:00.000+02:00", "crawled": "2018-01-17T16:36:55.013+02:00", "highlightTitle": ""}