{"organizations": [], "uuid": "3dd4cc8ef866155b572613aa37c7427439e887c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-mvc-capital-announces-fiscal-fourth-quarter-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "MVC Capital Announces Fiscal Fourth Quarter and Full Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.658, "site_type": "news", "published": "2018-01-17T01:30:00.000+02:00", "replies_count": 0, "uuid": "3dd4cc8ef866155b572613aa37c7427439e887c1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-mvc-capital-announces-fiscal-fourth-quarter-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "MVC Capital Announces Fiscal Fourth Quarter and Full Year 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.y.", "sentiment": "none"}], "organizations": [{"name": "mvc", "sentiment": "negative"}, {"name": "mvc capital announces fiscal fourth quarter", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "mvc capital, inc.", "sentiment": "neutral"}, {"name": "bdc", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "essner manufacturing", "sentiment": "none"}, {"name": "black diamond equipment rental", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PURCHASE, N.Y., Jan. 16, 2018 (GLOBE NEWSWIRE) -- MVC Capital, Inc. (NYSE:MVC) (the Company), a publicly traded business development company (BDC) that makes private debt and equity investments, announced its financial results for the fiscal fourth quarter and full year ended October 31, 2017.\nRecent Highlights\nMade three new yielding investments totaling $16.2 million.\n- Invested $5.0 million in a note issued by Highpoint Global, LLC at a 14% interest rate\n- Invested $3.7 million in a note issued by Essner Manufacturing at an interest rate of between 10.5% and 11.5% over the life of the loan (investment made after the end of the fiscal quarter)\n- Invested $7.5 million in a note issued by Black Diamond Equipment Rental at a 12.5% interest rate and received a warrant (investment made after the end of the fiscal quarter) After the end of the fiscal quarter, completed a public offering of 6.25% senior notes due November 30, 2022 with net proceeds to the company of $111.3 million (See \"Subsequent Events\" below). After the end of the fiscal quarter, redeemed all outstanding 7.25% Senior Notes due 2023 for $114.4 million (See \"Subsequent Events\" below). After the end of the fiscal quarter, acquired 2,293,577 shares of its common stock at $10.90 price per share (at an aggregate cost of $25 million) via a modified “Dutch Auction” Tender Offer (See \"Subsequent Events\" below).(The estimated NAV accretion of $0.28 per share is not reflected in the October 31, 2017 quarter-end NAV of $13.24 per share). Posted net realized gains of $89.9 million during fiscal 2017 from portfolio sales/exchanges, primarily attributable to the monetization of U.S. Gas & Electric, Inc. Generated total operating income of $5.5 million in the fourth quarter of fiscal 2017, compared to $5.4 million for the same quarter of fiscal 2016. Received a $10 million loan repayment from Quantum Plastics, LLC and realized a gain of $540K on the warrant.\nFinancial Results\nQuarter Ended (Unaudited)($ in thousands, except per share data) Q4 2017 Q3 2017 Q2 2017 Q1 2017 Q4 2016 Total operating income 5,490 7,305 3,929 3,380 5,417 Management fee 1,335 1,393 1,696 1,814 1,721 Portfolio fees - asset management 148 146 138 177 183 Management fee - asset management 67 67 49 62 72 Administrative 983 804 1,172 1,474 802 Interest, fees and other borrowing costs 2,495 2,649 2,606 2,538 2,598 Net Incentive compensation (1,224 ) 5,077 985 760 577 Total waiver by adviser (372 ) (386 ) (461 ) (491 ) (467 ) Tax expense 1 - - 1 1 Net operating income (loss) before net realized and unrealized gains 2,057 (2,445 ) (2,256 ) (2,955 ) (70 ) Net (decrease) increase in net assets resulting from operations (4,028 ) 23,906 3,069 4,377 5,279 Net (decrease) increase in net assets resulting from operations per share (0.17 ) 1.06 0.14 0.19 0.23 Net asset value per share 13.24 13.38 12.45 12.45 12.39 For the fourth quarter of fiscal 2017, the Company earned $4.4 million in interest income and $1.1 million in dividend and fee income, compared to $4.2 million and $1.2 million, respectively, for the same quarter of fiscal 2016.\nThe Company reported net operating income of $2.1 million for the fourth quarter of fiscal 2017, compared to net operating loss of $70,000 for the same quarter in fiscal 2016.\nFor the fiscal year 2017, the Company earned $16.6 million in interest income and $3.5 million in dividend, fee and other income, compared to $19.5 million and $17.9 million, respectively, for fiscal year 2016.\nThe Company reported a net operating loss of $5.6 million for the fiscal year 2017, compared to net operating income of $19.3 million for fiscal year 2016.\nPortfolio Adjustments and Liquidity\nAs of October 31, 2017, the Company's net assets were $279.5 million, or $13.24 per share, compared with net assets of $301.8 million, or $13.38 per share, at the end of the prior fiscal quarter.\nAs of October 31, 2017, MVC had investments in portfolio companies totaling $292.5 million and cash and cash equivalents of $106.7 million, including $5.3 million in restricted cash.\nAt October 31, 2017, there were no outstanding borrowings under MVC's revolving credit facility with Branch Banking and Trust Company (\"BB&T\") and there were no outstanding borrowings under its credit facility with Santander Bank N.A.\nDividends\nOn October 10, 2017, the Company's Board of Directors declared a dividend of $3.2 million or $0.15 per share, paid on October 31, 2017 to shareholders of record on October 24, 2017.\nSince implementing its dividend policy in July of 2005, MVC has paid fifty consecutive quarterly dividends. Through October 31, 2017, dividends paid total approximately $6.69 per share.\nSubsequent Events\nOn November 20, 2017, MVC completed a public offering of 6.25% senior notes due November 30, 2022, resulting in net proceeds to the company of $111.3 million. The Company redeemed all outstanding 7.25% Senior Notes due 2023 for $114.4. These actions are anticipated to provide a net of offering cost savings of $1.9 million over the term of the Notes.\nOn December 22, 2017, MVC completed a modified “Dutch Auction” Tender Offer by acquiring 2,293,577 shares of its common stock at $10.90 price per share for $25 million. As a result of the tender offer, NAV per share is estimated to increase by $0.28 (which is not reflected in the October 31, 2017 fiscal year-end NAV of $13.24 per share).\nIn December 2017, the Company made two yielding investments in Essner Manufacturing and Black Diamond Equipment Rental, committing $11.2 million in total.\nWith over $66 million of cash (including restricted cash) on the balance sheet as of December 31, 2017, MVC is positioned to execute on its pipeline of yielding investment opportunities to enhance operating income and ultimately drive return on equity over time.\nMVC-G\nAbout MVC Capital, Inc.\nMVC is a business development company traded on the New York Stock Exchange that provides long-term debt and equity investment capital to fund growth, acquisitions and recapitalizations of companies in a variety of industries. For additional information about MVC, please visit the MVC's website at www.mvccapital.com .\nSafe Harbor Statement and Other Disclosures\nThe information contained in this press release contains forward-looking statements. These forward-looking statements are subject to the inherent uncertainties in predicting future results and conditions. Certain factors could cause actual results and conditions to differ materially from those projected in these forward-looking statements, including: MVC Capital's ability to deliver value to all shareholders and execute its yield investment strategy; the ability to pay and grow MVC distributions; the performance of MVC Capital's investments; and changes in economic or financial market conditions and other factors that are enumerated in the Company's periodic filings with the Securities and Exchange Commission. MVC Capital disclaims and does not undertake any obligation to update or revise any forward-looking statement in this press release.\nThe press release contains unaudited financial results. For ease of review, we have excluded the word \"approximately\" when rounding the results.\nThere can be no assurance that future dividend payments will match or exceed historic ones, or that they will be made at all . This press release is for informational purposes only and is not an offer to purchase or a solicitation of an offer to sell shares of MVC’s common stoc", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/4d82058a-8ea5-4809-868a-4b3bbf7e2a12", "https://www.globenewswire.com/Tracker?data=c9tUAaRhyGQQtQdJpsd9GJlarXIJq6giliMzfisOHtA4SOtbuO9DxkJJ0brAhAy6NHghLsYWk8sxBc545yFKJIPM7-qx0CDZ5m_H93MroG4="], "published": "2018-01-17T01:30:00.000+02:00", "crawled": "2018-01-17T03:13:56.017+02:00", "highlightTitle": ""}