{"organizations": [], "uuid": "f6c9ac7b6c84f4dfe9d0a480f037afa5abfc27b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-rait-financial-trust-sells-and-divests-seven-properties-totaling-124-point-7-million-during-fourth-quarter-of-2017.html", "country": "US", "domain_rank": 767, "title": "RAIT Financial Trust Sells and Divests Seven Properties Totaling $124.7 Million During Fourth Quarter of 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T00:15:00.000+02:00", "replies_count": 0, "uuid": "f6c9ac7b6c84f4dfe9d0a480f037afa5abfc27b0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-rait-financial-trust-sells-and-divests-seven-properties-totaling-124-point-7-million-during-fourth-quarter-of-2017.html", "ord_in_thread": 0, "title": "RAIT Financial Trust Sells and Divests Seven Properties Totaling $124.7 Million During Fourth Quarter of 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "rait financial trust sells", "sentiment": "negative"}, {"name": "rait financial trust", "sentiment": "none"}, {"name": "rait", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RAIT continues making progress reducing its commercial property portfolio as part of its strategic transition to concentrate primarily on its commercial lending business\nPHILADELPHIA--(BUSINESS WIRE)-- RAIT Financial Trust (NYSE: RAS) (“RAIT”) today announced that it has completed sales of five properties for an aggregate purchase price of approximately $110.4 million and divested an additional two properties with an aggregate net carrying value of approximately $14.3 million during the fourth quarter of 2017. RAIT expects these transactions to result in a reduction of related indebtedness by approximately $128.3 million. These sales and divestitures align with RAIT’s previously announced strategy of transforming RAIT into a more focused and cost-efficient business concentrated on its core commercial real estate lending activities. During 2017, consistent with this strategy, RAIT sold or divested approximately $399.3 million of its property portfolio and reduced related indebtedness by approximately $356.2 million. During 2016 and 2017, RAIT sold or divested $737.2 million of its property portfolio and reduced related indebtedness by approximately $652.0 million.\nThe properties sold by RAIT during the fourth quarter of 2017 were two parcels of land in Daytona Beach, Florida, an office property in Scottsdale, Arizona, a retail property located in Round Rock, Texas, an office property in Milwaukee, Wisconsin and an office property in Charlotte, North Carolina. RAIT used approximately $90.8 million of the gross proceeds received from these sales to repay related indebtedness, pay transaction costs and for other items. RAIT received net cash proceeds of approximately $5.7 million related to these sales.\nThe properties divested by RAIT during the fourth quarter of 2017 were two industrial properties in Westmoreland, Pennsylvania and Marysville, Ohio. These properties had a net carrying value of approximately $14.3 million and related debt of $39.9 million. As previously disclosed, these divestitures completed RAIT’s divestiture of an industrial portfolio which RAIT expects to result in RAIT recognizing a non-cash gain of approximately $25.0 million during the fourth quarter of 2017.\nAbout RAIT Financial Trust\nRAIT Financial Trust is an internally-managed real estate investment trust focused on providing debt financing options to owners of commercial real estate throughout the United States. For more information, please visit www.rait.com or call Investor Relations at 215.207.2100.\nForward-Looking Statements\nThis press release may contain certain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Such forward-looking statements can generally be identified by our use of forward-looking terminology such as “strategy,” “transform,” “expect,” or other similar words or terms. Such forward-looking statements include, but are not limited to, statements regarding RAIT’s strategy of transforming RAIT into a more focused and cost-efficient business concentrated on its core commercial real estate lending activities and RAIT’s expectations as to the financial impact of the transactions described. Such forward-looking statements are based upon RAIT’s historical performance and its current strategies and expectations and are not a representation that such strategies or expectations will be achieved. Such statements are subject to known and unknown risks, uncertainties and contingencies that may cause actual results to differ materially from the expectations, intentions, beliefs, strategies or predictions of the future expressed or implied by such forward-looking statements. These risks, uncertainties and contingencies include, but are not limited to, the effect of the announcement of RAIT’s review of, or any implementation of, strategic and financial alternatives on RAIT’s business, including its financial and operating results and its employees, capital sources and customers; whether any expressions of interest received by RAIT or discussions RAIT has engaged in relating to RAIT’s strategic and financial alternatives will result in any transaction or the timing or nature of any such transaction; whether RAIT will be able to continue to implement its strategy to transition RAIT to a more lender focused, simpler, and more cost-efficient business model; whether RAIT will be able to continue to divest RAIT’s legacy real estate owned portfolio and existing property management operations and the majority of RAIT’s non-lending assets and repay any related debt; final accounting determinations on gains or losses realized in the event properties are sold or divested for prices that differ from their carrying value or if property valuations are adjusted in the process of revaluating properties when they are characterized as held for sale; final accounting determinations on the amount of gain recognized from the divestiture of RAIT’s industrial portfolio; whether RAIT will have any legal obligations on the non-recourse debt related to this portfolio and other factors described in RAIT’s Annual Report on Form 10-K, Quarterly Reports on Form 10-Q and in other filings with the SEC. RAIT undertakes no obligation to update these forward-looking statements to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events, except as may be required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180111006115/en/\nRAIT Financial Trust Contact\nAndres Viroslav, 215-207-2100\naviroslav@rait.com\nSource: RAIT Financial Trust", "external_links": ["http://www.businesswire.com/news/home/20180111006115/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rait.com&esheet=51742186&newsitemid=20180111006115&lan=en-US&anchor=www.rait.com&index=1&md5=fe06a0d3b82e3ddd0c9c555d88d3627e"], "published": "2018-01-12T00:15:00.000+02:00", "crawled": "2018-01-12T02:09:46.012+02:00", "highlightTitle": ""}