{"organizations": [], "uuid": "6b20bec3d774e2fec516d1f63278283a286c5f5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180106&t=2&i=1219811843&w=1200&r=LYNXMPEE0508T", "site_section": "http://feeds.reuters.com/reuters/topNews?format=xml", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-weather/brutal-dangerous-cold-grips-east-coast-idUSKBN1EV0C8", "country": "US", "domain_rank": 408, "title": "Brutal, dangerous cold grips East Coast", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T13:34:00.000+02:00", "replies_count": 0, "uuid": "6b20bec3d774e2fec516d1f63278283a286c5f5c"}, "author": "", "url": "https://www.reuters.com/article/us-usa-weather/brutal-dangerous-cold-grips-east-coast-idUSKBN1EV0C8", "ord_in_thread": 0, "title": "Brutal, dangerous cold grips East Coast", "locations": [], "entities": {"persons": [{"name": "scott mal", "sentiment": "negative"}, {"name": "gina cherelus", "sentiment": "none"}, {"name": "dan pydynowski", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "new england", "sentiment": "none"}, {"name": "u.s. east coast", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 6, 2018 / 11:35 AM / in 3 hours Brutal cold snap stuns U.S. East Coast after blizzard Scott Malone , Gina Cherelus 4 Min Read \nBOSTON/NEW YORK (Reuters) - A blanket of bone-chilling arctic air covered the U.S. East Coast and Midwest on Saturday, creating dangerous conditions as tens of millions of people struggled to clean up from a blizzard that dumped deep, drifting snow in many areas this week. \nWind chill and freeze warnings stretched from Florida to New England and inland to states to the Upper Midwest, while the National Weather Service warned of freezing rain from Kansas to Ohio. \nIn some areas, officials warned residents that exposed skin could freeze within minutes. Cities from Houston to Boston have stepped up efforts to bring the homeless to shelters. \nThe cold snap complicated efforts by crews to clear snow and ice from roadways after a blizzard clobbered the East Coast on Thursday and Friday, forcing hundreds of schools to close and causing commuter rail services to suspend or reduce service. \nCold and snowy weather was blamed for at least 18 deaths in the past few days, including four in North Carolina traffic accidents and three in Texas. \nKillington, the famous Vermont ski resort, closed on Saturday even though snow conditions were excellent, saying wind chill on the slopes was at least minus 50 degrees Fahrenheit (minus 46 degrees Celsius). \n“It’s just too cold to put folks out there,” the resort said on its website. \nThe brutal cold in parts of the East Coast and Midwest showed no sign of abating this weekend, but a thaw should begin on Monday, said meteorologist Bob Oravec of the National Weather Service’s Maryland-based Weather Prediction Center. Before then, conditions will probably worsen. A woman bundles up against the cold temperature as she walks in Manhattan in New York City, New York, U.S., January 5, 2018. REUTERS/Amr Alfiky \n“Sunday morning is going to be the coldest morning” in the weeklong stretch of frigid weather, he said. \nIn many parts of the eastern United States, residents shivered in temperatures of below 0F (minus 18C), Oravec said. Slideshow (4 Images) \nAmong the coldest places in the country on Saturday were the small Minnesota towns of Cotton and Embarrass, where the mercury plummeted to minus 39F (minus 39C), Oravec said. But that fell short of a record low for those hamlets in the northeastern corner of the state, where sub-zero temperatures are not unusual in January. \nNot so with New York’s John F. Kennedy International Airport, where a measuring station recorded a record low for this date at 8F (minus 13C), Oravec said. \nThe airport had closed from Thursday to Friday morning because of whiteout conditions from heavy snow. Some passengers endured more delays on Saturday after the wing of a China Southern plane clipped the tail of a Kuwait Airlines jet on the tarmac. \nAfter shutting down on Tuesday, Charleston International Airport in South Carolina remained closed on Saturday, with runaways still inactive after 5 inches (12.7 cm) of snow. \nThe East Coast’s first snowstorm of 2018 featured gusts of more than 70 miles per hour (113 km per hour), dumping 22 inches (56 cm) of snow in parts of Maine and 17 inches (43 cm) in parts of Massachusetts before ending on Friday, the National Weather Service said. \nThe storm was powered by a rapid drop in barometric pressure that some weather forecasters called a bombogenesis, or a “bomb cyclone.” Additional reporting by Alex Dobuzinskis in Los Angeles, Brendan O'Brien in Milwaukee and Harriet McLeod in Charleston, South Carolina; Editing by Frank McGurty and Lisa Von Ahn", "external_links": [], "published": "2018-01-06T13:34:00.000+02:00", "crawled": "2018-01-06T13:54:35.014+02:00", "highlightTitle": ""}