{"organizations": [], "uuid": "23717efe8fdec866d49ea3c23b089b5d6f12a3f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-pre-market-technical-scan-on-application-software-equities--sap-shopify-twilio-and-zendesk.html", "country": "US", "domain_rank": 767, "title": "Pre-Market Technical Scan on Application Software Equities - SAP, Shopify, Twilio, and Zendesk", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.049, "site_type": "news", "published": "2018-01-18T14:45:00.000+02:00", "replies_count": 0, "uuid": "23717efe8fdec866d49ea3c23b089b5d6f12a3f6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-pre-market-technical-scan-on-application-software-equities--sap-shopify-twilio-and-zendesk.html", "ord_in_thread": 0, "title": "Pre-Market Technical Scan on Application Software Equities - SAP, Shopify, Twilio, and Zendesk", "locations": [], "entities": {"persons": [{"name": "shopify", "sentiment": "negative"}], "locations": [{"name": "zendesk new york", "sentiment": "none"}, {"name": "walldorf", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "sap", "sentiment": "negative"}, {"name": "twlo", "sentiment": "none"}, {"name": "erp", "sentiment": "none"}, {"name": "twilio inc.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "shopify inc.", "sentiment": "none"}, {"name": "scm", "sentiment": "none"}, {"name": "zendesk inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 18, 2018 /PRNewswire/ --\nWallStEquities.com strives to bring the best free research to the investment community. Today we are offering reports on SAP, SHOP, TWLO, and ZEN which can be accessed for free by signing up to www.wallstequities.com/registration . Pre-market today, WallStEquities.com revisits the Application Software space, which is a consolidated industry consisting of ERP, CRM, SCM, and business intelligence and analytics. Four stocks have been lined up for assessment, and they are SAP SE (NYSE: SAP), Shopify Inc. (NYSE: SHOP), Twilio Inc. (NYSE: TWLO), and Zendesk Inc. (NYSE: ZEN). All you have to do is sign up today for this free limited time offer by clicking the link below. www.wallstequities.com/registration\nSAP SE\nOn Wednesday, shares in Walldorf, Germany headquartered SAP SE recorded a trading volume of 977,073 shares, which was above their three months average volume of 590,450 shares. The stock ended the session 0.46% higher at $111.19. The Company's shares have gained 24.04% over the past year. The stock is trading 3.23% above its 200-day moving average. Moreover, shares of SAP SE, which operates as an enterprise application software and database company worldwide, have a Relative Strength Index (RSI) of 43.75.\nOn January 11 th , 2018, research firm Morgan Stanley downgraded the Company's stock rating from 'Overweight' to 'Equal-Weight'.\nOn January 11 th , 2018, SAP SE announced Upgrade2Success, a program that helps customers with on-premise SAP® ERP Human Capital Management solutions transition and expand into the cloud. By providing clear guidance, predictable outcomes, faster time to value, and flexible commercial arrangements, the services and tools for digital HR transformation help customers ease the migration to cloud-based SAP SuccessFactors® solutions. Get the full research report on SAP for free by clicking below at: www.wallstequities.com/registration/?symbol=SAP\nShopify\nOttawa, Canada headquartered Shopify Inc.'s stock closed the day 2.67% higher at $114.91 with a total trading volume of 1.23 million shares. The Company's shares have advanced 11.31% in the past month, 18.49% in the previous three months, and 132.05% over the past year. The stock is trading 9.95% and 18.54% above its 50-day and 200-day moving averages, respectively. Additionally, shares of Shopify, which provides a cloud-based multi-channel commerce platform for small and medium-sized businesses in Canada, the US, the UK, Australia, and internationally, have an RSI of 67.79. Free research on SHOP can be accessed at: www.wallstequities.com/registration/?symbol=SHOP\nTwilio\nShares in San Francisco, California headquartered Twilio Inc. recorded a trading volume of 1.13 million shares. The stock ended yesterday's trading session 0.28% higher at $25.40. The Company's shares have advanced 0.91% in the past month. The stock is trading below its 50-day moving average by 1.73%. Furthermore, shares of Twilio, which provides cloud communications platform that enables developers to build, scale, and operate communications within software applications through the cloud as a pay-as-you-go service in the US and internationally, have an RSI of 50.67.\nOn January 10 th , 2018, Twilio announced that it will report its financial results for Q4 and full year ended December 31 st , 2017 after market close on February 13 th , 2018. The Company will host a conference call and live webcast at 5:00 p.m. ET that same day to discuss the results. A live webcast of the conference call will be available under the Investor Relations page of the Company's website. Visit WallStEquities.com now and sign up for the free research on TWLO at: www.wallstequities.com/registration/?symbol=TWLO\nZendesk\nSan Francisco, California headquartered Zendesk Inc.'s stock finished Wednesday's session 0.14% higher at $36.49. A total volume of 843,406 shares was traded, which was above their three months average volume of 804,380 shares. The Company's shares have advanced 7.86% in the last month, 22.45% over the previous three months, and 61.53% over the past year. The stock is trading above its 50-day and 200-day moving averages by 5.92% and 22.84%, respectively. Additionally, shares of Zendesk, which provides software-as-a-service products for organizations, have an RSI of 64.14.\nOn January 10 th , 2018, Zendesk announced that it will release financial results for the fourth fiscal quarter and full fiscal year ended December 31 st , 2017 following the close of the US markets on February 06 th , 2018. The Company will host a conference call that same day at 5:00 p.m. ET to answer questions. A live webcast of the conference call will be available under the investor page of the Company's website. The free technical report on ZEN is available at: www.wallstequities.com/registration/?symbol=ZEN\n--\nWall St. Equities :\nWall St. Equities (WSE) produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. WSE has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below.\nWSE has not been compensated; directly or indirectly; for producing or publishing this document.\nPRESS RELEASE PROCEDURES :\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third-party research service company (the \"Reviewer\") represented by a credentialed financial analyst [for further information on analyst credentials, please email info@wallstequities.com . Rohit Tuli, a CFA® charterholder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on publicly available information which is believed to be reliable. Content is researched, written and reviewed on a reasonable-effort basis. The Reviewer has not performed any independent investigations or forensic audits to validate the information herein. The Reviewer has only independently reviewed the information provided by the Author according to the procedures outlined by WSE. WSE is not entitled to veto or interfere in the application of such procedures by the third-party research service company to the articles, documents or reports, as the case may be. Unless otherwise noted, any content outside of this document has no association with the Author or the Reviewer in any way.\nNO WARRANTY\nWSE, the Author, and the Reviewer are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted whatsoever for any direct, indirect or consequential loss arising from the use of this document. WSE, the Author, and the Reviewer expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in th", "external_links": ["http://www.prnewswire.com/news-releases/pre-market-technical-scan-on-application-software-equities--sap-shopify-twilio-and-zendesk-300584481.html", "https://wallstequities.com/legal-disclaimer/", "http://www.wallstequities.com/registration/?symbol=SHOP", "http://www.wallstequities.com/registration/?symbol=TWLO", "http://www.wallstequities.com/registration/?symbol=SAP", "http://www.wallstequities.com/registration/?symbol=ZEN", "http://www.wallstequities.com/registration"], "published": "2018-01-18T14:45:00.000+02:00", "crawled": "2018-01-18T17:11:04.000+02:00", "highlightTitle": ""}