{"organizations": [], "uuid": "ce1569f8cfbac07f77fb51fa0f4ffa3ec45d9c64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224166978&w=1200&r=LYNXMPEE0L1AV", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-imf-economy-outlook/imf-revises-up-global-growth-forecast-helped-by-trump-tax-cuts-idUSKBN1FB1TK", "country": "US", "domain_rank": 408, "title": "IMF raises global growth forecast, sees Trump tax boost", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-22T22:17:00.000+02:00", "replies_count": 0, "uuid": "ce1569f8cfbac07f77fb51fa0f4ffa3ec45d9c64"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-imf-economy-outlook/imf-revises-up-global-growth-forecast-helped-by-trump-tax-cuts-idUSKBN1FB1TK", "ord_in_thread": 0, "title": "IMF raises global growth forecast, sees Trump tax boost", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "obstfeld", "sentiment": "none"}, {"name": "maurice obstfeld", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "imf", "sentiment": "negative"}, {"name": "international monetary fund", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DAVOS, Switzerland (Reuters) - The International Monetary Fund on Monday revised up its forecast for world economic growth in 2018 and 2019, saying sweeping U.S. tax cuts were likely to boost investment in the world’s largest economy and help its main trading partners.\nHowever, the IMF, in an update of its World Economic Outlook, also added that U.S. growth would likely start weakening after 2022 as temporary spending incentives brought about by the tax cuts began to expire.\nThe tax cuts would likely widen the U.S. current account deficit, strengthen the U.S. dollar and affect international investment flows, IMF chief economist Maurice Obstfeld said.\n“Political leaders and policymakers must stay mindful that the current economic momentum reflects a confluence of factors that is unlikely to last for long,” Obstfeld told reporters at the World Economic Forum in Davos.\nHe said economic gains from the tax cuts would be partially paid back later in the form of lower growth as temporary spending incentives, notably for investment, expired and as rising federal debt took a toll.\nIMF Managing Director Christine Lagarde pointed to a “troubling” increase in debt levels across many countries and warned policymakers against complacency, saying now was the time to address structural deficiencies in their economies.\nObstfeld said a sudden rise in interest rates could lead to questions about the debt sustainability of some countries and lead to a disruptive correction in “elevated” equity prices.\nU.S. President Donald Trump signed Republicans’ massive $1.5 trillion tax overhaul into law in December, cementing the biggest legislative victory of his first year.\nThe tax package, the largest such overhaul since the 1980s, slashed the corporate rate from 35 percent to 21 percent and temporarily reduced the tax burden for most individuals as well.\nPointing to growth in the United States and China, the IMF forecast global growth to 3.9 percent for both 2018 and 2019, a 0.2 percentage point increase from its last update in October.\nThe U.S. economy has been showing steady but underwhelming annual growth since the last recession in 2007-2009. The IMF now expects it to expand by 2.7 percent in 2018, much higher than the 2.3 percent the fund forecast in October. U.S. growth was projected to slow to 2.5 percent in 2019, it said.\nThe IMF also revised up its growth forecasts for the euro area, especially for Germany, Italy and the Netherlands “reflecting the stronger momentum in domestic demand and higher external demand”.\nHowever, it cut its forecast for Spain’s growth for 2018 by 0.1 percentage point, saying political uncertainty linked to the Catalonia region’s independence push was expected to impact business confidence and demand.\nThe IMF revised up its growth forecast for Japan to 1.2 percent this year and 0.9 percent in 2019. It maintained its projection for Britain’s growth at 1.5 percent this year.\nThe IMF maintained its forecast for growth in emerging markets and developing countries for this year and next. China’s economy was expected to expand 6.6. percent this year and slow to 6.4 percent in 2019.\nIt said growth in the Middle East, North Africa, Afghanistan and Pakistan was also expected to pick up in 2018 and 2019 but remain subdued at 3.6 percent this year.\nThe IMF revised down its growth estimate for South Africa to 0.9 percent for this year and next amid concerns over political uncertainty.\nIn Latin America, it said growth would be weighed down by an economic collapse in Venezuela despite a pick-up in economic activity in Brazil and Mexico.\nReporting by Lesley Wroughton; Editing by Andrea Ricci and Mark Bendeich\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T22:17:00.000+02:00", "crawled": "2018-01-22T19:10:21.007+02:00", "highlightTitle": ""}