{"organizations": [], "uuid": "2b119fc80c017353a8f8bd0927288ef7237d075d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-intellichief-ecm-capture-enterprise-reduces-document-management-cost-lifts-profit.html", "country": "US", "domain_rank": 767, "title": "IntelliChief ECM Capture Enterprise Reduces Document Management Cost, Lifts Profit", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T21:00:00.000+02:00", "replies_count": 0, "uuid": "2b119fc80c017353a8f8bd0927288ef7237d075d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-intellichief-ecm-capture-enterprise-reduces-document-management-cost-lifts-profit.html", "ord_in_thread": 0, "title": "IntelliChief ECM Capture Enterprise Reduces Document Management Cost, Lifts Profit", "locations": [], "entities": {"persons": [], "locations": [{"name": "fl", "sentiment": "none"}, {"name": "tampa", "sentiment": "none"}], "organizations": [{"name": "llc", "sentiment": "negative"}, {"name": "erp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tampa, FL, Jan. 22, 2018 (GLOBE NEWSWIRE) -- IntelliChief, LLC, a provider of automated document management and workflow enterprise content management (ECM) solutions, announces the latest release of IntelliChief ECM Capture Enterprise reduces document management cost. The company’s flagship document capture program increases capacity to reduce manual data entry into enterprise resource management (ERP) and departmental business systems. By automating capture and extracting key project and transactional information, validating and verifying it with system records for accuracy, then enabling archival and process-mapped workflow with IntelliChief ECM, ongoing cost reduction is achieved.\nIntelliChief ECM Capture Enterprise is created for ease of use with minimal instruction needed, reducing costs and accelerating document processing efficiency. The application significantly reduces labor-intensive document preparation and manual data entry (typically by 70+%), streamlining indexing and entry into workflow.\nFeatures encompass:\nMulti-channel capture capabilities that streamline processing of documents from scanners, MFPs, fax, email and other digital sources, creating both centralized and distributed capture environments Configurable actions and rules-based criteria, which span capture functions including multi-language recognition, document classification, validations and business rules, and formatting for company-specific processes Processing of documents with barcodes, machine-printed text (OCR), hand-printed text (ICR) and form’s check boxes (OMR), with full text and zonal identification, for locating and processing data on both structured and unstructured documentation Delivery of documents to business applications to speed processing and increase accuracy of information by automating document search field population, removing time consuming and costly manual keying, and enabling automated validation with ERP’s and line of business systems, assuring accuracy with consistent updating of data Identification of document type by a combination of pattern matching, key word and rules-based data location – no template set-up required, IntelliChief ECM Capture Enterprise learns new document types on-the-fly Application of advanced validations, such as database lookups, math calculations and check sums, to assure accurate data Design and deployment of complex capture applications without expensive programming Management tools including real-time monitoring and advanced reporting.\nAreas of use include Accounting (both Accounts Payable and Accounts Receivable), Finance, Purchasing, Customer Service, Human Resources, IT, Legal, Logistics/Distribution, Operations and other paper and process-intensive departments, supporting time and cost savings throughout organizations.\nIntelliChief ECM provides a smooth, automated transition from costly manual document management and workflow functions. Its industry-awarded automated capture, document management, workflow and real-time analytic visibility enables users to capture documentation in any format, index contents and validate with data in their ERP and line of business applications, for lifecycle-managing all related documentation, facilitating optimized interdepartmental processes workflow automation and cash flow optimization.\nFor IntelliChief Capture Enterprise information, visit http://www.intellichief.com/products/document-capture-forms-processing/ .\nAbout IntelliChief, LLC\nIntelliChief enterprise content management (ECM) provides enterprise-class business processes document management and workflow automation solutions for any IT platform. With decades of expertise in the market and seamless integration with leading enterprise resource planning (ERP) and line of business systems, IntelliChief thoroughly automates companies’ document management, achieving full ROI typically within a year of implementation. Users can create, capture, manage, archive, retrieve and distribute mission-critical documents directly from their familiar ERP screens, automating and streamlining business processes workflow throughout their organization. www.intellichief.com .\n###\nAttachments:\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/2053e139-1b89-497b-ab17-2d60aed756bb\nTim Nissen IntelliChief 8139719500 x335 tnissen@intellichief.com\nSource: IntelliChief", "external_links": ["https://www.globenewswire.com/Tracker?data=9j3X_s2BIhhHnMLEkvkoghOU4uvvJPwfdzP7ozGiBL53EOkxQ3WunE6OJ16jtXF9L7W0ZWPoN7QgMotzp25LZFbb_6U04qK-pElZuzXiya5QXK_8WYl-xQ6kdtTRovdEMNeYDKTgXTf4Osd4AzeMaLQYdOg-pCrRdZWCb-pQlnFGqE9A7PeZsylTI1sxl1lz8_K4inFjbqkCnDhtucsB_SVV8ZhZkQ9njNd6YWCMoGc=", "http://www.globenewswire.com/NewsRoom/AttachmentNg/2053e139-1b89-497b-ab17-2d60aed756bb", "https://www.globenewswire.com/Tracker?data=9j3X_s2BIhhHnMLEkvkogu2y6bApSjrUMgZMMqEKpntyFuCAdjdnFdBiR1KHQYBNAspgEfry0X0KiXHJGLODAleqMUwUdGdIoeO1UWG6f5qxmU_KQVRtsvPmBdwpsZUIdGsZ3V4_o4rGKM1eWvYn9ADxg46P7qG_0LNNNIwPPwV6mUdRZld4qpfOCHJMfQ9wb08jGPdG6NEqRrfx4YV8-40XtgVWUJR4OdRLx-L4kGIsphC5mmP94YwtONYJXRe8ie8Qi3WIc17uMSgk735onQ==", "https://www.globenewswire.com/Tracker?data=kCZ8Boe8Ewe6XndwTbXHgPK6j3hmXp29etSNq_6ql9V0tvGgvNlu10ECFCEjdQOFBKUNGTs3PyDkqG9kUMs0ZBUXI9vX_Sd8hLXgFXVEe-w=", "http://www.intellichief.com/products/document-capture-forms-processing/", "https://www.globenewswire.com/NewsRoom/AttachmentNg/2053e139-1b89-497b-ab17-2d60aed756bb/en"], "published": "2018-01-22T21:00:00.000+02:00", "crawled": "2018-01-22T23:21:02.018+02:00", "highlightTitle": ""}