{"organizations": [], "uuid": "d1b9406ba216fbb08b20249a797002b6341fceef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/china-stocks-hongkong-close/hong-kong-stocks-reach-new-peak-china-index-aided-by-q4-growth-idUSZZN2N7J00", "country": "US", "domain_rank": 408, "title": "Hong Kong stocks reach new peak, China index aided by Q4 growth", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T10:28:00.000+02:00", "replies_count": 0, "uuid": "d1b9406ba216fbb08b20249a797002b6341fceef"}, "author": "", "url": "https://www.reuters.com/article/china-stocks-hongkong-close/hong-kong-stocks-reach-new-peak-china-index-aided-by-q4-growth-idUSZZN2N7J00", "ord_in_thread": 0, "title": "Hong Kong stocks reach new peak, China index aided by Q4 growth", "locations": [], "entities": {"persons": [{"name": "iris pang", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "ing", "sentiment": "none"}, {"name": "hang seng china enterprises", "sentiment": "none"}, {"name": "greater china economist", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "china enterprises", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Hang Seng index ends up 0.4 pct\n* China Enterprises index HSCE rises 1.8 percent\n* HSI financial sector sub-index is 1 pct higher; property sector down 0.8 pct\nJan 18 (Reuters) - Hong Kong stocks rose to a fresh peak on Thursday, led by telecommunications and financial firms. The China Enterprises index HSCE, which tracks major Chinese firm listed in Hong Kong, extended gains after data showed China’s Q4 economic growth beats expectations. ** China’s economy grew 6.8 percent in the fourth quarter from a year earlier, helped by a rebound in the industrial sector, a resilient property market and strong export growth. “China’s growth is very healthy,” said Iris Pang, Greater China Economist, ING, Hong Kong.\n** At close of trade, the Hang Seng index was up 138.53 points or 0.43 percent at 32,121.94. The Hang Seng China Enterprises index rose 1.76 percent to 13,094.92. **The sub-index of the Hang Seng tracking energy shares rose 0.1 percent while the IT sector dipped 0.48 percent, the financial sector was 1.02 percent higher and property sector dipped 0.82 percent . ** The top gainer on Hang Seng was Industrial and Commercial Bank of China Ltd up 3.6 percent, while the biggest loser was Geely Automobile Holdings Ltd, down 4.08 percent. ** China’s main Shanghai Composite index closed up 0.91 percent at 3,475.9148 points while its blue-chip CSI300 index ended up 0.58 percent. firmer by 0.21 percent while Japan’s Nikkei index closed down 0.44 percent. ** The yuan was Quote: d at 6.428 per U.S. dollar at 08:09 GMT, 0.09 percent firmer than the previous close of 6.4335. ** So far this year, the Hang Seng index is up 6.9 percent, while China’s H-share index is up 9.9 percent. As of the previous close, the Hang Seng has risen 6.9 percent this month. ** The top gainers among H-shares were China Citic Bank Corp Ltd up 5.71 percent, followed by Dongfeng Motor Group Co Ltd gaining 5.63 percent and China Communications Construction Co Ltd up by 4.17 percent. ** The three biggest H-shares percentage decliners were Guangzhou Automobile Group Co Ltd which was down 2.76 percent, Zhuzhou CRRC Times Electric Co Ltd which fell 2.7 percent and Byd Co Ltd down by 2.3 percent. ** About 3.86 billion Hang Seng index shares were traded, roughly 198.7 1.94 billion shares a day. The volume traded in the previous trading session was 4.12 billion. ** At close, China’s A-shares were trading at a premium of 28.53 price-to-earnings ratio of the Hang Seng index was 14.58 2.7 Hang Seng index has risen by 1.67 percent to HK$20.96 trillion. ** The short and one-factor leveraged Hang Seng index, which is designed to replicate the payoff of a short or leveraged portfolio and is linked to the movements of the Hang Seng Index, was lower by 0.43 percent on the day at 4,593.09 points. (Reporting by the Shanghai Newsroom; Editing by Richard Borsuk)\n ", "external_links": [], "published": "2018-01-18T10:28:00.000+02:00", "crawled": "2018-01-18T11:01:39.031+02:00", "highlightTitle": ""}