{"organizations": [], "uuid": "0b0a391530620773ff0f9ea23a9a01acaeaf31d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/globe-newswire-financial-services-leader-michaela-scott-joins-borislow-insurance-as-a-strategic-benefits-consultant.html", "country": "US", "domain_rank": 767, "title": "Financial Services Leader Michaela Scott Joins Borislow Insurance as a Strategic Benefits Consultant", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T20:17:00.000+02:00", "replies_count": 0, "uuid": "0b0a391530620773ff0f9ea23a9a01acaeaf31d1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/globe-newswire-financial-services-leader-michaela-scott-joins-borislow-insurance-as-a-strategic-benefits-consultant.html", "ord_in_thread": 0, "title": "Financial Services Leader Michaela Scott Joins Borislow Insurance as a Strategic Benefits Consultant", "locations": [], "entities": {"persons": [{"name": "stra", "sentiment": "negative"}, {"name": "michaela scott", "sentiment": "negative"}, {"name": "borislow", "sentiment": "none"}, {"name": "michaela", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "methuen", "sentiment": "none"}], "organizations": [{"name": "borislow insurance", "sentiment": "negative"}, {"name": "master of science in financial services", "sentiment": "none"}, {"name": "boston partners financial group", "sentiment": "none"}, {"name": "the american college of financial services", "sentiment": "none"}, {"name": "saint anselm college", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "METHUEN, Mass., Jan. 15, 2018 (GLOBE NEWSWIRE) --\nBorislow Insurance welcomes Michaela Scott as Strategic Benefit Consultant\nAn accomplished financial services executive, Michaela Scott brings deep expertise in providing consultative services to a wide array of individual and group clients in planning for their business and personal financial wellbeing. A Certified Financial Planner™, Michaela has extensive experience with business planning, including business succession, salary continuation, income protection and key person protection. She works directly with clients in developing comprehensive strategic plans and reviewing existing estate plans. Michaela will expand offerings in these areas to compliment Borislow’s strong employee health and wellbeing solutions.\nMichaela previously served as Vice President at Boston Partners Financial Group. She received her Bachelor’s Degree from Saint Anselm College. Michaela also holds a Master of Science in Financial Services with a concentration in Retirement Planning from The American College of Financial Services where, in 2017, she was awarded The Millennial Advisor Award. She is a qualifying member of the Million Dollar Round Table, the premier association of financial professionals.\nJennifer Borislow, Founding Principal of Borislow Insurance, stated, “We are pleased to welcome Michaela to our team. Her expertise will allow us to continue our relentless commitment to provide our clients with innovative and comprehensive solutions to their most challenging health and wellbeing issues. Her dedication to exemplary client service is in direct alignment with that critical core value of our Firm.” Michaela commented, “I am excited to be joining such a dedicated team of professionals who bring extensive industry and client service expertise to the market.”\nBorislow Insurance is an innovative professional services firm serving clients in many states across a wide variety of industries . At a time of great uncertainty and change in healthcare, the insurance industry and the regulatory environment, Borislow remains among the fastest growing and most respected firms of its kind, predicated on an unwavering commitment to client service. By serving as a true strategic partner to their clients, Borislow’s consulting team provides a personal touch in delivering the broad and deep expertise their clients need. Borislow’s team of experts provides insights and services on a full range of health & welfare subjects including group benefits, risk management, healthcare cost solutions, compliance, health and wellbeing, technology and communication tools, HR consulting, healthcare reform, personal financial well-being and much more.\nContact: David A. Saltzman\nBorislow Insurance\n1 Griffin Brook Drive, Methuen MA 01844\nwww.borislow.com\nPhone: 978-689-8200\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/833f70b2-568d-46a7-bada-c9cb0774c0f2\nSource:Borislow Insurance", "external_links": ["https://borislow.com/industries-we-serve/", "https://www.globenewswire.com/NewsRoom/AttachmentNg/833f70b2-568d-46a7-bada-c9cb0774c0f2/en", "https://www.globenewswire.com/NewsRoom/AttachmentNg/f4f9f530-d7c6-4632-9942-27e844dcf1ae", "http://www.globenewswire.com/NewsRoom/AttachmentNg/833f70b2-568d-46a7-bada-c9cb0774c0f2"], "published": "2018-01-15T20:17:00.000+02:00", "crawled": "2018-01-15T22:59:53.007+02:00", "highlightTitle": ""}