{"organizations": [], "uuid": "75f83d68990faf3a399a7152fb7cb9eec2d748e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-vanguard-natural-resources-inc-announces-senior-leadership-changes-and-initial-2018-guidance-and-provides-2018-general.html", "country": "US", "domain_rank": 767, "title": "Vanguard Natural Resources, Inc. Announces Senior Leadership Changes and Initial 2018 Guidance, and Provides 2018 General Corporate Update", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T15:59:00.000+02:00", "replies_count": 0, "uuid": "75f83d68990faf3a399a7152fb7cb9eec2d748e9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-vanguard-natural-resources-inc-announces-senior-leadership-changes-and-initial-2018-guidance-and-provides-2018-general.html", "ord_in_thread": 0, "title": "Vanguard Natural Resources, Inc. Announces Senior Leadership Changes and Initial 2018 Guidance, and Provides 2018 General Corporate Update", "locations": [], "entities": {"persons": [{"name": "richard scott sloan", "sentiment": "none"}, {"name": "smith", "sentiment": "none"}, {"name": "joseph citarrella", "sentiment": "none"}, {"name": "scott w. smith", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "globe newswire", "sentiment": "negative"}, {"name": "today vanguard natural resources, inc.", "sentiment": "neutral"}, {"name": "vanguard natural resources, inc", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "vanguard", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 18, 2018 (GLOBE NEWSWIRE) -- Today Vanguard Natural Resources, Inc. (the “Company” or “Vanguard”) announced changes to its leadership team. It also announced its initial 2018 capital expenditure budget and provided its initial guidance for both the first quarter and full year 2018. Additionally, Vanguard announced numerous targeted divestments beyond those initially disclosed in November 2017.\nAppointment of Richard Scott Sloan as President and Chief Executive Officer\nOn January 15, 2018, Scott W. Smith, the President and Chief Executive Officer of the Company, stepped down as President and Chief Executive Officer and from his position on the board of directors of the Company (the “Board”), effective immediately. Mr. Smith has agreed to remain with the Company as a non-officer employee to help facilitate a seamless senior leadership transition.\nJoseph Citarrella, Chairman of the Board said, “On behalf of the entire Board, I would like to thank Scott for his dedication and many years of service. As the founder of the Company, he has been a critical member of the management team and we wish him every success in his future endeavors.”\nThe Company is pleased to announce the promotion of Richard Scott Sloan to President and Chief Executive Officer. Mr. Sloan has served as Executive Vice President and Chief Financial Officer of the Company since September 2017 and as a member of the Board since August 2017. He will continue to serve on the Board, having previously held various senior leadership positions over his 25-year career at BP, including President of BP Russia, Director of M&A, and Chief Financial Officer of several regional divisions. He received his BA in Economics from Colgate University and MBA in Corporate Finance from the University of Chicago. Mr. Citarrella remarked, “Scott is a seasoned executive with the capability and vision to lead Vanguard as we implement our long-term strategy to maximize value for all of the Company’s shareholders. His exceptional leadership skills have been evident since he joined the management team in September, and we are confident that he will deliver outstanding results as President and Chief Executive Officer of the Company.”\nScott W. Smith said, “Having founded the Company over ten years ago, I am proud to have seen it grow to an enterprise of significant size and scale. However, with the completion of the recapitalization, I believe it is time for me to step down from my role as President and Chief Executive Officer. I am highly confident that the current management team and the many other talented individuals that work tirelessly each day on behalf of the Company will continue doing a tremendous job in executing the business plan and long-term strategy that the Board has outlined for 2018 and beyond.”\nAppointment of Ryan Midgett as Chief Financial Officer\nIn connection with Mr. Sloan’s promotion to President and Chief Executive Officer, Ryan Midgett has been promoted to serve as the Chief Financial Officer of the Company. Mr. Midgett has over a decade of experience in financial management, analysis and reporting in the oil and gas industry. Most recently he served as the Vice President, Finance and Treasurer of the Company. Mr. Midgett received his BA in Economics, Managerial Studies and Political Science from Rice University. W. Greg Dunlevy, Chairman of the Audit Committee stated, “Ryan’s demonstrated leadership abilities, past experience and deep knowledge of the Company’s business make him the ideal successor as our Chief Financial Officer.”\nAppointment of Patty Avila-Eady as Chief Accounting Officer\nPatty Avila-Eady has been appointed to serve as the Chief Accounting Officer of the Company where she will work closely with Chief Financial Officer Ryan Midgett. Ms. Avila-Eady is a certified public accountant and, including the last ten years with the Company, has over thirty years of experience in accounting and financial reporting. Ms. Avila-Eady has been responsible for the preparation and oversight of financial reporting of both public and private companies, ensuring compliance with GAAP and SEC reporting guidelines. Ms. Avila-Eady received her BBA in Accounting, magna cum laude, from the University of Houston. “Patty’s intelligence, attention to detail, commitment and technical knowledge makes her the perfect person to perform this critical function for the Company,” stated President and Chief Executive Officer R. Scott Sloan.\nDeparture of Britt Pence\nIn addition to the above, Britt Pence, the Company’s Executive Vice President of Operations, has agreed to step down, effective on or before June 29, 2018 or such other time as mutually agreed with the Company.\nThe Board expects to announce Mr. Pence’s replacement at a later date.\n2018 Capital Expenditure Budget\nThe Company has approved a 2018 capital expenditure budget of $160 million that includes approximately $135 million of drilling and completions capital, or 85% of the total capital budget. More than 97% of the drilling and completion capital is focused on the core growth assets of Pinedale, Piceance, and Arkoma. The largest amount is budgeted for Pinedale development drilling (approximately $93 million). The Company is currently drilling a 14 well program in the Piceance basin, with plans to test various completion techniques, including high volume fracs, to more fully assess development upside in the field (approximately $21 million). Lastly, the Company is expected to participate in approximately 8 horizontal Woodford wells in the Arkoma basin (approximately $18 million).\nBased on the capital expenditure budget, the Company expects to grow production approximately 8%, pro forma for the recent Williston divestiture described below, from December 2017 to December 2018. Natural gas production is anticipated to comprise more than 70% of total production, and lease operating expenses per Mcfe are expected to decline from 2017 levels.\nMr. Sloan, President and Chief Executive Officer, commented, “2018 is shaping up to be an exciting transition year for Vanguard. The Company is increasingly focused on its core growth assets. At the same time, we continue to identify those assets in our portfolio that are non-core to our operations and which we anticipate will be worth more to other owners. In this regard, we have completed the sale of our Williston basin properties and are initiating the marketing of leasehold interests in Ward County, Texas, which have undeveloped shale resource along with established producing reserves. We expect that our 2018 divestment program will lead to a more focused and less levered Vanguard by year end.”\nInitial 2018 Guidance\nThe following table sets forth the Company’s initial guidance for 2018 which is based on certain estimates being used by the Company to model its anticipated results of operations for the 2018 fiscal year. These estimates do not include any future acquisitions or divestitures of oil or natural gas properties, reflect the impact of the sale of the Williston properties divested in December 2017, and assume Vanguard’s current capital structure.\nQ1 2018E FY 2018E Net Production: Oil (Bbls/d) 8,000 - 9,000 8,200 - 9,200 Natural gas (Mcf/d) 250,000 - 270,000 255,000 - 280,000 Natural gas liquids (Bbls/d) 8,000 - 9,000 8,300 - 9,300 Total (Mcfe/d) 346,000 - 378,000 354,000 - 391,000 Costs ($ thousands): Lease operating expenses 34,000 - 38,000 135,000 - 150,000 Prod", "external_links": ["https://www.globenewswire.com/Tracker?data=qqf8NG-nlgpq2aYvEUBEsxoKfQbt9T6X9pDnds12QX8DLWg0Ot5fnnLNyXffp26K7354DNoGp-sE6FDVj1FZeA=="], "published": "2018-01-18T15:59:00.000+02:00", "crawled": "2018-01-18T16:29:10.038+02:00", "highlightTitle": ""}