{"organizations": [], "uuid": "fac9009c615d96d701a4c572b5636f04ea0060cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180129.html", "section_title": "Archive News &amp; Video for Monday, 29 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-air-pollution-hanoi/hanoi-enjoyed-just-38-days-of-clean-air-in-2017-report-idUSKBN1FJ164", "country": "US", "domain_rank": 408, "title": "Hanoi enjoyed just 38 days of clean air in 2017: report", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.161, "site_type": "news", "published": "2018-01-30T17:44:00.000+02:00", "replies_count": 0, "uuid": "fac9009c615d96d701a4c572b5636f04ea0060cc"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-air-pollution-hanoi/hanoi-enjoyed-just-38-days-of-clean-air-in-2017-report-idUSKBN1FJ164", "ord_in_thread": 0, "title": "Hanoi enjoyed just 38 days of clean air in 2017: report", "locations": [], "entities": {"persons": [{"name": "lars blume", "sentiment": "none"}, {"name": "blume", "sentiment": "none"}], "locations": [{"name": "vietnam", "sentiment": "none"}, {"name": "hanoi", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "kuala lumpur", "sentiment": "negative"}, {"name": "world health organization", "sentiment": "none"}, {"name": "green innovation and development centre", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KUALA LUMPUR (Thomson Reuters Foundation) - Vietnam’s capital, Hanoi, enjoyed little more than one month of clean air last year as pollution levels rose to match China’s smog-prone capital, Beijing, preliminary findings of a new report showed.\nAnnual average air pollution in Hanoi in 2017 was also four times higher than those deemed acceptable by the World Health Organization’s air quality guidelines, according to a report by the Green Innovation and Development Centre (GreenID).\nAnd the situation is likely to get worse, according to the Hanoi-based non-profit organization.\n“A bit more than one month were days with good air quality,” said Lars Blume, technical advisor at GreenID, which analyzed air monitoring data compiled at the United States embassy in Hanoi.\n“It is out of people’s control - they have to go out and work - and in many cases it is hard to really feel whether air is good or bad,” Blume told the Thomson Reuters Foundation.\nAir pollution in Hanoi is due to a number of factors, including a rise in construction works, an increase in car and motorcycle use, and agriculture burning by farmers, Blume said.\nBut research in the report suggests that heavy industries, like steel works, cement factories and coal power plants in areas near the capital, are also significant contributors.\nHanoi’s air pollution is now worse than the Indonesian capital Jakarta, the report showed, and things are unlikely to improve as Vietnam pushes ahead with plans to build more coal power plants.\nExposure to high levels of air pollution, especially over the long term, can affect human respiratory and inflammatory systems, and can also lead to heart disease and cancer.\nAcknowledging the problem, in mid-2016 the Vietnam government launched a national action plan to that sought to control and monitor emissions and improve air quality. Hanoi is planning to install 70 air monitoring stations.\nThe GreenID report criticized the lack of regulations on air quality, a lack of public awareness of the problem and on effective measures to minimize the effects - such as home purifiers.\nThe Vietnamese government must install more air pollution monitoring stations across the country and make the data available to the public, Blume said.\nImproved urban planning and investments in renewable energy and public transport systems are also needed, said the report, which is due to be published at the end of February.\nPrevious GreenID surveys showed a growing concern among the Vietnamese over the issue of air quality and a rise in respiratory problems among children, said Nguyen Thi Anh Thu, a researcher at the organization.\nReporting by Michael Taylor, Editing by Jared Ferrie; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T17:44:00.000+02:00", "crawled": "2018-01-30T18:43:44.010+02:00", "highlightTitle": ""}