{"organizations": [], "uuid": "4245e1f57e48c57bced7bdd2a303cb9d887c675b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221415629&w=1200&r=LYNXMPEE0B0N6", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-auckland-men/del-potro-to-face-bautista-agut-in-auckland-classic-final-idUKKBN1F115B", "country": "US", "domain_rank": 408, "title": "Del Potro to face Bautista Agut in Auckland Classic final", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T13:00:00.000+02:00", "replies_count": 0, "uuid": "4245e1f57e48c57bced7bdd2a303cb9d887c675b"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-auckland-men/del-potro-to-face-bautista-agut-in-auckland-classic-final-idUKKBN1F115B", "ord_in_thread": 0, "title": "Del Potro to face Bautista Agut in Auckland Classic final", "locations": [], "entities": {"persons": [{"name": "del potro", "sentiment": "negative"}, {"name": "bautista agut", "sentiment": "negative"}, {"name": "david ferrer", "sentiment": "none"}, {"name": "ferrer", "sentiment": "none"}, {"name": "juan martin del potro", "sentiment": "none"}, {"name": "john isner reuters/charles platiau  del potro", "sentiment": "none"}, {"name": "roberto bautista agut", "sentiment": "none"}], "locations": [{"name": "auckland classic", "sentiment": "none"}, {"name": "auckland cla", "sentiment": "none"}, {"name": "auckland", "sentiment": "none"}, {"name": "argentina", "sentiment": "none"}, {"name": "accorhotels arena", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "auckland", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "usa", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 11:05 AM / Updated 7 hours ago Del Potro to face Bautista Agut in Auckland Classic final Reuters Staff 3 Min Read \nAUCKLAND (Reuters) - Juan Martin del Potro overcame a stubborn challenge from David Ferrer to clinch their semi-final 6-4 6-4 and advance to a title showdown against Roberto Bautista Agut in the Auckland Classic on Friday. Tennis - ATP 1000 Masters Series - Rolex Paris Masters - AccorHotels Arena, Paris, France - November 3, 2017 Argentina’s Juan Martin del Potro during his quarter final match against USA's John Isner REUTERS/Charles Platiau \nDel Potro, who sealed the Auckland title in 2009, shone in the key moments and fought off six of the seven break points Ferrer forged in a tense clash, with two games in the second set lasting almost 10 minutes apiece. \nThe Argentine’s massive forehand, however, was the major defining factor in the match as he worked himself into a position to drive winner after winner past the Spaniard and clinched the semi-final in one hour, 46 minutes. \n“I‘m exhausted,” Del Potro said in a court-side interview. “We played a great match. I think the crowd enjoyed the game. I did too. It’s never easy against David because he is such a fighter and runs a lot, I just took my chances.” \nDel Potro will enter the top 10 for the first time since August 2010 on Monday ahead of his Australian Open first round clash against American teenager Frances Tiafoe. \nHe won the Auckland tournament in 2009 before going on to win his maiden grand slam title at Flushing Meadows later the same year. \nHowever, the tall Argentine has battled with serious wrist injuries since 2014 and had to rehabilitate from four surgeries, but showed that his forehand, especially the ability to clinch winners on the run, will be a big threat in Melbourne. \n“It’s amazing to me to be playing tennis again after my wrist problems,” Del Potro added. \n“I‘m just so pleased to be able to make another final.” \nEarlier, fifth seed Bautista Agut outlasted Dutchman Robin Haase in an epic clash that took almost three hours before the Spaniard produced an audacious backhand lob that kissed the baseline to clinch the 6-7(7) 7-6(3) 7-6(5) win. \n”Unfortunately the match can’t have two winners,“ an exhausted Bautista Agut said after the two hour, 52 minute clash. ”It was an unbelievable battle on the court. \n“At the end everything was close, everybody knows we left everything on the court and anything could have happened.” \nThe 29-year-old, who won the title in 2016 but missed his defence last year due to illness, sunk to one knee and let out a massive yell of jubilation after he saw the ball drop in. \n”The end was unbelievable,“ he said. ”When I saw the ball was in, I went crazy. \n”I passed very bad moments on the court and that moment I screamed because I was very stressed. \n“I‘m just so happy that I have won.” Reporting by Greg Stutchbury in Wellington; Editing by John O'Brien", "external_links": [], "published": "2018-01-12T13:00:00.000+02:00", "crawled": "2018-01-12T13:41:16.021+02:00", "highlightTitle": ""}