{"organizations": [], "uuid": "eb9c86620eb5394b1467a686efc2441248bef18b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-axiomsl-recruits-james-babicz-to-lead-canadian-operations-opens-toronto-office.html", "country": "US", "domain_rank": 767, "title": "AxiomSL Recruits James Babicz to Lead Canadian Operations; Opens Toronto Office", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.062, "site_type": "news", "published": "2018-01-18T14:00:00.000+02:00", "replies_count": 0, "uuid": "eb9c86620eb5394b1467a686efc2441248bef18b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-axiomsl-recruits-james-babicz-to-lead-canadian-operations-opens-toronto-office.html", "ord_in_thread": 0, "title": "AxiomSL Recruits James Babicz to Lead Canadian Operations; Opens Toronto Office", "locations": [], "entities": {"persons": [{"name": "james babicz", "sentiment": "negative"}, {"name": "babicz", "sentiment": "none"}], "locations": [{"name": "toronto", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "opens toronto office", "sentiment": "negative"}, {"name": "lead canadian operations", "sentiment": "negative"}, {"name": "western bank", "sentiment": "none"}, {"name": "analytics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO--(BUSINESS WIRE)-- AxiomSL , the leading global provider of regulatory reporting, risk and data management solutions, today announced the appointment of James Babicz as Senior Vice President and Head of the recently opened Canadian office in Toronto, signaling the firm’s commitment to forge a strong Canadian presence. Mr. Babicz has more than 25 years’ experience in implementing risk management solutions to address Canadian and international regulatory requirements.\nMr. Babicz joins AxiomSL from Canadian Western Bank, where he held a senior role in risk management, directing Risk Data Aggregation, Analytics and Reporting programs. He oversaw the development and execution of multiple projects, updating and streamlining the bank’s risk management operations. He worked directly with the bank’s executives to successfully deploy and operationalize the data, technology and processes required to meet regulatory obligations. Additionally, he conducted an audit of the bank’s risk management and regulatory capital models, aggregation, and reporting processes and spearheaded an initiative that resulted in significant capital savings.\nAxiomSL’s center in Canada will be based in Toronto, where the team will deploy, implement and support AxiomSL’s regulatory, risk and data management solutions across the country. The Canadian-based team will ensure that AxiomSL’s solutions constantly evolve to address the ever-changing regulatory demands of the Canadian market. Currently, AxiomSL’s global team is analyzing and preparing a plan of action to adapt its solutions to meet the latest guidelines in the recent BCBS December 2017 publication. Other Canadian financial regulations the team will focus on include: Basel III, BCAR, IFRS 9, FATCA/CRS, Liquidity Stress Testing, LCR & NSFR, FRTB, Shareholding Disclosures and more.\n“We are pleased to welcome James to AxiomSL, as he will play a pivotal role in building our Canadian presence,” said Alex Tsigutkin, Founder and CEO of AxiomSL. “His depth of expertise and experience in deploying Basel and risk solutions within Canada and globally will ensure that we continue to act as a leader. James brings valuable perspective and deep insights into the challenges and priorities our clients have in the Canadian market, and we are thrilled to have opened an office in Canada.”\nPrior to joining Canadian Western Bank in 2012, Mr. Babicz served as head of risk at SAS UK and Ireland and also held leadership positions at Algorithmics, where he was involved in the development of regulatory capital calculation, aggregation and reporting solutions to meet OSFI requirements.\nOn his appointment, Mr. Babicz said, “I’m absolutely delighted to join AxiomSL, an organization that has an outstanding reputation as an international leader in risk and data management and regulatory reporting. I admire and share the team’s dedication, focus and passion for exceeding client expectations, and I’ve seen these values demonstrated first-hand by those working day-to-day on projects, as well as by the entire executive team. I am excited to be working with talented individuals, and I look forward to delivering solutions to the most complex regulatory, risk and data management challenges for AxiomSL’s Canadian clients.”\nAxiomSL’s Toronto office is located at 36 Toronto Street, 8 th floor.\nAbout AxiomSL:\nAxiomSL is the leading global provider of regulatory reporting, risk and data management solutions for financial services firms, including banks, broker dealers, asset managers and insurance companies. Its unique enterprise data management (EDM) platform delivers data lineage, risk aggregation, analytics, workflow automation, validation and audit functionality. For more information, visit AxiomSL at www.axiomsl.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180118005315/en/\nMedia :\nWater & Wall Group\nDanielle Orsino, +1 646-343-9672\ndanielle@w.group\nor\nAxiomSL\nFrancine Gittins, +1 212-248-4188\nfgittins@axiomsl.com\nSource: AxiomSL", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.axiomsl.com&esheet=51745002&newsitemid=20180118005315&lan=en-US&anchor=www.axiomsl.com&index=2&md5=f65a660f07f77f03379cb89e8de28b13", "http://www.businesswire.com/news/home/20180118005315/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.axiomsl.com&esheet=51745002&newsitemid=20180118005315&lan=en-US&anchor=AxiomSL&index=1&md5=720d0daeb83ac9e7b5cee5fa9e14e0a7"], "published": "2018-01-18T14:00:00.000+02:00", "crawled": "2018-01-18T13:25:09.003+02:00", "highlightTitle": ""}