{"organizations": [], "uuid": "845acc3ad53e7e7e1457cf4308e3a61be647b3b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets/europe", "section_title": "European Stock Market News | Reuters.com", "url": "https://www.reuters.com/article/emea-loans/lpc-emea-lending-falls-to-us894bn-in-2017-idUSL8N1OY1LQ", "country": "US", "domain_rank": 408, "title": "LPC-EMEA lending falls to US$894bn in 2017", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.96, "site_type": "news", "published": "2018-01-03T18:27:00.000+02:00", "replies_count": 0, "uuid": "845acc3ad53e7e7e1457cf4308e3a61be647b3b0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/emea-loans/lpc-emea-lending-falls-to-us894bn-in-2017-idUSL8N1OY1LQ", "ord_in_thread": 0, "title": "LPC-EMEA lending falls to US$894bn in 2017", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "dair reilly", "sentiment": "none"}, {"name": "claire ruckin", "sentiment": "none"}], "locations": [{"name": "middle east", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "central europe", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "jan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Overall annual volume lowest since 2012\n* Leveraged lending highest since financial crisis\nBy Alasdair Reilly and Claire Ruckin\nLONDON, Jan 3 (Reuters) - Syndicated lending in Europe, the Middle East and Africa in 2017 dropped 2% to US$894bn from the 2016 total, as a result of subdued refinancing activity in the first half and patchy acquisition financing throughout the year.\n2017’s annual volume is the lowest since 2012, when US$703bn was raised, as low commodity prices, European elections and continuing uncertainty around Brexit, Donald Trump and North Korea constrained borrower appetite despite the highly attractive terms still on offer.\nThe high levels of activity in the leveraged loan market in n 2017 failed to compensate for the loss of corporate volume across the wider market.\nMeanwhile, volumes in Central Europe, the Middle East and Africa were hit by a lack of refinancing opportunities, western sanctions against Russia, depressed oil prices, competitive bond markets and political volatility.\n“Reduced loan volumes and number of deals coupled with improving bank balance sheets meant better terms for borrowers; but M&A was dominated by a limited number of jumbo acquisition financings. If you missed out on them, then the year was probably a disappointment,” a senior banker said.\nM&A loan volume dropped 9% to US$240bn in 2017 as activity remained sporadic. This was despite the ready availability of bridge loan financing and quick and cheap refinancing through the bond market as well as the rising Schuldschein market.\nJumbo loans dominated and the five biggest loans of the year were all acquisition related.\nIn January, British American Tobacco closed the largest loan of the year, placing US$25bn of bridge loans and £5.68bn (US$7.72bn)of forward starting revolving credit facilities backing its acquisition of the remaining 57.8% stake in Reynolds American it did not already own.\nIn March, UK consumer goods group Reckitt Benckiser syndicated US$21.2bn-equivalent of loans supporting its US$17.9bn acquisition of US baby formula maker Mead Johnson Nutrition Co.\nGerman infrastructure group Hochtief closed a €15bn (US$18.05bn)loan in November backing its €17.1bn bid for Spanish motorway operator Abertis, after Italian transport infrastructure company Atlantia backed its rival €17bn cash-and-shares bid in May with a €14.7bn loan.\nFinnish utility Fortum closed a €12bn loan in September backing its €8.05bn bid for German conventional generation and energy trading group Uniper.\nREFINANCING RETURNS Refinancing, traditionally the main driver of the EMEA syndicated loan market, rebounded strongly in 2017 up 31% to US$564bn making up a substantial 63% of the market, as the second half of the year saw some companies refinance early while conditions remained positive.\nIn 2016 refinancing made up just 47% of the market as most companies remained comfortable having locked in low-priced loans until 2019 to 2021.\nA number of big hitters came back to refinance their loans either through new credit facilities or amend and extends, including Nestle, which completed its annual renewal of €11bn-equivalent of loans in October.\nItalian utility Enel signed a €10bn loan refinancing in December, replacing a €9.44bn facility that was due to mature in February 2020. Prior to that, German car maker BMW signed a €6bn refinancing in October on benchmark pricing.\nBanks expect more refinancing in 2018 as 2019 maturities loom and ahead of potential interest rate rises and a possible tapering of the ECB’s quantitative easing programmes.\nLEVERAGED FRENZY Leveraged lending rose nearly 40% to US$256bn in 2017 compared to US$182.72bn in 2016, reaching a 10-year high not seen since the financial crisis.\nThe first half of 2017 saw volume of US$142bn as borrowers took advantage of deep liquidity to reprice and refinance existing facilities on a more attractive basis.\nFirst half activity was enough to bolster total annual volume and compensate for a decline in second half volume, which totalled US$114bn, as sponsors and investors focused on new money transactions.\nThe pickup in event-driven financings during the second half of 2017 pushed buyout activity to US$49bn above the US$41bn seen in 2016. Fewer but larger buyout transactions came to the market in 2017 with 100 deals completed in the year, down from 120 in 2016.\nA number of public-to-privates provided some jumbo financings, much to the relief of new and existing CLOs and managed accounts desperate for new paper.\n“Refinancings and repricings dominated the first half of 2017 but buyout activity picked up in the second half providing some much needed new blood to Europe’s leveraged loan market. Take privates were the buzz word in the second half,” a senior loan banker said.\nA €2.95bn-equivalent financing backing US private equity firm Hellman & Friedman’s DKr33.1bn (US$5.3bn) take-private of payments firm Nets was the largest leveraged loan of the year.\nThe financing comprised a €1.86bn term loan B, which was the largest single tranche euro term loan B since the financial crisis, sources said. Despite its size, the borrower paid a tight margin of 325bp over Euribor, the tighter end of 325bp-350bp pricing guidance, characterising a year where demand far outweighed supply.\nOther large P2Ps included a US$2.6bn cross-border loan financing that closed in November and backed the buyout of UK-based payment processing company Paysafe as well as a €1.4bn loan and a £266m loan for German generic drugmaker Stada that formed part of a larger loan and bond financing backing its €5.2bn buyout.\nStada was the largest leveraged loan of the third quarter, followed by a €1.09bn and £200m term loan for Dutch-headquartered bottle manufacturer Refresco, backing its acquisition of the bottling activities of listed Canada-based Cott Corp.\nThe pipeline has been building and the first quarter of 2018 looks set for a good start with the likes of an approximate €5.5bn leveraged financing backing US private equity firm KKR’s €6.83bn acquisition of Unilever’s margarine and spreads business. The leveraged loan element will total up to €3.9bn-equivalent, sources said.\nHSBC topped the 2017 EMEA syndicated loan bookrunner league table, with a US$41.88bn market share and 167 deals. BNP Paribas claimed second place with US$38.45bn and 223 deals, while Deutsche Bank was third with a US$35.94bn market share and 118 deals. ($1 = 0.7361 pounds) ($1 = 0.8308 euros) (Editing by Christopher Mangham)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-03T18:27:00.000+02:00", "crawled": "2018-01-03T19:34:11.011+02:00", "highlightTitle": ""}