{"organizations": [], "uuid": "6dd770efc92c99d1a88a52aaa738f162bd726b25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223127140&w=1200&r=LYNXMPEE0H1V7", "site_section": "http://feeds.reuters.com/reuters/domesticNews/", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-congress-harassment/u-s-lawmakers-may-soon-be-liable-for-sexual-harassment-payouts-idUSKBN1F72XL", "country": "US", "domain_rank": 408, "title": "U.S. lawmakers may soon be liable for sexual harassment payouts", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T22:09:00.000+02:00", "replies_count": 0, "uuid": "6dd770efc92c99d1a88a52aaa738f162bd726b25"}, "author": "", "url": "https://www.reuters.com/article/us-usa-congress-harassment/u-s-lawmakers-may-soon-be-liable-for-sexual-harassment-payouts-idUSKBN1F72XL", "ord_in_thread": 0, "title": "U.S. lawmakers may soon be liable for sexual harassment payouts", "locations": [], "entities": {"persons": [{"name": "harvey weinstein", "sentiment": "none"}, {"name": "john conyers", "sentiment": "none"}, {"name": "matt lauer", "sentiment": "none"}, {"name": "paul ryan", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "office of compliance", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 09 PM / Updated 9 minutes ago U.S. lawmakers may soon be liable for sexual harassment payouts Reuters Staff 3   Members of the U.S. House of Representatives could no longer use public funds for awards or settlements in sexual harassment cases under bipartisan legislation unveiled on Thursday that updates a 20-year law governing the rights of congressional employees. \nLeaders from both parties, including Speaker Paul Ryan, the most powerful lawmaker in the chamber, support the bill, indicating it should pass quickly and easily in a Congress frequently frozen by partisan standoffs. \nA growing wave of women reporting abuse or misconduct has brought down powerful men recently, from movie producer Harvey Weinstein to popular television personality Matt Lauer, as well as one of the longest-serving Democrats in Congress, former Representative John Conyers. \nWhen that wave swept through Capitol Hill, the congressional Office of Compliance revealed it had paid out more than $160,000 in the last decade to settle sexual harassment or discrimination claims against lawmakers, sparking outrage that public money may have been used as a “hush fund.” Lawmakers and activists also began to say that protections for congressional employees passed in 1995 were woefully out-of-date. \nRepublican Representative Blake Farenthold announced last month he would not seek re-election in November after reports that the office had paid $84,000 from a public fund on his behalf for a sexual harassment claim and staff members alleged he had created a hostile work environment. \nUnder the new legislation, which a group of 13 House members led by Republican House Administration Committee Chairman Greg Harper began drafting last month, lawmakers would have to reimburse the Treasury for awards and settlements paid on their behalf within 90 days, even after they leave office. \nThe bill also requires the compliance office to report and publish information on awards every six months with details on the claims and to survey employees about their work environment every two years. It beefs up employee protections, such as providing an advocate to assist workers in proceedings conducted by the office or the Ethics Committee, as well. \n“It ensures that victims of workplace harassment have the resources they need to get the justice they deserve,” said Ryan in a statement. “No staffer or Member should ever feel unsafe in public service, and this bill will help make that a reality.” Reporting by Lisa Lambert; Editing by Richard Chang", "external_links": [], "published": "2018-01-18T22:09:00.000+02:00", "crawled": "2018-01-18T22:25:51.016+02:00", "highlightTitle": ""}