{"organizations": [], "uuid": "ea937a9dcf7cae0d289e772efade3995dbf5353b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-euro-zone-bond-markets-turn-defensive-as-ecb-meeting-looms-idUSL8N1PJ3DR", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Euro zone bond markets turn defensive as ECB meeting looms", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T20:28:00.000+02:00", "replies_count": 0, "uuid": "ea937a9dcf7cae0d289e772efade3995dbf5353b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-euro-zone-bond-markets-turn-defensive-as-ecb-meeting-looms-idUSL8N1PJ3DR", "ord_in_thread": 0, "title": "UPDATE 2-Euro zone bond markets turn defensive as ECB meeting looms", "locations": [], "entities": {"persons": [{"name": "dhara ranasinghe", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Euro hits 3-year highs vs dollar\n* Lifts expectation of dovish ECB meeting on Thursday\n* Stellar periphery rally pauses for now\n* Euro zone periphery govt bond yields tmsnrt.rs/2ii2Bqr (Updates prices)\nBy Dhara Ranasinghe\nLONDON, Jan 24 (Reuters) - Bond yields in the euro zone crept higher on Wednesday, as investors struck a cautious tone the day before a European Central Bank meeting.\nThursday’s ECB gathering is shaping up as a more lively event than anticipated just a few weeks ago: the central bank has flagged “early” 2018 for a revision of its policy guidance and this has led to talk of a possible early rise in interest rates.\nBut a strong euro, which rose above $1.23 to its highest level since December 2014, could encourage the ECB to play down talk of an imminent change in its policy stance.\nThe euro has gained 17 percent against the dollar since the start of 2017, putting downward pressure on inflation and making it harder for the ECB to achieve its near 2 percent target.\nECB bond buys have not led to “statistically significant” moves in the euro and exchange rate shifts are a side effect, not the objective of policy, ECB President Mario Draghi said in a letter on Wednesday.\n“ECB President Draghi’s priority will be to talk down growing expectations of early interest rate hikes and a strengthening euro,” said ABN AMRO senior fixed income strategist Kim Liu.\n“We estimate that the recent euro strength will reduce the ECB’s projections for core inflation by around 0.1-0.2 percentage points. Against this background, we expect a dovish January ECB meeting, resulting in euro weakness and a short term correction in yields.”\nBond yields across the single currency bloc were 1 to 3 basis points higher on the day.\nFrance’s 10-year bond yield hit its highest point since the ECB’s October meeting at 0.886 percent, while Germany’s 10-year Bund, the benchmark for the region, hovered near multi-month highs.\nSouthern European bonds, the big outperformers this week following ratings upgrades for Greece and Spain on Friday and overwhelming demand at a Spanish bond sale on Tuesday, were also slightly weaker.\nThe 10-year yield gaps that Spanish and Portuguese bonds hold over German peers were a touch wider, having hit their narrowest levels since 2010 on Tuesday.\nPeripheral debt markets have also benefited from a scaling back of rate-hike expectations after recent comments from ECB officials playing down a near-term shift in policy.\nMoney markets price roughly a 40 percent chance of a 10 bps hike by year-end, versus 70 percent earlier this month .\n“I think the market is starting to reassess its view on the ECB policy normalization but I think tomorrow will be too soon to get any signal in change in policy stance from the ECB,” said Marilyn Watson, head of the global fundamental bond product strategy team at BlackRock.\n“Our view is that by the end of the year they will finish buying assets and as the year unfolds will signal any interest rate hikes for next year.”\nEuro zone businesses kicked off 2018 in much better shape than anyone polled by Reuters expected, ramping up activity at the fastest rate since the middle of 2006, a survey meanwhile showed on Wednesday.\nReporting by Dhara Ranasinghe; Additional reporting by Saikat Chatterjee & fanny Potkin; Editing by Richard Balmforth\n ", "external_links": ["http://tmsnrt.rs/2ii2Bqr", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T20:28:00.000+02:00", "crawled": "2018-01-24T21:24:41.008+02:00", "highlightTitle": ""}