{"organizations": [], "uuid": "aede7430b754ef264e7da818cfe2b05d88f97a23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-paragon-bioservices-bolsters-leadership-ranks-with-executive-appointments-new-vice-president-hires.html", "country": "US", "domain_rank": 767, "title": "Paragon Bioservices Bolsters Leadership Ranks with Executive Appointments, New Vice President Hires", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-25T17:00:00.000+02:00", "replies_count": 0, "uuid": "aede7430b754ef264e7da818cfe2b05d88f97a23"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-paragon-bioservices-bolsters-leadership-ranks-with-executive-appointments-new-vice-president-hires.html", "ord_in_thread": 0, "title": "Paragon Bioservices Bolsters Leadership Ranks with Executive Appointments, New Vice President Hires", "locations": [], "entities": {"persons": [{"name": "john conner", "sentiment": "none"}, {"name": "william \"bill\" thomas", "sentiment": "none"}, {"name": "philip wills", "sentiment": "none"}, {"name": "randy henrickson", "sentiment": "none"}, {"name": "wills", "sentiment": "none"}, {"name": "philip", "sentiment": "none"}, {"name": "dermot mccaul", "sentiment": "none"}], "locations": [{"name": "baltimore", "sentiment": "none"}], "organizations": [{"name": "assay development", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BALTIMORE, Jan. 25, 2018 /PRNewswire/ -- Paragon Bioservices, the leading private equity-backed biologics contract development and manufacturing organization (CDMO) with proven expertise in gene therapy and next-generation vaccines, announces today the promotion of key personnel and the addition of two industry veterans to its leadership team. Specifically, the Company appoints Philip Wills, PhD, as Chief Commercial Officer, John Conner as Chief Manufacturing Officer, and William \"Bill\" Thomas, Jr., PhD, as Chief Scientific Officer, and hires Randy Henrickson as VP of Manufacturing and Dermot McCaul as VP of Information Technology.\nRecent Leadership Appointments\nDr. Wills has been instrumental to the growth of Paragon Bioservices and helping build the Company's reputation as a global CDMO leader in the gene therapy and vaccine space. He initially joined Paragon as Group Leader of Assay Development in July 2002, and during his tenure with the company has held many key positions.\n\"Since joining Paragon, Philip has played a vital role in growing our organization and helping us pivot to our new and aggressive growth strategy. He's led the way in building our current brand as well as solidifying our position in the marketplace,\" said President and CEO of Paragon Bioservices Pete Buzy.\nMr. Conner is a biotechnology operations executive who has successfully led development in the areas of manufacturing, process development, analytical, manufacturing science and technology operations. He has over 30 years of experience and has spent much of his career successfully meeting the challenges of providing manufacturing services to the biotechnology industry. Mr. Conner was most recently the Senior Vice President of Operations at CDMO, Cytovance Biologics, where he was responsible for building the operations team, manufacturing facilities and GMP systems, and providing world-class GMP manufacturing over several biologic platforms.\n\"John's experience and leadership in driving our growth, while expanding our manufacturing capabilities to meet burgeoning client needs, including our anticipated commercial manufacturing capacity in the next few years, has been invaluable to Paragon,\" stated Mr. Buzy.\nIn his role as Chief Scientific Officer, Dr. Thomas will work to continue to strengthen Paragon's collaborative partnerships, supporting the scientific aspects of product development. Dr. Thomas has more than 25 years of experience in the development and manufacture of vaccines and monoclonal antibodies. Before joining Paragon in 2016, he spent the last 15 years with MassBiologics at the University of Massachusetts Medical School, where he was responsible as Deputy Director for Product Discovery, Process Development and Manufacturing. Among his many accomplishments while there, Dr. Thomas led the development of monoclonal antibodies against C. difficile that were recently approved for human use.\n\"Bill has significantly advanced our scientific reputation and is evolving Paragon's client relationships to be that of collaborative partnerships,\" added Mr. Buzy.\nNew VP Hires\n\"Due to the Company's rapid and expansive growth garnered by client-base needs over the last few years, we have further invested in the ranks and capabilities of Paragon's leadership team,\" said Mr. Buzy of the new vice president hires. \"We are strategically assembling a number of experts in the field who have strong capacity to add value in building the infrastructure and complementing processes necessary to continue to deliver materials for our clients.\"\nOnce such strategic hire is that of Randy Henrickson as VP of Manufacturing. Mr. Henrickson is an accomplished senior-level manufacturing leader with over 20 years of experience within the biopharma industry. Most notable was his time at KBI Biopharma as SVP and Site Head where he was responsible for operations, client interactions, R&D and process development functions at the Boulder, Colorado, site after KBI acquired the site from Merck Biologics. Prior to this, he held senior level positions at Merck and Amgen leading technical operations and process development.\nAlso joining Paragon's Leadership team as a new hire is Dermot McCaul, VP of Information Technology. Mr. McCaul's technical and business expertise will be vital in moving the Company to a multi-site platform that can be scaled as appropriate to accommodate growth. Mr. McCaul spent his career with Merck, starting in Vaccine Manufacturing in multiple roles in Quality Assurance, Operations, and Engineering and culminating as the Director of Global IT Research for Preclinical Small Molecule development. Mr. McCaul's addition will ensure Paragon Bioservices has the appropriate technology strategy to propel the company towards Phase III/commercial readiness.\n\"We have built a world-class team to complement the Company's outstanding pre-clinical development and later-stage manufacturing capabilities,\" added Mr. Buzy. \"With Randy and Dermot joining our team, we are further expanding our capabilities to continue growing our value proposition as a leader in manufacturing gene therapies and next-generation vaccines.\"\nEarlier this week, Paragon Bioservices announced its plans for expansion , including late-phase and commercial manufacturing—acquiring a new 150,000-square-foot process development and cGMP manufacturing facility outside of Baltimore, convenient to Baltimore/Washington International (BWI)Thurgood Marshall Airport.\nAbout Paragon Bioservices, Inc.\nParagon Bioservices is an industry-leading, private-equity backed CDMO whose focus is the development and manufacturing of cutting-edge biopharmaceuticals. Paragon aims to build strong client partnerships with the world's best biotech and pharma companies, focusing on transformative technologies, including gene therapies (AAV), next-generation vaccines, oncology immunotherapies (oncolytic viruses and CAR-T cell therapies), therapeutic proteins, and other complex biologics. For more information, please visit www.paragonbioservices.com .\nCorporate Contact\nPhilip Wills, Chief Commercial Officer\nPH (410) 975-4050\nMedia Contact\nJuliette Bogus\nPH (410) 980-5687\nJuliette.bogus@gmail.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/paragon-bioservices-bolsters-leadership-ranks-with-executive-appointments-new-vice-president-hires-300588097.html\nSOURCE Paragon Bioservices, Inc.", "external_links": ["http://www.paragonbioservices.com/", "http://www.prnewswire.com/news-releases/paragon-bioservices-bolsters-leadership-ranks-with-executive-appointments-new-vice-president-hires-300588097.html", "http://paragonbioservices.com/january-23-2018/"], "published": "2018-01-25T17:00:00.000+02:00", "crawled": "2018-01-25T18:29:37.000+02:00", "highlightTitle": ""}