{"organizations": [], "uuid": "59cdb654869004f5f55184f91197d343566092c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-lakeland-bancorp-completes-sixth-consecutive-year-of-record-earnings.html", "country": "US", "domain_rank": 767, "title": "Lakeland Bancorp Completes Sixth Consecutive Year of Record Earnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.033, "site_type": "news", "published": "2018-01-26T16:00:00.000+02:00", "replies_count": 0, "uuid": "59cdb654869004f5f55184f91197d343566092c6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-lakeland-bancorp-completes-sixth-consecutive-year-of-record-earnings.html", "ord_in_thread": 0, "title": "Lakeland Bancorp Completes Sixth Consecutive Year of Record Earnings", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.j.", "sentiment": "none"}], "organizations": [{"name": "lakeland bancorp", "sentiment": "negative"}, {"name": "lakeland bancorp, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "lakeland bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OAK RIDGE, N.J., Jan. 26, 2018 (GLOBE NEWSWIRE) -- Lakeland Bancorp, Inc. (NASDAQ:LBAI) (the “Company”), the parent company of Lakeland Bank (“Lakeland”), reported net income and diluted earnings per share (“EPS”) of $13.2 million and $0.27 for the three months ended December 31, 2017, compared to $12.0 million and $0.26 for the three months ended December 31, 2016. For the fourth quarter of 2017, return on average assets was 0.97%, return on average common equity was 8.99%, and return on average tangible common equity was 11.82%. Excluding the impact of the $0.6 million one-time charge taken in the fourth quarter of 2017 for the implementation of the Tax Cuts and Jobs Act of 2017, net income would have been $13.8 million and EPS would have been $0.29.\nIn 2017, the Company reported net income of $52.6 million, compared to $41.5 million in 2016. The Company reported EPS of $1.09 in 2017 compared to $0.95 in 2016. In 2017, return on average assets was 1.00%, return on average common equity was 9.25%, and return on average tangible common equity was 12.24%. Excluding the impact of the $0.6 million one-time charge taken in 2017 for the implementation of the Tax Cuts and Jobs Act of 2017, net income would have been $53.2 million and EPS would have been $1.11 in 2017. Excluding the impact of merger costs in 2016, net income would have been $44.3 million and EPS would have been $1.02 in 2016.\nThomas Shara, Lakeland Bancorp’s President and CEO, commented on the Company’s results, “We are pleased to announce 2017’s financial results as another year of record earnings. We have continued to focus on growing shareholder value with net income growth of 20%, earnings per share growth of 9% and a return on average assets of 1% in 2017. Our results are highlighted by our continued improvement in asset quality, reduction in our efficiency ratio to 53% and a consistent loan-to-deposit ratio of 95%.”\nRegarding the recently passed changes to the tax laws, Mr. Shara continued, “The decrease in the corporate tax rate allows Lakeland to further invest in our future. We intend to utilize approximately 20% of the tax savings by accelerating and expanding our investments in personnel and technology that will continue to enhance the delivery of banking services and products to our customers. In addition, we plan to further increase our financial support of non-profits in the communities we serve.”\nThe following represents performance highlights and significant events related to the fourth quarter of 2017:\nReturn on average assets of 0.97% grew from 0.95% in the fourth quarter of 2016. The efficiency ratio of 53.06% improved from 56.35% in the fourth quarter of 2016. Net interest margin of 3.37% decreased 2 basis points from the prior quarter and increased 10 basis points from the fourth quarter of 2016. Tangible book value per share increased 8% to $9.38 at December 31, 2017 from $8.70 at December 31, 2016. Total non-performing assets decreased to 0.27% of total assets at December 31, 2017 from 0.42% of total assets at December 31, 2016. On January 23, 2018, the Company declared a cash dividend of $0.10 per share to be paid on February 15, 2018 to stockholders of record as of February 5, 2018.\nEarnings\nNet income for the fourth quarter of 2017 was $13.2 million, a 10% increase compared to $12.0 million in 2016. EPS for the fourth quarter of 2017 was $0.27, a 4% increase compared to $0.26 in 2016. Excluding the $0.6 million one-time tax charge during the quarter, quarterly net income increased 15% and EPS increased 12%.\nNet income for 2017 was $52.6 million, a 27% increase compared to $41.5 million in 2016. EPS for 2017 was $1.09, a 15% increase compared to $0.95 in 2016. Excluding merger related expenses incurred in 2016 and the $0.6 million one-time tax charge in 2017, net income increased 20% and EPS increased 9%.\nNet Interest Income\nNet interest income increased to $42.4 million for the fourth quarter of 2017, compared to $38.2 million for the fourth quarter of 2016 due primarily to the organic growth of earning assets.\nNet interest income for 2017 was $165.2 million, as compared to $145.6 million in 2016. Total interest income increased $26.9 million primarily due to higher interest earning assets from organic growth and the merger with Harmony Bank in July 2016 (the “merger”). Total interest expense increased $7.3 million primarily due to the deposits acquired in the merger, continued organic deposit growth coupled with higher CD rates and the impact of the additional interest expense from the subordinated debt offering in September 2016.\nNoninterest Income\nNoninterest income totaled $5.8 million for the fourth quarter of 2017 compared to $5.2 million for the fourth quarter of 2016. This change was primarily due to increases in service charges on deposit accounts and income on additional bank owned life insurance policies.\nIn 2017, noninterest income totaled $25.4 million compared to $21.3 million in 2016. This increase was primarily due to $2.5 million in gains on sales of investment securities in the first quarter of 2017, $0.9 million in gains on sales of three former branches during 2017, a $0.4 million increase on the sales of other real estate owned in 2017 and a $0.3 million gain on the payoff of an acquired loan in 2017, partially offset by a $0.3 million decline in gains on sales of loans during 2017.\nNoninterest Expense\nNoninterest expense totaled $25.8 million for the fourth quarter of 2017 compared to $24.8 million for the fourth quarter of 2016. The increase in noninterest expense was primarily due to additional salary and employee benefit expense from additional personnel and bonus accruals, partially offset by a decrease in other expenses.\nIn 2017, noninterest expense totaled $104.5 million, compared to $99.9 million in 2016. During 2017, the Company incurred long-term debt prepayment penalties of $2.8 million, and during 2016, the Company incurred $4.1 million in merger related expenses. Excluding these items, the resulting $5.9 million net increase in noninterest expense was primarily due to $5.1 million in increased salary and employee benefit expense related to additional headcount from the merger and new hiring as well as year-over-year salary increases and additional bonus accruals. This increase in salary and employee benefit expense was partially offset by a decrease in FDIC expense of $0.7 million.\nFinancial Condition\nIn 2017, total assets increased $312.5 million, or 6%, to $5.41 billion as total loans and leases grew $282.8 million, or 7%, to $4.16 billion, investment in bank owned life insurance grew $35.1 million, or 48%, to $107.5 million and investment securities increased $29.0 million, or 4%, to $798.4 million. On the funding side, total deposits grew $275.9 million, or 7%, to $4.37 billion. As of December 31, 2017, total loans and leases to total deposits was 95%.\nAsset Quality\nAt December 31, 2017, non-performing assets totaled $14.5 million (0.27% of total assets) compared to $21.5 million (0.42% of total assets) at December 31, 2016. Non-accrual loans and leases as a percent of total loans and leases decreased to 0.33% at December 31, 2017 from 0.53% at December 31, 2016. The allowance for loan and lease losses increased to $35.5 million at December 31, 2017 (0.85% of total loans and leases) compared to $31.2 million at December 31, 2016 (0.81% of total loans and leases). In 2017, the Company had net charge-offs of $1.9 million (0.05% of average loans and leases) compared to $3.9 million (0.11% of average loans and leases) in 2016. The 2017 provision for loan and lease losses was $6.1 million compared to $4.2 million in 2016.\nCapital\nAt December 31, 2017, stockholders' equity was $583.1 million compared to $550.0 million at December 31, 2016, a 6% increase. At December 31, 2017, the book value per common share and tangible book value per common share were $12.31 and $9.38 compared to $11.65 and $8.70 at December 31, 2016.\nForward-Looking Statements\nThe information disclosed in this document includes various forward-looking statements (with respect to corporate objectives, trends, the expected impact from the Tax Cuts and Jobs Act of 2017, and other financial and business matters) that are made in reliance upon the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. The words “anticipates”, “projects”, “intends”, “estimates”, “expects”, “believes”, “plans”, “may”, “will”, “should”, “could”, and other similar expressions are intended to identify such forward-looking statements. The Company cautions that these forward-looking statements are necessarily speculative and speak only as of the date made, and are subject to numerous assumptions, risks and uncertainties, all of which may change over time. Actual results could differ materially from such forward-looking statements. The following factors, among others, could cause actual results to differ materially and adversely from such forward-looking statements: changes in the financial services industry and the U.S. and global capital markets, changes in economic conditions nationally, regionally and in the Company’s markets, the nature and timing of actions of the Federal Reserve Board and other regulators, the nature and timing of legislation affecting the financial services industry, government intervention in the U.S. financial system, changes in levels of market interest rates, pricing pressures on loan and deposit products, credit risks of the Company’s lending and leasing activities, successful implementation, deployment and upgrades of new and existing technology, systems, services and products, customers’ acceptance of the Company’s products and services, and competition. Any statements made by the Company that are not historical facts should be considered to be forward-looking statements. The Company is not obligated to update and does not undertake to update any of its forward-looking statements made herein.\nExplanation of Non-GAAP Financial Measures\nReported amounts are presented in accordance with accounting principles generally accepted in the United States of America (\"GAAP\"). This press release also contains certain supplemental non-GAAP information that the Company’s management uses in its analysis of the Company’s financial results. Specifically, the Company provides measures based on what it believes are its operating earnings on a consistent basis, and excludes material non-routine operating items which affect the GAAP reporting of results of operations. The Company’s management believes that providing this information to analysts and investors allows them to better understand and evaluate the Company’s core financial results for the periods in question.\nThe Company also provides measurements and ratios based on tangible equity and tangible assets. These measures are utilized by regulators and market analysts to evaluate a company’s financial condition and, therefore, the Company’s management believes that such information is useful to investors.\nThe Company also uses an efficiency ratio that is a non-GAAP financial measure. The ratio that the Company uses excludes amortization of core deposit intangibles, provision for unfunded lending commitments and, where applicable, long-term debt prepayment fees and merger related expenses. Income for the non-GAAP ratio is increased by the favorable effect of tax-exempt income and excludes gains and losses from the sale of investment securities and gain on debt extinguishment, which can vary from period to period. The Company uses this ratio because it believes the ratio provides a relevant measure to compare the operating performance period to period.\nThese disclosures should not be viewed as a substitute for financial results determined in accordance with GAAP, nor are they necessarily comparable to non-GAAP performance measures which may be presented by other companies. See accompanying non-GAAP tables.\nAbout Lakeland Bank\nLakeland Bank is the wholly-owned subsidiary of Lakeland Bancorp, Inc. (NASDAQ:LBAI), which has $5.4 billion in total assets. The Bank operates 53 branch offices throughout Bergen, Essex, Morris, Ocean, Passaic, Somerset, Sussex, and Union counties in New Jersey including one branch in Highland Mills, New York; six New Jersey regional commercial lending centers in Bernardsville, Jackson, Montville, Newton, Teaneck and Waldwick; and one in New York to serve the Hudson Valley region. Lakeland also has a commercial loan production office serving Middlesex and Monmouth counties in New Jersey. Lakeland Bank offers an extensive suite of financial products and services for businesses and consumers. Visit LakelandBank.com for more information.\nThomas J. Shara\nPresident & CEO\nThomas F. Splaine\nEVP & CFO\n973-697-2000\nLakeland Bancorp, Inc. Financial Highlights (Unaudited) Three Months Ended December 31, Twelve Months Ended December 31, (Dollars in thousands, except per share amounts) 2017 2016 2017 2016 INCOME STATEMENT Net interest income $ 42,379 $ 38,179 $ 165,238 $ 145,649 Provision for loan and lease losses (1,218 ) (375 ) (6,090 ) (4,223 ) Gains (losses) on sales of investment securities - - 2,524 370 Gains on sales of loans 489 525 1,836 2,123 Other noninterest income 5,287 4,636 21,075 18,837 Long-term debt prepayment fee - - (2,828 ) - Merger related expenses - - - (4,103 ) Other noninterest expense (25,849 ) (24,772 ) (101,706 ) (95,814 ) Pretax income 21,088 18,193 80,049 62,839 Provision for income taxes (7,913 ) (6,240 ) (27,469 ) (21,321 ) Net income $ 13,175 $ 11,953 $ 52,580 $ 41,518 Basic earnings per common share $ 0.28 $ 0.26 $ 1.10 $ 0.96 Diluted earnings per common share $ 0.27 $ 0.26 $ 1.09 $ 0.95 Dividends per common share $ 0.10 $ 0.095 $ 0.395 $ 0.37 Weighted average shares - basic 47,466 45,002 47,438 42,912 Weighted average shares - diluted 47,719 45,257 47,674 43,114 SELECTED OPERATING RATIOS Annualized return on average assets 0.97 % 0.95 % 1.00 % 0.90 % Annualized return on average common equity 8.99 % 9.31 % 9.25 % 8.75 % Annualized return on average tangible common equity (1) 11.82 % 12.83 % 12.24 % 12.19 % Annualized return on interest-earning assets 3.95 % 3.74 % 3.88 % 3.82 % Annualized cost of interest-bearing liabilities 0.75 % 0.62 % 0.67 % 0.54 % Annualized net interest spread 3.20 % 3.12 % 3.21 % 3.28 % Annualized net interest margin 3.37 % 3.27 % 3.38 % 3.41 % Efficiency ratio (1) 53.06 % 56.35 % 53.40 % 56.48 % Stockholders' equity to total assets 10.79 % 10.80 % Book value per common share $ 12.31 $ 11.65 Tangible book value per common share (1) $ 9.38 $ 8.70 Tangible common equity to tangible assets (1) 8.44 % 8.30 % ASSET QUALITY RATIOS 12/31/2017 12/31/2016 Ratio of allowance for loan and lease losses to total loans and leases 0.85 % 0.81 % Non-performing loans and leases to total loans and leases 0.33 % 0.53 % Non-performing assets to total assets 0.27 % 0.42 % Annualized net charge-offs to average loans and leases 0.05 % 0.11 % SELECTED BALANCE SHEET DATA AT PERIOD-END 12/31/2017 12/31/2016 Loans and leases $ 4,156,680 $ 3,873,895 Allowance for loan and lease losses 35,455 31,245 Investment securities 798,396 769,417 Total assets 5,405,639 5,093,131 Total deposits 4,368,748 4,092,835 Short-term borrowings 124,936 56,354 Other borrowings 296,913 365,650 Stockholders' equity 583,122 550,044 SELECTED AVERAGE BALANCE SHEET DATA For the Three Months Ended For the Twelve Months Ended 12/31/2017 12/31/2016 12/31/2017 12/31/2016 Loans and leases $ 4,116,920 $ 3,806,588 $ 4,024,257 $ 3,562,882 Investment securities 798,687 683,986 810,434 609,336 Interest-earning assets 5,014,333 4,680,156 4,926,986 4,295,384 Total assets 5,372,248 5,015,439 5,267,561 4,619,816 Noninterest-bearing demand deposits 988,451 951,418 959,298 852,629 Savings deposits 478,685 490,556 486,821 485,004 Interest-bearing transaction accounts 2,222,221 2,072,154 2,241,259 1,880,391 Time deposits 730,590 539,870 623,257 506,487 Total deposits 4,419,947 4,053,998 4,310,635 3,724,511 Short-term borrowings 43,130 27,538 41,695 36,242 Other borrowings 295,818 392,789 316,283 356,907 Total interest-bearing liabilities 3,770,444 3,522,907 3,709,315 3,265,031 Stockholders' equity 581,254 510,562 568,680 474,540 (1) See Supplemental Information - Non-GAAP Financial Measures\nLakeland Bancorp, Inc. Consolidated Statements of Operations (Unaudited) Three Months Ended December 31, Twelve Months Ended December 31, (Dollars in thousands, except per share amounts) 2017 2016 2017 2016 INTEREST INCOME Loans, leases and fees $ 44,889 $ 40,090 $ 172,342 $ 149,777 Federal funds sold and interest-bearing deposits with banks 262 228 880 569 Taxable investment securities and other 3,850 2,878 14,987 11,163 Tax exempt investment securities 460 487 1,995 1,787 TOTAL INTEREST INCOME 49,461 43,683 190,204 163,296 INTEREST EXPENSE Deposits 5,039 3,017 16,600 10,512 Federal funds purchased and securities sold under agreements to repurchase 38 3 198 69 Other borrowings 2,005 2,484 8,168 7,066 TOTAL INTEREST EXPENSE 7,082 5,504 24,966 17,647 NET INTEREST INCOME 42,379 38,179 165,238 145,649 Provision for loan and lease losses 1,218 375 6,090 4,223 NET INTEREST INCOME AFTER PROVISION FOR LOAN AND LEASE LOSSES 41,161 37,804 159,148 141,426 NONINTEREST INCOME Service charges on deposit accounts 2,814 2,577 10,740 10,157 Commissions and fees 1,309 1,089 4,858 4,349 Income on bank owned life insurance 804 437 2,354 2,562 Gains on sales of loans 489 525 1,836 2,123 Gains on sales of investment securities - - 2,524 370 Other income 360 533 3,123 1,769 TOTAL NONINTEREST INCOME 5,776 5,161 25,435 21,330 NONINTEREST EXPENSE Salaries and employee benefit expense 15,553 14,305 61,166 56,107 Net occupancy expense 2,573 2,534 10,243 9,935 Furniture and equipment expense 2,103 2,113 8,269 8,017 FDIC insurance expense 404 262 1,577 2,248 Stationary, supplies and postage expense 378 456 1,797 1,727 Marketing expense 324 549 1,675 1,672 Data processing expense 497 394 1,993 1,891 Telecommunications expense 451 342 1,607 1,631 ATM and debit card expense 547 433 2,051 1,582 Core deposit intangible amortization 165 202 654 734 Other real estate owned and other repossessed assets expense 73 83 181 116 Long-term debt prepayment fee - - 2,828 - Merger related expenses - - - 4,103 Other expenses 2,781 3,099 10,493 10,154 TOTAL NONINTEREST EXPENSE 25,849 24,772 104,534 99,917 INCOME B EFORE PROVISION FOR INCOME TAXES 21,088 18,193 80,049 62,839 Provision for income taxes 7,913 6,240 27,469 21,321 NET INCO ME $ 13,175 $ 11,953 $ 52,580 $ 41,518 EARNINGS PER COMMON SHARE Basic $ 0.28 $ 0.26 $ 1.10 $ 0.96 Diluted $ 0.27 $ 0.26 $ 1.09 $ 0.95 DIVIDENDS PER COMMON SHARE $ 0.10 $ 0.095 $ 0.395 $ 0.37\nLakeland Bancorp, Inc. Consolidated Balance Sheets December 31, December 31, (Dollars in thousands) 2017 2016 (Unaudited) ASSETS Cash $ 114,138 $ 169,149 Interest-bearing deposits due from banks 28,795 6,652 Total cash and cash equivalents 142,933 175,801 Investment securities available for sale, at fair value 646,135 606,704 Investment securities held to maturity; fair value of $138,688 at December 31, 2017 and $146,990 at December 31, 2016 139,685 147,614 Federal Home Loan Bank and other membership stocks, at cost 12,576 15,099 Loans held for sale 456 1,742 Loans and leases: Commercial, real estate 3,096,092 2,767,710 Commercial, industrial and other 340,400 350,228 Leases 75,039 67,016 Residential mortgages 322,880 349,581 Consumer and home equity 322,269 339,360 Total loans and leases 4,156,680 3,873,895 Net deferred costs (fees) (3,960 ) (3,297 ) Allowance for loan and lease losses (35,455 ) (31,245 ) Net loans and leases 4,117,265 3,839,353 Premises and equipment, net 50,313 52,236 Accrued interest receivable 14,416 12,557 Goodwill 136,433 135,747 Other identifiable intangible assets 2,362 3,344 Bank owned life insurance 107,489 72,384 Other assets 35,576 30,550 TOTAL ASSETS $ 5,405,639 $ 5,093,131 LIABILITIES AND STOCKHOLDERS' EQUITY LIABILITIES Deposits: Noninterest-bearing $ 967,335 $ 927,270 Savings and interest-bearing transaction accounts 2,663,985 2,620,657 Time deposits $250 thousand and under 556,863 404,680 Time deposits over $250 thousand 180,565 140,228 Total deposits 4,368,748 4,092,835 Federal funds purchased and securities sold under agreements to repurchase 124,936 56,354 Other borrowings 192,011 260,866 Subordinated debentures 104,902 104,784 Other liabilities 31,920 28,248 TOTAL LIABILITIES 4,822,517 4,543,087 STOCKHOLDERS' EQUITY Common stock, no par value; authorized 70,000,000 shares; issued 47,353,864 shares at December 31, 2017 and 47,222,914 shares at December 31, 2016 512,734 510,861 Retained earnings 72,737 38,590 Accumulated other comprehensive gain (loss) (2,349 ) 593 TOTAL STOCKHOLDERS' EQUITY 583,122 550,044 TOTA L LIABILITIES AND STOCKHOLDERS' EQUITY $ 5,405,639 $ 5,093,131\nLakeland Bancorp, Inc. Financial Highlights (Unaudited) For the Quarter Ended Dec 31, Sept 30, June 30, Mar 31, Dec 31, (Dollars in thousands, except per share data) 2017 2017 2017 2017 2016 INCOME STATEMENT Net interest income $ 42,379 $ 42,115 $ 41,421 $ 39,323 $ 38,179 Provision for loan and lease losses (1,218 ) (1,827 ) (1,827 ) (1,218 ) (375 ) Gains (losses) on sales of investment securities - - (15 ) 2,539 - Gains on sales of loans 489 478 471 398 525 Other noninterest income 5,287 4,976 5,655 5,157 4,636 Long-term debt prepayment fee - - - (2,828 ) - Other noninterest expense (25,849 ) (24,849 ) (25,366 ) (25,642 ) (24,772 ) Pretax income 21,088 20,893 20,339 17,729 18,193 Provision for income taxes (7,913 ) (7,170 ) (6,969 ) (5,417 ) (6,240 ) Net income $ 13,175 $ 13,723 $ 13,370 $ 12,312 $ 11,953 Basic earnings per common share $ 0.28 $ 0.29 $ 0.28 $ 0.26 $ 0.26 Diluted earnings per common share $ 0.27 $ 0.29 $ 0.28 $ 0.26 $ 0.26 Dividends per common share $ 0.10 $ 0.10 $ 0.10 $ 0.095 $ 0.095 Dividends paid $ 4,776 $ 4,775 $ 4,775 $ 4,527 $ 4,265 Weighted average shares - basic 47,466 47,466 47,465 47,354 45,002 Weighted average shares - diluted 47,719 47,692 47,674 47,623 45,257 SELECTED OPERATING RATIOS Annualized return on average assets 0.97 % 1.03 % 1.02 % 0.97 % 0.95 % Annualized return on average common equity 8.99 % 9.48 % 9.49 % 9.02 % 9.31 % Annualized return on average tangible common equity (1) 11.82 % 12.51 % 12.58 % 12.04 % 12.83 % Annualized net interest margin 3.37 % 3.39 % 3.41 % 3.33 % 3.27 % Efficiency ratio (1) 53.06 % 51.72 % 52.64 % 56.36 % 56.35 % Common stockholders' equity to total assets 10.79 % 10.69 % 10.58 % 10.63 % 10.80 % Tangible common equity to tangible assets (1) 8.44 % 8.33 % 8.20 % 8.20 % 8.30 % Tier 1 risk-based ratio 10.87 % 10.82 % 10.77 % 10.73 % 10.85 % Total risk-based ratio 13.40 % 13.37 % 13.32 % 13.29 % 13.48 % Tier 1 leverage ratio 9.12 % 9.07 % 8.99 % 8.97 % 9.07 % Common equity tier 1 capital ratio 10.18 % 10.13 % 10.06 % 10.01 % 10.11 % Book value per common share $ 12.31 $ 12.19 $ 11.99 $ 11.78 $ 11.65 Tangible book value per common share (1) $ 9.38 $ 9.25 $ 9.05 $ 8.84 $ 8.70 (1) See Supplemental Information - Non-GAAP Financial Measures\nLakeland Bancorp, Inc. Financial Highlights (Unaudited) For the Quarter Ended Dec 31, Sept 30, June 30, Mar 31, Dec 31, (Dollars in thousands) 2017 2017 2017 2017 2016 SELECTED BALANCE SHEET DATA AT PERIOD-END Loans and leases $ 4,156,680 $ 4,092,893 $ 4,054,276 $ 3,974,718 $ 3,873,895 Allowance for loan and lease losses 35,455 33,925 32,823 31,590 31,245 Investment securities 798,396 795,096 830,531 847,833 769,417 Total assets 5,405,639 5,399,481 5,362,187 5,247,815 5,093,131 Total deposits 4,368,748 4,356,996 4,227,204 4,293,393 4,092,835 Short-term borrowings 124,936 133,960 118,487 84,850 56,354 Other borrowings 296,913 301,411 417,093 278,238 365,650 Stockholders' equity 583,122 577,081 567,545 557,642 550,044 LOANS AND LEASES Commercial, real estate $ 3,096,092 $ 3,018,106 $ 2,955,596 $ 2,881,972 $ 2,767,710 Commercial, industrial and other 340,400 342,775 352,977 342,264 350,228 Leases 75,039 71,698 70,295 67,488 67,016 Residential mortgages 322,880 329,625 337,765 344,890 349,581 Consumer and home equity 322,269 330,689 337,643 338,104 339,360 Total loans and leases $ 4,156,680 $ 4,092,893 $ 4,054,276 $ 3,974,718 $ 3,873,895 DEPOSITS Noninterest-bearing $ 967,335 $ 955,444 $ 978,668 $ 924,581 $ 927,270 Savings and interest-bearing transaction accounts 2,663,985 2,681,512 2,682,291 2,809,705 2,620,657 Time deposits 737,428 720,040 566,245 559,107 544,908 Total deposits $ 4,368,748 $ 4,356,996 $ 4,227,204 $ 4,293,393 $ 4,092,835 Total loans and leases to total deposits ratio 95.1 % 93.9 % 95.9 % 92.6 % 94.7 % SELECTED AVERAGE BALANCE SHEET DATA Loans and leases $ 4,116,920 $ 4,060,838 $ 4,011,325 $ 3,905,216 $ 3,806,588 Investment securities 798,687 815,773 837,075 790,046 683,986 Interest-earning assets 5,014,333 4,957,856 4,907,488 4,825,855 4,680,156 Total assets 5,372,248 5,300,191 5,241,155 5,153,893 5,015,439 Noninterest-bearing demand deposits 988,451 971,143 954,966 921,770 951,418 Savings deposits 478,685 484,982 492,991 490,777 490,556 Interest-bearing transaction accounts 2,222,221 2,206,206 2,295,256 2,241,954 2,072,154 Time deposits 730,590 645,333 559,665 555,270 539,870 Total deposits 4,419,947 4,307,664 4,302,878 4,209,771 4,053,998 Short-term borrowings 43,130 42,172 52,951 28,358 27,538 Other borrowings 295,818 344,775 291,882 332,750 392,789 Total interest-bearing liabilities 3,770,444 3,723,468 3,692,745 3,649,109 3,522,907 Stockholders' equity 581,254 574,113 565,211 553,782 510,562\nLakeland Bancorp, Inc. Financial Highlights (Unaudited) For the Quarter Ended Dec 31, Sept 30, June 30, Mar 31, Dec 31, (Dollars in thousands) 2017 2017 2017 2017 2016 AVERAGE ANNUALIZED YIELDS (TAXABLE EQUIVALENT BASIS) ASSETS Loans and leases 4.33 % 4.33 % 4.27 % 4.20 % 4.19 % Taxable investment securities and other 2.17 % 2.09 % 2.11 % 2.13 % 2.00 % Tax-exempt securities 3.21 % 2.98 % 2.86 % 2.78 % 2.75 % Federal funds sold and interest-bearing cash accounts 1.06 % 1.03 % 0.89 % 0.85 % 0.48 % Total interest-earning assets 3.95 % 3.93 % 3.88 % 3.78 % 3.74 % LIABILITIES Savings accounts 0.06 % 0.06 % 0.06 % 0.06 % 0.06 % Interest-bearing transaction accounts 0.51 % 0.49 % 0.44 % 0.38 % 0.35 % Time deposits 1.17 % 1.03 % 0.86 % 0.83 % 0.84 % Borrowings 2.36 % 2.20 % 2.30 % 2.37 % 2.37 % Total interest-bearing liabilities 0.75 % 0.71 % 0.63 % 0.60 % 0.62 % Net interest spread (taxable equivalent basis) 3.20 % 3.22 % 3.25 % 3.18 % 3.12 % Annualized net interest margin (taxable equivalent basis) 3.37 % 3.39 % 3.41 % 3.33 % 3.27 % Annualized cost of deposits 0.45 % 0.41 % 0.35 % 0.32 % 0.30 % ASSET QUALITY DATA ALLOWANCE FOR LOAN AND LEASE LOSSES Balance at beginning of period $ 33,925 $ 32,823 $ 31,590 $ 31,245 $ 31,369 Provision for loan and lease losses 1,218 1,827 1,827 1,218 375 Charge-offs (347 ) (869 ) (870 ) (1,360 ) (795 ) Recoveries 659 144 276 487 296 Balance at end of period $ 35,455 $ 33,925 $ 32,823 $ 31,590 $ 31,245 NET LOAN AND LEASE CHARGE-OFFS (RECOVERIES) Commercial, real estate $ 132 $ 285 $ (67 ) $ 595 $ (87 ) Commercial, industrial and other 25 168 44 68 (96 ) Leases 34 80 92 39 42 Residential mortgages 31 95 169 141 231 Consumer and home equity (534 ) 97 356 30 409 Net charge-offs (recoveries) $ (312 ) $ 725 $ 594 $ 873 $ 499 NON-PERFORMING ASSETS Commercial, real estate $ 7,362 $ 6,820 $ 10,240 $ 10,443 $ 11,885 Commercial, industrial and other 184 172 378 136 167 Leases 144 110 81 179 153 Residential mortgages 3,860 4,410 3,857 4,715 6,048 Consumer and home equity 2,105 2,033 1,689 2,270 2,151 Total non-accrual loans and leases 13,655 13,545 16,245 17,743 20,404 Property acquired through foreclosure or repossession 843 1,168 1,415 710 1,072 Total non-performing assets $ 14,498 $ 14,713 $ 17,660 $ 18,453 $ 21,476 Loans past due 90 days or more and still accruing $ 200 $ 9 $ 20 $ - $ 10 Loans restructured and still accruing $ 11,462 $ 11,279 $ 11,697 $ 11,553 $ 8,802 Ratio of allowance for loan and lease losses to total loans and leases 0.85 % 0.83 % 0.81 % 0.79 % 0.81 % Total non-accrual loans and leases to total loans and leases 0.33 % 0.33 % 0.40 % 0.45 % 0.53 % Total non-performing assets to total assets 0.27 % 0.27 % 0.33 % 0.35 % 0.42 % Annualized net charge-offs (recoveries) to average loans and leases -0.03 % 0.07 % 0.06 % 0.09 % 0.05 %\nLakeland Bancorp, Inc. Supplemental Information - Non-GAAP Financial Measures (Unaudited) At or for the Quarter Ended Dec 31, Sept 30, June 30, Mar 31, Dec 31, (Dollars in thousands, except per share amounts) 2017 2017 2017 2017 2016 CALCULATION OF TANGIBLE BOOK VALUE PER COMMON SHARE Total common stockholders' equity at end of period - GAAP $ 583,122 $ 577,081 $ 567,545 $ 557,642 $ 550,044 Less: Goodwill 136,433 136,433 136,433 135,747 135,747 Less: Other identifiable intangible assets 2,362 2,526 2,631 3,149 3,344 Total tangible common stockholders' equity at end of period - Non-GAAP $ 444,327 $ 438,122 $ 428,481 $ 418,746 $ 410,953 Shares outstanding at end of period 47,354 47,353 47,353 47,350 47,223 Book value per share - GAAP $ 12.31 $ 12.19 $ 11.99 $ 11.78 $ 11.65 Tangible book value per share - Non-GAAP $ 9.38 $ 9.25 $ 9.05 $ 8.84 $ 8.70 CALCULATION OF TANGIBLE COMMON EQUITY TO TANGIBLE ASSETS Total tangible common stockholders' equity at end of period - Non-GAAP $ 444,327 $ 438,122 $ 428,481 $ 418,746 $ 410,953 Total assets at end of period - GAAP $ 5,405,639 $ 5,399,481 $ 5,362,187 $ 5,247,815 $ 5,093,131 Less: Goodwill 136,433 136,433 136,433 135,747 135,747 Less: Other identifiable intangible assets 2,362 2,526 2,631 3,149 3,344 Total tangible assets at end of period - Non-GAAP $ 5,266,844 $ 5,260,522 $ 5,223,123 $ 5,108,919 $ 4,954,040 Common equity to assets - GAAP 10.79 % 10.69 % 10.58 % 10.63 % 10.80 % Tangible common equity to tangible assets - Non-GAAP 8.44 % 8.33 % 8.20 % 8.20 % 8.30 % CALCULATION OF RETURN ON AVERAGE TANGIBLE COMMON EQUITY Net income - GAAP $ 13,175 $ 13,723 $ 13,370 $ 12,312 $ 11,953 Total average common stockholders' equity - GAAP $ 581,254 $ 574,113 $ 565,211 $ 553,782 $ 510,562 Less: Average goodwill 136,433 136,433 135,755 135,747 136,385 Less: Average other identifiable intangible assets 2,450 2,606 3,069 3,276 3,459 Total average tangible common stockholders' equity - Non-GAAP $ 442,371 $ 435,074 $ 426,387 $ 414,759 $ 370,718 Return on average common stockholders' equity - GAAP 8.99 % 9.48 % 9.49 % 9.02 % 9.31 % Return on average tangible common stockholders' equity - Non-GAAP 11.82 % 12.51 % 12.58 % 12.04 % 12.83 % CALCULATION OF EFFICIENCY RATIO Total noninterest expense $ 25,849 $ 24,849 $ 25,366 $ 28,470 $ 24,772 Amortization of core deposit intangibles (165 ) (104 ) (190 ) (195 ) (202 ) Long-term debt prepayment fee - - - (2,828 ) - Merger related expenses - - - - - Noninterest expense, as adjusted $ 25,684 $ 24,745 $ 25,176 $ 25,447 $ 24,570 Net interest income $ 42,379 $ 42,115 $ 41,421 $ 39,323 $ 38,179 Total noninterest income 5,776 5,454 6,111 8,094 5,161 Total revenue 48,155 47,569 47,532 47,417 43,340 Tax-equivalent adjustment on municipal securities 247 271 281 275 262 (Gains) losses on sales of investment securities - - 15 (2,539 ) - Total revenue, as adjusted $ 48,402 $ 47,840 $ 47,828 $ 45,153 $ 43,602 Efficiency ratio - Non-GAAP 53.06 % 51.72 % 52.64 % 56.36 % 56.35 % For the Quarter Ended For the Twelve Months Ended Dec 31, Dec 31, Dec 31, Dec 31, (Dollars in thousands, except per share amounts) 2017 2016 2017 2016 RECONCILIATION OF EARNINGS PER SHARE Net income - GAAP $ 13,175 $ 11,953 $ 52,580 $ 41,518 NON-ROUTINE TRANSACTIONS, NET OF TAX One-time impact of Tax Cuts and Jobs Act of 2017 602 - 602 - Tax deductible merger related expenses - - - 1,915 Non-tax deductible merger related expenses - - - 866 Net effect of non-routine transactions 602 - 602 2,781 Net income available to common shareholders excluding non-routine transactions 13,777 11,953 53,182 44,299 Less: Earnings allocated to participating securities (118 ) (122 ) (480 ) (396 ) $ 13,659 $ 11,831 $ 52,702 $ 43,903 Weighted average shares - Basic 47,466 45,002 47,438 42,912 Weighted average shares - Diluted 47,719 45,257 47,674 43,114 Basic earnings per share - GAAP $ 0.28 $ 0.26 $ 1.10 $ 0.96 Diluted earnings per share - GAAP $ 0.27 $ 0.26 $ 1.09 $ 0.95 Basic earnings per share, adjusted for non-routine transactions $ 0.29 $ 0.26 $ 1.11 $ 1.02 Diluted earnings per share, adjusted for non-routine transactions (Core EPS)\n$ 0.29 $ 0.26 $ 1.11 $ 1.02\nLakeland Bancorp, Inc. Supplemental Information - Non-GAAP Financial Measures (Unaudited) For the Twelve Months Ended, Dec 31, Dec 31, (Dollars in thousands) 2017 2016 CALCULATION OF RETURN ON AVERAGE TANGIBLE COMMON EQUITY Net income - GAAP $ 52,580 $ 41,518 Total average common stockholders' equity - GAAP $ 568,680 $ 474,540 Less: Average goodwill 136,095 130,689 Less: Average other identifiable intangible assets 2,847 3,225 Total average tangible common stockholders' equity - Non-GAAP $ 429,738 $ 340,626 Return on average common stockholders' equity - GAAP 9.25 % 8.75 % Return on average tangible common stockholders' equity - Non-GAAP 12.24 % 12.19 % CALCULATION OF EFFICIENCY RATIO Total noninterest expense $ 104,534 $ 99,917 Amortization of core deposit intangibles (654 ) (734 ) Long-term debt prepayment fee (2,828 ) - Merger related expenses - (4,103 ) Provision for unfunded lending commitments - (438 ) Noninterest expense, as adjusted $ 101,052 $ 94,642 Net interest income $ 165,238 $ 145,649 Noninterest income 25,435 21,330 Total revenue 190,673 166,979 Tax-equivalent adjustment on municipal securities 1,074 962 Gains on sales of investment securities (2,524 ) (370 ) Total revenue, as adjusted $ 189,223 $ 167,571 Efficiency ratio - Non-GAAP 53.40 % 56.48 %\nSource:Lakeland Bancorp, Inc.", "external_links": [], "published": "2018-01-26T16:00:00.000+02:00", "crawled": "2018-01-26T18:12:45.007+02:00", "highlightTitle": ""}