{"organizations": [], "uuid": "a39339d2ca6d6a8cd3e00786dd33ab12dd946f50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222668002&w=1200&r=LYNXMPEE0G0FR", "site_section": "http://feeds.reuters.com/reuters/UKStocksAndSharesNews/", "section_title": "Reuters: Stocks & Shares News", "url": "https://uk.reuters.com/article/uk-europe-view-wednesday/daily-briefing-brexit-bill-set-for-lords-new-start-in-catalonia-idUKKBN1F60UB", "country": "US", "domain_rank": 408, "title": "Daily Briefing: Brexit bill set for Lords; new start in Catalonia", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T10:30:00.000+02:00", "replies_count": 0, "uuid": "a39339d2ca6d6a8cd3e00786dd33ab12dd946f50"}, "author": "", "url": "https://uk.reuters.com/article/uk-europe-view-wednesday/daily-briefing-brexit-bill-set-for-lords-new-start-in-catalonia-idUKKBN1F60UB", "ord_in_thread": 0, "title": "Daily Briefing: Brexit bill set for Lords; new start in Catalonia", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "carles puigdemont", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "catalonia", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "eu withdrawal bill", "sentiment": "none"}, {"name": "catalonia reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 8:32 AM / Updated 25 minutes ago Daily Briefing: Brexit bill set for Lords; new start in Catalonia Reuters Staff 7 Min Read \nLONDON (Reuters) - Britain's controversial EU Withdrawal Bill is set to complete its first journey through parliament's lower house with a vote some time after 1900 GMT today , marking a major legal step on the way to Brexit. \nDespite its wafer-thin majority, the government is likely to be able to get the bill through, meaning it then passes to the largely pro-EU upper chamber House of Lords for more scrutiny. Calls for a second referendum on Brexit have grown this month, and EU leaders insist Britain is welcome to stay in the EU if it changes its mind ; but Theresa May's government reaffirmed on Monday it is determined to see Brexit through. \nThe new Catalan parliament meets for the first time today with the task of electing its governing body and its speaker. It also triggers a 10-day deadline for Catalan leader-in-exile Carles Puigdemont to say whether he plans to come back to the region and face arrest for sedition and rebellion. Some of his backers have suggested he could try and rule Catalonia by Skype - an unprecedented arrangement which the Spanish government in Madrid has said it would contest in the courts. \nFurther east, two sagas of politics and graft are reaching a head. Czech Prime Minister Andrej Babis, who is battling allegations of EU subsidy fraud, saw his minority government lose a confidence vote on Tuesday , which means he must now try to cut a deal with opposition parties to stay in office. \nIn Romania, the ruling Social Democrat Party (PSD) has put forward as prime minister a close ally of the powerful party leader Liviu Dragnea . Dragnea himself is barred from government due to a vote-rigging conviction: assuming nominee Viorica Dancila is appointed, the question is whether she will help Dragnea sidestep that ban. \nMARKETS Former Catalan leader Carles Puigdemont attends a meeting with his party 'Junts per Catalunya' parliament group in Brussels, Belgium January 12, 2018. REUTERS/Francois Lenoir \nGlobal markets had another hiccup overnight as investors kick the tyres of the new year rally. After the Dow Jones topped 26,000 for the time – a doubling in just over five years – Wall St stocks turned tail to end in the red . GE’s drop of almost 3 percent stole the show after it announced plans for a further breakup of the sprawling conglomerate alongside a huge $11 billion charge on its insurance business and due to tax changes. As eye-catching was the jump in the ViX volatility gauge to its highest close since Dec. 4 of 11.66 percent. \nThe speed bump in 2018’s equity surge – which has already propelled MSCI’s all-country world index up more than 4 percent in the year-to-date – rippled through Asia bourses overnight, though without any obvious new triggers beyond some profit-taking and recalibration of the speed January’s surge while Q4 earnings stream in. Shanghai, HK, Tokyo and Seoul all ended in the red and European stocks are marked down about 0.2 percent. \nIn Europe, the earnings focus was on ASML after the chip tool maker reported a better-than-expected net profit for the fourth quarter, claiming several customers asked for early delivery of products amid a booming semiconductor industry. That will ease some recent concerns about a topping out in that industry in Q3 last year. In the UK, Interserve fell more than 10 percent at the open, hit by an FT report that the construction service provider was being monitored by the UK government over its financial health and in the light of Carillion's collapse this week . \nBond markets too remain on the backfoot, with two-year Treasury yields hitting 2.035 percent - their highest since 2008 – early on Wednesday. Germany’s two-year government bond yield rose to its highest in more than six months, meantime, amid ongoing angst about a possible change in the European Central Bank’s policy guidance at its first meeting of the year next week. \nReuters ECB sources reckon no new change in its massive bond-buying plan is imminent and Bundesbank President Jens Weidmann said late Tuesday that analyst expectations for an ECB interest-rate hike in the middle of next year are roughly in line with the ECB's own guidance . ECB Vice President Constancio told Wednesday’s La Repubblica newspaper monetary policy would remain accommodative for a very long time and the central bank saw no sign of emerging inflation. \nAfter hitting a new three-year high of $1.2322 overnight, the euro has recoiled to as low as $1.22. The dollar was firmer across the board, with a close eye on the Canada’s dollar ahead a possible interest rate rise from the Bank of Canada later in the day. Bitcoin and other cryptocurrencies continued to come under pressure after heavy losses of up to 20 percent on Tuesday amid fears of an intensifying regulatory crackdown in China and South Korea. Bitcoin fell to within a whisker of $10,000 at one stage before steadying and was last about $11,200. Editing by Hugh Lawson", "external_links": [], "published": "2018-01-17T10:30:00.000+02:00", "crawled": "2018-01-17T11:08:15.064+02:00", "highlightTitle": ""}