{"organizations": [], "uuid": "766ddde8a990010d1a236677fe39fb7d4334dba3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/usa-ma-congress/update-1-businesses-warn-of-risks-of-tighter-rules-on-u-s-foreign-investment-idUSL1N1PD25I", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Businesses warn of risks of tighter rules on U.S. foreign investment", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T23:42:00.000+02:00", "replies_count": 0, "uuid": "766ddde8a990010d1a236677fe39fb7d4334dba3"}, "author": "", "url": "https://www.reuters.com/article/usa-ma-congress/update-1-businesses-warn-of-risks-of-tighter-rules-on-u-s-foreign-investment-idUSL1N1PD25I", "ord_in_thread": 0, "title": "UPDATE 1-Businesses warn of risks of tighter rules on U.S. foreign investment", "locations": [], "entities": {"persons": [{"name": "diane bartz", "sentiment": "none"}, {"name": "christopher padilla", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "cfius", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "senate committee on banking, housing and urban affairs", "sentiment": "none"}, {"name": "committee on foreign investment", "sentiment": "none"}, {"name": "international business machines corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 9:43 PM / in 12 minutes UPDATE 1-Businesses warn of risks of tighter rules on U.S. foreign investment Reuters Staff \n(Adds CFIUS focus on high-tech deals and mergers involving data on Americans) \nBy Diane Bartz \nWASHINGTON, Jan 18 (Reuters) - Proposals before the U.S. Senate and House to tighten rules on foreign investment into critical technologies could cause companies to take their research and development overseas to avoid scrutiny, critics said on Thursday. \nBusinesses that see risks from the bills testified at a hearing by the Senate Committee on Banking, Housing and Urban Affairs. The bills before the House of Representatives and the Senate would allow the inter-agency Committee on Foreign Investment in the United States, known as CFIUS, to review minority investments and some intellectual property arrangements. \nInternational Business Machines Corp is worried that it would be forced to ask permission to sell computers or license software overseas, company Vice President Christopher Padilla said. \n“This bill would impose a very onerous - and entirely unilateral - set of restrictions on outbound transactions of U.S. companies,” Padilla said in written testimony. \nScott Kupor, chair of the National Venture Capital Association, said Chinese investments in U.S. funds could make those funds vulnerable to CFIUS reviews if they tried to invest in high-tech companies, even though those investors were given no sensitive information beyond valuation and accounting data. \nRepublican Senator John Cornyn, the driving force behind the bill, told the committee that he was an ardent supporter of foreign investment but that investment from China needed new, tougher scrutiny because of the threat it poses. \n“China uses both legal and illegal means to turn our own technology and know-how against us and erase our national security advantage. One of these tools is investment,” Cornyn told the committee. \nFormer Democratic President Barack Obama had increased scrutiny of Chinese investment, but Republican President Donald Trump’s administration has taken a harder line on issues ranging from Beijing’s role in restraining North Korea to Chinese efforts to acquire U.S. strategic industries. \nThe hearing came a day after CFIUS approved a $15 million deal for Beijing-based Naura Microelectronics Equipment Co Ltd to buy Akrion System LLC, a U.S. semiconductor manufacturing equipment company. \nThe approval is one of only a handful granted to Chinese transactions by CFIUS under the Trump administration. The agency has killed a series of high-profile deals since Trump took office. \nCFIUS has been particularly tough on deals that involve high tech, such as the top end chip business, or deals that involve sensitive information about Americans. CFIUS recently scuttled Chinese takeovers of the money transfer company MoneyGram and Lattice Semiconductor Corp. \nThe Senate version of the CFIUS bill has 10 co-sponsors. The House version, which recently picked up Representatives Pete Sessions as a co-sponsor, has 23, according to a congressional aide who spoke privately. (Reporting by Diane Bartz; Editing by Leslie Adler and Susan Thomas)", "external_links": [], "published": "2018-01-18T23:42:00.000+02:00", "crawled": "2018-01-19T00:02:58.011+02:00", "highlightTitle": ""}