{"organizations": [], "uuid": "2761c285c6ff1a000b0a7c497d0efd1357e77018", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223281239&w=1200&r=LYNXMPEE0I0ES", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-myanmar-rohingya-petition-exclusive/exclusive-rohingya-refugee-leaders-draw-up-demands-ahead-of-repatriation-idUSKBN1F80SE", "country": "US", "domain_rank": 408, "title": "Exclusive: Rohingya refugee leaders draw up demands ahead of repatriation", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T11:22:00.000+02:00", "replies_count": 0, "uuid": "2761c285c6ff1a000b0a7c497d0efd1357e77018"}, "author": "", "url": "https://www.reuters.com/article/us-myanmar-rohingya-petition-exclusive/exclusive-rohingya-refugee-leaders-draw-up-demands-ahead-of-repatriation-idUSKBN1F80SE", "ord_in_thread": 0, "title": "Exclusive: Rohingya refugee leaders draw up demands ahead of repatriation", "locations": [], "entities": {"persons": [{"name": "bangldesh", "sentiment": "none"}, {"name": "zeba siddiqui", "sentiment": "none"}], "locations": [{"name": "kutupalong refugee camp", "sentiment": "none"}, {"name": "myanmar", "sentiment": "none"}, {"name": "bangladesh", "sentiment": "none"}, {"name": "kutupalong", "sentiment": "none"}, {"name": "rakhine state", "sentiment": "none"}, {"name": "rakhine", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "muslim rohingya", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 8:35 AM / Updated 7 hours ago Exclusive: Rohingya refugee leaders draw up demands ahead of repatriation Zeba Siddiqui 5 Min Read \nKUTUPALONG, Bangladesh (Reuters) - Rohingya leaders in a Bangladesh refugee camp have drawn up a list of demands they want Myanmar to meet before authorities begin sending back hundreds of thousands in a repatriation process expected to begin next week and last for two years. \nThe petition is the latest indication of the challenges ahead for Bangladesh and Myanmar as they try to engineer the return of refugees who fear continued military operations in Rakhine State and are dismayed about the prospect of a prolonged stay in “temporary camps” in Myanmar when they go back. \nA half-dozen Rohingya elders, saying they represented 40 villages from Rakhine, showed the list of demands to a Reuters reporter at the Kutupalong refugee camp, where most of the 655,500 Rohingya refugees are staying. \nThe petition, handwritten in Burmese, said none of the Muslim Rohingya would return to mainly Buddhist Myanmar unless the demands were met. \nThe petition, which has still to be finalised, demanded the Myanmar government publicly announce it is giving Rohingya long-denied citizenship and inclusion on a list of the country’s recognized ethnic groups. It asks that land once occupied by the refugees be returned to them and their homes, mosques and schools rebuilt. \nIt wants the military held accountable for alleged killings, looting and rape, and the release from jails of “innocent Rohingya” picked up in counter-insurgency operations. \nIt also wants Myanmar to stop listing people with their photographs as “terrorists” in state media and on government Facebook pages. \nMyanmar state newspapers this week issued a supplement listing the names and photos of alleged members of the Arakan Rohingya Salvation Army (ARSA), whose attacks on security posts on Aug. 25 triggered a sweeping counter-insurgency operation. \nThe United Nations has described the Myanmar military operations in the northern part of Rakhine as a classic case of ethnic cleansing. \nThe military says it has only conducted legitimate operations and denies there have been cases of sexual assault. \nBut the military said last week soldiers had killed 10 captured Muslim “terrorists” during insurgent attacks at the beginning of September, after Buddhist villagers had forced the captured men into a grave the villagers had dug. \nIt was a rare acknowledgment of wrongdoing by the Myanmar military during its operations in the western state of Rakhine. \nARSA said in a statement last week the 10 Rohingya in the mass grave were “innocent civilians” and not members of their group. Rohingya refugees make their way at the Kutupalong refugee camp near Cox's Bazar, Bangladesh December 19, 2017. REUTERS/Alkis Konstantinidis CHALLENGES AHEAD \nThe Rohingya elders Reuters spoke to said they were still finalising their list of demands before showing it to Bangladesh authorities and to aid agencies administering the camps. \nThey said the 40 village leaders they discussed the petition with represent the interests of all Rohingya at the camp, but that could not be independently verified and aid agencies were unable to comment pending formal issuance of the petition. \nBangladesh and Myanmar this week agreed to complete the return of the refugees over the next two years, with the process due to begin on Tuesday. \nBut even as preparations get underway for the repatriation, Rohingya Muslims continue to pour into Bangladesh. Slideshow (2 Images) \nMore than 100 Rohingya have crossed into Bangladesh from Myanmar since Wednesday and scores more were waiting to cross the Naf river that forms the border, newly arrived refugees in Bangladesh told Reuters. \nThe new arrivals said they fled Myanmar because of military operations in their village of Sein Yin Pyin, and gave accounts of young men being rounded up and of discovering dead bodies in a pond and a forest. \nThey said they fled out of hunger, after hiding in their homes for days, unable to go to work in the fields and forests that provided their livelihood. \nMyanmar Police Colonel Myo Thu Soe, spokesman for the military-controlled Home Affairs Ministry, told Reuters on Thursday “there’s no clearance operation going on in the villages”. \nBut, he added, “security forces are still trying to take control of the area” in northern Rakhine. He declined to elaborate. \nRights groups and the UN say any repatriations must be voluntary. \nPhil Robertson, deputy Asia director at Human RightsWatch, told Reuters in an email authorities cannot deal with the Rohingya refugees “as if they are an inert mass of people who will go where and when they are told”. \nThe repatriation deal does not cover over 200,000 other Rohingya refugees living in Bangladesh prior to October 2016, who had been driven out of Myanmar during previous episodes of ethnic violence and military operations. \n(Fixes spelling of Bangladesh in dateline.) Writing by Bill Tarrant: Editing by Simon Cameron-Moore", "external_links": [], "published": "2018-01-19T11:22:00.000+02:00", "crawled": "2018-01-19T11:37:37.003+02:00", "highlightTitle": ""}