{"organizations": [], "uuid": "6a77a8149e0920448c6388e379f80ad0fb1272bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224444302&w=1200&r=LYNXMPEE0M0Q6", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-netflix-results-research/netflix-shares-hit-record-high-after-blockbuster-results-idUKKBN1FC1BV", "country": "US", "domain_rank": 408, "title": "Netflix shares hit record high after blockbuster results", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T13:24:00.000+02:00", "replies_count": 0, "uuid": "6a77a8149e0920448c6388e379f80ad0fb1272bc"}, "author": "", "url": "https://uk.reuters.com/article/us-netflix-results-research/netflix-shares-hit-record-high-after-blockbuster-results-idUKKBN1FC1BV", "ord_in_thread": 0, "title": "Netflix shares hit record high after blockbuster results", "locations": [], "entities": {"persons": [{"name": "daniel ives", "sentiment": "none"}], "locations": [], "organizations": [{"name": "netflix", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "factset", "sentiment": "none"}, {"name": "keybanc", "sentiment": "none"}, {"name": "netflix inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "rbc capital markets", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 11:24 AM / Updated 20 minutes ago Netflix shares hit record high after blockbuster results Reuters Staff 3 Min Read \n(Reuters) - Shares in Netflix Inc ( NFLX.O ) rose 9 percent to a record high in premarket trading on Tuesday after the video streaming service trounced Wall Street targets for new subscribers in the fourth quarter. \nAt least eight brokerages raised their price targets for the company’s shares by as much as $50. Analysts at RBC Capital Markets and KeyBanc were most bullish, setting targets of $300 compared to the $248 it traded at on Tuesday. \nIn a statement after markets closed on Monday, Netflix said it added 6.36 million subscribers in international markets in the fourth quarter, beating analysts’ expectations of 5.1 million, according to FactSet. \nIt now has 117.58 million streaming subscribers globally. \n“Overall, this was a ‘home run quarter’ for Netflix and should put any lingering worries to rest around sub(scriber) growth, international ramp, and the ‘negative’ possible effects from the (subscription) price increase,” GBH Insights analyst Daniel Ives said. \nThe company, which showcased popular returning series “Stranger Things”, “The Crown” and “Black Mirror” in the quarter, in October hiked its monthly fees for U.S. customers for the first time in two years. \n“The subscriber growth validates management’s ongoing content investment, and should contribute to comfort with 2018’s increased $7.5-8.0B content spend and associated marketing to support the content slate and ever-growing library,” Canaccord Genuity analyst Michael Graham said. \nNetflix and its peers Hulu and Amazon.com Inc’s ( AMZN.O ) Prime Video are steadily increasing budgets for producing original shows as they gain market share from traditional cable TV providers. \nNetflix spent $90 million on Will Smith action movie “Bright” last year, its largest investment in an original film to date, and is already planning a sequel and additional investment in original films. \n“Netflix continues to prove out the thesis that Internet TV is replacing linear TV on a global basis,” Evercore ISI analyst Vijay Jayant said. \nOut of the 44 analysts that cover Netflix’s stock, 28 now rate it at “buy” or higher, 14 at “hold” and two at “sell” or lower. The median price target for the stock was $250, only marginally above its trading price after Tuesday’s gains. \nHulu ended 2017 with 17 million subscribers while analysts estimate Amazon’s Prime service, which includes a free video subscription, has around 90 million customers. Reporting by Supantha Mukherjee and Muvija M in Bengaluru; editing by Patrick Graham", "external_links": [], "published": "2018-01-23T13:24:00.000+02:00", "crawled": "2018-01-23T13:43:07.014+02:00", "highlightTitle": ""}