{"organizations": [], "uuid": "7c0644e60b0128ca5fd08adb052842e0b863f0a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/trump-davos.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/26/donald-trump-davos-america-first-globalism/", "country": "US", "domain_rank": 1196, "title": "Donald Trump at Davos Says America First Is Good for the World | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.735, "site_type": "news", "published": "2018-01-26T10:47:00.000+02:00", "replies_count": 0, "uuid": "7c0644e60b0128ca5fd08adb052842e0b863f0a3"}, "author": "Michael Zennie", "url": "http://fortune.com/2018/01/26/donald-trump-davos-america-first-globalism/", "ord_in_thread": 0, "title": "Donald Trump at Davos Says America First Is Good for the World | Fortune", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "michael zennie", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "davos says america first is good for the world | fortune davos", "sentiment": "negative"}, {"name": "davos says 'america first", "sentiment": "neutral"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Davos President Trump at Davos Says 'America First' Is Good for the World US President Donald Trump delivers a speech during the World Economic Forum (WEF) annual meeting in Davos, eastern Switzerland NICHOLAS KAMM AFP/Getty Images By Michael Zennie 8:47 AM EST \nPresident Donald Trump said Friday that U.S. economic growth promoted by his policies would help the world, seeking to square his “America First” agenda with globalism. \n“When the United States grows, so does the world,” Trump said in a speech to the World Economic Forum in Davos, Switzerland. “American prosperity has created countless jobs around the globe and the drive for excellence, creativity and innovation in the United States has led to important discoveries that help people everywhere live more prosperous and healthier lives.” \nTrump is the first U.S. president to visit the conference in 18 years, and he made his government’s presence felt with a large delegation of Cabinet secretaries and top White House aides. His plenary address, though, was largely boilerplate. Trump boasted of U.S. economic performance under his leadership and urged cooperation with the American effort to curb North Korea’s nuclear and missile weapons programs and combat terrorism — routine themes of his speeches, especially to international audiences. \nHe told the audience that the U.S. still supports free trade as long as it is “fair and reciprocal.” \n“The United States is prepared to negotiate mutually beneficial, bilateral trade agreements with all countries,” he said. But he then suggested an exception for Pacific Rim countries that were part of the Trans-Pacific Partnership he abandoned last year. \nThe U.S. already has trade agreements with some of those 11 countries, he said, and “we would consider negotiating with the rest, either individually or perhaps as a group if it is in the interests of all.” Claiming Credit \nAfter taking questions from WEF Chairman Klaus Schwab, Trump plans to return home, where he faces a number of domestic challenges — difficult negotiations with Congress on an immigration overhaul and damaging new reports that he sought last year to fire the special counsel investigating his presidential campaign’s ties to the Russian government. \nTrump was booed by some of the Davos audience after complaining about “vicious” and “fake” news organizations in response to a question from Schwab. \nAs he does regularly, Trump claimed credit for the run-up in stocks and economic growth that has occurred in his first year in office. In the last year, the Standard & Poor’s 500 Index has surged about 25 percent and data scheduled for release on Friday is set to show the economy probably ended last year with the longest stretch of 3 percent-or-better growth since 2005. \n“After years of stagnation the United States is once again experiencing strong economic growth,” Trump said. “Consumer confidence, business confidence and manufacturing confidence are the highest they have ever been in many decades.” \nThe International Monetary Fund this week acknowledged Trump’s recent tax cuts were a reason it had lifted its forecast for U.S. economic growth this year to 2.7 percent. Still, it warned the short-term effect would wear off by 2022 as budget deficits materialized and individual tax cuts expired. Davos Whirlwind \nThe president will be in Davos for less than 36 hours. He met with the leaders of the U.K., Israel, Rwanda and Switzerland. He delivered a short speech at a private reception that some people in attendance described as awkward. He hosted a dinner for European corporate executives, which the White House allowed reporters to observe for about 20 minutes as Trump encouraged the business leaders to describe their U.S. investment plans. \n“Like all nations represented at this forum, America hopes for a future in which everyone can prosper, and every child can grow up free from violence, poverty, and fear,” Trump said. “The world is witnessing the resurgence of a strong and prosperous America.” \nThe presence of the nationalist American leader divided participants at Davos, which is in part a celebration of globalism by the world’s financial and government elite. \nWall Street figures and business executives embraced Trump, who late last year signed into law a drastic reduction of the U.S. corporate income tax rate. He has also embarked on an effort to reduce regulations that he considers burdensome to companies. \n“What I’m bulled up about is that policy makers are making good policy decisions in the U.S.,” JPMorgan Chase & Co. Chief Executive Officer Jamie Dimon told Bloomberg. Protectionist Concerns \nTrump invited business leaders in the audience to invest in the U.S. \n“There has never been a better time to hire, to build, to invest and to grow in the United States,” he said. “America is open for business and we are competitive once again.” \nOthers signaled concern with Trump’s protectionist instincts, which were underscored at the start of the week when his government slapped tariffs on imported solar panels and washing machines. European leaders including French President Emmanuel Macron and German Chancellor Angela Merkel promoted multilateralism from the Davos stage; neither of them intersected with Trump at the conference. \nSeveral Davos attendees expressed unease with Trump’s foreign policy and his crackdown on undocumented immigrants. Microsoft Corp. co-founder Bill Gates told Bloomberg that in “the balance of hard power versus soft power, the U.S. uniquely has a ratio emphasizing hard power and I’d hate to see it go even further.” \nBillionaire investor George Soros was more explicit, saying Trump is risking a nuclear war with North Korea and that he poses a “danger to the world.” \n“Part of that is I think the sense that the U.S. is less welcoming today,” Marriott International Inc. President and CEO Arne Sorenson said. “Words around immigration, or words around some of these other issues, can be interpreted in the rest of the world as words of welcome or relatively less welcome.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-26T10:47:00.000+02:00", "crawled": "2018-01-26T16:24:05.007+02:00", "highlightTitle": ""}