{"organizations": [], "uuid": "c6bcd51465601b9330fd938ceb557cd56a9c6595", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222638279&w=1200&r=LYNXMPEE0G0A3", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-china-luxury/china-luxury-sales-rebound-as-millennials-snap-up-cosmetics-handbags-report-idUSKBN1F60IP", "country": "US", "domain_rank": 408, "title": "China luxury sales rebound as millennials snap up cosmetics, handbags: report", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T08:02:00.000+02:00", "replies_count": 0, "uuid": "c6bcd51465601b9330fd938ceb557cd56a9c6595"}, "author": "", "url": "https://www.reuters.com/article/us-china-luxury/china-luxury-sales-rebound-as-millennials-snap-up-cosmetics-handbags-report-idUSKBN1F60IP", "ord_in_thread": 0, "title": "China luxury sales rebound as millennials snap up cosmetics, handbags: report", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}], "organizations": [{"name": "min read  shanghai", "sentiment": "none"}, {"name": "chanel", "sentiment": "none"}, {"name": "gucci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bain & co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 6:02 AM / Updated 6 hours ago China luxury sales rebound as millennials snap up cosmetics, handbags: report 4 Min Read \nSHANGHAI (Reuters) - China’s luxury goods market is back in fashion. \nDomestic sales of Gucci handbags to Chanel cosmetics, sluggish in China for years, rose at the fastest pace in over half a decade last year and are poised to consolidate the gains in 2018, according to consultancy Bain & Co. \nThat could provide a major fillip for brands targeting the world’s top luxury spenders, though who benefits most will depend on which brands are able to lure in China’s big-spending youth - now the driving force in the market. \nSales of luxury goods in China hit 142 billion yuan ($22.07 billion) last year, up around 20 percent from the year before, Bain & Co said in a report on Wednesday. That’s the sharpest growth since 2011, when luxury sales started to be hit by slower economic growth and a fierce crackdown on corruption. \nChina’s shoppers are the biggest spenders worldwide on luxury products, making up 32 percent of the 262 billion euros ($308 bln) global market last year and propelling France’s LVMH ( LVMH.PA ), Burberry ( BRBY.L ) and Gucci owner Kering ( PRTP.PA ). \n“It’s essentially been a flattish market for the last five years; now 2017 is plus 20 percent, that’s an amazing rebound,” said Bruno Lannes, Shanghai-based partner at Bain, adding lower pricing and government support were key drivers. \nThe sharp rise - which saw particularly strong growth for women’s clothing, jewelry, cosmetics, shoes and handbags - follows tepid growth in 2016 and dips in both 2015 and 2014. \nBeijing has been pushing for greater domestic spending, cracking down on shopping agents known as “daigou” bringing products into China from overseas, and cutting high tax rates on imported luxury goods sold in the country. \nChina’s domestic market makes up 8 percent of global luxury sales, according to Bain, and despite fast growth at home Chinese shoppers still make three-quarters of their luxury purchases overseas. MILLENNIAL DRIVERS \nBain said China’s luxury market should also see robust growth this year “fueled by millennials and ready to wear” attire, though the growth rate would likely slow down to “low-mid teen” levels given the fast growth in 2017. \nThe revival is being driven by China’s tech-savvy millennial generation aged between 20 to 34, who generally prefer ready-to-wear and fast fashion over more traditional design, helping propel new areas like luxury casual wear and sports wear. \n“This is a new China coming in as opposed to the old China coming back,” said Lannes. \nThat shift creates a challenge for more traditional brands like Prada ( 1913.HK ), which is having to play catch up with newer rivals like Coach. \nOthers like Hermes ( HRMS.PA ), France’s LVMH and Kering are seeing revived appetite from China, helping boost their global sales last year. \nLuxury spirits makers, including China’s own Kweichow Moutai ( 600519.SS ) and France’s Remy Cointreau ( RCOP.PA ), saw a pick up in China sales too. \nLannes added the fast growth would see winners and losers emerge, depending on who could crack the code of China’s youth. \n“A new China is emerging with new consumers that were not there five years ago that have different profiles, different expectations and different tastes,” he said. \n($1 = 6.4348 Chinese yuan renminbi) Reporting by Adam Jourdan; Editing by Muralikumar Anantharaman", "external_links": [], "published": "2018-01-17T08:02:00.000+02:00", "crawled": "2018-01-17T08:11:43.004+02:00", "highlightTitle": ""}