{"organizations": [], "uuid": "5caea140a0113fa26030a8d07e2ace5481731d70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-georgia-power-names-2017-new-teacher-assistance-grant-recipients.html", "country": "US", "domain_rank": 767, "title": "Georgia Power names 2017 New Teacher Assistance Grant recipients", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T20:38:00.000+02:00", "replies_count": 0, "uuid": "5caea140a0113fa26030a8d07e2ace5481731d70"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-georgia-power-names-2017-new-teacher-assistance-grant-recipients.html", "ord_in_thread": 0, "title": "Georgia Power names 2017 New Teacher Assistance Grant recipients", "locations": [], "entities": {"persons": [{"name": "anne kaiser", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}], "organizations": [{"name": "georgia power", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 10, 2018 /PRNewswire/ -- Georgia Power today announced the selection of 42 new teachers from across the state to receive one of the company's annual $1,000 New Teacher Assistance Grants. Since the program's inception in 2004, the company has awarded a total of $445,000 in individual grants to more than 400 new teachers from communities across the state. The grants provide the state's newest teachers with funds to purchase classroom supplies and start their teaching careers.\n\"Georgia's students are our future workforce and are learning the skills they need to be successful every day in the classroom,\" said Anne Kaiser, vice president of community and economic development for Georgia Power. \"Supporting high quality public education starts with supporting the educators on the front lines and the grants are one way that we can show new teachers that their work is appreciated.\"\nGeorgia public colleges and universities that have schools of education submitted the final nominations. To be eligible for a grant, candidates must be in the top 25 percent of their class, be a first-year teacher employed by a public school in Georgia and demonstrate a high aptitude for teaching.\nThe recipients vary from pre-K to elementary, middle and high school teachers. Teachers are encouraged to use the funds to purchase school items such as books, educational CDs or DVDs, computers, projectors, or other supplies to enhance their classrooms and student's learning experience.\n2017 New Teacher Assistant Grant recipients include:\nCentral Georgia\nZachary Ralph Griffin, Macon (Bibb County School District) Meagan Kaylee Pittman, Perry (Houston County School District)\nCoastal Georgia\nRaven Davis, Savannah (Savannah-Chatham County Schools) Donnie Jones, Savannah (Savannah-Chatham County Schools) Nicole Williams Harris, Savannah (Savannah-Chatham County Schools) Carly Elizabeth Chevalier, Metter (Candler County School District) Sarah Herrin, Jesup (Wayne County School District) Ashley Marie Galloway, Nahunta (Brantley County School District) Kevin Judy, Swainsboro (Emanuel County Schools)\nEast Georgia\nTara Swinson, Augusta (Richmond County School District) Keenan Jackson, Thomson (McDuffie County Schools) Taylor Thompson, Evans (Columbia County School System) John Goldberg, Evans (Columbia County School System)\nMetro Atlanta\nMaria L. Soto, Suwanee (Gwinnett County Public Schools) Randal James Taylor, Suwanee (Gwinnett County Public Schools) Esmeralda Trevino, Suwanee (Gwinnett County Public Schools) Todd Schuggerow, Cumming (Forsyth County Schools) Meria Carstarphen, Atlanta (Atlanta Public Schools) Alexander Petch, Newnan (Coweta County Schools) Jasmine Hill, Atlanta (Atlanta Public Schools) Robert Brown, Jonesboro (Clayton County Public Schools) Anslee Duff, Jonesboro (Clayton County Public Schools) Michael Claudius, Jonesboro (Clayton County Public Schools) David Handley, Douglas (Coffee County Schools) Michael Benjamin, Conyers (Rockdale County Schools) Chikima Brantley, McDonough (Henry County Schools) Maci Shearouse, McDonough (Henry County Schools) Darryl Baynes, Stone Mountain (DeKalb County School District)\nNortheast Georgia\nChrishandra Coletha Perkins, Greensboro (Greene County School District) J. Seth Warner, Winder (Barrow County School District) Darby Smith Bozeman, Winder (Barrow County Schools) Chelsea Freihaut, Athens (Clarke County School District)\nNorthwest Georgia\nDaniel Merritt, Lafayette (Walker County School District) Ernestina Gonzales, Chatsworth (Murray County School District) Marla Williams, Carrollton (Carroll County)\nSouth Region\nKeidra Nicole Green, Cordele (Crisp County School District) Joseph Wiggins, Thomasville (Thomas County School District) Raylee Clack Etheridge, Leesburg (Lee County School District) Chatabious Thomas, Albany (Dougherty County School District) Kelly Gordon, Valdosta (Lowndes County Schools)\nWest Georgia\nShelby Merriweather, Columbus (Muscogee County School District) Corey Reed, Barnesville (Lamar County School District)\nGeorgia Power has been a partner with the state's public education system for more than 100 years – from supporting the work of groups such as Junior Achievement, to providing new teacher assistance grants, to hosting students at the company's generation facilities, Georgia Power works to help students achieve their full potential. For more information about how the company is helping advance education and build the highly skilled workforce of tomorrow, visit www.georgiapower.com/education .\nAbout Georgia Power\nGeorgia Power is the largest electric subsidiary of Southern Company (NYSE: SO), America's premier energy company. Value, Reliability, Customer Service and Stewardship are the cornerstones of the company's promise to 2.5 million customers in all but four of Georgia's 159 counties. Committed to delivering clean, safe, reliable and affordable energy at rates below the national average, Georgia Power maintains a diverse, innovative generation mix that includes nuclear, coal and natural gas, as well as renewables such as solar, hydroelectric and wind. Georgia Power focuses on delivering world-class service to its customers every day and the company is consistently recognized by J.D. Power and Associates as an industry leader in customer satisfaction. For more information, visit www.GeorgiaPower.com and connect with the company on Facebook ( Facebook.com/GeorgiaPower ), Twitter ( Twitter.com/GeorgiaPower ) and Instagram ( Instagram.com/ga_power ).\nView original content with multimedia: http://www.prnewswire.com/news-releases/georgia-power-names-2017-new-teacher-assistance-grant-recipients-300580856.html\nSOURCE Georgia Power", "external_links": ["http://www.prnewswire.com/news-releases/georgia-power-names-2017-new-teacher-assistance-grant-recipients-300580856.html", "http://Facebook.com/GeorgiaPower", "http://Twitter.com/GeorgiaPower", "http://www.georgiapower.com/education", "http://Instagram.com/ga_power"], "published": "2018-01-10T20:38:00.000+02:00", "crawled": "2018-01-10T20:08:18.018+02:00", "highlightTitle": ""}