{"organizations": [], "uuid": "1c5d32f9775ea6294b3aa44ff0caa8b593bfa90d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-dr-seongjoon-koo-joins-j-d-power-as-chief-data-officer.html", "country": "US", "domain_rank": 767, "title": "Dr. Seongjoon Koo Joins J.D. Power as Chief Data Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:00:00.000+02:00", "replies_count": 0, "uuid": "1c5d32f9775ea6294b3aa44ff0caa8b593bfa90d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-dr-seongjoon-koo-joins-j-d-power-as-chief-data-officer.html", "ord_in_thread": 0, "title": "Dr. Seongjoon Koo Joins J.D. Power as Chief Data Officer", "locations": [], "entities": {"persons": [{"name": "seongjoon koo joins j.d. power", "sentiment": "negative"}, {"name": "seongjoon koo", "sentiment": "negative"}, {"name": "j.d. power", "sentiment": "none"}, {"name": "koo", "sentiment": "none"}, {"name": "bernardo rodriquez", "sentiment": "none"}], "locations": [{"name": "costa mesa", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "encore capital group", "sentiment": "none"}, {"name": "j.d. power", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "COSTA MESA, Calif., Jan. 24, 2018 /PRNewswire/ -- Dr. Seongjoon Koo, an accomplished technology innovator, has been named to the newly created position of Chief Data Officer at J.D. Power, the global leader in consumer data and analytics and advisory services. He will lead the creation of new capabilities in data engineering, data science, machine learning and artificial intelligence to support new as well as existing data products and services.\n\"Over the last 50 years J.D. Power has delivered value to users and clients through best-in-class market research and data analytics. As we enter a phase of expanded innovation, Dr. Koo will lead the creation of the team, infrastructure and operating model to make J.D. Power an AI-centered company,\" said Bernardo Rodriquez, Chief Digital Officer .\nDr. Koo joins J.D. Power from Encore Capital Group, one of the largest global specialty finance companies with more than $1 billion in market capitalization, where he served as Director of Data Science. At Encore Capital Group, he led the development of numerous machine learning models that support the company's investment valuation and servicing operations. He also helped develop multiple data science centers of excellence across the globe to support the company's global expansion.\n\"J.D. Power has great data assets and broad and deep industry coverage through exceptional partnerships,\" Dr. Koo said. \"I am excited to join this great company and look forward to bringing my data and analytics expertise to contribute to the transformational growth of J.D. Power.\"\nPreviously, Dr. Koo was a Principal Scientist at CoreLogic, a leading provider to businesses of consumer, financial and property data, analytics and services and which has a $4 billion market capitalization. At CoreLogic, he partnered with the largest global banking clients in the United States and United Kingdom and led the development of numerous machine learning and optimization solutions in the areas of fraud risk, credit risk and rental value estimation. Earlier, Dr. Koo led quantitative research efforts, including the development of machine learning-based trading algorithms and strategies, at a boutique hedge fund in Newport Beach, Calif.\nPrior to his financial services career, Dr. Koo made significant contributions to the medical diagnostics and pharmaceuticals industry. He worked at Hologic Inc., a $12 billion medical diagnostics company, and Ionis Pharmaceuticals, a $6 billion pharmaceutical company. He led the development of data-driven quantitative methods leveraging genomics, pre-clinical and clinical information for highly accurate cancer diagnostics and faster drug discovery and development.\nDr. Koo holds four U.S. patents and has been published in 18 academic publications on the subjects of machine learning, physics, chemistry and biomedicine. He received a Ph.D. for his research on the nonlinear dynamics of turbulent air flows from the University of California, Los Angeles. He holds B.S. and M.S. degrees from the Seoul National University in South Korea, the most prestigious university in that country.\nJ.D. Power is a global leader in consumer insights, advisory services and data and analytics. These capabilities enable J.D. Power to help its clients drive customer satisfaction, growth and profitability. Established in 1968, J.D. Power is headquartered in Costa Mesa, Calif., and has offices serving North/South America, Asia Pacific and Europe. J.D. Power is a portfolio company of XIO Group.\nXIO Group is a global alternative investments firm headquartered in London with more than $3.2 billion of committed capital and which employs an international team of more than 70 professionals. Representing more than 15 nationalities among its employees and its network of advisors, the firm has operations in the United Kingdom, Germany, Switzerland, Hong Kong and mainland China. With a seasoned international investment team that includes professionals with experience working at many of the world's leading private equity firms, XIO Group seeks to deploy its capital for global transactions. XIO Group's strategy is to identify and invest in market-leading businesses located across North America and Europe and help these companies to capitalize on untapped opportunities in fast growing markets, particularly in Asia. XIO Group is led by its four founders: Athene Li, Joseph Pacini, Murphy Qiao and Carsten Geyer. For more information, visit: www.xiogroup.com .\nMedia Relations Contacts\nGeno Effler; West Coast; 714-621-6224; media.relations@jdpa.com\nShane Smith; East Coast; 424-903-3665; ssmith@pacificcommunicationsgroup.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/dr-seongjoon-koo-joins-jd-power-as-chief-data-officer-300586972.html\nSOURCE J.D. Power", "external_links": ["http://www.xiogroup.com/", "http://www.prnewswire.com/news-releases/dr-seongjoon-koo-joins-jd-power-as-chief-data-officer-300586972.html"], "published": "2018-01-24T16:00:00.000+02:00", "crawled": "2018-01-24T17:32:02.013+02:00", "highlightTitle": ""}