{"organizations": [], "uuid": "e9c57c1291655a68dcd838612a354a8cb57a1f8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224097738&w=1200&r=LYNXMPEE0L0M8", "site_section": "http://feeds.reuters.com/reuters/UKEntertainment", "section_title": "Reuters: Entertainment News", "url": "https://uk.reuters.com/article/uk-fashion-paris-couture-fournie/craft-and-tech-mingle-at-french-couture-house-fournie-idUKKBN1FB0XH", "country": "US", "domain_rank": 408, "title": "Craft and tech mingle at French couture house Fournie", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T18:18:00.000+02:00", "replies_count": 0, "uuid": "e9c57c1291655a68dcd838612a354a8cb57a1f8a"}, "author": "", "url": "https://uk.reuters.com/article/uk-fashion-paris-couture-fournie/craft-and-tech-mingle-at-french-couture-house-fournie-idUKKBN1FB0XH", "ord_in_thread": 0, "title": "Craft and tech mingle at French couture house Fournie", "locations": [], "entities": {"persons": [{"name": "fourn", "sentiment": "negative"}, {"name": "fournie", "sentiment": "none"}, {"name": "julien fournie", "sentiment": "none"}], "locations": [{"name": "paris", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 9:07 AM / Updated an hour ago Craft and tech mingle at French couture house Fournie Reuters Staff 3 Min Read \nPARIS (Reuters) - At his Paris workshop, haute couturier Julien Fournie is surveying the final tucks and tweaks to his outfits as models try on his hand-stitched silk gowns, bringing to life creations he first sketched on a tablet. \nFournie is one of few designers trying to propel fashion into the modern age, with accessories created from 3D printers and sketches developed virtually. \nYet Fournie’s high-tech approach is barely noticeable in his latest Asian-inspired collection, on view on Tuesday during Paris’ Spring/Summer Haute Couture Week, one of fashion’s ultimate display of craftsmanship. \nVintage kimono fabrics are subtly integrated into the designs, some with intricate origami-style adornments. \n“New technology isn’t about doing dresses with blinking lights,” Fournie said in his studio after an afternoon of fittings. “We realised that in fashion, technology is only interesting when it disappears.” \nFor his couture house - a small team of seven - that means doing as much of the creative work as possible online, from conceiving looks to exchanging samples with textile suppliers virtually. \nFournie’s experiments with iPad designs earned him a visit last year from Apple CEO Tim Cook, who came to see how the tools were being used. French designer Julien Fournie (L) talks with model Diva (R) in his workshop ahead of his Spring-Summer 2018 Haute Couture fashion show presentation in Paris, France, January 15, 2018. REUTERS/Charles Platiau \nThe designer is also collaborating with French 3D engineering and software company Dassault Systemes to develop management systems and printing techniques adapted to the fashion world. \nFournie has other ventures up his sleeve with technology start-ups, and he said he had designed a soon-to-be unveiled USB stick meant to store and protect cryptocurrencies. Slideshow (9 Images) \nFournie’s clothing designs, however, remain at the heart of his business, as do the artisan skills of his team. \nThe 42-year-old, known for favouring 1950s-style silhouettes, last year became a permanent member of France’s select Haute Couture club, whose 15 houses include storied names such as Christian Dior and Chanel. \nHis clients, more than 90 percent of whom come from the Middle East, seek one-of-kind designs -- validating, in Fournie’s eyes, the role of Haute Couture in an age of fast-fashion high street labels and global luxury brands. \n“I love the idea that Haute Couture is bearing the torch for individuality,” he said. \nSome of the numbers from Fournie’s latest collection, in hues of cherry blossom pinks and deep blues meant to evoke an Asian dreamworld, have already been sold, he said. The price tag remains a secret. Reporting by Sarah White and Noemie Olive; editing by Clelia Oziel", "external_links": [], "published": "2018-01-22T18:18:00.000+02:00", "crawled": "2018-01-22T19:18:24.005+02:00", "highlightTitle": ""}