{"organizations": [], "uuid": "1293d359779f3d7a7708ca688cca70e2a25e7017", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/business-wire-daseke-appoints-scott-wheeler-as-president.html", "country": "US", "domain_rank": 767, "title": "Daseke Appoints Scott Wheeler as President", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-13T01:53:00.000+02:00", "replies_count": 0, "uuid": "1293d359779f3d7a7708ca688cca70e2a25e7017"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/business-wire-daseke-appoints-scott-wheeler-as-president.html", "ord_in_thread": 0, "title": "Daseke Appoints Scott Wheeler as President", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ADDISON, Texas--(BUSINESS WIRE)-- Daseke Inc. (NASDAQ: DSKE) (NASDAQ: DSKEW), the leading consolidator and largest flatbed and specialized transportation company in North America, today announced the appointment of its chief financial officer, Scott Wheeler, as the company’s new president. Wheeler assumes the role of president from company founder Don Daseke, who will continue to serve as Daseke’s CEO and chairman. Wheeler will remain as Daseke’s CFO.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180112005706/en/\nDaseke chief financial officer Scott Wheeler was appointed today (Jan. 12, 2018) as the company's new president. Wheeler will remain as Daseke’s CFO. (Photo: Business Wire)\n“I first met Scott when he was the mayor of our home town, Addison, Texas, a suburb of Dallas. When I asked Scott to join Daseke I knew he was a great CFO. I soon learned he was much more. Scott has now been my business partner and confidant for years, and is a trusted leader,” said Don Daseke. “He was the architect behind our mergers, organizational structure and critical to our success in going public. He has proven to be a great leader and Daseke will continue to greatly benefit from his talents and experience as he takes on this new leadership role. He has the respect of his corporate team, the CEOs of our operating companies, the Daseke board of directors and the public markets. Daseke would be very different if it were not for Scott Wheeler.”\nIn 2015, the Dallas Business Journal named Wheeler as CFO of the Year in its middle market category. In December of 2016, Wheeler was named to the company’s board of directors. Last year, the National Association of Corporate Directors and the Dallas Business Journal awarded Wheeler, and his fellow board members, with the Outstanding Directors Award for a public company.\nBefore joining Daseke, Wheeler served as CFO for two companies and was a managing director at a CFO consulting firm for high-growth companies. Wheeler sits on the advisory board of the College of Business - Texas A&M University-Commerce, where he earned his undergraduate degree and now serves as an adjunct professor of finance. In 2014, the Commerce, Finance and Economics Department at Texas A&M College of Business bestowed upon him the Alumni Ambassador Award, the highest honor granted to an alumnus. Wheeler received his M.B.A. from Southern Methodist University in 1985.\n“I knew Don was a leader from the first time I met him, and I feel fortunate to have worked alongside him for the last six years,” said Wheeler. “When Don first approached me about joining his new company as CFO, I found his philosophy of finding well-managed companies and offering them the opportunity and resources to grow their business to a whole new level to be so compelling. I look forward to taking on the operational leadership role that Don has so expertly established at Daseke, as he and I continue to serve as mentors to the leaders of Daseke’s growing number of operating companies.”\nAbout Daseke\nDaseke, Inc. is the leading consolidator and the largest flatbed and specialized transportation and logistics company in North America. Daseke offers comprehensive, best-in-class services to many of the world’s most respected industrial shippers through experienced people, more than 5,200 tractors, more than 11,000 flatbed and specialized trailers, and a million-plus square feet of industrial warehousing space. Daseke is the largest company, yet has only 1 percent market share, of the highly fragmented $133 billion flatbed and specialized transportation market.\nSource: Daseke, Inc.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180112005706/en/\nFor Daseke\nMatt Maurel, 512-387-3604\nmatt.maurel@anthonybarnum.com\nSource: Daseke, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180112005706/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.daseke.com&esheet=51742823&newsitemid=20180112005706&lan=en-US&anchor=Daseke+Inc.&index=1&md5=0e6921ebd0d45815d3f95b20e7ae3a2b"], "published": "2018-01-13T01:53:00.000+02:00", "crawled": "2018-01-13T02:07:34.031+02:00", "highlightTitle": ""}