{"organizations": [], "uuid": "dea0c33530c7d1eb9a86f85ca7ba75fa5d2eb188", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-eagleforce-health-appoints-senior-vice-president-and-chief-medical-officer.html", "country": "US", "domain_rank": 767, "title": "EagleForce Health Appoints Senior Vice President and Chief Medical Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.041, "site_type": "news", "published": "2018-01-30T19:30:00.000+02:00", "replies_count": 0, "uuid": "dea0c33530c7d1eb9a86f85ca7ba75fa5d2eb188"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-eagleforce-health-appoints-senior-vice-president-and-chief-medical-officer.html", "ord_in_thread": 0, "title": "EagleForce Health Appoints Senior Vice President and Chief Medical Officer", "locations": [], "entities": {"persons": [{"name": "cynthia izuno macri", "sentiment": "negative"}, {"name": "macri", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "herndon", "sentiment": "none"}], "organizations": [{"name": "eagleforce health", "sentiment": "negative"}, {"name": "eagleforce associates, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HERNDON, Va., Jan. 30, 2018 /PRNewswire/ -- Cynthia Izuno Macri, M.D. (CAPT MC USN-Retired) has joined the executive team at EagleForce Associates, Inc. as Senior Vice President and Chief Medical Officer. She serves as the subject matter expert on strategic business initiatives in health care education, management, and delivery, clinical applicability, and integration of technology with current and emerging health care models with special emphasis on patient safety and institutional compliance. She is also responsible for identifying, cultivating, and pursuing opportunities to collaborate with strategic business partners and academic institutions and communicating with local, state, and federal legislative officials and constituents to propel EagleForce Health's cost-effective, agile, secure, patented advanced analytics solutions into all aspects of the healthcare industry. Dr. Macri facilitates implementation of these solutions within a wide range of organizations serving diverse populations, ensuring compliance with all local, state and federal regulations and preserving the highest level of care.\nDr. Macri received her M.D. degree from Temple University School of Medicine. A board-certified Obstetrician Gynecologist and Gynecologic Oncologist with 35-years of experience in the U.S. Navy, she earned a national reputation as a Women's Cancer Specialist, surgeon, educator, and clinical researcher, focusing on cultural and technical proficiency, health literacy, social determinants of health, health disparities, population health, and cancer prevention and management.\nBefore joining EagleForce Health, Dr. Macri served as the Special Assistant to the Chief of Naval Operations (CNO) for diversity, using her strategic abilities to streamline and optimize a diverse workforce of over 300,000 active duty, reserve, and civilian personnel. She led the Navy's effort to improve Science, Technology, Engineering and Mathematics (STEM) course and career awareness, particularly within diverse, multicultural, disadvantaged, and overlooked communities. As the Chief Strategist for the Navy's 21st Century Sailor Office under the Chief of Naval Personnel (CNP), she crafted the Navy's response to the Department of Defense (DoD) Sexual Assault Prevention and Response Policy and served on the Navy's Population Health Advisory Board and the Psychological Health Advisory Board.\nDr. Macri currently sits on the Board of Directors of three veteran-centric non-profit organizations and the Steering Committee for the Asian American Health Initiative in Montgomery County. She also volunteers as an attending physician for two free clinics in Maryland that serve the underserved population. She is a certified Master Trainer in the Chronic Disease Self-Management (CDSMP), Diabetes (DSMP), and Chronic Pain Self-Management (CPSMP) Programs and teaches CDSMP and CPSMP at a transitional housing facility for homeless veterans in Baltimore. In 2016, she was appointed by Governor Hogan to represent Congressional District 8 on the Maryland State Veterans Commission. Dr. Macri is a competitive soccer player and will represent Northern Virginia in the upcoming 2018 U.S. Adult Amateur Soccer Association national championships in Bellingham, Washington.\nAbout EagleForce Health, LLC\nEagleForce Health is an Advanced Analytics Company that established its pedigree in the Defense and Intelligence sector of the government solving some of the country's biggest challenges. The Company has many patents in the area of eligibility and predictive analytics which it employs in solving some of healthcare's most difficult problems with respect to disparate data interoperability by utilizing artificial intelligence, neural computing and enhanced data modeling. For more information, please contact us or visit our website:\nwww.TheEagleForce.net\nView original content with multimedia: http://www.prnewswire.com/news-releases/eagleforce-health-appoints-senior-vice-president-and-chief-medical-officer-300590354.html\nSOURCE EagleForce Health, LLC", "external_links": ["http://www.prnewswire.com/news-releases/eagleforce-health-appoints-senior-vice-president-and-chief-medical-officer-300590354.html", "http://www.theeagleforce.net/"], "published": "2018-01-30T19:30:00.000+02:00", "crawled": "2018-01-30T20:53:46.002+02:00", "highlightTitle": ""}