{"organizations": [], "uuid": "3071120eb955adf21c212c443c05e9315651809f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220616599&w=1200&r=LYNXMPEE081DH", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-spain-politics-catalonia-mas/ex-catalan-president-artur-mas-steps-down-as-leader-of-separatist-party-idUSKBN1EY2C9", "country": "US", "domain_rank": 408, "title": "Ex-Catalan President Artur Mas steps down as leader of separatist party", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T21:12:00.000+02:00", "replies_count": 0, "uuid": "3071120eb955adf21c212c443c05e9315651809f"}, "author": "", "url": "https://www.reuters.com/article/us-spain-politics-catalonia-mas/ex-catalan-president-artur-mas-steps-down-as-leader-of-separatist-party-idUSKBN1EY2C9", "ord_in_thread": 0, "title": "Ex-Catalan President Artur Mas steps down as leader of separatist party", "locations": [], "entities": {"persons": [{"name": "artur mas", "sentiment": "negative"}, {"name": "mariano rajoy", "sentiment": "none"}], "locations": [{"name": "catalonia", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MADRID (Reuters) - Former Catalan president Artur Mas said on Tuesday he would step down as head of his separatist political party to pave the way for new leaders of Catalonia’s independence movement after reports of internal divisions.\nFollowing an illegal referendum last October and the imposition of direct rule on the region by Madrid, the pro-independence movement has become fractured over whether to continue with its push for an independent state or to engage in talks with the Spanish government to gain more regional autonomy in the short term.\nA Dec. 21 election gave separatists a slim majority in the regional parliament in a blow to Spanish Prime Minister Mariano Rajoy, who had hoped it would quash the independence movement and resolve Spain’s worst political crisis in decades.\n“This new stage requires new leaders, it is necessary to leave open spaces so that certain people can lead this project for the future,” Mas told a news conference.\nA Catalan court barred Mas from public office in March 2017 for two years for staging an informal referendum on independence in 2014 at a time when secessionist leaders were trying to drum up support for a new ballot.\nHowever, Mas remained leader of the conservative PDeCat party, which he has led for about 15 years.\nFormer Catalan president Artur Mas attends a news conference to resign as PDeCat party president in Barcelona, Spain January 9, 2018. REUTERS/Albert Gea PDeCat’s political platform in the election, the Junts per Catalunya (Together for Catalonia) led by Carles Puigdemont, emerged as the largest separatist group ahead of Esquerra Republicana (Republican Left).\nBut Puigdemont remains in self-imposed exile in Brussels after he fled to Belgium with four of his cabinet members when Madrid imposed direct rule on Catalonia and sacked his government following an Oct. 27 declaration of independence.\nHe is likely to be detained if he returns to Spain, pending an investigation on charges of sedition, rebellion, misuse of public funds, disobedience and breach of trust.\nMas previously supported Puigdemont in his push for independence but he may now favor a different candidate within the PdeCat in order to pave the way for a new separatist-led government, according to Barcelona-based newspaper La Vanguardia.\n“This should not be seen as me walking away from this project,” he said.\nSpanish Prime Minister Mariano Rajoy has called for the Catalan parliament to be formed on January 17.\nMarket-friendly Ciudadanos, which wants Catalonia to remain part of Spain and is led by Ines Arrimadas, gained the largest share of the popular vote but unionist parties did not win enough seats to govern by majority.\nReporting By Jesús Aguado and Inmaculada Sanz; additional reporting by Tomás Cobos; Editing by Angus Berwick\n ", "external_links": [], "published": "2018-01-09T21:12:00.000+02:00", "crawled": "2018-01-09T21:24:44.078+02:00", "highlightTitle": ""}