{"organizations": [], "uuid": "60a850628e6b11399b44a8750ecef365d8eee8c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-680801293.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/11/frozen-embryos-ivf-pcos/", "country": "US", "domain_rank": 1196, "title": "New Studies: Frozen Embryos Not Always Necessary for IVF | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.979, "site_type": "news", "published": "2018-01-11T02:00:00.000+02:00", "replies_count": 0, "uuid": "60a850628e6b11399b44a8750ecef365d8eee8c9"}, "author": "Emma Hinchliffe", "url": "http://fortune.com/2018/01/11/frozen-embryos-ivf-pcos/", "ord_in_thread": 0, "title": "New Studies: Frozen Embryos Not Always Necessary for IVF | Fortune", "locations": [], "entities": {"persons": [{"name": "emma hinchliffe", "sentiment": "none"}, {"name": "g. moscoso", "sentiment": "none"}], "locations": [{"name": "vietnam", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "fortune health frozen embryos", "sentiment": "negative"}, {"name": "new england journal of medicine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Health Frozen Embryos Aren’t Always Necessary for IVF, New Studies Show Human embryo. View of a human embryo at 7-8 weeks old, known as a first trimester embryo under the age of 12 weeks. Dr G. Moscoso—Science Photo Library via Getty Images By Emma Hinchliffe January 11, 2018 \nWomen have more options than previously thought for how to undergo in-vitro fertilization, according to two new studies. \nFrozen embryos are not more effective than fresh embryos for all women, according to researchers from China and Vietnam who published their findings in the the New England Journal of Medicine . This could challenge the long-held belief of fertility specialists that freezing and thawing embryos before implanting them offers a better chance of successful pregnancy and birth. \nDoctors came to that conclusion — freezing embryos before implanting works best — because it has been proven to be true for women experiencing infertility as the result of polycystic ovary syndrome, or PCOS. But for women not suffering PCOS, freezing embryos doesn’t make much of a difference. \nA research group in 2016 found that embryos that were frozen and then thawed had a 7 percentage-point advantage in leading to live births among women with PCOS. \n“Now these two papers, equally large and done in non-PCOS patients, show that in terms of live birth, which is what we care about, there is no difference,” Christos Coutifaris, a doctor at the University of Pennsylvania’s Perelman School of Medicine in Philadelphia, told Reuters . “So to apply the rule to everybody that we should freeze your embryos is probably not correct.” \nThis discovery means that doctors treating patients who don’t have PCOS may now implant one embryo at a time instead of multiple embryos at once, which can often lead to multiple births. Implanting one embryo at a time — without sacrificing the likelihood of successful pregnancy — lowers the risks associated with IVF. \n“Among infertile women without the polycystic ovary syndrome who were undergoing IVF, the transfer of frozen embryos did not result in significantly higher rates of ongoing pregnancy or live birth than the transfer of fresh embryos,” one of the studies concluded. \nFrozen embryo transfers are also more expensive than fresh embryo transfers, so this finding could help people undergoing IVF save money on the pricy frozen embryo transfer cost. One of the studies also found that for women with higher levels of progesterone, a thawed frozen embryo could be best. \n", "external_links": [], "published": "2018-01-11T02:00:00.000+02:00", "crawled": "2018-01-12T02:53:14.012+02:00", "highlightTitle": ""}