{"organizations": [], "uuid": "2425cc207d7d7b1fdb8ecfd51e6866aba6df3ebf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219185770&w=1200&r=LYNXMPEE0300T", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-pesticides-arkansas/arkansas-board-stands-by-proposal-to-limit-controversial-herbicide-idUSKBN1ET029", "country": "US", "domain_rank": 408, "title": "Arkansas board stands by proposal to limit controversial herbicide", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T02:45:00.000+02:00", "replies_count": 0, "uuid": "2425cc207d7d7b1fdb8ecfd51e6866aba6df3ebf"}, "author": "", "url": "https://www.reuters.com/article/us-usa-pesticides-arkansas/arkansas-board-stands-by-proposal-to-limit-controversial-herbicide-idUSKBN1ET029", "ord_in_thread": 0, "title": "Arkansas board stands by proposal to limit controversial herbicide", "locations": [], "entities": {"persons": [{"name": "tom po", "sentiment": "negative"}], "locations": [{"name": "arkansas", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "arkansas", "sentiment": "negative"}, {"name": "monsanto co", "sentiment": "none"}, {"name": "monsanto", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "basf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO (Reuters) - Arkansas agricultural regulators stuck with a proposal on Wednesday to prohibit sprayings of a controversial weed killer after mid-April, despite a lawsuit over the plan by manufacturer Monsanto Co.\nThe state’s plant board decided to move forward with a ban on the use of dicamba-based herbicides from April 16 to Oct. 31, after state lawmakers recommended last month that the panel review its recommendation.\nThe ban threatens to hurt demand for the products made by Monsanto and rival BASF SE because the chemicals are designed to be sprayed on dicamba-resistant crops during the summer growing season.\nThe United States faced an agricultural crisis last year caused by new versions of the herbicides, which farmers and weed experts said evaporated and drifted away from where they were applied, damaging millions of acres of crops that could not tolerate dicamba.\nMonsanto and BASF say the products are safe when used properly. They oppose the proposed ban in Arkansas and say it would hurt growers there by removing a tool to fight stubborn weeds.\nMonsanto is banking on its dicamba-based herbicide and soybean seeds engineered to resist it, called Xtend, to dominate soybean production in the United States, the world’s second-largest exporter.\nLast month, an Arkansas legislative subcommittee advised the plant board to review its proposed restrictions to consider scientific-based evidence and other factors, in a win for the agri-chemical companies. The panel is set to consider the proposal again on Jan. 16.\n“They feel like having looked back over the revisions suggested, that the rule change is based on scientific evidence and is the lowest-risk option,” said Adriane Barnes, a spokeswoman for the plant board.\nOther farm states, including Minnesota, Missouri and North Dakota, have imposed new limits on dicamba sprayings for 2018 in an attempt to prevent a repeat of the crop damage last year.\nReporting by Tom Polansek; Editing by Leslie Adler\n ", "external_links": [], "published": "2018-01-04T02:45:00.000+02:00", "crawled": "2018-01-04T03:00:41.011+02:00", "highlightTitle": ""}