{"organizations": [], "uuid": "0b5d98b0f7e66771a4d968bca80d26404b7199f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226253835&w=1200&r=LYNXMPEE0S0M8", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-china-economy/china-to-consider-shadow-banking-in-macro-prudential-review-central-bank-vice-governor-idUKKBN1FI0YD", "country": "US", "domain_rank": 408, "title": "China may widen macro-prudential review to curb risks - central bank", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T13:35:00.000+02:00", "replies_count": 0, "uuid": "0b5d98b0f7e66771a4d968bca80d26404b7199f9"}, "author": "", "url": "https://uk.reuters.com/article/uk-china-economy/china-to-consider-shadow-banking-in-macro-prudential-review-central-bank-vice-governor-idUKKBN1FI0YD", "ord_in_thread": 0, "title": "China may widen macro-prudential review to curb risks - central bank", "locations": [], "entities": {"persons": [{"name": "yi", "sentiment": "none"}, {"name": "yi gang", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "china finance", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "mpa", "sentiment": "none"}, {"name": "people’s bank of china", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 9:55   China may widen macro-prudential review to curb risks - central bank Reuters Staff 2 Min Read \nBEIJING (Reuters) - China may include shadow banking, property financing and internet financing in its macro-prudential assessment (MPA) to help curb risks, vice central bank governor Yi Gang said in remarks published on Monday. \nChinese policymakers have been trying to contain financial risks and slow an explosive build-up in debt without stunting economic growth. \n“We will further improve macro-prudential policy framework, explore ways to include shadow banking, real estate financing and internet financing,” Yi wrote in China Finance, a publication under the People’s Bank of China. \nThe central bank will also include interbank certificates of deposit and green credit in its MPA reviews and improve its counter-cyclical adjustments on capital flows, Yi said. \nSince the first quarter of 2017, the central bank has included banks’ off-the-balance-sheet wealth management products - part of the sprawling shadow banking sector, in its examination of broad credit in its MPA risk-tool. \nChina’s financial deleveraging has pushed up money market rates, bond yields and corporate funding costs as broad M2 money supply growth hit a record low of 8.2 percent last year -- well below the official target of around 12 percent. \nThe world’s second-biggest economy still has problems and hidden dangers as the country’s debt levels remain high and asset bubble risks have yet to be fully contained, Yi wrote. \nThe central bank will maintain prudent and neutral monetary policy while seeking to increase flexibility and effectiveness of liquidity management, Yi said. \nChina has conditions to keep the yuan basically stable, Yi said, adding that the regulator will look to increase the yuan’s exchange rate flexibility. \n“Pushing forward market-based reforms of renminbi (yuan) exchange rate mechanism in an orderly way and enhancing its flexibility will increase the resilience of China’s economy and its financial system in coping with external shocks,” Yi said. Reporting by Kevin Yao and Beijing Monitoring Desk; Editing by Jacqueline Wong", "external_links": [], "published": "2018-01-29T13:35:00.000+02:00", "crawled": "2018-01-29T13:57:48.016+02:00", "highlightTitle": ""}