{"organizations": [], "uuid": "61e3ba2ab17273ce4e8eab08f64636ed1bc5e4d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-upmc-center-for-high-value-health-care-names-dr-chester-bernie-good-senior-medical-director-for-the-center-for-value-based.html", "country": "US", "domain_rank": 767, "title": "UPMC Center for High-Value Health Care Names Dr. Chester \"Bernie\" Good Senior Medical Director for the Center for Value-Based Pharmacy Initiatives", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-23T20:11:00.000+02:00", "replies_count": 0, "uuid": "61e3ba2ab17273ce4e8eab08f64636ed1bc5e4d0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-upmc-center-for-high-value-health-care-names-dr-chester-bernie-good-senior-medical-director-for-the-center-for-value-based.html", "ord_in_thread": 0, "title": "UPMC Center for High-Value Health Care Names Dr. Chester \"Bernie\" Good Senior Medical Director for the Center for Value-Based Pharmacy Initiatives", "locations": [], "entities": {"persons": [{"name": "bernie", "sentiment": "neutral"}, {"name": "chester", "sentiment": "neutral"}, {"name": "good", "sentiment": "none"}], "locations": [{"name": "pittsburgh", "sentiment": "none"}], "organizations": [{"name": "upmc center for high-value health care", "sentiment": "neutral"}, {"name": "upmc insurance services division", "sentiment": "none"}, {"name": "upmc", "sentiment": "none"}, {"name": "university of pittsburgh", "sentiment": "none"}, {"name": "center for high-value health care", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PITTSBURGH, Jan. 23, 2018 /PRNewswire/ -- Dr. Chester \"Bernie\" Good has been named senior medical director for the Center for Value-Based Pharmacy Initiatives (VBPI), which is housed within the UPMC Center for High-Value Health Care.\nThe Center for Value-Based Pharmacy Initiatives (VBPI), which is supported jointly by UPMC Health Plan and a research grant from Express Scripts, was launched in 2017 to leverage the unique assets and resources of the UPMC Insurance Services Division to develop, implement, and evaluate new value-based payment models for pharmaceuticals at UPMC.\nIn his new role as senior medical director, Dr. Good will provide leadership and direction for VBPI research projects, collaborations, and dissemination activities and will support related research objectives of UPMC's Center for High-Value Health Care, the Health Plan's not-for-profit research group.\n\"Bernie brings more than 30 years of experience, including leadership roles at the University of Pittsburgh's school of medicine and school of pharmacy and at the Department of Veterans Affairs, where he served as the medical advisory panel for VA Pharmacy Benefits Management chairperson,\" said Chronis Manolis, RPh, chief pharmacy officer at UPMC Health Plan. \"Bernie will spearhead the Center for Value-Based Pharmacy Initiatives' efforts to include value assessments to address the rising cost of medications, which is a central policy issue and a major driver of increasing healthcare costs.\"\nDr. Good will be responsible for developing innovative, value-based alternative payment models. He will also identify and track trends toward alternative, value-based purchasing of drugs and other innovations in pharmacy strategy.\nIn addition to his role with the VBPI, Dr. Good will continue to serve as a faculty member at the University of Pittsburgh's school of medicine and school of pharmacy.\nHe earned his bachelor's degree in biochemistry from the University of Maryland, his medical degree from George Washington University, and his master of public health degree in epidemiology from the University of Pittsburgh. He is widely published, with research interests in drug safety and effectiveness, and conflicts of interest in medicine.\nAbout the UPMC Insurance Services Division\nThe UPMC Insurance Services Division is owned by UPMC (University of Pittsburgh Medical Center) a world-renowned health care provider and insurer based in Pittsburgh, Pa. The UPMC Insurance Services Division – which includes UPMC Health Plan, WorkPartners, UPMC for Life, UPMC for You, UPMC for Kids, and Community Care Behavioral Health — offers a full range of group health insurance, Medicare, Special Needs, CHIP, Medical Assistance, behavioral health, employee assistance and workers' compensation products and services to more than 3.2 million members. For more information, visit www.upmchealthplan.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/upmc-center-for-high-value-health-care-names-dr-chester-bernie-good-senior-medical-director-for-the-center-for-value-based-pharmacy-initiatives-300586796.html\nSOURCE UPMC Health Plan", "external_links": ["http://www.upmchealthplan.com/", "http://www.prnewswire.com/news-releases/upmc-center-for-high-value-health-care-names-dr-chester-bernie-good-senior-medical-director-for-the-center-for-value-based-pharmacy-initiatives-300586796.html"], "published": "2018-01-23T20:11:00.000+02:00", "crawled": "2018-01-23T20:06:34.005+02:00", "highlightTitle": ""}