{"organizations": [], "uuid": "add7fd9f31867dcaad1c87ad6135d68e4e6184f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/egypt-economy-investment/rpt-mideast-money-surge-in-foreign-fund-inflows-sets-stage-for-egyptian-boom-idUSL8N1P03DV", "country": "US", "domain_rank": 408, "title": "RPT-MIDEAST MONEY-Surge in foreign fund inflows sets stage for Egyptian boom", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T08:00:00.000+02:00", "replies_count": 0, "uuid": "add7fd9f31867dcaad1c87ad6135d68e4e6184f6"}, "author": "", "url": "https://www.reuters.com/article/egypt-economy-investment/rpt-mideast-money-surge-in-foreign-fund-inflows-sets-stage-for-egyptian-boom-idUSL8N1P03DV", "ord_in_thread": 0, "title": "RPT-MIDEAST MONEY-Surge in foreign fund inflows sets stage for Egyptian boom", "locations": [], "entities": {"persons": [{"name": "arwa gaballa", "sentiment": "none"}, {"name": "saeed azhar  cairo/dubai", "sentiment": "none"}], "locations": [{"name": "egypt", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 6:00 AM / Updated 3 hours ago RPT-MIDEAST MONEY-Surge in foreign fund inflows sets stage for Egyptian boom Reuters Staff \n(Repeats story first published on Jan. 7 with no changes) \n* Direct investment inflows highest in nearly a decade \n* Zohr gasfield set to improve balance of payments \n* Inefficient bureaucracy and political risks remain \n* GRAPHIC-Inflows into Egypt: tmsnrt.rs/2CgCGt4 \n* GRAPHIC-Real effective FX Rates: reut.rs/2CWIzJY \nBy Arwa Gaballa and Saeed Azhar \nCAIRO/DUBAI, Jan 7 (Reuters) - Encouraged by Egypt’s economic reforms, a major gas find, streamlined business rules and a devalued currency, investors are increasingly optimistic about prospects for the North African country after years of political turmoil. \nForeign holdings of Treasury bills hit a record high in December, foreign inflows into the stock market last year were the highest since 2010 and direct investment by foreign firms and private equity funds is on the rise again. \nKey for many longer-term foreign investors are the natural gasfields that have come on stream in the last few months, including the offshore Zohr field, whose estimated 30 trillion cubic feet makes it the largest in the Mediterranean. \nIyad Malas, a Dubai-based partner of private equity firm Gateway Partners, said Zohr “will be a game changer for Egypt” and the company’s fund, which invests in Asia, the Middle East and Africa, is looking at several opportunities in Egypt. \nThe gas discoveries should eventually make Egypt a gas exporter and boost its plans to become a regional energy hub. \nBesides the gas, private equity firms say reforms launched since the end of 2016 that secured a $12 billion loan programme from the International Monetary Fund (IMF) have shifted sentiment enough to spur investment, despite the risks. \nOne of Egyptian President Abdel Fattah al-Sisi’s biggest challenges is to end an Islamist insurgency which has started to shift its attacks from the remote Sinai peninsula to larger cities. \nInvestors, however, say they are more concerned the government might deviate from reforms agreed with the IMF, such as cutting energy subsidies further, to keep voters on side ahead of presidential elections this year. \nInvestors also want inflation to fall and for the government to press ahead with reforms to tackle the red tape that has left Egypt ranked 128 out of 190 countries in the World Bank’s ease of doing business index. \n‘ECONOMIC OUTPERFORMER’ \nSince November 2016, Egypt has devalued its currency, removed limits on foreign currency transfers, lifted hard currency restrictions for importers, cut subsidies for domestic fuel and raised value-added tax. \n“We’re very positive on Egypt,” said Karim El Solh, co-founder and chief executive of Abu Dhabi’s Gulf Capital, which has invested some $200 million in Egypt. \n“In the region, it is set to be the economic outperformer in 2018, especially after these very strong and needed structural reforms,” he said. \nInvestment by overseas investors in short-term, liquid instruments such as Treasury bills has been heavy since Egypt devalued its currency and raised interest rates. \nThroughout 2017, investors snapped up bills with maturities of three to 12 months yielding as much as 22 percent. By early December, foreign holdings of Treasury bills had hit a record 338 billion Egyptian pounds ($19 billion), up from 532 million pounds in mid-2016, central bank data showed. \nIn U.S. dollar terms, foreign holdings of Treasury bills are now nearly three times the previous high in 2010 - with about half the investment coming in the last few months of 2017. \nCharles Robertson, global chief economist at Renaissance Capital, estimates the Egyptian pound is 16 percent undervalued compared to its long-term average and with inflation coming down from its 2017 peak of 33 percent, Egypt remains one of the most attractive emerging markets. \nThe stock market, which has a capitalisation of $45 billion, has also benefited from net inflows of foreign funds, which came to 7.5 billion pounds in 2017, the highest since a record 8.4 billion pounds in 2010, according to exchange data. \nSince the pound floated on Nov. 3, 2016 - slumping from 8.8 to the dollar to 17.7 now - the Egyptian blue-chip index has climbed more than 70 percent. \nRobertson expects the rally to continue for the next two years now the shock of the 2016 currency devaluation has passed, economic growth is picking up and high inflation is receding. DIRECT INVESTMENT \nMore importantly for Egypt’s longer-term stability, investment by foreign companies and acquisitions by foreign private equity firms are rising - the kind of commitment that is less likely to be affected by short-term market fluctuations. \nEconomists say the fact Egypt has a population above 90 million, the third highest in Africa behind Nigeria and Ethiopia, coupled with a young and growing labour force make it an attractive destination. \nNet inflows of foreign direct investment into Egypt came to $7.9 billion in the year to the end of June, according to government data, helped by the energy sector. While below the government’s $10 billion target, it was the fourth annual increase in a row and the highest since $8.1 billion in 2008-09. \nInflows peaked at $13.2 billion in 2007-08 before plummeting to $2.2 billion in 2011 during the Arab Spring uprising that ousted long-serving President Hosni Mubarak, disrupted the economy and ushered in years of political instability. \nPartly because of the improving outlook for gas supplies and a growing solar power industry, foreign private equity firms are expecting a surge in investment in the energy sector. \nHashem Fouad, chief investment officer at Dubai-based Enara Capital, said his firm was working with Chinese interests on opportunities in Egypt. \n“We achieved financial closes worth $200 million in the renewable energy sector in 2017 and expect more deals this year,” he said. \nOthers are focusing on sectors likely to benefit as the economy expands, and exporters helped by the weaker currency. Solh at Gulf Capital said his firm was looking at companies in healthcare, education, water and food. \n“We are backing companies that are very export-oriented, earning hard currencies in dollars or euros so we are partially hedged to the currency,” he said. \nGateway Partners is also focusing on export-orientated sectors and consumer industries. \n“We believe sectors related to consumer - retail, real estate, healthcare and education - and export manufacturing industries like textiles, agri-processing, and many other manufactured products are attractive,” said Malas. \nThe impact of the devaluation on exports and imports, coupled with the surge in foreign fund inflows, has also helped Egypt start to address the chronic trade deficit and balance of payments problems that have plagued the country for a decade. \nThe central bank’s foreign reserves surged to $37 billion in December from just over $24 billion a year earlier, while gross domestic product growth accelerated to 5.2 percent in the July-September quarter from 3.4 percent a year ago. Additional reporting by Davide Barbuscia, Tom Arnold,; Nawied Jabarkhyl, Stephen Jewkes and Karin Strohecker; writing by Andrew Torchia; editing by David Clarke", "external_links": [], "published": "2018-01-08T08:00:00.000+02:00", "crawled": "2018-01-08T08:22:34.019+02:00", "highlightTitle": ""}