{"organizations": [], "uuid": "071eddfccff2bf808121df310c483a58115daeeb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-473160230.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/18/a-21-ft-cactus-flirty-tweets-and-hyperloop-10-amazon-hq2-bids-that-didnt-work/", "country": "US", "domain_rank": 1196, "title": "10 Outlandish Amazon HQ2 Bids That Didn’t Work | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.936, "site_type": "news", "published": "2018-01-18T02:00:00.000+02:00", "replies_count": 0, "uuid": "071eddfccff2bf808121df310c483a58115daeeb"}, "author": "Kirsten Korosec", "url": "http://fortune.com/2018/01/18/a-21-ft-cactus-flirty-tweets-and-hyperloop-10-amazon-hq2-bids-that-didnt-work/", "ord_in_thread": 0, "title": "10 Outlandish Amazon HQ2 Bids That Didn’t Work | Fortune", "locations": [], "entities": {"persons": [{"name": "kirsten korosec", "sentiment": "negative"}, {"name": "eric greitens", "sentiment": "none"}, {"name": "hyperloop", "sentiment": "none"}], "locations": [{"name": "amazon", "sentiment": "none"}, {"name": "kansas city", "sentiment": "none"}, {"name": "missouri", "sentiment": "none"}, {"name": "st. louis", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Kirsten Korosec January 18, 2018 \nAmazon has culled its list of potential sites for its second headquarters from 238 bids across North America to just 20. And that means a lot of sad local lawmakers and economic development officials are milling about their respective offices. Especially considering the lengths to which some cities went to capture the prized second headquarters location. \nHere’s how far some cities—including some that made the first cut—went to woo Amazon and the $5 billion campus the e-commerce company says it wants to build and fill with 50,000 new, full-time employees. Anywhere, Missouri \nReally. Just put it anywhere in the state. Gov. Eric Greitens made a bold suggestion to Amazon: chose the state for its second headquarters and a futuristic high-speed and unproven transit system called Hyperloop could be built to connect its two largest cities St. Louis and Kansas City. Birmingham, Alabama \nThree giant Amazon boxes the size of trucks were placed around Birmingham and residents were encouraged to share their photos on social media by using the hashtag “#bringatob.” \nThe city also installed two giant buttons built to resemble Amazon Dash’s instant-ordering units. When people press them, one of 600 different promotional and even flirty tweets were sent out onto the web. Birmingham is Sagittarius and Amazon is Cancer. We were made for each other. #BringAtoB \n— Bring A to B (@BringAtoB) December 14, 2017 \nOne tweet said: “Amazon, we got a 100% match on Bumble. Wanna go on a date?” Birmingham asks the company in one of hundreds of Tweets it has sent the company.” Another one said “We are Chipotle and these other cities are Taco Bell, Amazon.” #Bham 's the place to be for rising millennials. We topped the list of best cities for millennial entrepreneurs. #bringatob \n— Bring A to B (@BringAtoB) December 7, 2017 Calgary, Canada \nCalgary wanted to make sure Amazon got its message. So in October the Calgary’s economic development group erected a 120-ft. by 10-ft. banner at construction site near the retailer’s Seattle headquarters with the slogan “We’re not saying we’d fight a bear for you … but we totally would.” \nOther “cheeky, bold messages” intended to break through the clutter of bids from other cities appeared in chalk on nearby pedestrian sidewalks, the city’s economic development group said in a release at the time. Charlotte, North Carolina \nBasketball legend Michael Jordan wrote a personal letter to Amazon CEO Jeff Bezos in a pitch for Charlotte, North Carolina. \nJordan, a former University of North Carolina and Chicago Bulls superstar, owns the NBA’s Charlotte Hornets franchise and has deep roots in the state. The letter was included in Charlotte’s official bid for HQ2. \nCharlotte mayor Vi Lyles also made an effort to bring attention to the city. She declared Oct. 18—the day before the bids were due—to be an official Amazon-themed day in the metro area called #CLTisPrime Day. Chula Vista, California \nThe city offered to Amazon 85 acres of land for free, which has a value: $100 million. It also said it would excuse any property taxes on the headquarters for 30 years for a $300 million value. Fresno, California \nThis city took their pitch to a new level and actually proposed giving Amazon direct control over how civic dollars were spent. \nFresno promised to put 85% of all taxes and fees generated by Amazon into a special fund , which would be overseen by a board. The board, comprised of people from Amazon and the city, would determine how the money would be spent. The money would go towards housing, roads and parks in and around Amazon. Frisco, Texas \nThe city, located about a half hour from Dallas, offered to give away 40% of its land area. \n“Our city’s only about 60 percent built out, so we’ve got a lot of available land where we can build to suit,” Mayor Jeff Cheney told the New York Times . “We play to win. We’re innovators. We’re forward thinkers, and we’re serious.” Kansas City, Missouri \nKansas City’s mayor Sly James wanted to get the retailer’s attention, so he bought 1,000 Amazon products on Wednesday, and reviewed each and every one of them. Let’s rake this one in, KC. Tell Amazon what you love about KC with a tweet using #KC5Stars . pic.twitter.com/FCDChEXJYB \n— Mayor Sly James (@MayorSlyJames) October 16, 2017 \nStonecrest, Georgia \nThe suburb of Atlanta proposed de-annexing up to 345 acres of land and renaming it Amazon. \n“There are several major U.S. cities that want Amazon, but none have the branding opportunity we are now offering this visionary company,” Mayor Jason Lary said, according to a local NBC affiliate . ICYMI: The city of Stonecrest wants to change their city name to Amazon. (SEE WHY HERE) https://t.co/dMCzh6imEO pic.twitter.com/j6IXthPHU9 \n— Everything Georgia (@GAFollowers) October 4, 2017 Tucson, Ariz. \nIn September, a Tucson economic development group sent a giant 21-foot saguaro cactus to Amazon’s headquarters in Seattle. The company rejected the gift, tweeting to the group Sun Corridor Inc., “unfortunately we can’t accept gifts (even really cool ones) so we donated it to the Desert Museum.” The Arizona-Sonora Desert Museum is a 98-acre zoo and natural history museum focused on the plants and animals of the Sonoran desert located west of the city near Saguaro National Park (west). Thx @SunCorridorInc ! Unfortunately we can’t accept gifts (even really cool ones) so we donated it to @DesertMuseum 🌵 https://t.co/ZJPQfs44cq pic.twitter.com/Fot06Kgs9P \n— Amazon News (@amazonnews) September 19, 2017 \nThe final list of cities includes : Atlanta ", "external_links": [], "published": "2018-01-18T02:00:00.000+02:00", "crawled": "2018-01-20T18:17:53.038+02:00", "highlightTitle": ""}