{"organizations": [], "uuid": "49a3e6a8c1b1df9258b7aa827e362d5ab3686312", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-albertsons-companiesa-coo-wayne-denningham-to-retire-susan-morris-appointed-evp-chief-operations-officer.html", "country": "US", "domain_rank": 767, "title": "Albertsons Companies’ COO Wayne Denningham to Retire; Susan Morris Appointed EVP & Chief Operations Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T17:00:00.000+02:00", "replies_count": 0, "uuid": "49a3e6a8c1b1df9258b7aa827e362d5ab3686312"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-albertsons-companiesa-coo-wayne-denningham-to-retire-susan-morris-appointed-evp-chief-operations-officer.html", "ord_in_thread": 0, "title": "Albertsons Companies’ COO Wayne Denningham to Retire; Susan Morris Appointed EVP & Chief Operations Officer", "locations": [], "entities": {"persons": [{"name": "wayne denningham", "sentiment": "negative"}, {"name": "susan morris", "sentiment": "negative"}, {"name": "bob miller", "sentiment": "none"}, {"name": "susan", "sentiment": "none"}, {"name": "denningham", "sentiment": "none"}], "locations": [{"name": "boise", "sentiment": "none"}, {"name": "idaho", "sentiment": "none"}], "organizations": [{"name": "albertsons companies", "sentiment": "negative"}, {"name": "albertsons llc", "sentiment": "none"}, {"name": "manufacturing", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOISE, Idaho, Jan. 16, 2018 (GLOBE NEWSWIRE) -- Albertsons Companies today announced that President & Chief Operating Officer Wayne Denningham plans to retire near the end of the company’s fiscal year. Denningham garnered over 40 years with the company, having started working as a clerk as a teenager. The Company has named Susan Morris Executive Vice President and Chief Operations Officer, overseeing the company’s Supply Chain, Manufacturing, and Operations functions.\nAlbertsons Companies has named Susan Morris Executive Vice President and Chief Operations Officer, overseeing the company’s Supply Chain, Manufacturing, and Operations functions.\n“Susan is a talented leader within our company, and she fully embraces our entrepreneurial spirit and commitment to running really good stores,” said Bob Miller, Chairman and CEO of Albertsons Companies. “Susan raised her hand to come to Albertsons LLC in 2010 when she was a Senior Vice President of Sales and Marketing for a competitor, and she took the only job we had open – a Grocery Sales Manager in our Southwest Division. She has proven herself to be a valuable part of our leadership team in readily accepting new challenges, developing others and bringing teams together, and I know that her broad experience will be of significant value to Albertsons Companies as we move forward.”\nMorris began her career in Albertsons Denver Division while still in high school and worked her way up in the ranks proving her ability to lead, execute and cultivate great teams in one assignment after another in her 30+ years in the retail grocery business. Her career has spanned roles from Store Director to Corporate Grocery Sales Director, Vice President of Bakery and Operations and, upon the sale of Albertson’s Inc.’s assets to SUPERVALU, Vice President of Customer Satisfaction. In 2013, Morris was named Intermountain Division President after a three-year stint in the company’s Southwest Division, and subsequently was asked to lead the Denver Division in 2015. Morris was named EVP, East Operations in April 2016 and was moved to lead West Region Operations in March 2017.\nMorris will continue to lead the Seattle, Portland, Northern California and Southern California divisions as part of her role. Jim Perkins, EVP Operations and Special Projects, will continue as President of the Acme and Eastern divisions. Mike Withers, EVP East Region Operations will lead the remaining 6 divisions, which include Denver, Intermountain, Jewel-Osco, Shaw's, Southern, Southwest, and United.\nMorris will be based at the company’s Boise, Idaho corporate campus.\n###\nAbout Albertsons Companies\nAlbertsons Companies is one of the largest food and drug retailers in the United States, with both a strong local presence and national scale. We operate stores across 35 states and the District of Columbia under 20 well-known banners including Albertsons, Safeway, Vons, Jewel-Osco, Shaw's, Acme, Tom Thumb, Randalls, United Supermarkets, Pavilions, Star Market, Haggen and Carrs, as well as meal kit company Plated based in New York City. Albertsons Companies is committed to helping people across the country live better lives by making a meaningful difference, neighborhood by neighborhood. In 2016 alone, along with the Albertsons Companies Foundation, the company gave nearly $300 million in food and financial support. These efforts helped millions of people in the areas of hunger relief, education, cancer research and treatment, programs for people with disabilities and veterans outreach.\nImportant Notice Regarding Forward-Looking Statements\nThis press release contains certain forward-looking statements. Statements that are not historical facts, including statements about our perspectives and expectations, are forward looking statements. The words “expect,” “believe,” “estimate,” “intend,” “plan” and similar expressions, when related to the Company and its subsidiaries, indicate forward-looking statements. These statements reflect the current view of management and are subject to various risks and uncertainties. These statements are based on various assumptions and factors, including general economic, market, industry and operational factors. Any changes to these assumptions or factors may lead to practical results different from current expectations. Excessive reliance should not be placed on those statements. Forward-looking statements relate only to the date they were made, and the Company and its subsidiaries undertake no obligation to update forward-looking statements to reflect events or circumstances after the date they were made.\nAttachments:\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/45e1c8d4-b00d-4c29-9fca-c0c7e48e92dd\nAttachments:\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/9908bac2-3eef-4138-bed7-e4166a142b21\nChristine Wilcox Albertsons Companies 208-395-4163 Christine.Wilcox@albertsons.com\nSource: Albertsons Companies", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/9908bac2-3eef-4138-bed7-e4166a142b21/en", "https://www.globenewswire.com/NewsRoom/AttachmentNg/45e1c8d4-b00d-4c29-9fca-c0c7e48e92dd/en", "http://www.globenewswire.com/NewsRoom/AttachmentNg/9908bac2-3eef-4138-bed7-e4166a142b21", "https://www.globenewswire.com/Tracker?data=a8TwVc3GlLJdhjN46OUaY8IePGtfRuoEBrMyX0p2UZ44kkpGiwE46q0xi3a8LLBpHZt54blS0B3zPIOnVjJGJ02xV1AOWOl9c4W-A6UwwrKybW_17NUFmhNdyQPvKsbbU7yN22d2MqxKlrmnxJoQmdSIcwg-hK-ofl7uL5i1va1WAKaG-mF9gQZiN0p6b3ZV4v9XbnvQBqCzY5-4IEcyRE-jZiZRtKXNRTX0tmVMUtJmftlQA_U6ETXPsLbXvhvyCikHlrfgNu5SM7XyAhgvyQ==", "http://www.globenewswire.com/NewsRoom/AttachmentNg/45e1c8d4-b00d-4c29-9fca-c0c7e48e92dd", "https://www.globenewswire.com/Tracker?data=a8TwVc3GlLJdhjN46OUaY8IePGtfRuoEBrMyX0p2UZ44kkpGiwE46q0xi3a8LLBp1lDrQV8yQgszF2JlVL6p9zAd0EX6j2wI0PaPJh1hH_NBOlbgCWMBzpNFCUn3T3ioc8wPUEdPzhwR9BHGca2mhjrThzYnl_-zPYyEv7Prz_h_jOIkUClRkq2-Gr7ak05IQ2bJ2iU_RRYLBv5bU3sl578FQPY1XN6HIcnP8aefhBy1K7dBLLOVcnzmRuh95nBgu5_8zksJSXfhNHl_d0PKfw=="], "published": "2018-01-16T17:00:00.000+02:00", "crawled": "2018-01-16T18:23:28.012+02:00", "highlightTitle": ""}