{"organizations": [], "uuid": "a57bf11913a142c9ccbbc2c5e3faee80419f1ae1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-tower-arch-capital-announces-the-promotions-of-aubrey-burnett-thomas-feveryear-and-kathy-mickelson.html", "country": "US", "domain_rank": 767, "title": "Tower Arch Capital announces the promotions of Aubrey Burnett, Thomas Feveryear, and Kathy Mickelson", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-19T16:00:00.000+02:00", "replies_count": 0, "uuid": "a57bf11913a142c9ccbbc2c5e3faee80419f1ae1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-tower-arch-capital-announces-the-promotions-of-aubrey-burnett-thomas-feveryear-and-kathy-mickelson.html", "ord_in_thread": 0, "title": "Tower Arch Capital announces the promotions of Aubrey Burnett, Thomas Feveryear, and Kathy Mickelson", "locations": [], "entities": {"persons": [{"name": "aubrey burnett", "sentiment": "negative"}, {"name": "kathy mickelson", "sentiment": "negative"}, {"name": "thomas feveryear", "sentiment": "negative"}, {"name": "aubrey", "sentiment": "none"}, {"name": "ryan stratton", "sentiment": "none"}], "locations": [{"name": "lake city", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "tower arch capital", "sentiment": "negative"}, {"name": "charlesbank capital partners", "sentiment": "none"}, {"name": "stanford graduate school of business", "sentiment": "none"}, {"name": "hig capital", "sentiment": "none"}, {"name": "tower arch", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SALT LAKE CITY, Jan. 19, 2018 /PRNewswire/ -- Tower Arch Capital, LP, a leading lower-middle market private equity fund that partners with entrepreneurs and family-owned companies to create long-term value for its management teams and investors, is pleased to announce the following promotions:\nAubrey Burnett from Vice President to Principal Thomas Feveryear from Controller to Chief Financial Officer Kathy Mickelson from Executive Assistant to Office Manager\n\"Each of these individuals has exhibited exceptional performance in their respective areas and has contributed greatly to the continuing success of the fund. We are thrilled to announce these well-deserved promotions and look forward to another outstanding year,\" said Ryan Stratton, a Tower Arch partner.\nMr. Aubrey Burnett joined Tower Arch in 2016 as a Vice President. Prior to joining Tower Arch Capital, he was a Vice President at HIG Capital in San Francisco and also worked at Charlesbank Capital Partners in Boston. Aubrey received his Master of Business Administration from the Stanford Graduate School of Business and is a magna cum laude graduate of Dartmouth College with a Bachelor of Arts in Government. He is a member of the Board of Directors of KNS International.\nMr. Thomas Feveryear joined Tower Arch in 2013 as a Controller. Prior to Tower Arch, he was the Controller at Peterson Partners and was responsible for the accounting and financial reporting of several private equity and venture capital funds. Tom received his Master of Business Administration and a Bachelor of Science in Accounting from the University of Utah. Tom is a licensed Certified Public Accountant and is accredited in business valuations as a member of the American Institute of Certified Public Accountants.\nMs. Kathy Mickelson joined Tower Arch in 2014 as an Executive Assistant. Prior to joining Tower Arch, she was a personal assistant to the CFO of TCS, Inc. Kathy began her career working as an office manager and licensed insurance agent, specializing in both personal insurance lines and commercial policies. She is also active in the community where she manages the financial operations for a local nonprofit.\nAbout Tower Arch Capital\nHeadquartered in Salt Lake City, UT, Tower Arch Capital is a lower-middle market private equity fund with $272 million in capital commitments. They focus on partnering with and growing high-quality family and entrepreneur-owned companies to deliver long-term value for their management teams and investors. Tower Arch brings operational, consulting, and financial expertise to small companies to give them the tools they need to achieve their full potential. Tower Arch creates value in a range of industries and works with companies across the United States. Target investments include control positions in entrepreneur and family-owned businesses with revenue between $20 million and $150 million or EBITDA between $5 million and $25 million. For more information, please visit www.towerarch.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/tower-arch-capital-announces-the-promotions-of-aubrey-burnett-thomas-feveryear-and-kathy-mickelson-300584686.html\nSOURCE Tower Arch Capital", "external_links": ["http://www.prnewswire.com/news-releases/tower-arch-capital-announces-the-promotions-of-aubrey-burnett-thomas-feveryear-and-kathy-mickelson-300584686.html", "http://www.towerarch.com/"], "published": "2018-01-19T16:00:00.000+02:00", "crawled": "2018-01-19T16:06:34.005+02:00", "highlightTitle": ""}