{"organizations": [], "uuid": "cecb3140dcc75c52ca54e21d1fc277639f91d13a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-2017-a-banner-year-for-coso-cloud.html", "country": "US", "domain_rank": 767, "title": "2017 a Banner Year for CoSo Cloud", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T01:38:00.000+02:00", "replies_count": 0, "uuid": "cecb3140dcc75c52ca54e21d1fc277639f91d13a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-2017-a-banner-year-for-coso-cloud.html", "ord_in_thread": 0, "title": "2017 a Banner Year for CoSo Cloud", "locations": [], "entities": {"persons": [{"name": "glen d. vondrick", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "oakland", "sentiment": "none"}], "organizations": [{"name": "coso cloud llc", "sentiment": "negative"}, {"name": "us armed forces", "sentiment": "none"}, {"name": "aaski technology inc", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}, {"name": "coso cloud", "sentiment": "none"}, {"name": "federal government", "sentiment": "none"}, {"name": "coso cloud fed", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OAKLAND, Calif., Jan. 16, 2018 /PRNewswire/ -- CoSo Cloud LLC, the leading private cloud managed services provider for secure virtual classroom training and web conferencing, today announced that in 2017, after being acquired by AASKI Technology Inc, the company increased year on year Sales Bookings, Recurring Revenues, Gross Margin and EBITDA.\n\"2017 was an extremely successful first year for newly-formed CoSo Cloud, an AASKI company,\" said Glen D. Vondrick, General Manager, CoSo Cloud LLC. \" We added outstanding new talent to our Sales and Operations teams, which were immediately productive, helping us achieve all of our financial growth goals while simultaneously cutting costs. Customers will benefit from the business momentum we've experienced in 2017 by seeing more investment in new product development in 2018 as we continue to add more engineering and product management talent to the company.\"\nCoSo Cloud's 2017 highlights include:\nAdded new customers in Federal Government including a division of the US Armed Forces and a Federal Government agency who preferred the CoSo Cloud FedRAMP security certification over all other Adobe Connect deployment options. CoSo's existing customer base increased their usage and invested in add-on offerings resulting in a sizable increase in recurring revenue from the customer base. Launched CoSo Insights, a powerful reporting and management tool that enables users on CoSo Cloud Managed Services to monitor, track, and manage their global eLearning and virtual classroom deployment with usage analytics. Added 20+ year sales veteran Jim Seaman as Chief Sales Executive to lead the Direct, OEM, and VAR revenue teams. Expanded Federal Government sales and support team in the Washington, D.C. area and added experienced major account Commercial sales presence in the Northeast corridor. Strengthened CoSo's unique Adobe Connect OEM partnership with the addition of new CoSo Cloud managed services offerings and bundles available on the Adobe price list, including new FedRAMP-certified services and Commercial SOC-2, HITRUST security offerings. The company also strengthened its reseller channels in the Adobe Connect ecosystem by adding new authorized reseller and teaming referral agreements, which contributed immediate new revenue from CoSo's partnerships.\n\"AASKI is thrilled to see CoSo Cloud achieve record growth targets right out of the gate after joining the AASKI Technology family,\" said Bharat Parikh, CEO, AASKI Technology and CoSo Cloud. \"CoSo's world class talent, continued high renewal rates with customers, strategic partnership with Adobe, cost cutting and strong business management solidifies CoSo's leadership position as the company that will redefine the way virtual training enables global businesses and government agencies to lower their training costs and accelerate workforce productivity.\"\nAbout CoSo Cloud\nCoSo Cloud is a trusted private cloud managed services provider for businesses and government agencies that need the highest reliability and security for their high-consequence virtual training and web conferencing. The CoSo Cloud platform meets or exceeds most security and regulatory compliance requirements for SOC 2, HIPAA, HITRUST and FedRAMP. Citigroup, FEMA, General Motors, General Services Administration, KPMG, Raytheon and the Transportation Security Administration are among the many enterprises and government agencies relying upon CoSo Cloud for high reliability and protection of their sensitive data. CoSo Cloud is an authorized Adobe Connect Gold partner and wholly owned AASKI Technology company. For more information about CoSo, visit: http://cosocloud.com .\nAbout AASKI Technology\nAASKI Technology is headquartered in Tinton Falls, NJ and is a CMMI Development Maturity Level 3 rated and ISO 9001: 2008 certified company. AASKI Technology provides professional services for planning, designing, implementing, securing, and managing highly complex, mission-critical networks and systems. AASKI delivers complete lifecycle communications, infrastructure and support for the world's most demanding clients – from the U.S. Department of Defense, Department of Homeland Security, Defense Information Systems Agency, Defense Health Agency to leading communication service providers, and equipment manufacturers. These organizations have come to recognize our extraordinary expertise in delivering solutions that meet their objectives, mitigate their risks, and control all of their network-related costs. Learn more: http://www.aaski.com/about-us/\nContact: Chris Blake\n415-989-9000\nchris@msrcommunications.com\nView original content: http://www.prnewswire.com/news-releases/2017-a-banner-year-for-coso-cloud-300583480.html\nSOURCE CoSo Cloud", "external_links": ["http://www.cosocloud.com/", "http://www.prnewswire.com/news-releases/2017-a-banner-year-for-coso-cloud-300583480.html", "http://cosocloud.com/", "http://www.aaski.com/about-us/"], "published": "2018-01-17T01:38:00.000+02:00", "crawled": "2018-01-17T03:00:04.000+02:00", "highlightTitle": ""}