{"organizations": [], "uuid": "141f223f2f795f8ade205b48d847ba0f1f5bc18d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-china-biologic-announces-completion-of-acquisition-of-tianxinfu-from-pwm.html", "country": "US", "domain_rank": 767, "title": "China Biologic Announces Completion of Acquisition of TianXinFu from PWM", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.017, "site_type": "news", "published": "2018-01-03T14:00:00.000+02:00", "replies_count": 0, "uuid": "141f223f2f795f8ade205b48d847ba0f1f5bc18d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-china-biologic-announces-completion-of-acquisition-of-tianxinfu-from-pwm.html", "ord_in_thread": 0, "title": "China Biologic Announces Completion of Acquisition of TianXinFu from PWM", "locations": [], "entities": {"persons": [{"name": "gao", "sentiment": "none"}, {"name": "david (xiaoying", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "pwm beijing", "sentiment": "none"}], "organizations": [{"name": "china biologic products holdings", "sentiment": "negative"}, {"name": "tianxinfu (beijing) medical appliance co., ltd.", "sentiment": "none"}, {"name": "pw medtech group limited", "sentiment": "none"}, {"name": "stock exchange of hong kong limited", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING, Jan. 3, 2018 /PRNewswire/ -- China Biologic Products Holdings, Inc. (NASDAQ: CBPO) ( \"CBPO\" or the \"Company\"), a leading fully integrated plasma-based biopharmaceutical company in China, today announced that it has completed the acquisition of 80% equity interest in Tianxinfu (Beijing) Medical Appliance Co., Ltd. (\"TianXinFu\") from PW Medtech Group Limited (\"PWM\"), a company listed on The Stock Exchange of Hong Kong Limited (Stock Code: 1358). The transaction was first announced on October 12, 2017.\nMr. David (Xiaoying) Gao, Chairman and Chief Executive Officer of China Biologic, commented, \"We are pleased to welcome TianXinFu into the China Biologic family. We look forward to working with the team at TianXinFu to capitalize on the rapid growth of the regenerative medical bio-material industry in China while leveraging TianXinFu's extensive sales networks and professional marketing expertise to maximize growth opportunities for our plasma products. We believe this acquisition will create synergistic value to further solidify our core plasma leadership position in China.\"\nIn connection with the acquisition of TianXinFu, CBPO issued 5,521,000 ordinary shares to PWM, representing approximately 16.7% of the outstanding share capital of CBPO after taking into effect the new issuance.\nThe board of directors of CBPO has appointed Ms. Yue'e Zhang as a director of CBPO. Ms. Zhang currently serves as the chairman of the board of directors and an executive director of PWM.\nAbout China Biologic Products Holdings, Inc.\nChina Biologic Products Holdings, Inc. (NASDAQ: CBPO) is a leading fully integrated plasma-based biopharmaceutical company in China. The Company's products are used as critical therapies during medical emergencies and for the prevention and treatment of life-threatening diseases and immune-deficiency related diseases. China Biologic is headquartered in Beijing and manufactures over 20 different dosage forms of plasma products through its majority owned subsidiary, Shandong Taibang Biological Products Co., Ltd., and its wholly owned subsidiary, Guizhou Taibang Biological Products Co., Ltd. The Company also has an equity investment in Xi'an Huitian Blood Products Co., Ltd. The Company sells its products to hospitals, distributors and other healthcare facilities in China. For additional information, please see the Company's website www.chinabiologic.com .\nSafe Harbor Statement\nThis release contains certain \" \" within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical fact in this announcement are These statements are forward-looking in nature and subject to risks and uncertainties that may cause actual results to differ materially. All included in this release are based upon information available to CBPO as of the date of this release, which may change, and CBPO undertakes no obligation to update or revise any , except as may be required under applicable securities law.\nContact:\nChina Biologic Products Holdings, Inc.\nMr. Ming Yin\nSenior Vice President\nPhone: +86-10-6598-3099\nEmail: ir@chinabiologic.com\nICR Inc.\nMr. Bill Zima\nPhone: +86-10-6583-7511 or +1-646-405-5191\nE-mail: bill.zima@icrinc.com\nView original content: http://www.prnewswire.com/news-releases/china-biologic-announces-completion-of-acquisition-of-tianxinfu-from-pwm-300576822.html\nSOURCE China Biologic Products Holdings, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/china-biologic-announces-completion-of-acquisition-of-tianxinfu-from-pwm-300576822.html", "http://www.chinabiologic.com/"], "published": "2018-01-03T14:00:00.000+02:00", "crawled": "2018-01-03T13:58:11.002+02:00", "highlightTitle": ""}