{"organizations": [], "uuid": "641693694b32e8c0b6661c7ffec767eff42b5854", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 79, "shares": 79, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/28/104919225-GettyImages-899072864.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/eastern-us-braces-for-more-frigid-weather-ice-storms.html", "country": "US", "domain_rank": 767, "title": "Eastern US braces for more frigid weather, ice storms", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.837, "site_type": "news", "published": "2018-01-03T12:46:00.000+02:00", "replies_count": 0, "uuid": "641693694b32e8c0b6661c7ffec767eff42b5854"}, "author": "Getty Images", "url": "https://www.cnbc.com/2018/01/03/eastern-us-braces-for-more-frigid-weather-ice-storms.html", "ord_in_thread": 0, "title": "Eastern US braces for more frigid weather, ice storms", "locations": [], "entities": {"persons": [], "locations": [{"name": "science eastern us", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}, {"name": "new england", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}], "organizations": [{"name": "national weather service", "sentiment": "none"}, {"name": "nws", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Science Eastern US braces for more frigid weather, ice storms A record-shattering freeze kept its grip on much of the eastern United States, causing at least eight deaths and closing schools. Forecasters warned of a storm that could slam some areas with blizzard conditions later this week. Blizzards are possible across portions of eastern New England from late Thursday. Published 3 Hours Ago Getty Images A pedestrian crosses the street on December 27, 2017 in Chicago, Illinois. \nA record-shattering freeze kept its grip on much of the eastern United States on Tuesday, causing at least eight deaths and closing schools as forecasters warned of a storm that could slam some areas with blizzard conditions later this week. \nA mix of freezing rain, sleet and snow is forecast to fall in an area from northern Florida to South Carolina from Tuesday night, which could snarl transport. \nBlizzards are possible across portions of eastern New England from late Thursday, where some areas could see 12 to 15 inches (30-38 cm) of snow, the National Weather Service (NWS) said, adding an arctic air mass will remain entrenched over the eastern two thirds of the country through the end of the week. \nLate on Tuesday, Georgia Governor Nathan Deal declared a state of emergency for 28 counties after the National Weather Service issued the winter storm warning. \nBoston tied a 100-year-old record on Tuesday when it marked seven consecutive days of temperatures that did not top 20 degrees Fahrenheit (-6.7 degrees Celsius). Up and down the coast, people working outdoors struggled with the frigid conditions. \nIn New York City, Nayarit Delgrado, who promotes Times Square's Madame Tussauds wax museum by handing out discount cards to tourists, said her secret to enduring long days outdoors was resisting the urge to check the temperature on her mobile phone. \n\"I just don't want to know,\" said the 40-year-old Bronx resident, who said she was bundled up in layers and tugged back a cuff at her wrist to reveal a rainbow of sleeves. \nOfficials urged people across the northeast to alert social services if they saw people in jeopardy because of the cold. \n\"We want every resident to have shelter and warmth,\" Washington Mayor Muriel Bowser said on Twitter. \nThe major winter storm is expected to bring snow, ice, rain, strong winds, and tidal flooding to coastal locations from the southeast to New England into Thursday, the NWS said adding, \"hazardous travel is likely.\" \nThe weather service has issued a winter storm warning from northern Florida to North Carolina. Frozen South \nFlorida Governor Rick Scott on Tuesday urged residents in the northern part of the \"Sunshine State\" to prepare for the cold. His office said cold weather shelters have opened or are planning to open in 22 of the state's 67 counties. \nIn Texas, where two deaths have been linked to cold gripping large parts of the state, the frigid temperatures were expected to linger overnight, with a warm front moving in from Wednesday afternoon. \nSchool districts in Iowa, Massachusetts, Indiana, Ohio and North Carolina canceled or delayed classes. Water in a 750,000-gallon water tower in Evansdale, Iowa, froze for the first time, Mayor Doug Faas said in a telephone interview. \nThe cold was blamed for six deaths in Wisconsin, West Virginia, North Dakota and Michigan, where a Detroit man was believed to have frozen to death in front of a church, according to police and media reports from the localities. \nBut in many parts of Alaska, a state known for its harsh winters, the weather was unseasonably warm. On Tuesday, temperatures in Anchorage equaled a record daily high of 44 Fahrenheit (6.7 Celsius). \nThe warm spell that melted ice and snow forced sporting officials to use snow-making machines to cover a course with a blanket of the white stuff for the U.S. cross-country skiing national championships in the Anchorage area.", "external_links": [], "published": "2018-01-03T12:46:00.000+02:00", "crawled": "2018-01-03T13:15:51.001+02:00", "highlightTitle": ""}