{"organizations": [], "uuid": "3d8e0a2832c7356e6d8da0a665209f40186230f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-frutarom-implements-its-plan-for-the-full-merging-of-enzymotec-acceleration-of-its-growth-and-significant-improvement-to.html", "country": "US", "domain_rank": 767, "title": "Frutarom Implements its Plan for the Full Merging of Enzymotec, Acceleration of its Growth and Significant Improvement to its Profitability", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T17:01:00.000+02:00", "replies_count": 0, "uuid": "3d8e0a2832c7356e6d8da0a665209f40186230f9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-frutarom-implements-its-plan-for-the-full-merging-of-enzymotec-acceleration-of-its-growth-and-significant-improvement-to.html", "ord_in_thread": 0, "title": "Frutarom Implements its Plan for the Full Merging of Enzymotec, Acceleration of its Growth and Significant Improvement to its Profitability", "locations": [], "entities": {"persons": [], "locations": [{"name": "enzymotec", "sentiment": "none"}, {"name": "migdal ha’emek herzliya", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "advantage to leading international infant formula manufacturers", "sentiment": "none"}, {"name": "enzymotec ltd.", "sentiment": "none"}, {"name": "enzymotec", "sentiment": "none"}, {"name": "frutarom industries ltd.", "sentiment": "none"}, {"name": "vaya pharma", "sentiment": "none"}, {"name": "field of medical foods", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Frutarom is Selling Enzymotec’s Krill Oil Business, Which does not Constitute Part of its Core Activity, for approx. USD 26.4M\nMeasures are Being Implemented in the Field of Medical Foods (VAYA Pharma) which will contribute to Significant Cost Savings and Accelerated Growth of the Activity\nIn the Field of Infant Nutrition (InFat) the Year began on a Positive Note with the Support of New Regulatory Guidelines Taking Effect in China which provide an Advantage to Leading International Infant Formula Manufacturers, Many of Whom are Important Customers for this Activity\nAn Excellence Center for R&D and Innovation will be established at Enzymotec’s Plant in Migdal Ha’Emek\nHERZLIYA, Israel, Jan. 17, 2018 (GLOBE NEWSWIRE) -- Frutarom Industries Ltd. (“ Frutarom ”), one of the world's 10 largest companies in the field of flavors and natural specialty fine ingredients, reports that on Thursday, January 11, 2018 it completed its acquisition of full ownership of Enzymotec Ltd. whose ordinary shares had been traded on NASDAQ (under the symbol ENZY) (“ Enzymotec ”). Upon completion of the transaction, Enzymotec shares were delisted from trading on NASDAQ and it ceased to be a public company.\nFrutarom is working towards implementing the full merger plan of all Enzymotec activities through the rapid, efficient and comprehensive integration of both companies’ activities in the areas of management, R&D, sales and marketing, production and supply chain. In the framework of the merger and maximum streamlining, Frutarom’s Israeli headquarters will be combined with Enzymotec’s headquarters at Enzymotec’s modern plant in Migdal Ha’Emek and the full merger of Enzymotec activities with Frutarom’s global Natural Specialty Fine Ingredients Division has begun, with the fullest possible tapping of the many synergies existing between the activities, to accelerate growth, improve the cost structure and significantly improve the profitability of Enzymotec’s activity.\nEnzymotec activity will be focused on areas which Frutarom views as its main core activities, with emphasis on the growing and profitable fields of infant formula, elderly clinical nutrition, dietary supplements and pharmaceuticals, and will work towards accelerating growth in these fields which have significant business potential. As part of these measures, Frutarom announces the sale of Enzymotec’s krill oil business, which is not a core activity of Frutarom, to Aker BioMarine of Norway for approx. US$ 26.4 million. Aker BioMarine and Frutarom have established a strategic partnership in which Aker BioMarine will serve Frutarom's and Enzymotec’s nutraceutical krill oil customers.\nIn the medical foods activity (VAYA Pharma), measures are being implemented which will lead to significant cost savings, along with the addition of specialty Frutarom products to VAYA Pharma’s sales network in the United States, which will contribute to the acceleration of this activity’s growth. At the same time Frutarom continues to explore strategic alternatives for this activity.\nIn the field of infant nutrition (InFat), the year has begun on a positive note with the support of new regulatory guidelines taking effect in China which provide an advantage to international manufacturers and to leading local manufacturers of infant formula, many of whom are important customers for this activity.\nFrutarom has also begun taking steps towards building an excellence center of R&D and innovation at Enzymotec which will become a global base for the development of innovative technologies for natural specialty fine ingredients for the food and health spheres while combining and making maximum use of Enzymotec’s R&D infrastructure, also with the innovation incubator now being established by Frutarom after winning a tender of the Israel Innovation Authority.\nOri Yehudai, President and CEO of Frutarom Group , said: \"We are pleased to have completed the strategic acquisition of Enzymotec and are certain that joining Frutarom and Enzymotec brings about major and immediate growth opportunities to Enzymotec’s innovative product portfolio with the support of Frutarom’s global capabilities, and thereby creating significant value.\n“Upon completion of the transaction, we have begun carrying out plans for fully merging Enzymotec activities with Frutarom to enable the rapid, efficient and comprehensive integration of the global activities of both companies in the areas of management, R&D, sales and marketing, production and supply chain, along with streamlining, significant cost savings and optimum utilization of Enzymotec’s modern plant in which approx. US$ 40 million has been invested, and the pipeline of new products developed at an investment of approx. US$ 30 million in Enzymotec’s R&D labs over recent years,” said Mr. Yehudai . “As part of the merger plan, Frutarom’s headquarters in Israel will be combined with that of Enzymotec at its modern plant in Migdal Ha’Emek.\n“We are working towards focusing Enzymotec on the growing and profitable fields which we view as its core activities, accelerating the profitable growth of Frutarom’s and Enzymotec’s joint activities and on fully exploiting the significant cross-selling opportunities inherent in the acquisition, expanding Enzymotec’s business into additional countries and to many other Frutarom customers and expanding the product portfolio to the existing customer base of both companies,” said Mr. Yehudai . “As part of this plan, today we announced the sale of Enzymotec’s krill oil business.”\nIn conclusion, Mr. Yehudai said: \"We are working on seeking out and executing additional acquisitions of companies and activities in our fields of activity, with special focus on high-growth markets and natural products in the field of taste and health, and we have a strong pipeline of potential strategic acquisitions. We will continue carrying out our rapid profitable growth strategy, which is based on profitable internal growth and strategic acquisitions, in order to achieve the targets we recently set: sales of at least US$ 2.25 billion with an EBITDA margin of 23% in our core activities by the year 2020.”\nAbout Frutarom\nFrutarom (LSE:FRUT) (TASE:FRUT) is a leading global company operating in the global flavors and natural fine ingredients markets. Frutarom has significant production and development centers on all six continents and markets and sells over 70,000 products to more than 30,000 customers in over 150 countries. Frutarom’s products are intended mainly for the food and beverages, flavor and fragrance extracts, pharmaceutical, nutraceutical, health food, functional food, food additives and cosmetics industries.\nFrutarom, which employs over 5,000 people worldwide, has 2 main core activities:\nThe Flavors Activity which develops, produces and markets flavor compounds and food systems; The Specialty Fine Ingredients Activity, which develops, produces and markets natural flavor extracts, natural functional food ingredients, natural pharma/nutraceutical extracts, natural algae-based biotechnical products, natural food colors, natural antioxidants that provide solutions for natural food protection, aroma compounds, essential oils and unique citrus products. The Specialty Fine Ingredients products are sold primarily to the food and bev", "external_links": ["https://www.globenewswire.com/Tracker?data=8yzoz2W-XDrxRy9uIwEHeuBNXbC75dCtv63zcAsaN2SsOOHEw5K0gUvrR_2Q4oQZXGWS-wtPWZWDB-FwDWfmGg==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/97495ac6-19b7-419d-8cbd-9cb068d746ee", "https://www.globenewswire.com/Tracker?data=2WRv-zeaVfx5qDpRLfnaXgUAJtpHXQf9Ngty1vQoGUs7nQRx5qRBU1cEOleGQJ46LOOaoqtiCYZzen2vsdywfQ=="], "published": "2018-01-17T17:01:00.000+02:00", "crawled": "2018-01-17T19:15:07.005+02:00", "highlightTitle": ""}