{"organizations": [], "uuid": "520025ee9cef30a087773e3a85c2655a41b709f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/domesticNews/", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-massachusetts-education-lawsuit/u-s-says-massachusetts-cannot-sue-student-loan-servicer-idUSKBN1EZ210", "country": "US", "domain_rank": 408, "title": "U.S. says Massachusetts cannot sue student loan servicer", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T17:49:00.000+02:00", "replies_count": 0, "uuid": "520025ee9cef30a087773e3a85c2655a41b709f8"}, "author": "", "url": "https://www.reuters.com/article/us-massachusetts-education-lawsuit/u-s-says-massachusetts-cannot-sue-student-loan-servicer-idUSKBN1EZ210", "ord_in_thread": 0, "title": "U.S. says Massachusetts cannot sue student loan servicer", "locations": [], "entities": {"persons": [{"name": "nate raymond", "sentiment": "none"}, {"name": "healey", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "maura healey", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "pennsylvania higher education assistance agency", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "suffolk county superior court", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON (Reuters) - The U.S. Justice Department has filed papers arguing Massachusetts’s attorney general cannot pursue claims that one of the nation’s largest student loan servicers undermined a federal debt forgiveness program.\nThe move came ahead of a hearing on Wednesday in the lawsuit against the Pennsylvania Higher Education Assistance Agency and after the industry lobbied the Trump administration to block states from bringing actions against loan servicers.\nThe Justice Department in a motion filed in Suffolk County Superior Court in Boston on Monday argued the state law claims Massachusetts Attorney General Maura Healey was pursuing were preempted by federal law including the Higher Education Act.\n“This result is necessary to preserve the important federal interests in cost-effectively and uniformly administering and streamlining the federal student loan programs,” Justice Department lawyers wrote.\nHealey’s office had no comment on Wednesday. A lawyer for PHEAA declined to comment. The Justice Department did not respond to a request for comment.\nIn August, Healey, a Democrat, sued PHEAA, which does business as FedLoan Servicing and manages over a fourth of the nation’s $1.4 trillion student loan debt on behalf of various lenders.\nThe lawsuit accused PHEAA of deceptive practices that caused public servants to lose benefits and financial assistance under two federal programs, including one that forgives borrowers’ debts if they work in public service for 10 years.\nThat program is the Public Service Loan Forgiveness. The other is the Teacher Education Assistance for College and Higher Education Grant program, which provides grants to borrowers pursuing careers as teachers in low-income schools for at least four years.\nAccording to Healey’s lawsuit, PHEAA has prevented borrowers from making qualifying monthly payments that count toward loan forgiveness and also overcharged students.\nShe claimed PHEAA has failed to fix these servicing failures despite knowing of the problems. Her lawsuit seeks restitution to borrowers, penalties and an injunction.\nThe Justice Department’s motion came amid an industry backlash to enforcement actions and investigations pursued by states in recent years into the student loan servicing industry.\nIn July, the National Council of Higher Education Resources, an industry group, urged the U.S. Education Department to issue guidance making clear that federal rules preempt any state actions against federal student loan servicers.\nA group of 25 state attorneys general including Healey responded in an October letter urging Education Secretary Betsy DeVos to reject efforts to dismantle state oversight of the industry.\nReporting by Nate Raymond in Boston; Editing by Paul Simao\n ", "external_links": [], "published": "2018-01-10T17:49:00.000+02:00", "crawled": "2018-01-10T18:07:02.002+02:00", "highlightTitle": ""}