{"organizations": [], "uuid": "55aa8089af444179d8a0d5477094cf2f423c8f86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219658701&w=1200&r=LYNXMPEE0413E", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-football-nfl-nep/patriots-refute-talk-of-rift-we-stand-united-idUSKBN1EU1TJ", "country": "US", "domain_rank": 408, "title": "Patriots refute talk of rift: 'We stand united'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T20:08:00.000+02:00", "replies_count": 0, "uuid": "55aa8089af444179d8a0d5477094cf2f423c8f86"}, "author": "", "url": "https://www.reuters.com/article/us-football-nfl-nep/patriots-refute-talk-of-rift-we-stand-united-idUSKBN1EU1TJ", "ord_in_thread": 0, "title": "Patriots refute talk of rift: 'We stand united'", "locations": [], "entities": {"persons": [{"name": "bill belichick", "sentiment": "none"}, {"name": "tom brady", "sentiment": "none"}, {"name": "robert kraft", "sentiment": "none"}], "locations": [], "organizations": [{"name": "patriots", "sentiment": "none"}, {"name": "nfl", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "pingue", "sentiment": "none"}, {"name": "espn", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - New England Patriots quarterback Tom Brady, head coach Bill Belichick and owner Robert Kraft have all shot down a report that suggested a rift between them could soon bring an end to their successful run.\nAn ESPN report published on Friday said friction amongst the three most powerful members of the Patriots franchise, who last season won their fifth Super Bowl together, could be enough to make this the final season they work together.\n“For the past 18 years, the three of us have enjoyed a very good and productive working relationship,” the trio said in a joint statement. “In recent days, there have been multiple media reports that have speculated theories that are unsubstantiated, highly exaggerated or flat out inaccurate.”\nThe statement came hours after the ESPN article, which cites more than a dozen Patriots staffers, executives, players and NFL sources with knowledge of the team’s inner workings, said the trio have had serious disagreements.\nAccording to ESPN, the three men have been at odds for years over a number of issues, including Brady’s trainer and business partner Alex Guerrero having some team privileges removed and the team’s decision to trade backup quarterback Jimmy Garoppolo to the San Francisco 49ers for a second-round pick.\nDec 31, 2017; Foxborough, MA, USA; New England Patriots head coach Bill Belichick looks on during the second quarter against the New York Jets at Gillette Stadium. Mandatory Credit: Winslow Townson-USA TODAY Sports The article went as far as to say there is a “palpable sense in the building that this might be the last year together for this group.”\nThe Patriots, who are favorites to repeat as Super Bowl champions this season, are the top seed in the American Football Conference playoffs and will next play in the Divisional Round on Jan. 13 against either the Kansas City Chiefs, Tennessee Titans or Buffalo Bills.\n“The three of us share a common goal. We look forward to the enormous challenge of competing in the postseason and the opportunity to work together in the future, just as we have for the past 18 years,” the statement added.\n“It is unfortunate that there is even a need for us to respond to these fallacies. As our actions have shown, we stand united.”\nDon Yee, who is the agent for both Brady and Garoppolo, also weighed in on the report.\n“I don’t know really what to say — it’s tough to have a response since it didn’t appear to me to have one on-the-record Quote: ,” Yee said in a statement issued to the NFL Network’s Tom Pelissero. “All I can suggest is don’t believe everything you read.”\nReporting by Frank Pingue in Toronto; Editing by Christian Radnedge\n ", "external_links": [], "published": "2018-01-05T20:08:00.000+02:00", "crawled": "2018-01-05T20:20:03.001+02:00", "highlightTitle": ""}