{"organizations": [], "uuid": "957c3eb2d381f1a410d165cb524b7717a1f2ca41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-solaris-increases-liquidity-to-support-future-growth-provides-operational-update-and-schedules-fourth-quarter-2017.html", "country": "US", "domain_rank": 767, "title": "Solaris Increases Liquidity to Support Future Growth, Provides Operational Update and Schedules Fourth Quarter 2017 Conference Call", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T01:07:00.000+02:00", "replies_count": 0, "uuid": "957c3eb2d381f1a410d165cb524b7717a1f2ca41"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-solaris-increases-liquidity-to-support-future-growth-provides-operational-update-and-schedules-fourth-quarter-2017.html", "ord_in_thread": 0, "title": "Solaris Increases Liquidity to Support Future Growth, Provides Operational Update and Schedules Fourth Quarter 2017 Conference Call", "locations": [], "entities": {"persons": [{"name": "kyle ramachandran", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "kingfisher transload facility", "sentiment": "none"}, {"name": "solaris oilfield infrastructure, inc.", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Release Highlights\nClosed $70 million credit facility, including $20 million revolver and $50 million delayed draw term loan Commenced commercial operations at Kingfisher Transload Facility with first proppant rail shipment Forecasting 96 to 98 mobile proppant management systems in fleet by end of first quarter 2018; up from 77 at year-end 2017 Fourth quarter and full year 2017 conference call scheduled for Wednesday, March 7, 2018 at 7:30 a.m. Central Time (8:30 a.m. Eastern Time)\nHOUSTON--(BUSINESS WIRE)-- Solaris Oilfield Infrastructure, Inc. (NYSE: SOI) (“Solaris” or the “Company”) today announced that the Company has entered into a new credit agreement with certain lenders. The credit facility has a term of four years, is composed of a $20 million revolver and a $50 million delayed draw term loan and is undrawn. Solaris currently has more than $120 million of liquidity, including availability under the credit facility.\nSolaris’ Chief Financial Officer Kyle Ramachandran commented, “The increased borrowing capacity, combined with our cash balance, provides ample liquidity to not only fund the expansion of our rental fleet and finance the completion of phase one of the Kingfisher Facility, but also enhanced flexibility to execute on additional opportunities we may identify in the market.”\nThe credit facility syndicate is composed of Woodforest National Bank (“Woodforest”), Cadence Bank, N.A., Community Bank of Texas, N.A. and Credit Suisse AG, Cayman Islands Branch. Woodforest will serve as the administrative agent for the new Credit Facility. For further information regarding the credit facility, please refer to the Company’s current report on Form 8-K filed with the Securities and Exchange Commission today.\nOperational Update\nEarlier this month, Solaris commenced commercial operations at its Kingfisher Facility when it took delivery of its first rail shipment of proppant for its anchor tenant under a seven-year contract previously announced on August 2, 2017. Simultaneously, Solaris has completed the first phase of integration between its Railtronix and PropView™ inventory management systems, providing our customer full visibility from the mine to well site. Solaris announced the acquisition of Railtronix on December 11, 2017. Construction of the Kingfisher phase one build-out, including 30,000 tons of silo storage, is on budget and on track for completion by mid-2018.\nSolaris’ Chief Executive Officer Greg Lanham commented, “We are very excited about the progress we have made on the Kingfisher terminal. Our team is focused on providing exceptional service at the facility and ensuring phase one is completed on time and on or below budget.”\nSolaris ended 2017 with 77 mobile proppant management systems in the fleet, exceeding the previously provided forecast. Solaris currently has 81 systems in the rental fleet, all of which are deployed to customers, and expects to end first quarter 2018 with 96 to 98 systems in the fleet. Solaris has entered into 2018 term pricing and capacity arrangements with several customers and has secured take-or-pay arrangements on more than 40% of Solaris’ current fleet through 2018.\nLanham continued, “Our current backlog for 2018 is very strong. Driven by increased proppant loading levels and pad drilling activity, along with the execution and supply-chain logistics benefits that our systems provide to our customers, we are seeing rising demand, including for our 12-pack configuration. We have increased demand from our long-term customers, as well as a robust pipeline of orders from new customers, as we increase our total addressable market. Our operations team has once again stepped up to the challenge, increasing our manufacturing capacity from six systems per month to eight.”\nFourth Quarter and Full-Year 2017 Results Conference Call\nSolaris will host a conference call to discuss its fourth quarter and full year 2017 results on Wednesday, March 7, 2018 at 7:30 a.m. Central Time (8:30 a.m. Eastern Time). Solaris will issue its fourth quarter and full year 2017 earnings release and 2017 Form 10-K prior to the conference call.\nTo join the conference call from within the United States, participants may dial (844) 413-3978. To join the conference call from outside of the United States, participants may dial (412) 317-6594. When instructed, please ask the operator to be joined to the Solaris Oilfield Infrastructure, Inc. call. Participants are encouraged to log in to the webcast or dial in to the conference call approximately ten minutes prior to the start time. To listen via live webcast, please visit the Investor Relations section of the Company’s website, www.solarisoilfield.com .\nAn audio replay of the conference call will be available shortly after the conclusion of the call and will remain available for approximately seven days. It can be accessed by dialing (877) 344-7529 within the United States or (412) 317-0088 outside of the United States. The conference call replay access code is 10116267. The replay will also be available in the Investor Relations section of the Company’s website shortly after the conclusion of the call and will remain available for approximately seven days.\nAbout Solaris Oilfield Infrastructure, Inc.\nSolaris Oilfield Infrastructure, Inc. (NYSE: SOI) manufactures and provides patented mobile proppant management systems that unload, store and deliver proppant at oil and natural gas well sites. These patented systems are deployed in many of the most active oil and natural gas basins in the United States, including the Permian Basin, the Eagle Ford Shale, the STACK/SCOOP, the Marcellus Shale and the Haynesville Shale. Solaris’ high-capacity transload facility in Kingfisher, Oklahoma serves customers with operations in the STACK/SCOOP formation. Additional information is available on Solaris’ website, www.solarisoilfield.com .\nForward Looking Statements\nThis press release contains within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Examples of include, but are not limited to, outlook for the construction and operation of our new Kingfisher Facility, current and potential future long-term contracts and our future business and financial performance. Forward-looking statements are based on our current expectations and assumptions regarding our business, the economy and other future conditions. Because relate to the future, by their nature, they are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. As a result, our actual results may differ materially from those contemplated by the . Factors that could cause our actual results to differ materially from the results contemplated by such include, but are not limited to effectively integrating the acquisition of Railtronix’s assets and customer acceptance of our combined offerings and the factors discussed or referenced in our filings made from time to time with the SEC, including those described in our Registration Statement on Form S-1 (File No. 333-221389) filed with the Securities and Exchange Commission and declared effective on November 9, 2017. Readers are cautioned not to place undue reliance on , which speak only as of the date hereof. Factors or events that could cause our actual results to differ may emerge from time to time, and it is not possible for us to predict all of them. We undertake no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future developments or otherwise, except as may be required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006559/en/\nSolaris Oilfield Infrastructure, Inc.\nKyle Ramachandran, 281-501-3070\nChief Financial Officer\nIR@solarisoilfield.com\nSource: Solaris Oilfield Infrastructure, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.solarisoilfield.com&esheet=51747827&newsitemid=20180123006559&lan=en-US&anchor=www.solarisoilfield.com&index=1&md5=5ccfb5d176f2c9d9749b0239cc9a9c6a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.solarisoilfield.com&esheet=51747827&newsitemid=20180123006559&lan=en-US&anchor=www.solarisoilfield.com&index=2&md5=ad19b8faf6d1f699f6d6d7b0cf7eb2e3", "http://www.businesswire.com/news/home/20180123006559/en/"], "published": "2018-01-24T01:07:00.000+02:00", "crawled": "2018-01-24T01:23:31.000+02:00", "highlightTitle": ""}