{"organizations": [], "uuid": "6346567e5d1f466ff7a0b9232a31d8defb1bc164", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000666/device/rss", "section_title": "IPOs", "url": "https://www.cnbc.com/2018/01/11/reuters-america-hong-kong-london-new-york-shortlisted-for-aramco-ipo--sources.html", "country": "US", "domain_rank": 767, "title": "Hong Kong, London, New York shortlisted for Aramco - sources", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T17:48:00.000+02:00", "replies_count": 0, "uuid": "6346567e5d1f466ff7a0b9232a31d8defb1bc164"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/11/reuters-america-hong-kong-london-new-york-shortlisted-for-aramco-ipo--sources.html", "ord_in_thread": 0, "title": "Hong Kong, London, New York shortlisted for Aramco - sources", "locations": [], "entities": {"persons": [{"name": "mohammad bin salman", "sentiment": "none"}, {"name": "rania el gamal", "sentiment": "none"}, {"name": "alex lawler dubai/london", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "riyadh", "sentiment": "none"}], "organizations": [{"name": "aramco", "sentiment": "negative"}, {"name": "tadawul", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* International listing on one exchange or several, sources say\nFinal decision not made, rests with crown prince\n* Shortlist does not include Tokyo, Singapore, Toronto\n* IPO set for late 2018\nBy Rania El Gamal and Alex Lawler\nDUBAI/LONDON, Jan 11 (Reuters) - Saudi Arabia has shortlisted New York, London and Hong Kong - singly or in a combination of two or even all three - for the international portion of the listing of national oil company Aramco, two sources with knowledge of the discussions said.\nThe initial public offering (IPO) will also include the Saudi stock exchange, Tadawul, and is still set for late 2018, the sources said.\nThe shortlist means Tokyo, Singapore and Toronto are no longer in the running for what is likely to be the world's biggest IPO. Riyadh could raise as much as $100 billion in the sale of up to 5 percent of Aramco if it achieves a projected $2 trillion valuation.\nA final decision has yet to be made by Saudi Crown Prince Mohammad bin Salman, who oversees the kingdom's economic and oil policies, the sources said.\nOne of the sources said a phased listing was being considered, with the local listing occurring first, followed by an international listing or listings at a later stage.\nThe second source said it was possible that Aramco would be listed on all three international exchanges, as well as the Saudi bourse, but cautioned that no decision had been taken.\nThe first source said discussions involved listing on at least two of the three venues.\n\"As far as Aramco goes, late 2018 remains the objective and the plan and everything is moving to deliver that,\" the first source said.\nSaudi Aramco said in response to a Reuters request for comment: \"A range of listing options continue to be held under active review. However, no decision has been taken.\"\nThe Aramco listing is a centrepiece of Vision 2030, an ambitious reform plan championed by Prince Mohammad to reduce the dependence of the Saudi economy on oil.\nSaudi officials have left the door open to other options for the Aramco IPO, including listing exclusively on Tadawul and a domestic listing coupled with a private placement to a strategic investor as a precursor to an international IPO.\nChina has offered to buy up to 5 percent of Saudi Aramco directly, sources told Reuters in October. Senior industry sources say Riyadh is keen on China, its biggest buyer of oil, becoming a cornerstone investor in the company.\nThe chief executive of the Saudi stock exchange, Khalid al-Hussan, told Reuters on Wednesday he believed Tadawul could handle the entirety of the IPO despite having a capitalisation of about $450 billion in total.\n\"As an exchange, it is natural for us to aspire to be the only place for listing and we are taking all necessary measures to be ready for that, if that is the decision. We are waiting for the decision,\" he said in a telephone interview.\nSaudi Arabia changed Aramco to a joint-stock company as of Jan. 1. A senior Aramco source told Reuters the change was \"a customary step in the preparation process\" for an IPO in Saudi Arabia.\nThe change also indicated the listing was moving ahead despite market speculation it could be delayed or totally shelved. (Editing by Sonya Hepinstall)", "external_links": [], "published": "2018-01-11T17:48:00.000+02:00", "crawled": "2018-01-12T16:47:39.003+02:00", "highlightTitle": ""}