{"organizations": [], "uuid": "e143f47feb4b21f6f94d165919a5b2709cdd9ba0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-future-farm-signs-definitive-agreement-to-acquire-blockchain-cryptocurrency-application-for-cannabis-payment-platform.html", "country": "US", "domain_rank": 767, "title": "Future Farm Signs Definitive Agreement to Acquire Blockchain Cryptocurrency Application for Cannabis Payment Platform", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.978, "site_type": "news", "published": "2018-01-19T16:00:00.000+02:00", "replies_count": 0, "uuid": "e143f47feb4b21f6f94d165919a5b2709cdd9ba0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-future-farm-signs-definitive-agreement-to-acquire-blockchain-cryptocurrency-application-for-cannabis-payment-platform.html", "ord_in_thread": 0, "title": "Future Farm Signs Definitive Agreement to Acquire Blockchain Cryptocurrency Application for Cannabis Payment Platform", "locations": [], "entities": {"persons": [{"name": "bitcoin", "sentiment": "none"}, {"name": "litecoin", "sentiment": "none"}, {"name": "coinbase", "sentiment": "none"}], "locations": [{"name": "british columbia", "sentiment": "none"}, {"name": "ethereum", "sentiment": "none"}, {"name": "litecoin", "sentiment": "none"}, {"name": "square", "sentiment": "none"}], "organizations": [{"name": "acquire blockchain cryptocurrency application for cannabis payment platform vancouver", "sentiment": "negative"}, {"name": "future farm technologies inc.", "sentiment": "negative"}, {"name": "apple", "sentiment": "none"}, {"name": "new england ccs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Vancouver, British Columbia, Jan. 19, 2018 (GLOBE NEWSWIRE) -- Future Farm Technologies Inc. (the “Company” or “Future Farm”) ( CSE: FFT ) ( OTCQB: FFRMF ) is pleased to announce it has entered into a definitive agreement with New England CCS to acquire a 51% stake in FlipCoin, a new cryptocurrency application and Point of Sale (POS) platform – similar to Square – for cannabis dispensaries. The FlipCoin application, which has been in development for over six months, is expected to go live in the next three weeks and will allow dispensaries to be able to accept Bitcoin, Ethereum, Bitcoin Cash, or Litecoin as payment. Along with Future Farm’s current portfolio of projects, New England CCS expects to install this application in nine of its portfolio of dispensaries in 2018, as well as white label the application for dispensaries globally.\nThe FlipCoin application and platform will soon be integrated with Coinbase, the most-downloaded app in Apple's App Store with over 13 million accounts. Coinbase is the largest broker exchange of Bitcoin , Bitcoin Cash , Ethereum , Litecoin , and other digital assets with fiat currencies in 32 countries. Coinbase is expected to continue adding more than 100,000 new daily sign-ups for the foreseeable future.\n“Making the choice to integrate with Coinbase was easy because it gives us a potential userbase of 13 million people on day one,” comments Brett Fish, FlipCoin’s developer. “As Coinbase adds more digital currencies to its platform we will add them to our platform, whether that means Ripple, Dash, or Cardano. We envision a future in which buying cannabis with cryptocurrency is the norm.”\nDue to current federal law in the United States, dispensaries are locked out of even the most basic tools of doing business, such as opening a checking account and accepting credit cards. Security risks also loom large, particularly theft and accounting fraud, which naturally come with handling and storing large amounts of cash. This is a huge problem for an industry, which is expected to hit $24 billion by 2025 (according to New Frontier Data, a cannabis market research and analytics firm).\n“Under current US Federal law, dispensaries are un-bankable,” comments Bill Gildea, CEO of Future Farm. “As the industry has grown, an expensive problem for dispensaries has emerged. We believe the unique nature of cryptocurrencies – based on fast, secure, and proven blockchain technology – has the potential to be a game-changer by solving this multi-billion-dollar problem.”\nAs consideration for Future Farm receiving a 51% stake in FlipCoin, Future Farm agrees to issue 120,000 shares of its common stock to FlipCoin’s owner and developer, New England CCS. Future Farm also agrees to issue 10,000 shares of its common stock to Derek Ross as a finder’s fee.\nFor further information, contact William Gildea at 617.834.9467.\nOn behalf of the Board,\nFuture Farm Technologies Inc.\nWilliam Gildea, CEO & Chairman\nAbout Future Farm\nFuture Farm Technologies Inc. is a Canadian company with projects throughout North America including California, Florida and Maryland. The Company’s business model includes developing and acquiring technologies that will position it as a leader in the evolution of Controlled Environment Agriculture (CEA) for the global production of various types of plants, with a focus on cannabis. Future Farm provides scalable, indoor CEA systems that utilize minimal land, water and energy regardless of climate, location or time of year and are customized to grow an abundance of crops close to consumers, therefore minimizing food miles and its impact to the environment. The Company holds an exclusive, worldwide license to use a patented vertical farming technology that, when compared to traditional plant production methods, generates yields up to 10 times greater per square foot of land. The contained system provides many other benefits including 90% less water, fertilizer and land used, less travel costs, seed to sale security, scalability, consistency due to year-round production, cost control, product safety and purity by eliminating environmental variability . The Company also utilizes a leading cannabis oil extraction technology, which enables the Company to process 20lbs/hour of cannabis plant to yield approximately 908 grams/hour of oil.\nThe Company is also in the business of designing and distributing LED lighting solutions utilizing the COB and MCOB technology. The Company is focused on delivering cost efficient lighting to North America via advanced e-commerce sites the Company owns and operates. LEDCanada.com , which caters to B2B customers, is a supplier of the newest and highest demand LED solutions. The Company also owns and operates COBGrowlights.com , which caters to both large and small agriculture green houses and controlled cultivation centers.\nThe Company recently acquired the exclusive right to use a patented, augmented reality (AR) technology in the cannabis industry. As described in more detail above, the Company has decided to spin this asset off to its shareholders.\nNeither the Canadian Securities Exchange nor its Market Regulator (as that term is defined in the policies of the Canadian Securities Exchange) accepts responsibility for the adequacy or accuracy of this release. The Canadian Securities Exchange has not in any way passed upon the merits of the proposed transaction and has neither approved nor disapproved the contents of this press release.\nThis news release may include forward-looking statements that are subject to risks and uncertainties. All statements within, other than statements of historical fact, are to be considered forward looking. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results or developments may differ materially from those in forward-looking statements. Factors that could cause actual results to differ materially from those in forward-looking statements include market prices, exploitation and exploration successes, continued availability of capital and financing, and general economic, market or business conditions. There can be no assurances that such statements will prove accurate and, therefore, readers are advised to rely on their own evaluation of such uncertainties. We do not assume any obligation to update any forward-looking statements except as required under the applicable laws.\nWilliam Gildea, CEO & Chairman 617-834-9467 bill@futurefarmtech.com\nSource:Future Farm Technologies Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=_vtwVE1RrU1_hLPch6kOt7mqSaKHMuCpu_m8QZc5cFnFEwffJ7EDsHPQuv1sgI72iu5b6QWocwbJGXxzZ0DozgbBlXNrgMS7mDODHAvYUPQ=", "https://www.globenewswire.com/Tracker?data=1Cny4GNp5EGVDL1zx-_e9_jggIIlmwA8HswWhF1kbx_lmXqWOq44er4IFT-ml_9wRNMMZ99tHIovEeJKGXRESlQARcJOIPcjAWgdmDzyWJ4=", "https://www.globenewswire.com/Tracker?data=_vtwVE1RrU1_hLPch6kOt1THHrUtZU8b2sqFRr8RSFBKx-_uS_gpKVxoKqacgGbv-42FZJfpnP9HyQfbvTFwSXnp8N-8gKEF_0RYGyTsMcc=", "https://www.globenewswire.com/Tracker?data=lejJBwmaIrnXfHuZPGNsaKwWQzvLiYHqQDHYflwk4Rsn6JehNc4jd2sB2KaDTtQvmQ-KJjxzE21w7hRZ5Q5Q1MsKE8R6yhd_zzG2245Lwdk=", "https://www.globenewswire.com/Tracker?data=v6nmWDlu3r6paiX92eYJLdP0bBRN_VOcFRkhWyRuwAcMH8mBnpHQNNJYM76Aj9lugGDv5LCIgyYybgBMWfY1q55wVKg3xWdzcmGHGba32SQ=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/d08fdb19-7b3d-4487-9fc9-7ec9164a3c2f"], "published": "2018-01-19T16:00:00.000+02:00", "crawled": "2018-01-19T16:05:29.007+02:00", "highlightTitle": ""}