{"organizations": [], "uuid": "17b4aeb218878428c94d3ddcd2ebb88547696c88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104964627-PG_brands.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/24/pg-slashes-ad-budget-by-750-million-and-agencies-by-50-percent.html", "country": "US", "domain_rank": 767, "title": "Procter & Gamble saves $750 million on advertising, reduces agencies", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.934, "site_type": "news", "published": "2018-01-24T17:54:00.000+02:00", "replies_count": 0, "uuid": "17b4aeb218878428c94d3ddcd2ebb88547696c88"}, "author": "Lucy Handley", "url": "https://www.cnbc.com/2018/01/24/pg-slashes-ad-budget-by-750-million-and-agencies-by-50-percent.html", "ord_in_thread": 0, "title": "Procter & Gamble saves $750 million on advertising, reduces agencies", "locations": [], "entities": {"persons": [{"name": "marc pritchard", "sentiment": "none"}, {"name": "jon moeller", "sentiment": "none"}, {"name": "moeller", "sentiment": "none"}], "locations": [], "organizations": [{"name": "procter & gamble", "sentiment": "negative"}, {"name": "p&g", "sentiment": "none"}, {"name": "procter and gamble", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com SHARES \nOne of the world's biggest advertising spenders is reducing its ad budgets and cutting the number of agencies it works with by 50 percent, and plans to bring more media planning and buying in-house. \nProcter & Gamble 's Chief Financial Officer Jon Moeller said the company had already reduced ad agency and production costs by $750 million and expected to save another $400 million \"in the next phase.\" \nSpeaking on the company's second-quarter earnings call Tuesday, Moeller added that P&G currently works with 2,500 agencies and plans to reduce this to 1,250. \n\"We need the contribution of creative talent and are prepared to pay for that. We don't need some of the other components of the cost. We will move to more 'fixed and flow' arrangements with more open sourcing of creative talent and production capability, driving greater local relevance, speed, and quality at lower costs,\" he stated. show chapters 11:02 AM ET Tue, 23 Jan 2018 | 01:54 \nLast April, P&G's Chief Brand Officer Marc Pritchard said the business wanted to run fewer ad campaigns. \"We've cut the amount of work we do, but we can go much further by focusing on fewer and better ideas that last longer. We get tired of ads a lot faster than consumers do,\" he told an industry conference . \nPritchard has previously warned the media planning and buying industry to clean up its act or risk losing P&G's business. On Tuesday's earnings call, Moeller said improving \"media transparency\" had led to it reducing wasted advertising while increasing the number of people it reaches. \n\"There is more opportunity to eliminate waste by reducing excess frequency within and across channels, eliminating non-viewable ads, and stopping ads served to bots or adjacent to inappropriate content. Through these efforts, we've been able to eliminate waste and cut losses, while simultaneously increasing reach the number of consumers we're actually connecting with by about 10 percent,\" he said. \nTotal net sales for the quarter were $17.4 billion, a 3 percent increase year-over-year, but P&G said it is dealing with retailers buying fewer products and discounting them. Its baby, feminine and family care division, including Pampers diapers, dropped 1 percent. Competitor Kimberly-Clark, which makes Huggies diapers and Kleenex, said Tuesday it will cut around 5,000 jobs globally. \nClarification: This story has been updated to reflect the fact that P&G has saved $750 million on advertising costs. ", "external_links": [], "published": "2018-01-24T17:54:00.000+02:00", "crawled": "2018-01-24T19:05:39.030+02:00", "highlightTitle": ""}