{"organizations": [], "uuid": "e578bbfc4e9e668db11ffd6b48df0c158933be90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.newslookup.com/rss/newslookup-usnp.rss", "section_title": "US Newspapers: National", "url": "https://www.reuters.com/article/usa-results-outlook/explainer-investors-to-scour-outlooks-for-u-s-companies-tax-cut-plans-idUSL1N1P01A4", "country": "US", "domain_rank": 408, "title": "EXPLAINER-Investors to scour outlooks for U.S. companies&apos; tax cut plans", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T08:00:00.000+02:00", "replies_count": 0, "uuid": "e578bbfc4e9e668db11ffd6b48df0c158933be90"}, "author": "", "url": "https://www.reuters.com/article/usa-results-outlook/explainer-investors-to-scour-outlooks-for-u-s-companies-tax-cut-plans-idUSL1N1P01A4", "ord_in_thread": 0, "title": "EXPLAINER-Investors to scour outlooks for U.S. companies&apos; tax cut plans", "locations": [], "entities": {"persons": [{"name": "caroline valetkevitch", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "sam", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "walmart", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 6:00 AM / Updated 3 minutes ago EXPLAINER-Investors to scour outlooks for U.S. companies' tax cut plans Caroline Valetkevitch 5 Min Read \nNEW YORK, Jan 12 (Reuters) - Corporate results for 2017’s final quarter will start pouring in next week and are expected to be laden with one-time charges as U.S. companies begin to cope with tax code changes, including a one-time tax on trillions of dollars in profits held overseas. \nWall Street investors will be tuned in to chief executives’ statements about plans for 2018 and beyond for savings that will result from a deep cut in corporate income taxes enacted last month by the U.S. Congress and President Donald Trump. \nSome investors expect many companies will use their tax savings to buy back shares and increase dividends, while others will look for increased capital spending or wage increases. \nWalmart announced on Thursday that it will raise entry-level wages for hourly employees, partly because of tax cuts. It also said it would lay off thousands of workers and close dozens of Sam’s Club stores. \nThe tax law was Trump’s first major legislative achievement since he took office in January last year, and it slashes the corporate income tax rate to 21 percent from 35 percent. \nThe tax package, approved despite the unanimous opposition of Democrats, helped drive stock market gains in the last months of 2017. The momentum has continued in 2018, and there are widespread expectations that investors will overlook fourth-quarter charges and focus on upbeat corporate outlooks. \n“What you’ll see is companies will take a one-time hit, but it’s not going to have a bearing on stock price movements,” said David Katz, chief investment officer at Matrix Asset Advisors in New York. “They will talk about 2018, and we feel pretty confident it will be a win to a big win for U.S. companies.” \nEstimates for 2018 S&P 500 earnings have risen more than 2 percentage points since the beginning of the year, partly due to analysts factoring in the impact of the tax code changes. \nProfit growth for the year is forecast at 14.2 percent, according to Thomson Reuters data, while analysts expect fourth-quarter earnings to have risen 11.8 percent from a year ago. WINNERS IN ENERGY \nThe energy sector is expected to post the biggest year-over-year gain in earnings. Estimates have risen in recent weeks following a surge in oil prices, which this week climbed to their highest level in three years. \nIn the short term, many companies are expected to take one-time charges against earnings because of the tax bill, which includes a one-time tax on an estimated $2.6 trillion in profits held offshore by multinationals. \nAmong early reporters, Delta Air Lines said on Thursday that it was taking a one-time charge of $150 million on tax code changes. It said the new tax law would lower its tax rate to between 22 percent and 24 percent in 2018, and that it expects the tax cuts to help drive business demand. Delta’s stock rose on Thursday, as did other airlines’ shares. \nUnder the new law, companies with earnings parked offshore will face a one-time tax of 15.5 percent on cash and equivalents and 8 percent on illiquid assets, payable over eight years. \nIn the future, domestic corporate profits will be taxed at 21 percent, while most foreign profits will no longer be taxed, within some limits. The new law also allows companies to write off immediately the full value of new capital investments. BANKS TO ADJUST \nBanks and other companies will need to remeasure the value of their deferred tax assets and liabilities at the new tax rate, a note from strategists at Goldman Sachs said. \nFor instance, JPMorgan Chase & Co,, which will be the first big bank to give results when it reports on Friday, could show a 35 percent plunge in net income from a year earlier, based on analysts’ estimates. \nTechnology and healthcare companies are sitting on the largest stash of overseas cash and are expected to post the biggest charges related to the one-time repatriation tax, Goldman strategists wrote. \nApple “will incur the largest tax bill of any company under the provision, owing $33 billion on its $216 billion of overseas cash,” they wrote. \nAs a group, the technology sector, which led the market’s rally in 2017, is expected to benefit less from the tax rate cut than most other sectors, analysts said. Reporting by Caroline Valetkevitch; Editing by Kevin Drawbaugh and Daniel Wallis", "external_links": [], "published": "2018-01-12T08:00:00.000+02:00", "crawled": "2018-01-12T08:13:40.008+02:00", "highlightTitle": ""}