{"organizations": [], "uuid": "f56e76a62f03f62c921c84892760a06bc9e6c609", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/29/reuters-america-update-5-oil-dips-but-still-set-for-strongest-january-in-five-years.html", "country": "US", "domain_rank": 767, "title": "UPDATE 5-Oil dips but still set for strongest January in five years", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T16:04:00.000+02:00", "replies_count": 0, "uuid": "f56e76a62f03f62c921c84892760a06bc9e6c609"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/29/reuters-america-update-5-oil-dips-but-still-set-for-strongest-january-in-five-years.html", "ord_in_thread": 0, "title": "UPDATE 5-Oil dips but still set for strongest January in five years", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Brent oil has risen more than 6 percent in January\n* Speculators bet on higher prices but potential for correction\n* U.S. production to hit 10 million bpd soon (Adds comment, updates prices)\nLONDON, Jan 29 (Reuters) - Oil eased below $70 a barrel on Monday   OPEC and Russia to tighten supplies, but prices were still on track for their strongest start to the year in five years.\nBrent crude futures were down by 77 cents to $69.75 a barrel at 1338 GMT, while U.S. West Texas Intermediate (WTI) crude futures were 44 cents lower at $65.70 a barrel.\nSo far this month, the Brent has risen by 6.3 percent, making this its biggest rise in January since 2013.\nA key driver has been the dollar, which has had six consecutive weeks of losses and is set to fall 3 percent on a monthly basis.\nA falling dollar tends to support oil, which is priced in the U.S. currency, by making it cheaper for holders of other currencies.\nSupport for crude prices has also come from a large premium in the front-month Brent oil contract over those for future delivery, as investment in crude futures and options reached a new record high last week.\nOil consumption is growing rapidly as a result of growth in major economies, while OPEC and its allies have repeated their commitments to output restraint.\nOn Monday, Iraq's oil minister told a Chatham House conference in London that the oil market was improving, helped by an OPEC output deal, and that the country would comply with the cuts even though it is trying to increase its oil export capacity.\n\"Speculative financial investors in the energy sector are betting on further price rises. Net long positions in Brent were increased by an additional 13,892 to a record 579,260 contracts in the week to 23 January,\" analysts at Commerzbank said.\nSuch activity has been fuelled by risk appetite and further market tightening but there is considerable potential for price corrections, they added.\nDespite generally bullish sentiment, analysts said the market had been dented by rising output in North America.\n\"We believe that todays oil prices project a too rosy picture, stick to our cautious view, and view the market as being at risk from profit-taking,\" Julius Baer's head of macro and commodity research Norbert Ruecker said.\nU.S. output <C-OUT-T-EIA> has grown by more than 17 percent since mid-2016, reaching 9.88 million barrels per day (bpd) in mid-January. It is expected to exceed 10 million bpd soon.\nU.S. energy firms added 12 drilling rigs for new production in the week to Jan. 26, taking the total to 759, Baker Hughes reported.\nU.S. production is now on par with top exporter and OPEC kingpin Saudi Arabia. Only Russia produces more, averaging 10.98 million bpd in 2017.\n(Additional reporting by Henning Gloystein and Amanda Cooper; Editing by Alison Williams, Edmund Blair and Jane Merriman)", "external_links": [], "published": "2018-01-29T16:04:00.000+02:00", "crawled": "2018-01-29T17:43:00.000+02:00", "highlightTitle": ""}