{"organizations": [], "uuid": "82a9ea72158345087dd865f46b9fc2773fb10f22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221364498&w=1200&r=LYNXMPEE0B0BH", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-china-economy-trade/chinas-trade-boom-hits-speed-bump-as-december-imports-growth-slows-sharply-idUSKBN1F10K3", "country": "US", "domain_rank": 408, "title": "UPDATE 2-China's trade boom hits speed bump as Dec imports growth slows sharply", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T08:49:00.000+02:00", "replies_count": 0, "uuid": "82a9ea72158345087dd865f46b9fc2773fb10f22"}, "author": "", "url": "https://www.reuters.com/article/us-china-economy-trade/chinas-trade-boom-hits-speed-bump-as-december-imports-growth-slows-sharply-idUSKBN1F10K3", "ord_in_thread": 0, "title": "UPDATE 2-China's trade boom hits speed bump as Dec imports growth slows sharply", "locations": [], "entities": {"persons": [{"name": "louis kuijs", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "oxford economics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - China’s exports and imports growth slowed in December after surging in the previous month, adding to signs of ebbing economic momentum as the government extends a crackdown on financial risks and factory pollution.\nA synchronized uptick in the global economy over the past year has been a boon to China and much of trade-dependent Asia, with Chinese exports in 2017 growing at their quickest pace in four years.\nThe sharp December imports slowdown, however, is raising concerns that the world’s second-biggest economy faces domestic-demand pressure as authorities turn off cheap credit and restrict speculative financing.\n“We have since long expected China’s domestic demand and imports to slow in 2018 on gradually tighter monetary and financial policies and slower real estate activity momentum”, said Louis Kuijs, head of Asia economics at Oxford Economics in Hong Kong.\nIn December, exports rose 10.9 percent from a year earlier, beating analysts’ forecast of a 9.1 percent increase, but cooling from a robust 12.3 percent gain in November, the General Administration of Customs said on Friday.\nImports grew at an even slower pace of 4.5 percent year-on-year last month, the weakest since they rose 3.1 percent in December 2016, and way below forecasts of 13.0 percent growth. They had boomed 17.7 percent in the previous month.\nDespite the December slowdown, the overall picture for 2017 underscored strong global appetite for Chinese products ranging from electronics, household appliances and a vast array of consumer goods.\nExports from the Asian giant for the full year rose 7.9 percent, the fastest rate since 2013, while imports also gained a sizzling 15.9 percent - the best since 2011, thanks to insatiable Chinese demand for commodities.\nSLOWING DOMESTIC DEMAND But customs spokesman Huang Songping on Friday cautioned that strong growth in foreign trade would be difficult for China to maintain, adding that half of the growth rate in the value of imports last year was from higher prices.\nThe weaker imports in December backs recent data showing a slowdown in economic growth is underway, with domestic demand hit by the government’s intensified war on polluting factories and a crackdown on debt risks.\nCommodities imports were mixed, with copper purchases down 8.2 percent year-on-year by volume in December while coal and natural gas imports were up. Iron ore imports for the year hit a record high of 1.075 billion tonnes.\nFILE PHOTO: Chinese national flags flutter near a steel factory in Wu'an, Hebei province, China, February 23, 2017. REUTERS/Thomas Peter/File Photo Economists estimated that China’s import growth in December was entirely due to prices, with volumes down year-on-year.\nGrowth of China’s imports of electronic and high-tech products year-on-year slowed to single digits from over 15 percent the previous month, customs data showed.\n“We estimate that import volumes fell 6.8 percent in seasonally adjusted m/m terms last month...Although the trade data are often volatile, this latest decline – the largest in almost two years – is a sign that domestic demand may have weakened at the end of last year,” Capital Economics Senior China Economist Julian Evans-Pritchard wrote in a note.\nThe import slowdown caused China’s December trade surplus to surge to $54 billion, the highest since January 2016, compared to forecasts for a $37 billion surplus in December from November’s $40.21 billion.\nPROTECTIONISM RISK On the monetary policy front, most analysts expect subdued inflation expectations to keep the People’s Bank of China from tightening too hard.\nEconomists say rising trade friction is a key risk for China.\nChina’s goods surplus with the United States, a sore spot in relations between the two nations, hit a record high of $275.81 billion last year - topping the previous record in 2015 of $260.8 billion. nB9N1OT022]\nThat came even as the overall surplus fell 17 percent to $422.5 billion, bringing the share of the U.S. portion of the surplus to 65 percent last year, up from 49 percent in 2016.\nChina’s excess production capacity has emerged as a major trade irritant for the world’s leading economic powers, prompting them to consider new steps to protect domestic industries and jobs from a flood of Chinese imports.\nU.S. President Donald Trump’s administration is also considering several unilateral tariff actions on steel, aluminum and China’s intellectual property practices likely to draw disputes from WTO members.\n“For 2018, we think solid global growth will likely provide some support for Chinese export growth,” Nomura economists wrote in a note.\n“However, later this year, we believe real effective exchange rate appreciation and an increase in U.S. protectionism could weigh on Chinese export growth, narrowing the trade surplus further.”\nReporting by Yawen Chen and Elias Glenn; additional reporting by Lusha Zhang; Editing by Shri Navaratnam\n ", "external_links": [], "published": "2018-01-12T08:49:00.000+02:00", "crawled": "2018-01-12T09:57:09.007+02:00", "highlightTitle": ""}