{"organizations": [], "uuid": "5e72e17f4e116be139ea632a7a75db4210d1d728", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-citizens-community-bancorp-inc-earns-1-point-3-million-for-first-fiscal-quarter-2018-raises-annual-dividend-25-percent-to-0.html", "country": "US", "domain_rank": 767, "title": "Citizens Community Bancorp, Inc. Earns $1.3 Million For First Fiscal Quarter 2018; Raises Annual Dividend 25% to $0.20 Per Share; Commercial/Ag Real Estate Loans Expand 5.5% Over Previous Quarter", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T00:17:00.000+02:00", "replies_count": 0, "uuid": "5e72e17f4e116be139ea632a7a75db4210d1d728"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-citizens-community-bancorp-inc-earns-1-point-3-million-for-first-fiscal-quarter-2018-raises-annual-dividend-25-percent-to-0.html", "ord_in_thread": 0, "title": "Citizens Community Bancorp, Inc. Earns $1.3 Million For First Fiscal Quarter 2018; Raises Annual Dividend 25% to $0.20 Per Share; Commercial/Ag Real Estate Loans Expand 5.5% Over Previous Quarter", "locations": [], "entities": {"persons": [], "locations": [{"name": "eau claire", "sentiment": "none"}, {"name": "wis.", "sentiment": "none"}], "organizations": [{"name": "citizens community bancorp, inc.", "sentiment": "neutral"}, {"name": "citizens community bancorp, inc", "sentiment": "neutral"}, {"name": "citizens community federal n.a.", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}, {"name": "wells financial", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EAU CLAIRE, Wis., Jan. 26, 2018 (GLOBE NEWSWIRE) -- Citizens Community Bancorp, Inc. (the \"Company\") (Nasdaq:CZWI) , the parent company of Citizens Community Federal N.A. (the “Bank”), today reported GAAP earnings increased to $1.34 million, or $0.23 per diluted share in Q1 fiscal 2018, compared to $940,000, or $0.18 per share one year earlier and a loss of $458,000, or ($0.08) one quarter earlier. The Q1 fiscal 2018 operations reflect a full quarter earnings impact from the Wells Financial acquisition, the decrease in tax rate due to Tax Cuts and Jobs Act (\"the Tax Act\") of 2017, offset by higher professional costs, severance costs, and a $275,000, or $0.05 per share additional one-time tax expense associated with the recently passed Tax Act discussed above. The quarter reflected continued growth in commercial/ag loans while indirect lending balances have declined.\nThe Board of Directors increased the annual cash dividend 25% to $0.20 per share over the annual dividend paid to holders of common stock in 2017. The dividend will be payable on March 8, 2018 to shareholders of record on February 9, 2018.\nCore earnings (non-GAAP) increased 140% to $1.8 million, or $0.30 per diluted share for Q1 fiscal 2018, compared to $0.7 million, or $0.14 per diluted share from the prior quarter. Q1 fiscal 2018 core earnings (non-GAAP) exclude modest merger and branch closure expenditures and the net impact of the Tax Act which are itemized on the accompanying financial table \"Reconciliation of GAAP Earnings (loss) and Core Earnings (non-GAAP)\".\nCore earnings is a non-GAAP measure that management believes enhances investors' ability to better understand the underlying business performance and trends related to core business activities. For a detailed reconciliation of GAAP to non-GAAP results, see the accompanying financial table \"Reconciliation of GAAP Earnings (loss) and Core Earnings (non-GAAP)\".\n“We continue to make progress in transforming our balance sheet composition, which is translating into stronger core earnings. Our commercial loan growth reflects our commercial bankers' successful calling efforts and the addition of new commercial and ag bankers to our team. The efforts to improve our funding sources and costs by increasing transaction oriented, core deposits continues,” said Stephen Bianchi, President and Chief Executive Officer. “Our commitment to expense management is ongoing as we use technology to automate and manage workflows, specifically in commercial banking.”\nQ1 Fiscal 2018 Financial Highlights: (at or for the periods ended December 31, 2017, compared to September 30, 2017 and /or December 31, 2016)\nGAAP net income reflected earnings of $1.34 million in Q1 fiscal 2018, compared to $940,000 from a year ago, and a loss of $458,000 in Q4 fiscal 2017.\nNet interest income increased 35.5% to $7.53 million in Q1 fiscal 2018, from $5.56 million in Q1 fiscal 2017 and 22.0% from $6.17 million one quarter earlier, largely due to the full quarter impact of the Wells acquisition.\nNet interest margin (NIM) expanded to 3.42% for the current quarter, compared to 3.36% for Q1 fiscal 2017 and 3.29% for Q4 fiscal 2017, largely due to the full quarter impact of the Wells acquisition.\nLoan loss provision increased to $100,000 in Q1 fiscal 2018 compared to no provisions one year earlier and decreased from $319,000 the previous quarter.\nTotal non-interest income increased 56% to $1.94 million in Q1 fiscal 2018, compared to $1.24 million in Q1 fiscal 2017 and 39% from $1.39 million one quarter earlier. Growth in non-interest income is being driven by the impact of the Wells acquisition which has resulted in higher deposit charges and increased loan fees and service charges due to gain on sale of residential loan income.\nTotal non-interest expense increased to $7.14 million for Q1 fiscal 2018 from $5.39 million for Q1 fiscal 2017 and declined from $7.91 million in Q4 fiscal 2017, largely due to lower merger and branch closure expenses, partially offset by a full quarter's expenses related to the Wells acquisition.\nNet loans were $725.1 million at December 31, 2017, compared to $543.0 million at December 31, 2016, reflecting the Wells acquisition and $727.1 million at September 30, 2017.\nTotal deposits were $741.1 million at December 31, 2017, compared to $535.1 million at December 31, 2016 and $742.5 million at September 30, 2017.\nThe allowance for loan and lease losses was 0.80% of total loans at December 31, 2017, compared to 1.08% one year earlier and 0.81% the preceding quarter. The lower ratio for Q1 fiscal 2018 relative to one year earlier was a result of the larger balance of loans related to the acquisition of Wells Financial that were recorded at fair values and therefore without provisions for loan losses.\nNonperforming assets were $14.2 million, or 1.50% of total assets at December 31, 2017, compared to $7.4 million, or 1.08% of total assets at December 31, 2016, and $14.1 million, or 1.49% of total assets at September 30, 2017. In the current quarter, the impact of paydowns on non-performing loans was offset by the transfer of an owned, closed branch acquired in the Wells acquisition.\nBank capital ratios exceeded regulatory guidelines for a well-capitalized financial institution under the Basel III regulatory requirements at December 31, 2017:\nCitizens\nCommunity\nFederal N.A. To Be Well Capitalized Under\nPrompt Corrective Action\nProvisions Total capital (to risk weighted assets) 13.4 % 10.0 % Tier 1 capital (to risk weighted assets) 12.5 % 8.0 % Common equity tier 1 capital (to risk weighted assets) 12.5 % 6.5 % Tier 1 leverage ratio (to adjusted total assets) 9.3 % 5.0 % Balance Sheet and Asset Quality Review\nTotal assets were $943.0 million at December 31, 2017, compared to $686.4 million at December 31, 2016, and $940.7 million at September 30, 2017. The increase in total assets from a year ago was primarily due to the acquisition of Wells Financial.\nLoan balances decreased slightly from the immediate prior quarter due to the pay down of indirect loans and one to four family real estate loans. Meanwhile, commercial real estate loans increased through originations outpacing loan pay downs. At December 31, 2017, commercial and agricultural real estate loans totaled 39.4% of the total loan portfolio versus 37.2% the prior quarter and 27.6% one year earlier. One to four family residential and home equity real estate loans represented 32.4% of the total loan portfolio versus 33.6% the prior quarter, while consumer related non-real estate loans totaled 17.0% of the total loan portfolio versus 18.5% the prior quarter.\nThe allowance for loan and lease losses was largely unchanged at December 31, 2017 and totaled $5.9 million, representing 0.80% of total loans, compared to $5.9 million and 0.81% of total loans at September 30, 2017. Net charged off loans totaled $183,000 for the first quarter ended December 31, 2017 compared to $151,000 for the quarter ended December 31, 2016.\nNonperforming assets were $14.2 million, or 1.50% of total assets at December 31, 2017 compared to $7.4 million, or 1.08% of total assets at December 31, 2016, and $14.1 million, or 1.49% of total assets at September 30, 2017. Included in nonperforming assets are approximately $5.1 million of REO properties acquired in the Wells Financial acquisition. Additionally, the level of other real estate owned increased to $7.0 million at December 31, 2017 from $6.0 million one quarter earlier due to the transfer of an owned, closed branch acquired in the Wells acquisition.\nDeposits totaled $741.1 million at December 31, 2017, compared to $535.1 million at December 31, 2016, and $742.5 million at September 30, 2017. Noninterest-bearing deposits increased to $78.7 million at December 31, 2017, compared to $75.3 million at September 30, 2017, and $47.5 million at December 31, 2016. Core deposits, excluding time deposits, increased to $452.5 million, or 61.1% of total deposits compared to $451.7 million at September 30, 2017, or 60.8% of total deposits.\nFederal Home Loan Bank (\"FHLB\") advances totaled $94.0 million at December 31, 2017, compared to $90.0 million at September 30, 2017. Other borrowings decreased slightly to $29.9 million at December 31, 2017, compared to $30.3 million at September 30, 2017. The Bank has used borrowings and equity capital to fund acquisitions of other financial institutions, branch closings and FHLB advances to support organic loan growth.\nTangible book value per share (non-GAAP) was $9.98 at December 31, 2017, compared to $11.09 at December 31, 2016, and $9.78 at September 30, 2017.\nCapital ratios for the Bank continued to remain well above regulatory requirements.\nReview of Operations\nNet interest income increased to $7.5 million for Q1 fiscal 2018, compared to $5.6 million for Q1 fiscal 2017 and $6.2 million on a linked quarter basis. The NIM increased to 3.42% for Q1 fiscal 2018, compared to 3.36% for the same quarter one year earlier and 3.29% for Q4 fiscal 2017. The increase in the net interest margin was supported by higher yields on loans and lower cost of funds.\nLoan yields increased to 4.72% for Q1 fiscal 2018 compared to 4.61% one year earlier and 4.59% for the immediately prior quarter. Meanwhile, deposit costs declined to 0.72% for Q1 fiscal 2018 from 0.89% one year earlier and 0.77% for Q4 fiscal 2017. Costs on the FHLB and other borrowings increased to 2.33% for Q1 fiscal 2018 from 1.37% one year earlier and 2.12% for the preceding quarter. “The improved net interest margin is largely due to the full quarter impact of the Wells merger along with the result of our changing balance sheet composition which reflects more direct lending of commercial related loans and funding the loans with lower cost deposits,” said Jim Broucek, Chief Financial Officer.\nFor Q1 fiscal 2018, provision for loan losses totaling $100,000 was recorded, responsive to organic loan growth. Net charge offs were $183,000 for Q1 fiscal 2018, compared to $151,000 for Q1 fiscal 2017. Allowance for loan and lease losses to total loans was 0.80%, at December 31, 2017, compared to 1.08% at December 31, 2016 and 0.81%, at September 30, 2017.\nTotal non-interest expense was $7.1 million for Q1 fiscal 2018 compared to $5.4 million for Q1 fiscal 2017 and $7.9 million for Q4 fiscal 2017. Total non-interest expense for the first quarter includes severance expense related to an executive departure and slightly higher professional fees.\nThe Tax Cuts and Jobs Act was enacted December 22, 2017, reducing the corporate Federal income tax rate for the Company from 34% to 24.5% in fiscal 2018 and 21% in fiscal 2019. Additionally, the Tax Act made other changes to U.S. corporate income tax laws. GAAP requires that the impact of the provisions of the Tax Act be accounted for in the period of enactment. The Company revalued its net deferred tax assets to account for the future impact of lower corporate tax rates. For the first quarter ended December 31, 2017, the Company recorded a one-time net tax charge of $275,000 related to the revaluation of the deferred assets related to both the revaluation of timing differences and the unrealized loss on securities. This increase in income tax expense was partially offset by an approximately $135,000 reduction in income tax expense due to a lower corporate tax rate.\nThese financial results are preliminary until the Form 10-Q is filed in February 2018.\nAbout the Company\nCitizens Community Bancorp, Inc. (NASDAQ: “CZWI”) is the holding company of Citizens Community Federal N.A., a national bank based in Altoona, Wisconsin, serving customers in Wisconsin, Minnesota and Michigan through 21 branch locations. Its primary markets include the Chippewa Valley Region in Wisconsin, the Twin Cities and Mankato, MN, and various rural communities around these areas. The company offers traditional community banking services to businesses, Ag operators and consumers, including one-to-four family mortgages. The company’s recently completed merger with Wells Federal Bank of Wells, MN expands its market share in Mankato and southern Minnesota and added seven branch locations along with expanded services through Wells Insurance Agency.\nCautionary Statement Regarding Forward-Looking Statements\nCertain statements contained in this release are considered “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. These statements may be identified by the use of forward-looking words or phrases such as “anticipate,” “believe,” “could,” “expect,” “intend,” “may,” “planned,” “potential,” “should,” “will,” “would” or the negative of those terms or other words of similar meaning. Such forward-looking statements in this release are inherently subject to many uncertainties arising in the operations and business environment of Citizens Community Federal N.A. (“CCFBank”). These uncertainties include the combined company’s ability to achieve the synergies and value creation contemplated by the transaction with Wells Financial; management’s ability to promptly and effectively integrate the businesses of the two companies; the diversion of management time on post acquisition integration issues; the effects of governmental regulation of the financial services industry; industry consolidation; technological developments and major world news events; general economic conditions, in particular, relating to consumer demand for CCFBank’s products and services; CCFBank’s ability to maintain current deposit and loan levels at current interest rates; competitive and technological developments; deteriorating credit quality, including changes in the interest rate environment reducing interest margins; prepayment speeds, loan origination and sale volumes, charge-offs and loan loss provisions; CCFBank’s ability to maintain required capital levels and adequate sources of funding and liquidity; maintaining capital requirements may limit CCFBank’s operations and potential growth; changes and trends in capital markets; competitive pressures among depository institutions; effects of critical accounting estimates and judgments; changes in accounting policies or procedures as may be required by the Financial Accounting Standards Board (FASB) or other regulatory agencies overseeing CCFBank; CCFBank’s ability to implement its cost-savings and revenue enhancement initiatives, including costs associated with its branch consolidation and new market branch growth initiatives; legislative or regulatory changes or actions or significant litigation adversely affecting CCFBank; fluctuation of the Company’s stock price; CCFBank's ability to attract and retain key personnel; CCFBank's ability to secure confidential information through the use of computer systems and telecommunications networks; and the impact of reputational risk created by these developments on such matters as business generation and retention, funding and liquidity. Shareholders, potential investors and other readers are urged to consider these factors carefully in evaluating the forward-looking statements and are cautioned not to place undue reliance on such forward-looking statements. Such uncertainties and other risks that may affect the Company’s performance are discussed further in Part I, Item 1A, “Risk Factors,” in the Company’s Form 10-K, for the year ended September 30, 2017 filed with the Securities and Exchange Commission (\"SEC\") on December 13, 2017 and the Company's subsequent filings with the SEC. The Company undertakes no obligation to make any revisions to the forward-looking statements contained in this news release or to update them to reflect events or circumstances occurring after the date of this release.\nNon-GAAP Financial Measures\nThis press release contains non-GAAP financial measures, which management believes may be helpful in understanding the Company's results of operations or financial position and comparing results over different periods. Non-GAAP measures eliminate the impact of certain one-time expenses such as acquisition and branch closure costs and related data processing termination fees, legal costs, severance pay, accelerated depreciation expense and lease termination fees and the net impact of the Tax Cuts and Jobs Act of 2017. Merger related charges represent expenses to either satisfy contractual obligations of acquired entities without any useful benefit to the Company or to convert and consolidate customer records onto the Company platforms. These costs are unique to each transaction based on the contracts in existence at the merger date. Where non-GAAP financial measures are used, the comparable GAAP financial measure, as well as the reconciliation to the comparable GAAP financial measure, can be found in this press release. These disclosures should not be viewed as a substitute for operating results determined in accordance with GAAP, nor are they necessarily comparable to non-GAAP performance measures that may be presented by other banks and financial institutions.\nContact: Steve Bianchi, CEO\n(715)-836-9994\nCITIZENS COMMUNITY BANCORP, INC. Consolidated Balance Sheets (unaudited) (in thousands) December 31,\n2017 September 30,\n2017 December 31,\n2016 Assets Cash and cash equivalents $ 47,215 $ 41,677 $ 20,444 Other interest bearing deposits 7,155 8,148 745 Securities available for sale \"AFS\" 96,548 95,883 81,136 Securities held to maturity \"HTM\" 5,227 5,453 6,235 Non-marketable equity securities, at cost 8,151 7,292 5,365 Loans receivable 730,918 732,995 548,904 Allowance for loan losses (5,859 ) (5,942 ) (5,917 ) Loans receivable, net 725,059 727,053 542,987 Loans held for sale 2,179 2,334 — Mortgage servicing rights 1,866 1,886 — Office properties and equipment, net 8,517 9,645 5,166 Accrued interest receivable 3,189 3,291 2,073 Intangible assets 5,287 5,449 829 Goodwill 10,444 10,444 4,663 Foreclosed and repossessed assets, net 7,031 6,017 784 Other assets 15,164 16,092 15,987 TOTAL ASSETS $ 943,032 $ 940,664 $ 686,414 Liabilities and Stockholders’ Equity Liabilities: Deposits $ 741,069 $ 742,504 $ 535,112 Federal Home Loan Bank advances 94,000 90,000 73,491 Other borrowings 29,899 30,319 11,000 Other liabilities 3,610 4,358 2,985 Total liabilities 868,578 867,181 622,588 Stockholders’ equity: Common stock— $0.01 par value, authorized 30,000,000; 5,883,603; 5,888,816 and\n5,261,170 shares issued and outstanding, respectively 59 59 53 Additional paid-in capital 63,348 63,383 54,983 Retained earnings 12,241 10,764 10,047 Unearned deferred compensation (391 ) (456 ) (205 ) Accumulated other comprehensive (loss) gain (803 ) (267 ) (1,052 ) Total stockholders’ equity 74,454 73,483 63,826 TOTAL LIABILITIES AND STOCKHOLDERS’ EQUITY $ 943,032 $ 940,664 $ 686,414\nCITIZENS COMMUNITY BANCORP, INC. Consolidated Statements of Operations (unaudited) (in thousands, except per share data)\nThree Months Ended December 31,\n2017 September 30,\n2017 December 31,\n2016 Interest and dividend income: Interest and fees on loans $ 8,721 $ 7,194 $ 6,530 Interest on investments 691 576 418 Total interest and dividend income 9,412 7,770 6,948 Interest expense: Interest on deposits 1,202 1,095 1,119 Interest on FHLB borrowed funds 261 217 173 Interest on other borrowed funds 422 286 99 Total interest expense 1,885 1,598 1,391 Net interest income before provision for loan losses 7,527 6,172 5,557 Provision for loan losses 100 319 — Net interest income after provision for loan losses 7,427 5,853 5,557 Non-interest income: Net gains on available for sale securities — 82 29 Service charges on deposit accounts 460 368 398 Loan fees and service charges 776 453 533 Other 703 488 283 Total non-interest income 1,939 1,391 1,243 Non-interest expense: Compensation and benefits 3,555 3,233 2,604 Occupancy 705 584 1,068 Office 438 443 281 Data processing 704 650 472 Amortization of intangible assets 162 100 43 Amortization of mortgage servicing rights 90 39 — Advertising, marketing and public relations 149 302 63 FDIC premium assessment 142 69 83 Professional services 688 860 401 Other 510 1,629 378 Total non-interest expense 7,143 7,909 5,393 Income (loss) before provision (benefit) for income taxes 2,223 (665 ) 1,407 Provision (benefit) for income taxes 883 (207 ) 467 Net income (loss) attributable to common stockholders $ 1,340 $ (458 ) $ 940 Per share information: Basic earnings (loss) $ 0.23 $ (0.08 ) $ 0.18 Diluted earnings (loss) $ 0.23 $ (0.08 ) $ 0.18 Cash dividends paid $ — $ — $ — Book value per share at end of period $ 12.65 $ 12.48 $ 12.13 Tangible book value per share at end of period (non-GAAP) $ 9.98 $ 9.78 $ 11.09 Note: Certain items previously reported were reclassified for consistency with the current presentation.\nReconciliation of GAAP Earnings (loss) and Core Earnings (non-GAAP):\nThree Months Ended December 31,\n2017 September 30,\n2017 December 31,\n2016 (Dollars in Thousands, except share data) GAAP earnings (loss) before income taxes $ 2,223 $ (665 ) $ 1,407 Merger related costs (1) 94 1,517 — Branch closure costs (2) 7 255 633 Core earnings before income taxes (3) 2,324 1,107 2,040 Provision for income tax on core earnings (4) 569 376 694 Core earnings after income taxes (3) $ 1,755 $ 731 $ 1,346 GAAP diluted earnings (loss) per share, net of tax $ 0.23 $ (0.08 ) $ 0.18 Merger related costs, net of tax 0.02 0.19 — Branch closure costs, net of tax — 0.03 0.07 Tax Cuts and Jobs Act of 2017 tax provision (5) 0.05 — — Core diluted earnings per share, net of tax $ 0.30 $ 0.14 $ 0.25 Average diluted shares outstanding 5,920,899 5,629,363 5,262,718 (1) Costs incurred are included as data processing, advertising, marketing and public relations, professional fees and other non-interest expense in the consolidated statement of operations.\n(2) Branch closure costs include severance pay recorded in compensation and benefits, accelerated depreciation expense and lease termination fees included in occupancy and other costs included in other non-interest expense in the consolidated statement of operations. In addition, other non-interest expense includes costs related to the valuation reduction of the Ridgeland branch office in the fourth quarter of fiscal 2017.\n(3) Core earnings is a non-GAAP measure that management believes enhances investors' ability to better understand the underlying business performance and trends related to core business activities.\n(4) Provision for income tax on core earnings is calculated at 24.5% for the three months ended December 31, 2017 and at 34% for all quarters in the prior fiscal year, which represents our federal statutory tax rate for each respective period presented.\n(5) As a result of the Tax Cuts and Jobs Act of 2017, we recorded a one-time net tax provision of $275 in December 2017, which is included in provision for income taxes expense in the consolidated statement of operations.\n(6) Reconciliation of tangible book value:\nTangible book value per share at end of period December 31,\n2017 September 30,\n2017 December 31,\n2016 Total stockholders' equity $ 74,454 $ 73,483 $ 63,826 Less: Goodwill (10,444 ) (10,444 ) (4,663 ) Less: Intangible assets (5,287 ) (5,449 ) (829 ) Tangible common equity (non-GAAP) $ 58,723 $ 57,590 $ 58,334 Ending common shares outstanding 5,883,603 5,888,816 5,260,098 Tangible book value per share (non-GAAP) $ 9.98 $ 9.78 $ 11.09 Nonperforming Assets:\nDecember 31, 2017\nand Three Months Ended September 30, 2017\nand Twelve Months Ended December 31, 2016\nand Three Months Ended Nonperforming assets: Nonaccrual loans 6,388 $ 7,452 $ 5,750 Accruing loans past due 90 days or more 739 589 894 Total nonperforming loans (“NPLs”) 7,127 8,041 6,644 Other real estate owned 6,996 5,962 655 Other collateral owned 35 55 129 Total nonperforming assets (“NPAs”) $ 14,158 $ 14,058 $ 7,428 Troubled Debt Restructurings (“TDRs”) $ 7,263 $ 5,851 $ 3,529 Nonaccrual TDRs $ 1,327 $ 621 $ 410 Average outstanding loan balance $ 731,957 $ 653,717 $ 561,672 Loans, end of period 730,918 732,995 548,904 Total assets, end of period 943,032 940,664 686,414 ALL, at beginning of period 5,942 6,068 6,068 Loans charged off: Residential real estate (24 ) (233 ) (43 ) Commercial/agriculture real estate (1 ) — — Consumer non-real estate (194 ) (389 ) (172 ) Commercial agriculture non-real estate — (9 ) — Total loans charged off (219 ) (631 ) (215 ) Recoveries of loans previously charged off: Residential real estate 13 14 3 Commercial/agriculture real estate — — — Consumer non-real estate 22 171 61 Commercial agriculture non-real estate 1 1 — Total recoveries of loans previously charged off: 36 186 64 Net loans charged off (“NCOs”) (183 ) (445 ) (151 ) Additions to ALL via provision for loan losses charged to operations 100 319 — ALL, at end of period $ 5,859 $ 5,942 $ 5,917 Ratios: ALL to NCOs (annualized) 800.41 % 1,335.28 % 979.64 % NCOs (annualized) to average loans 0.10 % 0.07 % 0.11 % ALL to total loans 0.80 % 0.81 % 1.08 % NPLs to total loans 0.98 % 1.10 % 1.21 % NPAs to total assets 1.50 % 1.49 % 1.08 % Nonaccrual Loans Rollforward:\nQuarter Ended December 31,\n2017 September 30,\n2017 June 30,\n2017 March 31,\n2017 December 31,\n2016 Balance, beginning of period $ 7,452 $ 6,035 $ 5,767 $ 5,750 $ 3,191 Additions 263 $ 488 557 308 3,433 Acquired nonaccrual loans — 1,449 — — — Charge-offs (74 ) (22 ) (12 ) (68 ) (150 ) Transfers to foreclosed and repossessed assets (46 ) (153 ) (109 ) (14 ) (220 ) Return to accrual status — — — — — Payments received (1,207 ) (345 ) (168 ) (209 ) (504 ) Other, net — — — — — Balance, end of period $ 6,388 $ 7,452 $ 6,035 $ 5,767 $ 5,750 Other Real Estate Owned Rollforward:\nQuarter Ended December 31,\n2017 September 30,\n2017 June 30,\n2017 March 31,\n2017 December 31,\n2016 Balance, beginning of period $ 5,962 $ 580 $ 648 $ 655 $ 725 Loans transferred in 57 $ 175 82 — 179 Acquired OREO — 5,343 — — — Branch properties transferred in 1,444 250 — — — Sales (394 ) (353 ) (150 ) — (249 ) Writedowns (16 ) (33 ) — (7 ) — Other, net (57 ) — — — — Balance, end of period $ 6,996 $ 5,962 $ 580 $ 648 $ 655 Troubled Debt Restructurings:\nDecember 31, 2017 September 30, 2017 December 31, 2016 Number of\nModifications Recorded\nInvestment Number of\nModifications Recorded\nInvestment Number of\nModifications Recorded\nInvestment Troubled debt restructurings: Residential real estate 33 $ 3,667 32 $ 3,678 30 $ 3,214 Commercial/Agricultural real estate 12 2,699 8 1,890 — — Consumer non-real estate 19 166 20 195 22 315 Commercial/Agricultural non-real estate 6 731 2 88 — — Total loans 70 $ 7,263 62 $ 5,851 52 $ 3,529 Loan Composition:\nDecember 31, 2017 September 30, 2017 December 31, 2016 Originated Loans: Residential real estate: One to four family $ 128,396 $ 132,380 $ 151,180 Purchased HELOC loans 16,968 18,071 — Commercial/Agricultural real estate: Commercial real estate 110,815 97,155 62,724 Agricultural real estate 11,580 10,628 4,803 Multi-family real estate 30,868 24,486 15,550 Construction and land development 12,682 12,399 12,812 Consumer non-real estate: Originated indirect paper 79,492 85,732 111,507 Purchased indirect paper 26,210 29,555 44,006 Other Consumer 14,465 14,496 17,851 Commercial/Agricultural non-real estate: Commercial non-real estate 39,594 35,198 20,803 Agricultural non-real estate 12,649 12,493 9,621 Total originated loans $ 483,719 $ 472,593 $ 450,857 Acquired Loans: Residential real estate: One to four family $ 92,681 $ 97,183 $ 24,884 Commercial/Agricultural real estate: Commercial real estate 60,828 62,807 28,444 Agricultural real estate 53,447 57,374 24,133 Multi-family real estate 1,708 1,742 — Construction and land development 7,156 7,309 2,710 Consumer non-real estate: Other Consumer 4,777 6,172 604 Commercial/Agricultural non-real estate: Commercial non-real estate 19,229 20,053 12,650 Agricultural non-real estate 11,061 11,380 4,466 Total acquired loans $ 250,887 $ 264,020 $ 97,891 Total Loans: Residential real estate: One to four family $ 221,077 $ 229,563 $ 176,064 Purchased HELOC loans 16,968 18,071 — Commercial/Agricultural real estate: Commercial real estate 171,643 159,962 91,168 Agricultural real estate 65,027 68,002 28,936 Multi-family real estate 32,576 26,228 15,550 Construction and land development 19,838 19,708 15,522 Consumer non-real estate: Originated indirect paper 79,492 85,732 111,507 Purchased indirect paper 26,210 29,555 44,006 Other Consumer 19,242 20,668 18,455 Commercial/Agricultural non-real estate: Commercial non-real estate 58,823 55,251 33,453 Agricultural non-real estate 23,710 23,873 14,087 Gross loans $ 734,606 $ 736,613 $ 548,748 Unearned net deferred fees and costs and loans in process 1,252 1,471 1,605 Unamortized discount on acquired loans (4,940 ) (5,089 ) (1,449 ) Total loans receivable $ 730,918 $ 732,995 $ 548,904 Deposit Composition:\nDecember 31,\n2017 September 30,\n2017 December 31,\n2016 Non-interest bearing demand deposits $ 78,685 $ 75,318 $ 47,463 Interest bearing demand deposits 149,058 147,912 50,779 Savings accounts 98,941 102,756 51,826 Money market accounts 125,831 125,749 125,923 Certificate accounts 288,554 290,769 259,121 Total deposits $ 741,069 $ 742,504 $ 535,112 Average balances, Interest Yields and Rates:\nThree months ended\nDecember 31, 2017 Three months ended\nSeptember 30, 2017 Three months ended\nDecember 31, 2016 Average\nBalance Interest\nIncome/\nExpense Average\nYield/\nRate (1) Average\nBalance Interest\nIncome/\nExpense Average\nYield/\nRate (1) Average\nBalance Interest\nIncome/\nExpense Average\nYield/\nRate (1) Average interest earning assets: Cash and cash equivalents $ 30,848 $ 67 0.86 % $ 32,692 $ 71 0.86 % $ 10,238 $ 12 0.47 % Loans receivable 733,203 8,721 4.72 % 621,530 7,194 4.59 % 561,519 6,530 4.61 % Interest bearing deposits 7,714 32 1.65 % 4,571 18 1.56 % 745 3 1.60 % Investment securities (1) 100,737 513 2.23 % 90,467 430 2.24 % 86,617 358 1.97 % Non-marketable equity securities, at cost 7,336 79 4.27 % 5,701 57 3.97 % 5,200 45 3.43 % Total interest earning assets $ 879,838 $ 9,412 4.27 % $ 754,961 $ 7,770 4.13 % $ 664,319 $ 6,948 4.19 % Average interest bearing liabilities: Savings accounts $ 96,230 $ 22 0.09 % $ 72,476 $ 21 0.11 % $ 43,743 $ 17 0.15 % Demand deposits 146,838 90 0.24 % 98,416 79 0.32 % 48,989 74 0.60 % Money market accounts 123,459 167 0.54 % 128,039 168 0.52 % 130,057 134 0.41 % CD’s 263,429 839 1.26 % 235,076 752 1.27 % 245,646 814 1.31 % IRA’s 34,992 84 0.95 % 31,302 75 0.95 % 29,000 80 1.09 % Total deposits $ 664,948 $ 1,202 0.72 % $ 565,309 $ 1,095 0.77 % $ 497,435 $ 1,119 0.89 % FHLB advances and other borrowings 116,359 683 2.33 % 93,978 503 2.12 % 78,841 272 1.37 % Total interest bearing liabilities $ 781,307 $ 1,885 0.96 % $ 659,287 $ 1,598 0.96 % $ 576,276 $ 1,391 0.96 % Net interest income $ 7,527 $ 6,172 $ 5,557 Interest rate spread 3.31 % 3.17 % 3.23 % Net interest margin 3.42 % 3.29 % 3.36 % Average interest earning assets to average interest bearing liabilities 1.13 1.15 1.15 (1) Fully taxable equivalent.\nCITIZENS COMMUNITY FEDERAL N.A. Selected Capital Composition Highlights (unaudited) December 31,\n2017 September 30,\n2017 December 31,\n2016 To Be Well Capitalized Under\nPrompt Corrective Action\nProvisions Total capital (to risk weighted assets) 13.4 % 13.2 % 14.7 % 10.0 % Tier 1 capital (to risk weighted assets) 12.5 % 12.4 % 13.5 % 8.0 % Common equity tier 1 capital (to risk weighted assets) 12.5 % 12.4 % 13.5 % 6.5 % Tier 1 leverage ratio (to adjusted total assets) 9.3 % 9.2 % 9.8 % 5.0 %\nSource:Citizens Community Bancorp, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/77068116-8351-43c8-b646-e07494e7ce6b"], "published": "2018-01-27T00:17:00.000+02:00", "crawled": "2018-01-27T02:23:05.017+02:00", "highlightTitle": ""}