{"organizations": [], "uuid": "5dce2fa79816fc3a2076455a59ca9cc613857e89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224228467&w=1200&r=LYNXMPEE0L1SR", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/britain-politics-ukip/britains-anti-eu-party-in-chaos-over-racist-messages-idINKBN1FB2J1", "country": "US", "domain_rank": 408, "title": "Britain's anti-EU party in chaos over racist messages", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T20:12:00.000+02:00", "replies_count": 0, "uuid": "5dce2fa79816fc3a2076455a59ca9cc613857e89"}, "author": "", "url": "https://in.reuters.com/article/britain-politics-ukip/britains-anti-eu-party-in-chaos-over-racist-messages-idINKBN1FB2J1", "ord_in_thread": 0, "title": "Britain's anti-EU party in chaos over racist messages", "locations": [], "entities": {"persons": [{"name": "meghan markle", "sentiment": "none"}, {"name": "harry", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "guy faulconbridge", "sentiment": "none"}, {"name": "farage", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": [{"name": "independence party", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 6:14 PM / Updated 25 minutes ago Britain's anti-EU party in chaos over racist messages Guy Faulconbridge 4 Min Read \nLONDON (Reuters) - The United Kingdom Independence Party, which transformed British politics by securing a referendum on EU membership, was close to meltdown on Monday over the fate of its leader, whose lover made racist comments about Prince Harry’s fiancee Meghan Markle. \nUnder Nigel Farage, UKIP became a significant force in British politics by convincing the government to call a national vote and then campaigning successfully for Britain to leave. \nBut since Farage quit, UKIP has descended into chaos, partly as its main objective - leaving the EU - is now the official policy of both the Conservative and Labour parties. \nFarage, a fan of U.S. President Donald Trump who has accused traditional politicians of failing voters, dismissed speculation that he may be plotting to create a new political party to ensure a full break with the EU. \n“No thoughts of a new party, whatever some may speculate,” Farage told Reuters. Asked if he would return to frontline politics, he said: “Doubt it.” \nFarage declined to comment on the confusion inside UKIP, whose leader Henry Bolton has refused to resign after his lover, Jo Marney, made offensive comments about Markle and black people in text messages to a friend. \nMarney, who began dating Bolton just after Christmas, described Markle, a U.S. actress whose father is white and mother African-American, as a “dumb little commoner” and said “her seed with (sic) taint our royal family”, according to the texts printed in a Sunday newspaper. \nMarney also described black people as ugly. She later apologised for the text messages and Bolton said they were ending their relationship. Henry Bolton, the leader of UKIP (United Kingdom Independence Party) gives a statement in Folkestone, Britain, January 22, 2018. REUTERS/Hannah McKay ‘DRAIN THE SWAMP’ \nWithout the charisma of Farage, a former metals trader who charmed right-wing media, UKIP has suffered. \nHis first successor, Diane James, resigned after just 18 days and her successor, Paul Nuttall, quit after UKIP won only 1.8 percent of votes in last June’s parliamentary election. \nBolton lost a vote of confidence from the party’s national executive committee on Sunday but told reporters in Folkestone, southern England, on Monday that “I shall not be resigning as party leader”. Bolton promised to “drain the swamp” of UKIP and remove those responsible for infighting. \n“During the next four weeks I shall be calling for the coordination and mobilisation of all Leave campaigns, to ensure that the government delivers full independence from the European Union,” he said. \nBolton has said Marney’s texts were abhorrent, unwise and offensive. \nUKIP’s deputy leader, Margot Parker, resigned in protest at Bolton’s refusal to go, the BBC reported. \nUnder Farage, UKIP had won nearly 4 million votes - a share of 12.6 percent - in the 2015 election on its anti-EU platform, projecting it to the forefront of British politics even though it only managed to win one seat in parliament. \nIts popularity prompted then-prime minister David Cameron, who once dismissed the party as being full of “fruitcakes, loonies and closet racists”, to hold the Brexit referendum. Reporting by Guy Faulconbridge; editing by Michael Holden and Kevin Liffey", "external_links": [], "published": "2018-01-22T20:12:00.000+02:00", "crawled": "2018-01-22T20:41:16.003+02:00", "highlightTitle": ""}