{"organizations": [], "uuid": "59e691084584682cf97d67f633916930cdcbe287", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/15/104901516-GettyImages-892695698-bitcoin.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/02/ceo-of-soaring-blockchain-stock-sells-about-870000-worth-of-the-shares.html", "country": "US", "domain_rank": 767, "title": "CEO of soaring 'blockchain' stock sells about $870,000 worth of the shares", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T22:33:00.000+02:00", "replies_count": 0, "uuid": "59e691084584682cf97d67f633916930cdcbe287"}, "author": "Evelyn Cheng", "url": "https://www.cnbc.com/2018/01/02/ceo-of-soaring-blockchain-stock-sells-about-870000-worth-of-the-shares.html", "ord_in_thread": 0, "title": "CEO of soaring 'blockchain' stock sells about $870,000 worth of the shares", "locations": [], "entities": {"persons": [{"name": "riot blockchain", "sentiment": "none"}, {"name": "o'rourke", "sentiment": "none"}, {"name": "john o'rourke", "sentiment": "none"}], "locations": [], "organizations": [{"name": "biop", "sentiment": "none"}, {"name": "u.s. securities and exchange commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The head of a small biotech company-turned-crypto has made hundreds of thousands of dollars in stock sales already.\nJohn O'Rourke, president, CEO and chairman of Riot Blockchain , disclosed in a Friday filing with the U.S. Securities and Exchange Commission that he sold 30,383 shares at a weighted average price of about $28.61 a share.\nThat means O'Rourke received a gross payout of $869,256, and made at least $712,000 on Riot's 600-plus percent price surge in the last few months on a name change to include \"blockchain.\" \nAnnouncements tying a company to the blockchain technology that also backs bitcoin has caused several tiny stocks to soar dramatically in the last several months. In December, bitcoin itself had briefly surged about 1,900 percent for the year. \n\nRiot Blockchain was once primarily a biotech company named \"Bioptix.\" In early October, the company announced it was changing its name to focus on blockchain-related investments, and shares soared. The company also changed its ticker symbol to RIOT from BIOP.\nThe stock climbed 648 percent from $5.16 at the end of September to a closing high of $38.60 on Dec. 19. As a result, the company's market value jumped from around $17 million this past summer to near $270 million in December 2017, according to FactSet.\nShares were trading about 2 percent lower near $27.80 on Tuesday. \nRiot lists three blockchain investments so far on its website: a Canadian digital currency exchange called Coinsquare, a cryptocurrency accounting firm called Verady, and Tesspay, which is planning to apply blockchain technology to telecom payments.\nIn the first nine months of 2017, Riot reported a net loss of $10.97 million.\nThe SEC declined to comment to CNBC. O'Rourke did not immediately respond to a CNBC email for comment. Riot did not immediately respond to an email and phone call for comment.\nO'Rourke's rapid ascent to the top of Riot Blockchain CEO O'Rourke rose to the head of Riot Blockchain in less than a year, public documents show. \nHe is a managing member of ATG Capital, which focuses on small and mid-cap growth companies. \nO'Rourke was appointed a director of Riot on Jan. 6, 2017. A few weeks after Riot's name change, an Oct. 23 release mentioned O'Rourke's \"recent appointment as President of the Company.\" \nRiot's board then appointed O'Rourke chairman and CEO on Nov. 3. Outgoing chairman and CEO Michael Beeghley's \"resignation was not the result of any disagreement with the Company,\" a filing said.\nThe board approved a monthly salary for O'Rourke of $25,000 — $300,000 a year — a restricted stock award of 344,000 shares of common stock that will vest in 24 monthly installments and the option to purchase up to 100,000 shares at $10. \nCitron Research, led by short seller Andrew Left, tweeted on Dec. 18 it was starting a short position, or a bet against, Riot shares. \nLeft said on CNBC's \" Fast Money \" a day later that Riot is \"misrepresenting\" the scale of its blockchain-related investments. Riot had turned down a CNBC request to appear on the show that day. \"No one at the company has been able to get in touch with the CEO,\" a Riot spokesperson said at the time. \nCitron Research tweeted on Dec. 22 that it was covering its short positions in Riot, and the Bitcoin Investment Trust (GBTC), because \"easy money has been made.\" Riot shares fell nearly 33 percent between Dec. 18 and Dec. 22. \nOn Dec. 27, two days before O'Rourke sold his shares, Riot postponed its shareholders meeting from Dec. 28 to Feb. 1 due to insufficient participation.", "external_links": [], "published": "2018-01-02T22:33:00.000+02:00", "crawled": "2018-01-02T22:54:01.007+02:00", "highlightTitle": ""}