{"organizations": [], "uuid": "e0439255c6a5d4438d321aca4149a04b6b33a151", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKCricketNews", "section_title": "Reuters: Cricket News", "url": "https://uk.reuters.com/article/cricket-ashes/cricket-australia-peg-back-england-after-rain-delay-idUKL4N1OZ1WH", "country": "US", "domain_rank": 408, "title": "Cricket-Australia peg back England after rain delay", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T06:56:00.000+02:00", "replies_count": 0, "uuid": "e0439255c6a5d4438d321aca4149a04b6b33a151"}, "author": "", "url": "https://uk.reuters.com/article/cricket-ashes/cricket-australia-peg-back-england-after-rain-delay-idUKL4N1OZ1WH", "ord_in_thread": 0, "title": "Cricket-Australia peg back England after rain delay", "locations": [], "entities": {"persons": [{"name": "pat cummins", "sentiment": "none"}, {"name": "mark stoneman", "sentiment": "none"}, {"name": "cook", "sentiment": "none"}, {"name": "dawid malan", "sentiment": "none"}, {"name": "joe root", "sentiment": "none"}, {"name": "nick mulvenney", "sentiment": "none"}, {"name": "josh hazlewood", "sentiment": "none"}, {"name": "alastair cook", "sentiment": "none"}, {"name": "james vince", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 4:57 AM / Updated 7 hours ago Cricket-Australia peg back England after rain delay Nick Mulvenney 3 Min Read \nSYDNEY, Jan 4 (Reuters) - Australia took two wickets in the hour before tea, including that of Alastair Cook, to leave England on 122 for three at the break on a rain-disrupted opening day of the fifth and final Ashes test on Thursday. \nCaptain Joe Root, who won the toss and elected to bat, and Dawid Malan will both resume after the break on 16 not out looking to bat long into the evening to give the tourists the chance of a consolation victory. \nAfter the opening session had been washed out by light rain, Mark Stoneman and James Vince both made starts under brightening skies before being caught behind off quick Pat Cummins. \nCook made 244 not out in the drawn Melbourne test last week and looked to be creeping assiduously towards another big tally when Josh Hazlewood intervened. \nWith the former England captain on 39 and just five runs from becoming the sixth batsman to score 12,000 test runs, the big paceman fired down a fullish delivery that rapped the 33-year-old on the front pad. \nA loud shout for lbw was turned down by umpire Joel Wilson but skipper Steve Smith reviewed immediately with the TV tracking removing any doubt about the ball pitching outside leg and forcing the decision to be reversed. \nAt 3-0 down in the series with the Ashes already relinquished, England are playing for pride and they continued to show plenty of it even if their batting technique can sometimes be questioned. \nLefthander Stoneman survived an early pace barrage and hit a couple of powerful drives for boundaries in his 24 before a rising Cummins delivery took a thick edge off his bat and gave wicketkeeper Tim Paine a simple catch. \nVince was on 25, having put on 60 with Cook, when his attempt at cutting a wide Cummins delivery resulted in a thick top edge which Paine gratefully snaffled up behind the stumps. \nBoth teams made one change to their sides with England handing leg spinner Mason Crane his test debut in place of injured all-rounder Chris Woakes. \nAustralia brought left-arm pace spearhead Mitchell Starc back into the side after he missed the drawn fourth test in Melbourne because of a bruised heel. (Editing by John O‘Brien)", "external_links": [], "published": "2018-01-04T06:56:00.000+02:00", "crawled": "2018-01-04T10:58:34.001+02:00", "highlightTitle": ""}