{"organizations": [], "uuid": "e9ed4f6271927120c4478b8974db5224dfc2e5c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-2018-resolution-create-a-budget-that-actually-succeeds.html", "country": "US", "domain_rank": 767, "title": "2018 Resolution: Create a Budget That Actually Succeeds", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-17T20:01:00.000+02:00", "replies_count": 0, "uuid": "e9ed4f6271927120c4478b8974db5224dfc2e5c5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-2018-resolution-create-a-budget-that-actually-succeeds.html", "ord_in_thread": 0, "title": "2018 Resolution: Create a Budget That Actually Succeeds", "locations": [], "entities": {"persons": [{"name": "jill schlesinger", "sentiment": "none"}, {"name": "schlesinger", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "bureau of economic analysis", "sentiment": "none"}, {"name": "cfp", "sentiment": "none"}, {"name": "cfp board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan. 17, 2018 /PRNewswire-USNewswire/ -- Right after the new year begins, many Americans are creating new budgets for 2018. Being realistic and accurate can ensure those budgets have long-term success, according to Senior CFP Board Ambassador Jill Schlesinger, CFP®.\nIf the budget process is onerous from the start, Americans are unlikely to return to the plans they've developed when life interrupts with an unanticipated expense. The average American saves less than 4 percent of his or her income, according to the Bureau of Economic Analysis . The low savings rate, which is an average, disguises an even worse reality for some people. More than half of all Americans have less than $1,000 in a savings account that could help them in an emergency, according to a GOBankingRates survey .\n\"Psychologists note that change requires new thinking,\" Schlesinger said. \"Instead of hyper-focusing on the budget itself, remind yourself why you are doing what you are doing – these goals are YOUR goals, what you are trying to accomplish. Don't forget to celebrate the small wins and if you fall off the wagon, re-focus your efforts, be mindful and get back on track.\"\nIn her latest contribution to LetsMakeAPlan.org , Schlesinger offered a list of financial goals to help people start creating a financial plan. She also offered tips to help Americans carve money from their spending to save and invest.\nPay down consumer (credit card balances or auto loans) and student debt Establish an emergency reserve fund of six to 12 months of living expenses Maximize retirement savings (the 2018 limit for 401(k)s, 403(b)s and 457 plans is $18,500 or $24,500 if you are over age 50; the limit for Traditional or Roth IRAs is $5,500, $6,500 for those over age 50. If you are self-employed, the limits are higher.) Fund a 529-education fund (now expanded via the tax plan, to include private or parochial school for up to $10,000 a year in tuition and other expenses) Establish a general investment account to fund anything from a second home to an accelerated path to retirement\nA CERTIFIED FINANCIAL PLANNER™ professional can help a family develop a budget that can accommodate life events.\nABOUT CFP BOARD\nThe mission of Certified Financial Planner Board of Standards, Inc. is to benefit the public by granting the CFP ® certification and upholding it as the recognized standard of excellence for competent and ethical personal financial planning. The Board of Directors, in furthering CFP Board's mission, acts on behalf of the public, CFP ® professionals and other stakeholders. CFP Board owns the certification marks CFP ® , CERTIFIED FINANCIAL PLANNER™, CFP ® (with plaque design) and CFP ® (with flame design) in the U.S., which it awards to individuals who successfully complete CFP Board's initial and ongoing certification requirements. CFP Board currently authorizes more than 80,000 individuals to use these marks in the U.S.\nView original content: http://www.prnewswire.com/news-releases/2018-resolution-create-a-budget-that-actually-succeeds-300584009.html\nSOURCE Certified Financial Planner Board of Standards, Inc.", "external_links": ["https://www.bea.gov/newsreleases/national/pi/2017/pdf/pi0617_hist.pdf", "https://www.gobankingrates.com/saving-money/half-americans-less-savings-2017/", "http://www.letsmakeaplan.org/", "http://www.prnewswire.com/news-releases/2018-resolution-create-a-budget-that-actually-succeeds-300584009.html"], "published": "2018-01-17T20:01:00.000+02:00", "crawled": "2018-01-17T21:27:51.000+02:00", "highlightTitle": ""}