{"organizations": [], "uuid": "322e60232adc1f94111fe993bc0e335648368efe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000811/device/rss", "section_title": "Jobless Claims", "url": "https://www.cnbc.com/2018/01/11/reuters-america-wrapup-1-u-s-producer-prices-fall-jobless-claims-up-for-fourth-straight-week.html", "country": "US", "domain_rank": 767, "title": "WRAPUP 1-U.S. producer prices fall; up for fourth straight week", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T16:20:00.000+02:00", "replies_count": 0, "uuid": "322e60232adc1f94111fe993bc0e335648368efe"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/11/reuters-america-wrapup-1-u-s-producer-prices-fall-jobless-claims-up-for-fourth-straight-week.html", "ord_in_thread": 0, "title": "WRAPUP 1-U.S. producer prices fall; up for fourth straight week", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "labor department", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "week@\n* Producer price index dips 0.1 percent in December\n* PPI rises 2.6 percent on year-on-year basis\n* Core PPI edges up 0.1 percent; up 2.3 percent year-on-year\n* Weekly jobless claims increase 11,000\nWASHINGTON, Jan 11 (Reuters) - U.S. producer prices fell for the first time in nearly 1-1/2 years in December amid declining costs for services, which could temper expectations that inflation will accelerate in 2018.\nOther data on Thursday showed the number of Americans filing for unemployment increasing for the fourth straight week to more than a three-month high. That probably does not signal weakness in the labor market as bitter cold and snow in parts of the country likely kept some workers at home.\nStill, weak inflation at the producer level could add to concerns that the factors restraining inflation could become more persistent and result in the Federal Reserve being more cautious about raising interest rates this year.\nThe Labor Department said on Thursday its producer price index for final demand slipped 0.1 percent last month. That was the first drop in the PPI since August 2016 and followed two straight monthly increases of 0.4 percent.\nIn the 12 months through December, the PPI rose 2.6 percent after accelerating 3.1 percent in November. Economists polled by Reuters had forecast the PPI rising 0.2 percent last month and increasing 3.0 percent from a year ago.\nA key gauge of underlying producer price pressures that excludes food, energy and trade services edged up 0.1 percent last month. The so-called core PPI increased 0.4 percent in November. It rose 2.3 percent in the 12 months through December. The core PPI was up 2.4 percent in the 12 months through November.\nThe PPI data came on the heels of a report on Wednesday showing a sharp moderation in import prices in December. Economists are hoping that a tightening labor market and recent weakness in the dollar will lift inflation towards the Fed's 2 percent target this year.\nThe U.S. central bank's preferred inflation measure, the personal consumption expenditures (PCE) price index excluding food and energy, has undershot its target since May 2012. The greenback lost 7 percent of its value against the currencies of the United States' main trading partners last year.\nThe Fed raised interest rates three times in 2017. Its forecast of three rate hikes for this year will depend on the inflation outlook.\nThe dollar fell to a session low against a basket of currencies after the data. Prices of U.S. Treasuries were trading lower while U.S. stock index futures were marginally higher.\nSTRONG LABOR MARKET\nLast month, the price of services fell 0.2 percent after rising for nine straight months. That reflected a 10.7 percent drop in margins for automotive fuels and lubricants retailing.\nWholesale food prices recorded their biggest drop since May, while energy prices were unchanged. The cost of healthcare services increased 0.2 percent last month after being unchanged in November. Those costs feed into the core PCE price index.\nIn a second report on Thursday, the Labor Department said initial   September. Economists had  \nA large part of the country faced   rose by  \nClaims have risen since mid-December, though the data tend to be volatile during year-end holidays.\n \n  Last week, the four-week moving average of initial claims, considered a better measure of labor market trends as it irons out week-to-week volatility, rose 9,000 to 250,750.\nThe continuing low level of claims suggests a strong labor market. The pace of job growth is, however, expected to slow this year as the labor market hits full employment. Nonfarm payrolls increased by 148,000 jobs in December after surging by 252,000 jobs in November. (Reporting by Lucia Mutikani; Editing by Paul Simao)", "external_links": [], "published": "2018-01-11T16:20:00.000+02:00", "crawled": "2018-01-12T01:33:09.009+02:00", "highlightTitle": ""}