{"organizations": [], "uuid": "1fcb6b5f270fb8e6de12bf83fa6c06ff24b1e360", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-first-midwest-bancorp-inc-announces-2017-fourth-quarter-and-full-year-results.html", "country": "US", "domain_rank": 767, "title": "First Midwest Bancorp, Inc. Announces 2017 Fourth Quarter and Full Year Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T03:32:00.000+02:00", "replies_count": 0, "uuid": "1fcb6b5f270fb8e6de12bf83fa6c06ff24b1e360"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-first-midwest-bancorp-inc-announces-2017-fourth-quarter-and-full-year-results.html", "ord_in_thread": 0, "title": "First Midwest Bancorp, Inc. Announces 2017 Fourth Quarter and Full Year Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ITASCA, Ill., Jan. 29, 2018 (GLOBE NEWSWIRE) -- First Midwest Bancorp, Inc. (the \"Company\" or \"First Midwest\") (NASDAQ NGS:FMBI ) , the holding company of First Midwest Bank (the \"Bank\"), today reported results of operations and financial condition for the fourth quarter and full year of 2017. Net income for the fourth quarter of 2017 was $2.3 million, or $0.02 per share, compared to $38.2 million, or $0.37 per share, for the third quarter of 2017, and $20.7 million, or $0.25 per share, for the fourth quarter of 2016. For the full year of 2017, the Company reported net income of $98.4 million, or $0.96 per share, compared to $92.3 million, or $1.14 per share, for the year ended December 31, 2016.\nReported results for the fourth quarter and the full year of 2017 were impacted by various actions taken by the Company in light of federal income tax reform legislation, which include: the revaluation of the Company's deferred tax assets (the \"DTAs\"), additional investments in the Company's colleagues and communities, and certain actions related to the securities portfolio. For additional detail on these adjustments, see the \"Non-GAAP Financial Information\" section presented later in this release.\nEarnings per share, adjusted (1) was $0.34 for the fourth quarter of 2017 compared to $0.33 for the third quarter of 2017 and $0.32 for the fourth quarter of 2016. Earnings per share, adjusted (1) was $1.35 and $1.22 for the full years ended December 31, 2017 and 2016, respectively.\nFOURTH QUARTER AND FULL YEAR HIGHLIGHTS\nImproved both earnings per share and profitability, as adjusted (1) in 2017:\n° Increased earnings per share, adjusted (1) to $0.34 for the fourth quarter of 2017 and $1.35 for the full year of 2017, up 6% and 11%, respectively, versus a year ago.\n° Produced returns on average tangible common equity, adjusted (1) of 12.4% for the fourth quarter of 2017 and 13.1% for the full year of 2017, improved 80 and 160 basis points, respectively, versus a year ago.\n° Improved operating efficiency, lowering the efficiency ratio (1) to 60% for the full year of 2017, from 63% for 2016. Expanded net interest income and net interest margin to $472 million and 3.87% for the full year of 2017, up 35% and 27 basis points, respectively, compared to the full year of 2016. Grew fee-based revenues 7% from 2016, or 11% excluding the impact of the Durbin Amendment on the last half of 2017. Strengthened capital, returning to levels last achieved prior to the Standard acquisition:\n° Increased common equity Tier 1 capital to risk-weighted assets to 9.68%, up 29 basis points from a year ago.\n° Expanded tangible common equity to tangible assets to 8.33%, up 28 basis points from a year ago. Grew total loans 2%, annualized, and 26% from September 30, 2017 and December 31, 2016, respectively.\n° Increased commercial and industrial lending 8%, annualized, and 25% compared to September 30, 2017 and December 31, 2016, respectively. Increased average core deposits to $9.6 billion, consistent with the third quarter of 2017 and up 23% from the fourth quarter of 2016, holding the average core deposit ratio at 86%. Completed the acquisition of Standard Bancshares, Inc. on January 6, 2017, adding $2.6 billion in assets. Expanded total assets under management to $11 billion and wealth management fees to $41 million, both up nearly 25% from last year, driven by acquisitions including Premier Asset Management LLC.\n(1) These metrics are non-GAAP financial measures. For details on the calculation of these metrics, see the sections titled \"Non-GAAP Financial Information\" and \"Non-GAAP Reconciliations\" presented later in this release.\n\"Performance for 2017 was strong, against a backdrop of transformative growth, higher rates and tax reform,\" said Michael L. Scudder, Chairman and Chief Executive Officer. \"The magnitude and timing of tax legislation impacted both fourth quarter and full year operating results, largely in the form of a downward revaluation of our deferred tax assets. Importantly, core performance benefited from disciplined sales success across business lines, as well as our strategic acquisitions of Standard Bank and Trust Company and Premier Asset Management. Excluding tax-related actions and costs attendant to acquired growth, earnings per share improved 6% and 11% for the quarter and full year versus a year ago. Importantly, we closed 2017 as a larger, more diverse and profitable financial institution, having replenished capital and largely navigated the regulatory costs and organizational changes attendant to growth.\"\nMr. Scudder concluded, \"We begin 2018 with heightened optimism, ready to build on the momentum of 2017. Higher interest rates as well as the benefits of a lower corporate tax structure will generate earnings momentum and further strengthen capital. As a result, we are well positioned for continued investment in our business and communities, delivering both service excellence and greater efficiency. As we do so, our actions remain centered on helping our clients to achieve financial success, enhancing the value of our franchise, and the long-term interests of our shareholders.\"\nIMPACT OF TAX REFORM\nOn December 22, 2017, the “Tax Cuts and Jobs Act” (\"tax reform”) was enacted into law. This tax reform, among other things, reduces the federal corporate income tax rate from 35% to 21%, effective January 1, 2018. As a result, the Company revalued its DTAs, expanded investments in its colleagues and communities, and took certain actions related to its securities portfolio as follows:\nRevalued its DTAs by $27 million, which was recorded as additional income tax expense in the Company’s statement of operations in the fourth quarter of 2017. Earnings for the fourth quarter of 2017 were reduced by $0.26 due to this additional income tax expense. Increased its minimum pay rate to $15 for hourly colleagues, effective in 2018. Paid a special bonus of up to $1,035 to nearly 85% of colleagues. The aggregate amount of these bonuses was approximately $2 million on a pre-tax basis. Earnings for the fourth quarter of 2017 were reduced by $0.01 due to this bonus. Contributed approximately $2 million to the First Midwest Charitable Foundation, which supports charitable organizations in the communities the Company serves. Earnings for the fourth quarter of 2017 were reduced by $0.01 due to this charitable contribution. Liquidated all of its $46 million in trust-preferred collateralized debt obligations (\"CDOs\") at a minimal loss of approximately $800,000 late in the fourth quarter of 2017. This action improved the Company's total capital to risk-weighted assets by approximately 20 basis points. Sold $150 million of collateralized mortgage obligations and other mortgage-backed securities late in the fourth quarter of 2017 at a loss of approximately $5 million in order to invest the proceeds in higher-yielding securities with similar durations.\nOPERATING PERFORMANCE\nNet Interest Income and Margin Analysis (Dollar amounts in thousands) Quarters Ended December 31, 2017 September 30, 2017 December 31, 2016 Average\nBalance Interest\nEarned/\nPaid Yield/\nRate\n(%) Average\nBalance Interest\nEarned/\nPaid Yield/\nRate\n(%) Average\nBalance Interest\nEarned/\nPaid Yield/\nRate\n(%) Assets: Other interest-earning assets $ 203,459 $ 721 1.41 $ 237,727 $ 793 1.32 $ 177,974 $ 362 0.81 Securities (1) 1,890,020 10,977 2.32 1,961,382 11,586 2.36 2,016,588 11,088 2.20 Federal Home Loan Bank (\"FHLB\") and Federal Reserve Bank (\"FRB\") stock 63,520 506 3.19 67,605 312 1.85 54,093 421 3.11 Loans (1) 10,384,074 119,204 4.55 10,277,420 119,267 4.60 8,177,036 86,520 4.21 Total interest-earning assets (1) 12,541,073 131,408 4.16 12,544,134 131,958 4.18 10,425,691 98,391 3.76 Cash and due from banks 188,683 194,149 145,807 Allowance for loan losses (99,590 ) (99,249 ) (89,401 ) Other assets 1,488,459 1,516,732 898,011 Total assets $ 14,118,625 $ 14,155,766 $ 11,380,108 Liabilities and Stockholders' Equity: Savings deposits $ 2,017,489 382 0.08 $ 2,040,609 391 0.08 $ 1,633,010 300 0.07 NOW accounts 1,992,150 690 0.14 2,039,593 809 0.16 1,715,228 313 0.07 Money market deposits 1,938,195 772 0.16 1,928,962 700 0.14 1,623,392 436 0.11 Time deposits 1,619,758 3,033 0.74 1,559,966 2,469 0.63 1,213,048 1,426 0.47 Borrowed funds 554,634 2,263 1.62 648,275 2,544 1.56 617,975 1,716 1.10 Senior and subordinated debt 195,102 3,114 6.33 194,961 3,110 6.33 259,531 4,112 6.30 Total interest-bearing liabilities 8,317,328 10,254 0.49 8,412,366 10,023 0.47 7,062,184 8,303 0.47 Demand deposits 3,611,811 3,574,012 2,803,016 Total funding sources 11,929,139 11,986,378 9,865,200 Other liabilities 309,221 313,741 244,915 Stockholders' equity - common 1,880,265 1,855,647 1,269,993 Total liabilities and stockholders' equity $ 14,118,625 $ 14,155,766 $ 11,380,108 Tax-equivalent net interest income/margin (1) 121,154 3.84 121,935 3.86 90,088 3.44 Tax-equivalent adjustment (1,823 ) (2,042 ) (2,064 ) Net interest income (GAAP) (1) $ 119,331 $ 119,893 $ 88,024 Impact of acquired loan accretion (1) $ 6,240 0.20 $ 7,581 0.24 $ 2,663 0.10 Tax-equivalent net interest income/margin, adjusted (1) $ 114,914 3.64 $ 114,354 3.62 $ 87,425 3.34 (1) Interest income and yields on tax-exempt securities and loans are presented on a tax-equivalent basis, assuming a federal income tax rate of 35%. The corresponding income tax impact related to tax-exempt items is recorded in income tax expense. These adjustments have no impact on net income. See the \"Non-GAAP Financial Information\" section presented later in this release for a discussion of this non-GAAP financial measure.\nNet interest income for the fourth quarter of 2017 was consistent with the third quarter of 2017 and increased by 35.6% compared to the fourth quarter of 2016. Compared to the third quarter of 2017, net interest income was negatively impacted by lower acquired loan accretion and securities income and higher cost of time deposits, mostly offset by loan growth. The increase in net interest income compared to the fourth quarter of 2016 was driven primarily by higher interest rates, organic loan growth, and the acquisition of interest-earning assets from the Standard Bancshares, Inc. (\"Standard\") transaction, as well as lower senior and subordinated debt costs.\nAcquired loan accretion contributed $6.2 million, $7.6 million, and $2.7 million to net interest income for the fourth quarter of 2017, the third quarter of 2017, and the fourth quarter of 2016, respectively.\nTax-equivalent net interest margin for the current quarter was 3.84%, consistent with the third quarter of 2017 and increasing by 40 basis points from the fourth quarter of 2016. Compared to the third quarter of 2017, tax-equivalent net interest margin reflected the negative impact of a 4 basis point decrease in acquired loan accretion and an increase in the cost of time deposits, partially offset by the reinvestment of proceeds from securities sales late in the third quarter of 2017 into higher-yielding securities during the fourth quarter of 2017. The increase in tax-equivalent net interest margin compared to the fourth quarter of 2016 was due to the positive impact of higher interest rates, higher acquired loan accretion, lower senior and subordinated debt balances, and the reinvestment of proceeds from securities sales during the fourth quarter of 2017.\nFor the fourth quarter of 2017, total average interest-earning assets were consistent with the third quarter of 2017 and rose $2.1 billion from the fourth quarter of 2016. The increase from the fourth quarter of 2016 reflected the impact of the Standard transaction and loan growth.\nAverage funding sources for the fourth quarter of 2017 were consistent with the third quarter of 2017 and increased $2.1 billion from the fourth quarter of 2016. Deposits acquired in the Standard transaction contributed to the increase in average funding sources compared to the fourth quarter of 2016.\nFee-based Revenues and Total Noninterest Income Analysis (Dollar amounts in thousands) Quarters Ended December 31, 2017\nPercent Change From December 31,\n2017 September 30,\n2017 December 31,\n2016 September 30,\n2017 December 31,\n2016 Service charges on deposit accounts $ 12,289 $ 12,561 $ 10,315 (2.2 ) 19.1 Wealth management fees 10,967 10,169 8,375 7.8 30.9 Card-based fees 6,052 5,992 7,462 1.0 (18.9 ) Merchant servicing fees 1,771 2,237 3,016 (20.8 ) (41.3 ) Mortgage banking income 2,352 2,246 3,537 4.7 (33.5 ) Capital market products income 1,986 2,592 1,827 (23.4 ) 8.7 Other service charges, commissions, and fees 2,369 2,508 2,575 (5.5 ) (8.0 ) Total fee-based revenues 37,786 38,305 37,107 (1.4 ) 1.8 Net securities (losses) gains (5,357 ) 3,197 323 (267.6 ) (1,758.5 ) Other income 2,476 1,846 2,281 34.1 8.5 Total noninterest income $ 34,905 $ 43,348 $ 39,711 (19.5 ) (12.1 )\nTotal fee-based revenues of $37.8 million for the fourth quarter of 2017 were consistent with the third quarter of 2017 and the same period in 2016. Compared to the third quarter of 2017, the rise in wealth management fees as a result of continued sales of fiduciary and investment advisory services to new and existing customers were offset by decreases in service charges on deposit accounts and lower sales of capital market products to commercial clients.\nCompared to the fourth quarter of 2016, organic growth and services provided to customers acquired in the Standard and Premier Asset Management LLC (\"Premier\") transactions contributed to the increases in service charges on deposit accounts and wealth management fees. The decrease in card-based fees compared to the fourth quarter of 2016 resulted from the reduction in interchange revenue as the impact of the Durbin Amendment of the Dodd-Frank Act became effective in the third quarter of 2017. This reduction was partially offset by higher transaction volumes and services provided to customers acquired in the Standard transaction.\nThe decline in merchant servicing fees compared to both prior periods reflected lower customer volumes, substantially offset by the decline in merchant card expense included in noninterest expense for each period presented.\nMortgage banking income for the fourth quarter of 2017 resulted from sales of $66.5 million of 1-4 family mortgage loans in the secondary market, compared to $72.1 million in the third quarter of 2017 and $85.3 million in the fourth quarter of 2016. In addition, mortgage banking income for the fourth quarter of 2016 was positively impacted by changes in the fair value of mortgage servicing rights, which fluctuate from quarter to quarter.\nNet securities losses of $5.4 million were recognized during the fourth quarter of 2017 in connection with certain actions taken in light of tax reform. Net securities gains of $3.2 million were recognized during the third quarter of 2017 as a result of the opportunistic repositioning of the securities portfolio.\nOther income for the fourth quarter of 2017 was positively impacted by benefit settlements on bank-owned life insurance (\"BOLI\").\nNoninterest Expense Analysis (Dollar amounts in thousands) Quarters Ended December 31, 2017\nPercent Change From December 31,\n2017 September 30,\n2017 December 31,\n2016 September 30,\n2017 December 31,\n2016 Salaries and employee benefits: Salaries and wages $ 48,204 $ 45,219 $ 39,257 6.6 22.8 Retirement and other employee benefits 10,204 10,419 8,160 (2.1 ) 25.0 Total salaries and employee benefits 58,408 55,638 47,417 5.0 23.2 Net occupancy and equipment expense 12,826 12,115 10,774 5.9 19.0 Professional services 7,616 8,498 7,138 (10.4 ) 6.7 Technology and related costs 4,645 4,505 3,514 3.1 32.2 Merchant card expense 1,423 1,737 2,603 (18.1 ) (45.3 ) Advertising and promotions 4,083 1,852 2,330 120.5 75.2 Cardholder expenses 1,915 1,962 1,426 (2.4 ) 34.3 Net other real estate owned (\"OREO\") expense 695 657 925 5.8 (24.9 ) Other expenses 10,715 9,842 8,050 8.9 33.1 Acquisition and integration related expenses — 384 7,542 (100.0 ) (100.0 ) Lease cancellation fee — — 950 — (100.0 ) Total noninterest expense $ 102,326 $ 97,190 $ 92,669 5.3 10.4\nTotal noninterest expense for the fourth quarter of 2017 increased by 5.3% and 10.4% compared to the third quarter of 2017 and the fourth quarter of 2016, respectively. Compared to both prior periods, the increase in salaries and wages and advertising and promotions expense were impacted by the special bonus and charitable contribution in connection with tax reform. In addition, prior periods were impacted by acquisition and integration related expenses related to the acquisitions of Standard and Premier as well as a lease cancellation fee recognized as a result of the Company's planned 2018 corporate headquarters relocation. Excluding these items, total noninterest expense increased to $98.8 million, up 2.1% and 17.4% compared to the third quarter of 2017 and fourth quarter of 2016, respectively.\nThe decline in merchant card expense compared to both prior periods is in-line with the decrease in merchant servicing fees included in noninterest income.\nThe increase in net occupancy and equipment expense compared to the third quarter of 2017 was driven primarily by higher computer processing and software maintenance costs. Professional services decreased compared to the same period as a result of lower loan remediation costs. In addition to the charitable contribution noted above, advertising and promotions expense was higher due to the timing of certain advertising costs.\nCompared to the fourth quarter of 2016, the increase in total noninterest expense resulted from operating costs associated with the Standard and Premier transactions, which impacted most expense categories. In addition, compensation costs associated with merit increases and investments in additional talent to support growth contributed to the rise in salaries and employee benefits.\nINCOME TAXES\nThe Company's effective tax rate for the fourth quarter of 2017 was 94.7%, compared to 31.7% for the third quarter of 2017, and 30.4% for the fourth quarter of 2016. Excluding the downward revaluation of DTAs by $26.6 million in the fourth quarter of 2017 due to federal income tax reform as well as a $2.8 million benefit in the third quarter of 2017 due to changes in Illinois income tax rates, the effective tax rates for the fourth and third quarters of 2017 were 34.1% and 36.7%, respectively.\nLOAN PORTFOLIO AND ASSET QUALITY\nLoan Portfolio Composition (Dollar amounts in thousands) As of December 31, 2017\nPercent Change From December 31,\n2017 September 30,\n2017 December 31,\n2016 September 30,\n2017 December 31,\n2016 Commercial and industrial $ 3,529,914 $ 3,462,612 $ 2,827,658 1.9 24.8 Agricultural 430,886 437,721 389,496 (1.6 ) 10.6 Commercial real estate: Office, retail, and industrial 1,979,820 1,960,367 1,581,967 1.0 25.1 Multi-family 675,463 711,101 614,052 (5.0 ) 10.0 Construction 539,820 545,666 451,540 (1.1 ) 19.6 Other commercial real estate 1,358,515 1,391,241 979,528 (2.4 ) 38.7 Total commercial real estate 4,553,618 4,608,375 3,627,087 (1.2 ) 25.5 Total corporate loans 8,514,418 8,508,708 6,844,241 0.1 24.4 Home equity 827,055 847,209 747,983 (2.4 ) 10.6 1-4 family mortgages 774,357 711,607 423,922 8.8 82.7 Installment 321,982 322,768 237,999 (0.2 ) 35.3 Total consumer loans 1,923,394 1,881,584 1,409,904 2.2 36.4 Total loans $ 10,437,812 $ 10,390,292 $ 8,254,145 0.5 26.5\nTotal loans of $10.4 billion grew by 1.8% on an annualized basis from September 30, 2017, and 26.5% from December 31, 2016. Excluding loans related to the Standard transaction, total loans grew by 6.5% from December 31, 2016. Compared to both prior periods, growth in commercial and industrial loans, primarily within our sector-based lending businesses, drove the increase in total corporate loans. The addition of consumer loans also contributed to the increase in total loans compared to both prior periods. The declines in multi-family and other commercial real estate loans compared to September 30, 2017 were driven primarily by the decision of certain customers to opportunistically sell their investment real estate properties, as well as expected payoffs.\nAsset Quality (Dollar amounts in thousands) As of December 31, 2017\nPercent Change From December 31,\n2017 September 30,\n2017 December 31,\n2016 September 30,\n2017 December 31,\n2016 Asset quality Non-accrual loans $ 66,924 $ 65,176 $ 59,289 2.7 12.9 90 days or more past due loans, still accruing interest (1) 3,555 2,839 5,009 25.2 (29.0 ) Total non-performing loans 70,479 68,015 64,298 3.6 9.6 Accruing troubled debt restructurings (\"TDRs\") 1,796 1,813 2,291 (0.9 ) (21.6 ) OREO 20,851 19,873 26,083 4.9 (20.1 ) Total non-performing assets $ 93,126 $ 89,701 $ 92,672 3.8 0.5 30-89 days past due loans (1) $ 39,725 $ 28,868 $ 21,043 Non-accrual loans to total loans 0.64 % 0.63 % 0.72 % Non-performing loans to total loans 0.68 % 0.65 % 0.78 % Non-performing assets to total loans plus OREO 0.89 % 0.86 % 1.12 % Allowance for Credit Losses Allowance for loan losses $ 95,729 $ 94,814 $ 86,083 Reserve for unfunded commitments 1,000 1,000 1,000 Total allowance for credit losses $ 96,729 $ 95,814 $ 87,083 Allowance for credit losses to total loans (2) 0.93 % 0.92 % 1.06 % Allowance for credit losses to loans, excluding acquired loans 1.07 % 1.09 % 1.11 % Allowance for credit losses to non-accrual loans 144.54 % 147.01 % 146.88 % (1) Purchased credit impaired loans with an accretable yield are considered current and are not included in past due loan totals.\n(2) This ratio includes acquired loans that are recorded at fair value through an acquisition adjustment, which incorporates credit risk as of the acquisition date with no allowance for credit losses being established at that time. As the acquisition adjustment is accreted into income over future periods, an allowance for credit losses on acquired loans is established as necessary to reflect credit deterioration.\nOverall, asset quality was consistent with the prior quarter and improved from a year ago. Total non-performing assets represented 0.89% of total loans plus OREO at December 31, 2017, compared to 0.86% at September 30, 2017 and 1.12% at December 31, 2016.\nThe allowance for credit losses to total loans was 0.93% at December 31, 2017, down from 1.06% at December 31, 2016 driven primarily by loans acquired in the Standard transaction. The slight increase from September 30, 2017 was due to renewal and payment activity on acquired loans.\nCharge-Off Data (Dollar amounts in thousands) Quarters Ended Years Ended December 31,\n2017 September 30,\n2017 December 31,\n2016 December 31,\n2017 December 31,\n2016 Net Loan Charge-offs (1) : Commercial and industrial $ 5,635 $ 8,237 $ 3,540 $ 17,487 $ 7,531 Agricultural (102 ) — — 1,248 — Office, retail, and industrial (78 ) (1,811 ) 165 (2,745 ) 4,370 Multi-family (3 ) (2 ) 17 (39 ) 210 Construction (12 ) (25 ) (12 ) (232 ) 78 Other commercial real estate (5 ) (19 ) (111 ) 511 2,408 Consumer 1,674 1,286 933 5,414 3,933 Total net loan charge-offs $ 7,109 $ 7,666 $ 4,532 $ 21,644 $ 18,530 Total recoveries included above $ 2,011 $ 2,900 $ 1,489 $ 9,179 $ 4,763 Net loan charge-offs to average loans (2) 0.27 % 0.30 % 0.22 % 0.21 % 0.24 % (1) Amounts represent charge-offs, net of recoveries.\n(2) Annualized based on the actual number of days for each period presented.\nNet loan charge-offs to average loans, annualized, were 0.27% for the fourth quarter of 2017, down from 0.30% for the third quarter of 2017 and up from 0.22% for the fourth quarter of 2016.\nDEPOSIT PORTFOLIO\nDeposit Composition (Dollar amounts in thousands) Average for Quarters Ended December 31, 2017\nPercent Change From December 31,\n2017 September 30,\n2017 December 31,\n2016 September 30,\n2017 December 31,\n2016 Demand deposits $ 3,611,811 $ 3,574,012 $ 2,803,016 1.1 28.9 Savings deposits 2,017,489 2,040,609 1,633,010 (1.1 ) 23.5 NOW accounts 1,992,150 2,039,593 1,715,228 (2.3 ) 16.1 Money market accounts 1,938,195 1,928,962 1,623,392 0.5 19.4 Core deposits 9,559,645 9,583,176 7,774,646 (0.2 ) 23.0 Time deposits 1,619,758 1,559,966 1,213,048 3.8 33.5 Total deposits $ 11,179,403 $ 11,143,142 $ 8,987,694 0.3 24.4\nAverage core deposits were $9.6 billion for the fourth quarter of 2017, consistent with the third quarter of 2017 and up 23.0% from the fourth quarter of 2016. The rise in average core deposits compared to the fourth quarter of 2016 was driven primarily by deposits assumed in the Standard transaction, which contributed $1.6 billion to average core deposits in the fourth quarter of 2017, as well as organic growth.\nCAPITAL MANAGEMENT\nCapital Ratios As of December 31,\n2017 September 30,\n2017 December 31,\n2016 Company regulatory capital ratios: Total capital to risk-weighted assets 12.15 % 11.79 % 12.23 % Tier 1 capital to risk-weighted assets 10.10 % 9.83 % 9.90 % Common equity Tier 1 (\"CET1\") to risk-weighted assets 9.68 % 9.42 % 9.39 % Tier 1 capital to average assets 8.99 % 9.04 % 8.99 % Company tangible common equity ratios (1)(2) : Tangible common equity to tangible assets 8.33 % 8.25 % 8.05 % Tangible common equity, excluding accumulated other comprehensive income (\"AOCI\"), to tangible assets 8.58 % 8.53 % 8.42 % Tangible common equity to risk-weighted assets 9.31 % 9.02 % 8.88 % (1) These ratios are not subject to formal Federal Reserve regulatory guidance.\n(2) Tangible common equity (\"TCE\") represents common stockholders' equity less goodwill and identifiable intangible assets. For details of the calculation of these ratios, see the sections titled, \"Non-GAAP Financial Information\" and \"Non-GAAP Reconciliations\" presented later in this release.\nOverall, the Company's regulatory capital ratios returned to levels last achieved prior to the Standard acquisition. The increase in ratios compared to September 30, 2017 was primarily driven by certain actions taken by management to sell all of its $46 million in CDOs, which received significantly higher risk-weightings for regulatory capital ratio calculation purposes.\nThe Board of Directors approved a quarterly cash dividend of $0.10 per common share during the fourth quarter of 2017, which is consistent with the third quarter of 2017 and will represent the 140 th consecutive cash dividend paid by the Company since its inception in 1983. The dividend increased 11% from $0.09 to $0.10 per common share during the second quarter of 2017.\nConference Call\nA conference call to discuss the Company's results, outlook, and related matters will be held on Tuesday, January 30, 2018 at 11:00 A.M. (ET). Members of the public who would like to listen to the conference call should dial (877) 507-0639 (U.S. domestic) or (412) 317-6003 (International) and ask for the First Midwest Bancorp, Inc. Earnings Conference Call. The number should be dialed 10 to 15 minutes prior to the start of the conference call. There is no charge to access the call. The conference call will also be accessible as an audio webcast through the Investor Relations section of the Company's website, www.firstmidwest.com/investorrelations . For those unable to listen to the live broadcast, a replay will be available on the Company's website or by dialing (877) 344-7529 (U.S. domestic) or (412) 317-0088 (International) conference I.D. 10115697 beginning one hour after completion of the live call until 9:00 A.M. (ET) on February 13, 2018. Please direct any questions regarding obtaining access to the conference call to First Midwest Bancorp, Inc. Investor Relations, via e-mail, at investor.relations@firstmidwest.com .\nPress Release and Additional Information Available on Website\nThis press release, the accompanying unaudited Selected Financial Information, and the presentation materials to be discussed during the conference call are available through the \"Investor Relations\" section of First Midwest's website at www.firstmidwest.com/investorrelations .\nForward-Looking Statements\nThis press release may contain certain \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. In some cases, forward-looking statements can be identified by the use of words such as \"may,\" \"might,\" \"will,\" \"would,\" \"should,\" \"could,\" \"expect,\" \"plan,\" \"intend,\" \"anticipate,\" \"believe,\" \"estimate,\" \"predict,\" \"probable,\" \"potential,\" \"possible,\" \"target,\" \"continue,\" \"look forward,\" or \"assume\" and words of similar import. Forward-looking statements are not historical facts but instead express only management's beliefs regarding future results or events, many of which, by their nature, are inherently uncertain and outside of management's control. It is possible that actual results and events may differ, possibly materially, from the anticipated results or events indicated in these forward-looking statements. Forward-looking statements are not guarantees of future performance, and First Midwest cautions you not to place undue reliance on these statements. Forward-looking statements are made only as of the date of this press release, and First Midwest undertakes no obligation to update any forward-looking statements contained in this press release to reflect new information or events or conditions after the date hereof.\nForward-looking statements may be deemed to include, among other things, statements relating to our future financial performance, including the related outlook for 2018, the performance of our loan or securities portfolio, the expected amount of future credit reserves or charge-offs, corporate strategies or objectives, including the impact of certain actions and initiatives, anticipated trends in our business, regulatory developments, the impact of federal income tax reform legislation, acquisition transactions, including estimated synergies, cost savings and financial benefits of consummated transactions, and growth strategies, including possible future acquisitions. These statements are subject to certain risks, uncertainties and assumptions. For a discussion of these risks, uncertainties and assumptions, you should refer to the sections entitled \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in our Annual Report on Form 10-K for the year ended December 31, 2016, as well as our subsequent filings made with the Securities and Exchange Commission. However, these risks and uncertainties are not exhaustive. Other sections of such reports describe additional factors that could adversely impact our business and financial performance.\nNon-GAAP Financial Information\nThe Company's accounting and reporting policies conform to U.S. generally accepted accounting principles (\"GAAP\") and general practices within the banking industry. As a supplement to GAAP, the Company provides non-GAAP performance results, which the Company believes are useful because they assist investors in assessing the Company's operating performance. These non-GAAP financial measures include earnings per share (\"EPS\"), adjusted, the efficiency ratio, return on average assets, adjusted, tax-equivalent net interest income (including its individual components), tax-equivalent net interest margin, tax-equivalent net interest margin, adjusted, effective income tax rate, excluding revaluations of DTAs, tangible common equity to tangible assets, tangible common equity, excluding AOCI, to tangible assets, tangible common equity to risk-weighted assets, return on average tangible common equity, and return on average tangible common equity, adjusted.\nThe Company presents EPS, the efficiency ratio, return on average assets, and return on average tangible common equity, all adjusted for certain significant transactions. These transaction include the revaluation of DTAs (fourth and third quarters of 2017), certain actions resulting in securities losses and gains (fourth and third quarters of 2017), a special bonus to colleagues (fourth quarter of 2017), a charitable contribution to the First Midwest Charitable Foundation (fourth quarter of 2017), acquisition and integration related expenses associated with completed and pending acquisitions (all periods presented, excluding the fourth quarter of 2017), a lease cancellation fee recognized as a result of the Company's planned 2018 corporate headquarters relocation (fourth quarter of 2016), and a net gain on a sale-leaseback transaction (third quarter of 2016). Management believes excluding these transactions from EPS, the efficiency ratio, return on average assets, and return on average tangible common equity is useful in assessing the Company's underlying operational performance since these transactions do not pertain to its core business operations and their exclusion facilitates better comparability between periods. Management believes that excluding acquisition and integration related expenses from these metrics is useful to the Company, as well as analysts and investors, since these expenses can vary significantly based on the size, type, and structure of each acquisition. Additionally, management believes excluding these transactions from these metrics enhances comparability for peer comparison purposes.\nThe tax-equivalent adjustment to net interest income and net interest margin recognizes the income tax savings when comparing taxable and tax-exempt assets and assumes a 35% tax rate. Management believes that it is standard practice in the banking industry to present net interest income and net interest margin on a fully tax-equivalent basis and that it enhances comparability for peer comparison purposes. In addition, management believes that presenting tax-equivalent net interest margin, excluding the impact of acquired loan accretion, enhances comparability for peer comparison purposes and is useful to the Company, as well as analysts and investors, since acquired loan accretion income may fluctuate based on the size of each acquisition, as well as from period to period.\nIn management's view, tangible common equity measures are capital adequacy metrics meaningful to the Company, as well as analysts and investors, in assessing the Company's use of equity and in facilitating comparisons with peers. These non-GAAP measures are valuable indicators of a financial institution's capital strength since they eliminate intangible assets from stockholders' equity and retain the effect of accumulated other comprehensive loss in stockholders' equity.\nAlthough intended to enhance investors' understanding of the Company's business and performance, these non-GAAP financial measures should not be considered an alternative to GAAP. See the previously provided tables and the following reconciliations in the \"Non-GAAP Reconciliations\" section for details on the calculation of these measures to the extent presented herein.\nAbout the Company\nFirst Midwest is a relationship-focused financial institution and one of the largest independent publicly-traded bank holding companies based on assets headquartered in the Midwest, with over $14 billion in assets and approximately $11 billion in trust assets under management. First Midwest's principal subsidiary, First Midwest Bank, and other affiliates provide a full range of commercial, treasury management, equipment leasing, retail, wealth management, trust and private banking products and services through over 130 locations in metropolitan Chicago, northwest Indiana, central and western Illinois, and eastern Iowa. First Midwest's common stock is traded on the NASDAQ Stock Market under the symbol FMBI. First Midwest's website is www.firstmidwest.com .\nContact Information\nInvestors: Patrick S. Barrett\nEVP, Chief Financial Officer\n(630) 875-7273\npat.barrett@firstmidwest.com Media: James M. Roolf\nSVP and Corporate Relations Officer\n(630) 875-7533\njim.roolf@firstmidwest.com\nAccompanying Unaudited Selected Financial Information\nFirst Midwest Bancorp, Inc. Consolidated Statements of Financial Condition (Unaudited) (Dollar amounts in thousands) As of December 31, September 30, June 30, March 31, December 31, 2017 2017 2017 2017 2016 Period-End Balance Sheet Assets Cash and due from banks $ 192,800 $ 174,147 $ 181,171 $ 174,268 $ 155,055 Interest-bearing deposits in other banks 153,770 252,753 103,181 74,892 107,093 Trading securities, at fair value 20,447 20,425 19,545 19,130 17,920 Securities available-for-sale, at fair value 1,884,209 1,732,984 1,908,248 1,937,124 1,919,450 Securities held-to-maturity, at amortized cost 13,760 14,638 17,353 17,742 22,291 FHLB and FRB stock 69,708 69,708 66,333 46,306 59,131 Loans: Commercial and industrial 3,529,914 3,462,612 3,410,748 3,370,780 2,827,658 Agricultural 430,886 437,721 433,424 422,784 389,496 Commercial real estate: Office, retail, and industrial 1,979,820 1,960,367 1,983,802 1,988,979 1,581,967 Multi-family 675,463 711,101 681,032 671,710 614,052 Construction 539,820 545,666 543,892 568,460 451,540 Other commercial real estate 1,358,515 1,391,241 1,383,937 1,357,781 979,528 Home equity 827,055 847,209 865,656 880,667 747,983 1-4 family mortgages 774,357 711,607 614,818 540,148 423,922 Installment 321,982 322,768 314,850 253,061 237,999 Total loans 10,437,812 10,390,292 10,232,159 10,054,370 8,254,145 Allowance for loan losses (95,729 ) (94,814 ) (92,371 ) (88,163 ) (86,083 ) Net loans 10,342,083 10,295,478 10,139,788 9,966,207 8,168,062 OREO 20,851 19,873 26,493 29,140 26,083 Premises, furniture, and equipment, net 123,316 131,295 135,745 140,653 82,577 Investment in BOLI 279,900 279,639 278,353 276,960 219,746 Goodwill and other intangible assets 754,757 750,436 752,413 754,621 366,876 Accrued interest receivable and other assets 221,451 525,766 340,517 336,428 278,271 Total assets $ 14,077,052 $ 14,267,142 $ 13,969,140 $ 13,773,471 $ 11,422,555 Liabilities and Stockholders' Equity Noninterest-bearing deposits $ 3,576,190 $ 3,580,922 $ 3,525,905 $ 3,492,987 $ 2,766,748 Interest-bearing deposits 7,477,135 7,627,575 7,473,815 7,463,554 6,061,855 Total deposits 11,053,325 11,208,497 10,999,720 10,956,541 8,828,603 Borrowed funds 714,884 700,536 639,333 547,923 879,008 Senior and subordinated debt 195,170 195,028 194,886 194,745 194,603 Accrued interest payable and other liabilities 248,799 297,951 298,358 269,529 263,261 Stockholders' equity 1,864,874 1,865,130 1,836,843 1,804,733 1,257,080 Total liabilities and stockholders' equity $ 14,077,052 $ 14,267,142 $ 13,969,140 $ 13,773,471 $ 11,422,555 Stockholders' equity, excluding AOCI $ 1,897,910 $ 1,903,166 $ 1,873,410 $ 1,844,997 $ 1,297,990 Stockholders' equity, common 1,864,874 1,865,130 1,836,843 1,804,733 1,257,080\nFirst Midwest Bancorp, Inc. Condensed Consolidated Statements of Income (Unaudited) (Dollar amounts in thousands) Quarters Ended Years Ended December 31, September 30, June 30, March 31, December 31, December 31, December 31, 2017 2017 2017 2017 2016 2017 2016 Income Statement Interest income $ 129,585 $ 129,916 $ 126,516 $ 123,699 $ 96,328 $ 509,716 $ 378,332 Interest expense 10,254 10,023 8,933 8,502 8,304 37,712 28,641 Net interest income 119,331 119,893 117,583 115,197 88,024 472,004 349,691 Provision for loan losses 8,024 10,109 8,239 4,918 5,307 31,290 30,983 Net interest income after provision for loan losses 111,307 109,784 109,344 110,279 82,717 440,714 318,708 Noninterest Income Service charges on deposit accounts 12,289 12,561 12,153 11,365 10,315 48,368 40,665 Wealth management fees 10,967 10,169 10,525 9,660 8,375 41,321 33,071 Card-based fees 6,052 5,992 8,832 8,116 7,462 28,992 29,104 Merchant servicing fees 1,771 2,237 3,197 3,135 3,016 10,340 12,533 Mortgage banking income 2,352 2,246 1,645 1,888 3,537 8,131 10,162 Capital market products income 1,986 2,592 2,217 1,376 1,827 8,171 10,024 Other service charges commissions, and fees 2,369 2,508 2,659 2,307 2,575 9,843 9,542 Total fee-based revenues 37,786 38,305 41,228 37,847 37,107 155,166 145,101 Net securities (losses) gains (5,357 ) 3,197 284 — 323 (1,876 ) 1,420 Net gain on sale-leaseback transaction — — — — — — 5,509 Other income 2,476 1,846 3,433 2,104 2,281 9,859 7,282 Total noninterest income 34,905 43,348 44,945 39,951 39,711 163,149 159,312 Noninterest Expense �� Salaries and employee benefits: Salaries and wages 48,204 45,219 44,194 44,890 39,257 182,507 151,341 Retirement and other employee benefits 10,204 10,419 10,381 10,882 8,160 41,886 33,309 Total salaries and employee benefits 58,408 55,638 54,575 55,772 47,417 224,393 184,650 Net occupancy and equipment expense 12,826 12,115 12,485 12,325 10,774 49,751 41,154 Professional services 7,616 8,498 9,112 8,463 7,138 33,689 25,122 Technology and related costs 4,645 4,505 4,485 4,433 3,514 18,068 14,765 Merchant card expense 1,423 1,737 2,632 2,585 2,603 8,377 10,782 Advertising and promotions 4,083 1,852 1,693 1,066 2,330 8,694 7,787 Cardholder expenses 1,915 1,962 1,682 1,764 1,426 7,323 5,812 Net OREO expense 695 657 1,631 1,700 925 4,683 3,024 Other expenses 10,715 9,842 10,282 9,969 8,050 40,808 31,102 Acquisition and integration related expenses — 384 1,174 18,565 7,542 20,123 14,352 Lease cancellation fee — — — — 950 — 950 Total noninterest expense 102,326 97,190 99,751 116,642 92,669 415,909 339,500 Income before income tax expense 43,886 55,942 54,538 33,588 29,759 187,954 138,520 Income tax expense 41,539 17,707 19,588 10,733 9,041 89,567 46,171 Net income $ 2,347 $ 38,235 $ 34,950 $ 22,855 $ 20,718 $ 98,387 $ 92,349 Net income applicable to common shares $ 2,341 $ 37,895 $ 34,614 $ 22,621 $ 20,501 $ 97,471 $ 91,306 Net income applicable to common shares, adjusted (1) $ 34,131 $ 33,390 $ 35,318 $ 33,760 $ 25,596 $ 136,599 $ 97,182 Footnotes to Condensed Consolidated Statements of Income\n(1) Adjustments to net income for the fourth and third quarters of 2017 include revaluation of DTAs related to federal income tax reform and changes in Illinois income tax rates, a special colleague bonus, a charitable contribution, and certain actions related to the securities portfolio. In addition, net income for certain periods was adjusted for acquisition and integration related expenses associated with completed and pending acquisitions, a lease cancellation fee recognized as a result of the Company's planned 2018 corporate headquarters relocation, and a net gain on a sale-leaseback transaction. For additional discussion of adjustments, see the \"Non-GAAP Financial Information\" section.\nFirst Midwest Bancorp, Inc. Selected Financial Information (Unaudited) (Amounts in thousands, except per share data) As of or for the Quarters Ended Years Ended December 31, September 30, June 30, March 31, December 31, December 31, December 31, 2017 2017 2017 2017 2016 2017 2016 Earnings Per Share Basic EPS (1) $ 0.02 $ 0.37 $ 0.34 $ 0.23 $ 0.25 $ 0.96 $ 1.14 Diluted EPS (1) $ 0.02 $ 0.37 $ 0.34 $ 0.23 $ 0.25 $ 0.96 $ 1.14 Diluted EPS, adjusted (1)(7) $ 0.34 $ 0.33 $ 0.35 $ 0.34 $ 0.32 $ 1.35 $ 1.22 Common Stock and Related Per Common Share Data Book value $ 18.16 $ 18.16 $ 17.88 $ 17.56 $ 15.46 $ 18.16 $ 15.46 Tangible book value $ 10.81 $ 10.85 $ 10.55 $ 10.22 $ 10.95 $ 10.81 $ 10.95 Dividends declared per share $ 0.10 $ 0.10 $ 0.10 $ 0.09 $ 0.09 $ 0.39 $ 0.36 Closing price at period end $ 24.01 $ 23.42 $ 23.31 $ 23.68 $ 25.23 $ 24.01 $ 25.23 Closing price to book value 1.3 1.3 1.3 1.3 1.6 1.3 1.6 Period end shares outstanding 102,717 102,722 102,741 102,757 81,325 102,717 81,325 Period end treasury shares 9,634 9,626 9,604 9,586 9,959 9,634 9,959 Common dividends $ 10,278 $ 10,411 $ 10,256 $ 9,126 $ 7,315 $ 40,071 $ 29,191 Key Ratios/Data Return on average common equity (1)(2) 0.49 % 8.10 % 7.58 % 5.20 % 6.42 % 5.32 % 7.38 % Return on average tangible common equity (1)(2) 1.20 % 14.02 % 13.37 % 9.53 % 9.35 % 9.44 % 10.77 % Return on average tangible common equity, adjusted (1)(2)(7) 12.35 % 12.41 % 13.64 % 13.99 % 11.60 % 13.06 % 11.45 % Return on average assets (2) 0.07 % 1.07 % 1.00 % 0.68 % 0.72 % 0.70 % 0.84 % Return on average assets, adjusted (1)(2)(7) 0.96 % 0.95 % 1.02 % 1.01 % 0.90 % 0.98 % 0.90 % Loans to deposits 94.43 % 92.70 % 93.02 % 91.77 % 93.49 % 94.43 % 93.49 % Efficiency ratio (1) 60.32 % 58.97 % 58.67 % 60.98 % 63.98 % 59.73 % 62.59 % Net interest margin (3) 3.84 % 3.86 % 3.88 % 3.89 % 3.44 % 3.87 % 3.60 % Yield on average interest-earning assets (3) 4.16 % 4.18 % 4.17 % 4.17 % 3.76 % 4.17 % 3.89 % Cost of funds (4) 0.34 % 0.33 % 0.30 % 0.30 % 0.33 % 0.32 % 0.30 % Net noninterest expense to average assets 1.74 % 1.60 % 1.58 % 2.27 % 1.86 % 1.79 % 1.71 % Effective income tax rate 94.65 % 31.65 % 35.92 % 31.95 % 30.38 % 47.65 % 33.33 % Effective income tax rate, excluding revaluations of DTAs (5) 34.14 % 36.74 % 35.92 % 31.95 % 30.38 % 35.04 % 33.33 % Capital Ratios Total capital to risk-weighted assets (1) 12.15 % 11.79 % 11.69 % 11.48 % 12.23 % 12.15 % 12.23 % Tier 1 capital to risk-weighted assets (1) 10.10 % 9.83 % 9.71 % 9.53 % 9.90 % 10.10 % 9.90 % CET1 to risk-weighted assets (1) 9.68 % 9.42 % 9.30 % 9.11 % 9.39 % 9.68 % 9.39 % Tier 1 capital to average assets (1) 8.99 % 9.04 % 8.93 % 8.89 % 8.99 % 8.99 % 8.99 % Tangible common equity to tangible assets (1) 8.33 % 8.25 % 8.20 % 8.07 % 8.05 % 8.33 % 8.05 % Tangible common equity, excluding AOCI, to tangible assets (1) 8.58 % 8.53 % 8.48 % 8.38 % 8.42 % 8.58 % 8.42 % Tangible common equity to risk- weighted assets (1) 9.31 % 9.02 % 8.90 % 8.68 % 8.88 % 9.31 % 8.88 % Note: Selected Financial Information footnotes are located at the end of this section.\nFirst Midwest Bancorp, Inc. Selected Financial Information (Unaudited) (Amounts in thousands, except per share data) As of or for the Quarters Ended Years Ended December 31, September 30, June 30, March 31, December 31, December 31, December 31, 2017 2017 2017 2017 2016 2017 2016 Asset Quality Performance Data Non-performing assets Commercial and industrial $ 40,580 $ 41,504 $ 51,400 $ 21,514 $ 29,938 $ 40,580 $ 29,938 Agricultural 219 380 387 1,283 181 219 181 Commercial real estate: Office, retail, and industrial 11,560 12,221 15,031 19,505 17,277 11,560 17,277 Multi-family 377 153 158 163 311 377 311 Construction 209 146 197 198 286 209 286 Other commercial real estate 3,621 2,239 3,736 3,858 2,892 3,621 2,892 Consumer 10,358 8,533 8,287 7,773 8,404 10,358 8,404 Total non-accrual loans 66,924 65,176 79,196 54,294 59,289 66,924 59,289 90 days or more past due loans, still accruing interest 3,555 2,839 2,059 2,633 5,009 3,555 5,009 Total non-performing loans 70,479 68,015 81,255 56,927 64,298 70,479 64,298 Accruing TDRs 1,796 1,813 2,029 2,112 2,291 1,796 2,291 OREO 20,851 19,873 26,493 29,140 26,083 20,851 26,083 Total non-performing assets $ 93,126 $ 89,701 $ 109,777 $ 88,179 $ 92,672 $ 93,126 $ 92,672 30-89 days past due loans $ 39,725 $ 28,868 $ 19,081 $ 23,641 $ 21,043 $ 39,725 $ 21,043 Allowance for credit losses Allowance for loan losses $ 95,729 $ 94,814 $ 92,371 $ 88,163 $ 86,083 $ 95,729 $ 86,083 Reserve for unfunded commitments 1,000 1,000 1,000 1,000 1,000 1,000 1,000 Total allowance for credit losses $ 96,729 $ 95,814 $ 93,371 $ 89,163 $ 87,083 $ 96,729 $ 87,083 Provision for loan losses $ 8,024 $ 10,109 $ 8,239 $ 4,918 $ 5,307 $ 31,290 $ 30,983 Net charge-offs by category Commercial and industrial $ 5,635 $ 8,237 $ 1,721 $ 1,894 $ 3,540 $ 17,487 $ 7,531 Agricultural (102 ) — 836 514 — 1,248 — Commercial real estate: Office, retail, and industrial (78 ) (1,811 ) (8 ) (848 ) 165 (2,745 ) 4,370 Multi-family (3 ) (2 ) (6 ) (28 ) 17 (39 ) 210 Construction (12 ) (25 ) 27 (222 ) (12 ) (232 ) 78 Other commercial real estate (5 ) (19 ) 228 307 (111 ) 511 2,408 Consumer 1,674 1,286 1,233 1,221 933 5,414 3,933 Total net charge-offs 7,109 7,666 4,031 2,838 4,532 21,644 18,530 Total recoveries included above $ 2,011 $ 2,900 $ 828 $ 3,440 $ 1,489 $ 9,179 $ 4,763 Note: Selected Financial Information footnotes are located at the end of this section.\nFirst Midwest Bancorp, Inc. Selected Financial Information (Unaudited) (Amounts in thousands, except per share data) As of or for the Quarters Ended December 31, September 30, June 30, March 31, December 31, 2017 2017 2017 2017 2016 Asset Quality ratios Non-accrual loans to total loans 0.64 % 0.63 % 0.77 % 0.54 % 0.72 % Non-performing loans to total loans 0.68 % 0.65 % 0.79 % 0.57 % 0.78 % Non-performing assets to total loans plus OREO 0.89 % 0.86 % 1.07 % 0.87 % 1.12 % Non-performing assets to tangible common equity plus allowance for credit losses 7.72 % 7.41 % 9.32 % 7.74 % 9.48 % Non-accrual loans to total assets 0.48 % 0.46 % 0.57 % 0.39 % 0.52 % Allowance for credit losses and net charge-off ratios Allowance for credit losses to total loans (6) 0.93 % 0.92 % 0.91 % 0.89 % 1.06 % Allowance for credit losses to loans, excluding acquired loans 1.07 % 1.09 % 1.10 % 1.11 % 1.11 % Allowance for credit losses to non-accrual loans 144.54 % 147.01 % 117.90 % 164.22 % 146.88 % Allowance for credit losses to non-performing loans 137.25 % 140.87 % 114.91 % 156.63 % 135.44 % Net charge-offs to average loans (2) 0.27 % 0.30 % 0.16 % 0.12 % 0.22 % Footnotes to Selected Financial Information\n(1) See the \"Non-GAAP Reconciliations\" section for the detailed calculation.\n(2) Annualized based on the actual number of days for each period presented.\n(3) Presented on a tax-equivalent basis, assuming a federal income tax rate of 35%.\n(4) Cost of funds expresses total interest expense as a percentage of average total funding sources.\n(5) This measure excludes the impact of revaluations of DTAs related to federal tax reform and changes in Illinois income tax rates for the fourth and third quarters of 2017.\n(6) This ratio includes acquired loans that are recorded at fair value through an acquisition adjustment, which incorporates credit risk as of the acquisition date with no allowance for credit losses being established at that time. As the acquisition adjustment is accreted into income over future periods, an allowance for credit losses is established on acquired loans as necessary to reflect credit deterioration.\n(7) Adjustments to net income for the fourth and third quarters of 2017 include revaluation of DTAs related to federal income tax reform and changes in Illinois income tax rates, a special colleague bonus, a charitable contribution, and certain actions related to the securities portfolio. In addition, net income for certain periods was adjusted for acquisition and integration related expenses associated with completed and pending acquisitions, a lease cancellation fee recognized as a result of the Company's planned 2018 corporate headquarters relocation, and a net gain on a sale-leaseback transaction. For additional discussion of adjustments, see the \"Non-GAAP Financial Information\" section.\nFirst Midwest Bancorp, Inc. Non-GAAP Reconciliations (Unaudited) (Amounts in thousands, except per share data) Quarters Ended Years Ended December 31, September 30, June 30, March 31, December 31, December 31, December 31, 2017 2017 2017 2017 2016 2017 2016 Earnings Per Share Net income $ 2,347 $ 38,235 $ 34,950 $ 22,855 $ 20,718 $ 98,387 $ 92,349 Net income applicable to non-vested restricted shares (6 ) (340 ) (336 ) (234 ) (217 ) (916 ) (1,043 ) Net income applicable to common shares 2,341 37,895 34,614 22,621 20,501 97,471 91,306 Adjustments to net income: DTA revaluation 26,555 (2,846 ) — — — 23,709 — Losses (gains) from securities portfolio repositioning 5,357 (3,197 ) — — — 2,160 — Tax effect of losses (gains) from securities portfolio repositioning (2,196 ) 1,311 — — — (885 ) — Special bonus 1,915 — — — — 1,915 — Tax effect of special bonus (785 ) — — — — (785 ) — Charitable contribution 1,600 — — — — 1,600 — Tax effect of charitable contribution (656 ) — — — — (656 ) — Acquisition and integration related expenses — 384 1,174 18,565 7,542 20,123 14,352 Tax effect of acquisition and integration related expenses — (157 ) (470 ) (7,426 ) (3,017 ) (8,053 ) (5,741 ) Lease cancellation fee — — — — 950 — 950 Tax effect of lease cancellation fee — — — — (380 ) — (380 ) Net gain on sale-leaseback transaction — — — — — — (5,509 ) Tax effect of net gain on sale-leaseback transaction — — — — — — 2,204 Total adjustments to net income 31,790 (4,505 ) 704 11,139 5,095 39,128 5,876 Net income applicable to common shares, adjusted (1) $ 34,131 $ 33,390 $ 35,318 $ 33,760 $ 25,596 $ 136,599 $ 97,182 Weighted-average common shares outstanding: Weighted-average common shares outstanding (basic) 101,766 101,752 101,743 100,411 80,415 101,423 79,797 Dilutive effect of common stock equivalents 21 20 20 21 15 20 13 Weighted-average diluted common shares outstanding 101,787 101,772 101,763 100,432 80,430 101,443 79,810 Basic EPS $ 0.02 $ 0.37 $ 0.34 $ 0.23 $ 0.25 $ 0.96 $ 1.14 Diluted EPS $ 0.02 $ 0.37 $ 0.34 $ 0.23 $ 0.25 $ 0.96 $ 1.14 Diluted EPS, adjusted (1) $ 0.34 $ 0.33 $ 0.35 $ 0.34 $ 0.32 $ 1.35 $ 1.22 Anti-dilutive shares not included in the computation of diluted EPS 190 190 195 343 445 229 494 Note: Non-GAAP Reconciliations footnotes are located at the end of this section.\nFirst Midwest Bancorp, Inc. Non-GAAP Reconciliations (Unaudited) (Amounts in thousands, except per share data) As of or for the Quarters Ended Years Ended December 31, September 30, June 30, March 31, December 31, December 31, December 31, 2017 2017 2017 2017 2016 2017 2016 Return on Average Common and Tangible Common Equity Net income applicable to common shares $ 2,341 $ 37,895 $ 34,614 $ 22,621 $ 20,501 $ 97,471 $ 91,306 Intangibles amortization 1,806 1,931 2,163 1,965 1,207 7,865 4,682 Tax effect of intangibles amortization (740 ) (792 ) (865 ) (786 ) (483 ) (3,183 ) (1,873 ) Net income applicable to common shares, excluding intangibles amortization 3,407 39,034 35,912 23,800 21,225 102,153 94,115 Total adjustments to net income 31,790 (4,505 ) 704 11,139 5,095 39,128 5,876 Net income applicable to common shares, excluding intangible amortization, adjusted (1) $ 35,197 $ 34,529 $ 36,616 $ 34,939 $ 26,320 $ 141,281 $ 99,991 Average stockholders' equity $ 1,880,265 $ 1,855,647 $ 1,830,536 $ 1,763,538 $ 1,269,993 $ 1,832,880 $ 1,236,606 Less: average intangible assets (749,700 ) (751,366 ) (753,521 ) (750,589 ) (367,328 ) (751,292 ) (363,112 ) Average tangible common equity $ 1,130,565 $ 1,104,281 $ 1,077,015 $ 1,012,949 $ 902,665 $ 1,081,588 $ 873,494 Return on average common equity (3) 0.49 % 8.10 % 7.58 % 5.20 % 6.42 % 5.32 % 7.38 % Return on average tangible common equity (3) 1.20 % 14.02 % 13.37 % 9.53 % 9.35 % 9.44 % 10.77 % Return on average tangible common equity, adjusted (1)(3) 12.35 % 12.41 % 13.64 % 13.99 % 11.60 % 13.06 % 11.45 % Return on Average Assets Net Income $ 2,347 $ 38,235 $ 34,950 $ 22,855 $ 20,718 $ 98,387 $ 92,349 Total adjustments to net income 31,790 (4,505 ) 704 11,139 5,095 39,128 5,876 Net income, adjusted (1) $ 34,137 $ 33,730 $ 35,654 $ 33,994 $ 25,813 $ 137,515 $ 98,225 Average assets $ 14,118,625 $ 14,155,766 $ 13,960,843 $ 13,673,125 $ 11,380,108 $ 13,978,693 $ 10,934,240 Return on average assets (3) 0.07 % 1.07 % 1.00 % 0.68 % 0.72 % 0.70 % 0.84 % Return on average assets, adjusted (1)(3) 0.96 % 0.95 % 1.02 % 1.01 % 0.90 % 0.98 % 0.90 % Efficiency Ratio Calculation Noninterest expense $ 102,326 $ 97,190 $ 99,751 $ 116,642 $ 92,669 $ 415,909 $ 339,500 Less: Net OREO expense (695 ) (657 ) (1,631 ) (1,700 ) (925 ) (4,683 ) (3,024 ) Special bonus (1,915 ) — — — — (1,915 ) — Charitable contribution (1,600 ) — — — — (1,600 ) — Acquisition and integration related expenses — (384 ) (1,174 ) (18,565 ) (7,542 ) (20,123 ) (14,352 ) Lease cancellation fee — — — — (950 ) — (950 ) Total $ 98,116 $ 96,149 $ 96,946 $ 96,377 $ 83,252 $ 387,588 $ 321,174 Tax-equivalent net interest income (2) $ 121,154 $ 121,935 $ 119,625 $ 117,251 $ 90,088 $ 479,965 $ 358,334 Fee-based revenues 37,786 38,305 41,228 37,847 37,107 155,166 145,101 Add: Other income, excluding BOLI income 625 422 2,022 844 1,310 3,913 3,635 BOLI Income 1,851 1,424 1,411 1,260 971 5,946 3,647 Tax-equivalent adjustment of BOLI 1,234 949 941 840 647 3,964 2,431 Total $ 162,650 $ 163,035 $ 165,227 $ 158,042 $ 130,123 $ 648,954 $ 513,148 Efficiency ratio 60.32 % 58.97 % 58.67 % 60.98 % 63.98 % 59.73 % 62.59 % Note: Non-GAAP Reconciliations footnotes are located at the end of this section.\nFirst Midwest Bancorp, Inc. Non-GAAP Reconciliations (Unaudited) (Amounts in thousands, except per share data) As of or for the Quarters Ended Years Ended December 31, September 30, June 30, March 31, December 31, December 31, December 31, 2017 2017 2017 2017 2016 2017 2016 Risk-Based Capital Data Common stock $ 1,123 $ 1,123 $ 1,123 $ 1,123 $ 913 $ 1,123 $ 913 Additional paid-in capital 1,031,870 1,029,002 1,025,607 1,022,417 498,937 1,031,870 498,937 Retained earnings 1,074,990 1,082,921 1,056,072 1,030,403 1,016,674 1,074,990 1,016,674 Treasury stock, at cost (210,073 ) (209,880 ) (209,392 ) (208,946 ) (218,534 ) (210,073 ) (218,534 ) Goodwill and other intangible assets, net of deferred tax liabilities (743,327 ) (738,645 ) (740,236 ) (742,012 ) (356,477 ) (743,327 ) (356,477 ) Disallowed deferred tax assets (644 ) (275 ) (472 ) (1,150 ) (198 ) (644 ) (198 ) CET1 capital 1,153,939 1,164,246 1,132,702 1,101,835 941,315 1,153,939 941,315 Trust preferred securities 50,690 50,690 50,690 50,690 50,690 50,690 50,690 Other disallowed deferred tax assets (161 ) (69 ) (118 ) (287 ) (132 ) (161 ) (132 ) Tier 1 capital 1,204,468 1,214,867 1,183,274 1,152,238 991,873 1,204,468 991,873 Tier 2 capital 243,656 242,652 240,121 235,825 233,656 243,656 233,656 Total capital $ 1,448,124 $ 1,457,519 $ 1,423,395 $ 1,388,063 $ 1,225,529 $ 1,448,124 $ 1,225,529 Risk-weighted assets $ 11,920,372 $ 12,362,833 $ 12,180,416 $ 12,095,592 $ 10,019,434 $ 11,920,372 $ 10,019,434 Adjusted average assets $ 13,404,998 $ 13,439,744 $ 13,245,499 $ 12,965,450 $ 11,036,835 $ 13,404,998 $ 11,036,835 Total capital to risk-weighted assets 12.15 % 11.79 % 11.69 % 11.48 % 12.23 % 12.15 % 12.23 % Tier 1 capital to risk-weighted assets 10.10 % 9.83 % 9.71 % 9.53 % 9.90 % 10.10 % 9.90 % CET1 to risk-weighted assets 9.68 % 9.42 % 9.30 % 9.11 % 9.39 % 9.68 % 9.39 % Tier 1 capital to average assets 8.99 % 9.04 % 8.93 % 8.89 % 8.99 % 8.99 % 8.99 % Tangible Common Equity Stockholders' equity $ 1,864,874 $ 1,865,130 $ 1,836,843 $ 1,804,733 $ 1,257,080 $ 1,864,874 $ 1,257,080 Less: goodwill and other intangible assets (754,757 ) (750,436 ) (752,413 ) (754,621 ) (366,876 ) (754,757 ) (366,876 ) Tangible common equity 1,110,117 1,114,694 1,084,430 1,050,112 890,204 1,110,117 890,204 Less: AOCI 33,036 38,036 36,567 40,264 40,910 33,036 40,910 Tangible common equity, excluding AOCI $ 1,143,153 $ 1,152,730 $ 1,120,997 $ 1,090,376 $ 931,114 $ 1,143,153 $ 931,114 Total assets $ 14,077,052 $ 14,267,142 $ 13,969,140 $ 13,773,471 $ 11,422,555 $ 14,077,052 $ 11,422,555 Less: goodwill and other intangible assets (754,757 ) (750,436 ) (752,413 ) (754,621 ) (366,876 ) (754,757 ) (366,876 ) Tangible assets $ 13,322,295 $ 13,516,706 $ 13,216,727 $ 13,018,850 $ 11,055,679 $ 13,322,295 $ 11,055,679 Tangible common equity to tangible assets 8.33 % 8.25 % 8.20 % 8.07 % 8.05 % 8.33 % 8.05 % Tangible common equity, excluding AOCI, to tangible assets 8.58 % 8.53 % 8.48 % 8.38 % 8.42 % 8.58 % 8.42 % Tangible common equity to risk-weighted assets 9.31 % 9.02 % 8.90 % 8.68 % 8.88 % 9.31 % 8.88 % Footnotes to Non-GAAP Reconciliations\n(1) Adjustments to net income for the fourth and third quarters of 2017 include revaluation of DTAs related to federal income tax reform and changes in Illinois income tax rates, a special colleague bonus, a charitable contribution, and certain actions related to the securities portfolio. In addition, net income for certain periods was adjusted for acquisition and integration related expenses associated with completed and pending acquisitions, a lease cancellation fee recognized as a result of the Company's planned 2018 corporate headquarters relocation, and a net gain on a sale-leaseback transaction. For additional discussion of adjustments, see the \"Non-GAAP Financial Information\" section.\n(2) Presented on a tax-equivalent basis, assuming a federal tax rate of 35%.\n(3) Annualized based on the actual number of days for each period presented.\nSource:First Midwest Bancorp, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/3811de16-6ef9-4f0c-a333-6a8bd7e1d814", "http://www.firstmidwest.com/investorrelations"], "published": "2018-01-30T03:32:00.000+02:00", "crawled": "2018-01-30T07:10:12.046+02:00", "highlightTitle": ""}