{"organizations": [], "uuid": "7702b16697f63d07d6fe696b4cf0c3d5e71c5351", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/india", "section_title": "India", "url": "https://www.reuters.com/article/us-india-women-taboos/not-a-dirty-word-indian-girls-shatter-menstruation-myths-idUSKBN1FJ169", "country": "US", "domain_rank": 408, "title": "Not a dirty word: Indian girls shatter menstruation myths", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-30T17:44:00.000+02:00", "replies_count": 0, "uuid": "7702b16697f63d07d6fe696b4cf0c3d5e71c5351"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-india-women-taboos/not-a-dirty-word-indian-girls-shatter-menstruation-myths-idUSKBN1FJ169", "ord_in_thread": 0, "title": "Not a dirty word: Indian girls shatter menstruation myths", "locations": [], "entities": {"persons": [{"name": "dhanashree kantaram dhere", "sentiment": "none"}, {"name": "dhere", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "maharashtra", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MURBAD, India (Thomson Reuters Foundation) - After attending a menstruation myth-busting class in her village in India, 13-year-old Dhanashree Kantaram Dhere decided to test her newfound knowledge by touching a statue of a Hindu god in her family home.\nAlthough it was believed to be bad luck, nothing terrible happened.\nAccording to widely-held beliefs in India, menstruating women are impure and should not enter temples, take part in religious ceremonies, or prepare certain foods, among other restrictions.\nThose taboos are being challenged in states including Maharashtra, where the government late last year ordered all public schools to begin teaching the truth about periods.\nDhere began menstruating four months ago, but unlike many women in India she was taught that it was healthy. Her mother was not convinced though, and refused to let her help prepare papadums, which are thin, crispy, cracker-like snacks.\n“I learned in school that nothing would happen if I touched food, so I did,” she recalled. “But I was worried and watched. Nothing happened.”\nEmboldened with her first experiment, Dhere decided to test the taboo further.\n“So, I also touched a god’s idol after that,” she said.\nThe admission drew gasps from fellow students, who were discussing menstruation at their school in Kheware Mehaj, a small village about 150 km from Mumbai.\nThey are among the 300,000 adolescent girls who have taken classes during the past two years in seven Maharashtra districts, according to Yusuf Kabir of the United Nations children’s agency (UNICEF).\nUNICEF started the menstrual hygiene program five years ago in Maharashtra’s Jalna and Aurangabad districts, and is now partnered with the government to expand it to schools across the state.\nTwo years ago, the federal government incorporated the program into its Clean India Mission, which aims to clean up streets and roads in communities throughout the country.\nVennelaganti Radha, joint secretary in the federal Ministry of Drinking Water and Sanitation, said the menstrual hygiene program is now being implemented in other states in partnership with various non-governmental organizations.\n“But Maharashtra is a leader in this,” she said. “UNICEF and local officials have done great work,”\nBATTLING DISCRIMINATION The first challenge is the teachers, who are in charge of incorporating the class into the curriculum. Trainers from UNICEF have to convince them that there is nothing unclean about menstruation.\n“The teachers had a lot of inhibitions and believed the myths themselves,” said Bharathy Tahiliani, a rights campaigner who drafted the menstruation lesson plans.\n“Around 80 percent of the teachers believed that menstrual blood is impure,” she told the Thomson Reuters Foundation.\nShe said it takes multiple training sessions to get them comfortable talking to students about their own menstruation experiences.\nOnce they are ready, teachers begin running the program over the course of six-months. The students are all female except for one session in which boys watch an educational video.\nIn addition to traditional textbook learning, the course includes games, songs and drama.\nThe course is desperately needed, according to Tarulata Dhanke, a physician and government health officer who worked for 14 years in a village in Maharashtra and is now overseeing the program’s implementation in Thane district.\n“I would get girls seeking stitches in their vagina when they first got their period,” she said. “They had no idea why they were bleeding suddenly.”\nThose raising awareness across India will soon get a boost with the release of “PadMan”, a film scheduled for release next week in which a popular action hero uses a sanitary pad to fight discrimination faced by women during their periods. [nL4N1OJ2IW]\nHEALTH RISKS In addition to helping girls feel good about getting their periods, the lessons may convince them to stay in school and save them from sickness.\nPeriods are among the leading factors for girls to drop out of school, often to get married early. It is also common to skip school during menstruation, largely due to lack of toilets or safe places to change their pads.\nStudies have shown the vulnerability of menstruating women to infections of the urinary and reproductive tract due to unhygienic practices.\nThis is partly due to unhygienic methods of cleaning cloth, which is used by more than 60 percent of Indian women aged 15 to 24 during their periods, according to recent government data.\nPads are not easily available in many rural parts of the country, but taboos around menstruation mean that women are ashamed to openly wash and dry cloth.\nHealth experts say that can lead to infection, because the cloth needs to be dried in direct sunlight in order more effectively to kill germs.\nHarshala Anil Suroshe, 13, said she used to hide her “period cloth” after washing it “so nobody could see”. But that has changed since her she began the menstrual hygiene lessons at school.\n“After use, I wash the cloth and dry it in the sun,” she said. “I showed my mother and sister too that this is how it is done.”\nReporting by Roli Srivastava @Rolionaroll; Editing by Jared Ferrie. Please credit Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women’s rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T17:44:00.000+02:00", "crawled": "2018-01-30T16:34:08.012+02:00", "highlightTitle": ""}