{"organizations": [], "uuid": "01c1593e8d7ae6082ecfe5386bd16dc71c9cc73f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XF146_3nO3p_TOP_20180129050552.jpg", "site_section": "http://online.wsj.com/xml/rss/3_7031.xml", "section_title": "WSJ.com: Markets", "url": "https://www.wsj.com/articles/dollars-drop-fuels-a-fire-thats-already-raging-1517220852", "country": "US", "domain_rank": 387, "title": "Dollar’s Drop Fuels a Fire That’s Already Raging", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T12:14:00.000+02:00", "replies_count": 0, "uuid": "01c1593e8d7ae6082ecfe5386bd16dc71c9cc73f"}, "author": "Richard Barley", "url": "https://www.wsj.com/articles/dollars-drop-fuels-a-fire-thats-already-raging-1517220852", "ord_in_thread": 0, "title": "Dollar’s Drop Fuels a Fire That’s Already Raging", "locations": [], "entities": {"persons": [{"name": "mario draghi", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "draghi", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "ice", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS A weak dollar has been great for markets . A much weaker dollar could be too much of a good thing.\nThe decline in the U.S. dollar in 2017—down 10% on ICE’s index—accompanied stronger global growth, in particular in Europe, and spurred risk appetite nearly everywhere. A broad measure of stocks around the world, the MSCI ACWI developed- and emerging-market stock index, rose 21.6% last year.\nBut last week’s quick-fire moves in the dollar might offer reason for caution in the longer run. The currency fell and rose rapidly as Treasury Secretary Steven Mnuchin, European Central Bank President Mario Draghi and President Donald Trump all weighed in with conflicting takes on foreign-exchange rates.\nThe end result is a sharply weaker dollar, and confusion. That might not sound like so much of a problem: if it was good news in 2017, why not now? But the pace and bumpy nature of the move should be watched. The trend for a lower dollar was already clear. But the conflicting discourse may fuel broader concerns about U.S. policy on trade. Mr. Draghi said worries among eurozone central bankers went beyond the exchange rate to cover the “overall status of international relations right now.”\nInvestors don’t appear fazed. Stocks are up , corporate-bond yield spreads have compressed from already tight levels, and a modest rise in government-bond yields hasn’t derailed markets.\nA much weaker dollar could spur further risk-taking in markets where worries about valuations are already rife. Photo: philippe huguen/Agence France-Presse/Getty Images But a further rapid fall in the dollar may yet cause headaches for central bankers who have created the conditions in which markets are partying. In the U.S., financial conditions have been loosening even as the Federal Reserve lifts rates. At some point, that might cause a reappraisal of policy, potentially upsetting markets that have come to rely on the idea that U.S. rates will peak much lower than in the past.\nMeanwhile, a much weaker dollar could spur further risk-taking in markets where worries about valuations are already rife. The move up in stocks has accelerated in 2018, with the MSCI ACWI up another 7.3% already. That might bring more debate about the risk of financial-market instability: after many years in which ultraloose monetary policy appeared not to bring dividends, it is suddenly having a turbocharged effect. Despite the acceleration in global growth and buoyant markets, even U.S. policy rates are still negative in real terms.\nThe dollar’s decline thus bears watching. If the pace of the decline were to moderate, and be matched by strong global growth, then it is more benign. Otherwise, the dollar could test markets in unexpected ways.\nWrite to Richard Barley at richard.barley@wsj.com", "external_links": [], "published": "2018-01-29T12:14:00.000+02:00", "crawled": "2018-01-29T13:08:11.012+02:00", "highlightTitle": ""}