{"organizations": [], "uuid": "01ecf4220223a603a9872d321609b60429b6fd95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224182951&w=1200&r=LYNXMPEE0L1GU", "site_section": "http://feeds.reuters.com/reuters/INhealth\r", "section_title": "Reuters: Health", "url": "https://in.reuters.com/article/us-biotech-m-a/biotech-ma-takes-off-as-sanofi-and-celgene-spend-20-billion-idINKBN1FB20V", "country": "US", "domain_rank": 408, "title": "Biotech M&A takes off as Sanofi and Celgene spend $20 billion", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T17:08:00.000+02:00", "replies_count": 0, "uuid": "01ecf4220223a603a9872d321609b60429b6fd95"}, "author": "", "url": "https://in.reuters.com/article/us-biotech-m-a/biotech-ma-takes-off-as-sanofi-and-celgene-spend-20-billion-idINKBN1FB20V", "ord_in_thread": 0, "title": "Biotech M&A takes off as Sanofi and Celgene spend $20 billion", "locations": [], "entities": {"persons": [{"name": "ben hirschler", "sentiment": "none"}, {"name": "juno", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "bioverativ", "sentiment": "none"}], "organizations": [{"name": "sanofi", "sentiment": "negative"}, {"name": "biotech m&a", "sentiment": "negative"}, {"name": "celgene", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Biotech deal activity exploded on Monday with French drugmaker Sanofi and U.S.-based Celgene spending a combined total of more than $20 billion to add new products for hemophilia and cancer to their medicine cabinets.\nThe acquisitions will fuel expectations for a busy year of mergers and acquisitions (M&A) as large drugmakers snap up promising assets from smaller rivals to help revive growth.\nSanofi agreed to buy U.S. hemophilia expert Bioverativ for $11.6 billion, its biggest deal for seven years, while Celgene is paying about $9 billion for the 90 percent of cancer specialist Juno Therapeutics it does not already own.\nThe two cash deals were agreed at a prices of $105 and $87 per share respectively. Shares in Bioverativ leaped 63 percent in early U.S. trading and Juno jumped 27 percent, while Sanofi fell 4 percent and Celgene 1.5 percent on news of the deals.\n“The signs are good for biotech deal activity in 2018,” said Chris Stirling, head of KPMG’s global life sciences practice.\nBig companies are under pressure from declining sales of older treatments and many are struggling to find sufficient high-value replacements from within their own laboratories, making buying in products and know-how an attractive option.\n“It takes a long time to introduce technology that makes a significant difference, and in the interim CEOs are looking at any way to get their hands on product where they believe they can make a decent return,” Stirling said. “They’ve got to be seen to be doing things, otherwise they really struggle to convince investors.”\nBoth Sanofi and Celgene had been seen as likely multibillion-dollar acquirers.\nBUSY START\nFILE PHOTO: A scientist prepares protein samples for analysis in a lab at the Institute of Cancer Research in Sutton, Britain, July 15, 2013. REUTERS/Stefan Wermuth/File Photo The French group, which faces mounting competition in its key diabetes unit, lost out on buying U.S. cancer firm Medivation to Pfizer in 2016, and also missed acquiring Swiss-based Actelion, which was bought by Johnson & Johnson last year.\nCelgene, meanwhile, needs to dilute its reliance on cancer drug Revlimid. It had been widely tipped as a buyer for Juno, whose technology is at the cutting edge of cancer treatment.\nJuno is one of several pioneers of a system to modify immune cells to fight tumors and its JCAR017 product is likely to reach the market in 2019, behind rival approval treatments from Novartis and Gilead.\nFILE PHOTO:A scientist prepares protein samples for analysis in a lab at the Institute of Cancer Research in Sutton, July 15, 2013. REUTERS/Stefan Wermuth/File Photo. Gilead only recently jumped into the space after acquiring Kite Pharma last year for $12 billion in one of the few standout deals during a relatively subdued year for biotech M&A.\nDespite the late start, Celgene believes JCAR017 could have peak annual sales of $3 billion and it sees the acquisition being “incrementally additive” to net product sales in 2020. Following setbacks at Juno, Celgene is paying less than the $93 a share it stumped up for just under 10 percent of the company in 2015.\nSanofi expects Bioverativ, which was spun off from Biogen last year, can deliver commercial success despite rapid changes in the $10 billion hemophilia market posed by a novel drug from Roche and the potential of gene therapy to provide a one-time cure.\nThose changes have spooked some investors but Sanofi is betting that the factor replacement therapies made by Bioverativ will remain the standard of care for many years and it expects the deal to boost earnings immediately.\nMonday’s two big acquisitions build on an already busy start for 2018 biotech M&A, with Celgene earlier agreeing to acquire privately-held Impact Biomedicines for as much as $7 billion, including $1.1 billion upfront, and Novo Nordisk bidding $3.1 billion for Belgium’s Ablynx.\nSeparate reports this month by consultancy EY and law firm Baker McKenzie both predicted a significant rise in life sciences M&A in 2018, helped by U.S. tax changes that may lift big companies’ appetite for deals.\nLazard advised Sanofi on its deal, while Guggenheim Securities and J.P. Morgan worked for Bioverativ. J.P. Morgan also worked for Celgene and Morgan Stanley for Juno.\nReporting by Ben Hirschler; Editing by Edmund Blair\n ", "external_links": [], "published": "2018-01-22T17:08:00.000+02:00", "crawled": "2018-01-22T17:34:52.018+02:00", "highlightTitle": ""}