{"organizations": [], "uuid": "5c345b5cd84f3cfa700f8c8f06f495fae4758eae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 615, "shares": 615, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225662174&w=1200&r=LYNXMPEE0Q02X", "site_section": "http://feeds.reuters.com/Reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/usa-alaska-pebblemine/in-reversal-u-s-epa-halts-approval-process-for-alaska-mine-project-idUSKBN1FG03M", "country": "US", "domain_rank": 408, "title": "In reversal, U.S. EPA halts approval process for Alaska mine project", "performance_score": 6, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T10:59:00.000+02:00", "replies_count": 0, "uuid": "5c345b5cd84f3cfa700f8c8f06f495fae4758eae"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-alaska-pebblemine/in-reversal-u-s-epa-halts-approval-process-for-alaska-mine-project-idUSKBN1FG03M", "ord_in_thread": 0, "title": "In reversal, U.S. EPA halts approval process for Alaska mine project", "locations": [], "entities": {"persons": [{"name": "scott pruitt", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "pruitt", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "alaska", "sentiment": "none"}, {"name": "bristol bay", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "u.s. environmental protection agency", "sentiment": "negative"}, {"name": "epa", "sentiment": "negative"}, {"name": "pebble limited partnership", "sentiment": "none"}, {"name": "northern dynasty minerals ltd", "sentiment": "none"}, {"name": "u.s. army corps of engineers", "sentiment": "none"}, {"name": "first quantum minerals ltd", "sentiment": "none"}, {"name": "pebble mine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 2:59 AM / Updated 17 hours ago In reversal, U.S. EPA halts approval process for Alaska mine project Reuters Staff 3 Min Read \nWASHINGTON (Reuters) - In a surprise move, the U.S. Environmental Protection Agency reversed itself on Friday and halted the approval process for the proposed Pebble Mine copper and gold mine project in southwest Alaska’s Bristol Bay region. \n“It is my judgment at this time that any mining projects in the region likely pose a risk to the abundant natural resources that exist there,” EPA Administrator Scott Pruitt said in a statement. \nPresident Donald Trump has championed increased domestic mining and the EPA’s decision to halt the Pebble Mine’s approval process comes as a surprise. \n“Until we know the full extent of that risk, those natural resources and world-class fisheries deserve the utmost protection,” Pruitt said. \nThe Obama administration blocked the proposed mine in 2014 over environmental concerns. Last year, Pruitt reversed that decision, allowing the Canadian company behind the mine project to apply for a permit from the U.S. Army Corps of Engineers. \nThe Pebble Limited Partnership, comprising Canadian miners Northern Dynasty Minerals Ltd and First Quantum Minerals Ltd, is planning to mine 1.2 billion tons of material, including 287 million pounds of copper. \nNorthern Dynasty Minerals said in a statement the permitting process for the mine being overseen by the U.S. Army Corps of Engineers would continue. \n“We expect the permitting process for Pebble to advance expeditiously over the next few years, and that a draft and final (Environmental Impact Statement) will be completed upon which final permitting decisions for the Pebble Project will be made,” Northern Dynasty Chief Executive Officer Ron Thiessen said. \nEnvironmentalists, commercial and sport fishermen, many Alaska Native tribal organizations and even some Republican politicians have all criticized the project, which would be built on land near Lake Clark National Park. \nAlaska Governor Bill Walker, an independent, applauded the decision and thanked Pruitt “for listening to my input and that of thousands of Alaskans” who oppose the mine. \nPruitt indicated the mine could ultimately be approved. \n“This decision neither deters nor derails the application process of Pebble Limited Partnership’s proposed project,” he said. \n“The project proponents continue to enjoy the protection of due process and the right to proceed. However, their permit application must clear a high bar, because EPA believes the risk to Bristol Bay may be unacceptable,” he said. Reporting by Eric Beech; Editing by Eric Walsh and Cynthia Osterman", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-27T10:59:00.000+02:00", "crawled": "2018-01-27T06:28:56.012+02:00", "highlightTitle": ""}