{"organizations": [], "uuid": "0706c3ad40d35d5190f9d28c2c9ea36f6b81e955", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222209290&w=1200&r=LYNXMPEE0E1B4", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-nigeria-security-benue/nigerias-buhari-vows-to-punish-all-those-behind-ethnic-violence-idUSKBN1F42FK", "country": "US", "domain_rank": 408, "title": "Nigeria's Buhari vows to punish all those behind ethnic violence", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T20:27:00.000+02:00", "replies_count": 0, "uuid": "0706c3ad40d35d5190f9d28c2c9ea36f6b81e955"}, "author": "", "url": "https://www.reuters.com/article/us-nigeria-security-benue/nigerias-buhari-vows-to-punish-all-those-behind-ethnic-violence-idUSKBN1F42FK", "ord_in_thread": 0, "title": "Nigeria's Buhari vows to punish all those behind ethnic violence", "locations": [], "entities": {"persons": [{"name": "buhari", "sentiment": "negative"}, {"name": "muhammadu buhari", "sentiment": "none"}, {"name": "fulani", "sentiment": "none"}], "locations": [{"name": "nigeria", "sentiment": "none"}, {"name": "abuja", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ABUJA (Reuters) - Nigeria will punish all those behind an outbreak of deadly clashes between cattle herders and farmers, President Muhammadu Buhari said on Monday pushing back at accusations that he failed to take action against members of his own ethnic group.\nAt least 83 people have been killed since the start of the new year in violence between the mainly Christian farmers and the semi-nomadic herders, who are mostly Muslims from Buhari’s Fulani ethnic group.\nThe outbreak of violence, mostly in the central state of Benue, has become increasingly political ahead of elections in February 2019, with Buhari’s opponents accusing him of failing to take action against the herdsmen.\n“President Buhari said all those involved in the conflict that culminated in loss of lives would not escape justice, including any illegally armed militia in the state,” said a statement released by Nigeria’s presidency, after Buhari spoke to a delegation of Benue political leaders.\nNigeria, Africa’s most populous country, is home to 250 ethnic groups, about evenly divided between Christians who mainly live in the south and Muslims who mainly live in the north. Central states such as Benue have often seen violence over religious, ancestral and cultural differences.\nFarmers caught up in the clashes say herdsmen, who roam West Africa in search of pasture and often travel in and out of Nigeria through porous borders, are armed with guns and cutlasses. Groups representing herdsmen have also accused farmers of violent attacks in the last few years.\n“I assure you that the police, the Department of State Service and other security agencies had been directed to ensure that all those behind the mayhem get punished,” Buhari told the delegation, according to the statement.\nThose who attended the meeting in the capital, Abuja, included the Benue state governor, members of parliament and traditional rulers. Buhari, a former military ruler who was elected in 2015 after vowing to improve security, has not yet said whether he will seek a new term next year.\nLast week his spokesman said the suggestion that Buhari was not taking action regarding the herdsmen because of his ethnicity was “disturbing”, adding that such clashes predated Buhari’s administration.\nReporting by Felix Onuah; Writing by Alexis Akwagyiram; Editing by Peter Graff\n ", "external_links": [], "published": "2018-01-15T20:27:00.000+02:00", "crawled": "2018-01-15T20:40:42.003+02:00", "highlightTitle": ""}