{"organizations": [], "uuid": "78283a950eb96625f001f4f6eece758a98453f18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222509195&w=1200&r=LYNXMPEE0F1FL", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-immigration-court/trump-administration-to-appeal-dreamer-immigrant-ruling-idUSKBN1F52II", "country": "US", "domain_rank": 408, "title": "Trump administration to appeal 'Dreamer' immigrant ruling", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T21:30:00.000+02:00", "replies_count": 0, "uuid": "78283a950eb96625f001f4f6eece758a98453f18"}, "author": "", "url": "https://www.reuters.com/article/us-usa-immigration-court/trump-administration-to-appeal-dreamer-immigrant-ruling-idUSKBN1F52II", "ord_in_thread": 0, "title": "Trump administration to appeal 'Dreamer' immigrant ruling", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "lawrence hurley", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "will dunham", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "u.s. justice department", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "san francisco-based 9th u.s. circuit court of appeals", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - The U.S. Justice Department on Tuesday said it will ask the Supreme Court to overturn a judge’s ruling last week that blocked President Donald Trump’s move to end a program that protects hundreds of thousands of immigrants brought to the United States illegally as children.\nThe Trump administration will file an appeal of the judge’s injunction directly with the conservative-majority Supreme Court as well as seeking to appeal to the San Francisco-based 9th U.S. Circuit Court of Appeals, the department said.\nThe Republican president in September rescinded the Deferred Action for Childhood Arrivals (DACA), a program put in place in 2012 by his Democratic predecessor Barack Obama, effective in March. A variety of Democratic state attorneys general, organizations and individuals challenged Trump’s action in multiple federal courts.\nThe administration is challenging a Jan. 9 decision by San Francisco-based U.S. District Judge William Alsup, who ruled that DACA must remain in place while the litigation is resolved.\nThe Justice Department is not filing an emergency application that, if successful, would result in the judge’s ruling being put on hold, which means the program will remain in effect during the litigation.\n“It defies both law and common sense for DACA ... to somehow be mandated nationwide by a single district court in San Francisco,” Attorney General Jeff Sessions said in a statement.\nProtesters calling for an immigration bill addressing the so-called Dreamers, young adults who were brought to the United States as children, crowd in to the office of Senator Chuck Grassley on Capitol Hill in Washington, U.S., January 16, 2018. REUTERS/Joshua Roberts “We are now taking the rare step of requesting direct review on the merits of this injunction by the Supreme Court so that this issue may be resolved quickly and fairly for all the parties involved,” Sessions added.\nSince the program was implemented, about 800,000 young adults dubbed Dreamers, mostly Hispanic, have been protected from deportation and allowed to work legally in the United States under DACA. As of September, when the most recent figures were made available, 690,000 young adults were protected under the program.\nSlideshow (2 Images) “Dreamers came out of the shadows based on a representation that if they qualified for the status, they would be allowed to stay in the country. Now they’re being used as bargaining chips in a high-stakes immigration policy debate in which their status should have no part,” said Mark Rosenbaum, an attorney for the public interest law firm Public Counsel, which represents six DACA recipients in the case.\nAlsup’s ruling came during negotiations between Trump and congressional leaders over immigration policy. Those talks fell apart after Trump rejected a bipartisan deal and provoked outrage with his reported use of vulgar language to describe African countries in a meeting with lawmakers on immigration.\nThe Justice Department’s move to go directly to the Supreme Court is unusual as the administration is essentially seeking to circumvent the 9th Circuit appeals court, which has previously ruled against it over Trump’s travel bans on people entering the United States from seven Muslim-majority countries.\nEven if the high court agrees to take up the case, it is unlikely to rule until its next term, which starts in October and runs until June 2019.\nReporting by Lawrence Hurley; Additional reporting by Dan Levine; Editing by Will Dunham; Editing by Will Dunham\n ", "external_links": [], "published": "2018-01-16T21:30:00.000+02:00", "crawled": "2018-01-16T21:39:40.054+02:00", "highlightTitle": ""}