{"organizations": [], "uuid": "c539107ed7b25818c3f7f1ebdd66f1b2e02eab8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 172, "shares": 172, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218896360&w=1200&r=LYNXMPEE010XU", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-costarica-crash/executive-at-top-hedge-fund-among-costa-rica-crash-victims-idUSKBN1ER1RT", "country": "US", "domain_rank": 408, "title": "Executive at top hedge fund among Costa Rica crash victims", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T23:43:00.000+02:00", "replies_count": 0, "uuid": "c539107ed7b25818c3f7f1ebdd66f1b2e02eab8b"}, "author": "", "url": "https://www.reuters.com/article/us-costarica-crash/executive-at-top-hedge-fund-among-costa-rica-crash-victims-idUSKBN1ER1RT", "ord_in_thread": 0, "title": "Executive at top hedge fund among Costa Rica crash victims", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN JOSE (Reuters) - A senior executive at the world’s largest hedge fund, Bridgewater Associates, was among 12 killed when their plane crashed and exploded Sunday in Costa Rica, according to Bridgewater Associates founder Ray Dalio. \n“The Bridgewater family lost Bruce Steinberg (a senior investor at Bridgewater and a wonderful man) and his family in a plane crash in Costa Rica,” Dalio posted on Twitter. \nBridgewater Associates, based in Westport, Connecticut, manages $160 billion for about 350 institutional clients such as public and private pension funds, sovereign wealth funds and central banks, according to its website. \nIn Costa Rica, civil aviation authorities were investigating the plane crash that occurred shortly after takeoff from the airport at the popular beach town of Punta Islita. The Cessna 208B Grand Caravan aircraft was bound for the capital, San Jose. \nThe other victims were Steinberg’s wife, Irene, and their three sons - Zachary, William and Matthew - as well as five other U.S. citizens and two Costa Rican crew members. \nMichael Soto, a Costa Rican police spokesman, said on Tuesday that various possible causes for the crash such as weather, mechanical failure or human failure were still being investigated. \nSoto said forensic pathologists and dentists had begun autopsies on the 12 badly burned bodies and that it could take two months or more to finish DNA identification tests. \nThe work was difficult because of the temperatures to which the bodies were subjected, he added. \nReporting by Enrique Andres Pretel in San Jose and Stefanie Eschenbacher in Mexico City; Editing by Jonathan Oatis\n ", "external_links": [], "published": "2018-01-02T23:43:00.000+02:00", "crawled": "2018-01-03T00:05:35.002+02:00", "highlightTitle": ""}