{"organizations": [], "uuid": "2067e6e864df3297e2fc4e76505ab85bd405a6dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/17/reuters-america-u-s-consumer-agency-launches-policy-review-under-trump-appointee.html", "country": "US", "domain_rank": 767, "title": "U.S. consumer agency launches policy review under Trump appointee", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T22:46:00.000+02:00", "replies_count": 0, "uuid": "2067e6e864df3297e2fc4e76505ab85bd405a6dc"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/17/reuters-america-u-s-consumer-agency-launches-policy-review-under-trump-appointee.html", "ord_in_thread": 0, "title": "U.S. consumer agency launches policy review under Trump appointee", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mulvaney", "sentiment": "none"}, {"name": "mick mulvaney", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "u.s. consumer financial protection bureau", "sentiment": "negative"}, {"name": "cfpb", "sentiment": "none"}, {"name": "bureau", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan 17 (Reuters) - The U.S. Consumer Financial Protection Bureau on Wednesday launched a public review of its operations, indicating broad changes could be coming to the agency after U.S. President Donald Trump appointed an interim director.\nThe regulator, which came under the control of Trump's budget director Mick Mulvaney in November, said it would be seeking comment on its \"enforcement, supervision, rulemaking, market monitoring, and education activities.\"\nEstablished under President Barack Obama, the agency has become a partisan lightning rod as Democrats see it as a critical consumer watchdog while Republicans regard it as an excessively powerful bureaucracy.\nUnder new leadership, it is natural for the Bureau to critically examine its policies and practices to ensure they align with the Bureaus statutory mandate,\" Mulvaney, a vocal critic of the CFPB when he served as a Republican lawmaker, said in a statement.\nThe CFPB will start its review seeking public comment on how the agency conducts investigations as part of its enforcement work. The comments could provide the foundation for a significant reworking of the agency's operations.\nIn a sign of a new direction at the agency, Mulvaney on Tuesday said it would reconsider rules it finished in October that would drastically curb the payday lending industry.\nFormer Director Richard Cordray, who resigned in November and is now running for governor of Ohio, criticized the decision on Twitter, calling it a \"truly shameful action by the interim pseudo-leaders of the CFPB.\"\nMulvaney is leading the agency until Trump nominates a full-time head. His control is facing a legal challenge from CFPB deputy director Leandra English. She filed a lawsuit arguing she was the legal head of the agency until a new full-time director was in place. A federal judge ruled in Mulvaney's favor earlier this month and English has appealed that ruling. (Reporting by Pete Schroeder; Editing by Andrew Hay)", "external_links": [], "published": "2018-01-17T22:46:00.000+02:00", "crawled": "2018-01-18T02:02:34.013+02:00", "highlightTitle": ""}