{"organizations": [], "uuid": "0e55cf2cb90cf6d17d6cc30a5f8bb3c8ffbcaac9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/09/21/103013488-GettyImages-478545993.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100646281/device/rss/rss.html", "section_title": "Financial Advisor Hub", "url": "https://www.cnbc.com/2018/01/29/single-married-divorced-how-and-when-to-claim-social-security.html", "country": "US", "domain_rank": 767, "title": "Single? Married? Divorced? How and when to claim Social Security", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T15:00:00.000+02:00", "replies_count": 0, "uuid": "0e55cf2cb90cf6d17d6cc30a5f8bb3c8ffbcaac9"}, "author": "Deborah Nason", "url": "https://www.cnbc.com/2018/01/29/single-married-divorced-how-and-when-to-claim-social-security.html", "ord_in_thread": 0, "title": "Single? Married? Divorced? How and when to claim Social Security", "locations": [], "entities": {"persons": [{"name": "marc kiner", "sentiment": "none"}, {"name": "kiner", "sentiment": "none"}], "locations": [], "organizations": [{"name": "social security", "sentiment": "neutral"}, {"name": "nssa", "sentiment": "none"}, {"name": "premier social security consulting", "sentiment": "none"}, {"name": "national social security association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "While the notion of Social Security benefits seems straightforward at first glance, the program is governed by thousands of regulations, resulting in hundreds — some say thousands — of possible claiming strategies for individuals and couples.\nFor those who are married, these can be narrowed down to 10 to 15 major strategies, according to Marc Kiner, a CPA and owner of Premier Social Security Consulting and co-founder of the National Social Security Association, which offers the NSSA certificate program in Social Security maximization. Kiner pointed out a handful of these approaches:\nSocial Security as a joint benefit. For example, if you want the highest survivor benefits for your spouse, you need to delay claiming benefits until age 70. Benefits for minor children. Kids become eligible for their own benefits until age 18, once their parents file for benefits. Earnings test. If you make more than $16,920 in any year prior to full retirement age, Social Security will withhold some or all of your benefit amount. So if you're making too much, it might not make sense to apply. Offset previous low-earning years. Because Social Security benefits are based on your past 35 years of earning, it is important to return to work if possible to offset past low-income years. The fewer of those years, the higher the benefit. Ex-spouse benefits. It's important to know that there may be benefits available to ex-spouses or widows and widowers. Generally, you must have been married for at least 10 years and be currently unmarried, and the ex must be collecting Social Security in order to collect on the ex-spouse's account. However, if you have been divorced more than two years, the ex does not need to be collecting. Although the so-called restricted application strategy is being phased out , those who reached age 62 by January 1, 2016, are still able to collect benefits off their spouse's (or ex-spouse's) accounts and then \"turn on\" their own benefit payments later, when they have grown larger. Additionally, according to certified financial planner Robert Leitner, president of Financial Advisory Network, those who divorce and then remarry cannot collect on their ex's accounts; unless they remarry after age 60, in which case they can collect survivor benefits.\nMore from Investor Toolkit:\nSo you're a 401(k) \"millionairess.\" Now what?\nIt's time for financial services firms to regain consumer trust\nDon't put all your financial eggs in one investment basket\nSocial Security's guaranteed compounding behavior from the earliest claiming age (62) to the latest (70) results in a benefit guaranteed to be 76 percent higher, said Ash Ahluwalia, CFP, founder of National Social Security Partners, and this notion can impact other portfolio decisions. For example, conventional thinking around individual retirement accounts is to wait until age 70½ to begin withdrawing funds, while taking Social Security at age 66.\n\"However, it may be better to do the opposite — take your IRA distribution early and delay Social Security — because the IRA may not grow, but Social Security is guaranteed to grow by 8 percent per year up to age 70,\" he said.\nFor your consideration A fundamental error, said Ahluwalia, is looking at your Social Security benefits without coordinating them with your other assets. \"When and how you elect can have a major impact on your income in retirement,\" he said.\nThe fact that the claiming rules are in transition sometimes complicates decisions, Ahluwalia noted. He has found that often Social Security staffers themselves get confused, and he has had to send them the regulation code section to support an option.\nPeople need to be aware that, when they file for Social Security, they are making a pension election and they are locked in, he added.\nIt is possible to change an election decision after the fact, but it comes with serious restrictions. You get one chance to make a change, but with two stipulations: The change must take place within 12 months of filing, and everything you or your beneficiaries received must be paid back, Ahluwalia said.\nYour Wealth: Weekly advice on managing your money Sign up to get Your Wealth\nJob Industry Advertising/Marketing Automotive Communications/PR Construction/Manufacturing Education Finance/Banking/Insurance Legal Media/Entertainment Medical/Health Care Mining/Oil/Gas/Utilities Gov't/Non-Profit Real Estate Retail Technology/IT Transportation/Shipping Travel/Hospitality Other Submit Please enter a valid email address Get this delivered to your inbox, and more info about about our products and service. Privacy Policy . Social Security is \"actuarially neutral\" on when to file, said Leitner of Financial Advisory Network. For example, if you file at 62 and live until 82, you'll get a smaller check for a longer period. If you file at 70 and live to 82, you'll be getting a larger check for a shorter time. Overall, you'll be getting the same amount of money.\nHe also advises clients to be mindful that Social Security could be taxable depending on certain combinations of modified adjusted gross income, Social Security and tax-exempt interest received.\nThere is a behavioral aspect to Social Security claiming, according to Tim Maurer, CFP, director of personal finance with The BAM Alliance.\n\"Many people's perspective is that they've paid in to the program, so they want to get as much as possible out of it ASAP,\" he said. \"What's most often written about is getting the most, but it's important to think strategically, not just [gross] numerically.\"\n\"If you compound the benefits of working plus delaying Social Security, you will get the most.\" -Tim Maurer, director of personal finance, The BAM Alliance Maurer wants individuals to consider the point at which they're most likely to run out of money. The answer, he said, is at the end of life, and as a result, he advises them to delay claiming until they need it more urgently.\n\"We have a tendency to spend what comes in, so behaviorally, if we claim sooner, we'll spend more,\" he said. \"Leaving it in the system forces you to save.\"\nThis strategic thinking can mitigate longevity risk, Maurer said.\n\"If you compound the benefits of working plus delaying Social Security, you will get the most,\" he added. \"The question is: Can you get a better rate of return than 8 percent per year?\"\nIn other words, do you want to spend, or do you want to save?\n— By Deborah Nason, special to CNBC.com", "external_links": [], "published": "2018-01-30T15:00:00.000+02:00", "crawled": "2018-01-30T15:30:32.033+02:00", "highlightTitle": ""}