{"organizations": [], "uuid": "b508c9ada12d35d68ab6440ec3681af6cc0a2b45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/japan-economy-budget/japans-fiscal-target-delay-fuels-worry-about-healthcare-spending-idUSL4N1PI20K", "country": "US", "domain_rank": 408, "title": "Japan's fiscal target delay fuels worry about healthcare spending", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T12:13:00.000+02:00", "replies_count": 0, "uuid": "b508c9ada12d35d68ab6440ec3681af6cc0a2b45"}, "author": "", "url": "https://www.reuters.com/article/japan-economy-budget/japans-fiscal-target-delay-fuels-worry-about-healthcare-spending-idUSL4N1PI20K", "ord_in_thread": 0, "title": "Japan's fiscal target delay fuels worry about healthcare spending", "locations": [], "entities": {"persons": [{"name": "shinzo abe", "sentiment": "none"}, {"name": "shinichi fukuda", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}], "organizations": [{"name": "reuters sta", "sentiment": "negative"}, {"name": "tokyo university", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 10:13 AM / in 37 minutes Japan's fiscal target delay fuels worry about healthcare spending Reuters Staff 3 Min Read \nTOKYO, Jan 23 (Reuters) - Japan’s two-year delay of an important fiscal discipline target has fuelled concerns that an expected jump in healthcare costs will sap the government’s ability to pay off outstanding debts. \nPrime Minister Shinzo Abe’s government this week pushed back the timing for achieving a primary budget surplus by two years to fiscal 2027 as it spends more on daycare, child care, and job training to bolster its workforce. \nTo some economists, delaying the discipline target means fiscal policy could stay too loose for too long, requiring sudden tax hikes and spending cuts later to contain the debt burden, which is already the heaviest among major economies. \n“Economic disruptions would be unavoidable, because there would be big cuts in welfare spending due to worsening public finances.” said Shinichi Fukuda, an economics professor at Tokyo University. \nEconomists and academics are pointing to what they call the “2025 problem” - the year when government spending on healthcare is forecast to skyrocket as all of Japan’s baby boomers then will be 75 or older. \nUnder Japan’s current welfare system, out-of-pocket costs for healthcare fall dramatically once citizens turn 75. In return, the government foots a bigger portion of the healthcare bill for this age group. \nThis system made sense a long time ago when Japan’s population was younger and the debt burden smaller. SYSTEM OVERWHELMED \nFast forward to 2018 and Japan’s population is ageing so rapidly that the number of elderly people is overwhelming the healthcare system. Healthcare spending now eats up about one-third of the budget. \nIn fiscal 2025, government spending on healthcare for those 75 and older is expected to total 25.4 trillion yen ($229.45 billion), up two-thirds from fiscal 2015, according to Japan’s federation of health insurers. \nTotal spending on healthcare is expected to reach 57.8 trillion yen, up one-third from 42.3 trillion yen in fiscal 2015, the federation says. \nJapan will face difficulty funding its budget deficit from 2021 to 2024 because public debt will exceed private sector savings, according to Kenji Yumoto, vice chairman of the Japan Research Institute. \nTo be sure, Abe can argue his move to delay the fiscal target is not problematic because Japan’s economy is enjoying its best run of growth in a decade and tax revenue is rising. \nThe government will draft new fiscal guidelines in June. Some economists say they are worried that Abe will steer away from changes to the healthcare system needed to address the “2025 problem”. $1 = 110.70 yen Reporting by Stanley White and Izumi Nakagawa; Editing by Richard Borsuk", "external_links": [], "published": "2018-01-23T12:13:00.000+02:00", "crawled": "2018-01-23T12:43:59.000+02:00", "highlightTitle": ""}