{"organizations": [], "uuid": "a8da845f07a1b89b691ea1452a1980409ca6be10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/20/104178366-GettyImages-145747399.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/amd-stock-drops-3-percent-after-the-company-says-its-chips-are-affected-by-security-flaw.html", "country": "US", "domain_rank": 767, "title": "AMD stock drops 3 percent after the company says its chips are affected by security flaw", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-11T23:52:00.000+02:00", "replies_count": 0, "uuid": "a8da845f07a1b89b691ea1452a1980409ca6be10"}, "author": "Jordan Novet", "url": "https://www.cnbc.com/2018/01/11/amd-stock-drops-3-percent-after-the-company-says-its-chips-are-affected-by-security-flaw.html", "ord_in_thread": 0, "title": "AMD stock drops 3 percent after the company says its chips are affected by security flaw", "locations": [], "entities": {"persons": [{"name": "ashley pon", "sentiment": "none"}], "locations": [], "organizations": [{"name": "amd", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AMD on Thursday saw its stock drop nearly 4 percent in after-hours trading following a new announcement about how its processors are impacted by a recently disclosed security vulnerability .\nOn January 3, the chipmaker said AMD chips had a near-zero risk of being affected by one variant of the Spectre vulnerability. But on Thursday the statement said the variant \"is applicable\" to AMD chips.\n\"While we believe that AMD's processor architectures make it difficult to exploit Variant 2, we continue to work closely with the industry on this threat. We have defined additional steps through a combination of processor microcode updates and OS patches that we will make available to AMD customers and partners to further mitigate the threat,\" AMD said.\n\"AMD will make optional microcode updates available to our customers and partners for Ryzen and EPYC processors starting this week. We expect to make updates available for our previous generation products over the coming weeks.\"\nThe updated statement makes it clear that the Meltdown vulnerability still isn't impacting AMD chips, although it has been affecting Intel's chips.\nAMD said in a statement after this story was initially published that there's been no change to its position on the susceptibility to the second variant of Spectre for its chips and only that it's rolling out optional updates to further contain the threat.\nMeanwhile, AMD said it expects it expects an issue that resulted in pausing the release of some updates protecting against the first variant of the Spectre issue \"to be corrected shortly.\" Microsoft should be getting those updates out by next week, AMD said.\nIn a blog post earlier on Thursday, Google engineering vice president Benjamin Treynor Sloss described the Meltdown and Spectre issues as being perhaps the hardest to fix in a decade.", "external_links": [], "published": "2018-01-11T23:52:00.000+02:00", "crawled": "2018-01-12T00:33:22.003+02:00", "highlightTitle": ""}