{"organizations": [], "uuid": "984afa97422c8e68a27c7f2fcd71c9aaddce1625", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 46, "shares": 46, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1220019072&w=1200&r=LYNXMPEE060D3", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-italy-election-minister/italys-padoan-says-left-right-coalition-possible-paper-idUSKBN1EW0F7", "country": "US", "domain_rank": 408, "title": "Italy's Padoan says left-right coalition possible: paper", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T14:06:00.000+02:00", "replies_count": 0, "uuid": "984afa97422c8e68a27c7f2fcd71c9aaddce1625"}, "author": "", "url": "https://www.reuters.com/article/us-italy-election-minister/italys-padoan-says-left-right-coalition-possible-paper-idUSKBN1EW0F7", "ord_in_thread": 0, "title": "Italy's Padoan says left-right coalition possible: paper", "locations": [], "entities": {"persons": [{"name": "valentina za", "sentiment": "negative"}, {"name": "padoan", "sentiment": "negative"}, {"name": "pier carlo padoan", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}], "organizations": [{"name": "corriere della sera", "sentiment": "none"}, {"name": "milan", "sentiment": "none"}, {"name": "partito democratico", "sentiment": "none"}, {"name": "forza italia", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 06 PM / in 6 minutes Italy's Padoan says left-right coalition possible: paper Valentina Za 3 Min Read \nMILAN (Reuters) - A coalition between Italy’s main left- and right-wing parties cannot be ruled out if no clear winner emerges from the upcoming general election, the country’s economy minister was quoted on Sunday as saying. \nItaly will vote on March 4 in an election expected to produce a hung parliament, feeding instability in a country made vulnerable by the world’s third-largest public debt and weak growth potential. \nIn an interview with Sunday’s Corriere della Sera, Pier Carlo Padoan said he expected that none of the three main parties - the left-wing Partito Democratico (PD), right-wing Forza Italia (FI) and the anti-establishment 5-Star Movement - would be able to govern alone. \nWhile the center-right is seen winning most seats in March, opinion polls suggest it will not gain an absolute majority. \nAsked if the PD and FI parties could form a government, Padoan said: ”In a context of high uncertainty nothing can be ruled out. \n“Such uncertainty is already being perceived. Financial markets are rather nervous it seems to me: when parliament dissolved the (German-Italian 10-year bond yield) spread widened.” \nLeft and right parties in have supported each other in power previously. \nBoosted in recent years by the European Central Bank’s ultra-loose monetary policy, Italian government bonds are seen vulnerable to political risks as the ECB started scaling down its bond purchases. \nParties across the spectrum are pledging to voters that they will change or abolish European Union budget rules, cut taxes and spend more to boost the economy which is slowly picking up steam. \nPD, the party of former prime minister Matteo Renzi, and FI, led by 81-year-old,four-times prime minister Silvio Berlusconi, hold the most moderate positions. \nAsked about proposals to introduce a single income tax rate, Padoan said the 15 percent rates suggested by the regional and sometimes secessionist Northern League was not sustainable, while Berlusconi’s 20 percent suggestion was “less unsustainable.” \n“I would explore a tax reform that would simplify the tax rates reducing them to one or, better, two. But we should avoid benefitting disproportionately higher income earners.” \nPadoan, a former economist at the Organisation for Economic Co-operation and Development who joined Renzi’s government in 2014, said he would consider running for parliament at the next election if he were asked to do so. Reporting by Valentina Za", "external_links": [], "published": "2018-01-07T14:06:00.000+02:00", "crawled": "2018-01-07T14:20:28.000+02:00", "highlightTitle": ""}