{"organizations": [], "uuid": "eea2ea9c20681ac4f9478170643ea357998ee553", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-j-w-childs-associates-acquires-majority-interest-in-honors-holdings.html", "country": "US", "domain_rank": 767, "title": "J.W. Childs Associates Acquires Majority Interest in Honors Holdings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T14:00:00.000+02:00", "replies_count": 0, "uuid": "eea2ea9c20681ac4f9478170643ea357998ee553"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-j-w-childs-associates-acquires-majority-interest-in-honors-holdings.html", "ord_in_thread": 0, "title": "J.W. Childs Associates Acquires Majority Interest in Honors Holdings", "locations": [], "entities": {"persons": [{"name": "jamie weeks", "sentiment": "none"}, {"name": "ellen latham", "sentiment": "none"}, {"name": "jerome kern", "sentiment": "none"}, {"name": "dave long", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "oregon", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "j.w. childs associates acquires majority interest", "sentiment": "negative"}, {"name": "llc", "sentiment": "none"}, {"name": "orangetheory fitness", "sentiment": "none"}, {"name": "j.w. childs associates", "sentiment": "none"}, {"name": "honors holdings", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Investment to Support Growth and Development of Existing and Future Orangetheory ® Studios\nBOSTON--(BUSINESS WIRE)-- J.W. Childs Associates, L.P., a private equity firm focused on operational value creation in middle-market growth companies, today announced it has acquired a majority interest in Honors Holdings, LLC, a leading franchisee of Orangetheory ® Fitness. Honors Holdings operates 16 studios in Georgia, Tennessee, South Carolina, Washington and Oregon. Founder Jamie Weeks will retain a substantial investment in the business.\nFounded by Dave Long, Ellen Latham and Jerome Kern, Orangetheory Fitness is a scientifically designed, one-of-a-kind group personal training, interval fitness concept. Backed by the science of excess post-exercise oxygen consumption (EPOC), Orangetheory Fitness is a 60-minute workout broken into intervals of cardiovascular and strength training. Led by highly skilled coaches, each Orangetheory Fitness workout incorporates endurance, strength and power elements through a variety of equipment including treadmills, rowing machines, TRX ® suspension training and free weights. Orangetheory Fitness has awarded 1,000+ franchised studios in the United States and more than 15 additional countries.\n“Our partnership with J.W. Childs will allow us to expand significantly in our existing territories to bring the Orangetheory phenomenon to even more fitness enthusiasts” said Honors Holdings’ Founder & CEO Jamie Weeks. “We completed three studio acquisitions over the last year and a half with the goal now of further expanding in current and new geographies.”\n“We’re excited about our investment in Honors Holdings and the operating platform Jamie and team have built within the Orangetheory ecosystem,” said J.W. Childs Partner, Jeff Teschke. “We believe our specialty retail expertise and experience will further accelerate the already strong growth trajectory of the business.”\nBill Watts, Partner at J.W. Childs, has been appointed Chairman of the Board, and will work closely with Jamie Weeks and management. Bill has been involved with numerous investments at J.W. Childs, including Mattress Firm, Equinox Fitness, Bass Pro Shops, Cycle Gear, RevZilla and EbLens, among others. Bill commented, “I’ve been very impressed with the performance that Jamie and his team have delivered. We’ve been searching for the right opportunity to invest in fitness and we’re excited about the combination of a superb management team, a great studio fitness concept and our experience in high growth specialty retail.”\nFour executives from J.W. Childs will join Jamie Weeks on the Honors Holdings Board of Directors: Partners Jeff Teschke and Bill Watts, Operating Partner Joe Fortunato and Vice President Kyle Casella.\nLatham & Watkins served as legal counsel to J.W. Childs. Davis Wright Tremaine served as legal counsel and Piper Jaffray & Co. served as financial advisor to Honors Holdings.\nAbout J.W. Childs Associates\nJ.W. Childs is a Boston-based private equity firm focused on investing in middle-market growth companies. Since inception in 1995, J.W. Childs has invested in excess of $3.5 billion of equity capital in more than 45 companies across the consumer, specialty retail and healthcare industries. The firm’s success has been built on its industry focus and the extensive operating expertise of its partners. , please visit www.jwchilds.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104005118/en/\nJ.W. Childs Associates, L.P.\nPhilippe Schenk, +1 617-753-1100\npschenk@jwchilds.com\nSource: J.W. Childs Associates, L.P.", "external_links": ["http://www.businesswire.com/news/home/20180104005118/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.jwchilds.com&esheet=51737495&newsitemid=20180104005118&lan=en-US&anchor=www.jwchilds.com&index=1&md5=71b4b8670427192e3123df043de77384"], "published": "2018-01-04T14:00:00.000+02:00", "crawled": "2018-01-04T13:58:43.032+02:00", "highlightTitle": ""}