{"organizations": [], "uuid": "d8784c0999d115cc728c9585ff86fdbc3a8ed911", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 21, "shares": 21, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225019626&w=1200&r=LYNXMPEE0O051", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-puertorico-debt-fiscalplan/puerto-rico-sees-no-debt-payment-ability-until-2022-idUSKBN1FE0AN", "country": "US", "domain_rank": 408, "title": "Puerto Rico sees no debt payment ability until 2022", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.96, "site_type": "news", "published": "2018-01-25T12:11:00.000+02:00", "replies_count": 0, "uuid": "d8784c0999d115cc728c9585ff86fdbc3a8ed911"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-puertorico-debt-fiscalplan/puerto-rico-sees-no-debt-payment-ability-until-2022-idUSKBN1FE0AN", "ord_in_thread": 0, "title": "Puerto Rico sees no debt payment ability until 2022", "locations": [], "entities": {"persons": [{"name": "ricardo rossello", "sentiment": "none"}, {"name": "maria", "sentiment": "none"}], "locations": [{"name": "puerto rico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "fema", "sentiment": "none"}, {"name": "u.s. federal emergency management agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Puerto Rico’s governor has projected his bankrupt, hurricane-ravaged U.S. territory will carry budget gaps for the next four fiscal years, requiring new liquidity and leaving nothing to repay the island’s $72 billion debt until 2022.\nGovernor Ricardo Rossello issued revised fiscal turnaround plans in the early hours of Thursday, painting a bleak picture of an island struggling after its worst natural disaster in 90 years while navigating the largest government bankruptcy in U.S. history.\nThe plans add detail on Rossello’s vision for privatizing the debt-laden power utility, PREPA, and assume a minimum of $35.3 billion in federal aid to help recover from Hurricane Maria, which devastated Puerto Rico in September.\nA spokesman for the U.S. Federal Emergency Management Agency (FEMA) said it was too early to tell what Puerto Rico might get in so-called public assistance funding.\nIt is unclear how the budget gap will be plugged. Puerto Rico will need “external liquidity support” to maintain basic services, the plan says, adding that “the availability of this funding source is a critical risk to ... the long term viability of Puerto Rico.”\nSURPLUS TO GAP A previous turnaround plan, approved by Puerto Rico’s federally appointed financial oversight board last April, had projected $800 million a year for debt repayment over the next decade. Even that was just a quarter of what the island owed.\nBut that was before Maria slammed Puerto Rico, killing dozens of people, cutting power to all 3.4 million residents, and destroying tens of billions of dollars in housing.\nThe new plan projects that Maria’s impact will spur increased inflation and nearly triple a contraction in gross national product this fiscal year, as well as drive some 600,000 more people from the island in the next five years.\nThe outlook turns what was formerly a projected $3.7 billion surplus through 2021 into a $3.4 billion gap in the same period.\nThat forecast is after accounting for steps to improve the island’s fiscal health, including cuts in subsidies to towns and the University of Puerto Rico, measures to boost tax collection, and the streamlining of public agencies.\nWith the plan now in the hands of the oversight board, the projections could change. Appointed to manage Puerto Rico’s finances and oversee its recovery, the board can request edits before it approves a final plan on February 23.\nImmediate reaction from stakeholders and analysts was measured. Bose George, a municipal bond insurer analyst at KBW Inc, said in a note on Thursday the five-year debt moratorium was “not surprising.”\nA source familiar with the restructuring told Reuters late Wednesday that “it would be a mistake to put any stock in” the governor’s projections, which “will undoubtedly be revised again.”\nFEDERAL AID\nPuerto Rico Governor Ricardo Rossello speaks during a Facebook live broadcast in the library of the governor's mansion, in San Juan, Puerto Rico January 24, 2018. REUTERS/Alvin Baez The $35.3 billion minimum projection by Rossello for federal disaster aid is derived from the FEMA public assistance program, which provides money to governments for debris removal, life-saving measures and public facility repairs.\nIt was unclear on Thursday how solid Rossello’s projection was. In a roundtable with media on Wednesday, he said the number was based on FEMA’s own estimates and that the program “has been legislated and has never been underfunded.”\nBut Daniel Llargues, a spokesman for FEMA in Puerto Rico, said any estimate was premature.\n“We’re still working with municipalities to identify the public projects that are needed,” he said. “We don’t know who’s going to apply, who’s going to qualify, and for how much.”\nFEMA has approved $503 million in public assistance so far, Llargues said.\nFEMA assistance is a small piece of what Puerto Rico is seeking from Washington. The governor in November asked for a total of $94 billion in various sources of federal aid.\nThe latest overall aid package under discussion in the U.S. Congress is $81 billion, to be split between several hurricanes and the California wildfires.\nSenator Kirsten Gillibrand called on Thursday for a new Marshall Plan to help the island, referring to the U.S. program that helped rebuild Western Europe after World War Two.\n“Congress has done the bare minimum expected of us,” the New York Democrat said at an event in Washington. “We must forge the political will that is necessary to stand with the families” in Puerto Rico, she said.\nENERGY OVERHAUL Even before Maria, Puerto Rico was reeling under $120 billion in combined bond and pension debt and a poverty rate around 46 percent. It filed the largest municipal bankruptcy in U.S. history last May.\nA big piece of its troubles is public power utility PREPA, which is trudging through its own bankruptcy, with some $9 billion of debt.\nOn Monday, Rossello surprised Wall Street by announcing plans to privatize PREPA over the next 18 months, an endeavor that will need approval of Puerto Rico’s bankruptcy judge.\nIn a separate fiscal plan for PREPA released on Thursday, Rossello detailed his vision, which calls for the selling of PREPA’s current plants to “one or more” private operators, and public-private-partnerships for the construction of new plants.\nIt envisions a 25-year concession model for PREPA’s transmission and distribution system, which would continue to be owned by Puerto Rico but operated by “a single private concessionaire.”\nA new public service commission, to regulate rates and set performance standards, would replace PREPA’s current regulator, the Puerto Rico Energy Commission.\nThe goal of privatization would be to promote the lowest possible rates, the plan says, adding that private investors will be chosen in part based on their “ability to integrate new technologies quickly and cost-effectively.”\nReporting by Nick Brown; Additional reporting by David Alexander; Editing by Daniel Bases, Leslie Adler and Frances Kerry\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T12:11:00.000+02:00", "crawled": "2018-01-25T09:59:46.034+02:00", "highlightTitle": ""}