{"organizations": [], "uuid": "cfa7ad87bf7a5cb559c63f8ea6d3b1c215e02847", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220683505&w=1200&r=LYNXMPEE0900T", "site_section": "https://www.reuters.com/finance/markets/us", "section_title": "US Stock Market News - Dow Jones, Nasdaq, S&amp;P 500 | Reuters.com", "url": "https://www.reuters.com/article/us-usa-agriculture-tax/u-s-grain-companies-fear-harm-from-new-tax-law-idUSKBN1EZ022", "country": "US", "domain_rank": 408, "title": "grain companies fear harm from new tax law", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.289, "site_type": "news", "published": "2018-01-10T08:56:00.000+02:00", "replies_count": 0, "uuid": "cfa7ad87bf7a5cb559c63f8ea6d3b1c215e02847"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-agriculture-tax/u-s-grain-companies-fear-harm-from-new-tax-law-idUSKBN1EZ022", "ord_in_thread": 0, "title": "grain companies fear harm from new tax law", "locations": [], "entities": {"persons": [{"name": "john hoeven", "sentiment": "none"}, {"name": "john thune", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "south dakota", "sentiment": "none"}, {"name": "north dakota", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "archer daniels midland co", "sentiment": "none"}, {"name": "bunge ltd", "sentiment": "none"}, {"name": "cargill inc", "sentiment": "none"}, {"name": "cargill", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO (Reuters) - The new U.S. tax law is poised to drive more control over the nation’s grain supply to farmer-owned cooperatives, provoking concern among ethanol producers and privately run grain handlers that they could be squeezed out of the competition to buy crops.\nUntil now, the cooperatives, private companies and publicly traded firms had a more even opportunity to handle the grain supply used in everything from loaves of bread in supermarkets to livestock feed.\nThe changes mean massive grain traders such as Archer Daniels Midland Co, Bunge Ltd and Cargill Inc [CARG.UL] could find it difficult to source corn, soybeans and wheat.\nThe perceived threat to these companies stems from a provision included in the final stages of the law’s passage in December. It gives farmers such a big tax deduction for selling their produce to agricultural cooperatives that private firms fear their grains supply will dry up.\nThe provision was championed by Republican farm state senators including John Thune of South Dakota and John Hoeven of North Dakota.\nPrivately held Cargill said on Tuesday it was surprised the provision was added to the bill at the last minute and is evaluating its potential impact.\nRival ADM, which also produces ethanol, said it too was evaluating the provision and “various potential solutions” to it.\nThe new tax law allows farmers and ranchers to claim a 20 percent deduction on all payments received on sales to cooperatives.\n“It is going to put us out of business as a private if something is not changed right off the bat,” said Doug Bell, president and general manager of Bell Enterprises Inc, which operates grain elevators in central Illinois.\n“There is just no reason whatsoever why a farmer would do business with anyone other than a co-op.”\nThe deductions could come as a massive boon to cash-strapped U.S. grain farmers, who have struggled for at least four years amid a global grain glut and sluggish commodity prices.\nSome farmers seeking to take advantage of the new deduction are already asking about transferring grain they have stored at private elevators and selling it to cooperatives, Bell said. An association that represents cooperatives also has received questions from people who want to open new cooperatives.\nThe change focuses on a provision in the federal tax code that cuts taxes on proceeds from agricultural products – whether corn and soybeans, or milk and fresh fruit – that farmers and ranchers sell to farm cooperatives such as CHS Inc.\nThere is no comparable provision for farmers doing the same business with private or investor-owned companies.\n“The advantage for the farmer is probably at least five times larger selling to a co-op versus not selling to a co-op,” said Paul Neiffer, an accountant at CliftonLarsonAllen in Yakima, Washington.\nNeiffer said he has received hundreds of calls and emails from private elevators upset about the law.\nChuck Conner, president and chief executive of the National Council of Farmer Cooperatives, said his organization had begun to receive calls from people asking questions about starting a co-op to take advantage of the deduction.\n“The producer/member deduction is more generous than most of us thought possible a few months ago,” he said in an email to members.\nThe number of U.S. farm cooperatives has been steadily shrinking in recent years, as they scramble to consolidate and stay competitive amid the merger frenzy of major seed and chemical companies.\nThere were 1,953 farmer, rancher and fishery co-ops in 2016 in the United States, down 4.6 percent from a year earlier, according to the most recent U.S. Department of Agriculture data. They handled $44.3 billion in net sales of grains in 2016, down 33 percent from a $66.3 billion peak in 2013.\nCHS, the largest U.S. agricultural cooperative, said the new law ensures that “that cooperatives continue to be a driver of economic growth in rural America.”\nAdditional reporting by P.J. Huffstutter in Chicago; Editing by Simon Webb and Matthew Lewis\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T08:56:00.000+02:00", "crawled": "2018-01-10T03:00:53.042+02:00", "highlightTitle": ""}