{"organizations": [], "uuid": "eed22593529bccfbd1593dad8b9b9f93de440d88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-compass-diversified-holdings-acquires-foam-fabricators.html", "country": "US", "domain_rank": 767, "title": "Compass Diversified Holdings Acquires Foam Fabricators", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.346, "site_type": "news", "published": "2018-01-18T23:10:00.000+02:00", "replies_count": 0, "uuid": "eed22593529bccfbd1593dad8b9b9f93de440d88"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-compass-diversified-holdings-acquires-foam-fabricators.html", "ord_in_thread": 0, "title": "Compass Diversified Holdings Acquires Foam Fabricators", "locations": [], "entities": {"persons": [{"name": "florkiewicz", "sentiment": "none"}, {"name": "warren \"budd", "sentiment": "none"}], "locations": [{"name": "conn.", "sentiment": "none"}, {"name": "westport", "sentiment": "none"}, {"name": "az", "sentiment": "none"}, {"name": "scottsdale", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "foam fabricators, inc.", "sentiment": "none"}, {"name": "wells fargo securities", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WESTPORT, Conn., Jan. 18, 2018 /PRNewswire/ -- Compass Diversified Holdings (NYSE: CODI) (\"CODI\" or the \"Company\"), an owner of leading middle market businesses, announced that on January 18, 2018, it entered into a definitive agreement to acquire Foam Fabricators, Inc. (\"Foam Fabricators\") from its owner Warren \"Budd\" Florkiewicz for a purchase price of $247.5 million (excluding working capital and certain other adjustments upon closing). The acquisition is expected to close within the next 45 days, subject to customary closing conditions. Wells Fargo Securities served as exclusive financial advisor to Foam Fabricators.\nHeadquartered in Scottsdale, AZ, Foam Fabricators is a leading designer and manufacturer of custom molded protective foam solutions and OEM components made from expanded polymers such as expanded polystyrene (EPS) and expanded polypropylene (EPP). Founded in 1957, the company operates 13 state-of-the-art molding and fabricating facilities across North America. Foam Fabricators provides products to a variety of end-markets, including appliances and electronics, pharmaceuticals, health and wellness, automotive, building products and others. For the trailing twelve months ended November 30, 2017, the company reported net revenue of approximately $126 million and EBITDA of approximately $30 million. CODI expects to fund the purchase price through a draw on its revolving credit facility.\n\"We are pleased to start the year with an attractive platform acquisition, growing our family of niche leading businesses to ten,\" said Alan Offenberg, CEO of Compass Diversified Holdings. \"This platform acquisition will be immediately accretive and will enable us to continue growing our cash flow and provide attractive and stable distributions.\"\nElias Sabo, CODI's CEO-elect, stated, \"Foam Fabricators possesses the key characteristics that we look for in all our subsidiaries: a strong management team; a diversified customer base; strong free cash flow; and attractive growth prospects. We look forward to working with them to capitalize on the growing demand in many of their end-markets.\"\nJames K. Hughes, President of Foam Fabricators, will assume the role of Chief Executive Officer and continue leading the company. Mr. Hughes commented, \"We are excited to partner with Compass Diversified Holdings as we enter the next phase of Foam Fabricators' growth. CODI provides the financial stability and experience to allow us to continue to meet the needs of our customers, employees and stakeholders. We are eager to leverage CODI's financial resources and proven expertise in growing middle market companies to build upon our 60-year history. I would also like to thank Budd Florkiewicz for his leadership of the company over the last three decades.\"\nAdditional information on the acquisition will be available on the Company's current report on Form 8-K that will be filed with the Securities and Exchange Commission.\nAbout Compass Diversified Holdings (\"CODI\")\nCODI owns and manages a diverse family of established North American middle market businesses. Each of its current subsidiaries is a leader in its niche market.\nCODI maintains controlling ownership interests in each of its subsidiaries in order to maximize its ability to impact long term cash flow generation and value. The Company provides both debt and equity capital for its subsidiaries, contributing to their financial and operating flexibility. CODI utilizes the cash flows generated by its subsidiaries to invest in the long-term growth of the Company and to make cash distributions to its shareholders.\nOur nine majority-owned subsidiaries are engaged in the following lines of business:\nThe design and marketing of purpose-built tactical apparel and gear serving a wide range of global customers ( 5.11 ); The manufacture of quick-turn, small-run and production rigid printed circuit boards ( Advanced Circuits ); The manufacture of engineered magnetic solutions for a wide range of specialty applications and end-markets ( Arnold Magnetic Technologies ); Environmental services for a variety of contaminated materials including soils, dredged material, hazardous waste and drill cuttings ( Clean Earth ); The design, manufacture and marketing of airguns, archery products, optics and related accessories ( Crosman ); The design and marketing of wearable baby carriers, strollers and related products ( Ergobaby ); The design and manufacture of premium home and gun safes ( Liberty Safe ); The manufacture and marketing of branded, hemp-based food products ( Manitoba Harvest ); and The manufacture and marketing of portable food warming fuels and creative ambience solutions for the hospitality and consumer markets ( Sterno Products ).\nThis press release may contain certain forward-looking statements, including statements with regard to the future performance of CODI. Words such as \"believes,\" \"expects,\" \"projects,\" and \"future\" or similar expressions, are intended to identify forward-looking statements. These forward-looking statements are subject to the inherent uncertainties in predicting future results and conditions. Certain factors could cause actual results to differ materially from those projected in these forward-looking statements, and some of these factors are enumerated in the risk factor discussion in the Form 10-K filed by CODI with the SEC for the year ended December 31, 2016 and other filings with the SEC. Except as required by law, CODI undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.\nView original content: http://www.prnewswire.com/news-releases/compass-diversified-holdings-acquires-foam-fabricators-300584898.html\nSOURCE Compass Diversified Holdings", "external_links": ["http://www.prnewswire.com/news-releases/compass-diversified-holdings-acquires-foam-fabricators-300584898.html"], "published": "2018-01-18T23:10:00.000+02:00", "crawled": "2018-01-19T01:22:42.016+02:00", "highlightTitle": ""}