{"organizations": [], "uuid": "110cf2d46c69618f052e1119ea97456988368509", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/06/104693025-GettyImages-843113446-daca.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/trump-turns-again-on-immigration-allies-bash-amnesty-don.html", "country": "US", "domain_rank": 767, "title": "Trump turns again on immigration, allies bash 'Amnesty Don'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.564, "site_type": "news", "published": "2018-01-26T18:19:00.000+02:00", "replies_count": 0, "uuid": "110cf2d46c69618f052e1119ea97456988368509"}, "author": "Christopher Dilts", "url": "https://www.cnbc.com/2018/01/26/trump-turns-again-on-immigration-allies-bash-amnesty-don.html", "ord_in_thread": 0, "title": "Trump turns again on immigration, allies bash 'Amnesty Don'", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "don", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}], "organizations": [{"name": "amnesty don' immigration trump", "sentiment": "neutral"}, {"name": "deferred action for childhood arrivals", "sentiment": "none"}, {"name": "breitbart news", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fearing betrayal on a signature campaign issue, President Donald Trump 's loyalists across the country are lashing out against his proposal to create a path to citizenship for nearly 2 million \"Dreamer\" immigrants.\nTrump-aligned candidates from Nevada and Virginia rejected the notion outright. The president's most loyal media ally, Breitbart News, attacked him as \"Amnesty Don.\" And outside groups who cheered the hard-line rhetoric that dominated Trump's campaign warned of a fierce backlash against the president's party in November's midterm elections.\n\"There's a real potential for disaster,\" said Mark Krikorian, executive director of the far-right Center for Immigration Studies. \"The president hasn't sold out his voters yet. But I think it's important that his supporters are making clear to him that they're keeping an eye on him.\"\nThe public scolding was aimed at a president who has changed course under pressure before. Yet Trump has faced no greater test on a more significant issue than this one, which dominated his outsider candidacy and inspired a coalition of working-class voters that fueled his unlikely rise. Now, barely a year into his presidency, Trump can bend either to the will of his fiery base or the pressure to govern and compromise.\nHis leadership may determine the fate of hundreds of thousands of young immigrants and whether his party can improve its standing among a surging group of Hispanic voters. It may also alienate those who love him most.\n\"There's a Trump movement. And It's not necessarily about Donald Trump,\" said Corey Stewart, a Republican Senate candidate in Virginia and a vocal Trump ally. \"It's about the things that Donald Trump campaigned and stood for during his campaign. Ultimately, every elected leader needs to stay true to the message that they ran on, otherwise people will leave them.\"\nThe passionate response underscores the Republican Party's immigration dilemma in the age of Trump.\nMuch of the country, including independents and moderate Republicans, favor protections for thousands of young people brought to the country as children illegally and raised here through no fault of their own. But a vocal conservative faction emboldened by Trump's anti-immigrant rhetoric will never accept anything viewed as \"amnesty.\" And many view legal protection for these young immigrants as just that.\nTrump's proposal includes billions for border security and significant changes to legal immigration long sought by hard-liners. Several Democrats and immigration activists rejected it outright. But his supporters' focus on \"amnesty\" for Dreamers highlights how dug in the base is and how little room Trump has to maneuver.\nThe president told reporters this week that he favored a pathway to citizenship for those immigrants, embracing a notion he once specifically rejected. Legal protection for roughly 700,000 immigrants enrolled in the Deferred Action for Childhood Arrivals program, or DACA, has emerged as the driving priority for Democrats, who forced a government shutdown over this issue last week. The businessman president appears to have set out to cut a deal.\n\"It is concerning why anyone would attempt to repeat history by granting amnesty,\" said Mississippi state Sen. Chris McDaniel, who is mulling a primary challenge against Republican Sen. Roger Wicker. McDaniel likened the Trump proposal to the \"amnesty\" granted in 1986 immigration overhaul backed by President Ronald Reagan.\nSuch a policy, he said, would harm American workers and \"invite more illegals,\" while emboldening liberals in future debates. Making a deal now would ensure that a future Congress will be \"held hostage by open border advocates.\"\nIn Virginia, Stewart said \"any amnesty, including an extension of DACA,\" would lead to a \"humanitarian crisis\" at the border and could draw millions of new immigrants into the country illegally.\n\"I'm not happy about it,\" he said.\nIn Nevada, where Trump loyalty is the centerpiece of Republican Danny Tarkanian's primary challenge against Sen. Dean Heller, Tarkanian also broke from the president.\n\"It's his decision,\" Tarkanian said of Trump. \"But I don't believe we should grant citizenship to people who have come to the country illegally.\"\nHe would, however, support permanent legal status for children who entered the country illegally, but said he draws the line at citizenship.\nThe consequences could be severe for the GOP as it struggles to energize voters heading into the 2018 midterm elections, when Republican majorities in the House and Senate are at stake. Recent Democratic victories in Alabama and Virginia suggest that the GOP has cause for concern — especially as Trump's approval number hover near record lows.\nProtections for more immigration of these young immigrants could trigger wholesale revolt by Trump's base in November, said Bob Dane, executive director of the conservative Federation for American Immigration Reform.\n\"There's widespread fear that if Trump capitulates to the Democrats and fails to deliver on his campaign promises on immigration, there's not going to be any more campaign promises for the GOP to make in the future, because the base will inflict a scorched-earth policy in midterms,\" Dane said, noting that his organization has \"a longstanding position of opposing amnesty in any form, including the extension of the DACA protections.\"\nSome allies hoped Trump comments and the proposal were an early step in negotiations that could change. Trump has zig-zagged on the issue before.\nWith Congress pushing Trump to clearly state his position, the White House plans to formally unveil a legislative framework next week.\nBut Trump on Wednesday left little wiggle room in his support for citizenship.\n\"It's going to happen, at some point in the future, over a period of 10 to 12 years,\" he said.", "external_links": [], "published": "2018-01-26T18:19:00.000+02:00", "crawled": "2018-01-26T18:19:38.005+02:00", "highlightTitle": ""}