{"organizations": [], "uuid": "faad9383ff847dfa8c33fe48292575fc52f86b5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-fda-has-approved-farons-traumakinea-ind.html", "country": "US", "domain_rank": 767, "title": "FDA has approved Faron's Traumakine速 IND", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.827, "site_type": "news", "published": "2018-01-24T15:00:00.000+02:00", "replies_count": 0, "uuid": "faad9383ff847dfa8c33fe48292575fc52f86b5f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-fda-has-approved-farons-traumakinea-ind.html", "ord_in_thread": 0, "title": "FDA has approved Faron's Traumakine速 IND", "locations": [], "entities": {"persons": [{"name": "faron", "sentiment": "negative"}, {"name": "traumakine", "sentiment": "none"}], "locations": [{"name": "finland", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "traumakine", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "fda", "sentiment": "negative"}, {"name": "traumakine速 ind faron pharmaceuticals ltd", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "bla", "sentiment": "none"}, {"name": "us food and drug administration", "sentiment": "none"}, {"name": "ards", "sentiment": "none"}, {"name": "faron pharmaceuticals ltd", "sentiment": "none"}, {"name": "biologics license application", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Faron Pharmaceuticals Ltd\n(\"Faron\" or the \"Company\")\nFDA has approved Faron's Traumakine 速 IND\nTURKU - FINLAND, 24 January 2018 - Faron Pharmaceuticals Ltd (\"Faron\") (AIM: FARN), the clinical stage biopharmaceutical company, announces that the US Food and Drug Administration (FDA) has approved the Investigational New Drug (IND) Application for Traumakine, the Company's wholly-owned product for the treatment of Acute Respiratory Distress Syndrome (ARDS), which is part of the regulatory process towards BLA submission.\nThe FDA has already proposed that Faron can proceed directly to Biologics License Application (BLA) pending positive results from the two on-going Phase III trials (INTEREST in Europe and MR11A8-2 in Japan) and the IND forms part of this process towards BLA submission. Faron also continues to consider providing access to Traumakine in the US to ARDS patients under an expanded access program, which requires an IND. Top-line data from the INTERST study is due in the first half of 2018.\nFaron is also planning to conduct a small open label study in the US for pharmacological purposes and the IND will allow opening of clinical activities in the US. This first US study will target Traumakine (drug product FP-1201-lyo) in moderate and severe ARDS patients, especially with end organ (kidney and liver) failures.\nARDS is a severe orphan disease with a reported mortality rate of approximately 30-45% [1] ,[2],[3], for which there is currently no approved pharmacological treatment. It is characterised by widespread capillary leakage and inflammation in the lungs, most often as a result of pneumonia (e.g. following a pandemic influenza), sepsis, or significant trauma. Faron estimates there are around 300,000 plus annual cases in Europe and US alone. Faron completed the recruitment of 300 patients with moderate and severe ARDS for the pan-European pivotal trial INTEREST in December 2017.\nDr Markku Jalkanen, CEO of Faron, said: \"We are very pleased to receive this IND approval from the FDA which will allow us to further advance our Traumakine plans in the US. It also allows rolling dossier build up for FDA, which can speed up the final BLA acceptance. With data expected in H1 2018 and, following previous guidance from the FDA, we remain hopeful that we can expedite Traumakine's route to market addressing this significant unmet medical need in terms of reducing mortality and providing savings for healthcare systems.\"\nThis announcement contains inside information for the purposes of Article 7 of Regulation (EU) No 596/2014 (\"MAR\").\nFor more information please contact:\nFaron Pharmaceuticals Ltd\nDr Markku Jalkanen, Chief Executive Officer\ninvestor.relations@faron.com\nConsilium Strategic Communications\nMary-Jane Elliott, Chris Welsh, Philippa Gardner, Lindsey Neville\nPhone: +44 (0)20 3709 5700\nE-mail: faron@consilium-comms.com\nWestwicke Partners, IR (US)\nChris Brinzey\nPhone: 01 339 970 2843\nE-Mail: chris.brinzey@westwicke.com\nPanmure Gordon (UK) Limited, Nomad and Broker\nFreddy Crossley (Corporate Finance)\nTom Salvesen (Corporate Broking)\nPhone: +44 207 886 2500\nAbout Faron Pharmaceuticals Ltd\nFaron (AIM:FARN) is a clinical stage biopharmaceutical company developing novel treatments for medical conditions with significant unmet needs. The Company currently has a pipeline focusing on acute organ traumas, vascular damage and cancer immunotherapy. The Company's lead candidate Traumakine, to prevent vascular leakage and organ failures, is currently the only treatment for Acute Respiratory Distress Syndrome (ARDS) undergoing Phase III clinical trials and in 2017 received advice from US FDA to proceed directly to BLA submission following completion of EU and Japanese Phase III studies. There is currently no approved pharmaceutical treatment for ARDS. An additional European Phase II Traumakine trial is underway for the Rupture of Abdominal Aorta Aneurysm (\"RAAA\"). Faron's second candidate Clevegen is a ground breaking pre-clinical anti-Clever-1 antibody. Clevegen has the ability to switch immune suppression to immune activation in various conditions, with potential across oncology, infectious disease and vaccine development. This novel macrophage-directed immuno-oncology switch called Tumour Immunity Enabling Technology (\"TIET\") may be used alone or in combination with other immune checkpoint molecules for the treatment of cancer patients. Faron is based in Turku, Finland. Further information is available at www.faron.com\n[1] JAMA. 2016 Feb;315(8):788-800\n[2] Intensive Care Med. 2011;37(12):1932\n[3] N Engl J Med. 2005;353(16):1685\nSource:Faron Pharmaceuticals Oy", "external_links": ["https://www.globenewswire.com/Tracker?data=L0JUnoyaTxIr7Vk1kTJFjd6LxpuUJx7oR4ifokh4LddMpdqZFEm9f5FraiddGWcugq6bHyk7zzrn2lD1fNs8kWyppvLUUgoAXiQMSwHRM232-04WVZd3UZcYQgc6Yvf-", "https://www.globenewswire.com/Tracker?data=BZ_L9Fw48p8JZlnn_wjOCkIYbScFQokpJYgrOZwEhUvORWMrJrr0zDz0-tauU5YQnAGvCSie77VWOEJvdXf95W3qa2tQ1ODdPVMnBazkktk=", "https://www.globenewswire.com/Tracker?data=FxShrieYhqA_uGJJNPc3p0axa8HgWIyM40ERgbse9ZtCLezWejyhfa-zmf7txCej8Sbn6G1GmF4E3VIspQ-8Wg==", "https://www.globenewswire.com/Tracker?data=cQInJKYP0rYOY9kS7xV524GNwQZ4Xy9FYQ0oa4aTSC5w81pU6f3P9PX5P_GVffv1dpXBbkuSyzSOhCxMrrrsJBkL331aiCJpeTGzck8ubs86HjHHz6PRVQD47yRMlmU4"], "published": "2018-01-24T15:00:00.000+02:00", "crawled": "2018-01-24T14:58:33.010+02:00", "highlightTitle": ""}