{"organizations": [], "uuid": "a5bb6fcbd5099d3623c328c546e585d27e26cfe0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-ribbon-communications-appoints-tony-scarfo-executive-vice-president-of-products-and-rd.html", "country": "US", "domain_rank": 767, "title": "Ribbon Communications Appoints Tony Scarfo Executive Vice President of Products and R", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T16:00:00.000+02:00", "replies_count": 0, "uuid": "a5bb6fcbd5099d3623c328c546e585d27e26cfe0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-ribbon-communications-appoints-tony-scarfo-executive-vice-president-of-products-and-rd.html", "ord_in_thread": 0, "title": "Ribbon Communications Appoints Tony Scarfo Executive Vice President of Products and R", "locations": [], "entities": {"persons": [{"name": "john mccready", "sentiment": "none"}, {"name": "tony scarfo", "sentiment": "none"}, {"name": "kevin riley", "sentiment": "none"}, {"name": "scarfo", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "westford", "sentiment": "none"}], "organizations": [{"name": "ribbon communications appoints tony scarfo", "sentiment": "positive"}, {"name": "sonus networks, inc.", "sentiment": "none"}, {"name": "ribbon communications inc.", "sentiment": "none"}, {"name": "product lifecycle management", "sentiment": "none"}, {"name": "cto", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "30-year industry veteran brings extensive record of innovation, leadership and vision in telecommunications, security and cloud communications\nWESTFORD, Mass., Jan. 31, 2018 /PRNewswire/ -- Ribbon Communications Inc. (Nasdaq: RBBN), a global leader in secure and intelligent cloud communications, today announced that it has appointed veteran industry leader Tony Scarfo as Executive Vice President of Products and Research & Development (R&D), responsible for the company's Product Lifecycle Management and solutions roadmap strategy. Scarfo will focus on Ribbon's core products, while Chief Technology Officer (CTO) Kevin Riley will oversee the company's cloud communications solutions. John McCready, who previously held the dual role of Executive Vice President of Products and R&D and Chief Strategy Officer, will focus on Corporate Development and serve as Ribbon's Chief Strategy Officer.\nScarfo has spent more than 30 years in telecommunications and technology and boasts numerous achievements, including leading Sonus Networks, Inc., in introducing the industry's first software-only Session Border Controller (SBC), the Sonus Software edition (SWe) . He served as Sonus' Executive Vice President of Technology and Business Development from 2013 – 2016, where he oversaw the company's solutions roadmap across cloud , video , mobile , virtualization and Unified Communications (UC) technologies and helped Sonus deliver one of the industry's leading SBC platforms, the Sonus SBC 7000. Scarfo also previously served in several other leadership positions at Sonus including Senior Vice President of Technology Development; and Vice President of Product Management and Business Development. Sonus combined with GENBAND in 2017 in a series of merger transactions to form Ribbon.\n\"We are fortunate to have someone with Tony's visionary leadership and proven track record of innovation in the industry, helping to lead us into this new chapter,\" said Fritz Hobbs, President and Chief Executive Officer of Ribbon. \"Tony brings a unique and insightful perspective as we continue our commitment to delivering our customers the industry's most advanced real time communications and security solutions.\"\nHobbs added, \"Our focus is on helping service providers and enterprises embrace the digital economy by transitioning their networks to the latest in secure IP and cloud-based technologies while leveraging current investments and assets. Tony will be a key asset in helping us execute this strategy.\"\n\"It is such an exciting time to be a part of the industry and Ribbon is uniquely primed to capitalize on the numerous opportunities that are before us,\" said Scarfo. \"Bringing together the strengths of two industry-leading organizations, leveraging decades of cutting edge, patent-protected science and the world-class talent that the company possesses made becoming a part of the Ribbon team a very easy decision.\"\nScarfo's career has spanned technology, product management, marketing, channel, business development and sales leadership roles at well-known companies including Polycom, Inc., ECI Telecom Ltd., Juniper Networks, Inc., Unisphere Networks, Inc., Lucent Technologies, Inc. and AT&T Inc.\nKey Takeaways :\nRibbon has appointed long-time technology veteran Tony Scarfo as Executive Vice President of Products and R&D Scarfo will be responsible for leading the company's core Product Lifecycle Management and solutions roadmap strategy Scarfo previously served as Sonus Networks' Executive Vice President of Technology and Business Development from 2013 -2016, leading in virtualizing the company's SBC portfolio and helping it become one of the fastest growing products on the market. He also served in several other senior management positions at Sonus. Scarfo has served in various leadership roles across technology organizations that include Polycom, Juniper Networks, Lucent Technologies and AT&T.\nAbout Ribbon Communications\nRibbon Communications Inc. (Nasdaq: RBBN) is a company with two decades of leadership in real-time communications. Built on world-class technology and intellectual property, the company delivers intelligent, secure, embedded real-time communications for today's world. The company transforms fixed, mobile and enterprise networks from legacy environments to secure IP and cloud-based architectures, enabling highly productive communications for consumers and businesses. With 64 locations in 27 countries around the globe, Ribbon's innovative, market-leading portfolio empowers service providers and enterprises with rapid service creation in a fully virtualized environment. The company's Kandy Communications Platform as a Service (CPaaS) delivers a comprehensive set of advanced embedded communications capabilities that enables this transformation. To learn more, visit ribboncommunications.com .\nInvestor Relations\nSara Leggat\n+1 (978) 614-8841\nsleggat@rbbn.com\nUS Press\nDennis Watson\n+1 (214) 695-2224\ndwatson@rbbn.com\nInternational Press\nCatherine Berthier\n+1 (646) 741-1974\ncberthier@rbbn.com\nAnalyst Relations\nMichael Cooper\n+1 (708) 383-3387\nmcooper@rbbn.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/ribbon-communications-appoints-tony-scarfo-executive-vice-president-of-products-and-rd-300589775.html\nSOURCE Ribbon Communications Inc.", "external_links": ["https://ribboncommunications.com/solutions/service-provider-solutions/network-functions-virtualization", "https://ribboncommunications.com/solutions/enterprise-solutions/unified-communications", "http://www.prnewswire.com/news-releases/ribbon-communications-appoints-tony-scarfo-executive-vice-president-of-products-and-rd-300589775.html", "https://ribboncommunications.com/solutions/enterprise-solutions/microsoft-skype-business", "https://ribboncommunications.com/solutions/enterprise-solutions/cloud-services-enterprises", "https://ribboncommunications.com/products/enterprise-products/session-border-controllers/sbc-software-edition-sbc-swe", "https://ribboncommunications.com/solutions/service-provider-solutions/mobile-network-solutions", "http://www.ribboncomm.com/"], "published": "2018-01-31T16:00:00.000+02:00", "crawled": "2018-01-31T17:20:41.015+02:00", "highlightTitle": ""}