{"organizations": [], "uuid": "4bd49bbc8829a04e7d3c04117af109ec3276723a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-shiftpixy-inc-areports-fiscal-2018-first-quarter-results.html", "country": "US", "domain_rank": 767, "title": "ShiftPixy, Inc. Reports Fiscal 2018 First Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T00:05:00.000+02:00", "replies_count": 0, "uuid": "4bd49bbc8829a04e7d3c04117af109ec3276723a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-shiftpixy-inc-areports-fiscal-2018-first-quarter-results.html", "ord_in_thread": 0, "title": "ShiftPixy, Inc. Reports Fiscal 2018 First Quarter Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}], "organizations": [{"name": "shiftpixy, inc", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IRVINE, Calif., Jan. 22, 2018 (GLOBE NEWSWIRE) -- ShiftPixy, Inc. (NASDAQ:PIXY), a developing, proprietary next-gen technology platform for workforce engagement and management, today announced operating results for the three months ended November 30, 2017 (“2018 First Quarter”).\n2018 First Quarter Highlights\nGross billings grew 14.7% to $40.2 million, compared to $35.0 million for the 2017 first quarter; gross billings for the quarter increased, sequentially, 21.2% from $33.1 million in the prior quarter. Revenues increased 14.6% to $6.5 million for the quarter, compared to $5.7 million for the first quarter of 2017. Worksite employees increased by 719 to 5,682 compared to 4,963 as of November 30, 2016; the number of employees at the end of the quarter also represents a sequential increase of 608 over the number of employees at the end of the fourth quarter 2017. Gross profit for the quarter was $1.2 million versus $2.0 million in the prior year period, and net loss per share was 12 cents during the quarter, versus a net profit of 1 cent the prior year period.\n“ShiftPixy remains an early stage company, and we will continue to invest in the business as appropriate, in areas such as product development, sales and marketing and client support,” noted Scott W. Absher, Chief Executive Officer of ShiftPixy. “Over the past year, we’ve also incurred the necessary professional expenses related to being a publicly-traded company.”\nMr. Absher continued, “We are pleased with our pattern of growth and the development of our technology platform. We anticipate that the continued development of our technology platform will further enhance our service offerings and better enable us to meet the needs of our assigned workforce and clients as we endeavor to create value for our shareholders.”\n2018 Second Quarter Guidance\nBased on our preliminary development of financial statements for the second quarter ending February 28, 2018, the Company currently expects gross billings for fiscal second quarter 2018 to be in the range of $60 million to $65 million, which at the midpoint would represent a sequential increase of 55.6% over the fiscal first quarter 2018. Our expectations may change as we continue development of our financial statements for the quarter.\nWebcast\nShiftPixy will host a webcast at 5:00 p.m. Eastern Time on Monday, January 22, 2018, to discuss financial results for the 2018 fiscal first quarter. Investors can access the webcast through the ShiftPixy website at https://ir.shiftpixy.com .\nAbout ShiftPixy\nShiftPixy is a disruptive human capital management (HCM) services provider, revolutionizing employment in the Gig Economy by delivering a next-gen platform for workforce management that helps businesses with shift-based employees navigate regulatory mandates, minimize administrative burdens and better connect with a ready-for-hire workforce. With expertise rooted in management’s nearly 25 years of workers’ compensation and compliance programs experience, ShiftPixy adds a needed layer for addressing compliance and continued demands for equitable employment practices in the growing Gig Economy. ShiftPixy’s complete HCM ecosystem is designed to manage regulatory requirements and compliance in such required areas as paid time off (PTO) laws, insurance and workers’ compensation, minimum wage increases, and the Affordable Care Act (ACA) compliance.\nShiftPixy Cautionary Statement\nThe information provided in this release includes forward-looking statements, the achievement or success of which involves risks, uncertainties, and assumptions. Although such forward-looking statements are based upon what management of the Company believes are reasonable assumptions, there can be no assurance that forward-looking statements will prove to be accurate. If any of the risks or uncertainties, including those set forth below, materialize or if any of the assumptions proves incorrect, the results of ShiftPixy, Inc., could differ materially from the results expressed or implied by the forward-looking statements we make. The risks and uncertainties include, but are not limited to, risks associated with the nature of our business model; our ability to execute the Company's vision and growth strategy; our ability to attract and retain clients; our ability to assess and manage risks; changes in the law that affect our business and our ability to respond to such changes and incorporate them into our business model, as necessary; our ability to insure against and otherwise effectively manage risks that affect our business; competition; reliance on third-party systems and software; our ability to protect and maintain our intellectual property; and general developments in the economy and financial markets. Statements made in connection with any guidance may refer to financial statements that have not been reviewed or audited. The Company undertakes no obligation to update forward-looking statements if circumstances or management's estimates or opinions should change, except as required by applicable securities laws. The information in this press release shall not be deemed to be \"filed\" for the purpose of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that section, and will not be deemed an admission as to the materiality of any information that is required to be disclosed solely by Regulation FD. Further information on these and other factors that could affect the financial results of ShiftPixy, Inc., is included in the filings on Forms 1-A and 10-Q and in other filings we make with the Securities and Exchange Commission from time to time. These documents are available on the \"SEC Filings\" subsection of the \"Investor Information\" section of our website at https://ir.shiftpixy.com/financial-information/sec-filings .\nConsistent with the SEC’s April 2013 guidance on using social media outlets like Facebook and Twitter to make corporate disclosures and announce key information in compliance with Regulation FD, ShiftPixy is alerting investors and other members of the general public that ShiftPixy will provide updates on operations and progress required to be disclosed under Regulation FD through its social media on Facebook, Twitter, LinkedIn and YouTube. Investors, potential investors, shareholders and individuals interested in our Company are encouraged to keep informed by following us on Facebook, Twitter, LinkedIn and YouTube.\nCONTACT:\nMedia:\nClark Wilson\nclark.wilson@shiftpixy.com\n888.798.9100\nInvestors :\nInvestorRelations@shiftpixy.com\n800.475.3655\nShiftPixy, Inc. Condensed Consolidated Balance Sheets November 30,\n2017 August 31, 2017\nASSETS (Unaudited) Current Assets Cash and cash equivalents $ 2,822,325 $ 5,896,705 Accounts receivable 471,189 428,790 Prepaid expenses 2,895,076 2,687,188 Other current assets 16,363 15,916 Total Current Assets 6,204,953 9,028,599 Fixed assets, net 297,775 288,065 Deposits and Other assets 149,480 126,480 Total Assets $ 6,652,208 $ 9,443,144\nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent Liabilities\nAccounts payable $ 1,773,318 $ 1,160,474\nPayroll related liabilities 2,295,262 2,388,454\nOther current liabilities 142,075 278,982\nTotal Current Liabilities 4,210,655 3,827,910\nCommitments and Contingencies\nStockholders' Equity Preferred stock, 50,000,000 authorized shares; $0.0001 par value; no shares issued and outstanding - - Common stock, 750,000,000 authorized shares; $0.0001 par value; 28,799,856 and 28,762,424 shares issued and outstanding, respectively 2,880 2,877 Additional paid-in capital 15,180,117 15,012,584 Accumulated deficit (12,741,444 ) (9,400,227 ) Total Stockholders' Equity 2,441,553 5,615,234 TOTAL LIABILITIES AND STOCKHOLDERS' EQUITY $ 6,652,208 $ 9,443,144\nShiftPixy, Inc. Condensed Consolidated Statements of Operations (Unaudited) For the Three\nMonths\nEnded November\n30, 2017 November\n30, 2016 Revenues (gross billings of $40.2 million and $35.0 million less worksite employee payroll cost of $33.7 million and $29.4 million, respectively) $ 6,511,919 $ 5,681,676 Cost of Revenue 5,266,403 3,730,553 Gross Profit 1,245,516 1,951,123 Operating Expenses 4,586,733 1,573,024 Net (Loss) Income $ (3,341,217 ) $ 378,099 Net (Loss) Income per common share available to Common Shareholders: Basic $ (0.12 ) $ 0.01 Diluted $ (0.12 ) $ 0.01 Weighted Average Number of Common Shares Used in Per Share Computations: Basic 28,767,850 26,213,800 Diluted 28,767,850 26,974,150\nSource:ShiftPixy, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=urdkturmUZB-I7a-JOqVhXUNTle1_G3ibRFqSN-NrnPCc5BthhWWzmYAqFAPmyv20114v0itxoeS_ckwkfl3pg==", "https://www.globenewswire.com/Tracker?data=26PNmaRteNYnhi3nI_QGSsT4db6kzJaWiFlJDPW4TGY0-Yiv5MdiESxPxZFQz9M-vabaUUmd9aFItDy3OKY8tQ==", "https://www.globenewswire.com/Tracker?data=LD4byAxUUIUomJ3F9Gw_EozOuQOFLSP796r-UPzeCymf4Hz0wDl1Q4mblPVl_Q4qeBKxC7PpfouKCtkU03dvkgL__Zhmj5-6FaSfXoWeRTYBKZo4OUQpjFmZPwzw_8DvyFUoaGUf2AQ35AHEe83I39E0lNrjJED76tDaSEpmtg9G8AgpCRpoIXjGe5wCbAUp", "https://www.globenewswire.com/NewsRoom/AttachmentNg/77aa1d32-3462-4abd-975a-4862aa143847", "https://ir.shiftpixy.com/financial-information/sec-filings", "https://www.globenewswire.com/Tracker?data=wUK6tU9_QXK4nHqJpxgEBG0vFvzMCzk60raEvgQLCozcRtT4giX9e77cmO_Kc1y3qU2Zb6aMYDxJ-TUst6yV5-TTxbRp-aETsuHBT4w-ajWMUAQKXV-cylQUNqq-DHXs", "https://www.globenewswire.com/Tracker?data=LD4byAxUUIUomJ3F9Gw_EozOuQOFLSP796r-UPzeCyn9LzVnrqXti9ux1Ws1y_TToOb8S-rxvZsPoH7Kb1L0Nh-A7V1yVfUHq8S2dkHnW_w=", "https://www.globenewswire.com/Tracker?data=Dia3H1EriawGmRdg3DjavXb5fzFMAnahuIgFXdFzZX8qVtoYgVCwHcqI1KX7o0Y-kATsev-fWX9gkNAxfJMNDo24rrNdRs8s7MG0MmW6BKIJHJM5uOWzqoMMsBvXK4J5"], "published": "2018-01-23T00:05:00.000+02:00", "crawled": "2018-01-23T02:16:47.006+02:00", "highlightTitle": ""}