{"organizations": [], "uuid": "c7dec2d1012631f64861842ef2dc789dde12729c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-multi-billion-dollar-waste-management-industry-continues-to-evolve-with-a-rise-in-technological-innovation.html", "country": "US", "domain_rank": 767, "title": "Multi-billion Dollar Waste Management Industry Continues to Evolve With a Rise in Technological Innovation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T17:48:00.000+02:00", "replies_count": 0, "uuid": "c7dec2d1012631f64861842ef2dc789dde12729c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-multi-billion-dollar-waste-management-industry-continues-to-evolve-with-a-rise-in-technological-innovation.html", "ord_in_thread": 0, "title": "Multi-billion Dollar Waste Management Industry Continues to Evolve With a Rise in Technological Innovation", "locations": [], "entities": {"persons": [{"name": "deep", "sentiment": "none"}], "locations": [{"name": "florida", "sentiment": "none"}], "organizations": [{"name": "dollar waste management industry continues", "sentiment": "negative"}, {"name": "dun & bradstreet - first research", "sentiment": "none"}, {"name": "united nations environment programme", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PALM BEACH, Florida, January 19, 2018 /PRNewswire/ --\nMarketNewsUpdates.com News Commentary\nIn a recent report published by Dun & Bradstreet - First Research - the global waste and recycling industry collects more than 11 billion tons of solid waste and generates about $410 billion in revenue each year, according to the United Nations Environment Programme. The waste management services industry is largest in developed nations that consume more resources and generate more waste. Demand depends on the volume of waste generated, which depends on economic conditions and consumer spending. The profitability of individual companies depends on efficient operations, because the service is a commodity sold based on price. The waste management market has emerged as amongst the most swiftly developing market. Some of the prominent trends that the market is witnessing include technological advancements, expanding medical waste management services, lack of stringent regulations in developing countries and rising government initiatives. Industry Active companies in the news this week include Deep Green Waste & Recycling Inc. (OTC: DGWR), Waste Management Inc. (NYSE: WM), Republic Services Inc. (NYSE: RSG), Advanced Disposal Services Inc. (NYSE: ADSW), Waste Connections Inc. (NYSE: WCN)\nDeep Green Waste & Recycling Inc. (OTC: DGWR) enters into a distributor contract with Veolia North America to further expand its offering of waste solution products and services for commercial properties. Under this agreement Deep Green will include Veolia's RecyclePak® brand environmental and universal waste program into Deep Green's growing portfolio of enhanced waste management services for its retail, multifamily, industrial and institutional client base.\n\"Universal waste is a huge problem and we feel that this is a valuable additional service for our clients. It is a great solution for them for the disposal of fluorescent lamps, ballasts, batteries, computer electronics and other mercury and heavy metal containing waste\", stated Bill Edmonds, Chairman and CEO of Deep Green. \"Not only is this a valuable service for our customers to help them be environmentally responsible and legally compliant, but it is a naturally accretive contributor to our revenue and cash flow, one more positive thing we're doing for the environment, and a great market expander for Deep Green\". Read this and more news for DGWR at http://www.marketnewsupdates.com/news/dgwr.html\nAdditional waste management announcements include:\nWaste Management Inc. (NYSE: WM) recently announced it will distribute US $2,000 in 2018 to every North American employee not on a bonus or sales incentive plan; that includes hourly and other employees. \"We are about to get a tax benefit as our U.S. corporate tax rate goes from 35 percent to 21 percent. In considering how to best spend that, we wanted to find a way to help grow our economy, which in turn, will help grow our business, and give some of the tax savings back to those hardworking employees who do not get the opportunity to participate in our salaried incentive plans,\" said Jim Fish, president and chief executive officer, Waste Management. \"So, we are offering each North American hourly full-time employee and salaried employee who does not participate in any sales incentive or bonus plan during 2018, a cash bonus of US $2,000 to show our appreciation to so many of our valued employees while growing our business and returning a good portion of the tax savings directly to the overall economy,\" he continued.\nRepublic Services Inc. (NYSE: RSG) closed down slightly on Thursday at $67.91 trading over 1.2 Million shares by the market close but was up slightly in afterhours trading. Republic Services will release its fourth quarter 2017 financial results on Thursday, Feb. 8, 2018, after the market closes, and will host an investor conference call at 5 p.m. ET. A live audio webcast of the conference call can be accessed by logging onto the Company's Investor Relations page on RepublicServices.com or listeners may access the call by dialing 844-890-1789 or 412-717-9598, passcode \"Republic Services. Republic Services, Inc. is an industry leader in U.S. recycling and non-hazardous solid waste disposal. Through its subsidiaries, Republic's collection companies, recycling centers, transfer stations and landfills focus on providing effective solutions to make proper waste disposal effortless for their 14 million customers.\nAdvanced Disposal Services Inc. (NYSE: ADSW) also announced on Thursday it will release fourth quarter results on February 22, 2018 after closing and host its investor conference call at 10:00 a.m. EDT on February 23, 2018. A live version of the call can be accessed by dialing (866) 478-7805 domestically or (832) 445-1679 internationally and asking for conference ID#3099638 or the Advanced Disposal Q4 2017 earnings call. This call will be recorded and available via replay approximately two hours after completion for thirty days. You may access the recording by dialing (855) 859-2056 or through the link on the investor relations page of the company's website at http://www.AdvancedDisposal.com .\nWaste Connections Inc. (NYSE: WCN) recently announced that it will report financial results for the fourth quarter of 2017 and outlook for the full year 2018 after the close of the stock market on February 14, 2018. The Company will be hosting an investor conference call related to this release on February 15th at 8:30 A.M. Eastern Time. To access the call, listeners should dial 800-786-6705 (within North America) or 212-231-2933 (international) approximately 10 minutes prior to the scheduled start time and ask the operator for the Waste Connections conference call (a Passcode is not required). A replay of the conference call will be available until February 22, 2018, by calling 800-633-8284 (within North America) or 402-977-9140 (international) and entering Passcode # 21879922.\nDISCLAIMER: MarketNewsUpdates.com (MNU) is a third party publisher and news dissemination service provider, which disseminates electronic information through multiple online media channels. MNU is NOT affiliated in any manner with any company mentioned herein. MNU and its affiliated companies are a news dissemination solutions provider and are NOT a registered broker/dealer/analyst/adviser, holds no investment licenses and may NOT sell, offer to sell or offer to buy any security. MNU's market updates, news alerts and corporate profiles are NOT a solicitation or recommendation to buy, sell or hold securities. The material in this release is intended to be strictly informational and is NEVER to be construed or interpreted as research material. All readers are strongly urged to perform research and due diligence on their own and consult a licensed financial professional before considering any level of investing in stocks. All material included herein is republished content and details which were previously disseminated by the companies men", "external_links": ["http://www.firstresearch.com/industry-research/Waste-Management-Services.html", "http://www.marketnewsupdates.com/news/dgwr.html"], "published": "2018-01-19T17:48:00.000+02:00", "crawled": "2018-01-19T21:03:51.008+02:00", "highlightTitle": ""}