{"organizations": [], "uuid": "3b439302c3b3eb49669821336f4b7f9ceb1a3051", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-reviver-auto-closes-11-point-1-million-finance-round-to-expand-footprint-of-worlds-first-digital-license-plate.html", "country": "US", "domain_rank": 767, "title": "Reviver Auto Closes $11.1 Million Finance Round to Expand Footprint of World's First Digital License Plate", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T17:00:00.000+02:00", "replies_count": 0, "uuid": "3b439302c3b3eb49669821336f4b7f9ceb1a3051"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-reviver-auto-closes-11-point-1-million-finance-round-to-expand-footprint-of-worlds-first-digital-license-plate.html", "ord_in_thread": 0, "title": "Reviver Auto Closes $11.1 Million Finance Round to Expand Footprint of World's First Digital License Plate", "locations": [], "entities": {"persons": [{"name": "ken denman", "sentiment": "none"}, {"name": "r.l. polk", "sentiment": "none"}, {"name": "stephen polk", "sentiment": "none"}], "locations": [{"name": "foster city", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "highgate", "sentiment": "none"}, {"name": "foster city", "sentiment": "none"}, {"name": "ca", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "ack group", "sentiment": "none"}, {"name": "lendingclub", "sentiment": "none"}, {"name": "reviver auto", "sentiment": "none"}, {"name": "carfax", "sentiment": "none"}, {"name": "wrv", "sentiment": "none"}, {"name": "detroit regional chamber of commerce", "sentiment": "none"}, {"name": "motorola", "sentiment": "none"}, {"name": "detroit auto show", "sentiment": "none"}, {"name": "costco", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FOSTER CITY, Calif., Jan. 10, 2018 /PRNewswire/ -- Reviver Auto , creator of the RPlate™, the world's first digital license plate, has closed an $11.1 million funding round led by Australian-based ACK Group, with participation from WRV and a number of strategic individual investors.\nThe rapidly growing company, which recently relocated from San Francisco to an approximately 11,000 square foot facility in Foster City, CA, also announced two additions to its Board of Directors: Ken Denman, former CEO of Emotient, which was acquired by Apple, who also serves on the boards of Costco, Motorola and LendingClub; and Stephen Polk, CEO of Highgate, LLC, current Chairman of The Detroit Regional Chamber of Commerce, and former Chairman of R.L. Polk and Carfax.\nReviver Auto's RPlate Pro, which officially launches at the Detroit Auto Show next week, transforms the 125-year-old stamped metal vehicle license plate into a modern, aesthetically designed, multi-functional digital display and connected car platform which will deliver multiple efficiencies to businesses, state agencies and consumers, including a first-ever digitally-automated vehicle registration platform.\nThe investment further accelerates the development of the Reviver Auto platform and its patented technology, including RConnect, the platform that manages the RPlate's functionality. It also fuels the company's work with state DMVs and legislatures as the RPlate expands its national footprint. In addition to California and Arizona, legislation authorizing pilot programs for the RPlate has been passed in Texas and Florida.\n\"We are on a mission to change the future of automotive ownership and everyday driving by transforming communications between vehicle owners, drivers and the world around them,\" said Neville Boston, CEO of Reviver Auto. \"This investment helps accelerate the fulfillment of that mission, further boosting the development of strategic partnerships that will broaden the RPlate's range of functionalities – all designed to make life easier for businesses and consumers.\"\nState DOTs, DMVs, OEMs, fleet management companies and auto dealers, among others, are looking to the RPlate for a myriad of solutions, including streamlined vehicle registration, new opportunities for personalized license plate designs, targeted marketing messaging, emergency alert broadcasting, vehicle tracking and, as electric vehicles popularity takes hold, a unique solution to the growing road usage tax tracking issues faced by states.\n\"The RPlate has the potential to change the way we think of vehicle ownership - starting first with digital vehicle registration – which is a tremendously inefficient process,\" said Stephen Polk, Reviver Auto board member. \"The capabilities of the RPlate are unlimited - think automated parking and toll payments, digital parking permits, personalized messaging, and, of course, vehicle specific data and driving behavior analytics for commercial businesses that can be utilized to track vehicles, mileage, etc.\"\nErnst Leib, current Reviver Auto board member and former CEO and President of Mercedes Benz USA, Canada and Australia, also invested in the round and said: \"It's exciting to see the reaction the RPlate elicits from everyone who sees it – this is truly a game-changing technology for the automotive industry and I'm thrilled to be a part of the Reviver Auto team as it builds up production capabilities and begins shipping the first of the thousands of digital license plates it will deliver to customers throughout California in 2018.\"\nReviver Auto's RPlate Pro can be seen in booth #MS06 at The Detroit Auto Show's Automobili-D showcase; the company will hold a press conference on Tuesday, Jan 16 th at 3:05 PM on the Atrium Stage at the Detroit Cobo Center.\nAbout Reviver Auto\nReviver Auto's mission is to bring new and far-reaching efficiencies, revolutionary marketing, and unprecedented connectivity to the auto industry through disruptive technology. With its RPlate™, the company has completely reinvented the 125-year-old stamped metal license plate into a connected car platform that digitizes and automates the costly, often frustrating and time-consuming DMV renewal process. Approved by multiple DMVs and DOTs, the RPlate also provides telematics functionality and brings a new level of personalization to existing license plates. For more information visit http://www.reviverauto.com .\nMedia Contact:\nCassandra Cavanah, mWEBB Communications, cassandra@mwebbcom.com or 818-397-4630\nView original content with multimedia: http://www.prnewswire.com/news-releases/reviver-auto-closes-111-million-finance-round-to-expand-footprint-of-worlds-first-digital-license-plate-300580555.html\nSOURCE Reviver Auto", "external_links": ["http://www.prnewswire.com/news-releases/reviver-auto-closes-111-million-finance-round-to-expand-footprint-of-worlds-first-digital-license-plate-300580555.html", "http://www.reviverauto.com/"], "published": "2018-01-10T17:00:00.000+02:00", "crawled": "2018-01-10T18:51:48.030+02:00", "highlightTitle": ""}