{"organizations": [], "uuid": "7f10687b940def5a96acf4e9fa856b0189529a05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/04/15/103551544-GettyImages-556379945.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/19/us-regulator-charges-cabbagetech-with-bitcoin-related-fraud.html", "country": "US", "domain_rank": 767, "title": "US regulator charges 'CabbageTech' with bitcoin-related fraud", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T17:36:00.000+02:00", "replies_count": 0, "uuid": "7f10687b940def5a96acf4e9fa856b0189529a05"}, "author": "Evelyn Cheng", "url": "https://www.cnbc.com/2018/01/19/us-regulator-charges-cabbagetech-with-bitcoin-related-fraud.html", "ord_in_thread": 0, "title": "US regulator charges 'CabbageTech' with bitcoin-related fraud", "locations": [], "entities": {"persons": [{"name": "patrick k. mcdonnell", "sentiment": "none"}, {"name": "cabba", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "staten island", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "u.s. commodity futures trading commission", "sentiment": "none"}, {"name": "cabbagetech", "sentiment": "none"}, {"name": "cftc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "In the latest bitcoin -related fraud, a digital currency trading scheme called CabbageTech has disappeared from the internet allegedly with customers' funds.\nThe U.S. Commodity Futures Trading Commission announced Friday it charged Patrick K. McDonnell and his company CabbageTech with \"fraud and misappropriation in connection with purchases and trading of Bitcoin and Litecoin.\"\nBased just outside Manhattan, in Staten Island, New York, CabbageTech operated under the name \"Coin Drop Markets.\" Since around January 2017, the company promised customers real-time trading advice but never provided it and essentially disappeared after receiving payment, the complaint said.\nshow chapters CFTC charges CabbageTech with virtual currency fraud 2 Hours Ago | 01:30 \"Defendants also solicited 'lifetime' memberships in a more exclusive trading sector that would provide greater opportunities to profit from virtual currency trading,\" the complaint said. \"For example, one such opportunity purported to offer profits as much as 300% return on an investment in less than a week.\"\nThe domain Cabbage.tech appears for sale at $3,999 , and the complaint points out that the company has removed other social media materials from the internet.\n\"In reality, as alleged, customers only bought into the Defendants' fraudulent scheme,\" CFTC director of enforcement, James McDonald, said in a statement. \"We will continue to work hard to identify and remove bad actors from these markets.\"\nThe commission is seeking the return of funds to defrauded customers, among other actions in the civil litigation case. The complaint to the U.S. District Court of the Eastern District of New York also demands a jury trial.\nSeparately on Friday, the Commodity Futures Trading Commission announced it charged a Colorado resident named Dillon Michael Dean with engaging in a fraudulent scheme to \"solicit at least $1.1 million worth of Bitcoin from more than 600 members of the public to participate in a pooled investment vehicle for trading commodity interests.\"\nDean's company, The Entrepreneurs Headquarters, did not invest the funds into binary options contracts, as promised, but used some of them to pay other customers \"in the manner of a Ponzi scheme,\" the complaint alleged.\nLawyers for CabbageTech and The Entrepreneurs Headquarters couldn't immediately be reached for comment.\nWATCH: Bitcoin could be the biggest bubble in history – here's how show chapters Bitcoin could be the biggest bubble in history – here's how 7:26 AM ET Wed, 17 Jan 2018 | 02:00", "external_links": [], "published": "2018-01-19T17:36:00.000+02:00", "crawled": "2018-01-19T17:45:33.004+02:00", "highlightTitle": ""}