{"organizations": [], "uuid": "79b6997ae84ac761fa43d72f65748f12bde76780", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218719875&w=1200&r=LYNXMPEE0102N", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/singapore-economy-gdp/singapore-q4-gdp-growth-slows-as-manufacturing-loses-steam-idINKBN1ER05M", "country": "US", "domain_rank": 408, "title": "Singapore Q4 GDP growth slows as manufacturing loses steam", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T05:41:00.000+02:00", "replies_count": 0, "uuid": "79b6997ae84ac761fa43d72f65748f12bde76780"}, "author": "", "url": "https://in.reuters.com/article/singapore-economy-gdp/singapore-q4-gdp-growth-slows-as-manufacturing-loses-steam-idINKBN1ER05M", "ord_in_thread": 0, "title": "Singapore Q4 GDP growth slows as manufacturing loses steam", "locations": [], "entities": {"persons": [], "locations": [{"name": "singapore", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "min read  singapore", "sentiment": "none"}, {"name": "ministry of trade and industry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SINGAPORE (Reuters) - Singapore’s economic growth slowed in the fourth quarter as manufacturing lost steam, weighing on a pickup in services sector activity, although full-year growth for 2017 was the fastest in three years.\nFILE PHOTO: Singapore's skyline is seen June 17, 2017. REUTERS/Thomas White/File Photo Gross domestic product in the fourth quarter expanded 2.8 percent on an annualised and seasonally adjusted basis, advance estimates from the Ministry of Trade and Industry showed on Tuesday.\nThat was slightly below the median forecast of 2.9 percent growth in a Reuters survey, and down from a revised 9.4 percent growth in the third quarter.\nCompared with a year earlier, the economy expanded 3.1 percent in the October-December quarter, slowing from the third quarter’s revised 5.4 percent growth, which was the fastest on-year growth in nearly four years.\n“The longer trend of Singapore relying more on services growth is likely to resume starting from 2018, with external oriented services sectors growing at a faster pace than domestic oriented ones,” said Jeff Ng, chief economist Asia for Continuum Economics.\nFull-year growth in 2017 came in at the top end of the government’s official 3.0 to 3.5 percent forecast range and was the fastest growth since GDP expanded nearly 3.6 percent in 2014. The economy grew 2.0 percent in 2016.\nThe government has previously said it expects growth of 1.5 to 3.5 percent in 2018.\nThe city-state’s growth figures come amid signs Asian economies remained on a solid footing in late 2017.\nJapanese exports accelerated sharply in November, while exports in South Korea climbed for the 14th straight month in December. In China, the manufacturing sector slowed slightly but still expanded in December for the 18th straight month.\nSingapore’s trade-reliant economy had enjoyed a boost in 2017 from an improvement in global demand, particularly for electronics products and components such as semiconductors.\nThe manufacturing sector lost some shine in the fourth quarter, however, contracting 11.5 percent on an annualised basis after jumping 38.0 percent in the third quarter. Compared with a year earlier, manufacturing grew 6.2 percent in the fourth quarter.\nThe construction sector contracted 3.6 percent on an annualised basis, shrinking for the fourth straight quarter.\nThe services sector grew 7.5 percent on an annualised basis, recording the fastest growth since the fourth quarter of 2016.\nReporting by Masayuki Kitano; Editing by Sam Holmes\n ", "external_links": [], "published": "2018-01-02T05:41:00.000+02:00", "crawled": "2018-01-02T06:01:28.012+02:00", "highlightTitle": ""}