{"organizations": [], "uuid": "11ba6da703d2481c9a1a333a5d08edb3d2752451", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-jefferson-health-and-national-jewish-health-announce-jesse-roman-md-as-ceo-of-the-jane-leonard-korman-respiratory-institute.html", "country": "US", "domain_rank": 767, "title": "Jefferson Health and National Jewish Health Announce Jesse Roman, MD, as CEO of the Jane & Leonard Korman Respiratory Institute", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T22:17:00.000+02:00", "replies_count": 0, "uuid": "11ba6da703d2481c9a1a333a5d08edb3d2752451"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-jefferson-health-and-national-jewish-health-announce-jesse-roman-md-as-ceo-of-the-jane-leonard-korman-respiratory-institute.html", "ord_in_thread": 0, "title": "Jefferson Health and National Jewish Health Announce Jesse Roman, MD, as CEO of the Jane & Leonard Korman Respiratory Institute", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA, Jan. 25, 2018 /PRNewswire-USNewswire/ -- Jesse Roman, MD, has been appointed CEO of the Jane and Leonard Korman Respiratory Institute, a collaboration of Jefferson Health and National Jewish Health. Dr. Roman brings exceptional leadership skills and extensive experience treating and researching respiratory disease to the Respiratory Institute in Philadelphia.\n\"Dr. Roman's combination of leadership and pulmonary expertise makes him an excellent choice to shape this new collaboration, which will deliver unparalleled respiratory care and research for patients throughout the Delaware Valley,\" said Bruce A. Meyer, MD, MBA, Chief Physician Executive, Jefferson Health.\nAnnounced in 2017, the collaboration between National Jewish Health and Jefferson Health leverages the strengths of each organization to transform the way respiratory care is delivered to patients in the region. The new Respiratory Institute is enabled by the continuing support of the Jane and Leonard Korman Family Foundation. The Respiratory Institute also will be affiliated with the Respiratory Institute that National Jewish Health and Mount Sinai in New York established in 2014. All three institutions will collaborate on research, clinical trials and other programs that will serve patients throughout the Northeast region of the nation.\nDr. Roman will join Jefferson in February. He comes most recently from the University of Louisville School of Medicine, where he was Distinguished University Scholar and Chairman of the Department of Medicine. Prior to that, Dr. Roman was Director of the Emory Center for Respiratory Health within the Woodruff Health Science Center at Emory. He has published more than 115 peer-reviewed articles in scientific journals and 20 manuscripts, primarily on interstitial lung disease, pulmonary fibrosis and sarcoidosis.\nWell-known for his advocacy efforts and community engagement, Dr. Roman established the Interstitial Lung Disease Programs at Emory and University of Louisville, and the Puerto Rico Center for Pulmonary Fibrosis in Mayaguez, Puerto Rico. He continues to consult for pulmonary fibrosis patients in Louisville and Puerto Rico. Dr. Roman recently served as Chair of the Medical Advisory Board of the Pulmonary Fibrosis Foundation and currently chairs the American Thoracic Society Health Equality & Diversity Committee.\n\"We are excited to have Dr. Roman coming on board in this leadership role at Jefferson,\" said Jay Finigan, MD, director of the Centers for Respiratory Excellence at National Jewish Health. \"Together, National Jewish Health, Jefferson Health and Mount Sinai bring extraordinary expertise in developing a patient-centered, multi-disciplinary model of care for complex respiratory illnesses as well as a commitment to working together on breakthrough research.\"\nThomas Jefferson University Hospitals, Inc., is named 16th on U.S. News & World Report's 2017-2018 Best Hospitals Honor Roll, a distinction awarded to just 20 hospitals in the U.S. chosen for breadth and depth of clinical excellence. National Jewish Health is ranked #1 in pulmonology on the U.S. News & World Report list of Best Hospitals, and is the only institution dedicated to research and treatment of respiratory disease, treating both adults and children.\nAbout Jefferson Health\nJefferson Health, home of Sidney Kimmel Medical College, is reimagining health care in the greater Philadelphia region and southern New Jersey. Jefferson's dedicated team of doctors, nurses, health professionals and staff provides a range of primary to highly-specialized care through 13 hospitals (three Magnet®-designated for nursing excellence), more than 50 outpatient and urgent care locations, the NCI-designated Sidney Kimmel Cancer Center and the JeffConnect® telemedicine program. Jefferson's academic health center, Thomas Jefferson University Hospitals, Inc., is recognized by US News & World Report as #16 on the 2017-18 Best Hospitals Honor Roll. Jefferson Health's mission is to improve the health of those patients and communities it is privileged to serve through safe, effective, equitable, compassionate care.\nAbout National Jewish Health\nNational Jewish Health is the leading respiratory hospital in the nation. Founded 119 years ago as a nonprofit hospital, National Jewish Health today is the only facility in the world dedicated exclusively to groundbreaking medical research and treatment of patients with respiratory, cardiac, immune and related disorders. Patients and families come to National Jewish Health from around the world to receive cutting-edge, comprehensive and coordinated care. To learn more, visit www.njhealth.org .\nView original content with multimedia: http://www.prnewswire.com/news-releases/jefferson-health-and-national-jewish-health-announce-jesse-roman-md-as-ceo-of-the-jane--leonard-korman-respiratory-institute-300588438.html\nSOURCE Jefferson Health", "external_links": ["http://www.prnewswire.com/news-releases/jefferson-health-and-national-jewish-health-announce-jesse-roman-md-as-ceo-of-the-jane--leonard-korman-respiratory-institute-300588438.html", "http://www.jeffersonhealth.org/", "http://www.njhealth.org/"], "published": "2018-01-25T22:17:00.000+02:00", "crawled": "2018-01-26T00:05:54.013+02:00", "highlightTitle": ""}