{"organizations": [], "uuid": "64b3b94bee22ec8ed11519b4d5592785e380d843", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223373767&w=1200&r=LYNXMPEE0I14Z", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-global-economics-breakingviews/breakingviews-review-the-high-cost-of-measuring-the-economy-idUSKBN1F81VL", "country": "US", "domain_rank": 408, "title": "Breakingviews - Review: The high cost of measuring the economy", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-19T23:39:00.000+02:00", "replies_count": 0, "uuid": "64b3b94bee22ec8ed11519b4d5592785e380d843"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-global-economics-breakingviews/breakingviews-review-the-high-cost-of-measuring-the-economy-idUSKBN1F81VL", "ord_in_thread": 0, "title": "Breakingviews - Review: The high cost of measuring the economy", "locations": [], "entities": {"persons": [{"name": "david pilling", "sentiment": "none"}, {"name": "pilling", "sentiment": "none"}, {"name": "diane coyle", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters breakingviews", "sentiment": "negative"}, {"name": "financial times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters Breakingviews) - “For the purposes of this book ...‘the economy’ and ‘GDP’ are interchangeable terms.” The footnote on the first page of “The Growth Delusion” is a bit misleading. David Pilling’s intention is to demonstrate that even though maximising Gross Domestic Product has become the standard definition of national economic success, GDP is actually far from interchangeable with the actual economy.\nPilling, a Financial Times journalist, makes a strong case. He is not the first writer to complain that both GDP and the cult of increasing it need to be rethought. His account’s main advantage is easy reading. Serious arguments are lightened by a stream of more and less relevant anecdotes, including entertaining descriptions of statisticians and other experts from around the world.\nSome readers may appreciate the colour, particularly the entertaining historical sketch of the development of the measure. For a more serious account, they should turn to one of Pilling’s principal sources, Diane Coyle’s more sober “GDP: A Brief but Affectionate History”.\nPilling provides a more detailed inventory of the problems with the measure itself and its uses. The fingers of two hands will not be enough to list the faults.\nThe list starts with housework and other labour that is excluded because it is not paid for. Next comes finance, which probably should not be included in GDP at all, and certainly should be measured differently.\nThat’s just the beginning. Improvements in technology are generally underestimated while changes in the calibre of services are almost always ignored. Social decay reduces the quality of life, but its costs mostly add to GDP. If maximising this aggregate measure is the only standard of economic success, then the blight of increasing inequality becomes invisible.\nGDP measures in poor countries are woefully inadequate, often missing both significant progress and the persistence of extreme poverty. Pollution does not subtract from GDP, but the costs of reducing pollution increase it. Crime is a little worse, as both wrongdoing and its prevention tend to increase the measure.\nGDP also misses the damage done by the depletion of natural resources, from the destruction of rain forests to the erosion of topsoil. It takes no count of the construction and degradation of the physical assets needed for production. Nor does it reflect the building up or tearing down of human capital. Finally, GDP does not measure happiness, which Pilling somewhat unpersuasively argues is the actual goal of economic activity.\nEnough already? No, there are other flaws, most of which Pilling mentions in passing. The inflation measures which are vital for calculating so-called real GDP have problems with sampling and indexing. Cross-currency GDP comparisons are faulty. The value of leisure time is ignored, as are the different human values of luxuries, comforts and necessities. The many imputations, approximations and estimates make a mockery of the precision of reported long-term growth rates.\nWith such a long charge sheet, defenders of GDP would seem to be in weak position. However, as Pilling notes, they do have two strong arguments. First, changes in measured real GDP seem to correlate fairly well with other indicators of economic development, especially in poor countries.\nSecond, there is no clearly better alternative. Pilling discusses many proposed additions and modifications, but notes they are all based on subjective judgements of the relative importance of the various dimensions of economic success and failure. The only clear improvement Pilling can suggest is shifting the standard measure from national GDP to average GDP per person, preferably the median rather than the mean.\nWhile “The Growth Delusion” tries to get to the bottom of the GDP problem, Pilling could have dug even deeper. The book only raises, but does not really discuss, two fundamental questions. Why did economic success become almost synonymous with national achievement, and why did GDP growth become almost synonymous with economic success? Both of those equivalences are obviously false, yet seem well-entrenched among politicians and pundits.\nPilling also does not seem to notice that the basic idea behind the political and financial market interest in GDP is at best questionable. It is far from clear that anything as complicated as a modern economy can be reduced to a single number or that anything as multi-faceted as economic success can be measured at all.\nGDP was developed to help governments guide the economy. As a rough measure, it is still useful for that. Similarly, it can be a helpful indicator for central bankers and corporate planners. However, no amount of refinements, additions and alterations, no matter how clever or wise, can make GDP a good measure of economic success in affluent countries.\nFor prosperous people, non-measurable accomplishments – security, opportunity, justice, excellence and environmental respect – are more important than the countable production of goods and services. The best thing to do with GDP now is probably to get over it.\nBreakingviews Reuters Breakingviews is the world's leading source of agenda-setting financial insight. As the Reuters brand for financial commentary, we dissect the big business and economic stories as they break around the world every day. A global team of about 30 correspondents in New York, London, Hong Kong and other major cities provides expert analysis in real time.\nSign up for a free trial of our full service at https://www.breakingviews.com/trial and follow us on Twitter @Breakingviews and at www.breakingviews.com . All opinions expressed are those of the authors.", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-19T23:39:00.000+02:00", "crawled": "2018-01-20T17:27:26.011+02:00", "highlightTitle": ""}