{"organizations": [], "uuid": "6bcac1c49d1ffdaa19c345a638bcd2d281c71796", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/europe-stocks/live-markets-we-would-probably-buy-a-more-pronounced-dip-idUSL8N1PP62H", "country": "US", "domain_rank": 408, "title": "LIVE MARKETS-\"We would probably buy a more pronounced dip\"", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T17:30:00.000+02:00", "replies_count": 0, "uuid": "6bcac1c49d1ffdaa19c345a638bcd2d281c71796"}, "author": "", "url": "https://www.reuters.com/article/europe-stocks/live-markets-we-would-probably-buy-a-more-pronounced-dip-idUSL8N1PP62H", "ord_in_thread": 0, "title": "LIVE MARKETS-\"We would probably buy a more pronounced dip\"", "locations": [], "entities": {"persons": [{"name": "trevor greetham", "sentiment": "none"}, {"name": "helen reid", "sentiment": "none"}], "locations": [], "organizations": [{"name": "multi asset at royal london asset management", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 33 PM / in 38 minutes LIVE MARKETS-\"We would probably buy a more pronounced dip\" Reuters Staff 18 Min Read Jan 30 (Reuters) - Welcome to the home for real time coverage of European equity markets brought to you by Reuters stocks reporters and anchored today by Helen Reid. Reach her on Messenger to share your thoughts on market moves: helen.reid.thomsonreuters.com@reuters.net \"WE WOULD PROBABLY BUY A MORE PRONOUNCED DIP\" (1530 GMT) A sell-off was in the air from the start of the week as bond yields spiked but today we're seeing a bit of an acceleration in price declines with volatility gauges hitting multi-week highs and the STOXX 600 set for its biggest fall since early November, down 1 percent. For some investors the sell-off may have further to go but that could open up possible buying opportunities, as a global macro recovery powers ahead. Among them is Trevor Greetham, Head of Multi Asset at Royal London Asset Management. \"With expectations running high, we think the sell-off may have further to run and we reduced our exposure to equities in our multi asset funds yesterday, although we still remain overweight stocks,\" he says in a note. But he adds: \"With the world economy strong and interest rates low, we would probably buy a more pronounced dip.” (Danilo Masoni) PRESSURE'S ON: EUROPEAN EARNINGS IN THE SPOTLIGHT (1500 GMT) The pressure is on for European equities in 2018 to deliver a convincing sequel to last year's impressive earnings comeback. The recovery in earnings underpins investors' conviction the region is a buy, and should the numbers show signs of fading, international and cross-asset investors may start pulling back. \"In Europe we'd had an absence of top line growth. Our hope and belief is now as that top line growth reappears there should be some decent operating leverage to come through,\" says Marcus Morris-Eyton, portfolio manager, European equities at Allianz Global Investors. Valuations still make Europe relatively attractive, too. \"In Europe you have valuations at a 30 percent discount to U.S.\" Investors' hopes for European earnings come against a backdrop of global earnings expectations also rising strongly (see chart) - but Europe, the latest to emerge from its drawn-out earnings slump, is particularly feeling the heat. (Helen Reid) STOXX 600 ON TRACK FOR WORST DAY IN SIX WEEKS (1412 GMT) Whether you prefer calling it a 'correction' or a 'blip', things have taken a turn for the worse in afternoon trading. The STOXX 600 just hit a session low and is now trading down 0.8 percent, on track for its biggest one-day fall in six weeks, since Dec 20. Banks and miners are still leading the slide which accelerated as U.S. futures sank. The bank sector is down 1.4 percent and set for its worst fall in five months. Dow, S&P 500 and Nasdaq futures are trading down 0.7 to 1 percent as the rise in bond yields weighs and Apple again falls 1.1 percent in premarket trading. The VIX index of S&P 500 volatility has crept up to its highest level since Dec 1, crossing the 14 mark for the first time in nearly two months. Just as, with January nearing a close, New Year greetings and resolutions go stale, so the New Year 'melt-up' seems to have reached an existential impasse. (Helen Reid) LOOKING FOR HEDGES? CONSIDER THE SMI (1320 GMT) Rising bond yields, trade war worries, stretched stock valuations have generated a mild risk-off mood and with the \"correction\" word sneaking back into market commentary, fund managers are looking for ways to protect their portfolios. Strategists at Natixis recommend considering Switzerland and its top share index SMI as they draw a comparison to Japan's Nikkei. Japan and Switzerland both enjoy currencies with a safe haven status, making their equity markets an interesting case but Natixis has found a key difference. \"It is no secret that JPY and Nikkei Index are inversely correlated. Businesses in Japan have enjoyed benefits from cheaper currency and expansionary monetary policy. On the other hand, SMI Index and CHF have not shown strong relation to one another,\" they say. \"Switzerland’s export GDP growth has been similar to that of Japan and the two central banks conducted an asset purchasing program, though SNB operated in a quiet and discreet way during 2009-2010, with a negative policy rate. Factors for JPY and Nikkei correlation have not had an impact on the Swiss financial market,\" they add. As a result the SMI could be a relatively good bet even when risk-off is on the rise. \"In addition to a stronger performance during risk-on periods, the SMI index also provides greater excess return than Nikkei during risk-off periods,\" they conclude. (Danilo Masoni) **** MEANWHILE, THE EURO BREAK-UP INDEX HITS AN ALL-TIME LOW (1254 GMT) \"At the beginning of 2018 the euro zone is more robust than ever,\" writes behavioural finance analysis house sentix. Its Euro Break-Up Index has hit its lowest ever level, indicating investors are less fearful than ever of the currency union unravelling. This month's reading shows that just 6.9 percent of all surveyed investors expect the euro to break up in the next 12 months. That compares to the high of 73 percent in July 2012 in the depths of the euro zone debt crisis. The one area of concern? Italy: sentix's sub-index for the country rose this month to 5.22%, meaning investors see it \"as most likely to be regarded as a candidate for exit from the euro\". Analysts at sentix expect this to increase until Italy's election on March 4. (Helen Reid) EUROPEAN EQUITIES: GROWTH VS VALUE (1207) As we pointed out in yesterday's blog, years of low interest rates helped propel the performance of growth stocks as investors were happy to buy into the promise of future earnings. The rise in bond yields may increase the appeal of \"jam today\" in he form of \"value\" stocks. Allianz Global Investors is watching carefully to see if bond yields are rising more because of solid economic growth, or due to an inflation risk coupled with subdued growth. If it’s the former, “then people won’t want to pay so much of a premium for resilient growth if they can get more cyclical recovery,” said Simon Gergel, Chief Investment Officer for UK Equities. If the latter, “then I think the typical growth stocks will probably do better”. Gergel sees the UK market polarized between higher growth international companies that are seen as more resilient like Unilever or Diageo and then smaller domestic cyclical players facing the brunt of Brexit economic risk and a potential change of government. Among Gergel’s more recent buys: Barclays, Bovis Homes, Land Securities . He also holds IG Group, National Grid, Shell (took some profits recently), BP. (Tom Pfeiffer) **** TELECOMS FACE REGULATORY TECTONIC SHIFT AS FANGS TARGETED (1143 GMT) HSBC has taken a look at the interface of telecoms and technology regulation and for once there's good news for phone companies, which have been the top underperformers in Europe over the last few years whereas tech has done brightly. \"After years of being on the receiving end of onerous rules imposed at the behest of Silicon Valley (i.e., net neutrality), there is now a tectonic shift underway for telecoms. The FANGs (Facebook, Amazon, Netflix, Google) have fallen from grace, and telecoms operators are looking to capitalise on this,\" HSBC analysts led by Stephen Howard say in a note. \"We very much doubt operators can seize the role of ‘innovation dynamo’ from the technology giants, and even net neutrality regulation is secure for the present (at least in Europe). However, one advantage of the new climate is that regulators now have, in the form of the FANGs, a fresh set of targets with a far higher media profile than that of the stolid telecoms operators,\" they add. Arguably any regulatory benefit may take time to materialise, but some investors are starting to consider the shifting regulatory environment as they look for fresh long-term opportunities. As you can see in the chart telecoms have led sectoral underperformers in Europe over the last 3 years, while tech has led the gainers. (Danilo Masoni) INSURANCE SECTOR REACHES A \"CRITICAL JUNCTURE\" (1126 GMT) Among the positivity on cyclicals (though not on a day like today), this is the positive view on Europe's insurance sector from Jefferies analysts. They estimate that the value of the sector gains 6 percent for a 50bps upward move in yields. Jefferies adds that an increase in yields benefits the primary life sector most. \"The primary conglomerates remain highly investible, in our view, with our investment focus on those companies continuing to refine capital allocation,\" Jefferies analysts say in a note. However, they do add that, in the event of a 10 percent equity market sell-off, reinsurance and non-life biased stocks such as Allianz and Zurich are the most defensive under such a scenario. (Kit Rees) MORE INVESTORS LOOK AT DIALLING DOWN RISK (1054 GMT) PIMCO’s European global wealth management team say they've found some of their financial intermediary clients in Europe have been looking at reducing risk in their portfolios. This has proven tricky in an environment of zero or negative real returns on cash, PIMCO adds. But they have two potential solutions: low volatility absolute return strategies and core bond strategies, especially those with a U.S. focus. \"Increasing core bond exposure is the more contrarian view; many clients say they plan to decrease allocations in the coming year,\" Ryan P. Blute, managing director and head of PIMCO’s global wealth management business in EMEA, says in a note. \"However, core bonds can play an important diversification role in a portfolio, and U.S. Treasuries in particular remain a source of high quality duration, historically outperforming when there are significant declines in equity or credit markets.\" (Kit Rees) TECH OUTPERFORMS, BUT APPLE AND SUPPLIERS REMAIN UNDER PRESSURE(1038 GMT) While tech is outperforming the market today in a recovery from yesterday's jitters, Frankfurt-listed shares in Apple are falling 1.6 percent to hit their lowest in three months. The bearish sentiment from that Nikkei report we mentioned earlier still seems to be taking its toll, and it's interesting to note that iPhone suppliers Dialog Semiconductor, AMS and ASMI are among the worst-performing in the sector. (Helen Reid) IS A CORRECTION ON THE CARDS? (0845 GMT) A negative day like today lays bare investor concerns about a more potent pullback in equity markets. \"Given current complacency and positioning, when things go wrong there may be quite a violent market reaction and I think we are moving more into that territory in 2018,\" Nicholas Brooks, head of research and investment strategy at Intermediate Capital Group, said, adding that he thinks we are due a correction. Brooks recommends moving into lower-beta sectors and companies and seeking out businesses with high cash flows in relatively defensive sectors. (Kit Rees and Tom Pfeiffer) OPENING SNAPSHOT: CYCLICAL SLIDE PULLS EUROPEAN SHARES LOWER (0817 GMT) European shares have opened lower thanks to falls among commodities-related sectors and financials - almost all sectors are in the red. Is this the start of a pullback? But elsewhere it's all about earnings, with a sprinkling of M&A. Alfa Laval and Swatch are the biggest risers after their updates, while UBM is also up there after Informa confirmed its deal with the conference organiser. Here's your opening snapshot: (Kit Rees) WHAT'S ON THE RADAR FOR EUROPEAN STOCKS (0750 GMT) Taking its cue from Wall Street and Asia, Europe’s stock market is set to suffer losses with futures down 0.6 to 0.8 percent across the major benchmarks. A slide in Apple shares was the catalyst for the weaker U.S. session, after a Nikkei report said the tech giant would halve its iPhone X production. The report came out during European trading hours on Monday and weighed on iPhone suppliers including AMS, Dialog Semiconductor and STMicro, but there may be further pressure on the chipmakers and tech stocks in this session as investors grow skittish about high valuations and the equity ‘melt-up’ with the MSCI World entering its longest ever period without a correction of more than 5 percent. Mining stocks could also be a weight, indicated lower in pre-market as base metals lose ground with the strengthening dollar. Under the benchmark level, a slew of company results should keep traders busy today. Europe’s top tech company, SAP, will be a focus after its results came in shy of expectations and it bought a U.S. software firm for $2.4 billion. The stock is indicated down 1 percent in pre-market. Swatch meanwhile is seen rising 3 to 4 percent after impressive guidance and accelerating sales. (Helen Reid) EARLY MORNING ROUND-UP (0739 GMT) Here are the company headlines grabbing our attention in Europe this morning: SAP talks up cloud business, buys $2.4 bln U.S. sales software firm Debt-ridden Altice to further reduce share capital Philips delivers on Q4 sales growth on higher order intake SCA 2017 operating profit just beats forecasts, dividend higher France's Elis doubles targeted cost synergies from Berendsen acquisition Swatch \"very positive\" on 2018 after H2 sales accelerate Renault-Nissan group pips VW to become top-selling carmaker in 2017 Cevian Capital raises Ericsson stake to 9 pct PZ Cussons Says Profitability Expected To Improve In H2 Volkswagen faces inquiry call over diesel fume tests on monkeys Biggest investor in Italy's Safilo has no intention to change its stake Luxottica sees strong adj. net profit growth after FY sales meet guidance Hedge fund Elliott increases stake in Fox takeover target Sky Alfa Laval CEO sees slower Marine unit demand in Q1 after bumper Q4 (Kit Rees and Tom Pfeiffer) FUTURES POINT TO PULL-BACK IN EUROPEAN STOCKS (0710 GMT) As expected futures have gapped significantly at the open - down 0.5 to 0.7 percent across the board now. Looks like the risk-off mood across the Atlantic will sour today's trading in Europe as well. The chipmakers and Apple suppliers will again be ones to watch, as will all those cyclical sectors leading the rally year-to-date. (Helen Reid) CORRECTION BECOMING INCREASINGLY LIKELY, SAYS GS (0656 GMT) The S&P 500 has had the longest period since 1929 without a correction of more than 5 percent, Goldman Sachs finds, saying a correction is overdue. The MSCI World has also entered its longest period ever without a correction of more than 5 percent. \"As inflows into equities rise strongly alongside increasing optimism, the equity market becomes more vulnerable to disappointments,\" GS writes. They're staying bullish, though - seeing a sharp correction as more likely than a full-blown bear market. One interesting observation they make is that this year the S&P 500 and the VIX volatility index have been rising together. \"The increase in volatility amid a market rally may, in part, reflect increasing risks, and may also reflect a bullish willingness to spend premium to add to upside exposure.\" GS recommends buying on dips, but would also buy hedges as protection. If you're more of a glass half full kind of person, then you can keep looking at global growth - running at above 5%, the strongest pace since 2010 - and global earnings - where expectations are finally being revised up sharply. (Helen Reid) SAP ANNOUNCES $2.4 BLN ACQUISITION, ALTICE TO FURTHER CUT SHARE CAPITAL (0636 GMT) With tech a notable focus yesterday, and ahead of the U.S. giants reporting later this week, all eyes will be on results from European firms in the sector to see how they stack up. Germany's SAP, Europe's top tech company, just announced a $2.4 billion acquisition of U.S. cloud software company Callidus Software Inc - a sweetener on 2017 results which came in at the lower end of market expectations. The firm's guidance was in line with analysts' expectations - but we'll have to see what they make of this purchase. At the intersection of health and tech, Dutch firm Philips reported Q4 sales growth in line with expectations. Elsewhere in stocks to watch today there's telecoms and cable group Altice which is reducing its share capital to help improve returns while it restructures. And it's a sad day for Volkswagen whose position as world's top-selling carmaker was just nabbed by the Renault-Nissan alliance. (Helen Reid)", "external_links": [], "published": "2018-01-30T17:30:00.000+02:00", "crawled": "2018-01-30T18:05:38.032+02:00", "highlightTitle": ""}