{"organizations": [], "uuid": "8d9ec74a2fe5ec321cddfd203975744cdb892769", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-australia-cannabis/australia-to-permit-medicinal-cannabis-exports-in-bid-to-capture-lucrative-market-idUKKBN1ET0D2", "country": "US", "domain_rank": 408, "title": "Australia to permit medicinal cannabis exports in bid to capture lucrative market", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T07:36:00.000+02:00", "replies_count": 0, "uuid": "8d9ec74a2fe5ec321cddfd203975744cdb892769"}, "author": "", "url": "https://uk.reuters.com/article/us-australia-cannabis/australia-to-permit-medicinal-cannabis-exports-in-bid-to-capture-lucrative-market-idUKKBN1ET0D2", "ord_in_thread": 0, "title": "Australia to permit medicinal cannabis exports in bid to capture lucrative market", "locations": [], "entities": {"persons": [{"name": "colin packham", "sentiment": "none"}, {"name": "greg hunt", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "hydroponics company", "sentiment": "none"}, {"name": "cann group", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "auscann group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 4:06 AM / Updated 7 hours ago Australia to permit medicinal cannabis exports in bid to capture lucrative market Colin Packham 3 Min Read \nSYDNEY (Reuters) - Australia said on Thursday it planned to become the fourth country in the world to legalise medicinal marijuana exports in a bid to score a piece of the estimated $55 billion global market. \nCannabis cultivation in Australia is still relatively small, as recreational use remains illegal. But the government hopes domestic medicinal use, legalised last year, and exports will rapidly boost production. \n“Our goal is very clear: to give farmers and producers the best shot at being the world’s number one exporter of medicinal cannabis,” Health Minister Greg Hunt told reporters in Melbourne. \nShares in the more than a dozen Australian cannabis producers listed on the local exchange soared after the announcement. \nCann Group ended the day up 35 percent; AusCann Group rose nearly 54 percent; and BOD Australia closed up about 39 percent. All were record highs for those companies. Hydroponics Company finished up 30 percent, hitting its highest price in five weeks. \nPeter Crock, chief executive of Cann Group, which cultivates cannabis for medicinal and research purposes, said medicinal marijuana production had been stymied by limited demand from Australian patients. \n“While the Australian patient base is growing, it is very small,” Crock told Reuters. “Being able to export will allow us to have the scale to increase production.” \nHunt said the new legislation would include a requirement that growers first meet demand from local patients before exporting the remainder of their crop. \nDespite growing demand, only Uruguay, Canada and the Netherlands have so far legalised the export of medicinal marijuana. Israel has said it intends to do so within months. \nThe Australian government’s proposal needs to pass federal parliament when it returns to session in February. The country’s main opposition Labor Party has signalled it would support the move. \nExports would then likely begin within months. \nFuelled by a growing acceptance of the benefits of marijuana to manage chronic pain, moderate the impact of multiple sclerosis and to soften the effects of cancer treatment, several countries and 29 states in the United States have legalised cannabis for medicinal use. \nAustralia’s chief commodity forecaster does not publish data on cannabis production, but rough estimates by the University of Sydney estimated the legal industry at A$100 million ($78 million), well below the C$4 billion ($3.19 billion) that Canada estimates its market to be worth. \nU.S. consultancy company Grand View Research last year forecast the global medicinal cannabis market would be worth $55.8 billion by 2025. Reporting by Colin Packham; Editing by Jane Wardell and Gerry Doyle", "external_links": [], "published": "2018-01-04T07:36:00.000+02:00", "crawled": "2018-01-04T08:11:19.000+02:00", "highlightTitle": ""}