{"organizations": [], "uuid": "f7ddcef880f663971f465d1151242e01a3c4822b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-select-medical-holdings-corporation-announces-business-outlook-for-2018.html", "country": "US", "domain_rank": 767, "title": "Select Medical Holdings Corporation Announces Business Outlook for 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "f7ddcef880f663971f465d1151242e01a3c4822b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-select-medical-holdings-corporation-announces-business-outlook-for-2018.html", "ord_in_thread": 0, "title": "Select Medical Holdings Corporation Announces Business Outlook for 2018", "locations": [], "entities": {"persons": [], "locations": [{"name": "mechanicsburg", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}], "organizations": [{"name": "select medical holdings corporation", "sentiment": "negative"}, {"name": "concentra", "sentiment": "none"}, {"name": "u.s. healthworks, inc.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "select medical", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MECHANICSBURG, Pa., Jan. 8, 2018 /PRNewswire/ -- Select Medical Holdings Corporation (\"Select Medical\") (NYSE: SEM), today announced its business outlook for calendar year 2018.\nSelect Medical expects consolidated net operating revenues for the full year 2018 to be in the range of $5.0 billion to $5.2 billion. Select Medical expects net income before interest, income taxes, depreciation and amortization, stock compensation expense, other income/(expense), and equity in earnings/(losses), or Adjusted EBITDA for the full year 2018 to be in the range of $630 million to $660 million. Select Medical expects fully diluted income per common share for the full year 2018 to be in the range of $0.97 to $1.12.\nSelect Medical assumed that the consummation of the acquisition of U.S. HealthWorks, Inc. by its Concentra joint venture subsidiary and the related financing would occur on February 1, 2018 when preparing the above business outlook. Select Medical also included in the expectation for consolidated net operating revenues a reduction in net operating revenues for what historically was reported as bad debt expense. In 2018, bad debt expense will be reported as a component of net operating revenue. Select Medical assumed a 28.0% effective tax rate when preparing the above business outlook, which includes the expected impact of the federal tax reform legislation passed in 2017. Select Medical assumed total shares outstanding of 134.5 million when preparing the above business outlook for 2018. This share count includes unvested restricted shares, which have participation rights and are allocated an equitable portion of earnings under the two-class method for calculating income per common share.\nThe following is a reconciliation of full year 2018 Adjusted EBITDA expectations as computed to the low and high points of the range to the closest comparable GAAP financial measure. Refer to Select Medical's most recent Form 10-Q filing for a discussion of Select Medical's use of Adjusted EBITDA in evaluating financial performance and determining resource allocation. Each item presented in the table below is an estimation of full year 2018 expectations.\nRange\nNon-GAAP Measure Reconciliation\nLow\nHigh\nNet Income attributable to SEM\n$\n131\n$\n150\nNon-controlling Interest\n45\n47\nNet Income\n176\n197\nIncome tax expense\n68\n77\nInterest expense\n206\n206\nEquity in earnings of unconsolidated subsidiaries\n(22)\n(22)\nIncome from Operations\n$\n428\n$\n458\nStock Compensation Expense\n21\n21\nDepreciation and amortization\n181\n181\nAdjudsted EBITDA\n$\n630\n$\n660\nSelect Medical began operations in 1997 and has grown to be one of the largest operators of specialty hospitals, outpatient rehabilitation clinics, and occupational health centers in the United States based on the number of facilities. As of September 30, 2017, Select Medical operated 101 long term acute care hospitals and 22 acute medical rehabilitation hospitals in 28 states and 1,604 outpatient rehabilitation clinics in 37 states and the District of Columbia. Select Medical's joint venture subsidiary Concentra operated 312 centers in 38 states. Concentra also provides contract services at employer worksites and Department of Veterans Affairs community-based outpatient clinics. At September 30, 2017, Select Medical had operations in 46 states and the District of Columbia. Information about Select Medical is available at www.selectmedical.com .\nCertain statements contained herein that are not descriptions of historical facts are \"forward-looking\" statements (as such term is defined in the Private Securities Litigation Reform Act of 1995). Because such statements include risks and uncertainties, actual results may differ materially from those expressed or implied by such forward-looking statements due to factors including the following:\nchanges in government reimbursement for our services due to the implementation of healthcare reform legislation, deficit reduction measures, and/or new payment policies (including, for example, the expiration of the moratorium limiting the full application of the 25 Percent Rule that would reduce our Medicare payments for those patients admitted to a long term acute care hospital from a referring hospital in excess of an applicable percentage admissions threshold) may result in a reduction in net operating revenues, an increase in costs and a reduction in profitability;\nthe impact of the Bipartisan Budget Act of 2013, which established payment limits for Medicare patients who do not meet specified criteria, may result in a reduction in net operating revenues and profitability of our long term acute care hospitals;\nthe failure of our specialty hospitals to maintain their Medicare certifications may cause our net operating revenues and profitability to decline;\nthe failure of our facilities operated as \"hospitals within hospitals\" to qualify as hospitals separate from their host hospitals may cause our net operating revenues and profitability to decline;\na government investigation or assertion that we have violated applicable regulations may result in sanctions or reputational harm and increased costs;\nacquisitions or joint ventures may prove difficult or unsuccessful, use significant resources or expose us to unforeseen liabilities;\nthe timing of the consummation of the proposed acquisition of U.S. HealthWorks, Inc. by Concentra;\nour plans and expectations related to the acquisition of U.S. HealthWorks, Inc. and our ability to realize anticipated synergies;\nprivate third-party payors for our services may adopt payment policies that could limit our future net operating revenues and profitability;\nthe failure to maintain established relationships with the physicians in the areas we serve could reduce our net operating revenues and profitability;\nshortages in qualified nurses, therapists, physicians, or other licensed providers could increase our operating costs significantly or limit our ability to staff our facilities;\ncompetition may limit our ability to grow and result in a decrease in our net operating revenues and profitability;\nthe loss of key members of our management team could significantly disrupt our operations;\nthe effect of claims asserted against us could subject us to substantial uninsured liabilities; and\nother factors discussed from time to time in our filings with the Securities and Exchange Commission (the \"SEC\"), including factors discussed under the heading \"Risk Factors\" of our quarterly reports on Form 10-Q and of the annual report on Form 10-K for the year ended December 31, 2016.\nExcept as required by applicable law, including the securities laws of the United States and the rules and regulations of the SEC, we are under no obligation to publicly update or revise any forward-looking statements, whether as a result of any new information, future events or otherwise. You should not place undue reliance on our forward-looking statements. Although we believe that the expectations reflected in forward-looking statements are reasonable, we cannot guarantee future results or performance.\nInvestor inquiries:\nJoel T. Veit\nSenior Vice President and Treasurer\n717-972-1100\nir@selectmedical.com\nView original content: http://www.prnewswire.com/news-releases/select-medical-holdings-corporation-announces-business-outlook-for-2018-300578635.html\nSOURCE Select Medical Holdings Corporation", "external_links": ["http://www.selectmedical.com/", "http://www.prnewswire.com/news-releases/select-medical-holdings-corporation-announces-business-outlook-for-2018-300578635.html"], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:08:05.000+02:00", "highlightTitle": ""}