{"organizations": [], "uuid": "59670cc8bd349f49b2caef09f963ea9f564c4886", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-global-pim-provider-akeneo-acquires-top-israeli-machine-learning-company.html", "country": "US", "domain_rank": 767, "title": "Global PIM Provider Akeneo Acquires Top Israeli Machine Learning Company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T16:00:00.000+02:00", "replies_count": 0, "uuid": "59670cc8bd349f49b2caef09f963ea9f564c4886"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-global-pim-provider-akeneo-acquires-top-israeli-machine-learning-company.html", "ord_in_thread": 0, "title": "Global PIM Provider Akeneo Acquires Top Israeli Machine Learning Company", "locations": [], "entities": {"persons": [{"name": "yoav maor", "sentiment": "none"}, {"name": "akeneo", "sentiment": "none"}, {"name": "yonatan maor", "sentiment": "none"}, {"name": "izzy cohen", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}], "organizations": [{"name": "akeneo", "sentiment": "negative"}, {"name": "akeneo acquires top israeli machine learning company", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON, January 18, 2018 /PRNewswire/ --\nFrench technology company Akeneo, a leading provider of open source product information management (PIM) solutions, today announced that it has acquired Sigmento, an Israel-based technology company specializing in product data automation.\n(Logo: http://mma.prnewswire.com/media/563966/Akeneo_Logo.jpg )\n(Photo: https://mma.prnewswire.com/media/630482/Akeneo.jpg )\nThe acquisition bolsters Akeneo's market-leading position among PIM providers and reinforces the company's mission to help retailers turn product information into powerful brand assets. The combined entity, now equipped with state-of-the-art machine learning technologies, will allow large enterprise companies to deploy data intelligence and deliver integrated product attribute information across multiple channels far more quickly and at scale.\nSigmento, founded in 2015 by Izzy Cohen, Yoav Maor and Yonatan Maor, has emerged as a prominent provider of automated product listing solutions. The startup's machine learning algorithms allow ecommerce merchants to enrich structured product information with just a few clicks while improving SEO, conversions, and competitive advantages.\n\"The next frontier of innovation in ecommerce technology is happening at the intersection of data intelligence and automation, which is Sigmento's core strength,\" said Fred de Gombert, co-founder and CEO of Akeneo. \"Having Yoav and his talented team join our #PIMforAll movement and offer best-in-class AI driven ecommerce solutions will significantly differentiate Akeneo and allow us to enable customers to further deliver compelling product experiences.\"\n\"Akeneo is an industry-acclaimed PIM leader with hundreds of enterprise clients around the world,\" said Yoav Maor, Sigmento's co-founder and CEO. \"The company's expertise brings tremendous benefits to Sigmento's existing clients, and I'm excited about embarking on this new chapter as part of the Akeneo family.\"\nSigmento's founders will join the Akeneo management team. The combined development team will continue to advance Sigmento's core technology while integrating it into Akeneo's current and future PIM products. Sigmento's Israeli office will become Akeneo's fourth global outpost, joining existing locations in Boston, MA; Nantes, France; and Düsseldorf, Germany.\nAbout Akeneo\nAkeneo created an open source enterprise product information management (PIM) platform that radically improves product data and simplifies product catalog management. Leading global brands such as Samsung, Shop.com , Carrefour, Universal Music Group and John Deere trust Akeneo's PIM solution to scale and customize their ecommerce initiatives in order to gain productivity and offer their customers an amazing user experience. Akeneo is based in France, Germany and the United States. For more information about our solutions: http://www.akeneo.com\nSOURCE Akeneo", "external_links": [], "published": "2018-01-18T16:00:00.000+02:00", "crawled": "2018-01-18T16:33:56.010+02:00", "highlightTitle": ""}