{"organizations": [], "uuid": "83d1012deb004f3ab36088f760f70edd651ac122", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221133974&w=1200&r=LYNXMPEE0A0Z1", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/mideast-crisis-syria/syrian-rebels-declare-counter-attack-in-idlib-province-idINKBN1F01NH", "country": "US", "domain_rank": 408, "title": "Syrian rebels declare counter attack in Idlib province", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T15:15:00.000+02:00", "replies_count": 0, "uuid": "83d1012deb004f3ab36088f760f70edd651ac122"}, "author": "", "url": "https://in.reuters.com/article/mideast-crisis-syria/syrian-rebels-declare-counter-attack-in-idlib-province-idINKBN1F01NH", "ord_in_thread": 0, "title": "Syrian rebels declare counter attack in Idlib province", "locations": [], "entities": {"persons": [{"name": "assad", "sentiment": "none"}, {"name": "bashar al-assad", "sentiment": "none"}], "locations": [{"name": "idlib", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "hamoria", "sentiment": "none"}, {"name": "damascus", "sentiment": "none"}, {"name": "eastern ghouta", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "hezbollah", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "syria civil defence", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIRUT/AMMAN (Reuters) - Rebels launched a counter attack against Syrian government forces and their allies in Idlib province on Thursday, trying to roll back an advance that is fuelling tension with neigbouring Turkey.\nSyria Civil Defence members search for survivors after an airstrike in the besieged town of Hamoria, Eastern Ghouta, in Damascus, Syria Janauary 9, 2018. REUTERS/Bassam Khabieh Fighting raged in Idlib, where a government offensive helped by Iran-backed militia has gathered pace in the last two weeks, according to rebels and a military media unit run by Lebanon’s Hezbollah, which is fighting on the Syrian government side.\nIdlib province is the biggest chunk of Syria still held by rebels fighting President Bashar al-Assad, with a population swollen by Syrians who have fled government advances in other parts of the country. Assad has defeated rebels in many parts of western Syria with critical help from Russia and Iran.\nThe recent military escalation in western Syria has included an unprecedented attack by a squadron of drones on Russian military bases and has cast a shadow over Moscow’s efforts to convene a Syria peace congress later this month.\nThe Hezbollah media unit said the army and its allies were repelling a “fierce assault” by the Nusra Front, formerly al Qaeda’s affiliate in the Syrian war, and factions linked to it.\nSyrian troops and allied forces absorbed the attack and regained control of some positions they had withdrawn from, it said.\nRebels fighting under the banner of the Free Syrian Army (FSA) said in a statement they had set up a joint operations room to repel the offensive and take back areas seized by the government in northeastern Hama and southern Idlib.\n“The operation is to hit the belly of the regime deep into liberated territories and to encircle their advancing forces,” said Abdul Hakim al Rahamon, a senior official in Jaish al Nasr, an FSA faction taking part.\nA man stands on rubble of damaged buildings after an airstrike in the besieged town of Hamoria, Eastern Ghouta, in Damascus, Syria Janauary 9, 2018. REUTERS/Bassam Khabieh Tahrir al-Sham (HTS), an alliance led by the Nusra Front, the dominant force in Idlib, said it had already made gains.\n“With Allah’s blessings we drew plans and prepared ourselves and are encircling them,” said Abu al Naji, a commander from Tahrir al Sham. “We have killed many.”\nA man carries a wounded child, as he walks on debris of damaged buildings, after an airstrike in the Saqba area, in the eastern Damascus suburb of Ghouta, Syria January 9, 2018. REUTERS/Bassam Khabieh Rebels said they had captured some 15 villages and seized 60 government fighters. A Syrian military source denied this and dismissed rebel talk of a counter attack as propaganda. The source said fierce battles were however underway in the area and army advances were continuing.\nRebel sources said warplanes had struck Khan Sheikhoun and Saraqeb, two major population centres in Idlib province that are among several towns that have been targeted in the latest offensive.\nThe latest push by the army and its allies has alarmed Turkey which has been deploying forces inside northern Idlib and setting up bases which it says are part of agreements with Iran and Russia over a descalation zone in Idlib.\nThe Turkish government said the Idlib offensive was endangering the effort to reach a resolution of the conflict and accused the Syrian government of using the pretext of fighting militants to wage a widescale attack.\nAnkara is concerned that wider fighting in the province could bring tens of thousands of Syrians fleeing from the battlefields on its borders far beyond the numbers now fleeing.\nMany Syrians living in rebel-held areas see Turkey’s military intervention as a bulwark against a relentless bombing campaign by Syrian and Russian airforces they blame for killing and injuring hundreds of civilians in urban areas in recent months, away from the frontlines.\nReporting by Tom Perry and Suleiman al-Khalidi, Editing by William Maclean\n ", "external_links": [], "published": "2018-01-11T15:15:00.000+02:00", "crawled": "2018-01-11T15:44:13.003+02:00", "highlightTitle": ""}