{"organizations": [], "uuid": "783a19172e124f0090147f760f582a73a4e89b7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222277396&w=1200&r=LYNXMPEE0F00R", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-global-markets/asian-shares-slip-as-iron-ore-softens-euro-near-three-year-top-idUSKBN1F501C", "country": "US", "domain_rank": 408, "title": "Asian shares slip as iron ore softens, euro near three-year top", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T02:48:00.000+02:00", "replies_count": 0, "uuid": "783a19172e124f0090147f760f582a73a4e89b7b"}, "author": "", "url": "https://www.reuters.com/article/us-global-markets/asian-shares-slip-as-iron-ore-softens-euro-near-three-year-top-idUSKBN1F501C", "ord_in_thread": 0, "title": "Asian shares slip as iron ore softens, euro near three-year top", "locations": [], "entities": {"persons": [{"name": "lisa twaronite", "sentiment": "none"}], "locations": [{"name": "asia-pacific", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - World stock markets slipped on Tuesday, giving back early gains as Wall Street pulled back from initial highs after a decline in oil and metals dragged energy and materials stocks lower.\nWall Street had opened higher, as the Dow breached the 26,000 mark for the first time. The healthcare sector, up 0.46 percent, provided support to the upside, with Merck ( MRK.N ) up 5.8 percent and UnitedHealth ( UNH.N ) up 1.9 percent.\nUnitedHealth posted quarterly results that topped analyst estimates and raised its 2018 outlook, bolstering optimism for another solid quarter for corporate earnings.\nEarnings growth for the quarter is forecast at 11.9 percent, according to Thomson Reuters data through Tuesday morning.\nBut each of the major Wall Street indexes fell into negative territory as materials .SPLRCM, down 1.2 percent and energy .SPNY, off 1.2 percent, slumped.\nMarket participants cited skittishness over a possible U.S. government shutdown at the end of the week as the impetus behind the pullback in areas that have rallied of late.\n“Look at what has happened to commodities, the dollar has collapsed, commodities have exploded, they have done nothing but go straight up,” said Ken Polcari, Director of the NYSE floor division at O’Neil Securities in New York.\n“The minute there is any catalyst that makes anyone a little bit nervous they take some money in the really good performers.”\nA woman walks in strong wind caused by Typhoon Lan, past an electronic board showing the graphs of the recent movements of Japan's Nikkei average outside a brokerage in Tokyo, Japan, October 23, 2017. REUTERS/Issei Kato Oil prices eased from three-year highs as traders booked profits from the rally but healthy demand underpinned prices near $70, a level not seen since 2014’s market slump.\nU.S. crude settled down 0.9 percent at $63.73 per barrel and Brent LCOcv1 was last at $69.15, down 1.6 percent on the day.\nCopper CMCU3 lost 1.37 percent to $7,111.50 a tonne, touching a 3-1/2 week low following strong gains late last year and as worries lingered over fading demand in China.\nThe Dow Jones Industrial Average .DJI fell 10.33 points, or 0.04 percent, to 25,792.86, the S&P 500 .SPX lost 9.8 points, or 0.35 percent, to 2,776.44 and the Nasdaq Composite .IXIC dropped 37.38 points, or 0.51 percent, to 7,223.69.\nCitigroup ( C.N ) shares rose 0.4 percent to $77.11 after earnings topped expectations, the latest major U.S. bank to post results for the fourth quarter. The S&P financial index .SPSY is up nearly 5 percent to start the year.\nShares in Europe closed little changed as commodity stocks also weighed.\nThe pan-European FTSEurofirst 300 index .FTEU3 percent and MSCI's gauge of stocks across the globe .MIWD PUS shed 0.09 percent after hitting a record for a third straight session.\nThe euro held close to a three-year high against the dollar on Tuesday, as the common currency recovered from earlier losses tied to doubts that the European Central Bank would back away from its pledge to keep buying bonds at next week’s meeting, up 0.03 percent to $1.2265 while the dollar remained near three-year lows.\nU.S. long-dated Treasury yields edged up as equities retreated. Benchmark 10-year notes US10YT=RR last rose 3/32 in price to yield 2.5426 percent, from 2.552 percent late on Friday.\nEditing by Chizu Nomiyama and Nick Zieminski\n ", "external_links": [], "published": "2018-01-16T02:48:00.000+02:00", "crawled": "2018-01-16T03:04:28.005+02:00", "highlightTitle": ""}