{"organizations": [], "uuid": "e56833d980ad39615b92a60dfea16555ec4fe493", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/06/07/100799632-159249342r.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/scientists-are-now-rushing-to-develop-a-universal-flu-vaccine.html", "country": "US", "domain_rank": 767, "title": "Scientists are now rushing to develop a universal flu vaccine", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.014, "site_type": "news", "published": "2018-01-26T18:33:00.000+02:00", "replies_count": 0, "uuid": "e56833d980ad39615b92a60dfea16555ec4fe493"}, "author": "Bob Woods", "url": "https://www.cnbc.com/2018/01/26/scientists-are-now-rushing-to-develop-a-universal-flu-vaccine.html", "ord_in_thread": 0, "title": "Scientists are now rushing to develop a universal flu vaccine", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "cdc", "sentiment": "none"}, {"name": "national institute of allergy and infections diseases", "sentiment": "none"}, {"name": "nih", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Getty Images The nation's battle against this year's nasty influenza epidemic rages on as government health agencies and drug companies rush to develop a universal flu vaccine that can protect against multiple stains of the flu. \nThe flu season in the United States is now in full swing. The CDC's latest weekly FluView Report , for the week ending Jan. 20, revealed that all U.S. states continue to report widespread flu activity, and the number of states experiencing high influenza activity increased from 32 to 39 states. The CDC likened this current flu activity, centered mostly around the H3N2 virus, to that experienced in the 2014–15 season, considered to be of high severity, although the rate of hospitalization now remains lower than three years ago.\nSo far, 39 children have died from the flu. Every year, 3,000 to 49,000 Americans die annually from flu-related illness, according to the CDC. Nonetheless, flu activity is likely to continue for several more weeks, the agency stated. And although the current flu vaccine is only about 10 percent to 30 percent effective, the CDC continues to recommend influenza vaccination for all persons six months of age and the elderly, the most vulnerable groups. Indeed, the flu vaccinations averted 40,000 deaths in the United States between the 2005–2006 and 2013–2014 flu seasons, the CDC estimates.\nMeanwhile, research on a so-called universal flu vaccine remains urgent. \"I've made the development of a universal influenza vaccine literally the top priority of our institute over the next couple of years,\" said Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases (NIAID), part of the National Institutes of Health (NIH). \nDeveloping a universal solution The definition of a universal flu vaccine is somewhat flexible. Ideally, a single injection would protect against all known and emerging influenza A strains and last a lifetime, said Peter Palese, a microbiologist at the Icahn School of Medicine at Mount Sinai in New York. More modest proposals envision a one-shot vaccine that would protect against getting the flu for anywhere from three to 20 years.\nshow chapters Widespread flu outbreak causing serious complications this year      7:58 AM ET Thu, 11 Jan 2018 | 01:51 Palese's laboratory is one of three different research groups at Mount Sinai exploring a universal flu vaccine and one of numerous efforts underway mostly in academia, biotech firms and NIH. A handful of major pharmaceutical companies are supporting universal flu vaccine research, including GlaxoSmithKline , Janssen Vaccines, a division of Johnson & Johnson , and Sanofi .\nPalese's team has developed a universal flu vaccine that is now in the first phase of testing in humans, with support from GSK and the Gates Foundation. \"What changes in the influenza virus from year to year is the hemagglutinin (HA),\" Palese explained, \"which is the major protein against which we make an immune response.\"\nThe HA comprises a head and a stalk. \"When our immune system sees a flu virus, it makes antibodies against the head,\" he said. Palese's vaccine aims to stimulate antibodies that bind to the more \"conserved\" areas on the stalk and which remain the same every year and are common to most seasonal flu viruses. \"We want to redirect the body's immune response to the stalk.\"\n\nMore from Modern Medicine:\nFlu shots aren't perfect, but scientists are trying to make them better \nHow robot math and smartphones led researchers to a drug breakthrough \nThe most popular free apps to keep you healthy in 2018 \nA different approach to the universal vaccine is underway at FluGen , a biotech firm in Madison, Wis. Backed by both government and VC funding, the company is working with technology first discovered at the University of Wisconsin-Madison by Dr. Yoshihiro Kawaoka and Dr. Gabriele Neumann and exclusively licensed to FluGen. \"Our vaccine, called RedeeFlu, is based on a premise that says, what happens if you take a [naturally occurring] 'wild-type' of flu virus and modify it to infect the human body but don't allow it to replicate and cause illness?\" said Boyd Clarke, executive chairman of FluGen. (Coincidentally, his maternal grandfather died in the 1918 flu pandemic.)\nLast October, FluGen announced that it was awarded $14.4 million by the Department of Defense to conduct human clinical challenge trials with RedeeFlu. In those studies, half of the participants will be vaccinated and half will receive a placebo, but all will subsequently be infected with an influenza virus. \"We want to see if the vaccine prevents illness and replication of the virus,\" Clarke said. \"Based on pre-clinical trials, we have reason to be optimistic.\"\nOn another front, this year the Human Vaccines Projec t, a New York-based non-profit consortium of academic, government and industry medical researchers, is launching the Universal Influenza Vaccine Initiative (UIVI). \"The goal is to understand immunity to the flu and then convert that into a universal flu vaccine,\" said Dr. James Crowe, a pediatric infectious diseases physician at Vanderbilt University Medical Center in Nashville, Ten., and the director of UIVI. Similar to Palese's approach, UIVI is targeting the more stable stalk region of the HA protein.\nAlthough Crowe is dedicated to the eventual discovery of a universal vaccine, he also wants to focus on improving current vaccines. \"The excitement in the field is making better vaccines for strains that are killing people right now,\" he said. \"Even modest improvements would save thousands of lives.\"\nThe funding challenge A vexing challenge in developing any type of universal flu vaccine is a woeful lack of federal funding for NIH studies and grants. Fauci said that his agency spent about $230 million on influenza in general in 2017, about $85 million on vaccines and of that around $30 million on a universal vaccine.\n\"Our budget has been relatively flat,\" he said, \"and when we've gotten new money, it's been earmarked for popular things like the Cancer Moonshot, the BRAIN Initiative and Alzheimer's disease. So to get new money for universal flu vaccine, I'm probably going to have to shift priorities and take money away from other things.\"\nIt is impossible to estimate what it will ultimately cost to bring a fully tested and FDA-approved product to market, Fauci added, because we're \"still at the level of scientific discovery. A good guess is several hundreds of millions [of dollars].\"\nProducing and distributing current flu vaccines is a relatively small market for a only a few major pharmaceutical companies, and the industry as a whole is not yet willing to invest heavily in universal vaccine R&D. \"When we look at the vaccine area, this is not an area of high profits,\" Michael Osterholm, an epidemiologist and head of the Center for Infectious Disease Research and Policy at the University of Minnesota, told the PBS Newshour last fall. \"The industry has no appetite for that right now, unless there's assurances of support throughout the process and that there's a market at the end of it.\"\nWhile optimistic that a universal vaccine can be developed, Osterholm has warned against the strong probability of a flu pandemic on the horizon if private and public entities don't dedicate energy and resources toward ongoing efforts.\nBut even as researchers get closer to developing better vaccines, Crowe admitted that we'll never completely eradicate influenza as we did smallpox, once the world's deadliest plague. \"We're going to be battling flu forever,\" he said. \"We're managing the risk. The goal is to prevent disease and death, not to get rid of it, because it's not going to happen.\"", "external_links": [], "published": "2018-01-26T18:33:00.000+02:00", "crawled": "2018-01-26T18:40:05.007+02:00", "highlightTitle": ""}