{"organizations": [], "uuid": "ce0cc9a549235de43d67ef508414d728b1eb5078", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104940957-RTX476WY.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/california-rescuers-use-dogs-scanners-to-search-deadly-mudslide-debris.html", "country": "US", "domain_rank": 767, "title": "California rescuers use dogs, scanners to search deadly mudslide debris", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.225, "site_type": "news", "published": "2018-01-11T17:51:00.000+02:00", "replies_count": 0, "uuid": "ce0cc9a549235de43d67ef508414d728b1eb5078"}, "author": "Mike Eliason", "url": "https://www.cnbc.com/2018/01/11/california-rescuers-use-dogs-scanners-to-search-deadly-mudslide-debris.html", "ord_in_thread": 0, "title": "California rescuers use dogs, scanners to search deadly mudslide debris", "locations": [], "entities": {"persons": [{"name": "mike eliason", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "southern california", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "santa barbara county", "sentiment": "none"}, {"name": "pacific ocean", "sentiment": "none"}, {"name": "montecito", "sentiment": "none"}], "organizations": [{"name": "los padres national forest", "sentiment": "none"}, {"name": "santa barbara county fire department", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "California rescuers use dogs, scanners to search deadly mudslide debris Seventeen people were confirmed dead and another 17 people were missing on Thursday. The mudslides destroyed about 100 homes and injured 28 people. Last month's spate of wildfires included the largest in California history. Published 2 Hours Ago SHARES Al Seib | Los Angeles Times | Getty Images Davis Doty with 'Jester' from Orange County Search and Rescue work to locate bodies along Olive Mill Road at Hot Springs Road in Montecito Wednesday January 10, 2018 after a rainstorm sent mud and debris through Montecito neighborhoods. \nRescue crews in Southern California worked overnight into Thursday morning, using dogs and scanners to comb through tons of debris for survivors from deadly mudslides that struck along the state's picturesque coastal communities. \nSeventeen people were confirmed dead and at least another eight people were missing on Thursday after a wall of mud roared down hillsides two days earlier in the scenic area between the Pacific Ocean and the Los Padres National Forest, according to Santa Barbara County authorities. The mudslides destroyed about 100 homes and injured 28 people. \n\"We have crews out there,\" said Amber Anderson, a spokeswoman for the Santa Barbara County Fire Department. \"They've been working 24 hours a day.\" \nAbout 500 rescuers using search dogs, military helicopters, and thermal imaging equipment were on the scene. On Wednesday, dogs helped crews rescue 10 stranded residents, Anderson said. Mike Eliason | Santa Barbara County Fire Department | Reuters A search dog looks for victims in damaged homes after a mudslide in Montecito, California, U.S. in this photo provided by the Santa Barbara County Fire Department, January 9, 2018. \nSearch and rescue efforts have been slow as crews have to navigate through waist-deep mud, fallen trees, boulders and other debris. Teams have completed initial searches of the entire debris field and are about a quarter of the way through a more intensive secondary search of the zone, Anderson said. \n\"Another tough day in Santa Barbara County as Search and Rescue, Fire and Law Enforcement personnel from across our county and our neighboring counties searched for survivors and evacuated people,\" the sheriff's office said on its Twitter feed late Wednesday night. \nThe mudslides, triggered by heavy rains early on Tuesday, roared into valleys denuded by historic wildfires that struck the area last month. \nIn addition to destroying 100 homes, the debris flow from the mudslides has damaged hundreds of other structures, officials said. Getty Images Firefighters search for people trapped in mudslide debris on January 10, 2018 in Montecito, California. \nAmong the damaged properties were historic hotels and the homes of celebrities, including media mogul and actress Oprah Winfrey and talk-show host Ellen DeGeneres, who both live in the upscale hillside community of Montecito. \nDeGeneres said on her talk show on Thursday that the picturesque town of 9,000 is a \"tight-knit\" community. \n\"It's not just a wealthy community, it's filled with a lot of different types of people from all backgrounds,\" she said. \"And there are families missing, there are people who are missing family members ... it's catastrophic.\" \nLast month's spate of wildfires, including the largest in California history, not only burned away grass and shrubs that held soil in place, but also baked a waxy layer into the earth that prevents water from sinking deeply into the ground. \n\"First we got burned out at our ranch that caught on fire and now we're flooding, so the last month has been pretty bad, Charles Stoops said as he stood in front of his house, which was surrounded in mud 3 feet (nearly a meter) deep.", "external_links": [], "published": "2018-01-11T17:51:00.000+02:00", "crawled": "2018-01-11T17:52:13.004+02:00", "highlightTitle": ""}