{"organizations": [], "uuid": "0bce1eb2bcfbe0c2e629e807deac6d631d1ba073", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-bentall-kennedyas-vp-of-sustainability-appointed-to-co-chair-united-nations-environment-programme-working-group-to-drive.html", "country": "US", "domain_rank": 767, "title": "Bentall Kennedy’s VP of Sustainability Appointed to Co-Chair United Nations Environment Programme Working Group to Drive Global Sustainability in Commercial Real Estate", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.019, "site_type": "news", "published": "2018-01-29T16:00:00.000+02:00", "replies_count": 0, "uuid": "0bce1eb2bcfbe0c2e629e807deac6d631d1ba073"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-bentall-kennedyas-vp-of-sustainability-appointed-to-co-chair-united-nations-environment-programme-working-group-to-drive.html", "ord_in_thread": 0, "title": "Bentall Kennedy’s VP of Sustainability Appointed to Co-Chair United Nations Environment Programme Working Group to Drive Global Sustainability in Commercial Real Estate", "locations": [], "entities": {"persons": [{"name": "bentall kennedy", "sentiment": "neutral"}, {"name": "vi", "sentiment": "neutral"}, {"name": "anna murray", "sentiment": "neutral"}, {"name": "murray", "sentiment": "none"}], "locations": [{"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "co-chair united nations environment programme working group to drive global sustainability", "sentiment": "neutral"}, {"name": "united nations environment programme finance initiative", "sentiment": "none"}, {"name": "unep", "sentiment": "none"}, {"name": "unep fi", "sentiment": "none"}, {"name": "investment committee", "sentiment": "none"}, {"name": "property working group", "sentiment": "none"}, {"name": "business wire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO--(BUSINESS WIRE)-- Bentall Kennedy is pleased to announce the appointment of Anna Murray, Vice President of Sustainability, to the Investment Committee of the United Nations Environment Programme Finance Initiative (UNEP FI). As Bentall Kennedy’s representative, Anna Murray will Co-Chair the Property Working Group of the UNEP FI, with a global mandate to drive adoption of sustainability in real estate investment and property management. The UNEP FI was created at the conclusion of the 1992 Earth Summit and now includes membership from more than 200 global financial institutions, including banks, insurers and investors.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180129005122/en/\nAnna Murray, VP of Sustainability, Bentall Kennedy. (Photo: Business Wire)\nAs a member of the Investment Committee, Murray will share responsibility for developing and monitoring the UNEP FI sustainability strategy for the investment industry and engaging with leading global investors to address pressing sustainability issues.\n“With buildings accounting for approximately one-third of global greenhouse gas emissions and consuming 40 per cent of global energy, there is an incredible opportunity to reduce the real estate industry’s overall environmental footprint,” said Murray. “I am honored to represent Bentall Kennedy to help lead a global movement for sustainability, climate change action, and environmental progress that strengthens the long-term value generation and competitiveness of commercial real estate.”\nUNEP FI’s work also includes a strong focus on policy – by stimulating country-level dialogues between finance practitioners, supervisors, regulators and policy-makers, and, at the international level, by promoting financial sector involvement in processes such as the global climate negotiations.\n“In the buildings sector alone, meeting the Paris commitments will require in the region of USD 300 billion annually by 2020 just for financing energy efficiency retrofits,” said Eric Usher, Head of the UNEP FI. “The UNEP FI Property Working Group works to address and contribute to the most imminent challenges in the field of sustainable real estate investment, and for many years Bentall Kennedy has helped steer that course of innovation within our initiative. We welcome Anna Murray on the UNEP FI Investment Committee and look forward to growing and strengthening sustainable real estate investment in North America.”\nAbout Bentall Kennedy\nBentall Kennedy, a Sun Life Investment Management company, is one of the largest global real estate investment advisors and one of North America's foremost providers of real estate services. Bentall Kennedy serves the interests of more than 550 institutional clients with expertise in office, retail, industrial and multi-residential assets throughout Canada and the U.S. Bentall Kennedy's Investment Management group has approximately $46 billion (CAD)/$37 billion (USD) of assets under management (as of September 30, 2017). Bentall Kennedy is one of the largest real estate services providers in Canada, managing 60 million square feet on behalf of third-party and investment management clients (as of September 30, 2017). Bentall Kennedy is a member of UN PRI and a recognized Responsible Property Investing leader ranked among the top firms around the globe in the Global Real Estate Sustainability Benchmark (GRESB) for the seventh consecutive year since GRESB was launched. Bentall Kennedy includes Bentall Kennedy (Canada) Limited Partnership, Bentall Kennedy (U.S.) Limited Partnership and the real estate and commercial mortgage investment groups of certain of their affiliates, all of which comprise a team of real estate professionals spanning multiple legal entities. The assets under management shown above include real estate equity and mortgage investments of the companies within Bentall Kennedy.\nFor more information, visit www.bentallkennedy.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129005122/en/\nMedia Contact:\nBentall Kennedy Group\nRahim Ladha, 416-986-9027\nVice President, Corporate Communications\nrladha@bentallkennedy.com\nSource: Bentall Kennedy", "external_links": ["http://www.businesswire.com/news/home/20180129005122/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.bentallkennedy.com&esheet=51749757&newsitemid=20180129005122&lan=en-US&anchor=www.bentallkennedy.com&index=1&md5=2bfc2ffee5fef08f371c65b2ae64a804"], "published": "2018-01-29T16:00:00.000+02:00", "crawled": "2018-01-29T17:36:36.011+02:00", "highlightTitle": ""}