{"organizations": [], "uuid": "92aa4ae2127d1ffae9cffd384b1c7dc76d0b08b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/31/reuters-america-update-2-oil-prices-fall-for-3rd-day-as-us-inventory-build-up-weighs.html", "country": "US", "domain_rank": 767, "title": "UPDATE 2-Oil prices fall for 3rd day as US inventory build-up weighs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T09:44:00.000+02:00", "replies_count": 0, "uuid": "92aa4ae2127d1ffae9cffd384b1c7dc76d0b08b2"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/31/reuters-america-update-2-oil-prices-fall-for-3rd-day-as-us-inventory-build-up-weighs.html", "ord_in_thread": 0, "title": "UPDATE 2-Oil prices fall for 3rd day as US inventory build-up weighs", "locations": [], "entities": {"persons": [{"name": "matt stanley", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Brent, WTI prices down as much as 1 percent\n* Industry report shows 3.2 mln barrel rise in U.S. stocks\n* Government inventory figures due on Wednesday (Adds comment, updates prices)\nTOKYO, Jan 31 (Reuters) - Oil prices fell for a third day on Wednesday after data from an industry body showed U.S. crude stocks rose more than expected last week, while a selloff in other commodities, stocks and bonds added to investors' bearish mood.\nBrent crude, the global benchmark, was down 22 cents, or about 0.3 percent, at $68.80 a barrel by 0735 GMT, after falling earlier to a nearly two-week low.\nU.S. West Texas Intermediate (WTI) futures were down 31 cents, or 0.5 percent, at $64.19, after falling to their weakest level in more than a week.\nOn Tuesday, U.S. crude fell 1.6 percent to close at $64.50 a barrel, the contract's decline far outpacing a 0.6-percent drop in the price of Brent.\nPrices of both WTI and Brent are still on track for a fifth month of gains.\n\"The rig count will only continue to rise and the U.S. system will only become more efficient,\" said Matt Stanley, a fuel broker at Freight Services International in Dubai.\n\"I see a correction on the horizon down towards $60 before the inevitable OPEC minister comes out and talks about new cuts,\" he added.\nThe Organization of the Petroleum Exporting Countries (OPEC), along with other producers including Russia, have been waging a battle against U.S. shale producers, agreeing to take 1.8 million barrels a day off the market through the end of 2018.\nBut as prices have risen, U.S. producers have only added rigs after cutting costs, with energy companies adding 12 oil rigs last week, the biggest weekly increase since March.\nA report from the American Petroleum Institute late on Tuesday showing crude stocks rose by 3.2 million barrels last week cast a further bearish pall over the market.\nU.S. Energy Department data on Wednesday is likely to show an increase in increase in inventories for the first time 11 weeks. Analysts polled by Reuters forecast an average 100,000-barrel build in crude stocks.\nThe date is due at 10:30 a.m. EST (1530 GMT) on Wednesday.\n\"Increasing concerns over the rising U.S. production continue to mount pressure on the commodity,\" said Mihir Kapadia, chief executive of Sun Global Investments. \"Over the past couple of years, U.S. producers have gained significant inroads in the global oil market industry.\"\n(With additional reporting by Henning Gloystein; Editing by Kenneth Maxwell and Joseph Radford)", "external_links": [], "published": "2018-01-31T09:44:00.000+02:00", "crawled": "2018-01-31T13:10:10.004+02:00", "highlightTitle": ""}