{"organizations": [], "uuid": "e485aeb5bf0418d0a1ed3f3d8897eb3f9f47d041", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-cerus-reports-positive-top-line-results-from-chronic-anemia-phase-3-study-evaluating-intercept-red-blood-cells-in.html", "country": "US", "domain_rank": 767, "title": "Cerus Reports Positive Top-Line Results from Chronic Anemia Phase 3 Study Evaluating INTERCEPT Red Blood Cells in Thalassemia Patients", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-24T00:15:00.000+02:00", "replies_count": 0, "uuid": "e485aeb5bf0418d0a1ed3f3d8897eb3f9f47d041"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-cerus-reports-positive-top-line-results-from-chronic-anemia-phase-3-study-evaluating-intercept-red-blood-cells-in.html", "ord_in_thread": 0, "title": "Cerus Reports Positive Top-Line Results from Chronic Anemia Phase 3 Study Evaluating INTERCEPT Red Blood Cells in Thalassemia Patients", "locations": [], "entities": {"persons": [], "locations": [{"name": "concord", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "cerus reports positive top-line results", "sentiment": "negative"}, {"name": "rbc", "sentiment": "none"}, {"name": "rbc transfusion", "sentiment": "none"}, {"name": "cerus corporation", "sentiment": "none"}, {"name": "safety of s-303 treated red blood cells", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Study successfully met primary efficacy and safety endpoints No antibodies detected specific to INTERCEPT treated red blood cells No treatment-emergent antibodies to red blood cell alloantigens Conference call scheduled tomorrow at 8:30 am ET, Wednesday January 24\nCONCORD, Calif.--(BUSINESS WIRE)-- Cerus Corporation (NASDAQ: CERS) today reported that the primary efficacy and safety endpoints were successfully achieved in the company’s Phase 3 transfusion study of chronic anemia evaluating INTERCEPT-treated red blood cells (RBCs) in thalassemia patients, SPARC (A Randomized Controlled Study to Evaluate Efficacy and Safety of S-303 Treated Red Blood Cells in Subjects with Thalassemia Major Requiring Chronic RBC Transfusion). The results from the SPARC study provide important clinical data regarding the safety profile of INTERCEPT-treated RBCs in a chronically transfused patient population and support Cerus’ INTERCEPT RBC CE mark submission, which is planned for the second half of 2018.\nThe study’s primary efficacy endpoint used a non-inferiority design to assess up to a 15% relative difference in the mean consumption of hemoglobin between INTERCEPT-treated RBC and conventional RBC. The safety endpoints included the incidence of treatment-emergent antibody with confirmed specificity to INTERCEPT-treated RBCs, the incidence of antibodies to red blood cell alloantigens, the incidence of adverse events, and the incidence of transfusion reactions.\nA total of 86 patients were enrolled at three participating international sites in the double blinded, cross-over study. Subjects were randomly assigned to a sequential treatment period of either INTERCEPT-treated RBCs or conventional RBCs with cross over to the other treatment upon completion of the first treatment period. Each treatment period consisted of 6 transfusion episodes. A total of 2006 units were transfused during the course of the study, with 999 in the Control arm and 1007 in the Test arm. Full results of the study are planned for submission and presentation at upcoming scientific conferences and for publication.\n“These study results mark a major milestone in our mission to make INTERCEPT the standard of care in transfusion medicine. Thalassemia major patients require a lifetime of red cell transfusion, putting these individuals at elevated risk of transfusion transmitted infections (TTI) from existing and emerging pathogens. We believe that the INTERCEPT Blood System has the potential to markedly reduce the risk of TTI for patients needing red cell transfusions,” said Richard Benjamin, Cerus’ chief medical officer.\nIn addition to the SPARC study in thalassemia patients, the company’s planned 2018 CE mark submission also will include previously reported clinical results from the company’s successful European Phase 3 study in patients with acute anemia. In the U.S., the company is conducting a Phase 3 study of INTERCEPT-treated RBCs (RedeS) in Puerto Rico and the mainland to ameliorate the risk of Zika virus, and is preparing to initiate a separate Phase 3 study of INTERCEPT-treated RBCs with 600 patients undergoing complex cardiovascular surgery (ReCePI) to support a potential Premarket Approval application (PMA) submission to the FDA for the INTERCEPT Blood System for RBCs.\nCONFERENCE CALL INFORMATION\nCerus will host a conference call and webcast tomorrow, January 24 at 8:30 AM ET to discuss the top-line results from SPARC, a Phase 3 study evaluating the safety and efficacy of INTERCEPT treated red blood cells in thalassemia patients.\nTo access the live webcast, please visit the Investor Relations page of the company’s website at http://www.cerus.com/ir . Alternatively, you may access the live conference call by dialing (866) 235-9006 (U.S.) or (631) 291-4549 (international).\nA replay will be available on the company’s website, or by dialing (855) 859-2056 (U.S.) or (404) 537-3406 (international) and entering conference ID number 4961559. The replay will be available approximately three hours after the call through February 7, 2018.\nABOUT THALASSEMIA\nThalassemia is a genetic blood disorder caused by a defect in synthesis of hemoglobin, the oxygen-carrying component of the red blood cell. Insufficient production of hemoglobin results in severe chronic anemia leading to multiple organ dysfunction unless treated with transfusion support. Thalassemia major is the most severe form of the disease and symptoms may present in patients as early as 6-months old. Patients with thalassemia major may require a lifetime of transfusions. Thalassemia is more common in individuals from Mediterranean countries, Asia, Africa, and the Middle East.\nABOUT CERUS\nCerus Corporation is a biomedical products company focused in the field of blood transfusion safety. The INTERCEPT Blood System is designed to reduce the risk of transfusion-transmitted infections by inactivating a broad range of pathogens such as viruses, bacteria and parasites that may be present in donated blood. The nucleic acid targeting mechanism of action of the INTERCEPT treatment is designed to inactivate established transfusion threats, such as hepatitis B and C, HIV, West Nile virus and bacteria, as well as emerging pathogens such as chikungunya, malaria and dengue. Cerus currently markets and sells the INTERCEPT Blood System for both platelets and plasma in the United States, Europe, the Commonwealth of Independent States, the Middle East and selected countries in other regions around the world. The INTERCEPT Red Blood Cell system is in clinical development. See http://www.cerus.com for information about Cerus.\nINTERCEPT and the INTERCEPT Blood System are trademarks of Cerus Corporation.\nForward-Looking Statements\nThis press release contains forward-looking statements. Any statements contained in this press release that are not statements of historical fact may be deemed to be forward-looking statements, including, without limitation, statements concerning Cerus‘ planned INTERCEPT red blood cell CE Mark submission and the timing thereof; Cerus’ mission to make INTERCEPT the standard of care in transfusion medicine; Cerus’ belief that the INTERCEPT Blood System has the potential to markedly reduce the risk of TTI; Cerus’ planned Phase 3 ReCePI study; the potential submission of a PMA to the FDA by Cerus for the INTERCEPT Blood System for RBCs; and other statements that are not historical facts. Actual results could differ materially from these forward-looking statements as a result of certain factors, including, without limitation: risks related to Cerus’ ability to demonstrate to the transfusion medicine community and other health care constituencies that pathogen reduction and the INTERCEPT Blood System is safe, effective and economical; the uncertain and time-consuming development and regulatory process, including the risks (a) that Cerus may be unable to file for CE Mark approval of the red blood cell system in Europe on the anticipated timeframe or at all, and even if filed, Cerus may be unable to obtain CE Mark approval, or any other regulatory approvals, of the red blood cell system in a timely manner or at all, (b) that applicable regulatory authorities may disagree with Cerus‘ interpretations of the data from its clinical studies and/or may otherwise determine not to approve Cerus‘ regualtory submissions in a timely manner or at all; (c) that anticipated clinical trials of the INTERCEPT Blood System may not be initiated on the ancticipated timing or at all, or if initiated, may be extended, delayed, suspended or terminated, including as result of safety concerns, and (d) that negative or inconclusive results in Cerus‘ Phase 3 studies of INTERCEPT RBCs, including in the RedeS or the ReCePI studies would negatively impact, substantially delay or preclude altogether, Cerus‘ ability to submit a PMA to the FDA for INTERCEPT Blood System for RBCs and Cerus‘ ability to obtain regulatory approval of the INTERCEPT Blood System for RBCs in the United States, and that Cerus may otherwise be unable to submit a PMA to the FDA for the INTERCEPT Blood System for RBCs in a timely manner or at all; risks related to Cerus‘ need for additional funding; risks future opportunities and plans, as well as other risks detailed in Cerus’ filings with the Securities and Exchange Commission, including Cerus’ Quarterly Report on Form 10-Q for the quarter ended September 30, 2017, filed with the SEC on November 3, 2017. Cerus disclaims any obligation or undertaking to update or revise any forward-looking statements contained in this press release.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006368/en/\nCerus Corporation\nTim Lee, 925-288-6137\nInvestor Relations Director\nor\nMedia Contact:\nW20 Communications\nDan Boyle\ndan@boylepr.com\nSource: Cerus Corporation", "external_links": ["http://www.cerus.com/ir", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cerus.com&esheet=51747719&newsitemid=20180123006368&lan=en-US&anchor=http%3A%2F%2Fwww.cerus.com&index=2&md5=1d6028adf57fca237000d67c0dc3692d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cerus.com%2Fir&esheet=51747719&newsitemid=20180123006368&lan=en-US&anchor=http%3A%2F%2Fwww.cerus.com%2Fir&index=1&md5=05077dbfcae66dd4609f2e9f21194fc4", "http://www.businesswire.com/news/home/20180123006368/en/"], "published": "2018-01-24T00:15:00.000+02:00", "crawled": "2018-01-24T00:39:03.000+02:00", "highlightTitle": ""}