{"organizations": [], "uuid": "35d4ad230ab01a64b600daffc91fff642f597ec2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 44, "shares": 44, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226186912&w=1200&r=LYNXMPEE0S09R", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-afghanistan-military-blast/blasts-heard-near-military-academy-in-afghan-capital-witness-idUKKBN1FI07P", "country": "US", "domain_rank": 408, "title": "Militants attack Afghan army post near military academy in capital", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T06:18:00.000+02:00", "replies_count": 0, "uuid": "35d4ad230ab01a64b600daffc91fff642f597ec2"}, "author": "", "url": "https://uk.reuters.com/article/uk-afghanistan-military-blast/blasts-heard-near-military-academy-in-afghan-capital-witness-idUKKBN1FI07P", "ord_in_thread": 0, "title": "Militants attack Afghan army post near military academy in capital", "locations": [], "entities": {"persons": [{"name": "dawlat waziri", "sentiment": "none"}, {"name": "mirwais harooni", "sentiment": "none"}, {"name": "hamid shalizi", "sentiment": "none"}, {"name": "fahim", "sentiment": "none"}], "locations": [{"name": "afghanistan", "sentiment": "none"}, {"name": "kabul", "sentiment": "none"}], "organizations": [{"name": "taliban", "sentiment": "none"}, {"name": "ministry", "sentiment": "none"}, {"name": "ministry of defence", "sentiment": "none"}, {"name": "min read  kabul", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 2:52 AM / Updated an hour ago Eleven Afghan soldiers killed in latest attack in Kabul Mirwais Harooni , Hamid Shalizi 5 Min Read \nKABUL (Reuters) - Militants on Monday raided a military academy in Kabul, the Afghan capital, killing 11 soldiers, the fourth major attack in a spate of violence over the past nine days that is putting a new, more aggressive U.S. strategy under the spotlight. \nFive gunmen attacked an army outpost near one of Afghanistan’s main military academies on Monday and 11 soldiers were killed and 15 wounded before the attackers were subdued, the defence ministry said. \nIslamic State claimed responsibility for the attack near the Marshal Fahim military academy on the city’s western outskirts, in which four of the gunmen were killed and one captured. \nIt came two days after an ambulance bomb in the city centre killed more than 100 people and just over a week after another attack on the Hotel Intercontinental, also in Kabul, killed more than 20. \nBoth of those attacks were claimed by the Taliban. \nMinistry of Defence officials said the five militants, armed with rocket-propelled grenades and automatic rifles, attacked the outpost near the well-defended academy just before dawn. \n“The Afghan National Army is the country’s defence force and makes sacrifices for the security and well-being of the people,” the ministry said. \nSecurity officials at the scene said the gunmen had used a ladder to get over a wall into the post. \nIn October, a suicide attacker rammed a car full of explosives into a bus carrying cadets from the academy, known as the Defence University, killing 15 of them. \nWhile militants claiming allegiance to Islamic State operate in mountains in the eastern province of Nangarhar, little is known about the group and many analysts question whether they are solely responsible for the attacks they have claimed in Kabul and elsewhere. \nIslamic State claimed an assault on the office of aid group Save the Children in the eastern city of Jalalabad on Wednesday in which six people were killed. \nThe attacks have put pressure on President Ashraf Ghani and his U.S. allies, who have expressed growing confidence that a new, more aggressive military strategy has succeeded in driving Taliban insurgents back from major provincial centres. \nThe United States has stepped up its assistance to Afghan security forces and its air strikes against the Taliban and other militant groups, aiming to break a stalemate and force the insurgents to the negotiating table. Afghan policemen inspect the site of a bomb attack in Kabul, Afghanistan, January 28, 2018. REUTERS/Omar Sobhani MESSAGE TO TRUMP \nHowever, the Taliban have dismissed suggestions they have been weakened and said Saturday’s bombing was a message to President Donald Trump. \n“The Islamic Emirate has a clear message for Trump and his hand kissers, that if you go ahead with a policy of aggression and speak from the barrel of a gun, don’t expect Afghans to grow flowers in response,” Taliban spokesman Zabihullah Mujahid said in a statement, using the term the Islamist militants use to describe themselves. \nThe United States and Afghanistan have accused neighbouring Pakistan of helping the Taliban in a bid to undermine old rival India’s growing influence in Afghanistan. \nGhani, speaking alongside visiting Indonesian President Joko Widodo, said the Taliban claim of responsibility for the Saturday blast, even though it inflicted so many civilian casualties, showed that their “overlord” wanted to make a statement of defiance. Slideshow (11 Images) \nBut Pakistan, which denies accusations it fosters the Afghan war, condemned the attack on Monday as it did the Saturday blast, saying it reiterated its “strong condemnation of terrorism”. \nThe surge of violence is unlikely to sway the U.S. strategy, or breathe life into stalled efforts to get peace talks going. \nThe U.S. military and the Afghan government say big attacks on civilians are evidence that the militants are being squeezed in the countryside. \nTrump condemned the Saturday attack, saying it “renews our resolve and that of our Afghan partners”. \n“We will not allow the Taliban to win!” he said on Twitter on Sunday. \nGhani, embroiled in confrontation with provincial powerbrokers defying central rule, faces anger from an increasingly frustrated population, who want him to set aside political divisions and focus on security. \n“People think the government is working very badly, that the security agencies think about themselves and don’t care, and the international coalition just wants to fight with air strikes and doesn’t have any good intelligence,” said Najib Mahmood, political science professor at Kabul University. \nSaturday’s blast in one of the most heavily protected parts of the city, close to foreign embassies and government buildings, was the worst in the Afghan capital since a truck bomb near the German embassy killed 150 people in May. \nThe May blast triggered bloody anti-government protests but there has been no sign of any such agitation this week. Additional Omar Sobhani, Nayera Abdallah in CAIRO, Kay Johnson in ISLAMABAD; Writing by James Mackenzie; Editing by Robert Birsel and Paul Tait", "external_links": [], "published": "2018-01-29T06:18:00.000+02:00", "crawled": "2018-01-29T06:51:38.007+02:00", "highlightTitle": ""}