{"organizations": [], "uuid": "a438ac39874658623256ffc6271a909f6f12c921", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-africa-solar-investment/everyones-a-winner-how-impact-investing-can-make-money-and-do-good-idUSKBN1F611C", "country": "US", "domain_rank": 408, "title": "FEATURE-Everyone's a winner? How 'impact investing' can make money - and do good", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T11:00:00.000+02:00", "replies_count": 0, "uuid": "a438ac39874658623256ffc6271a909f6f12c921"}, "author": "", "url": "https://www.reuters.com/article/us-africa-solar-investment/everyones-a-winner-how-impact-investing-can-make-money-and-do-good-idUSKBN1F611C", "ord_in_thread": 0, "title": "FEATURE-Everyone's a winner? How 'impact investing' can make money - and do good", "locations": [], "entities": {"persons": [{"name": "james harman", "sentiment": "none"}, {"name": "harman", "sentiment": "none"}, {"name": "lee mannion", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "uganda", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}, {"name": "east africa", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Thomson Reuters Foundation) - Rural families in Africa who need access to power and investors seeking a decent return on their money are getting together so everyone prospers. The cherry on the cake? It’s good for the environment too.\nBritish investors are funding solar kits for households in East Africa with no access to electricity. As families pay for the kits over two or three years, investors recoup their stake with interest three times that offered by high street banks.\n“There are environmental benefits and social benefits so it seemed like a no brainer. It’s also a chance to address inequality between rich and poor countries,” one small-scale investor, James Harman, 24, told the Thomson Reuters Foundation.\nHarman has invested 500 pounds ($690) in projects in Uganda and Kenya and could make 5 percent interest annually for two years if repayments on the kits stay up to date.\n“You put the money in, accept you might lose some of it and see what happens,” Harman said. Other risks include currency fluctuations, political upheaval or natural disasters.\nThe investment scheme, Energise Africa, is one example of so-called impact investing, where both financial and social returns - making improvements in people’s lives - are created.\nPreviously the domain of corporations and the wealthy, impact investing is now available to anyone with small amounts of cash to spare - with investments in community cinemas, affordable housing or low cost gyms - from as little as $70.\nDemand is strong on both sides. In rural Uganda for example, only 7 percent of households in rural areas have access to electricity so off-grid schemes like Energise Africa can be transformative.\nAnd with advanced economies experiencing low interest rates since the global financial crisis of 2008, new ways of generating returns have increasing appeal.\nENERGIZING AFRICA A joint venture between Britain-based investing platforms Ethex and Lendahand, Energise Africa raises funds from individual investors that are then used by solar companies working locally to provide solar kits to rural families in Uganda, Kenya and Mozambique.\nAs well as the solar panel, the kits, typically costing about $400, comprise three solar lights, a mobile phone charger and a rechargeable torch and radio. The kits are covered by five years warranty and servicing.\nThe upfront cost means the technology is unaffordable for families. But, with overseas money providing solar companies with working capital, they can afford to offer payment plans to customers.\nThe interest paid by those purchasing the systems is used to pay investors their return.\nFather of five Hajji Ssenkere Umaru, 81, is a farmer living in Kyazanga District, a rural area of central Uganda. He grows tomatoes, cabbages and matoke, a type of banana, on his small farm, which is about the size of a soccer pitch.\nHe used to spend 150,000 Ugandan shillings ($40) a month - 15 percent of his salary - to fuel a water pump which irrigated his fields. The pump also incurred frequent repair costs.\nThese expenses made it difficult for him to pay school fees of nearly $200 a year in the months outside of the harvest.\nHe purchased a solar kit and waterpump in October and will pay for it over two years. When it’s paid for, he’ll be saving $50 per month. He is also able to charge his neighbors to use the pump, which brings in an additional $11 per week.\n“Before we got solar we suffered from the kerosene smoke. It created lumps in our throats and smoke got in our noses and was everywhere,” Umaru said by email to the Thomson Reuters Foundation.\nAs well as the cost savings, Umaru said his children now had more hours in which they could read. He also appreciates being connected to the outside world as he can power a television.\nACCESS TO FINANCE Interest rates vary for customers depending on the kind of solar kit they want.\n“It’s affordable, it’s not extortionate,” said Lisa Ashford, CEO of Ethex. “People might start off with a small solar kit but can upgrade in order to power a computer or television.”\n“People are paying off the lower cost product and, as they gain in confidence about the affordability, they tend to upgrade sooner and faster which I think indicates that people are able to afford this and can budget quite well,” Ashford said.\nThose providing the life-changing investments come from all walks of life, she said.\n“Energise Africa investors are everyday people – gardeners, campaigners and bankers - from millennials to families or retirees. They all share a common motivation to invest their money in a way that generates social and financial impact.”\nSuch initiatives are much needed as countries strive to meet United Nations development goals, aimed at ending poverty and fighting inequality. A report published last year, for example, found there is not enough finance for energy access to meet one of the goals - sustainable energy for all - by 2030.\n“There needs to be more range of financing available to get this done,” said Rachel Kyte, CEO of Sustainable Energy for All (SEforALL), which published the report.\nHarman, the young investor in Energise Africa, said the issue of global inequality was one of his motivations.\n“Much as I‘m not a rich person, I‘m very conscious I‘m in the top three percent of the world’s population in terms of income. I do feel a bit guilty about that,” said the data analyst, who earns nearly $50,000 annually.\nHis first investment - a microloan to a businesswoman via the website Zidisha - was promptly repaid and he went on to invest in two Energise Africa projects.\n“I want to help people, I want to put my money somewhere with a decent return on investment and I want to help reduce reliance on fossil fuels,” he said.\nReporting by Lee Mannion @leemannion; Editing by Ros Russell; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": [], "published": "2018-01-17T11:00:00.000+02:00", "crawled": "2018-01-17T11:40:46.023+02:00", "highlightTitle": ""}