{"organizations": [], "uuid": "98cf069f0a30111f40f078b4d4a0e81299425787", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225397187&w=1200&r=LYNXMPEE0P09S", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-usa-trump-britain/trump-says-would-apologise-for-sharing-far-right-videos-did-not-mean-to-offend-the-british-idUKKBN1FF0M9", "country": "US", "domain_rank": 408, "title": "Trump says would apologise for sharing far right videos, did not mean to offend the British", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T09:03:00.000+02:00", "replies_count": 0, "uuid": "98cf069f0a30111f40f078b4d4a0e81299425787"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-trump-britain/trump-says-would-apologise-for-sharing-far-right-videos-did-not-mean-to-offend-the-british-idUKKBN1FF0M9", "ord_in_thread": 0, "title": "Trump says would apologise for sharing far right videos, did not mean to offend the British", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "itv", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 04 AM / Updated 5 hours ago Trump says he 'would apologise' for sharing British far-right videos Guy Faulconbridge   U.S. President Donald Trump said he had not intended to cause offence in Britain by sharing anti-Muslim videos originally posted by a leader of a far-right fringe group, and that he would apologise if such people were horrible racists. \nTrump told ITV’s Good Morning Britain show he knew nothing about the group but that he was the “least racist person that anybody’s going to meet” and that his retweet was not an endorsement. \nTrump sparked outrage in Britain when he shared the anti-Muslim videos last November and became embroiled in a public spat with British PM Theresa May who criticised him for the retweet. \nWhen pressed on whether he would apologise for his retweet, Trump said that if the group was made up of racists then he would. \n“Here’s what’s fair, if you’re telling me they’re horrible people, horrible racist people, I would certainly apologise if you would like me to do that,” Trump said. \n“I know nothing about them. I don’t want to be involved with (these) people, but you’re telling me about these people because I know nothing about these people.” \nJayda Fransen, deputy leader of anti-immigration Britain First, posted the videos which she said showed a group of people who were Muslims beating a teenage boy to death, battering a boy on crutches and destroying a Christian statue. \nFransen on Friday said believed Trump had been “railroaded” into making an apology and said it was she who was due an apology for being described as a racist. U.S. President Donald Trump walks in a corridor after a meeting during the World Economic Forum (WEF) annual meeting in Davos, Switzerland January 25, 2018. REUTERS/Denis Balibouse MILITANT ATTACKS \n“The British establishment is trying to censor the president of the United States,” she told journalists after a court appearance in Belfast related to allegations that a speech she made about Muslims was “intended or likely to stir up hatred”. \nRelations between the two nations, described as “the special relationship”, have faced several ups and downs not just due to Trump’s criticism of May, but also his spats with London Mayor Sadiq Khan and his comments on militant attacks in Britain. \nEarlier this month, he cancelled a trip to London to open a new embassy, saying he did not want to endorse a bad deal agreed by the Obama administration to sell the old one for “peanuts”. \nSome Britons are angry at the prospect of a visit by Trump with large protests expected when he does arrive, most probably in the second half of the year according to a senior British government source. \nOfficials are discussing whether Trump will be given a state visit, which means he will be hosted by Queen Elizabeth, and when exactly it will take place, the source said. \nIn the interview aired on Friday, Trump said he loved Britain very much and got along well with May. \n“I can tell you I have a very good relationship with your Prime Minister,” Trump said. “She’s been doing a very good job. We actually have a very good relationship, although a lot of people think we don‘t.” \n“I support her, I support a lot of what she does and a lot of what she says and I support you militarily very much. We will come to your defence if anything should happen, which hopefully will never happen. I am a tremendous supporter of the UK.” Writing by Guy Faulconbridge and Costas Pitas; additional reporting by Amanda Ferguson in Belfast; editing by Kate Holton and William Maclean", "external_links": [], "published": "2018-01-26T09:03:00.000+02:00", "crawled": "2018-01-26T09:21:36.006+02:00", "highlightTitle": ""}