{"organizations": [], "uuid": "b329d4c857facb97a775673ef4912e51573c3760", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-sienna-resources-inc-commences-operations-on-slattberg-cobalt-nickel-copper-project-in-sweden.html", "country": "US", "domain_rank": 767, "title": "Sienna Resources Inc. Commences Operations on Slättberg Cobalt-Nickel-Copper Project in Sweden", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T16:14:00.000+02:00", "replies_count": 0, "uuid": "b329d4c857facb97a775673ef4912e51573c3760"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-sienna-resources-inc-commences-operations-on-slattberg-cobalt-nickel-copper-project-in-sweden.html", "ord_in_thread": 0, "title": "Sienna Resources Inc. Commences Operations on Slättberg Cobalt-Nickel-Copper Project in Sweden", "locations": [], "entities": {"persons": [{"name": "slättberg", "sentiment": "none"}], "locations": [{"name": "british columbia", "sentiment": "none"}, {"name": "sweden vancouver", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}], "organizations": [{"name": "sienna resources inc", "sentiment": "neutral"}, {"name": "slättberg cobalt-nickel-copper project", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, British Columbia, Jan. 25, 2018 (GLOBE NEWSWIRE) -- Sienna Resources (TSX-V:SIE) (A1XCQ0:FSE) (SNNAF:OTCBB) is pleased to announce the commencement of a high resolution ground magnetic survey on the Slättberg Cobalt-Nickel-Copper Project in Sweden.\nSlättberg’s massive sulfide mineralization is known to be strongly magnetic, owing to its high concentrations of pyrrhotite, a magnetic ferrous sulfide mineral associated with the Co-Ni-Cu mineralization. The new magnetic data will be used to potentially generate additional high priority drill targets on the project. Drilling is slated to commence in the coming weeks.\nSurvey methods:\nField teams are currently deployed and are using a G-859 Geometrics Cesium Vapor Magnetometer paired with a G-856AX Proton Procession magnetometer as a base station. Approximately 50-100 survey lines of 500 meters in length are planned at 25 meter spacing. The current survey will cover the central portion of the trend of historic mine workings where the initial drill program will be focused. Additional surveys will be conducted across other prioritized areas in the coming months.\nJason Gigliotti President of Sienna Resources states, “We are pleased to have started up operations on the Slättberg Cobalt-Nickel-Copper. We have recently closed an oversubscribed placement of $2.5 million and we plan to deploy this cash strategically and immediately. We plan to be very active on this project and expect to be drilling in the coming weeks. The global demand on battery metals such as cobalt continues to strengthen and we are very optimistic about our 2018 work programs.”\nAbout Sienna Resources Inc.:\nRecently Sienna received TSX Venture approval to go forward into an exploration and option agreement to acquire the Slättberg Cobalt-Nickel-Copper Project in Sweden (the “Project”) from EMX Royalty Corporation (“EMX”) (EMX-NYSE, tsxv) (announced December 4, 2017). The Project consists of two adjacent exploration permits comprising approximately 9513 contiguous acres.\nJason Gigliotti president of Sienna states, “We are very pleased to receive approval for this exciting cobalt-nickel-copper prospect. Cobalt prices have just crossed fresh ten year highs, and we look forward to advancing this prospect. There are 12 historic mines on this property and with modern mining approaches, we are very optimistic about what this project could contain.”\nNorthvolt is planning to be the largest battery factory in Europe at roughly the same size as Tesla’s Gigafactory. Jason Gigliotti states “Northvolt wants to locally source as much battery material as possible such as cobalt and nickel. There are now more than 20 mega battery factories currently being planned or constructed globally, creating a massive demand on the battery metals such as lithium, cobalt and nickel. Sienna is focused on exploring and developing projects that will meet this insatiable demand.”\nSlättberg is located 25 kilometers northwest of Falun, Sweden. Slättberg is a historic mining camp hosting cobalt-nickel-copper rich massive sulfide mineralization that occurs within a two kilometer belt of historic nickel-copper mines. The Project contains drill defined massive sulfide mineralization that extends to ~100 meters in depth, and remains open for expansion at depth and along strike. The Project is accessible year round, with nearby rail, power and 5 smelters in the Nordic region. At least 12 historic mines are located on the property, with historic operations dating back to the late 1800’s.\nTo view an enhanced version of the Geophysics and Target Map, please visit:\nhttp://orders.newsfilecorp.com/files/854/32315_a1516864958984_75.jpg\nMineralization at Slättberg is hosted by 1.8-1.9 Ga (Svecofennian) supracrustal rocks (metavolcanics and metasediments) located along the southwestern flank of a large gabbroic intrusive complex. The historic mines are positioned along an east-west trend of massive sulfide occurrences developed in and around a similarly oriented body of “leptite”. This is a local term used to describe rhyolitic/felsic tuffaceous rocks commonly associated with sulfide mineralization in Bergslagen. Mafic and ultramafic rocks also occur in and around the mine workings.\nSweden is at the forefront of an exploration and development boom in the mining industry. The country's favorable business environment includes a low corporate income tax rate, a proactive geological survey, and broad public support for export-led resource extraction. Sweden has a long history of mining, and is host to some of Europe’s largest active mines.\nThe technical contents of this release were approved by Greg Thomson, PGeo, a qualified person as defined by National Instrument 43-101.\nSienna has launched its new corporate website and branding. Please visit the site at www.siennaresources.com\nIf you would like to be added to Sienna’s email list please email info@siennaresources.com for information or join our twitter account at @SiennaResources\nContact Information\nTel: 1.604.646.6900\nFax: 1.604.689.1733\nwww.siennaresources.com\ninfo@siennaresources.com\n“Jason Gigliotti”\nPresident, Director\nSienna Resources Inc.\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release.\nSource:Sienna Resources Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=FJocUwVadvanU3w_ekfUd4M3Yc1wBaTnbAjixt7ornCaxYdvGUAoTI3M6Cl6MUW3_Ra4LWsWMYlf2AcvlA4epORvilRsgYqBCJny5LcKiVfgIiZDAlbWiWCZH8ZblJFj5275eRHrggBa8388z-EtQZOrLm04G6XlWdwc2QvcSiey1Bvm7wHmPFX_9fd2br3xXx0st0_cboUkeAY3-XXN0Q=="], "published": "2018-01-25T16:14:00.000+02:00", "crawled": "2018-01-25T17:16:11.004+02:00", "highlightTitle": ""}