{"organizations": [], "uuid": "4edfaf3a98993048591f1728185051d662abe9db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/france-nuclear/update-1-separate-unit-for-edf-nuclear-arm-has-been-discussed-says-minister-hulot-idUSL8N1PH4D6", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Separate unit for EDF nuclear arm has been discussed, says minister Hulot", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.056, "site_type": "news", "published": "2018-01-22T22:02:00.000+02:00", "replies_count": 0, "uuid": "4edfaf3a98993048591f1728185051d662abe9db"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/france-nuclear/update-1-separate-unit-for-edf-nuclear-arm-has-been-discussed-says-minister-hulot-idUSL8N1PH4D6", "ord_in_thread": 0, "title": "UPDATE 1-Separate unit for EDF nuclear arm has been discussed, says minister Hulot", "locations": [], "entities": {"persons": [{"name": "hulot", "sentiment": "negative"}, {"name": "geert de clercq", "sentiment": "none"}, {"name": "nicolas hulot", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "edf", "sentiment": "negative"}, {"name": "epr", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Separate EDF nuclear unit is option, nothing decided yet\n* Building new model EPR is not priority for now -Hulot (Adds Hulot comments)\nBy Geert De Clercq\nPARIS, Jan 22 (Reuters) - French Energy Minister Nicolas Hulot said the government has discussed the possibility of putting state-owned utility EDF’s nuclear activities in a separate legal unit, but added that nothing had been decided.\nHe also said that building a new-model EPR nuclear reactor in France was not a priority for now.\nAsked whether putting EDF’s nuclear activities in a separate legal unit was an option that had been discussed by the government, Hulot said: “This is one of the scenarios that are on the table, but there is no preferred option at this point”.\n“This is part of the suggestions, but no single solution has a preference,” Hulot told reporters on the sidelines of a news conference held to mark the beginning of the new year.\nSources told Reuters in November that the French finance ministry is studying several scenarios for restructuring EDF, including spinning off its nuclear power generation activities into a standalone unit.\nAsked whether it would be conceivable to build a new-model EPR nuclear reactor in France as EDF chief executive Jean-Bernard Levy has suggested, Hulot said that “for now this is neither a priority or a plan. Right now the priority is to develop renewable energy and to reduce the share of nuclear.”\nLast week, Levy told Le Figaro newspaper that French President Emmanuel Macron strongly supports the international ambitions of the French nuclear industry and that EDF hopes to sell nuclear reactors in Saudi Arabia and India.\nLevy also said that EDF unit Framatome is developing an optimised new model of its flagship European Pressurized Reactor (EPR), but he said that before this model could be exported, it would have to be ordered and built on French territory.\nUnder the previous government’s 2015 energy transition law, France needs to cut the share of nuclear energy in its power mix to 50 percent by 2025 from about 75 percent today.\nBut Hulot said late last year that while the government remains committed to reducing the share of nuclear to 50 percent, it may take ten more years to get to that level. (Reporting by Geert De Clercq; Editing by Sudip Kar-Gupta)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T22:02:00.000+02:00", "crawled": "2018-01-23T17:54:13.001+02:00", "highlightTitle": ""}