{"organizations": [], "uuid": "2f66e72414eaca223dbf89585e1ae222a72ee006", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/09/gettyimages-805851680-1.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/05/twitter-world-leaders-donald-trump/", "country": "US", "domain_rank": 1196, "title": "Twitter Responds to Criticism of Donald Trump's Tweets | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T19:58:00.000+02:00", "replies_count": 0, "uuid": "2f66e72414eaca223dbf89585e1ae222a72ee006"}, "author": "Tom Huddleston Jr.", "url": "http://fortune.com/2018/01/05/twitter-world-leaders-donald-trump/", "ord_in_thread": 0, "title": "Twitter Responds to Criticism of Donald Trump's Tweets | Fortune", "locations": [], "entities": {"persons": [{"name": "tom huddleston jr.", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}], "locations": [], "organizations": [{"name": "twitter", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Tom Huddleston Jr. January 5, 2018 \nTwitter responded to criticism over how it lets major public figures (like, say, President Donald Trump ) use its service to bully others and threaten violence (like a nuclear war ) while banning average users for doing the same thing. \nOn Friday, the company explained in a blog post that it draws a distinction between “world leaders” and others in terms of how it decides whether their posts violate its terms of service. Trump is never specifically named in Twitter’s statement. \n“Elected world leaders play a critical role in that conversation because of their outsized impact on our society,” Twitter said. “Blocking a world leader from Twitter or removing their controversial Tweets, would hide important information people should be able to see and debate. It would also not silence that leader, but it would certainly hamper necessary discussion around their words and actions.” New Blog: World Leaders on Twitter https://t.co/KhrGbrgEuA \n— Twitter Public Policy (@Policy) January 5, 2018 \nThe blog post comes as Twitter faces mounting criticism over its refusal to take any action against President Trump after he posted a tweet earlier this week taunting North Korean leader Kim Jong-Un. The president wrote, “I too have a nuclear button,” in what many interpreted as a threat of a nuclear strike against North Korea. Since then, calls for Twitter to remove Trump (and, perhaps, other world leaders ) from its service have intensified. Protesters even gathered outside Twitter’s headquarters in San Francisco earlier this week to call on CEO Jack Dorsey to delete Trump’s account. \nIn November, Twitter defended its decision to give Trump—a prolific Twitter user with a following of 46 million—free rein on the platform, even as it suspended other celebrity users for seemingly similar behavior. At the time, Dorsey called Trump’s tweets inherently “newsworthy” due to the office he holds. Of course, even Dorsey admitted then that evaluating newsworthiness on Twitter would be completely subjective. \nAnd, similarly, Twitter’s latest response to criticism is already causing confusion. Does this mean that elected officials can say whatever they want on Twitter? And, what defines a “world leader,” exactly? So how exactly does Twitter define \"world leaders\"? Is it just heads of state? The tweet mentions \"elected world leaders\"– what about those who take office by undemocratic means? Do opposition leaders get the same blessing? https://t.co/lRAd4WH0Vb \nGet Data Sheet , Fortune’s technology newsletter. \nBased on the initial response, it seems unlikely that Twitter’s latest statement will silence the company’s critics, some of whom have suggested that Twitter is reluctant to upset a powerful public figure with a large social following because of financial considerations. The company shot back at those assertions in its statement, arguing: “No one person’s account drives Twitter’s growth, or influences these decisions.” Twitter added that it tries to “remain unbiased with the public interest in mind.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-06T19:58:00.000+02:00", "crawled": "2018-01-06T02:08:40.128+02:00", "highlightTitle": ""}