{"organizations": [], "uuid": "426cc3f14497d19f6d8fb213628e10b700b05bb4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-syros-announces-pricing-of-40-million-public-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "Syros Announces Pricing of $40 Million Public Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T04:59:00.000+02:00", "replies_count": 0, "uuid": "426cc3f14497d19f6d8fb213628e10b700b05bb4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-syros-announces-pricing-of-40-million-public-offering-of-common-stock.html", "ord_in_thread": 0, "title": "Syros Announces Pricing of $40 Million Public Offering of Common Stock", "locations": [], "entities": {"persons": [], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}], "organizations": [{"name": "million public offering of common stock", "sentiment": "negative"}, {"name": "llc", "sentiment": "none"}, {"name": "cowen and company", "sentiment": "none"}, {"name": "j.p. morgan securities llc", "sentiment": "none"}, {"name": "piper jaffray & co.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMBRIDGE, Mass.--(BUSINESS WIRE)-- Syros Pharmaceuticals (NASDAQ: SYRS), a biopharmaceutical company pioneering the development of medicines to control the expression of genes, today announced that it has priced an underwritten public offering of 4,188,481 shares of common stock at a price to the public of $9.55 per share, before underwriting discounts and commissions, which would result in aggregate gross proceeds of approximately $40.0 million. Syros has also granted the underwriters a 30-day option to purchase from it up to an additional 15% of the shares of common stock offered in the public offering at the price offering price, less underwriting discounts and commissions. The proceeds of the offering are expected to be used to fund the Company’s research and clinical development programs and other corporate purposes. Closing of the offering is expected to occur on or about February 2, 2018, subject to customary closing conditions.\nJ.P. Morgan Securities LLC, Cowen and Company, LLC and Piper Jaffray & Co. are acting as joint book-running managers for the offering. JMP Securities LLC is acting as lead manager.\nThe shares are being offered by Syros pursuant to a shelf registration statement that was filed with the Securities and Exchange Commission (“SEC”) on July 20, 2017 and declared effective by the SEC on July 31, 2017. The offering will be made only by means of the prospectus and prospectus supplement that form a part of the registration statement. A preliminary prospectus supplement relating to, and describing the terms of, the offering has been filed with the SEC and is available on the SEC’s web site at www.sec.gov .\nThe final terms of the offering will be disclosed in a final prospectus supplement to be filed with the SEC. Copies of the final prospectus supplement and the accompanying prospectus relating to this offering, when available, can be obtained from J.P. Morgan Securities LLC, c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, New York 11717, telephone: 866-803-9204; Cowen and Company, LLC, c/o Broadridge Financial Services, 1155 Long Island Avenue, Edgewood, NY 11717, Attention: Prospectus Department, or by telephone at (631) 274-2806; or Piper Jaffray & Co., Attention: Prospectus Department, 800 Nicollet Mall, J12S03, Minneapolis, MN 55402, or by telephone at 800-747-3924.\nThis press release does not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Syros Pharmaceuticals\nSyros is pioneering the understanding of the non-coding region of the genome to advance a new wave of medicines that control expression of genes. Syros has built a proprietary platform that is designed to systematically and efficiently analyze this unexploited region of DNA in human disease tissue to identify and drug novel targets linked to genomically defined patient populations. Because gene expression is fundamental to the function of all cells, Syros’ gene control platform has broad potential to create medicines that achieve profound and durable benefit across a range of diseases. Syros is currently focused on cancer and monogenic diseases and is advancing a growing pipeline of gene control medicines. Syros’ lead drug candidates are SY-1425, a selective RARα agonist in a Phase 2 clinical trial for genomically defined subsets of patients with acute myeloid leukemia and myelodysplastic syndrome, and SY-1365, a selective CDK7 inhibitor in a Phase 1 clinical trial for patients with advanced solid tumors. Led by a team with deep experience in drug discovery, development and commercialization, Syros is located in Cambridge, Mass.\nCautionary Note Regarding Forward-Looking Statements\nThis press release contains within the meaning of The Private Securities Litigation Reform Act of 1995 such as those, among others, relating to Syros’ plans to consummate its proposed offering. The words ‘‘anticipate,’’ ‘‘believe,’’ ‘‘continue,’’ ‘‘could,’’ ‘‘estimate,’’ ‘‘expect,’’ ‘‘intend,’’ ‘‘may,’’ ‘‘plan,’’ ‘‘potential,’’ ‘‘predict,’’ ‘‘project,’’ ‘‘target,’’ ‘‘should,’’ ‘‘would,’’ and similar expressions are intended to identify , although not all contain these identifying words. Actual results or events could differ materially from the plans, intentions and expectations disclosed in these as a result of various important factors, including include, without limitation, risks and uncertainties related to, the satisfaction of customary closing conditions related to the proposed offering and the impact of general economic, industry or political conditions in the United States or internationally. There can be no assurance that Syros will be able to complete the proposed offering on the anticipated terms, or at all. Additional risks and uncertainties relating to the proposed offering, Syros and its business can be found under the caption “Risk Factors” in Syros’ Quarterly Report on Form 10-Q for the quarter ended September 30, 2017, Syros’ preliminary prospectus supplement filed with the SEC on January 30, 2018; and risks described in other filings that Syros makes with the Securities and Exchange Commission in the future. Any contained in this press release speak only as of the date hereof, and Syros expressly disclaims any obligation to update any , whether because of new information, future events or otherwise.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130006524/en/\nMedia Contact:\nSyros Pharmaceuticals, Inc.\nNaomi Aoki, 617-283-4298\nnaoki@syros.com\nor\nInvestor Contact:\nStern Investor Relations, Inc.\nHannah Deresiewicz, 212-362-1200\nhannahd@sternir.com\nSource: Syros Pharmaceuticals", "external_links": ["http://www.businesswire.com/news/home/20180130006524/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51751393&newsitemid=20180130006524&lan=en-US&anchor=www.sec.gov&index=1&md5=19008dbeac71408c7f6d38e9f9d9b245"], "published": "2018-01-31T04:59:00.000+02:00", "crawled": "2018-01-31T05:31:45.021+02:00", "highlightTitle": ""}