{"organizations": [], "uuid": "963de0f612b45cae6537579528716cf33014a233", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222397235&w=1200&r=LYNXMPEE0F0OM", "site_section": "http://feeds.reuters.com/reuters/UKStocksAndSharesNews/", "section_title": "Reuters: Stocks & Shares News", "url": "https://uk.reuters.com/article/us-global-markets-wages/commentary-relax-wage-boom-wont-unleash-inflation-idUKKBN1F5183", "country": "US", "domain_rank": 408, "title": "Commentary: Relax, wage boom won't unleash inflation", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T13:21:00.000+02:00", "replies_count": 0, "uuid": "963de0f612b45cae6537579528716cf33014a233"}, "author": "", "url": "https://uk.reuters.com/article/us-global-markets-wages/commentary-relax-wage-boom-wont-unleash-inflation-idUKKBN1F5183", "ord_in_thread": 0, "title": "Commentary: Relax, wage boom won't unleash inflation", "locations": [], "entities": {"persons": [{"name": "jamie mcgeever", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "harrisburg", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "ames companies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 11:21 AM / Updated 22 minutes ago Commentary: Relax, wage boom won't unleash inflation Jamie McGeever 5 Min Read \nLONDON (Reuters) - Bond yields around the world are rising as the pieces of the inflation jigsaw fall into place: a booming world economy, high and rising oil prices, strong corporate capex spending and the lowest unemployment rates in years, even decades. Painted wheelbarrow buckets arrive at the end of the assembly line at the AMES Companies factory, the largest wheelbarrow factory in the world, in Harrisburg, Pennsylvania, U.S. on June 29, 2017. REUTERS/Tim Aeppel \nThe final, missing piece is wage growth. With the world economy humming along close to potential, and unemployment so low across the developed world, it’s only a matter of time before wages take off. \nOnce they do, inflation will be right in our faces, instead of always being just around the corner. Then central banks will have to really tighten policy, and the fallout will hit all markets. \nAt least, that’s the consensus among economists and investors scrabbling to retain faith in the “Phillips curve” theory that economic growth leads to more jobs, lower unemployment, higher wages and ultimately inflation. \nBut rising wages don’t always fuel inflation. And if that’s how it plays out this year, investors will have to radically readjust their expectations on how high policy and market interest rates will go. \nJoe Lavorgna, chief U.S. economist at Natixis, goes further. He notes that the correlation between U.S. wage growth and inflation, and wage growth and the unemployment rate over the past quarter of a century has been “basically zero”. \n(For a graphic showing U.S. growth vs. inflation, click here: reut.rs/2DlEpLD ) \n(For a graphic showing U.S. wage growth vs. unemployment, click here: http://reut.rs/2CV5UdT) \n(For a graphic showing U.S. GDP vs. inflation, click here reut.rs/2Do2CB9 ) \nThe reasons wage growth has been so weak for so long, even in relative economic boom times, are well-known: rapid advances in technology, automation, globalisation, falling trade union membership, demographic changes and fragmented labour markets thanks to more part-time, freelance and temporary work. \nThere’s little indication this transfer of wealth to capital from labour will slow or stop, far less reverse, any time soon. \nStrong earnings growth isn’t inflationary if marginal increases are saved. This is a risk in the current environment given how high aggregate consumer debt levels are. According to McKinsey, “household debt continues to grow rapidly, and deleveraging is rare.” \nSome pockets in certain countries are showing record levels of debt, such as U.S. student and auto loans. Borrowers are likely to use higher wages to pay down debt, not consume. \nThen there’s the question of how income growth is distributed. The world’s richest people are getting richer, with the top 1 percent now owning half of the planet’s wealth compared with 43 percent a decade ago, according to Credit Suisse. \nHow much more can they actually spend? YOU NEVER GIVE ME YOUR MONEY \nLet’s assume wage growth does take off. Traditional economic theory dictates that it will almost certainly be driven by a surge in productivity (also conspicuous by its absence in the current expansion), as workers producing more per hour demand more compensation per hour. \nBut rising productivity is a deflationary force. All else equal, if output per hour is rising then the nominal value of those goods and services produced falls. \nIn any case, the link between productivity and wages is fragmenting. An OECD paper last year found that: “Over the past two decades, aggregate labour productivity growth in most OECD countries has decoupled from real median compensation growth, implying that raising productivity is no longer sufficient to raise real wages for the typical worker.” \nAnd if earnings growth remains elusive, Japan’s experience of the last 20 years, like many aspects of post-crisis global markets and economics, is again a useful guide. \n(For a graphic showing Japanese inflation vs. wage growth, click here: reut.rs/2CW8DUA ) \nApart from a brief three-year period around the turn of the millennium, unemployment in Japan has been lower than the U.S. jobless rate every single month since the early 1950s. Japan’s labour market is almost always tighter than the U.S. labour market. \nYet wage growth and inflation have been anemic. Annual earnings growth has barely risen above 2 percent over the past quarter of a century, and indeed, for much of that time wages have fallen. \nJapan has been battling against deflation for getting on decades. Apart from a two-year period from late 2013 to late 2015, Japan has consistently had lower inflation than the United States over the past 40 years, despite a tighter labour market. \nEither way, rising wages may not be the source of inflation many currently expect. \nThe opinions expressed here are those of the author, a columnist for Reuters. Reporting by Jamie McGeever; Graphics by Jamie McGeever and Ritvik Carvalho; Editing by Raissa Kasolowsky", "external_links": [], "published": "2018-01-16T13:21:00.000+02:00", "crawled": "2018-01-16T13:48:15.001+02:00", "highlightTitle": ""}