{"organizations": [], "uuid": "345cb6df576a4187ef41eca299632addd0843f47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/30/104976733-rsz_pencils_of_promise_headshot.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/pencils-of-promise-got-1-million-in-bitcoin-from-pineapple-fund.html", "country": "US", "domain_rank": 767, "title": "Pencils of Promise got $1 million in bitcoin from Pineapple Fund", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.032, "site_type": "news", "published": "2018-01-30T19:25:00.000+02:00", "replies_count": 0, "uuid": "345cb6df576a4187ef41eca299632addd0843f47"}, "author": "Catherine Clifford", "url": "https://www.cnbc.com/2018/01/30/pencils-of-promise-got-1-million-in-bitcoin-from-pineapple-fund.html", "ord_in_thread": 0, "title": "Pencils of Promise got $1 million in bitcoin from Pineapple Fund", "locations": [], "entities": {"persons": [{"name": "adam braun", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "pineapple fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\"I ran around my house with joy, and danced with our twin babies to celebrate (we do a lot of dancing together) the impact that I know that donation will have in the world,\" says Adam Braun, in a blog post published Tuesday about the moment a $999,999.99 donation from an anonymous bitcoin millionaire hit the bank account of his charity, Pencils of Promise.\nThe donation came via the Pineapple Fund , an online organization set up by a bitcoin enthusiast to give away the majority of his cryptocurrency wealth.\n\"Sometime around the early days of bitcoin, I saw the promise of decentralized money and decided to mine/buy/trade some magical internet tokens,\" the bitcoin investor, known only as 'Pine,' writes on the homepage for the Pineapple Fund. \"The expectation shattering returns of bitcoin over many years has lead to an amount far more than I can spend.\n\"What do you do when you have more money than you can ever possibly spend? Donating most of it to charity is what I'm doing,\" the philanthropist explains.\nA huge thanks to @_pineapplefund for donating $1 million to PoP and helping us bring quality education to thousands of children! #SeasonofPromise\nBraun launched Pencils of Promise in September 2008 to build schools for children in low-income areas. So far, Pencils of Promise has built more than 400 schools to help educate more than 75,000 individuals.\nIn December, Braun noticed people sharing the link to a Reddit post on his Facebook feed — it was about the launch of Pineapple Fund.\n\"I immediately sent the link to the team and said that we should fill out an application form for a donation through the Pineapple Fund website, which the team submitted right away,\" Braun recounts.\nThe team heard nothing back.\nBraun reached out to his friend and fellow charity entrepreneur, Scott Harrison, the founder and CEO of Charity: water , who had successfully received a donation from Pineapple Fund. Harrison told Braun he had written a cold email and suggested Braun focus on a really catchy subject line.\nThis time, Braun sat down himself and wrote an \"email from the heart, with a subject line that I knew would get opened.\" The text of the email is included below.\nSubject: You are the reason I started Pencils of Promise\nHI, my name is Adam Braun and after seeing your support of my friend Scott Harrison's organization charity: water (an amazing charity) I reached out to him and he suggested I shoot you a note as well.\nTo give you some background, 12 years ago while walking through the streets of India I met a young boy begging on the street who when I asked him what he wanted most on the world, simply answered, \"A pencil.\" It turns out he had never been to school before, which I learned was the case for 57 million children around the world. Inspired by that boy, several years later I founded Pencils of Promise to build schools, train teachers and increase access to quality education for children in the poorest parts of the world where education is needed most.\nThe organization began with just $25 and the goal to enable any person regardless of age, status or location to change lives. Truthfully, what you are now doing is the exact reason the organization was created, to show that philanthropy can be a vehicle to inspire others… This is now our 10th year of operation (founded Sept 2008 and now incorporated in the USA, Laos, Ghana and Guatemala), and from the beginning we've always believed the impossible could be made possible. From the start, we crowdsourced our early donations through small contributions from youth across the country, and over time have grown into a global movement that's built more than 400+ schools around the world for nearly 75,000 children so far. Most important though, we're completely data-driven and are pushing new boundaries of transparency in the education space (see here for examples).\nI can assure you that if you were to select Pencils of Promise for one of your $1M grants, we would be able to immediately use those funds in the communities we serve across Asia, Africa and Latin America to transform tens of thousands of lives through building new schools, training teachers, providing holistic community support and implementing our e-reader program that truly transforms learning for children in rural poverty.\nWhat you are doing is insanely inspiring to so many of us who have dedicated many, many years to this space and I hope you'll enable us to support even more children going forward. If you have any questions please don't hesitate to let me know!\nIn gratitude for your consideration,\nAdam\nEight days later, Braun received a response as he was walking home from brunch with his wife and twins.\nHi Adam,\nFirst, apologies for my delay in getting back to you. I've been super swamped with emails and personal / family commitments around this festive season.\nWe'd love to make a $1 million contribution to Pencils of Promise, even though it is outside of the scope of work we usually fund. Would you be able to set up bitcoin payment processing facilities?\nBest,\nPine\n\"As I read those words, my heart started beating out of my chest,\" says Braun.\nPencils of Promise had already set up a payment processing link, so Braun shared the url with Pine and in 10 minutes, a donation of $1 million showed up.\nWe now accept bitcoin donations! Give bitcoin. Give education:\n\"Pine, whoever you are, I hope that one day you'll reveal yourself so I can thank you in person. The world needs more people like you… Thank you for inspiring us all!\" writes Braun.\nSo far the fund has donated $34.4 million to 41 charities, including $2 million to Charity: water, which helps provide clean drinking water around the world; $ 1 million to Quill , an organization which provides free online tools to help students become better writers; and $5 million to Give Directly , an organization aiming to alleviate poverty by giving cash handouts to people living in Kenya, Uganda and Rwanda.\nAnd as for the name of the fund?\n\"I really like pineapple,\" writes Pine, citing the fruit's health benefits.\nSee also:\nCharity giving away $86 million in bitcoin donates $5 million to fight poverty—with cash\nWhy this Harvard grad has spent a decade making maxi pads out of banana fibers\nThese 14 billionaires just promised to give away more than half of their money like Bill Gates and Warren Buffett\nshow chapters This secret bitcoin millionaire is giving away $86 million to charity 4:44 PM ET Fri, 29 Dec 2017 | 01:10 Like this story? Like CNBC Make It on Facebook .", "external_links": [], "published": "2018-01-30T19:25:00.000+02:00", "crawled": "2018-01-30T19:25:17.001+02:00", "highlightTitle": ""}