{"organizations": [], "uuid": "675f12e26345bed2cdfe84d3b0ea7ca5f3f81377", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-illuminoss-medical-granted-fda-marketing-clearance-for-the-illuminossa-bone-stabilization-system.html", "country": "US", "domain_rank": 767, "title": "IlluminOss Medical Granted FDA Marketing Clearance for the IlluminOss® Bone Stabilization System", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.712, "site_type": "news", "published": "2018-01-09T17:00:00.000+02:00", "replies_count": 0, "uuid": "675f12e26345bed2cdfe84d3b0ea7ca5f3f81377"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-illuminoss-medical-granted-fda-marketing-clearance-for-the-illuminossa-bone-stabilization-system.html", "ord_in_thread": 0, "title": "IlluminOss Medical Granted FDA Marketing Clearance for the IlluminOss® Bone Stabilization System", "locations": [], "entities": {"persons": [], "locations": [{"name": "r.i.", "sentiment": "none"}, {"name": "providence", "sentiment": "none"}], "organizations": [{"name": "illuminoss medical", "sentiment": "negative"}, {"name": "illuminoss medical granted fda", "sentiment": "negative"}, {"name": "fda", "sentiment": "none"}, {"name": "illuminoss bone stabilization system", "sentiment": "none"}, {"name": "u.s. food and drug administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EAST PROVIDENCE, R.I., Jan. 09, 2018 (GLOBE NEWSWIRE) -- IlluminOss Medical , a privately held, commercial-stage medical device company focused on minimally invasive orthopedic fracture repair, today announced that it has received U.S. Food and Drug Administration (FDA) de novo clearance for the IlluminOss Bone Stabilization System for treatment of impending and actual pathological fractures of the humerus, radius and ulna from metastatic bone disease.\nThe IlluminOss System incorporates the use of a thin-walled PET balloon that is infused with a liquid monomer and delivered in a minimally invasive fashion into the intramedullary canal of the bone through a small incision.\nOnce the balloon is infused with monomer, it conforms to the shape of the patient’s specific bone. The surgeon then activates a light source which delivers visible light to the PET balloon, polymerizing the monomer. The cured, hardened implant provides longitudinal strength and rotational stability over the length of the implant, stabilizing the fracture.\nThe IlluminOss System, which has been commercially available in international markets and been in clinical use since 2010, will now be available to patients in the U.S. for the treatment of pathological fractures of the humerus, radius and ulna.\n“The FDA marketing clearance marks a significant milestone for IlluminOss Medical, allowing us to bring our products to the U.S. market,” said Robert Rabiner, Chief Technology Officer, IlluminOss. “The IlluminOss System was developed with an aim to provide improved patient experiences and outcomes when treating pathologic fractures. There is a critical need to make less invasive orthopedic fracture repair options available to an aging and underserved market segment.”\nSurgeons’ experiences with the product in the international markets have reported smaller incisions, shorter procedural times, faster return to patients' daily living activities, with reduced hospital stays and lower complication rates for patients.\n“The IlluminOss System has significantly changed the way we are able to approach the treatment of certain impending and actual pathological fractures resulting from metastatic bone disease,” said Dr. Richard McGough, Department of Orthopaedic Surgery, University of Pittsburgh Medical Center. “We were able to offer patients a quick, reliable surgical option that minimized pain and hospitalization. We were also able to consolidate their treatments; in some cases, we moved from two-day admissions to outpatient surgery, and we were ultimately able to complete radiation much more quickly.”\n“I am delighted that we now have an improved option to help patients with metastatic bone disease of the humerus,” said John Healey, Chief of Orthopaedic Surgery, Memorial Sloan Kettering Cancer Center. “Since this device doesn’t violate the rotator cuff and can be inserted with reduced operative time and blood loss, it relieves pain and restores function more effectively than alternative treatments, in my experience. Furthermore, this new technology is versatile, and I anticipate that new applications will follow.”\nIlluminOss plans to start commercialization efforts in the U.S. in Q2 of 2018.\nAbout IlluminOss Medical\nIlluminOss Medical is a privately held, commercial-stage medical device company focused on designing, developing and marketing orthopedic fracture repair products that leverage its proprietary bone stabilization technology, the IlluminOss System.\nIlluminOss’ minimally invasive technology produces patient specific intramedullary implants for fracture fixation by utilizing a light-curable polymer, contained within an expandable balloon catheter, to achieve bone stabilization.\nThe revolutionary procedure uses a small percutaneous surgical approach, providing patients and clinicians with a fast, patient-specific method of orthopedic bone stabilization.\nThe company currently markets its products in international countries under a CE Mark for approved clinical applications through both a direct sales force and distribution networks and has obtained U.S. Food and Drug Administration (FDA) de novo clearance.\nLearn more at www.illuminoss.com .\nMedia Contact: Jordan Bouclin SVM Public Relations Jordan.bouclin@svmpr.com (401)490-9700\nSource: IlluminOss Medical", "external_links": ["https://www.globenewswire.com/Tracker?data=Rqf0z2rKl0-L4xEX5Hnc_0KewOipcyH4_57c9ljVfKmNax8V4z5H3MhcRYoPuCWBnNdMmJpQJt4lfAkQmyYHIa3eIBOrV_Q4UQ_ojJQoYyg=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/3cd39d22-6490-41bf-bcb4-e5ef1e4e281d", "https://www.globenewswire.com/Tracker?data=v6bAEDTW32Y4aFLUypukQ4SrS8geVGBt8n4vWnsAT2aB6jFqiwWlgc6FuNJszQg0FkPKcf-8YVgPV3EPrMNOgeJ4kMqDPMoE3Eo7FKCaRlA="], "published": "2018-01-09T17:00:00.000+02:00", "crawled": "2018-01-09T19:03:10.000+02:00", "highlightTitle": ""}