{"organizations": [], "uuid": "3b558516885d0a37a32e9ce19f57cc1355061d59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/29/104974122-GettyImages-590550434.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/republicans-donate-steve-wynn-contributions-amid-misconduct-claims.html", "country": "US", "domain_rank": 767, "title": "Republicans donate Steve Wynn contributions amid misconduct claims", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-29T18:55:00.000+02:00", "replies_count": 0, "uuid": "3b558516885d0a37a32e9ce19f57cc1355061d59"}, "author": "Jacob Pramuk", "url": "https://www.cnbc.com/2018/01/29/republicans-donate-steve-wynn-contributions-amid-misconduct-claims.html", "ord_in_thread": 0, "title": "Republicans donate Steve Wynn contributions amid misconduct claims", "locations": [], "entities": {"persons": [{"name": "steve wynn", "sentiment": "negative"}, {"name": "wynn resor", "sentiment": "negative"}, {"name": "harvey weinstein", "sentiment": "none"}, {"name": "rob portman", "sentiment": "none"}, {"name": "wynn", "sentiment": "none"}, {"name": "paul ryan", "sentiment": "none"}], "locations": [{"name": "r-ohio", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "ts ltd", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Calvin Sit | Bloomberg | Getty Images Steve Wynn, chairman and chief executive officer of Wynn Resorts Ltd. \nSome Republicans in Congress are announcing plans to donate campaign contributions linked to Steve Wynn as the casino mogul faces claims of sexual misconduct. \nGOP lawmakers aimed to distance themselves from the billionaire, who resigned as the party's finance chairman on Saturday . Democrats quickly put pressure on Republicans to return Wynn's money — echoing Republicans when numerous sexual misconduct allegations against prolific Democratic donor Harvey Weinstein surfaced. \nMultiple members of Congress said they would give donations from Wynn or an affiliated organization to charity. According to NBC News and The Wall Street Journal, the following GOP lawmakers and organizations have announced plans to donate Wynn's contributions: House Speaker Paul Ryan said he will donate $1,000 he received from a Wynn Resorts-affiliated group in 2016 to charity. Sen. Rob Portman, R-Ohio, said he plans to give the $2,700 he received from Wynn during his 2016 campaign to charities that fight human trafficking, NBC reported. Rep. Karen Handel, R-Ga., donated $2,700 she received from Wynn in last year's special election campaign to a charity for domestic violence and sexual assault survivors. Rep. Greg Gianforte, R-Mont., said he will give the $2,700 he received from Wynn during his special election bid last year to charity. Rep. Gus Bilirakis, R-Fla., said he plans to donate $1,000 he received from the Wynn Resorts-affiliated group. Sen. Jeff Flake, R-Ariz., had received $5,400 in total from Wynn for Flake's 2018 primary and 2018 general elections. After announcing that he would resign at the end of his term, Flake returned the $2,700 general election donation. Flake said he will donate the remaining $2,700 to charity. The Republican Governors Association (RGA) said it will return a $100,000 Wynn Resorts contribution it received during the most recent election cycle. The RGA will also cancel its contract with Wynn Resorts and will not accept money from the company in the future. Rep. Kevin McCarthy, R-Calif., said he plans to donate his contributions to charity. \nWynn has given hundreds of thousands of dollars to candidates and committees over the years, and his contributions have gone to both Republicans and Democrats. His donations in recent years have skewed heavily toward the GOP. show chapters 9 Hours Ago | 02:28 \nWynn became the top Republican fundraiser last year and oversaw a period in which the Republican National Committee handily outraised the Democratic Party. It is unclear whether the national party organization plans to donate Wynn's contributions.", "external_links": [], "published": "2018-01-29T18:55:00.000+02:00", "crawled": "2018-01-29T18:55:53.008+02:00", "highlightTitle": ""}