{"organizations": [], "uuid": "191a278cd27a54c3a1c35b18e4da47832f90026a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-vision-announces-leadership-appointments.html", "country": "US", "domain_rank": 767, "title": "Vision Announces Leadership Appointments", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-09T00:00:00.000+02:00", "replies_count": 0, "uuid": "191a278cd27a54c3a1c35b18e4da47832f90026a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-vision-announces-leadership-appointments.html", "ord_in_thread": 0, "title": "Vision Announces Leadership Appointments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "High growth marketing firm appoints Brad Moore as CEO and Mario Christopher as CFO;\nElevates Doug Powell to serve as Chairman of the Board\nBOLINGBROOK, Ill.--(BUSINESS WIRE)-- Vision, a leading marketing services firm, today announced leadership appointments to support the company’s high growth and position it for long-term success.\nEffective immediately, Doug Powell has been elevated from CEO to serve as Chairman of the Board of Directors. Since the Company’s inception, Doug has led Vision’s tremendous growth from start-up to over $100 million in annual revenue. As Chairman, Doug will remain active in the business focusing on strategic sales and acquisitions.\nThe next step in the board’s leadership succession plan is the appointment of Brad Moore as CEO. Brad has been with Vision since 2015; initially as the organization’s sales leader and most recently as President. Brad’s deep background in marketing and media and his experience building and leading high growth teams are critical to Vision’s future success.\n“We are grateful to Doug Powell for building Vision into what it is today,” said Ken Hooten, Partner at Concentric Equity Partners and current Chairman of the Board. “Having led Vision for over 30 years, Doug’s experience and knowledge is invaluable to the leadership team. We couldn’t be more excited for Brad, who has been instrumental to our recent growth under Doug’s leadership.”\nDoug Powell added, “We recruited Brad into the organization with this succession plan in mind and we are confident he will continue to execute on our growth plan.”\nMario Christopher, an accomplished finance executive with over 20 years CFO experience, joins Vision as CFO. Throughout his career, Mario has led high growth companies with a broad leadership perspective overseeing finance, accounting, HR, IT and risk management. He comes to Vision from ShowingTime, a technology services provider, and previously served as the finance leader for organizations with revenue over $100 million.\n“Mario brings a wealth of experience that will be invaluable to Vision’s strategic direction and continued trend of profitable growth,” said Brad Moore. “We are thrilled to add him to our talented executive team.”\nAbout Vision\nVision is a leading provider of marketing services and technology solutions. The company specializes in multi-channel, personalized direct response campaigns and marketing automation solutions. Vision serves national brands across many sectors including financial services, insurance, healthcare, retail, automotive, e-commerce and not-for-profit. Vision is headquartered in the Chicago area and has approximately 400 employees. You can read more about Vision at www.visionps.com .\nAbout Concentric Equity Partners\nConcentric Equity Partners (CEP) is a private investment firm based in Chicago, IL., providing capital and strategic support to exceptional companies pursuing rapid growth. The firm’s approach is to support entrepreneurs with capital, operating expertise and industry knowledge. CEP and the Vision management team own Vision. You can read more about CEP at www.ficcep.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108006805/en/\nVision\nJoan Patrick | Director of Marketing\n312-373-6354\njpatrick@visionps.com\nSource: Vision", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.visionps.com&esheet=51739916&newsitemid=20180108006805&lan=en-US&anchor=www.visionps.com&index=1&md5=6596ef526764fec8a3e209aaf95fd205", "http://www.businesswire.com/news/home/20180108006805/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ficcep.com&esheet=51739916&newsitemid=20180108006805&lan=en-US&anchor=www.ficcep.com&index=2&md5=debbe8f8d8ad471e9430d18660e97a3b"], "published": "2018-01-09T00:00:00.000+02:00", "crawled": "2018-01-09T09:40:27.558+02:00", "highlightTitle": ""}