{"organizations": [], "uuid": "c8f99c68863d66ef7e351607b4d765c5805affc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222421064&w=1200&r=LYNXMPEE0F0UJ", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-autoshow-detroit-gmceo/gm-sees-2017-eps-near-top-of-target-2018-in-line-with-2017-idUSKBN1F51IE", "country": "US", "domain_rank": 408, "title": "GM sees 2017 EPS near top of target, 2018 'in line' with 2017", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T15:01:00.000+02:00", "replies_count": 0, "uuid": "c8f99c68863d66ef7e351607b4d765c5805affc0"}, "author": "", "url": "https://www.reuters.com/article/us-autoshow-detroit-gmceo/gm-sees-2017-eps-near-top-of-target-2018-in-line-with-2017-idUSKBN1F51IE", "ord_in_thread": 0, "title": "GM sees 2017 EPS near top of target, 2018 'in line' with 2017", "locations": [], "entities": {"persons": [{"name": "nick carey", "sentiment": "none"}, {"name": "mary barra", "sentiment": "none"}, {"name": "joseph white", "sentiment": "none"}], "locations": [{"name": "detroit", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}], "organizations": [{"name": "gm", "sentiment": "negative"}, {"name": "fiat chrysler automobiles nv", "sentiment": "none"}, {"name": "general motors co", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ford motor co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT (Reuters) - General Motors Co ( GM.N ) shares rose on Tuesday after the company said 2018 earnings will be largely flat compared with 2017 and forecast higher profits in 2019 when its revamped line of high-margin pickup trucks hits the U.S. market.\nThe 2018 earnings outlook was above market expectations, sending GM shares up about 2 percent in midday trading.\nGM forecast 2017 earnings per share at the high end of its previously forecast range of $6 to $6.50. The company expects earnings for 2018 to be roughly the same as in 2017. Analysts have predicted full-year 2017 earnings per share of $6.30, and $5.98 a share in 2018.\n“If the guidance is as positive as we interpret it, this could be the positive catalyst that we expected, and sets up a solid ’18,” Barclays analyst Brian Johnson wrote in a client note.\nThe company and its Detroit rivals, Ford Motor Co ( F.N ) and Fiat Chrysler Automobiles NV ( FCHA.MI ), are bringing on new trucks at a time when overall U.S. new vehicle sales have been falling, but truck sales continue to grow as consumers abandon passenger cars in favor of pickups, SUVs and crossovers.\nPresident Dan Ammann said GM’s new line of pickups should generate improved profit from increased production of higher-priced, four-door crew cab trucks, and expanded sales of luxury truck models.\nGM said in a presentation on Tuesday its Denali line of luxury pickups has average transaction prices of about $55,600, higher than the average for Daimler AG’s ( DAIGn.DE ) Mercedes-Benz brand, or GM’s own Cadillac luxury brand.\nChief Executive Mary Barra said during a meeting with reporters the automaker will boost investment in electric vehicles, but declined to say by how much. Rival automakers have used the Detroit auto show to tout multi-billion dollar investments in electrification.\nGM said it expects capital expenditure in 2018 of around $8.5 billion, about $1 billion of which will go toward self-driving car technology. In future years, Chief Financial Officer Chuck Stevens said total capital spending should decrease.\nLast week, the company said it was seeking U.S. government approval for a fully autonomous car - one without a steering wheel, brake pedal or accelerator pedal - to join GM’s first commercial ride-sharing fleet in 2019.\nBarra also said GM will not follow other companies that have given employees special bonuses tied to tax cuts by the administration of U.S. President Donald Trump, which slashed the top U.S. corporate tax rate.\nInstead, Barra said if GM has higher profits because of lower U.S. taxes, GM employees, including union-represented U.S. factory workers, should see larger bonuses or profit-sharing checks based on existing pay formulas.\nIn a client note, Buckingham Research Group analyst Joseph Amaturo wrote that GM’s 2018 earnings outlook includes a “lower statutory corporate tax rate, so on an apples-to-apples basis, this appears to be an effective EPS guide down.”\n“We believe the stock will fade after investors understand that the implied EPS guide is for a year-on-year decline, as we and consensus are forecasting,” Amaturo wrote.\nGM faces challenges in 2018 from the costs of launching the new large pickup trucks, rising interest rates in the United States and a likely decline in overall U.S. vehicle sales, Stevens said.\nHowever, Stevens said wage growth could offset the impact of higher interest rates for consumers buying vehicles.\nBarra, Ammann and Stevens declined to say when investments in self-driving vehicle services and electrification will return profits. They pointed to the potential for new trucks and SUVs, a new, low-cost car for international markets, and the Cadillac luxury brand, to improve future earnings.\nCadillac profits should double from current levels by 2021, GM said, riding growing sales in China and new products planned for the United States to replace a current crop of slow-selling sedans. Stevens did not disclose current profit figures for Cadillac.\nGM said on Tuesday that while it retools a factory in Ft. Wayne, Indiana, to make the new pickup trucks, it will shift some production to an Oshawa, Ontario, plant in order to build up to 60,000 vehicles and avoid missing sales.\nThe No. 1 U.S. automaker said it will record a $7 billion non-cash charge for its fourth-quarter 2017 earnings related to deferred tax assets that will lose their value because of the lower U.S. corporate tax rate.\nGM shares rose 2.2 percent to $45.04 in noon trading.\nReporting By Nick Carey; Editing by Bernadette Baum\n ", "external_links": [], "published": "2018-01-16T15:01:00.000+02:00", "crawled": "2018-01-16T15:11:32.025+02:00", "highlightTitle": ""}