{"organizations": [], "uuid": "56253c7fd2ac9719df838ae1f0e84a896b35b570", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 34, "shares": 34, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-818932834.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/30/bitcoin-gold-cryptocurrency-citi/", "country": "US", "domain_rank": 1196, "title": "Bitcoin May Not Be Digital Gold, Citi Crypto Report Finds | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.597, "site_type": "news", "published": "2018-01-30T02:00:00.000+02:00", "replies_count": 0, "uuid": "56253c7fd2ac9719df838ae1f0e84a896b35b570"}, "author": "Jen Wieczner", "url": "http://fortune.com/2018/01/30/bitcoin-gold-cryptocurrency-citi/", "ord_in_thread": 0, "title": "Bitcoin May Not Be Digital Gold, Citi Crypto Report Finds | Fortune", "locations": [], "entities": {"persons": [{"name": "jen wieczner", "sentiment": "negative"}, {"name": "bitcoin", "sentiment": "negative"}, {"name": "james altucher", "sentiment": "none"}, {"name": "jim rickards", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "bitcoin", "sentiment": "none"}], "organizations": [{"name": "citi crypto", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Jen Wieczner January 30, 2018 \nTo explain Bitcoin’s exponential rise over the past year, proponents of the cryptocurrency often come back to the same refrain. Think of Bitcoin, they say, as digital gold—a so-called “store of value” that, like the precious metal itself, doesn’t need to have a lot of practical uses to be worth a lot of money. \nThe price of a Bitcoin, which first surpassed the gold price nearly a year ago, is now worth more than seven times the value of an ounce of the metal (currently priced at $1,338). That’s after the Bitcoin price has tumbled recently to its current value around $10,000, half what it was worth at its all-time high last month. \nBut whether Bitcoin can actually replace gold (let alone traditional government-backed currency) has been a matter of fervent debate—quite literally, as evidenced by an event last week entitled “Gold Versus Bitcoin,” held at a New York comedy club, in which well-known gold proponent (Jim Rickards debated James Altucher, a self-help author now peddling Bitcoin investment advice under the moniker “crypto-genius.” (The gold side, represented by Rickards, prevailed.) \nCameron Winklevoss, who with his twin brother Tyler reportedly turned settlement money from their Facebook lawsuit into more than $1 billion in Bitcoin , has suggested the cryptocurrency could “disrupt” gold, calling it “gold 2.0.” \nNow, in a rare move, a major Wall Street bank has weighed in, too. Offering their latest market outlook Tuesday, investment strategists from Citigroup’s wealth management arm directly questioned Winklevoss’s argument—but still suggested that Bitcoin could offer better returns than gold. \n“Amid record low volatility in other asset classes, the grand scale of the volatility in cryptocurrencies is welcomed as a return vehicle by many traders,” the strategists from Citi Private Bank wrote in their report. “What should the expected return of the most volatile asset class be? Generally, the highest.” \nIndeed, Bitcoin has made investors far richer than gold has recently, with the cryptocurrency returning 1,116% over the past 12 months, compared to less than 12% for gold. But investors turn to gold in order to diversify their portfolio, using the metal as a safe haven protecting against a drop in the stock market. After all, gold historically has shown a negative correlation with stocks—meaning when stocks go down, gold typically rises, and vice versa. \nBitcoin, on the other hand, not only is far more volatile than both stocks and gold (as illustrated in the chart above), but trades unpredictably, even maniacally, without any relationship to other assets or even gold itself. In its analysis, Citi Private Bank found that Bitcoin’s correlation to the S&P 500 was virtually zero, while its correlation with gold was .054, meaning gold and Bitcoin only trade in sync about 5% of the time—a relationship so negligible as to be insignificant. \nThose erratic movements would make it hard for Bitcoin to serve the same purpose as gold does for investors. What’s more, the Citi strategists doubt whether the world even needs a new version of gold, when governments long ago stopped pegging the value of paper currency to the metal: “Is a fixed supply of money, a digital gold standard, really superior to a flexible money supply?” the report’s authors wrote rhetorically. \nStill, Citi believes that Bitcoin’s ability to rise, no matter how other markets are trading, bodes well for investors, at least for the time being. “Low correlations between asset prices are also a sign of ‘bull market psychology,'” according to the report. “This benefits near-term returns at the expense of the future.” \nBecause of those potential winnings, Citi advised that it would be reasonable for investors to own a small amount of cryptocurrencies, as such “opportunistic, speculative investments” could “have a role” in investment portfolios—as long as they don’t “overwhelm” the returns of more traditional stocks and bonds. \nThough the bank stopped short of dismissing Bitcoin altogether, it was highly skeptical that it or any of the other almost 1,500 other cryptocurrencies now in existence would survive, comparing the digital currencies to “lottery tickets.” Of the other cryptocurrencies besides Bitcoin, the Citi strategists wrote, “We expect a great many to have a dubious future.” \nBut that future could also be more distant than many cryptocurrency critics think. Noting that the value of tech stocks at the height of the dot-com bubble was many times the size of the current cryptocurrency market (with a total value of about $519 billion), Citi’s report conceded that it may be a while before the crypto bubble bursts: “Bubbles can build in plain sight, be duly identified, and prove highly durable for a period measured in years.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-30T02:00:00.000+02:00", "crawled": "2018-01-31T10:00:28.005+02:00", "highlightTitle": ""}