{"organizations": [], "uuid": "5c5f80b137fad587c2196ecc8b8563515b2cfdde", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104934991-J1UC6737-2.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/22/south-koreas-moon-jae-in-hopes-inter-korean-thaw-opens-door-for-nuclear-talks-with-us.html", "country": "US", "domain_rank": 767, "title": "South Korea's Moon hopes inter-Korean thaw 'opens door' for nuclear talks with US", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T12:30:00.000+02:00", "replies_count": 0, "uuid": "5c5f80b137fad587c2196ecc8b8563515b2cfdde"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/22/south-koreas-moon-jae-in-hopes-inter-korean-thaw-opens-door-for-nuclear-talks-with-us.html", "ord_in_thread": 0, "title": "South Korea's Moon hopes inter-Korean thaw 'opens door' for nuclear talks with US", "locations": [], "entities": {"persons": [{"name": "moon", "sentiment": "negative"}, {"name": "moon jae-in", "sentiment": "negative"}, {"name": "north", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "koreas", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "hoenggye", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "u.n. security council", "sentiment": "none"}, {"name": "international olympic committee", "sentiment": "none"}, {"name": "blue house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "South Korean President Moon Jae-in said on Monday a thaw in relations between the two Koreas ahead of next month's Winter Olympics presented a \"precious chance\" for the United States and North Korea to discuss the North's weapons programmes.\nNorth Korea is developing missile and nuclear technology amid regular threats to destroy the United States and Japan and in defiance of U.N. Security Council resolutions, prompting a war of words between the North and the United States.\nGetty Images The Olympic rings is seen in Hoenggye town, near the venue for the Opening and Closing ceremony ahead of PyeongChang 2018 Winter Olympic Games in Pyeongchang-gun, South Korea. But after a year of mounting tension, diplomacy focused on sport enabled the International Olympic Committee to announce on Saturday that reclusive North Korea will send 22 athletes to the Feb. 9-25 Games.\nThe Olympics provided a \"precious chance to open the door\" for talks to resolve the nuclear issue and establish peace on the peninsula, Moon said at the presidential Blue House.\n\"But no one can be optimistic about how long the current mood for dialogue will last. We need wisdom and efforts to sustain the dialogue opportunities ... beyond the Olympics so that the inter-Korean talks will lead to talks between the United States and North Korea and other forms of dialogue\".\nWhile a recent opinion poll showed most South Koreans welcomed the North's participation in the Games, conservative opponents staged a small but noisy rally as a North Korean delegation inspected venues in Seoul for cultural events to be held on the sidelines of the Olympics.\nSouth Korean police intervened when one group of protesters burned a picture of North Korean leader Kim Jong Un on the steps of Seoul's central train station where a delegation from the North had arrived.\nHolding a sign saying \"We're opposed to Kim Jong Un's Pyongyang Olympics!\", the protesters chanted that the North had \"snatched\" attention for the showpiece event from South Korea.\nThe North Korean delegation was led by Hyon Song-wol, a popular female singer, who smiled and waved to a crowd at the train station before the protest began.\n\"Seeing the citizens here welcoming us, I feel we will be able to successfully complete the concert\", Hyon was Quote: d as saying by a Seoul official, according to South Korean media.\nSome specific Olympic plans, including marching under a united flag and forming a joint women's ice hockey team, have proven controversial, with conservatives and younger South Koreans upset that an unchastened North Korea is stealing the spotlight.\nOne year in office: How Donald Trump has shaped US foreign policy Jabin Botsford | The Washington Post | Getty Images Moon's administration was also under pressure over the plan to send athletes to a North Korean ski resort for joint training, which experts say risks giving Kim's regime legitimacy and some much needed cash.\nMoon's approval rating has fallen to a four-month low at 66 percent, a poll showed on Monday, after a public backlash over the decision on a combined ice hockey team.\nNorth Korea's state media on Monday criticised South Korea for having joined last week's meeting of 20 nations in Vancouver which called for additional sanctions and pressure on the North to ensure it gives up its nuclear ambitions.\n\"This is an unpardonable provocation going against the aspiration and desire of all Koreans for the country's peace and reunification and aggravating the regional situation\", the North's official KCNA said in a commentary.", "external_links": [], "published": "2018-01-22T12:30:00.000+02:00", "crawled": "2018-01-22T13:06:13.000+02:00", "highlightTitle": ""}