{"organizations": [], "uuid": "b212787820ed3982d022ce8c8c7116e706bc9b4c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222668293&w=1200&r=LYNXMPEE0G0FV", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-spain-politics-catalonia-factbox/whats-next-for-catalonia-and-would-be-leader-puigdemont-idUSKBN1F60TV", "country": "US", "domain_rank": 408, "title": "What's next for Catalonia and would-be leader Puigdemont?", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T16:33:00.000+02:00", "replies_count": 0, "uuid": "b212787820ed3982d022ce8c8c7116e706bc9b4c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-spain-politics-catalonia-factbox/whats-next-for-catalonia-and-would-be-leader-puigdemont-idUSKBN1F60TV", "ord_in_thread": 0, "title": "What's next for Catalonia and would-be leader Puigdemont?", "locations": [], "entities": {"persons": [{"name": "puigdemont", "sentiment": "neutral"}, {"name": "carles puigdemont", "sentiment": "none"}, {"name": "mariano rajoy", "sentiment": "none"}, {"name": "rajoy", "sentiment": "none"}], "locations": [{"name": "catalonia", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "catalonia", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MADRID (Reuters) - Catalonia’s new parliament meets for the first time on Wednesday, a step toward choosing a president for Spain’s wealthiest region, a daunting challenge when the top candidate has fled abroad and other potentials are in jail.\nHere is a look at what lies ahead for Catalonia, a region which has been ruled by Madrid for the past three months after it held an illegal independence referendum:\n** CAN PUIGDEMONT RULE CATALONIA? Carles Puigdemont, the 55-year old ex-Catalonia chief sacked by Spanish Prime Minister Mariano Rajoy for his role in organizing the Oct. 1 independence referendum, is the separatists’ candidate to rule Catalonia.\nIn theory, that should have been easy: the Dec. 21 regional election called by Rajoy in a bid to weaken the independence drive backfired and gave nationalists an absolute majority.\nBut Puigdemont is targeted by an arrest warrant over leading the secession bid. He is now in Brussels and faces arrest and potentially decades in jail the minute he steps foot in Spain.\nPuigdemont and his allies have touted ruling via proxy or by videolink from Belgium.\nBut, Rajoy said Madrid would simply not recognize such an in-absentia regional government and would continue its direct rule of Catalonia in that case. Catalonia’s parliament’s own legal advisers said such a government would be against the law.\n** IF NOT PUIGDEMONT, WHO ELSE? The head of ally ERC, Oriol Junqueras, the other main separatist leader, is in jail for his role in Catalonia’s secession bid.\nThe problem for the nationalists, if they don’t manage to get one of them elected, is that there are no obvious replacement candidates and agreeing on someone else could be a lengthy and difficult process.\nAnother option would be for those jailed or fugitive deputies to forfeit their seats and hand them to other party members.\n** WHO DECIDES IF PUIGDEMONT CAN BE PRESIDENTIAL CANDIDATE?\nOn Wednesday, lawmakers will be sworn in and elect their house’s president and the assembly’s committee.\nThe committee has the ultimate authority to decide whether Puigdemont is allowed to present himself as presidential candidate from Brussels, a move Madrid says it will contest in the courts.\nSince separatists have a majority in parliament they are likely to dominate the committee.\n** POTENTIAL FOR PROTRACTED CRISIS After Wednesday, more voting will be needed for Catalonia’s parliament to choose the region’s government and its president.\nThat could take up to two months if no candidate gets an absolute majority of votes.\nIf parties agree on a regional leader and it’s Puigdemont while he is still abroad, Madrid would declare the vote null and keep its control over the region.\nIf they fail to agree on Puigdemont or another candidate in that time frame, it’s back to square one with fresh regional elections.\nReporting by Ingrid Melander; Editing by Sonya Dowsett/Jeremy Gaunt\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T16:33:00.000+02:00", "crawled": "2018-01-17T10:48:25.040+02:00", "highlightTitle": ""}