{"organizations": [], "uuid": "b3b99ee2b89224a7a176609026d3f4b18b2d73a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-marathon-petroleum-corporation-announces-senior-leadership-appointments.html", "country": "US", "domain_rank": 767, "title": "Marathon Petroleum Corporation announces senior leadership appointments", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T17:15:00.000+02:00", "replies_count": 0, "uuid": "b3b99ee2b89224a7a176609026d3f4b18b2d73a7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-marathon-petroleum-corporation-announces-senior-leadership-appointments.html", "ord_in_thread": 0, "title": "Marathon Petroleum Corporation announces senior leadership appointments", "locations": [], "entities": {"persons": [{"name": "rick linhardt", "sentiment": "none"}, {"name": "partee", "sentiment": "none"}, {"name": "donald c. templin", "sentiment": "none"}, {"name": "brian k. partee", "sentiment": "none"}, {"name": "michael j. hennigan", "sentiment": "none"}, {"name": "timothy t. griffith", "sentiment": "none"}, {"name": "linhardt", "sentiment": "none"}], "locations": [{"name": "findlay", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "findlay", "sentiment": "none"}], "organizations": [{"name": "mpc", "sentiment": "negative"}, {"name": "marathon petroleum corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "business development", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FINDLAY, Ohio, Jan. 23, 2018 /PRNewswire/ -- Marathon Petroleum Corporation (NYSE: MPC) today announced the appointments of Brian K. Partee, currently director of Business Development, to vice president of Business Development, and Rick Linhardt, currently director of Tax, to vice president of Tax. Both positions are effective Feb. 1, 2018. Partee will report to Donald C. Templin, president of MPC, and Michael J. Hennigan, president of the general partner of MPLX LP (NYSE: MPLX), the master limited partnership sponsored by MPC. Linhardt will report to Timothy T. Griffith, senior vice president and chief financial officer of MPC. Both Partee and Linhardt will remain in Findlay.\nPartee joined MPC in 1995 as an accountant in Marathon Pipe Line. He progressed through increasingly responsible positions before being named territory manager in the Wholesale Marketing southern region in 2004, district sales manager in 2006 and coordinating manager in 2008. In 2009, Partee was named commercial director for Speedway. In 2012, he was named vice president, Business Development and Franchise at Speedway. He served as MPC's manager of crude oil logistics and analysis beginning in 2014 and assumed his current role in January 2017. Partee holds a bachelor's degree in accounting from Bowling Green State University and an MBA from the University of Findlay.\nLinhardt joined MPC in 2013 as manager of Tax Compliance with responsibility for the company's income tax, sales/use tax, property tax, trade and customs tax and motor fuels tax. He was named director of Tax in 2017. Linhardt has 30 years of tax experience in public accounting and the oil and gas industry, including an assignment as the head of the tax department at RRI Energy Inc., where he was instrumental in its merger with NRG Energy. He earned a bachelor's degree in accounting from the University of Kansas, and has been a certified public accountant since 1986.\n\"We are delighted to welcome Brian and Rick to our executive leadership team,\" said Gary R. Heminger, chairman and chief executive officer of MPC. \"They both have a wealth of experience and knowledge that will benefit our Business Development and Tax organizations.\"\nThe respective organizations led by Partee and Linhardt also provide services for MPLX.\nAbout Marathon Petroleum Corporation\nMPC is the nation's second-largest refiner, with a crude oil refining capacity of approximately 1.9 million barrels per calendar day in its six-refinery system. Marathon brand gasoline is sold through approximately 5,600 independently owned retail outlets across 20 states and the District of Columbia. In addition, Speedway LLC, an MPC subsidiary, owns and operates the nation's second-largest convenience store chain, with approximately 2,740 convenience stores in 21 states. Through subsidiaries, MPC owns the general partner of MPLX LP, a midstream master limited partnership. Primarily through MPLX, MPC owns, leases or has ownership interests in approximately 10,800 miles of crude oil and light product pipelines. Also through MPLX, MPC has ownership interests in gathering and processing facilities with approximately 5.9 billion cubic feet per day of gathering capacity, 8.2 billion cubic feet per day of natural gas processing capacity and 610,000 barrels per day of fractionation capacity. MPC's fully integrated system provides operational flexibility to move crude oil, NGLs, feedstocks and petroleum-related products efficiently through the company's distribution network and midstream service businesses in the Midwest, Northeast, East Coast, Southeast and Gulf Coast regions.\nView original content with multimedia: http://www.prnewswire.com/news-releases/marathon-petroleum-corporation-announces-senior-leadership-appointments-300586647.html\nSOURCE Marathon Petroleum Corporation", "external_links": ["http://www.prnewswire.com/news-releases/marathon-petroleum-corporation-announces-senior-leadership-appointments-300586647.html"], "published": "2018-01-23T17:15:00.000+02:00", "crawled": "2018-01-23T17:35:18.000+02:00", "highlightTitle": ""}