{"organizations": [], "uuid": "e83ef18c50e3a163beca5b21ec89094038edf529", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/05/104930658-Face-Tenderizer---courtesy-TSA-Instagram.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000739/device/rss/rss.html", "section_title": "Travel", "url": "https://www.cnbc.com/2018/01/05/tsa-releases-its-annual-list-of-top-banned-items.html", "country": "US", "domain_rank": 767, "title": "TSA releases its annual list of top banned items", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T20:00:00.000+02:00", "replies_count": 0, "uuid": "e83ef18c50e3a163beca5b21ec89094038edf529"}, "author": "Harriet Baskas", "url": "https://www.cnbc.com/2018/01/05/tsa-releases-its-annual-list-of-top-banned-items.html", "ord_in_thread": 0, "title": "TSA releases its annual list of top banned items", "locations": [], "entities": {"persons": [{"name": "bob", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "buffalo-niagara international airport", "sentiment": "none"}], "organizations": [{"name": "tsa", "sentiment": "negative"}, {"name": "transportation security administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Note to air passengers: Along with the list of prohibited items federal officials say you should never fly with, remember to leave things like inert grenades and throwing stars at home.\nLoaded guns, explosives and illegal narcotics are at the top of the list that the Transportation Security Administration asks travelers not to pack in their checked or carry-on bags. However, the TSA still encounters those items — and lots more — in passengers' luggage each year.\nThe agency documents many of the odd and offbeat items on its blog and Instagram feed throughout the year, and this week released a top 10 list of verboten items it found in 2017.\nIn a YouTube video, TSA's bearded, bespectacled \"Blogger Bob\" Burns ticks off the \"best of\" list of forbidden items in a countdown format.\nNo. 10 is an intimidating \"face tenderizer\" found in a carry-on bag at Buffalo-Niagara International Airport (BUF) in New York, which resembled a set of brass knuckles with a spiked facade used to tenderize meat.\nContinuing down the list, inert grenades were found tucked into a pair of sneakers in a checked bag at Milwaukee's General Mitchell International Airport; and then a menacing-looking pointed fidget spinner spotted in a carry-on bag at Savannah/Hilton Head International Airport in Georgia.\nAlso on the list: A small sculpture made with inert grenades, a throwing star, a scythe, \"Satan's\" pizza cutter, a bone knife and an umbrella that looks exactly like a rifle. Topping the list was festively wrapped narcotics found in a checked bag at Los Angeles International Airport.\nSource: TSA \"Some people travel with weird stuff because they are collectors: it's an heirloom, they have ADHD [attention deficit hyperactive disorder] and it's their fidget, or they want to use the item as a training aid in a seminar,\" said Jeff Price, an aviation security expert and professor at Metropolitan State University of Denver.\nStill, \"a lot of people who don't travel frequently just don't understand that some of these items can be used as weapons,\" he said.\nPassengers even have a hard time keeping known banned items at home, with firearms being wildly popular among seized items. As of Christmas Eve, the year's tally of firearms found at airport checkpoints was close to 3,900.\nNext week, TSA officials are expected to release their official tally of firearms found in 2017, but the current number already significantly exceeds the total of 3,391 detected at airport checkpoints during 2016. The TSA reported that most gun owners claim they just \"forgot\" a firearm was in the bag they took to the airport.\nAccording to TSA spokesman Mike England, one theory behind the increase in the number of firearms and banned items could be a function of more passengers at U.S. airports.\nDuring the 2017 holiday travel period alone (Dec. 15, 2017, through Jan. 2, 2018), the TSA said it screened more than 42 million passengers and more than 30.6 million checked bags — a record. \"More passengers equals more prohibited items,\" said England.\n— Harriet Baskas is the author of seven books, including \" Hidden Treasures: What Museums Can't or Won't Show You , \" and the Stuck at the Airport blog. Follow her on Twitter at @hbaskas . Follow Road Warrior at @CNBCtravel .", "external_links": [], "published": "2018-01-07T20:00:00.000+02:00", "crawled": "2018-01-07T20:44:20.012+02:00", "highlightTitle": ""}