{"organizations": [], "uuid": "d8e504a82952a9f9d8e2b900e47ce01a6c4bc1b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/spain-politics-catalonia/no-reason-why-i-cant-rule-catalonia-remotely-former-leader-says-idUSL8N1PE2EI", "country": "US", "domain_rank": 408, "title": "No reason why I can't rule Catalonia remotely, former leader says", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T19:40:00.000+02:00", "replies_count": 0, "uuid": "d8e504a82952a9f9d8e2b900e47ce01a6c4bc1b1"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/spain-politics-catalonia/no-reason-why-i-cant-rule-catalonia-remotely-former-leader-says-idUSL8N1PE2EI", "ord_in_thread": 0, "title": "No reason why I can't rule Catalonia remotely, former leader says", "locations": [], "entities": {"persons": [{"name": "carles puigdemont", "sentiment": "none"}, {"name": "puigdemont", "sentiment": "none"}, {"name": "mariano rajoy", "sentiment": "none"}], "locations": [{"name": "catalonia", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "catalunya radio", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MADRID, Jan 19 (Reuters) - The sacked former leader of Catalonia said on Friday he was perfectly eligible to be re-elected as regional president and there was no reason why he couldn’t rule the Spanish region remotely from self-imposed exile in Brussels.\nSupporters of Carles Puigdemont, who faces arrest for charges including sedition and rebellion if he returns to Spain, have suggested he could rule via video link -- earning him the sobriquet ‘the hologram president’ from detractors.\n“I am a member of parliament who is perfectly eligible as president,” Puigdemont told Catalunya Radio. “These days many big projects are handled with the use of new technologies.”\nReferring to the charges against him, he added: “You can’t rule from prison.”\nPuigdemont’s administration was dismissed by the central government in Madrid after he spearheaded a drive for the wealthy northeastern region to split from Spain that culminated in an October declaration of independence.\nHe regained his seat in the Catalan parliament in a Dec. 21 election that was called by Spanish Prime Minister Mariano Rajoy in the hope that pro-unity parties would win and resolve Spain’s worst political crisis in decades. That ploy backfired, with parties in favour of a split gaining a slim majority.\nPuigdemont moved to Brussels shortly after he was fired by Madrid but has said he would return to Catalonia if the Spanish government gave him certain “guarantees”, probably a promise not to arrest him.\nOther Catalan independence leaders including Oriol Junqueras, leader of the second-biggest separatist party in the regional parliament, are serving custodial sentences in Madrid for their roles in planning a banned independence referendum.\nUncertainty over the future of the region, which hosts Spain’s second-biggest city Barcelona and world-class factories for global brands like Volkswagen and Nestle , spooked investors and led to thousands of companies moving their registered headquarters elsewhere in Spain.\nThe Catalan parliamentary committee, which has a pro-independence majority, must decide by Jan. 31 if it will allow presidential candidates to present remotely. Madrid has said it will contest any such decision in the courts.\nPuigdemont would not clarify in Friday’s radio interview whether he would continue with plans to unilaterally construct an independent republic if elected regional president. But he said he planned to restore the previous administration.\n“There is no plan B: plan A is restoration because that is what the people have entrusted us with.” (Reporting by Sonya Dowsett and Immaculada Sanz; Editing by Catherine Evans)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T19:40:00.000+02:00", "crawled": "2018-01-20T17:41:06.002+02:00", "highlightTitle": ""}