{"organizations": [], "uuid": "aa6abbf1990483830c589746659edbe88abcf28e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-broward-health-appoints-new-vice-president-of-government-relations.html", "country": "US", "domain_rank": 767, "title": "Broward Health Appoints New Vice President of Government Relations", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-17T21:27:00.000+02:00", "replies_count": 0, "uuid": "aa6abbf1990483830c589746659edbe88abcf28e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-broward-health-appoints-new-vice-president-of-government-relations.html", "ord_in_thread": 0, "title": "Broward Health Appoints New Vice President of Government Relations", "locations": [], "entities": {"persons": [{"name": "diana arteaga", "sentiment": "negative"}, {"name": "diana", "sentiment": "none"}, {"name": "beverly capasso", "sentiment": "none"}, {"name": "arteaga", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "fort lauderdale", "sentiment": "none"}, {"name": "esq.", "sentiment": "none"}], "organizations": [{"name": "broward health", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FORT LAUDERDALE, Fla.--(BUSINESS WIRE)-- Broward Health has announced that Diana Arteaga, Esq. will become its new vice president of government relations.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180117006249/en/\nBroward Health has announced that Diana Arteaga, Esq. will become its new vice president of government relations. (Photo: Business Wire)\n“We are pleased to be welcoming Diana to oversee Broward Health’s legislative efforts,” said Broward Health interim president and CEO Beverly Capasso. “In today’s challenging healthcare environment, Diana’s deep knowledge of public policy issues combined with her leadership skills will be a significant asset to Broward Health as we work with our elected officials and other stakeholders. We continue to focus on enhancements to the quality and breadth of services provided to our community and reducing reliance on taxpayer subsidies.”\nArteaga will be responsible for the strategic leadership and oversight of the government relations and public affairs department. She will develop, implement and execute Broward Health’s strategic initiatives regarding public policy and legislative affairs on healthcare policies and issues.\nAn experienced attorney who specializes in governmental affairs, Arteaga was most recently the director of government relations for the City of Miami, the largest municipality of Miami-Dade County. Her efforts were recognized by the National League of Cities which appointed her to the Finance, Administration and Intergovernmental Relations Committee to advocate for the League's interests before the legislative and executive branches in Washington, D.C.\nShe has worked in federal, state and local government on matters ranging from policy development and strategic communications to legislative appropriations and advocacy. Additionally, she worked for Florida's Chief Financial Officer, Jeff Atwater, as a market manager, and for former U.S. Rep. Lincoln Diaz-Balart in Washington, D.C. as a foreign affairs advisor and legal counsel.\nShe earned her Juris Doctor degree from Florida International University College of Law and her Bachelor of Arts degree in political science/pre-law and Latin American studies from the University of Central Florida. She is a member of the Florida Bar. She has also served on the Florida Bar's Consumer Protection Law Committee and as an officer of the Miami-Dade Commission on Ethics & Public Trust.\nAbout Broward Health\nBroward Health, providing service for more than 75 years, is a nationally recognized system in South Florida that offers world-class healthcare to all.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180117006249/en/\nBroward Health\nMedia Contacts:\nDenise Moore, 954-634-2704\ndrmoore@browardhealth.org\nor\nEvClay Public Relations\nMelisa Chantres, +1-305-261-6222, Toll Free +1-877-261-6222\nmmchantres@evclay.com\nSource: Broward Health", "external_links": ["http://www.businesswire.com/news/home/20180117006249/en/"], "published": "2018-01-17T21:27:00.000+02:00", "crawled": "2018-01-17T21:09:08.017+02:00", "highlightTitle": ""}