{"organizations": [], "uuid": "5acdd9c2d52210d966c3dd7f9dbff75e4ea1c7d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 130, "shares": 130, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221079781&w=1200&r=LYNXMPEE0A0JV", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-iran-nuclear-eu/germany-urges-u-s-to-separate-iran-nuclear-deal-from-other-issues-idUSKBN1F00XN", "country": "US", "domain_rank": 408, "title": "Germany urges U.S. to separate Iran nuclear deal from other issues", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T11:11:00.000+02:00", "replies_count": 0, "uuid": "5acdd9c2d52210d966c3dd7f9dbff75e4ea1c7d8"}, "author": "", "url": "https://www.reuters.com/article/us-iran-nuclear-eu/germany-urges-u-s-to-separate-iran-nuclear-deal-from-other-issues-idUSKBN1F00XN", "ord_in_thread": 0, "title": "Germany urges U.S. to separate Iran nuclear deal from other issues", "locations": [], "entities": {"persons": [{"name": "philip blenkinsop", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "robin emmott", "sentiment": "none"}, {"name": "gabriel", "sentiment": "none"}, {"name": "sigmar gabriel", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (Reuters) - Britain, France and Germany called on Donald Trump on Thursday to uphold a pact curbing Iran’s nuclear ambitions on the eve of a sanctions ruling by the U.S. president they fear could torpedo an accord he has relentlessly criticized.\nHailed by its admirers as key to stopping Iran from building a nuclear bomb, the deal lifted economic sanctions in exchange for Tehran limiting its nuclear program. It was also signed by China, France, Russia, Britain, Germany and the European Union.\nThe U.S. Congress requires the president to periodically certify Iran’s compliance and issue a waiver to allow U.S sanctions to remain suspended. The next deadline is on Friday.\nIn sharp contrast to Trump’s view that the 2015 pact was “the worst deal ever negotiated”, the foreign ministers of the three countries and the EU’s top diplomat said there was no alternative to it and that sanctions should remain lifted.\n“We agree on this approach, we want to protect (the deal) against every possible decision that might undermine it,” Germany’s Sigmar Gabriel said alongside his French and British counterparts and EU foreign policy chief Federica Mogherini after meeting Iran’s Foreign Minister Mohammad Javad Zarif.\n“It is absolutely necessary to have this to prevent the development of nuclear weapons at a time when other parts of the world are discussing how to get them,” Gabriel said, later specifically mentioning North Korea in his remarks.\nTrump’s choice comes at a delicate time for Iran’s government, which faced protests over economic hardships and corruption that are linked to frustration among younger Iranians who hoped to see more benefits from the lifting of sanctions.\nThe meeting in Brussels was choreographed to send a message to Washington before Trump is due to decide whether to re-impose oil sanctions lifted under the deal. If that happens, Iran has said it would no longer be bound by the pact and could return to producing enriched uranium.\nZarif tweeted that the Brussels meeting had shown a “strong consensus” that Iran was complying with the pact, had the right to enjoy its economic benefits and “any move that undermines (it) is unacceptable”.\n“E3 (Germany, France and Britain) and EU fully aware that Iran’s continued compliance (is) conditioned on full compliance by the US,” Zarif added.\nBritain's Foreign Secretary Boris Johnson attends a news conference with French Foreign Minister Jean-Yves Le Drian, German counterpart Sigmar Gabriel and European Union's foreign policy chief Federica Mogherini after meeting Iran's Foreign Minister Mohammad Javad Zarif (unseen) in Brussels, Belgium January 11, 2018. REUTERS/Francois Lenoir European countries have benefited from renewed trade with Iran as sanctions have been lifted, while U.S. companies are still largely barred from doing business with the Islamic Republic due to other sanctions unrelated to the nuclear issue..\n“GOOD NEIGHBOUR”\n“The deal is working. It is delivering on its main goal which means keeping the Iranian nuclear program in check and under close surveillance,” Mogherini said, adding that the International Atomic Energy Agency had shown in nine reports that Iran is meeting its commitments.\nBritish Foreign Secretary Boris Johnson said the pact was also a way for Iran to show it was “a good neighbour” in the region by complying.\nSlideshow (5 Images) Trump formally rejected the deal in October, although the United States has not yet pulled out.\nThat major shift in U.S. policy put the United States at odds with its European allies, as well as Russia and China that are also signatories to the nuclear accord, in the most visible transatlantic split on foreign policy since the 2003 U.S. invasion of Iraq.\nEuropean governments are troubled by Trump’s “America first” rhetoric and inconsistent statements on NATO and the European Union, while they consider the Iran nuclear deal one of West’s the biggest diplomatic achievements in decades.\nIn a gesture to Trump, France’s Foreign Minister Jean-Yves Le Drian said Paris shared Washington’s concerns about Iran’s ballistic missile program and involvement in wars in Yemen and Syria, but stressed the nuclear deal should still stand.\n“We do not hide other disagreements, which exist ... both in the ballistic field and over Iran’s actions in the whole region,” Le Drian said.\nTehran has repeatedly vowed to continue building up its ballistic missile arsenal, one of the biggest in the Middle East, saying it is for defense purposes only. The West sees it as a threat and has installed a U.S.-built missile shield in southeastern Europe, under NATO command.\nGabriel said Zarif agreed at the Brussels meeting to discuss the issues in a more regular and structured way, but diplomats said there was no immediate timetable for talks.\nAdditional reporting by Robert-Jan Bartunek and Peter Maushagen; Editing by Robin Pomeroy, William Maclean\n ", "external_links": [], "published": "2018-01-11T11:11:00.000+02:00", "crawled": "2018-01-11T11:28:31.001+02:00", "highlightTitle": ""}