{"organizations": [], "uuid": "679b07a1e504ee84c76cc6fcac37587c54a4d2db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-wall-st-new-year-rally-pauses-as-healthcare-bank-stocks-weigh-idUSL4N1P33XT", "country": "US", "domain_rank": 408, "title": "US STOCKS-Wall St new year rally pauses as healthcare, bank stocks weigh", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-08T23:05:00.000+02:00", "replies_count": 0, "uuid": "679b07a1e504ee84c76cc6fcac37587c54a4d2db"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-wall-st-new-year-rally-pauses-as-healthcare-bank-stocks-weigh-idUSL4N1P33XT", "ord_in_thread": 0, "title": "US STOCKS-Wall St new year rally pauses as healthcare, bank stocks weigh", "locations": [], "entities": {"persons": [{"name": "sruthi shankar jan", "sentiment": "none"}, {"name": "peter cardillo", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "caterpillar", "sentiment": "negative"}, {"name": "first standard financial", "sentiment": "none"}, {"name": "fed", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Caterpillar opens at a record high after brokerage upgrade\n* Financials decline for the first time in four sessions\n* Dollar edges up on hopes of Fed rate hike\n* Indexes down: Dow 0.10 pct, S&P 0.12 pct, Nasdaq 0.06 pct (Updates to open)\nBy Sruthi Shankar\nJan 8 (Reuters) - The benchmark S&P 500 opened lower for the first time in 2018 on Monday, as losses in healthcare and financial stocks cut short Wall Street’s strongest start to a year in a decade.\nThe S&P and the Nasdaq last week recorded its strongest first four trading days in a year since 2006, and the Dow industrials posted its best since 2003.\n“We had a strong market in the past week, and what generally happens in the first week sets the trend for the remainder of the year. Now that it’s established, there could be some profit- taking,” said Peter Cardillo, chief market economist at First Standard Financial in New York.\nAt 9:41 a.m. ET (1441 GMT), the S&P 500 was down 2.84 points, or 0.10 percent, at 2,740.31.\nThe Dow Jones Industrial Average was down 31.55 points, or 0.12 percent, at 25,264.32, and the Nasdaq Composite was down 4.19 points, or 0.06 percent, at 7,132.37.\nThe Dow and the Nasdaq still eked out record highs briefly after open.\nThe dollar inched higher against a basket of major peers with data showing that slower U.S. jobs growth did little to dent expectations for further interest rate increases this year.\nComments by some Federal Reserve officials on Friday and over the weekend suggested the U.S. central bank remained on track to raise interest rates in 2018.\n“The dollar is reversing and we’re seeing that effect due to some Fed comments,” Cardillo said.\nA stronger dollar tends to weaken revenue of U.S. companies that earn much of its income from abroad.\nInvestors are waiting for earnings reports to see how much companies would benefit from the recent tax cuts. The fourth quarter earnings season will kick off later this week, starting with big banks.\nBank of America, Goldman Sachs, JPMorgan and Wells Fargo were down between 0.4 percent and 1 percent. Most big U.S. lenders have estimated one-off charges to their fourth quarter earnings on account of tax cuts.\nThe S&P healthcare index fell 0.5 percent and was the biggest decliner among major S&P sectors, led by 1.6 percent drop in AbbVie’s shares and a 1 percent fall in UnitedHealth‘s.\nCaterpillar climbed 0.9 percent to open at a record high after JP Morgan upgraded the stock saying the tax overhaul could help construction business cycle to extend into 2018.\nAmazon rose about 2 percent after Credit Suisse hiked its price target on the online retailer’s stock.\nShares of Nvidia climbed about 4 percent after the graphics chipmaker announced partnership with Uber and Volkswagen as its artificial intelligence platforms expand into technology for self-driving cars.\nPandora Media slipped about 8 percent after Morgan Stanley downgraded its stock to “equal-weight” on concerns about slowing advertising revenue in 2018.\nDeclining issues outnumbered advancers on the NYSE by 1,659 to 971. On the Nasdaq, 1,711 issues fell and 860 advanced.\nReporting by Sruthi Shankar in Bengaluru; Editing by Arun Koyyur\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T23:05:00.000+02:00", "crawled": "2018-01-09T17:04:35.008+02:00", "highlightTitle": ""}