{"organizations": [], "uuid": "f95a9ca35afd51c8478ac00988b2e90932b2bdc1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 199}, "facebook": {"likes": 223, "shares": 223, "comments": 1}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-458592308.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/30/steve-case-amazon-second-headquarters-entrepreneurship/", "country": "US", "domain_rank": 1196, "title": "Steve Case: Amazon HQ2 Cities Passed Over Should Focus on Startups | Fortune", "performance_score": 2, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.361, "site_type": "news", "published": "2018-01-30T02:00:00.000+02:00", "replies_count": 0, "uuid": "f95a9ca35afd51c8478ac00988b2e90932b2bdc1"}, "author": "Steve Case", "url": "http://fortune.com/2018/01/30/steve-case-amazon-second-headquarters-entrepreneurship/", "ord_in_thread": 0, "title": "Steve Case: Amazon HQ2 Cities Passed Over Should Focus on Startups | Fortune", "locations": [], "entities": {"persons": [{"name": "steve case", "sentiment": "negative"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "amzn", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Steve Case January 30, 2018 \nEver since Amazon (AMZN) announced that it would follow a formal request-for-proposal process to select the site of its second headquarters, tech and business commentators have debated the merits of one U.S. city vs. another for this Olympic-bid-like moment. Would it be New York, allowing the company to establish an East Coast presence in a city already flush with talent? Would it be Washington, D.C. because of its proximity to policymakers? Or, in a post-2016 presidential election world, would Amazon select a city in the heartland, acknowledging that great talent can be found between the coasts, and perhaps that big tech bears some responsibility in making our innovation economy more dispersed? \nNow, we know the answers to some of those questions. But as Amazon-watchers now turn to the 20 finalists, I would like to take a moment to address the other 218 cities that bid for the company’s attention. I understand you are disappointed that Amazon—and its estimated 50,000 jobs—is not coming to your city, but you can still get many of those jobs if you redirect your efforts to strengthening your startup community. Indeed, supporting dozens of startups—one of which could end up being the next Amazon—is likely the better strategy anyway. \nOne of the amazing, but less discussed, byproducts of Amazon’s contest is the way in which it brought people together. I’ve been traveling the country for the last four years on a series of Rise of the Rest bus tours to shine a spotlight on regional entrepreneurship. We’ve been to 33 cities, and in each one, people lament the challenges in connecting startup communities with traditional businesses, governments, and local investors. \nBut on our most recent tour to cities in Pennsylvania, Indiana, Michigan, Wisconsin, and Ohio, I noticed something had changed when people spoke about the Amazon HQ2 competition. At almost every stop, people wanted to discuss the Amazon bid, touting the unique plans and incentives their city offered. The contest galvanized communities in ways that can have a true and lasting impact for entrepreneurs. Instead of thinking of this as a loss, recognize that you have already created the groundwork for a different kind of victory. \nFirst, one of the things that makes coastal tech hubs so attractive is network density. In Silicon Valley, you can’t turn the corner without running into someone who can connect you with a customer, a coder, or a potential funder. That’s not the case for most entrepreneurs in the heartland. One solution is to broaden the aperture. Many of the cities that bid for Amazon’s attention joined forces with other municipalities to pitch a connected region. \nFor example, Detroit-based founder Dan Gilbert led a plan that not only included Detroit, but Ann Arbor, Mich. (with the University of Michigan) and a cross-border collaboration with Canada. In Central Pennsylvania, Harrisburg’s bid included neighboring Lancaster and York. These cross-city, county, and even border collaborations can help develop and attract the resources startup founders need. \nSecond, in many cities, the Amazon bid brought together unprecedented coalitions of government officials, startup community leaders, and corporate executives. In Chicago, a city that is still in the running, Mayor Rahm Emanuel joined with United Airlines CEO Oscar Munoz, former commerce secretary Penny Pritzker, and serial entrepreneurs Brad Keywell and Eric Lefkofsky. And in Baltimore, Mayor Catherine Pugh partnered with Under Armour CEO Kevin Plank and Johns Hopkins Technology Ventures. \nStartups account for nearly all net new job creation. In order to build the economies of the future, governments will need to have deeper and richer relationships with the startup community. Government policy can play an important role in spurring innovation economies by clearing regulatory hurdles, providing crucial resources or investments, and enacting entrepreneur-friendly tax incentives. \nAnd we can’t discount the role long-established corporations can play. In Columbus, Ohio, for example, 14 Fortune 1000 companies dot the region. They are critically important customers and partners for the startup community and can provide credibility to nascent ventures. These companies are also rewarded with the local talent a robust startup ecosystem attracts. \nFinally, what’s most exciting is seeing how all these initiatives can work together to accelerate the virtuous cycle of entrepreneurial activity. As cities nurture vibrant startup communities, they build the talent, infrastructure, and culture that attracts even more entrepreneurs. Each accomplishment generates more capital that can be reinvested in the next round of great ideas. \n\nFor instance, in Indianapolis, another Amazon HQ2 contender, Scott Dorsey and Chris Baggott, founders of ExactTarget, a company bought by Salesforce for $2.5 billion in 2013, did not retire from the community after the exit. Instead, they doubled down, creating new ventures and reinvesting in the next wave of entrepreneurs in the city. Their commitment helps one “win” beget dozens of success stories. \nSo, to all the cities disappointed about not making it to Amazon’s final 20, perhaps you already received your “golden ticket” and just didn’t know it. Perhaps this spirit of collaboration, initiated by a corporate bid, will turn out to be the start of the supportive network needed to build the entrepreneurial ecosystems of the future. \nSteve Case is the co-founder of AOL, the chairman and CEO of Revolution LLC, and the author of the best-selling book “The Third Wave: An Entrepreneur’s Vision of the Future.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-30T02:00:00.000+02:00", "crawled": "2018-01-31T13:35:44.014+02:00", "highlightTitle": ""}