{"organizations": [], "uuid": "f7434588775fa399c7a598cc2c7d68d0c5d2348e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/oil-prices-kemp/column-hedge-funds-pile-into-oil-despite-rising-risk-of-a-correction-kemp-idUSL8N1PO3QZ", "country": "US", "domain_rank": 408, "title": "COLUMN-Hedge funds pile into oil despite rising risk of a correction: Kemp", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T15:20:00.000+02:00", "replies_count": 0, "uuid": "f7434588775fa399c7a598cc2c7d68d0c5d2348e"}, "author": "", "url": "https://www.reuters.com/article/oil-prices-kemp/column-hedge-funds-pile-into-oil-despite-rising-risk-of-a-correction-kemp-idUSL8N1PO3QZ", "ord_in_thread": 0, "title": "COLUMN-Hedge funds pile into oil despite rising risk of a correction: Kemp", "locations": [], "entities": {"persons": [{"name": "john kemp", "sentiment": "negative"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Chart 2: tmsnrt.rs/2EkJBQA \nBy John Kemp \nLONDON, Jan 29 (Reuters) - Hedge funds continue to increase their bullish positions in oil, even as prices hit the highest level since the slump began in 2014, brushing aside concerns about overheated markets and the risk of a correction. \nHedge funds and other money managers raised their net long position in the six most important futures and options contracts linked to oil by 44 million barrels to a record of 1,484 million in the week to Jan. 23. \nPortfolio managers have raised their net long position in Brent, NYMEX and ICE WTI, U.S. gasoline, U.S. heating oil and European gasoil by the equivalent of 1,174 million barrels since the end of June. \nHedge funds are more bullish on the outlook for petroleum than at any time on record, even though benchmark Brent prices have already nearly tripled over the last two years ( tmsnrt.rs/2EifLfr ). \nThe ratio of hedge fund long positions to short positions has climbed to a record 11.51:1, up from a low of just 1.55 at the end of June. \nSince the start of 2015, such lopsided hedge fund positioning has usually preceded a sharp reversal in the recent price trend. \nBut most fund managers seem unconcerned about the threat of a short-term reversal because the medium-term fundamentals appear solid. \nOil consumption is growing rapidly as a result of synchronised growth in the major economies. OPEC and its allies have reiterated their commitment to output restraint. And global inventories are falling. \nPortfolio managers increased their bullish positions in every element of the petroleum complex in the week to Jan. 23. \nNet long positions rose in Brent (+14 million barrels), WTI (+8 million barrels), U.S. gasoline (+12 million), U.S. heating oil (+4 million) and European gasoil (+6 million). \nNet long positions are at record levels in every contract and in most contracts the ratio of long to short positions is at a multi-year highs. \nBrent prices are close to their 10-year average ($82 per barrel) and already above their average over the last complete cycle from 1998 to 2016 ($64). \nThe implication is that petroleum prices are no longer cheap but still have room to rise further as the price cycle matures in 2018 and 2019 ( tmsnrt.rs/2DIoGG6 and tmsnrt.rs/2EkJBQA ). \nOil consumption is expected to continue rising strongly thanks to fast growth in the global economy and world trade. \nThe principal risks come from an acceleration in U.S. shale drilling, declining compliance in OPEC and its allies, increased production from non-OPEC non-shale sources, or a deceleration in demand owing to rising prices. \nNone of these risks appears likely to materialise imminently but they will all increase the higher that oil prices rise. \nAs with almost all relationships in the oil market, the relationship between these risks and oil prices is highly non-linear. \nRisks will increase even faster than prices. The higher prices rise, the greater the risk from increased shale and non-shale drilling, the greater the chance of non-compliance and the more likely demand will slow. \nThe other source of risk comes from within the market itself. The higher prices rise the greater the temptation for hedge fund managers to try to realise some profits by selling a proportion of their long positions. \nThe extremely lopsided positioning of the hedge funds and other money managers in the oil market has created a significant source of fragility. \nFragility does not mean a correction will happen soon, but it does increase the probability even a small increase in production or slowdown in consumption could trigger a relative large downward movement in prices. \nRelated columns: \n“Hedge fund trade in oil becomes very crowded”, Reuters, Jan. 22 \n“OPEC’s focus on stocks risks prices overshooting”, Reuters, Jan. 3 \n“Hedge funds gamble OPEC will tighten oil market too much”, Reuters, Jan. 2 Editing by David Evans", "external_links": [], "published": "2018-01-29T15:20:00.000+02:00", "crawled": "2018-01-29T15:50:36.003+02:00", "highlightTitle": ""}