{"organizations": [], "uuid": "98a579766575a3e04fe53ba6f252782276e45c89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/oil-prices-kemp/column-rpt-hedge-fund-trade-in-oil-becomes-very-crowded-kemp-idUSL8N1PH44B", "country": "US", "domain_rank": 408, "title": "COLUMN-RPT-Hedge fund trade in oil becomes very crowded - Kemp", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T03:00:00.000+02:00", "replies_count": 0, "uuid": "98a579766575a3e04fe53ba6f252782276e45c89"}, "author": "", "url": "https://www.reuters.com/article/oil-prices-kemp/column-rpt-hedge-fund-trade-in-oil-becomes-very-crowded-kemp-idUSL8N1PH44B", "ord_in_thread": 0, "title": "COLUMN-RPT-Hedge fund trade in oil becomes very crowded - Kemp", "locations": [], "entities": {"persons": [{"name": "kemp", "sentiment": "negative"}, {"name": "john kemp", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "kemp reuters", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(John Kemp is a Reuters market analyst. The views expressed are his own. Repeats Monday’s column with no changes)\n* Chartbook: tmsnrt.rs/2DpAcpw\nBy John Kemp\nLONDON, Jan 22 (Reuters) - Hedge funds added to their record bullish positions in petroleum in the week to Jan. 16, continuing the recent wave of buying, but the extra long positions were almost entirely confined to U.S. crude rather than Brent or refined fuels.\nHedge funds and other money managers increased their net long position in the six most important futures and options contracts linked to crude and fuels by a total of 41 million barrels.\nThe net long position in Brent, NYMEX and ICE WTI, U.S. gasoline, U.S. heating oil and European gasoil contracts has surged by a massive 1,130 million barrels since the end of June 2017.\nSince the start of the year, however, most of the increase has come from WTI rather than Brent or refined fuels, according to position data released by regulators and exchanges ( tmsnrt.rs/2DpAcpw ).\nTotal net long positions in petroleum have risen by 109 million barrels in the two most recent weeks, with WTI accounting for 87 million barrels.\nThe remainder has mostly come from U.S. gasoline, where hedge funds have boosted their net long position by almost 15 million barrels.\nNet positions in Brent, U.S. heating oil and European gasoil are near record highs but have changed little since the start of the year.\nThere is an element of catching up in the position-building in WTI, which has traded at a large and persistent discount to Brent since July and was shunned by portfolio managers until recently.\nThe hedge funds’ net long position in WTI increased from 455 million barrels to 542 million barrels between Jan. 2 and Jan 16 compared with only a minor increase in Brent.\nAs a result, the net position in WTI has now risen by 385 million barrels since the end of June, comparable to the increase of 371 million barrels in Brent.\nWTI position-building has corresponded with a narrowing of the prompt Brent-WTI premium, which has fallen from a high of almost $6.50 per barrel towards the end of last year to less than $5.30.\nBut across the petroleum complex as a whole, hedge fund positions look increasingly stretched, with fund managers holding almost 10.5 long positions for every short one.\nExperience suggests such lopsided positions, either long or short, are normally followed by a sharp reversal in prices when some portfolio managers attempt to realise their profits.\nOPEC and non-OPEC ministers have sought to validate the bullish narrative by insisting they remain committed to tightening the oil market through 2018 and plan to continue their cooperation in 2019.\nMany hedge fund managers are betting OPEC will risk tightening the market too much and cause prices to overshoot before eventually correcting, rather than tighten it too little and allow prices to fall back.\nThis seems a fair assessment of OPEC’s strategy in the short term – even if it risks creating more price instability later in 2018 and in 2019.\nBut the enormous hedge fund long position remains a source of fragility.\nHedge funds hold almost 1.6 billion barrels of long positions across the six major contracts, an increase of more than 80 percent since June.\nIf and when portfolio managers try to realise their profits and liquidate some of those positions, there are few obvious immediate buyers.\nRelated columns:\n“Hedge funds have left the oil market looking very stretched”, Reuters, Jan. 16\n“OPEC’s focus on stocks risks prices overshooting”, Reuters, Jan. 3\n“Hedge funds gamble OPEC will tighten oil market too much”, Reuters, Jan. 2 (Editing by Kevin Liffey)\n ", "external_links": [], "published": "2018-01-23T03:00:00.000+02:00", "crawled": "2018-01-23T03:23:15.014+02:00", "highlightTitle": ""}