{"organizations": [], "uuid": "7346726a44d2a0e0786197fc5c539c603757a5ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 31, "shares": 31, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/afghanistan-blast/blast-hits-afghan-capital-kabul-reuters-witnesses-idINKBN1FG08J", "country": "US", "domain_rank": 408, "title": "Blast hits Afghan capital Kabul - Reuters witnesses", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T10:39:00.000+02:00", "replies_count": 0, "uuid": "7346726a44d2a0e0786197fc5c539c603757a5ab"}, "author": "", "url": "https://in.reuters.com/article/afghanistan-blast/blast-hits-afghan-capital-kabul-reuters-witnesses-idINKBN1FG08J", "ord_in_thread": 0, "title": "Blast hits Afghan capital Kabul - Reuters witnesses", "locations": [], "entities": {"persons": [{"name": "nick macfie", "sentiment": "none"}, {"name": "james mackenzie", "sentiment": "none"}], "locations": [{"name": "kabul", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "intercontinental hotel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KABUL (Reuters) - A bomb hidden in an ambulance killed at least 95 people and wounded about 158 in the Afghan capital Kabul on Saturday when it blew up at a police checkpoint in a busy part of the city that was crowded with pedestrians at the time of the attack.\nThe Taliban claimed responsibility for the suicide blast, a week after they claimed an attack on the Intercontinental Hotel in which more than 20 people were killed.\nAn interior ministry spokesman blamed the Haqqani network, a militant group affiliated with the Taliban which Afghan and Western officials consider to be behind many of the biggest attacks on urban targets in Afghanistan.\nAs medical teams struggled to handle the casualties pouring in, some of the wounded were laid out in the open, with intravenous drips set up next to them in hospital gardens.\n“It’s a massacre,” said Dejan Panic, coordinator in Afghanistan for the Italian aid group Emergency, which runs a nearby trauma hospital that treated dozens of wounded.\nHours after the blast, a health ministry spokesman said the casualty toll had risen to at least 95 killed and 158 wounded.\nThe latest attack will add pressure on President Ashraf Ghani and his U.S. allies, who have expressed growing confidence that a new more aggressive military strategy has succeeded in driving Taliban insurgents back from major provincial centres.\n“Today’s attack is nothing short of an atrocity, and those who have organized and enabled it must be brought to justice and held to account,” Tadamichi Yamamoto, head of the United Nations Assistance Mission in Afghanistan, said in a statement.\nThe United States has stepped up its assistance to Afghan security forces and increased its air strikes against the Taliban and other militant groups, aiming to break a stalemate and force the insurgents to the negotiating table.\nHowever, the Taliban have dismissed suggestions they have been weakened by the new strategy, and the past week has shown their capacity to mount deadly, high-profile attacks is undiminished, even in the heavily protected centre of Kabul.\nThe U.S.-led international force in Afghanistan vowed its support for the Afghan government and armed forces in their “difficult and dangerous work”, adding that none of its members had been killed or wounded in the blast.\nAfghan security forces members and civilians assist the injured after a blast in Kabul, Afghanistan January 27, 2018. REUTERS/Mohammad Ismail AMBULANCE AT CHECKPOINT Saturday is a working day in Afghanistan and the streets were full when the blast went off at around lunchtime in a busy part of the city close to shops and markets and near a number of foreign embassies and government buildings.\nMirwais Yasini, a member of parliament who was nearby when the explosion occurred, said an ambulance approached the checkpoint and blew up. The target was apparently an interior ministry building but the victims were mainly people who happened to be in the street.\nSlideshow (13 Images) Buildings hundreds of metres away were shaken by the force of the blast, which left torn bodies strewn on the street amid piles of rubble, debris and wrecked cars.\nThe casualty toll is the worst since 150 people were killed in a truck bomb explosion last May near the German embassy, an attack that prompted a major reinforcement of security aimed at preventing similar vehicle-borne attacks.\nWith much of central Kabul now a heavily fortified zone of high concrete blast walls and police checkpoints, there were angry questions about how the bomber had been able to get through and set off the blast.\n“Officials must be held responsible,” said former deputy Interior Minister Mohammad Ayub Salangi.\nPeople helped walking-wounded away as ambulances with sirens wailing inched their way through the traffic-clogged streets of the city centre.\n“I was sitting in the office when the explosion went off,” said Alam, an office worker whose head was badly cut in the blast.\n“All the windows shattered, the building collapsed and everything came down.”\nThe Swedish and Dutch embassies as well as the European Union mission and an Indian consular office are also nearby but there were no reports that any of their staff had been hurt in the attack.\nAdditional reporting by Yeganeh Torbati in WASHINGTON; Writing by James Mackenzie; Editing by Robert Birsel and Jeremy Gaunt\n ", "external_links": [], "published": "2018-01-27T10:39:00.000+02:00", "crawled": "2018-01-27T10:55:50.066+02:00", "highlightTitle": ""}