{"organizations": [], "uuid": "be1a42a0bff55b04551ef1e5d12b2e8d1ccf5c58", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/04/104876810-GettyImages-883237098.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/16/us-stock-futures-dow-fed-speeches-earnings-data-and-politics-on-the-agenda.html", "country": "US", "domain_rank": 767, "title": "US stock futures: Dow, Fed speeches, earnings, data, and politics on the agenda", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-16T13:11:00.000+02:00", "replies_count": 0, "uuid": "be1a42a0bff55b04551ef1e5d12b2e8d1ccf5c58"}, "author": "Alexandra Gibbs", "url": "https://www.cnbc.com/2018/01/16/us-stock-futures-dow-fed-speeches-earnings-data-and-politics-on-the-agenda.html", "ord_in_thread": 0, "title": "US stock futures: Dow, Fed speeches, earnings, data, and politics on the agenda", "locations": [], "entities": {"persons": [{"name": "michael nagle", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "comerica", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "dow", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "citigroup", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "csx", "sentiment": "none"}, {"name": "empire state manufacturing", "sentiment": "none"}, {"name": "unitedhealth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. stocks closed lower on Tuesday, pulling back from record highs set earlier in the session, as investors weighed the possibility of a government shutdown.\nThe Dow Jones industrial average ended 10.33 points lower at 25,792.86. At its session highs, the index traded above 26,000 and 283 points higher. The Dow also posted its biggest one-day reversal since Feb. 10, 2016.\nThe S&P 500 closed 0.4 percent lower at 2,776.42. The index had traded above 2,800 for the first time earlier in the session. The Nasdaq composite also erased gains, finishing 0.5 percent lower at 7,223.69.\nCongress needs to pass a spending bill by the end of Friday to avoid a government shutdown. A point of contention between Republicans and Democrats is an immigration bill which Democrats want to pass. Those talks have complicated efforts to keep the government open.\n\"Key Democratic constituencies are demanding that Congressional Democrats insist on making DACA part of the 'must pass' budget legislation to keep the government open,\" said L. Thomas Block, Washington policy strategist at Fundstrat Global Advisors.\n\"DACA is actually the easy issue for a budget compromise. More difficult is needed legislation to avoid defense and non-defense spending cuts under the sequestration required by the Budget Act of 2011,\" Block said.\nThe Cboe Volatility index, which is considered to be the best gauge of fear in the market, rose 14.5 percent to 11.63.\nHistorically, stocks have struggled immediately after a government shutdown. The S&P 500 averages a negative return of 0.3 percent one week after the government shuts down, according to CNBC analysis using Kensho.\n\"I think the market has been conditioned to a last minute deal. I think the market can actually continue to focus on the earnings,\" said Quincy Krosby, chief market strategist at Prudential Financial. \"Anything that throws that off is going to be a net negative for the market but because it will be indicative of ability of the two sides together to get there, and that will be a deeper concern.\"\nEquities were boosted earlier by better-than-expected earnings and rising economic optimism under President Donald Trump.\nUnitedHealth posted better-than-expected earnings and sales, sending the stock up 1.9 percent. Citigroup reported adjusted earnings that surpassed estimates, while revenue came in line with expectations. Citigroup shares rose 0.4 percent.\nEarnings season is off to a strong start thus far. Of the S&P 500 companies that had reported as of Friday, 69 percent have surpassed earnings-per-share estimates while 85 percent have beaten expectations on the top line, according to FactSet.\nEquities are off to a strong start for the year, with the Dow, S&P 500 and Nasdaq composite jumping at least 3.8 percent in 2018. A stronger U.S. economy, tax reform, and optimism maid the corporate earnings season have been key catalysts for the market.\n\"The boring stock market of 2017 has turned on the burners two weeks into the new year,\" said Frank Cappelleri, executive director at Instinet, noting the S&P 500 was on track to post its first monthly gain of more than 4 percent since March 2016.\n\"Regardless if the [S&P 500] finishes January with a 4% gain or not, this just tells us once again that strength does, in fact, beget more strength. It also means we shouldn't cast doubt on the uptrend simply because the advance has gained steam recently,\" Cappelleri said in a note.\nThe major averages closed at record highs on Friday. U.S. markets were closed on Monday because of the Martin Luther King holiday.\nThe euro, meanwhile, hovered near a three-year peak amid heightened expectations the European Central Bank may soon pare its monetary stimulus. The U.S. dollar had been showing some signs of weakness in recent sessions.\nElsewhere, Merck shares jumped 5.8 percent after announcing positive Phase 3 results for its Keytruda drug, which is aimed at treating cancer.\nDisclosure: NBCUniversal, parent of CNBC, is a minority investor in Kensho.\n—CNBC's Patti Domm and Robert Hum contributed to this report.", "external_links": [], "published": "2018-01-16T13:11:00.000+02:00", "crawled": "2018-01-16T13:36:54.030+02:00", "highlightTitle": ""}