{"organizations": [], "uuid": "83f79a97c37686946ab169f7327fe18789791ff3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/business-wire-interlink-electronics-inc-appoints-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "Interlink Electronics, Inc. Appoints Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-11T00:15:00.000+02:00", "replies_count": 0, "uuid": "83f79a97c37686946ab169f7327fe18789791ff3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/business-wire-interlink-electronics-inc-appoints-chief-financial-officer.html", "ord_in_thread": 0, "title": "Interlink Electronics, Inc. Appoints Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "steven n. bronson", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "burnett", "sentiment": "none"}, {"name": "david s. burnett", "sentiment": "none"}], "locations": [{"name": "westlake village", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "interlink electronics, inc", "sentiment": "neutral"}, {"name": "interlink electronics, inc.", "sentiment": "neutral"}, {"name": "bkf capital group", "sentiment": "none"}, {"name": "interlink", "sentiment": "none"}, {"name": "bkf capital group, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WESTLAKE VILLAGE, Calif.--(BUSINESS WIRE)-- Interlink Electronics, Inc. (NASDAQ: LINK), a global technology leader and trusted advisor in Human Machine Interface (HMI) solutions, announced today that David S. Burnett has rejoined the company as its Chief Financial Officer. Mr. Burnett will be responsible for overseeing all financial and administrative functions that drive performance improvement and allow Interlink to invest in new and existing products and technologies.\n“We are pleased to have David return to the Interlink executive team. His strong leadership skills, combined with a solid financial pedigree bring a strategic view to a critical function; one that allows us to work as a focused team and drive innovative solutions to the marketplace,” said Steven N. Bronson, CEO of Interlink Electronics, Inc.\nIn addition to being named Chief Financial Officer at Interlink, Mr. Burnett was also appointed Chief Financial Officer of BKF Capital Group, Inc. (OTC PINK: BKFG). BKF Capital Group owns 11.93% of Interlink, as well as other portfolio investments. Mr. Burnett will divide his time between the entities.\nMr. Burnett brings over 27 years of diverse financial experience to Interlink, where he will serve our primary stakeholders of investors, customers and team members. Mr. Burnett was Chief Financial Officer of Interlink from August 2016 – April 2017, and has continued to serve in a consulting capacity since leaving. During the interim period, Mr. Burnett was Chief Financial Officer of privately-held Palmetto Clean Technology, Inc. Prior to joining Interlink the first time, Mr. Burnett served in various management positions with EnPro Industries, Inc. (NYSE: NPO), most recently Vice President and Treasurer. Before EnPro, his history includes a long stint as a Director at PricewaterhouseCoopers LLP and Senior Manager at Grant Thornton LLP. Mr. Burnett received his Bachelor of Science in Business Administration (Accounting) from Old Dominion University, and a Masters of Science in Taxation from Golden Gate University. He is both a Certified Public Accountant and a Certified Treasury Professional.\n“I am thrilled to be coming home to Interlink Electronics and look forward to developing a strong growth strategy around the company’s technologies, as well as seeking inorganic growth opportunities that exist in this exciting sector,” said Mr. Burnett. He continues, “Interlink Electronics has been a leader in the printed electronics industry for many years and continues to develop innovative HMI solutions. I am confident that we will link the company’s goals to sound financial performance, risk management and operational effectiveness.”\nAbout Interlink Electronics, Inc.\nInterlink Electronics is a world-leading trusted advisor and technology partner in the advancing world of human-machine interface and force-sensing technologies. Interlink Electronics has led the printed electronics industry in its commercialization of its patented Force-Sensing Resistor (FSR®) technology, which has enabled rugged and reliable human-machine interface (HMI) solutions. For over 30 years, Interlink Electronics' solutions have focused on handheld user input, menu navigation, cursor control, and other intuitive interface technologies for the world's top electronics manufacturers. Interlink Electronics has a proven track record of supplying human-machine interface solutions for mission-critical applications in a wide range of markets, including, but not limited to, consumer electronics, automotive, industrial, and medical devices. Interlink Electronics serves a world-class customer-base from its corporate headquarters in Westlake Village, California (greater Los Angeles area), global research and development center in Singapore, printed-electronics factory in China, global distribution and warehouse facility in Hong Kong, and offices in North Carolina and Japan. For more information, please see our website at www.interlinkelectronics.com .\nForward Looking Statements\nThis release contains forward-looking statements made in reliance upon the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements include, but are not limited to, the Company’s views on future financial performance, market growth, new customers, and new product introductions, and are generally identified by phrases such as “thinks,” “anticipates,” “believes,” “estimates,” “expects,” “intends,” “plans,” and similar words. Forward-looking statements are not guarantees of future performance and are inherently subject to uncertainties and other factors which could cause actual results to differ materially from the forward-looking statement. These statements are based upon, among other things, assumptions made by, and information currently available to, management, including management’s own knowledge and assessment of the Company’s industry, R&D initiatives, competition and capital requirements. Other factors and uncertainties that could affect the Company’s forward-looking statements include, among other things, the following: our success in predicting new markets and the acceptance of our new products; efficient management of our infrastructure; the pace of technological developments and industry standards evolution and their effect on our target product and market choices; the effect of outsourcing technology development; changes in the ordering patterns of our customers; a decrease in the quality and/or reliability of our products; protection of our proprietary intellectual property; competition by alternative sophisticated as well as generic products; continued availability of raw materials for our products at competitive prices; disruptions in our manufacturing facilities; risks of international sales and operations including fluctuations in exchange rates; compliance with regulatory requirements applicable to our manufacturing operations; and customer concentrations. These and other risks are more fully described in the Company’s filings with the Securities and Exchange Commission, including the Company’s most recently filed Annual Report on Form 10-K, which should be read in conjunction herewith for a further discussion of important factors that could cause actual results to differ materially from those in the forward-looking statements. The Company undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180110006238/en/\nInterlink Electronics, Inc.\nSteven N. Bronson, CEO\n805-416-7004\nir@iefsr.com\nSource: Interlink Electronics, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.interlinkelectronics.com&esheet=51741517&newsitemid=20180110006238&lan=en-US&anchor=www.interlinkelectronics.com&index=1&md5=62b32c68cb9782fa42e3b7b38610ef64", "http://www.businesswire.com/news/home/20180110006238/en/"], "published": "2018-01-11T00:15:00.000+02:00", "crawled": "2018-01-11T01:30:32.001+02:00", "highlightTitle": ""}