{"organizations": [], "uuid": "dba57e0a6311fe968e1701fd5e1b2f6f127e765b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220643806&w=1200&r=LYNXMPEE081J6", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-immigration-protections-family/salvadorans-say-going-home-not-an-option-after-u-s-axes-protection-idUSKBN1EY2MO", "country": "US", "domain_rank": 408, "title": "Salvadorans say going home not an option after U.S. axes protection", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T23:39:00.000+02:00", "replies_count": 0, "uuid": "dba57e0a6311fe968e1701fd5e1b2f6f127e765b"}, "author": "", "url": "https://www.reuters.com/article/us-usa-immigration-protections-family/salvadorans-say-going-home-not-an-option-after-u-s-axes-protection-idUSKBN1EY2MO", "ord_in_thread": 0, "title": "Salvadorans say going home not an option after U.S. axes protection", "locations": [], "entities": {"persons": [{"name": "joseph ax", "sentiment": "none"}, {"name": "munoz", "sentiment": "none"}, {"name": "mica rosenberg", "sentiment": "none"}, {"name": "luis munoz", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "hachi", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "n.j.", "sentiment": "none"}, {"name": "red bank", "sentiment": "none"}, {"name": "el salvador", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "belize", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "red bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 9:32 PM / Updated 3 minutes ago Salvadorans say going home not an option after U.S. axes protection Joseph Ax , Mica Rosenberg 5 Min Read \nRED BANK, N.J. (Reuters) - Three decades after fleeing civil war in his native El Salvador, Luis Munoz has built a life for himself in the New Jersey coastal town of Red Bank, working as a mechanic and raising three children with his wife. \nNow Munoz and his adult kids may face deportation in 2019 along with around 200,000 other Salvadorans, after the Trump administration said on Monday they would no longer have legal protection under a program known as Temporary Protected Status (TPS). \n“I cannot go back to my country,” Munoz, 58, said on Monday evening, sitting on the couch with his bichon frise dog, Hachi, in the apartment he shares with his wife, an immigrant from Belize. \nNot only did he get death threats before he left El Salvador in the 1980s, he said, but current gang violence makes going back too dangerous and the ailing economy offers few opportunities. \nSalvadoran families across the United States faced an anguished choice, with those like Munoz saying a return to their crime-ravaged country was not an option. \nMany had feared an end to their protected status after the Trump administration cut TPS for Nicaraguans and Haitians as part of its broader push to tighten immigration laws. \nTPS, which began in 1990, offers protection from deportation to immigrants already in the United States, including those who entered illegally, from countries affected by natural disasters, civil conflicts and other problems. \nSalvadorans were admitted following a pair of destructive earthquakes in 2001. U.S. officials on Monday said TPS by definition was not intended to become permanent and that the unsafe conditions created by the earthquakes no longer exist. They said the protections would expire for Salvadorans in September 2019. \nMany of the recipients were not affected by the earthquakes but took advantage of the program to gain legal status. \nRicardo Lemus, 38, crossed the Mexican border with his brother in 1997. As a legal immigrant under TPS, he has started his own hardwood flooring company in Rockland County, New York. He said he had put expansion plans on hold while he determined whether he would lose his business. \n“I don’t have any options,” said Lemus, who has three American-born daughters and is not willing to take them to a country they have never known. “I‘m not sure yet what I can do.” Luis Munoz from EL Salvador speaks during an interview with media at his home in Red Bank, New Jersey, U.S., January 8, 2018. REUTERS/Eduardo Munoz \nElba Perlera, 47, came to the United States illegally in 1997. As a single mother, she intended to work for a few years in the United States to earn money and then return to her young son, whom she left with her mother. \nBut once she arrived, she said, it became more difficult to return. She found work as a janitor, got married and had another child. \nHer son, now 22, made it to the United States at age 15 after gangs threatened him at his school and works in construction. Her U.S.-born 11-year-old daughter wrote a handwritten letter to lawmakers earlier this year pleading with them to protect TPS for the sake of her parents. \nBoth Perlera and her Salvadoran husband were granted TPS status in 2001, allowing them to get driver’s licenses, work permits and better jobs. Slideshow (4 Images) \n“Now with this decision we could lose all that,” she said. \nShe hopes Congress passes a legislative solution and plans to make her case to lawmakers in Washington. She had no wish to return to El Salvador. \n“Life there is not easy, and the government is not prepared to take people back,” she said. \nLike Lemus and Perlera, Munoz was not an earthquake victim. At the time of the disasters, he was already in the United States, having entered from Belize legally on a tourist visa and then overstaying his time before applying to TPS. \nHis children, who were born in Belize and have TPS protection, have virtually no connection with the country they may soon be forced to repatriate to. \n“Basically they would return to a world they do not know,” Munoz said. \nMunoz fled El Salvador in the 1980s as a student, at a time when many of his classmates were arrested or killed by the army for suspected ties to leftist guerrillas. A day after a friend was killed, Munoz’s brother, who was in the army, called to warn him that he would be next. \n“There are too many sad memories for me there - all my friends, my schoolmates were murdered just because they were young,” Munoz said. “They stopped the war but they were not able to establish peace or security. No one would say it is better off now.” Reporting by Joseph Ax and Mica Rosenberg; Editing by Andrew Hay", "external_links": [], "published": "2018-01-09T23:39:00.000+02:00", "crawled": "2018-01-09T23:47:43.017+02:00", "highlightTitle": ""}