{"organizations": [], "uuid": "564bac13347bf7747e34c8666a46f784c4c848b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-peninsula-orthopaedic-announces-david-davies-as-new-ceo.html", "country": "US", "domain_rank": 767, "title": "Peninsula Orthopaedic Announces David Davies As New CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T17:00:00.000+02:00", "replies_count": 0, "uuid": "564bac13347bf7747e34c8666a46f784c4c848b8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-peninsula-orthopaedic-announces-david-davies-as-new-ceo.html", "ord_in_thread": 0, "title": "Peninsula Orthopaedic Announces David Davies As New CEO", "locations": [], "entities": {"persons": [{"name": "david davies", "sentiment": "negative"}, {"name": "brian mathias", "sentiment": "none"}, {"name": "thomas brandon", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "pasquale petrera", "sentiment": "none"}, {"name": "davies", "sentiment": "none"}], "locations": [{"name": "md.", "sentiment": "none"}, {"name": "salisbury", "sentiment": "none"}, {"name": "delmarva peninsula", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "peninsula orthopaedic associates", "sentiment": "negative"}, {"name": "poa", "sentiment": "none"}, {"name": "university orthopedics center in state college", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SALISBURY, Md., Jan. 9, 2018 /PRNewswire/ -- Peninsula Orthopaedic Associates (POA) is pleased to announce the appointment of David Davies as the organization's new chief executive officer, succeeding past CEO Brian Mathias, who led POA for the last ten years.\n\"David is uniquely qualified to lead our evolving organization into the future,\" said Dr. Pasquale Petrera, head of the search committee. \"His demonstrated strategic leadership abilities, enthusiasm and prior healthcare experience, in both a large group orthopaedic practice and regional health system, make him the perfect fit for our ongoing commitment to the people of the Delmarva Peninsula.\"\nDr. Thomas Brandon, president of POA, added, \"David is a dynamic leader with a passion for quality, innovation and excellence and is a wonderful addition to our team and our forward-focused vision for POA.\"\nDavies joins POA from University Orthopedics Center in State College, Pennsylvania, where he served as CEO, a position he held since 1998. While there, David is credited with a long list of accomplishments, from building an integrated multiple-site physical therapy practice to directing the design and construction of two AAAHC accredited ambulatory surgical facilities to provide increased access to the area's growing need for high-quality orthopaedic surgical services and care.\nIn addition, Davies' prior leadership role as CEO of Mercy Regional Health System in Altoona, Pennsylvania, a 182-bed flagship hospital and regional referral facility for oncology, spine care, vascular, geriatric psychiatry and rehabilitation services, greatly shaped his deep understanding of the importance of consistently delivering exceptional patient experiences and quality outcomes.\n\"It is a true honor to be selected as the next leader of POA,\" said Davies. \"This is an outstanding organization with a long history of excellence. In coming here, I know I have joined a team that together will continue its steadfast focus on delivering a level of orthopaedic care and rehabilitation services to the communities we serve normally reserved for academic medical centers.\"\nAbout Peninsula Orthopaedic Associates\nPeninsula Orthopaedic Associates is a multi-specialty orthopaedic practice that has been offering communities across the Delmarva Peninsula an expansive continuum of orthopaedic services for over 50 years. With offices in Berlin and Salisbury, Maryland and Millsboro and Seaford, Delaware, as well as the Surgical Center in Salisbury, POA provides comprehensive orthopaedic care and expertise in foot and ankle, hand, hip and knee, shoulder and elbow, spine, sports medicine, joint replacement, joint preservation, orthopaedic trauma care, performance enhancement and rehabilitation, and biologic solutions.\nFor further information contact:\nJessica Ennis\n(410) 860-4506\njennis@peninsulaortho.com\nView original content: http://www.prnewswire.com/news-releases/peninsula-orthopaedic-announces-david-davies-as-new-ceo-300579473.html\nSOURCE Peninsula Orthopaedic Associates", "external_links": ["http://www.prnewswire.com/news-releases/peninsula-orthopaedic-announces-david-davies-as-new-ceo-300579473.html"], "published": "2018-01-09T17:00:00.000+02:00", "crawled": "2018-01-09T19:03:09.019+02:00", "highlightTitle": ""}