{"organizations": [], "uuid": "516fbd18b24351cc85d48e85a3adb64e008b4b4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220807861&w=1200&r=LYNXMPEE090NQ", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-ivorycoast-military/soldiers-loot-arms-burn-military-base-in-ivory-coasts-second-city-idUSKBN1EZ18P", "country": "US", "domain_rank": 408, "title": "Soldiers loot arms, burn military base in Ivory Coast's second city", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T13:55:00.000+02:00", "replies_count": 0, "uuid": "516fbd18b24351cc85d48e85a3adb64e008b4b4f"}, "author": "", "url": "https://www.reuters.com/article/us-ivorycoast-military/soldiers-loot-arms-burn-military-base-in-ivory-coasts-second-city-idUSKBN1EZ18P", "ord_in_thread": 0, "title": "Soldiers loot arms, burn military base in Ivory Coast's second city", "locations": [], "entities": {"persons": [{"name": "ange aboa", "sentiment": "none"}], "locations": [{"name": "ivory coast", "sentiment": "none"}, {"name": "bouake", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}], "organizations": [{"name": "ccdo", "sentiment": "none"}, {"name": "min read  abidjan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ABIDJAN (Reuters) - Soldiers in Ivory Coast’s second largest city looted weapons from the base of a rival elite military unit before setting it on fire during an overnight clash, leaders of the faction that carried out the raid said on Wednesday.\nThe soldiers, who were involved in a series of mutinies last year that tarnished the image of Ivory Coast, one of Africa’s fastest growing economies, accuse the elite unit, known as the CCDO, of spying on them.\nGunshots and heavy weapons fire erupted between the rival factions late on Tuesday, though residents said the situation on Wednesday was calm after some early sporadic gunfire, and businesses were operating normally.\n“We entered the CCDO camp around midnight and took all of their arms and ammunitions,” one of the faction’s leaders, who asked not to be named, told Reuters. “Their troops fled the camp but we are looking for them.”\nA government spokesman said that there were no deaths in the clash and about 100 troops along with armoured vehicles and attack helicopters had been sent to Bouake to reinforce security.\nA burned car is seen in front of the Coordination Center for Operational Decisions (CCDO), a unit composed of soldiers, paramilitary gendarmes and police, in Bouake, Ivory Coast, January 10, 2018. REUTERS/Stringer Footage of the damage at the CCDO base broadcast on state television showed burned vehicles and offices gutted by fire. Authorities said they were carrying out an investigation into the attack.\nThe CCDO is a rapid-reaction unit composed of army soldiers, paramilitary gendarmes and police officers.\nA soldier is seen in front of the Coordination Center for Operational Decisions (CCDO), a unit composed of soldiers, paramilitary gendarmes and police, in Bouake, Ivory Coast, January 10, 2018. REUTERS/Stringer “We have to stop this. I’ve asked the soldiers to keep their heads. No matter what their demands are, they can’t launch such brutal protests,” Nicolas Djibo, Bouake’s mayor, told state broadcaster RTI.\nBouake, in the centre of the west African nation, was the epicentre of several months of army mutinies last year that spread across the nation, forcing the government to yield to demands for bonuses and promotions.\nIvory Coast, the world’s top cocoa grower, emerged from a decade-long political crisis as a rising African economic star and a darling of international investors.\nBut last year’s instability laid bare the dangerous divisions that still persist within an army cobbled together from rival rebel and loyalist factions at the end of a 2011 civil war.\nAdditional reporting and writing by Joe Bavier; Editing by Gareth Jones, William Maclean\n ", "external_links": [], "published": "2018-01-10T13:55:00.000+02:00", "crawled": "2018-01-10T14:10:27.054+02:00", "highlightTitle": ""}