{"organizations": [], "uuid": "90b6a969cf02f310d2a689eb4b6e6c77adaab984", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-q-e-p-co-inc-reports-fiscal-2018-nine-month-and-third-quarter-sales-and-earnings.html", "country": "US", "domain_rank": 767, "title": "Q.E.P. Co., Inc. Reports Fiscal 2018 Nine Month and Third Quarter Sales and Earnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T16:56:00.000+02:00", "replies_count": 0, "uuid": "90b6a969cf02f310d2a689eb4b6e6c77adaab984"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-q-e-p-co-inc-reports-fiscal-2018-nine-month-and-third-quarter-sales-and-earnings.html", "ord_in_thread": 0, "title": "Q.E.P. Co., Inc. Reports Fiscal 2018 Nine Month and Third Quarter Sales and Earnings", "locations": [], "entities": {"persons": [], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "raton", "sentiment": "none"}], "organizations": [{"name": "q.e.p. co., inc", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Completes Sale of Two North American Facilities and Related Equipment\nDeclares Special Dividend of $1.00 Per Share\nBOCA RATON, Fla., Jan. 10, 2018 (GLOBE NEWSWIRE) -- Q.E.P. CO., INC. (OTC:QEPC.PK) (the “Company”) today reported its consolidated results of operations for the first nine months and third quarter of its fiscal year ending February 28, 2018, the sale of two North American facilities and the declaration of a special dividend.\nResults of Operation:\nThe Company reported net sales of $246.9 million for the nine months ended November 30, 2017, an increase of $8.6 million or 3.6% from the $238.2 million reported in the same period of fiscal 2017. As a percentage of net sales, gross margin was 28.3% in the first nine months of fiscal 2018 compared to 28.2% in the first nine months of fiscal 2017.\nThe Company reported net sales of $80.7 million for the quarter ended November 30, 2017, an increase of $2.8 million or 3.6% from the $78.0 million reported in the same period of fiscal 2017. As a percentage of net sales, gross margin was 27.9% in the third quarter of fiscal 2018 compared to 28.2% in the third quarter of fiscal 2017.\nLewis Gould, Chairman of the Board of Directors, commented on Q.E.P.’s nine month results, “QEP experienced sales growth compared to the prior year’s third fiscal quarter, maintaining this growth through gross profit. Operationally, the increase to sales came at a cost that was reflected in higher shipping and selling costs in both our European and Australian segments. Our general and administrative costs reflect one-time costs, that when normalized are in line with our expectations for the current quarter. We continue to see unprecedented sales growth in our Australian business with the rollout of new product offerings and the successful integration of our current year acquisitions in North America. For the first nine months of fiscal 2018, we still continue to see difficult top line comparisons due to shifting product demand in North America, foreign currency in Europe and our discontinued carpet installation business in Australia.”\nMr. Gould continued, “QEP has been very active over the past few months. In December we sold two of our domestic operating facilities and related equipment as we began a process of improving efficiency in our business. Over the next few months we will continue to streamline our operations and prepare for growth and expansion. These transactions generated $5.5 million of cash, net of related debt. Our Board of Directors has elected to return some of this cash to our shareholders in the form of a special dividend with the remainder of the proceeds being used for general operating purposes. We are encouraged by the recent tax law changes in the United States believing that as a full tax payer we will benefit from these changes. As a company, we will take this opportunity to make strategic investments in our existing workforce, operating infrastructure and acquisitions to continue to grow our company.”\nNet sales growth for the first nine months and third quarter of fiscal 2018 as compared to the same periods in the prior fiscal year reflect the impact of businesses acquired during the first nine months of the current fiscal year and net growth across a range of product categories, predominately in the Australian segment. Foreign currency rate changes in our European operations had a negative effect on the nine month period and positive effect on the third quarter compared to the prior fiscal year.\nThe Company’s gross margin as a percentage of net sales increased for first nine months of fiscal 2018 to 28.3% compared to the prior fiscal year nine month period of 28.2% but decreased minimally in the third quarter of fiscal 2018 to 27.9% compared to the prior fiscal year third quarter of 28.2%. The Company benefited from changes in the product mix during the first nine months of the current fiscal year. The negative impact of foreign currency rates in our European operations compared to first nine months of the prior fiscal year partially offset these gains.\nOperating expenses for the first nine months and third quarter of fiscal 2018 were $61.0 million and $21.8 million, respectively, or 24.7% and 27.0% of net sales in those periods, compared to $56.1 million and $18.6 million, respectively, or 23.6% and 23.9% of net sales in the comparable fiscal 2017 periods. The increase was due to a non-cash asset impairment charge related to equipment in North America that was held for sale during the third quarter and was sold in the fourth quarter of fiscal 2018, operating expenses related to certain one-time corporate development costs, the incremental expenses assumed with the businesses acquired during the current fiscal year and additional operating costs incurred to support international sales growth.\nNon-operating income for the nine months of fiscal 2017 represents a gain on the sale of certain non-core assets of the Company.\nThe increase in interest expense during the third quarter of fiscal 2018 was due to an increase in interest rates and utilization of our credit facilities to support sales growth in Australia. The decrease in interest expense during fiscal 2018 as compared to fiscal 2017 is due to repayment of outstanding debt which more than offset increases to interest rates and to our lines of credit to support working capital needs.\nThe provision for income taxes as a percentage of income before taxes for the first nine months and third quarter of fiscal 2018 and fiscal 2017 was 37.5% in each period. The effective tax rate in both fiscal years reflects the relative contribution of the Company’s earnings sourced from its international operations.\nNet income for the first nine months and third quarter of fiscal 2018 was $5.0 million and $0.3 million, respectively, or $1.57 and $0.10, respectively, per diluted share. For the comparable periods of fiscal 2017, net income was $6.5 million and $2.0 million, respectively, or $2.03 and $0.62, respectively, per diluted share.\nAdjusting for the non-cash asset impairment charge and corporate development related expenses of $2.3 million ($1.4 million net of tax) adjusted net income for the third quarter of fiscal 2018 was $1.7 million, or $0.54 per diluted share, compared to adjusted net income of $2.0 million, or $0.62 per share, in the third quarter of the prior fiscal year. These adjustments resulted in adjusted EBITDA of $14.1 million and $4.0 million for the nine months and third quarter of fiscal 2018, respectively, compared to adjusted EBITDA of $14.0 million and $4.4 million for the nine months and third quarter of fiscal 2017, respectively. The non-recurring charges, totaling $2.3 million before the effect of taxes, were comprised of a $1.4 million asset impairment charge and $0.9 million in corporate development related expenses.\nAdjusted net income for the first nine months of fiscal 2018 was $6.5 million, or $2.04 per diluted share, compared to net income of $6.5", "external_links": [], "published": "2018-01-10T16:56:00.000+02:00", "crawled": "2018-01-10T18:47:32.000+02:00", "highlightTitle": ""}