{"organizations": [], "uuid": "d3833873043d509dee1513a5768039437d8971ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/04/104877965-GettyImages-141221028.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/15/richard-branson-tells-virgin-trains-to-re-stock-the-daily-mail.html", "country": "US", "domain_rank": 767, "title": "Richard Branson tells Virgin Trains to re-stock the Daily Mail", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.034, "site_type": "news", "published": "2018-01-15T15:11:00.000+02:00", "replies_count": 0, "uuid": "d3833873043d509dee1513a5768039437d8971ff"}, "author": "Lucy Handley", "url": "https://www.cnbc.com/2018/01/15/richard-branson-tells-virgin-trains-to-re-stock-the-daily-mail.html", "ord_in_thread": 0, "title": "Richard Branson tells Virgin Trains to re-stock the Daily Mail", "locations": [], "entities": {"persons": [{"name": "richard branson", "sentiment": "negative"}, {"name": "brian", "sentiment": "none"}, {"name": "branson", "sentiment": "none"}, {"name": "brian souter", "sentiment": "none"}], "locations": [{"name": "u.k.", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "west coast", "sentiment": "none"}], "organizations": [{"name": "virgin trains", "sentiment": "negative"}, {"name": "daily mail cnbc.com", "sentiment": "negative"}, {"name": "daily mail", "sentiment": "none"}, {"name": "virgin group", "sentiment": "none"}, {"name": "stagecoach", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Richard Branson has told staff at his Virgin Trains franchise to start selling U.K. newspaper the Daily Mail again, after the title was removed because of employee concerns over its reporting on immigration, LGBT rights and unemployment.\nIn November, a Virgin Trains memo said that the rightwing newspaper was \" not compatible \" with the brand's beliefs and it was removed from trains operating on its West Coast route, which runs from southern England to Wales, the West Midlands and Scotland.\nBut writing on his blog on Monday, Branson said the removal of the Daily Mail amounted to censorship, adding that he and Brian Souter, chairman of Stagecoach, which operates the rail service with Virgin Group, had instructed staff to re-stock the paper.\n\"Brian and I agree that we must not ever be seen to be censoring what our customers read and influencing their freedom of choice,\" Branson wrote. \"Nor must we be seen to be moralizing on behalf of others. Instead, we should stand up for the values we hold dear and defend them publicly, as I have done with the Mail on many issues over the years.\"\nCameron Costa | CNBC Sir Richard Branson. Branson added that he and Souter had not been aware of the decision to remove the newspaper from trains until they read media reports. \"Freedom of speech, freedom of choice and tolerance for differing views are the core principles of any free and open society,\" he said.\n\"While Virgin Trains has always said that their passengers are free to read whatever newspaper they choose on board West Coast trains, it is clear that on this occasion the decision to no longer sell the Mail has not been seen to live up to these principles.\"\nA statement from the Daily Mail given to AP last week suggested that the paper had been removed because Branson is in favor of the U.K. staying in the EU. \"They informed us last November that to save space, they were restricting sales to just three newspapers: the Mirror, FT (Financial Times) and Times,\" the Mail said . \"They gave no other reason, but it may be no coincidence that all those titles, like Virgin owner Sir Richard Branson, are pro-Remain.\"\nDaniel Sorabji | AFP | Getty Images An arrangement of newspapers pictured in London on March 29, 2017, as an illustration, shows the front pages of the UK daily newspapers. Virgin Group has operated the West Coast rail route since 1997, selling 49 percent of Virgin Rail Group to Stagecoach in 1998. The franchise is due to expire in March 2019.\nA Virgin Trains spokesperson confirmed to CNBC by phone that it had removed the Daily Mail from some of its trains in November 2017, following staff concerns. He did not confirm a date when the newspaper would be reinstated and had no further comment.\nA spokesperson for the Daily Mail said in an email to CNBC: \"We welcome Sir Richard Branson and Brian Souter's support for freedom of speech, which is a cornerstone of our democracy, and his decision to instruct Virgin Trains to restock the Mail. We are sure the many Mail readers who travel on Virgin Trains will be delighted.\"", "external_links": [], "published": "2018-01-15T15:11:00.000+02:00", "crawled": "2018-01-15T15:14:05.005+02:00", "highlightTitle": ""}