{"organizations": [], "uuid": "1dbdd129f7aa8957e15b2d1be655169813048409", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-lippert-components-agrees-to-acquire-marine-and-industrial-supplier-taylor-made-group-llc.html", "country": "US", "domain_rank": 767, "title": "Lippert Components Agrees to Acquire Marine and Industrial Supplier Taylor Made Group, LLC", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-17T15:30:00.000+02:00", "replies_count": 0, "uuid": "1dbdd129f7aa8957e15b2d1be655169813048409"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-lippert-components-agrees-to-acquire-marine-and-industrial-supplier-taylor-made-group-llc.html", "ord_in_thread": 0, "title": "Lippert Components Agrees to Acquire Marine and Industrial Supplier Taylor Made Group, LLC", "locations": [], "entities": {"persons": [{"name": "taylor", "sentiment": "none"}, {"name": "taylor made", "sentiment": "none"}], "locations": [{"name": "llc elkhart", "sentiment": "none"}, {"name": "ind.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "gloversville", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "lci industries", "sentiment": "negative"}, {"name": "lcii", "sentiment": "negative"}, {"name": "lippert components agrees to acquire marine and industrial supplier taylor made group", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "taylor made group", "sentiment": "none"}, {"name": "lci", "sentiment": "none"}, {"name": "lippert components, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ELKHART, Ind., Jan. 17, 2018 /PRNewswire/ -- LCI Industries (NYSE: LCII) today announced that its wholly-owned subsidiary, Lippert Components, Inc. (\"LCI\"), a supplier of components for the leading original equipment manufacturers (\"OEMs\") of recreational vehicles (\"RVs\") and adjacent industries, and the related aftermarkets of those industries, expects to enter into an agreement to acquire Taylor Made Group, LLC (\"Taylor Made\"). Headquartered in Gloversville, New York, Taylor Made is one of the recreational marine industry's largest, most diversified suppliers to boat builders and the aftermarket, as well as a key supplier to a host of other industrial end markets. Taylor Made operates out of ten facilities, including two in Europe. Sales of the soon-to-be-acquired business for the twelve months ending December 2017 were approximately $150 million. The transaction is expected to close within two weeks; provided, however, that such closing is subject to the completion of negotiations and the execution of a mutually agreeable purchase agreement.\n\"LCI is one of the leading providers of windows for the RV towable industry, and with the addition of Taylor Made's products, will be a leading supplier of marine and industrial market windshields as well,\" said LCI's CEO Jason Lippert. \"Taylor Made has many characteristics we look for in acquisitions: great teams, great products with diversified markets, and a great opportunity for growth. With revenue composition of 20% aftermarket, 25% industrial, and 15% international, Taylor Made is a great balance of diversified revenues,\" added Lippert.\n\"This is an exciting time in the marine industry and Taylor Made could not be more pleased to join with Lippert, a combination that brings together leading brands, manufacturing expertise, and global capabilities. We will work together to bring increased value and innovation to Lippert's and Taylor Made's mutual associates, team members, customers, and consumers,\" said Dennis Flint, Chairman and CEO of Taylor Made.\nOnce the acquisition is complete, a majority of the Taylor Made team will remain with LCI to lead the acquired business under the direction of Jason Falk, Vice President of Operations. \"Together, as one company, Lippert and Taylor Made will have more resources to fully serve our respective customers, and will be very well positioned for long-term, sustained growth,\" said Jason Pajonk-Taylor, President of Taylor Made.\n\"Our combined window, glass, and windshield team is talented and innovative, as well as experienced in managing growth,\" added LCI's President Scott Mereness. \"On the heels of another large acquisition last year, Taylor Made will be LCI's largest acquisition in the company's history, and is representative of our strategy of quickly assembling a portfolio of companies and products that will help us become a major contributor to marine component designs and solutions. We expect to leverage our purchasing, sales, distribution, and administrative capabilities to improve the profitability of this business, and we expect this acquisition to be immediately accretive to LCI's earnings.\"\nAbout LCI Industries\nFrom 50 manufacturing and distribution facilities located throughout the United States and in Canada and Italy, LCI Industries, through its wholly-owned subsidiary, Lippert Components, Inc., supplies, domestically and internationally, a broad array of components for the leading original equipment manufacturers of recreational vehicles; buses; trailers used to haul boats, livestock, equipment, and other cargo; trucks; pontoon boats; trains; manufactured homes; and modular housing. The Company also supplies components to the related aftermarkets of these industries primarily by selling to retail dealers, wholesale distributors, and service centers. LCI's products include steel chassis and related components; axles and suspension solutions; slide-out mechanisms and solutions; thermoformed bath, kitchen, and other products; vinyl, aluminum, and frameless windows; manual, electric, and hydraulic stabilizer and leveling systems; furniture and mattresses; entry, luggage, patio, and ramp doors; electric and manual entry steps; awnings and awning accessories; electronic components; televisions and sound systems; navigation systems; backup cameras; appliances; and other accessories. Additional information about LCI and its products can be found at www.lci1.com .\nAbout Taylor Made Group, LLC.\nHeadquartered in Gloversville, N.Y., Taylor Made Group, LLC operates facilities in the United States, the Republic of Ireland, and the United Kingdom — with additional licensed affiliates in Australia, New Zealand, and Poland. In business for over 100 years, Taylor Made Group is one of the recreational marine industry's leading and most diversified suppliers. Additionally, Taylor Made Group provides products to numerous other industries, including the agriculture, construction, powersports, mass transit, emergency, utility, golf, automotive industries, and more. Employing over 1,100 associates, Taylor Made Group distributes its products through a worldwide distribution network.\nForward-Looking Statements\nThis press release contains certain \"forward-looking statements\" with respect to our financial condition, results of operations, business strategies, operating efficiencies or synergies, competitive position, growth opportunities, acquisitions, plans and objectives of management, and other matters. Statements in this press release that are not historical facts are \"forward-looking statements\" for the purpose of the safe harbor provided by Section 21E of the Securities Exchange Act of 1934, as amended, and Section 27A of the Securities Act of 1933, as amended, and involve a number of risks and uncertainties.\nForward-looking statements, including, without limitation, those relating to our future business prospects resulting from acquisitions, whenever they occur in this press release are necessarily estimates reflecting the best judgment of the Company's senior management at the time such statements were made. There are a number of factors, many of which are beyond the Company's control, which could cause actual results and events to differ materially from those described in the forward-looking statements. These factors include, in addition to other matters described in this press release, pricing pressures due to domestic and foreign competition, costs and availability of raw materials (particularly steel, steel based components and aluminum) and other components, seasonality and cyclicality in the industries to which we sell our products, availability of credit for financing the retail and wholesale purchase of products for which we sell our components, inventory levels of retail dealers and manufacturers, availability of transportation for products for which we sell our components, the financial condition of our customers, the financial condition of retail dealers of products for which we sell our components, retention and concentration of significant customers, the costs, pace of, and successful integration of acquisitions and other growth initiatives, availability and costs of labor, employee benefits, employee retention, realization and impact of efficiency improvements and cost reductions, the successful entry into new markets, the costs of compliance with environmental laws and increas", "external_links": ["http://www.lci1.com/", "http://www.prnewswire.com/news-releases/lippert-components-agrees-to-acquire-marine-and-industrial-supplier-taylor-made-group-llc-300583695.html"], "published": "2018-01-17T15:30:00.000+02:00", "crawled": "2018-01-17T16:33:33.009+02:00", "highlightTitle": ""}