{"organizations": [], "uuid": "10ed43d225dba4e70633827a7dad71652330adcb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/21/104957915-GettyImages-529084742.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/22/sanofi-digs-deep-to-buy-us-hemophilia-specialist-bioverativ-for-11-point-6-billion.html", "country": "US", "domain_rank": 767, "title": "Sanofi digs deep to buy US hemophilia specialist Bioverativ for $11.6 billion", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T12:40:00.000+02:00", "replies_count": 0, "uuid": "10ed43d225dba4e70633827a7dad71652330adcb"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/22/sanofi-digs-deep-to-buy-us-hemophilia-specialist-bioverativ-for-11-point-6-billion.html", "ord_in_thread": 0, "title": "Sanofi digs deep to buy US hemophilia specialist Bioverativ for $11.6 billion", "locations": [], "entities": {"persons": [{"name": "bioverativ", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "sanofi", "sentiment": "negative"}, {"name": "biogen", "sentiment": "none"}, {"name": "genzyme", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "French health-care group Sanofi has agreed to buy U.S. hemophilia specialist Bioverativ for $11.6 billion, its biggest deal for seven years and a major play to strengthen its presence in treatments for rare diseases.\nSeveral analysts said the deal looked expensive, given uncertainties in the hemophilia market due to the arrival of new drug treatments, and Sanofi shares fell 4 percent on Monday, the worst performance on France's benchmark CAC-40 index.\nThe move comes at a time of renewed interest by large drugmakers in smaller biotech firms, with Celgene also announcing a $9 billion deal to buy Juno Therapeutics , and predictions by some experts that 2018 will see a substantial pick-up in mergers and acquisitions.\nSanofi has agreed to buy all of the outstanding shares of Bioverativ for $105 apiece in cash, a premium of 64 percent to Bioverativ's closing price on January 19.\nBioverativ, a maker of hemophilia drugs, was separated from Biogen early last year. Its shares surged to $104 in early U.S. trading.\nThe agreed transaction marks Sanofi's successful return to deal-making after its failure to land major takeovers in recent years. It is its biggest acquisition since the 2011 takeover of U.S. biotech company Genzyme for around $20 billion.\nSanofi lost out on buying California-based cancer specialist Medivation to Pfizer in 2016, and also missed acquiring Swiss biotech company Actelion, which was bought by Johnson & Johnson last year.\n\"With Bioverativ, we welcome a leader in the growing hemophilia market,\" Sanofi Chief Executive Olivier Brandicourt said.\nThe market dealing with treatments for hemophilia is an important one that is evolving rapidly as a new drug from Roche changes the landscape and gene therapy holds out the promise of a possible one-time cure.\nSanofi said the sector had around $10 billion in annual sales, with 181,000 people affected worldwide, and hemophilia represented the largest market for rare diseases, set to grow by more than 7 percent per year through to 2022.\nMore deals? Sanofi expects the acquisition, which brings it established hemophilia products Eloctate and Alprolix, to be immediately accretive to its business earnings per share in the full 2018 financial year and up to 5 percent accretive for the following year.\nHowever, some analysts questioned the cost.\n\"Bioverativ looks a relatively expensive acquisition. It is logical in terms of building around Sanofi's presence and pipeline in rare diseases and hemophilia, though management may have to argue against concerns on competition,\" Jefferies analysts wrote in a note to clients.\n\"The obvious parallel is Shire's highly unpopular acquisition of Baxalta; but Sanofi's 2011 acquisition of rare disease specialist Genzyme was also unpopular at the time, yet has it turned into a major success story,\" Kepler analysts said.\nSanofi added it would fund the takeover with a mixture of existing cash resources and a debt issue.\n\"We have the means to make further takeovers,\" added Brandicourt on a conference call, without going into further details.\nBrandicourt has said in the past he was ready to do deals of a similar size to the $20 billion purchase of Genzyme to help accelerate growth at France's biggest drugmaker. One asset analysts and bankers believe could be of interest is Pfizer's consumer health unit, although competition for this business is likely to be fierce.\nSanofi said it expected to achieve a return on its invested capital (ROIC) in excess of the cost of capital within three years. The French group also expects to preserve its strong credit rating.\nThis month Celgene agreed to pay up to $7 billion to take over Impact Biomedicines.\nIn Europe, Novo Nordisk has offered $3.1 billion for Ablynx and Japan's Takeda Pharmaceutical plans to buy TiGenix for $630 million.\nThe spate of deal-making follows a relatively subdued 2017 for biotech M&A.\nLazard advised Sanofi on the deal, while Guggenheim Securities and J.P. Morgan advised Bioverativ.", "external_links": [], "published": "2018-01-22T12:40:00.000+02:00", "crawled": "2018-01-22T13:06:07.036+02:00", "highlightTitle": ""}