{"organizations": [], "uuid": "6033ee061a24deb1196cb483716f8014b697b585", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/09/reuters-america-update-1-dominos-turnaround-ceo-to-step-down-in-june.html", "country": "US", "domain_rank": 767, "title": "UPDATE 1-Domino's turnaround CEO to step down in June", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T03:04:00.000+02:00", "replies_count": 0, "uuid": "6033ee061a24deb1196cb483716f8014b697b585"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/09/reuters-america-update-1-dominos-turnaround-ceo-to-step-down-in-june.html", "ord_in_thread": 0, "title": "UPDATE 1-Domino's turnaround CEO to step down in June", "locations": [], "entities": {"persons": [{"name": "doyle", "sentiment": "negative"}, {"name": "richard allison", "sentiment": "none"}, {"name": "patrick doyle", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "pizza inc", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds details on Doyle, share moves, Chipotle job search)\nJan 9 (Reuters) - Domino's Pizza Inc said on Tuesday its chief executive, Patrick Doyle, will leave the biggest U.S. pizza delivery chain in June and would be replaced by Richard Allison, currently president of its international business.\nIn after-market trading, shares in Domino's fell 2.8 percent to $201 following news of the pending departure of Doyle, who has been CEO since early 2010. He presided over a turnaround that improved the taste of the company's namesake product, invested in online ordering and promotions, and fueled explosive share gains.\nDoyle in a statement said he had accomplished several goals, including making the company No. 1 in its category, but did not elaborate on his plans.\nDomino's did not immediately respond to requests for comment.\nDomino's reworked its U.S. pizza recipe in December 2009, when Doyle was president of the chain, and he is perhaps best known for admitting in commercials and news interviews that the company's pizza simply did not taste good.\nThe campaign, which included focus group comments comparing Domino's crusts to cardboard and dubbing the product the \"worst excuse for pizza I've ever had,\" was widely seen as a marketing win for Domino's and helped fuel its turnaround.\nCompany shares, which traded at $7.75 on Dec. 1, 2009, closed at $206.71 on Tuesday.\nDoyle, who is 54 years old, is seen by some industry experts as a potential candidate for the CEO job at Chipotle Mexican Grill Inc.\nChipotle has struggled to regain its footing after a string of food safety lapses in 2015 and is lagging other chains when it comes to digital efforts and delivery.\nA Chipotle spokesman declined comment on its CEO search.\nAllison, who is 50 years old, will become CEO on July 1.\nMore than half of Domino's roughly 14,400 stores are located outside the United States. (Reporting by Lisa Baertlein in Los Angeles and Uday Sampath in Bengaluru; Editing by Maju Samuel and Chris Reese)", "external_links": [], "published": "2018-01-10T03:04:00.000+02:00", "crawled": "2018-01-10T03:08:03.014+02:00", "highlightTitle": ""}