{"organizations": [], "uuid": "3e94499429b724311a25f81ce644965f7549337e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221423709&w=1200&r=LYNXMPEE0B0P7", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-ecb-policy-breakingviews/breakingviews-markets-start-doing-mario-draghis-job-for-him-idUSKBN1F1199", "country": "US", "domain_rank": 408, "title": "Markets start doing Mario Draghi’s job for him", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T19:38:00.000+02:00", "replies_count": 0, "uuid": "3e94499429b724311a25f81ce644965f7549337e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-ecb-policy-breakingviews/breakingviews-markets-start-doing-mario-draghis-job-for-him-idUSKBN1F1199", "ord_in_thread": 0, "title": "Markets start doing Mario Draghi’s job for him", "locations": [], "entities": {"persons": [{"name": "mario draghi", "sentiment": "neutral"}, {"name": "draghi", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "neutral"}, {"name": "ecb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON Financial markets have started doing European Central Bank President Mario Draghi’s job for him. The euro hit three-year highs and government bond yields rose after euro zone rate-setters hinted they may change their tune on how long monetary policy will stay ultra-loose. These market moves amount to a tightening of monetary conditions. That buys Draghi some time to phase out negative rates that are increasingly at odds with accelerating growth.\nThe single currency traded above $1.21 for the first time in three years on Friday while 10-year German bond yields hit a five-month peak of 0.54 percent. The impetus for those moves was the release a day earlier of the minutes of the ECB’s December policy meeting, which showed policymakers might adjust their message to acknowledge the euro zone’s strong growth. That doused speculation the central bank might extend its asset purchases beyond the end of September and boosted expectations that its deposit rate could rise from a record low of minus 0.4 percent before the end of the year.\nBut traders are tightening monetary conditions before the central bank does. ECB officials estimate that a 10 percent rise in the euro’s value against the currencies of its major trading partners shaves about 0.4-0.5 percentage points off regional inflation. The single currency had risen 6.5 percent on a trade-weighted basis in less than a year even before its latest gains. Meanwhile, rising market interest rates will eventually translate into higher borrowing costs for countries, companies and consumers.\nThe ECB may not mind, within limits. The central bank last cut its deposit rate in March 2016, when rate-setters were concerned about the risk of deflation and diffident about growth prospects. Those emergency-era policies now appear anachronistic.\nThe euro zone economy expanded more quickly than the United States in the third quarter and data on Thursday showed German GDP growing at its fastest rate in six years in 2017. True, the ECB has yet to hit its near-2 percent inflation target. But consumer prices are rising at an annual pace of 1.4 percent; they were stuck around zero when rates were last cut. All this militates for a shift in the ECB’s rhetoric and policy. But with financial markets so willing to take on the task of tightening monetary conditions, Draghi can afford to pace himself.\n ", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-12T19:38:00.000+02:00", "crawled": "2018-01-12T18:22:34.005+02:00", "highlightTitle": ""}