{"organizations": [], "uuid": "261d1f99b2b0fd91728f3527280c9fea617e148e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221521475&w=1200&r=LYNXMPEE0B1DX", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-rigs-baker-hughes/u-s-drillers-add-most-oil-rigs-in-a-week-since-june-baker-hughes-idUSKBN1F12BZ", "country": "US", "domain_rank": 408, "title": "U.S. drillers add most oil rigs in a week since June: Baker Hughes", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-13T02:29:00.000+02:00", "replies_count": 0, "uuid": "261d1f99b2b0fd91728f3527280c9fea617e148e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-rigs-baker-hughes/u-s-drillers-add-most-oil-rigs-in-a-week-since-june-baker-hughes-idUSKBN1F12BZ", "ord_in_thread": 0, "title": "U.S. drillers add most oil rigs in a week since June: Baker Hughes", "locations": [], "entities": {"persons": [{"name": "baker hughes", "sentiment": "negative"}, {"name": "james williams", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "arkansas", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "general electric co’s baker hughes", "sentiment": "none"}, {"name": "wtrg economics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 6:29 PM / Updated an hour ago U.S. drillers add most oil rigs in a week since June: Baker Hughes Scott DiSavino 3 Min Read \n(Reuters) - U.S. energy companies added 10 oil rigs this week, the biggest increase since June, as crude prices rose to their highest levels in three years, prompting drillers to return to the well pad. \nThe total rig count rose to 752 in the week to Jan. 12, the most since September, General Electric Co’s Baker Hughes energy services firm said in its closely followed report on Friday. \nThe U.S. rig count, an early indicator of future output, is much higher than a year ago when only 522 rigs were active after energy companies boosted spending plans in 2017 as crude started recovering from a two-year price crash. \nThe increase in U.S. drilling lasted 14 months before briefly stalling in the second half of last year as some producers trimmed their 2017 spending plans after prices turned softer over the summer. \n“Drilling activity may not be up every week, but we continue to expect growth through the first quarter of 2018 and longer if prices hold,” James Williams, president of WTRG Economics in Arkansas, said in a report this week. \nU.S. crude futures traded around $64 a barrel this week, near its highest since December 2014. That compares with averages of $50.85 in 2017 and $43.47 in 2016. \nLooking ahead, futures were trading around $62 for the balance of 2018 and $58 for calendar 2019. \nIn anticipation of higher prices in 2018 than 2017, U.S. financial services firm Cowen & Co said 23 of the roughly 65 E&Ps they track have already provided capital expenditure guidance for 2018 indicating a 12 percent increase in planned spending over 2017. \nCowen said the E&Ps it tracks said they would spend about $66.1 billion on drilling and completions in the lower 48 U.S. states in 2017, which was about 53 percent over what they planned to spend in 2016. \nAnalysts at Simmons & Co, energy specialists at U.S. investment bank Piper Jaffray, this week slightly reduced their forecast for the total oil and natural gas rig count to an average of 996 in 2018 and 1,126 in 2019. Last week, it forecast 997 in 2018 and 1,126 in 2019. \nThere were 939 oil and natural gas rigs active on Jan. 12. On average, there were 876 rigs available for service in 2017, 509 in 2016 and 978 in 2015. Most rigs produce both oil and gas. \nOverall, U.S. production is expected to rise to an all-time high of 10.3 million barrels per day in 2018 and 10.9 million bpd in 2019, up from 9.3 million bpd in 2017, according to a federal energy projection this week. [EIA/M] \nU.S. output peaked on an annual basis at 9.6 million bpd in 1970, according to federal energy data. \nMuch of the production growth will be concentrated in the Permian Basin, the largest U.S. oilfield stretching across Texas and New Mexico, said John Staub, the EIA director of the office of petroleum, natural gas and biofuels analysis. Reporting by Scott DiSavino; Editing by Marguerita Choy", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-13T02:29:00.000+02:00", "crawled": "2018-01-12T20:46:47.000+02:00", "highlightTitle": ""}