{"organizations": [], "uuid": "e55260e9b9eb343134a6b7e70aa1708e20c690fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226961538&w=1200&r=LYNXMPEE0U10Y", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/israel-lebanon-usa/u-s-defends-role-of-lebanon-army-as-israel-threatens-to-attack-it-idINKBN1FK20E", "country": "US", "domain_rank": 408, "title": "U.S. defends role of Lebanon army as Israel threatens to attack it", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T16:01:00.000+02:00", "replies_count": 0, "uuid": "e55260e9b9eb343134a6b7e70aa1708e20c690fe"}, "author": "", "url": "https://in.reuters.com/article/israel-lebanon-usa/u-s-defends-role-of-lebanon-army-as-israel-threatens-to-attack-it-idINKBN1FK20E", "ord_in_thread": 0, "title": "U.S. defends role of Lebanon army as Israel threatens to attack it", "locations": [], "entities": {"persons": [{"name": "dan williams", "sentiment": "none"}, {"name": "leba", "sentiment": "none"}, {"name": "bashar al-assad", "sentiment": "none"}], "locations": [{"name": "lebanon", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "min read  tel aviv", "sentiment": "none"}, {"name": "hezbollah", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "lebanese armed forces", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TEL AVIV (Reuters) - The United States pledged continued support for Lebanon’s military on Wednesday, calling it a potential counterweight to Iranian-backed Hezbollah, even as Israel said the two forces were indistinguishable and fair game in any future war.\nSuch a public difference of opinion between the allies was remarkable enough, but especially so as it was sounded by senior officials at the same event - an Israeli security conference.\nThe Lebanese Armed Forces took no part in the 2006 war between Hezbollah and Israel. It has received more than $1.5 billion in U.S. military assistance since then and, in the last seven years, training and support from U.S. special forces too.\nWith Hezbollah having helped sway the Syrian civil war in President Bashar al-Assad’s favour, Israel and the United States worry that the Shi‘ite militia could now broaden its clout in its Lebanese heartland.\n“We will sustain our efforts to support legitimate state security institutions in Lebanon, such as the Lebanese Armed Forces, which is the only legitimate force in Lebanon,” David Satterfield, acting assistant U.S. secretary of state, told the conference organised by Tel Aviv University’s INSS think-tank.\nSatterfield added that the Lebanese army “could well serve as a counterweight to Hezbollah’s desire to expand its own influence there, as well as Iran’s reach in Lebanon”.\nBut taking the stage three hours later, Israeli Defence Minister Avigdor Lieberman reiterated his view that the Lebanese army was under the command of the better-equipped Hezbollah.\n“As far as I‘m concerned, all of Lebanon - the Lebanese army, Lebanon and the Lebanese army - are no different from Hezbollah,” he said. “They are part of Hezbollah and they will all pay the full price” for any large-scale attack on Israel.\nActing U.S. Assistant Secretary of State for Near Eastern Affairs, David Satterfield, speaks during the 11th Annual International Institute for National Security Studies (INSS) Conference in Tel Aviv, Israel January 31, 2018. REUTERS/Amir Cohen There was no immediate response from Hezbollah or the Lebanese military.\nThe Lebanese military has previously said it operates independently from Hezbollah, most recently during an operation against Islamic State at the Lebanese-Syrian border last year.\nIsraeli intelligence officials told Reuters last year that they believed the Lebanese army maintained autonomy even if some of its personnel cooperated with Hezbollah.\nSlideshow (2 Images) The INSS conference coincided with heightened concern in Israel about what it describes as Iranian efforts to fit precision-guidance systems onto Hezbollah’s longer-range missiles. Such improvements could potentially allow Hezbollah to knock out key Israeli infrastructure.\nWashington shares these worries, according to Nathan Sales, the State Department’s coordinator for counterterrorism.\n“We’re very concerned about Hezbollah developing an indigenous weapons manufacturing capability or alteration capability inside Lebanon,” Sales told Reuters at the conference.\nHe declined to comment on how far advanced such missile projects might be, but said the United States was trying to hinder them and other Hezbollah capabilities by using sanctions to dent the $700 million that Iran gives the militia annually.\nNeither Hezbollah nor Iran has responded to such charges.\nIsrael has also been lobbying Russia - which has some sway over Iran and Hezbollah because of their alliance in Syria. Israeli officials said they hosted a senior Russian security delegation on Wednesday, with the missile issue on the agenda.\nWriting by Dan Williams; Editing by Mark Heinrich\n ", "external_links": [], "published": "2018-01-31T16:01:00.000+02:00", "crawled": "2018-01-31T16:48:40.000+02:00", "highlightTitle": ""}