{"organizations": [], "uuid": "ebb46165d0a31ae759ddc553f09f7da98855dfcb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-canadian-society-of-professionals-in-disability-management-appoints-new-chair-to-re-establish-international-return-to-work.html", "country": "US", "domain_rank": 767, "title": "Canadian Society of Professionals in Disability Management Appoints New Chair to Re-Establish International Return-to-Work Goals", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.962, "site_type": "news", "published": "2018-01-31T21:00:00.000+02:00", "replies_count": 0, "uuid": "ebb46165d0a31ae759ddc553f09f7da98855dfcb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-canadian-society-of-professionals-in-disability-management-appoints-new-chair-to-re-establish-international-return-to-work.html", "ord_in_thread": 0, "title": "Canadian Society of Professionals in Disability Management Appoints New Chair to Re-Establish International Return-to-Work Goals", "locations": [], "entities": {"persons": [{"name": "evie docouto", "sentiment": "none"}, {"name": "docouto", "sentiment": "none"}], "locations": [{"name": "british columbia", "sentiment": "none"}, {"name": "port alberni", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}], "organizations": [{"name": "society of professionals in disability management", "sentiment": "negative"}, {"name": "nidmar", "sentiment": "negative"}, {"name": "work program", "sentiment": "none"}, {"name": "iso", "sentiment": "none"}, {"name": "workplace safety and insurance board", "sentiment": "none"}, {"name": "canadian society of professionals in disability management", "sentiment": "none"}, {"name": "national institute of disability management and research", "sentiment": "none"}, {"name": "international disability management standards council", "sentiment": "none"}, {"name": "certification council", "sentiment": "none"}, {"name": "wsib", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New chair partners with NIDMAR to tackle increasing case complexity\nPORT ALBERNI, British Columbia--(BUSINESS WIRE)-- Vice President Evie DoCouto, head of the Return to Work Program at Ontario’s Workplace Safety and Insurance Board (WSIB), has been appointed chair of the Canadian Society of Professionals in Disability Management. In this role, she also serves as chair of the Canadian Certification Council, which awards certificates in disability management (DM) under the auspices of the International Disability Management Standards Council (IDMSC) ─ a standard of excellence in the DM field comparable to ISO certification in other sectors.\nThe professional designations of Certified Disability Management Professional (CDMP) and Certified Return to Work Coordinator (CRTWC) are administered in Canada by the National Institute of Disability Management and Research (NIDMAR).\n“As chair, a first step will be to provide strategic direction to re-establish the Society through recruitment of the board,” Ms. DoCouto explains, adding, “I’ll be working very closely with NIDMAR to entrench the curriculum more closely with what we do at the WSIB, and to promote the CDMP and CRTWC designations in Ontario, Canada, and internationally.”\nMembers of the Canadian Society of Professionals in Disability Managements achieve certification through a combination of academic course work and real-life work experience. Similarly, Ms. DoCouto earned her academic credentials while continuing a 27-year career with the WSIB. She holds both a Master of Science from the University of Toronto and an MBA from Washington State University.\nCurrently, Ms. DoCouto and the staff of 380 employees in the WSIB’s Return to Work Program have achieved a 92 percent success rate in getting people back on the job with no wage loss within one year of being injured.\nHowever, she notes, “The world of work is changing around us. The nature of cases 10 years ago looked much different than they do today. Mental health cases are on the rise. Minimum wage legislation has an impact, as do demographics, immigration, and an aging work force. All these things create case complexity and people under these circumstances are more vulnerable.”\nIn response, the WSIB has created a renewed return to work strategy that will be part of a new customer-centric service model, a key pillar of which is a strengthened, professional work force, ultimately leading to more employees gaining CDMP and CRTWC certification to aid them in handling complex cases.\n“We will support all our return to work specialists in achieving the CDMP designation. As a result, our employees are feeling empowered that they will now have a stronger voice than they’ve had in the past to impact return to work outcomes,” stresses Ms. DoCouto. “Through my role as chair of the Society of Professionals in Disability Management, I hope to encourage other organizations to have their staff attain the designation as well.”\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005499/en/\nFor more information:\nWolfgang Zimmermann, 778 421-0821, Ext. 202\nExecutive Director, NIDMAR\nwolfgang@nidmar.ca\nwww.nidmar.ca\nor\nEvie DoCouto, 416 344-4894\nVice President, Return to Work Program, WSIB\nChair, Canadian Society of Professionals in Disability Management\nEvie_DoCouto@wsib.on.ca\nSource: Canadian Society of Professionals in Disability Management", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.nidmar.ca&esheet=51751420&lan=en-US&anchor=www.nidmar.ca&index=1&md5=6f0726cb4c5f977637f6c554673ebe59", "http://www.businesswire.com/news/home/20180131005499/en/"], "published": "2018-01-31T21:00:00.000+02:00", "crawled": "2018-01-31T22:54:22.027+02:00", "highlightTitle": ""}