{"organizations": [], "uuid": "560a1afc1ec760a632058cfe1bcdea16442972c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-acm-global-laboratories-announces-strategic-acquisition-of-drugscan-and-dsi-medical-services-growing-international.html", "country": "US", "domain_rank": 767, "title": "ACM Global Laboratories Announces Strategic Acquisition of DrugScan and DSI Medical Services Growing International Laboratory Business", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-16T17:00:00.000+02:00", "replies_count": 0, "uuid": "560a1afc1ec760a632058cfe1bcdea16442972c8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-acm-global-laboratories-announces-strategic-acquisition-of-drugscan-and-dsi-medical-services-growing-international.html", "ord_in_thread": 0, "title": "ACM Global Laboratories Announces Strategic Acquisition of DrugScan and DSI Medical Services Growing International Laboratory Business", "locations": [], "entities": {"persons": [{"name": "globa", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "rochester", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "rochester regional health", "sentiment": "neutral"}, {"name": "horsham", "sentiment": "neutral"}, {"name": "dsi medical services growing international laboratory business", "sentiment": "neutral"}, {"name": "drugscan, inc.", "sentiment": "none"}, {"name": "global laboratories", "sentiment": "none"}, {"name": "dsi medical services, inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROCHESTER, N.Y. & HORSHAM, Pa.--(BUSINESS WIRE)-- Rochester Regional Health, a $2.2 billion integrated health care delivery system with more than 17,000 employees, has announced that wholly-owned subsidiary, ACM Global Laboratories, has added to its portfolio with the strategic acquisition of Philadelphia-based DrugScan, Inc. and DSI Medical Services, Inc. ACM currently operates in more than 65 countries, with key offices in the United States, the United Kingdom, Singapore, China and India. DrugScan is a best-in-breed toxicology laboratory testing company with a thirty-year track record of delivering innovative medication monitoring solutions to healthcare providers across the United States. As toxicology testing demand grows in the wake of the national opioid epidemic, health systems nationally will need to partner with innovative companies like DrugScan to help providers manage and treat patients with complex medication needs.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180116005520/en/\nAdding DrugScan to our ACM Global Laboratories portfolio positions Rochester Regional Health to lead the way on the front lines of the opioid crisis here and across the nation. The addition of DrugScan/DSI adds to ACM’s strong, established laboratory service portfolio and drug testing capabilities. ACM completed its acquisition of DrugScan and DSI Medical Services on December 31, 2017. ACM will retain DrugScan and DSI Medical Services’ leadership, locations and brand names.\n“Rochester Regional Health is a recognized leader in integrated health services and we are excited to continue to fuel the rapid growth of ACM Global Laboratories with strategic acquisitions of high performing, innovative companies like DrugScan and DSI Medical,” said Eric Bieber, MD, president and CEO, Rochester Regional Health. “As the traditional healthcare marketplace continues to evolve, Rochester Regional’s overall growth strategy of investing beyond the traditional healthcare vertical will continue to be an important part of our overall growth strategy.”\nThis acquisition also reaffirms ACM’s commitment to combat the opioid crisis via DrugScan’s toxicology drug testing capabilities across the continental United States and Canada.\n“This acquisition provides the comprehensive platform that ACM needs to accelerate its growth in the toxicology drug testing market,” says John Foley, president, ACM Global Laboratories. “In the last decade, we’ve seen the toxicology market nearly double in size as health systems seek to partner with innovative laboratory providers that can help safely manage patients with complex medication needs. We anticipate that dynamic growth to continue into the future as healthcare leaders like Rochester Regional develop comprehensive programs to combat the opioid epidemic.”\nAbout ACM Global Laboratories\nACM Global Laboratories , an affiliate of Rochester Regional Health, is one of the largest global independent central labs in the industry. ACM is CAP and SAMHSA certified. The company delivers high-quality laboratory testing and diagnostic lab services in support of both clinical trials research, toxicology and individual patient care. ACM provides a powerful combination of operational excellence, scientific expertise, and unsurpassed global service to customers in more than 65 countries. ACM performs more than 20 million laboratory tests each year—spanning all medical disciplines including pathology, microbiology, molecular diagnostics, toxicology, and more. For more information, visit www.acmgloballab.com or call +1 866 405 0400.\nAbout Rochester Regional Health\nRochester Regional Health is an integrated health services organization serving the people of Western New York, the Finger Lakes and beyond. The system includes five hospitals; primary and specialty practices, rehabilitation centers, ambulatory campuses and immediate care facilities; innovative senior services, facilities and independent housing; a wide range of behavioral health services; and Rochester Regional Health Laboratories and ACM Global Laboratories, a global leader in patient and clinical trials. Rochester Regional Health is the region’s second largest employer. Learn more at RochesterRegional.org .\nAbout DrugScan, Inc.\nDrugScan is a preeminent national toxicology laboratory that delivers a range of solutions to improve patient care; from medical management and drug testing to enhancing pharmaceutical drug development through Category 1 abuse-deterrent studies. DrugScan is proud of its distinction as a College of American Pathologists (CAP) accredited toxicology laboratory, ensuring consistently high levels of service, strict compliance with regulations, and achievement of the highest standards of accuracy, professionalism and responsiveness. DrugScan has been certified by the Substance Abuse and Mental Health Services Administration (SAMHSA) since 1989. Visit www.DrugScan.com .\nAbout DSI Medical Services, Inc.\nDSI Medical is the National Leader in Drug and Alcohol Program Management Services, providing drug and alcohol testing services for company substance abuse testing programs nationwide. Our service and years of experience assure compliance for those companies operating in regulated environments. Founded in 1991, DSI quickly gained a reputation as a leader in providing complete management and oversight for substance abuse testing programs. DSI Medical is a third party administrator (TPA) of employer testing and onboarding services. With an elite, experienced and knowledgeable staff – well versed in Federal, State and local regulations – their customers benefit from a Drug and Alcohol Program that insures sound decisions, defensibility and mitigated risk. Visit DSI Medical .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116005520/en/\nRochester Regional Health\nJessica Sanderson, 585-922-3086\nJessica.Sanderson@rochesterregional.org\nSource: ACM Global Laboratories", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fdsimed.com%2F&esheet=51743365&newsitemid=20180116005520&lan=en-US&anchor=DSI+Medical&index=4&md5=9c060bbc47cfcbfe4e23c8f5ebd9af5c", "http://www.businesswire.com/news/home/20180116005520/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.DrugScan.com&esheet=51743365&newsitemid=20180116005520&lan=en-US&anchor=www.DrugScan.com&index=3&md5=4d62e0a9cf0020efcebaccea2161cf89", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.acmgloballab.com&esheet=51743365&newsitemid=20180116005520&lan=en-US&anchor=www.acmgloballab.com&index=1&md5=03a452a83e9e983b954fada8a54d06e6", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.rochesterregional.org%2F&esheet=51743365&newsitemid=20180116005520&lan=en-US&anchor=RochesterRegional.org&index=2&md5=457d3be9e57ef740ea93f72e39d4579a"], "published": "2018-01-16T17:00:00.000+02:00", "crawled": "2018-01-16T19:12:38.021+02:00", "highlightTitle": ""}