{"organizations": [], "uuid": "9e7f775e4c2559c9fe54491c555d9d61d2bd1aa7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/britain-retail-outlook/rpt-preview-mss-clothing-sales-to-fall-again-as-uk-grocers-show-resilience-idUSL8N1P30OA", "country": "US", "domain_rank": 408, "title": "RPT-PREVIEW-M&S's clothing sales to fall again as UK grocers show resilience", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T14:58:00.000+02:00", "replies_count": 0, "uuid": "9e7f775e4c2559c9fe54491c555d9d61d2bd1aa7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/britain-retail-outlook/rpt-preview-mss-clothing-sales-to-fall-again-as-uk-grocers-show-resilience-idUSL8N1P30OA", "ord_in_thread": 0, "title": "RPT-PREVIEW-M&S's clothing sales to fall again as UK grocers show resilience", "locations": [], "entities": {"persons": [{"name": "chr", "sentiment": "negative"}, {"name": "james davey", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "morrisons", "sentiment": "negative"}, {"name": "m&s", "sentiment": "negative"}, {"name": "tesco", "sentiment": "negative"}, {"name": "sainsbury", "sentiment": "negative"}, {"name": "marks & spencer", "sentiment": "none"}, {"name": "debenhams", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats Jan 5 story with no changes to text)\n* M&S, Tesco, Sainsbury‘s, Morrisons all report on Christmas\n* M&S Q3 like-for-like clothing sales forecast down 3.4 pct\n* Tesco Q3 underlying sales up 1.7-2.4 pct, Xmas up 2.4-3.2 pct\n* Sainsbury’s Q3 underlying sales seen up 0.9 pct\n* Morrisons underlying Christmas sales forecast up 1.8 pct\nBy James Davey\nLONDON, Jan 5 (Reuters) - Britain’s Marks & Spencer is expected to report another fall in comparable clothing sales in its Christmas quarter, though the major grocers are forecast to report solid trading as cash-strapped consumers prioritised spend on food and drink.\nChristmas trading updates from British retailers so far have been mixed. Clothing chain Next provided some initial cheer, beating expectations and upgrading its profit forecast. But the mood was quickly soured by a profit warning from department store chain Debenhams.\nWith Britons being squeezed by slow wage growth and a jump in inflation that followed the 2016 Brexit vote, overall expectations going into the key Christmas trading period were subdued.\n“Consumer confidence is low, and shoppers have exercised extreme caution or shopped strategically online, rather than visiting bricks-and-mortar stores or making impulse purchases. As such retailers, and in particular fashion retailers, have felt a fall in footfall and consumer spend,” said Sophie Michael, head of retail and wholesale at BDO, the business advisory firm.\nWith investors concerned about a further squeeze on spending in 2018, they will focus on retailers’ comments on the outlook.\nFor M&S&rsquo;s third quarter to Jan. 6 analysts are on average forecasting a 3.4 percent fall in like-for-like clothing and home sales - much worse than the previous quarter’s 0.1 percent fall. Analysts are also forecasting a 1.1 percent drop in like-for-like food sales - a fourth straight quarter of decline.\nM&S, which said in November it would speed up store closures and re-position its food offer, will likely point to harder comparative numbers with last year in the third quarter compared to the second and the tough overall market when it reports on Thursday.\n“Like-for-like declines in both core segments...will not help spark a reassessment of the bear case, but we think the numbers would be respectable given the starting point and the market context,” said analysts at Barclays.\nTESCO MOMENTUM Industry data published in December showed Tesco, Britain’s biggest retailer, outperforming its three major UK supermarket rivals - Sainsbury‘s, Asda and Morrisons - and entering the key festive period with momentum.\nOn Thursday it will publish data for its third quarter to Nov. 25 as well as the six weeks to Jan. 6. Analysts forecast like-for-like sales up 1.7-2.4 percent for the quarter and 2.4-3.2 percent for the Christmas period. Tesco’s second quarter UK like-for-like sales rose 2.1 percent.\nNo. 2 supermarket group Sainsbury’s updates on third quarter to Jan. 6 trading on Wednesday. Analysts are on average forecasting a like-for-like sales rise of 0.9 percent - a slight pick-up from its second quarter.\nNo. 4 Morrisons reports on Tuesday, with analysts on average forecasting group like-for-like sales up 1.8 percent - a deceleration from its previous quarter but a ninth straight quarter of growth.\nWhile the big Quote: d retailers appear to have performed respectably, a theme for the period is likely to be a further shift in market share to the German discounters, reflecting defensively minded consumers.\nAldi UK has already reported an over 15 percent year-on-year rise in total December sales, driven by strong demand for its premium ranges. Lidl UK is scheduled to update on Wednesday.\nIndustry data from researcher Kantar Worldpanel on Tuesday will provide an early guide to Sainsbury‘s, Tesco’s and Lidl’s performance before their official updates. (Editing by Adrian Croft)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T14:58:00.000+02:00", "crawled": "2018-01-09T17:19:06.003+02:00", "highlightTitle": ""}