{"organizations": [], "uuid": "232bf603ab66006f0bf92feb788899b8766b8369", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220869932&w=1200&r=LYNXMPEE0914A", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-russia-alrosa-gas-competition/russian-competition-watchdog-investigates-alrosa-gas-assets-sale-idUSKBN1EZ233", "country": "US", "domain_rank": 408, "title": "Russian competition watchdog investigates Alrosa gas assets sale", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T00:11:00.000+02:00", "replies_count": 0, "uuid": "232bf603ab66006f0bf92feb788899b8766b8369"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-russia-alrosa-gas-competition/russian-competition-watchdog-investigates-alrosa-gas-assets-sale-idUSKBN1EZ233", "ord_in_thread": 0, "title": "Russian competition watchdog investigates Alrosa gas assets sale", "locations": [], "entities": {"persons": [{"name": "vladimir putin", "sentiment": "none"}, {"name": "alrosa", "sentiment": "none"}, {"name": "igor sechin", "sentiment": "none"}, {"name": "putin", "sentiment": "none"}, {"name": "sechin", "sentiment": "none"}], "locations": [{"name": "alrosa", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "rosneft", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOSCOW (Reuters) - The Russian Federal Anti-Monopoly Service (FAS) said on Wednesday it is investigating the forthcoming sale of natural gas assets by Russian diamond producer Alrosa ( ALRS.MM ) after a complaint from would-be buyer, energy giant Rosneft ( ROSN.MM ).\nRussia’s largest oil producer Rosneft, run by a close ally of President Vladimir Putin, has said it was not satisfied with some terms of the sale and the reliability of the stated resources of the auctioned gas deposits.\nThe watchdog said there were signs of irregularities in the terms of the sale, scheduled for Feb. 19. It said it would consider the complaint from Rosneft on Jan. 15, looking into the size of the downpayment of 21 billion roubles and the deadline for payments set for Jan 10. The starting price for the assets is 30 billion roubles ($526 million).\nAlrosa declined immediate comment.\nRosneft, whose chief executive is Igor Sechin, is one of the potential buyers of the assets but decided against participation in the sale, saying the auction terms were unacceptable.\nSechin has been an ally of Putin since the president’s early political career in the mayor’s office of St Petersburg in the 1990s.\nPREVIOUS DEAL COLLAPSED OVER PRICE In 2013, Rosneft had agreed to buy the same gas assets and other oil and gas fields in Russia’s far eastern region from Alrosa for $1.4 billion, in a drive to expand its natural gas business.\nThat deal fell through because of disagreement over price. At the time the fields were expected to increase Rosneft’s recoverable gas reserves by more than 200 billion cubic meters.\nRussia’s top non-state gas producer Novatek ( NVTK.MM ) has said it is interested in participating in the current auction and buying Alrosa’s gas fields. The Finance Ministry has said that seven bidders were expected to take part in the auction.\nRosneft and its subsidiary Bashneft ( BANE.MM ) had applied to the Federal Anti-Monopoly Service (FAS) for clearance to take part in the Alrosa auction before launching the complaint.\n“The request itself is not participation,” Rosneft spokesman Mikhail Leontyev said.\nHe said the sales terms would not allow any future buyer to log claims with the seller in the event the resources turn out to be lower than initially stated.\n“At the moment, with the information we have about the asset, we can’t risk the interests of our shareholders. We won’t play under such rules,” the spokesman said, adding that Rosneft had filed complaints to the FAS, Finance Ministry and subsoil agency Rosnedra.\nLast year, Sechin won a legal battle with businessman Vladimir Yevtushenkov and his Sistema ( AFKS.MM ) conglomerate over the Bashneft oil company, leaving Sistema out of pocket to the tune of 100 billion roubles ($1.7 billion).\nThat dispute pitted the powerful Rosneft chief executive against billionaire Yevtushenkov, who media reports said was close to Prime Minister Dmitry Medvedev.\n($1 = 57.0019 roubles)\nReporting by Vladimir Soldatkin and Diana Asonova; Editing by Christian Lowe and Elaine Hardcastle\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T00:11:00.000+02:00", "crawled": "2018-01-11T03:45:50.021+02:00", "highlightTitle": ""}