{"organizations": [], "uuid": "8d5d0db0bd543260d7cdc125be2017040dcacc37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-insulin-algorithms-changes-name-to-mellitus-health.html", "country": "US", "domain_rank": 767, "title": "Insulin Algorithms Changes Name To Mellitus Health", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T17:06:00.000+02:00", "replies_count": 0, "uuid": "8d5d0db0bd543260d7cdc125be2017040dcacc37"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-insulin-algorithms-changes-name-to-mellitus-health.html", "ord_in_thread": 0, "title": "Insulin Algorithms Changes Name To Mellitus Health", "locations": [], "entities": {"persons": [{"name": "josh davidson", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "insulin algorithms", "sentiment": "negative"}, {"name": "mellitus health", "sentiment": "none"}, {"name": "fda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 16, 2018 /PRNewswire/ -- Insulin Algorithms, a healthcare technology company committed to improving diabetes management by developing best-in-class clinical tools, announced today that it is changing its corporate name to Mellitus Health. The name change reflects the company's growing portfolio of clinical tools for diabetes management.\n\"The new name – Mellitus Health – enables us to more accurately position ourselves as a company committed to driving innovation in clinical diabetes management,\" said Josh Davidson, CEO of Mellitus Health. \"We are focused on creating tools that help providers, payers and potential partners improve health outcomes for people living with diabetes.\"\nMellitus Health's first product, Insulin Insights, is an FDA cleared, CE marked decision-support tool utilizing proprietary algorithms proven to help clinicians lower HbA1c and maintain proper blood sugar levels. It provides fast, detailed analyses and titration recommendations, enabling clinicians to optimize insulin therapy. Insulin Insights is compatible with any glucometer and works with all brands of insulin and the more than 125 insulin regimens endorsed by the American Diabetes Association.\nWhen managed properly, insulin is one of the most effective treatments for patients with diabetes. Every 1 percent drop in HbA1c equates to a 40 percent drop in the risk for diabetes complications and an average healthcare savings of $1,300.\n\"Managing an insulin regimen can be intimidating for many clinicians, but failure rates with non-insulin agents show that better delivery of medicine is needed at every stage of diabetes progression,\" said Vivian Fonseca, MD, FRCP, Chief of the Section of Endocrinology at Tulane University Medical Center and past President for Science and Medicine of the American Diabetes Association. \"The most important thing is to get the patient's blood glucose under control without delay, so it makes sense that Mellitus Health wants to help clinicians make better decisions about the medicines they prescribe before insulin is required.\"\nThe new name is effective immediately.\nAbout Mellitus Health\nMellitus Health is a healthcare technology company headquarter in Los Angeles, CA. Its first product, Insulin Insights, received FDA clearance in 2017. Insulin Insights helps clinicians analyze blood-glucose monitor data and adjust a patient's insulin regimen in seconds, using algorithms that are clinically proven to lower HbA1c levels. It is the only comprehensive dosing solution for all patients and all insulin regimens. Insulin Insights uses algorithms developed over 35 years by Mayer B. Davidson, MD, a former president of the ADA and the recipient of its 2016 Outstanding Physician-Clinician Award. Thousands of clinicians have been trained in Dr. Davidson's insulin dosing method, and his algorithms have been used for decades to manage blood sugars in some of the most challenging patient populations. For more information, please visit www.mellitushealth.com .\nCONTACT: Craig Lewis, craigl@mellitushealth.com , 424-218-0793\nView original content with multimedia: http://www.prnewswire.com/news-releases/insulin-algorithms-changes-name-to-mellitus-health-300582174.html\nSOURCE Mellitus Health", "external_links": ["http://www.mellitushealth.com/", "http://www.prnewswire.com/news-releases/insulin-algorithms-changes-name-to-mellitus-health-300582174.html"], "published": "2018-01-16T17:06:00.000+02:00", "crawled": "2018-01-16T18:22:33.004+02:00", "highlightTitle": ""}