{"organizations": [], "uuid": "9c099304ef830b75da86536dbb2efc408dd019fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 56, "shares": 56, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219519170&w=1200&r=LYNXMPEE040AV", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-china-pboc-payments-analysis/code-crackdown-china-payments-restrictions-to-hit-profits-idUSKBN1EU0H7", "country": "US", "domain_rank": 408, "title": "Code crackdown: China payments restrictions to hit profits", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T08:10:00.000+02:00", "replies_count": 0, "uuid": "9c099304ef830b75da86536dbb2efc408dd019fc"}, "author": "", "url": "https://www.reuters.com/article/us-china-pboc-payments-analysis/code-crackdown-china-payments-restrictions-to-hit-profits-idUSKBN1EU0H7", "ord_in_thread": 0, "title": "Code crackdown: China payments restrictions to hit profits", "locations": [], "entities": {"persons": [{"name": "cate cadell", "sentiment": "none"}, {"name": "shu zhang", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "pboc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "tencent group holdings", "sentiment": "none"}, {"name": "people’s bank of china", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 6:08 AM / Updated 15 hours ago Code crackdown: China payments restrictions to hit profits Cate Cadell , Shu Zhang 6 Min Read \nBEIJING (Reuters) - A decision by China’s central bank to rein in reserve funds held by payment firms could cost the industry upwards of $689 million a year, spur consolidation and alter the way Asia’s biggest tech firms move money. \nMobile payments using in-app QR or bar-codes have become ubiquitous for everything from taxis to grocery shopping and bike rental in China in recent years, with customers making 19 trillion yuan ($2.9 trillion) in transactions in 2016, according to iResearch. \nThe rapid uptake has spurred fears that mobile payment firms, without oversight, could misuse funds held while transactions between users and merchants clear. \nRegulations unveiled by the People’s Bank of China (PBOC) on Saturday require firms to allocate 42 to 50 percent of their total client funds in regulated interest-free reserve accounts by April, up from a current rate of 12 to 20 percent. \nThe move will hit services backed by Tencent Group Holdings Ltd ( 0700.HK ) and Alibaba Group Holding Ltd ( BABA.N ) affiliate Ant Financial, which together make up over 93 percent of China’s online payments market, according to research firm Analysys International. \nIt’s part of a two-year government crackdown on financial risks in the country’s fast growing and loosely regulated online finance sector, aimed at limiting the activities of third-party payment services, online asset managers, micro lenders and others. \nThe central bank has said it will eventually raise the ratio to 100 percent but hasn’t given a timeline. \nThe moves will impact a major source of profit for online payment firms, particularly those that relied on the interest income for fast growth during the early boom years. \n“From an industry perspective, these changes will alter the economics underlying certain revenue streams,” said James Lloyd, Asia-Pacific Fintech lead at EY. \n“Clearly the PBOC is increasingly considering the potential financial stability risks associated with large-scale mass-market non-traditional players.” INTEREST INCOME \nChina’s e-commerce and mobile payments market has enjoyed explosive growth in recent years with Alipay and Tencent’s Tenpay each accumulating over 500 million users. \nClient reserve funds are prepaid sums from buyers that are held temporarily by payment companies before they are transferred to merchants. Payment firms typically deposit them into bank accounts where they earn interest. \nInterest income earned on those reserve funds accounted for 11 percent of total income for internet-based payment companies, data from Zhongtai Securities shows. Slideshow (3 Images) \nThe latest hike in reserves will slash more than 4.48 billion yuan ($689 million) in annual interest earnings from the industry, according to Reuters calculations, under the assumption that payment companies could have earned 3 percent annualized interest rate on those funds. \nAnalysts say large, diversified firms such as Ant Financial and Tencent will be able to absorb the costs, and seek to replace revenue with income from other products, including wealth management tools and micro-loans. \nThe move puts extra pressure on the two top firms, however, who are facing barriers at home and abroad as regulators balk at the technical and financial implications of their rapid expansion. \nAnt Financial on Wednesday announced it has withdrawn a $1.2 billion acquisition bid for U.S. money transfer firm Moneygram International Inc ( MGI.O ) after U.S. government panel rejected the bid over national security concerns. \nAnt Financial said it was supportive of the PBOC’s move. Tencent did not respond to a request for comment. \nSmaller payment firms could face consolidation as their margins slide. There are currently more than 200 companies licensed to provide such services. \nShanghai-based All In Pay Network Service, which has 1.7 million merchants, said it would adjust its business to comply with the central bank’s new policy. \n“In terms of the actual impact it will have on our company, that still remains to be seen,” it said. GREATER REGULATORY OVERSIGHT \nThe move will allow China’s central bank to gain more insight into capital flows within the industry as it seeks to quell financial risks associated with the massive funds now kept by third-party payment companies. \nThe rules on reserve funds also pave the way for the establishment of a new government-directed clearing house for third-party payment companies, which is expected to launch in June. The new entity will enable the central bank to track all online financial transaction data and the flow of funds in the industry, analysts say. \nIn August, the regulator instructed third-party payment firms to route all of their transactions through the centralized clearing house, in which its affiliated companies own largest stakes. \nIn addition to new rules on reserve funds and clearing, last week the PBOC also announced plans to cap barcode payments to as low as 500 yuan to rein in risks arising from the popular service. \n“Preventing risks remains the core theme in 2018,” CITIC Securities said in a research note. “Payment giants are likely to slow down their aggressive marketing deployed in the early stages of development and pay more attention to compliance.” Additional Reporting by SHANGHAI Newsroom; Editing by Lincoln Feast", "external_links": [], "published": "2018-01-05T08:10:00.000+02:00", "crawled": "2018-01-05T08:21:15.007+02:00", "highlightTitle": ""}