{"organizations": [], "uuid": "2d8c06f00f86579a2e878d5d95f21af20dad3aef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/01/fortune-logo.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/31/brainstorm-health-daily-01-31-18/", "country": "US", "domain_rank": 1196, "title": "Brainstorm Health: Implications of Amazon in Health Care, CDC Director Resigns, Alzheimer's Brain Pacemaker | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.705, "site_type": "news", "published": "2018-01-31T18:32:00.000+02:00", "replies_count": 0, "uuid": "2d8c06f00f86579a2e878d5d95f21af20dad3aef"}, "author": "Clifton Leaf", "url": "http://fortune.com/2018/01/31/brainstorm-health-daily-01-31-18/", "ord_in_thread": 0, "title": "Brainstorm Health: Implications of Amazon in Health Care, CDC Director Resigns, Alzheimer's Brain Pacemaker | Fortune", "locations": [], "entities": {"persons": [{"name": "hal wolf", "sentiment": "negative"}, {"name": "clifton leaf", "sentiment": "negative"}, {"name": "wolf", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "healthcare information", "sentiment": "negative"}, {"name": "implications of amazon in health care", "sentiment": "negative"}, {"name": "cdc", "sentiment": "negative"}, {"name": "aetna", "sentiment": "none"}, {"name": "cvs", "sentiment": "none"}, {"name": "systems society", "sentiment": "none"}, {"name": "hipaa", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "j.p. morgan chase", "sentiment": "none"}, {"name": "berkshire hathaway", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Clifton Leaf 4:32 PM EST \nHal Wolf, the CEO of the non-profit Healthcare Information and Management Systems Society—better known by its acronym, HIMSS —had suspected something was up. The tantalizing clue, he says, was that Amazon last week had begun looking to hire a regulatory expert on HIPAA, the complicated (and controversial) piece of health privacy legislation that touches virtually every part of our national healthcare system. And so when news broke yesterday that Amazon, J.P. Morgan Chase , and Berkshire Hathaway were creating a joint venture to reduce healthcare costs and improve employee satisfaction, Wolf said his first response was less surprise than “keen interest” and excitement. \nThe move by these hugely successful companies is, in fact, only the latest in a slew of corporate actions aimed at reconfiguring healthcare in the U.S.—a system where outcomes, for the most part, remain woefully disconnected from costs, and where those costs continue to soar without the mooring of reason. The Amazon et alia news follows CVS’s bid to purchase Aetna (which we’ve written about here and here ), and Apple’s head-turning push into electronic health records , announced just last week. “These are examples of people who are stepping in now,” says Wolf, “and I think that the industry’s ready for this disruption model. We’ve been waiting for it.” And while we don’t yet have a lot of specifics on what the Amazon venture with JPM and Berkshire will entail—the companies smartly left the details vague—“we can make up a few things,” says Wolf. \nSo, with the help of Mr. Wolf and others, I thought I would do just that. Here, a few made-up observations and predictions: 1) It isn’t necessarily a non-profit. \nThe trio announced in their press release that they would jointly form an “independent company that is free from profit-making incentives and constraints”—and the nuance in those words isn’t there by accident. Indeed, you might use the same phrasing to describe Amazon itself, which blithely went through the first 23 quarters of its existence operating free from a profit-making imperative . (For those counting at home, Amazon—now the fourth-most valuable and the single-most feared corporation in the world—has been in the red for 34 of its 87 quarters as a publicly traded enterprise.) The distinction between “free from” the necessity to turn a profit and “non-profit” is important: These companies are not only willing to experiment with new ideas for delivering and managing care, they’re eager to do so—whatever the time (and presumably, financial) investment might be. \nAmazon spent its sweet time achieving retail dominance. J.P. Morgan grew with deliberate steps and careful acquisitions into a global banking giant. Berkshire Hathaway has always been the quintessential buy-and-hold company—and helps ensure that its Class A shareholders are focused on the same long-term goals by refusing, for example, to indulge in gimmicks like stock splits. (Berkshire Class A shares now trade for about $322,000, an ante that tends to dissuade short-termers and speculators from jumping in and out.) \nAll three partners in this effort believe in the long game. Which brings up observation No. 2: 2) Companies will continue to “own” the healthcare cost problem. \nFor all the heady talk about universal health coverage and/or “Medicare for all,” companies know they’re stuck holding a good chunk of the national $3.3 trillion medical bill —a bill that has been growing like a parasitic “tapeworm,” as Berkshire Hathaway CEO Warren Buffett described it in the companies’ joint press release. The Kaiser Family Foundation calculates that employers contributed $12,865 per covered worker choosing a family health plan in 2016—an expenditure that’s up 58% since 2006. (The employee share of that premium bill rose 78% over the same time.) The latest AMZN-JPM-BRK move is an acknowledgment that the buck stops there, in the corporate accounting department, at least for the foreseeable future. \nThat’s actually a more meaningful statement than many might realize. It’s been all-too-easy for corporate leaders to throw up their hands and let others solve the growing healthcare cost problem. No longer. The influential and canny CEO billionaires Jeff Bezos, Jamie Dimon, and Warren Buffett have now declared that they own this problem, and they plan on solving it, and you can bet other corporate honchos will soon follow their lead. They’ll have to. And that might be the most significant outcome of this venture. 3) This will be a real-test of patient-centered healthcare. \nDimon said it well: “Our people want transparency, knowledge and control when it comes to managing their healthcare.” The means to achieve this will no doubt come from technology—apps, for example, that aggregate health records on a patient’s smartphone or other device. (You’ve heard this all before….) \nWhat will make this different, I predict, is that patients will make real and frequent choices with this instantly available data: For lack of a better verb, they’ll “Amazon” it. Start with the more straightforward behavioral changes that might be needed to develop a healthier lifestyle or quit a bad habit. An employee who smokes, for example, might be given a dozen webpages’ worth of options for help in quitting, with each offering rated by fellow users (say, the employees and family members of the three companies). But instead of paying for a program—as you would a book or movie on Amazon—you’d get an incentive: a credit, maybe, to be used against your health insurance premium, or a free download at Amazon, or a discounted checking account at Chase. \nThe keys here are personalization, ease, and self-reward. Employees could conceivably order with a swipe or click incentives to manage their blood glucose levels, lower their blood pressure or cholesterol, exercise, get substance abuse counseling, or check in regularly for maternity care. They could be rewarded for switching to generics or donating blood, for taking their meds on time….or, more radically, for posting their genetic data to an anonymized, shared research database that might be used to identify those at risk for certain diseases or to identify those who respond better to specific classes of drugs, from beta blockers to cancer medicines. With a potential universe of nearly two and a half million people (including employees and their families), the opportunity for pharmacogenomic and clinical research is immense. \n“Getting employees engaged [in prevention and wellness efforts], I’m sure, will be a part of the upfront model,” says Wolf. “The second piece of it—and this gets to the extension of digital wealth and connectivity—is how different an ecosystem they can create.” Where can they define best practices? “How can they create not only prevention and engagement in terms of the physical space of healthcare,” asks Wolf, “but also in the virtual space of healthcare?” \nThat’s the answer we’ll all be looking for. My guess is, this venture will give us far more insight into effective care delivery than we can now imagine. Clifton Leaf, Editor in Chief, FORTUNE @CliftonLeaf DIGITAL HEALTH \nA “brain pacemaker” for Alzheimer’s? Deep brain stimulation, or DBS, is a technique that’s already used to treat many Parkinson’s disease patients in order to combat their hand tremors. But could it be used to tackle cognitive decline in Alzheimer’s disease? That’s the provocative (and extremely early-stage) question posed by researchers at the Ohio State University Wexner Medical Center. The basic theory goes that electrical stimulation of the brain could help mollify Alzheimer’s symptoms and improve brain function. ( BBC ) INDICATIONS \nMassachusetts pharmacist sentenced to 8 years over meningitis outbreak. In 2012, a meningitis outbreak linked to unsanitary and unsafe conditions at a New England compounding pharmacy killed more than 70 people and made hundreds of others sick. Now, the pharmacist tied to the outbreak, Glenn Chin, has been sentenced to eight years in prison for fraud and racketeering charges (but was cleared by a federal jury in October of second degree murder). ( Reuters ) THE BIG PICTURE \nIndiana considers raising smoking age to 21. Indiana may become the sixth state in the country to raise the legal smoking age from 18 to 21, following in the footsteps of California, Hawaii, New Jersey, Maine, and Oregon. Indiana has a particularly high rate of tobacco use, with 21% of adults and 11% of teens using cigarettes. ( Fortune ) \nCDC director resigns amid tobacco stock scandal. CDC director Dr. Brenda Fitzgerald resigned Wednesday following a Politico investigation that found she had bought tobacco company stock despite making anti-smoking efforts a key part of her public health agenda. Fitzgerald handed her resignation in to new Health and Human Services (HHS) Secretary Alex Azar and will be temporarily replaced by acting director Anne Schuchat. ( Politico ) REQUIRED READING ", "external_links": [], "published": "2018-01-31T18:32:00.000+02:00", "crawled": "2018-01-31T23:48:18.017+02:00", "highlightTitle": ""}