{"organizations": [], "uuid": "2b0fba1a639236291cfc2c624f0f5d0cfa47ee7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-strong-china-data-cranks-up-pressure-on-bond-markets-idUSL8N1PD293", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Strong China data cranks up pressure on bond markets", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T18:03:00.000+02:00", "replies_count": 0, "uuid": "2b0fba1a639236291cfc2c624f0f5d0cfa47ee7b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-strong-china-data-cranks-up-pressure-on-bond-markets-idUSL8N1PD293", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Strong China data cranks up pressure on bond markets", "locations": [], "entities": {"persons": [{"name": "marc jones", "sentiment": "none"}], "locations": [{"name": "asia-pacific", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "morgan stanley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Treasury yields hit highest in 10-months at 2.61 percent\n* MSCI Asia-Pacific index hits record high, 26-yr peak for Nikkei\n* European stocks tick higher in choppy trade\n* Dollar index lifts off 3-year lows but euro on prowl\n* China sees first acceleration in growth in 7 years\n* South Africa, Turkey both hold rates steady\n* Morgan Stanley Q4 profit down 60 pct due to U.S. tax law\nBy Marc Jones\nLONDON, Jan 18 (Reuters) - The first acceleration by China’s giant economy in seven years kept stocks near record highs on Thursday, but added to growing pressure on bond markets as U.S. Treasury yields, the benchmark for global borrowing costs, reached a 10-month high.\nUnderlining the momentum of the world economic expansion into the back end of last year, both Chinese fourth quarter growth of 6.8 percent and December industrial output growth of 6.2 percent were ahead of expectations.\nMost Asian bourses were closing when the data landed but had briefly set a new all-time record after the U.S. blue chip Dow Jones Industrial closed above 26,000 points for the first time on Wednesday.\nChina’s yuan finished strongly to hit its highest since December 2015. Europe’s main FTSE, Dax and CAC40 markets ticked higher too, though moves were choppy, as were Wall Street futures, in the cross currents of rising bond yields.\nAfter a week of trying, the 10-year U.S. Treasury yield passed 2.6 percent to hit 2.613, its highest since March 2017. It drove European counterparts up too with Germany’s 10-year bond yield near a 5-1/2 month top at 0.52 percent.\nWith such encouraging data coming through, “the likelihood we have higher inflation in the big economies is well over 50 percent, so that is the next turning point for the markets,” said SEB investment management’s global head of asset allocation Hans Peterson.\nHe said that raised two big questions. How will central banks respond? And will the rise in bond yields happen at such a pace that it impacts optimism around assets like equities?\n“We are going to change the regime probably within the next 2-3 months,” he said. “Will it be accompanied by rising producer prices? If so then we can live with higher bond yields, otherwise it is a problem for us.”\nThe break higher in U.S. yields also lifted the dollar off a three-year low hit earlier in the day in Asia.\nAhead of U.S. trading though, the euro was regaining traction and last stood at $1.2245, up 0.5 percent on the day but well below a peak of $1.2323 set on Wednesday, the euro’s strongest level since December 2014.\nSome top European Central Bank policymakers speaking in Frankfurt may have been caught off guard by the speed of the euro’s appreciation, said Lee Jin Yang, macro research analyst for Aberdeen Standard Investments in Singapore.\n“Maybe they are trying to manage volatility or slow down the rise,” Lee said referring to Austria’s Ewald Nowotny, who told reporters on Wednesday that the euro’s recent strength against the dollar was “not helpful”.\nTRAINED LIKE DOGS Wall Street was expected to move only fractionally when trading resumes, with investors already digesting another deluge of fourth-quarter company results as well as some mixed jobs and housing market data.\nOne showed the number of Americans filing for unemployment benefits had fallen to the lowest level in 45 years while the other revealed the biggest drop in U.S. homebuilding in over a year.\nThe Canadian dollar eased about 0.1 percent to C$1.2450 , having see-sawed after the Bank of Canada raised interest rates but sounded a cautious tone on the future of the North American Free Trade Agreement (NAFTA).\nEmerging markets must navigate a number of key interest rate meetings including in Turkey, which kept its rates on hold having seen last year’s 18 percent slump in the lira versus the euro drive inflation back into double digits.\nSouth Africa’s central bank also stood pat, which helped the rand score new long-term highs after being sickly for much of 2017. A sounder political backdrop has made it one of the best performing currencies in the world so far this year.\n“In the near term the rand is expected to remain sensitive to sentiment generated by political developments,” South African Reserve Bank Governor, Lesetja Kganyago, said.\nRising U.S. bond yields could cause turbulence for EM debt markets, however. As well as the gains for benchmark Treasuries, the two-year yield hovered at a nine-year high of just over 2 percent.\n“In emerging markets we are trained like dogs,” UBP’s EM macro and FX strategist Koon Chow said about the rising yields. “When we hear that bell ring we want to just run.”\nIn commodities, crude oil prices rose earlier on data showing a decline in U.S. crude inventories and as rebels in Nigeria threatened to attack the country’s petroleum infrastructure, before trimming their gains.\nU.S. crude futures were 10 cents higher at $64.07 a barrel have hit a three-year high of $64.89 on Tuesday.\nSpot gold was steady at $1,333 an ounce, with the dollar’s bounce pulling it back from a four-month high of $1,344.43 set on Monday. (Reporting by Marc Jones; Editing by Catherine Evans)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T18:03:00.000+02:00", "crawled": "2018-01-19T00:51:35.017+02:00", "highlightTitle": ""}