{"organizations": [], "uuid": "fc3afd51248315f33ff85c2d18ef498bcfe61dcb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219636016&w=1200&r=LYNXMPEE040YJ", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-moldova-president/moldovan-leaders-powers-suspended-to-enact-russian-tv-curbs-idUKKBN1EU1LC", "country": "US", "domain_rank": 408, "title": "Moldovan leader's powers suspended to enact Russian TV curbs", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T18:07:00.000+02:00", "replies_count": 0, "uuid": "fc3afd51248315f33ff85c2d18ef498bcfe61dcb"}, "author": "", "url": "https://uk.reuters.com/article/uk-moldova-president/moldovan-leaders-powers-suspended-to-enact-russian-tv-curbs-idUKKBN1EU1LC", "ord_in_thread": 0, "title": "Moldovan leader's powers suspended to enact Russian TV curbs", "locations": [], "entities": {"persons": [{"name": "vladimir putin", "sentiment": "none"}, {"name": "igor dodon", "sentiment": "none"}, {"name": "pavel filip", "sentiment": "none"}, {"name": "dodon", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "moldova", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "min read  kiev", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 4:09 PM / Updated 3 minutes ago Moldovan leader's powers suspended to enact Russian TV curbs Reuters Staff 3 Min Read \nKIEV (Reuters) - A court temporarily suspended the powers of Moldova’s President Igor Dodon on Friday, paving the way for parliament to bypass his veto and enact a law that would restrict Russian TV broadcasts as foreign propaganda. FILE PHOTO: Moldovan President Igor Dodon arrives for a meeting with Russian counterpart Vladimir Putin in Sochi, Russia October 10, 2017. REUTERS/Maxim Shemetov/File Photo \nEx-Soviet Moldova, a small country that borders on the European Union and Ukraine, is politically divided between supporters of closer ties with Moscow and those who seek closer relations with the EU and United States. \nThe president is from the pro-Russia camp, while parliament and the government of Prime Minister Pavel Filip are controlled by parties from the pro-Western camp. \nThe constitutional court temporarily suspended Dodon after he opposed a law passed last month aimed at combating foreign propaganda, legislation which Dodon says is an attempt to foment “anti-Russian hysteria” and violates free speech. \nThe court ruled that Dodon can veto a bill only once and must approve it if it is passed again; by refusing to do so, he had violated his duties. It ordered him suspended until the law is implemented. \nIt was the second time this week the court had taken similar action. He was also temporarily suspended on Tuesday for trying to block the appointment of ministers he accuses of incompetence and links to scandals. \n“As promised, I will not yield to the regime under any pretext. I will not approve of compromised candidates and will not sign laws that are contrary to the interests of citizens,” Dodon wrote on Facebook. \n“As for the current actions of the regime with the support of the Constitutional Court, they will not remain without consequences. After the parliamentary elections that will be held this year, we will have to change and correct many things.” \nDodon and the government have frequently clashed, especially during rows between Moldova and Russia. Last month Moldova recalled its ambassador from Moscow, accusing Russia of harassing and intimidating Moldovan politicians. \nLawmakers are seeking to implement a measure passed in parliament last month to prevent the dissemination of what they describe as “fake news” on foreign channels. \nThe author of the bill, MP Serdjiu Sirbu, denies that it is aimed at any one country. The law bans television channels from airing news and analytical programmes from countries that have not signed up to a European broadcasting agreement, such as Russia. Broadcasters who defy the law can be fined or have their licence revoked after repeated offences. \n“Concerning the law on combating propaganda, it is an outright violation of the freedom of citizens of the Republic of Moldova to obtain information,” Dodon said. \nMost Moldovans speak Romanian. However there is a large minority of Russian speakers, many of whom primarily watch Russian TV channels. Reporting by Matthias Williams; Editing by Peter Graff", "external_links": [], "published": "2018-01-05T18:07:00.000+02:00", "crawled": "2018-01-05T18:27:02.004+02:00", "highlightTitle": ""}