{"organizations": [], "uuid": "d999ee5e4febe9e5bcb080a6e2405dbbcef6af1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104968028-GettyImages-670854616.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/the-san-francisco-da-will-dismiss-thousands-of-marijuana-related-convictions.html", "country": "US", "domain_rank": 767, "title": "The San Francisco DA will dismiss thousands of marijuana-related convictions", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.217, "site_type": "news", "published": "2018-01-31T23:35:00.000+02:00", "replies_count": 0, "uuid": "d999ee5e4febe9e5bcb080a6e2405dbbcef6af1a"}, "author": "Chloe Aiello", "url": "https://www.cnbc.com/2018/01/31/the-san-francisco-da-will-dismiss-thousands-of-marijuana-related-convictions.html", "ord_in_thread": 0, "title": "The San Francisco DA will dismiss thousands of marijuana-related convictions", "locations": [], "entities": {"persons": [{"name": "george gascón", "sentiment": "none"}, {"name": "josh edelson", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "mendocino county", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Josh Edelson | AFP | Getty Images A worker displays marijuana grown on one of his properties in Mendocino County, California. \nSan Francisco will expunge and dismiss thousands of misdemeanor and felony marijuana convictions for those sentenced prior to the passage of a California measure to legalize recreational pot for adults — even if those with prior convictions don't file a petition, District Attorney George Gascón said Wednesday. \nThe move could provide a model for other U.S. city and state governments to follow as the push to legalize marijuana continues to gather steam. \nThe District Attorney's office announced its intent to retroactively apply new, more lenient rules on marijuana possession and legalization to drug cases dating back to 1975. \n\"While drug policy on the federal level is going backwards, San Francisco is once again taking the lead to undo the damage that this country's disastrous, failed drug war has had on our nation and on communities of color in particular,\" Gascón said in a statement. \nBeyond legalizing marijuana for adult use, the recently implemented California measure, known as Proposition 64 , enables those with past convictions to petition a court to recall or dismiss their cases. But in San Francisco, only 23 petitions were filed within the past year. \n\"While this relief is already available pursuant to Proposition 64 for anyone with a conviction, it requires that they know it is available and to retain an attorney to file the expungement paperwork,\" Gascón said. \nThe district attorney was referring specifically to minority populations, which are disproportionately impacted by felony and misdemeanor drug convictions. \nWhen marijuana arrests skyrocketed in 2000, the percentage of black people arrested rose from 34 to 41 percent of the total, according to the city's Cannabis Equity Report . Black people represented only about 8 percent of the city's population at the time. \nAs Gascón has long claimed reducing criminal conviction disparities along race lines as a cornerstone of his tenure as DA, he made moves to dismiss convictions en masse. His office intends to review, recall and re-sentence as many as 4,940 felony convictions and dismiss and seal 3,038 misdemeanors. \n\"This example, one of many across our state, underscores the true promise of Proposition 64 – providing new hope and opportunities to Californians, primarily people of color, whose lives were long ago derailed by a costly, broken and racially discriminatory system of marijuana criminalization,\" California Lieutenant Governor Gavin Newsom said in a statement. \n\"This isn't just an urgent issue of social justice here in California – it's a model for the rest of the nation,\" he added. \nGascón's unprecedented action comes at a turbulent time for the U.S. marijuana industry. Days after the nation's largest marijuana market opened for business Jan. 1, Attorney General Jeff Sessions moved to undermine previous federal guidance for state-by-state marijuana regulation, threatening burgeoning industries in several states. \nGascón is just the latest leader from a cannabis-friendly state to come out in defiant opposition to Sessions' actions.", "external_links": [], "published": "2018-01-31T23:35:00.000+02:00", "crawled": "2018-01-31T23:34:39.022+02:00", "highlightTitle": ""}