{"organizations": [], "uuid": "4474f26f833013a66992765d3e30fd94f71bb36d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-lighthouse-bank-announces-0-point-09-quarterly-cash-dividend-payment-to-shareholders.html", "country": "US", "domain_rank": 767, "title": "Lighthouse Bank Announces $0.09 Quarterly Cash Dividend Payment to Shareholders", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T02:10:00.000+02:00", "replies_count": 0, "uuid": "4474f26f833013a66992765d3e30fd94f71bb36d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-lighthouse-bank-announces-0-point-09-quarterly-cash-dividend-payment-to-shareholders.html", "ord_in_thread": 0, "title": "Lighthouse Bank Announces $0.09 Quarterly Cash Dividend Payment to Shareholders", "locations": [], "entities": {"persons": [], "locations": [{"name": "santa cruz", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "lighthouse bank", "sentiment": "negative"}, {"name": "bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SANTA CRUZ, Calif., Jan. 26, 2018 /PRNewswire/ -- Lighthouse Bank (OTC-QB: LGHT), a top-rated locally owned and operated community bank, today announced that its Board of Directors has declared a quarterly cash dividend in the amount of $0.09 per share. The dividend is payable on February 28, 2018 to shareholders of record at the close of business on February 9, 2018. The cash dividend is the result of the Bank's strong ongoing financial performance and significant capital strength.\nIn October 2017, the Bank declared its second $0.09 per share quarterly cash dividend payment to shareholders, following four previous consecutive quarterly cash dividends of $0.08 per share. Since January 2015, the Bank has paid $2,790,181 in cash dividends to shareholders.\nThe Bank recently released its fourth-quarter and year-end 2017 financial results, reporting net income of $533 thousand for the quarter, and $3.0 million for the year. Total assets grew to a record $261.1 million, an increase of $43.0 million, or 20%, from the previous year.\nLighthouse Bank has established itself as a consistent elite performer, earning consecutive top rankings based on a variety of categories including asset quality, capital adequacy, return on average assets, return on average equity and operational efficiency.\nMilestones Reached, Recognition & Awards Received :\nLighthouse Bank marked its 10 th Anniversary and celebrated the grand opening of its Silicon Valley Office in October 2017. Consecutive-year ranking as \"Nation's 5 th Healthiest Bank\" of 6,000 total banks, for 2016 & 2017. SNL Financial ranking as \"Nation's 29 th Highest Performing Bank\" in 2016 of 5,100 banks of asset size under $1 billion. Financial Management Consulting's \"12 th Highest Performing Bank\" out of 171 California banks, based on overall performance. 22-consecutive quarters possessing \"Five-Star Superior,\" the top rating by Bauer Financial. 6 consecutive-year achievement of \"Super Premier Performing Bank , \" the highest designation given by Findley Reports, Inc.\nLighthouse Bank stock ( LGHT ) is actively traded via the Bank's market makers and online and full-service brokerage providers. More information on the Bank's stock and historical financial performance may be located on the Bank's website at www.lighthousebank.net or by calling 831-600-4000.\nABOUT LIGHTHOUSE BANK:\nLighthouse Bank is a highly rated locally owned and operated full-service commercial bank with offices in Santa Cruz and Santa Clara Counties. The Bank's headquarters are located at 2020 North Pacific Avenue in Santa Cruz, CA. The Bank's Silicon Valley office is located at 19240 Stevens Creek Blvd, Cupertino, CA. The Bank is dedicated to providing exceptional personalized service and access to decision makers who are close at hand. Lighthouse Bank's unique worldwide ATM fee waiver program, complimentary business courier service and remote deposit capture product expand the Bank's geographical reach throughout Santa Cruz County and the Silicon Valley.\nMember FDIC / Equal Housing Lender / SBA Preferred Lender\nThe attached release may contain forward-looking statements that are subject to risks and uncertainties. Such risks and uncertainties may include but are not necessarily limited to fluctuation in interest rates, inflation, government regulations and general economic conditions, and competition within the business areas in which the Bank is conducting its operations, including the real estate market in California and other factors beyond the Bank's control. Such risks and uncertainties could cause results for subsequent interim periods or for the entire year to differ materially from those indicated. Readers should not place undue reliance on the forward-looking statements, which reflect management's view only as of the date hereof. The Bank undertakes no obligation to publicly revise these forward-looking statements to reflect subsequent events or circumstances.\nView original content with multimedia: http://www.prnewswire.com/news-releases/lighthouse-bank-announces-009-quarterly-cash-dividend-payment-to-shareholders-300589151.html\nSOURCE Lighthouse Bank", "external_links": ["https://finance.yahoo.com/quote/LGHT?p=LGHT", "http://www.prnewswire.com/news-releases/lighthouse-bank-announces-009-quarterly-cash-dividend-payment-to-shareholders-300589151.html", "http://www.lighthousebank.net/"], "published": "2018-01-27T02:10:00.000+02:00", "crawled": "2018-01-27T03:54:21.005+02:00", "highlightTitle": ""}