{"organizations": [], "uuid": "8648673c47fc743b041891b92580543971f3363f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/14/104587505-RTX3AOXE.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/24/one-of-wall-streets-biggest-bulls-warns-stocks-may-have-run-too-far-too-fast.html", "country": "US", "domain_rank": 767, "title": "One of Wall Street’s biggest bulls warns stocks may have run ‘too far, too fast’", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T15:58:00.000+02:00", "replies_count": 0, "uuid": "8648673c47fc743b041891b92580543971f3363f"}, "author": "Keris Lahiff", "url": "https://www.cnbc.com/2018/01/24/one-of-wall-streets-biggest-bulls-warns-stocks-may-have-run-too-far-too-fast.html", "ord_in_thread": 0, "title": "One of Wall Street’s biggest bulls warns stocks may have run ‘too far, too fast’", "locations": [], "entities": {"persons": [{"name": "julian emanuel", "sentiment": "negative"}, {"name": "emanuel", "sentiment": "none"}], "locations": [], "organizations": [{"name": "s&p 500", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "btig", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Despite the S&P 500 's blazing record run this year, strategist Julian Emanuel is worried that the steep ascent could derail the bull run.\n\"The fact that volatility has crept up for most of the month of January along with the rising market is sort of a warning sign that we may have come too far, too fast,\" the chief equity strategist at BTIG told CNBC's \" Futures Now \" on Tuesday.\nThe S&P 500 has clocked 12 record closes in the new year, logging year-to-date gains of 6 percent. Should those gains stick through the end of the month, it would be the index's highest one-month gain since March 2016 and its best January since 1997.\nAt the same time, the volatility index, or \"fear index,\" has stepped steadily higher. The Cboe market volatility index is up 0.5 percent in January after two-straight years of more than 20 percent declines. The index had closed at its lowest level ever in November.\n\"We'd prefer to see the kind of action that we saw in 2017 — very steady, grinding-it-out gains,\" Emanuel said. \"There does feel as if there's an element of speculation creeping into the market.\"\nEven with the risks, Emanuel remains generally bullish on the S&P 500's prospects for the rest of the year. BTIG has a 3,000 year-end price target on the S&P, roughly 6 percent higher than current levels. In just the start to the year, the S&P 500 has already risen halfway to BTIG's target.\nEmanuel's bullish target relies on a few forecasts: Earnings continue to tick along, ending the year with double-digit gains; the economy is moving toward 2.5 to 3.5 percent growth; and interest rates stay contained. Emanuel sees a nice case for stocks in the energy, financials and health care sectors, should his bullish scenario come to pass.\nA shift into late-stage cyclicality benefits energy names in particular, especially as the curve in crude futures enters backwardation , Emanuel added. On financials, he predicts continued deregulation from the Trump White House and steadily rising interest rates as supportive. Finally, Emanuel sees political pressures on health care as easing this year, which should make names in the space even more attractive.\nThe three sectors are already among the best performers on markets this year. The energy sector has logged an 8 percent gain since in 2018, and the financials and health care have risen 7 percent.\nBTIG analysts join a number of others in pegging a 3,000 year-end price target for the S&P 500, including Bernstein, RBC Capital Markets, Oppenheimer, J.P. Morgan, Bank of America and Credit Suisse. UBS has the highest price target at 3,150, and Morgan Stanley the lowest at 2,750. \nshow chapters More record gains for the S&P 500 in reach, says BTIG      20 Hours Ago | 07:03 Vote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nDisclaimer", "external_links": [], "published": "2018-01-24T15:58:00.000+02:00", "crawled": "2018-01-24T16:04:15.010+02:00", "highlightTitle": ""}