{"organizations": [], "uuid": "cc350fa71f083abf767d390e8faf62be2eca653c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-silicoms-fourth-quarter-and-full-year-2017-results-release-scheduled-for-january-29-2018.html", "country": "US", "domain_rank": 767, "title": "Silicom's Fourth Quarter and Full Year 2017 Results Release Scheduled for January 29, 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T16:15:00.000+02:00", "replies_count": 0, "uuid": "cc350fa71f083abf767d390e8faf62be2eca653c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-silicoms-fourth-quarter-and-full-year-2017-results-release-scheduled-for-january-29-2018.html", "ord_in_thread": 0, "title": "Silicom's Fourth Quarter and Full Year 2017 Results Release Scheduled for January 29, 2018", "locations": [], "entities": {"persons": [{"name": "silicom si", "sentiment": "none"}], "locations": [{"name": "kfar sava", "sentiment": "none"}, {"name": "silicom", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "silicom ltd.", "sentiment": "negative"}, {"name": "eastern time", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KFAR SAVA, Israel, Jan. 2, 2018 /PRNewswire/ -- Silicom Ltd. (NASDAQ: SILC), an industry-leading provider of high-performance server/appliances networking solutions, announced today that it will be releasing its fourth quarter and full year 2017 results on Monday, January 29, 2018.\nThe Company will be hosting a conference call that same day at 9:00am Eastern Time. On the call, management will review and discuss the results, and will also be available to answer investors' questions.\nTo participate, please call one of the following teleconferencing numbers. Please begin placing your calls a few minutes before the conference call commences. If you are unable to connect using the toll-free numbers, try the international dial-in number.\nUS: 1 888 668 9141\nUK: 0 800 917 5108\nISRAEL: 03 918 0609\nINTERNATIONAL: +972 3 918 0609\nAt: 9:00am Eastern Time, 6:00am Pacific Time, 4:00pm Israel Time\nFor those unable to listen to the live call, a replay of the call will be available for three months from the day after the call under the investor relations section of Silicom's website.\nAbout Silicom\nSilicom Ltd. is an industry-leading provider of high-performance networking and data infrastructure solutions. Designed primarily to improve performance and efficiency in Cloud and Data Center environments, Silicom's solutions increase throughput, decrease latency and boost the performance of servers and networking appliances, the infrastructure backbone that enables advanced Cloud architectures and leading technologies like NFV, SD-WAN and Cyber Security. Our innovative solutions for high-density networking, high-speed fabric switching, offloading and acceleration, which utilize a range of cutting-edge silicon technologies as well as FPGA-based solutions, are ideal for scaling-up and scaling-out cloud infrastructures.\nSilicom products are used by major Cloud players, service providers, telcos and OEMs as components of their infrastructure offerings, including both add-on adapters in the Data Center and stand-alone virtualized/universal CPE devices at the edge.\nSilicom's long-term, trusted relationships with more than 150 customers throughout the world, its more than 400 active Design Wins and more than 300 product SKUs have made Silicom a \"go-to\" connectivity/performance partner of choice for technology leaders around the globe.\nFor more information, please visit: www.silicom.co.il\nStatements in this press release which are not historical data are which involve known and unknown risks, uncertainties, or other factors not under the company's control, which may cause actual results, performance, or achievements of the company to be materially different from the results, performance, or other expectations implied by these . These factors include, but are not limited to, difficulty in commercializing and marketing of Silicom's products and services, maintaining and protecting brand recognition, protection of intellectual property, competition and other factors detailed in the company's periodic filings with the Securities and Exchange Commission. These can generally be identified as such because the context of the statement will include words, such as \"expects,\" \"should,\" \"believes,\" \"anticipates\" or words of similar import. Similarly, statements that describe future plans, objectives or goals are also . In light of significant risks and uncertainties inherent in , the inclusion of such statements should not be regarded as a representation by the company that it will achieve such . The company disclaims any duty to update such statements, whether as a result of new information, future events, or otherwise.\nCompany Contact:\nEran Gilad, CFO\nSilicom Ltd.\nTel: +972-9-764-4555\nE-mail: erang@silicom.co.il\nInvestor Relations Contact:\nEhud Helft / Gavriel Frohwein\nGK Investor Relations\nTel: +1-646-668-3559\nE-mail : silicom@gkir.com\nView original content: http://www.prnewswire.com/news-releases/silicoms-fourth-quarter-and-full-year-2017-results-release-300576346.html\nSOURCE Silicom Ltd.", "external_links": ["http://www.silicom.co.il/", "http://www.prnewswire.com/news-releases/silicoms-fourth-quarter-and-full-year-2017-results-release-300576346.html"], "published": "2018-01-02T16:15:00.000+02:00", "crawled": "2018-01-02T16:32:23.003+02:00", "highlightTitle": ""}