{"organizations": [], "uuid": "6d25e876f7c78a754dd32342f5768424ba75e68b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-future-appoints-luke-edson-to-u-s-chief-revenue-officer.html", "country": "US", "domain_rank": 767, "title": "Future Appoints Luke Edson to U.S. Chief Revenue Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.023, "site_type": "news", "published": "2018-01-29T17:39:00.000+02:00", "replies_count": 0, "uuid": "6d25e876f7c78a754dd32342f5768424ba75e68b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-future-appoints-luke-edson-to-u-s-chief-revenue-officer.html", "ord_in_thread": 0, "title": "Future Appoints Luke Edson to U.S. Chief Revenue Officer", "locations": [], "entities": {"persons": [{"name": "luke edson", "sentiment": "negative"}, {"name": "luke", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO, Jan. 29, 2018 /PRNewswire/ -- Today, Future announces the appointment of Luke Edson as the U.S. Chief Revenue Officer effective immediately. Luke joins Future at an extremely exciting time, amidst a period of new business development and growth for the company. 2017 was a year for exceptional growth, with the U.S. revenue up 41 percent plus an increase in online growth and market share. With Future's digital advertising now representing 90 percent of advertising revenues in the U.S., it's a crucial time for us to exploit these opportunities.\nAs part of Future's intention to scope and deliver new operating methods within the ever-changing landscape of media sales, Luke will play a crucial role in shaping the company's U.S. strategy and new business development including the company's top brands TechRadar and PC Gamer. Luke's responsibilities will see him leading the growth in the U.S. market. He will oversee the commercial operations, revenue strategy and sales activity.\nLuke brings a wealth of market-relevant experience and will be joining Future from Yellow Pages, where he worked as the Senior Vice President of National Markets. Prior to this, Luke worked at Cox Digital Solutions, AOL and Internet Broadcasting. Luke Edson, U.S. CRO, Future says, \"Future is a flourishing company with a strong portfolio of market-leading brands and audiences, I am looking forward to building on the current momentum and to bringing to the U.S. market, innovative solutions that integrate print and digital media, creative, live experiences and eCommerce.\"\nZillah Byng-Thorne, CEO of Future says, \"I'm really excited to welcome Luke on board. His proficiency in commercial operations will help shape our strategy and business development in the U.S. There's a wealth of opportunity for us in the U.S. and I have every faith Luke will be able to capitalize on that.\"\nThis announcement follows last week's appointments of Will Hattam as Chief Marketing Officer and Stacy Gaines as Vice President, U.S. Marketing & Strategic Partnerships.\nAbout Future plc\nFuture plc is an international media group and leading digital publisher, listed on the London Stock Exchange (symbol: FUTR). The Group operates two separately managed brand-led divisions: Media and Magazine. The Group has a reach of 100m+ globally, including 62m online users and 63m social media reach. The Magazine division is brand-led. It has over 100 market-leading publications, with 10 key titles. The Media division focuses on being at the forefront of digital innovation, in particular, the high growth technology and games markets, with three complementary revenue streams: eCommerce, events and digital advertising. It has a number of leading brands including TechRadar, PC Gamer, GamesRadar+, The Photography Show, Generate, The Homebuilding and Renovating Show and Golden Joysticks Awards.\nView original content with multimedia: http://www.prnewswire.com/news-releases/future-appoints-luke-edson-to-us-chief-revenue-officer-300589481.html\nSOURCE Future plc", "external_links": ["http://www.prnewswire.com/news-releases/future-appoints-luke-edson-to-us-chief-revenue-officer-300589481.html"], "published": "2018-01-29T17:39:00.000+02:00", "crawled": "2018-01-29T19:37:32.021+02:00", "highlightTitle": ""}