{"organizations": [], "uuid": "727edaaaa84b5a06e5a67aa8f1186d45be406a37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "https://www.cnbc.com/id/23103686/device/rss/rss.html", "section_title": "Charting Asia with Daryl Guppy", "url": "https://www.cnbc.com/2018/01/30/the-aussie-may-rise-sharply-on-us-dollar-weakness--commentary.html", "country": "US", "domain_rank": 767, "title": "The Aussie may rise sharply on US dollar weakness -", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.754, "site_type": "news", "published": "2018-01-30T08:09:00.000+02:00", "replies_count": 0, "uuid": "727edaaaa84b5a06e5a67aa8f1186d45be406a37"}, "author": "Daryl Guppy", "url": "https://www.cnbc.com/2018/01/30/the-aussie-may-rise-sharply-on-us-dollar-weakness--commentary.html", "ord_in_thread": 0, "title": "The Aussie may rise sharply on US dollar weakness -", "locations": [], "entities": {"persons": [], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Australian dollar is challenging a long-term resistance level near $0.81. It challenged that level in September 2017, but then fell back to lows near $0.75. A breakout above the upper edge of a long-term trading band has the potential to test $0.845.\nGetty Images This is a technical target based on the trading band projection. This level has no previous history of support or resistance so this leaves open the potential for the Australian dollar to move above this technical target.\nIt is difficult to ignore the performance of the U.S. dollar as Aussie strength is often a direct consequence. The U.S. dollar index has fallen below $0.90. The Australian and U.S. dollars have an inverse relationship.\nThis suggests an Australian dollar rebound rally is well embedded until the dollar resumes its uptrend. The failure of support near $0.91 on the U.S. dollar index, and the failure to create a double-bottom pattern, suggests continued weakness in the dollar.\nAlthough the Australian dollar may be driven by the weakness of the dollar, it is the behavior of the Aussie that sets the breakout targets.\nThe long-trading band is the most significant feature on the Aussie chart. The upper edge of the trading band near $0.775 was established in April 2016.\nThe December 2017 breakout above $0.775 is significant because it is the second strong rally move in six months. Just as with the July 2017 breakout, the December breakout has moved rapidly to the next resistance feature near $0.81.\nThe resistance level is now experiencing its third test in six months and this increases the probability that the Aussie can break above resistance.\nA breakout above this level may have significant impact with the Reserve Bank of Australia reluctant to increase interest rates when the Aussie is strong. The low-interest rate setting adds further fuel to the Australian housing market and magnifies the impact of any market crash.\nThe width of the trading band is projected upwards to set a target near $0.845. That target is treated with caution and used as a guide only because the price projection methods are not quite as reliable as they are with index and equity charts.\nshow chapters The U.S. dollar index is on pace for its worst January since 1987 — But here's what could turn it around 23 Hours Ago | 01:29 We use the Guppy Multiple Moving Averages indicator analysis to identify trend strength and trend changes. Full trend confirmation is when the short-term GMMA moves completely above the upper edge of the trading band. This is the key indicator and we use the ANTSSYS trade and analysis method to identify the opportunities as the rally continues.\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": ["http://www.antssys.com/", "http://www.guppytraders.com/", "http://www.twitter.com/CNBCopinion", "https://sc.cnbcfm.com/applications/cnbc.com/resources/files/2018/01/29/guppy", "http://www.guppytraders.com/gup329.shtml"], "published": "2018-01-30T08:09:00.000+02:00", "crawled": "2018-01-30T07:32:47.008+02:00", "highlightTitle": ""}