{"organizations": [], "uuid": "1797ddafa85457c493579b180f5114670664ee6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-associated-banc-corp-reports-full-year-2017-earnings-of-1-point-42-per-common-share-or-1-point-52-per-common-share-excluding.html", "country": "US", "domain_rank": 767, "title": "Associated Banc-Corp Reports Full Year 2017 Earnings of $1.42 per common share, or $1.52 per common share excluding expenses related to the Tax Act(1)", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.047, "site_type": "news", "published": "2018-01-26T00:15:00.000+02:00", "replies_count": 0, "uuid": "1797ddafa85457c493579b180f5114670664ee6e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-associated-banc-corp-reports-full-year-2017-earnings-of-1-point-42-per-common-share-or-1-point-52-per-common-share-excluding.html", "ord_in_thread": 0, "title": "Associated Banc-Corp Reports Full Year 2017 Earnings of $1.42 per common share, or $1.52 per common share excluding expenses related to the Tax Act(1)", "locations": [], "entities": {"persons": [], "locations": [{"name": "wis.", "sentiment": "none"}, {"name": "minnesota", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}], "organizations": [{"name": "asb", "sentiment": "neutral"}, {"name": "associated banc-corp", "sentiment": "neutral"}, {"name": "nyse", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "associated", "sentiment": "none"}, {"name": "bank mutual", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GREEN BAY, Wis., Associated Banc-Corp (NYSE: ASB) today reported net income available to common equity (\"earnings\") of $220 million, or $1.42 per common share for the year ended December 31, 2017. Earnings per common share (\"EPS\") for the year ended December 31, 2017 included $15 million of expenses related to the recently enacted Tax Cuts and Jobs Act of 2017 (the \"Tax Act\"). These amounts compare to net income available to common equity of $191 million, or $1.26 per common share for the year ended December 31, 2016. The Company reported earnings of $0.31 per common share for the quarter ended December 31, 2017 ($0.41 per common share excluding expenses related to the Tax Act), compared to $0.34 per common share for the quarter ended December 31, 2016.\n\"During 2017, Associated continued to grow its customer deposit market share across its footprint. The pending acquisition of Bank Mutual will further enhance our Wisconsin and Minnesota network and we look forward to welcoming Bank Mutual's customers to Associated on February 1,\" said President and CEO Philip B. Flynn. \"Our 2017 financial results reflect strong underlying credit quality, growing fee-based revenue, and the ongoing benefits of our technology and efficiency initiatives. For 2018, we expect to fund over $1 billion in new loans, to improve our net interest margin modestly, and to further reduce our efficiency ratio, driving increasing returns on capital for our shareholders.\"\n1 The following table reconciles non-GAAP financial measures which exclude expenses related to the Tax Act, to GAAP financial measures.\n($ in millions, except per share data)\n4Q 2017\n4Q 2017\nper share data\nFY 2017\nFY 2017\nper share data\nGAAP earnings and EPS\n$\n48\n$\n0.31\n$\n220\n$\n1.42\nRequired partial write-off of deferred tax asset\n12\n0.08\n12\n$\n0.08\nRequired acceleration of low income housing tax credit amortization\n1\n<0.01\n1\n<0.01\nPreviously disclosed compensation actions\n1\n<0.01\n1\n<0.01\nOther accelerated write-offs\n1\n<0.01\n1\n<0.01\nTotal expenses related to the Tax Act\n$\n15\n$\n0.10\n$\n15\n$\n0.10\nEarnings and EPS, excluding expenses related to the Tax Act\n$\n63\n$\n0.41\n$\n235\n$\n1.52\nFor notes on non-GAAP measures see page 7.\n2017 HIGHLIGHTS (all comparisons to the year ago)\nAverage loans of $20.6 billion were up 5%, or $942 million Average deposits of $21.9 billion were up 4%, or $918 million Income before income taxes was up 18%, or $51 million Total dividends paid per common share were $0.50, up 11%\n2017 FULL YEAR AND FOURTH QUARTER FINANCIAL RESULTS\nLoans\nFull year 2017 average loans of $20.6 billion were up 5%, or $942 million from 2016.\nWith respect to full year 2017 average balances by loan category as compared to 2016:\nConsumer lending increased $854 million, or 11% to $8.4 billion driven by the Company's on balance sheet mortgage retention strategy. Commercial real estate lending increased $228 million, or 5% to $5.0 billion. Commercial and business lending decreased $141 million, or 2% to $7.3 billion.\nAt year end 2017, loans of $20.8 billion were up $730 million, or 4% from 2016. The loan to deposit ratio was 91% at year end.\nFourth quarter 2017 average loans of $20.9 billion were up $887 million, or 4% from the year ago quarter and were down modestly from the third quarter.\nWith respect to fourth quarter 2017 average balances by loan category:\nConsumer lending increased $1.2 billion from the year ago quarter driven by the Company's on balance sheet mortgage retention strategy and grew $204 million from the third quarter to $8.8 billion. Commercial real estate lending decreased $41 million from the year ago quarter and decreased $100 million from the third quarter to $4.9 billion, consistent with the Company's plan to moderate commercial real estate growth in anticipation of the pending Bank Mutual transaction. Commercial and business lending decreased $228 million from the year ago quarter and decreased $140 million from the third quarter to $7.2 billion on lower general commercial outstandings.\nDeposits\nFull year 2017 average deposits of $21.9 billion were up 4%, or $918 million from 2016.\nWith respect to full year 2017 average balances by deposit category as compared to 2016:\nInterest-bearing demand deposits increased $544 million, or 14% to $4.3 billion. Savings and time deposits increased $526 million, or 18% to $3.5 billion. Money market deposits decreased $42 million to $9.1 billion. Noninterest-bearing demand deposits decreased $110 million to $5.0 billion.\nAt year end 2017, deposits of $22.8 billion were up $898 million, or 4% from 2016. During the year, the Company reduced its reliance on network deposits by $1.4 billion, or 35% while increasing net deposits and customer funding by $2.2 billion, or 12%.\nFourth quarter 2017 average deposits of $22.2 billion were up $507 million, or 2% from the year ago quarter and were down $192 million, or 1% from the third quarter.\nWith respect to fourth quarter 2017 average balances by deposit category:\nSavings and time deposits increased $898 million from the year ago quarter and increased $176 million from the third quarter to $3.9 billion. Interest-bearing demand deposits increased $323 million from the year ago quarter and increased $115 million from the third quarter to $4.5 billion. Noninterest-bearing demand deposits decreased $160 million from the year ago quarter, but increased $142 million from the third quarter to $5.1 billion. Money market deposits decreased $553 million from the year ago quarter and decreased $624 million from the third quarter to $8.7 billion.\nNet Interest Income and Net Interest Margin\nFull year 2017 net interest income of $741 million was up 5%, or $34 million from 2016. Net interest margin of 2.82% was up 2 basis points from the prior year.\nThe average yield on total commercial loans increased 44 basis points to 3.76% from the prior year. The average cost of interest-bearing deposits increased 24 basis points to 0.56% from the prior year. The net free funds benefit, the benefit of holding noninterest-bearing demand deposits, increased 5 basis points from the prior year.\nFourth quarter 2017 net interest income of $187 million was up 4%, or $7 million from the year ago quarter, with net interest margin decreasing 1 basis point to 2.79%. Fourth quarter net interest income decreased 2%, or $3 million from the third quarter, with net interest margin decreasing 5 basis points to 2.79%.\nThe average yield on total commercial loans increased 53 basis points to 3.89% from the year ago quarter, but decreased 4 basis points from the prior quarter. The average cost of interest-bearing deposits increased 32 basis points to 0.65% from the year ago quarter and increased 2 basis points from the prior quarter. The net free funds benefit, the benefit of holding noninterest-bearing demand deposits, increased 8 basis points from the year ago quarter and increased 1 basis point from the prior quarter.\nNoninterest Income\nFull year 2017 total noninterest income of $333 million was down $20 million reflecting expected lower mortgage banking activity.\nMortgage banking decreased $19 million from the prior year primarily driven by the Company's on balance sheet mortgage retention strategy. Brokerage and asset management fees benefited from the strong equity market and were up $7 million.\nFourth quarter 2017 total noninterest income of $85 million decreased $8 million from the year ago quarter and decreased $1 million from the prior quarter.\nWith respect to fourth quarter 2017 noninterest income line items:\nBrokerage and asset management fees were up $4 million from the year ago quarter and up $3 million from the prior quarter based on the strong equity market and the acquisition of Whitnell & Co., which increased both assets under management and related run-rate revenues. Capital market fees increased $2 million from the prior quarter primarily driven by increased loan syndication activity and higher customer hedging transactions, but decreased $1 million from the year ago quarter. Mortgage banking decreased $3 million from the prior quarter primarily driven by seasonal factors and decreased $8 million from the year ago quarter primarily driven by overall mortgage market contraction.\nNoninterest Expense\nFull year 2017 noninterest expense of $709 million was up 1%, or $7 million from the prior year.\nTechnology expense increased $6 million from the prior year as the Company continues to invest in solutions that drive operational efficiency. All other noninterest expense line items, collectively, increased $1 million from the prior year.\nFourth quarter 2017 total noninterest expense of $182 million increased 2%, or $3 million from the year ago quarter and increased $4 million from the third quarter.\nWith respect to fourth quarter 2017 noninterest expense line items:\nTechnology expense increased $3 million from the prior and year ago quarters as the Company continues to invest in solutions that drive operational efficiency. Occupancy expense increased $1 million from the prior quarter primarily driven by higher maintenance and snow plowing costs. As previously announced, in connection with the enactment of the Tax Act, the Company recorded $1 million in the fourth quarter of 2017 for one-time bonus payments to hourly, non-commissioned employees.\nTaxes\nFull year 2017 income tax expense of $110 million was up $22 million from 2016 due to a partial write-down of the Company's deferred tax assets driven by a decrease in the corporate tax rate, an acceleration of low income housing tax credit amortization, and certain other charges related to the Tax Act. The Company's effective tax rate was 32% in 2017 compared to 30% in 2016.\nFourth quarter 2017 income tax expense was $40 million, including the above referenced items.\nFor 2018, the Company expects its effective tax rate to be in the range of 20%-22%.\nCredit\nFull year 2017 provision for credit losses of $26 million was down $44 million from the prior year.\nThe fourth quarter 2017 provision for credit losses of $0 was down $15 million from the year ago quarter and down $5 million from the prior quarter.\nPotential problem loans of $177 million were down $174 million from the year ago quarter and down $82 million from the prior quarter. Nonaccrual loans of $209 million were down $67 million from the year ago quarter and down $2 million from the prior quarter. The nonaccrual loans to total loans ratio was 1.00% in the fourth quarter, compared to 1.37% in the year ago quarter, and 1.01% in the prior quarter. Fourth quarter net charge offs of $11 million were up $1 million from the year ago quarter and relatively unchanged from the prior quarter. The allowance for loan losses of $266 million was down $12 million from the year ago quarter and was down $11 million from the prior quarter. The allowance for loan losses to total loans ratio was 1.28% in the fourth quarter, compared to 1.39% in the year ago quarter, and 1.32% in the prior quarter. The allowance related to the oil and gas portfolio was $27 million at December 31, 2017 and represented 4.5% of total oil and gas loans compared to 5.7% in the year ago quarter, and 5.2% in the prior quarter.\nCapital\nThe Company's capital position remains strong, with a CET1 capital ratio of 10.1%at December 31, 2017. The Company's capital ratios continue to be in excess of the Basel III \"well-capitalized\" regulatory benchmarks on a fully phased in basis.\nFOURTH QUARTER 2017 EARNINGS RELEASE CONFERENCE CALL\nThe Company will host a conference call for investors and analysts at 4:00 p.m. Central Time (CT) today, January 25, 2018. Interested parties can access the live webcast of the call through the Investor Relations section of the Company's website, http://investor.associatedbank.com . Parties may also dial into the call at 877-407-8037 (domestic) or 201-689-8037 (international) and request the Associated Banc-Corp fourth quarter 2017 earnings call. The fourth quarter 2017 financial tables with an accompanying slide presentation will be available on the Company's website just prior to the call. An audio archive of the webcast will be available on the Company's website approximately fifteen minutes after the call is over.\nABOUT ASSOCIATED BANC-CORP\nAssociated Banc-Corp (NYSE: ASB) has total assets of $30 billion and is one of the top 50 publicly traded U.S. bank holding companies. Headquartered in Green Bay, Wisconsin, Associated is a leading Midwest banking franchise, offering a full range of financial products and services from over 200 banking locations serving more than 100 communities throughout Wisconsin, Illinois and Minnesota, and commercial financial services in Indiana, Michigan, Missouri, Ohio, and Texas. Associated Bank, N.A. is an Equal Housing Lender, Equal Opportunity Lender and Member FDIC. More information about Associated Banc-Corp is available at www.associatedbank.com .\nFORWARD-LOOKING STATEMENTS\nStatements made in this document which are not purely historical are forward-looking statements, as defined in the Private Securities Litigation Reform Act of 1995. This includes any statements regarding management's plans, objectives, or goals for future operations, products or services, and forecasts of its revenues, earnings, or other measures of performance. Such forward-looking statements may be identified by the use of words such as \"believe,\" \"expect,\" \"anticipate,\" \"plan,\" \"estimate,\" \"should,\" \"will,\" \"intend,\" \"outlook,\" or similar expressions. Forward-looking statements are based on current management expectations and, by their nature, are subject to risks and uncertainties. Actual results may differ materially from those contained in the forward-looking statements. Factors which may cause actual results to differ materially from those contained in such forward-looking statements include those identified in the Company's most recent Form 10-K and subsequent SEC filings. Such factors are incorporated herein by reference.\nNON-GAAP FINANCIAL MEASURES\nThis press release and related materials may contain references to measures which are not defined in generally accepted accounting principles (\"GAAP\"). Information concerning these non-GAAP financial measures can be found in the financial tables.\nOn December 22, 2017, the Tax Act was signed into law. The fourth quarter of 2017 and full year 2017 results reflect the estimated impact of the enactment of the Tax Act, which resulted in a $15 million decrease in net income. Net income and earnings per share excluding these related expenses are non-GAAP financial measures. Management believes these measures are meaningful because it reflects adjustments commonly made by management, investors, regulators, and analysts to evaluate the adequacy of earnings per common share and provides a greater understanding of ongoing operations and enhances comparability of results with prior periods. All items are tax effected.\nInvestor Contact:\nJessica Vanden Heuvel, Vice President, Director of Investor Relations\n920-491-7059\nMedia Contact:\nJennifer Kaminski, Vice President, Public Relations Senior Manager\n920-491-7576\n releases/associated-banc-corp-reports-full-year-2017-earnings-of-142-per-common-share-or-152-per-common-share-excluding-expenses-related-to-the-tax-act1-300588425.html\nSOURCE Associated Banc-Corp", "external_links": ["http://www.prnewswire.com/news-releases/associated-banc-corp-reports-full-year-2017-earnings-of-142-per-common-share-or-152-per-common-share-excluding-expenses-related-to-the-tax-act1-300588425.html"], "published": "2018-01-26T00:15:00.000+02:00", "crawled": "2018-01-26T01:22:33.022+02:00", "highlightTitle": ""}