{"organizations": [], "uuid": "5e1dc305e85a4206e5d51c0a89f011c8e86e9f16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews/", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-vertex-pharms-cysticfibrosis/vertex-picks-cystic-fibrosis-triple-combinations-for-phase-iii-trials-idUSKBN1FK33A", "country": "US", "domain_rank": 408, "title": "Vertex picks cystic fibrosis triple combinations for Phase III trials", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T23:08:00.000+02:00", "replies_count": 0, "uuid": "5e1dc305e85a4206e5d51c0a89f011c8e86e9f16"}, "author": "", "url": "https://www.reuters.com/article/us-vertex-pharms-cysticfibrosis/vertex-picks-cystic-fibrosis-triple-combinations-for-phase-iii-trials-idUSKBN1FK33A", "ord_in_thread": 0, "title": "Vertex picks cystic fibrosis triple combinations for Phase III trials", "locations": [], "entities": {"persons": [{"name": "bill berkrot", "sentiment": "negative"}, {"name": "kalydeco", "sentiment": "none"}, {"name": "jeffrey leiden", "sentiment": "none"}], "locations": [{"name": "kalydeco", "sentiment": "none"}, {"name": "orkambi", "sentiment": "none"}], "organizations": [{"name": "vertex", "sentiment": "negative"}, {"name": "vertex pharmaceuticals", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 9:09 PM / Updated 8 minutes ago Vertex picks cystic fibrosis triple combos for Phase III trials Bill Berkrot 3 Min Read \n(Reuters) - Vertex Pharmaceuticals said on Wednesday it selected two next-generation cystic fibrosis drugs to advance into late-stage testing of triple-combination therapies that could eventually treat up to 90 percent of patients with the life-shortening lung disease. \nIts currently approved treatments, Kalydeco and Orkambi, can address about 34,000 patients, or some 45 percent of the CF population. Other patients have no drugs that treat the underlying cause of the disease that leads to serious lung infections and declining lung function. \nVertex also reported higher-than-expected fourth-quarter revenue and profit, and its shares rose nearly 5 percent to $175 in extended trading. Revenue of $651.6 million easily surpassed Wall Street estimates of $594.7 million. \nBased on promising Phase II data, Vertex said it will test VX-659 and VX-445 in separate Phase III triple-combination trials beginning later this year. \n“This is another very important step forward,” said Chief Executive Jeffrey Leiden. “We think they’re going to enroll very quickly ... and our goal is to do them in an accelerated way so we can get (the treatments) to patients.” \nIn the Phase II trials combining Kalydeco (ivacaftor) and tezacaftor with each of the new agents, the highest tested dose of VX-659 led to a 13.3 percent FEV1 improvement, while the highest dose of VX-445 showed a 13.8 percent FEV1 improvement, both deemed highly statistically significant. \nFEV1 measures volume of air exhaled in one second, a standard test for lung disorders. \nPatients in the studies had one F508del gene mutation and one minimal function mutation. Orkambi treats those with two copies of the F508del mutation. \nThe Phase II studies also yielded highly significant improvements versus placebo in sweat chloride - a biomarker linked to the underlying cause of CF - and on a scale that measures patient assessment of quality of life. \n“This data is so strong and we’ve already shared it with FDA. That’s why we’re so confident that we’ll start (Phase III trials) in the first half of this year,” Leiden said. \nThe first Phase III will test VX-659 with Kalydeco and tezacaftor. In mid-2018, Vertex hopes to begin a Phase III testing VX-445 with tezacaftor and a new formulation of Kalydeco called VX-561 in a once-a-day regimen. Current Kalydeco is taken twice a day. \nVertex expects U.S. approval of its Kalydeco/tezacaftor combination therapy next month and European approval in the second half of 2018. \nIt will provide a 2018 CF revenue forecast following U.S. approval of Kalydeco/tezacaftor. Reporting by Bill Berkrot; Editing by James Dalgleish", "external_links": [], "published": "2018-01-31T23:08:00.000+02:00", "crawled": "2018-01-31T23:28:26.003+02:00", "highlightTitle": ""}