{"organizations": [], "uuid": "6715afe745332467c183f4599a0d3f8ce399dff4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/04/the-associated-press-trump-moves-to-vastly-expand-offshore-drilling-off-us-coasts.html", "country": "US", "domain_rank": 767, "title": "Trump moves to vastly expand offshore drilling off US coasts", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T20:04:00.000+02:00", "replies_count": 0, "uuid": "6715afe745332467c183f4599a0d3f8ce399dff4"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/04/the-associated-press-trump-moves-to-vastly-expand-offshore-drilling-off-us-coasts.html", "ord_in_thread": 0, "title": "Trump moves to vastly expand offshore drilling off US coasts", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "ryan zinke", "sentiment": "none"}, {"name": "rick scott", "sentiment": "none"}, {"name": "zinke", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "west coast", "sentiment": "none"}, {"name": "arctic", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "interior", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — The Trump administration moved Thursday to vastly expand offshore drilling from the Atlantic to the Arctic oceans with a plan that would open up federal waters off California for the first time in more than three decades.\nThe new five-year drilling plan also could open new areas of oil and gas exploration in areas off the East Coast from Florida to Maine, where drilling has been blocked for decades. While some lawmakers in those states support offshore drilling, the plan drew immediate opposition from governors up and down the East Coast, including Republican Govs. Rick Scott of Florida and Larry Hogan of Maryland, who pressed President Donald Trump to withdraw their states from consideration.\nDemocratic governors on both coasts blasted the plan. New York Gov. Andrew Cuomo called it \"another federal assault on our environment\" while California Gov. Jerry Brown vowed to block \"this reckless, short-sighted action.\"\nInterior Secretary Ryan Zinke announced the plan, saying that responsible development of offshore energy resources would boost jobs and economic security while providing billions of dollars to fund conservation along U.S. coastlines.\nThe five-year plan would open 90 percent of the nation's offshore reserves to development by private companies, Zinke said, with 47 leases proposed off the nation's coastlines from 2019 to 2024. Nineteen sales would be off Alaska, 12 in the Gulf of Mexico, nine in the Atlantic and seven in the Pacific, including six off California.\n\"This is a draft program,\" Zinke told reporters during a conference call. \"Nothing is final yet, and our department is continuing to engage the American people to get to our final product.\"\nIndustry groups praised the announcement, which would be the most expansive offshore drilling proposal in decades. The proposal follows Trump's executive order in April encouraging more drilling rights in federal waters, part of the administration's strategy to help the U.S. achieve \"energy dominance\" in the global market.\n\"To kick off a national discussion, you need a national plan — something that has been lacking the past several years,\" said Randall Luthi, president of the National Ocean Industries Association. President Barack Obama blocked Atlantic and Pacific drilling under a five-year plan finalized in 2016.\nA coalition of more than 60 environmental groups denounced the plan, saying it would impose \"severe and unacceptable harm\" to America's oceans, coastal economies, public health and marine life.\n\"These ocean waters are not President Trump's personal playground. They belong to all Americans and the public wants them preserved and protected, not sold off to multinational oil companies,\" read the coalition's statement, which was signed by leaders of the Sierra Club, Natural Resources Defense Council, League of Conservation Voters and other environmental groups.\nThe proposal comes less than a week after the Trump administration proposed to rewrite or kill rules on offshore oil and gas drilling imposed after the 2010 rig explosion in the Gulf of Mexico. The accident on BP's Deepwater Horizon rig killed 11 workers and triggered the biggest offshore oil spill in U.S. history.\nThe Trump administration called the rules an unnecessary burden on industry and said rolling them back will encourage more energy production. Environmentalists said Trump was raising the risk of more deadly oil spills.\nThe Obama administration imposed tougher rules in response to the BP spill. The rules targeted blowout preventers, massive valve-like devices designed to prevent spills from wells on the ocean floor. The preventer used by BP failed. The rules require more frequent inspections of those and other devices and dictate that experts onshore monitor drilling of highly complex wells in real time.\nThe Gulf of Mexico is still recovering from the BP spill, said Diane Hoskins, campaign director for the marine conservation group Oceana.\n\"Americans have seen the devastation that comes from offshore drilling,\" she said. \"Will we allow Florida's white beaches or the popular and pristine Outer Banks to share a similar fate? What about the scenic Pacific coast or even remote Arctic waters?\"\nZinke's announcement \"ignores widespread and bipartisan opposition to offshore drilling,\" including from more than 150 municipalities nationwide and 1,200 local, state and federal officials, Hoskins said.\nScott, the Florida governor, said he has asked for an immediate meeting with Zinke to discuss his concerns. \"My top priority is to ensure that Florida's natural resources are protected,\" Scott said. Hogan, of Maryland, said he would oppose the plan \"to the fullest extent that is legally possible.\"\nCalifornia was the site of the first offshore drilling in the U.S. more than 120 years ago, but the region was tarnished by one of the worst spills in U.S. history in 1969, when more than 3 million gallons of oil poured into the ocean near Santa Barbara.\nThousands of sea birds were killed, along with dolphins, elephant seals and sea lions. Virtually all commercial fishing near Santa Barbara was halted, and tourism dropped dramatically.\nPublic outrage generated by the spill helped spark the modern environmental movement, and no federal leases have been granted off the California coast since 1984.\nDemocratic Govs. Jerry Brown of California, Kate Brown of Oregon and Jay Inslee of Washington issued a joint statement slamming the proposal, which they said ignored science and the devastation of past offshore spills.\n\"For more than 30 years, our shared coastline has been protected from further federal drilling and we'll do whatever it takes to stop this reckless, short-sighted action,\" they said.", "external_links": [], "published": "2018-01-04T20:04:00.000+02:00", "crawled": "2018-01-05T00:03:44.012+02:00", "highlightTitle": ""}