{"organizations": [], "uuid": "bac6ac1e5e0e1b8659fbb525add367486330a733", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/emerging-markets-latam/emerging-markets-brazil-markets-soar-as-lula-trial-adds-to-em-rally-idUSL2N1PJ0QH", "country": "US", "domain_rank": 408, "title": "EMERGING MARKETS-Brazil markets soar as Lula trial adds to EM rally", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:14:00.000+02:00", "replies_count": 0, "uuid": "bac6ac1e5e0e1b8659fbb525add367486330a733"}, "author": "", "url": "https://www.reuters.com/article/emerging-markets-latam/emerging-markets-brazil-markets-soar-as-lula-trial-adds-to-em-rally-idUSL2N1PJ0QH", "ord_in_thread": 0, "title": "EMERGING MARKETS-Brazil markets soar as Lula trial adds to EM rally", "locations": [], "entities": {"persons": [{"name": "lula", "sentiment": "negative"}, {"name": "michel temer", "sentiment": "none"}, {"name": "bruno federowski", "sentiment": "none"}, {"name": "luiz inácio lula da silva", "sentiment": "none"}], "locations": [{"name": "brasilia", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}], "organizations": [{"name": "fibria celulose sa", "sentiment": "none"}, {"name": "banco bradesco sa", "sentiment": "none"}, {"name": "vale sa", "sentiment": "none"}, {"name": "petróleo brasileiro sa", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "itaú unibanco holding sa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 2:18 PM / in 4 minutes EMERGING MARKETS-Brazil markets soar as Lula trial adds to EM rally Reuters Staff 4 Min Read By Bruno Federowski BRASILIA, Jan 24 (Reuters) - Brazilian markets surged on Wednesday as bets that former President Luiz Inácio Lula da Silva would be barred from running in this year's presidential race added to a global emerging market rally. The benchmark Bovespa stock index hit an all-time high above 82,000 points as an appeals court discussed whether to confirm Lula's conviction on corruption charges. Lula, who has railed against President Michel Temer's austerity platform and is leading polls of voter intentions for the October election, would be banned from the race by an unfavorable ruling, though he could still appeal the decision. Blue-chip Brazilian stocks such as lenders Itaú Unibanco Holding SA and Banco Bradesco SA, miner Vale SA and state-controlled oil firm Petróleo Brasileiro SA led the rally. The sole decliner on the index was wood pulp producer Fibria Celulose SA, which could see the value of its exports fall as the Brazil's currency appreciated. Most traders expected the court to uphold Lula's conviction, but there were doubts about whether all three judges weighing the case would vote unanimously. \"A 3-0 vote against Lula would make it less likely that he runs,\" analysts at LCA Consultores wrote in a report. \"Our baseline scenario is that Lula will be convicted. It is harder to guess whether all judges will agree, but a unanimous decision seems to us a bit more likely than other possibilities.\" The Brazilian real firmed 1.6 percent, the biggest gainer among Latin American currencies amid broad U.S. dollar weakness. The dollar slid to a three-year low against a basket of currencies after the U.S. Treasury secretary said he welcomed weakness in the currency. In a break with the traditional strong dollar mantra, Treasury Secretary Steven Mnuchin said the weaker dollar was positive for American trade. Currencies from Mexico, Chile and Colombia firmed between 0.8 percent and 1.2 percent. Also helping to support demand for the Mexican peso were upbeat comments by negotiators looking to overhaul the North American Free Trade Agreement (NAFTA). U.S. President Donald Trump said the talks were going \"pretty well\" and Canada's chief negotiator said he had high hopes for progress. Trump, vowing to undo what he portrays as disastrous trade deals, has in recent days expressed different views about NAFTA, stoking concerns about trade with Mexico. Key Latin American stock indexes and currencies at 1340 GMT: Stock indexes daily % YTD % change change Latest MSCI Emerging Markets 1256.24 0.31 8.11 MSCI LatAm 3128.99 2.54 7.9 Brazil Bovespa 82547.58 2.32 8.04 Chile IPSA 5794.77 -0.09 4.14 Chile IGPA 29134.71 -0.07 4.12 Currencies daily % YTD % change change Latest Brazil real 3.1859 1.62 4.00 Mexico peso 18.5490 0.80 6.20 Chile peso 603.74 0.85 1.81 Colombia peso 2818.93 1.18 5.78 Peru sol 3.212 0.22 0.78 Argentina peso (interbank) 19.4200 -0.39 -4.22 Argentina peso (parallel) 19.83 -0.15 -3.03 (Reporting by Bruno Federowski; Editing by Meredith Mazzilli)", "external_links": [], "published": "2018-01-24T16:14:00.000+02:00", "crawled": "2018-01-24T16:34:20.016+02:00", "highlightTitle": ""}