{"organizations": [], "uuid": "4dd35593bfa5da2a856212bbda1fae8aa923e287", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226961338&w=1200&r=LYNXMPEE0U10R", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-peru-corruption-grana-y-montero/prosecutors-in-peru-target-grana-y-montero-in-graft-probe-idUKKBN1FK20C", "country": "US", "domain_rank": 408, "title": "Prosecutors in Peru target Grana y Montero in graft probe", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T16:00:00.000+02:00", "replies_count": 0, "uuid": "4dd35593bfa5da2a856212bbda1fae8aa923e287"}, "author": "", "url": "https://uk.reuters.com/article/uk-peru-corruption-grana-y-montero/prosecutors-in-peru-target-grana-y-montero-in-graft-probe-idUKKBN1FK20C", "ord_in_thread": 0, "title": "Prosecutors in Peru target Grana y Montero in graft probe", "locations": [], "entities": {"persons": [{"name": "grana", "sentiment": "none"}], "locations": [{"name": "grana y montero", "sentiment": "none"}, {"name": "peru", "sentiment": "none"}], "organizations": [{"name": "min read  lima", "sentiment": "none"}, {"name": "odebrecht", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "grana y montero", "sentiment": "none"}, {"name": "montero group", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 2:01 PM / Updated 8 minutes ago Prosecutors in Peru target Grana y Montero in graft probe Reuters Staff 3 Min Read \nLIMA (Reuters) - Peruvian prosecutors investigating a $20 million bribe that Brazilian builder Odebrecht allegedly paid a former president have sought a judge’s approval to formally investigate Peru’s biggest construction company, Grana y Montero. \nGrana said late on Tuesday that a judge had summoned it to a Feb 16 hearing regarding the prosecutors’ request to include it and other units in the Grana y Montero Group as “investigated subjects” in the far-reaching graft probe. \nGrana rejected the notion that any of the Grana companies should be targeted. “These companies are not organizations designed to corrupt officials...on the contrary, we are an organization with no room for irregular practices or fraud,” the company said in a statement. \nGrana has been hit by a series of setbacks that have sunk its share price since late 2016, when its partner Odebrecht acknowledged paying local officials $29 million in bribes to secure lucrative construction contracts. \nAs Grana has been paying down debt stemming from the cancellation of a pipeline project it was building with Odebrecht, its former executives have been placed under pre-trial arrest and prosecutors have raided its offices. \nGrana reiterated on Tuesday that it had no knowledge that any of its employees or former employees took part in corruption and said it was willing to collaborate with probes by public prosecutors. \nIt was not clear what the immediate impact might be if Grana were formally placed under investigation. \nUnder an anti-graft law passed last year, companies that have acknowledged or been found guilty of corruption cannot bid on new government contracts and must comply with a series of financial restrictions. \nCritics say the law has discouraged other companies from offering prosecutors details of potential corruption and the government of President Pedro Pablo Kuczynski has said it plans to replace it ahead of its expiration next month. \nThe opposition-controlled Congress passed legislation last year to expand the law to include Odebrecht’s partners, but the prime minister signaled Kuczynski would not sign off on it. \nJudge Richard Concepcion, who has approved prosecutors’ requests to order the pre-trial detention of corruption suspects, summoned Grana to the Feb 16 hearing, Grana said. \nLast year, lead prosecutor Hamilton Castro accused Odebrecht of paying a $20 million bribe to former president Alejandro Toledo. Toledo, who is in the United States and is wanted for arrest in Peru, denies the charges. Reporting By Mitra Taj; Editing by Andrew Hay", "external_links": [], "published": "2018-01-31T16:00:00.000+02:00", "crawled": "2018-01-31T16:12:06.002+02:00", "highlightTitle": ""}