{"organizations": [], "uuid": "f543e03bd7a3d83501df69abd4b4fab74d3e012f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/01/fortune-logo.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/25/brainstorm-health-daily-01-25-18/", "country": "US", "domain_rank": 1196, "title": "Brainstorm Health: Trump at Davos, Monkey Clones, Azar HHS Confirmation | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.599, "site_type": "news", "published": "2018-01-26T15:06:00.000+02:00", "replies_count": 0, "uuid": "f543e03bd7a3d83501df69abd4b4fab74d3e012f"}, "author": "Clifton Leaf", "url": "http://fortune.com/2018/01/25/brainstorm-health-daily-01-25-18/", "ord_in_thread": 0, "title": "Brainstorm Health: Trump at Davos, Monkey Clones, Azar HHS Confirmation | Fortune", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "azar", "sentiment": "negative"}, {"name": "clifton leaf", "sentiment": "negative"}, {"name": "sue desmond-hellmann", "sentiment": "none"}, {"name": "bill gates", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}], "organizations": [{"name": "bill & melinda gates foundation", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Clifton Leaf 1:06 PM EST \nHello Dailies. President Trump arrived at the globe-hugging, free-trade-lovin’ World Economic Forum today, along with what appears to be his entire administration in tow. Cabinet secretaries, aides, and a veritable posse of current (and oddly, former) Trump staffers were also on hand, marching in and out of the city’s swank hotels with their earphoned security details. \nMr. Trump’s big speech comes tomorrow, following a week’s worth of other world leaders’ remarks to the CEO set assembled in this alpine redoubt. But in the meantime, the daily business of Davos—an unbroken agenda of speeches and side meetings, panels and presentations—continues…and continues. I could say something snarky here about said agenda, but the truth is, some of this stuff is both fascinating and important. \nI’ll have more to report soon, for example, on where we stand in the age-old fight against malaria. Bill Gates and Sue Desmond-Hellmann, CEO of the Bill & Melinda Gates Foundation, gave a striking assessment yesterday of how and when we could eradicate this child-decimating disease, the 21st century tools (from sophisticated data mapping to gene drives) that will help us accomplish it, and what could reverse the progress made if we’re not vigilant. I’ll share some thoughts on an illuminating panel on mental health—and why Kaiser Permanente CEO Bernard Tyson (one of the most powerful speakers I’ve met) says that, when it comes to healthcare, we’ve cut our heads off our bodies. I’ll sum up what some provocative soothsayers like Siemens CEO Joe Kaeser, Google Cloud honcho Diane Greene, and Will.i.am say healthcare, jobs, and social interaction will look like in five years—courtesy of the annual hot-ticket Salesforce lunch. But first, I have to run to another meeting. Clifton Leaf, Editor in Chief, FORTUNE @CliftonLeaf DIGITAL HEALTH \nMonkey see, monkey do… Monkey two? Chinese researchers have successfully cloned healthy monkeys using the same method that was used to replicate the famous sheep Dolly. Now, monkeys are far from the first animals to be cloned—but the development represents a striking milestone because, up until now, primates had never been successfully cloned. And the achievement comes with both medical promise and plenty of ethical debate. “The Chinese researchers said cloning of fetal cells could be combined with gene editing techniques to produce large numbers of monkeys with certain genetic defects that cause disease in people. The animals could then be used to study such diseases and test treatments. The researchers said their initial targets will be Alzheimer’s and Parkinson’s,” ABC reports. ( ABC News ) INDICATIONS \nYet another Alzheimer’s drug disappointment. Add another experimental Alzheimer’s treatment to the dustbin of pharma R&D history: Takeda announced Thursday that its diabetes drug Actos did not, in fact, slow down Alzheimer’s symptoms in patients. And that’s not the only bit of challenging Alzheimer’s news out today—Eli Lilly, whose experimental solanezumab famously flopped after showing early promise, announced complete findings from the drug’s late-stage trials which may challenge the “amyloid hypothesis” of Alzheimer’s altogether (i.e., the suggestion that tackling the protein which leads to brain plaque in patients could help slow cognitive decline). ( Forbes ) THE BIG PICTURE \nAlex Azar confirmed as HHS Secretary. Former pharmaceutical executive and George W. Bush administration official Alex Azar won confirmation by the U.S. Senate to be the next Secretary of Health and Human Services (HHS) on Wednesday. Six Democratic Senators joined Republicans in the 55-43 vote confirming his nomination, while one lone Republican, Kentucky’s Sen. Rand Paul, voted against him. Independent Senators Angus King of Maine and Bernie Sanders of Vermont split their votes, with King in support and Sanders opposed. \nThe federalism war on Obamacare begins. The state of Kentucky is being sued over new proposed work requirements on low-income Americans who received health care through Medicaid, which was significantly expanded in dozens of states under Obamacare. What’s more, Idaho is pursuing plans to allow insurers to sell health plans which don’t abide by the health law’s various consumer protections, and will likely be subject to legal scrutiny under the Supremacy Clause, according to some experts. REQUIRED READING ", "external_links": [], "published": "2018-01-26T15:06:00.000+02:00", "crawled": "2018-01-26T01:46:31.017+02:00", "highlightTitle": ""}