{"organizations": [], "uuid": "d853200792cc7cb77093a1556b9930aaed306d87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/us-france-babymilk-victims/group-representing-lactalis-victims-says-48-children-infected-with-salmonella-idUKKBN1FF239", "country": "US", "domain_rank": 408, "title": "Group representing Lactalis victims says 48 children infected with salmonella", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T17:36:00.000+02:00", "replies_count": 0, "uuid": "d853200792cc7cb77093a1556b9930aaed306d87"}, "author": "", "url": "https://uk.reuters.com/article/us-france-babymilk-victims/group-representing-lactalis-victims-says-48-children-infected-with-salmonella-idUKKBN1FF239", "ord_in_thread": 0, "title": "Group representing Lactalis victims says 48 children infected with salmonella", "locations": [], "entities": {"persons": [{"name": "quentin guillemain", "sentiment": "none"}, {"name": "john irish", "sentiment": "none"}, {"name": "leigh thomas", "sentiment": "none"}, {"name": "sybille de la hamaide", "sentiment": "none"}], "locations": [{"name": "paris", "sentiment": "none"}], "organizations": [{"name": "group", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "salmonella contaminated victims families association", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 3:38 PM / Updated 34 minutes ago Lactalis victims' group says 10 more babies have salmonella Reuters Staff 2 Min Read \nPARIS (Reuters) - Ten more babies have tested positive for salmonella in France after drinking milk produced by the firm Lactalis, a group representing families said on Friday \nLactalis, one of the world’s largest dairy groups, has recalled 12 millions tins nationwide and from stores around the world after last month discovering salmonella bacteria in some baby milk at a factory in western France. \nFrench authorities have said that “Salmonella Agona” infections were reported in 38 cases between mid-August and December, 36 of them clearly linked to Lactalis milk. \nBut Quentin Guillemain, president of the Association of Families of Victims Contaminated with Salmonella (AFVLCS), told reporters there were “at least 10 families to this date not accounted for” whose children had tested positive for salmonella after drinking Lactalis milk. \nAnother case has been confirmed in Spain and one is suspected in Greece. The recalls have stretched as far as China. \nPresident Emmanuel Macron addressed the issue on Thursday, saying there could be no tolerance for companies that did not respect rules. \nAFVLCS’s lawyer, Jade Dousselin, said she would file 10 legal complaints from families at the end of next week, eight against Lactalis, and two against the retailers Leclerc and Auchan [AUCH.UL]. \nLeclerc, Auchan, Carrefour and Systeme U have all acknowledged that some baby milk recalled by Lactalis made it onto their shelves. \nThe consumer protection body DGCCRF has performed 3,600 checks in the past two weeks and found recalled products in two supermarkets, 13 pharmacies, one hospital and six other distributors, the economy ministry said. \nAFVLCS plans to launch a website on Monday allowing families to submit legal complaints through the association. \nLactalis Chief Executive Emmanuel Besnier has said his group will compensate every family that has suffered harm. Reporting by Sybille de la Hamaide; writing by John Irish; Editing by Kevin Liffey", "external_links": [], "published": "2018-01-26T17:36:00.000+02:00", "crawled": "2018-01-26T17:49:41.013+02:00", "highlightTitle": ""}