{"organizations": [], "uuid": "944e559eaf222923f3a7ec3c7e16c806bf7547d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221354997&w=1200&r=LYNXMPEE0B09P", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-usa-trump-britain/trump-cancels-uk-visit-says-will-not-unveil-new-u-s-embassy-idUSKBN1F10H6", "country": "US", "domain_rank": 408, "title": "Trump cancels UK visit, says will not unveil new U.S. embassy", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T08:10:00.000+02:00", "replies_count": 0, "uuid": "944e559eaf222923f3a7ec3c7e16c806bf7547d4"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-britain/trump-cancels-uk-visit-says-will-not-unveil-new-u-s-embassy-idUSKBN1F10H6", "ord_in_thread": 0, "title": "Trump cancels UK visit, says will not unveil new U.S. embassy", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "obama administration", "sentiment": "none"}, {"name": "u.s. embassy & consulates", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 6:07 AM / Updated 5 hours ago Trump cancels Britain trip, blames Obama for 'peanuts' London embassy deal Guy Faulconbridge , Costas Pitas 6 Min Read \nLONDON (Reuters) - U.S. President Donald Trump canceled a trip to London scheduled for next month to open a new embassy, saying he did not want to endorse a bad deal agreed by the Obama administration to sell the old one for “peanuts”. \nThe trip’s cancellation is a further blow to relations between the close allies. More than a year into his presidency, Trump has yet to visit London, with many Britons vowing to protest against a man they see as crude, volatile and opposed to their values on a range of issues. \nThe decision to move the U.S. Embassy from its current Grosvenor Square location in the upmarket Mayfair area of London and to a site on the south bank of the Thames was agreed in 2008 under the presidency of George W. Bush. [ tmsnrt.rs/2DnVe8U ] \nHowever, Trump blamed former president Barack Obama for the sale, saying he would not attend the official opening of the new site. \n“(The) reason I canceled my trip to London is that I am not a big fan of the Obama administration having sold perhaps the best located and finest embassy in London for ‘peanuts,’ only to build a new one in an off location for 1.2 billion dollars,” Trump said in a tweet late on Thursday. \n“Bad deal. Wanted me to cut ribbon-NO!” Trump said. \nA pillar of Britain’s foreign policy since World War Two, the “special relationship” with Washington has taken on added importance as Britain prepares to leave the European Union in 2019 and seeks new major trade deals. \nPrime Minister Theresa May was the first foreign leader to visit Trump after his inauguration in January last year, and they were filmed emerging from the White House holding hands. She later said Trump took her hand in a gentlemanly gesture as they walked down a ramp. \nBut British officials have been dismayed by some of Trump’s pronouncements, particularly a proposed ban on Muslims entering the United States and most recently when Trump rebuked May on Twitter after she criticized him for retweeting British far-right anti-Islam videos. \nDuring May’s U.S. trip a year ago, she extended an invitation to Trump to make a formal state visit - which includes pomp, pageantry and a banquet with Queen Elizabeth. \nMay’s spokesman told reporters Trump was welcome in London and that the invitation to visit had been accepted, although no date agreed. He said the opening of the embassy was a matter for the U.S. government. \n“The U.S. is one of our oldest and most valued allies and our strong and deep partnership will endure,” the spokesman said. \n“HE‘S GOT THE MESSAGE” FILE PHOTO: The new United States embassy building is seen during a press preview near the River Thames in London, Britain December 13, 2017. REUTERS/Stefan Rousseau/Pool/File Photo \nMany British politicians have voiced their opposition to Trump being granted a state visit, and say the invite should be recalled. \n“Many Londoners have made it clear that Donald Trump is not welcome here while he is pursuing such a divisive agenda,” London Mayor Sadiq Khan, who has often exchanged barbs with Trump on social media, tweeted. \n“It seems he’s finally got the message.” \nBritish Foreign Secretary Boris Johnson said opponents such as Khan were putting the relationship with the United States, the biggest investor in Britain, at risk. \n“We will not allow US-UK relations to be endangered by some puffed-up, pompous popinjay in City Hall,” Johnson tweeted. Slideshow (5 Images) \nThe American flag was this month removed from Grosvenor Square where the U.S. embassy has been based since 1938 with the area known as “Little America” during World War Two, when the square also housed the military headquarters of General Dwight D. Eisenhower. \nIt was also the scene of violence in 1968 when thousands of demonstrators protested against the U.S. war in Vietnam. \nIn October 2008, the embassy was put up for sale and, the following year, sold to Gulf investor Qatari Diar. The purchase price was not disclosed. In 2009, it was given “listed” status which limits changes that can be made to the building’s exterior because of its historical significance. \nWoody Johnson, Trump’s appointed U.S. ambassador to Britain, told reporters last month that moving to the new site at Nine Elms reflected “the global outlook of the U.S. going forward in the 21st century: rather looking out, than looking in”. \n“This isn’t just a new office, though, it signifies a new era of friendship between out two countries. President Trump wants us to work more closely than ever with the UK,” said Johnson, adding he hoped the president would attend the opening ceremony. \nThere had long been security concerns about the Grosvenor Square site, dating back to the late 1990s after attacks on U.S. embassies in Africa. \nSome local residents had opposed measures that they felt would detract from one of London’s plushest neighborhoods while others feared not enough was being done to ensure they would not be caught up in any attack. \nThe new embassy is a veritable fortress set back at least 100 feet (30 meters) from surrounding buildings - mostly newly-erected high-rise residential blocks - and incorporating living quarters for U.S. Marines permanently stationed inside. \nThe $1 billion construction was funded by the sale of other properties in London. Additional reporting by David Milliken, Alistair Smout and Kanishka Singh; Writing by Michael Holden; Editing by Robin Pomeroy/Jeremy Gaunt", "external_links": [], "published": "2018-01-12T08:10:00.000+02:00", "crawled": "2018-01-12T08:22:38.007+02:00", "highlightTitle": ""}