{"organizations": [], "uuid": "d76258029e3924354b82cc9adaf0f0aab6962736", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-canon-u-s-a-kicks-off-2018-with-announcement-of-new-executive-appointments.html", "country": "US", "domain_rank": 767, "title": "Canon U.S.A. Kicks Off 2018 with Announcement of New Executive Appointments", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T17:27:00.000+02:00", "replies_count": 0, "uuid": "d76258029e3924354b82cc9adaf0f0aab6962736"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-canon-u-s-a-kicks-off-2018-with-announcement-of-new-executive-appointments.html", "ord_in_thread": 0, "title": "Canon U.S.A. Kicks Off 2018 with Announcement of New Executive Appointments", "locations": [], "entities": {"persons": [{"name": "ross he", "sentiment": "none"}, {"name": "joe adachi", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "melville", "sentiment": "none"}], "organizations": [{"name": "canon u.s.a.", "sentiment": "negative"}, {"name": "canon", "sentiment": "none"}, {"name": "canon u.s.a., inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELVILLE, N.Y., Jan. 11, 2018 /PRNewswire/ -- Beginning the New Year with a celebration of teamwork and an appreciation for those who have contributed to the company's continued success, Canon U.S.A., Inc., a leader in digital imaging solutions, is proud to announce new senior executive appointments and promotions, effective January 1, 2018. These personnel moves represent Canon's commitment to elevating its own leaders and putting them in a position to succeed, both personally and professionally.\n\"Every year, it is a great honor of mine to announce the well-deserved promotions of some of our cherished Canon team members,\" said Joe Adachi, chairman and chief executive officer, Canon U.S.A., Inc. \"These individuals are truly representative of the valuable leadership and dedication that is prevalent in so many of our esteemed employees. Having shown a strong commitment to helping cement our company's standing as an industry leader, I thank them for their continued service and wish them much success with their new responsibilities.\"\nExecutive promotions for the New Year include:\nRoss Held has been promoted from vice president and general manager to senior vice president and general manager, Imaging Technologies Communications Group, Canon U.S.A., Inc. Richard Antaya has been promoted from senior director and general manager to vice president, Imaging Technologies Communications Group, Canon U.S.A., Inc. Robert Poseno has been promoted from senior director and general manager to vice president, Imaging Technologies Communications Group, Canon U.S.A., Inc. Peter Kowalczuk has been promoted from executive vice president and general manager to president of Canon Solutions America, a wholly owned subsidiary of Canon U.S.A.\nFor more information about Canon U.S.A., visit www.usa.canon.com .\nAbout Canon U.S.A., Inc.\nCanon U.S.A., Inc., is a leading provider of consumer, business-to-business, and industrial digital imaging solutions to the United States and to Latin America and the Caribbean markets. With approximately $29 billion in global revenue, its parent company, Canon Inc. (NYSE:CAJ), ranks third overall in U.S. patents granted in 2017. † Canon U.S.A. is committed to the highest level of customer satisfaction and loyalty, providing 100 percent U.S.-based service and support for all of the products it distributes in the United States. Canon U.S.A. is dedicated to its Kyosei philosophy of social and environmental responsibility. In 2014, the Canon Americas Headquarters secured LEED® Gold certification, a recognition for the design, construction, operations and maintenance of high-performance green buildings. To keep apprised of the latest news from Canon U.S.A., sign up for the Company's RSS news feed by visiting www.usa.canon.com/rss and follow us on Twitter @CanonUSA. For media inquiries, please contact pr@cusa.canon.com .\n† Based on weekly patent counts issued by United States Patent and Trademark Office.\nCanon U.S.A. Web site:\nhttp://www.usa.canon.com\nFor sales information/customer support:\n1-800-OK-CANON\nView original content with multimedia: http://www.prnewswire.com/news-releases/canon-usa-kicks-off-2018-with-announcement-of-new-executive-appointments-300581401.html\nSOURCE Canon U.S.A., Inc.", "external_links": ["http://www.usa.canon.com/rss", "http://www.usa.canon.com/", "http://www.prnewswire.com/news-releases/canon-usa-kicks-off-2018-with-announcement-of-new-executive-appointments-300581401.html"], "published": "2018-01-11T17:27:00.000+02:00", "crawled": "2018-01-11T19:05:47.000+02:00", "highlightTitle": ""}