{"organizations": [], "uuid": "e13bb06c28c1118499b2c6f47ef5db5e384419e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224896799&w=1200&r=LYNXMPEE0N1Y0", "site_section": "http://feeds.reuters.com/reuters/UKEntertainment", "section_title": "Reuters: Entertainment News", "url": "https://uk.reuters.com/article/uk-people-elton/british-pop-musician-elton-john-to-quit-touring-daily-mirror-says-idUKKBN1FD1D5", "country": "US", "domain_rank": 408, "title": "Goodbye yellow brick tours; Elton John announces farewell world concerts", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T21:11:00.000+02:00", "replies_count": 0, "uuid": "e13bb06c28c1118499b2c6f47ef5db5e384419e8"}, "author": "", "url": "https://uk.reuters.com/article/uk-people-elton/british-pop-musician-elton-john-to-quit-touring-daily-mirror-says-idUKKBN1FD1D5", "ord_in_thread": 0, "title": "Goodbye yellow brick tours; Elton John announces farewell world concerts", "locations": [], "entities": {"persons": [{"name": "elton john", "sentiment": "negative"}, {"name": "john", "sentiment": "none"}, {"name": "david furnish", "sentiment": "none"}, {"name": "alicia powell", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 11:15 AM / Updated 3 hours ago Goodbye yellow brick tours; Elton John announces farewell world concerts Alicia Powell 3 Min Read \nNEW YORK (Reuters) - Elton John on Wednesday announced a three-year farewell world tour, saying he would quit traveling afterward to focus on life with his family. \nThe 70-year-old singer, one of the best-selling recording artists in the world over a 50-year career, told a news conference in New York that his priorities have changed after becoming a parent to two children with his husband David Furnish. \n“I love them so much. I don’t want to miss them and I don’t want them to miss me,” he said. “I’ve had a good run.” \nHe said his last tour, called “Farewell Yellow Brick Road,” would start in September 2018 in the United States and would last through 2021, taking him all around the world. \n“It will be a wonderful way to thank people,” he said. “It’s a way of going out with a bang. I’m not the kind of guy to go out with a whimper.” \nJohn made the announcement after a live performance of his hits “Tiny Dancer” and “I‘m Still Standing.” \nWith a penchant for flamboyant stage costumes and an ear for piano rockers and ballads, John has dominated the pop industry for decades with hits like “Your Song” and “Candle in the Wind.” Singer Elton John performs before announcing his final \"Farewell Yellow Brick Road\" tour in Manhattan, New York, U.S., January 24, 2018. REUTERS/Shannon Stapleton \nOn Wednesday, he denied British media reports that he was quitting touring because of ill health. \nBut he said he had been on the road since he was 17, adding; “I can’t physically do the traveling anymore. I want to be home with my children more.” \nJohn and Furnish married in 2014 and the couple are raising two sons, Zachary, 7, and Elijah, 5, who were born through a surrogate mother. Slideshow (5 Images) \n“I never thought that I could love anything as much as I love my sons... I never thought I could be a father, I thought I’m too selfish, too set in my ways,” he said. \nJohn is due to perform at the Grammy Awards in New York on Sunday. On Jan 30, musicians including Miley Cyrus, John Legend, Chris Martin and Sam Smith will pay tribute to his music and career at a previously announced concert in New York. \nJohn, who has Grammy, Oscar and Tony awards for his work in film and theater including “The Lion King” and “Billy Elliott,” said he planned to remain creative but said that after the tour he would likely take 2 or 3 years off from writing music. \nOnce a hard-partying rock star with a voracious appetite for cocaine and alcohol, John has achieved the kind of long-lasting fame enjoyed by The Beatles and The Rolling Stones. \nHe also was one of the first celebrities to become involved in the fight against AIDS. His AIDS Foundation, established in 1992, has raised millions of dollars for prevention and services. Reporting by Piya Sinha-Roy in Los Angeles and Guy Faulconbridge in London, Editing by Franklin Paul in New York", "external_links": [], "published": "2018-01-24T21:11:00.000+02:00", "crawled": "2018-01-24T21:50:03.000+02:00", "highlightTitle": ""}