{"organizations": [], "uuid": "4e9d5d9ec7b04a48b3db98afd178bda2ddd27b9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180111.html", "section_title": "Archive News &amp; Video for Thursday, 11 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/eurozone-bonds/update-2-german-bund-yields-hit-0-5-percent-as-ecb-to-revisit-policy-stance-in-early-2018-idUSL8N1P63UA", "country": "US", "domain_rank": 408, "title": "UPDATE 3-German Bund yields hit 5 month high after ECB says may tweak messaging in early 2018", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T21:40:00.000+02:00", "replies_count": 0, "uuid": "4e9d5d9ec7b04a48b3db98afd178bda2ddd27b9a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/eurozone-bonds/update-2-german-bund-yields-hit-0-5-percent-as-ecb-to-revisit-policy-stance-in-early-2018-idUSL8N1P63UA", "ord_in_thread": 0, "title": "UPDATE 3-German Bund yields hit 5 month high after ECB says may tweak messaging in early 2018", "locations": [], "entities": {"persons": [{"name": "fanny potkin", "sentiment": "none"}, {"name": "dhara ranasinghe", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Bund yield jumps to 0.53 pct, highest in over 5 months\n* ECB Dec meeting minutes take markets by surprise\n* Regulator: Report China slowing US bond buys may be fake\n* Euro zone periphery govt bond yields tmsnrt.rs/2ii2Bqr (Updates prices)\nBy Dhara Ranasinghe and Fanny Potkin\nLONDON, Jan 11 (Reuters) - German bond yields hit their highest levels since September on Thursday after minutes from the ECB’s December meeting said the bank should revisit its communication stance in early 2018 and gradually adjust its language to reflect improved growth.\nGermany’s 10-year Bund yield jumped 5 basis points to as high as 0.532 percent in late trades, its highest point in over 5 months.\nThe December policy meeting minutes took markets by surprise, putting bond investors back on the defensive in a week that has seen bond markets rattled by fears that Bank of Japan stimulus could come to an end and a report that China may stop purchases of U.S. Treasuries.\nA change in the ECB’s policy message would likely be taken by investors as a sign that rate-setters are getting ready to wind down their 2.55 trillion euros bond-buying programme, the key plank of their stimulus policy for the past three years.\n“There seems to be a consensus that the ECB has to prepare the markets well before September for a change in the policy stance,” said Martin van Vliet, senior rates strategist at ING, referring to the minutes. “That’s obviously come a bit sooner than expected for markets.”\nMost euro zone bond yields jumped 3-6 basis points higher on the day.\nThey had opened lower after China’s regulator called a report about Beijing slowing or halting its U.S. bond purchases possibly erroneous, allowing a degree of calm to return to debt markets.\nFears about a withdrawal of the central bank stimulus that has long held borrowing costs down, combined with higher oil prices and hefty new bond supply, have in recent days soured sentiment in bond markets, pushing up yields in the United States, Europe and Japan.\nPeripheral bonds outperformed their top-rated peers after Italy successfully sold six billion euros of bonds but trimmed yield falls after the ECB minutes.\nU.S. Treasury yields gave up earlier falls and were last up around 2 bps at 2.564 percent -- heading back towards Wednesday’s 10-month peak just shy of 2.60 percent.\nAnalysts said that with firmer growth and oil prices expected to feed through to higher inflation, the outlook for bonds remained bearish.\n“We have strong momentum in the world economy, which is consistent with bond yields being materially higher than they are today,” said Chris Bailey, European strategist at Raymond James, a wealth management firm.\nReporting by Dhara Ranasinghe & Fanny Potkin; Editing by Toby Chopra\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://tmsnrt.rs/2ii2Bqr", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T21:40:00.000+02:00", "crawled": "2018-01-12T18:39:55.036+02:00", "highlightTitle": ""}