{"organizations": [], "uuid": "d13e824273b8949cc5e2e114cc394961f5fa7b77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-tunisia-women-rights/is-womens-inheritance-next-on-reformist-tunisias-rights-agenda-idUSKBN1FE2UC", "country": "US", "domain_rank": 408, "title": "Is women's inheritance next on reformist Tunisia's rights agenda?", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T03:27:00.000+02:00", "replies_count": 0, "uuid": "d13e824273b8949cc5e2e114cc394961f5fa7b77"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-tunisia-women-rights/is-womens-inheritance-next-on-reformist-tunisias-rights-agenda-idUSKBN1FE2UC", "ord_in_thread": 0, "title": "Is women's inheritance next on reformist Tunisia's rights agenda?", "locations": [], "entities": {"persons": [{"name": "bochra bel haj hmida", "sentiment": "none"}], "locations": [{"name": "beirut", "sentiment": "none"}, {"name": "tunisia", "sentiment": "none"}, {"name": "lebanon", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "neutral"}, {"name": "committee on individual freedoms and equality", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIRUT (Thomson Reuters Foundation) - Women in Tunisia may be able to pass their family name on to their children and have equal inheritance with men if proposals, due to be finalised in February, are adopted in a country regarded as a leader for women’s rights in the Arab world.\nThe Committee on Individual Freedoms and Equality, set up in August, will present its recommendations on Feb. 20 to the president.\n“Tunisia is once again pioneering and irreversibly moving towards advancement,” the committee’s chairwoman Bochra Bel Haj Hmida told the Thomson Reuters Foundation in emailed comments.\n“The issue of the right of children to add the title of their mother has been discussed ... All discriminatory laws in the family space and public space are included in the commission’s tasks.”\nWomen in the north African country are eagerly anticipating the proposals, following gains in 2017 that lifted a ban on Muslim women marrying non-Muslim men and an end to a law that let rapists escape punishment by marrying their victims.\nThis led the way for Jordan and Lebanon to scrap similar laws, following lengthy campaigns by activists.\nThe committee will present two proposals on inheritance, one providing for full equality between men and women and a second merely allowing women to request parity, Tunisia’s TAP news agency reported earlier this month.\nWafa Ben-Hassine, a Tunisian lawyer and women’s rights advocate, applauded the prospect of further reform but cautioned that new laws must also be implemented on the ground.\nA 2017 law criminalizing domestic violence, harassment in public spaces and pay discrimination also requires Tunisia’s government to provide services to assist survivors, but did not make provisions for funding them, Human Rights Watch (HRW) said.\n“The law ... means little if not backed up by real resources that address root causes of violence,” Ben-Hassine said, calling for doctors to receive training to detect signs of domestic violence and for schools to teach gender equality.\nTunisia’s religion-based personal status laws - which govern marriage, child custody, divorce and inheritance - are among the most progressive in the region, according to activists.\nBut men are still designated as head of the household and Tunisian girls do not receive an equal share of inheritance, according to HRW.\n“Tunisia is already being seen as a pioneer when it comes to women’s rights,” Suad Abu-Dayyeh, a Middle East expert with the global advocacy group Equality Now, said in emailed comments.\n“These new developments towards gender equality will definitely help affect positive change in other regional countries, such as encouraging the repeal of discriminatory laws (including) those relating to rape and nationality.”\nReporting by Heba Kanso @hebakanso, Editing by Katy Migiro. Please credit Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women’s rights, trafficking, property rights, and climate change. Visit www.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-26T03:27:00.000+02:00", "crawled": "2018-01-25T23:08:13.005+02:00", "highlightTitle": ""}