{"organizations": [], "uuid": "06eef362aa9f8c06ee309e1fb9b4ae847cc6ce7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/05/05/103610573-GettyImages-520557810.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/19/nomura-instinet-square-shares-to-rise-59-percent-this-year.html", "country": "US", "domain_rank": 767, "title": "Nomura Instinet: Square shares to rise 59 percent this year", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-19T16:25:00.000+02:00", "replies_count": 0, "uuid": "06eef362aa9f8c06ee309e1fb9b4ae847cc6ce7d"}, "author": "Thomas Franck", "url": "https://www.cnbc.com/2018/01/19/nomura-instinet-square-shares-to-rise-59-percent-this-year.html", "ord_in_thread": 0, "title": "Nomura Instinet: Square shares to rise 59 percent this year", "locations": [], "entities": {"persons": [{"name": "dan dolev", "sentiment": "none"}], "locations": [{"name": "dolev", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "square", "sentiment": "negative"}, {"name": "google", "sentiment": "negative"}, {"name": "nomura instinet", "sentiment": "negative"}, {"name": "paypal", "sentiment": "none"}, {"name": "square capital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Payment company Square is \"analogous to Amazon or Google in their early days\" but Wall Street is valuing the stock all wrong, according to Nomura Instinet\nThe firm reiterated its buy rating on the company's stock on Friday, calling big gains in 2018 as the company disrupts the payments industry.\nThe San Francisco-based company's climb to fame is a result of its financial transaction technology, enabling small businesses to accept card payments through its software and hardware products. It also developed Square Cash, a means of sending and receiving money between individuals and businesses akin to PayPal's Venmo.\n\"In 10 years, Square is likely to be a very different company helped by accelerating share gains from payment peers and relentless disruption of services like payroll and HR,\" analyst Dan Dolev wrote in a note to clients. Valuation should include \"mix shift to large sellers, accelerating share gains, growing penetration of higher priced transaction types like virtual terminal and e-commerce, as well as high margin services like Square Capital and payroll.\"\nIn all, added Dolev, a surge in gross payment volume — a key industry metric — should help ensure Square has another \"phenomenal year.\"\nThe analyst's $64 price target represents 59 percent upside from Thursday's close over the next year, the highest target on Wall Street according to FactSet data. Shares rallied 4.8 percent Friday morning.\nDolev believes his peers on Wall Street don't see this bright future for Square because they are using \"conventional valuation methodologies.\" The analyst is using a discounted cash flow model to come up with his target.\nSquare shares are up 173 percent over the past 12 months.\nThe company topped Wall Street expectations in its latest earnings report and CEO Jack Dorsey , who also leads social media site Twitter, told investors that Square's growth runway looks strong.\n\"As we continue to grow up-market, we've learned that more complex sellers often have established systems that they've tailored to their businesses, such as e-commerce websites, custom points of sale, or inventory software,\" he said during the earnings call. \"With our open platform, developers can connect these systems with Square and give sellers the ability to manage them in one place.\"\nDisclaimer", "external_links": [], "published": "2018-01-19T16:25:00.000+02:00", "crawled": "2018-01-19T15:34:46.020+02:00", "highlightTitle": ""}