{"organizations": [], "uuid": "c212f96f1ec4bd4826b465bda8bd79323646b57e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-edison-research-announces-major-expansion-promotions.html", "country": "US", "domain_rank": 767, "title": "Edison Research Announces Major Expansion, Promotions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-05T07:15:00.000+02:00", "replies_count": 0, "uuid": "c212f96f1ec4bd4826b465bda8bd79323646b57e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-edison-research-announces-major-expansion-promotions.html", "ord_in_thread": 0, "title": "Edison Research Announces Major Expansion, Promotions", "locations": [], "entities": {"persons": [{"name": "rob farbman", "sentiment": "none"}, {"name": "edison", "sentiment": "none"}, {"name": "melissa kiesc", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "somerville", "sentiment": "none"}, {"name": "somerville", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}], "organizations": [{"name": "edison research", "sentiment": "negative"}, {"name": "edison research announces major expansion", "sentiment": "negative"}, {"name": "nep", "sentiment": "none"}, {"name": "edison", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SOMERVILLE, N.J., Jan. 4, Edison Research, a Somerville, New Jersey-based market research agency, announces the purchase of additional office space to double its current square footage and the promotion of several key employees in advance of a significant expansion. The company is expanding its Somerville offices as it adds employees to support its growth in both election and audio research.\nEdison Research has been the sole provider of exit polling to the National Election Pool since 2003. In mid-2017, the company was also awarded the sole contract to provide vote count data to the NEP, and many of the company's new hires will be dedicated to that effort. In addition, Edison is expanding its digital audio portfolio, as the company has seen significant growth in research engagements in Podcasting, Streaming Audio, and the syndicated Share of Ear® research series, the only single-source measure of online and offline audio in the U.S.\nIn addition to these moves, Edison is also announcing the following promotions:\nRob Farbman - Executive Vice President Melissa Kiesche - Senior Vice President Tom Webster - Senior Vice President Nicole Beniamini - Vice President Randall Brown - Vice President Megan Lazovick - Vice President Mary Meyn - Vice President Johanna Roche - Vice President Laura Silvia - Vice President, Digital Operations and Information Technology\nIn addition, the company has hired Clint Stevenson as Vice President, Data Science.\nEdison's President, Larry Rosin, said of the recent expansion, \"We are honored by the immense trust placed upon us by our election, media, and consumer research clients over the past 24 years, and we are thrilled to be able to continue to grow and expand our capabilities. We know we have the right team in place to continue to achieve our objectives.\"\nAbout Edison Research:\nEdison Research conducts survey research and provides strategic information to a broad array of clients, including Activision, AMC Theatres, Disney, Dolby Laboratories, Google, NPR, Oracle, the U.S. International Broadcasting Bureau, Entercom, Pandora, Samsung, Siemens, Sony, St. Jude Children's Research Hospital, The Gates Foundation, Audible, and Univision. Edison is the leading podcast research company in the world, and has conducted research on the medium for NPR, CBS, PodcastOne, WNYC, and many more leading companies in the space. Another specialty for Edison is its work for media companies throughout the world, conducting research in North America, South America, Africa, Asia, Australia, and Europe. Edison Research is the sole provider of election exit poll data for the National Election Pool comprised of ABC, CBS, CNN, and NBC. Edison is also the leading provider of consumer exit polling and has conducted face-to-face research in almost every imaginable venue.\nContact:\nTom Webster, Senior Vice President\nEdison Research\ntwebster@edisonresearch.com\n(908) 707-4707\n releases/edison-research-announces-major-expansion-promotions-300578021.html\nSOURCE Edison Research", "external_links": ["http://www.prnewswire.com/news-releases/edison-research-announces-major-expansion-promotions-300578021.html", "http://www.edisonresearch.com/"], "published": "2018-01-05T07:15:00.000+02:00", "crawled": "2018-01-05T09:47:46.006+02:00", "highlightTitle": ""}