{"organizations": [], "uuid": "fc76e26a3ae8219dac2d159512d2a5c5d3a12755", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/03/08/103451555-RTS9BT1r.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/12/us-stocks-earnings-season-dow-jp-morgan.html", "country": "US", "domain_rank": 767, "title": "Dow jumps 150 points, hits record high as Wall Street bets on strong earnings season", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-12T17:31:00.000+02:00", "replies_count": 0, "uuid": "fc76e26a3ae8219dac2d159512d2a5c5d3a12755"}, "author": "Fred Imbert", "url": "https://www.cnbc.com/2018/01/12/us-stocks-earnings-season-dow-jp-morgan.html", "ord_in_thread": 0, "title": "Dow jumps 150 points, hits record high as Wall Street bets on strong earnings season", "locations": [], "entities": {"persons": [{"name": "brendan mcdermid", "sentiment": "none"}], "locations": [], "organizations": [{"name": "new york stock exchange", "sentiment": "none"}, {"name": "nasdaq", "sentiment": "none"}, {"name": "wells fargo", "sentiment": "none"}, {"name": "factset", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "reuters traders", "sentiment": "none"}, {"name": "j.p. morgan chase", "sentiment": "none"}, {"name": "blackrock", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Stocks rose to record highs on Friday after some of the major financial companies in the U.S. reported strong quarterly results.\nThe Dow Jones industrial average rose 197 points to an all-time high. J.P. Morgan Chase was among the best-performing stocks in the index, rising 1.1 percent.\nThe S&P 500 reached a record high, climbing 0.6 percent with industrials and consumer discretionary as the best-performing sectors.\nThe index was also enjoying its best 10-day start to a year since 2003. In that time period, the S&P 500 is up 4 percent. It gained 5.9 percent during the first 10 days of 2003.\n\"There is optimism in the market,\" but there is also uncertainty about this rally, said Cooper Abbott, chairman of Carillon Tower Advisers. That level of uncertainty can be good for the market because it \"dampens expectations.\"\nThe Nasdaq composite traded 0.6 percent higher and also hit an all-time high. Amazon shares rose 2.1 percent and broke above $1,300 for the first time.\nJ.P. Morgan Chase, BlackRock and Wells Fargo all reported better-than-expected quarterly results.\nBrendan McDermid | Reuters Traders work on the floor of the New York Stock Exchange. S&P 500 profits are expected to have risen 11.2 percent in the fourth quarter of last year . All 11 S&P 500 sectors, meanwhile, are expected to post increases in both earnings and revenue, according to FactSet. This would be the first time since 2011 that all the sectors in the S&P 500 posted sales and profit growth for the same quarter.\nStocks have carried over the momentum from 2017 into the new year thus far. The S&P 500 and Nasdaq have closed lower only once this year, while the Dow has fallen just twice. For 2018, the major averages were up at least 3.5 percent entering Friday's session.\nFor the week, they were on track to post gains of at least 1.2 percent. The Dow has outperformed the Nasdaq and S&P 500 this week, gaining 1.8 percent, as Boeing shares have soared 8.4 percent.\n\"The most important dynamic to focus on in the market is growth,\" said Sandip Bhagat, chief investment officer at Whittier Trust. He acknowledged that risks to the rally do exist, but added: \"They pale in comparison to the economic growth we're seeing.\"\nRecent data suggests the U.S. economy is picking up steam. The Labor Department said its Consumer Price Index excluding the volatile food and energy components rose 0.3 percent last month. That was the biggest advance in the so-called core CPI since January.\nTreasury yields ticked higher following the data release. The two-year yield broke above 2 percent for the first time since September 2008. It traded at 2.01 percent at 1:54 p.m. ET.\n—Reuters contributed to this report.", "external_links": [], "published": "2018-01-12T17:31:00.000+02:00", "crawled": "2018-01-12T17:30:49.005+02:00", "highlightTitle": ""}