{"organizations": [], "uuid": "889ecfde7be3157378d52ea8cf7918d0a92f5201", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-aeon-global-health-names-armando-moncada-md-fcap-as-chief-medical-officer-of-its-anatomic-pathology-business.html", "country": "US", "domain_rank": 767, "title": "Aeon Global Health Names Armando Moncada, MD, FCAP as Chief Medical Officer of its Anatomic Pathology Business", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.628, "site_type": "news", "published": "2018-01-10T18:29:00.000+02:00", "replies_count": 0, "uuid": "889ecfde7be3157378d52ea8cf7918d0a92f5201"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-aeon-global-health-names-armando-moncada-md-fcap-as-chief-medical-officer-of-its-anatomic-pathology-business.html", "ord_in_thread": 0, "title": "Aeon Global Health Names Armando Moncada, MD, FCAP as Chief Medical Officer of its Anatomic Pathology Business", "locations": [], "entities": {"persons": [{"name": "armando moncada", "sentiment": "negative"}, {"name": "moncada", "sentiment": "none"}, {"name": "sonny roshan", "sentiment": "none"}], "locations": [{"name": "gainesville", "sentiment": "none"}, {"name": "ga.", "sentiment": "none"}, {"name": "aeon", "sentiment": "none"}], "organizations": [{"name": "aeon global health", "sentiment": "negative"}, {"name": "fcap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GAINESVILLE, Ga., - Aeon Global Health (OTCQB: ADAT), a growth-oriented provider of personalized, clinically actionable medical informatics and telemedicine, announced today that Armando Moncada, MD, FCAP, has been appointed to the position of Chief Medical Officer of its Anatomic Pathology business line. Dr. Moncada has more than 20 years' experience in the pathology field, the last ten of which he served as Chief Medical Officer of PCG Molecular. He has expertise in the fields of gynecologic, breast, and head and neck pathology and cytopathology as well as in molecular pathology and oropharyngeal and cervical cancer genomics.\n\"It is with great pleasure that we welcome Dr. Moncada to our leadership team\" said Sonny Roshan, Chairman and CEO of Aeon Global Health. \"He has built an impressive reputation for his work in actionable molecular and genetic information related to an individual's risk for developing cancer. We are confident that this will serve Aeon well as we continue to build a world-class medical information company.\"\n\"Dr. Moncada will provide important guidance and advice as we expand into the anatomic pathology field. By adding targeted assays based on his expertise, we believe that Aeon can emerge with a menu that will augment our outcomes-based assays that are the hallmark of today's healthcare environment.\"\nDr. Moncada is a Board Certified pathologist by the American Board of Pathology and served as the Chief Medical Officer (CMO) of PCG Molecular, LLC. He trained in pathology while attending Tulane University School of Medicine in New Orleans, Louisiana followed by a fellowship in oncopathology at City of Hope Medical Center in Duarte, California. Upon completing his fellowship, Dr. Moncada served as medical director of large hospital systems in Texas and New Mexico. He was then given an appointment as Assistant Professor of Pathology at Baylor College of Medicine in Houston.\nDr. Moncada is a Fellow and/or active member of the following professional organizations: American Medical Association, College of American Pathologists, American Society for Clinical Pathology, American College of Physician Executives, and Association for Molecular Pathology.\nIn addition, Dr. Moncada is an experienced College of American Pathologists (\"CAP\") inspector who served as the State Commissioner for the College of American Pathologists in New Mexico where he was responsible for the laboratory accreditation program for both clinical and pathology medical laboratories. He continues to serve as a CAP inspector for the College of American Pathologists and understands the changing needs of the medical community and laboratory industry. Dr. Moncada also has a special interest in the laboratory industry and healthcare administration.\nIn addition, Aeon Global Health announced that it intends to acquire certain intellectual property assets from PCG Molecular, LLC, a genetics and molecular informatics company that has developed proprietary testing for screening for oropharyngeal carcinoma and related infectious diseases. Dr. Moncada is the controlling officer of PCG Molecular. Among the assays developed by PCG are MOP ® —a multiplex-based molecular assay for the identification of a number of extra-genital sexually transmitted diseases from samples taken in the oral cavity; Bella One Pap™, a comprehensive molecular cervical based test that identifies both cervical cancer risk as well as infectious agents from a single sample; and MAP™-Molecular Anal Pap, a genetic assay for the identification of anal cancer risk and related sexually transmitted diseases. Completion of this transaction is subject to the negotiation and execution of a definitive assignment agreement and customary conditions. Accordingly, there can be no assurance that a definitive agreement will be reached by the parties.\nAbout Authentidate Holding Corp.:\nAeon Global Health (Aeon), the operating arm of Authentidate Holding Corp., is an emerging leader in the provision of clinically actionable medical informatics. Founded in 2011, Aeon is focused on the delivery of services that exceed federal standards for quality and industry standards for turn-around time. Operating out of a 30,000 square foot facility built to FDA standards in suburban Atlanta, the Company provides a comprehensive menu of diagnostic and laboratory- developed tests as well as interpretative data for a wide range of inherited conditions.\nExcept for historical information, the matters discussed in this press release may be considered \"forward-looking\" statements within the meaning of Section 27A of the Securities Act of 1933, as amended and Section 21E of the Securities Exchange Act of 1934, as amended. When used in this release, words such as \"believe\", anticipate\" think\", \"intend\", \"plan\", \"will be\", \"expect\" or similar expressions identify such forward looking statements. In addition, such statements include declarations regarding the intent, belief or current expectations of Authentidate Holding Corp. and its management, including those related to cash flow, gross margins, revenues, and expenses which are dependent on a number of factors outside of the control of the Company including, for example, the markets for the Company's services, costs of and services, other expenses, government regulations, litigation, and general business conditions. Investors are cautioned that any such forward-looking statements are not guarantees of future performance and involve a number of risks and uncertainties that could materially affect actual results. The Company disclaims any obligations to update any forward-looking statement as a result of developments occurring after the date of this press release.\nView original content: http://www.prnewswire.com/news-releases/aeon-global-health-names-armando-moncada-md-fcap-as-chief-medical-officer-of-its-anatomic-pathology-business-300580765.html\nSOURCE Aeon Global Health", "external_links": ["http://www.prnewswire.com/news-releases/aeon-global-health-names-armando-moncada-md-fcap-as-chief-medical-officer-of-its-anatomic-pathology-business-300580765.html"], "published": "2018-01-10T18:29:00.000+02:00", "crawled": "2018-01-10T20:19:34.002+02:00", "highlightTitle": ""}