{"organizations": [], "uuid": "33b395154ddc754e3174c5176310ae6e4814567b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-sonic-foundry-announces-fourth-quarter-and-fiscal-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "Sonic Foundry Announces Fourth Quarter and Fiscal 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T00:05:00.000+02:00", "replies_count": 0, "uuid": "33b395154ddc754e3174c5176310ae6e4814567b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-sonic-foundry-announces-fourth-quarter-and-fiscal-2017-financial-results.html", "ord_in_thread": 0, "title": "Sonic Foundry Announces Fourth Quarter and Fiscal 2017 Financial Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MADISON, Wis., Jan. 12, 2018 (GLOBE NEWSWIRE) -- Sonic Foundry, Inc. (NASDAQ:SOFO), the trusted leader for video creation and management solutions, today announced consolidated financial results for its fiscal 2017 fourth quarter and fiscal year ended September 30, 2017.\nFiscal 2017 Fourth Quarter Highlights\nTotal revenues of $8.3 million down from $9.5 million in the fourth quarter of 2016\nGross margin of $6.1 million, or 74% of sales, down from $7.1 million, or 75% of sales in the fourth quarter of 2016\nAdjusted EBITDA of $(836,000), including a $600,000 non-cash impairment charge to goodwill reflected in operating expenses, compared to $4,000 in the fourth quarter of 2016\nNet loss of $(1.6) million, or $(0.37) per share compared to a net loss of $(847,000) or $(0.19) per share in the fourth quarter of 2016.\nBillings totaled $9.4 million in the fourth quarter of 2017, a decline of 3% compared to the same period last year\nUnearned revenue increased to $14.3 million as of September 30, 2017, an increase of $211,000 from the beginning of the year\nFiscal 2017 Fourth Quarter Review\nSupport Billings saw an increase of 19% to $2.6 million in the fourth quarter of 2017 compared to the same period in 2016, reflecting excellent customer retention and increasing recurring revenues. Likewise, events billings increased by 14% while product billings decreased by 19%. Most of the decrease in product billings was negatively impacted by customers using a mix of lower-priced recorders, and a delay in orders by certain customers during the quarter. The company expects to recognize $4.6 million of unearned revenue in the first quarter of fiscal 2018.\nRecurring revenue was 65% of total revenue in the fourth quarter of 2017, up from 60% in 2016, and hosting revenue was up 8% compared to the fourth quarter in 2016. These increases are driven by the strong demand for our cloud offering and annual software licenses, strength in support services, and continued customer repurchases and renewals.\nDespite a decrease in revenue of $1.2 million in the fourth quarter compared to 2016, net loss only increased by $138,000, without including the one-time charge to goodwill*. This in large part was due to efforts made by the company to reduce operating expenses, including certain headcount reductions made in the third quarter, which were $6.9 million, again excluding the non-cash goodwill charge, down $671,000 or 9% from the same period in 2016.\n“Our team has done great work in developing world-class video capture, delivery and management solutions and we are adjusting our tactics and improving our efficiency so that we can better address a market which is growing slower than we would have anticipated two years ago. The impact of customers increasingly choosing our lower cost recorders and delaying expansion of their Mediasite footprint was a 2017 phenomenon, and we are now seeing positive early interest in just-released software solutions and entry-level capture devices. We strengthened our recurring revenue position, seeing growth in product support, software licensing and cloud rising to 65% of total revenue. We are focused on protecting and increasing the established value of our high-end video solutions while enabling customers to right-size capture deployments to meet their needs,” said Gary Weis, CEO of Sonic Foundry.\n“We expect to substantially reduce the loss in 2018 by continuing to deliver operational cost-savings, and driving efficiencies in the business. We believe the operational adjustments we made in 2017, along with introducing new innovations to the market, will put us in the best position to support our strategy going forward, improve company efficiency, maintain high customer satisfaction and, deliver consistent top line billings in the coming year,” concluded Mr. Weis.\nInitial results for our first quarter of 2018 are indicating an improvement in billings over the prior year’s first quarter in total of 4% to $7.6 million, reflecting increased demand from domestic higher education, Japan and EMEA. It also demonstrates success from our lower price point recorders with shipments of 261 RL 220 and Mini recorders compared to 103 in the prior period. We also anticipate a substantial reduction in net loss from the $1.5 million recorded in the prior year’s first fiscal quarter.\n*As previously disclosed, the company’s year-end audit required an extended testing and evaluation of good will and intangible assets on the balance sheet that delayed our filing. With the audit now concluded, the company is satisfactorily submitting its filing with the SEC simultaneously with this presentation, and recognized a non-cash charge of $600,000 in the fourth quarter to reflect a goodwill impairment related to the purchase of Mediasite KK. The remaining balance of goodwill on the balance sheet is $10.5 million.\nNon-GAAP Financial Information\nTo supplement and enhance the reader’s understanding of our operating performance and our ability to satisfy lender requirements, we disclose adjusted Earnings Before Interest, Taxes, Depreciation, and Amortization (adjusted EBITDA), a non-GAAP measure of operating performance. Our adjusted EBITDA measure additionally adds back stock compensation expense from the SEC definition of EBITDA. As such, our adjusted EBITDA may not be comparable to similarly titled measures reported by other companies, and should not be viewed as an alternative to net income as a measurement of our operating performance. Our credit agreement contains a minimum EBITDA calculation based, in part, on adjusted EBITDA since this measure is representative of adjusted income available for debt and interest payments. A reconciliation of net loss to adjusted EBITDA for the quarters and years ended September 30, 2017 and 2016 are included in the release. The company is unable to provide a reconciliation of projected EBITDA to projected net income due to the unknown effect, timing and potential significance of certain income statement items.\nWebcast\nThe company will hold its corporate webcast for analysts and investors at 4:30 p.m. ET today, January 12. Sonic Foundry will use its webcasting technology, Mediasite, to stream the presentation for live and on-demand viewing. To access the webcast register at www.sonicfoundry.com/earnings on or before January 12, 2018. A video archive of the full earnings call, including Q&A, will be available for 90 days.\nAbout Sonic Foundry®, Inc.\nSonic Foundry (NASDAQ:SOFO) is the global leader for video capture, management and streaming solutions. Trusted by more than 4,700 educational institutions, corporations, health organizations and government entities in over 65 countries, its Mediasite Video Platform quickly and cost-effectively automates the capture, management, delivery and search of live and on-demand streaming videos. Leading research firms Aragon, Forrester, Wainhouse and Frost & Sullivan recognize Sonic Foundry as a leader in enterprise video, webcasting and lecture capture. Learn more at www.sonicfoundry.com and @mediasite.\n© 2018 Sonic Foundry, Inc. Product and service names mentioned herein are the trademarks of Sonic Foundry, Inc. or their respective owners.\nForward Looking Sta", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/6e4ddb3b-0938-48f5-8c53-1624c0f47499", "https://www.globenewswire.com/Tracker?data=uWua5jS7MAH6ENICrfFtZhAuXPI3WJkaBlX3AwA9OC6mXApvqWhUl-fCDiCWaLHclEmp3Y8kYI-BFJs3-StlKQ==", "https://www.globenewswire.com/Tracker?data=qvZfLoUQU03K7J0-PC76neObowxwGY6UkZkF6NP-vDJ1sGy1W_uNPazycBR9X9qAWQbO0mTBOUopVN7QL9JcC2BlbtzZtdEjM5tOMX1IGFw=", "https://www.globenewswire.com/Tracker?data=-_avG8LYeLBPtZPob6t1W3tA2WOwymZuPvSnAbNvyP0CMOsurp4laLBKO4q-m8lUp5r6Fn_Ebnqd5idyuoWjXrZOVkUUVFao3OhYfIyevb4=", "https://www.globenewswire.com/Tracker?data=DdNuvtqNVimlxxoUo9iAsaw31JzpyztG_KIhnDnTQYdb5pgc8dzC40VTmNx0CAm-fe_p2qhx5P-IB5puygK-5R-DPjASASJdCj0-BCG6ER2zP8SSWT0tFRP9aoLyD-Cb", "https://www.globenewswire.com/Tracker?data=KiWqd1_ClAYCSEu-DFob2qpDVkj9gGl6eO9SuPuGiMChTlxlA305F8X42s3Y_POAhmH4Sch3B8_DOKN_ZxY8sQ=="], "published": "2018-01-13T00:05:00.000+02:00", "crawled": "2018-01-13T02:07:34.018+02:00", "highlightTitle": ""}