{"organizations": [], "uuid": "5654befafd99b1bee3e908663a6fa3feda845b70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-iia-welcomes-kim-keenan-to-leadership-team.html", "country": "US", "domain_rank": 767, "title": "IIA Welcomes Kim Keenan to Leadership Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T17:00:00.000+02:00", "replies_count": 0, "uuid": "5654befafd99b1bee3e908663a6fa3feda845b70"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-iia-welcomes-kim-keenan-to-leadership-team.html", "ord_in_thread": 0, "title": "IIA Welcomes Kim Keenan to Leadership Team", "locations": [], "entities": {"persons": [{"name": "kim keenan", "sentiment": "negative"}, {"name": "rick boucher", "sentiment": "none"}, {"name": "keenan", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "boucher", "sentiment": "none"}, {"name": "bruce mehlman", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "marketi", "sentiment": "none"}], "organizations": [{"name": "multicultural media, telecom & internet council", "sentiment": "none"}, {"name": "odyssey media", "sentiment": "none"}, {"name": "house energy and commerce committee's subcommittee on communications", "sentiment": "none"}, {"name": "mmtc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, D.C. , Jan. 16, 2018 (GLOBE NEWSWIRE) -- The Internet Innovation Alliance (IIA) today named Kim Keenan Co-Chairwoman of the coalition. Well-versed in telecom law and a strong supporter of net equality, Keenan joins Honorary Chairman Rick Boucher and IIA Founding Co-Chairman Bruce Mehlman to further the organization’s mission of expanding broadband availability and access for all Americans.\n“Kim is a respected advocate for unserved and underserved communities and brings a deep understanding of the broadband policy issues that are shaping the future of the tech and telecom landscape,” commented Boucher, a 28-year Congressman who chaired the House Energy and Commerce Committee's Subcommittee on Communications and the Internet. “I look forward to working alongside Kim to advance internet openness, consumer privacy, diversity and other leading policy goals.”\nKeenan capably led the Multicultural Media, Telecom & Internet Council (MMTC) as President and CEO from 2014 through 2017. At the beginning of this year, she joined Odyssey Media as the Executive Vice President for Marketing and Research. At MMTC, Keenan created the Capital Pitch Competition to provide seed money to multicultural entrepreneurs in technology and the College Tech Prep Summit, which provides college students with career preparation for digital and technical careers, as well as industry internships. She also launched a “Net Equality Tour” to educate the public on telecommunications issues impacting daily life and was instrumental in building a partnership with the National Urban League and the Wireless Infrastructure Association to develop a telecommunications apprenticeship program for the Department of Labor.\nPrior to her role with MMTC, Keenan was the longest serving female General Counsel of the NAACP, in addition to holding the position of Secretary. She also previously served as principal of her own law firm and in the litigation practices of two top law firms. Keenan is a nationally recognized speaker, a Senior Adjunct Professor at the George Washington University Law School, and the recipient of awards including the Media Executive of the Year from Vote It Loud, the NAACP Medgar Evers Award for Excellence, the Charging Buffalo Award from the New York Society, and the Distinguished Civil Rights Advocate Award from the Lawyers Committee for Civil Rights Under Law.\n“IIA is fortunate to have such an esteemed and experienced leader like Kim join our team,” shared Mehlman. “She will no doubt be a valuable partner in the mission to advance smart internet policies that protect consumers and help close the digital divide, while encouraging investment and innovation.”\nAfter more than six years, Jamal Simmons stepped down from his role as IIA Co-Chairman at the end of 2017 to pursue a new digital media opportunity.\nTo learn more about IIA’s policy goals and read Kim Keenan’s full bio, visit www.internetinnovation.org .\nAbout The Internet Innovation Alliance\nThe Internet Innovation Alliance was founded in 2004 and is a broad-based coalition supporting broadband availability and access for all Americans, including underserved and rural communities. It aims to ensure every American, regardless of race, income or geography, has access to this critical tool. The IIA seeks to promote public policies that leverage the power of entrepreneurs and the market to achieve universal broadband availability and adoption.\nFor more information contact: Lauren DuBois (917) 573-2485 lauren@internetinnovation.org\nSource:Internet Innovation Alliance", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/e53f8d38-849a-4cf9-bd01-69db9549299a", "https://www.globenewswire.com/Tracker?data=aKRp4zSl6F74pHZK8Aesf4TpigeoKPRaiNCQeMo6w-KV33RXdee7mq89ukOdF36zQn5O_qU2k2bhBajd-PuL3Ur3nzkZiXJiHctvucvk02VS8YjCdOUPjNxnpNnCDQIJ"], "published": "2018-01-16T17:00:00.000+02:00", "crawled": "2018-01-16T18:23:02.002+02:00", "highlightTitle": ""}