{"organizations": [], "uuid": "2b1d7b9075d58f1d33e503b16a0a9b275c6f6354", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/08/the-associated-press-on-health-care-democrats-are-shifting-to-offense.html", "country": "US", "domain_rank": 767, "title": "On health care, Democrats are shifting to offense", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T08:29:00.000+02:00", "replies_count": 0, "uuid": "2b1d7b9075d58f1d33e503b16a0a9b275c6f6354"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/08/the-associated-press-on-health-care-democrats-are-shifting-to-offense.html", "ord_in_thread": 0, "title": "On health care, Democrats are shifting to offense", "locations": [], "entities": {"persons": [{"name": "tim kaine", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "d-va.", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "medicare", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — Democrats are shifting to offense on health care, emboldened by successes in defending the Affordable Care Act. They say their ultimate goal is a government guarantee of affordable coverage for all.\nWith Republicans unable to agree on a vision for health care, Democrats are debating ideas that range from single-payer, government-run care for all, to new insurance options anchored in popular programs like Medicare or Medicaid. There's also widespread support for authorizing Medicare to negotiate prescription drug prices, an idea once advocated by candidate Donald Trump, which has languished since he was elected president.\nDemocrats are hoping to winnow down the options during the 2018 campaign season, providing clarity for their 2020 presidential candidate. In polls, health care remains a top priority for the public, particularly for Democrats and independents.\n\"We're tired of just playing defense,\" said Sen. Tim Kaine, D-Va., the party's 2016 vice presidential candidate. \"It is now time to talk about the next big idea. It is a good time for everybody to put their big ideas on the table.\" His offering: \"Medicare-X,\" a public insurance plan to be initially deployed in communities that lack private insurer competition.\nRising Democratic ambitions come as a cloud of uncertainty lingers over former President Barack Obama's health law. While major provisions have survived the GOP onslaught, some Republicans are vowing to go for repeal again. Congress has ended the health law's requirement that most people get coverage, and that's expected to lead to higher premiums in 2019. But bipartisan legislation to stabilize insurance markets doesn't seem to be getting traction.\nObama's former health secretary, Kathleen Sebelius, says she sees Democrats reclaiming a core belief that health care should be a right guaranteed under law.\n\"Coverage for all is as much of an organizing principle for Democrats as eliminating Obamacare is for Republicans,\" said Sebelius. \"But it turned out that (Republicans) didn't have any idea what that meant. I think Democrats have a much clearer vision.\"\nTime will tell. Here's a sample of ideas under debate by Democrats and others on the political left:\n—Medicare for All: Vermont Sen. Bernie Sanders made single-payer, government-run health care the cornerstone of his campaign for the 2016 Democratic presidential nomination. It remains the most talked-about health care idea on the left. Financing would be funneled through the tax system. Individuals wouldn't have to worry about deductibles, copays or narrow provider networks. Although state-level attempts to enact single-payer care have foundered because of the large tax increases needed, about one-third of Sanders' Democratic colleagues in the Senate are co-sponsoring his latest bill.\n—Medicare-X: The legislation from Sens. Kaine, and Michael Bennet, D-Col., would allow individuals in communities lacking insurer competition to buy into a new public plan built on Medicare's provider network and reimbursement rates. Medicare would be empowered to negotiate prescription drug prices. Medicare-X would be available as an option through HealthCare.gov and state health insurance markets. Enrollees could receive financial assistance for premiums and copays through the Obama health law. Eventually, Medicare-X would be offered everywhere for individuals and small businesses.\n—Medicare Part E: Yale University political scientist Jacob Hacker has proposed a new public health insurance plan based on Medicare, for people who don't have access to job-based coverage meeting certain standards. It would be financed partly with taxes on companies that don't provide insurance. Consumers would pay income-based premiums. Hospitals and doctors would be reimbursed based on Medicare rates, generally lower than what private insurance pays. \"The crucial part of this is that you have guaranteed health insurance, just like you have guaranteed Medicare or Social Security,\" said Hacker. He's working with Democrats in Congress to turn the concept into legislation.\n—Medicaid Buy-In: Sen. Brian Schatz, D-Hawaii, and Rep. Ben Ray Lujan, D-N.M., have introduced legislation that would allow states to open their Medicaid programs up to people willing to pay premiums. Although Medicaid started out as insurance for the poor, it has grown to cover about 75 million people, making it the largest government health program. Most beneficiaries are now enrolled in private insurance plans designed for the Medicaid market.\nExpect more ideas as the year unfolds, said Neera Tanden, president of the Center for American Progress and a former top aide to Obama as well as Hillary Clinton. \"Democrats are much more comfortable with an expansionist view,\" said Tanden. \"Almost every Democrat is talking about truly universal health care.\"\nSome Republicans are taking note. In a recent floor speech, Sen. John Barrasso, R-Wyo., said \"it's interesting listening to Democrats, because they think they have good ideas and they're just proven wrong by the facts.\"\nBarrasso aimed his criticism at Sanders' single-payer plan. \"Democrats who are pushing for a Washington takeover of America's health care are still not coming clean about the rationing of care that it would cause,\" he said.\nBut in Sanders' home state of Vermont, primary care physician Dr. Deborah Richter says she believes it's only a matter of time before the Unites States adopts single-payer. Activists who failed in an earlier attempt in the state are now focused on passing a plan that would cover just primary care.\n\"I think the next election will be a move to the left,\" said Richter. \"Whether Democrats will be willing to go for the whole system is pretty doubtful. I feel it might be possible for us to do it in phases.\"", "external_links": [], "published": "2018-01-08T08:29:00.000+02:00", "crawled": "2018-01-08T11:36:21.032+02:00", "highlightTitle": ""}