{"organizations": [], "uuid": "14fc934d2e713641797eb14c67ea981dfa40cf5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-harte-hanks-announces-executive-changes.html", "country": "US", "domain_rank": 767, "title": "Harte Hanks Announces Executive Changes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T00:30:00.000+02:00", "replies_count": 0, "uuid": "14fc934d2e713641797eb14c67ea981dfa40cf5d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-harte-hanks-announces-executive-changes.html", "ord_in_thread": 0, "title": "Harte Hanks Announces Executive Changes", "locations": [], "entities": {"persons": [{"name": "harte hanks", "sentiment": "negative"}, {"name": "karen puckett", "sentiment": "none"}, {"name": "shirish", "sentiment": "none"}, {"name": "shirish lal", "sentiment": "none"}], "locations": [{"name": "san antonio", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN ANTONIO, Jan. 18, 2018 (GLOBE NEWSWIRE) -- Harte Hanks (NYSE:HHS), a leader in developing customer relationships, experiences and interaction-led marketing, today announced changes to its executive team. Shirish Lal, the company’s Executive Vice President, Chief Operating Officer and Chief Technology Officer informed the company of his decision to pursue another opportunity. As a result, Harte Hanks will be streamlining its executive team as part of 2018 strategic and operational plan to better align the company in serving existing customers and meeting new market and growth opportunities.\nKaren Puckett, Harte Hanks’ CEO, commented, “I’d like to thank Shirish for all his efforts at Harte Hanks. During his tenure, he has been involved with implementing technology and marketing partnerships, product development, improving customer satisfaction, and cost cutting. Thanks to the operational and product foundation he helped lay, we now have executable plans that will support our success in 2018 and beyond. The time is right to streamline our executive team, and we will divide Shirish’s responsibilities among our CMO, Frank Grillo, our CFO, Jon Biro, and me.”\nShirish Lal commented, “Since 2016, we have seen a significant improvement in customer satisfaction, launched industry leading database and data products, and established partnerships that have repositioned Harte Hanks. I believe Harte Hanks has the foundation to be a leader in assisting companies with digital transformation of their marketing capabilities. The timing was right for me to pursue another opportunity that has long been a passion.”\nAbout Harte Hanks:\nHarte Hanks is a global marketing services firm specializing in multi-channel marketing solutions that connect our clients with their customers in powerful ways. Experts in defining, executing and optimizing the customer journey, Harte Hanks offers end-to-end marketing services including consulting, strategic assessment, data, analytics, digital, social, mobile, print, direct mail and contact center. From visionary thinking to tactical execution, Harte Hanks delivers smarter customer interactions for some of the world's leading brands. Harte Hanks’ 5,000+ employees are located in North America, Asia-Pacific and Europe. For more information, visit Harte Hanks at www.hartehanks.com , call 800-456-9748, email us at pr@hartehanks.com . Follow us on Twitter @hartehanks or Facebook at https://www.facebook.com/HarteHanks .\nAs used herein, “Harte Hanks” refers to Harte Hanks, Inc. and/or its applicable operating subsidiaries, as the context may require. Harte Hanks’ logo and name are trademarks of Harte Hanks.\nContact:\nScott Hamilton\nPublic & Investor Relations\n(303) 214-5563\nscott.hamilton@hartehanks.com\nSource:Harte Hanks, Inc.", "external_links": ["https://www.facebook.com/HarteHanks", "https://www.globenewswire.com/NewsRoom/AttachmentNg/9d982e29-a34d-4174-b45e-ada5954975d2"], "published": "2018-01-19T00:30:00.000+02:00", "crawled": "2018-01-19T00:21:31.001+02:00", "highlightTitle": ""}