{"organizations": [], "uuid": "a511cfc1e31da5737ae25ef8a1a66abf67033bfa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-franklin-financial-network-announces-financial-results-for-the-fourth-quarter-of-2017.html", "country": "US", "domain_rank": 767, "title": "Franklin Financial Network Announces Financial Results For The Fourth Quarter Of 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:15:00.000+02:00", "replies_count": 0, "uuid": "a511cfc1e31da5737ae25ef8a1a66abf67033bfa"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-franklin-financial-network-announces-financial-results-for-the-fourth-quarter-of-2017.html", "ord_in_thread": 0, "title": "Franklin Financial Network Announces Financial Results For The Fourth Quarter Of 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "tenn.", "sentiment": "none"}, {"name": "franklin", "sentiment": "none"}], "organizations": [{"name": "fsb", "sentiment": "negative"}, {"name": "franklin financial network", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "franklin financial network, inc.", "sentiment": "neutral"}, {"name": "franklin synergy bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKLIN, Tenn., Jan. 24, 2018 /PRNewswire/ -- Franklin Financial Network, Inc. (NYSE: FSB), the parent company (the \"Company\") of Franklin Synergy Bank (the \"Bank\"), today announced financial results for the fourth quarter and year ended December 31, 2017. For the fourth quarter, net income available for common shareholders was $2.4 million, or $0.17 per diluted share, compared with $7.2 million, or $0.58 per diluted share, for the fourth quarter of 2016. As previously reported, results for the fourth quarter of 2017 included a non-cash income tax charge of $5.3 million, or $0.38 per diluted share, related to a write-down of its deferred tax asset (the \"DTA write-down\"). This non-recurring charge was a result of the reduction in the federal income tax rate to 21% from 35% under the Tax Cut and Jobs Act (the \"Act\"), enacted December 22, 2017, and is subject to change pending further review. The Act will, in turn, benefit net income beginning in the first quarter of 2018. Weighted average diluted shares outstanding increased 10.4% for the fourth quarter of 2017 compared with the fourth quarter of 2016, primarily due to the Company's $72 million public offering of common stock in November 2016.\nHighlights for the fourth quarter of 2017 include:\nReturn on average assets was 0.26%, including the 58 basis-point impact of the DTA write-down, compared with 1.00% for the fourth quarter of 2016 and 1.03% for the third quarter of 2017. Return on average tangible common equity was 3.22% for the fourth quarter of 2017, including the 7.17 percentage-point impact of the DTA write-down, compared with12.68% for the fourth quarter of 2016 and 12.26% for the third quarter of 2017. Total loans, including loans held for sale, increased 26.2%, or $471.3 million, to $2.27 billion at the quarter's end from $1.80 billion at December 31, 2016, and 6.6% from $2.13 billion at the end of the third quarter of 2017. Total deposits increased 32.4%, or $775.4 million to $3.17 billion from $2.39 billion at December 31, 2016, and 12.1% from $2.82 billion at the end of the third quarter of 2017. Credit quality remained strong, with nonperforming loans improving to 0.13% of total loans, excluding loans held for sale; the allowance for loan losses steady at 0.94% of total loans, excluding loans held for sale; and negligible net recoveries. Tangible book value per share increased 11.7% to $22.24 from $19.91 at December 31, 2016, and increased 0.2% from $22.20 at September 30, 2017. See non-GAAP reconciliation on the last page of this release. The Company's application for the approval of the previously announced merger with Civic Bank & Trust was approved by the Federal Reserve Bank of Atlanta (\"Fed\") and the Tennessee Department of Financial Institutions (\"TDFI\"). The Company's application to open a new branch office in Murfreesboro, Tennessee, was approved by the Fed and the TDFI, and the office opened in November as the Company's sixth location in Rutherford County.\n\"For the fourth quarter of 2017, we were pleased with the continuing strength of our credit quality and significant loan growth, which were consistent with our expectations on a comparable and sequential-quarter basis,\" commented Richard Herrington, the Company's Chairman and Chief Executive Officer. \"However, our measures of profitability were negatively affected for the quarter, primarily by two factors. First, the non-cash DTA write-down had a substantial impact on our fourth-quarter earnings and return statistics, but these measures will benefit from lower effective income tax rates going forward. Second, net interest margin declined, reflecting three primary drivers that converged over the course of 2017 and particularly in the fourth quarter, including (1) the lower growth of low-cost deposit funding sources compared to loans; (2) a significant flattening of the yield curve, causing funding costs to increase more quickly than asset yields; and (3) our decision to shorten the duration of the investment portfolio in response to the yield curve changes and to positively affect balance sheet liquidity factors.\n\"As we move into our second decade as a bank during 2018 and 2019, we are committed to return to our long-established record of profitable growth by addressing the significant changes in market forces and by leveraging the significant investments we have made in people, systems, and technology infrastructure. Ongoing initiatives to increase lower-cost core deposits throughout our branch office network were given a boost when we opened a new highly visible flagship office during the fourth quarter in Murfreesboro in Rutherford County, one of the fastest growing counties in the country. In addition, the December 2017 regulatory approval to complete the acquisition of Civic Bank & Trust (expected to close in late first or early second quarter of 2018) provides us the ability to better serve our customers in Nashville with a local branch office in a premier location. We also believe we are now well positioned to pursue additional merger transactions, with a primary focus on banks with complementary balance sheets.\"\nHerrington added, \"We celebrated the Company's 10 th anniversary in business in November 2017. During the past decade, we have produced a remarkable record of profitable growth, asset quality and increased shareholder value through outstanding execution of a proven business model by a highly experienced team of senior managers and local bankers. With this perspective, we are confident that we will successfully address our long-term funding costs and continue to deliver on our three long-term strategic goals of soundness, growth and profitability.\"\nStrong Asset Quality\nNonperforming loans improved to 0.13% of total loans, excluding loans held for sale, at December 31, 2017 compared with 0.35% and 0.14% at December 31, 2016, and September 30, 2017. The allowance for loan losses at December 31, 2017, was 0.94% of total loans, excluding loans held for sale, compared with 0.93% and 0.94% at December 31, 2016, and September 30, 2017. There were net charge-offs of 0.00% of average loans for the fourth quarter of 2017 compared with 0.04% for the fourth quarter of 2016 and net recoveries of 0.13% of average loans for the third quarter of 2017.\nAttractive, Growing, Local Markets Support Expansion of Balance Sheet\nTotal assets increased 30.6% to $3.84 billion at December 31, 2017, from $2.94 billion at December 31, 2016, and 7.8% from $3.57 billion at September 30, 2017. Total loans, including loans held for sale, increased 26.2%, or $471.3 million, to $2.27 billion at December 31, 2017, from $1.80 billion at December 31, 2016. Business loans increased 35.4%, or $125.5 million, compared with the fourth quarter of 2016, including growth of 62.1%, or $96.2 million, in healthcare loans. In addition, loan growth included increases of $160.3 million in 1-4 family real estate loans, $181.1 million in commercial real estate loans and $5.3 million in construction loans. The mix of total loans, excluding loans held for sale, at the end of the fourth quarter of 2017 changed slightly in comparison with the mix at the end of the prior quarter, with total real estate lending at 77.5% and business loans at 22.3% of total loans, compared with prior-quarter total real estate lending at 77.8% and business loans at 22.0%. Deposits were $3.17 billion at December 31, 2017, an increase of 32.4% from $2.39 billion at December 31, 2016, and 12.1% from $2.82 billion at September 30, 2017. Non-interest bearing deposits increased 16.4% and 5.8% compared with the fourth quarter of 2016 and third quarter of 2017, and interest bearing deposits increased 34.2% and 12.8%, respectively.\nStrong Growth in the Loan Portfolio Partially Offset by Increased Funding Costs\nNet interest income for the fourth quarter of 2017 increased 13.4% to $24.6 million from $21.7 million for the fourth quarter of 2016 and increased 1.2% from $24.3 million for the third quarter of 2017. The growth in net interest income on a comparable-quarter basis primarily resulted from 26.8% growth in average interest earning assets and a slight increase in average yield that produced a 28.5%, or $7.8 million increase in interest income. In addition, interest expense increased 86.5%, or $4.9 million, due to a 28.7% increase in average interest bearing liabilities from a changing mix of funding sources and a 44.2% increase in average rate paid. The 1.2% increase in net interest income on a sequential-quarter basis reflected 5.3% growth in average interest earning assets and a slight decline in average yield that produced a 4.0% increase in interest income, as well as a 6.7% increase in interest bearing liabilities and a slight increase in average rate paid that produced an 11.2% increase in interest expense. The average yield on total interest earning assets was 4.11% for the fourth quarter of 2017, an increase of three basis points from 4.08% for the fourth quarter of 2016, driven by changes in the mix of loans and competitive pressures. Average yield decreased six basis points from 4.17% for the third quarter of 2017. The average rate on total interest bearing liabilities was 1.37% for the fourth quarter of 2017, up 42 basis points from 0.95% for the fourth quarter of 2016. On a sequential-quarter basis, the increase was six basis points. These increases were driven primarily by the rise in interest rates and flattening yield curve, as well as changes in the mix of deposits. Net interest margin, adjusted for tax equivalent yield, was 2.92% for the fourth quarter of 2017, compared with 3.27% for the fourth quarter of 2016 and 3.05% for the third quarter of 2017. Noninterest income increased 27.8% for the fourth quarter of 2017 to $3.3 million from $2.6 million for the fourth quarter of 2016 and declined 8.5% from $3.6 million for the third quarter of 2017. The comparable-quarter increase was primarily driven by net gains on sales of loans and increased wealth management fees, partially offset by a decline in gain on sale of securities. The sequential-quarter decline primarily reflected a decrease in net gains on sale of loans, partially offset by an increase in gain on sale of securities and wealth management fees. The increase or decrease in net gains on sales of loans are primarily related to an increase or decrease in the value of held-for-sale mortgages due to market conditions. For the fourth quarter of 2017, noninterest expense increased 20.8% to $16.0 million from $13.2 million for the fourth quarter of 2016, primarily due to a 14.7% increase in salaries and employee benefits and a 22.6% increase in occupancy and equipment, both related to the Company's ongoing investment in people, systems and infrastructure to support growth. The Company's FDIC assessment expense increased 47.8% due to growth in total assets. Sequentially, noninterest expense increased 4.6% for the fourth quarter of 2017 compared with the third quarter. The Company's efficiency ratio was 57.36% for the fourth quarter of 2017, compared with 54.55% for the fourth quarter of 2016 and 54.77% for the third quarter of 2017. The Company's effective income tax rate was 77.3% for the fourth quarter of 2017, 50.3 percentage points of which were related to the DTA write-off, compared with 27.3% for the fourth quarter of 2016 and 26.1% for the third quarter of 2017. Due to the recently passed tax reform, the Company expects its effective income tax rate for 2018 to improve substantially.\nWebcast and Conference Call Information\nThe Company will host a webcast and conference call at 8:00 a.m. (CT) on Thursday, January 25, 2018, to discuss operating and financial results for the fourth quarter of 2017. To access the call for audio only, please call 1-844-378-6480. For the presentation materials and streaming audio, please access the webcast on the Investor Relations page of Franklin Synergy Bank's website at www.FranklinSynergyBank.com . For those unable to participate in the webcast, it will be archived for one year, with audio available for 90 days.\nSafe Harbor for Forward-Looking Statements\nThis media release contains forward-looking statements. Such statements include, but are not limited to, expected operating results, including market share and shareholder value, strategy for growth and profitability, projected sales, gross margin and net income figures, the availability of capital resources, and plans concerning products and market acceptance. Words such as \"expects,\" \"anticipates,\" \"intends,\" \"plans,\" \"believes,\" \"seeks,\" \"estimates,\" \"strategies\" and variations of such words and similar expressions are intended to identify such forward-looking statements. Forward-looking statements are inherently subject to risks and uncertainties, many of which cannot be predicted with accuracy and some of which might not even be anticipated. Risks and uncertainties that could cause the corporation's actual results to materially differ from those described in forward-looking statements include those discussed in Item 1A of the corporation's Annual Report on Form 10-K for the year ended December 31, 2016 filed with the Securities and Exchange Commission on March 16, 2017. Future events and actual results, financial and otherwise, could differ materially from those set forth in or contemplated by the forward-looking statements herein. Future operating results of the corporation are impossible to predict, and no representation or warranty of any kind can be made respecting the present or future accuracy of such forward-looking statements or the ability of the corporation to meet its obligations, and no such representation or warranty is to be inferred.\nAbout the Company\nFranklin Financial Network, Inc. is a financial holding company headquartered in Franklin, Tennessee. The Company's wholly-owned bank subsidiary, Franklin Synergy Bank, a Tennessee-chartered commercial bank founded in November 2007 and a member of the Federal Reserve System, provides a full range of banking and related financial services with a focus on service to small businesses, corporate entities, local governments and individuals. With consolidated total assets of $3.84 billion at December 31, 2017, the Bank currently operates through 13 branches and one loan production office in the growing Williamson, Rutherford and Davidson Counties, all within the Nashville metropolitan statistical area. Additional information about the Company, which is included in the NYSE Financial-100 Index, and the FTSE Russell 2000 Index, is available at www.FranklinSynergyBank.com .\nInvestor Relations Contact:\nSarah Meyerrose\nEVP, Chief Financial Officer\n(615) 236-8344\nsarah.meyerrose@franklinsynergy.com\nFRANKLIN FINANCIAL NETWORK\nCONSOLIDATED BALANCE SHEETS\n(Amounts in thousands, except share data)\nDecember 31,\n2017\nDecember 31,\n2016\nASSETS\n(Unaudited)\nCash and due from financial institutions\n$ 251,543\n$ 90,927\nCertificates of deposit at other financial institutions\n2,855\n1,055\nSecurities available for sale\n999,881\n754,755\nSecurities held to maturity (fair value 2017—$217,608 and 2016—$227,892)\n214,856\n228,894\nLoans held for sale, at fair value\n12,024\n23,699\nLoans\n2,256,608\n1,773,592\nAllowance for loan losses\n(21,247 )\n(16,553 )\nNet loans\n2,235,361\n1,757,039\nRestricted equity securities, at cost\n18,492\n11,843\nPremises and equipment, net\n11,281\n9,551\nAccrued interest receivable\n11,947\n9,931\nBank owned life insurance\n49,085\n23,267\nDeferred tax asset\n10,837\n15,013\nForeclosed assets\n1,503\n—\nServicing rights, net\n3,620\n3,621\nGoodwill\n9,124\n9,124\nCore deposit intangible, net\n1,007\n1,480\nOther assets\n10,940\n2,990\nTotal assets\n$ 3,844,356\n$ 2,943,189\nLIABILITIES AND EQUITY\nDeposits\nNon-interest bearing\n$ 272,172\n$ 233,781\nInterest bearing\n2,895,056\n2,158,037\nTotal deposits\n3,167,228\n2,391,818\nFederal Home Loan Bank advances\n272,000\n132,000\nFederal funds purchased and repurchase agreements\n31,004\n83,301\nSubordinated notes, net\n58,515\n58,337\nAccrued interest payable\n2,769\n1,924\nOther liabilities\n8,187\n5,448\nTotal liabilities\n3,539,703\n2,672,828\nEquity\nPreferred stock, no par value: 1,000,000 shares authorized; no shares outstanding at December 31, 2017 and December 31, 2016\n—\n—\nCommon stock, no par value: 30,000,000 shares authorized; 13,237,128 and 13,036,954 issued at December 31, 2017 and December 31, 2016, respectively\n222,665\n218,354\nRetained earnings\n87,469\n59,386\nAccumulated other comprehensive loss\n(5,584 )\n(7,482 )\nTotal shareholders' equity\n304,550\n270,258\nNoncontrolling interest in consolidated subsidiary\n103\n103\nTotal equity\n$ 304,653\n$ 270,361\nTotal liabilities and equity\n$ 3,844,356\n$ 2,943,189\nFRANKLIN FINANCIAL NETWORK, INC.\nCONSOLIDATED STATEMENTS OF INCOME\n(Amounts in thousands, except per share data)\n(Unaudited)\nThree Months Ended\nDecember 31,\nTwelve Months Ended\nDecember 31,\n2017\n2016\n2017\n2016\nInterest income and dividends\nLoans, including fees\n$ 27,275\n$ 21,372\n$ 100,470\n$ 78,236\nSecurities:\nTaxable\n4,951\n3,904\n21,309\n15,306\nTax-Exempt\n2,144\n1,833\n8,593\n5,609\nDividends on restricted equity securities\n265\n146\n928\n500\nFederal funds sold and other\n486\n81\n1,153\n256\nTotal interest income\n35,121\n27,336\n132,453\n99,907\nInterest expense\nDeposits\n8,346\n4,116\n27,464\n14,234\nFederal funds purchased and repurchase agreements\n98\n66\n407\n303\nFederal Home Loan Bank advances\n987\n373\n3,215\n884\nSubordinated notes and other borrowings\n1,082\n1,082\n4,321\n2,902\nTotal interest expense\n10,513\n5,637\n35,407\n18,323\nNet interest income\n24,608\n21,699\n97,046\n81,584\nProvision for loan losses\n1,295\n1,145\n4,313\n5,240\nNet interest income after provision for loan losses\n23,313\n20,554\n92,733\n76,344\nNoninterest income\nService charges on deposit accounts\n40\n46\n154\n185\nOther service charges and fees\n744\n796\n3,041\n3,041\nNet gains on sale of loans\n861\n324\n6,779\n7,183\nWealth management\n693\n551\n2,577\n1,894\nLoan servicing fees, net\n106\n24\n336\n22\nGain on sale of securities\n426\n637\n896\n2,172\nNet gain on sale and write-down of foreclosed assets\n3\n4\n(7 )\n40\nOther\n391\n171\n945\n603\nTotal noninterest income\n3,264\n2,553\n14,721\n15,140\nNoninterest expense\nSalaries and employee benefits\n9,096\n7,930\n35,268\n30,029\nOccupancy and equipment\n2,530\n2,064\n9,219\n7,627\nFDIC assessment expense\n1,005\n680\n3,680\n2,068\nMarketing\n221\n151\n965\n762\nProfessional fees\n837\n540\n3,395\n3,546\nAmortization of core deposit intangible\n110\n133\n473\n564\nOther\n2,188\n1,731\n7,824\n7,085\nTotal noninterest expense\n15,987\n13,229\n60,824\n51,681\nIncome before income tax expense\n10,590\n9,878\n46,630\n39,803\nIncome tax expense\n8,188\n2,699\n18,531\n11,746\nNet income\n2,402\n7,179\n28,099\n28,057\nEarnings attributable to noncontrolling interest\n(8 )\n—\n(16 )\n—\nDividends paid on Series A preferred stock\n—\n—\n—\n(23 )\nNet income available to common shareholders\n$ 2,394\n$ 7,179\n$ 28,083\n$ 28,034\nEarnings per share:\nBasic\n$ 0.18\n$ 0.61\n$ 2.14\n$ 2.56\nDiluted\n0.17\n0.58\n2.04\n2.42\nFRANKLIN FINANCIAL NETWORK, INC.\nAVERAGE BALANCES (7) — ANALYSIS OF YIELDS & RATES (UNAUDITED)\n(Amounts in thousands, except percentages)\nThree Months Ended December 31,\n2017\n2016\nAverage\nBalance\nInterest\nInc / Exp\nAverage\nYield / Rate\nAverage\nBalance\nInterest\nInc / Exp\nAverage\nYield / Rate\nASSETS:\nLoans (1)(6)\n$ 2,198,919\n$ 27,294\n4.92 %\n$ 1,732,872\n$ 21,397\n4.91 %\nSecurities available for sale (6)\n942,916\n6,224\n2.62 %\n742,614\n4,676\n2.50 %\nSecurities held to maturity (6)\n216,429\n2,255\n4.13 %\n232,350\n2,244\n3.84 %\nRestricted equity securities\n18,481\n265\n5.69 %\n11,835\n146\n4.91 %\nCertificates of deposit at other financial institutions\n2,381\n9\n1.50 %\n1,055\n4\n1.51 %\nFederal funds sold and other (2)\n150,627\n477\n1.26 %\n62,747\n77\n0.49 %\nTOTAL INTEREST EARNING ASSETS\n$ 3,529,753\n$ 36,524\n4.11 %\n$ 2,783,473\n$ 28,544\n4.08 %\nAllowance for loan losses\n(20,351 )\n(16,137 )\nAll other assets\n123,906\n89,146\nTOTAL ASSETS\n$ 3,633,308\n$ 2,856,482\nLIABILITIES & EQUITY\nDeposits:\nInterest checking\n$ 603,930\n$ 1,417\n0.93 %\n$ 452,224\n$ 558\n0.49 %\nMoney market\n681,950\n2,130\n1.24 %\n642,541\n1,086\n0.67 %\nSavings\n53,121\n42\n0.31 %\n52,533\n41\n0.31 %\nTime deposits\n1,323,637\n4,757\n1.43 %\n964,396\n2,431\n1.00 %\nFederal Home Loan Bank advances\n290,913\n987\n1.35 %\n153,087\n373\n0.97 %\nFederal funds purchased and other (3)\n35,689\n98\n1.09 %\n45,091\n66\n0.58 %\nSubordinated notes and other borrowings\n58,488\n1,082\n7.34 %\n58,315\n1,082\n7.38 %\nTOTAL INTEREST BEARING LIABILITIES\n$ 3,047,728\n$ 10,513\n1.37 %\n$ 2,368,187\n$ 5,637\n0.95 %\nDemand deposits\n268,894\n239,962\nOther liabilities\n11,839\n12,336\nTotal equity\n304,847\n235,997\nTOTAL LIABILITIES AND EQUITY\n$ 3,633,308\n$ 2,856,482\nNET INTEREST SPREAD (4)\n2.74 %\n3.13 %\nNET INTEREST INCOME\n$ 26,011\n$ 22,907\nNET INTEREST MARGIN (5)\n2.92 %\n3.27 %\n(1)\nLoan balances include both loans held in the Bank's portfolio and mortgage loans held for sale and are net of deferred origination fees and costs. Non-accrual loans are included in total loan balances.\n(2)\nIncludes federal funds sold and interest-bearing deposits at the Federal Reserve Bank and the Federal Home Loan Bank.\n(3)\nIncludes repurchase agreements.\n(4)\nRepresents the average rate earned on interest-earning assets minus the average rate paid on interest-bearing liabilities.\n(5)\nRepresents net interest income (annualized) divided by total average earning assets.\n(6)\nInterest income and rates include the effects of tax-equivalent adjustments to adjust tax-exempt interest income on tax-exempt loans and investment securities to a fully taxable basis.\n(7)\nAverage balances are average daily balances.\nFRANKLIN FINANCIAL NETWORK, INC.\nAVERAGE BALANCES (7) — ANALYSIS OF YIELDS & RATES (UNAUDITED)\n(Amounts in thousands, except percentages\nTwelve Months Ended December 31,\n2017\n2016\nAverage\nBalance\nInterest\nInc / Exp\nAverage\nYield / Rate\nAverage\nBalance\nInterest\nInc / Exp\nAverage\nYield / Rate\nASSETS:\nLoans (1)(6)\n$ 2,031,883\n$ 100,568\n4.95 %\n$ 1,554,482\n$ 78,329\n5.04 %\nSecurities available for sale (6)\n987,196\n26,182\n2.65 %\n666,745\n16,593\n2.49 %\nSecurities held to maturity (6)\n222,222\n9,267\n4.17 %\n203,884\n7,943\n3.90 %\nRestricted equity securities\n16,498\n928\n5.62 %\n9,904\n500\n5.05 %\nCertificates of deposit at other financial institutions\n2,229\n33\n1.48 %\n827\n15\n1.81 %\nFederal funds sold and other (2)\n101,292\n1,120\n1.11 %\n60,519\n241\n0.40 %\nTOTAL INTEREST EARNING ASSETS\n$ 3,361,320\n$ 138,098\n4.11 %\n$ 2,496,361\n$ 103,621\n4.15 %\nAllowance for loan losses\n(18,729 )\n(13,923 )\nAll other assets\n103,063\n74,830\nTOTAL ASSETS\n$ 3,445,654\n$ 2,557,268\nLIABILITIES & EQUITY\nDeposits:\nInterest checking\n$ 624,612\n$ 5,003\n0.80 %\n$ 332,285\n$ 1,411\n0.42 %\nMoney market\n627,140\n6,542\n1.04 %\n617,036\n3,853\n0.62 %\nSavings\n54,952\n169\n0.31 %\n49,525\n162\n0.33 %\nTime deposits\n1,228,676\n15,750\n1.28 %\n944,086\n8,808\n0.93 %\nFederal Home Loan Bank advances\n254,740\n3,215\n1.26 %\n94,937\n884\n0.93 %\nFederal funds purchased and other (3)\n43,402\n407\n0.94 %\n48,841\n303\n0.62 %\nSubordinated notes and other borrowings\n58,421\n4,321\n7.40 %\n39,276\n2,902\n7.39 %\nTOTAL INTEREST BEARING LIABILITIES\n$ 2,891,943\n$ 35,407\n1.22 %\n$ 2,125,986\n$ 18,323\n0.86 %\nDemand deposits\n252,276\n210,780\nOther liabilities\n10,999\n12,739\nTotal equity\n290,436\n207,763\nTOTAL LIABILITIES AND EQUITY\n$ 3,445,654\n$ 2,557,268\nNET INTEREST SPREAD (4)\n2.89 %\n3.29 %\nNET INTEREST INCOME\n$ 102,691\n$ 85,298\nNET INTEREST MARGIN (5)\n3.06 %\n3.42 %\n(1)\nLoan balances include both loans held in the Bank's portfolio and mortgage loans held for sale and are net of deferred origination fees and costs. Non-accrual loans are included in total loan balances.\n(2)\nIncludes federal funds sold and interest-bearing deposits at the Federal Reserve Bank, the Federal Home Loan Bank and other financial institutions and interest in other financial instruments.\n(3)\nIncludes repurchase agreements.\n(4)\nRepresents the average rate earned on interest-earning assets minus the average rate paid on interest-bearing liabilities.\n(5)\nRepresents net interest income (annualized) divided by total average earning assets.\n(6)\nInterest income and rates include the effects of tax-equivalent adjustments to adjust tax-exempt interest income on tax-exempt loans and investment securities to a fully taxable basis.\n(7)\nAverage balances are average daily balances.\nFRANKLIN FINANCIAL NETWORK, INC.\nSUMMARY QUARTERLY CONSOLIDATED FINANCIAL DATA (UNAUDITED)\n(Amounts in thousands, except per share data and percentages)\nAs of and for the three months ended\nDec 31,\n2017\nSept 30,\n2017\nJun 30,\n2017\nMar 31,\n2017\nDec 31,\n2016\nIncome Statement Data ($):\nInterest income\n35,121\n33,780\n33,011\n30,541\n27,336\nInterest expense\n10,513\n9,454\n8,542\n6,898\n5,637\nNet interest income\n24,608\n24,326\n24,469\n23,643\n21,699\nProvision for loan losses\n1,295\n590\n573\n1,855\n1,145\nNoninterest income\n3,264\n3,569\n3,880\n4,008\n2,553\nNoninterest expense\n15,987\n15,278\n15,283\n14,276\n13,229\nNet income before taxes\n10,590\n12,027\n12,493\n11,520\n9,878\nIncome tax expense\n8,188\n3,138\n3,619\n3,586\n2,699\nNet income\n2,402\n8,889\n8,874\n7,934\n7,179\nEarnings before interest and taxes\n21,103\n21,481\n21,035\n18,418\n15,515\nNet income available to common shareholders\n2,394\n8,889\n8,866\n7,934\n7,179\nWeighted average diluted common shares\n13,767,949\n13,773,539\n13,701,762\n13,657,357\n12,473,725\nEarnings per share, basic\n0.18\n0.67\n0.68\n0.61\n0.61\nEarnings per share, diluted\n0.17\n0.65\n0.64\n0.58\n0.58\nProfitability (%)\nReturn on average assets\n0.26\n1.03\n1.03\n0.99\n1.00\nReturn on average equity\n3.13\n11.83\n12.46\n11.80\n12.10\nReturn on average tangible common equity (4)\n3.22\n12.26\n12.92\n12.27\n12.68\nEfficiency ratio (4)\n57.36\n54.77\n53.91\n51.63\n54.55\nNet interest margin (1)\n2.92\n3.05\n3.08\n3.18\n3.27\nBalance Sheet Data ($):\nLoans (including HFS)\n2,268,632\n2,127,753\n2,023,679\n1,962,397\n1,797,291\nLoan loss reserve\n21,247\n19,944\n18,689\n18,105\n16,553\nCash\n251,543\n155,842\n96,741\n114,664\n90,927\nSecurities\n1,214,737\n1,198,049\n1,243,406\n1,299,349\n983,649\nGoodwill\n9,124\n9,124\n9,124\n9,124\n9,124\nIntangible assets (Sum of core deposit intangible and SBA servicing rights)\n1,057\n1,170\n1,232\n1,353\n1,509\nAssets\n3,844,356\n3,565,278\n3,443,593\n3,454,788\n2,943,189\nDeposits\n3,167,228\n2,824,825\n2,754,425\n2,817,212\n2,391,818\nLiabilities\n3,539,703\n3,261,581\n3,150,572\n3,176,278\n2,672,828\nTotal equity\n304,653\n303,697\n293,021\n278,510\n270,361\nCommon equity\n304,550\n303,594\n292,918\n278,407\n270,258\nTangible common equity (4)\n294,369\n293,300\n282,562\n267,930\n259,625\nAsset Quality (%)\nNonperforming loans/ total loans (2)\n0.13\n0.14\n0.19\n0.21\n0.35\nNonperforming assets / (total loans (2) + foreclosed assets)\n0.20\n0.21\n0.26\n0.27\n0.35\nLoan loss reserve / total loans (2)\n0.94\n0.94\n0.93\n0.93\n0.93\nNet charge-offs (recoveries) / average loans\n0.00\n(0.13)\n0.00\n0.07\n0.04\nCapital (%)\nTangible common equity to tangible assets (4)\n7.68\n8.25\n8.23\n7.78\n8.85\nLeverage ratio (3)\n8.22\n8.58\n8.21\n8.36\n9.28\nCommon Equity Tier 1 ratio (3)\n11.32\n11.57\n11.54\n11.32\n11.75\nTier 1 risk-based capital ratio (3)\n11.32\n11.57\n11.54\n11.32\n11.75\nTotal risk-based capital ratio (3)\n14.35\n14.67\n14.69\n14.51\n15.09\n(1)\nNet interest margins shown in the table above include tax-equivalent adjustments to adjust interest income on tax-exempt loans and tax-exempt investment securities to a fully taxable basis.\n(2)\nTotal loans in this ratio exclude loans held for sale.\n(3)\nCapital ratios come from the Company's regulatory filings with the Board of Governors of the Federal Reserve System, and for September 30, 2017 the ratios are estimates since the Company's quarterly regulatory reports have not yet been filed.\n(4)\nSee Non-GAAP table in the pages that follow.\nGAAP Reconciliation and Management Explanation of Non-GAAP Financial Measures\nSome of the financial data included in our selected historical consolidated financial information are not measures of financial performance recognized by GAAP. Our management uses these non-GAAP financial measures in its analysis of our performance:\n\"Common shareholders' equity\" is defined as total shareholders' equity at end of period less the liquidation preference value of the preferred stock; \"Tangible common shareholders' equity\" is common shareholders' equity less goodwill and other intangible assets; \"Total tangible assets\" is defined as total assets less goodwill and other intangible assets; \"Other intangible assets\" is defined as the sum of core deposit intangible and SBA servicing rights; \"Tangible book value per share\" is defined as tangible common shareholders' equity divided by total common shares outstanding. This measure is important to investors interested in changes from period-to-period in book value per share exclusive of changes in intangible assets; \"Tangible common shareholders' equity ratio\" is defined as the ratio of tangible common shareholders' equity divided by total tangible assets. We believe that this measure is important to many investors in the marketplace who are interested in relative changes from period-to period in common equity and total assets, each exclusive of changes in intangible assets; \"Return on Average Tangible Common Equity\" is defined as annualized net income available to common shareholders divided by average tangible common shareholders' equity; and \"Efficiency ratio\" is defined as noninterest expenses divided by our operating revenue, which is equal to net interest income plus noninterest income.\nWe believe these non-GAAP financial measures provide useful information to management and investors that is supplementary to our financial condition, results of operations and cash flows computed in accordance with GAAP; however, we acknowledge that our non-GAAP financial measures have a number of limitations. As such, you should not view these disclosures as a substitute for results determined in accordance with GAAP, and they are not necessarily comparable to non-GAAP financial measures that other companies use. The following reconciliation table provides a more detailed analysis of these non-GAAP financial measures:\n(Amounts in thousands, except share/ per share data and percentages)\nAs of or for the Three Months Ended\nDec 31,\n2017\nSept 30,\n2017\nJun 30,\n2017\nMar 31,\n2017\nDec 31,\n2016\nTotal shareholders' equity\n$ 304,550\n$ 303,594\n$ 292,918\n$ 278,407\n$ 270,258\nLess: Preferred stock\n—\n—\n—\n—\n—\nTotal common shareholders' equity\n304,550\n303,594\n292,918\n278,407\n270,258\nCommon shares outstanding\n13,237,128\n13,209,055\n13,181,501\n13,064,110\n13,036,954\nBook value per share\n$ 23.01\n$ 22.98\n$ 22.22\n$ 21.31\n$ 20.73\nTotal common shareholders' equity\n304,550\n303,594\n292,918\n278,407\n270,258\nLess: Goodwill and other intangible assets\n10,181\n10,294\n10,356\n10,477\n10,633\nTangible common shareholders' equity\n$ 294,369\n$ 293,300\n$ 282,562\n$ 267,930\n$ 259,625\nCommon shares outstanding\n13,237,128\n13,209,055\n13,181,501\n13,064,110\n13,036,954\nTangible book value per share\n$ 22.24\n$ 22.20\n$ 21.44\n$ 20.51\n$ 19.91\nAverage total common equity\n304,847\n298,088\n285,659\n$ 272,713\n$ 235,984\nLess: Average Preferred stock\n—\n—\n—\n—\n—\nLess: Average Goodwill and other intangible assets\n10,247\n10,321\n10,427\n10,565\n10,719\nAverage tangible common shareholders' equity\n$ 294,600\n$ 287,767\n$ 275,232\n$ 262,148\n$ 225,265\nNet income available to common shareholders\n2,394\n8,889\n8,866\n$ 7,934\n$ 7,179\nAverage tangible common equity\n294,600\n287,767\n275,232\n262,148\n225,265\nReturn on average tangible common equity\n3.22 %\n12.26 %\n12.92 %\n12.27 %\n12.68 %\nEfficiency Ratio:\nNet interest income\n$ 24,608\n$ 24,326\n$ 24,469\n$ 23,643\n$ 21,699\nNoninterest income\n3,264\n3,569\n3,880\n4,008\n2,553\nOperating revenue\n27,872\n27,895\n28,349\n27,651\n24,252\nExpense\nTotal noninterest expense\n15,987\n15,278\n15,283\n14,276\n13,229\nEfficiency ratio\n57.36 %\n54.77 %\n53.91 %\n51.63 %\n54.55 %\nView original content with multimedia: http://www.prnewswire.com/news-releases/franklin-financial-network-announces-financial-results-for-the-fourth-quarter-of-2017-300587791.html\nSOURCE Franklin Financial Network, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/franklin-financial-network-announces-financial-results-for-the-fourth-quarter-of-2017-300587791.html", "http://www.franklinsynergybank.com/"], "published": "2018-01-25T00:15:00.000+02:00", "crawled": "2018-01-25T01:38:07.034+02:00", "highlightTitle": ""}