{"organizations": [], "uuid": "cc1d7b5f6a92178768adad8a00f14c025b072c46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-margaret-murdock-named-general-manager-of-terametrixa-a-division-of-luna-innovations.html", "country": "US", "domain_rank": 767, "title": "Margaret Murdock Named General Manager of TeraMetrix™, a Division of Luna Innovations", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-25T20:30:00.000+02:00", "replies_count": 0, "uuid": "cc1d7b5f6a92178768adad8a00f14c025b072c46"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-margaret-murdock-named-general-manager-of-terametrixa-a-division-of-luna-innovations.html", "ord_in_thread": 0, "title": "Margaret Murdock Named General Manager of TeraMetrix™, a Division of Luna Innovations", "locations": [], "entities": {"persons": [{"name": "margaret murdock", "sentiment": "negative"}, {"name": "luna innovations", "sentiment": "negative"}, {"name": "murdock", "sentiment": "none"}, {"name": "ann arbor", "sentiment": "none"}, {"name": "luna", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "roanoke", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}], "organizations": [{"name": "luna innovations incorporated", "sentiment": "negative"}, {"name": "ndt", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROANOKE, Va.--(BUSINESS WIRE)-- Luna Innovations Incorporated (NASDAQ: LUNA) is pleased to announce its recent hire of Margaret Murdock, who has joined TeraMetrix™, a division of Luna in Ann Arbor, Michigan, as General Manager. Murdock will accelerate the development and global commercialization of the terahertz product platform for the industrial process control environments, aerospace and non-destructive testing (NDT) markets.\n“TeraMetrix is a growing division of Luna, and we are poised commercially to execute and expand our reach,” said Murdock. “The TeraMetrix team has successfully translated proven concepts into robust terahertz products with a wide range of applications from specialty coatings in defense to quality of asphalt shingles to multi-layer thickness in blow-molded products. I’m privileged to lead such a high-performing organization.”\nWith more than 20 years of experience in strategic leadership of global strategies for innovative product development, engineering and manufacturing, Murdock has successfully optimized organizations’ capabilities by initiating quality management systems, implementing Lean Six Sigma principles and identifying actionable change designed to meet customer satisfaction. As a former General Manager at Picometrix, LLC, Murdock was on the leading edge of terahertz instrumentation application development and initial technology adoption into industrial markets.\n“As the TeraMetrix division focuses on meeting the specifications for penetrating additional industrial process control markets, Margaret’s leadership in assessing processes, noting opportunities for improvement and optimizing profitability will be invaluable,” said Scott Graeff, President and CEO of Luna Innovations. “Under Margaret’s guidance, TeraMetrix is poised for critical growth in multiple industry sectors.”\n“I am very excited for this opportunity to lead TeraMetrix,” Murdock said. “Our resources and talent position us to capitalize on our current opportunities and accelerate our future growth.”\nAbout Luna:\nLuna Innovations Incorporated ( www.lunainc.com ) is a leader in optical technology, providing unique capabilities in high speed optoelectronics and high performance fiber optic test products for the telecommunications industry and distributed fiber optic sensing for the aerospace and automotive industries. Luna is organized into two business segments which work closely together to turn ideas into products: a Technology Development segment and a Products and Licensing segment. Luna’s business model is designed to accelerate the process of bringing new and innovative technologies to market.\nForward-Looking Statements:\nThe statements in this release that are not historical facts constitute “forward-looking statements” made pursuant to the safe harbor provision of the Private Securities Litigation Reform Act of 1995 that involve risks and uncertainties. These statements include the company’s expectations Luna’s growth strategy, the expansion of its operations and its future operating performance. Management cautions the reader that these forward-looking statements are only predictions and are subject to a number of both known and unknown risks and uncertainties, and actual results may differ materially from those expressed or implied by these forward-looking statements as a result of a number of factors. These factors include, without limitation, failure of demand for the company’s products and services to meet expectations, technological challenges and those risks and uncertainties set forth in the company’s periodic reports and other filings with the Securities and Exchange Commission (\"SEC\"). Such filings are available on the SEC’s website at www.sec.gov and on the company’s website at www.lunainc.com . The statements made in this release are based on information available to the company as of the date of this release and Luna undertakes no obligation to update any of the forward-looking statements after the date of this release.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005991/en/\nLuna Innovations Incorporated\nInvestor Contact:\nDale Messick, 1-540-769-8400\nCFO\nIR@lunainc.com\nSource: Luna Innovations Incorporated", "external_links": ["http://www.businesswire.com/news/home/20180125005991/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51748994&newsitemid=20180125005991&lan=en-US&anchor=www.sec.gov&index=2&md5=7ccd464a215c8fe114836274c8494c98", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.lunainc.com&esheet=51748994&newsitemid=20180125005991&lan=en-US&anchor=www.lunainc.com&index=3&md5=ca32a1f9121c8e73109aef4df05e6309", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.lunainc.com%2F&esheet=51748994&newsitemid=20180125005991&lan=en-US&anchor=www.lunainc.com&index=1&md5=e123e57a798680461481d1172a746e4b"], "published": "2018-01-25T20:30:00.000+02:00", "crawled": "2018-01-25T20:37:11.000+02:00", "highlightTitle": ""}