{"organizations": [], "uuid": "aa98fe9be93f760185c1e619735d703c0c926fa9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-mosser-companies-establishes-presence-in-los-angeles-with-6-new-acquisitions.html", "country": "US", "domain_rank": 767, "title": "Mosser Companies Establishes Presence in Los Angeles With 6 New Acquisitions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.322, "site_type": "news", "published": "2018-01-16T21:20:00.000+02:00", "replies_count": 0, "uuid": "aa98fe9be93f760185c1e619735d703c0c926fa9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-mosser-companies-establishes-presence-in-los-angeles-with-6-new-acquisitions.html", "ord_in_thread": 0, "title": "Mosser Companies Establishes Presence in Los Angeles With 6 New Acquisitions", "locations": [], "entities": {"persons": [{"name": "mosser", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "koreatown", "sentiment": "none"}, {"name": "westlake", "sentiment": "none"}, {"name": "southern california", "sentiment": "none"}, {"name": "east hollywood", "sentiment": "none"}, {"name": "downtown la", "sentiment": "none"}, {"name": "bay area", "sentiment": "none"}, {"name": "san francisco bay area", "sentiment": "none"}, {"name": "mid-wilshire", "sentiment": "none"}, {"name": "oakland", "sentiment": "none"}], "organizations": [{"name": "mosser companies establishes presence", "sentiment": "negative"}, {"name": "mosser companies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 16, 2018 /PRNewswire/ -- After over a half-century as a sophisticated leader in urban workforce housing in the San Francisco Bay Area, Mosser Companies is proud to announce a thrilling new chapter. As the company has grown and sharpened its abilities, it has become apparent that ever more markets are ready for Mosser's proven strategies in the value-add, multifamily real estate space. In addition to thriving properties in San Francisco and Oakland, the company has now established a strong presence in Southern California's premier locale: Los Angeles.\nMosser Companies has acquired 6 properties in the Los Angeles area in some of the most preeminent locations nearest to and including Downtown LA. Across West and East Hollywood, from Koreatown to Westlake and Mid-Wilshire, the Mosser name will mark the region's best in urban living. Mosser Companies' experienced team is ready to take on this exciting new frontier where the glitz and glamour of Los Angeles provides the newest backdrop for our proven urban management expertise.\nAs with Mosser's Bay Area properties, there will remain a continual focus on serving a dynamic, industrious renter base with living that offers proximity to all of city life's necessities and conveniences. Much like their counterparts in Oakland and San Francisco, residents of Mosser properties in LA will enjoy contemporary living in fast-growing areas, boosted by a long history of successful development and management.\n\"We are excited about these initial acquisitions, as they are a perfect fit with our portfolio as we look to grow our presence in Los Angeles. We look forward to modernizing these properties while maintaining the character of the neighborhood. As always, we've got an eye on enhancing the living experience for current and future residents as well as that of our new neighbors,\" says Neveo Mosser , CEO of Mosser Companies and Co-Founder and CEO of Mosser Capital.\nMosser's deep focus and expertise in this field promise continually strong performance, even throughout economic downturns, thanks to proven techniques that have made Mosser a top name in the highly competitive Bay Area.\n\"The Los Angeles market is one we're all extremely excited to work within. Mosser Companies' emphasis on transforming undermanaged properties in supply-constrained markets makes this latest step a particularly attractive opportunity for investors. We'll continue to seek risk-adjusted returns through the acquisition, improvement and repositioning of multifamily properties in these highly promising emerging neighborhoods in Los Angeles,\" said Co-Founder and Principal of Mosser Capital, Jim Farris.\nLeadership was effusive with praise for the entire team. \"Nothing gets done in this business without having the right personnel in place,\" continued Farris. \"That we were able to expand Mosser's regional footprint so effectively is a testament to our truly dedicated and talented team.\"\nAs we enter 2018, Mosser Companies stands poised to do for Los Angeles what it has done for the San Francisco Bay Area since 1955: provide the standard of living that hard-working urban professionals deserve, and a unique investment opportunity with beneficial growth. Its proven platform has given residents and investors alike a reason to do business with Mosser again and again, and now the LA market is about to reap those same benefits.\nIn business for five decades with 400 employees, the San Francisco-based Mosser Companies has $1.3 billion in assets under management, comprising more than 3,200 rental apartment units, on behalf of institutional investors, high net worth individuals, and its own account. Mosser acquires, renovates, manages, and leases multifamily units, focusing on rent-stabilized assets in core, urban neighborhoods. Through funds and programmatic joint ventures managed by its subsidiary Mosser Capital, investment partners and clients can access this specialized multifamily platform to seek core-plus and value-add returns.\nView original content with multimedia: http://www.prnewswire.com/news-releases/mosser-companies-establishes-presence-in-los-angeles-with-6-new-acquisitions-300583342.html\nSOURCE Mosser Companies", "external_links": ["http://www.prnewswire.com/news-releases/mosser-companies-establishes-presence-in-los-angeles-with-6-new-acquisitions-300583342.html", "http://neveomosser.com/", "http://mosserco.com/", "http://mosserco.net/"], "published": "2018-01-16T21:20:00.000+02:00", "crawled": "2018-01-16T21:02:56.009+02:00", "highlightTitle": ""}