{"organizations": [], "uuid": "92b43703e71b37c7c0519d8baa941352ed75bc5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180124.html", "section_title": "Archive News &amp; Video for Wednesday, 24 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-britain-slavery-lawmaking-victims/britain-mulls-law-to-rescue-modern-slaves-from-net-of-abuse-idUSKBN1FD2M0", "country": "US", "domain_rank": 408, "title": "Britain mulls law to rescue modern slaves from net of abuse", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T02:10:00.000+02:00", "replies_count": 0, "uuid": "92b43703e71b37c7c0519d8baa941352ed75bc5e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-britain-slavery-lawmaking-victims/britain-mulls-law-to-rescue-modern-slaves-from-net-of-abuse-idUSKBN1FD2M0", "ord_in_thread": 0, "title": "Britain mulls law to rescue modern slaves from net of abuse", "locations": [], "entities": {"persons": [{"name": "kate roberts", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "human trafficking foundation", "sentiment": "none"}, {"name": "nrm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Thomson Reuters Foundation) - Support for victims of modern slavery should be enshrined in law to bolster piecemeal care that leaves survivors open to abuse and repeat trafficking, British charities said on Wednesday.\nPeople who say they have been enslaved can enter the National Referral Mechanism (NRM) and access counseling, housing and legal aid while the government decides whether to recognize them as victims.\nYet those who are identified as victims then have no guarantee of further help, and campaigners say this leaves charities scrambling to ward off the knock-on risk of homelessness, destitution or fresh exploitation.\nA proposed law - put forward by parliament’s unelected upper chamber - would allow such survivors to remain in Britain for a year and receive a support package while deciding whether to apply to remain indefinitely, or accept help to return home.\n“People need a meaningful recovery period to give them the chance to rebuild their lives and decide what to do next,” Kate Roberts of the Human Trafficking Foundation said at the launch of a campaign at parliament backing the private members’ bill.\nThe 2015 Modern Slavery Act has been lauded as a milestone in the global anti-slavery fight for introducing life sentences for traffickers, forcing firms to check their supply chains for forced labor, and protecting people at risk of being enslaved.\nYet it does not specify a period or standard of care for people who claim to be slavery victims, critics say.\nVictims risk getting mediocre aid because the Home Office (interior ministry) does not monitor the support provided to people in safe houses while they await a decision on their future, a government watchdog said last month.\nThe government in October announced an overhaul of the way it handles potential victims, with a raft of changes including extra shelter and support, and drop-in services.\nYet these reforms do not go far enough, highlighting the need for care to be backed by a law, anti-slavery groups say.\n“We see so many cases where survivors’ lives fall apart as the quality of care they get is so sub-standard,” Jakub Sobik of Anti-Slavery International told the Thomson Reuters Foundation.\nAt least 13,000 people are estimated by the government to be victims of forced labor, sexual exploitation and domestic servitude - but police say the figure is the tip of the iceberg.\nReporting By Kieran Guilbert, Editing by Lyndsay Griffiths.; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T02:10:00.000+02:00", "crawled": "2018-01-25T13:12:35.000+02:00", "highlightTitle": ""}