{"organizations": [], "uuid": "d11ebbd141ea3e4ba215edbd36c23b2688b4ab10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226679214&w=1200&r=LYNXMPEE0T1D2", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-usa-economy/u-s-consumer-confidence-rebounds-house-prices-march-higher-idUSKBN1FJ2LL", "country": "US", "domain_rank": 408, "title": "U.S. consumer confidence rebounds; house prices march higher", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T20:21:00.000+02:00", "replies_count": 0, "uuid": "d11ebbd141ea3e4ba215edbd36c23b2688b4ab10"}, "author": "", "url": "https://www.reuters.com/article/us-usa-economy/u-s-consumer-confidence-rebounds-house-prices-march-higher-idUSKBN1FJ2LL", "ord_in_thread": 0, "title": "U.S. consumer confidence rebounds; house prices march higher", "locations": [], "entities": {"persons": [{"name": "jennifer lee", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "bmo capital markets", "sentiment": "none"}, {"name": "conference board", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - U.S consumer confidence rebounded in January and house prices increased further in November, suggesting that a recent acceleration in consumer spending was likely to be sustained despite sluggish wage growth. \nRobust consumer confidence and rising household wealth as a result of record gains on the U.S. stock market and rising house prices have left Americans less fearful about the future. That is encouraging some to dip into their savings to fund purchases. \n“More confident U.S. consumers point to stronger spending as the year begins,” said Jennifer Lee, a senior economist at BMO Capital Markets in Toronto. \nThe Conference Board said its consumer confidence index increased 2.3 points to a reading of 125.4 this month. \nBut consumers were less upbeat in their assessment of current conditions. They were also ambivalent about their income prospects over the coming months, which the survey attributed to “some uncertainty regarding the impact of the tax plan.” \nThe Trump administration and the Republican-controlled U.S. Congress pushed through a $1.5 trillion tax cut package last month. While many Americans will see an increase in their paychecks, taxes will increase for some middle-income families. \nThe survey’s so-called labor market differential, derived from data about respondents who think jobs are hard to get and those who think jobs are plentiful, rose to a cycle high of 21.2 in January from 20.3 in December. \nThis measure closely correlates to the unemployment rate in the Labor Department’s employment report and is consistent with further absorption of labor market slack. The labor market is near full employment, with the unemployment rate at a 17-year low of 4.1 percent. \n\nFILE PHOTO: Homes with boathouses built around an artificial lake are seen in Indio, California April 13, 2015. REUTERS/Lucy Nicholson/File Photo STRONG CONSUMER SPENDING The report came as Federal Reserve officials began a two-day policy meeting on Tuesday. The U.S. central bank is expected to leave interest rates unchanged at the end of the meeting on Wednesday. Economists expect the Fed, which has forecast three rate increases this year, to raise its economic assessment. \nThe central bank raised borrowing costs three times last year. The dollar was little changed against a basket of currencies. U.S. Treasury yields rose, putting pressure on Wall Street, with the Dow Jones Industrial Average .DJI falling more than 350 points. \nStrong consumer confidence bodes well for consumer spending, even though households’ buying plans showed mixed intentions in January. Consumers’ inflation expectations over the next 12 months slipped a bit in January. \nConsumer spending increased at its quickest pace in three years in the fourth quarter. Robust consumer confidence also provides a boost to the economy after it grew 2.3 percent in 2017. Households are drawing down savings to boost spending. The saving rate fell to a 10-year low of 3.4 percent in 2017. \nA second report on Tuesday showed the S&P CoreLogic Case-Shiller composite index of house prices in 20 metropolitan areas rose 6.4 percent in November on a year-over-year basis after increasing 6.3 percent in October. \nAn acute shortage of homes on the market and strong demand are pushing up house prices. While rising house prices are boosting equity for homeowners, the dearth of properties is sidelining first-time buyers from the market, hurting home sales. The house price appreciation has outpaced wage growth, which has been stuck below 3 percent. \n“Strong economic growth has boosted home buying but new construction has been slow to ramp up. The persistent supply-demand imbalance has driven prices higher across the country and worsened affordability concerns,” said Mark Vitner, a senior economist at Wells Fargo Securities in Charlotte, North Carolina. \n“Home prices have risen about three times faster than inflation and twice as fast as income growth over the past year.” \nReporting By Lucia Mutikani; Editing by Andrea Ricci\n ", "external_links": [], "published": "2018-01-30T20:21:00.000+02:00", "crawled": "2018-01-30T20:36:05.000+02:00", "highlightTitle": ""}