{"organizations": [], "uuid": "00d251090aecf27234bbc2eb74630c4f8c5afd97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKTennisNews/", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-kyrgios-wilander/wilander-fears-rod-laver-slot-may-inhibit-kyrgios-v-tsonga-idUKKBN1F71V1", "country": "US", "domain_rank": 408, "title": "Tennis-Wilander fears Rod Laver slot may inhibit Kyrgios v Tsonga", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T15:51:00.000+02:00", "replies_count": 0, "uuid": "00d251090aecf27234bbc2eb74630c4f8c5afd97"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-kyrgios-wilander/wilander-fears-rod-laver-slot-may-inhibit-kyrgios-v-tsonga-idUKKBN1F71V1", "ord_in_thread": 0, "title": "Tennis-Wilander fears Rod Laver slot may inhibit Kyrgios v Tsonga", "locations": [], "entities": {"persons": [{"name": "rod laver", "sentiment": "negative"}, {"name": "wilander", "sentiment": "negative"}, {"name": "martyn herman", "sentiment": "none"}, {"name": "viktor troicki", "sentiment": "none"}, {"name": "nick kyrgios", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "tsonga", "sentiment": "none"}, {"name": "mats wilander", "sentiment": "none"}, {"name": "rogerio dutra silva", "sentiment": "none"}, {"name": "kyrgios", "sentiment": "none"}, {"name": "jo-wilfried tsonga", "sentiment": "none"}], "locations": [{"name": "hisense arena", "sentiment": "none"}], "organizations": [{"name": "kyrgios", "sentiment": "negative"}, {"name": "hisense arena", "sentiment": "none"}, {"name": "min read  melbourne", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 1:59 PM / Updated 5 minutes ago Wilander fears Rod Laver slot may inhibit Kyrgios vs. Tsonga Martyn Herman 3 Min Read \nMELBOURNE (Reuters) - Nick Kyrgios must not let playing on Rod Laver Arena douse his natural fire when he plays Jo-Wilfried Tsonga in the standout match of the Australian Open third round on Friday, according to former champion Mats Wilander. \nThe 22-year-old Australian has thrived in the chaotic atmosphere of the smaller Hisense Arena, beating both Rogerio Dutra Silva and Viktor Troicki in straight sets. \nBut the home favourite has been given top billing on the grandiose Rod Laver stadium for his clash against boyhood idol Tsonga, the 15th seed, when the great and good will be watching his every move from the posh seats. \nWilander, who has been impressed with 17th seed Kyrgios’s progress so far, fears the bigger stage might inhibit him whereas the hubbub on the Hisense Arena, where fans with ground passes get in free, energises the Canberran. \n“That is the problem for me, I‘m not sure what (the organisers) are doing,” three-times Australian Open champion Wilander, in Australia as a commentator for Eurosport, told Reuters. \n”I‘m assuming it’s Nick who wants to play on Laver. When I look at him, he is the people’s hero not the corporate hero because of the way he is on court. \n”Nick is clever and there is no way he won’t pay attention to who is in the stadium. For example he will have Laver and (Ken) Rosewall and will think ‘Oh man they are all watching, maybe I better be careful what I say, have to clean up my act’. \n“It definitely bothers him. I don’ think I’ve seen him win a match on Rod Laver. He played Andy Murray once there and after a set he said ‘I‘m dead mate’ and couldn’t move his legs.” \nWilander said Kyrgios thrives in a chaotic environment as was demonstrated in his matches on Hisense, where he swore at a fan during the encounter against Dutra Silva and then was heckled against Troicki. \n”Nick likes to be disruptive, it’s the way he plays,“ Wilander said. ”Opponents can get distracted by his tactics. \n”But I think he’s less disruptive the more organised the surroundings are, that’s the problem. \n“You have to show up emotionally against Tsonga, he can’t afford to go in there flat, which could happen in Laver.” Related Coverage Kyrgios graduates to Rod Laver as temperatures rise in Melbourne \nDespite his misgivings, Wilander says Kyrgios is the favourite in what will be his second meeting with the player he describes as his idol. \n”If he shows up mentally he is the favourite,“ he said. ”Tsonga played better when he was behind (against Denis Shapovalov) in the previous round. \n“But I don’t think that’s enough against Kyrgios. I think Nick is one size too big for Jo.” Reporting by Martyn Herman, editing by Pritha Sarkar", "external_links": [], "published": "2018-01-18T15:51:00.000+02:00", "crawled": "2018-01-18T16:08:01.002+02:00", "highlightTitle": ""}