{"organizations": [], "uuid": "d9a1ceb10b1e1f8aa0133ce6cc54cc2aca3c119d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/02/104627540-GettyImages-691658422-manufacturing.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/cnbc-fed-survey-most-of-the-tax-cut-windfall-will-boost-buybacks-and-dividends.html", "country": "US", "domain_rank": 767, "title": "CNBC Fed survey: Most of the tax cut windfall will boost buybacks and dividends", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-30T18:29:00.000+02:00", "replies_count": 0, "uuid": "d9a1ceb10b1e1f8aa0133ce6cc54cc2aca3c119d"}, "author": "Steve Liesman", "url": "https://www.cnbc.com/2018/01/30/cnbc-fed-survey-most-of-the-tax-cut-windfall-will-boost-buybacks-and-dividends.html", "ord_in_thread": 0, "title": "CNBC Fed survey: Most of the tax cut windfall will boost buybacks and dividends", "locations": [], "entities": {"persons": [{"name": "jim young", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc fed", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "fed", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Forecasters are more optimistic now about the effects of tax cuts on economic growth, they but don't see workers pocketing much of the windfall.\nRespondents to the CNBC Fed Survey believe that tax cuts will add 63 basis points to GDP this year, up about 20 basis points from their December estimates.\nThis could reflect last-minute changes to the bill that pulled forward some of the benefits. But it also could result from corporate announcements in the wake of the tax cuts for increased capital spending and either higher worker wages or one-time bonuses to employees.\n\"Markets may be understating the impact of the tax cut. We believe that there is the potential for consumers to respond more positively to this tax cut than polls suggest,\" Drew T. Matus, chief market strategist for MetLife Investment Management, wrote in response to the survey.\nBut asked to parse out how companies will use the windfall from the tax gains, most respondents didn't see much going to workers. About 36 percent is seen being used to buy back shares (22 percent) and dividends (14 percent.)\nDebt reduction is forecast to get the next biggest piece of the pie at 13 percent. Workers are estimated to get just 12 cents of every dollar of additional savings from the corporate tax cut.\nThis would amount to much less than estimated by Trump administration economists, who have argued that workers could reap 70 or 80 cents of every dollar of corporate tax relief.\nTo be sure, administration economists based their argument on their belief that a lot of the money would be used to buy capital equipment and boost worker productivity in a process that would take at least several years to show up in paychecks. Higher productivity would underpin higher worker salaries of as much as $4,000 to $9,000 a year .\nThose claims have been the subject of considerable controversy, but these are early days for either side to claim victory.\nOverall, just 8 percent of the 40 respondents, who include economists, strategists and fund managers, say workers will benefit the most from the tax cuts. Fifty-four percent say it will be shareholders and executives and 39 percent say both sides will benefit equally.\nAt the very least, that's a sign that the administration's optimistic view on the effect of the tax cuts on workers has yet to take hold in the broader economic community.", "external_links": [], "published": "2018-01-30T18:29:00.000+02:00", "crawled": "2018-01-30T18:29:12.001+02:00", "highlightTitle": ""}