{"organizations": [], "uuid": "b3cf07e168de60bf3c265cbf28ce910995813f8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/cnbc-interview-with-richard-edelman-edelman-pr-ceo-from-the-world-economic-forum-2018.html", "country": "US", "domain_rank": 767, "title": "CNBC Interview with Richard Edelman, Edelman PR CEO, from the World Economic Forum 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T10:24:00.000+02:00", "replies_count": 0, "uuid": "b3cf07e168de60bf3c265cbf28ce910995813f8e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/cnbc-interview-with-richard-edelman-edelman-pr-ceo-from-the-world-economic-forum-2018.html", "ord_in_thread": 0, "title": "CNBC Interview with Richard Edelman, Edelman PR CEO, from the World Economic Forum 2018", "locations": [], "entities": {"persons": [{"name": "richard edelman", "sentiment": "negative"}, {"name": "edelman", "sentiment": "negative"}, {"name": "akiko", "sentiment": "negative"}, {"name": "davos", "sentiment": "none"}, {"name": "cap con", "sentiment": "none"}, {"name": "fujita", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "cnbc interview", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Following are excerpts from a CNBC interview with Richard Edelman, CEO of Edelman, and CNBC's Akiko Fujita from the World Economic Forum 2018.\nAF: Welcome back to Cap Con. We are live here in Davos, Switzerland, for the World Economic Forum, a very snowy Davos, we should say. The theme this year is creating a shared future in a fractured world. World and business leaders, all gathering here to tackle the issues of climate change, inequality, trade, all of the above. And we're joined by somebody who is a veteran here at Davos, Richard Edelman, who is the CEO and President of Edelman. It's great to have you on today.\nRE: Thank you.\nAF: You've just come out with a study, the Trust Barometer, which is something that you have every year, and one of the things that struck me is just how the US suffered the largest record drop in trust in the survey. What's behind that?\nRE: Well, it was led down by government. Government dropped 30 points for the opinion leaders, 14 points for the mass population. People don't have a sense of confidence in what's being said. Not just the policies. There's a, sort of, instability in a world without facts, and it's all opinion, and it's moving quite quickly, and it's disturbing people.\nAF: So, there's no question, it sounds like the Trump administration, at least, the rhetoric that has come out of it has-, has, at least according to this study, really hurt the US standing, the trust, as you point out. President Trump expected to come in here on Friday. How does he play to the group here at the World Economic Forum? It seems that the It seems that the America First policy runs a bit counter to what many of the global leaders here believe should be the policy, moving forward.\nRE: I think that America has to do more than just have an opinion. It has to lead. And I think what we've found in the data is a real hunger for knowledge and expertise. That a person like yourself is going down, that technical experts, academics, CEOs are going up. We want to have people we can trust giving us information. And it's also shocking that-, the decline of trust in search and social. That's driving all media down. Interestingly, a rise for journalists, like you, and a big jump for mainstream journalism.\nAF: Mm. So, a big jump for mainstream media, as you say, but the broader scope here, when you look at media, in general, there is a huge distrust there. How do you think people distinguish between what is on social, and what's on some of the bigger outlets? Is there a distinction there, in terms of what they trust?\nRE: 70% of people tell us that they can't distinguish between a real story and 'fake news', and they also believe that media is somewhat politicized, elitist. Half the people have now signed off of mainstream media altogether, so they're getting their news exclusively from search and social.\nAF: Mm.\nRE: So, I think it's urgent for companies, and media companies, especially, to try to bring the discussion back to informing, as opposed to opining.\nAF: So, how do they do that? I mean, given that the general consumption of news right now isn't just through your traditional means, it is on social, it is online. How do mainstream outlets try to distinguish those two?\nRE: I believe that media's big job is to take on the responsibility for having the populace educated. And, in the moment, more than half the people say they can't judge whether a government official's doing well, or whether a brand is doing well, and that's a bad place to be. I think companies have to use their privileged position. Actually, 70% of people trust their own employer, so, talk first to your employees, let them talk broadly, but also, business has to not just have CEOs stand up, but take on issues of the future. For example, in the States, we're going to have 3 million truck drivers, with autonomous vehicles, they're not going to have a job. So, how are we going to retrain these people, so that they actually feel good, instead of having fears about immigration, or about lower social mobility, or about their future of their kids?\nAF: Mm. Let me bring the conversation back to your field, which is-,\nRE: Sure.\nAF: Public relations, because, last year, we saw your biggest competitor, Bell Pottinger, fall, on the back of an epic scandal-,\nRE: Mm.\nAF: And you have called for the PR industry to adopt new ethics principles. What does that guideline look like?\nRE: Well, basically, you shouldn't take every client. You should also have a style that recognizes your job as helping the media to find quality information. I think the whole PR industry, and I'm going to work like, hard on this, this year, should move from a position of advocacy and lobbying, towards one that is informing. Tell both sides of the story. Even if you're being paid by the company, your job is, oftentimes, to go direct to the end user of information, and, in the moment, silence is a tax on truth. And we've got to get companies to speak up, but speak up in a way that is educating, as opposed to just lobbying.\nAF: Okay, we'll have to leave it on that note. It's great to have you on, very early here-,\nRE: Thanks.\nAF: In Davos, Switzerland. Richard Edelman, there, joining us, from Edelman. We have-, we will have much more coverage from here in Switzerland that's coming up on the other side of the break.\nENDS", "external_links": [], "published": "2018-01-23T10:24:00.000+02:00", "crawled": "2018-01-23T11:58:53.000+02:00", "highlightTitle": ""}