{"organizations": [], "uuid": "3e521caf640db6a80b41659dddaa5f77451d69d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-jargon-patient-communication/medical-jargon-may-cloud-doctor-patient-communication-idUKKBN1EQ17B", "country": "US", "domain_rank": 408, "title": "Medical jargon may cloud doctor-patient communication", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T20:40:00.000+02:00", "replies_count": 0, "uuid": "3e521caf640db6a80b41659dddaa5f77451d69d2"}, "author": "", "url": "https://uk.reuters.com/article/us-health-jargon-patient-communication/medical-jargon-may-cloud-doctor-patient-communication-idUKKBN1EQ17B", "ord_in_thread": 0, "title": "Medical jargon may cloud doctor-patient communication", "locations": [], "entities": {"persons": [{"name": "sidney eisig", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "british dental journal", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "columbia university’s college of dental medicine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 1, 2018 / 6:43 PM / Updated 2 hours ago Medical jargon may cloud doctor-patient communication 5 Min Read \n(Reuters Health) - When patients misunderstand commonly used medical terms, communication and decision-making may suffer, UK researchers say. \nIn a survey of London oral and maxillofacial surgery clinic patients, more than a third of participants did not know the meaning of terms like “benign” or “lesion” and more than half could not define “metastasis” or “lymph node,” the study team reports in the British Dental Journal. \nCommunication between patient and practitioner is essential, the researchers write, but it may not be happening as often as doctors think it is. \n“As a result, ill-informed patients tend to neglect timely treatment which can lead to very bad - sometimes disastrous - outcomes,” said Dr. Sidney Eisig of Columbia University’s College of Dental Medicine in New York, who wasn’t involved in the study. \n“I’ve seen patients with premalignant lesions turn to cancer that otherwise might not have occurred had surgical treatment not been so delayed,” he told Reuters Health in a telephone interview. \nEmma Hayes of King’s College Hospital, London, and her colleagues recruited 123 patients waiting for their appointments at the hospital’s outpatient clinic to anonymously answer questionnaires about the meanings of several medical terms. Participants also provided background information about themselves, including education level and whether English was their first language. \nIn a multiple-choice section of the questionnaire, they were asked to define: blister, ulcer, malignant, lesion and benign. In a free-written answer section, they were also asked to describe in their own words the meanings of: biopsy, tumor, lymph node, pre-malignant and metastasis. \nHayes’ team found that 90 percent of respondents correctly defined blister as a bubble of fluid under the skin. Ulcer came in at a distant second with just 70 percent choosing the appropriate definition as an open sore or break in the skin. \n“The words blister and ulcer are frequently used in medical areas unrelated to dental care, which may explain why the two are the most recognized medical lexicon,” Eisig noted. “For example, a patient experienced foot or hand blisters in the past. A friend or family member once had a stomach ulcer.” \nForty-five percent of patients were able to define a biopsy as a test involving taking a sample, but 30 percent wrongly defined it as a test specifically for cancer. \nBenign and metastasis were the least understood terms, with 33 percent of patients responding “Don’t know” for the meaning of benign and just 6 percent correctly defining metastasis as the spread of a cancer to other areas of the body. Many patients also seemed to mistake “metastasis” for other words, offering responses such as “foot bone” (metatarsal) or “breast condition, very painful” (mastitis). \nThe researchers found that nearly 27 percent of participants did not speak English as a first language, which is a higher rate than London as a whole, at 22 percent, they note. But when the researchers looked just at those whose first language was English, they saw no differences in the number of correct answers based on educational level. \nThe study authors did not respond to a request for comments. \nAccording to the U.S. National Institutes of Health, providers in many fields, including emergency room settings, surgery requiring anesthetics and breast cancer clinics, grapple with how best to effectively communicate with patients. \nEfforts to bridge this gap include encouraging the use of plainer language in written materials and providing interpreting services for non-English speakers. \nEisig notes that some of the biggest challenges to effectively communicating with patients stem from growing bureaucracy within healthcare and are not so easily remedied. \n“Over the past decade or so there have been many changes to healthcare, many of which are driven by finances. Some of these changes aren’t always beneficial,” he said. \n“Frequently the doctor’s back may be to the patient as entries are being made into the electronic health record. Doctor-patient communication is now being done increasingly through email. These are just two examples that may lead to communication failures because practitioners are spending less time with patients, which results in diminished relationships thus increasing the likelihood for patient misinterpretation.” \nSOURCE: go.nature.com/2zMEzbt British Dental Journal, online December 1, 2017.", "external_links": [], "published": "2018-01-01T20:40:00.000+02:00", "crawled": "2018-01-01T21:13:46.004+02:00", "highlightTitle": ""}