{"organizations": [], "uuid": "32737ca5f8d3fce8b35dc2f8c1d9684345bd63af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221243478&w=1200&r=LYNXMPEE0A1TP", "site_section": "http://feeds.reuters.com/Reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-puertorico-storm-energy/puerto-rico-governor-orders-probe-of-discovery-of-hurricane-recovery-materials-idUSKBN1F02VU", "country": "US", "domain_rank": 408, "title": "Puerto Rico governor orders probe of discovery of hurricane recovery materials", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T23:06:00.000+02:00", "replies_count": 0, "uuid": "32737ca5f8d3fce8b35dc2f8c1d9684345bd63af"}, "author": "", "url": "https://www.reuters.com/article/us-puertorico-storm-energy/puerto-rico-governor-orders-probe-of-discovery-of-hurricane-recovery-materials-idUSKBN1F02VU", "ord_in_thread": 0, "title": "Puerto Rico governor orders probe of discovery of hurricane recovery materials", "locations": [], "entities": {"persons": [{"name": "ricardo rossello", "sentiment": "none"}, {"name": "nick brown", "sentiment": "none"}], "locations": [{"name": "puerto rico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "prepa", "sentiment": "none"}], "organizations": [{"name": "u.s. army corps of engineers", "sentiment": "none"}, {"name": "army corps", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "department of justice", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 08 PM / Updated 23 minutes ago Puerto Rico governor orders probe of discovery of hurricane recovery materials Nick Brown 3 Min Read \nNEW YORK (Reuters) - Puerto Rico’s governor has ordered an investigation of materials discovered in a warehouse belonging to the U.S. territory’s electric authority that the U.S. Army Corps of Engineers said are critical to restoring power following September’s Hurricane Maria. \nGovernor Ricardo Rossello said in a statement on Thursday he is ordering the island’s Department of Justice to investigate whether “rules were violated and/or crimes were committed against the public interest” in the procurement and administration of the materials. \nIt is the latest headache for Puerto Rico over the response by its power authority, known as PREPA, to the September storm, which decimated the U.S. territory’s outdated electric grid so forcefully that 40 percent of its 3.4 million residents remain without power. \nThe Army Corps, which is in charge of grid repairs in Puerto Rico, on Saturday discovered a stock of transformers, splices and other materials in a warehouse at PREPA’s Palo Seco plant. The Army Corps said the materials were not being used, leading to some delays in power resurgence. \nPREPA refuted that, saying the items were consistently put to use, if not specifically for hurricane recovery. \nCarlos Monroig, a spokesman for PREPA, on Thursday said the materials were being used for “capital improvements.” In a separate statement in Spanish, PREPA said the materials had been used to build transmission lines, pursuant to bond issues carried out by past administrations to acquire the materials. \nArmy Corps spokeswoman Lynn Rose said the Corps began distributing the materials to its contractors on Saturday. \nThe items are “critical to the ongoing mission to restore power to Puerto Rico,” Rose said, declining to comment on Rossello’s referral to the Justice Department. \nPuerto Rico is struggling to recover from Maria, its worst disaster in 90 years, while at the same time navigating the largest government bankruptcy in U.S. history, with $120 billion in combined bond and pension debt. \nPREPA’s public image is still reeling from the revelation in the weeks after the storm that it had awarded a $300 million, no-bid grid repair contract to the tiny Montana firm Whitefish Energy Holdings. \nThat contract, later canceled by Rossello, led to a U.S. congressional investigation and the eventual resignation of ex-PREPA chief Ricardo Ramos. \nIn bankruptcy with some $9 billion of debt, PREPA has long been plagued by a shrinking workforce and sorely outdated infrastructure. \nMultiple debt restructuring deals with bondholders have fallen apart at the 11th hour. Reporting by Nick Brown; Editing by Leslie Adler", "external_links": [], "published": "2018-01-11T23:06:00.000+02:00", "crawled": "2018-01-11T23:19:36.028+02:00", "highlightTitle": ""}