{"organizations": [], "uuid": "82f5ed77d17cc8b888c35e22e25a60483938f825", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-skids-lower-as-euro-attention-turns-to-ecb-meeting-idUSL8N1PK1H7", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar skids lower as euro attention turns to ECB meeting", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:11:00.000+02:00", "replies_count": 0, "uuid": "82f5ed77d17cc8b888c35e22e25a60483938f825"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-skids-lower-as-euro-attention-turns-to-ecb-meeting-idUSL8N1PK1H7", "ord_in_thread": 0, "title": "FOREX-Dollar skids lower as euro attention turns to ECB meeting", "locations": [], "entities": {"persons": [{"name": "tommy wilkes", "sentiment": "none"}, {"name": "yuan", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}, {"name": "mnuchin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar slumps leaves greenback near fresh 3-year low\n* ECB to meet on Thursday amid rally in euro\n* Swiss Franc, Yuan hit highest levels since 2015\n* Graphic: World FX rates in 2018 tmsnrt.rs/2egbfVh\nBy Tommy Wilkes\nLONDON, Jan 25 (Reuters) - The dollar stumbled near multi-year lows on Thursday following the U.S. treasury secretary’s comments that he welcomed a weaker greenback, while attention turned to whether the European Central Bank can stomach a surging euro at its policy decision.\nThe ECB meets later on Thursday against a backdrop of a single currency that has gained more than 3 percent already this year after double digit gains last year amid a broad-based dollar sell-off that intensified on Wednesday when U.S. Treasury Secretary Steven Mnuchin said a weaker dollar was “good for us”.\nMnuchin, whose comments were a departure from traditional U.S. currency policy, said on Thursday that he was not concerned where the dollar was in the short term.\nAgainst a basket of currencies the dollar fell 0.1 percent , slightly off its overnight lows that marked a fresh three-year low.\nThe dollar was flat versus the euro as the surging single currency held above $1.24, a three-year high that could see ECB President Mario Draghi pour cold water on the view the bank is speeding towards a rate hike when he speaks later on Thursday.\n“It feels like what we expected to happen to the dollar over the entirety of 2018 has in fact transpired in first few trading weeks of the year,” analysts at ING said.\n“The burning question for FX markets at today’s ECB meeting is ”Will – and can – President Draghi talk the euro lower?“ For the past week, we’ve argued that in the current environment – there is very little the ECB can do to stem the tide of a stronger euro.”\nAnalysts note that the euro’s rise on a trade weighted basis has been far less substantial than versus the dollar, and with investor sentiment towards the region at its highest in years, the single currency is strengthening for the right reasons.\nStill, Draghi will likely seek to stop the euro from firming further, economists said.\nElsewhere, the dollar hit multi-year lows against several currencies.\nThe Swiss Franc hit its strongest level against the dollar since August 2015, and the Chinese yuan since November 2015.\nSterling gained 0.2 percent to $1.4261 after earlier shooting above $1.43 for a fresh high since the vote to leave the European Union in June, 2016.\nThe greenback had already been on the defensive on trade protectionism worries fanned by U.S. President Donald Trump’s decision to impose steep import tariffs on washing machines and solar panels earlier in the week.\n“Last week the dollar was under pressure on expectations towards the European Central Bank and Bank of Japan normalising monetary policy, but the bear trend has entered an entirely new phase after Mnuchin’s comments,” said Yukio Ishizuki, senior currency strategist at Daiwa Securities in Tokyo.\nWith a weaker dollar, the yen strengthened despite the Bank Of Japan keeping monetary settings unchanged on Tuesday and Governor Haruhiko Kuroda quashing market speculation of a shift away from ultra-easy policy later this year.\nThe U.S. currency was 0.1 percent lower at 109.100 yen , after sinking 1 percent the previous day to a four-month trough of 108.965. (Reporting by Tommy Wilkes; Editing by Toby Chopra)\n ", "external_links": ["http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T17:11:00.000+02:00", "crawled": "2018-01-26T21:28:33.012+02:00", "highlightTitle": ""}