{"organizations": [], "uuid": "3385c5b6253ec6f36425b66d1f44340a710f57a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222741021&w=1200&r=LYNXMPEE0G106", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-germany-poland/germany-and-poland-look-to-experts-on-reparations-row-idUKKBN1F61RO", "country": "US", "domain_rank": 408, "title": "Germany and Poland look to experts on reparations row", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T16:06:00.000+02:00", "replies_count": 0, "uuid": "3385c5b6253ec6f36425b66d1f44340a710f57a1"}, "author": "", "url": "https://uk.reuters.com/article/uk-germany-poland/germany-and-poland-look-to-experts-on-reparations-row-idUKKBN1F61RO", "ord_in_thread": 0, "title": "Germany and Poland look to experts on reparations row", "locations": [], "entities": {"persons": [{"name": "jacek czaputowicz", "sentiment": "none"}, {"name": "gabriel", "sentiment": "none"}, {"name": "sigmar gabriel", "sentiment": "none"}], "locations": [{"name": "poland", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "justice", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "min read  berlin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 08 PM / Updated 40 minutes ago Germany and Poland look to experts on reparations row Reuters Staff 3 Min Read \nBERLIN (Reuters) - Germany and Poland said on Wednesday they would consider setting up a commission to explore Polish calls for reparations for German actions during World War Two. \nPoland’s ruling Law and Justice (PiS) party has revived the issue of war compensation although the government has stopped short of making an official demand. \nNew Polish Foreign Minister Jacek Czaputowicz and his German counterpart, Sigmar Gabriel, said at their first meeting they did not want the issue to harm bilateral relations. \nBoth ministers stressed the importance of the relationship between the neighbours and EU partners but acknowledged that the question of reparations was not going away. \n“We have a clear legal position that all questions about reparations have been cleared up,” Gabriel said, adding that Poland’s democratically elected government accepted that in the early 1990s after the fall of Communism. \n“But there is no point in talking about the legal situation if there is a debate within society in a neighbouring country,” he said. German Foreign Minister Sigmar Gabriel meets his Polish counterpart Jacek Czaputowicz in Berlin, Germany, January 17, 2018. REUTERS/Fabrizio Bensch \n“One way ahead could be to ask experts to look at this,” he said, making clear there was no concrete plan so far and the makeup of such a panel would have to be decided but it may constitute historians and lawyers. \nSix million Poles, including three million Polish Jews were killed during the war and the capital Warsaw was razed to the ground in 1944 after a failed uprising in which 200,000 civilians died. \nAfter the war, the victorious Allies awarded Poland a large swathe of German land as compensation for Polish territory annexed by the Soviet Union in the east. \n“We want to have this debate,” said Czaputowicz, who said he accepted Gabriel’s suggestion. \nRelations between Poland and Germany have improved in recent years but have taken a knock since the nationalist-leaning PiS won a parliamentary election in 2015. \nThe PiS, which says Berlin wields too much influence within the European Union, frequently talks about Poland’s suffering under the German occupation in an effort it says aims to promote patriotism. Reporting by Madeline Chambers", "external_links": [], "published": "2018-01-17T16:06:00.000+02:00", "crawled": "2018-01-17T16:53:36.000+02:00", "highlightTitle": ""}