{"organizations": [], "uuid": "30ee0d338bb271c922b30fd4202aad1b9a635621", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218710571&w=1200&r=LYNXMPEE0101R", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-northkorea-missiles-moon/south-koreas-moon-says-better-inter-korean-relations-go-in-hand-with-resolving-north-korea-nuclear-issue-idUKKBN1ER03Y", "country": "US", "domain_rank": 408, "title": "South Korea's Moon says better inter-Korean relations go in hand with resolving North Korea nuclear issue", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T04:40:00.000+02:00", "replies_count": 0, "uuid": "30ee0d338bb271c922b30fd4202aad1b9a635621"}, "author": "", "url": "https://uk.reuters.com/article/uk-northkorea-missiles-moon/south-koreas-moon-says-better-inter-korean-relations-go-in-hand-with-resolving-north-korea-nuclear-issue-idUKKBN1ER03Y", "ord_in_thread": 0, "title": "South Korea's Moon says better inter-Korean relations go in hand with resolving North Korea nuclear issue", "locations": [], "entities": {"persons": [{"name": "moon", "sentiment": "negative"}, {"name": "moon jae-in", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "christine kim", "sentiment": "none"}, {"name": "li keqiang", "sentiment": "none"}, {"name": "michael perry", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "great hall of the people", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 2:44 AM / Updated 7 minutes ago U.S. warns North Korea against new missile test, plays down talks Rodrigo Campos , Christine Kim 5 Min Read \nUNITED NATIONS/SEOUL (Reuters) - The U.S. ambassador to the United Nations, Nikki Haley, warned North Korea on Tuesday against staging another missile test and said Washington would not take any talks between North and South Korea seriously if they did not do something to get Pyongyang to give up its nuclear weapons. \nHaley told reporters the United States was hearing reports that North Korea might be preparing to fire another missile. \n“I hope that doesn’t happen. But if it does, we must bring even tougher measures to bear against the North Korean regime,” Haley said. \nSouth Korea on Tuesday offered talks with North Korea next week, amid a tense standoff over Pyongyang’s nuclear and missile programmes, after North Korean leader Kim Jong Un said in a New Year’s Day speech that he was “open to dialogue” with Seoul. \nKim also said he was open to the possibility of North Korean athletes taking part in Winter Olympics South Korea hosts next month. \nAt the same time, he stressed that his country would push ahead with “mass producing” nuclear warheads in defiance of U.N. sanctions and that he had a nuclear button on his desk capable of launching missiles at the United States. \nHaley said the United States would not take talks seriously if they did not take steps toward banning North Korea’s nuclear weapons. \n“North Korea can talk to anyone they want, but the U.S. is not going to recognise it or acknowledge it until they agree to ban the nuclear weapons that they have,” she said. \nHaley gave no details of the missile test preparations. \nAnother U.S. official, who spoke on condition of anonymity, said there were indications that could point towards a potential missile launch “sooner rather than later,” but cautioned that such signs had been seen in the past and no test had resulted. \n‘DRIVE A WEDGE’ \nU.S. State Department spokeswoman Heather Nauert said North Korea might be “trying to drive a wedge of some sort” between the United States and South Korea and added that while it was up to Seoul to decide who it talked to: “We are very sceptical of Kim Jong Un’s sincerity in sitting down and having talks.” \nU.S. President Donald Trump, who has led a global drive to pressure North Korea through sanctions to give up development of nuclear-tipped missiles capable of hitting the United States, earlier held back judgement on Pyongyang’s offer to talk, saying on Twitter: FILE PHOTO - South Korea's President Moon Jae-In talks with China's Premier Li Keqiang (not seen) at the Great Hall of the People in Beijing, China December 15, 2017. REUTERS/Nicolas Asfouri/Pool \n”Rocket man now wants to talk to South Korea for first time. \n“Perhaps that is good news, perhaps not - we will see!” \nTrump has frequently derided Kim as “rocket man.” The U.S. president said sanctions and other pressures were starting to have a big impact on North Korea. \nKim and Trump have exchanged fiery barbs in the last year and the U.S. president has warned that the United States would have no choice but to “totally destroy” North Korea if forced to defend itself or its allies. \nNorth Korea regularly threatens to destroy the United States, South Korea and Japan and tested its most powerful intercontinental ballistic missile in November, which it said was capable of delivering a warhead anywhere in the United States. \nSouth Korea’s Unification Minister Cho Myong-gyon said the offer for high-level talks next Tuesday had been discussed with the United States. Nauert said she was not aware if the matter had been discussed in advance of the South Korean response. \nCho suggested the talks be held at the border village of Panmunjom and said they should be focussed on North Korea’s participation at the Olympics, but other issues would likely arise, including the denuclearisation of North Korea. \n“I repeat: The government is open to talking with North Korea, regardless of time, location and form,” Cho said. \nShould the talks be held, it would be the first such dialogue since a vice-ministerial meeting in December 2015. \nSouth Korean President Moon Jae-in welcomed Kim’s New Year \naddress and asked his government to move as quickly as possible to bring North Korea to the Olympics, but he stressed that an improvement in inter-Korean relations “cannot go separately with resolving North Korea’s nuclear programme”. \nChina, which has persistently urged a return to talks to ease tensions, said recent positive comments from North and South Korea were a good thing. \n“China welcomes and supports North Korea and South Korea taking earnest efforts to treat this as an opportunity to improve mutual relations, promote the alleviation of the situation on the Korean peninsula and realise denuclearisation on the peninsula,” Foreign Ministry spokesman Geng Shuang said. Reporting by Christine Kim, Jane Chung and Hyonhee Shin in Seoul, Michael Martina in Beijing, Doina Chiacu, David Brunnstrom, David Alexander and Arshad Mohammed in Washington, and Rodrigo Campos at the United Nations; Editing by Andrew Hay and Alistair Bell", "external_links": [], "published": "2018-01-02T04:40:00.000+02:00", "crawled": "2018-01-02T05:09:42.000+02:00", "highlightTitle": ""}