{"organizations": [], "uuid": "bc9883afc178178e517cc0ba42f707bdec2006fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GA861_wr_cli_ZG_20171228160155.jpg", "site_section": "http://feeds.marketwatch.com/marketwatch/topstories", "section_title": "MarketWatch.com - Top Stories", "url": "https://www.wsj.com/articles/do-states-have-a-role-in-making-climate-policy-1510628581", "country": "US", "domain_rank": 387, "title": "The Wall Street Journal: Should states have a role in climate policy?", "performance_score": 0, "site": "wsj.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T12:01:00.000+02:00", "replies_count": 0, "uuid": "bc9883afc178178e517cc0ba42f707bdec2006fa"}, "author": "", "url": "https://www.wsj.com/articles/do-states-have-a-role-in-making-climate-policy-1510628581", "ord_in_thread": 0, "title": "The Wall Street Journal: Should states have a role in climate policy?", "locations": [], "entities": {"persons": [{"name": "arnold sch", "sentiment": "negative"}, {"name": "arthur van benthem oren cass", "sentiment": "none"}, {"name": "brown", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "jerry brown", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published: Jan 4, 2018 10:32 a.m. ET Share \nTwo experts weigh in AFP/Getty Images Former Governor of California Arnold Schwarzenegger, left, and California Governor Jerry Brown, center, attend the One Planet Summit December 12, 2017 in Paris. Brown is one of several governors pushing climate policies as the federal government backs off. \nBy Arthur van Benthem Oren Cass \nWhen scientists from 13 U.S. federal agencies issued a report on climate change in November that drew a direct connection between human activity and global warming, it was a reminder of the turmoil that has surrounded environmental issues since President Donald Trump took office. \nThe Trump administration has rejected the international Paris climate accord, calling it a job-killing pact that impinges on U.S. sovereignty. It also has moved to repeal the domestic Clean Power Plan, following up on the president’s pledge to boost the energy industry by cutting regulation. \nIn response, several state governors have pledged to take the initiative on climate change by crafting their own strict emissions standards and pursuing the development of renewable energy with renewed vigor. \nSupporters say such actions not only will benefit the environment but also will spur the development of the green-technology industry. \nBut critics say that such state initiatives have a record of being ill conceived and ineffective, and that policies that run counter to the federal government’s stand on the climate in international talks are beyond the rightful scope of state governments. \nArthur van Benthem, an energy economist at the University of Pennsylvania’s Wharton School, argues for state action. Oren Cass, a senior fellow at the Manhattan Institute for Policy Research, makes the contrary case. YES: states can mitigate damage done by the federal government By Arthur van Benthem \nGiven the state of affairs in Washington, D.C., states should adopt their own policies to promote renewable energy and limit the emissions of greenhouse gases. \nAmbitious governments in China, Europe and elsewhere are ramping up pressure on their companies to become world leaders in green energy, electric vehicles and low-carbon technologies, in an effort to seize the golden opportunity that comes with the rise of the global green-tech market. \nMeanwhile, the U.S. federal government is backing away from those same policies, rejecting the Paris accord and hitting the brakes on fuel-economy rules and efforts to reduce carbon emissions under the Obama administration’s Clean Power Plan. \nAlso read: Clean-energy jobs seen rising to 24 million by 2030, international energy agency says \nSeveral states, spearheaded by the governors of California, New York and Washington, have pledged to fill the void in leadership by adopting their own strict climate policies. In principle, having a single federal policy is cheaper for industry and less prone to unintended consequences. But an unwieldy patchwork of 50 different state policies is an extremely unlikely outcome of state initiatives. \nMuch more likely, state efforts will eventually spur demand for strict federal policies, and operate at a regional level in the meantime. But they also could be short-circuited if the Clean Power Plan is replaced with weak federal regulation of carbon emissions that would preclude stricter state rules, or if the waiver that allows California to set vehicle standards that are tougher than federal regulations isn’t extended. \nIt is imperative that states be allowed to proceed unhindered. If they are, here are the highlights of what is likely to happen: two sets of vehicle regulations, as we have now for electric vehicles and local air pollution, and broad regional cap-and-trade systems to reduce emissions from electricity generation and heavy industry, like the ones already in place among the nine states in the Northeast or the California-Quebec-Ontario market. \nDon’t miss: Climate change has already cost the government $35 billion — here’s how much it will cost you \nThere would likely be two vehicle standards because under the Clean Air Act, California was granted a unique federal waiver to adopt stricter-than-federal vehicle policies, an acknowledgment of the state’s severe smog problems. Other states have a choice—follow California or stick with the federal standard. About a dozen states, representing some 40% of the U.S. population, have followed California’s lead on tailpipe emissions and electric-car regulations that exceed federal standards. \nOn fuel economy, when California set a tougher standard and 14 states followed, it led to an agreement among the Obama administration, states and auto makers on stricter federal standards. In exchange, California abandoned its own rule. The same could happen with regional cap-and-trade systems, which could be linked or subsumed under a federal trading system if they spur demand for a uniform approach. The governors of California and New York recently floated the idea of linking the two existing carbon markets. \nThose who criticize states for overreaching and moving contrary to federal policy should consider that state climate initiatives seem to fit seamlessly with the Environmental Protection Agency’s stated goal to return power to the states under Administrator Scott Pruitt. The EPA has applied that philosophy selectively, aiming to relieve states that have a limited appetite for environmental action from federal regulations, by backing out of the Clean Power Plan, but explicitly leaving open the possibility of denying California future requests for waivers on vehicle standards. \nThen there is the criticism that states’ efforts to promote renewable energy sources are far more expensive than continued reliance on nonrenewable sources for affordable, reliable power. That, too, doesn’t hold water. The costs of renewables are falling spectacularly, and setting goals for their adoption will foster further innovation in battery storage technologies. The move to renewables is inevitable, and other countries have already proven they can run their power grids with far more solar and wind than the U.S. \nFinally, letting the states drive policy is the only serious option to put the U.S. back on track in the global green-tech race. \nAlso read: With climate change and sprawling property development, wildfires are here to stay \nThe U.S. is at serious risk of losing its dominant position in this multitrillion-dollar and fast-growing market. For China and Europe, this is an unprecedented opportunity to run away with valuable patents, jobs and export markets. \nJust like our competitors, we need a supportive government that is willing to enforce policies to keep us at the cutting edge of green innovation. Now that the federal government has given up American leadership on climate, it is time to pass the baton to the states and let them pressure Washington into correcting a costly economic mistake. Arthur van Benthem is an energy economist at the Wharton School of the University of Pennsylvania. Email . NO: it won’t work—and this isn’t the states’ role anyway By Oren Cas", "external_links": [], "published": "2018-01-04T12:01:00.000+02:00", "crawled": "2018-01-04T12:06:08.003+02:00", "highlightTitle": ""}