{"organizations": [], "uuid": "71716a7135537cea7f72147c7c1807c288986704", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224801444&w=1200&r=LYNXMPEE0N15M", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/israel-palestinians-telecom/palestinians-get-3g-mobile-services-in-west-bank-idINKBN1FD1NT", "country": "US", "domain_rank": 408, "title": "Palestinians get 3G mobile services in West Bank", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T14:38:00.000+02:00", "replies_count": 0, "uuid": "71716a7135537cea7f72147c7c1807c288986704"}, "author": "", "url": "https://in.reuters.com/article/israel-palestinians-telecom/palestinians-get-3g-mobile-services-in-west-bank-idINKBN1FD1NT", "ord_in_thread": 0, "title": "Palestinians get 3G mobile services in West Bank", "locations": [], "entities": {"persons": [{"name": "ali sawafta", "sentiment": "none"}, {"name": "jawwal", "sentiment": "none"}], "locations": [{"name": "west bank", "sentiment": "none"}, {"name": "ramallah", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "world bank", "sentiment": "none"}, {"name": "wataniya mobile", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "palestinian authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RAMALLAH, West Bank (Reuters) - Palestinian cellular providers launched high-speed data services in the occupied West Bank on Wednesday, narrowing a technological gap with Israel after a lengthy and costly Israeli ban on the operation of local 3G networks.\nTwo Palestinian companies, Jawwal and Wataniya Mobile, will compete with the West Bank’s black market high-speed providers - Israeli cellular firms.\nIndustry experts said the Israeli providers already have a customer base of some 500,000 Palestinians using smuggled, pre-paid SIM cards that connect with 3G and 4G network cell towers in Israel and Jewish settlements.\nIsraeli cellular companies say they have no control over where the SIM cards - many of them purchased by Palestinians working in Israel and classified as illegal by the Palestinian Authority (PA) - are used.\nThe World Bank, in a 2016 report, estimated that Palestinian cellular companies lost between $436 million and $1.5 billion in potential revenue in 2013 to 2015 due to Israeli restrictions on frequencies and equipment imports, and unauthorised competition by Israeli operators.\n“We have launched the 3G network service in the West Bank, while the Gaza Strip is still deprived of it because of Israeli restrictions,” Ammar Aker, CEO of the Palestine Telecommunications Group (Paltel) that operates Jawwal, said in an interview with Reuters in his Ramallah office.\nA Palestinian woman uses her mobile phone in the West Bank city of Ramallah January 24, 2018. REUTERS/Mohamad Torokman The 3G is mobile phone technology that allows users to make calls and texts and gain high-speed access to the Internet. The 2G, the network in operation in Gaza, allows calls and limited data transmission.\nAker said some $40 million was invested in building a 3G infrastructure for the West Bank that includes 1,000 new cell towers. Jawwal says it has three million customers in Gaza and the West Bank, and Wataniya says it has 800,000.\nSlideshow (2 Images) Israel, where 3G networks went into service in 2004, withheld frequencies for the Palestinians for nearly 12 years. In November 2015, it agreed to allow 3G in the West Bank alone and not in Gaza, an enclave dominated by the Hamas Islamist group that advocates Israel’s destruction.\nUnder interim peace deals, Israel has final say in allocating radio frequencies in the Palestinian territories.\nThe World Bank report said that Israel has pointed to security concerns in imposing cellular spectrum and equipment importing restrictions on the Palestinians.\nJawwal’s general manager, Abdul Majeed Melhem, said Israeli approval of a 3G Palestinian network in the West Bank came only after Israeli cellular providers upgraded to 4G in 2014, which kept them a step ahead of the competition.\nAdditional reporting by Nidal al-Mughrabi in Gaza, Writing by Jeffrey Heller, Editing by Angus MacSwan\n ", "external_links": [], "published": "2018-01-24T14:38:00.000+02:00", "crawled": "2018-01-24T14:54:05.019+02:00", "highlightTitle": ""}