{"organizations": [], "uuid": "162eb9fd2d07a444997fc2f50c82db2882bf527a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-treasury-department-awards-monster-government-solutions-award-for-talent-acquisition-software-and-services.html", "country": "US", "domain_rank": 767, "title": "Treasury Department Awards Monster Government Solutions Award for Talent Acquisition Software and Services", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T17:00:00.000+02:00", "replies_count": 0, "uuid": "162eb9fd2d07a444997fc2f50c82db2882bf527a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-treasury-department-awards-monster-government-solutions-award-for-talent-acquisition-software-and-services.html", "ord_in_thread": 0, "title": "Treasury Department Awards Monster Government Solutions Award for Talent Acquisition Software and Services", "locations": [], "entities": {"persons": [], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "mclean", "sentiment": "none"}, {"name": "usajobs", "sentiment": "none"}], "organizations": [{"name": "enterprise business solutions", "sentiment": "none"}, {"name": "bpa", "sentiment": "none"}, {"name": "u.s. department of the treasury", "sentiment": "none"}, {"name": "careerconnector shared service center", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "monster hiring management enterprise", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MCLEAN, Va., Jan. 9, 2018 /PRNewswire/ -- Monster Government Solutions (MGS), a wholly-owned subsidiary of Monster Worldwide, today announced a five year Blanket Purchase Agreement (BPA) valued up to $51.4 Million to provide talent acquisition technology and services to the U.S. Department of the Treasury. The award, made by Treasury's Chief Information Office, Enterprise Business Solutions (EBS), continues Monster Government Solutions' 14-year relationship as a designated provider of software and services in support of Treasury's CareerConnector Shared Service Center.\nWith the award of the BPA, Monster will continue to support over twenty of Treasury's federal government customers who utilize Monster Hiring Management Enterprise for their talent acquisition. Monster Hiring Management software is a secure, comprehensive applicant tracking system, purpose-built to automate and accelerate the federal hiring process. Fully integrated with USAJOBS, HR Connect services, Government HRIS systems and assessments, the system provides applicants and hiring managers a simpler, easier, and faster way to navigate the federal government's hiring process.\nThe CareerConnector Product Suite is offered as an Office of Personnel Management (OPM) officially designated Human Resources Line of Business (HRLOB), Shared Service Center (SSC). OPM's designation enables Treasury to offer interoperable, portable and scalable HR/payroll solutions across the federal space.\nUnder the BPA, Monster will deliver talent acquisition functionality under a Software-as-a-Service (SaaS) model. With Monster Hiring Management Enterprise, federal agencies will be able to: produce job announcements; seamlessly integrate with HR Connect and non-Treasury services and other sites and back end systems; allow applicants to apply online; leverage a variety of integrated assessments; rate and rank applicants; apply Federal applicant eligibilities and preferences; allow applicants to self-schedule for recruitment or assessment events; send electronic status and task notifications to applicants, HR users and hiring managers; and produce a wide variety of reports to meet federal regulatory reporting requirements and track metrics on recruiting activities.\nAgencies can also subscribe to Monster's Position Classification system, which enables them to move from a static Position Description library to a standardized online classification solution. Monster's easy-to-use PD builder wizard helps both expert and novice users build high-quality, federally compliant classification documents. The system automatically recommends the right series and grade, based on the duties and factor levels selected. The Position Classification system fosters collaboration between classifiers, HR, and hiring managers, with dashboards, notifications, an audit log, and the ability to compare and track changes.\nIn addition to its technology suite, Monster Government Solutions will continue to provide customer support and training services.\nAbout Monster Government Solutions\nFor 15 years, Monster Government Solutions has been working with leaders in government and education. Along the way, we changed the way people look for government jobs and we constantly strive to make a difference in the lives of people across the country, the way employers look for people, and how organizations connect with their target audiences. Our software solutions also vastly improve the recruitment experience by increasing speed-to-hire and accelerating the onboarding process, so new employees become more productive, faster. More than 60 federal government agencies rely on Monster's federal products and services every day, including 14 of 15 cabinet-level agencies and all five branches of the uniformed armed services. Monster Government Solutions, a wholly owned subsidiary of Monster Worldwide, Inc., is a U.S. company with offices in McLean, Virginia.\nAbout Monster Worldwide\nMonster Worldwide, Inc. is a global leader in connecting people to jobs, wherever they are. For more than 20 years, Monster has helped people improve their lives with better jobs, and employers find the best talent. Today, the company offers services in more than 40 countries, providing some of the broadest, most sophisticated job seeking, career management, recruitment and talent management capabilities. Monster continues its pioneering work of transforming the recruiting industry with advanced technology using intelligent digital, social, and mobile solutions, including our flagship website monster.com ® and a vast array of products and services. For more information, visit monster.com/about .\nView original content with multimedia: http://www.prnewswire.com/news-releases/treasury-department-awards-monster-government-solutions-award-for-talent-acquisition-software-and-services-300579686.html\nSOURCE Monster Worldwide, Inc.", "external_links": ["https://urldefense.proofpoint.com/v2/url?u=http-3A__www.monster.com_about&d=DwMFAg&c=9wxE0DgWbPxd1HCzjwN8Eaww1--ViDajIU4RXCxgSXE&r=5i1svJK_mH0pTfOzZpkuJOEqwzCPJ4lVvI1hsvL-zek&m=6xiRQc5rK0mFL-WgvsAYhhXpduk05lLT97wHH2RoCdA&s=aVZmVxPAmgBceu18GhpyTGudqqztUJitCW4dfARhO5o&e=", "https://urldefense.proofpoint.com/v2/url?u=http-3A__www.monster.com_&d=DwMFAg&c=9wxE0DgWbPxd1HCzjwN8Eaww1--ViDajIU4RXCxgSXE&r=5i1svJK_mH0pTfOzZpkuJOEqwzCPJ4lVvI1hsvL-zek&m=6xiRQc5rK0mFL-WgvsAYhhXpduk05lLT97wHH2RoCdA&s=3VwGTfufX_bdLQ8Ep3E2xCDqDG0YmGs_0ZKJ-811oQ8&e=", "http://www.prnewswire.com/news-releases/treasury-department-awards-monster-government-solutions-award-for-talent-acquisition-software-and-services-300579686.html"], "published": "2018-01-09T17:00:00.000+02:00", "crawled": "2018-01-09T19:04:54.051+02:00", "highlightTitle": ""}