{"organizations": [], "uuid": "6ef47bcfd931cf47496c653a6b355702d0e9e717", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-latest-peo-pulse-survey-shows-sustained-growth-for-peo-industry.html", "country": "US", "domain_rank": 767, "title": "Latest PEO Pulse Survey Shows Sustained Growth For PEO Industry", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T22:13:00.000+02:00", "replies_count": 0, "uuid": "6ef47bcfd931cf47496c653a6b355702d0e9e717"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-latest-peo-pulse-survey-shows-sustained-growth-for-peo-industry.html", "ord_in_thread": 0, "title": "Latest PEO Pulse Survey Shows Sustained Growth For PEO Industry", "locations": [], "entities": {"persons": [{"name": "pat cleary", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "alexandria", "sentiment": "none"}], "organizations": [{"name": "national association", "sentiment": "negative"}, {"name": "napeo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ALEXANDRIA, Va., Jan. 15, 2018 /PRNewswire-USNewswire/ -- A new survey by the National Association of Professional Employer Organizations (NAPEO) shows that the PEO industry continued to grow in the third quarter of 2017. PEOs provide HR services to small and mid-sized businesses. Industry executives also expect that that pattern will continue over the next year, with 84% reporting a likely increase in the number of worksite employees, with 33% forecasting a significant increase.\nThe quarterly survey, conducted in October 2017 by Industry Insights, also showed that PEO revenues, gross profits, operating income, and average number of clients all increased in the third quarter of 2017, compared to the third quarter of 2016. Previous surveys have shown similar results.\n\"This most recent survey demonstrates a continued pattern of sustained, vibrant growth by PEOs,\" said NAPEO President & CEO Pat Cleary. \"It's clear that more and more small and mid-sized businesses have realized that using a PEO is good for their business and their employees. PEOs deliver enormous value to businesses by providing HR services and solutions that they would otherwise be unable to afford.\"\nA total of 50 PEO executives responded to the survey, which is conducted each quarter. The typical responding PEO has 22 worksite employees per client. Survey respondents indicated the following:\n3 rd quarter revenue increased somewhat when compared to 3 rd quarter 2016 The annual wage per worksite employee increased over prior year The average number of worksite employees (WSEs) stayed about the same over prior year Gross profit for the 3 rd quarter increased somewhat over prior year Operating income for the 3 rd quarter increased somewhat over prior year Number of internal employees stayed about the same Number of clients increased somewhat Number of workers' comp claims reported to carriers remained about the same\nComplete PEO Pulse Survey results .\nAbout NAPEO\nThe National Association of Professional Employer Organizations (NAPEO) is The Voice of the PEO Industry TM and represents about 85 percent of the industry's estimated $136-$152 billion in gross revenues. NAPEO has some 250 PEO members that provide payroll, benefits, and other HR services to between 156,000 to 180,000 businesses employing 2.7 and 3.4 million people. An additional 200 companies that provide services to PEOs are associate members of NAPEO. For more information, please visit www.napeo.org .\nView original content: http://www.prnewswire.com/news-releases/latest-peo-pulse-survey-shows-sustained-growth-for-peo-industry-300582641.html\nSOURCE National Association of Professional Employer Organizations (NAPEO)", "external_links": ["http://www.napeo.org/", "http://www.prnewswire.com/news-releases/latest-peo-pulse-survey-shows-sustained-growth-for-peo-industry-300582641.html", "https://www.napeo.org/docs/default-source/pulse-survey/napeo-pulse-industry-results-trend-report.pdf?sfvrsn=2", "https://www.napeo.org/docs/default-source/pulse-survey/napeo-pulse-industry-results-q3-2017.pdf?sfvrsn=2"], "published": "2018-01-15T22:13:00.000+02:00", "crawled": "2018-01-16T00:29:56.000+02:00", "highlightTitle": ""}