{"organizations": [], "uuid": "f3b98f46f80e144c839a552dac2b404948be7554", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/ico-ernstyoung/more-than-10-percent-of-3-7-bln-raised-in-icos-has-been-stolen-ernst-young-idUSL1N1PE19U", "country": "US", "domain_rank": 408, "title": "More than 10 percent of $3.7 bln raised in ICOs has been stolen - Ernst & Young", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.021, "site_type": "news", "published": "2018-01-22T21:00:00.000+02:00", "replies_count": 0, "uuid": "f3b98f46f80e144c839a552dac2b404948be7554"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/ico-ernstyoung/more-than-10-percent-of-3-7-bln-raised-in-icos-has-been-stolen-ernst-young-idUSL1N1PE19U", "ord_in_thread": 0, "title": "More than 10 percent of $3.7 bln raised in ICOs has been stolen - Ernst & Young", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ernst & young new york", "sentiment": "negative"}, {"name": "ernst & young", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan 22 (Reuters) - More than 10 percent of funds raised through “initial coin offerings” are lost or stolen in hacker attacks, according to new research by Ernst & Young that delves into the risks of investing in cryptocurrency projects online.\nThe professional services firm analyzed more than 372 ICOs, in which new digital currencies are distributed to buyers, and found that roughly $400 million of the total $3.7 billion funds raised to date had been stolen, according to research published on Monday.\nPhishing was the most widely used hacking technique for ICOs, with hackers stealing up to $1.5 million in ICO proceeds per month, according to the report.\nThe research also noted that the volume of ICOs has been slowing since late 2017. Less than 25 percent of ICOs reached their target in November, compared with 90 percent in June.\nThe study comes amid a cryptocurrency investing craze, with young companies raising hundreds of millions of dollars online to fund their projects, with often little more than a handful of employees and a business plan outlined in a so-called “white paper”.\nThe challenges faced by more recent ICOs in reaching their targets are partly attributable to the lower quality of projects, as well as issues that have emerged around earlier projects, said Paul Brody, global innovation leader for blockchain technology at Ernst & Young (EY).\n“The volume just exploded, people raised their fundraising goals and the quality just dropped,” Brody said in an interview.\n“We were shocked by the quality of some of the white papers, we see clear coding errors and we see conflicts of interest between the companies issuing tokens and the community of token holders.”\nIn ICOs companies typically raise money to build new technology platforms or to fund businesses that use cryptocurrencies, also called tokens, and blockchain, the software that underpins them. Yet for many of these projects the need for blockchain and cryptocurrencies is often unjustified, according to EY.\nIt also noted valuations of ICO tokens are often driven by “fear of missing out”, or “FOMO”, and have no connection to market fundamentals such as project development. EY said “FOMO” has led investors to pour money into ICOs at record speeds, with the 10 shortest lasting ICOs attracting $300,000 per second on average.\nThe study also found several instances in which the underlying software code of a project contained hidden investment terms that had not been disclosed, or contradicted previous disclosures. For example, a whitepaper might state that there will be no further issuance of a cryptocurrency, while the code might leave that option open. (Reporting by Anna Irrera)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T21:00:00.000+02:00", "crawled": "2018-01-23T17:46:36.021+02:00", "highlightTitle": ""}