{"organizations": [], "uuid": "6be560318c8a77363d5e0b200c7cd30ffc301aea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/28/104617419-RTR2RYAD.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/oxfam-report-in-2017-there-was-a-new-billionaire-every-2-days.html", "country": "US", "domain_rank": 767, "title": "Oxfam report: In 2017 there was a new billionaire every 2 days", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.093, "site_type": "news", "published": "2018-01-22T19:23:00.000+02:00", "replies_count": 0, "uuid": "6be560318c8a77363d5e0b200c7cd30ffc301aea"}, "author": "Catherine Clifford", "url": "https://www.cnbc.com/2018/01/22/oxfam-report-in-2017-there-was-a-new-billionaire-every-2-days.html", "ord_in_thread": 0, "title": "Oxfam report: In 2017 there was a new billionaire every 2 days", "locations": [], "entities": {"persons": [{"name": "forbes", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}], "organizations": [{"name": "oxfam", "sentiment": "negative"}, {"name": "credit suisse", "sentiment": "none"}, {"name": "credit suisse global wealth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Around the world, there was a new billionaire every two days in 2017.\nThat's according to a report published Monday by the global charity Oxfam . The goal of the report, which is called \"Reward Work, Not Wealth,\" is to call attention to wealth inequality.\nThere are 2,043 dollar billionaires in the world, the report finds.\nThe growth in wealth of the world's billionaires is eye-popping: Wealth of billionaires increased by $762 billion in 2017 — a sum which is enough to end extreme poverty around the world seven times over, the report says.\nAnd 82 percent of the total wealth created wealth went to the top 1 percent while the bottom 50 percent of individuals saw no increase in their wealth at all.\nOxfam used data from Forbes and the Credit Suisse Global Wealth datebook for its calculations. Wealth is calculated as an individual's assets minus debts.\nA mere 42 of the world's wealthiest people have the same amount of wealth as the bottom 3.7 billion people, according to new data from Credit Suisse, which the report highlights.\nAnd in the United States, the three richest people — Bill Gates, Jeff Bezos and Warren Buffett — have more wealth than half the population of the US combined. That's according to a November report from from the progressive Washington, D.C.-based think tank Institute for Policy Studies, which the Oxfam study also points to.\nshow chapters Jeff Bezos is the world’s richest person      10:06 AM ET Thu, 27 July 2017 | 01:05 Of particular note, nine out of 10 of the billionaires are men.\nIt's nearly impossible for workers to catch up with the world's wealthiest. To highlight the disparity, Oxfam makes the following comparison: Zara founder Amancio Ortega made $1.59 billion in share dividends in 2016. Stefan Perssin, the son of the founder of H&M, made $805 million in share dividends in 2016. A woman named Anju in Bangladesh, who sews clothes 12 hours a day for export, makes just over $900 a year. Zara and H&M often have the clothes they sell made in Bangladesh . \nSuch extreme levels of wealth inequality must be fixed, according to one of the richest people in the world, Warren Buffett . The investor and CEO of Berkshire Hathaway is currently worth almost $92 billion , according to Forbes.\n\"The real problem, in my view, is — this has been — the prosperity has been unbelievable for the extremely rich people,\" says Buffett on PBS Newshour in June, speaking about the U.S. economy. \"This has been a prosperity that's been disproportionately rewarding to the people on top.\n\"The economy is doing well, but all Americans aren't doing well,\" says Buffett.\nAutomation and digitization of the workforce is leaving workers behind in the United States, says Buffett. \n\"That's the problem that has to be addressed, because when you have something that's good for society, but terribly harmful for given individuals, we have got to make sure those individuals are taken care of.\"\nSee also: \nInequality gap widens as 'world's richest 1% get 82% of the wealth,' Oxfam says \nBill Gates, Jeff Bezos and Warren Buffett have more wealth than half the population of the US combined \nBillionaire Warren Buffett says 'the real problem' with the US economy is people like him \nshow chapters Billionaire Warren Buffett says 'the real problem' with the US economy is people like him      1:52 PM ET Tue, 27 June 2017 | 00:45 Like this story? Like CNBC Make It on Facebook .", "external_links": [], "published": "2018-01-22T19:23:00.000+02:00", "crawled": "2018-01-22T19:28:05.017+02:00", "highlightTitle": ""}