{"organizations": [], "uuid": "d462bdb931a4d54fbc7e72a24bf88eeb243b0315", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/08/104639481-NUP_178469_1618.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/doublelines-gundlach-still-betting-on-commodities.html", "country": "US", "domain_rank": 767, "title": "DoubleLine's Gundlach still betting on commodities", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.233, "site_type": "news", "published": "2018-01-31T01:38:00.000+02:00", "replies_count": 0, "uuid": "d462bdb931a4d54fbc7e72a24bf88eeb243b0315"}, "author": "Evelyn Cheng", "url": "https://www.cnbc.com/2018/01/30/doublelines-gundlach-still-betting-on-commodities.html", "ord_in_thread": 0, "title": "DoubleLine's Gundlach still betting on commodities", "locations": [], "entities": {"persons": [{"name": "gundlach", "sentiment": "negative"}, {"name": "jeffrey gundlach", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "doubleline capital lp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Gold DoubleLine's Gundlach still betting on commodities \"While stocks have been doing great, commodities have been doing well too,\" DoubleLine CEO Jeffrey Gundlach said on a webcast. There's \"quite a lot of high octane [gas] in the commodities vs. stocks tank.\" The investor noted Tuesday that global growth is causing demand for commodities, while the weaker U.S. dollar should also help. \"Usually when you get a bad year in the dollar, it's followed by one or two more bad years,\" Gundlach said. Jeffrey Gundlach, founder of DoubleLine Capital LP. \nDoubleLine CEO Jeffrey Gundlach said Tuesday he expects commodities to run higher versus stocks. \n\"While stocks have been doing great, commodities have been doing well, too,\" Gundlach said on a webcast. There's \"quite a lot of high octane [gas] in the commodities vs. stocks tank.\" \nGundlach said in mid-December on CNBC's \" Halftime Report \" that his best investment idea for 2018 is commodities, such as oil and metals. His thesis is that the relative performance of stocks to commodities goes through defined cycles, and that right now commodities are poised for a period of outperformance compared with stocks. \nThe investor noted Tuesday that global growth is causing demand for commodities, while the weaker U.S. dollar should also help. \n\"Usually when you get a bad year in the dollar, it's followed by one or two more bad years,\" Gundlach said. \nThe U.S. dollar index dropped to its lowest in more than three years last week. \nMeanwhile, oil prices have recovered over the last two years from a slump in 2014 and 2015. U.S. crude oil futures for March delivery hit a high of $66.66 last week, their highest since Dec. 5, 2014. \nWhile Gundlach did not comment Tuesday on oil prices, DoubleLine's Deputy Chief Investment Officer Jeffrey Sherman said in response to a question on the webcast that \"there is the structural support for oil prices to be where they are\" and that \"the energy market does still look pretty attractive.\" \nThe DoubleLine Strategic Commodity Fund I-shares gained 9.13 percent in 2017, versus the Bloomberg Commodity Index's 1.7 percent rise. \nU.S. stocks tumbled Tuesday, with the S&P 500 falling more than 1 percent in its worst day since August.", "external_links": [], "published": "2018-01-31T01:38:00.000+02:00", "crawled": "2018-01-31T01:38:02.000+02:00", "highlightTitle": ""}