{"organizations": [], "uuid": "c3cc298876deac45a58f159e8215b616580687f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/italy-factors-jan-15/italy-factors-to-watch-on-jan-15-idUSL8N1P72HO", "country": "US", "domain_rank": 408, "title": "Italy - Factors to watch on Jan. 15", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-15T13:01:00.000+02:00", "replies_count": 0, "uuid": "c3cc298876deac45a58f159e8215b616580687f8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/italy-factors-jan-15/italy-factors-to-watch-on-jan-15-idUSL8N1P72HO", "ord_in_thread": 0, "title": "Italy - Factors to watch on Jan. 15", "locations": [], "entities": {"persons": [{"name": "silvio berlusconi", "sentiment": "none"}, {"name": "berlusconi", "sentiment": "none"}, {"name": "francesco greco", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}, {"name": "milan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "oecd", "sentiment": "none"}, {"name": "la stampa", "sentiment": "none"}, {"name": "easyjet", "sentiment": "none"}, {"name": "mediaset", "sentiment": "none"}, {"name": "ac milan", "sentiment": "none"}, {"name": "air france", "sentiment": "none"}, {"name": "bank of italy", "sentiment": "none"}, {"name": "alitalia air france", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The following factors could affect Italian markets on Monday.\nReuters has not verified the newspaper reports, and cannot vouch for their accuracy. New items are marked with (*).\nFor a complete list of diary events in Italy please click on .\nPOLITICS Milan’s chief prosecutor said on Saturday his office was not investigating the sale of AC Milan soccer club by Silvio Berlusconi, leader of the biggest political party on the centre-right, to a Chinese group last year.\nProsecutor Francesco Greco made the statement after La Stampa newspaper reported that his office had opened a probe into the transaction.\nBerlusconi denied the report in an interview on his Mediaset TV network on Sunday.\nECONOMY OECD releases November composite leading indicator (1100 GMT).\nBank of Italy releases November data on public finances, state borrowing and debt.\nCOMPANIES ALITALIA Air France denied on Saturday that it had made an offer to buy the struggling airline, after Italy’s industry minister said the French flag carrier had made a joint bid with budget airline Easyjet.\nAir France has expressed interest in Alitalia but has not made a formal offer, Corriere della Sera reported on Sunday, citing banking sources in contact with the French company. Several other papers reported that Air France was interested in buying Alitalia but had made no offer yet.\nSome of Lufthansa’s executives want to drop their bid for the Italian airline, or at least put it off until after a March 4 election, Il Messaggero reported on Saturday, without citing sources.\n(*) ATLANTIA The Italian motorway operator is in talks with India’s IRB Infrastructure Developers to acquire road assets in a $2 billion deal, the Economic Times reported.\n(*) FIAT CHRYSLER AUTOMOBILES U.S. tax cuts could add about $1 billion a year to the car maker’s profits, CEO Sergio Marchionne told Bloomberg News in an interview, adding FCA could double profits by 2022 thanks to Jeep conquering one fifth of the SUV market.\nHe ruled out staying on as FCA’s CEO after early 2019 and reiterated his successor would be internal, but added his job at Ferrari was not done yet. About FCA’s search for a partner, Marchionne said: “If nobody wants you, then celibacy may be the only option. ... I adjusted to the notion of celibacy.”\nTELECOM ITALIA The phone group has pushed back a deadline for binding bids for its broadcasting services unit Persidera to give potential suitors more time to prepare offers, sources close to the matter said.\n(*) In order to help settle a legal spat between Vivendi and Mediaset over a failed pay-TV deal, Telecom Italia is preparing to approve a new version of its contents accord with Vivendi’s Canal+, Il Sole 24 Ore reported on Saturday. TIM, which would invest 460 million euros over six years to buy contents, would have 60 percent of the j-v with the rest split equally between Canal+ and Mediaset, the paper said.\nYOOX NET-A-PORTER Board meeting on FY preliminary results (net revenues).\nOVS European private equity firm BC Partners is considering selling its 17.8 percent stake in the chain of clothing shops to a long-term investor that could guarantee stability for the business, Corriere della Sera reported on Sunday without citing sources.\nFor Italian market data and news, click on codes in brackets:\n20 biggest gainers (in percentage)\n20 biggest losers (in percentage)\nFTSE IT allshare index\nFTSE Mib index\nFTSE Allstars index...\nFTSE Mid Cap index....\nBlock trades\nStories on Italy IT-LEN\nFor pan-European market data and news, click on codes in brackets: European Equities speed guide FTSEurofirst 300 index DJ STOXX index Top 10 STOXX sectors Top 10 EUROSTOXX sectors Top 10 Eurofirst 300 sectors Top 25 European pct gainers Top 25 European pct losers Main stock markets: Dow Jones Wall Street report Nikkei 225 Tokyo report FTSE 100 London report Xetra DAX Frankfurt market stories CAC-40 Paris market stories... World Indices Reuters survey of world bourse outlook Western European IPO diary European Asset Allocation Reuters News at a Glance: Equities Main currency report:\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T13:01:00.000+02:00", "crawled": "2018-01-16T13:14:21.002+02:00", "highlightTitle": ""}