{"organizations": [], "uuid": "7557b2619a5ec6dab1a54589c1d0501ef20242d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000238/device/rss", "section_title": "Mark Zuckerberg", "url": "https://www.cnbc.com/2018/01/19/reuters-america-update-3-facebook-to-prioritize-trustworthy-news-based-on-surveys.html", "country": "US", "domain_rank": 767, "title": "UPDATE 3-Facebook to prioritize 'trustworthy' news based on surveys", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T02:36:00.000+02:00", "replies_count": 0, "uuid": "7557b2619a5ec6dab1a54589c1d0501ef20242d9"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/reuters-america-update-3-facebook-to-prioritize-trustworthy-news-based-on-surveys.html", "ord_in_thread": 0, "title": "UPDATE 3-Facebook to prioritize 'trustworthy' news based on surveys", "locations": [], "entities": {"persons": [{"name": "mark zuckerberg", "sentiment": "none"}, {"name": "zuckerberg", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds reaction from newspaper trade group, background)\nSAN FRANCISCO, Jan 19 (Reuters) - Facebook Inc will prioritize \"trustworthy\" news in its feed of social media posts, using member surveys to identify high-quality outlets and fight sensationalism and misinformation, Chief Executive Mark Zuckerberg said on Friday.\nThe company, which has more than 2 billion monthly users, said its members, not experts or Facebook executives, would determine how news outlets rank in terms of trustworthiness. It also said it would put an emphasis on local news sources.\nThe move is likely to send shockwaves through the media landscape in nearly every country, given the ubiquity of the world's largest social network and how central it has become in some places to the distribution of news.\nZuckerberg said on Friday he expects recently announced changes to shrink the amount of news on Facebook by 20 percent, to about 4 percent of all content from 5 percent currently.\nThe chief executive outlined the shakeup in a post on Facebook, saying that starting next week the News Feed, the company's centerpiece product, would prioritize \"high quality news\" over less trusted sources.\n\"There's too much sensationalism, misinformation and polarization in the world today,\" Zuckerberg wrote.\n\"Social media enables people to spread information faster than ever before, and if we don't specifically tackle these problems, then we end up amplifying them,\" he wrote.\nThe quality of news on Facebook has been called into question after alleged Russian operatives, for-profit spammers and others spread false reports on the site, including during the 2016 U.S. election campaign.\nTwo years ago, Facebook users saw hoaxes saying Pope Francis endorsed Republican Donald Trump for U.S. president and that a federal agent investigating Democrat Hillary Clinton was found dead. Facebook initially proposed fighting false stories by letting users flag them.\nThe change will affect not only links posted by news outlets but also news stories that individuals share, Facebook said.\nNews organizations immediately began considering how they would fare in the ranking.\nFIGHTING FAKE NEWS\nThe trust ranking will help to address fake news stories, said David Chavern, president of the News Media Alliance, a trade group for old-line U.S. newspapers.\n\"For some time, we have argued that Facebook should give priority to news from trusted sources,\" he said in a statement.\nTom Gara, opinion editor at BuzzFeed News, wrote on Twitter that he expected partisan outlets to fare worse: \"This sounds like extremely good news for news publishers that aren't hated by one side or the other.\"\nFacebook has had a stormy relationship with news organizations, especially those with strong political leanings. In 2016, Republican U.S. lawmakers expressed concern that Facebook, based in liberal Northern California, was suppressing news stories of interest to conservative readers.\nFacebook said that ranking by trustworthiness was not intended to directly impact any specific groups of publishers based on their size or ideology.\nZuckerberg said he settled on the idea of surveying Facebook users after rejecting having the company itself rank news outlets' trustworthiness.\n\"We decided that having the community determine which sources are broadly trusted would be most objective,\" he wrote in his post.\nFacebook said it did not plan to release the survey results because they will represent an incomplete picture of how a story's position in a person's feed is determined.\nMany factors determine where a post appears in a Facebook user's News Feed such as subject of the post, who wrote it and who is commenting on it.\nLast week, Zuckerberg said the company would change the way it filters posts and videos on News Feed to prioritize what friends and family share.\nNews Corp, owner of the New York Post and other outlets, responded to the earlier Facebook announcement with a pledge to look for \"any signs that the weighting of news sites is politically motivated.\"\nThe Rupert Murdoch-led company had no immediate comment on Friday.\n(Reporting by David Ingram; Editing by Leslie Adler and Cynthia Osterman)", "external_links": [], "published": "2018-01-20T02:36:00.000+02:00", "crawled": "2018-01-20T03:13:08.093+02:00", "highlightTitle": ""}