{"organizations": [], "uuid": "178e6320a1a0539c0e6d64f5c811f616bc96f784", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/china-economy-tech-analysis/analysis-china-goes-on-tech-hiring-binge-and-wages-soar-closing-gap-with-silicon-valley-idINKBN1FD382", "country": "US", "domain_rank": 408, "title": "Analysis: China goes on tech-hiring binge and wages soar, closing gap with Silicon Valley", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T01:07:00.000+02:00", "replies_count": 0, "uuid": "178e6320a1a0539c0e6d64f5c811f616bc96f784"}, "author": "", "url": "https://in.reuters.com/article/china-economy-tech-analysis/analysis-china-goes-on-tech-hiring-binge-and-wages-soar-closing-gap-with-silicon-valley-idINKBN1FD382", "ord_in_thread": 0, "title": "Analysis: China goes on tech-hiring binge and wages soar, closing gap with Silicon Valley", "locations": [], "entities": {"persons": [{"name": "stella qiu", "sentiment": "none"}, {"name": "elias glenn", "sentiment": "none"}, {"name": "thomas liang", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "hk", "sentiment": "none"}, {"name": "baidu", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "tencent", "sentiment": "none"}, {"name": "alibaba", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 11:07 PM / Updated 10 hours ago China goes on tech-hiring binge and wages soar, closing gap with Silicon Valley Stella Qiu , Elias Glenn 6 Min Read \nBEIJING (Reuters) - China’s war for technology talent is intensifying. Tens of thousands of people are being hired to shore up cybersecurity, help censor online content, and try to make China No.1 in the application of artificial intelligence (AI), as capital pours into both start-ups and more mature businesses at a time when the government is demanding rapid development. \n“Companies are well-funded and are in serious competition for talent,” said Thomas Liang, a former executive at Chinese search giant Baidu who is now running an AI–focussed fund. He said that startups in hot sectors like AI often have to offer 50-100 percent pay raises to attract employees away from established technology firms. \nChina’s emergence as a global centre for technology, with champions such as Alibaba and Tencent now worth more than a trillion dollars combined, has led to a hiring boom and wage growth that starts to puts salaries for the top talent within striking distance of those offered in Silicon Valley. \nAnd while that should please the Chinese government as it seeks to create higher-paying jobs and move up the value-chain, it could also add to income inequality in China as wages in non-tech jobs lag, and as the sector’s recruitment and income gains tend to be concentrated in the biggest cities such as Beijing and Shenzhen. \nTechnology is certainly a major driver of growth in China. Output in China’s information technology and software sector expanded by 33.8 percent year-on-year in the fourth quarter, compared with 29 percent growth in the third quarter, according to data from the statistics bureau. \nIn China, top graduates working on AI can command salaries of 300,000 yuan ($47,066) to 600,000 yuan ($94,132) a year, according to tech recruitment website 100offer.com, while team leaders with three-to-five years of experience can make more than 1.5 million yuan ($235,331) annually. Many of these jobs are in Beijing or Shenzhen. \nLiang estimates salaries in the industry have roughly doubled since 2014. \nBy comparison, an AI researcher in San Francisco makes an average of $112,659 a year, and a machine learning engineer in the same city an average $150,815, according to job search site Indeed.com. \nFor Chinese software engineers who have studied in the U.S. but now worry about the impact of U.S. President Donald Trump’s immigration policies on their chances of retaining visas, returning home is becoming more appealing. Chinese tech firms say they actively recruit Chinese students from U.S. colleges, and many have opened offices in Silicon Valley to attract top talent. \nThe boom in AI work is prompting some engineers to retrain in China. \n“I doubled my salary by making the AI jump,” said Song, a 26-year-old AI-engineer in Beijing who now makes around $55,000 per year after taking AI training courses in his own time. \nAnd as a 26-year-old artificial intelligence engineer working for Beijing Bytedance Technology Co, maker of the Chinese news aggregator app Toutiao, George is pulling down an annual salary of around $60,000 but says he may jump ship if something better comes along. \nBoth Song and George asked that their full names not be used. A robotic arm assembles an electronic calculator at the Convention on the Exchange of Overseas Talents in Guangzhou, Guangdong province, China December 20, 2017. REUTERS/Stringer/Files \nThe money is still pouring in. More than $65 billion of venture capital investments were made in Greater China last year, up 35 percent from a year earlier, according to research firm Preqin, an all-time high and second only to North America, with $77 billion. \nChinese President Xi Jinping said at the Communist Party Congress held last year that China will push for the integration of the internet, big data and AI with the traditional economy. \nThis is all part of a government drive to move the Chinese economy up the value chain with a particular emphasis on areas such as information technology, robotics and energy saving vehicles. \nThe government is also behind a massive push to use facial recognition and other technologies to track people on a national scale - the authorities say that it will improve security and reduce crime, while human rights advocates claim it is part of a giant surveillance state and will be used against activists and dissidents. \nAmong the fastest-growing tech companies is Beijing-based AI startup Cloudminds. It plans to expand headcount by almost 40 percent this year from its current 400 staffers, human resources director Arina Li told Reuters. FILE PHOTO: China's President Xi Jinping shown on a screen in front of logos of China's leading Internet companies Tencent, Baidu, Alibaba Group during the fourth World Internet Conference in Wuzhen, Zhejiang province, China, December 4, 2017. REUTERS/Aly Song/File Photo \nThe tech boom has spilt over to inland cities with Alibaba setting up a regional headquarters in Xian in the northwest while American tech giants like Apple and Qualcomm have invested heavily in Guizhou province in the southwest. SALARIES RISING \nThe technology hiring and wage rises are starting to show up in the wider economy. \nAfter stagnating for several years, disposable income growth in China accelerated to 7.3 percent last year, according to official data published last week. \nBut the gains are much greater for those in the country’s burgeoning tech hubs - Beijing, Shenzhen, Shanghai and Hangzhou - where the disparity with average salaries mirrors trends seen in San Francisco. \nBut it’s not all roses in China’s labour market as high-paying tech jobs are only available to a tiny slice of the overall workforce, and even official surveys show declining employment in both the manufacturing and services industries. \nThe high salaries in the tech industry far outpace typical income levels in China, where average per capita disposable income was just 25,974 yuan ($4,058.44) last year, China’s statistics bureau said last week. \n“Don’t forget that in 2018, (China) is going to have 8.2 million fresh university graduates. Those guys need a job. So from my point of view the pressure to create enough jobs is still there,” said Qu Hongbin, Greater China Chief Economist at HSBC in Hong Kong. \n($1 = 6.3740 Chinese yuan renminbi) Reporting by Stella Qiu and Elias Glenn; Additional reporting by Salvador Rodriguez in San Francisco; Editing by Martin Howell", "external_links": [], "published": "2018-01-25T01:07:00.000+02:00", "crawled": "2018-01-25T01:35:03.000+02:00", "highlightTitle": ""}