{"organizations": [], "uuid": "d20c07ac64b94c3a583136ebf68152d115451eab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/16/104948497-RTX4BYM9.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/disrupting-the-internal-combustion-engine--from-within.html", "country": "US", "domain_rank": 767, "title": "Disrupting the internal combustion engine — from within", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.182, "site_type": "news", "published": "2018-01-16T20:19:00.000+02:00", "replies_count": 0, "uuid": "d20c07ac64b94c3a583136ebf68152d115451eab"}, "author": "Ahmad Al Khowaiter", "url": "https://www.cnbc.com/2018/01/16/disrupting-the-internal-combustion-engine--from-within.html", "ord_in_thread": 0, "title": "Disrupting the internal combustion engine — from within", "locations": [], "entities": {"persons": [{"name": "ahmad al khowaiter", "sentiment": "none"}, {"name": "jonathan ernst", "sentiment": "none"}], "locations": [{"name": "detroit", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}], "organizations": [{"name": "north american international auto show", "sentiment": "none"}, {"name": "saudi aramco", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As automakers and enthusiasts from across the globe meet in Detroit this week for the North American International Auto Show, battery electric vehicles (BEVs) will be in the spotlight. In an era of climate change concerns, BEVs have become a symbol of innovation, promising to disrupt the automotive industry. Yet hidden in plain sight are some of the most disruptive technologies the industry has ever seen; and they happen to be new and improved internal combustion engines.\nIronically, as countries announce plans to phase out gasoline- and diesel-powered vehicles in favor of BEVs, new fuels and engine designs are making ICEs greener than ever, and far more efficient. In fact, in many of the world's largest markets, on a cradle-to-grave basis, the most efficient ICE has a significantly lower carbon footprint than a BEV — mainly due to the carbon intensity of the electrical power grid and the environmental impact of battery manufacturing.\nOver the past century, internal combustion engines have harnessed the unparalleled energy density of hydrocarbons, transforming our world and powering our economies to ever-greater heights. Today's hydrocarbons (whether fossil or renewable based) meet 99 percent of the world's transport needs.\nAs BEVs overcome cost and infrastructure challenges over the next 10 years, they are set to increase their market share in specific segments of the light-duty vehicle market. Yet forecasts by the Energy Information Administration and the International Energy Agency predict that combustion engines will still account for more than 90 percent of global transport energy demand by mid-century. The anticipated growth of the global population to 9 billion, and the expected doubling of the world economy will continue to drive demand for affordable ICE-powered vehicles.\nWith combustion engines factoring in the transport equation for decades — and ICE remaining the dominant power source for the foreseeable future — they must be part of any sensible climate strategy. Improving the ICE remains the most cost-effective and timely means to reduce greenhouse gas emissions from the transport sector — and those improvements can yield dramatic results.\nTake gasoline compression ignition (GCI), which boosts engine efficiency while reducing NOx and soot pollutants simultaneously. GCI uses market gasoline for diesel-like efficiencies in a cost-effective manner — with even greater potential using future fuels. At Saudi Aramco, we have demonstrated that GCI can boost fuel economy by 30 percent. Innovative automakers like Mazda with their upcoming SkyActivX engine are leading the way for gasoline compression ignition, with others expected to follow.\nSome of the most exciting developments are radically new engine designs which save fuel and reduce emissions, like the Achates Power opposed-piston engine. The engine, which utilizes two pistons per cylinder working in opposite reciprocating motion, has the potential to achieve efficiencies exceeding those of diesel and gasoline engines by 30 and 50 percent, respectively.\nElectrification can complement ICE to achieve the highest vehicle efficiency, bringing together the strengths of both technologies. Hybrids have demonstrated that ICEs, when paired with batteries, can run at peak efficiency.\nIn addition to making engines more efficient, we can trap emissions before they are released into the atmosphere. Saudi Aramco has already demonstrated the on-board capture and storage of 30 percent of the tail-pipe CO2 from a Toyota Camry.\nCombining CO2 capture with ever more-affordable renewable energy, and using proven synthetic fuel technologies, carbon-neutral combustion is already within reach.\nThe global community faces a great challenge: reducing greenhouse gases and improving local air quality while simultaneously meeting the world's growing energy needs. Addressing this challenge requires policies that promote a range of technologies, as those that attempt to pick winners are frequently counter-productive. We must employ a balanced approach, using all available technologies, if we're to achieve our energy and climate goals. Neither the BEV nor the ICE is the perfect solution in all scenarios; both are needed for a sustainable and affordable mobility future.\nAhmad Al Khowaiter is chief technology officer of Saudi Aramco, the world's top exporter of crude oil and natural gas liquids and a fully integrated, global petroleum and chemicals enterprise. To learn more about the company and its participation in the North American International Auto Show, follow us on Twitter @Saudi_Aramco and visit http://www.saudiaramco.com/en/home/news-media/news/NAIAS-2018.html", "external_links": [], "published": "2018-01-16T20:19:00.000+02:00", "crawled": "2018-01-16T20:37:16.032+02:00", "highlightTitle": ""}