{"organizations": [], "uuid": "40276b96f8c23e857ce396d89c03fbb6a88a0212", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104933809-GettyImages-902392442.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/weather-and-airport-structure-hampered-recovery-at-new-yorks-jfk.html", "country": "US", "domain_rank": 767, "title": "Weather and airport structure hampered recovery at New York's JFK", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-08T23:41:00.000+02:00", "replies_count": 0, "uuid": "40276b96f8c23e857ce396d89c03fbb6a88a0212"}, "author": "Leslie Josephs", "url": "https://www.cnbc.com/2018/01/08/weather-and-airport-structure-hampered-recovery-at-new-yorks-jfk.html", "ord_in_thread": 0, "title": "Weather and airport structure hampered recovery at New York's JFK", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "john f. kennedy airport", "sentiment": "none"}, {"name": "john f. kennedy international", "sentiment": "none"}, {"name": "jfk", "sentiment": "none"}], "organizations": [{"name": "jfk shares mohammed elshamy | anadolu agency", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Mohammed Elshamy | Anadolu Agency | Getty Images A passenger and his luggage are seen during the weather-related cancellation at the John F. Kennedy Airport in New York, United States on January 08, 2017. \nWhen New York's John F. Kennedy International airport goes down, the implications are felt around the world. \nThe airport receives more international passenger traffic — more than 31 million people in 2016 — than any other U.S. airport. The air travel disruptions in the wake of powerful winter storm that struck the East Coast last week only snowballed thanks to a blast of cold temperatures and confusion on whether the airport was up and running. \nMore than 7,000 flights were canceled because of the storm, a costly headache for airlines that were dealt a string of hurricanes in 2017, as well as for passengers who were stranded abroad after their flights were canceled. The storm struck as many travelers were making their way home from end-of-year holidays and 2018 business travel was getting going. \nFor international travelers, the chaos at JFK was intense: long-haul flights arrived in the airport only to sit on taxiways for hours due to a lack of available gates. Ground equipment malfunctioned in the bone-chilling cold, while high winds and ice on the ground after the storm hampered cleanup efforts. \nBut passengers and airlines alike were confused by whether the airport and the carriers who operate there could even cater to them, which lead to more chaos. The Port Authority of New York and New Jersey, which oversees the airport decided to close JFK down during the storm on Thursday, forcing JFK-bound flights to divert to an array of other airports. \nEven after the airport reopened, diversions continued as there weren't enough gates to handle the influx of flights: the previous days' schedule plus new arriving flights. The Federal Aviation Administration on Saturday suspended arrivals of some flights. That day an Aeroflot plane from Moscow turned back halfway through the trip to JFK. Dozens of other JFK-bound flights landed at other airports in the region and elsewhere, such as Detroit. More than 230 flights were diverted since Thursday because of the storm, 124 of them international flights to JFK, according to flight-tracking site FlightAware. \nPassengers at JFK complained on social media that they were not able to retrieve their luggage as bags piled up at claims areas. \nThe airport appeared to be slowly getting back to normal on Monday but more than 100 flights were canceled in or out of JFK. Snow and sleet were in the forecast for the New York area during the rush hour period, which could throw things even more off track. \nSo what complicated the cleanup from a one-day storm? For one, while the Port Authority oversees operations at the airport, and makes the call on whether to close the airport, separate terminals are leased by different parties: airlines and other consortiums. \nFor airlines, the advantage of this arrangement is they have dedicated gates and facilities for their operations. JetBlue , for example, operates Terminal 5. American Airlines has Terminal 8. \nHowever, it is difficult for a plane to get a gate at a terminal where they don't normally fly into. For one, gates are often allotted to scheduled flights. Some planes are so big, such as the Airbus A380, that a terminal may lack gates or jetways tall enough to accommodate the aircraft. \nFurther complicating the recovery, on Sunday, a pipe burst in Terminal 4, the main international terminal, home to airlines including El Al, China Southern, Air India, Copa and Swiss Air, just to name a few. Passengers were evacuated from the terminal after a portion of it flooded , and while it reopened later that day, operations were snarled again. The Port Authority said it would investigate the incident and other relationships within the airport. \n\"The Port Authority intends to aggressively review with its partners, the terminal operators and airlines, the process to assure that planes and passengers get to their gates during the surge of rescheduled flights that follow a severe weather event,\" it said. \nWhile wintry weather is expected and airlines and airport officials knew about the problem days in advance, it was no consolation to passengers who waited for hours, and even days, to board flights. Many complained about a lack of communication from airlines about whether flights would take off as the storm left some flights without crews, which have strict limits to their working hours to ensure adequate rest. \n\"This past weekend's events at New York's John F. Kennedy airport demonstrated in stunning detail the consequences of inadequate contingency planning and passenger communication at major international airports,\" said Greeley Koch, executive director of the Association of Corporate Travel Executives. \nKoch called out another infrastructure problem that recently snarled air travel: the nearly half-day power outage last month at Hartsfield-Jackson Atlanta International Airport , the busiest airport in the world and the home of Delta Air Lines . \n\"The airlines don't help themselves when they are not providing accurate information and customers are spending a lot of their own money [to get to the airport],\" said Henry Harteveldt, a travel consultant and founder of Atmosphere Research Group. \nHow airlines \"recover will determine whether passengers book with them again,\" he said. \"It's not about how you operate when it's sunny and 72.\" Leslie Josephs Airline Reporter for CNBC.com Related Securities", "external_links": [], "published": "2018-01-08T23:41:00.000+02:00", "crawled": "2018-01-08T23:41:58.005+02:00", "highlightTitle": ""}