{"organizations": [], "uuid": "123724307cea21f05bdccc9a5274277a6c80df1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-helen-of-troy-limited-reports-third-quarter-fiscal-2018-results.html", "country": "US", "domain_rank": 767, "title": "Helen of Troy Limited Reports Third Quarter Fiscal 2018 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.044, "site_type": "news", "published": "2018-01-08T14:45:00.000+02:00", "replies_count": 0, "uuid": "123724307cea21f05bdccc9a5274277a6c80df1e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-helen-of-troy-limited-reports-third-quarter-fiscal-2018-results.html", "ord_in_thread": 0, "title": "Helen of Troy Limited Reports Third Quarter Fiscal 2018 Results", "locations": [], "entities": {"persons": [{"name": "helen", "sentiment": "negative"}], "locations": [{"name": "texas", "sentiment": "none"}], "organizations": [{"name": "el paso", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "continuing operations", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "● Delivers Consolidated Net Sales Revenue Growth of 1.9%; Core Business Growth of 1.3%\n● Reports GAAP Diluted Loss Per Share of $(1.12); Adjusted Diluted EPS of $2.52\n● Updates Post-Divestiture Fiscal 2018 GAAP Diluted EPS Outlook to $5.42 to $5.63 for Continuing Operations\n● Updates Post-Divestiture Adjusted Diluted EPS Outlook to $6.85 to $7.10 for Continuing Operations\n● Updates Post-Divestiture Fiscal 2018 Outlook for Consolidated Net Sales from Continuing Operations of $1.440 to $1.463 billion; Growth of 2.3% to 4.0%\nEL PASO, Texas--(BUSINESS WIRE)-- Helen of Troy Limited (NASDAQ:HELE), designer, developer and worldwide marketer of consumer brand-name housewares, health and home and beauty products, today reported results for the three-month period ended November 30, 2017. Third quarter fiscal 2018 GAAP results include pre-tax non-cash asset impairment charges of $82.2 million associated with the Company’s Nutritional Supplements segment and $1.3 million in restructuring charges related to our restructuring plan, Project Refuel, with no comparable charges in the same period last year.\nExecutive Summary\nConsolidated net sales revenue increase of 1.9%, including: An increase in Leadership Brand net sales of approximately 6.4% An increase in online channel net sales of approximately 18.6% GAAP operating loss of $(15.6) million, or (3.4)% of net sales, which includes $82.2 million in non-cash pre-tax asset impairment charges and $1.3 million in restructuring charges, compared to operating income of $63.3 million, or 14.2% of net sales, in the same period last year Non-GAAP adjusted operating income growth of 7.5% to $79.0 million, or 17.4% of net sales, which excludes the impairment and restructuring charges mentioned above, compared to $73.4 million, or 16.5% of net sales in the same period last year Effective tax rate of (58.4)% compared to 3.7% in the same period of the prior year, driven by the impact of impairment charges on the tax provision GAAP diluted loss per share of $(1.12), which includes $3.30 per share in impairment and restructuring charges mentioned above, compared to diluted earnings per share (“EPS”) of $2.07 in the same period last year with no comparable charges in the prior year Non-GAAP adjusted diluted earnings per share growth of 6.3% to $2.52, compared to $2.37 in the same period last year Repurchased 311,100 shares of common stock in the open market during the quarter for $29.2 million\nJulien R. Mininberg, Chief Executive Officer, stated: “We achieved solid results in the third quarter, with consolidated sales growth of 1.9% driven primarily by new product introductions, incremental distribution, and growth in international sales. Our Leadership Brands continue to perform well, gaining 6.4% with each of the seven growing during the quarter. Growth in the online channel continued to be a key driver, gaining 18.6% to now represent 17.4% of total sales for the third quarter. We drove gross margin expansion through a better mix of higher-margin sales, and increased consolidated adjusted operating margin as we benefitted from greater efficiencies from our shared services platform, even as we continued to invest in our brand portfolio and digital capabilities. This progress resulted in adjusted earnings per share growth of 6.3%. Our Health & Home and Housewares segments led sales growth in the quarter, and both segments achieved higher adjusted operating margins compared to the prior year period. In our Beauty segment, sales and profitability benefitted from new product introductions in the appliance category, which was offset by continued challenges in the personal care category. Subsequent to the end of the third quarter, we completed the sale of the Nutritional Supplements business. The sale of Healthy Directions demonstrates our willingness to sharpen our portfolio and allows us to focus even more resources on our Leadership Brands. Post divestiture, these brands, which are among our highest volume, highest margin and most asset-efficient, now represent more than 75% of fiscal year-to-date sales from continuing operations. Importantly, the direct-to-consumer systems and fulfillment capability we built for Healthy Directions remain with Helen of Troy. We continue to look for the right acquisition to further strengthen our portfolio and make use of our strong balance sheet. Meanwhile, during the third quarter we opportunistically repurchased 1.2% of our outstanding common stock.”\nMr. Mininberg continued: “We are pleased with our accomplishments this fiscal year to date, which are the result of solid execution against our clear and focused strategies. We achieved overall sales growth of 2.6%, including growth in our Leadership Brands of 7.3%, improved profitability, and delivered adjusted diluted EPS growth of 12.1%. We also reduced inventory by over 5% year over year as we continue to benefit from the improved operating efficiencies that are so important to our overall transformation plan. We are therefore increasing our fiscal 2018 adjusted diluted EPS outlook range for continuing operations. We continue to prudently invest behind those brands, channels and categories that provide the best opportunities to drive growth and further improve profitability. We believe these disciplined investments in product innovation, marketing, and digital initiatives will position our company for continued long-term shareholder value creation.”\nThree Months Ended November 30, Housewares Health & Home\nNutritional\nSupplements\nBeauty Total Fiscal 2017 sales revenue, net $ 124,723 $ 179,842 $ 32,163 $ 107,686 $ 444,414 Core business 3,074 9,323 (2,827) (3,731) 5,839 Impact of foreign currency 220 1,810 - 762 2,792 Change in sales revenue, net 3,294 11,133 (2,827) (2,969) 8,631 Fiscal 2018 sales revenue, net $ 128,017 $ 190,975 $ 29,336 $ 104,717 $ 453,045 Total net sales revenue growth 2.6 % 6.2 % (8.8) % (2.8) % 1.9 % Core business 2.5 % 5.2 % (8.8) % (3.5) % 1.3 % Impact of foreign currency 0.2 % 1.0 % - % 0.7 % 0.6 % Operating margin (GAAP) Third quarter fiscal 2018 23.4 % 14.6 % (284.7) % 9.6 % (3.4) % Third quarter fiscal 2017 23.4 % 11.2 % (0.2) % 13.0 % 14.2 % Adjusted operating margin (non-GAAP) Third quarter fiscal 2018 25.0 % 16.9 % 3.6 % 13.0 % 17.4 % Third quarter fiscal 2017 24.5 % 13.7 % 5.8 % 15.3 % 16.5 % Consolidated Operating Results - Third Quarter Fiscal 2018 Compared to Third Quarter Fiscal 2017\nConsolidated net sales revenue increased 1.9% to $453.0 million compared to $444.4 million, which included an increase of 0.6% from foreign currency fluctuations. The net sales increase includes the contribution from new product introductions, online customer growth, incremental distribution, and growth in international sales. These factors were partially offset by an 8.8% decline in the Nutritional Supplements segment, which had an unfavorable impact of 0.6% on consolidated sales growth, a decrease in the personal care category within Beauty, and the impact of lower store traffic and soft consumer spending at traditional brick and mortar retail.\nConsolidated gross profit margin increased 0.8% percentage points to 44.5% compared to 43.7%. The increase in consolidated gross profit margin is primarily due to favorable product mix, growth in the Company’s Leadership Brands and the favorabl", "external_links": ["http://investor.hotus.com/", "http://www.businesswire.com/news/home/20180108005536/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestor.hotus.com%2F&esheet=51739121&newsitemid=20180108005536&lan=en-US&anchor=http%3A%2F%2Finvestor.hotus.com%2F&index=2&md5=58b388988498516e9c18405d30d7103a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestor.hotus.com%2F&esheet=51739121&newsitemid=20180108005536&lan=en-US&anchor=http%3A%2F%2Finvestor.hotus.com%2F&index=1&md5=a3d32fee879c98817fc1f7c2d0ddcdd5"], "published": "2018-01-08T14:45:00.000+02:00", "crawled": "2018-01-08T15:35:24.012+02:00", "highlightTitle": ""}