{"organizations": [], "uuid": "888be3c60b773bdea78069a012acbffb8140190a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-he-equipment-services-completes-acquisition-of-cec-significantly-expands-presence-in-colorado-market.html", "country": "US", "domain_rank": 767, "title": "H&E Equipment Services Completes Acquisition of CEC; Significantly Expands Presence in Colorado Market", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.031, "site_type": "news", "published": "2018-01-04T16:30:00.000+02:00", "replies_count": 0, "uuid": "888be3c60b773bdea78069a012acbffb8140190a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-he-equipment-services-completes-acquisition-of-cec-significantly-expands-presence-in-colorado-market.html", "ord_in_thread": 0, "title": "H&E Equipment Services Completes Acquisition of CEC; Significantly Expands Presence in Colorado Market", "locations": [], "entities": {"persons": [{"name": "john engquist", "sentiment": "none"}], "locations": [{"name": "colorado market baton rouge", "sentiment": "none"}, {"name": "la.", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "denver", "sentiment": "none"}], "organizations": [{"name": "h&e equipment services completes acquisition of cec", "sentiment": "negative"}, {"name": "hees", "sentiment": "negative"}, {"name": "h&e equipment services, inc.", "sentiment": "neutral"}, {"name": "contractors equipment center", "sentiment": "none"}, {"name": "cec", "sentiment": "none"}, {"name": "h&e", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BATON ROUGE, La.--(BUSINESS WIRE)-- H&E Equipment Services, Inc. (NASDAQ: HEES) today announced it has completed its acquisition of Contractors Equipment Center (CEC), a non-residential construction focused equipment rental company located in the greater Denver, Colorado area. The acquisition is part of H&E's ongoing strategy of acquiring rental companies to complement its existing business and footprint, and will augment H&E’s capabilities and efficiencies of scale in the market areas and geographies that CEC currently serves. The assets acquired include approximately $84.0 million of fleet based on original equipment cost and three branch facilities serving end markets in the non-residential construction and other sectors.\nJohn Engquist, H&E’s Chief Executive Officer, said, “We are very pleased to have finalized the CEC transaction, which doubles our branch count to six in Colorado, significantly expanding our presence in a strong non-residential construction market. Our collective teams have been working side-by-side since we announced the definitive agreement in late November in an effort to ensure a seamless integration process post-closing. As a result, our newly combined Colorado operations have solid momentum entering the New Year. CEC is extremely representative of the type of acquisitions we intend to actively pursue.”\nAbout H&E Equipment Services, Inc.\nThe Company is one of the largest integrated equipment services companies in the United States with 80 full-service facilities throughout the West Coast, Intermountain, Southwest, Gulf Coast, Mid-Atlantic and Southeast regions. The Company is focused on heavy construction and H&E Equipment Services Completes Acquisition of Contractors Equipment Center industrial equipment and rents, sells and provides parts and services support for four core categories of specialized equipment: (1) hi-lift or aerial platform equipment; (2) cranes; (3) H&E Equipment Services Completes Acquisition of Contractors Equipment Center earthmoving equipment; and (4) industrial lift trucks. By providing equipment rental, sales, on-site parts, repair and maintenance functions under one roof, the Company is a one-stop provider for its customers' varied equipment needs. This full service approach provides the Company with multiple points of customer contact, enabling it to maintain a high quality rental fleet, as well as an effective distribution channel for fleet disposal and provides cross-selling opportunities among its new and used equipment sales, rental, parts sales and services operations.\nForward-Looking Statements\nStatements contained in this press release that are not historical facts, including statements about H&E’s beliefs and expectations, are “forward-looking statements” within the meaning of the federal securities laws. Statements that are not historical facts, including statements about our beliefs and expectations are forward-looking statements. Statements containing the words “may,” “could,” “would,” “should,” “believe,” “expect,” “anticipate,” “plan,” “estimate,” “target,” “project,” “intend,” “foresee” and similar expressions constitute forward-looking statements. Forward-looking statements involve known and unknown risks and uncertainties, which could cause actual results to differ materially from those contained in any forward-looking statement. Such factors include, but are not limited to, the following: (1) the risk that any savings and synergies anticipated from the acquisition are not realized or take longer than anticipated to be realized; (2) the risk of unsuccessful integration of H&E’s and CEC’s businesses, or that such integration will be materially delayed or will be more costly or difficult than anticipated; (3) the amount of the costs, fees, expenses and charges related to the acquisition; (4) any additional costs related to the acquisition or the other transactions contemplated thereby as a result of unexpected factors or events; (5) any negative effects of this announcement or the consummation of the acquisition on H&E's or CEC's supplier, customer or other business relationships or the market price of H&E’s common stock or other securities; (6) the diversion of management time on transaction-related issues; (7) other business effects, including the effects of general industry, market, economic, political or regulatory conditions, future exchange or interest rates or changes in tax laws, regulations, rates and policies, including the uncertainty regarding rules and regulations with respect to the foregoing that may be affected by the United States Congress and Trump administration; (8) the expected business outlook, anticipated financial and operating results of H&E generally; and (10) other factors discussed in our public filings, including the risk factors included in the H&E’s most recent Annual Report on Form 10-K. Investors, potential investors and other readers are urged to consider these factors carefully in evaluating the forward-looking statements and are cautioned not to place undue reliance on such forward-looking statements. Except as required by applicable law, including the securities laws of the United States and the rules and regulations of the Securities and Exchange Commission, we are under no obligation to publicly update or revise any forward-looking statements after the date of this release. These statements are based on the current beliefs and assumptions of H&E’s management, which in turn are based on currently available information and important, underlying assumptions. H&E is under no obligation to publicly update or revise any forward-looking statements after this press release, whether as a result of any new information, future events or otherwise. Investors, potential investors, security holders and other readers are urged to consider the above mentioned factors carefully in evaluating the forward-looking statements and are cautioned not to place undue reliance on such forward-looking statements. Although H&E believes that the expectations reflected in the forward-looking statements are reasonable, they cannot guarantee future results or performance, including any anticipated effects of the acquisition.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104005220/en/\nH&E Equipment Services, Inc.\nLeslie S. Magee, 225-298-5261\nChief Financial Officer\nlmagee@he-equipment.com\nor\nKevin S. Inda, 225-298-5318\nVice President of Investor Relations\nkinda@he-equipment.com\nSource: H&E Equipment Services, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180104005220/en/"], "published": "2018-01-04T16:30:00.000+02:00", "crawled": "2018-01-04T16:42:27.015+02:00", "highlightTitle": ""}