{"organizations": [], "uuid": "5846a8e4c5b179ecbd6510616bdda769596b11a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222912216&w=1200&r=LYNXMPEE0H021", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/us-global-markets/asia-stocks-near-record-highs-after-wall-st-surge-dollar-edges-back-idUKKBN1F704A", "country": "US", "domain_rank": 408, "title": "Asia stocks reach record highs after Wall St surge, dollar edges back", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T04:22:00.000+02:00", "replies_count": 0, "uuid": "5846a8e4c5b179ecbd6510616bdda769596b11a7"}, "author": "", "url": "https://uk.reuters.com/article/us-global-markets/asia-stocks-near-record-highs-after-wall-st-surge-dollar-edges-back-idUKKBN1F704A", "ord_in_thread": 0, "title": "Asia stocks reach record highs after Wall St surge, dollar edges back", "locations": [], "entities": {"persons": [{"name": "shinichi saoshiro", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}, {"name": "ssec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 1:03 AM / Updated 2 hours ago Asia stocks reach record highs after Wall St. surge, dollar edges back Shinichi Saoshiro 5 Min Read \nTOKYO (Reuters) - Asian stocks struck record highs on Thursday, with a rally by Wall Street supporting bullish investor sentiment, while the dollar pulled back from three-year lows as comments by European Central Bank officials tempered the euro’s recent rally. \nMSCI’s broadest index of Asia-Pacific shares outside Japan .MIAPJ0000PUS rose 0.2 percent, building on the previous day’s gains to make a fresh peak. \nAustralian stocks were flat, South Korea's KOSPI .KS11 added 0.2 percent and Japan's Nikkei .N225 was last up 0.4 percent after reaching its highest level since late 1991. \nShanghai .SSEC rose 0.4 percent and Hong Kong's Hang Seng .HSI advanced 0.4 percent. \nU.S. stocks jumped on Wednesday and the Dow .DJI closed above 26,000 for the first time as investors' expectations for higher earnings lifted stocks across sectors. [.N] \nOptimism over prospects for sustained strong global growth and improved corporate earning shave helped share markets rally at the start of 2018. \n“Events related to North Korea pose potential risks, but there are very few factors holding equities back at the moment,” said Junichi Ishikawa, senior FX strategist at IG Securities in Tokyo. \n“And bullish U.S. stocks, higher Treasury yields and signs of the euro’s recent surge running its course are all dollar-supportive factors,” Ishikawa said. \nNear-term market focus was on China’s gross domestic product data due at 0700 GMT. Analysts polled by Reuters expect the world’s second-largest economy to have grown 6.7 percent in the October-December quarter from a year earlier, slowing from a rise of 6.8 percent in the previous quarter. \n“The downward trend is clear. We expect investment to come under pressure this year but we are relatively optimistic about consumption and exports,” said Li Huiyong, an economist at Shenwan Hongyuan Securities in Shanghai. \nThe dollar index against a basket of six major currencies .DXY was 0.4 percent higher at 90.878 after pulling back overnight from a three-year low of 90.279 set earlier in the week. \nThe euro was little changed at $1.2188 EUR= , slipping from a three-year peak above $1.2300 after some ECB officials voiced worries about the currency's strength. The common currency had advanced this month on expectations that the central bank would take steps towards winding back on stimulus measures to normalize monetary policy. \nThe dollar was steady at 111.310 yen JPY= after surging 0.75 percent overnight, when it bounced from a four-month low of 110.190. \nThe Australian dollar dipped slightly to $0.7959 AUD=D4 after being nudged off a four-month high of $0.8023 the previous day. \nThe two-year Treasury yield US2YT=RR hovered near a nine-year high of 2.051 percent reached on Wednesday on expectations the Federal Reserve will continue to tighten monetary policy this year. \nIn commodities, crude oil prices extended gains on data showing a decline in U.S. crude inventories. [O/R] \nBrent crude futures LCOc1 rose 0.15 percent to $69.50 a barrel. On Monday, they hit a three-year high of $70.37. \nU.S. crude futures CLc1 were 0.4 percent higher at $64.21 per barrel. \nDespite the gains, many analysts are warning that the recent oil price rally may lose momentum. \n“We reckon that the upside is now limited for oil prices. U.S. shale oil output will increase by a good 111,000 barrels per day (bpd) next month to 10 million bpd, and will rise to about 11 million bpd by the end of next year,” said Fawad Razaqzada, market analyst at future brokerage Forex.com. \n“This would put the U.S. on par with Saudi Arabia and Russia’s output,” Razaqzada said. \nSpot gold XAU= was down 0.25 percent at $1,326.50 an ounce, with the dollar’s bounce pulling it back from a four-month high of $1,344.43 set on Monday. [GOL/] Reporting by Shinichi Saoshiro; Additional reporting by Kevin Yao in Beijing and Henning Gloystein in Singapore; Editing by Simon Cameron-Moore", "external_links": [], "published": "2018-01-18T04:22:00.000+02:00", "crawled": "2018-01-18T07:16:43.019+02:00", "highlightTitle": ""}