{"organizations": [], "uuid": "f8288f693f548b5a16cc2504e2426614dccf75f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets/europe", "section_title": "European Stock Market News | Reuters.com", "url": "https://www.reuters.com/article/diary-top-econ/diary-top-economic-events-to-march-22-idUSL3N1PE4EL", "country": "US", "domain_rank": 408, "title": "DIARY-Top Economic Events to March 22", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T08:05:00.000+02:00", "replies_count": 0, "uuid": "f8288f693f548b5a16cc2504e2426614dccf75f7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/diary-top-econ/diary-top-economic-events-to-march-22-idUSL3N1PE4EL", "ord_in_thread": 0, "title": "DIARY-Top Economic Events to March 22", "locations": [], "entities": {"persons": [{"name": "erik thedeen", "sentiment": "none"}, {"name": "mario draghi", "sentiment": "none"}, {"name": "ingvar mattson", "sentiment": "none"}, {"name": "hans lindblad", "sentiment": "none"}, {"name": "marvin goodfriend", "sentiment": "none"}, {"name": "finansinspektionen", "sentiment": "none"}, {"name": "vitor constancio", "sentiment": "none"}, {"name": "benoit coeure", "sentiment": "none"}, {"name": "stefan ingves", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "stockholm", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "senate banking committee", "sentiment": "none"}, {"name": "financial markets per bolund", "sentiment": "none"}, {"name": "national debt office", "sentiment": "none"}, {"name": "chicago - federal reserve bank of chic", "sentiment": "none"}, {"name": "general news this diary", "sentiment": "none"}, {"name": "federal reserve board of governors", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "riksbank", "sentiment": "none"}, {"name": "riksdag committee on finance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 22 (Reuters) - For other diaries, please see:\nU.S. Federal Reserve\nPolling Unit Diary\nToday in Washington\nPolitical and General News This Diary is filed daily. ** Indicates new events MONDAY, JANUARY 22 ** BRUSSELS - ECB President Mario Draghi and executive board member Benoit Coeure participate in a Eurogroup meeting.\nBRUSSELS - Eurogroup finance ministers’ meeting.\nTOKYO - Bank of Japan monetary policy meeting (to Jan. 23).\nTUESDAY, JANUARY 23 ** WASHINGTON - Senate Banking Committee holds a hearing on the nomination of Marvin Goodfriend to be a member of the Federal Reserve Board of Governors - 1500 GMT. ** BRUSSELS - ECB Vice President Vitor Constancio attends an ECOFIN meeting.\nSTOCKHOLM - The Riksdag Committee on Finance is holding an open hearing on financial stability and macroprudential policy. Minister for Financial Markets Per Bolund, Riksbank Governor Stefan Ingves, Finansinspektionen Director-General Erik Thedeen, National Debt Office Director-General Hans Lindblad and Auditor-General Ingvar Mattson are participating – 0800 GMT.\nCHICAGO - Federal Reserve Bank of Chicago President Charles Evans gives introductory remarks before the Chicago Council on Global Affairs conference: “The Future of Monetary Policy: Embracing the Unconventional” - 2330 GMT. BRUSSELS - EU Economic and Financial Affairs Council meeting.\nWEDNESDAY, JANUARY 24 ** STOKHOLM – Riksbank Deputy Governor Martin Floden to discuss current monetary policy at Moody’s seminar on Credit Trends – 1030 GMT. ** FRANKFURT - ECB Supervisory Chief Daniele Nouy attends the European Banking Federation Boardroom Dialogue – 0815 GMT.\nTHURSDAY, JANUARY 25 ** DAVOS, Switzerland – Riksbank Deputy Governor Cecilia Skingsley attends the World Economic Forum (to Jan. 26). FRANKFURT - ECB Governing Council meeting, followed by an interest rate announcement and a press conference by President Mario Draghi. OSLO - Norway Central Bank interest rate decision – 0900 GMT.\nTOKYO - Bank of Japan releases the minutes of its Dec. 20-21 monetary policy meeting - 2350 GMT.\nFRIDAY, JANUARY 26 ** DAVOS, Switzerland - ECB executive board member Benoit Coeure participates in a televised session on “The end of easy money” at the World Economic Forum – 1000 GMT. LONDON - Bundesbank Vice President Claudia Buch speaks at the Imperial College – 1530 GMT.\nSTOCKHOLM - Riksbank executive board meeting – 0800 GMT.\nMONDAY, JANUARY 29 ** STOCKHOLM – Riksbank First Deputy Governor Kerstin af Jochnick explains what responsibility the central bank has with regard to financial stability and how it safeguards the efficiency and stability of the financial system. Her speech will be commented on by Mattias Persson, chief economist at the Swedish National Debt Office – 1100 GMT. ** FRANKFURT, Germany - ECB board member Sabine Lautenschläger, Basel committee chair Stefan Ingves, European Banking Authority chair Andrea Enria and Bundesbank board member Andreas Dombret speak at a Frankfurt conference on banking reforms.\nTUESDAY, JANUARY 30 ** FRANKFURT - ECB board member Yves Mersch speaks at the Goethe University - 1600 GMT.\nWASHINGTON - U.S. Federal Reserve’s Federal Open Market Committee (FOMC) starts its two-day meeting on interest rates (to Jan. 31).\nTOKYO - Bank of Japan to release a summary of opinions from board members at its Jan. 22-23 policy meeting – 2350 GMT.\nWEDNESDAY, JANUARY 31 ** OSLO – Riksbank Governor Stefan Ingves will attend the Norges Bank seminar “Monetary Policy Symposium 2018” and will speak on financial stability risks, monetary policy and the need for macroprudential policy – 0900 GMT. OITA, Japan - Bank of Japan Deputy Governor Kikuo Iwata speaks to business leaders - 0130 GMT. WASHINGTON - U.S. Federal Reserve’s Federal Open Market Committee (FOMC) announces its decision on interest rates, followed by statement – 1900 GMT.\nMONDAY, FEBRUARY 5 LONDON - OMFIF lunch discussion with Cecilia Skingsley, deputy governor of the Swedish central bank and co-chair of the World Economic Forum’s working group, examining the prospects for central bank-issued digital currencies - 1200 GMT\nTUESDAY, FEBRUARY 06 ** FRANKFURT - Conference for the Center for Financial Studies (CFS) and the Bundesbank on “Money in the Digital Age: What Role for Central Banks?” - 0900 GMT.\nWEDNESDAY, FEBRUARY 7 FRANKFURT - ECB Governing Council meeting. No interest rate announcements scheduled. STOCKHOLM - Riksbank executive board meeting – 0800 GMT. THURSDAY, FEBRUARY 8 FRANKFURT - Federal Reserve Bank of Dallas President Robert Kaplan speaks on “Monetary Policy Issues in an European Context” before the Global Interdependence Center “Central Banking Series: Frankfurt” – 0915 GMT. OTTAWA – Speech by Carolyn Wilkins, Bank of Canada Senior Deputy Governor at Bank of Canada – 1800 GMT. LONDON - European Central Bank executive board member Yves Mersch gives a lecture - 1000 GMT.\nLONDON - Bank of England releases its inflation report.\nLONDON - Bank of England announces its rate decision and publishes the minutes of the meeting – 1200 GMT. WELLINGTON - Reserve Bank of New Zealand’s Official Cash Rate (OCR) and Monetary Policy Statement.\nFRIDAY, FEBRUARY 9 STOCKHOLM - Riksbank general council meeting - 1200 GMT. TUESDAY, FEBRUARY 13\nDAYTON, Ohio - Federal Reserve Bank of Cleveland President Loretta Mester speaks on the economic outlook at the Dayton Area Chamber of Commerce Government Affairs Breakfast - 1300 GMT. STOCKHOLM - Riksbank monetary policy meeting – 0800 GMT.\nWEDNESDAY, FEBRUARY 14 STOCKHOLM - Swedish Central Bank interest rate decision and monetary policy report - 0830 GMT.\nTHURSDAY, FEBRUARY 15 WINNIPEG, Canada - Speech by Lawrence Schembri, Bank of Canada Deputy Governor at Manitoba Association for Business Economics – 1845 GMT. STOCKHOLM - Riksbank executive board meeting – 0800 GMT.\nFRIDAY, FEBRUARY 16 STOCKHOLM - Riksbank general council meeting - 1200 GMT. MONDAY, FEBRUARY 19 BRUSSELS - Eurogroup meeting.\nWEDNESDAY, FEBRUARY 21 WASHINGTON - Federal Open Market Committee will release the minutes from its January policy meeting. FRANKFURT - ECB Governing Council meeting. No interest rate announcements scheduled.\nMONDAY, FEBRUARY 26 ** WASHINGTON - Federal Reserve Bank of St. Louis President James Bullard speaks at a luncheon before the National Association for Business Economics conference, “Promoting Sustained Growth: Policy Tensions and Risks” - 1700 GMT. ** WASHINGTON - Federal Reserve Vice Chair for Supervision Randal Quarles speaks on “A View From the Federal Reserve Board” before the National Association for Business Economics conference, “Promoting Sustained Growth: Policy Tensions and Risks” - 2000 GMT.\nWEDNESDAY, FEBRUARY 27 STOCKHOLM - Swedish Central Bank minutes of its monetary policy meeting will be published – 0830 GMT.\nWEDNESDAY, MARCH 7 ** OTTAWA - Bank of Canada key policy interest rate announcement – 1500 GMT. ** STOCKHOLM - Riksbank executive board meeting – 0800 GMT.\nTHURSDAY, MARCH 8 ** FRANKFURT - ECB Governing Council meeting, followed by an interest rate announcement and a press conference by President Mario Draghi. ** TOKYO - Bank of Japan monetary policy meeting (to March 09).\nTUESDAY, MARCH 13 ** TOKYO - Bank of Japan releases the minutes of monetary policy meeting held on Jan 22-23 – 2350 GMT.\nTHURSDAY, MARCH 15 ** OSLO - Norway Central Bank gives its interest rate decision, followed by press conference – 0900 GMT.\nSUNDAY, MARCH 18 ** TOKYO - Bank of Japan to release the summary of opinions from board members at its March 08-09 policy meeting – 2350 GMT.\nTUESDAY, MARCH 20 ** WASHINGTON - U.S. Federal Reserve’s Federal Open Market Committee (FOMC) starts its two-day meeting on interest rates.\nWEDNESDAY, MARCH 21 ** WASHINGTON - U.S. Federal Reserve’s Federal Open Market Committee (FOMC) announces decision on interest rate, followed by a statement – 1800 GMT. ** WASHINGTON – U.S. Federal Reserve chairperson holds a news conference regarding the interest rate – 1830 GMT. ** FRANKFURT - ECB Governing Council meeting. No interest rate announcements scheduled.\nTHURSDAY, MARCH 22 ** FRANKFURT - ECB general council meeting. ** WELLINGTON - Reserve Bank of New Zealand’s issues Official Cash Rate (OCR) announcement.\n** LONDON - Bank of England announces its interest rate decision and publishes the minutes of the meeting – 1200 GMT.", "external_links": [], "published": "2018-01-22T08:05:00.000+02:00", "crawled": "2018-01-22T05:58:03.011+02:00", "highlightTitle": ""}