{"organizations": [], "uuid": "8e089fa8b9b0b3aa5da544b62228e03dc668146d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221383913&w=1200&r=LYNXMPEE0B0FE", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-carrefour-showroomprive/carrefour-shares-edge-up-after-investment-in-online-fashion-retailer-showroomprive-idUKKBN1F10RY", "country": "US", "domain_rank": 408, "title": "Carrefour shares edge up after investment in online fashion retailer Showroomprive", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T10:31:00.000+02:00", "replies_count": 0, "uuid": "8e089fa8b9b0b3aa5da544b62228e03dc668146d"}, "author": "", "url": "https://uk.reuters.com/article/uk-carrefour-showroomprive/carrefour-shares-edge-up-after-investment-in-online-fashion-retailer-showroomprive-idUKKBN1F10RY", "ord_in_thread": 0, "title": "Carrefour shares edge up after investment in online fashion retailer Showroomprive", "locations": [], "entities": {"persons": [{"name": "alexandre bompard", "sentiment": "none"}, {"name": "bompard", "sentiment": "none"}, {"name": "leclerc", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "carrefour", "sentiment": "negative"}, {"name": "walmart", "sentiment": "none"}, {"name": "conforama", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "showroomprive reuters staff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 8:31 AM / Updated 2 hours ago Investors want more Carrefour digital deals after Showroomprive purchase Dominique Vidalon 4 Min Read \nPARIS (Reuters) - Investors welcomed supermarket retailer Carrefour’s ( CARR.PA ) acquisition of a stake in online fashion retailer Showroomprive.com ( SRPG.PA ), and analysts added on Friday they wanted more moves by the company in this area. Customers stand next to shopping trolleys as they shop in a Carrefour hypermarket in Nice, France, April 6, 2016. REUTERS/Eric Gaillard/File Photo \nCarrefour’s new boss Alexandre Bompard will present a strategy plan on Jan. 23, and his ambitions regarding digital and online businesses could form a key part of this. \nCarrefour said late on Thursday it will buy 17 percent of Showroomprive.com for 79 million euros (70.37 million pounds), from Steinhoff-owned ( SNHJ.J ) furniture chain Conforama. \nThe acquisition helped lift Carrefour shares by around 1 percent on Friday, outperforming a 0.6 percent rise in the broader European retail sector .SXRP, while Showroomprive shares jumped 50 percent. \nAnalysts at brokerage Bryan Garnier said the deal was “hopefully ... a first step towards more announcements on 23rd January,” and kept a “buy” rating on Carrefour shares. \nLast July Bompard, former boss of France’s top electronics retailer Fnac Darty ( FNAC.PA ), became CEO at Carrefour, the world’s largest retailer after Walmart ( WMT.N ). \nCarrefour issued a profit warning in August and Bompard is under pressure to improve results in its core French market. \nCarrefour has been losing market share to unlisted rival Leclerc, and investors also want Bompard to speed up an expansion into e-commerce where its lags domestic rivals and faces competition from online giant Amazon ( AMZN.O ). \nHe has also faced pressure after French rival Casino ( CASP.PA ) agreed to use Ocado’s ( OCDO.L ) e-commerce platform to expand its online grocery business. \n“A partnership with a web bulge-bracket might lend more credibility to Carrefour’s digital project, as would a partnership, if not a tie-up with Galeries Lafayette,” Bryan Garnier analysts added in a research note. \nThe Moulin family, which owns department store Galeries Lafayette, is the top shareholder in Carrefour with a near 10 percent stake. \nBernstein analysts said the Showroomprive deal could boost traffic in Carrefour stores, although they added it was nevertheless “fairly negligible” and Carrefour faced bigger issues over its underperforming food retail business. FEARS ABOUT BIG JOB CUTS \nBompard is also expected to back a restructuring on Jan. 23 that some analysts estimate could involve a billion euros. \nOptions for the French market include turning some stores into franchises, moving others to lease management, closing loss-making ones as well as Sunday opening. \nThere could also be some head office restructuring and more price cuts to attract shoppers, union sources have said. \nThe CGT and Force Ouvriere trade unions fear the restructuring could lead to 4,500-5,000 job cuts in France. Carrefour has declined to comment. \nDejan Terglav, FO secretary general, told Reuters on Friday his union was calling for a day of protests on Feb. 8. \n“If the plan does not suit us, it will be war,” he warned. \nCarrefour is the largest private sector employer in France, with 115,000 French staff out of a global workforce of 384,000. Reporting by Dominique Vidalon; Editing by Sudip Kar-Gupta and David Evans", "external_links": [], "published": "2018-01-12T10:31:00.000+02:00", "crawled": "2018-01-12T11:58:50.002+02:00", "highlightTitle": ""}