{"organizations": [], "uuid": "4401b895b89def17b2ae90e8b7d775e69bf43b2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/business-wire-fluent-expands-leadership-team-with-appointment-of-donald-patrick-as-coo.html", "country": "US", "domain_rank": 767, "title": "Fluent Expands Leadership Team with Appointment of Donald Patrick as COO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.127, "site_type": "news", "published": "2018-01-05T16:30:00.000+02:00", "replies_count": 0, "uuid": "4401b895b89def17b2ae90e8b7d775e69bf43b2d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/business-wire-fluent-expands-leadership-team-with-appointment-of-donald-patrick-as-coo.html", "ord_in_thread": 0, "title": "Fluent Expands Leadership Team with Appointment of Donald Patrick as COO", "locations": [], "entities": {"persons": [{"name": "busi", "sentiment": "negative"}, {"name": "donald patrick", "sentiment": "negative"}, {"name": "patrick", "sentiment": "none"}, {"name": "don", "sentiment": "none"}, {"name": "ryan schulke", "sentiment": "none"}, {"name": "schulke", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "merkle executive joins fluent as company prepares for international expansion", "sentiment": "negative"}, {"name": "llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Former Merkle Executive Joins Fluent as Company Prepares for International Expansion\nNEW YORK--(BUSINESS WIRE)-- Fluent, LLC, a cogint company (NASDAQ: COGT) and a leading provider of digital performance marketing solutions, today announced that the Company has appointed Donald Patrick, an executive with over 20 years of operational experience in the technology, data and marketing services industries, as Chief Operating Officer. Effective immediately, Patrick officially joined Fluent and reports to Fluent’s CEO, Ryan Schulke. Patrick will spearhead Fluent’s commercial growth initiatives, including international expansion and further activating across addressable channels to provide brands and marketers with a more robust set of solutions for customer acquisition, retention and loyalty.\n\"We are excited to welcome Don to the Fluent team,” said Schulke. “His outstanding record of accomplishments as a marketing leader is sure to drive success as Fluent expands its reach and product capabilities.”\nPatrick is an experienced executive recognized for driving expansive growth across diverse enterprises, including that of data-driven, technology-enabled performance marketing agency Merkle. Prior to Fluent, Patrick recently served as CEO of Seneca One, a financial services company in the lottery and structured settlement industries, as well as President of Infogroup Targeting Solutions and COO at Merkle. He was an original member of the Merkle executive team that grew the business from $6 million to over $300 million in revenue.\n“I am very excited to join the Fluent management team as the Company executes its continued expansion both domestically and internationally,” commented Patrick. “Given the changing landscape in the digital marketing industry over the years and Fluent’s unique model and capabilities, I am very optimistic about Fluent’s prospects for growth in both the near and long-term.”\nPatrick graduated from the University of Chicago with a Master of Business Administration and St. Lawrence University with a Bachelor of Arts.\nAbout Fluent\nFluent LLC, a cogint company, is an industry leader in people-based digital marketing and customer acquisition, serving over 500 leading consumer brands and direct marketers. Leveraging a unique data-driven platform, Fluent enables advertisers to more effectively target and acquire their most valuable customers, with precision, at a massive scale. The company is headquartered in New York City.\nAbout cogint™\nAt cogint, we believe that time is your most valuable asset. Through powerful analytics, we transform data into intelligence, in a fast and efficient manner, so that our clients can spend their time on what matters most – running their organizations with confidence. Through leading-edge, proprietary technology and a massive data repository, our data and analytical solutions harness the power of data fusion, uncovering the relevance of disparate data points and converting them into comprehensive and insightful views of people, businesses, assets and their interrelationships. We empower clients across markets and industries to better execute all aspects of their business, from managing risk, conducting investigations, identifying fraud and abuse, and collecting debts, to identifying and acquiring new customers. At cogint, we are dedicated to making the world a safer place, to reducing the cost of doing business, and to enhancing the consumer experience.\nRELATED LINKS: http://www.fluentco.com and http://www.cogint.com\nForward-Looking Statements\nThis press release contains \"forward-looking statements,\" as that term is defined under the Private Securities Litigation Reform Act of 1995 (PSLRA), which statements may be identified by words such as \"expects,\" \"plans,\" \"projects,\" \"will,\" \"may,\" \"anticipate,\" \"believes,\" \"should,\" \"intends,\" \"estimates,\" and other words of similar meaning. Such forward-looking statements include whether Mr. Patrick will drive success as Fluent expands its reach and product capabilities and whether Fluent’s unique model and capabilities will bring growth in both the near and long-term. Readers are cautioned not to place undue reliance on these forward-looking statements, which are based on our expectations as of the date of this press release and speak only as of the date of this press release and are advised to consider the factors listed above together with the additional factors under the heading \"Forward-Looking Statements\" and \"Risk Factors\" in the Company's Annual Report on Form 10-K, as may be supplemented or amended by the Company's Quarterly Reports on Form 10-Q and other SEC filings. We undertake no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180105005363/en/\nNorth 6th Agency, Inc. (For Fluent)\nShauna Garriques, 212-334-9753 ext. 145\nfluent@n6a.com\nSource: Fluent, LLC", "external_links": ["http://www.businesswire.com/news/home/20180105005363/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cogint.com&esheet=51738450&newsitemid=20180105005363&lan=en-US&anchor=http%3A%2F%2Fwww.cogint.com&index=2&md5=1a5b841bd0f94cebd7b0958a5736abd7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.fluentco.com&esheet=51738450&newsitemid=20180105005363&lan=en-US&anchor=http%3A%2F%2Fwww.fluentco.com&index=1&md5=06445e6d6e7d59d66b608bf6238d4ba4"], "published": "2018-01-05T16:30:00.000+02:00", "crawled": "2018-01-05T18:06:23.022+02:00", "highlightTitle": ""}