{"organizations": [], "uuid": "09a027085145575c73da0fa8ef0ca302ae84801e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-weisslaw-llp-files-class-action-lawsuit-against-time-inc.html", "country": "US", "domain_rank": 767, "title": "WeissLaw LLP Files Class Action Lawsuit Against Time, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T20:44:00.000+02:00", "replies_count": 0, "uuid": "09a027085145575c73da0fa8ef0ca302ae84801e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-weisslaw-llp-files-class-action-lawsuit-against-time-inc.html", "ord_in_thread": 0, "title": "WeissLaw LLP Files Class Action Lawsuit Against Time, Inc.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 8, 2018 /PRNewswire/ -- WeissLaw LLP announced that a class action was commenced in the United States District Court for the Southern District of New York on behalf of shareholders of Time, Inc. (\"Time\") (NYSE: TIME) seeking to pursue remedies under the Securities Exchange Act of 1934 (the \"Exchange Act\") in connection with the proposed acquisition of Time by Meredith Corporation (\"Meredith\") (NYSE: MDP).\nOn November 26, 2017, Time and Meredith announced that they had entered into a definitive agreement pursuant to which Meredith will acquire all outstanding shares of Time in a cash transaction valued at approximately $2.8 billion (\"Proposed Transaction\"). Under the terms of the agreement, Time shareholders will receive $18.50 in cash for each share held.\nThe complaint seeks injunctive relief on behalf of the named plaintiff and all Time shareholders. The plaintiff is represented by WeissLaw, which has expertise in prosecuting investor class actions and extensive experience in actions involving financial fraud. The complaint further alleges that in an attempt to secure shareholder approval for the merger, the defendants filed a materially false and/or misleading Solicitation/Recommendation Statement with the SEC in violation of the Exchange Act. The omitted and/or misrepresented information is believed to be material to Time shareholders' ability to make an informed decision whether to tender their shares in support of the Proposed Transaction.\nIf you wish to serve as lead plaintiff, you must move the Court no later than sixty (60) days from today . If you wish to discuss this action or have any questions concerning this notice or your rights or interests, please contact plaintiff's counsel, Joshua M. Rubin of WeissLaw at 888.593.4771, or by e-mail at stockinfo@weisslawllp.com . Any member of the putative class may move the Court to serve as lead plaintiff through counsel of their choice, or may choose to do nothing and remain an absent class member.\nWeissLaw LLP has litigated hundreds of stockholder class and derivative actions for violations of corporate and fiduciary duties. We have recovered over a billion dollars for defrauded clients and obtained important corporate governance relief in many of these cases. If you have information or would like legal advice concerning possible corporate wrongdoing please email us at stockinfo@weisslawllp.com .\nView original content: http://www.prnewswire.com/news-releases/weisslaw-llp-files-class-action-lawsuit-against-time-inc-300579161.html\nSOURCE WeissLaw LLP", "external_links": ["http://www.prnewswire.com/news-releases/weisslaw-llp-files-class-action-lawsuit-against-time-inc-300579161.html"], "published": "2018-01-08T20:44:00.000+02:00", "crawled": "2018-01-09T09:40:36.927+02:00", "highlightTitle": ""}