{"organizations": [], "uuid": "7759670800b7787ae82aaa3327f1669ef60ae470", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223348841&w=1200&r=LYNXMPEE0I0UD", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-britain-ineos-autos/ineos-plan-to-build-british-4x4s-started-as-a-pub-chat-idUKKBN1F81IG", "country": "US", "domain_rank": 408, "title": "Ineos’ plan to build British 4X4s started as a pub chat", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T15:51:00.000+02:00", "replies_count": 0, "uuid": "7759670800b7787ae82aaa3327f1669ef60ae470"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-ineos-autos/ineos-plan-to-build-british-4x4s-started-as-a-pub-chat-idUKKBN1F81IG", "ord_in_thread": 0, "title": "Ineos’ plan to build British 4X4s started as a pub chat", "locations": [], "entities": {"persons": [{"name": "susanna twidale", "sentiment": "none"}, {"name": "ratcliffe", "sentiment": "none"}, {"name": "tom crotty", "sentiment": "none"}, {"name": "jim", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "ineos", "sentiment": "neutral"}, {"name": "reuters", "sentiment": "none"}, {"name": "land rover", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 1:28 PM / Updated 8 hours ago Ineos’ plan to build British 4X4s started as a pub chat Susanna Twidale 3 Min Read \nLONDON (Reuters) - What started as a discussion in a pub could end up creating as many as 1,500 jobs in Britain by late 2020 as privately-owned Ineos moves ahead with plans to build a new 4x4 vehicle, one of its directors told Reuters. \nIneos, better known as a chemical manufacturer, wants to build an offroader along the lines of Land Rover’s iconic Defender which ceased full production in 2016 after 68 years. \n“Jim (Ratcliffe, Ineos’ CEO) was a big fan of the Land Rover Defender,” Tom Crotty said in an interview, talking of the British billionaire’s disappointment when production ended. \n“It was initially a pub conversation. Why don’t we make one? But we are extremely serious about it and have around 200 engineers working on the product.” \nIneos plans to make around 25,000 vehicles a year, starting production in 2020, and has said it will make a decision this year on where they will be built. \nThe engineers, currently based in Germany, and the company would prefer to make them in a new factory in Britain, which could create 1,000-1,500 direct jobs, Crotty said. \n“Jim has a long held view that the decline of UK manufacturing needs to be reversed,” he said. \nRatcliffe has previously said he could invest 600 million pounds in a new British plant, but Crotty said this would also depend on the company receiving support from the government. \nWithout giving specifics he said several sites could be considered in Britain, while other options include setting up at an existing factory with spare capacity, likely in continental Europe, or manufacturing through a third party. \nIn an effort to boost Britain’s output and cope with upheaval caused by leaving the European Union, the government last year launched an industrial strategy. But support for the automotive industry has so far focused on development of electric and automated vehicles. \nCrotty said the company planned to make petrol, diesel and hybrid versions of the 4x4 but that current battery technology was unsuitable for making a full electric version due to the weight involved. \nBritain and parts of Europe are seeking to phase out traditional combustion engines, but Crotty said for some markets, such as sub-Saharan Africa, where electricity supplies are scarce, diesel is the only option. Reporting by Susanna Twidale; Editing by Mark Potter", "external_links": [], "published": "2018-01-19T15:51:00.000+02:00", "crawled": "2018-01-19T16:11:32.009+02:00", "highlightTitle": ""}