{"organizations": [], "uuid": "0d906cd656767294b3e96824801f6a0962134374", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-sunverge-names-jon-bode-cfo-and-earns-cleantech-100-award-for-third-consecutive-year.html", "country": "US", "domain_rank": 767, "title": "Sunverge Names Jon Bode CFO and Earns Cleantech 100 Award for Third Consecutive Year", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.522, "site_type": "news", "published": "2018-01-23T04:07:00.000+02:00", "replies_count": 0, "uuid": "0d906cd656767294b3e96824801f6a0962134374"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-sunverge-names-jon-bode-cfo-and-earns-cleantech-100-award-for-third-consecutive-year.html", "ord_in_thread": 0, "title": "Sunverge Names Jon Bode CFO and Earns Cleantech 100 Award for Third Consecutive Year", "locations": [], "entities": {"persons": [{"name": "jon bode", "sentiment": "negative"}, {"name": "martin milani", "sentiment": "none"}, {"name": "jon", "sentiment": "none"}, {"name": "sunverge", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "nexant", "sentiment": "none"}, {"name": "sunverge", "sentiment": "none"}], "organizations": [{"name": "sunverge energy", "sentiment": "negative"}, {"name": "global cleantech", "sentiment": "none"}, {"name": "cleantech group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO, Jan. 22, 2018 /PRNewswire/ -- Sunverge Energy announced today tech industry veteran Jon Bode has joined the company as Chief Financial Officer. Bode, who has spent more than 25 years in senior finance roles with tech startups, brings valuable SaaS experience to Sunverge as the company expands its software platform. He was most recently CFO of Nexant, a leading provider of grid management software to the utility industry.\nSunverge also announced its designation, for the third year in a row, as a Global Cleantech 100 \"Ones to Watch\" company. Selected out of 12,300 nominees from 61 countries, Sunverge's presence on Cleantech Group 's list, which recognizes the top private companies in clean technology, identifies it as one of the companies \"best positioned to solve tomorrow's clean technology challenge.\"\n\"The Cleantech 100 award validates our position as a leader in the rapidly growing distributed energy resource management market,\" said Sunverge CEO Martin Milani. \"By adding Jon to our management team, we gain the experience of someone who has successfully scaled organizations to $100 million run rates and his experience will be invaluable as we continue to advance and monetize the integration of distributed energy resources and smart devices into power grids globally.\"\n\"I'm excited to join Sunverge at such an important time in the company's evolution,\" said Bode. \"With global distributed energy resource capacity expected to reach more than 500 GW by 2026, the Sunverge platform is going to play an increasingly important role in helping utilities and energy service providers manage these disruptive technologies.\"\nThe Global Cleantech 100 List\nThe Global Cleantech 100 is a comprehensive list of private companies with the highest potential to make significant market impact within a 5- to 10-year timeframe. The complete list of 100 companies, representing the most innovative and promising ideas impacting the future of a wide range of industries, was revealed on January 22rd at the 16 th annual Cleantech Forum San Francisco: https://i3connect.com/gct100/the-list . The list is accompanied by a full report with commentary and insight on the 2018 Global Cleantech 100—authored by CTG, powered by data from i3, and sponsored by Chubb .\nFor complete information on Sunverge's leadership within the cleantech space, access i3 by visiting i3connect.com (CTG's leading market intelligence platform) and search for Sunverge. The complete list of Global Cleantech 100 Expert Panel members is available at https://i3connect.com/gct100/panelist . Download the report at: http://info.cleantech.com/GlobalCleantech100Report2017_GCT100Report2017Submit.html .\nAbout Sunverge Energy\nSan Francisco–based Sunverge Energy enables homeowners to efficiently manage their own renewable energy generation and helps utilities, retailers and solar power providers aggregate those renewable power sources into virtual power plants across neighborhoods, communities and entire service areas — reliably, effectively and intelligently. Founded in 2009, the company makes the Sunverge One, a fully integrated energy storage system, and the Sunverge Infinity, an energy management platform for managing third-party distributed energy resources. The Sunverge One and Sunverge Infinity increase energy reliability, strengthen the grid, and accelerate the adoption and integration of distributed renewable energy. Investors include AGL, the Southern Cross Renewable Energy Fund backed by the Australian Renewable Energy Agency (ARENA) and SB China Venture Capital (SBCVC), MITSUI & Co., Siemens Venture Capital, Total Energy Ventures International and VisIR. For more information, please visit www.sunverge.com or follow @Sunverge on Twitter.\nView original content with multimedia: http://www.prnewswire.com/news-releases/sunverge-names-jon-bode-cfo-and-earns-cleantech-100-award-for-third-consecutive-year-300586183.html\nSOURCE Sunverge Energy", "external_links": ["https://i3connect.com/gct100/panelist", "http://www.cleantech.com/", "https://i3connect.com/", "http://info.cleantech.com/GlobalCleantech100Report2017_GCT100Report2017Submit.html", "http://www.prnewswire.com/news-releases/sunverge-names-jon-bode-cfo-and-earns-cleantech-100-award-for-third-consecutive-year-300586183.html", "http://www.sunverge.com/", "http://www.chubb.com/", "https://i3connect.com/gct100/the-list"], "published": "2018-01-23T04:07:00.000+02:00", "crawled": "2018-01-23T04:04:33.169+02:00", "highlightTitle": ""}