{"organizations": [], "uuid": "49d493f63fea572f7ebb412a8c06ef3d76993ac2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 58, "shares": 58, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223093036&w=1200&r=LYNXMPEE0H1K3", "site_section": "http://feeds.reuters.com/reuters/technologyNews/", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-usa-congress-surveillance/senate-passes-bill-renewing-nsas-internet-surveillance-program-idUSKBN1F72JX", "country": "US", "domain_rank": 408, "title": "Senate passes bill renewing NSA's internet surveillance program", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T19:46:00.000+02:00", "replies_count": 0, "uuid": "49d493f63fea572f7ebb412a8c06ef3d76993ac2"}, "author": "", "url": "https://www.reuters.com/article/us-usa-congress-surveillance/senate-passes-bill-renewing-nsas-internet-surveillance-program-idUSKBN1F72JX", "ord_in_thread": 0, "title": "Senate passes bill renewing NSA's internet surveillance program", "locations": [], "entities": {"persons": [{"name": "dustin volzediting", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "chizu nomiyama", "sentiment": "none"}], "locations": [{"name": "shington", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "negative"}, {"name": "nsa", "sentiment": "negative"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "national security agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 5:47 PM / in an hour Senate passes bill renewing internet surveillance program Dustin Volz 3 Min Read \nWASHINGTON (Reuters) - The U.S. Senate on Thursday passed a bill to renew the National Security Agency’s warrantless internet surveillance program for six years with minimal changes, overcoming objections from civil liberties advocates that it undermined the privacy of Americans. \nThe legislation, which easily passed the House of Representatives last week, is expected to be signed into law by President Donald Trump by Friday. \nThursday’s 65-34 passage in the Senate was largely a foregone conclusion, after senators earlier this week cleared a 60-vote procedural hurdle, which split party lines and came within one vote of failing. \nPassage of the legislation marked a disappointing end to a years-long effort by a coalition of liberal Democrats and libertarian-leaning Republicans to redefine the scope of U.S. intelligence collection following the 2013 disclosures of classified surveillance secrets by former NSA contractor Edward Snowden. \nThe bill reauthorizes what is known as Section 702 of the Foreign Intelligence Surveillance Act, which gathers information from foreigners overseas but incidentally collects an unknown amount of communications belonging to Americans. Slideshow (15 Images) \nUnder Section 702, the NSA is empowered to eavesdrop on vast amounts of digital communications via American companies like Facebook Inc ( FB.O ), Verizon Communications Inc ( VZ.N ) and Alphabet Inc’s ( GOOGL.O ) Google. \nBut the program also incidentally scoops up Americans’ communications, including when they communicate with a foreign target living overseas. Intelligence analysts can then search those messages without a warrant. \nThe White House, U.S. intelligence agencies and congressional Republican leaders said the program is indispensable to national security. \nOpponents of the program said it allows the NSA and other intelligence agencies to grab data belonging to Americans in a way that represents an affront to the U.S. Constitution. \nThe bill passed by Congress does add a narrow warrant requirement for cases where the Federal Bureau of Investigation seeks emails related to an existing criminal investigation that has no relevance to national security. Privacy advocates said that essentially gave more protections to criminal suspects than ordinary Americans caught up in the program’s surveillance. Reporting by Dustin Volz; Editing by Chizu Nomiyama and Tom Brown", "external_links": [], "published": "2018-01-18T19:46:00.000+02:00", "crawled": "2018-01-18T20:01:42.006+02:00", "highlightTitle": ""}