{"organizations": [], "uuid": "2240f29ff3568bf1c44256730bf33ee17c80dc40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKCricketNews/", "section_title": "Reuters: Cricket News", "url": "https://uk.reuters.com/article/cricket-test-zaf-ind/cricket-inspired-india-rip-through-south-africa-to-set-up-victory-chance-idUKL8N1P31ZQ", "country": "US", "domain_rank": 408, "title": "Cricket-Inspired India rip through South Africa to set up victory chance", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T12:52:00.000+02:00", "replies_count": 0, "uuid": "2240f29ff3568bf1c44256730bf33ee17c80dc40"}, "author": "", "url": "https://uk.reuters.com/article/cricket-test-zaf-ind/cricket-inspired-india-rip-through-south-africa-to-set-up-victory-chance-idUKL8N1P31ZQ", "ord_in_thread": 0, "title": "Cricket-Inspired India rip through South Africa to set up victory chance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 10:54 AM / Updated a day ago Cricket-Inspired India rip through South Africa to set up victory chance Nick Said 3 Min Read \nCAPE TOWN, Jan 8 (Reuters) – India’s seamers exploited the lively Newlands wicket to tear through South Africa’s brittle batting line-up and leave themselves with a victory target of 208 at lunch on day four of the first test on Monday. \nIndia bowled South Africa out for 130 in their second innings as they took eight wickets for 65 to swing the test in their favour, though they must still bat last on a wicket offering pace, bounce and lateral movement. \nAfter the third day was a complete washout, South Africa resumed on 65 for two, but apart from a fighting 35 from AB de Villiers, they had no answer to the venom and accuracy of the Indian attack. \nThe home side’s chances of victory are also hampered by the loss of seamer Dale Steyn to a heel injury, and the fact that India will have five sessions and a good weather forecast to secure a win in the opening match of the three-game series. \nSouth Africa’s problems started early as they lost Hashim Amla (four) having added just one run to their overnight total when he was caught by Rohit Sharma at third slip off Mohammed Shami. \nAmla stood his ground believing the ball to have bounced and with television replays inconclusive, the soft signal of out from umpire Michael Gough stood. \nFrom then it was something of a procession as nightwatchman Kagiso Rabada (five) became Shami’s second victim, before debutant seamer Jasprit Bumrah (3-39) picked up the key wickets of Faf du Plessis (zero) and Quinton de Kock (eight), both caught by wicketkeeper Wriddhiman Saha. \nShami had Vernon Philander (nought) trapped lbw, and Bhuvneshwar Kumar accounted for Keshav Maharaj (15) and Morne Morkel (two) as Saha collected two more catches. \nSteyn limped to the wicket to try to hold up an end for an attacking De Villiers, but the latter was caught on the boundary by Kumar off Bumrah to end the innings. \nIndia were bowled out for 209 in their first innings and will need one less for victory this time round, though on the evidence of the morning session the wicket has become even more difficult to bat on. (Reporting by Nick Said, editing by Ed Osmond)", "external_links": [], "published": "2018-01-08T12:52:00.000+02:00", "crawled": "2018-01-09T11:04:30.015+02:00", "highlightTitle": ""}