{"organizations": [], "uuid": "f63ff4a7b8335decc5f091fb392278827c0a8f15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/business-wire-supervalu-reports-third-quarter-fiscal-2018-results.html", "country": "US", "domain_rank": 767, "title": "SUPERVALU Reports Third Quarter Fiscal 2018 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-10T14:45:00.000+02:00", "replies_count": 0, "uuid": "f63ff4a7b8335decc5f091fb392278827c0a8f15"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/business-wire-supervalu-reports-third-quarter-fiscal-2018-results.html", "ord_in_thread": 0, "title": "SUPERVALU Reports Third Quarter Fiscal 2018 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "minneapolis", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "supervalu", "sentiment": "negative"}, {"name": "associated grocers", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "adjusted ebitda", "sentiment": "none"}, {"name": "supervalu inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Consolidated net sales increased by $935 million, or 31%, over last year ’s third quarter Wholesale net sales increased by $982 million, or 52%, over last year ’s third quarter, including Unified Grocers that contributed approximately $860 million to net sales this year Third quarter net earnings from continuing operations of $18 million; Adjusted EBITDA of $96 million Completed acquisition of Associated Grocers of Florida in the fourth quarter\nMINNEAPOLIS--(BUSINESS WIRE)-- SUPERVALU INC. (NYSE: SVU) today reported third quarter fiscal 2018 consolidated net sales of $3.94 billion and net earnings from continuing operations of $18 million, or $0.46 per diluted share, which included $4 million of after-tax merger and integration costs and $1 million of after-tax store closure charges and costs. When adjusted for these items, third quarter fiscal 2018 net earnings from continuing operations were $23 million, or $0.61 per diluted share, which included a discrete tax benefit that contributed approximately $0.30 to net earnings from continuing operations per diluted share.\nNet loss from continuing operations for last year’s third quarter was $11 million, which included $25 million of net after-tax charges and costs comprised of a pension settlement charge, a goodwill impairment charge and store closure charges and costs, partially offset by a deferred income tax benefit. When adjusted for these items, third quarter fiscal 2017 net earnings from continuing operations were $14 million, or $0.35 per diluted share. See tables 1-7 for a reconciliation of GAAP to non-GAAP (adjusted) results appearing in this release.\n\"We're pleased to have completed our acquisition of AG Florida early in the fourth quarter,\" said President and CEO Mark Gross. \"The work done in the third quarter concluded with this deal which, combined with the acquisition of Unified Grocers earlier this fiscal year, demonstrates our commitment to the strategic growth of our Wholesale business. Furthermore, we're extremely pleased with the integration work at Unified and the progress made in that market.\"\n\"In addition to these recent acquisitions, we continue to achieve strong underlying growth in our Wholesale business,\" Gross continued. \"With the influx of significant new business in certain distribution centers, we experienced a larger-than-anticipated increase in expenses, but we're encouraged by the work we are doing to address those costs and believe they are manageable going forward. We remain committed to investing in our Wholesale business to drive future growth.”\nThird Quarter Results – Continuing Operations\nThird quarter net sales were $3.94 billion compared to $3.00 billion last year, an increase of $935 million or 31 percent. Total net sales within the Wholesale segment increased 52 percent. Retail identical store sales were negative 3.5 percent. Fees earned under services agreements in the third quarter were $33 million compared to $37 million last year.\nGross profit for the third quarter was $409 million and included merger and integration costs of $2 million. When adjusted for this item, gross profit was $411 million, or 10.5 percent of net sales. Last year’s third quarter gross profit was $407 million, or 13.6 percent of net sales. The gross profit rate decrease compared to last year is primarily due to the change in business segment mix, with Wholesale representing a larger portion of total sales and gross profit, and the contribution from Unified Grocers at a lower gross profit rate.\nSelling and administrative expenses in the third quarter were $370 million and included merger and integration costs of $3 million and store closure charges and costs of $3 million. When adjusted for these items, selling and administrative expenses were $364 million, or 9.3 percent of net sales. Selling and administrative expenses in last year’s third quarter were $391 million and included a pension settlement charge of $41 million and store closure charges and costs of $1 million. When adjusted for these items, last year’s selling and administrative expenses were $349 million, or 11.6 percent of net sales. The decrease in the adjusted selling and administrative expense rate compared to last year was primarily driven by the change in business segment mix, with Wholesale representing a larger portion of total sales and selling and administrative expenses, and higher pension income, partially offset by higher employee-related costs.\nNet interest expense for the third quarter was $29 million compared to $40 million in last year’s third quarter. The decrease in interest expense was driven by lower average outstanding debt balances associated with the use of proceeds from the sale of Save-A-Lot.\nIncome tax benefit was $8 million, or negative 77.1 percent of pre-tax earnings, for the third quarter, compared to income tax benefit of $27 million, or 71.6 percent of pre-tax loss, in last year’s third quarter. This quarter's tax benefit was driven by a $12 million non-cash tax benefit from the release of certain tax reserves.\nSupervalu expects the newly enacted federal tax legislation to reduce future cash taxes, although it is still evaluating the favorable impact.\nWholesale\nThird quarter Wholesale net sales were $2.89 billion, compared to $1.91 billion last year, an increase of 52 percent. The net sales increase is primarily due to sales from the acquired Unified Grocers business, sales to new customers and increased sales to new stores operated by existing customers, partially offset by stores no longer operated by customers and lower military sales.\nWholesale operating earnings in the third quarter were $46 million and included $2 million of merger and integration costs. When adjusted for this item, third quarter Wholesale operating earnings were $48 million, or 1.7 percent of net sales. Last year’s third quarter Wholesale operating earnings were $52 million, or 2.7 percent of net sales. The decrease in adjusted Wholesale operating earnings, as a percent of net sales, was driven by the mix impact of the acquired Unified Grocers business contributing to operating earnings at a lower percent of net sales and higher trucking and logistics costs.\nRetail\nThird quarter Retail net sales were $1.02 billion, compared to $1.06 billion last year, a decrease of 4.1 percent. The net sales decrease reflects identical store sales of negative 3.5 percent and closed stores, partially offset by new and acquired store sales.\nRetail operating loss in the third quarter was $6 million and included $3 million in store closure charges and costs. When adjusted for this item, Retail operating loss in the third quarter was $3 million. Last year’s third quarter Retail operating loss was $14 million and included a $15 million goodwill impairment charge and $1 million of store closure charges and costs. When adjusted for these items, last year’s third quarter Retail operating earnings were $2 million, or 0.2 percent of net sales. The decrease in adjusted Retail o", "external_links": ["http://www.businesswire.com/news/home/20180110005319/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.supervaluinvestors.com&esheet=51740427&newsitemid=20180110005319&lan=en-US&anchor=www.supervaluinvestors.com&index=2&md5=89e1d2ebcb8d04c1e408f569ae5281fa", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.supervalu.com&esheet=51740427&newsitemid=20180110005319&lan=en-US&anchor=www.supervalu.com&index=3&md5=71742b51d026aed4b1f06ce1fa97988a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.supervaluinvestors.com&esheet=51740427&newsitemid=20180110005319&lan=en-US&anchor=www.supervaluinvestors.com&index=1&md5=92a9ec1850b0c30c4cb5c0b9971266d6"], "published": "2018-01-10T14:45:00.000+02:00", "crawled": "2018-01-10T16:33:07.033+02:00", "highlightTitle": ""}