{"organizations": [], "uuid": "a4b05eba4ff75d406d0995f4d61541cd6d82316f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/greek-sub-debt-comeback-conceivable-but/greek-sub-debt-comeback-conceivable-but-stress-tests-a-hurdle-idUSL8N1PO2BA", "country": "US", "domain_rank": 408, "title": "Greek sub debt comeback conceivable, but stress tests a hurdle", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.88, "site_type": "news", "published": "2018-01-30T21:19:00.000+02:00", "replies_count": 0, "uuid": "a4b05eba4ff75d406d0995f4d61541cd6d82316f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/greek-sub-debt-comeback-conceivable-but/greek-sub-debt-comeback-conceivable-but-stress-tests-a-hurdle-idUSL8N1PO2BA", "ord_in_thread": 0, "title": "Greek sub debt comeback conceivable, but stress tests a hurdle", "locations": [], "entities": {"persons": [{"name": "alice gledhill", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "portugal", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "national bank of greece", "sentiment": "none"}, {"name": "piraeus bank", "sentiment": "none"}, {"name": "eurobank", "sentiment": "none"}, {"name": "ikb deutsche industriebank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Buoyant market receptive to weaker credits\n* Greek issuance unlikely prior to May’s stress tests\nBy Alice Gledhill\nLONDON, Jan 30 (IFR) - Greek banks could attempt to raise subordinated debt after strong conditions reopened the door for many of the banking sector’s black sheep, though some say it is far too early and that they will have to wait until after May’s stress tests.\nSome of Europe’s weakest institutions charged back into the bond market in 2017 and early 2018, touting cleaned-up balance sheets and helped by investors’ desperation for decent yields in a world of central bank easing.\nIKB Deutsche Industriebank, one of the first lenders to topple in the 2007 financial crisis, was the latest such example, finding over €1.3bn of demand last week for an unrated €300m 4% 10-year non-call five-year Tier 2.\nAfter successful bank transactions out of Spain, Italy and Portugal, the spotlight has inevitably shifted to the Greek lenders after their debt was effectively wiped out in 2015 to help plug a €14.4bn capital hole.\nThe big four - National Bank of Greece, Eurobank, Piraeus Bank and Alpha Bank - have all issued covered bonds since October, but bankers believe a sale of riskier subordinated debt is also feasible.\n“The Greek banks are looking into re-entering the market,” said one. “Some are even thinking they can get an Additional Tier 1 done. If IKB can do Tier 2, the Greek banks can as well.”\nBut others view a comeback prior to the European Central Bank’s stress tests of the Greek banks, planned for May, as impossible.\n“I don’t know if the term ‘no smoke without fire’ applies here,” said a second banker.\nWhile the rally in Greek sovereign debt is encouraging, one Greek bank official said there are no plans to issue at this stage. His bank would ideally issue debt before returning to the equity market, but that is by no means a given.\n“It depends really, if it is something we have to do, or if it is something we do out of our own initiative - these are two different things,” he said.\n“The rational thing here is to wait for the stress test results, and see how the next day looks for Greece, and re-examine all the options.”\nHIDDEN RISKS? It is easy to see the source of bankers’ optimism.\nA €750m 5.375% 10NC5 Tier 2 (Caa2/CCC+) sold by Italian problem child Banca Monte dei Paschi earlier in January was more than three-times subscribed, despite previous bondholders seeing their securities wiped out to permit the injection of government funds. It has since rallied to 5%.\nBut numerous question marks hang over the Greek economy and the recovery of its banking system. The country has struggled to reduce its pile of non-performing loans, Europe’s highest, which stood at 46% of total exposures at year-end 2016.\nFurthermore, their comparatively high capital ratios are tempered by a heavy reliance on deferred tax assets, the value of which could be undermined by regulatory changes, leaving banks vulnerable.\nMichael Hunseler, managing director at Assenagon Asset Management, said he would not buy Greek bank subordinated debt now even if capital ratios look fine.\n“These ratios are ultimately derived from risk assets, and you need to trust those numbers and the underlying risk,” he said.\n“We’ve seen it several times where typically it’s not the erosion of capital ratio which leads to panic, it’s more the perception that there are some hidden risks and that credit portfolios might be worst than anticipated, and then all of a sudden, those banks die of liquidity death.”\nPATIENCE IS A VIRTUE While the cost of subordinated debt has plummeted in the past year, it is arguably still too punitive for Greek lenders.\nEurobank gave a glimpse into where a Tier 2 might clear in the public market when it replaced €950m of government-held preference shares that had lost regulatory value with Tier 2 earlier in January.\nThose securities, also sold to the state, carried a 6.4% coupon, but bankers said that may not have been sufficient to twist the arm of private investors.\n“What do the banks get from putting Tier 2 out there at 7% or 8%, prior to the stress tests?” said another DCM banker. “If they have a good stress test, is it really a good return to market at a punitive level?”\nHe reckoned AT1 would be a stretch given the pools out of which coupons are paid look too low, years of accumulative losses having depleted reserves.\nOn the other hand, that situation should improve as the Greek banks edge into profitability.\n“Banks might start considering some nominal payments at some point, as shareholders have been injecting capital for the last few years with no return whatsoever,” said Nondas Nicolaides, a senior credit officer at Moody‘s. (Reporting by Alice Gledhill, editing by Helene Durand, Julian Baker)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T21:19:00.000+02:00", "crawled": "2018-01-31T16:26:00.009+02:00", "highlightTitle": ""}