{"organizations": [], "uuid": "3eb839d2c31e6d241e35f674c8515d11b8990ad4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/12/104466724-GettyImages-678094372.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/2018-may-bring-disastrous-geopolitical-event-says-eurasia-group.html", "country": "US", "domain_rank": 767, "title": "2018 may bring disastrous geopolitical event, says Eurasia Group", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.132, "site_type": "news", "published": "2018-01-02T18:16:00.000+02:00", "replies_count": 0, "uuid": "3eb839d2c31e6d241e35f674c8515d11b8990ad4"}, "author": "Tom Dichristopher", "url": "https://www.cnbc.com/2018/01/02/2018-may-bring-disastrous-geopolitical-event-says-eurasia-group.html", "ord_in_thread": 0, "title": "2018 may bring disastrous geopolitical event, says Eurasia Group", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "cliff kupchan", "sentiment": "none"}, {"name": "ian bremmer", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "eurasia group nicholas kamm | afp", "sentiment": "negative"}, {"name": "eurasia group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The world is moving toward crisis and a state of \"geopolitical depression\" as the presidency of Donald Trump accelerates divisions among citizens and the unraveling of the global order, risk consultancy Eurasia Group warns.\nLiberal democracies are suffering from a deficit of legitimacy not seen since World War II, and today's leaders have largely abandoned civil society and common values, Eurasia Group says in its annual assessment of top geopolitical risks . The breakdown in norms opens the door to a major event that could rock the global economy and markets.\n\"In the 20 years since we started Eurasia Group, the global environment has had its ups and downs. But if we had to pick one year for a big unexpected crisis — the geopolitical equivalent of the 2008 financial meltdown — it feels like 2018,\" said Eurasia Group President Ian Bremmer and Chairman Cliff Kupchan.\nU.S. global power is \"sputtering to a stall\" as the Trump philosophy of retrenchment and unilateralism sows confusion among both allies and rivals, Eurasia Group says. The world now lacks leadership to steer it through the impending crisis.\n\"'America First' and the policies that flow from it have eroded the U.S.-led order and its guardrails, while no other country or set of countries stands ready or interested in rebuilding it … significantly increasing global risk.\"\nHere are Eurasia Group's top risks in 2018:\nChina will fill the vacuum left by the United States In the absence of U.S. leadership, China faces less resistance in setting the international standards in trade and investment, technology development and the value of noninterference in other countries' affairs. This could force businesses to adapt to a new set of rules and may increase tensions with the Asia-Pacific region's more democratic powers.\nMiscalculations spark conflict The world has become more dangerous because there is no global power to underwrite security and many subnational and nonstate actors can carry out destablizing actions. Cyberattacks and terrorism are two top risks, but there is also the chance of a miscalculation leading to conflict as North Korea continues to test ballistic missiles in a region full of U.S. allies and as the United States and Russia back rival factions in Syria.\nTechnology cold war The United States and China are racing to dominate areas like artificial intelligence and supercomputing, setting up a battle to supply other countries with civilian infrastructure, consumer goods and security equipment. This could lead to a fragmented tech space in which China and countries in its sphere of influence seek to control the flow of information and the United States guards against foreign investment in American tech companies.\nTough year for Mexico Mexico and investors in its economy will suffer more than the United States if NAFTA negotiations do not succeed this year. A presidential campaign that begins in March will make it difficult for Mexican candidates to accept tough compromises with an antagonistic Trump administration.\nDeteriorating U.S.-Iran relations The Trump administration has announced a more aggressive strategy to clamp down on Iran's nuclear program and involvement in foreign affairs. This raises a number of risks, including that the 2015 Iran nuclear deal dissolves, tensions lead to a deadly conflict in the Persian Gulf or another regional theater and a more assertive Saudi Arabia takes the U.S. stance as a green light for actions that escalate tensions.\nFalling trust in democratic institutions The rise of an \"increasingly toxic antiestablishment sentiment\" is eroding trust in political institutions in democratic countries, as well as the media and the electoral system in the United States. Weakness in these institutions can lead to instability, authoritarianism, unpredictable policy and conflict.\nRise of protectionism 2.0 Countries are using nontraditional measures — bailouts, subsidies and \"buy local\" requirements — to protect intellectual property and technology, a trend that can be called \"protectionism 2.0.\" This could lead to a surge in protectionism, a more complex and contradictory regulatory environment, and resentment among countries whose policies are seen to target one another.\nBrexit gets tougher to manage The United Kingdom is moving toward a phase of its separation from the European Union that will bring more difficult negotiations, including designing a border for Northern Ireland and finalizing the U.K.'s divorce bill. Prime Minister Theresa May needs to clarify the U.K.'s goals to reach a deal with Europe, but as she reveals her hand, her leadership may be challenged by rival political factions with contradicting priorities.\nIdentity politics in southern Asia Islamism in Indonesia and Malaysia, Indian nationalism, and anti-Chinese and anti-minority sentiment across southern Asia are on the rise in countries that are growing more prosperous. These strains of identity politics can contribute to instability and protectionism and bleed over into economic policy in ways that damage the business environment.\nAfrica becomes less stable The relatively stable countries of Africa like Ivory Coast, Nigeria, Kenya and Ethiopia are vulnerable to spillover from less secure nations, increased threats of terrorism and their own inability to support their weaker neighbors. Some of these countries will have to allocate more money for security costs and could see foreign direct investment fall if increased violence rattles already shaky investor sentiment.", "external_links": [], "published": "2018-01-02T18:16:00.000+02:00", "crawled": "2018-01-02T18:27:12.002+02:00", "highlightTitle": ""}