{"organizations": [], "uuid": "e1653df886059a3616cc4fc59e79e2b073f7331b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/domesticNews/", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-new-york-food/wage-dispute-at-ny-citys-main-produce-market-could-lead-to-strike-idUSKBN1F52K2", "country": "US", "domain_rank": 408, "title": "Wage dispute at NY City's main produce market could lead to strike", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T21:59:00.000+02:00", "replies_count": 0, "uuid": "e1653df886059a3616cc4fc59e79e2b073f7331b"}, "author": "", "url": "https://www.reuters.com/article/us-new-york-food/wage-dispute-at-ny-citys-main-produce-market-could-lead-to-strike-idUSKBN1F52K2", "ord_in_thread": 0, "title": "Wage dispute at NY City's main produce market could lead to strike", "locations": [], "entities": {"persons": [{"name": "peter szekely", "sentiment": "none"}, {"name": "dan kane", "sentiment": "none"}], "locations": [{"name": "ny city", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "south bronx", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "teamsters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - The market that supplies New York City with most of its fresh fruits and vegetables faces the prospect of its first work stoppage since 1986 if last-ditch bargaining on Tuesday fails to bridge pay differences in a contract covering 1,100 warehouse workers.\nEmployers at the sprawling Hunts Point Terminal Produce Market said they were confident an agreement could be reached, but the president of the union said he believed a strike was more likely than not after the current contract expires at midnight.\n“I‘m not very optimistic that we’re going to get a settlement, let’s put it that way,” said Dan Kane, president of Teamsters union Local 202, which represents the workers.\nWorkers who load and unload trucks and sort fruits and vegetables for 35 produce merchants operating at the South Bronx facility rejected a management offer of a pay raise of 30 cents an hour on Saturday and authorized union leaders to call a strike if necessary. Kane said the union has not issued a strike deadline.\nThe employers, who are represented by the New York Produce Trade Association, expressed optimism that a strike could be averted, while vowing to keep the market open if the talks fail and workers walk off the job.\n“Discussions are ongoing and we are confident that both sides can come to an agreement to avoid a work stoppage,” the group’s board said in a statement.\nThe Hunt’s Point market says it supplies 60 percent of New York City’s food. It is the city’s central distribution point for fruits and vegetables that are shipped in from all over the world and delivered to restaurants, grocery stores, wholesalers and hotels.\nThe union was seeking a raise of 75 cents an hour for workers, whose annual pay ranges from $45,000 to $55,000, depending on length of service, work schedules and overtime, Kane said.\nA key goal for the union is to bridge a pay gap under which new workers make almost $2 an hour less than longer-serving workers, a provision that was agreed to during the 2009 recession, he said.\n“We rolled with the punches then and now we want to see that these folks are at least addressed,” Kane added.\nA management representative declined to discuss the substance of the negotiations.\nReporting by Peter Szekely; Editing by Leslie Adler\n ", "external_links": [], "published": "2018-01-16T21:59:00.000+02:00", "crawled": "2018-01-16T22:10:48.005+02:00", "highlightTitle": ""}