{"organizations": [], "uuid": "54c663cc6ed91ffec5fdeeb4196e6d58048af1ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226300025&w=1200&r=LYNXMPEE0S0XN", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-africanunion-summit-nile/egypt-ethiopia-and-sudan-hope-to-break-nile-dam-talks-deadlock-in-one-month-idUSKBN1FI1LC", "country": "US", "domain_rank": 408, "title": "Egypt, Ethiopia and Sudan hope to break Nile dam talks deadlock in one month", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T15:12:00.000+02:00", "replies_count": 0, "uuid": "54c663cc6ed91ffec5fdeeb4196e6d58048af1ab"}, "author": "", "url": "https://www.reuters.com/article/us-africanunion-summit-nile/egypt-ethiopia-and-sudan-hope-to-break-nile-dam-talks-deadlock-in-one-month-idUSKBN1FI1LC", "ord_in_thread": 0, "title": "Egypt, Ethiopia and Sudan hope to break Nile dam talks deadlock in one month", "locations": [], "entities": {"persons": [{"name": "abdel fattah al-sisi", "sentiment": "none"}, {"name": "aaron maasho", "sentiment": "none"}, {"name": "omar hassan al-b", "sentiment": "none"}], "locations": [{"name": "egypt", "sentiment": "none"}, {"name": "sudan", "sentiment": "none"}, {"name": "ethiopia", "sentiment": "none"}, {"name": "cairo", "sentiment": "none"}, {"name": "addis ababa", "sentiment": "none"}], "organizations": [{"name": "min read  addis ababa", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 1:12 PM / in 9 minutes Egypt, Ethiopia and Sudan hope to break Nile dam talks deadlock in one month Aaron Maasho 3 Min Read \nADDIS ABABA (Reuters) - The leaders of Ethiopia, Egypt and Sudan on Monday set a one-month deadline for laying out the ways to break a deadlock in talks over a mega dam Addis Ababa is building along its share of the Nile, an official said. \nEgypt and Ethiopia are at loggerheads over the construction of the Grand Renaissance Dam, a $4 billion-hydroelectric project that Cairo fears will reduce waters that run to its fields and reservoirs from Ethiopia’s highlands and via Sudan. \nEthiopia, which is financing the project alone and hopes to become the continent’s biggest power generator and exporter, dismisses the claims. Sudan supports the dam because it will regulate floods and provide electricity and irrigation. \nTalks between the three governments have stalled for months over disagreement on the wording of a study on the dam’s environmental impact. \nOn Monday, Egypt’s President Abdel Fattah al-Sisi and his Sudanese counterpart Omar Hassan al-Bashir met Ethiopian Prime Minister Hailemariam Desalegn on the sidelines of an African Union summit in the Ethiopian capital Addis Ababa. \n“They instructed their water and energy ministers to draw up in one month a report that thrashes out ways to resolve all outstanding issues regarding the dam,” an Ethiopian official who attended the talks told Reuters. \nThe leaders have also agreed to hold heads of state meetings annually, and to set up a fund with the aim of building infrastructure such as a railway linking the three countries, he said. \nAt the meeting, Hailemariam said the project “was never intended to harm any country but to fulfil vital electricity needs and enhance development cooperation in the region”, according to a report by state-run Ethiopian Broadcasting Corporation. \nEgypt, Sudan and Ethiopia have agreed to finish the initial technical study within one month, the Egyptian state news agency said, citing the foreign minister. \nTensions over the use of the world’s longest river have long simmered between the Egypt and Ethiopia, raising fears the disputes could eventually boil over into conflict. \nA major source of disagreement over the construction of the Grand Renaissance Dam is the speed at which its reservoir would be filled. \nNow over 60 percent complete, the dam will produce 6,000 MW upon completion. It is centerpiece to Ethiopia’s ambitious power exporting plans. \nSudan and Ethiopia have also previously expressed concern over a proposed baseline from which a study by a French firm commissioned to assess the dam’s environmental and economic impact would measure the dam’s effects. Additional reporting by Nadine Awadalla in Cairo; Editing by Katharine Houreld and Matthew Mpoke Bigg", "external_links": [], "published": "2018-01-29T15:12:00.000+02:00", "crawled": "2018-01-29T15:23:02.004+02:00", "highlightTitle": ""}