{"organizations": [], "uuid": "2b12505b3fcdcb94ee27c81912ae8c53009f0c6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WW632_3mlUp_TOP_20180107235519.jpg", "site_section": "https://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/cmo-today-golden-globes-ratings-slip-viacom-acquires-whosay-endeavor-to-buy-160over90-1515502461", "country": "US", "domain_rank": 387, "title": "CMO Today: Golden Globes Ratings Slip; Viacom Acquires WhoSay; Endeavor to Buy 160over90", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T15:54:00.000+02:00", "replies_count": 0, "uuid": "2b12505b3fcdcb94ee27c81912ae8c53009f0c6b"}, "author": "Lara O’Reilly", "url": "https://www.wsj.com/articles/cmo-today-golden-globes-ratings-slip-viacom-acquires-whosay-endeavor-to-buy-160over90-1515502461", "ord_in_thread": 0, "title": "CMO Today: Golden Globes Ratings Slip; Viacom Acquires WhoSay; Endeavor to Buy 160over90", "locations": [], "entities": {"persons": [{"name": "digiday", "sentiment": "none"}, {"name": "oprah winfrey", "sentiment": "none"}], "locations": [{"name": "vegas", "sentiment": "none"}], "organizations": [{"name": "viacom", "sentiment": "negative"}, {"name": "new york times", "sentiment": "none"}, {"name": "medialink", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "nielsen", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Good morning. It was “media day” at the CES technology trade show Monday. As usual, lots of new gadgets were on display for the super techies. ( The Verge has wall-to-wall coverage .) For many media and advertising execs, the key mission of the day was getting down to the annual invite-only MediaLink party at the Encore nightclub. Expect more marketing-related news from the show over the coming days as more execs touch down in Vegas and CES really gets into its swing. Make sure to check out Digiday’s “what’s in and what’s out” guide so you’re fully versed on all the talking points—and what *not* to bring up in conversation over the roulette wheels.\nGolden Globes Losing Their Sparkle? The Golden Globes grabbed the headlines Sunday as women’s rights took center stage and Oprah Winfrey delivered a speech so powerful that there’s speculation she may run for president. So awards broadcaster NBC, and the many brands such as Facebook and the New York Times that aired ads during the telecast, might have been expecting a ratings bonanza. Not so, according to Nielsen figures provided by the TV network. As CMO Today’s Alex Bruell reports, the 75th Golden Globe Awards brought in 19 million viewers, a 5% decline from last year’s 20 million . That said, the Golden Globes still ranked as the most-watched entertainment show in prime time since the Academy Awards last February, according to NBC. And while TV ratings might be declining—as they are across the board—awards broadcasters like NBC can point to how people flood to social feeds on the night as red-carpet events are guaranteed to create considerable online buzz.\nSay You, Say Me The in-house creative agency is certainly no longer a rare concept. Media firms ranging from digital natives to newspapers and TV networks have jumped on the trend in recent years as companies look to diversify their revenue streams from 30-second spots and display advertising. Viacom is the latest to enhance its in-house creative chops, announcing Monday that it has agreed to acquire influencer marketing agency Whosay , CMO Today’s Alex Bruell reports. Terms weren’t disclosed. Viacom has long worked with brands to develop unique content around tentpole events such as MTV’s Video Music Awards, but now it wants to use Whosay as an “engine to allow us to do this on a 52-week basis,” Viacom ad sales chief Sean Moran said. The plan is for Whosay to take a client’s marketing goal and, within a couple of days, develop a creative concept, find high-profile talent to feature, then distribute the content through Viacom’s various TV and digital platforms.\nClever Endeavor While we’re on the theme of acquisitions and stories from CMO Today’s Alex, here’s another: Endeavor, the new name for the entertainment conglomerate formed after WME’s acquisition of IMG, has agreed to buy branding and marketing agency 160over90 . Terms weren’t disclosed, but a person familiar with the matter said the price was around the $200 million mark. The agency will join Endeavor’s Global Marketing division, which recently picked up experiential agencies Fusion Marketing and IMG LIVE and has a stake in Droga5. What’s the plan for 160over90? It’s all about adding digital marketing and branding services expertise and using 160over90 to expand its business with professional sports leagues and brands. More “bolt-on” acquisitions are on the way, Endeavor hinted. With this, Viacom-Whosay and news that Accenture Interactive has completed its acquisition of France-based digital commerce shop Altima all coming on the same day, it’s a buoyant time to run an independent agency, as the pool of strategic buyers has extended far beyond the traditional agency holding companies.\nAlex(a)isonfire All the 2018 advertising predictions mentioned it, execs at CES are going to endlessly bleat on about it, and magazine publisher Hearst wants to make sure it’s way out ahead and on top of it. I’m talking about voice, of course. Business Insider reports Hearst is going “all in” on Amazon’s Alexa platform, having already rolled out “skills” including daily horoscopes from Elle magazine and a twice-a-day mini podcast called My Beauty Chat. By getting in early, Hearst is creating new daily voice habits for its audience ahead of competitors. And the experiment is already making money: L’Oréal is a sponsor of My Beauty Chat, and Hearst has set a 2018 priority to use Alexa to “acquire customers, retain users, [and make] money on it.” The data speaks to the size of the opportunity and why Hearst is making Amazon’s device a priority: EMarketer estimates 45.4 million Americans will use a voice-enabled smart speaker this year. Last year, eMarketer says 68% of smart speaker users used an Amazon Echo, and 25% were on a Google Home.\nBest of the rest James Damore, the former Google engineer who was fired over a memo he sent suggesting men were better suited for certain tech jobs, and another former Google engineer have filed a lawsuit claiming the search giant discriminates against conservative white men. Google said, “We look forward to defending against Mr. Damore’s lawsuit in court.” The suit comes shortly after former female Google employees filed a suit against the company, alleging it discriminates against women. [ WSJ ]\nFacebook is shutting down its M text-based virtual assistant, a human-assisted artificial-intelligence platform that lived in Messenger. The company said it would use the insights gathered to power other artificial-intelligence projects at Facebook, and staffers who worked on it will be offered other jobs at the company. [ The Verge ]\nAltice is spinning off its controlling stake in its U.S. arm as part of a broader reorganization that will split the highly acquisitive company in two: Altice Europe and Altice USA. [ WSJ ]\nMediaocean has signed a deal with Adobe Marketing Cloud to help marketers integrate their digital and TV ad buying. [ Axios ]\nPop star The Weeknd has cut ties with H&M after the retailer sparked a backlash for featuring an image on its website of a black child wearing a hooded top with the slogan “coolest monkey in the jungle.” H&M, which has removed the image from the site and the garment from sale, issued statements to apologize, saying it will “thoroughly investigate” the incident. [ Variety ]\nIntuit has bought its first Super Bowl ad for its own, corporate brand. The company also purchased its fifth consecutive spot for its TurboTax brand. [ Ad Age ]\nAbout Us Follow us on Twitter: @wsjCMO , @larakiara , @VranicaWSJ , @alexbruell , @BenMullin , @srabil , @asharma\nSubscribe to our morning newsletter, delivered straight to your inbox, at http://on.wsj.com/CMOTodaySignup .\nWrite to Lara O’Reilly at lara.oreilly@wsj.com", "external_links": ["http://www.businessinsider.com/hearst-is-betting-on-amazon-alexa-2018-1", "https://twitter.com/VranicaWSJ", "http://adage.com/article/special-report-super-bowl/intuit-air-super-bowl-ad-corporate-brand-turbotax-returns-game/311842/", "https://www.google.co.uk/amp/variety.com/2018/music/news/the-weeknd-cut-ties-hm-1202657822/amp/", "https://digiday.com/media/the-definitive-digiday-guide-to-whats-in-and-whats-out-for-ces-2018/", "https://twitter.com/BenMullin", "http://www.adweek.com/brand-marketing/facebook-finds-reasons-to-hope-in-this-artful-portrait-based-ad-from-the-golden-globes/", "https://www.hollywoodreporter.com/news/new-york-times-metoo-ad-air-golden-globes-2018-1071828", "https://www.axios.com/exclusive-massive-shakeup-in-digital-tv-buying-1515450406-fd1e0161-5044-4aac-9582-cc89a4db5fc9.html", "https://twitter.com/wsjCMO", "https://twitter.com/srabil", "https://www.theverge.com/2018/1/8/16863054/ces-2018-lg-sony-samsung-panasonic-tcl-toyota-qualcomm", "https://twitter.com/larakiara", "https://www.theverge.com/2018/1/8/16856654/facebook-m-shutdown-bots-ai", "https://twitter.com/alexbruell", "https://twitter.com/asharma", "https://www.businesswire.com/news/home/20180108005162/en/Accenture-Completes-Acquisition-Altima-Strengthening-Leading-Customer"], "published": "2018-01-09T15:54:00.000+02:00", "crawled": "2018-01-09T16:06:42.000+02:00", "highlightTitle": ""}