{"organizations": [], "uuid": "8a18f27d4ff0d37ea8ae606af9e318e298a9be37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-wheaton-precious-metals-announces-new-precious-metals-purchase-agreement-with-first-majestic-in-conjunction-with-primeros-sale.html", "country": "US", "domain_rank": 767, "title": "Wheaton Precious Metals Announces New Precious Metals Purchase Agreement with First Majestic in Conjunction with Primero's Sale of the San Dimas Mine", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-12T14:30:00.000+02:00", "replies_count": 0, "uuid": "8a18f27d4ff0d37ea8ae606af9e318e298a9be37"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-wheaton-precious-metals-announces-new-precious-metals-purchase-agreement-with-first-majestic-in-conjunction-with-primeros-sale.html", "ord_in_thread": 0, "title": "Wheaton Precious Metals Announces New Precious Metals Purchase Agreement with First Majestic in Conjunction with Primero's Sale of the San Dimas Mine", "locations": [], "entities": {"persons": [{"name": "primero", "sentiment": "none"}], "locations": [{"name": "vancouver", "sentiment": "none"}, {"name": "san dimas", "sentiment": "none"}], "organizations": [{"name": "primero", "sentiment": "neutral"}, {"name": "san dimas mine tsx", "sentiment": "neutral"}, {"name": "wheaton precious metals™ corp.", "sentiment": "neutral"}, {"name": "wheaton precious metals", "sentiment": "neutral"}, {"name": "first majestic silver corp.", "sentiment": "none"}, {"name": "wheaton international", "sentiment": "none"}, {"name": "wheaton precious metals international ltd.", "sentiment": "none"}, {"name": "primero mining corp.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TSX: WPM\nNYSE: WPM\nVANCOUVER, Jan. 12, 2018 /PRNewswire/ - Wheaton Precious Metals™ Corp. (\"Wheaton\" or the \"Company\") announces that its wholly owned subsidiary Wheaton Precious Metals International Ltd. (\"Wheaton International\") has agreed to a new precious metals purchase agreement (the \"First Majestic PMPA\") relating to the San Dimas mine, in conjunction with the proposed transaction announced today under which First Majestic Silver Corp. (\"First Majestic\") will acquire Primero Mining Corp. (\"Primero\") pursuant to a plan of arrangement (the \"Arrangement\").\nWheaton International has agreed to terminate the existing San Dimas silver purchase agreement with Primero (the \"Existing SPA\") and enter into the First Majestic PMPA, which includes the following terms:\n25% of gold production plus an additional amount of gold equal to 25% of silver production converted to gold at a fixed gold to silver exchange ratio of 70:1 1 from San Dimas For each ounce of gold delivered, Wheaton International will pay to First Majestic a production payment equal to the lesser of US$600/oz, subject to a 1% annual inflationary adjustment, and the prevailing market price First Majestic to provide a corporate guarantee; security to be limited to San Dimas assets Area of interest that is subject to the First Majestic PMPA remains unchanged from the Existing SPA 2\nAs part of the transaction, in addition to the new stream Wheaton International will receive 20,914,590 First Majestic common shares reflecting an aggregate value of US$151 million 3 (the \"First Majestic Shares\").\n\"San Dimas has operated for over 130 years and is the mine Wheaton was founded on in 2004. With the new streaming arrangement being linked to a combination of gold and silver production, we believe San Dimas will continue to deliver significant value to Wheaton for many years to come while also providing economic and social opportunities to the community of Tayoltita,\" said Randy Smallwood, President and Chief Executive Officer of Wheaton. \"First Majestic has a long history of operating in Mexico and an expertise in mining narrow vein underground deposits similar to San Dimas. Given their experience and a renewed focus on mining the entire deposit, including the silver rich areas, we are excited to welcome First Majestic as a partner.\"\nThe termination of the Existing SPA and the effectiveness of the First Majestic PMPA remain subject to a number of conditions, including completion of the Arrangement. The First Majestic Shares will represent approximately 11% of First Majestic's current issued and outstanding shares and will be subject to a six month hold period (subject to certain exceptions) with volume selling restrictions thereafter.\nIn addition, at the time of closing of the Arrangement, Wheaton International has agreed to release the guarantee previously provided by Goldcorp Inc. (\"Goldcorp\") under the Existing SPA in consideration for a payment of US$10 million from Goldcorp to Wheaton International. Furthermore, the US$0.50 per ounce penalty for each ounce less than 215 million ounces delivered by 2031 will be extinguished.\nIn order to facilitate the closing of the Arrangement, Wheaton also announces that it has agreed to extend the guarantee previously provided by Wheaton and certain of its subsidiaries under Primero's existing revolving credit facility to the earlier of April 30, 2018, and the completion or termination of the Arrangement.\nImpact to Wheaton Precious Metals\nThe silver stream on San Dimas represented on average approximately 10% of Wheaton's total historical production over the past three years at approximately 5.4 million silver ounces per year. Under the First Majestic PMPA, San Dimas is expected to contribute on average approximately 40,000 to 45,000 ounces of gold production 4 annually to Wheaton's total production over the next five years. The Company will update its five-year average annual guidance for both silver and gold when it releases its fourth quarter and full year results for 2017.\nMineral Reserves and Resources will be updated under due course in the first half of 2018 and include any changes due to the amendments to the stream subject to the successful closing of the Arrangement.\nAdvisors and Counsel\nBMO Capital Markets acted as financial advisor and Cassels Brock & Blackwell LLP and Goodmans LLP acted as legal counsel to Wheaton.\nEnd Notes\n1 If the average gold to silver price ratio decreases to less than 50:1 or increases to more than 90:1 for a period of 6 months or more, then the \"70\" shall be revised to \"50\" or \"90\", as the case may be, until such time as the average gold to silver price ratio is between 50:1 to 90:1 for a period of 6 months or more in which event the \"70\" shall be reinstated.\n2 Wheaton has a right of first refusal on certain areas outside of the current area of interest. In addition, to the extent ore from certain areas outside of the current area of interest is processed through the San Dimas' mill, such ore will be subject to the stream.\n3 Number of First Majestic Shares is based on the 20-day volume weighted average price of the First Majestic common shares ending as of January 10, 2018, which common shares will be issuable upon termination of the Existing SPA.\n4 Gold production is based on a silver / gold ratio of 70:1.\nCAUTIONARY NOTE REGARDING FORWARD LOOKING-STATEMENTS\nThe information contained herein contains \"forward-looking statements\" within the meaning of the United States Private Securities Litigation Reform Act of 1995 and \"forward-looking information\" within the meaning of applicable Canadian securities legislation. Forward-looking statements, which are all statements other than statements of historical fact, include, but are not limited to, statements with respect to:\nstatements with respect to the completion of the Arrangement; statements with respect to the termination of the Existing SPA and the payments to be made to Wheaton International, including the delivery of the US$151 million in First Majestic Shares; statements with respect to the termination of the Goldcorp guarantee and the payment to be made to Wheaton International; statements with respect to the satisfaction of the conditions relating to the First Majestic PMPA, payment by Wheaton International of US$220 million and the satisfaction of each party's obligations in accordance with the First Majestic PMPA; the receipt by the Company of gold and gold equivalent production in respect of the San Dimas mine; the ability to sell the First Majestic Shares after the expiry of hold periods and the value that may be realized for such First Majestic Shares; future payments by the Company in accordance with precious metal purchase agreements, including any acceleration of payments, estimated throughput and exploration potential; projected increases to Wheaton Precious Metals' production and cash flow profile; the expansion and exploration potential at the Salobo and San Dimas mines; projected changes to Wheaton Precious Metals' production mix; anticipated increases in total throughput; the effect of the SAT legal claim on Primero's business, financial condition, results of operations and cash flows for 2010-2014 and 2015-2019; the impact on Primero of the unionized employee strike at the San Dimas mine which concluded in April 2017 and any other labour disruptions; the ability of Primero to continue as a going concern; the abil", "external_links": [], "published": "2018-01-12T14:30:00.000+02:00", "crawled": "2018-01-12T15:51:26.010+02:00", "highlightTitle": ""}