{"organizations": [], "uuid": "e1422ea506effe2f65055c906291d8bd0b9cae17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-synchronoss-welcomes-mary-clark-as-chief-marketing-officer-and-executive-vice-president.html", "country": "US", "domain_rank": 767, "title": "Synchronoss Welcomes Mary Clark as Chief Marketing Officer and Executive Vice President", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-09T16:30:00.000+02:00", "replies_count": 0, "uuid": "e1422ea506effe2f65055c906291d8bd0b9cae17"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-synchronoss-welcomes-mary-clark-as-chief-marketing-officer-and-executive-vice-president.html", "ord_in_thread": 0, "title": "Synchronoss Welcomes Mary Clark as Chief Marketing Officer and Executive Vice President", "locations": [], "entities": {"persons": [{"name": "mary clark", "sentiment": "negative"}, {"name": "clark", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "synchronoss", "sentiment": "none"}], "organizations": [{"name": "syniverse", "sentiment": "none"}, {"name": "synchronoss technologies, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mobile industry veteran to lead product division while driving company’s marketing efforts\nBRIDGEWATER, N.J.--(BUSINESS WIRE)-- Synchronoss Technologies, Inc. (NASDAQ:SNCR) (the “Company” or “Synchronoss”), a global leader and innovator in cloud, messaging and digital products, has appointed Mary Clark as its new Chief Marketing Officer and Executive Vice President of Product. Ms. Clark offers more than 25 years of mobile industry experience. She is a highly visible and well-respected industry thought leader, regularly speaking at major global industry events, on a wide range of issues. In her new role at Synchronoss, Ms. Clark will be responsible for product management, marketing and communications.\nPrior to joining Synchronoss, Ms. Clark served as Chief Corporate Relations Officer and Chief of Staff at Syniverse. Previously, she acted as Chief Marketing Officer and Senior Vice President of Roaming. During her tenure, she was a key player across many areas of the business: from running global financial settlements and delivering the first real-time intelligence solutions to the roaming market, to leading a successful acquisition and merger with MACH of Luxemburg. Additionally, in 2017 Ms. Clark was awarded a Silver Anvil Award from the Public Relations Society of America for a campaign that put Syniverse in the center of the discussion for mobile engagement for brands and enterprises.\n“I’ve had the pleasure of knowing Mary for more than seven years, and have seen firsthand the impact, respect and influence she has built in the industry. I can personally attest to not only her talent, but also her warm and engaging character,” said Glenn Lurie, Chief Executive Officer and President of Synchronoss. “Mary will be an exceptional addition, and a phenomenal fit within our existing executive team. She is a world-class leader and we are thrilled to welcome her and know she will be a strategic driver of our future success.”\nMs. Clark has served as a Board member for the Competitive Carriers Association, and the CTIA Wireless Foundation, and currently serves on the CMO Advisory Council. She has been a contributing writer for Global Telecoms Business and CMO.com and has several honors to her name, including being named to the National Diversity Council’s “Top 50 Most Powerful Women in Technology” list in 2016 and 2017. Ms. Clark earned her Bachelor of Arts in communications from the University of Delaware.\n“Synchronoss is uniquely positioned to capitalize on a wealth of new opportunity in the Telecom, Media and Technology industries,” said Mary Clark, Chief Marketing Officer, Synchronoss. “Its market-leading offers in cloud, messaging and digital transformation have the power to disrupt and revolutionize how carriers and technology companies engage, monetize, and retain their customers. Synchronoss has a long and proud history in achieving real differentiation through high quality customer experience. I am proud to work with Glenn and his executive team to keep Synchronoss at the forefront as the partner technology companies need to drive growth in this dynamic ecosystem.”\nAbout Synchronoss\nSynchronoss (NASDAQ: SNCR) transforms the way companies create new revenue, reduce costs and delight their subscribers with cloud, messaging and digital products supporting hundreds of millions of subscribers across the globe. Synchronoss’ secure, scalable and groundbreaking new technologies, trusted partnerships and talented people change the way TMT customers grow their business. For more information, visit us at www.synchronoss.com\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180109005777/en/\nRed Lorry Yellow Lorry\nUS:\nKerry Quintiliani, 781-479-7475\nsynchronoss@rlyl.com\nor\nCCgroup\nInternational:\nSarah Walker, +44 20 3824 9200\nsynchronoss@ccgrouppr.com\nSource: Synchronoss Technologies, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fapps.prsa.org%2FAwards%2FSilverAnvil%2F%23.Wk6q10xFzsY&esheet=51740161&newsitemid=20180109005777&lan=en-US&anchor=Silver+Anvil+Award&index=1&md5=0ae7b318cb376b4f80fd00c510f41f0d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.synchronoss.com&esheet=51740161&newsitemid=20180109005777&lan=en-US&anchor=www.synchronoss.com&index=3&md5=90f72fac34bab0069fd8620828e4e1ba", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Ftop50tech.org%2F2017%2F&esheet=51740161&newsitemid=20180109005777&lan=en-US&anchor=National+Diversity+Council%27s+%E2%80%9CTop+50+Most+Powerful+Women+in+Technology%E2%80%9D+list&index=2&md5=42cce10da3c6cbe82e18cb7490553d78", "http://www.businesswire.com/news/home/20180109005777/en/"], "published": "2018-01-09T16:30:00.000+02:00", "crawled": "2018-01-09T17:40:35.019+02:00", "highlightTitle": ""}