{"organizations": [], "uuid": "9efd3cd7b7697bbe8418cf180d17dfe4a2d2fd28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226973965&w=1200&r=LYNXMPEE0U137", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/usa-stocks/boeing-leads-wall-street-higher-after-two-day-slump-idINKBN1FK23A", "country": "US", "domain_rank": 408, "title": "Wall Street cuts gains after Fed sees rising inflation", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T21:43:00.000+02:00", "replies_count": 0, "uuid": "9efd3cd7b7697bbe8418cf180d17dfe4a2d2fd28"}, "author": "", "url": "https://in.reuters.com/article/usa-stocks/boeing-leads-wall-street-higher-after-two-day-slump-idINKBN1FK23A", "ord_in_thread": 0, "title": "Wall Street cuts gains after Fed sees rising inflation", "locations": [], "entities": {"persons": [{"name": "caroline valetkevitch", "sentiment": "none"}, {"name": "mike terwilliger", "sentiment": "none"}, {"name": "kevin logan", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "wall street", "sentiment": "negative"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "resource credit income fund", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. economist", "sentiment": "none"}, {"name": "hsbc securities", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 2:47 PM / in 6 minutes Wall Street ends off day's highs as Fed sees inflation rising Stephen Culp 4 Min Read \n(Reuters) - U.S. stocks finished marginally higher on Wednesday as indexes gave up early gains after the Federal Reserve said it sees inflation rising this year, signalling it remains on track to boost interest rates again in March. \nThe Fed kept rates unchanged but, in a statement following its two-day policy meeting, it repeated that it expected that “further gradual” rate hikes will be warranted. \n“The subtle message is that they will continue to press rates higher,” said Scott Kimball, director and portfolio manager at BMO Global Asset Management. \nThe central bank raised rates three times last year and sees three additional hikes in 2018 even as it continues to trim its balance sheet on a largely pre-set schedule. \n“They’re more confident in their expectations of rising inflation,” said Kevin Logan, Chief U.S. Economist at HSBC Securities. \nBolstering the Fed’s view of a solid economy, ADP published a report on Wednesday showing 234,000 private sector jobs added in January compared with 185,000 expected by analysts. The U.S. Labor Department is due to release its more comprehensive report on Friday. \nThe Dow Jones Industrial Average rose 73.74 points, or 0.28 percent, to 26,150.63, the S&P 500 gained 1.47 points, or 0.05 percent, to 2,823.9 and the Nasdaq Composite added 9.00 points, or 0.12 percent, to 7,411.48. \nStocks were lifted earlier Wednesday by a surge in Boeing which forecast better-than-expected full-year profits and said it expects to deliver a record number of commercial aircraft in 2018, sending its shares up 4.9 percent. \nThe aerospace giant was the biggest percentage gainer on the Dow, helping pull the blue-chip index out of its biggest two-day plunge since September 2016. \nThe selloff earlier in the week had been prompted by an increase in U.S. Treasury yields to multi-year highs. The U.S. yield curve flattened to a decade low following the Fed statement as traders sold more short-dated Treasuries. \nFacebook shares dipped more than 4 percent in after-market trading after the social media giant reported results. \nAmong the S&P 500’s 11 major sectors, technology gave the biggest boost to the index. \nHealthcare stocks continued to weigh on the three major U.S. indexes following a report on Tuesday that Amazon.com, Berkshire Hathaway and JPMorgan Chase were joining forces to cut healthcare costs for its U.S. employees. The S&P 500 healthcare index fell 1.5 percent. \nAnalysts expect fourth-quarter S&P 500 earnings growth of 13.7 percent, up from 12 percent expected at the start of the month. So far, 37 percent of companies in the index have reported and 80.5 percent have come in above consensus estimates. \nAdvancing issues outnumbered declining ones on the NYSE by a 1.14-to-1 ratio; on Nasdaq, a 1.61-to-1 ratio favoured decliners. \nThe S&P 500 posted 34 new 52-week highs and 3 new lows; the Nasdaq Composite recorded 82 new highs and 48 new lows. \nVolume on U.S. exchanges was 8.05 billion shares, above the 7.18 billion average for the full session over the last 20 trading days. Reporting by Stephen Culp; additional reporting by Kate Duguid; Editing by Nick Zieminski", "external_links": [], "published": "2018-01-31T21:43:00.000+02:00", "crawled": "2018-01-31T22:06:48.020+02:00", "highlightTitle": ""}