{"organizations": [], "uuid": "94545c656270c8d879fe3123f3c7719b9c87402b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-crowdstrike-expands-operations-within-japan-registers-massive-growth-in-region.html", "country": "US", "domain_rank": 767, "title": "CrowdStrike Expands Operations Within Japan, Registers Massive Growth in Region", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T05:00:00.000+02:00", "replies_count": 0, "uuid": "94545c656270c8d879fe3123f3c7719b9c87402b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-crowdstrike-expands-operations-within-japan-registers-massive-growth-in-region.html", "ord_in_thread": 0, "title": "CrowdStrike Expands Operations Within Japan, Registers Massive Growth in Region", "locations": [], "entities": {"persons": [{"name": "kawai", "sentiment": "none"}, {"name": "tetsuya kawai", "sentiment": "none"}, {"name": "crowdstrike", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}], "organizations": [{"name": "region company", "sentiment": "negative"}, {"name": "symantec", "sentiment": "none"}, {"name": "crowdstrike® inc.", "sentiment": "none"}, {"name": "attachmate group", "sentiment": "none"}, {"name": "verizon", "sentiment": "none"}, {"name": "apac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Company announces leadership expansion and triple-digit growth within region; continues to actively grow and invest within APAC\nTOKYO--(BUSINESS WIRE)-- CrowdStrike® Inc., the leader in cloud-delivered endpoint protection, today announced its rapid expansion of customer growth, new business opportunities, and operations in Japan, alongside the company’s explosive growth within the APAC region. CrowdStrike is also announcing the appointment of a local leadership team.\nCrowdStrike has appointed Tetsuya Kawai as managing director of Japan to lead business growth and operational expansion within the region. An industry veteran, Kawai previously held senior roles at Verizon, Symantec, The Attachmate Group and HP. CrowdStrike continues to invest in Japan, building out its regional salesforce with supporting functions in sales engineering, marketing, and channel sales. CrowdStrike is currently looking to recruit the top technical and sales talent within the region, and plans to make a number of strategic hires by the end of 2018.\nSince expanding its local presence and go-to market opportunities, including its channel and reseller ecosystem, CrowdStrike has seen growing momentum in its business, operations, and sales. According to “ITR Market View Endpoint / Sanitization / Internet Separation Market 2017,” published in November 2017 by ITR Corporation, a consulting and research firm in Japan, CrowdStrike has been ranked as #1 in market share in the endpoint detection and response (EDR) market in Japan for three years in a row. This is based on revenue estimates from 2015 to 2017.\nIn Japan, business growth milestones registered within the first half of the year include:\n204 percent growth in total annual contract value, year-over-year growth 208 percent growth in new annual contract value, year-over-year Doubled the total number of customers, year-over-year\nThe hiring of Kawai is one of multiple strategic hires aimed at continuing investment in the APAC region. CrowdStrike’s operations within APAC currently include Japan, Australia, New Zealand, Singapore, and India.\n“Having been in the security marketplace for over a decade, I can state with certainty that CrowdStrike has taken the industry by storm with its holistic and innovative approach to endpoint security technology, services, and intelligence. This compelling approach to meeting the needs of modern-day organizations has resulted in CrowdStrike’s rapid momentum in Japan,” said Tetsuya Kawai, managing director, CrowdStrike Japan.\nCrowdStrike Falcon® is the only platform that unifies next-generation antivirus (AV), endpoint detection and response (EDR), and a 24/7 threat hunting service — all delivered via a single lightweight agent.\nWith its cloud-based approach, CrowdStrike Falcon allows security professionals to gain instant visibility into threat activity and immediate time-to-value with the technology, unlike legacy AV solutions. Having established presence in Japan five years ago, CrowdStrike today serves a rapidly growing customer base that includes customers in top industries such as manufacturing, banking, government, technology, gaming and more.\n“We are proud of our strong and longstanding partnership with CrowdStrike since 2013. We have also experienced the rapidly increasing customer demand for CrowdStrike’s technology protecting endpoint devices in Japan. Defending against modern-day threats is CrowdStrike’s compelling, next-generation approach, which highlights their strength in the local market. Organizations using CrowdStrike Falcon can improve their efficacy and reliability dramatically over legacy AV offerings,” said president Ikeda of Macnica Networks Corp.\nWith multiple new office openings across the APAC region,CrowdStrike is fulfilling an increasing demand for its unique cloud-based endpoint protection platform as more and more organizations look to replace their AV or augment it with advanced endpoint detection and response capabilities.\nAbout CrowdStrike®\nCrowdStrike is the leader in cloud-delivered endpoint protection. Leveraging artificial intelligence (AI), the CrowdStrike Falcon® platform offers instant visibility and protection across the enterprise and prevents attacks on endpoints on or off the network. CrowdStrike Falcon deploys in minutes to deliver actionable intelligence and real-time protection from Day One. It seamlessly unifies next-generation AV with best-in-class endpoint detection and response (EDR), backed by 24/7 managed hunting. Its cloud infrastructure and single-agent architecture take away complexity and add scalability, manageability, and speed.\nCrowdStrike Falcon protects customers against all cyber attack types, using sophisticated signatureless AI and Indicator-of-Attack (IoA) based threat prevention to stop known and unknown threats in real time. Powered by the CrowdStrike Threat Graph™, Falcon instantly correlates over 78 billion security events a day from across the globe to detect and prevent threats.\nLearn more: https://www.crowdstrike.com/\nFollow us: Blog | Twitter\n© 2018 CrowdStrike, Inc. All rights reserved. CrowdStrike®, CrowdStrike Falcon®, CrowdStrike Threat Graph™, CrowdStrike Falcon Prevent™, Falcon Prevent™, CrowdStrike Falcon Insight™, Falcon Insight™, CrowdStrike Falcon Discover™, Falcon Discover™, CrowdStrike Falcon Intelligence™, Falcon Intelligence™, CrowdStrike Falcon DNS™, Falcon DNS™, CrowdStrike Falcon OverWatch™, Falcon OverWatch™, CrowdStrike Falcon Spotlight™ and Falcon Spotlight™ are among the trademarks of CrowdStrike, Inc. Other brands may be third-party trademarks.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006360/en/\nCrowdStrike, Inc.\nIlina Cashiola, 202-340-0517\nIlina.cashiola@crowdstrike.com\nSource: CrowdStrike, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.crowdstrike.com%2F&esheet=51747682&newsitemid=20180123006360&lan=en-US&anchor=https%3A%2F%2Fwww.crowdstrike.com%2F&index=1&md5=0f4d784a0a3fb3b37ac9ac24997f3a0d", "http://www.businesswire.com/news/home/20180123006360/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Fcrowdstrike&esheet=51747682&newsitemid=20180123006360&lan=en-US&anchor=Twitter&index=3&md5=efae7a2fe50d279dd00f6af9eacb61e1", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.crowdstrike.com%2Fblog%2F&esheet=51747682&newsitemid=20180123006360&lan=en-US&anchor=Blog&index=2&md5=66f0671c0722ec86720992ef6cd94e6d", "https://www.crowdstrike.com/"], "published": "2018-01-24T05:00:00.000+02:00", "crawled": "2018-01-24T06:04:57.000+02:00", "highlightTitle": ""}