{"organizations": [], "uuid": "85f0c6b389ae80d28109007b4f9a068b6d2a259f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221898437&w=1200&r=LYNXMPEE0D0AO", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-pope-migrants/fear-and-doubt-should-not-determine-response-to-immigrants-pope-says-idUKKBN1F30HS", "country": "US", "domain_rank": 408, "title": "Fear and doubt should not determine response to immigrants, Pope says", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T14:05:00.000+02:00", "replies_count": 0, "uuid": "85f0c6b389ae80d28109007b4f9a068b6d2a259f"}, "author": "", "url": "https://uk.reuters.com/article/uk-pope-migrants/fear-and-doubt-should-not-determine-response-to-immigrants-pope-says-idUKKBN1F30HS", "ord_in_thread": 0, "title": "Fear and doubt should not determine response to immigrants, Pope says", "locations": [], "entities": {"persons": [{"name": "pope", "sentiment": "negative"}, {"name": "reuters/max rossi  francis", "sentiment": "none"}, {"name": "francis", "sentiment": "none"}, {"name": "pope francis", "sentiment": "none"}, {"name": "peter", "sentiment": "none"}], "locations": [{"name": "st. peter’s basilica", "sentiment": "none"}, {"name": "vatican", "sentiment": "none"}], "organizations": [{"name": "vatican city", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 12:06 PM / Updated 9 hours ago Fear and doubt should not determine response to immigrants, Pope says Reuters Staff 2 Min Read \nVATICAN CITY (Reuters) - Mutual fears between immigrants and their new communities are understandable, but must not prevent new arrivals from being welcomed and integrated, Pope Francis said on Sunday in a special Mass to mark the World Day of Migrants and Refugees. Pope Francis speaks as he leads a special mass to mark International Migrants Day in Saint Peter's Basilica at the Vatican January 14, 2018. REUTERS/Max Rossi \nFrancis, a keen defender of the rights of migrants, was addressing a congregation including migrants and refugees from some 50 countries, whose flags festooned the area around the altar in St. Peter’s Basilica at the Vatican. \n“Local communities are sometimes afraid that the newly arrived will disturb the established order, will ”steal“ something they have long laboured to build up,” he said, while “the newly arrived ... are afraid of confrontation, judgement, discrimination, failure.” \n“Having doubts and fears is not a sin. The sin is to allow these fears to determine our responses, to limit our choices, to compromise respect and generosity, to feed hostility and rejection.” \nAs politicians and civil society grapple with the mass movement of people around the world, with flashpoints including in the Mediterranean, and between Myanmar and Bangladesh, the pope has repeatedly urged support for those who migrate. \nArgentina-born Francis, who was the first non-European elected to the post in nearly 1,300 years, has criticised President Donald Trump’s stated intention to build a wall to stop illegal migrants crossing the U.S. border with Mexico. \nThe leader of the world’s 1.2 billion Roman Catholics also met Muslim refugees in Myanmar and Bangladesh last year and called for decisive action to solve political problems that cause many to flee. \nOn Sunday, he said newcomers must “know and respect the laws, the culture and the traditions of the countries that take them in”. \nCommunities, meanwhile, have “to open themselves without prejudices to (newcomers’) rich diversity, to understand the hopes and potential of the newly arrived as well as their fears and vulnerabilities”. Reporting by Isla Binnie, editing by Louise Heavens", "external_links": [], "published": "2018-01-14T14:05:00.000+02:00", "crawled": "2018-01-14T14:20:25.001+02:00", "highlightTitle": ""}