{"organizations": [], "uuid": "33cd2ac738358fdb5924e7956d5647066278b4ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/kamala-harris-cory-booker.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/09/kamala-harris-cory-booker-senate-judiciary-committee/", "country": "US", "domain_rank": 1196, "title": "Kamala Harris, Cory Booker Join Senate Judiciary Committee | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.45, "site_type": "news", "published": "2018-01-09T02:00:00.000+02:00", "replies_count": 0, "uuid": "33cd2ac738358fdb5924e7956d5647066278b4ff"}, "author": "Claire Zillman", "url": "http://fortune.com/2018/01/09/kamala-harris-cory-booker-senate-judiciary-committee/", "ord_in_thread": 0, "title": "Kamala Harris, Cory Booker Join Senate Judiciary Committee | Fortune", "locations": [], "entities": {"persons": [{"name": "cory booker", "sentiment": "negative"}, {"name": "al franken", "sentiment": "negative"}, {"name": "kamala harris", "sentiment": "negative"}, {"name": "claire zillman", "sentiment": "negative"}, {"name": "chuck schumer", "sentiment": "none"}, {"name": "harris", "sentiment": "none"}, {"name": "doug jones", "sentiment": "none"}], "locations": [{"name": "decem", "sentiment": "none"}], "organizations": [{"name": "join senate judiciary committee", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "cbc", "sentiment": "none"}, {"name": "senate judiciary committee", "sentiment": "none"}, {"name": "judicial and finance committees", "sentiment": "none"}, {"name": "congressional black caucus", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Claire Zillman January 9, 2018 \nWhen Sen. Al Franken (D-Minn.) announced his resignation in December amid allegations of groping women, his exit didn’t just vacate a Senate seat; it opened up a spot on the high-profile Senate Judiciary Committee. \nThe Congressional Black Caucus jumped on the opportunity, urging Sen. Chuck Schumer (D-N.Y.), the minority leader, to fill the spot with either Cory Booker (D-N.J.) or Kamala Harris (D-Calif.). On Tuesday, Democrats met the CBC’s demand and then some, naming—in a somewhat surprising move—both lawmakers to the committee. \n(The second appointment was made possible by the election of Sen. Doug Jones (D-Ala.) in December, which narrowed the Republican advantage on the Judicial and Finance Committees.) \n“Thrilled to share that I’ve been appointed to the Senate Judiciary Committee,” Harris , a first-term senator elected in 2016, tweeted Tuesday. “You have my commitment that I will fight for justice on behalf of Californians and all Americans.” Thrilled to share that I've been appointed to the Senate Judiciary Committee. You have my commitment that I will fight for justice on behalf of Californians and all Americans. \n— Kamala Harris (@SenKamalaHarris) January 9, 2018 \nIn tweeting his appointment, Booker vowed to stand up to the Trump administration. As a new member of the Senate Judiciary Committee – I will make it my mission to stand up to Jeff Sessions & President Trump. \nAnd I won't rest until there is liberty & justice for all. Thread 👇🏽 pic.twitter.com/lfopZFefcB \n— Sen. Cory Booker (@SenBooker) January 9, 2018 \nIn a letter to Schumer in December urging the appointment of Harris or Booker—both of whom are attorneys—CBC chair Rep. Cedric Richmond (D-La.) said that black America is currently facing “the greatest threats to its rights and safety since the post-Reconstruction era.” \n“Given this pivotal moment in American history, the CBC urges you and the Senate Democratic Caucus to appoint a CBC Member to join Ranking Member [Diane] Feinstein and others in defense of our democracy, our values and our constitutional rights.” \nCivil rights groups had also called for the appointment of an African American senator, pointing out that only one black lawmaker had served on the committee over the course of its 201-year history. Sen. Carol Moseley-Braun (D-Ill.) served one term in the 1990s. \n“We are indeed at an unprecedented moment in history where a record number of African American Senators serve in Congress,” said the letter signed by leaders of the Lawyer’s Committee for Civil Rights Under Law, the NAACP, the NAACP Legal Defense and Educational Fund, The Leadership Conference on Civil and Human Rights, the National Action Network, the National Urban League, and the National Coalition on Black Civic Participation. “This vacancy creates the opportunity to further diversity the perspectives and voices overseeing issues that impact the most vulnerable communities in our country. We urge Senate Leadership to ensure that the voice of the African American community is reflected, not only in its mission, but in its makeup. In its 201 year history, only one Black Senator has served on @senjudiciary . We joined with six other racial and social justice organizations to urge that an African American Senator be chosen to fill the Committee's current vacancy. Read our letter: pic.twitter.com/Y8A8QMv8N7 \n— NationalActionNet (@NationalAction) December 13, 2017 \nOthers latched onto the idea of a Harris appointment as black women emerged as a dependable voter base for Democrats in two of the most recent high-profile elections: the special Senate race in Alabama and the Virginia gubernatorial race that saw Jones and Democrat Ralph Northam elected to office. \n“It’s time for another strong African American voice to be heard on the Judiciary Committee. Given the results of Virginia and Alabama, that voice should be a black woman’s. It should be Harris’s,” wrote Washington Post opinion writer Jonathan Capehart in December . \nOn Tuesday, Kristen Clarke, president and executive of the Lawyers’ Committee for Civil Rights Under Law, told Fortune that the appointments were “truly remarkable.” \n“The Senate Judiciary is arguably one of the most important committees,” she said, pointing to its handling of judicial nominations and matters like criminal justice reform and its role as a check on the power of the executive branch. \nThe Senate Judiciary Committee is—notably—one of several congressional committees undertaking an investigation into Russian interference in the 2016 election. \n“It’s important that this committee reflects the diversity of our country; that different perspectives are brought to bear,” Clarke said. \nIn addition to satisfying the CBC and civil rights groups, the two appointments will no doubt fuel speculation about Harris’s and Booker’s political futures. Even before they were named to one of the most prominent subcommittees in Congress, the two were considered 2020 Democratic presidential contenders. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-09T02:00:00.000+02:00", "crawled": "2018-01-10T21:27:27.013+02:00", "highlightTitle": ""}