{"organizations": [], "uuid": "72685482f370058abbfeece74d91dd4a7727d2ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/europe-stocks/live-markets-what-could-spoil-the-european-equity-party-idUSL8N1PC2DX", "country": "US", "domain_rank": 408, "title": "LIVE MARKETS-What could spoil the European equity party?", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T12:08:00.000+02:00", "replies_count": 0, "uuid": "72685482f370058abbfeece74d91dd4a7727d2ae"}, "author": "", "url": "https://www.reuters.com/article/europe-stocks/live-markets-what-could-spoil-the-european-equity-party-idUSL8N1PC2DX", "ord_in_thread": 0, "title": "LIVE MARKETS-What could spoil the European equity party?", "locations": [], "entities": {"persons": [{"name": "pearson", "sentiment": "none"}, {"name": "kit rees", "sentiment": "none"}, {"name": "danilo masoni", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "ubs", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "asml", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 09 AM / Updated 16 minutes ago LIVE MARKETS-What could spoil the European equity party? Reuters Staff 6 Min Read * European shares dip * Earnings in focus: ASML, Casino, Pearson * Informa agrees to buy UBM Jan 17 (Reuters) - Welcome to the home for real time coverage of European equity markets brought to you by Reuters stocks reporters and anchored today by Danilo Masoni. Reach him on Messenger to share your thoughts on market moves: danilo.masoni.thomsonreuters.com@reuters.net WHAT COULD SPOIL THE EUROPEAN EQUITY PARTY? (1007 GMT) On a day like today, it's sobering to consider what could go wrong for European equities. \"No one wants to be dancing when the music stops, but the last part of a bull market tends to produce some of the most powerful returns,\" UBS' strategists say in a note, predicting around 15 percent of total returns in European equities in 2018. UBS flags rising U.S. yields, euro strength, PMIs rolling over and volatility picking up as potential spanners in the works, though. (Kit Rees) EUROPE JOINS GLOBAL GLOOM, INTERSERVE FALLS IN POST-CARILLION SCARE (0820 GMT) As expected, European markets opened on a downward trend, in sync with a gloomy global mood which dampened Wall Street and Asian markets. All main bourses and sectors are down with the exception of tech, boosted by the results of ASML. British contractor Interserve is taking a 10 percent hit after the Financial Times reported that government ministers are \"very worried\" and have set up a team of officials to monitor the company following the collapse of competitor Carillion. Still in the UK but on a brighter note, events organiser UBM is surging 15 percent after a 3.8 billion pound bid from Informa. Here are the top movers on the STOXX 600 which is down 0.22 percent. (Julien Ponthus) WHAT YOU NEED TO KNOW (0748 GMT) European shares are expected to open lower today with index futures pointing to losses of around 0.1-0.4 percent, as markets pull back following a new year rally that a lifted the pan-European STOXX 600 benchmark to its highest since August 2015. Earnings are likely to be the main focus with ASML in the spotlight after the chip tool maker reported a better-than-expected net profit for the fourth quarter as several customers asked for early delivery of products amid a booming semiconductor industry. For 2018, the company said it expected continued solid growth of sales and profitability. Eyes also on retailer Casino, which said it would deliver on its 2017 profit growth forecasts despite posting slightly softer fourth quarter sales, and manufacturing group Alstom, which reported higher third-quarter sales and kept its 2020 financial targets. UK education group Pearson predicted underlying profit growth in 2018 despite ongoing pressures in its North American business. In M&A, Britain's Informa made a cash and paper offer to buy events organiser UBM , while Nestle agreed to sell its U.S. confectionery business to Italy's Ferrero for $2.8 billion. Baader Bank noted Nestle got an attractive price for a business that's losing market share. Interserve could be hit after the FT reported that the construction service provider was under UK government watch over financial health fears. Other stock movers: European car sales drop 4.8 pct in December, Rio Tinto says U.S. SEC fraud case should be dismissed; Novartis's Kymriah wins speedy reviews in U.S., Europe; UK cinema chain Cineworld's 2017 revenue grows as Star Wars, Dunkirk shine. (Danilo Masoni) FROM YESTERDAY'S \"HICCUP\" TO A BITCOIN-LIKE FALL (0725 GMT) What would it take? According to Rabobank, a trade war waged by Donald Trump on China has the potential to bring down global markets in the most dramatic way. \"The little hiccup we got in equities yesterday could -- perhaps -- start to look more like what Bitcoin just did\", it wrote in its morning note as world leaders nervously await the U.S. president's speech at the World Economic Forum in Davos next week. Here's bitcoin's fall these last three days: (Julien Ponthus) EUROPEAN STOCK FUTURES FALL (0702 GMT) Stock futures in Europe have opened in the red with declines of around 0.3 percent. (Danilo Masoni) TECH IN FOCUS AS ASML BEATS EXPECTATIONS (0634 GMT) The richly valued tech sector is one to watch this morning after the Dutch supplier of equipment to key chip makers reported a better-than-expected net profit for the fourth quarter. Several customers asked for early delivery of products amid a booming semiconductor industry, helping ASML's net profit rise to 644 million euros from 524 million euros. Analysts polled for Reuters had expected profit of 454 million euros. Tech stocks are leading sectoral gainers in Europe over the last 12 months but some investors say the sector's golden era may be over. (Danilo Masoni)", "external_links": [], "published": "2018-01-17T12:08:00.000+02:00", "crawled": "2018-01-17T12:26:31.009+02:00", "highlightTitle": ""}