{"organizations": [], "uuid": "da66eb9ff2d3f99d885d3460ec011357c4844d9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221898470&w=1200&r=LYNXMPEE0D0AP", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-pope-latam/church-credibility-in-focus-as-pope-heads-for-latin-america-idUSKBN1F30HU", "country": "US", "domain_rank": 408, "title": "Church credibility in focus as Pope heads for Latin America", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T14:06:00.000+02:00", "replies_count": 0, "uuid": "da66eb9ff2d3f99d885d3460ec011357c4844d9b"}, "author": "", "url": "https://www.reuters.com/article/us-pope-latam/church-credibility-in-focus-as-pope-heads-for-latin-america-idUSKBN1F30HU", "ord_in_thread": 0, "title": "Church credibility in focus as Pope heads for Latin America", "locations": [], "entities": {"persons": [{"name": "pope", "sentiment": "negative"}, {"name": "philip p", "sentiment": "negative"}, {"name": "fernando karadima", "sentiment": "none"}, {"name": "pope francis", "sentiment": "none"}, {"name": "francis", "sentiment": "none"}, {"name": "juan barros", "sentiment": "none"}, {"name": "karadima", "sentiment": "none"}, {"name": "barros", "sentiment": "none"}], "locations": [{"name": "latin america", "sentiment": "none"}, {"name": "vatican", "sentiment": "none"}, {"name": "chile", "sentiment": "none"}, {"name": "peru", "sentiment": "none"}, {"name": "osorno", "sentiment": "none"}], "organizations": [{"name": "catholic", "sentiment": "none"}, {"name": "vatican city", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "catholics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 12:06 PM / in 5 hours Church credibility in focus as Pope heads for Latin America Philip Pullella 5 Min Read \nVATICAN CITY (Reuters) - Pope Francis starts a trip to Chile and Peru on Monday, attempting to inject new confidence in the staunchly Catholic countries where the Church’s credibility has been severely damaged by sexual abuse scandals. \nOn his visit to Peru, the second leg of the Jan. 15-22 tour, Francis will also find a destabilizing political corruption crisis has reopened wounds from one of the country’s darkest periods of human rights abuses. \nIn Chile, where the Argentine pope arrives on Monday night, Catholics have planned daily protests against his 2015 appointment of Bishop Juan Barros to head the small diocese of Osorno, a small city south of the Chilean capital. \nBarros has been accused of protecting his former mentor, Father Fernando Karadima, whom a Vatican investigation in 2011 found guilty of abusing teenage boys over many years. Karadima has denied the allegations and Barros said he was unaware of any wrongdoing. \nThe situation for the Church was complicated last week by the leak in Chile of a 2015 letter from the pope to local bishops showing that the Vatican had planned to ask Barros to take a one-year leave at the end of his previous post in 2014. That plan went awry and Barros was appointed to Osorno. \n“The Church in Chile, which during the dictatorship of Augusto Pinochet enjoyed great prestige for its courageous defence of justice and human rights, has today lost much of its credibility with public opinion,” wrote papal biographer Andrea Tornielli. \nA poll by Santiago-based think tank Latinobarometro this month showed that the number of Chileans calling themselves Catholics fell to 45 percent last year, from 74 percent in 1995. \nThe pope will meet victims of the Pinochet dictatorship, which lasted from 1973 to 1990. \nVatican spokesman Greg Burke said the Church had “maximum respect” for those planning to protest against sexual abuse and did not exclude the possibility that the pope would meet victims privately, as he has on past trips. CHURCHES ATTACKED, POPE WARNED \nThere have been a series of attacks on Catholic churches in the capital ahead of the pope’s visit, including one with a home-made bomb where unidentified vandals left a pamphlet reading “Pope Francis, the next bomb will be in your robe”. \nNo one has been injured and no group has claimed responsibility for the attacks. \nAbuse scandals will also cast a shadow on the pope’s stop in Peru, where he arrives on Thursday. \nLast week Francis ordered the Vatican takeover of an elite Catholic society in Peru. The society’s founder is accused of sexually and physically abusing children and former members of the group. \nPolitical corruption and human rights are also likely to be in focus in a country divided over former autocrat leader Alberto Fujimori, whose pardon from prison by the current president has sparked national protests. \nFujimori, 79, had served less than half of a 25-year sentence for corruption and human rights crimes for commanding death squads to combat a Maoist-inspired insurgency during his 1990-2000 right-wing populist government. \nDuring a previous trip to Latin America Francis called corruption “the plague, it’s the gangrene of society”. \nA common thread linking the two countries is the pope’s defense of indigenous people. \nOn Tuesday he flies south to Temuco in Chile’s Araucania region, home of the Mapuche, who accuse the state and private companies of taking their ancestral land, stripping it of natural resources and of using heavy handed enforcement against their communities. \nPresident Michelle Bachelet last year asked for forgiveness from the Mapuche community for such “errors and horrors”. \nIn Peru, Francis will visit the Amazonian town of Puerto Maldonado where the indigenous people - including reclusive tribes that shun contact with outsiders - face risks ranging from wildcat gold mining, illegal logging and drug trafficking. \n“Their territory is increasingly being invaded, their space is becoming smaller and smaller; the livelihoods with which they have survived for so many centuries are being destroyed,” Father Manuel Jesus Romero told the newsletter of REPAM, a Pan-Amazonian Church Network. Additional reporting by Caroline Stauffer in Buenos Aires, Mitra Taj in Lima and Dave Sherwood in Santiago; Editing by David Goodman", "external_links": [], "published": "2018-01-14T14:06:00.000+02:00", "crawled": "2018-01-14T14:42:51.057+02:00", "highlightTitle": ""}