{"organizations": [], "uuid": "1b9e326b833f41ccfe4623d2702fc59264c38eb5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-bitauto-announces-changes-to-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Bitauto Announces Changes to Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.026, "site_type": "news", "published": "2018-01-26T13:00:00.000+02:00", "replies_count": 0, "uuid": "1b9e326b833f41ccfe4623d2702fc59264c38eb5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-bitauto-announces-changes-to-board-of-directors.html", "ord_in_thread": 0, "title": "Bitauto Announces Changes to Board of Directors", "locations": [], "entities": {"persons": [{"name": "rob huting", "sentiment": "none"}, {"name": "joseph luppino", "sentiment": "none"}, {"name": "huting", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "cox automotive international", "sentiment": "none"}, {"name": "atg group", "sentiment": "none"}, {"name": "cox automotive inc.", "sentiment": "none"}, {"name": "bita", "sentiment": "none"}, {"name": "cox automotive", "sentiment": "none"}, {"name": "autotrader group", "sentiment": "none"}, {"name": "continental europe for manheim retail services", "sentiment": "none"}, {"name": "corporate development", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING, Jan. 26, 2018 /PRNewswire/ -- Bitauto Holdings Limited (\"Bitauto\" or the \"Company\") (NYSE: BITA), a leading provider of internet content & marketing services, and transaction services for China's fast-growing automotive industry, today announced the appointment of Mr. Rob Huting as a director to its board of directors (\"the board\"), replacing Mr. Joseph Luppino, effective immediately.\nMr. Huting is currently Corporate Development, Vice President of Cox Automotive Inc., responsible for international M&A transactions. In addition, Mr. Huting is responsible for managing and developing existing and potential new strategic partnerships in emerging markets including Brazil, India and China. Cox Automotive, the parent company of Cox Automotive International, is also the parent company of AutoTrader Group, or ATG Group, which is a major shareholder of Bitauto. Prior to Mr. Huting's current role, he was General Manager for Autotrader Classics. Mr. Huting's previous positions include Managing Director Continental Europe for Manheim Retail Services, Director Sales and Marketing, and Director European Business Development for Manheim Europe. Mr. Huting holds a Masters of International Business Studies from the University of South Carolina.\nMr. William Li, chairman of Bitauto said, \"We are pleased to welcome Rob Huting to our board of directors. We have worked with Rob since ATG Group's initial investment in Bitauto in 2012, and we look forward to collaborating more closely in the future. With his deep knowledge of the automotive industry in the US, China and other international markets, Rob is a great addition to our board of directors, and we are confident that Bitauto will benefit from his experience and contributions. We would also like to express our sincere gratitude to Mr. Joseph Luppino for his dedication and valuable contributions over the past two years.\"\nAbout Bitauto Holdings Limited\nBitauto Holdings Limited (NYSE: BITA) is a leading provider of internet content & marketing services, and transaction services for China's fast-growing automotive industry. Bitauto manages its businesses in three segments: its advertising and subscription business, transaction services business and digital marketing solutions business.\nBitauto's advertising and subscription business provides a variety of advertising services mainly to automakers through its Bitauto.com website as well as corresponding mobile applications, which provide consumers with up-to-date automobile pricing and promotional information, specifications, reviews and consumer feedback. Bitauto also offers subscription services via its SaaS platform, which provides web-based and mobile-based integrated digital marketing solutions to automobile dealers in China. The platform enables dealer subscribers to create their own online showrooms, list pricing and promotional information, provide dealer contact information, place advertisements and manage customer relationships to help them reach a broad set of purchase-minded customers and effectively market their automobiles to consumers online.\nBitauto's transaction services business is primarily conducted by its controlled subsidiary, Yixin Group Limited (SEHK: 2858), a leading online automobile retail transaction platform in China, which provides transaction platform services as well as self-operated financing services.\nBitauto's digital marketing solutions business provides automakers with one-stop digital marketing solutions, including website creation and maintenance, online public relations, online marketing campaigns and advertising.\nFor more information, please visit ir.bitauto.com .\nFor investor and media inquiries, please contact:\nSuki Li\nBitauto Holdings Limited\nPhone: +86-10-6849-2145\nir@Bitauto.com\nClarisse Pan\nFoote Group\nPhone: +86-10-8429-9544\nBitauto@thefootegroup.com\nView original content: http://www.prnewswire.com/news-releases/bitauto-announces-changes-to-board-of-directors-300588720.html\nSOURCE Bitauto Holdings Limited", "external_links": ["http://bitauto.com/", "http://www.prnewswire.com/news-releases/bitauto-announces-changes-to-board-of-directors-300588720.html", "http://ir.bitauto.com/"], "published": "2018-01-26T13:00:00.000+02:00", "crawled": "2018-01-26T16:56:57.001+02:00", "highlightTitle": ""}