{"organizations": [], "uuid": "40c3325444f7d0bcc463830ea11d73579572d317", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-paige-rothermel-named-chief-growth-officer-for-blue-cross-blue-shield-of-arizona.html", "country": "US", "domain_rank": 767, "title": "Paige Rothermel Named Chief Growth Officer for Blue Cross Blue Shield of Arizona", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-31T18:00:00.000+02:00", "replies_count": 0, "uuid": "40c3325444f7d0bcc463830ea11d73579572d317"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-paige-rothermel-named-chief-growth-officer-for-blue-cross-blue-shield-of-arizona.html", "ord_in_thread": 0, "title": "Paige Rothermel Named Chief Growth Officer for Blue Cross Blue Shield of Arizona", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PHOENIX, Jan. 31, 2018 /PRNewswire-USNewswire/ -- Blue Cross Blue Shield of Arizona (BCBSAZ) has named Paige Rothermel as its chief growth officer. In this role, she will ignite new opportunities to deliver on what customers need and want, and help drive our mission for improving the quality of life for Arizonans.\n\"I'm energized by this new role,\" Rothermel says. \"Arizona has so much potential with its growing economy and business climate. Add Blue Cross' stellar reputation in the community, and I couldn't pass up the opportunity. I'm looking forward to creating products and services that will help Arizonans achieve their optimal health.\"\nRothermel joins BCBSAZ from Anthem Inc., where she served for more than 30 years. In her most recent role as vice president and general manager, she was responsible for directing the California Large Group sales, underwriting, and account management functions. Rothermel championed strategic growth initiatives that nearly doubled the size of the group business.\nThis is a new position created by BCBSAZ President and CEO Pam Kehaly, who started in November 2017. \"We are in a position to expand upon the foundation that has allowed us to serve millions of Arizonans through the years,\" she says. \"With Paige's growth-focused mindset and keen insight into customers' needs, she will help BCBSAZ remain the insurer of choice across the state.\"\nAbout Blue Cross Blue Shield of Arizona\nBlue Cross Blue Shield of Arizona (BCBSAZ) is committed to helping Arizonans get healthier faster and stay healthier longer. With a focus on connecting people with the care they need, BCBSAZ offers health insurance and related services to nearly 1.5 million customers. BCBSAZ, a not-for-profit company, is an independent licensee of the Blue Cross Blue Shield Association. The company employs nearly 1,500 people in its Phoenix, Chandler, Flagstaff, and Tucson offices. Through advanced clinical programs and community outreach, BCBSAZ is moving health forward. To learn more, visit azblue.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/paige-rothermel-named-chief-growth-officer-for-blue-cross-blue-shield-of-arizona-300590825.html\nSOURCE Blue Cross Blue Shield of Arizona", "external_links": ["http://www.azblue.com/", "http://www.prnewswire.com/news-releases/paige-rothermel-named-chief-growth-officer-for-blue-cross-blue-shield-of-arizona-300590825.html"], "published": "2018-01-31T18:00:00.000+02:00", "crawled": "2018-01-31T18:37:40.008+02:00", "highlightTitle": ""}