{"organizations": [], "uuid": "730903ee9f5564f0d88b5b8693b2aaff98e73148", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224815176&w=&fh=545&fw=810&ll=&pl=&sq=&r=2018-01-24T132516Z_29257_MRPRC17B1EEF210_RTRMADP_0_USA-ISRAEL-PENCE", "site_section": "http://feeds.reuters.com/ReutersPictures", "section_title": "Reuters: 24 hours", "url": "https://www.reuters.com/news/picture/editors-choice-idUSRTX4J9FX", "country": "US", "domain_rank": 408, "title": "Editor's Choice", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T15:25:00.000+02:00", "replies_count": 0, "uuid": "730903ee9f5564f0d88b5b8693b2aaff98e73148"}, "author": "", "url": "https://www.reuters.com/news/picture/editors-choice-idUSRTX4J9FX", "ord_in_thread": 0, "title": "Editor's Choice", "locations": [], "entities": {"persons": [{"name": "mike pence", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "reuters/ronen zvulun close", "sentiment": "none"}], "locations": [{"name": "old city", "sentiment": "none"}, {"name": "asunc", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "mount barsaya", "sentiment": "none"}, {"name": "paraguay", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "afrin", "sentiment": "none"}, {"name": "judaism", "sentiment": "none"}, {"name": "free syrian army", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Pictures | Wed Jan 24, 2018 | 8:25am EST Editor's Choice \nVice President Mike Pence touches the Western Wall, Judaism's holiest prayer site, in Jerusalem's Old City. REUTERS/Ronen Zvulun   Vice President Mike Pence touches the Western Wall, Judaism's holiest prayer site, in Jerusalem's Old City. REUTERS/Ronen Zvulun Close 1 / 25 \nCarnevalists pose before a reception of German carnival societies with German Chancellor Angela Merkel at the Chancellery in Berlin, Germany. REUTERS/Hannibal Hanschke   Carnevalists pose before a reception of German carnival societies with German Chancellor Angela Merkel at the Chancellery in Berlin, Germany. REUTERS/Hannibal Hanschke Close 2 / 25 \nTurkish-backed Free Syrian Army fighters are seen near Mount Barsaya, northeast of Afrin, Syria. REUTERS/Khalil Ashawi   Turkish-backed Free Syrian Army fighters are seen near Mount Barsaya, northeast of Afrin, Syria. REUTERS/Khalil Ashawi Close 3 / 25 \nA young girl uses a piece of styrofoam as a paddle board next to a flooded home after heavy rains caused the river Paraguay to overflow, on the outskirts of Asuncion, Paraguay. REUTERS/Jorge Adorno   A young girl uses a piece of styrofoam as a paddle board next to a flooded home after heavy rains caused the river Paraguay to overflow, on the outskirts of Asuncion, Paraguay. REUTERS/Jorge Adorno Close 4 / 25 \n  5 / 25 \nA pigeon flies out of a pedestrian subway at Charing Cross station after it was shut due to a gas leak, in London, Britain. REUTERS/Dylan Martinez   A pigeon flies out of a pedestrian subway at Charing Cross station after it was shut due to a gas leak, in London, Britain. REUTERS/Dylan Martinez Close 6 / 25 \nModels present creations by Italian designer Giorgio Armani   show for Giorgio Armani Prive in Paris, France. REUTERS/Charles Platiau   Models present creations by Italian designer Giorgio Armani   show for Giorgio Armani Prive in Paris, France. REUTERS/Charles Platiau Close 7 / 25 \nCentral Palo Seco power station of the Puerto Rico Electric Power Authority (PREPA) is seen behind a cemetery, in San Juan, Puerto Rico. REUTERS/Alvin Baez Reuters / Monday, January 22, 2018 Central Palo Seco power station of the Puerto Rico Electric Power Authority (PREPA) is seen behind a cemetery, in San Juan, Puerto Rico. REUTERS/Alvin Baez Close 8 / 25 \nEillen O'Riordan leaves her daughter Dolores O'Riordan's funeral with Dolores' ex-husband Don Burton and one of their daughters at St Ailbe's Church in Ballybricken, Ireland. REUTERS/Clodagh Kilcoyne   Eillen O'Riordan leaves her daughter Dolores O'Riordan's funeral with Dolores' ex-husband Don Burton and one of their daughters at St Ailbe's Church in Ballybricken, Ireland. REUTERS/Clodagh Kilcoyne Close \nA flock of starlings fills the dusk sky over Rome, Italy. REUTERS/Tony Gentile   A flock of starlings fills the dusk sky over Rome, Italy. REUTERS/Tony Gentile Close 10 / 25 \nFighters from the self-defence forces of the Kurdish-led north hold their weapons during a rally in Hasaka, northeastern Syria. REUTERS/Rodi Said   Fighters from the self-defence forces of the Kurdish-led north hold their weapons during a rally in Hasaka, northeastern Syria. REUTERS/Rodi Said Close 11 / 25 \nIndia's Prime Minister Narendra Modi gestures at the Opening Plenary during   (WEF) annual meeting in Davos, Switzerland. REUTERS/Denis Balibouse   India's Prime Minister Narendra Modi gestures at the Opening Plenary during   (WEF) annual meeting in Davos, Switzerland. REUTERS/Denis Balibouse Close 12 / 25 \nDACA recipients and supporters protest for a clean Dream Act outside Disneyland in Anaheim, California. REUTERS/Lucy Nicholson Reuters / Monday, January 22, 2018 DACA recipients and supporters protest for a clean Dream Act outside Disneyland in Anaheim, California. REUTERS/Lucy Nicholson Close 13 / 25 \nCate Blanchett, Goodwill Ambassador, United Nations High Commissioner for Refugees (UNHCR) attends   (WEF) annual meeting in Davos, Switzerland. REUTERS/Denis Balibouse   Cate Blanchett, Goodwill Ambassador, United Nations High Commissioner for Refugees (UNHCR) attends   (WEF) annual meeting in Davos, Switzerland. REUTERS/Denis Balibouse Close 14 / 25 \nA Palestinian moves a burning tire during clashes with Israeli troops at a protest against the visit of Vice President Mike Pence in Jerusalem, near the Jewish settlement of Beit El, near the West Bank city of Ramallah. REUTERS/Mohamad Torokman   A Palestinian moves a burning tire during clashes with Israeli troops at a protest against the visit of Vice President Mike Pence in Jerusalem, near the Jewish settlement of Beit El, near the West Bank city of Ramallah. REUTERS/Mohamad Torokman Close 15 / 25 \nFormer Brazilian president Luiz Inacio Lula da Silva is greeted by former president Dilma Rousseff during a rally in support of his candidacy to the 2018 presidential race, in Porto Alegre, Brazil. REUTERS/Diego Vara   Former Brazilian president Luiz Inacio Lula da Silva is greeted by former president Dilma Rousseff during a rally in support of his candidacy to the 2018 presidential race, in Porto Alegre, Brazil. REUTERS/Diego Vara Close 16 / 25 \nA general view shows a shoe of Maryam Monsef, Canada's Minister of Status of Women, as she attends   (WEF) annual meeting in Davos, Switzerland. REUTERS/Denis Balibouse   A general view shows a shoe of Maryam Monsef, Canada's Minister of Status of Women, as she attends   (WEF) annual meeting in Davos, Switzerland. REUTERS/Denis Balibouse Close 17 / 25 \nIMF Director Christine Lagarde reacts after kicking a football with the UN sustainability goals given her by the Norwegian Prime Minister Erna Solberg (far right), while General Secretary of the International Trade Union Confederation (ITUC), Sharan... more   IMF Director Christine Lagarde reacts after kicking a football with the UN sustainability goals given her by the Norwegian Prime Minister Erna Solberg (far right), while General Secretary of the International Trade Union Confederation (ITUC), Sharan Burrow, social activist Chetna Sinha and Director of CERN, Fabiola Gianotti are watching, during their meeting at the he World Economic Forum (WEF) annual meeting in Davos, Switzerland. NTB Scanpix/Heiko Junge /via REUTERS Close 18 / 25 \nMarcel Hirscher of Austria celebrates at the end of the FIS Alpine Skiing World Cup race in Schladming, Austria. REUTERS/Dominic Ebenbichler   Marcel Hirscher of Austria celebrates at the end of the FIS Alpine Skiing World Cup race in Schladming, Austria. REUTERS/Dominic Ebenbichler Close 19 / 25 \nU.S. national security adviser H.R. McMaster and White House chief economic adviser Gary Cohn during the daily press briefing at the White House in Washington. REUTERS/Jonathan Ernst   U.S. national security adviser H.R. McMaster and White House chief economic adviser Gary Cohn during the daily press briefing at the White House in Washington. REUTERS/Jonathan Ernst Close 20 / 25 \nCaroline Wozniacki of Denmark hits a shot against Carla Suarez Navarro of Spain during the Australian Open. REUTERS/Thomas Peter   Caroline Wozniacki of Denmark hits a shot against Carla Suarez Navarro of Spain during the Australian Open. REUTERS/Thomas Peter Close 21 / 25 \nVenezuela's President Nicolas Maduro waves as he arrives for a rally to commemorate the 60th anniversary of the end of Venezuelan dictator Marcos Perez Jimenez's regime in Caracas, Venezuela. REUTERS/Marco Bello   Venezuela's President Nicolas Maduro waves as he arrives for a rally to commemorate the 60th anniversary of the end of Venezuelan dictator Marcos Perez Jimenez's regime in Caracas, Venezuela. REUTERS/Marco Bello Close 22 / 25 \nThe reconstructed face of 'Dawn', a young woman who lived around 7,000 BC in a cave in Greece, is displayed during a presentation at the Acropolis museum in Athens, Greece. A Greek team led by an orthodontics professor has reconstructed the face of... more   The reconstructed face of 'Dawn', a young woman who lived around 7,000 BC in a cave in Greece, is displayed during a presentation at the Acropolis museum in Athens, Greece. A Greek team led by an orthodontics professor has reconstructed the face of 'Dawn', from her remains, bringing to life a person who lived during the mesolithic period and uncovering details of her everyday existence.REUTERS/Costas Baltas Close 23 / 25 \n  24 / 25 \n ", "external_links": [], "published": "2018-01-24T15:25:00.000+02:00", "crawled": "2018-01-25T15:04:25.004+02:00", "highlightTitle": ""}