{"organizations": [], "uuid": "f2a9a62eb0ec4ae95dd6b22337890b8190886da7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/tcw-group-tirschwell-harassment/lawsuit-claims-tcw-fired-female-fund-manager-for-alleging-sexual-harassment-idUSL2N1PK1FQ", "country": "US", "domain_rank": 408, "title": "Lawsuit claims TCW fired female fund manager for alleging sexual harassment", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T23:26:00.000+02:00", "replies_count": 0, "uuid": "f2a9a62eb0ec4ae95dd6b22337890b8190886da7"}, "author": "", "url": "https://www.reuters.com/article/tcw-group-tirschwell-harassment/lawsuit-claims-tcw-fired-female-fund-manager-for-alleging-sexual-harassment-idUSL2N1PK1FQ", "ord_in_thread": 0, "title": "Lawsuit claims TCW fired female fund manager for alleging sexual harassment", "locations": [], "entities": {"persons": [{"name": "jess ravich", "sentiment": "none"}, {"name": "jessica dinapoli", "sentiment": "none"}, {"name": "sara tirschwell", "sentiment": "none"}, {"name": "jonathan stempel", "sentiment": "none"}, {"name": "tirschwell", "sentiment": "none"}, {"name": "david lippman", "sentiment": "none"}, {"name": "ravich", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "tcw", "sentiment": "negative"}, {"name": "hedge fund journal", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "tcw group inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 27 PM / Updated 10 minutes ago Lawsuit claims TCW fired female fund manager for alleging sexual harassment Jessica DiNapoli , Jonathan Stempel 4 Min Read \nNEW YORK, Jan 25 (Reuters) - TCW Group Inc, one of the largest U.S. asset managers, is being sued by a prominent female hedge fund manager who said she was fired in retaliation for complaining about being sexually harassed and “coerced” into sex by her boss. \nSara Tirschwell, a distressed debt specialist named last year by the Hedge Fund Journal as among the top women in her field, filed her $30 million complaint on Thursday in New York state court in Manhattan against TCW, Chief Executive David Lippman and Jess Ravich, TCW’s head of alternative products. \nTirschwell said in the complaint she was fired on Dec. 14, 2017, nine days after complaining about Ravich’s advances, on the pretext that she had violated TCW’s conflict of interest rules. \nAccording to the complaint, Ravich joined TCW’s board 13 days later, “without TCW commencing, much less concluding, an investigation” into Tirschwell’s allegations. \n“Ms. Tirschwell was dismissed for cause due to repeated, documented violations of firm policy, and had made no complaint of any kind before it was clear she was being dismissed,” TCW spokesman Doug Morris said in an email. “TCW is proud of its inclusive culture and has a zero tolerance policy for any form of predatory behavior.” \nLippman and Ravich did not immediately respond to requests for comment. \nA spokesman for Tirschwell declined to comment. \nBased in Los Angeles, TCW oversees about $200 billion of client assets, and is owned by management, employees, Carlyle Group LP and Nippon Life Insurance Co. Reuters reported Tirschwell’s departure on the day it happened. \nDozens of men have been fired or resigned from jobs in politics, media, entertainment and business over the last few months after facing sexual misconduct allegations, including Hollywood mogul Harvey Weinstein and broadcaster Charlie Rose. \nIn her complaint, Tirschwell said she joined TCW in 2016 after spending 11 years at the hedge fund Davidson Kempner Capital Management. She also said she dated Ravich for a year around 2012 and had remained on friendly terms. \nDuring the hiring process, Ravich disclosed the relationship to Lippman, and Lippman had told him to “keep hands off of her” and avoid any “funny business,” the complaint said. \nTirschwell said Ravich nevertheless made sexual advances during several “breakfast meetings” over a 10-month period, including while wearing a white bathrobe in his apartment at the Trump International Hotel & Tower overlooking Central Park. \nShe said she was “fearful of what Ravich might do if she did not comply with his unwelcome advances,” citing threats to deprive her of resources and client access, and that he ended marketing support after the encounters stopped in early 2017. \nAccording to the complaint, Lippman complained to colleagues that Tirschwell was “bitchy” and “yelled at people.” \nTirschwell said she complained to human resources on Dec. 5, 2017, after Ravich threatened to let her contract expire unless she accepted non-negotiable severance. \nShe said TCW fired her on a “manufactured” pretext that she had communicated with the firm’s Direct Lending group, which for ethical reasons was kept separate from her Direct Strategy group though Ravich oversaw both. \nAfter being fired, Tirschwell said in the complaint that Lippman told her that TCW took “seriously” her retaliation charge and that it hired an independent investigator. “This was untrue on all counts,” Tirschwell said. \nMorris, TCW’s spokesman, said the firm “promptly engaged an independent investigative firm” to examine what happened and Tirschwell declined to cooperate. (Reporting by Jessica DiNapoli and Jonathan Stempel in New York)", "external_links": [], "published": "2018-01-25T23:26:00.000+02:00", "crawled": "2018-01-25T23:41:52.006+02:00", "highlightTitle": ""}