{"organizations": [], "uuid": "8188e02094f46330b4072b43379d75ed92582ff9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226246493&w=1200&r=LYNXMPEE0S004", "site_section": "http://www.reuters.com/resources/archive/us/20180128.html", "section_title": "Archive News &amp; Video for Sunday, 28 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/uk-britain-eu-banks/business-survey-says-brexit-biggest-threat-to-uk-financial-centre-idUSKBN1FI003", "country": "US", "domain_rank": 408, "title": "Business survey says Brexit biggest threat to UK financial centre", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.02, "site_type": "news", "published": "2018-01-29T08:52:00.000+02:00", "replies_count": 0, "uuid": "8188e02094f46330b4072b43379d75ed92582ff9"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-britain-eu-banks/business-survey-says-brexit-biggest-threat-to-uk-financial-centre-idUSKBN1FI003", "ord_in_thread": 0, "title": "Business survey says Brexit biggest threat to UK financial centre", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "andrew kail", "sentiment": "none"}, {"name": "newton-smith", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european union", "sentiment": "negative"}, {"name": "cbi", "sentiment": "none"}, {"name": "pwc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Uncertainty over Britain’s future trading relations with the European Union after Brexit is the most serious threat to London as the world’s top financial centre, a business survey showed on Monday.\nThe quarterly survey from business lobby CBI and consultants PwC said optimism in the financial services sector fell for the third consecutive quarter in the three months to December, marking two years of flat or falling sentiment, though transactions remained stable overall.\nFirms want as much clarity as possible on what Britain wants in future trade relations, the survey found.\n“To restore some confidence, financial services firms absolutely must – no ifs, no buts – get as much certainty as possible on what the UK is aiming for in the Brexit negotiations, the opportunities of success and the consequences of failure,” CBI Chief Economist Rain Newton-Smith said in a statement.\nThe EU is due on Monday to approve criteria for negotiating a transition period that would bridge Brexit in March 2019 and the start of new trading terms.\nAndrew Kail, head of financial services at PwC said a transition period is likely, but the financial sector must get ready to operate outside the bloc\n“The industry will need to take positive action if it is to preserve its trading status and business model,” Kail said.\nParis, Frankfurt Dublin and Luxembourg are vying to attract financial services from London that need continued access to EU customers after Brexit.\nFrench Finance Minister Bruno Le Maire told Reuters on Friday that Paris could overtake London as Europe’s most important financial centre in a matter of years.\nFinancial company profits continued to improve in the final three months of last year, with a similar trend expected in the current quarter, the survey found. Headcount is expected to remain stable.\nSeparately the City of London Corporation, the municipal authority for the capital’s “Square Mile” financial district, said nearly one in every five workers there in 2016 came from a European country, the highest on record.\nEighteen percent of the City’s workforce came from the European Economic Area, up from 8 percent a decade earlier. UK workers accounted for 59 percent of staff, the rest came from outside Europe.\n“This data crystalizes the importance of European workers to the UK’s biggest financial centre, and the need for a clear post-Brexit immigration policy,” City of London policy chief Catherine McGuinness said.\nThe CBI/PwC said that 54 percent of the 92 firms they surveyed said they want to make it easier to attract staff to Britain’s financial technology or fintech sector.\nReporting by Huw Jones; Editing by Elaine Hardcastle\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-29T08:52:00.000+02:00", "crawled": "2018-01-29T21:55:00.000+02:00", "highlightTitle": ""}