{"organizations": [], "uuid": "0ee7a26c8d93601a4ced0498999095f52c1bd621", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/01/gettyimages-631676300.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/22/data-sheet-davos-world-economic-forum-trump/", "country": "US", "domain_rank": 1196, "title": "Data Sheet—Davos World Economic Forum Focus on Trump, China | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.372, "site_type": "news", "published": "2018-01-22T10:49:00.000+02:00", "replies_count": 0, "uuid": "0ee7a26c8d93601a4ced0498999095f52c1bd621"}, "author": "Aaron Pressman", "url": "http://fortune.com/2018/01/22/data-sheet-davos-world-economic-forum-trump/", "ord_in_thread": 0, "title": "Data Sheet—Davos World Economic Forum Focus on Trump, China | Fortune", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "bremmer", "sentiment": "none"}, {"name": "ian bremmer", "sentiment": "none"}, {"name": "aaron pressman", "sentiment": "none"}, {"name": "adam lashinsky", "sentiment": "none"}, {"name": "michele limina", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "congress center", "sentiment": "negative"}, {"name": "fortune data sheet data sheet", "sentiment": "negative"}, {"name": "eurasia group", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Data Sheet Data Sheet—Why the Top 0.001% Is So Happy National flags hang above the Congress Center, the venue for the World Economic Forum in Davos, Switzerland, on Jan. 14. 2017. Michele Limina—Bloomberg/Getty Images By Aaron Pressman and Adam Lashinsky 8:49 AM EST \nThis is the web version of Data Sheet, Fortune’s daily newsletter on the top tech news. To get it delivered daily to your in-box, sign up here . \nGood morning from Davos, Switzerland, where I’m attending the annual meeting of the World Economic Forum. It is a one-of-a-kind event, a mixture of unalloyed commerce, high-minded do-gooderism, and brass-tacks policy discussions, attended by corporate bigwigs, journalists, academics, non-governmental organizations, and top government officials. \nTo prepare for my trip last week I called Ian Bremmer, my favorite globalist and the head of his own political-analysis consultancy, the Eurasia Group. I asked Bremmer the three things Davos attendees either will or should be discussing this week. His take: \n* The global economy. Leading plutocrats will be pinching themselves on how well things are going a decade after the financial crisis, says Bremmer. “If you are in the top .001% you’re just minting it,” he says. “This is a happy group.” Risks abound, including the sustainability of the expansion and the durability of low interest rates. But by and large the well-heeled attendees have every reason to feel quite good this year. \n* The big geopolitical underside. Bremmer says major keynote speeches by India’s Modi, France’s Macron, and Germany’s Merkel are likely to avoid the topic. But in hushed conversations leading globalists will express their concern about the “undermining of the old political system.” Which leads to the topic certain to dominate every other in Davos … \n* Donald Trump. Bremmer calls the U.S. president’s entourage “the big circus,” much as the jumbo-jet of Chinese officials and executives traveling with Xi Jinping dominated last year’s event. Trump is as unlikely a Davosian as Xi was. “His relationship with the WEF globally is kind of like with The New York Times in the U.S.,” says Bremmer. “He craves their praise but will antagonize them all the same.” Bremmer reckons that if Trump’s approval is nearly 40% in his own country it is closer to 5% among attendees in Davos. He predicts fireworks. “There will be missteps. His ability to do damage to himself on the global stage is pretty high.” And just as Trump’s tweets are simultaneously artifice and impactful, Bremmer predicts Trump’s appearance in Davos holds the potential for real harm. “What he says doesn’t matter in the sense that it’s not policy,” says Bremmer. “But what he says matters in that he’s the antithesis of leading by example. He gives other world leaders more reason to move away from the U.S.” \nBremmer is tough to contain to just three thoughts, and as we kept talking he raised two other topics for the week, both involving China. The beleaguered top honchos of the U.S. tech giants undoubtedly will be scrambling to figure out how to minimize the ongoing public-policy and public-opinion backlash against them. But Bremmer thinks they also will be huddling on what to do about their lack of access to the China market. \nChina itself, predicts Bremmer, will be the silent elephant in the room in Davos. Last year Xi made a splash on the eve of Trump’s inauguration. Bremmer thinks Xi doesn’t have much use for the WEF anymore. “He’s building alternative infrastructures,” says Bremmer, of Xi, noting that the Chinese leader’s “One Belt, One Road” initiative will spend seven times what the Marshall Plan spent. And if the Chinese can opt out of the Davos discussion, as Bremmer predicts, “that means we don’t live in a global market anymore.” \nAnd that will eventually make the Davos party less festive. Adam Lashinsky @ NEWSWORTHY \nNot exactly a crackdown . South Korea has not decided to shut down all digital currency exchanges, at least not yet. But new taxes and customer disclosure requirements are coming . \nNot exactly regretful . Asked about the firing of the author of a sexist memo, Google CEO Sundar Pichai expressed exactly zero regrets. “The last thing we do when we make decisions like this is look at it with a political lens,” Pichai said. The fired author, James Damore, who alleged women were biologically unsuited to be engineers, is suing the company. \nNot exactly an admission . Perhaps addressing the growing controversy over Apple’s role in so-called smartphone addiction, CEO Time Cook warned against the “overuse” of technology. “I’m not a person that says we’ve achieved success if you’re using it all the time,” Cook said in talk at Harlow College in near London. “I don’t subscribe to that at all.” Cook added that he keeps his nephew off of social media. For a contrarian view, Wall Street Journal columnist Christopher Mims rounded up some researchers who say kids would benefit from more, not less, exposure to computing devices. \nNot exactly on board . Online lender Social Finance is looking to Twitter as it seeks to get past the controversial tenure of former CEO Mike Cagney. SoFi has offered the top job to Twitter COO and former Goldman Sachs banker Anthony Noto, the Wall Street Journal reports . Noto will decide whether to take the job within a few days. \nNot exactly a good deal. Amazon raised the price of its free-shipping-and-free-movies Prime plan for people who pay monthly to $13 from $11. But it kept the price of paying annually at $99. So pretty much everyone can save $56 a year by subscribing annually. \nNot exactly growing. Tile , the startup selling those bluetooth-enabled tracking tchotchkes that attach to your keyring, laid off 30 people after weak holiday sales, TechCrunch reports. Similar story at toy robot maker Sphero , which laid of f 45, according to TechCrunch. \nNot exactly a bubble. Intercontinental Exchange, a little Wall Street outfit that owns the New York Stock Exchange, is getting in on the cryptocurrency hype. ICE is creating a realtime feed of the prices of 15 major digital currencies in partnership with Blockstream. FOOD FOR THOUGHT \nThe United States ranks highest among all nations for its incarceration rate . Among the many secondary effects, some 600,000 people a year are released from prison. Jennifer Alsever for Fortune checked in on efforts to help those ex-cons find jobs, particularly among tech companies. One group is teaching them coding skills even before they get out. \nIn San Francisco, husband-and-wife tech veterans Beverly Parenti and Chris Redlitz have been training prisoners to be coders and entrepreneurs—even before they get out of prison. Their nonprofit, the Last Mile, teaches software programming, design, and entrepreneurship in four California prisons—using computers without Internet access. Over the course of four years, a string of local tech executives and entrepreneurs have come in as guest speakers, garnering connections that have led to higher-paying jobs when prisoners are released. Those enrolled in the group’s web development shop inside San Quentin State Prison do design work for businesses while still behind bars, building their portfolios, references, and cash for when they get out. IN CASE YOU MISSED IT ", "external_links": [], "published": "2018-01-22T10:49:00.000+02:00", "crawled": "2018-01-22T17:15:20.002+02:00", "highlightTitle": ""}