{"organizations": [], "uuid": "42e2ceea6bb16ad01d70e201468921e022327f68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-scottsmiracle-gro-reports-first-quarter-results-company-wide-sales-increase-7-percent-due-to-hawthorne-acquisitions.html", "country": "US", "domain_rank": 767, "title": "ScottsMiracle-Gro Reports First Quarter Results; Company-wide Sales Increase 7% Due to Hawthorne Acquisitions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.014, "site_type": "news", "published": "2018-01-30T15:00:00.000+02:00", "replies_count": 0, "uuid": "42e2ceea6bb16ad01d70e201468921e022327f68"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-scottsmiracle-gro-reports-first-quarter-results-company-wide-sales-increase-7-percent-due-to-hawthorne-acquisitions.html", "ord_in_thread": 0, "title": "ScottsMiracle-Gro Reports First Quarter Results; Company-wide Sales Increase 7% Due to Hawthorne Acquisitions", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "marysville", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "hawthorne acquisitions hawthorne", "sentiment": "negative"}, {"name": "gaap", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "scotts miracle-gro company", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "smg", "sentiment": "none"}, {"name": "non-gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hawthorne segment reports 20% sales growth; U.S. Consumer flat to prior year\nGAAP loss from continuing operations per share of $0.35 vs. $0.97 in prior year Non-GAAP adjusted loss per share of $1.08 compared with $0.88 in prior year Non-GAAP adjusted EPS guidance raised to $4.60 to $4.80 due to lower expected tax rate Full-year sales guidance reduced to a range of 2 to 4 percent\nMARYSVILLE, Ohio, Jan. 30, 2018 (GLOBE NEWSWIRE) -- The Scotts Miracle-Gro Company (NYSE:SMG), the world’s leading marketer of branded consumer lawn and garden as well as hydroponic growing products, today announced that company-wide sales increased 7 percent in its fiscal first quarter driven by the benefit of recently completed Hawthorne acquisitions.\nFor the quarter ended December 30, 2017, GAAP loss from continuing operations was $0.35 per share compared with $0.97 per share in the prior year as the Company recognized a net deferred tax benefit of $46 million as a result of the revaluation and reduction of deferred tax liabilities due to the recent tax law changes. The non-GAAP adjusted loss was $1.08 per share, compared with a loss of $0.88 per share for the same period a year ago largely due to the unfavorable impact of lower tax rate and share count in a loss-making quarter. Due to the seasonal nature of the lawn and garden category, the Company reports a loss each year during its first quarter.\n“As we prepare for the start of the lawn and garden season, our core business is on pace with our internal expectations and we continue to expect solid consumer and retailer engagement once the weather breaks,” said Jim Hagedorn, chairman and chief executive officer. “In our Hawthorne segment, growth was driven by acquisitions. Excluding acquisitions, sales declined roughly $12 million from the prior year, which we attribute to the slower-than-expected pace of regulatory changes in California.”\n“While we view the recent slow down within Hawthorne as temporary, it has continued into the second quarter. We now expect full-year organic sales growth at Hawthorne will be flat assuming a return to normal market conditions in the second half of the year. Our long-term prospects for this business remain unchanged and we continue to see Hawthorne having strong long-term growth.”\nFirst quarter details\nFor the fiscal first quarter, the Company reported sales of $221.5 million, up 7 percent from $207.4 million a year earlier. Sales for the Hawthorne segment increased 20 percent to $76.7 million. U.S. Consumer segment sales were flat at $125.9 million.\nThe company-wide gross margin rates decreased to 15.3 percent from 17.7 percent. The change was driven primarily from lower sales volume within Hawthorne. Selling, general and administrative expenses (SG&A) increased 4 percent to $108.2 million due to newly acquired businesses and were in line with the Company’s internal expectation.\nOn a company-wide basis, GAAP loss from continuing operations was $20.0 million, or $0.35 per share, compared with a loss of $58.1 million, or $0.97 per share for the first quarter of fiscal 2017. Those results include impairment, restructuring, and other charges, and the impacts of the recent U.S. tax law changes. Excluding those items, the Non-GAAP adjusted loss from continuing operations was $62.2 million, or $1.08 per share, compared with $52.6 million, or $0.88 per share, last year. The year-over-year difference in non-GAAP performance is primarily non-operating in nature and due to both lower tax rate and share count, which had a negative impact of approximately $0.15 on earnings.\n“We’ve started the year in a solid place, even with the decline in Hawthorne sales,” said Randy Coleman, chief financial officer. “I remain confident in the visibility we have on cost of goods and remain optimistic about our continued focus on controlling SG&A and improving our free cash flow.”\nThe Company also said it expects its effective tax rate to decline to a range of 26 to 27 percent in fiscal 2018, a rate that will likely remain consistent in future years. As a result of the lower rate, the Company increased its Non-GAAP adjusted earnings guidance to a range of $4.60 to $4.80 per share from the previous range of $4.15 to $4.35 per share. In addition, the Company reduced its full-year sales outlook to a range of 2 to 4 percent due to the slow start at Hawthorne but maintained a consistent operating earnings outlook primarily due to tighter SG&A spending.\n“We appreciate both President Trump and Congress showing the courage to address the uncompetitive nature of the corporate tax structure in the U.S.,” Hagedorn said. “While our shareholders will benefit from this reduction, our associates will as well. We expect the first 20 percent of the savings we achieve will eventually result in higher wages for most of our hourly associates and improvements in our benefit programs for all of our people.”\nConference Call and Webcast Scheduled for 9:00 a.m. EST today, January 30\nThe Company will discuss results during a webcast and conference call today at 9:00 a.m. EST. To participate in the conference call, please call 866-838-2057 (Conference Code: 5091913). A replay of the call can be heard by calling 888-203-1112. The replay will be available for 30 days.\nA live webcast of the call and the press release will be available on Company’s investor relations website at http://investor.scotts.com . An archive of the press release and any accompanying information will remain available for at least a 12-month period.\nAbout ScottsMiracle-Gro\nThe Scotts Miracle-Gro Company is the world's largest marketer of branded consumer products for lawn and garden care. The Company's brands are among the most recognized in the industry. The Company's Scotts®, Miracle-Gro® and Ortho® brands are market-leading in their categories, as is the consumer Roundup® brand, which is marketed in the U.S. and certain other countries by Scotts and owned by Monsanto. We maintain a minority interest in TruGreen®, the largest residential lawn care service business, and in Bonnie Plants®, the largest marketer of edible gardening plants in retail channels. The Company’s wholly-owned subsidiary, The Hawthorne Gardening Company, is a leading provider of nutrients, lighting and other materials used in the hydroponic growing segment. For additional information, visit us at www.scottsmiraclegro.com .\nForward Looking Non-GAAP Measures\nIn this release, the Company provides an outlook for fiscal 2018 non-GAAP adjusted EPS. The Company does not provide a GAAP EPS outlook, which is the most directly comparable GAAP measure to non-GAAP adjusted EPS, because changes in the items that the Company excludes from GAAP EPS to calculate non-GAAP adjusted EPS, described above, can be dependent on future events that are less capable of being controlled or reliably predicted by management and are not part of the Company’s routine operating activities. Additionally, due to their unpredictability, management does not forecast the excluded items for internal use and therefore cannot create or rely on a GAAP EPS outlook without unreasonable efforts. The timing and amount of any of the excluded items could significantly impact the Company’s GAAP EPS. As a result, the Company does not provide a reconciliation of guidance for non-GAAP adjusted EPS to GAAP EPS, in reliance on the unreasonable efforts exception provided under Item 10(e)(1)(i)(B) of Regulation S-K.\nCautionary Note Regarding Forward-Looking Statements\nStatements contained in this press release, other than statements of historical fact, which address activities, events and developments that the Company expects or anticipates will or may occur in the future, including, but not limited to, information regarding the future economic performance and financial condition of the Company, the plans and objectives of the Company’s management, and the Company’s assumptions regarding such performance and plans are “forward-looking statements” within the meaning of the U.S. federal securities laws that are subject to risks and uncertainties. These forward-looking statements generally can be identified as statements that include phrases such as “guidance,” “outlook,” “projected,” “believe,” “target,” “predict,” “estimate,” “forecast,” “strategy,” “may,” “goal,” “expect,” “anticipate,” “intend,” “plan,” “foresee,” “likely,” “will,” “should” or other similar words or phrases. Actual results could differ materially from the forward-looking information in this release due to a variety of factors, including, but not limited to:\nCompliance with environmental and other public health regulations could increase the Company’s costs of doing business or limit the Company’s ability to market all of its products; Increases in the prices of raw materials and fuel costs could adversely affect the Company’s results of operations; The highly competitive nature of the Company’s markets could adversely affect its ability to maintain or grow revenues; Because of the concentration of the Company’s sales to a small number of retail customers, the loss of one or more of, or significant reduction in orders from, its top customers could adversely affect the Company’s financial results; Climate change and unfavorable weather conditions could adversely impact financial results; Certain of our products may be purchased for use in new or emerging industries or segments and/or be subject to varying, inconsistent, and rapidly changing laws, regulations, administrative practices, enforcement approaches, judicial interpretations and consumer perceptions; The Company may not be able to adequately protect its intellectual property and other proprietary rights that are material to the Company’s business; In the event the Restated Marketing Agreement for consumer Roundup products terminates, we would lose a substantial source of future earnings and overhead expenses absorption; Hagedorn Partnership, L.P. beneficially owns approximately 26% of the Company’s common shares and can significantly influence decisions that require the approval of shareholders; The Company may pursue acquisitions, dispositions, investments, dividends, share repurchases and/or other corporate transactions that it believes will maximize equity returns of its shareholders but may involve risks.\nAdditional detailed information concerning a number of the important factors that could cause actual results to differ materially from the forward-looking information contained in this release is readily available in the Company’s publicly filed quarterly, annual and other reports. The Company disclaims any obligation to update developments of these risk factors or to announce publicly any revision to any of the forward-looking statements contained in this release, or to make corrections to reflect future events or developments.\nContact:\nJim King\nSenior Vice President\nInvestor Relations & Corporate Affairs\n(937) 578-5622\n﻿\nTHE SCOTTS MIRACLE-GRO COMPANY Condensed Consolidated Statements of Operations (In millions, except for per common share data) (Unaudited) Three Months Ended Footnotes December 30,\n2017 December 31,\n2016 %\nChange Net sales $ 221.5 $ 207.4 7 % Cost of sales 187.5 170.6 Gross profit 34.0 36.8 (8 )% % of sales 15.3 % 17.7 % Operating expenses: Selling, general and administrative 108.2 104.1 4 % Impairment, restructuring and other (0.2 ) (0.2 ) Other income, net (2.1 ) (5.3 ) Loss from operations (71.9 ) (61.8 ) (16 )% % of sales (32.5 )% (29.8 )% Equity in (income) loss of unconsolidated affiliates (3)\n(0.6 ) 13.2 Interest expense 17.8 15.3 Other non-operating income (6)\n(2.5 ) — Loss from continuing operations before income taxes (86.6 ) (90.3 ) 4 % Income tax benefit from continuing operations (66.6 ) (32.2 ) Loss from continuing operations (20.0 ) (58.1 ) 66 % Loss from discontinued operations, net of tax (3) (4) (1.2 ) (6.8 ) Net loss $ (21.2 ) $ (64.9 ) Net income attributable to noncontrolling interest — (0.4 ) Net loss attributable to controlling interest $ (21.2 ) $ (65.3 ) Basic loss per common share: (1)\nLoss from continuing operations $ (0.35 ) $ (0.97 ) 64 % Loss from discontinued operations (0.02 ) (0.12 ) Net loss $ (0.37 ) $ (1.09 ) Diluted loss per common share: (2)\nLoss from continuing operations $ (0.35 ) $ (0.97 ) 64 % Loss from discontinued operations (0.02 ) (0.12 ) Net loss $ (0.37 ) $ (1.09 ) Common shares used in basic loss per share calculation 57.6 60.1 (4 )% Common shares and potential common shares used in diluted loss per share calculation 57.6 60.1 (4 )% Non-GAAP results: Adjusted net loss attributable to controlling interest from continuing operations (5)\n$ (62.2 ) $ (52.6 ) (18 )% Adjusted diluted loss per common share from continuing operations (2) (5) $ (1.08 ) $ (0.88 ) (23 )% Adjusted EBITDA (5)\n$ (44.8 ) $ (49.9 ) 10 % Note: See accompanying footnotes on page 8. THE SCOTTS MIRACLE-GRO COMPANY\nSegment Results\n(In millions)\n(Unaudited)\nThe Company divides its business into three reportable segments: U.S. Consumer, Hawthorne and Other. U.S. Consumer consists of the Company’s consumer lawn and garden business located in the geographic United States. Hawthorne consists of the Company’s indoor, urban and hydroponic gardening business. Other consists of the Company’s consumer lawn and garden business in geographies other than the U.S. and the Company’s product sales to commercial nurseries, greenhouses and other professional customers. Corporate consists of general and administrative expenses and certain other income/expense items not allocated to the business segments. This identification of reportable segments is consistent with how the segments report to and are managed by the chief operating decision maker of the Company. These segments differ from those used in prior periods due to the change in the Company’s internal organization structure resulting from the Company’s divestiture of its consumer lawn and garden business in certain international jurisdictions (the “International Business”), which closed on August 31, 2017. As a result, effective in its fourth quarter of fiscal 2017, the Company classified its results of operations for all periods presented to reflect the International Business as a discontinued operation and classified the assets and liabilities of the International Business as held for sale. The prior period amounts have been reclassified to conform with the new segments.\nSegment performance is evaluated based on several factors, including income (loss) from continuing operations before income taxes, amortization, impairment, restructuring and other charges (“Segment Profit (Loss)”), which is a non-GAAP financial measure. Senior management uses this measure of profit (loss) to evaluate segment performance because the Company believes this measure is indicative of performance trends and the overall earnings potential of each segment.\nThe following tables present financial information for the Company’s reportable segments for the periods indicated:\nThree Months Ended December 30,\n2017 December 31,\n2016 %\nChange Net Sales: U.S. Consumer $ 125.9 $ 126.2 — % Hawthorne 76.7 63.7 20 % Other 18.9 17.5 8 % Consolidated $ 221.5 $ 207.4 7 % Segment Profit (Loss) (Non-GAAP): U.S. Consumer $ (37.9 ) $ (38.5 ) 2 % Hawthorne 1.7 6.6 (74 )% Other (4.0 ) (2.3 ) (74 )% Total Segment Loss (Non-GAAP) (40.2 ) (34.2 ) (18 )% Corporate (25.0 ) (22.4 ) Intangible asset amortization (6.9 ) (5.4 ) Impairment, restructuring and other 0.2 0.2 Equity in income (loss) of unconsolidated affiliates 0.6 (13.2 ) Interest expense (17.8 ) (15.3 ) Other non-operating income 2.5 — Loss from continuing operations before income taxes (GAAP) $ (86.6 ) $ (90.3 ) 4 %\nTHE SCOTTS MIRACLE-GRO COMPANY Condensed Consolidated Balance Sheets (In millions) (Unaudited) Footnotes December 30,\n2017 December 31,\n2016 September 30,\n2017 ASSETS Current assets: Cash and cash equivalents $ 54.5 $ 73.1 $ 120.5 Accounts receivable, net 170.6 175.7 286.6 Inventories 696.1 685.9 407.5 Assets held for sale (4 ) — 245.9 — Prepaid and other current assets (7 ) 61.7 60.6 67.1 Total current assets 982.9 1,241.2 881.7 Investment in unconsolidated affiliates 31.7 83.9 31.1 Property, plant and equipment, net 464.1 438.0 467.7 Goodwill 464.8 397.4 441.6 Intangible assets, net 783.4 734.0 748.9 Other assets (6 ) 183.9 117.7 176.0 Total assets $ 2,910.8 $ 3,012.2 $ 2,747.0 LIABILITIES AND EQUITY Current liabilities: Current portion of debt $ 86.1 $ 41.8 $ 143.1 Accounts payable 223.2 218.4 153.1 Liabilities held for sale (4 ) — 137.7 — Other current liabilities 161.8 92.7 248.3 Total current liabilities 471.1 490.6 544.5 Long-term debt (6 ) 1,697.0 1,648.1 1,258.0 Distributions in excess of investment in unconsolidated affiliate 21.9 — 21.9 Other liabilities (7 ) 213.0 281.3 260.9 Total liabilities 2,403.0 2,420.0 2,085.3 Equity 507.8 592.2 661.7 Total liabilities and equity $ 2,910.8 $ 3,012.2 $ 2,747.0\nTHE SCOTTS MIRACLE-GRO COMPANY Reconciliation of Non-GAAP Disclosure Items (5) (In millions, except per common share data) (Unaudited) Three Months Ended December 30, 2017 Three Months Ended December 31, 2016 Footnotes As\nReported\n(GAAP) Discontinued\nOperations Impairment,\nRestructuring\nand Other Adjusted\n(Non-\nGAAP) As\nReported\n(GAAP) Discontinued\nOperations Impairment,\nRestructuring\nand Other Adjusted\n(Non-\nGAAP) Gross profit $ 34.0 $ — $ — $ 34.0 $ 36.8 $ — $ — $ 36.8 Gross profit as a % of sales 15.3 % 15.3 % 17.7 % 17.7 % Loss from operations (71.9 ) — 0.2 (72.1 ) (61.8 ) — 0.2 (62.0 ) Loss from operations as a % of sales (32.5 )% (32.6 )% (29.8 )% (29.9 )% Equity in (income) loss of unconsolidated affiliates (3 ) (0.6 ) — — (0.6 ) 13.2 — 9.6 3.6 Loss from continuing operations before income taxes (86.6 ) — 0.2 (86.8 ) (90.3 ) — (9.4 ) (80.9 ) Income tax benefit from continuing operations (66.6 ) — (42.0 ) (24.6 ) (32.2 ) — (3.5 ) (28.7 ) Loss from continuing operations (20.0 ) — 42.2 (62.2 ) (58.1 ) — (5.9 ) (52.2 ) Net loss attributable to controlling interest (21.2 ) (1.2 ) 42.2 (62.2 ) (65.3 ) (6.8 ) (5.9 ) (52.6 ) Diluted loss per common share from continuing operations (0.35 ) — 0.73 (1.08 ) (0.97 ) — (0.10 ) (0.88 )\nCalculation of Adjusted EBITDA (5): Three Months Ended\nDecember 30, 2017 Three Months Ended\nDecember 31, 2016 Net loss (GAAP) $ (21.2 ) $ (64.9 ) Income tax benefit from continuing operations (66.6 ) (32.2 ) Income tax benefit from discontinued operations — (3.5 ) (Gain) loss on sale / contribution of business (0.2 ) 0.3 Interest expense 17.8 15.6 Depreciation 12.7 14.0 Amortization 7.1 6.0 Impairment, restructuring and other from continuing operations (0.2 ) 9.4 Impairment, restructuring and other from discontinued operations 1.4 2.2 Interest income (2.5 ) — Expense on certain leases 0.9 0.9 Share-based compensation expense 6.0 2.3 Adjusted EBITDA (Non-GAAP) $ (44.8 ) $ (49.9 )\nNote: See accompanying footnotes on page 8. The sum of the components may not equal due to rounding.\nTHE SCOTTS MIRACLE-GRO COMPANY\nFootnotes to Preceding Financial Statements\n(1) Basic income (loss) per common share amounts are calculated by dividing income (loss) from continuing operations, income (loss) from discontinued operations and net income (loss) attributable to controlling interest by the weighted average number of common shares outstanding during the period.\n(2) Diluted income (loss) per common share amounts are calculated by dividing income (loss) from continuing operations, income (loss) from discontinued operations and net income (loss) attributable to controlling interest by the weighted average number of common shares, plus all potential dilutive securities (common stock options, performance shares, performance units, restricted stock and restricted stock units) outstanding during the period.\n(3) On April 13, 2016, pursuant to the terms of the Contribution and Distribution Agreement, by and among the Company and TruGreen Holding Corporation (“TruGreen Holdings”), the Company completed the contribution of the Scotts LawnService ® business (the “SLS Business”) to a newly formed subsidiary of TruGreen Holdings (the “TruGreen Joint Venture”) in exchange for a minority equity interest of 30% in the TruGreen Joint Venture. As a result, effective in its second quarter of fiscal 2016, the Company classified its results of operations for all periods presented to reflect the SLS Business as a discontinued operation and classified the assets and liabilities of the SLS Business as held for sale. In the first quarter of fiscal 2018, the Company discontinued applying the equity method of accounting for the TruGreen Joint Venture as the Company’s investment and advances were reduced to zero. The Company does not have any contractual obligations to fund losses of the TruGreen Joint Venture.\n(4) On April 29, 2017, the Company received a binding and irrevocable conditional offer (the “Offer”) from Exponent Private Equity LLP (“Exponent”) to purchase its consumer lawn and garden business in certain international jurisdictions (the “International Business”). On July 5, 2017, the Company accepted the Offer and entered into the Share and Business Sale Agreement (the “Agreement”) contemplated by the Offer. The transaction closed on August 31, 2017. Pursuant to the Agreement, Scotts-Sierra Investments LLC, an indirect wholly-owned subsidiary of the Company (“Sierra”) and certain of its direct and indirect subsidiaries, entered into separate stock or asset sale transactions with respect to the consumer lawn and garden businesses located in Australia, Austria, Benelux, Czech Republic, France, Germany, Poland and the United Kingdom. As a result, effective in its fourth quarter of fiscal 2017, the Company classified its results of operations for all periods presented to reflect the International Business as a discontinued operation and classified the assets and liabilities of the International Business as held for sale.\n(5) Reconciliation of Non-GAAP Measures\nUse of Non-GAAP Measures\nTo supplement the financial measures prepared in accordance with U.S. generally accepted accounting principles (“GAAP”), the Company uses non-GAAP financial measures. The reconciliations of these non-GAAP financial measures to the most directly comparable financial measures calculated and presented in accordance with GAAP are shown in the tables above. These non-GAAP financial measures should not be considered in isolation from, or as a substitute for or superior to, financial measures reported in accordance with GAAP. Moreover, these non-GAAP financial measures have limitations in that they do not reflect all the items associated with the operations of the business as determined in accordance with GAAP. Other companies may calculate similarly titled non-GAAP financial measures differently than the Company, limiting the usefulness of those measures for comparative purposes.\nIn addition to GAAP measures, management uses these non-GAAP financial measures to evaluate the Company’s performance, engage in financial and operational planning and determine incentive compensation because it believes that these measures provide additional perspective on and, in some circumstances are more closely correlated to, the performance of the Company’s underlying, ongoing business.\nManagement believes that these non-GAAP financial measures are useful to investors in their assessment of operating performance and the valuation of the Company. In addition, these non-GAAP financial measures address questions routinely received from analysts and investors and, in order to ensure that all investors have access to the same data, management has determined that it is appropriate to make this data available to all investors. Non-GAAP financial measures exclude the impact of certain items (as further described below) and provide supplemental information regarding operating performance. By disclosing these non-GAAP financial measures, management intends to provide investors with a supplemental comparison of operating results and trends for the periods presented. Management believes these measures are also useful to investors as such measures allow investors to evaluate performance using the same metrics that management uses to evaluate past performance and prospects for future performance. Management views free cash flow as an important measure because it is one factor used in determining the amount of cash available for dividends and discretionary investment. Management views free cash flow productivity as a useful measure to help investors understand the Company’s ability to generate cash.\nExclusions from Non-GAAP Financial Measures\nNon-GAAP financial measures reflect adjustments based on the following items:\nImpairments, which are excluded because they do not occur in or reflect the ordinary course of the Company’s ongoing business operations and their exclusion results in a metric that provides supplemental information about the sustainability of operating performance. Restructuring and employee severance costs, which include charges for discrete projects or transactions that fundamentally change the Company’s operations and are excluded because they are not part of the ongoing operations of its underlying business, which includes normal levels of reinvestment in the business. Costs related to refinancing, which are excluded because they do not typically occur in the normal course of business and may obscure analysis of trends and financial performance. Additionally, the amount and frequency of these types of charges is not consistent and is significantly impacted by the timing and size of debt financing transactions. Charges or credits incurred by the TruGreen Joint Venture that are apart from and not indicative of the results of its ongoing operations, including transaction related costs, refinancing costs, restructurings and other discrete projects or transactions including a non-cash purchase accounting fair value write down adjustment related to deferred revenue and advertising (“TruGreen Joint Venture non-GAAP adjustments”). Discontinued operations and other unusual items, which include costs or gains related to discrete projects or transactions and are excluded because they are not comparable from one period to the next and are not part of the ongoing operations of the Company’s underlying business.\nThe tax effect for each of the items listed above is determined using the tax rate and other tax attributes applicable to the item and the jurisdiction(s) in which the item is recorded.\nDefinitions of Non-GAAP Financial Measures\nThe reconciliations of non-GAAP disclosure items include the following financial measures that are not calculated in accordance with GAAP and are utilized by management in evaluating the performance of the business, engaging in financial and operational planning, the determination of incentive compensation, and by investors and analysts in evaluating performance of the business:\nAdjusted gross profit : Gross profit excluding impairment, restructuring and other charges / recoveries.\nAdjusted income (loss) from operations : Income (loss) from operations excluding impairment, restructuring and other charges / recoveries.\nAdjusted equity in (income) loss of unconsolidated affiliates : Equity in (income) loss of unconsolidated affiliates excluding TruGreen Joint Venture non-GAAP adjustments.\nAdjusted other non-operating (income) expense : Other non-operating (income) expense excluding impairment, restructuring and other charges / recoveries.\nAdjusted income (loss) from continuing operations before income taxes : Income (loss) from continuing operations\nbefore income taxes excluding impairment, restructuring and other charges / recoveries, costs related to refinancing\nand TruGreen Joint Venture non-GAAP adjustments.\nAdjusted income tax expense (benefit) from continuing operations : Income tax expense (benefit) from continuing operations excluding the tax effect of impairment, restructuring and other charges / recoveries, costs related to refinancing and TruGreen Joint Venture non-GAAP adjustments.\nAdjusted income (loss) from continuing operations : Income (loss) from continuing operations excluding impairment, restructuring and other charges / recoveries, costs related to refinancing and TruGreen Joint Venture non-GAAP adjustments, each net of tax.\nAdjusted net income (loss) attributable to controlling interest from continuing operations : Net income (loss) attributable to controlling interest excluding impairment, restructuring and other charges / recoveries, costs related to refinancing, TruGreen Joint Venture non-GAAP adjustments and discontinued operations, each net of tax.\nAdjusted diluted income (loss) per common share from continuing operations : Diluted income (loss) per common share from continuing operations excluding impairment, restructuring and other charges / recoveries, costs related to refinancing and TruGreen Joint Venture non-GAAP adjustments, each net of tax.\nAdjusted EBITDA : Net income (loss) before interest, taxes, depreciation and amortization as well as certain other items such as the impact of the cumulative effect of changes in accounting, costs associated with debt refinancing and other non-recurring or non-cash items affecting net income (loss). The presentation of adjusted EBITDA is intended to be consistent with the calculation of that measure as required by the Company’s borrowing arrangements, and used to calculate a leverage ratio (maximum of 4.50 at December 30, 2017) and an interest coverage ratio (minimum of 3.00 for the twelve months ended December 30, 2017).\nFree cash flow : Net cash provided by (used in) operating activities reduced by investments in property, plant and equipment.\nFree cash flow productivity : Ratio of free cash flow to net income (loss).\nFor the three months ended December 30, 2017, the following items were adjusted, in accordance with the definitions above, to arrive at the non-GAAP financial measures:\nThe Company recognized adjustments to previously recognized termination benefits of $0.2 million for the three months ended December 30, 2017 related to Project Focus activity within the “Impairment, restructuring and other” line in the Condensed Consolidated Statements of Operations. On December 22, 2017, President Trump signed into law H.R.1 (the “Act,” formerly known as the “Tax Cuts and Jobs Act”) which provides for significant changes to the U.S. Internal Revenue Code of 1986, as amended. Among other items important to the Company, the Act implements a territorial tax system, imposes a one-time transition tax on deemed repatriated earnings of foreign subsidiaries, and permanently reduces the federal corporate tax rate to 21% effective January 1, 2018. As the Company’s fiscal year end falls on September 30, the statutory federal corporate tax rate for fiscal 2018 will be prorated to 24.5%, with the statutory rate for 2019 and beyond at 21%. At September 30, 2017, the Company had a net deferred tax liability of $157.5 million. In connection with this law change, the Company recognized a one-time $45.9 million net tax benefit adjustment reflecting the revaluation of its net deferred tax liability at the lower tax rate. In addition, as part of the Act, the Company recognized one-time tax expense on deemed repatriated earnings and cash of foreign subsidiaries as required by the new law of $14.0 million plus local statutory withholding tax expense on these foreign subsidiaries of $3.8 million; partially offset by the recognition and application of foreign tax credits associated with these foreign subsidiaries of $13.9 million.\nFor the three months ended December 31, 2016, the following items were adjusted, in accordance with the definitions above, to arrive at the non-GAAP financial measures:\nThe Company recognized adjustments to previously recognized termination benefits of $0.2 million for the three months ended December 31, 2016 related to Project Focus activity within the “Impairment, restructuring and other” line in the Condensed Consolidated Statements of Operations. The Company incurred TruGreen Joint Venture non-GAAP adjustments of $9.6 million for the three months ended December 31, 2016 within the “Equity in (income) loss of unconsolidated affiliates” line in the Condensed Consolidated Statements of Operations.\nForward Looking Non-GAAP Measures\nIn this earnings release, the Company presents its outlook for fiscal 2018 non-GAAP adjusted EPS. The Company does not provide a GAAP EPS outlook, which is the most directly comparable GAAP measure to non-GAAP adjusted EPS, because changes in the items that the Company excludes from GAAP EPS to calculate non-GAAP adjusted EPS, described above, can be dependent on future events that are less capable of being controlled or reliably predicted by management and are not part of the Company’s routine operating activities. Additionally, due to their unpredictability, management does not forecast the excluded items for internal use and therefore cannot create or rely on a GAAP EPS outlook without unreasonable efforts. The timing and amount of any of the excluded items could significantly impact the Company’s GAAP EPS. As a result, the Company does not provide a reconciliation of guidance for non-GAAP adjusted EPS to GAAP EPS, in reliance on the unreasonable efforts exception provided under Item 10(e)(1)(i)(B) of Regulation S-K.\n(6) For the three months ended December 30, 2017, the Company has classified interest income on loans receivable of $2.5 million in the “Other non-operating income” line in the Condensed Consolidated Statements of Operations. For the three months ended December 31, 2016, interest income on loans receivable of $2.7 million is classified in the “Other income, net” line in the Condensed Consolidated Statements of Operations.\n(7) In November 2015, the FASB issued an accounting standard update to simplify the presentation of deferred income taxes by requiring that deferred income tax liabilities and assets be classified as noncurrent in a classified statement of financial position. The Company adopted this guidance on a retrospective basis during the fourth quarter of fiscal 2017. As a result, deferred tax assets totaling $44.8 million have been classified net in the “Other liabilities” line in the Condensed Consolidated Balance Sheets as of December 31, 2016. This amount was previously classified in the “Prepaid and other current assets” line.\nSource:Scotts Miracle-Gro Company(The)", "external_links": ["https://www.globenewswire.com/Tracker?data=dMtl4ZKRRQQBjcDp6t4nmOxMdJZf4tHpXvoNxQ1OhKTZWSg41XLa_zYEdMa5NFd3oeYvHhVLK239C4X1ZdYa9bEFgkSJY5uZdTW8b8s-DrY=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/47da2710-72be-47c2-b8cb-af2cfe5d9f95", "https://www.globenewswire.com/Tracker?data=wPZ0FuMSGCClW48ol3t2d1Ab9Z_y6wJq0NxQdyL8-dE_gC8c4d2_B5uMzO-G-ZmUydzZcBSCWY7_NqV7I2PlF9jpa9F1CEShfRTMEpyILo0="], "published": "2018-01-30T15:00:00.000+02:00", "crawled": "2018-01-30T15:20:00.006+02:00", "highlightTitle": ""}