{"organizations": [], "uuid": "4648c053d11a0a41c7f3a669a944404a97dbad8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-diplomat-initiates-ceo-transition-reaffirms-2017-guidance-and-provides-preliminary-2018-outlook.html", "country": "US", "domain_rank": 767, "title": "Diplomat Initiates CEO Transition; Reaffirms 2017 Guidance and Provides Preliminary 2018 Outlook", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T16:31:00.000+02:00", "replies_count": 0, "uuid": "4648c053d11a0a41c7f3a669a944404a97dbad8c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-diplomat-initiates-ceo-transition-reaffirms-2017-guidance-and-provides-preliminary-2018-outlook.html", "ord_in_thread": 0, "title": "Diplomat Initiates CEO Transition; Reaffirms 2017 Guidance and Provides Preliminary 2018 Outlook", "locations": [], "entities": {"persons": [{"name": "ben wolin", "sentiment": "none"}, {"name": "hagerman", "sentiment": "none"}, {"name": "phil hagerman", "sentiment": "none"}, {"name": "jeff park", "sentiment": "none"}, {"name": "park", "sentiment": "none"}], "locations": [{"name": "mich.", "sentiment": "none"}, {"name": "outlook flint", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "diplomat pharmacy, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "diplomat board of directors", "sentiment": "none"}, {"name": "diplomat board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FLINT, Mich., Diplomat Pharmacy, Inc. (NYSE: DPLO) (\"Diplomat\" or the \"Company\") today announced that Jeff Park, a member of the Diplomat Board of Directors, has been appointed Interim Chief Executive Officer, effective immediately. Mr. Park's appointment follows the retirement of Phil Hagerman, co-founder of Diplomat in 1975 and Chief Executive Officer and Chairman of Diplomat since 1991. Mr. Hagerman will remain as a member of the Diplomat Board and become Chairman Emeritus. The Board has appointed Ben Wolin, independent Lead Director, as Chairman of the Diplomat Board, effective immediately.\nMr. Hagerman's decision to retire as CEO was made with the support of the Board of Directors. The Board has commenced a comprehensive search process to identify a permanent CEO with the assistance of a leading, independent executive search firm. Mr. Hagerman will serve as a consultant to the Company during the CEO search process to ensure a smooth transition. As a consultant, Mr. Hagerman will advise the management team on the execution of Diplomat's growth plans and the integration of recent acquisitions.\nBen Wolin said, \"Diplomat has a significant opportunity to enhance shareholder value by building on our recent acquisitions and accelerating our evolution from a specialty pharmacy provider to a broader health care company. While we have made meaningful progress over this past year, there remains work ahead to build on the growth plans we have in place. Phil and the Board have mutually determined that now is the right time to identify a new CEO to help drive the Company forward and position Diplomat for long-term growth and success. As we continue to execute on our strategy, we will remain true to our one essential tenet: take good care of patients and the rest falls into place.\"\nMr. Wolin continued, \"Over the course of 2017, we have strengthened our senior leadership team and Board to ensure we have the right talent and we are pleased Jeff has agreed to step into the role of Interim CEO while we search for a permanent successor. Jeff joined the Board in June 2017, and brings a unique understanding and proven track record in the PBM and Pharmacy industries. Throughout his career, Jeff has overseen the integration of over a dozen transactions, and we look forward to benefitting from his operational expertise as we continue to integrate our recent acquisitions. As Jeff and the management team work to realize Diplomat's potential, the Board will conduct a comprehensive search to identify a leader with a proven track record of performance in the key areas of growth and focus for Diplomat. We look forward to Phil's continued contributions on the Board, and wish him the best in his well-deserved retirement.\"\nMr. Hagerman said, \"I am proud of all that Diplomat has accomplished since my father, Dale Hagerman, and I co-founded Diplomat more than 40 years ago. Over this time, Diplomat has grown from an individual pharmacy in Flint, Michigan to the nation's largest independent provider of specialty pharmacy services – reaching patients and providers across all 50 states. We have added great talent to Diplomat's leadership team over the past year, and the time is right for this leadership change to help accelerate Diplomat's growth into a broader based health care company. I look forward to presenting together with Jeff on this strategy next week at the JP Morgan Healthcare conference in San Francisco. I will continue to support the Company as a consultant during this transition period and look forward to remaining involved with Diplomat as a member of the Board.\"\nMr. Park said, \"I look forward to working closely with our talented management team and Board to drive sustainable growth. Together, we will work to enhance our pharmacy capabilities and expand our service offerings to address the needs of our partners across the continuum of care, while continuing our unwavering focus on the health of patients we serve. Our updated financial outlook demonstrates the momentum we are seeing across our business and positions us for a strong 2018. With the integration of our acquisitions of National Pharmaceutical Services and LDI Integrated Pharmacy Services underway, we are on track to meet growing demand for an affordable service model and increased access to complex therapies, strengthening our business for the long-term.\"\n2017 Guidance and 2018 Financial Outlook\nIn a separate press release issued today, the Company reaffirmed guidance for the full-year 2017 and provided its preliminary 2018 outlook:\nDiplomat preliminarily expects 2017 revenue will be at the midpoint of the previously provided range of $4.4 and $4.6 billion and Adjusted EBITDA will be at the upper end of the previously announced range of $99 and $102 million. In 2018, Diplomat preliminarily expects revenue in the range of $5.3 to $5.6 billion, representing an approximately 20 percent increase based on the midpoint of the 2017 range, and Adjusted EBITDA in the range of $164 to $170 million, representing an approximately 66 percent increase based on the midpoint of the 2017 range.\nAbout Jeff Park\nJeff Park has been a director since June 2017. Prior to his appointment as Interim CEO, he was a member of the Audit Committee. Mr. Park was the Chief Operating Officer of OptumRx, a $75 billion entity resulting from the merger of Catamaran Corporation (NASDAQ: CTRX), a major Pharmacy Benefits Management (PBM) services provider, and OptumRx, UnitedHealth Group's (NYSE: UNH) free-standing pharmacy care services business from July 2015 until July 2016. Immediately prior to the merger, Mr. Park served as Catamaran's Executive Vice President, Operations since March 2014 and previously served as its Chief Financial Officer beginning in 2006. Prior to serving as Chief Financial Officer, Mr. Park was a member of Catamaran's board of directors and was a Senior Vice President of Covington Capital Corporation, a private equity venture capital firm he joined in 1998.\nMr. Park has substantial experience in the PBM and Pharmacy industries and has led PBM, pharmacy and technology operations, as well as clinical and member services. He has also had key managerial, financial and operational responsibilities during his 11 years in the health care industry, including significant roles in building operations through the integration of over a dozen acquisitions and driving organic growth. Mr. Park also has extensive financial and accounting expertise having served as a chief financial officer through a transition from a small Canadian listed public company to a Fortune 500 Nasdaq listed public company. In addition to his public company board experience, Mr. Park previously served on ten Covington portfolio company boards.\nAbout Ben Wolin\nBenjamin Wolin has been a director since October 2015 and the independent Lead Director since February 2017. He is a member of the Audit Committee and the Nominating and Corporate Governance Committee of Diplomat.\nMr. Wolin was the co-founder, Chief Executive Officer and a member of the boar", "external_links": ["http://www.prnewswire.com/news-releases/diplomat-initiates-ceo-transition-reaffirms-2017-guidance-and-provides-preliminary-2018-outlook-300578174.html", "http://www.diplomat.is/"], "published": "2018-01-05T16:31:00.000+02:00", "crawled": "2018-01-05T18:05:13.002+02:00", "highlightTitle": ""}