{"organizations": [], "uuid": "50c52031e160c1c808c22880c40b71b5df3aaf72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/ersekstill2.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/22/hikmet-ersek-western-union/", "country": "US", "domain_rank": 1196, "title": "Western Union CEO: Money Transfers Are Crucial Part of People's Lives | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-23T17:00:00.000+02:00", "replies_count": 0, "uuid": "50c52031e160c1c808c22880c40b71b5df3aaf72"}, "author": "Susie Gharib", "url": "http://fortune.com/2018/01/22/hikmet-ersek-western-union/", "ord_in_thread": 0, "title": "Western Union CEO: Money Transfers Are Crucial Part of People's Lives | Fortune", "locations": [], "entities": {"persons": [{"name": "susie gharib", "sentiment": "negative"}, {"name": "hikmet ersek", "sentiment": "negative"}, {"name": "ersek", "sentiment": "none"}], "locations": [{"name": "western union", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "western union", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Susie Gharib 3:00 PM EST \nHikmet Ersek knows how to tell a good story. And as CEO of Western Union, storytelling is how he explains to employees the company’s mission and business strategies. \nErsek says he has shared his own personal story “hundreds of times” about how he relied on Western Union to send money to his father in Turkey so he could buy blood pressure medicine. “It was not easy to send money from Europe to Turkey. And I said, if I have that issue, then millions of customers must have the same issue,” he explains. “I tell this story in my management meetings. I told this story maybe one hundred times.” \nErsek’s personal experience is why he joined Western Union in 1999. Eleven years later he would become CEO and his key message and mission since then has been “moving money for the better.” \nWestern Union, which was founded in 1851 and famous for its giant telegraph system, is now the largest money transfer company in the world. It conducts cross-border money transfers in 200 countries and does transactions in more than 130 currencies. The legendary company has built much of its business on helping immigrants and refugees send and receive money to and from their families for nominal fees. \nServing those customers takes people who believe wholeheartedly in Western Union’s mission, says Ersek, and so he looks to hire special kinds of leaders. \n“They should have a big heart. Our customers are special. Our customers sometimes take miles, days, to come to a country. They work hard and we should understand that,” says Ersek. “I am looking for people who really understand that hardship journey and have a big heart for that.” \nWatch the video above for more of our conversation with Ersek. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-23T17:00:00.000+02:00", "crawled": "2018-01-23T01:50:13.005+02:00", "highlightTitle": ""}