{"organizations": [], "uuid": "95ce6add4981a90f779815b93d7ae0151cbbc078", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/arlanhamilton_104298-web_104298.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/24/arlan-hamilton-backstage-capital/", "country": "US", "domain_rank": 1196, "title": "Backstage Capital Bets on Women, People Of Color, and LGBTQ Founders | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.311, "site_type": "news", "published": "2018-01-24T02:00:00.000+02:00", "replies_count": 0, "uuid": "95ce6add4981a90f779815b93d7ae0151cbbc078"}, "author": "Polina Marinova", "url": "http://fortune.com/2018/01/24/arlan-hamilton-backstage-capital/", "ord_in_thread": 0, "title": "Backstage Capital Bets on Women, People Of Color, and LGBTQ Founders | Fortune", "locations": [], "entities": {"persons": [{"name": "susan kimberlin", "sentiment": "none"}, {"name": "hamilton", "sentiment": "none"}, {"name": "marc andreessen", "sentiment": "none"}, {"name": "arlan hamilton", "sentiment": "none"}], "locations": [{"name": "silicon valley", "sentiment": "none"}], "organizations": [{"name": "backstage capital j", "sentiment": "negative"}, {"name": "backstage capital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why This VC Is Betting on Women, People Of Color, and LGBTQ Founders Courtesy of Backstage Capital January 24, 2018 \nThis article originally ran in Term Sheet, Fortune’s newsletter about deals and dealmakers. Sign up here. \nFour years ago, Arlan Hamilton was living out of a hotel room that she shared with her mom. At that point, she had given up a career as a live music production coordinator to become a venture capitalist. There were a few problems though: She didn’t have a formal finance background and virtually no connections in Silicon Valley. \nHer goal? Raise a fund that invests in companies founded by underrepresented entrepreneurs, including women, people of color, LGBTQ company founders, or any combination of the three. She cold-emailed venture investors, explained her strategy, and asked them to back her fund. She eventually managed to raise enough capital to launch Backstage Capital . “[They] saw that I wasn’t just a VC tourist — I was serious,” she says. \nHamilton convinced a number of remarkable limited partners to back her fund, including Susan Kimberlin, Marc Andreessen, Chris Sacca, Stewart Butterfield, and Ellen Pao. Since 2015, Backstage has deployed approximately $3 million across more than 60 pre-seed and seed stage startups. The portfolio includes companies such as Thesis Couture, Mars Reel, and Tinsel. \nFortune spoke with Hamilton about why she believes a diverse portfolio is good for business. \nTell me about your investment thesis. What are some of the key elements you look for in a founder or company before investing? \nWe invest in founders who are women, people of color, and/or LGBT. We felt like a lot of these people and companies were being overlooked, undervalued, and underestimated. With a little bit of leveling the playing field, we believe that these people are equipped to handle an erratic market and the various ups and downs in the startup world. \nHow do you think about dealflow, and what’s your current process of driving it? \nWhen I first started, the question I would get from potential LPs over and over again was: Will you have the dealflow for this? How will you find them? We see more than a thousand companies every year. All of them, except for the several that haven’t researched us, are led by underrepresented and underestimated founders. \nYou’ve said previously that you don’t look at investing as “social impact” or a “charity.” Can you elaborate on that? \nI think that “social impact” and “charity” are two different things. While in the past I’ve said we’re not an impact fund, I’ve actually come around to understand that we are an impact fund, and I’m proud of that. We are an impact fund because of the impact we have, but we are also looking for outsize returns. Those things do not have to be mutually exclusive. \nNow, I will say that we are not a charity or a non-profit. When you talk to a group of white, affluent male investors and tell them you’re investing in women of color, the first thing that comes out is, “Oh, that’s really nice of you. That’s a great mission.” They immediately correlate us to needing a helping hand. This is not that. \nWhat do you think about VC firms forming independent funds to back diverse founders separately from their own firms? \nHere’s the thing: In an ideal world, they wouldn’t think about it as something separate. But at least, it’s a step forward. I’d rather them do that than completely ignore it. I would be happy to go along to the top 10 funds in the country and help them do that. It’s all about getting the capital access — the politics of it we can talk about another time. You have to start somewhere, so I volunteer to go into any fund and help them start a scout fund that is scouting for diversity. That is not a bad idea, and I applaud the people who are already doing that. They may not have it perfect, but they’re attempting it, and that’s a good start. \nOn average, women founders receive less than 3% of total VC dollars and women of color receive only 0.2%. What needs to happen for these stats to change? \nA few things: One, more and more angels of color and women angels need to step up and meet founders early in their journey. There’s power in numbers. Two, some of these companies need to have more support at the post-seed level. There’s a lot that has been done at the pre-seed and seed level, but then there’s nowhere for them to go after that. I think larger investors think we’ve taken care of it because there’s a black woman writing a check. That’s not enough. We just can’t do it alone. The larger investors need to step up. \nYou support founders in the early stage, but what do you advise them to do as their company grows and they need further capital? \nI struggle with that question because I’ve seen so much. I want to tell them that this is a meritocracy and that as long as you keep hitting your KPIs, you’ll be met with a Series A investor and you’ll be part of that percentage that makes it to the next level. But the reality is that the best and brightest and most deserving — even with the numbers, even with the traction — are being shut out. So I don’t know the answer to that until the larger investors really take this seriously and put money behind it. \nHow can the industry get more funding to female founders & more women partners in VC firms? \nOver the next 18 months, there will be two or three major exits that are just too hard to ignore that will come from women or come from people of color. They will be profound exits that shock the system. Once that happens, a lot of investors will take note, and I believe that will happen by the middle of 2019. I also think that there needs to be a group of LPs who demand that their fund managers are looking at diversity and are actively looking at leveling the playing field. \nWhat are some interesting industry trends in tech right now you think Term Sheet readers should be paying attention to? \nI actually don’t pay much attention to industry trends in tech, to be quite honest. I just spend a lot of time hyperfocused on what we’re doing. I will say that the more I learn about blockchain, the more excited I get about it. It could potentially level the playing field. \nDo you think cryptocurrency and the blockchain has the power to disrupt venture capital as it stands today? \nYes — it has the power to turn it upside down. The people who aren’t figuring out that Silicon Valley doesn’t represent the United States are the same people who laugh and scoff at cryptocurrency. You may laugh at the silliness of the scams but the root of what’s happening is that the world has figured out a different way to communicate and trade with each other. It’s like a new language, and if you aren’t able to read and write in that language over the next couple of years, you’ll be left in the dust. \nWhat’s the best business advice you’ve ever received? \nGo home. Take the day off. Stop working. I’m a big proponent of self-care, and I’ll never stop talking about it. If self-care isn’t part of your daily and business routine, you’re doing it wrong. It’s about recognizing how valuable you are, and you can’t run a company if you’re not able to take care of yourself first. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-24T02:00:00.000+02:00", "crawled": "2018-01-25T03:05:43.026+02:00", "highlightTitle": ""}