{"organizations": [], "uuid": "2f7167a6f05f8111396037727b7ec8fd9e8e7b41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/10", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-superior-industries-announces-ellen-b-richstone-board-director-is-recognized-as-an-nacd-board-leadership-fellow.html", "country": "US", "domain_rank": 767, "title": "Superior Industries Announces Ellen B. Richstone, Board Director, is Recognized as an NACD Board Leadership Fellow", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-25T21:58:00.000+02:00", "replies_count": 0, "uuid": "2f7167a6f05f8111396037727b7ec8fd9e8e7b41"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-superior-industries-announces-ellen-b-richstone-board-director-is-recognized-as-an-nacd-board-leadership-fellow.html", "ord_in_thread": 0, "title": "Superior Industries Announces Ellen B. Richstone, Board Director, is Recognized as an NACD Board Leadership Fellow", "locations": [], "entities": {"persons": [{"name": "ellen b. richstone", "sentiment": "negative"}], "locations": [{"name": "mich.", "sentiment": "none"}, {"name": "ield", "sentiment": "none"}], "organizations": [{"name": "superior industries", "sentiment": "negative"}, {"name": "superior industries international, inc.", "sentiment": "none"}, {"name": "national association of corporate directors", "sentiment": "none"}, {"name": "audit committee chair of superior", "sentiment": "none"}, {"name": "nacd fellows", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NACD Fellows demonstrate their commitment to the highest level of leadership in the Boardroom\nSOUTHFIELD, Mich.--(BUSINESS WIRE)-- Superior Industries International, Inc. (“Superior”) (NYSE:SUP) , one of the world’s leading aluminum wheel suppliers for OEMs and the European aftermarket, today announced that the National Association of Corporate Directors (“NACD”) recently recognized Ellen B. Richstone, Board Director and Audit Committee Chair of Superior, as an NACD Board Leadership Fellow. NACD Fellows, who earn NACD Fellowship – The Gold Standard Director Credential ® – stand within the highest echelon of those committed to excellence in the boardroom.\nAs the highest standard of credentialing for directors and governance professionals, NACD Fellowship is a comprehensive and continuous program of study that empowers Fellows with the latest insights, intelligence, and leading boardroom practices year after year.\n“I am honored to join the distinguished and diverse group of individuals who make up the NACD Fellow community and who are committed to advancing the highest standards of boardroom excellence,” said Ms. Richstone. “The resources, insights, and connections I’ve made through NACD Fellowship and being on the Board of NACD New England are assets to the companies I serve, as well as to my professional growth as a director.”\nEllen is a former Fortune 500 CFO, former Fortune 500 Treasurer and former private company CEO. Currently a full-time professional director with extensive financial, global, and M&A experience, she is a financial expert and Audit Committee Chair with experience on Boards ranging in size from Micro-Cap to Large-Cap. Her Board experience includes: Technology, Industrial, Consumer Products, BioTech, Pharma and Automotive industries. Ellen also received the first annual Distinguished Director award from the American College of Corporate Directors in 2013 and has achieved its Executive Masters-Gold Level.\n“We are proud to announce that Ellen Richstone has joined NACD’s credentialed directors and has taken the next step in the pursuit of boardroom excellence,” said Peter Gleason, Chief Executive Officer of NACD. “Our fellows help advance the highest standards for those who serve in the boardroom, strengthening our businesses, and driving director professionalism. The impact of this program is unmatched, and they should be commended for their ongoing commitment to their own professional development.”\nTim McQuay, Chairman of the Board of Superior Industries, commented, “I’d like to congratulate Ellen on being recognized as an NACD Board Fellow Leader. This reflects her commitment to boardroom excellence and supports our company’s commitment to the highest standards of board governance.”\nAbout Superior Industries\nSuperior is one of the world’s leading aluminum wheel suppliers. Its team collaborates and partners with customers to design, engineer and manufacture a wide variety of innovative and high-quality products utilizing the latest lightweighting and finishing technologies. Superior also maintains leading aftermarket brands including ATS, RIAL, ALUTEC, and ANZIO. Headquartered in Southfield, Michigan, Superior is listed on the New York Stock Exchange and is a component of Standard & Poor’s Small Cap 600 and Russell 2000 Indices. For more information, please visit www.supind.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125006109/en/\nSuperior Investor Relations\nTroy Ford\n(248) 234-7104\nInvestor.Relations@supind.com\nor\nClermont Partners\nVictoria Sivrais\n(312) 690-6004\nvsivrais@clermontpartners.com\nSource: Superior Industries International, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180125006109/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.supind.com&esheet=51749066&newsitemid=20180125006109&lan=en-US&anchor=www.supind.com&index=1&md5=88b9cc80b5ade641d4d9f6aeab02721a"], "published": "2018-01-25T21:58:00.000+02:00", "crawled": "2018-01-26T02:24:44.013+02:00", "highlightTitle": ""}