{"organizations": [], "uuid": "015d0321dd95025731f715c3f66e9e0805c02fae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-aduro-biotech-announces-management-changes.html", "country": "US", "domain_rank": 767, "title": "Aduro Biotech Announces Management Changes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T16:00:00.000+02:00", "replies_count": 0, "uuid": "015d0321dd95025731f715c3f66e9e0805c02fae"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-aduro-biotech-announces-management-changes.html", "ord_in_thread": 0, "title": "Aduro Biotech Announces Management Changes", "locations": [], "entities": {"persons": [{"name": "jennifer lew", "sentiment": "none"}, {"name": "jen", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "gregory w. schafer", "sentiment": "none"}, {"name": "stephen t. isaacs", "sentiment": "none"}, {"name": "greg", "sentiment": "none"}, {"name": "lew", "sentiment": "none"}], "locations": [{"name": "berkeley", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "aduro", "sentiment": "none"}], "organizations": [{"name": "aduro biotech, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERKELEY, Calif., Jan. 05, 2018 (GLOBE NEWSWIRE) -- Aduro Biotech, Inc. (NASDAQ:ADRO) a biopharmaceutical company with three distinct immunotherapy technologies, today announced that Jennifer Lew has been promoted to chief financial officer. Ms. Lew, who previously served as the company’s senior vice president of finance, will oversee the company’s global finance operations, including accounting, planning, and investor relations functions. Separately, Gregory W. Schafer will be stepping down from his position as chief operating officer in early March and has agreed to continue as a consultant to the company to facilitate a smooth transition of responsibilities.\n“I am very pleased to congratulate Jen, an important and valued leader in the organization, on a well-deserved promotion,” said Stephen T. Isaacs, chairman, president and chief executive officer of Aduro. “Jen has played an integral role at Aduro, including participating in the company’s 2015 initial public offering and in maintaining the company’s strong cash position.”\nSteve continued, “I want to thank Greg for his tremendous contributions in the growth and development of Aduro these last four years. His expertise and leadership were essential to securing key partnerships and building the robust pipeline we have today.”\nJennifer Lew\nJennifer Lew joined Aduro in October 2013 and has served as our Senior Vice President of Finance since January 2015. Prior to joining Aduro, from 2004 to 2013, Ms. Lew held various positions of increasing responsibility at Dynavax Technologies, culminating as Vice President of Finance and Principal Accounting Officer responsible for all accounting and finance operations. Earlier in her career Ms. Lew served as Assistant Controller and Director of Finance at QRS Corporation, a publicly-held technology company, and was a member of the audit practice at Ernst & Young. Ms. Lew earned a B.A. in Economics/Accounting and Government from Claremont McKenna College and is a Certified Public Accountant (inactive status).\nAbout Aduro\nAduro Biotech, Inc. is an immunotherapy company focused on the discovery, development and commercialization of therapies that transform the treatment of challenging diseases. Aduro's technology platforms, which are designed to harness the body's natural immune system, are being investigated in cancer indications and have the potential to expand into autoimmune and infectious diseases. Aduro's STING Pathway Activator platform is designed to activate the STING receptor in immune cells, resulting in a potent tumor-specific immune response. ADU-S100 is the first STING Pathway Activator compound to enter the clinic and is currently being evaluated in both a Phase 1 monotherapy study as well as a Phase 1b combination study with an anti-PD1 immune checkpoint inhibitor. Aduro’s B-select monoclonal antibody platform is comprised of a number of immune modulating assets in research and development, including BION-1301, an anti-APRIL antibody. Aduro's pLADD program is based on proprietary attenuated strains of Listeria that have been engineered to express tumor neoantigens that are specific to an individual patient’s tumor. Other Listeria strains for lung and prostate cancers are being advanced by a partner. Aduro is collaborating with leading global pharmaceutical companies to expand its products and technology platforms. For more information, please visit www.aduro.com .\nCautionary Note on Forward-Looking Statements\nThis press release contains forward-looking statements for purposes of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements include statements regarding our intentions or current expectations concerning, among other things, the potential for our technology platforms, plans, and the potential for eventual regulatory approval of our product candidates. In some cases, you can identify these statements by forward-looking words such as “may,” “will,” “continue,” “plan,” “anticipate,” “intend,” “could,” “project,” “seek,” “expect,” “position” or the negative or plural of these words or similar expressions. Forward-looking statements are not guarantees of future performance and are subject to risks and uncertainties that could cause actual results and events to differ materially from those anticipated, including, but not limited to, our history of net operating losses and uncertainty regarding our ability to achieve profitability, our ability to develop and commercialize our product candidates, our ability to use and expand our technology platforms to build a pipeline of product candidates, our ability to obtain and maintain regulatory approval of our product candidates, our ability to operate in a competitive industry and compete successfully against competitors that have greater resources than we do, our reliance on third parties, and our ability to obtain and adequately protect intellectual property rights for our product candidates. We discuss many of these risks in greater detail under the heading “Risk Factors” contained in our quarterly report on Form 10-Q for the quarter ended September 30, 2017, which is on file with the Securities and Exchange Commission. Any forward-looking statements that we make in this press release speak only as of the date of this press release. We assume no obligation to update our forward-looking statements whether as a result of new information, future events or otherwise, after the date of this press release.\nContact:\nAlexandra Santos\nCorporate Affairs & Investor Relations\n510 809 9231\nMedia Contact:\nAljanae Reynolds\n510 809 2452\npress@aduro.com\nSource:Aduro Biotech, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=9Pql3w0T3I1RBzftLvajTWAhTH-QkEib1BQ7-09pTnmpK2Vt6oTj0bbJiMA1o2y98Cl4was_6IOjO4ByFwEhZg==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/93ed04ca-68db-44a7-bf22-0088208e44f2"], "published": "2018-01-05T16:00:00.000+02:00", "crawled": "2018-01-05T18:04:46.000+02:00", "highlightTitle": ""}