{"organizations": [], "uuid": "3a08aaf6749dfa4496e2b73eb48fb483d25719a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-scientific-learning-corp-signs-agreement-to-acquire-brainmaps-in-china.html", "country": "US", "domain_rank": 767, "title": "Scientific Learning Corp. Signs Agreement to Acquire BrainMaps in China", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.103, "site_type": "news", "published": "2018-01-19T00:05:00.000+02:00", "replies_count": 0, "uuid": "3a08aaf6749dfa4496e2b73eb48fb483d25719a8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-scientific-learning-corp-signs-agreement-to-acquire-brainmaps-in-china.html", "ord_in_thread": 0, "title": "Scientific Learning Corp. Signs Agreement to Acquire BrainMaps in China", "locations": [], "entities": {"persons": [], "locations": [{"name": "china oakland", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "scientific learning corp.", "sentiment": "negative"}, {"name": "scientific learning corp", "sentiment": "negative"}, {"name": "stanford", "sentiment": "none"}, {"name": "harvard", "sentiment": "none"}, {"name": "brain maps technology co. ltd.", "sentiment": "none"}, {"name": "mit", "sentiment": "none"}, {"name": "brainmaps", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OAKLAND, Calif.--(BUSINESS WIRE)-- Scientific Learning Corp. (OTC PINK:SCIL) announced today that it has signed a definitive agreement with Brain Maps Technology Co. Ltd. to acquire Shanghai-based BrainMaps , a blended learning company with more than 70 English language learning centers across China. BrainMaps combines Scientific Learning’s patented language learning technologies and a unique Online-to-Offline (O2O) methodology to help students achieve fluency in English in as little as three years.\nThe anticipated acquisition represents a major strategic shift for Scientific Learning to the large and rapidly expanding English language learning market in China as the primary growth engine for the Company’s unique and established intellectual property. The Company’s neuroscience-based educational technologies are built on more than 40 years of research and have been research-validated by over 250 studies, including those from Stanford, MIT, and Harvard.\n“China is a country where education-focused parents spend on average more than 30 percent of household income on education, and where 84 percent of families spend money on after-school tutoring,” said Robert C. Bowen, CEO of Scientific Learning. “BrainMaps’ recent success is emblematic of the strong demand for English language learning solutions for students in China, and this acquisition will enable us to further accelerate BrainMaps’ growth there.”\nThe proposed acquisition is contingent upon financing transactions to obtain the capital necessary to acquire BrainMaps and expand its presence in China, and board of director and shareholder approval of the election of Rick Lee and Tiffany Koo (or alternatives chosen by them) to the Scientific Learning board effective upon closing of the acquisition, among other conditions. Scientific Learning has engaged Tyton Partners , the leading provider of investment banking and strategy consulting services to the global knowledge sector, as its exclusive investment banking advisor to assist with the transaction.\nUnder the terms of the agreement, BrainMaps’ shareholders will receive 40 percent of the common stock of Scientific Learning, on a diluted basis, subject to certain exclusions. In addition, Scientific Learning will pay BrainMaps shareholders $6.2 million in cash. Also, BrainMaps’ shareholders will be eligible for up to $12 million in earn-out cash payments earned over seven and a half years. Earn-out payments will be made annually based on the continued employment of Rick Lee and Tiffany Koo, with $9 million of the potential earn-out to be earned as a percentage of the free cash flow generated by BrainMaps’ business.\nThe agreement also sets forth material terms of employment agreements to be executed at closing between the Company and Rick Lee and Tiffany Koo. Terms of the deal are subject to various conditions, exceptions and limitations. Please refer to the actual agreement for full details on https://www.otcmarkets.com/stock/SCIL/filings .\n“We have been partners with Scientific Learning for more than 12 years, and this definitive agreement between our companies is the next step on our journey to help change the way Chinese students learn English,” said BrainMaps founder and CEO Rick Lee. “Millions of Chinese youngsters can benefit from the unique combination of neuroscience-based online solutions from Scientific Learning, and BrainMaps’ effective O2O instructional model.”\nAbout Scientific Learning Corp.\nBased in Oakland, Calif., Scientific Learning is a leading SaaS provider that delivers neuroscience-based educational technologies. Scientific Learning’s programs, Fast ForWord® and Reading Assistant™, have been used by more than 2.8 million learners in more than 2,600 K-12 schools in the United States, by over 500 private practice clinicians, by thousands of students via a direct-to-consumer channel, and in over 55 countries via Value Added Resellers (VAR). The Fast ForWord programs cross-train foundational language and cognitive skills necessary for rapid English language development, while Reading Assistant uses speech verification technology to provide real-time corrective feedback to students as they read and speak, in a manner similar to that of an individualized language and reading coach.\nAbout BrainMaps\nBrainMaps, a VAR partner of Scientific Learning’s for over 12 years, was founded by Rick Lee and Tiffany Koo, who are using their past experience as national directors for companies such as Wall Street English and Gymboree to rapidly expand the BrainMaps model across China. Based on its compelling student outcomes and rapid growth, BrainMaps was named a top 10 franchise in China by Entrepreneur magazine in 2016.\nSafe Harbor Statement : The information posted in this release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. You can identify these statements by use of the words \"may,\" \"will,\" \"should,\" \"plans,\" \"explores,\" \"expects,\" \"anticipates,\" \"continue,\" \"estimate,\" \"project,\" \"intend,\" and similar expressions. The forward-looking statements in this release include statements regarding the Company’s proposed acquisition of BrainMaps, plans to raise capital to finance the transaction and support BrainMaps’ expansion in China, and plans to grow BrainMaps’ business in China. Forward-looking statements involve risks and uncertainties that could cause actual results to differ materially from those projected or anticipated. Factors which could cause results or events to differ from current expectations include, among other things: the inability to complete a financing transaction sufficient to complete the acquisition of BrainMaps and support BrainMaps’ growth in China at terms that are reasonable to the Company or at all; the inability to secure approval of the acquisition from SCIL’s board of directors or its shareholders; general economic and business conditions; effects of potential geopolitical unrest and regional conflicts; competition; and various other factors beyond the Company's control. Although the Company believes that the expectations reflected in such forward-looking statements are reasonable, it can provide no assurance that such expectations will prove to have been correct. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date made. Except as required by law, the Company assumes no obligation to update or revise any forward-looking statements.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180118006330/en/\nScientific Learning Corp.\nHallie Smith, 619-888-0887\nhsmith@scilearn.com\nSource: Scientific Learning Corp.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Ftytonpartners.com%2F&esheet=51745619&newsitemid=20180118006330&lan=en-US&anchor=Tyton+Partners&index=3&md5=eab1dd0b7e5195c7f793d077af651faf", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.otcmarkets.com%2Fstock%2FSCIL%2Ffilings&esheet=51745619&newsitemid=20180118006330&lan=en-US&anchor=https%3A%2F%2Fwww.otcmarkets.com%2Fstock%2FSCIL%2Ffilings&index=4&md5=0c07ce91450c2de86e4eb189ae355c28", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.gymboreeclasses.com%2Fen%2F&esheet=51745619&newsitemid=20180118006330&lan=en-US&anchor=Gymboree&index=6&md5=fb8fd09080802459fa864fac840eeef7", "https://www.otcmarkets.com/stock/SCIL/filings", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.wallstreetenglish.com%2F&esheet=51745619&newsitemid=20180118006330&lan=en-US&anchor=Wall+Street+English&index=5&md5=d37cc389418c59ce2a4f67af289dd61d", "http://www.businesswire.com/news/home/20180118006330/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.scilearn.com&esheet=51745619&newsitemid=20180118006330&lan=en-US&anchor=Scientific+Learning+Corp.&index=1&md5=4e3bccfa4f9cd5e78e51c3bcfed71727", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.brainmaps.com.cn%2F&esheet=51745619&newsitemid=20180118006330&lan=en-US&anchor=BrainMaps&index=2&md5=836a1127c19e78dee1ec039d1dad1190"], "published": "2018-01-19T00:05:00.000+02:00", "crawled": "2018-01-19T00:19:16.003+02:00", "highlightTitle": ""}