{"organizations": [], "uuid": "cca58959fc470e30cbd65effe3b89c90d0e24c40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226650813&w=1200&r=LYNXMPEE0T16C", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-britain-boe-carney/bank-of-england-turning-sights-to-tackling-inflation-carney-idUKKBN1FJ2A8", "country": "US", "domain_rank": 408, "title": "Bank of England turning sights to tackling inflation - Carney", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T18:24:00.000+02:00", "replies_count": 0, "uuid": "cca58959fc470e30cbd65effe3b89c90d0e24c40"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-boe-carney/bank-of-england-turning-sights-to-tackling-inflation-carney-idUKKBN1FJ2A8", "ord_in_thread": 0, "title": "Bank of England turning sights to tackling inflation - Carney", "locations": [], "entities": {"persons": [{"name": "carney", "sentiment": "negative"}, {"name": "mark carney", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "bank of england", "sentiment": "negative"}, {"name": "carney reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 4:21 PM / Updated 27 minutes ago Bank of England turning sights to tackling inflation - Carney Reuters Staff 2 Min Read \nLONDON (Reuters) - Bank of England Governor Mark Carney said on Tuesday that the central bank was refocusing on bringing down inflation as Britain’s economy recovered from the damage inflicted by the 2007-09 financial crisis. \n“The important thing with policy now ... is that as ... slack in the economy has been taken out, we move into a more conventional area for monetary policy, where the focus is increasingly on returning inflation sustainably to target over an appropriate horizon,” Carney told members of the upper house of parliament. \nThe BoE raised interest rates for the first time since 2007 in November and said it was likely to raise them again over the next three years as it sought to bring inflation down towards its 2 percent target. \nInflation in November hit a nearly six-year high of 3.1 percent, pushed up by the hit to the value of sterling caused by the 2016 Brexit vote. It fell back to 3.0 percent in December. \nData published last week showed Britain’s economy performed better than the BoE expected at the end of last year although it still lagged behind stronger growth in many other rich countries due in large part to the impact of the 2016 Brexit vote. FILE PHOTO: A statue is silhouetted against the Bank of England in the City of London, Britain, December 12, 2017. REUTERS/Clodagh Kilcoyne/File Photo \nEconomists mostly expect the next BoE rate hike in the second half of 2018 but some think it could move as soon as May. \nThe BoE is due to make its latest assessment of Britain’s economy on Feb. 8. \nIn Tuesday’s question-and-answer session in the House of Lords, Carney defended the forecasts made by the BoE before the Brexit referendum about what was likely to happen to the economy in the event of a vote to leave. Related Coverage Highlights - Bank of England's Carney speaks in House of Lords \n“We got the broad economic channels right,” Carney said \nSome Brexit supporters have criticised Carney for the BoE’s prediction that a vote to leave the EU could cause a “material slowing” in Britain’s economy. Carney said at the time that it might even cause a short recession. Reporting by David Milliken and Alistair Smout; Writing by William Schomberg", "external_links": [], "published": "2018-01-30T18:24:00.000+02:00", "crawled": "2018-01-30T18:35:33.001+02:00", "highlightTitle": ""}