{"organizations": [], "uuid": "6c9b1dad2f80125677dc64263527a389da7cb8c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222325949&w=1200&r=LYNXMPEE0F0A4", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-usa-trump-business/foreign-governments-candidates-trade-groups-spent-at-trump-properties-report-idUKKBN1F50DO", "country": "US", "domain_rank": 408, "title": "Foreign governments, candidates, trade groups spent at Trump properties - report", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T07:11:00.000+02:00", "replies_count": 0, "uuid": "6c9b1dad2f80125677dc64263527a389da7cb8c4"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-trump-business/foreign-governments-candidates-trade-groups-spent-at-trump-properties-report-idUKKBN1F50DO", "ord_in_thread": 0, "title": "Foreign governments, candidates, trade groups spent at Trump properties - report", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "donald jr.", "sentiment": "none"}, {"name": "eric", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "trump international hotel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 5:12 AM / Updated 2 hours ago Foreign governments, candidates, trade groups spent at Trump properties - report Reuters Staff 3 Min Read \nWASHINGTON (Reuters) - Sixty-four trade groups, foreign governments, Republican candidates and others stayed at or held events at properties linked to U.S. President Donald Trump during Trump’s first year in office, a political watchdog group said in a report released on Tuesday. FILE PHOTO: The entrance of Trump International Hotel is seen in downtown Washington, U.S., June 28, 2017. REUTERS/Carlos Barria/File Photo \nThe arrangements represented “unprecedented conflicts of interest” because Trump oversees the federal government and has not divested from properties he owns or that carry his name, Public Citizen, a nonpartisan group, said in the report. \nShortly before taking office last year, Trump said he would hand off control of his global business empire to his sons Donald Jr. and Eric, and move his assets into a trust to help ensure that he would not consciously take actions as president that would benefit him personally. \nMany government and private ethics watchdogs said the president should have gone farther, divesting assets that could cause a conflict of interest. \nThe White House declined comment on the Public Citizen report, which is based on filings to the U.S. Federal Election Commission and news stories. It referred the issue to the Trump Organization. A spokesperson there did not immediately respond to a request for comment. \nRepresentatives of four foreign governments - Kuwait, Malaysia, Saudi Arabia and Turkey - held events at the Trump International Hotel in Washington, the report said. That hotel, just blocks from the White House, was the most popular Trump property, accounting for more than half the 64 events. \nPublic Citizen has joined 17 Democratic lawmakers in suing the U.S. General Services Administration for documents regarding the Trump Organization’s 2013 lease of the property from the U.S. government. \nFEC records, which require disclosing campaign expenditures over $100, show that 24 groups backing candidates for Congress held events, most of them fundraisers, at Trump properties. All, like the U.S. president, were Republicans. \nAlso holding events at Trump properties were oil and mining interests, representatives of the vaping industry and a college football team, the report said. It did not cite a figure for the combined spending of the 64 groups at Trump properties. Reporting by Warren Strobel; Additional reporting by Steve Holland; Editing by Leslie Adler", "external_links": [], "published": "2018-01-16T07:11:00.000+02:00", "crawled": "2018-01-16T07:28:20.015+02:00", "highlightTitle": ""}