{"organizations": [], "uuid": "f7ef5cde8edc76e41ee72c6dba7015251882c749", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225336608&w=1200&r=LYNXMPEE0P03Y", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-trump-russia-mueller/trump-ordered-muellers-firing-then-backed-off-new-york-times-idUKKBN1FF07L", "country": "US", "domain_rank": 408, "title": "Trump ordered Mueller's firing, then backed off - New York Times", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T04:00:00.000+02:00", "replies_count": 0, "uuid": "f7ef5cde8edc76e41ee72c6dba7015251882c749"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-trump-russia-mueller/trump-ordered-muellers-firing-then-backed-off-new-york-times-idUKKBN1FF07L", "ord_in_thread": 0, "title": "Trump ordered Mueller's firing, then backed off - New York Times", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "mueller", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "robert mueller", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "new york times reuters", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "times", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 01 AM / Updated an hour ago Trump ordered Mueller's firing, then backed off - New York Times Reuters Staff 3 Min Read \nWASHINGTON (Reuters) - U.S. President Donald Trump last June ordered Special Counsel Robert Mueller fired but backed down after the White House counsel threatened to resign rather than follow his directive, The New York Times reported on Thursday, citing four people told of the matter. \nWhite House lawyers and press officials did not immediately reply to Reuters requests for comment. \nMueller, who is investigating allegations of Russian meddling in the 2016 U.S. election, learned of the incident in recent months as his investigators interviewed current and former senior White House officials in an inquiry into whether the president obstructed justice, the Times reported. \nAmid media reports that Mueller was looking into a possible obstruction case, Trump argued that the former Federal Bureau of Investigation director had three conflicts of interest that disqualified him from overseeing the probe, two of the people said, according to the Times report. \nFirst, Trump said that a dispute years ago over fees at Trump National Golf Club in Sterling, Virginia, had led Mueller to resign his membership, the newspaper reported. \nThe president also said Mueller could not be impartial because he had most recently worked for a law firm that previously represented the president’s son-in-law, Jared Kushner. Trump also said Mueller had been interviewed to return as the director of the Federal Bureau of Investigation the day before he was appointed special counsel in May, the Times reported, citing the two people. FILE PHOTO: Special Counsel Robert Mueller (R) departs after briefing members of the U.S. Senate on his investigation into potential collusion between Russia and the Trump campaign on Capitol Hill in Washington, U.S., June 21, 2017. REUTERS/Joshua Roberts/File Photo \nWhite House counsel Donald McGahn said he would quit rather than follow through on the order to fire Mueller, the Times reported, citing the people. \nMcGahn disagreed with the president’s case for dismissing Mueller and told senior White House officials that firing him would have a catastrophic effect on Trump’s presidency and raise questions about whether the White House was trying to obstruct the Russia probe, according to the people cited by the Times. \nMcGahn also told White House officials that Trump would not follow through on the dismissal on his own, and the president then backed off his demand, according to the people, who the Times said spoke on condition of anonymity because they did not want to be identified discussing a continuing investigation. \nMueller was appointed special counsel in May by the Justice Department after Trump fired FBI Director James Comey, who was leading the agency’s Russia investigation. Russia has denied any meddling and Trump has denied any collusion. Related Coverage", "external_links": [], "published": "2018-01-26T04:00:00.000+02:00", "crawled": "2018-01-26T04:19:57.007+02:00", "highlightTitle": ""}