{"organizations": [], "uuid": "b408dd80150bc9abba55a762e342b1988c9b6c4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 29}, "facebook": {"likes": 137, "shares": 137, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220436522&w=1200&r=LYNXMPEE08052", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-alibaba-hongkong-listing/alibaba-founder-says-to-consider-hong-kong-listing-scmp-idUSKBN1EY062", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Alibaba will \"seriously consider\" Hong Kong listing, says founder Ma", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T09:48:00.000+02:00", "replies_count": 0, "uuid": "b408dd80150bc9abba55a762e342b1988c9b6c4f"}, "author": "", "url": "https://www.reuters.com/article/us-alibaba-hongkong-listing/alibaba-founder-says-to-consider-hong-kong-listing-scmp-idUSKBN1EY062", "ord_in_thread": 0, "title": "UPDATE 2-Alibaba will \"seriously consider\" Hong Kong listing, says founder Ma", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 1:56 AM / Updated 10 hours ago Alibaba will 'seriously consider' Hong Kong listing, says founder Ma Brenda Goh , Jennifer Hughes 5 Min Read \nSHANGHAI/HONG KONG (Reuters) - Alibaba Group Holding Ltd ( BABA.N ) will “seriously consider” listing in Hong Kong, founder Jack Ma said, potentially providing a powerful boost to the financial hub which is preparing to allow dual-class share listings. \nMa made the comments at an event in the city on Monday in response to remarks by Hong Kong Chief Executive Carrie Lam about how she hoped Alibaba would consider returning to Hong Kong to list, an Alibaba spokeswoman said. \n“Daring to speak like this marks a strong commitment so we will definitely seriously consider the Hong Kong market,” Ma said in response to Lam’s speech, according to a transcript provided by Alibaba. \nWhen asked by reporters about his comments after he met President Emmanuel Macron in Beijing on Tuesday, Ma said Alibaba was considering listing subsidiaries in Hong Kong, without elaborating. Macron is on the second leg of a three-day state visit in China. \nThe Alibaba spokeswoman said there were no further details available on what any Hong Kong listing plan could involve. \nAlibaba held its record $25 billion public float in New York in 2014 after Hong Kong, its favored venue, refused to accept its governance structure where a self-selecting group of senior managers control the majority of board appointments. \nHong Kong is now set to allow dual-class shares under rule changes to be proposed by the city’s stock exchange as it raises the stakes in its battle against New York for blockbuster Chinese initial public offerings. \nSuch shares grant differentiated voting rights and underpin the alternative governance and shareholding structures favored by many owners of new age industries such as technology. \nOver $3 billion worth of Alibaba shares were traded on Monday, based on Reuters calculations using NASDAQ data. The stock closed at $190.33, with 16.23 million shares traded. \nThat compares with the Hong Kong Exchanges and Clearing Ltd’s (HKEX) ( 0388.HK ) average daily securities turnover of HK$88.2 billion ($11.28 billion) in 2017. FILE PHOTO: A sign of Alibaba Group is seen during the fourth World Internet Conference in Wuzhen, Zhejiang province, China, December 3, 2017. REUTERS/Aly Song/File Photo \n“NEW ECONOMY” PLATFORM \nShares in HKEX, the city’s exchange operator, rose as much as 3.1 percent to HK$270 on Tuesday, their highest level since July 2015. \nAnalysts said that an Alibaba listing in Hong Kong could help drive more funds from the mainland towards the city and could convince other big firms, in particular technology-related ones, to list in the financial hub. \n“If the trading volume in Hong Kong is even better than that in the U.S., it will send out a signal to other new economy new listings that Hong Kong is a much better place for a listing than the U.S,” said Steven Leung, sales director at UOB Kay Hian in Hong Kong. \nFor Alibaba, it could provide greater access to investors closer to China who are familiar with its business and allow it to benefit from the Hong Kong government’s growing support for financial services innovation, said James Lloyd, Asia-Pacific FinTech leader at consulting firm EY. \nThe HKEX said in December that it had begun drafting specific rule changes for allowing dual-class shares that will be put up for a formal public consultation in the first three months of 2018. \nUnder the planned rule changes, “innovative” Chinese companies with a market capitalization over HK$10 billion and a primary listing on the New York Stock Exchange, Nasdaq or the London Stock Exchange would be able to seek a secondary listing in Hong Kong. The HKEX has not yet defined what “innovative” is. \n“We are also creating a new route to secondary listings in Hong Kong to attract companies from emerging and innovative sectors. We are aware that many successful new economy companies already listed in the US and UK would benefit from these reforms,” wrote Charles Li, chief executive of HKEX, in a blog post last month when the proposed changes were put forward. \nJust 3 per cent of Hong Kong listings in the past decade, by market value, have been so-called “new economy” companies, compared with 47 per cent for the New York Stock Exchange, according to a discussion paper published by the HKEX in June. \nSome analysts said technical issues and underlying concerns about the dual-class structure still needed to be resolved and fine tuned. \n“The main concern is about the protection to minority investors under the dual structure,” said Linus Yip, chief strategist at First Shanghai Securities. Reporting by Brenda Goh in SHANGHAI and Jennifer Hughes in HONG KONG; Additional Reporting by Donny Kwok in HONG KONG, Anshuman Daga in SINGAPORE and Michel Rose in BEIJING; Editing by Muralikumar Anantharaman and Keith Weir", "external_links": [], "published": "2018-01-09T09:48:00.000+02:00", "crawled": "2018-01-09T10:04:48.030+02:00", "highlightTitle": ""}