{"organizations": [], "uuid": "7d9076784a4c34181e0623b909f81c59e8ac3d6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-blockchain-emerging-as-a-new-frontier-for-the-gaming-industry.html", "country": "US", "domain_rank": 767, "title": "Blockchain Emerging as a New Frontier for the Gaming Industry", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:30:00.000+02:00", "replies_count": 0, "uuid": "7d9076784a4c34181e0623b909f81c59e8ac3d6d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-blockchain-emerging-as-a-new-frontier-for-the-gaming-industry.html", "ord_in_thread": 0, "title": "Blockchain Emerging as a New Frontier for the Gaming Industry", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "tapinator, inc.", "sentiment": "none"}, {"name": "bitcoin investment trust", "sentiment": "none"}, {"name": "revolution blockchain llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, January 9, 2018 /PRNewswire/ --\nThe overall value of the global cryptocurrency market reached an all-time high of more than $700 billion on January 3, 2018 ( http://nnw.fm/0rxFZ ), a clear indicator of the increased interest in the adoption of digital currencies and their underlying blockchain technology. Blockchain is already being successfully implemented across various market sectors and is expected to revolutionize a significant number of industries over the next decade, including the financial, healthcare, real estate, legal and gaming industries. Mobile gaming in particular is a promising segment for blockchain adoption, with the fastest growing rate in the whole gaming industry and over $40 billion in revenues in 2017. Tapinator, Inc. (OTC: TAPM) (TAPM Profile) has positioned itself to exploit these market trends and establish an early lead within the blockchain gaming industry through the recent creation of its subsidiary, Revolution Blockchain LLC. Other companies poised to capitalize on opportunities in the blockchain sector include Bitcoin Investment Trust (OTC: GBTC) , Riot Blockchain , Inc. (NASDAQ: RIOT), Bitcoin Services, Inc. (OTC: BTSC) and Marathon Patent Group, Inc. (NASDAQ: MARA).\nTapinator, Inc. (OTCQB: TAPM) develops and publishes mobile games on Google Play, iOS and Amazon platforms. To date, it has developed over 300 games, which have been downloaded over 450 million times by global gamers, and the company has stated its intentions to further increase its market share by concluding strategic mergers and acquisitions.\nTapinator kicked off 2018 with news it will form a new subsidiary, Revolution Blockchain LLC, to develop and publish distributed apps and games leveraging blockchain technology ( http://nnw.fm/Us6W7 ). Currently under development, Revolution Blockchain's first product will leverage blockchain technology for payment and asset storage via fungible tokens residing on the blockchain. This product is scheduled to be launched during the second quarter of 2018. The Company has announced a seed investment in the new subsidiary by an individual accredited investor, resulting in the issuance of membership interests that are convertible into Tapinator's common stock at $0.25 per share.\n\"We believe that we're at the dawn of a new revolution where the applicability of blockchain technology will expand from currency trading to industry-changing applications and games,\" Tapinator CEO Ilya Nikolayev stated in the press release about the new subsidiary.\n\"The formation of our Revolution Blockchain subsidiary allows us to plant a hard stake in the ground and make a long-term commitment to the distributed app market. Our management team has been in the application development and publishing space for over ten years now and successfully made the transition from social/desktop to mobile ecosystems. Similarly, we now believe Tapinator is extremely well positioned and qualified to create early leadership within the decentralized apps market.\"\nDecentralized apps (DApps) run on a P2P computer network instead of operating through a single, centralized computer or server. DApps eliminate the issues with having a single point of failure and are therefore more stable than apps running on centralized systems. They are also more flexible in terms of diversity and have much more scalability potential. For decentralized applications to be integrated in the blockchain, they must be completely open-source, they need to enable data and records to be cryptographically stored, and also to enable the use and generation of cryptographic tokens. Ethereum is currently the leading platform for DApps, allowing developers to choose rules for transaction formats and asset ownership. In the gaming industry at the moment, dedicated players who build up large in-game assets have no ownership over them and may also have issues ensuring asset security. These issues will be solved by blockchain-based gaming apps.\nTapinator has developed and published a number of established products, including a selection of best-in-class \"Full-Featured Games.\" These include ROCKY™ and Solitaire Dash, which offer unique and in-depth content that enables long-term player retention. Recently, Tapinator launched three other Full-Featured titles: Big Sport Fishing 2017, Dice Mage 2, and ColorFill. Other new titles scheduled for release in early 2018 include Fusion Heroes and Divide and Conquer. The Company predicts the lifespan of its Full-Featured Games to be over five years, and is attempting to build franchisee-type games that could achieve lifetime revenues of over $100 million.\nTapinator's revenue model is a blend of app store purchases combined with in-game advertising. 54 percent of its revenue is derived from advertising and 46 percent is derived from app store transactions. The company restricts advertising to placements between game levels and runs rewarded video ad units that are tied directly into each game's currency. Tapinator's broader business model also focuses on capitalizing on the significant opportunities for expanding its gaming IP to new platforms such as Ethereum.\nAs Tapinator continues to grow its product portfolio and modify its offerings to meet the demands of the modern gamer, the company joins several other sector players taking advantage of blockchain technology for a variety of applications.\nBitcoin Investment Trust (OTCQX: GBTC) is a U.S.-based open-ended grantor trust, sponsored by Grayscale Investments, that invests exclusively in bitcoin - the underlying use of which is blockchain. Bitcoin Investment Trust is the first publicly Quote: d bitcoin investment enterprise, with its shares the first publicly Quote: d securities to be solely invested in and deriving value from the price of bitcoin. The company relieves investors of the challenges of buying, storing and securing bitcoin, which are taken care of through its traditional investment vehicle. This ensures shares are titled in the investors' name and provides a structure for financial and tax advisers, while enabling easy transfer to beneficiaries under estate laws. Bitcoin Investment Trust has earned the distinction of being named one of OTC Market Group's \"OTCQX Best 50\" for 2017.\nRiot Blockchain (NASDAQ: RIOT) identifies unique projects in decentralized markets to invest in blockchain technology, focusing primarily on bitcoin and Ethereum blockchains. Its portfolio of investments includes Verady, a company providing cryptocurrency accounting and audit technology services using VeraNet. VeraNet enables individuals and companies to audit, account and report on blockchain assets, and provides a bridge between cryptocurrencies and traditional financial accounting. Tesspay is another Riot Blockchain company that is developing a blockchain-based escrow service for wholesale telecom carriers. A third company within the Riot Blockchain stable is Coinsquare, a leading Canadian digital currency exchange providing a user-friendly, secure and cost-efficient method of purchasing digital assets.\nBitcoin Services (OTC: BTSC) focuses primarily on mining bitcoin, but also develops and sells blockchain software. The company recently established a new subsidiary, CryptoCapital Corp., a cryptocurrency holding enterprise that acts as a catalyst for cryptocurrency adoption and innovation. This subsidiary developed a cryptocurrency wallet that enables consumers to sec", "external_links": ["http://nnw.fm/0rxFZ", "https://www.networknewswire.com/clients/tapinator-inc/?symbol=tapm", "http://nnw.fm/Us6W7", "http://NNW.fm/Disclaimer", "http://www.networknewsbreaks.com/"], "published": "2018-01-09T16:30:00.000+02:00", "crawled": "2018-01-09T18:49:24.047+02:00", "highlightTitle": ""}