{"organizations": [], "uuid": "2ae908680951b8023d85c2553bfac6b2cca9c88e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/20/reuters-america-update-3-trumps-dealmaker-image-tarnished-by-u-s-government-shutdown.html", "country": "US", "domain_rank": 767, "title": "UPDATE 3-Trump's dealmaker image tarnished by U.S. government shutdown", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T23:18:00.000+02:00", "replies_count": 0, "uuid": "2ae908680951b8023d85c2553bfac6b2cca9c88e"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/20/reuters-america-update-3-trumps-dealmaker-image-tarnished-by-u-s-government-shutdown.html", "ord_in_thread": 0, "title": "UPDATE 3-Trump's dealmaker image tarnished by U.S. government shutdown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(ADDS new details about Trump-Schumer meeting)\nWASHINGTON, Jan 20 (Reuters) - For President Donald Trump, this weekend was supposed to be a celebration.\nOn the first anniversary of his presidency on Saturday, with the stock market roaring and his poll ratings finally rising, he had planned to rest at his Mar-a-Lago estate in Florida, feted by friends and admirers.\nInstead, Trump stayed in Washington after he was unable to avert a government shutdown.\nHis failure to win passage by the U.S. Congress of a stopgap bill to maintain funding for the federal government further damaged his self-crafted image as a dealmaker who would repair the broken culture in Washington.\n\"This is the One Year Anniversary of my Presidency and the Democrats wanted to give me a nice present,\" Trump said in an early morning tweet, adding the hashtag #DemocratShutdown.\nEven as the White House began pointing the finger at Democrats, the Republican president came under fire.\n\"It's almost like you were rooting for a shutdown,\" Senate Democratic leader Chuck Schumer said of Trump on Saturday.\nTrump, who in July 2016 said: \"Nobody knows the system better than me, which is why I alone can fix it,\" has asserted that past government shutdowns were the fault of the person in the White House.\nIn a \"Fox & Friends\" interview after a 2013 shutdown, he said then-  was ultimately responsible.\n\"The problems start from the top and have to get solved from the top,\" Trump said. \"The president is the leader, and hes got to get everybody in a room and hes got to lead.\"\nAs this new shutdown, the first since 2013, looked increasingly likely on Friday, Trump made a last-ditch effort to behave as the kind of problem-solver he has long claimed to be.\nFirst, he postponed a long-planned weekend trip to his winter home Mar-a-Lago, where a lavish $100,000-a-couple fundraiser on Saturday would extol his first year in office.\nHe had little choice. Critics would have hammered him for attending such an event while government workers were being put on leave and many government services curtailed.\nThen Trump called Schumer, and, after a positive conversation, invited him to a meeting at the White House. It was intimate - just the president, Schumer and top aides. Republican leaders were excluded. The idea was to find some common ground. It lasted 90 minutes.\nNO DEAL\nOne person familiar with the events said the two men agreed to seek a grand deal in which Democrats would win protections from deportation for some 700,000 young undocumented immigrants known as \"Dreamers\" and Trump would get more money for a border wall and tighter security to stem illegal immigration from Mexico.\nBy early evening, however, that plan was dead. The source said Trump had spoken in the meantime with conservative Republicans and been hit with their objections to the deal with Schumer.\nAnother source familiar with the meeting said White House Chief of Staff John Kelly called Schumer later on Friday, after the meeting, and complained that the outline that Schumer and Trump had discussed was too liberal.\n\"He did not press his party to accept it,\" Schumer said later.\nOn Saturday, with no resolution to the shutdown seemingly in sight, the White House fired back at Schumer, with Mick Mulvaney, Trump's budget director, suggesting that the Democrat had misrepresented the details of the meeting and could no longer be trusted as a negotiator.\n\"You have to ask yourself at what point does it even become profitable to continue to work with somebody like that,\" Mulvaney told reporters.\nThe confusion on Friday seemed part of a familiar pattern that has driven Democrats to distraction. Trump courts their support and suggests flexibility, only to pivot and side with more conservative lawmakers.\nIt happened in September, after he cut a short-term government funding deal with Schumer and House Democratic leader Nancy Pelosi.\nWeeks later, when Schumer and Pelosi thought they had reached an agreement to preserve a program that protected Dreamers, congressional sources said Trump walked away.\nThat stand-off lasted until earlier this month, when Republican Senator Lindsey Graham and Democratic Senator Dick Durbin reached a bipartisan proposal on immigration.\nThey believed Trump had signaled he would support it. But in a heated Oval Office meeting, Trump savaged the deal.\nA Democratic senator alleged that Trump said the United States needed to take fewer immigrants from Haiti and African nations, referring to them as \"shit hole countries.\" Trump denied using that language but the controversy poisoned negotiations.\nBoth sides felt betrayed, and Trumps flip-flops left Republican Senate leader Mitch McConnell mystified to the point where he said earlier this week that he could not figure out Trumps position on the issue.\nTrust was further undermined when Trump appeared to criticize a House stopgap funding bill that the White House hours earlier said he supported.\nMembers of each party blamed the other for the shutdown, but some of the blame landed on the president.\n\"Donald Trump is not capable of carrying out this kind of an intricate conversation about issues,\" John Yarmuth, the senior Democrat on the House Budget Committee, told reporters.\n\"He doesn't have the attention span to do it. He doesn't have the interest to do it. All he wants to do is show he's engaged in the process.\" (Reporting by James Oliphant, Susan Cornwell, Richard Cowan, David Brunnstrom and Rich McKay; Editing by Janet Lawrence and Alistair Bell)", "external_links": [], "published": "2018-01-20T23:18:00.000+02:00", "crawled": "2018-01-21T00:10:18.002+02:00", "highlightTitle": ""}