{"organizations": [], "uuid": "aa845a50bcb5078a4e4f401baa8e6e5d7718084e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225889006&w=1200&r=LYNXMPEE0Q0U1", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-tot-kane/kanes-newport-rescue-act-critical-for-spurs-season-idUKKBN1FG0YO", "country": "US", "domain_rank": 408, "title": "Kane's Newport rescue act critical for Spurs' season", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T01:58:00.000+02:00", "replies_count": 0, "uuid": "aa845a50bcb5078a4e4f401baa8e6e5d7718084e"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-tot-kane/kanes-newport-rescue-act-critical-for-spurs-season-idUKKBN1FG0YO", "ord_in_thread": 0, "title": "Kane's Newport rescue act critical for Spurs' season", "locations": [], "entities": {"persons": [{"name": "kane", "sentiment": "negative"}, {"name": "mauricio pochettino", "sentiment": "none"}, {"name": "son heung-min", "sentiment": "none"}, {"name": "pochettino", "sentiment": "none"}, {"name": "harry kane", "sentiment": "none"}], "locations": [{"name": "newport", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "newport county", "sentiment": "none"}], "organizations": [{"name": "spurs", "sentiment": "negative"}, {"name": "tottenham hotspur", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 12:01 AM / Updated 9 minutes ago Kane's Newport rescue act critical for Spurs' season Reuters Staff 3 Min Read \nLONDON (Reuters) - Harry Kane has scored far better goals among the 30 he has netted this season - but none of them had the critical feel of the tap-in at little Newport County on Saturday that may yet transform Tottenham Hotspur’s season. \nFor not only did Kane’s 82nd-minute gimme spare Spurs from potential FA Cup humiliation in their fourth-round tie at the League Two club, the resulting 1-1 draw also salvaged their best chance of winning silverware in a crucial campaign. \nMauricio Pochettino’s stylish side continue to be much admired but the lack of Spurs silverware - their last trophy was the 2008 League Cup - as they prepare to move into their gleaming new London home next season is increasingly glaring. \nBeing on the wrong end of a Cup sensation may only have cranked up the pressure on the Argentine, which is why he was once again indebted to his alpha striker for converting Son Heung-min’s brilliant flick with embarrassment looming. \nPochettino’s strong-looking selection had suffered such a dismal, lethargic off-day against a side 72 places below them on the league ladder that the manager was forced to admit he was “a little bit relieved...well, a lot” by Kane’s late saver. Soccer Football - FA Cup Fourth Round - Newport County vs Tottenham Hotspur - Rodney Parade, Newport, Britain - January 27, 2018 Newport County manager Mike Flynn and Tottenham manager Mauricio Pochettino after the match Action Images via Reuters/Matthew Childs \nHe sounded most alarmed about why his side had performed so poorly, even if the Rodney Parade experience - battling to avoid defeat in a tight stadium on a pitch shared by two rugby teams - really did look like a culture shock to some. \n“The team didn’t really show they want to go next stage of the FA Cup. That is what has disappointed us,” Pochettino said after Padraig Amond’s first-half header had given Newport the scent of a genuine sensation against the eight-times Cup winners. Soccer Football - FA Cup Fourth Round - Newport County vs Tottenham Hotspur - Rodney Parade, Newport, Britain - January 27, 2018 Tottenham's Harry Kane in action REUTERS/Rebecca Naden \n”The theory is to win trophies, and it’s easy to talk about that. But I think we missed a massive opportunity to show we really want to win a trophy. \n“I’ve heard in my years here that the FA Cup between a Premier League team and a League Two team is magic. But if I‘m honest, I didn’t see much difference.” \nFor Pochettino recognised this had really been Newport’s day. Their reward for such a striking effort? The chance for the 10,000 who crammed into Rodney Parade to now move on to the grandeur of Wembley’s 90,000-seater arena for the replay. \n“Wembley is something else for the club to look forward to. We were nearly there, we could taste it but we switched off for a minute,” said Newport’s proud but frustrated manager, Mike Flynn. “I‘m gutted because we conceded so late.” Reporting by Ian Chadband, editing by Ed Osmond", "external_links": [], "published": "2018-01-28T01:58:00.000+02:00", "crawled": "2018-01-28T02:19:09.016+02:00", "highlightTitle": ""}