{"organizations": [], "uuid": "f42460404d7487c6bc7052e89a67071e52dea793", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/09/reuters-america-update-6-huaweis-att-u-s-smartphone-deal-collapses.html", "country": "US", "domain_rank": 767, "title": "UPDATE 6-Huawei's AT&T U.S. smartphone deal collapses", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T23:33:00.000+02:00", "replies_count": 0, "uuid": "f42460404d7487c6bc7052e89a67071e52dea793"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/09/reuters-america-update-6-huaweis-att-u-s-smartphone-deal-collapses.html", "ord_in_thread": 0, "title": "UPDATE 6-Huawei's AT&T U.S. smartphone deal collapses", "locations": [], "entities": {"persons": [{"name": "ajit pai", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "huawei", "sentiment": "negative"}, {"name": "at&t", "sentiment": "negative"}, {"name": "at&t inc", "sentiment": "none"}, {"name": "u.s. federal communications commission", "sentiment": "none"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "fcc", "sentiment": "none"}, {"name": "huawei technologies co ltd", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Huawei was close to announcing AT&T partnership -sources\n* Huawei says Mate 10 Pro won't be sold by U.S. carrier\n* AT&T abandoned deal due to political pressure -media\n* Huawei has 0.5 pct of U.S. smartphone market -Canalys (Recasts lead paragraph, adds details on letter)\nHONG KONG, Jan 9 (Reuters) - Huawei Technologies Co Ltd's planned deal with U.S. carrier AT&T Inc to sell its smartphones in the United States has collapsed at the 11th hour because of security concerns, people with knowledge of the matter said, in a blow to the Chinese firm's global ambitions.\nAT&T was pressured to drop the deal after members of the U.S. Senate and House intelligence committees sent a letter on Dec. 20 to the U.S. Federal Communications Commission (FCC) citing concerns about Huawei's plans to launch consumer products through a major U.S. telecom carrier.\nThe letter to FCC Chairman Ajit Pai, which was signed by 18 lawmakers, noted concerns about Chinese companies in the U.S. telecommunications industry.\nThe letter notes the committee's concerns \"about Chinese espionage in general, and Huawei's role in that espionage in particular.\" A copy of the letter was seen by Reuters.\nHuawei said in a statement on Tuesday that its flagship smartphone Mate 10 Pro - Huawei's challenger to the iPhone - will be sold in the United States only through open channels.\n\"The U.S. market presents unique challenges for Huawei, and while the HUAWEI Mate 10 Pro will not be sold by U.S. carriers, we remain committed to this market now and in the future,\" it said.\nHuawei's Washington-based spokesman William Plummer said on Tuesday that \"privacy and security are always our first priority.\"\n\"We are compliant with the world's most stringent privacy protection frameworks and requirements and have gained the trust of over 150 million customers in the past year alone,\" Plummer said in an email.\nREJECTION OF DEALS\nHuawei is the world's third largest smartphone vendor by volume after Samsung Electronics and Apple Inc , but it has a mere 0.5 percent share of the U.S. smartphone market, compared with 39 percent for Apple and 18 percent for Samsung, according to industry tracker Canalys.\nWashington began to have concerns about Chinese investment in the United States before President Donald Trump took office last year, and those concerns have heightened.\nBecause of this skepticism, including the U.S. government's rejection of several Chinese deals, Chinese investment in the United States fell to $25 billion last year from $50 billion in 2016, according to Derek Scissors, a China expert at the American Enterprise Institute.\nAmong the deals killed recently by the multi-agency Committee on Foreign Investment in the United States (CFIUS) were Ant Financial's plan to buy U.S. money transfer company MoneyGram International Inc, the purchase by China-backed Canyon Bridge Capital Partners LLC of a U.S. chip maker and plans by Zhongwang USA, backed by a Chinese aluminum tycoon, to buy a U.S. aluminum maker.\nIn 2012, Huawei and ZTE Corp were the subject of a U.S. investigation into whether their equipment provided an opportunity for foreign espionage and threatened critical U.S. infrastructure - a link that Huawei has consistently denied.\nIn the United States, where telecom carriers dominate the distribution channel by typically providing subsidies and special package deals, Huawei had been unable to make any significant inroads due to national security concerns.\nAT&T declined to comment.\nThe flagship Mate 10 Pro that was to be introduced is Huawei's most high-end product to date, equipped with its own AI-powered chips that Huawei says process data much faster than those used by Apple and Samsung. It was launched in Europe in October with a price tag of 799 euros ($955).\n\"This makes it very difficult for Huawei to get significant in the U.S. as the open channels account for only about 10-11 percent of the market,\" said Canalys analyst Mo Jia, referring to sales channels outside telecom carriers and vendors' own stores.\nHe said Huawei's proprietary mobile chips may have presented a bigger regulatory hurdle for its U.S. market entry in the current political climate, compared with other Chinese vendors' entry strategy that relies on U.S. chip suppliers. ($1 = 0.8363 euro) (Reporting by Sijia Jiang in Hong Kong; Additional reporting by Stephen Nellis in San Francisco, Anjali Athavaley in New York, David Shepardson and Diane Bartz in Washington, and Sonam Rai in Bengaluru; Editing by Chris Sanders, Andrew Hay and Paul Simao)", "external_links": [], "published": "2018-01-09T23:33:00.000+02:00", "crawled": "2018-01-10T00:44:43.020+02:00", "highlightTitle": ""}