{"organizations": [], "uuid": "c1ae8d487cacc013b4070fe17576f4a6a20d8fd2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/10", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-vaalco-energy-provides-operational-and-financial-update-and-preliminary-2018-production-guidance.html", "country": "US", "domain_rank": 767, "title": "VAALCO Energy Provides Operational and Financial Update and Preliminary 2018 Production Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:45:00.000+02:00", "replies_count": 0, "uuid": "c1ae8d487cacc013b4070fe17576f4a6a20d8fd2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-vaalco-energy-provides-operational-and-financial-update-and-preliminary-2018-production-guidance.html", "ord_in_thread": 0, "title": "VAALCO Energy Provides Operational and Financial Update and Preliminary 2018 Production Guidance", "locations": [], "entities": {"persons": [], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "vaalco", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "vaalco energy, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 31, 2018 (GLOBE NEWSWIRE) -- VAALCO Energy, Inc. (NYSE:EGY) today provided an operational update including fourth quarter and full year 2017 production and preliminary 2018 production guidance, as well as key financial information. An investor presentation has been posted to the Company’s web site, www.vaalco.com , which has additional details on the matters discussed in this release.\nHighlights and Recent Key Items:\nProduced an average of approximately 4,160 net barrels of oil per day (BOPD) for calendar 2017, at the high end of the previously-provided annual guidance range;\nProduced an average of 3,968 net BOPD in the fourth quarter of 2017, slightly below the guidance range, despite two ESP failures in the quarter;\nRealized pricing of $59.89 per barrel of oil in the fourth quarter of 2017 compared with $51.10 per barrel in the third quarter of 2017 and $41.88 per barrel in the fourth quarter of 2016 (excluding the impact of hedging);\nEstimates preliminary full year 2018 production guidance of 3,500 to 4,100 BOPD;\nProduced an average of approximately 3,680 BOPD to-date in 2018;\nAnticipates realized pricing of approximately $67.00 to $70.00 for January sales; the Company noted that it has no hedges in place for 2018 with realized pricing correlated to Brent;\nEstimates that its operational breakeven price in 2018 is approximately $28 per barrel of oil sales and its free cash flow breakeven price in 2018 is approximately $38 per barrel of oil sales. (See investor presentation on web site for full details and definitions);\nAt December 31, 2017, VAALCO had an unrestricted cash balance of $19.7 million; the Company reduced debt by $10 million in 2017, resulting in total debt (principal amount) at year-end 2017 of $9.2 million;\nIncreased proved reserves to 3.0 million barrels of oil (determined under SEC guidelines) with a PV-10 of $22.5 million at year-end 2017, up 15% and 139%, respectively, from December 31, 2016; and\nReplaced 127% of 2017 production of 1.5 MMBO with proved reserve additions of 1.9 MMBO due to reservoir performance and positive pricing revisions.\nCary Bounds, Chief Executive Officer commented, “We are very optimistic as we enter 2018, due to the significant benefit we are realizing from the strong improvement in oil prices, particularly Brent, combined with our ongoing commitment to operational excellence. Our positive year-end 2017 reserve report, achieving annual production within guidance during 2017, and 2018 forecasted production with minimal decline from 2017 validate our continued efforts focused on operating efficiently, minimizing downtime and curtailing production decline. We are forecasting a meaningful increase in sales for 2018, and, coupled with current Brent pricing around $70 per barrel and no hedges currently in place for 2018, VAALCO is well positioned to generate substantial free cash flow and capture significant value in 2018. We were able to pay off a significant amount of our debt in 2017, and with our projected increase in revenue for 2018, we plan to pay down nearly all of our existing debt this year and will be in a better position to consider development drilling on our offshore Gabon asset. Clearly, the outlook for VAALCO is greatly improved.”\nProduction and Sales Update\nIn the fourth quarter of 2017, VAALCO produced 3,968 net BOPD. In late December, the normal monthly sales lifting from the floating production facility that stores oil produced in the Etame Marin permit area was not able to be completed by December 31 due to adverse sea and weather conditions. As a result, the December lifting took place during the period December 31, 2017 to January 1, 2018 with 53,300 net barrels of oil sold in December and the balance of 95,500 net barrels of oil sold in January 2018. The Company will benefit financially from the split-lifting. VAALCO’s December 2017 pricing was $63.67 per barrel of oil sales while January is estimated to be in the range of $67.00 to $70.00 per barrel.\nVAALCO anticipates a normal January monthly lifting of approximately 108,000 net barrels of oil by January 31 in addition to the partial lifting in early January. As previously commented, VAALCO has no hedges currently in place for 2018 and receives pricing correlated to Brent prices.\nThe Company currently estimates its 2018 production will average 3,500 to 4,100 BOPD. This assumes that the two wells currently shut-in on the Avouma platform (the South Tchibala 1-HB and the Avouma 2-H) return to production early in the second quarter of 2018. The Company plans to mobilize a hydraulic workover unit in March to perform those workovers. Sales volumes for 2018 are currently estimated to average 3,700 to 4,300 BOPD, higher than 2018 production due to the split-lifting impact in January.\nFinancial Update\nVAALCO has updated its estimate of operational and cash flow breakeven prices and its realized margin at various oil prices. The investor presentation on VAALCO’s web site has full details. For 2018, the Company estimates that its operational cash flow breakeven is $28 per barrel of oil sales while its free cash flow breakeven is $38 per barrel of oil sales. At $60 realized prices, VAALCO realizes $26.90 per barrel in operational margin and $19.20 per barrel in free cash flow. At $70 realized prices, VAALCO realizes $35.40 per barrel in operational margin and $27.70 per barrel in free cash flow. The Company estimates that each $5 increase in realized oil price increases annual cash flow by $7 million.\nAt December 31, 2017, VAALCO had an unrestricted cash balance of $19.7 million. During 2017, the Company reduced the principal amount of its debt by $10 million resulting in principal outstanding on debt of $9.2 million at December 31, 2017. The Company expects to pay down that balance by $6.7 million in 2018.\n2017 Year-End Reserves\nAs previously disclosed, VAALCO’s proved reserves of 3.0 MMBO at December 31, 2017, consisted of 100% oil. In 2017, the Company added 1.3 MMBO of reserves through reservoir performance additions and 0.6 MMBO through positive pricing revisions. Preliminary 2017 estimated production totaled 1.5 MMBO. All of VAALCO’s proved reserves are proved developed and are located offshore Gabon in the Etame Marin Permit area.\nThe present value of the proved reserves discounted at 10% (“PV-10 Value”) at year-end 2017, utilizing SEC pricing of $54.42 per barrel of oil (average of monthly prices on the first of each month for calendar year 2017), more than doubled to $22.5 million from $9.4 million at December 31, 2016. Utilizing forward strip pricing at year-end 2017 of $65.38 for 2018, $61.65 for 2019, $59.10 for 2020, and $57.96 for 2021, per barrel of oil, the PV-10 value would have been $39.3 million. VAALCO receives pricing for its crude that is correlated to Brent oil prices.\nForward Looking Statements\nThis document includes \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. All statements, other than statements of historical facts, included in this document that address activities, events, plans, expectations, objectives or developments that VAALCO expects, believes or anticipates will or may occur in the future are forward-looking statements. These statements may include amounts due in connection with the Company’s withdrawal from Angola, expected sources of future capital funding and future liquidity, future operating losses, future changes in oil and natural gas prices, future strategic alternatives, capital expenditures, future drilling plans, prospect evaluations, negotiations with governments and third parties including with the government of the Republic of Gabon in connection with a revised production sharing contract, expectations regarding processing facilities, production and sales projections, reserve growth, and other issues related to our exit from Angola. These statements are based on assumptions made by VAALCO based on its experience and perception of historical trends, current conditions, expected future developments and other factors it believes are appropriate in the circumstances. Such statements are subject to a number of assumptions, risks and uncertainties, many of which are beyond VAALCO's control. These risks include, but are not limited to, oil and gas price volatility, inflation, general economic conditions, the Company's success in discovering, developing and producing reserves, production and sales differences due to timing of liftings, decisions by our current lender or future lenders, the risks associated with liquidity, the risk that our negotiations with the governments of the Republic of Gabon and the Republic of Angola will be unsuccessful, lack of availability of goods, services and capital, environmental risks, drilling risks, foreign regulatory and operational risks, and regulatory changes. These and other risks are further described in VAALCO's annual report on Form 10-K for the year ended December 31, 2016 and quarterly report on Form 10-Q for the quarter ended September 30, 2017, and other reports filed with the SEC which can be reviewed at http://www.sec.gov , or which can be received by contacting VAALCO at 9800 Richmond Avenue, Suite 700, Houston, Texas 77042, (713) 623-0801. Investors are cautioned that forward-looking statements are not guarantees of future performance and that actual results or developments may differ projected in the forward-looking statements. VAALCO disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise.\nAbout VAALCO\nVAALCO Energy, Inc. is a Houston-based independent energy company principally engaged in the acquisition, development and production of crude oil. The Company's properties and acreage are located primarily in Gabon and Equatorial Guinea in West Africa.\nInvestor Contact\nPhil Patman 713-623-0801\nSource:Vaalco Energy Inc", "external_links": ["https://www.globenewswire.com/Tracker?data=6KWjI5QnNDhbUhY9PDjShMCxFpZt1mVc9puf1bnCh4QX1SjpVwH8yJemMlrMuQ4euk0SsboRv_8lDiAD_iateg==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/acf6e99a-60d2-41a8-8684-de154533fa9d"], "published": "2018-01-31T14:45:00.000+02:00", "crawled": "2018-01-31T17:49:29.029+02:00", "highlightTitle": ""}