{"organizations": [], "uuid": "991bf88b59034d5cfdfde5fd88c1b6560590c164", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-aritzia-reports-third-quarter-2018-financial-results.html", "country": "US", "domain_rank": 767, "title": "Aritzia Reports Third Quarter 2018 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T00:01:00.000+02:00", "replies_count": 0, "uuid": "991bf88b59034d5cfdfde5fd88c1b6560590c164"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-aritzia-reports-third-quarter-2018-financial-results.html", "ord_in_thread": 0, "title": "Aritzia Reports Third Quarter 2018 Financial Results", "locations": [], "entities": {"persons": [{"name": "brian hill", "sentiment": "none"}], "locations": [{"name": "vancouver", "sentiment": "none"}], "organizations": [{"name": "aritzia inc.", "sentiment": "negative"}, {"name": "ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, Jan. 10, 2018 /PRNewswire/ - Aritzia Inc. (\"Aritzia\" or the \"Company\") (TSX: ATZ), an innovative design house of exclusive fashion brands, today announced financial results for the third quarter of fiscal 2018.\n\"In the third quarter, we delivered our thirteenth consecutive quarter of positive comparable sales growth. Our strong revenue and adjusted EBITDA performance is a result of our diligent focus on executing against our long-term growth strategy. We believe our measured approach to eCommerce and store growth ensures thoughtful decision-making today to grow revenue, propel our brand, and invest in infrastructure to drive long-term value creation. We remain competitively positioned due to our vertically-integrated sourcing model and our focus on offering beautiful, high-quality products at an attainable price point with exceptional customer service,\" said Brian Hill, Aritzia Founder and Chief Executive Officer.\n\"As we look ahead, we will continue to execute on our successful strategy by enhancing our product supply chain, developing beautiful, high-quality products, capitalizing on premiere real estate locations, and growing our eCommerce business and omni-channel capabilities. We are excited about the opportunities ahead and believe we are well positioned to meet or exceed our long-term growth goals.\"\nUnless otherwise indicated, all amounts are expressed in Canadian dollars. Certain metrics, including those expressed on an adjusted or comparable basis, are non-IFRS measures. See \"Non-IFRS Measures including Retail Industry Metrics\" and \"Selected Consolidated Financial Information\" further below.\nHighlights for the Third Quarter\nNet revenue increased by 9.6% to $204.4 million from $186.5 million in Q3 last year. The weakening of the U.S. dollar year-over-year in the quarter negatively impacted net revenue by approximately 160 basis points, or $3.0 million Comparable sales growth was 6.3%, following 15.1% growth in Q3 last year Gross profit margin was 44.8%, compared to 44.1% in Q3 last year. This was primarily driven by continued improvement in product costs and the positive impact from the weakening of the U.S. dollar year-over-year in the quarter Adjusted EBITDA increased by 10.0% to $50.0 million from $45.4 million in Q3 last year Net income increased to $28.1 million, compared to a net loss of $8.1 million in Q3 last year Adjusted Net Income increased by 11.4% to $30.6 million, or $0.26 per diluted share (treasury stock method (1) ), from $27.5 million or $0.23 per diluted share (treasury stock method (2) ), in Q3 last year The Company opened one new store (Babaton Pacific Centre in Vancouver) and expanded or relocated three stores (Eaton Centre and Scarborough Town Centre in Greater Toronto, and Bellevue Square in Seattle) during the quarter\nThird Quarter Results\nAll comparative figures below are for the 13-week period ended November 26, 2017, compared to the 13-week period ended November 27, 2016.\nNet revenue increased by 9.6% to $204.4 million from $186.5 million in the third quarter last year. The net revenue increase was primarily driven by the addition of seven new store openings and five expanded or repositioned stores since the third quarter of fiscal 2017, as well as comparable sales growth of 6.3%, resulting from continued momentum in the Company's eCommerce business. The weakening of the U.S.dollar year-over-year in the quarter negatively impacted net revenue by approximately 160 basis points, or $3.0 million.\nGross profit increased by 11.3% to $91.5 million, or 44.8% of net revenue, compared to $82.3 million, or 44.1% of net revenue, in the third quarter last year. This was primarily due to the benefit of ongoing product supply chain initiatives, as well as the positive impact from the weakening of the U.S. dollar year-over-year in the quarter, partially offset by straight-line rent expense from our new Vancouver distribution centre and a flagship store under construction of $1.0 million in the aggregate during the quarter. We will continue to incur rent expense for our new distribution centre until its planned opening in the fall of 2018, which as expected, will temporarily inflate our reported cost of goods sold.\nSelling, general and administrative (\"SG&A\") expenses decreased by 1.6% to $47.7 million compared to $48.5 million in the third quarter last year. The third quarter of last year included $3.1 million of costs related to the Company's IPO. Excluding these IPO-related costs, SG&A was $45.3 million in the third quarter last year. This increase in normalized SG&A dollars during the quarter was primarily due to variable selling expenses driven by higher sales volume, as well as investments in information technology and talent. SG&A expenses for the quarter were 23.3% of net revenue, compared to a normalized 24.3% in the third quarter last year after excluding IPO-related costs.\nOther income, net was $2.0 million compared to $3.1 million in the third quarter last year. Other income, net this quarter primarily relates to unrealized operational foreign exchange gains of $0.8 million and unrealized foreign exchange gains on U.S. dollar forward contracts of $1.9 million, offset by realized operational foreign exchange losses of $0.1 million and realized foreign exchange losses on U.S. dollar forward contracts of $0.8 million.\nAdjusted EBITDA increased by 10.0% to $50.0 million, or 24.4% of net revenue, compared to $45.4 million, or 24.4% of net revenue, in the third quarter last year. Adjusted EBITDA in the quarter excludes stock-based compensation expense of $3.9 million and unrealized foreign exchange gains on U.S. dollar forward contracts of $1.9 million. Adjusted EBITDA for the third quarter last year excludes stock-based compensation expense of $4.0 million, IPO-related costs of $3.1 million, and unrealized foreign exchange gains on U.S. dollar forward contracts of $1.1 million. The increase in Adjusted EBITDA during the quarter was primarily driven by the factors described above.\nIncluded in Adjusted EBITDA is the aforementioned straight-line rent expense from the new distribution centre and a flagship store under construction of $1.0 million in the aggregate during the quarter.\nStock-based compensation expense was $3.9 million compared to $4.0 million in the third quarter last year. This quarter's stock-based compensation expense consists of $1.6 million in expenses related to the accounting for options under the legacy option plan and $2.3 million in expenses primarily related to the accounting of options under the new option plan.\nNet income for the quarter was $28.1 million, compared to a net loss of $8.1 million in the third quarter last year which was primarily due to the non-cash income tax reversal of $28.3 million during the third quarter last year relating to the modification of the accounting treatment of the Company's legacy option plan from a liability to equity-settled plan as of September 30, 2016.\nAdjusted Net Inc", "external_links": ["http://www.sedar.com/"], "published": "2018-01-11T00:01:00.000+02:00", "crawled": "2018-01-11T03:21:02.002+02:00", "highlightTitle": ""}