{"organizations": [], "uuid": "44312db739606ad116ee03a8fe2d03c2e9160f1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-propanc-biopharma-engages-alan-morell-of-creative-management-partners-as-senior-strategic-advisor-to-ceo-and-board-of.html", "country": "US", "domain_rank": 767, "title": "Propanc Biopharma Engages Alan Morell of Creative Management Partners as Senior Strategic Advisor to CEO and Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T16:30:00.000+02:00", "replies_count": 0, "uuid": "44312db739606ad116ee03a8fe2d03c2e9160f1e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-propanc-biopharma-engages-alan-morell-of-creative-management-partners-as-senior-strategic-advisor-to-ceo-and-board-of.html", "ord_in_thread": 0, "title": "Propanc Biopharma Engages Alan Morell of Creative Management Partners as Senior Strategic Advisor to CEO and Board of Directors", "locations": [], "entities": {"persons": [{"name": "alan morell", "sentiment": "neutral"}, {"name": "propanc biopharma", "sentiment": "none"}, {"name": "morell", "sentiment": "none"}, {"name": "james nathanielsz", "sentiment": "none"}, {"name": "alan", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "propanc biopharma inc.", "sentiment": "neutral"}, {"name": "creative management partners llc", "sentiment": "none"}, {"name": "pharma and biotech", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE, Australia, Jan. 10, 2018 /PRNewswire/ -- Propanc Biopharma Inc. (OTCQB: PPCB) (\"Propanc Biopharma\" or \"the Company\"), a clinical stage biopharmaceutical company focusing on development of new and proprietary treatments for cancer patients suffering from solid tumors such as pancreatic, ovarian and colorectal cancers, today announced the engagement of Mr. Alan Morell as a Senior Strategic Advisor for the Company, focusing on branding, growth strategy and market positioning. Mr. Morell currently serves as Chief Executive Officer of Creative Management Partners LLC, an internationally recognized Media and Public Relations firm and will be advising the Company on a consulting basis.\n\"For a number of months I held numerous discussions with Alan and observed his important contacts at the highest level among Fortune 500 Companies, including within the Pharma and Biotech sectors,\" said James Nathanielsz, Propanc Biopharma's Chief Executive Officer. \"Alan is highly respected on Wall Street within the Microcap sector and has excellent contacts across all Media. We look forward to maximizing the exciting growth potential of the Company with Alan's involvement, as we advance our lead product, PRP, towards a First-In-Human study in 2018.\"\n\"It is an incredibly enlightening journey to witness the advancement of this innovative technology and dedication of the management team at Propanc Biopharma under CEO James Nathanielsz,\" said Mr. Morell, Senior Strategic Advisor to the CEO at Propanc Biopharma. \"I share James' belief that PRP have the ability to direct cancer stem cells (CSCs) to become benign, converting cancerous cells into normal cells by reprogramming gene expression in CSCs, but not healthy cells. Our job is to get this positive word out.\"\nCurrently progressing towards a First-In-Human study, PRP aims to prevent tumor recurrence and metastasis from solid tumors. Eighty percent of all cancers are solid tumors and metastasis is the main cause of patient death from cancer. According to the World Health Organization, 8.2 million people died from cancer in 2012. Consequently, a report by IMS Health states innovative therapies are driving the global oncology market to meet demand, which is expected to reach $150 billion by 2020. The Company's initial target patient populations are pancreatic, ovarian and colorectal cancers, representing an estimated combined market segment of $14 billion in 2020, according to GBI Research.\nTo view Propanc Biopharma's \"Mechanism of Action\" video on anti-cancer product candidate, PRP, please click on the following link: http://www.propanc.com/news-media/video\nTo be added to Propanc Biopharma's email distribution list, please click on the following link: http://ir.propanc.com/email-alerts and submit the online request form.\nAbout Creative Management Partners LLC, Agent Alan Morell, Consulting and Advisory:\nCreative Management Partners assists clients with Brand Growth Strategy, which includes identifying relevant cancer support associations for media campaigns, such as video news releases, social media, and print and online placement for business-focused publications. Through Creative Management Partners, Mr. Morell coordinates with news affiliates including Fox, MSNBC, and CNBC, Fortune, Time among others, for both live and taped appearances and interviews. At Creative Management Partners LLC, Mr. Morell's client list ranges from select individuals within Pharma, Medical, Literary; Broadcast; Sports, Entertainment and the Arts. Creative Management Partners is headquartered in Beverly Hills, California, with partner offices in New York, Toronto and London. With over 30 years in the industry, Mr. Morell has led more than 2,500 Brand Strategy campaigns in both the public and private sectors.\nAbout Propanc Biopharma:\nPropanc Biopharma is a clinical stage biopharmaceutical company developing new cancer treatments initially for patients suffering from pancreatic, ovarian and colorectal cancers. We have developed a formulation of anti-cancer compounds, which exert a number of effects designed to control or prevent tumors from recurring and spreading throughout the body. Our products involve or employ pancreatic proenzymes, which are inactive precursors of enzymes. In the near term, we intend to target patients with limited remaining therapeutic options for the treatment of solid tumors. In future, we intend to develop our lead product to treat (i) early stage cancer and (ii) pre-cancerous diseases and (iii) as a preventative measure for patients at risk of developing cancer based on genetic screening. For more information, visit: www.propanc.com .\nForward-Looking Statements:\nAll statements other than statements of historical fact contained herein are \"forward-looking statements\" for purposes of federal and state securities laws. Forward-looking statements may include the words \"may,\" \"will,\" \"estimate,\" \"intend,\" \"continue,\" \"believe,\" \"expect,\" \"plan\" or \"anticipate\" and other similar words. Although we believe that the expectations reflected in our forward-looking statements are reasonable, actual results could differ materially from those projected or assumed. Our future financial condition and results of operations, as well as any forward-looking statements, are subject to change and to inherent risks and uncertainties including those regarding our earnings, revenues and financial condition, our ability to implement our plans, strategies and objectives for future operations, our ability to execute on proposed new products, services or development thereof, our ability to establish and maintain the proprietary nature of our technology through the patent process, our ability to license from others patents and patent applications, if necessary, to develop certain products, our ability to implement our long range business plan for various applications of our technology, our ability to enter into agreements with any necessary manufacturing, marketing and/or distribution partners for purposes of commercialization, the results of our clinical research and development, competition in the industry in which we operate, overall market conditions, and any statements or assumptions underlying any of the foregoing. Other risks, uncertainties and factors that could cause actual results to differ materially from those projected may be described from time to time in reports we file with the Securities and Exchange Commission, including our reports on Forms 10-K, 10-Q and 8-K. We do not intend, and undertake no obligation, to update any forward-looking statement contained herein, except as required by law.\nView original content with multimedia: http://www.prnewswire.com/news-releases/propanc-biopharma-engages-alan-morell-of-creative-management-partners-as-senior-strategic-advisor-to-ceo-and-board-of-directors-300580326.html\nSOURCE Propanc Biopharma", "external_links": ["http://ir.propanc.com/email-alerts", "http://www.propanc.com/news-media/video", "http://www.propanc.com/", "http://www.prnewswire.com/news-releases/propanc-biopharma-engages-alan-morell-of-creative-management-partners-as-senior-strategic-advisor-to-ceo-and-board-of-directors-300580326.html"], "published": "2018-01-10T16:30:00.000+02:00", "crawled": "2018-01-10T18:36:46.010+02:00", "highlightTitle": ""}