{"organizations": [], "uuid": "86125c87be9fb9e112a488c79d6af0a8294cbaa0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/softbank-group-ipo/update-1-softbank-plans-18-bln-ipo-of-mobile-phone-unit-as-soon-as-spring-nikkei-idUSL3N1P90IM", "country": "US", "domain_rank": 408, "title": "CORRECTED-UPDATE 3-SoftBank considers IPO for Japan wireless unit, said to seek $18 bln", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T06:45:00.000+02:00", "replies_count": 0, "uuid": "86125c87be9fb9e112a488c79d6af0a8294cbaa0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/softbank-group-ipo/update-1-softbank-plans-18-bln-ipo-of-mobile-phone-unit-as-soon-as-spring-nikkei-idUSL3N1P90IM", "ord_in_thread": 0, "title": "CORRECTED-UPDATE 3-SoftBank considers IPO for Japan wireless unit, said to seek $18 bln", "locations": [], "entities": {"persons": [{"name": "yoshiyasu shida", "sentiment": "none"}, {"name": "sam nussey", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "ipo", "sentiment": "negative"}, {"name": "softbank", "sentiment": "none"}, {"name": "arm holdings", "sentiment": "none"}, {"name": "alibaba group holding ltd", "sentiment": "none"}, {"name": "softbank group", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "softbank group corp", "sentiment": "none"}, {"name": "sprint corp", "sentiment": "none"}, {"name": "ntt", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Corrects 2nd bullet point to 2.2 trln yen, not 2.2 bln yen)\n* IPO could raise up to $18 billion - Nikkei\n* IPO would rival NTT’s 2.2 trln yen 1986 listing\n* SoftBank would use proceeds for overseas investment - Nikkei\n* Simultaneous TSE, overseas listings eyed - Nikkei\n* SoftBank says listing an option but no decision made\nBy Yoshiyasu Shida and Sam Nussey\nTOKYO, Jan 15 (Reuters) - SoftBank Group Corp said on Monday it was considering listing its Japanese wireless business, seeking to raise a reported $18 billion in a move that would accelerate the conglomerate’s transformation into one of the world’s biggest tech investors.\nA spin-off - potentially the biggest IPO by a Japanese company in nearly two decades - would also give the unit more autonomy as well as help investors with valuing the business and its parent.\nSoftBank Group, which saw its shares climb 4 percent on the news, has a vast range of holdings including stakes in British chip designer ARM Holdings, struggling U.S. wireless service provider Sprint Corp as well as Alibaba Group Holding Ltd.\nIt has with other investors also set up a $93 billion Vision Fund, that is investing in range of firms to capitalise on a tech future expected to be driven by artificial intelligence, robotics and interconnected devices.\nSoftBank Group plans to sell some 30 percent of SoftBank Corp, raising around 2 trillion yen ($18 billion) that would go towards investments in growth, such as buying into foreign information-technology companies, the Nikkei newspaper said without citing sources.\nIt plans to seek approval from the Tokyo Stock Exchange as early as spring and aims to debut in Tokyo as well as overseas, possibly London, around autumn, the business daily said.\nSoftBank Group said in a statement that a listing of the business was one option for its capital strategy but that no such decision had been made.\nA 2 trillion yen ($18 billion) IPO would be one of the biggest listings by a Japanese company, rivalling the 2.2 trillion yen 1986 offering of Nippon Telegraph and Telephone Corp as well as a 2.1 trillion yen listing by NTT DoCoMo Inc a decade later.\n“It makes sense to spin off the mobile-phone business using a public offering that would leave SoftBank in control and provide SoftBank with more cash to pursue its strategy of investing in companies with potentially high growth prospects,” Erik Gordon, a professor at the University of Michigan’s Ross School of Business.\n“It is a way of obtaining capital without adding debt or diluting SoftBank’s equity interests in the growth companies.”\nThe domestic telecoms unit, Japan’s No. 3 wireless carrier, posted a 4.5 percent rise in operating profit to 720 billion yen in the year ended March on sales of 3.2 trillion yen.\nSoftBank Group’s complicated structure and constant stream of new investments have left many investors struggling to value the company with analysts often noting that its market value does not accurately reflect the value of its massive holdings.\nSoftBank’s market value currently stands at around $92 billion. By contrast, its near 30 percent stake in Alibaba is worth around $140 billion.\nLarge companies seeking to list in Tokyo are required to float at least 35 percent of their shares although these rules can be eased when the company is also listing overseas. (Reporting by Yoshiyasu Shida and Sam Nussey; Additional reporting by Chris Gallagher and Minami Funakoshi; Writing by William Mallard; Editing by Edwina Gibbs)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T06:45:00.000+02:00", "crawled": "2018-01-16T13:39:13.000+02:00", "highlightTitle": ""}