{"organizations": [], "uuid": "dbf9491eced796bc81ede23a63a5bb15a66cd1c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XG261_GOPTRA_SOC_20180131132320.jpg", "site_section": "https://www.wsj.com/news/technology", "section_title": "Tech News &amp; Analysis - Wall Street Journal", "url": "https://www.wsj.com/articles/train-carrying-gop-members-of-congress-involved-in-accident-1517418224", "country": "US", "domain_rank": 387, "title": "Train Carrying GOP Lawmakers Collides With Truck", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-31T22:44:00.000+02:00", "replies_count": 0, "uuid": "dbf9491eced796bc81ede23a63a5bb15a66cd1c0"}, "author": "Kristina Peterson", "url": "https://www.wsj.com/articles/train-carrying-gop-members-of-congress-involved-in-accident-1517418224", "ord_in_thread": 0, "title": "Train Carrying GOP Lawmakers Collides With Truck", "locations": [], "entities": {"persons": [{"name": "paul ryan", "sentiment": "negative"}, {"name": "jason lewis", "sentiment": "none"}], "locations": [{"name": "greenbrier", "sentiment": "none"}, {"name": "west virginia", "sentiment": "none"}, {"name": "charleston", "sentiment": "none"}, {"name": "va.", "sentiment": "none"}, {"name": "charlottesville", "sentiment": "none"}, {"name": "richmond roanoke", "sentiment": "none"}, {"name": "uva medical center", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "minn.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "negative"}, {"name": "gop", "sentiment": "negative"}, {"name": "house", "sentiment": "negative"}, {"name": "university of virginia health system", "sentiment": "none"}, {"name": "amtrak", "sentiment": "none"}, {"name": "national transportation safety board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "128 COMMENTS A train carrying House Speaker Paul Ryan and other Republican members of Congress to a policy retreat in West Virginia collided Wednesday with a truck, killing one of the people in the vehicle.\nAll the lawmakers on board the train were believed safe, although Rep. Jason Lewis (R., Minn.) was taken to a local hospital to be checked out after suffering whiplash and a possible concussion.\nAmtrak said three passengers and two train crew members were taken to a local hospital with non-life-threatening injuries. Two other people in the truck were injured, according to witnesses at the scene.\nThe University of Virginia Health System said several people have been transported to UVA Medical Center in Charlottesville, Va., including one in critical condition.\npennsylvania\n50 miles\nohio\nWashington, D.C.\nwest\nvirginia\nCharleston\nSite of crash\nCharlottesville\nThe Greenbrier\nvirginia\nRichmond\nRoanoke\nnorth carolina\nThe National Transportation Safety Board said it was opening an investigation into the crash. A team of federal investigators is on its way to the scene. A spokesman for Amtrak said the train struck the truck at a grade crossing at 11:20 a.m. in Crozet, Va., a small town west of Charlottesville.\nThe train was a special charter traveling from Washington to the Greenbrier resort in White Sulphur Springs, W.Va., site of the annual legislative conference. Onboard were members of the House and Senate as well as their families, staff and security personnel.\nThe train appears to have struck a truck carrying trash, causing the cab of the truck to separate from its cargo. Photos shared with The Wall Street Journal and on Twitter show garbage strewn across a field. Lawmakers and others on the scene said crossing-guard rails establishing the train’s right of way were in the down position.\nA tweet from Rep. Greg Walden (R., Ore.): ‘We’re fine, but our train hit a garbage truck. Members with medical training are assisting the drivers of the truck.’ Photo: @repgregwalden/twitter The truck bore the logo of Time Disposal, a locally owned company that hauls residential and commercial garbage in rural areas without municipal garbage collection. A representative of Time Disposal declined to comment on the crash.\nSeveral lawmakers told CNN that several people were on the truck and that one appeared to have been thrown clear of the vehicle. A GOP aide said many lawmakers had sustained minor injuries.\nSen. Mike Lee (R., Utah), who was a passenger on the train, said there was no warning before the crash.\n“Leading up to the crash, the train was just going along full speed and all of a sudden we felt some kind of an impact,” he said. “There was a strong jolt—everybody hit their knees on the seats in front of them. A few people who were standing up fell,” he said.\nRep. Pete Sessions (R., Texas) said the crash threw people on the floor and into the seats in front of them.\n“All of the sudden we hit something,” Mr. Sessions said. “We knew we hit something big, and smack probably a second later we had a second hit” as the train came to a stop.\nThe mood after the crash was somber. Typically, the annual policy retreat is a relaxed trip that allows lawmakers to relax and enjoy each other’s company in a setting outside of Washington.\n“Obviously people are shaken by the fact that someone died today. That will affect a lot of lives,” Mr. Lee said. “We’re worried about the other person who was in bad shape and other people as well. The person operating the train has got to be terribly shaken by this.”\nPeople in the train didn’t panic, but Mr. Sessions worried several people may have concussions or injuries related to hitting their head. He was traveling with his wife, Karen, who “hit rather hard” against the seat in front of her.\nSen. Bill Cassidy (R., La.), who is a physician, said he awoke abruptly from a nap when the train hit the truck. When he went outside to see about helping people in the truck, he could see Rep. Phil Roe (R., Tenn.), who is also a physician, and some others looking at the person who was eventually pronounced dead. They attempted CPR, “but it was pretty clear he was dead,” Mr. Cassidy said.\nMr. Cassidy said he joined some other doctors in the congressional group, including Reps. Brad Wenstrup (R., Ohio), Larry Bucshon (R., Ind.) and Mike Burgess (R., Texas), in tending to another person. Mr. Bucshon’s wife, who is an anesthesiologist, was there helping, he said.\nWhite House press secretary Sarah Huckabee Sanders said President Donald Trump had been briefed on the situation and continued to receive regular updates.\nA number of lawmakers reported they were uninjured in the incident, but expressed concerns about the passengers of the truck.\nSen. Steve Daines of Montana tweeted: “On the train and okay. Prayers for the drivers of the truck.”\nLawmakers said buses were being dispatched to the scene to retrieve members of Congress.\nThe three-day retreat is designed to help the party formulate a legislative agenda and strategy for the coming year. Mr. Trump was expected to attend the retreat.\nHouse and Senate Democrats are also expected to hold retreats next week.\n— Valerie Bauerlein and Paul Berger contributed to this article.\nWrite to Kristina Peterson at kristina.peterson@wsj.com , Siobhan Hughes at siobhan.hughes@wsj.com and Byron Tau at byron.tau@wsj.com", "external_links": ["https://twitter.com/repgregwalden/status/958743314748014592"], "published": "2018-01-31T22:44:00.000+02:00", "crawled": "2018-01-31T22:08:58.022+02:00", "highlightTitle": ""}