{"organizations": [], "uuid": "6c5732afb502338598d35b00a8b5c9f3721ed06e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-business-unit-management-appointments.html", "country": "US", "domain_rank": 767, "title": "Business Unit Management Appointments", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.375, "site_type": "news", "published": "2018-01-18T01:00:00.000+02:00", "replies_count": 0, "uuid": "6c5732afb502338598d35b00a8b5c9f3721ed06e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-business-unit-management-appointments.html", "ord_in_thread": 0, "title": "Business Unit Management Appointments", "locations": [], "entities": {"persons": [{"name": "haithem ben hassen", "sentiment": "none"}, {"name": "ben hassen", "sentiment": "none"}, {"name": "trent rehill", "sentiment": "none"}], "locations": [{"name": "calgary", "sentiment": "none"}, {"name": "alberta", "sentiment": "none"}, {"name": "warsaw", "sentiment": "none"}, {"name": "romania", "sentiment": "none"}, {"name": "école polytechnique de montréa", "sentiment": "none"}, {"name": "pireco tunisia", "sentiment": "none"}, {"name": "tunisia", "sentiment": "none"}], "organizations": [{"name": "serinus energy inc.", "sentiment": "negative"}, {"name": "winstar", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "winstar tunisia bv", "sentiment": "none"}, {"name": "moftinu gas development project", "sentiment": "none"}, {"name": "serinus energy", "sentiment": "none"}, {"name": "frimar sa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CALGARY, Alberta, Jan. 17, 2018 (GLOBE NEWSWIRE) -- Serinus Energy Inc. (“ Serinus ”, “ SEN ” or the “ Company ”) (TSX:SEN) (WARSAW:SEN), is pleased to announce the following management appointments at the Company’s business units in Tunisia and Romania.\nIn Tunisia, the Company is pleased to appoint Mr. Haithem Ben Hassen as President of Winstar Tunisia BV, Serinus Energy’s wholly-owned operating subsidiary in Tunisia. He is replacing Dr. Trent Rehill who has resigned his position for personal reasons. Mr. Ben Hassen joined Winstar Tunisia in November 2014 as Senior Project Engineer and was then promoted to Project Manager in June 2015. During this time, he has been responsible for the completion of numerous capital projects undertaken by the Company, including the vital seconded role as Project Manager for the Moftinu Gas Development Project in Romania. Prior to joining Winstar, Mr. Ben Hassen had numerous senior engineering roles with Pireco Tunisia, Mondial Contractors, and Frimar SA in Tunisia. He has a Bachelor of Mechanical Engineering degree from École Polytechnique de Montréal in Canada.\nThe Company is also pleased to appoint Mr. Arafet Mansali as Chief Operating Officer and Mr. Chedly Maghraoui as Finance Director of Winstar Tunisia BV.\nMr. Mansali joined Winstar Tunisia in February 2014 as Senior Production Engineer before being appointed Production Manager in May 2017. He has significant petroleum engineering and operations management education and experience. Mr. Mansali will work closely with the Calgary technical team to implement capital programs to increase production efficiency from our Tunisia fields.\nPrior to joining Winstar, Mr. Maghraoui was Finance Accounting and Administration Manager for Ensco PLC, overseeing the financial reporting functions for all of Ensco’s projects in the United Kingdom and the Mediterranean region. He will work closely with the Calgary finance team in the financial reporting requirements of the Tunisia business unit as well joint venture financial reporting. He has significant training and experience in financial controls and audit compliance.\nIn Romania, the Company is pleased to announce that it has promoted Ms. Alexandra Damascan to the position of President of Serinus Energy Romania SA from her previous role of Country Manager, Romania. This change in title better reflects her significant role and contributions as the head of the Romanian Business Unit as the Company moves forward in the construction and commissioning of the Moftinu Gas Project. Ms. Damascan has been with Serinus Energy Romania since 2008 and has proven to be an invaluable member of the Serinus team. She has degrees in Political Economics, an MBA in Business Transactions from the Academy of Economic Studies, a Law Degree and LLM in International Arbitration from the Romanian-American University, as well as being currently enrolled in the MBA Oil & Gas Program at the Oil and Gas Institute in Ploiesti, Romania.\nIn addition to the promotion of Ms. Damascan, Serinus Energy Romania has also appointed Mr. Florin Georgescu to the role of Vice President, Production & Development. In this position, Mr. Georgescu will oversee the Romanian commercial and production operations, working closely with the Calgary team. Mr. Georgescu has an MBA in Business Management, an MBA in Oil & Gas Management from the Oil & Gas University in Ploiesti, Romania as well as significant education and experience in Commercial, Financial and Banking and working experience in oil regions such as North America and Middle East.\nSerinus Executive Management is very pleased to appoint and promote these very competent and experienced individuals to their positions. These are important organizational steps for the Company as it positions itself for future years of growth in both Business Units.\nAbout Serinus\nSerinus is an international upstream oil and gas exploration and production company that owns and operates projects in Tunisia and Romania.\nFor further information, please refer to the Serinus website ( www.serinusenergy.com ) or contact the following:\nSerinus Energy Inc. Serinus Energy Inc. Calvin Brackman Jeffrey Auld Vice President, External Relations & Strategy Chief Executive Officer Tel.: +1-403-264-8877 Tel.: +1-403-264-8877 cbrackman@serinusenergy.com jauld@serinusenergy.com Translation: This news release has been translated into Polish from the English original.\nForward-looking Statements This release may contain forward-looking statements made as of the date of this announcement with respect to future activities that either are not or may not be historical facts. Although the Company believes that its expectations reflected in the forward-looking statements are reasonable as of the date hereof, any potential results suggested by such statements involve risk and uncertainties and no assurance can be given that actual results will be consistent with these forward-looking statements. Various factors that could impair or prevent the Company from completing the expected activities on its projects include that the Company's projects experience technical and mechanical problems, there are changes in product prices, failure to obtain regulatory approvals, the state of the national or international monetary, oil and gas, financial , political and economic markets in the jurisdictions where the Company operates and other risks not anticipated by the Company or disclosed in the Company's published material. Since forward-looking statements address future events and conditions, by their very nature, they involve inherent risks and uncertainties and actual results may vary materially from those expressed in the forward-looking statement. The Company undertakes no obligation to revise or update any forward-looking statements in this announcement to reflect events or circumstances after the date of this announcement, unless required by law.\nSource:Serinus Energy Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/8f329506-4646-44c7-90c2-f8d6eee2d454"], "published": "2018-01-18T01:00:00.000+02:00", "crawled": "2018-01-18T03:35:08.000+02:00", "highlightTitle": ""}