{"organizations": [], "uuid": "ae5cfc8553541fec008631668b4a56563251c250", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/21/104912513-_sites_default_files_images_104912513-GettyImages-892695676.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/25/four-triggers-could-cause-a-huge-cryptocurrency-crash--commentary.html", "country": "US", "domain_rank": 767, "title": "Four triggers could cause a huge cryptocurrency crash - commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-26T04:14:00.000+02:00", "replies_count": 0, "uuid": "ae5cfc8553541fec008631668b4a56563251c250"}, "author": "Julian Hosp", "url": "https://www.cnbc.com/2018/01/25/four-triggers-could-cause-a-huge-cryptocurrency-crash--commentary.html", "ord_in_thread": 0, "title": "Four triggers could cause a huge cryptocurrency crash - commentary", "locations": [], "entities": {"persons": [{"name": "julian hosp", "sentiment": "none"}, {"name": "hosp", "sentiment": "none"}, {"name": "jaap arriens", "sentiment": "none"}], "locations": [], "organizations": [{"name": "venture capital four", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "If it's true that the bigger they are, the harder they fall, then cryptocurrencies have been gearing up for a tremendous decline.\nBut, then again, maybe this is just the start for the great crypto bull market.\nAs of Monday, the entire cryptocurrency market stands at approximately $563 billion, according to industry site CoinMarketCap, which represents a more than 3,400 percent increase from the beginning of 2017.\nWith some cryptocurrencies soaring several thousand percent, Google search results for the space coming in at all-time highs and lots of people hoping for overnight riches in nascent markets, it begs the question: Just how far can this growth be sustained and are we in a crypto currency bubble?\nI'm not going to argue whether or not the space is dangerously overinflated, but I am in the business of considering worst-case scenarios.\nMy company, TenX, provides debit cards that people can use to spend their cryptocurrencies, so I want to always be prepared for whatever the future may bring. So here's the question I'm asking: If it is a bubble, then what could make it burst?\nKnowing that one person alone is hardly ever smart enough to weigh all the variables, I have set out over the past few weeks to talk to some of the brightest and most experienced people in the crypto ecosystem, to challenge them with the question of what could make a crypto bubble pop.\nFinding an obviously right answer was not so easy, but here are some ideas we came up with:\nRegulation If regulators in the U.S., Europe or elsewhere get together and ban exchanges and other companies that provide services to the crypto ecosystem, that would have a hefty effect on cryptocurrencies themselves, which cannot really be banned.\nLooking at China, which \"banned\" cryptocurrencies in the summer of 2017, there's one clear result: People and companies simply moved somewhere else. And instead of the market collapsing it rallied. Would the U.S. or Europe have a more dramatic effect? I am pretty sure they would, but how likely is the entire scenario of one of the major Western economies banning cryptocurrencies? After bouncing this idea off a lot of people that I trust, I would give it a 10 percent chance in 2018, leading to a decline of about 50 percent from the market top.\nExchanges Prior to 2014, the crypto ecosystem saw one exchange accounting for over 70 percent of all trading volume: Mt. Gox. At the beginning of that year it suspended trading, initiating an 80 percent crash of the entire crypto market from its high.\nSome worry that we could see something similar today, but trading is much more distributed and hardly any exchange owns more than 10 percent of the entire trading volume according to CoinMarketCap. There are, however, some significant exchanges that do play an important role: According to Hackernoon , Coinbase and its backend solution GDax account for one of the largest exchanges to bring fresh fiat money into the ecosystem. It also boasts some of the largest user bases worldwide.\nSo a problem to the ecosystem could arise not from a hack, but rather from the cessation of fresh money to keep feeding the growth.\nOn the crypto-to-crypto side, we have an even scarier picture: One of the largest exchanges by trading volume is the only 6-month old exchange Binance, sometimes adding over 200,000 new users per hour.\nWhile I am NOT implying that any of the mentioned exchanges do a bad job, I am just highlighting some of the risks involved. What if Coinbase goes down and fresh money dries up? What if the extremely young exchange Binance runs into any issues?\nI know first-hand that they and many other exchanges do the best they can to keep users' funds safe, but there is always the risk of one or more of them blowing up. Growth is exponential and if some small thing goes wrong, it could make fresh capital dry up or lock up lots of coins indefinitely.\nI see the chances of a large exchange running into serious issues at around 25 percent for 2018 – with a drop of 10 to 15 percent from the market top.\nCredit Some exchanges allow users to buy cryptocurrencies with credit cards. And, on top of that, investors can even leverage purchases in many cases.\nIn fact, one report put the number around 3 to 4 percent for purchases that are made on credit that could not be paid back by the buyer.\nSuch a play is a bet the market will continue to go higher, so any extended period of sideways movement could be bad news for those who have to start closing positions. We haven't seen a such a market since the summer of 2017, so some recent entrants into the space could be caught unawares.\nI see such a scenario as reasonably likely, but it would probably have a weaker impact than other market risks due to the single digit prevalence. I give it a 20 to 25 percent probability with a 5 to 10 percent drop from the market's top.\nTether If a cryptocurrency has a market cap of $1 billion, it doesn't mean that $1 billion has flown into that cryptocurrency. It was probably a lot less, since the market cap gets calculated by multiplying the number of tokens by its last trading price.\nSo, for a cryptocurrency to have a market cap of $1 billion, maybe only $50 million actually moved into the cryptocurrency. Therefore, if that coin collapsed completely, its market cap would go from $1 billion to zero, but investors would have actually only lost $50 million.\nThere is one big exception: tether.\nTether gets issued out of thin air through a very complex system, supposedly whenever $1 is deposited in return. At the moment, tether is priced at around $1.6 billion, which supposedly means $1.6 billion actually went into that cryptocurrency.\nAccording to some reports , however, there isn't actually $1.6 billion backing up the token. Since many exchanges and other cryptocurrencies are connected to tether, any finding that its stated value is untrue would send the market into a significant decline.\nI've assessed this probability at only around 10 percent this year, but I think it would put the market down by around 10 to 15 percent.\nIt's worth noting that in-house counsel for Bitfinex, an exchange with close ties to tether, said in a December statement that \"every claim made by these bad actors has been patently false and made simply to agitate the cryptocurrency ecosystem. As a result, Bitfinex has decided to assert all of its legal rights and remedies against this agitator and his associates.\"\nLooking ahead Looking at these options, we see a few things: One individual outcome is neither likely nor would it have a huge impact, but many of the potentialities are interconnected. If one domino starts to fall, it could take others down — and probabilities start to add up, potentially taking the market down the same 80 percent that Mt. Gox did in 2014.\nWhile I personally do not believe we will see this happen in 2018, I would react instantly by moving my crypto holdings into \"safer\" asset classes if I noticed one of the scenarios becoming more likely.\nCommentary by Dr. Julian Hosp, the co-founder and president of TenX , a company that makes cryptocurrencies spendable in everyday life. He has recently released the book \"Cryptocurrencies Simply Explained.\" \nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter. \nWATCH: Bitcoin could be the biggest bubble in history – here's how show chapters Bitcoin could be the biggest bubble in history – here's how      7:26 AM ET Wed, 17 Jan 2018 | 02:00", "external_links": [], "published": "2018-01-26T04:14:00.000+02:00", "crawled": "2018-01-26T04:15:50.001+02:00", "highlightTitle": ""}