{"organizations": [], "uuid": "72827159b18160d0f3e051bf7899431ba5f8a061", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223911539&w=1200&r=LYNXMPEE0K0PB", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-yemen-security-southerners/southern-yemen-separatists-want-saudi-backed-government-overthrown-idUKKBN1FA0WT", "country": "US", "domain_rank": 408, "title": "Southern Yemen separatists want Saudi-backed government overthrown", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T19:02:00.000+02:00", "replies_count": 0, "uuid": "72827159b18160d0f3e051bf7899431ba5f8a061"}, "author": "", "url": "https://uk.reuters.com/article/uk-yemen-security-southerners/southern-yemen-separatists-want-saudi-backed-government-overthrown-idUKKBN1FA0WT", "ord_in_thread": 0, "title": "Southern Yemen separatists want Saudi-backed government overthrown", "locations": [], "entities": {"persons": [{"name": "ahmed bin daghr", "sentiment": "none"}, {"name": "abd-rabbu mansour hadi", "sentiment": "none"}, {"name": "hadi", "sentiment": "none"}, {"name": "mohammed mukhashaf", "sentiment": "none"}], "locations": [{"name": "southern yemen", "sentiment": "none"}, {"name": "yemen", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "aden", "sentiment": "none"}, {"name": "uae", "sentiment": "none"}, {"name": "united arab emirates", "sentiment": "none"}], "organizations": [{"name": "min read  aden", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 5:06 PM / Updated 13 minutes ago Southern Yemen separatists want Saudi-backed government overthrown Mohammed Mukhashaf 3 Min Read \nADEN (Reuters) - Southern Yemeni separatists declared a state of emergency in the port city of Aden on Sunday and vowed to overthrow the internationally recognised government, the group said, in a move that puts the two allies on a collision course. \nThe announcement underscores rising tensions between southern separatists, who are allied with the United Arab Emirates (UAE), and President Abd-Rabbu Mansour Hadi’s government over control of the southern half of Yemen. \nHadi’s government has been energized after Saudi Arabia deposited $2 billion into the central bank to shore up the rial. \nThe government has been nominally based in the southern port city of Aden since the coalition, with help from southern fighters, drove the Iran-aligned Houthis out of the city in 2015. \nPrime Minister Ahmed bin Daghr, who has been struggling to assert his government’s control over southern Yemen, has announced the first state budget since 2014. \nAt a meeting in Aden on Sunday, the Southern Transitional Council accused bin Daghr’s government of starving Yemenis and pushing the impoverished country to the verge of famine. \n“The Southern Resistance Forces (SRF) declare a state of emergency in Aden and announce that it has begun the process of overthrowing the legitimate government and replacing it with a cabinet of technocrats,” the statement issued after the meeting said. \nThe statement did not give any details on what it intends to do to topple the government, but it said it was giving Hadi a week to comply and dismiss his cabinet before starting the process. \nThe SRF will become the core of a new force that will rebuild security in southern Yemen and military institutions, the statement said. It added that it banned military forces and officials from northern Yemen, including members of Hadi’s government, in southern provinces. \nOne of the main differences between the two sides is that the UAE, a key member of the Saudi-led coalition, is hostile towards Islamists, but Hadi’s cabinet is formed mostly by the Islah party, seen as linked with the Muslim Brotherhood. \nThe new spat could jeopardise a rare opportunity offered by the killing of former president Ali Abdullah Saleh last month, that Saudi Arabia intended to seize to isolate the Houthi movement. \nSouthern forces have previously clashed with Hadi supporters, including members of Islah party, over control of strategic areas, including Aden airport and oil facilities. \nWith thousands of fighters deployed on battlefronts against the Houthis, Islah has been an important ally of Hadi and the Saudi-led coalition trying to reinstate his government. \nSince the coalition intervened in Yemen, Islah has tried to distance itself from the Brotherhood in an effort to ease Gulf rulers’ anxiety about its Islamist ideology. Writing By Aziz El Yaakoubi; Editing By Matthew Mpoke Bigg", "external_links": [], "published": "2018-01-21T19:02:00.000+02:00", "crawled": "2018-01-21T19:24:05.021+02:00", "highlightTitle": ""}