{"organizations": [], "uuid": "19a9bfbbabf9048e9bf8d5148ad27e6f783c0401", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-sanderson-farms-chicken-antibiotics/u-s-faces-oversupply-of-antibiotic-free-chicken-sanderson-farms-idUKKBN1F6021", "country": "US", "domain_rank": 408, "title": "U.S. faces oversupply of antibiotic-free chicken: Sanderson Farms", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T02:23:00.000+02:00", "replies_count": 0, "uuid": "19a9bfbbabf9048e9bf8d5148ad27e6f783c0401"}, "author": "", "url": "https://uk.reuters.com/article/us-sanderson-farms-chicken-antibiotics/u-s-faces-oversupply-of-antibiotic-free-chicken-sanderson-farms-idUKKBN1F6021", "ord_in_thread": 0, "title": "U.S. faces oversupply of antibiotic-free chicken: Sanderson Farms", "locations": [], "entities": {"persons": [{"name": "sanderson", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "sanderson farms tom polansek", "sentiment": "none"}, {"name": "sanderson farms inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "mcdonald’s corp", "sentiment": "none"}, {"name": "tyson foods inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 12:27 AM / Updated 17 hours ago U.S. faces oversupply of antibiotic-free chicken: Sanderson Farms Tom Polansek 3 Min Read \nCHICAGO (Reuters) - Supplies of chicken raised without antibiotics are outstripping demand, a major U.S. poultry producer said on Tuesday, a sign of overproduction that could eat into processors’ profits. \nLarge chicken and restaurant companies, including Tyson Foods Inc and McDonald’s Corp, have raced to cut antibiotics from poultry supplies as public health experts have warned about the link between use of the drugs in farms and the rise of drug-resistant bacteria. \nAntibiotic-free chickens made up an average of 40.5 percent of all fresh U.S. production for the first 10 months of 2017, Sanderson Farms Inc said in a regulatory filing. However, only 6.4 percent of sales were for products sold as antibiotic-free (ABF), according to Sanderson, the third-largest U.S. poultry producer. \nThe company declined to identify the source of the data. \nConsumers of antibiotic-free chicken, which can cost more to produce, mainly want breast meat and chicken tenders, Sanderson said. Producers are forced to sell other parts of the bird, including wings, against lower-priced meat from conventionally raised chickens. \n“Industry data indicate that the supply of ABF chicken is currently significantly greater than demand for the product, and that oversupply has increased,” the company said in its filing. \nSanderson’s assertion challenges a belief that the U.S. supply of antibiotic-free chicken is not enough to meet demand. As recently as three years ago, some poultry producers claimed that switching from conventionally raised birds would be too expensive to stay in business. \nSanderson is the only large U.S. chicken producer that has not committed to limit the use of antibiotics, though it has a plan to eliminate them if it is in the company’s best interest. \nChief Financial Officer Mike Cockrell said in an interview on Tuesday that proper antibiotic use was good for animal welfare and gave the company a competitive advantage. \n“It allows us to produce product at a more affordable price point,” he said. \nPerdue Farms, which eliminated the routine use of antibiotics in its chicken in 2016, does not know the source of Sanderson’s data, Perdue spokeswoman Andrea Staub said in an email. Demand is strong for Perdue products, she added. \nTyson, the biggest U.S. chicken producer, did not respond to a request for comment. \nThe market for antibiotic-free chicken is mainly limited to breast meat, said Christine McCracken, animal protein analyst for Rabobank. \n“All indications are that demand is increasing,” said Austin Wilson, program manager for activist group As You Sow, which is pushing Sanderson to stop using certain antibiotics. \n“Even if it’s not currently keeping pace, it may catch up.” \n(This story has been refiled to add dropped word ‘certain’ as in ‘certain antibiotics’ in paragraph 14.) Reporting by Tom Polansek; Editing by Richard Chang", "external_links": [], "published": "2018-01-17T02:23:00.000+02:00", "crawled": "2018-01-17T02:51:09.000+02:00", "highlightTitle": ""}