{"organizations": [], "uuid": "d3868e9d0d1204efb1436d5555d5aae0805bcd97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-a10-networks-announces-preliminary-fourth-quarter-2017-results.html", "country": "US", "domain_rank": 767, "title": "A10 Networks Announces Preliminary Fourth Quarter 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.017, "site_type": "news", "published": "2018-01-17T00:15:00.000+02:00", "replies_count": 0, "uuid": "d3868e9d0d1204efb1436d5555d5aae0805bcd97"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-a10-networks-announces-preliminary-fourth-quarter-2017-results.html", "ord_in_thread": 0, "title": "A10 Networks Announces Preliminary Fourth Quarter 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "san jose", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "north ameri", "sentiment": "none"}], "organizations": [{"name": "aten", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN JOSE, Calif.--(BUSINESS WIRE)-- A10 Networks, Inc. (NYSE: ATEN), a Secure Application Services™ company, today announced preliminary results for the fourth quarter ended Dec. 31, 2017.\nA10 Networks expects total revenue in the fourth quarter 2017 to be between $55.5 million and $56.0 million, below its prior guidance of $64.0 million to $67.0 million. The company expects to report GAAP net income in the range of break-even to $0.01 per share. On a non-GAAP basis, the company expects to report net income between $0.05 and $0.06 per share, using approximately 74.6 million diluted shares, which is within the previous guidance for non-GAAP net income of $0.01 to $0.07 per share, using approximately 74.0 million shares on a diluted basis. GAAP and non-GAAP net income results include a benefit from performance-based variable compensation. A preliminary reconciliation between GAAP and non-GAAP information is contained in the financial statements below.\n“We are disappointed with our revenue results for the quarter, which were below our guidance primarily due to a shortfall in North America sales as we experienced lower than expected seasonal demand trends in the region. Despite this shortfall, we increased our cash and cash equivalents by $6.6 million, and continued to see strength for our security solutions,\" said Lee Chen, president and chief executive officer of A10 Networks. \"Over the past two quarters, we have implemented a number of changes across the organization to help improve our execution and expand our presence in security to drive growth. We are making progress on these initiatives and continuing to work to align our sales and enablement engine with the growth opportunities in our market. As part of these initiatives, we have brought in Chris White to lead our global sales team, effective January 2, 2018. Chris is an accomplished sales executive with a long career in the cybersecurity industry, and his expertise in sales and channel leadership will be a solid asset to A10.”\n“We remain confident in our market opportunities and the actions we are taking to drive growth and tightly manage our cost structure. We also plan to more actively purchase shares in 2018 to help enhance shareholder value,\" continued Chen.\nA10's results are preliminary and remain subject to the completion of the company's customary quarterly close and review procedures. Material adjustments may arise between the date of this press release and the dates on which A10 Networks announces its full fourth quarter and year 2017 results and files its Form 10-K for the period with the SEC.\nConference Call Information\nThe company also announced it will release its complete financial results for the fourth quarter and year ended Dec. 31, 2017 after the U.S. markets close on Thursday, Feb. 8, 2018. Management will host a call that day at 1:30 p.m. Pacific time (4:30 p.m. Eastern time) to discuss the results and provide its outlook for first quarter 2018. Interested parties may access the conference call by dialing +1-844-792-3728 or +1-412-317-5105.\nA live audio webcast of the conference call will be accessible from the “Investors” section of A10 Networks’ website at investors.a10networks.com . The webcast will be archived for a period of one year. A telephonic replay of the conference call will be available one hour after the call and will run for five business days and may be accessed by dialing +1-877-344-7529 or +1-412-317-0088 and entering the passcode 10115827.\nA presentation with management’s prepared remarks on the full fourth quarter and year 2017 financial results and supplemental financial information will be posted to the website following the issuance of the company’s fourth quarter and year 2017 results press release after U.S. markets close on Thursday, Feb. 8, 2018. These materials will be accessible from the “Investor Relations” section of A10 Networks website at investors.a10networks.com .\nForward-Looking Statements\nThis press release contains “forward-looking statements,” including statements regarding our ability and plans to improve our execution, penetrate and expand into the security market, and drive growth and shareholder value, including through more active repurchasing shares. Forward-looking statements are subject to known and unknown risks and uncertainties and are based on assumptions that may prove to be incorrect, which could cause actual results to differ materially from those expected or implied by the forward-looking statements. Factors that may cause actual results to differ include currently unknown issues and adjustments that arise during the normal course of completion of the audit of our fiscal 2017 financial statements, execution risks related to closing key deals and improving our execution, the continued market adoption of our products, our ability to successfully anticipate market needs and opportunities, our timely development of new products and features, our ability to achieve or maintain profitability, any loss or delay of expected purchases by our largest end-customers, our ability to attract and retain new end-customers, our ability to maintain and enhance our brand and reputation, continued growth in markets relating to network security, the success of any future acquisitions or investments in complementary companies, products, services or technologies, the ability of our sales team to execute well, our ability to shorten our close cycles, the ability of our channel partners to sell our products, variations in product mix or geographic locations of our sales and risks associated with our presence in international markets.\nNon-GAAP Financial Measures\nIn addition to disclosing financial measures prepared in accordance with U.S. generally accepted accounting principles (GAAP), this press release and the accompanying table contain certain non-GAAP financial measures, including non-GAAP net income. Non-GAAP financial measures do not have any standardized meaning and are therefore unlikely to be comparable to similarly titled measures presented by other companies.\nA10 Networks considers these non-GAAP financial measures to be important because they provide useful measures of the operating performance of the company, exclusive of unusual events or factors that do not directly affect what we consider to be our core operating performance, and are used by the company's management for that purpose. We define non-GAAP net income as our net income excluding: (i) stock-based compensation and (ii) amortization expense related to acquisition.\nWe have included an estimate of our non-GAAP net income in this press release. Non-GAAP financial measures are presented for supplemental informational purposes only for understanding the company's operating results. The non-GAAP financial measures should not be considered a substitute for financial information presented in accordance with GAAP, and may be different from non-GAAP financial measures presented by other companies. Please see the reconciliation of non-GAAP financial measures to the most directly comparable GAAP measure attached to this release.\nAbout A10 Networks\nA10 Networks (NYSE:ATEN) ", "external_links": ["http://www.businesswire.com/news/home/20180116006622/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Fa10networks&esheet=51744006&newsitemid=20180116006622&lan=en-US&anchor=%40A10Networks&index=4&md5=480cf259d86ca776050af2013b6b3a1f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestors.a10networks.com%2F&esheet=51744006&newsitemid=20180116006622&lan=en-US&anchor=investors.a10networks.com&index=1&md5=5133cd76d36127aa9775a93765c69933", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestors.a10networks.com&esheet=51744006&newsitemid=20180116006622&lan=en-US&anchor=investors.a10networks.com&index=2&md5=663ff27d4a338a9bfc2a3a47875544ae", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.a10networks.com&esheet=51744006&newsitemid=20180116006622&lan=en-US&anchor=www.a10networks.com&index=3&md5=5c3a498276d4e61de65e848d0d0db0c7"], "published": "2018-01-17T00:15:00.000+02:00", "crawled": "2018-01-17T00:01:48.000+02:00", "highlightTitle": ""}