{"organizations": [], "uuid": "6a0f246c29400468bde2c72b71f9c7292722b7fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224137470&w=1200&r=LYNXMPEE0L11D", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-doping-olympics-russia/sports-tribunal-begins-hearing-appeals-from-39-banned-russians-idUSKBN1FB1G5", "country": "US", "domain_rank": 408, "title": "Sports tribunal begins hearing appeals from 39 banned Russians", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T14:04:00.000+02:00", "replies_count": 0, "uuid": "6a0f246c29400468bde2c72b71f9c7292722b7fa"}, "author": "", "url": "https://www.reuters.com/article/us-doping-olympics-russia/sports-tribunal-begins-hearing-appeals-from-39-banned-russians-idUSKBN1FB1G5", "ord_in_thread": 0, "title": "Sports tribunal begins hearing appeals from 39 banned Russians", "locations": [], "entities": {"persons": [{"name": "russi", "sentiment": "negative"}, {"name": "brian homewood", "sentiment": "none"}], "locations": [{"name": "pyeongchang", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "international olympic committee", "sentiment": "none"}, {"name": "min read  geneva", "sentiment": "none"}, {"name": "world anti-doping agency", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ioc", "sentiment": "none"}, {"name": "wada", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GENEVA (Reuters) - The Court of Arbitration for Sport (CAS) began to hear appeals on Monday from 39 Russian athletes who were given lifetime Olympic bans for doping violations at the 2014 Sochi Games.\nThe athletes were among 43 disqualified from their events, banned from participating in future Olympics and in some cases stripped of their medals following the International Olympic Committee’s investigation of widespread doping in Sochi.\nThe IOC has banned Russia from the Pyeongchang Winter Games next month as a result of its “unprecedented systematic manipulation” of the anti-doping system. However, individual Russian athletes will be able to compete as neutrals if they can prove their anti-doping credentials.\nRussia has repeatedly denied any state involvement in the doping which was exposed by an independent report commissioned by the World Anti-Doping Agency (WADA).\nLawyers representing the athletes said in a statement that they had been banned “despite a lack of specific evidence against any of them and in breach of their fundamental due process rights.”\n“The athletes are hopeful that the CAS Panels will grant them a fair hearing.”\nCourt of Arbitration for Sport (CAS) secretary general Matthieu Reeb speaks to the media during the hearings of the cases of 39 of the 42 Russian athletes who have challenged the decisions taken by the Disciplinary Commission of the International Olympic Committee (IOC DC) in relation to the 2014 Sochi Winter Olympic Games, in Geneva, Switzerland, January 22, 2018. REUTERS/Pierre Albouy The banned athletes compete in speed skating, bobsleigh, skeleton, cross-country skiing, ice hockey, luge and biathlon.\nCAS said that Grigory Rodchenkov, Russia’s former anti-doping chief who turned whistleblower, and Richard McLaren, the Canadian sports lawyer who wrote the WADA report, were expected to testify by video or telephone.\nCourt of Arbitration for Sport (CAS) secretary general Matthieu Reeb speaks to the media during the hearings of the cases of 39 of the 42 Russian athletes who have challenged the decisions taken by the Disciplinary Commission of the International Olympic Committee (IOC DC) in relation to the 2014 Sochi Winter Olympic Games, in Geneva, Switzerland, January 22, 2018. REUTERS/Pierre Albouy CAS secretary general Matthieu Reeb said that three speed skaters would be the first of the 39 athletes to address the hearing on Monday.\n“(The 39 athletes) will be heard one by one during the week. I can confirm that the hearing will last at least until next Saturday,” he told reporters. A decision is due by Jan. 31 - nine days before the start of this year’s games in Pyeongchang.\nCAS has said it received applications from 42 of the 43 banned athletes and that the cases involving three biathletes had been suspended and would not be heard this week.\nMaxim Belugin, part of the two and four-man bobsleigh teams which finished fourth at Sochi 2014, is the only banned athlete not to have lodged an appeal.\nWriting by Brian Homewood; Editing by Richard Balmforth\n ", "external_links": [], "published": "2018-01-22T14:04:00.000+02:00", "crawled": "2018-01-22T15:28:57.003+02:00", "highlightTitle": ""}