{"organizations": [], "uuid": "506f92a5eeba17f5145e09b66d4c9b9df5f5eaf1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/26/104970251-RTX4KQRY.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/trumps-performance-at-davos-was-calming-critics-say.html", "country": "US", "domain_rank": 767, "title": "Trump's performance at Davos was calming, critics say", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.182, "site_type": "news", "published": "2018-01-26T23:13:00.000+02:00", "replies_count": 0, "uuid": "506f92a5eeba17f5145e09b66d4c9b9df5f5eaf1"}, "author": "Kellie Ell", "url": "https://www.cnbc.com/2018/01/26/trumps-performance-at-davos-was-calming-critics-say.html", "ord_in_thread": 0, "title": "Trump's performance at Davos was calming, critics say", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "tony fratto", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "kempe", "sentiment": "none"}, {"name": "fred kempe", "sentiment": "none"}, {"name": "gene sperling", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "atlantic council", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Davos - World Economic Forum Trump's performance at Davos was calming, critics say Attendees at President Trump's speech at Davos were \"ready to bite,\" says Fred Kempe, but instead left feeling they need to re-examine their feelings about the president. \"He was more reserved\" than usual, says former White House deputy press secretary Tony Fratto. But the president not making \"terribly offensive\" comments is a low bar to set, says Gene Sperling, former national economic advisor. 2 Hours Ago | 04:54 \nAttendees at the World Economic Forum in Davos were \"ready to bite\" as they filled the room on Friday in Switzerland to hear President Donald Trump speak, but were surprised at what they heard. \n\"President Trump pulled off something that I didn't actually know was in his repertoire, which is he calmed the room with his speech,\" Fred Kempe, president and CEO of the Atlantic Council and former Wall Street Journal reporter, told CNBC on Friday during \" Power Lunch .\" \nKempe, who attended the event, described the ambiance as \"a hot room.\" \n\"I'd say 99 percent of them would have voted for Hillary Clinton had they had a vote,\" he said. \"They were ready to bite, ready to boo, ready to hate what he said.\" \nWhile the crowd didn't leave \"being in love with Donald Trump,\" Kempe said, they did leave \"feeling that they have to re-examine their current thinking about him as a leader. And that's about as best as he could have come out of it.\" \nSome leaders at Davos are now thinking of investing in the U.S. who previously were not, Kempe said. The performance may also have scored Trump an invitation to next year's World Economic Forum, he said. \nIn fact, the \"combative, loud Trump\" that people have grown accustomed to seeing on TV wasn't there, said Tony Fratto, former White House deputy press secretary and assistant Treasury secretary for President George W. Bush . \n\"He was more reserved, and he also had a good story to tell about the United States,\" Fratto said. \nBut not making inappropriate comments may be a low bar for the president of the United States , said Gene Sperling, former national economic advisor under President Bill Clinton and later President Barack Obama . \n\"The general positive reaction was, he wasn't as terribly offensive and divisive as we've seen other times,\" Sperling said. \n\"[But] he didn't do a lot to take away the profanities he's used to describe about a third of the countries in the crowd,\" he said. \"I think he was just literally not quite as bad as some people thought.\" \nSperling said he supports the president's attendance at the forum but thought Trump didn't get all of his facts straight. Most notably was Trump's claim that he has created a whole new era of jobs under his administration. \nJob growth has hovered around 171,000 per month under Trump, compared with 214,000 the previous four years, a 20 percent decline, Sperling said. \n\"I'm not blaming him for all that,\" said Sperling. \"I'm just saying, come on.\" \nThe national unemployment rate was 4.1 percent in December 2017, a 17-year-low, as the Dow Jones industrial average passed record highs of 26,000 this month under Trump. \n\"Anything good that's happening is a continuation, including some rising incomes, of things that had happened before that,\" Sperling said. Kellie Ell News Associate for CNBC Playing", "external_links": [], "published": "2018-01-26T23:13:00.000+02:00", "crawled": "2018-01-26T23:13:25.010+02:00", "highlightTitle": ""}