{"organizations": [], "uuid": "67b36082a279dff1c5dbca8bee7921d686f62bf2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221144088&w=1200&r=LYNXMPEE0A12F", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-luge-taiwan/olympics-no-ice-no-problem-for-taiwan-luger-lien-idUKKBN1F01S8", "country": "US", "domain_rank": 408, "title": "Olympics - No ice, no problem for Taiwan luger Lien", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T15:54:00.000+02:00", "replies_count": 0, "uuid": "67b36082a279dff1c5dbca8bee7921d686f62bf2"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-luge-taiwan/olympics-no-ice-no-problem-for-taiwan-luger-lien-idUKKBN1F01S8", "ord_in_thread": 0, "title": "Olympics - No ice, no problem for Taiwan luger Lien", "locations": [], "entities": {"persons": [{"name": "lien", "sentiment": "negative"}, {"name": "lien fabian hamacher", "sentiment": "negative"}, {"name": "lien te-an", "sentiment": "none"}], "locations": [{"name": "taiwan", "sentiment": "none"}, {"name": "taipei", "sentiment": "none"}, {"name": "yilan county", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}], "organizations": [{"name": "min read  taipei", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 59 PM / Updated 13 minutes ago Olympics - No ice, no problem for Taiwan luger Lien Fabian Hamacher 3 Min Read \nTAIPEI (Reuters) - When Lien Te-an sets off on his luge for practice runs there is no biting cold or sound of blades scraping the ice, only a swoosh before he disappears down a steep mountain road into the shimmering heat of eastern Taiwan’s Yilan County. Taiwanese Winter Olympic luge athlete Lien Te-an reacts as he works out at a gym room in Taipei, Taiwan September 19, 2017. REUTERS/Tyrone Siu \nAlthough his practice environment fails to evoke visions of winter sports, Lien will soon be heading towards the ice at next month’s Pyeongchang Olympics as one of the few Taiwanese athletes to have qualified. \nAfter a knee injury put paid to his hopes of a basketball career, Lien embraced luge at the age of 14 after being approached by a coach who was looking for new talent. \n“When I was small and had just started to practise with the sled, my friends all asked me, ‘Why are you doing this kind of sport?’ No one knew what this sport was about,” he said. \n“But later as I started to have some results and get some more exposure, they all started to say, ‘This is a lot of fun, this is so cool, and I also want to have a try’.” \nSwitching sport put Lien on a course of training abroad in winter sporting nations and finally participating in the Sochi Winter Olympics in 2014 where he was placed 39 in the men’s single competition. Taiwanese Winter Olympic luge athtlete Lien Te-an talks to physiotherapists at a gym room in Taipei, Taiwan September 19, 2017. REUTERS/Tyrone Siu \nWhen not training abroad, he swaps his luge for inline skates so he can get some training done even when he is away from the snow and ice. \nThe wheeled luge takes him down the mountain at top speeds of 105 km/h while his friends are looking out for incoming cars and trucks, but he normally avoids speeds of more than 70 km/h to prevent accidents. Slideshow (7 Images) \nLien calls Taiwanese winter sports athletes an “endangered species”, since they have to rely on self-discipline to reach their goals as the Winter Olympics receive much less attention there than the Summer Games. \n“I want to share my mental process and my story. I want to use my experiences to give people who need positive energy the motivation to go and do the things they want to do,” said the 23-year-old. \n“I want to popularise this sport ... I hope that even more young athletes can get into this sport in the future and make sure that Taiwan’s Winter Olympics doesn’t disappear after we retire because there are only so few of us.” \nLien crashed in the first run on his Olympic debut in Sochi four years ago but the luger is confident heading into Pyeongchang. \nSo long as the race is not over, he says, there is always the opportunity to get back on track. Writing by Amlan Chakraborty in New Delhi; editing by Peter Rutherford", "external_links": [], "published": "2018-01-11T15:54:00.000+02:00", "crawled": "2018-01-11T16:21:55.004+02:00", "highlightTitle": ""}