{"organizations": [], "uuid": "942231d1567e9d0d6adfec9f39c053a48d3c115f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/29/104559814-RTS195ZV-steve-mnuchin.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19794221/device/rss", "section_title": "Europe News", "url": "https://www.cnbc.com/2018/01/24/a-weaker-dollar-is-good-for-the-us-treasury-secretary-mnuchin-says.html", "country": "US", "domain_rank": 767, "title": "A weaker dollar is good for the US, Treasury Secretary Mnuchin says", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T11:04:00.000+02:00", "replies_count": 0, "uuid": "942231d1567e9d0d6adfec9f39c053a48d3c115f"}, "author": "Matt Clinch", "url": "https://www.cnbc.com/2018/01/24/a-weaker-dollar-is-good-for-the-us-treasury-secretary-mnuchin-says.html", "ord_in_thread": 0, "title": "A weaker dollar is good for the US, Treasury Secretary Mnuchin says", "locations": [], "entities": {"persons": [{"name": "steve mnuchin", "sentiment": "negative"}, {"name": "mnuchin", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}], "organizations": [{"name": "treasury", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Davos - World Economic Forum A weaker dollar is good for the US, Treasury Secretary Mnuchin says Treasury Secretary Steven Mnuchin said the U.S. is open for business and welcomed a weaker dollar , saying that it would benefit the country. He made a bid for investment into the U.S., saying the government was committed to growth of 3 percent or higher. Kevin Lamarque | Reuters Treasury Secretary Steve Mnuchin during a press briefing at the White House in Washington. \nTreasury Secretary Steven Mnuchin said the U.S. is open for business and welcomed a weaker dollar , saying that it would benefit the country. \nSpeaking at a press conference at the World Economic Forum in Davos Wednesday, he made a bid for investment into the U.S., saying the government was committed to growth of 3 percent or higher. \n\"Obviously a weaker dollar is good for us as it relates to trade and opportunities,\" Mnuchin told reporters in Davos, according to Bloomberg, adding that the currency's short term value is \"not a concern of ours at all.\" \n\"Longer term, the strength of the dollar is a reflection of the strength of the U.S. economy and the fact that it is and will continue to be the primary currency in terms of the reserve currency,\" he said. \nOn the eve President Donald Trump 's arrival at the event, he said that the U.S. delegation to Davos was its largest ever. \"(The) size of the delegation to Davos this year is testament to the scale of Trump's work over the past year,\" Mnuchin said. \n\"What's happening in the U.S. (is a) reflection of programs being put in place. As we look at U.S. growth, it continues to look quite good and is a very attractive place to invest,\" he added. \nThe dollar dipped slightly after his comments and hit a session low, with the dollar index slipping 0.47 percent for the day. The British pound climbed to a post-Brexit vote high shortly after 8:30 a.m. London time. \nMnuchin iterated that his country is \"absolutely\" committed to free and fair trade, according to the Associated Press. He added that strong U.S. growth was good for the economy and that there was no inconsistency with Trump's \"America First\" agenda, according to the news agency. \n—Reuters contributed to this report. Matt Clinch Digital News Editor, CNBC.com Related Securities", "external_links": [], "published": "2018-01-24T11:04:00.000+02:00", "crawled": "2018-01-24T11:14:55.013+02:00", "highlightTitle": ""}