{"organizations": [], "uuid": "7f9b323c8e9977a747c328d9fe284fe214c64af6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1220081191&w=1200&r=LYNXMPEE060NC", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-russia-election/cias-pompeo-says-russia-and-others-trying-to-undermine-u-s-elections-idUKKBN1EW0TC", "country": "US", "domain_rank": 408, "title": "CIA's Pompeo says Russia and others trying to undermine U.S. elections", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T21:17:00.000+02:00", "replies_count": 0, "uuid": "7f9b323c8e9977a747c328d9fe284fe214c64af6"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-russia-election/cias-pompeo-says-russia-and-others-trying-to-undermine-u-s-elections-idUKKBN1EW0TC", "ord_in_thread": 0, "title": "CIA's Pompeo says Russia and others trying to undermine U.S. elections", "locations": [], "entities": {"persons": [{"name": "pompeo", "sentiment": "negative"}, {"name": "mike pompeo", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "cia", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "republicans", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "cbs", "sentiment": "none"}, {"name": "fdd national security summit", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "central intelligence agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 7:18 PM / Updated 14 minutes ago CIA's Pompeo says Russia and others trying to undermine U.S. elections Reuters Staff 3 Min Read \nWASHINGTON (Reuters) - The head of the Central Intelligence Agency said on Sunday that Russia and others are trying to undermine elections in the United States, the next major one being in November when Republicans will try to keep control of Congress. CIA Director Mike Pompeo speaks at the FDD National Security Summit in Washington, U.S., October 19, 2017. REUTERS/Yuri Gripas \nU.S. intelligence agencies have concluded that Russia interfered in the 2016 presidential election to try to help President Donald Trump win, in part by hacking and releasing emails embarrassing to Democratic presidential candidate Hillary Clinton, and spreading social media propaganda. \nCIA Director Mike Pompeo told CBS that the Russian interference is longstanding, and continues. Asked on “Face the Nation” if Moscow is currently trying to undermine U.S. elections, Pompeo responded: “Yes sir, have been for decades.” \n“Yes, I continue to be concerned, not only about the Russians, but about others’ efforts as well,” Pompeo said, without giving details. “We have many foes who want to undermine Western democracy.” \nMoscow denies any meddling in the 2016 elections to help Republican Trump win. U.S. Special Counsel Robert Mueller is investigating whether any crimes were committed. Two Trump associates, former national security adviser Michael Flynn and campaign aide George Papadopoulos have pleaded guilty to lying to FBI agents in the probe. Trump denies any campaign collusion with Russia. \nTrump has at times suggested that he accepts the U.S. intelligence agencies’ assessment that Russia sought to interfere in the election but at other times has said he accepts Russian President Vladimir Putin’s denials that Moscow meddled. \nTrump has frequently spoken of wanting to improve relations with Putin, even though Russia has frustrated U.S. policy in Syria and Ukraine and done little to help Washington in its standoff with North Korea. \nPompeo told CBS that the CIA had an important function as a part of the national security team to keep U.S. elections secure and democratic. “We are working diligently to do that. So we’re going to work against the Russians or any others who threaten that very outcome,” he said. \nTrump said on Saturday that he planned an active year on the campaign trail on behalf of Republican candidates running in the mid-term elections, in which all of the House of Representatives and one-third of the Senate will be up for election. Republicans hold majorities in both. Reporting by Susan Cornwell; editing by Grant McCool", "external_links": [], "published": "2018-01-07T21:17:00.000+02:00", "crawled": "2018-01-07T21:34:51.000+02:00", "highlightTitle": ""}