{"organizations": [], "uuid": "7c5364566878f64f6256f8bbd619719a985ec28c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-motor-indy-king/motor-racing-briton-king-makes-move-to-indycar-idUKKBN1ET2C6", "country": "US", "domain_rank": 408, "title": "Motor racing - Briton King makes move to IndyCar", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T22:21:00.000+02:00", "replies_count": 0, "uuid": "7c5364566878f64f6256f8bbd619719a985ec28c"}, "author": "", "url": "https://uk.reuters.com/article/uk-motor-indy-king/motor-racing-briton-king-makes-move-to-indycar-idUKKBN1ET2C6", "ord_in_thread": 0, "title": "Motor racing - Briton King makes move to IndyCar", "locations": [], "entities": {"persons": [{"name": "king", "sentiment": "none"}], "locations": [{"name": "st. petersburg", "sentiment": "none"}, {"name": "jordan king", "sentiment": "none"}], "organizations": [{"name": "indycar reuters staff", "sentiment": "negative"}, {"name": "verizon", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ultra premium vodka chevrolet", "sentiment": "none"}, {"name": "carpenter", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 8:23 PM / Updated 31 minutes ago Motor racing - Briton King makes move to IndyCar Reuters Staff 3 Min Read \n(Reuters) - British Formula Two driver Jordan King has made the move over to the IndyCar Series after being named on Thursday as the latest addition to the Ed Carpenter Racing team for the 2018 season. \nKing, who spent 2017 in F2 with MP Motorsport, will drive Carpenter’s No. 20 Fuzzy’s Ultra Premium Vodka Chevrolet in the 11 road- and street-course races on this year’s Verizon IndyCar Series schedule. \nThe 23-year-old Briton, who will make his IndyCar debut at the season-opening Grand Prix of St. Petersburg on March 11, is eager to take on a new challenge. \n“I don’t want to put blinkers on myself straightaway before I’ve got in the car,” King told reporters. \n“I want to be like a sponge, absorb everything I can, try everything I can, and obviously do - certainly if I can win races, perfect, but it’s very much going to be a learning year for me, and the longer goal is to become a full-time IndyCar driver and work towards greater things in the future.” \nKing’s transition to Indy car racing is the latest step in a young career during which he has risen up the European motorsport ranks. \nHe was named the FIA Institute’s 2015 Driver of the Year and won the 2013 British F3 championship. \nAfter beginning in karts in 2005, King progressed to single-seaters in 2010. \nHe has spent the last three seasons in F2, previously known as GP2. While serving as a development driver for Manor F1 in 2015 and 2016, he participated in several tests and drove in practice sessions at the 2016 United States and Abu Dhabi grands prix. \nKing competed for MP Motorsport in the 2017 FIA Formula 2 Championship, collecting top-10 finishes in over half the races. \nKing said he did plenty of due diligence before making his decision, including a chat with former F2 team mate Alexander Rossi, who made a successful transition to IndyCar by winning the 2016 Indianapolis 500. \n“There’s always a bit of scepticism changing paths, and obviously for me it’s actually moving country and a couple of things like that, and for me someone like Alexander Rossi, he’s done it, but the other way around,” King said. Reporting by Frank Pingue in Toronto, editing by Ed Osmond", "external_links": [], "published": "2018-01-04T22:21:00.000+02:00", "crawled": "2018-01-04T22:32:59.013+02:00", "highlightTitle": ""}