{"organizations": [], "uuid": "d188dd2cfae3ac186d587967a8927a95ead6686e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221425653&w=1200&r=LYNXMPEE0B0PY", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-eve-walcott/everton-in-negotiations-to-sign-walcott-from-arsenal-idUKKBN1F11A5", "country": "US", "domain_rank": 408, "title": "Everton in negotiations to sign Walcott from Arsenal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T13:41:00.000+02:00", "replies_count": 0, "uuid": "d188dd2cfae3ac186d587967a8927a95ead6686e"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-eve-walcott/everton-in-negotiations-to-sign-walcott-from-arsenal-idUKKBN1F11A5", "ord_in_thread": 0, "title": "Everton in negotiations to sign Walcott from Arsenal", "locations": [], "entities": {"persons": [{"name": "walcott", "sentiment": "negative"}, {"name": "allardyce", "sentiment": "none"}, {"name": "sam allardyce", "sentiment": "none"}, {"name": "neil robinson", "sentiment": "none"}, {"name": "theo walcott", "sentiment": "none"}], "locations": [{"name": "emirates stadium", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "west ham united - emirates stadium", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "everton", "sentiment": "negative"}, {"name": "tottenham hotspur", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 11:45 AM / Updated 2 hours ago Everton in negotiations to sign Walcott from Arsenal Neil Robinson 3 Min Read \n(Reuters) - Everton manager Sam Allardyce said on Friday that the club are in negotiations to sign England international Theo Walcott from Arsenal. Soccer Football - Carabao Cup Quarter Final - Arsenal vs West Ham United - Emirates Stadium, London, Britain - December 19, 2017 Arsenal's Theo Walcott looks on REUTERS/Dylan Martinez \nThe 28-year-old forward has struggled to hold down a regular first-team slot at the Emirates Stadium this season and is reported to be keen to move after 12 years at the club with a view to securing a place in the England squad for the upcoming World Cup. \n“You’re all aware of our interest in Theo Walcott,” said Allardyce at a news conference ahead of Saturday’s game at Tottenham Hotspur. \n”If that can all be sorted out, which is difficult, then he’d be a great addition. \n“Some negotiations are going on. (The deal) is permanent, I don’t think there’s any chance of a loan. We’ll wait and see.” \nWhen asked what Walcott, who has been capped 47 times for England, would bring to Everton, Allardyce said: “Goal-scoring threat, pace, experience and good on assists from wide areas.” \nBut Allardyce, whose side have climbed to ninth in the Premier League, cautioned the deal was not imminent. \n“You don’t get optimistic because so many things can happen in such a short space of time. You never get excited until someone has signed on the dotted line,” he said. \nArsenal manager Arsene Wenger also said that negotiations were taking place, adding that he did not know if Walcott would stay. \n”I cannot give him assurances as it is not honest, but we will see. We have a good relationship. I don’t want him to lose an opportunity to go to the World Cup. \n“He went in 2006 and we are now in 2018 and he hasn’t been since for different reasons,” Wenger said at a news conference ahead of Sunday’s Premier League game with Bournemouth. \nWalcott’s future is likely to depend on Arsenal securing a replacement. The situation is complicated by another Arsenal striker, Alexis Sanchez, also linked with a move in the transfer window with British media reporting that Manchester City and United are both keen to sign the Chilean for around 35 million pounds. \nWenger straight-batted questions about their interest in Friday’s news conference. But when asked if Sanchez is replaceable, he said: “He is an exceptional player and if that happens, we must find a different balance in the team. I cannot tell you what I don’t know.” \nArsenal, who are sixth in the Premier League, have been linked with moves for Monaco midfielder Thomas Lemar, Paris St Germain winger Julian Draxler and Bordeaux’s Brazilian striker Malcom \nWhen asked about Malcom, Wenger said: “He is a good player but nothing is happening. We are not on that case at the moment.” Reporting by Neil Robinson; Editing by Toby Davis", "external_links": [], "published": "2018-01-12T13:41:00.000+02:00", "crawled": "2018-01-12T14:06:06.014+02:00", "highlightTitle": ""}