{"organizations": [], "uuid": "e44604055b7f929864cea6bca459e2338dd84002", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-oncor-sempra-energy-settlement-agreement-expands-to-9-texas-stakeholders.html", "country": "US", "domain_rank": 767, "title": "Oncor-Sempra Energy Settlement Agreement Expands to 9 Texas Stakeholders", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.094, "site_type": "news", "published": "2018-01-25T14:50:00.000+02:00", "replies_count": 0, "uuid": "e44604055b7f929864cea6bca459e2338dd84002"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-oncor-sempra-energy-settlement-agreement-expands-to-9-texas-stakeholders.html", "ord_in_thread": 0, "title": "Oncor-Sempra Energy Settlement Agreement Expands to 9 Texas Stakeholders", "locations": [], "entities": {"persons": [], "locations": [{"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "oncor", "sentiment": "negative"}, {"name": "texas stakeholders san diego", "sentiment": "negative"}, {"name": "oncor electric delivery company", "sentiment": "negative"}, {"name": "texas industrial energy consumers", "sentiment": "none"}, {"name": "energy freedom coalition of america", "sentiment": "none"}, {"name": "public utility commission of texas", "sentiment": "none"}, {"name": "sempra energy", "sentiment": "none"}, {"name": "texas energy association for marketers", "sentiment": "none"}, {"name": "office of the public utility counsel", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "energy future holdings corp.", "sentiment": "none"}, {"name": "nucor steel and golden spread electric cooperative inc.", "sentiment": "none"}, {"name": "steering committee of cities served", "sentiment": "none"}, {"name": "alliance for retail markets", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO and DALLAS, Jan. 25, 2018 /PRNewswire/ -- Oncor Electric Delivery Company, LLC (Oncor) and Sempra Energy (NYSE: SRE) today announced that the Energy Freedom Coalition of America, Nucor Steel and Golden Spread Electric Cooperative Inc. have joined the group of settling parties related to Sempra Energy's pending acquisition of Energy Future Holdings Corp. (EFH), including EFH's indirect, approximate 80-percent ownership of Oncor.\nWith today's announcement, nine of 10 intervenors in the proceeding have agreed to the settlement. This development marks a significant step forward for Sempra Energy's proposed acquisition of EFH and its stake in Oncor.\nPrevious stakeholders signing on to the settlement agreement include: Staff of the Public Utility Commission of Texas (PUCT); the Office of the Public Utility Counsel; Steering Committee of Cities Served by Oncor; Texas Industrial Energy Consumers; The Alliance for Retail Markets; and the Texas Energy Association for Marketers.\nOn Jan. 5, 2018, Oncor, Sempra Energy and Staff of the PUCT jointly filed with the PUCT, requesting that the agency approve the acquisition, consistent with the governance, regulatory and operating commitments in the settlement agreement. The nine settling parties have agreed that the acquisition is in the public interest, meets Texas statutory standards, and provides tangible and quantifiable benefits.\nOn Aug. 21, 2017, Sempra Energy entered into an agreement to acquire EFH. In September, the U.S. Bankruptcy Court for the District of Delaware approved EFH's entry into the merger agreement with Sempra Energy and, in October, Sempra Energy and Oncor filed a joint Change-in-Control application with the PUCT. On Oct. 16, 2017, the PUCT set a procedural schedule to complete a review of the joint application by early April 2018, with a proposed February 2018 hearing date. On Dec. 12, 2017, the Federal Energy Regulatory Commission issued an order authorizing Sempra Energy's acquisition of EFH, subject to customary conditions.\nThe EFH transaction closing remains subject to further approvals by the U.S. Bankruptcy Court and the PUCT, among other approvals and closing conditions.\nHeadquartered in Dallas, Oncor is a regulated electric transmission and distribution service provider, made up of approximately 134,000 miles of lines and more than 3.4 million advanced meters, making it the largest utility in Texas. Using cutting-edge technology, more than 3,900 employees work to safely maintain reliable electric delivery service to over 10 million Texans.\nSempra Energy , based in San Diego, is a Fortune 500 energy services holding company with 2016 revenues of more than $10 billion. The Sempra Energy companies' more than 16,000 employees serve approximately 32 million consumers worldwide.\nThis press release contains statements that are not historical fact and constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These statements can be identified by words such as \"believes,\" \"expects,\" \"anticipates,\" \"plans,\" \"estimates,\" \"projects,\" \"forecasts,\" \"contemplates,\" \"assumes,\" \"depends,\" \"should,\" \"could,\" \"would,\" \"will,\" \"confident,\" \"may,\" \"can,\" \"potential,\" \"possible,\" \"proposed,\" \"target,\" \"pursue,\" \"outlook,\" \"maintain,\" or similar expressions or discussions of guidance, strategies, plans, goals, opportunities, projections, initiatives, objectives or intentions. Forward-looking statements are not guarantees of performance. They involve risks, uncertainties and assumptions. Future results may differ materially from those expressed in the forward-looking statements.\nFactors, among others, that could cause actual results and future actions to differ materially from those described in any forward-looking statements include risks and uncertainties relating to: actions and the timing of actions, including decisions, new regulations, and issuances of permits and other authorizations by the California Public Utilities Commission, U.S. Department of Energy, California Division of Oil, Gas, and Geothermal Resources, Federal Energy Regulatory Commission, U.S. Environmental Protection Agency, Pipeline and Hazardous Materials Safety Administration, Los Angeles County Department of Public Health, states, cities and counties, and other regulatory and governmental bodies in the United States and other countries in which we operate; the timing and success of business development efforts and construction projects, including risks in obtaining or maintaining permits and other authorizations on a timely basis, risks in completing construction projects on schedule and on budget, and risks in obtaining the consent and participation of partners; the resolution of civil and criminal litigation and regulatory investigations; deviations from regulatory precedent or practice that result in a reallocation of benefits or burdens among shareholders and ratepayers; modifications of settlements; delays in, or disallowance or denial of, regulatory agency authorizations to recover costs in rates from customers (including with respect to regulatory assets associated with the San Onofre Nuclear Generating Station facility and 2007 wildfires) or regulatory agency approval for projects required to enhance safety and reliability; the availability of electric power, natural gas and liquefied natural gas, and natural gas pipeline and storage capacity, including disruptions caused by failures in the transmission grid, moratoriums or limitations on the withdrawal or injection of natural gas from or into storage facilities, and equipment failures; changes in energy markets; volatility in commodity prices; moves to reduce or eliminate reliance on natural gas; the impact on the value of our investment in natural gas storage and related assets from low natural gas prices, low volatility of natural gas prices and the inability to procure favorable long-term contracts for storage services; risks posed by actions of third parties who control the operations of our investments, and risks that our partners or counterparties will be unable or unwilling to fulfill their contractual commitments; weather conditions, natural disasters, accidents, equipment failures, computer system outages, explosions, terrorist attacks and other events that disrupt our operations, damage our facilities and systems, cause the release of greenhouse gases, radioactive materials and harmful emissions, cause wildfires and subject us to third-party liability for property damage or personal injuries, fines and penalties, some of which may not be covered by insurance (including costs in excess of applicable policy limits) or may be disputed by insurers or may impact our ability to obtain satisfactory levels of insurance; cybersecurity threats to the energy grid, storage and pipeline infrastructure, the information and systems used to operate our businesses and the confidentiality of our proprietary information and the personal information of our customers and employees; capital markets and economic conditions, including the availability of credit and the liquidity of our investments; fluctuations in inflation, interest and currency exchange rates and our ability to effectively hedge the risk of such fluctuations; the impact of changes in the tax code as a result of recent federal tax reform and uncertainty as to how certain of those changes may be applied, and our ability to mitigate such impacts; actions by credit rating agencies to downgrade credit ratings of us or our subsidiaries or to place those ratings on negative outlook; changes in foreign and domestic trade policies and laws, including border tariffs, revisions to international trade agreements, such as the North American Free Trade Agreement, and changes that make our exports less competitive or otherwise restrict our ability to export or resolve trade disputes; the ability to win competitively bid infrastructure projects against a number of strong and aggressive competitors; expropriation of assets by foreign governments and title and other property disputes; the impact on reliability of San Diego Gas & Electric Company's (SDG&E) electric transmission and distribution system due to increased amount and variability of power supply from renewable energy sources; the impact on competitive customer rates due to the growth in distributed and local power generation and the corresponding decrease in demand for power delivered through SDG&E's electric transmission and distribution system and from possible departing retail load resulting from customers transferring to Direct Access and Community Choice Aggregation or other forms of distributed and local power generation, and the potential risk of nonrecovery for stranded assets and contractual obligations; and other uncertainties, some of which may be difficult to predict and are beyond our control.\nAdditional forward-looking statements include, but are not limited to, statements about the completion of the merger and the expected financing plans for the merger, and other statements that are not historical facts. Additional factors that could cause actual results and future actions to differ materially from those described in any such forward-looking statements include risks and uncertainties relating to: the risk that Sempra Energy, EFH or Oncor may be unable to obtain bankruptcy court and governmental and regulatory approvals required for the merger, or that required bankruptcy court and governmental and regulatory approvals may delay the merger or result in the imposition of conditions that could cause the parties to abandon the transaction or be onerous to Sempra Energy; the risk that a condition to closing of the merger may not be satisfied; the risk that the transaction may not be completed for other reasons, or may not be completed on the terms or timing currently contemplated; the risk that the anticipated benefits from the transaction may not be fully realized or may take longer to realize than expected; the risk that the significant additional indebtedness Sempra Energy incurred in connection with the transaction may make it more difficult to pay or refinance its debt or take or other actions, including by decreasing business flexibility and increasing borrowing costs; the risk that, if the transaction is completed, Oncor's results of operations after the transaction will not be consistent with our expectations or that its capital investment spending will be less than anticipated; disruption from the transaction making it more difficult to maintain relationships with customers, employees or suppliers; the diversion of management time and attention to merger-related issues; and related legal, accounting and other costs, whether or not the merger is completed; and the risk that Oncor will eliminate or reduce its quarterly dividends due to its requirement to meet and maintain its new required regulatory capital structure, or because any of the three major credit rating agencies rates its senior secured debt securities below BBB (or its equivalent) or its independent directors determine it is in the best interest of Oncor to retain such amounts to meet future capital expenditures.\nThese risks and uncertainties are further discussed in the reports that Sempra Energy has filed with the U.S. Securities and Exchange Commission (SEC). These reports are available through the EDGAR system free-of-charge on the SEC's website, www.sec.gov . Investors should not rely unduly on any forward-looking statements. These forward-looking statements speak only as of the date hereof, and the company undertakes no obligation to update or revise these forecasts or projections or other forward-looking statements, whether as a result of new information, future events or otherwise.\nSempra South American Utilities, Sempra Infrastructure, Sempra LNG & Midstream, Sempra Renewables, Sempra Mexico and Infraestructura Energética Nova, S.A.B. de C.V. (IEnova) are not the same as the California Utilities, San Diego Gas & Electric Company (SDG&E) or Southern California Gas Company (SoCalGas), and are not regulated by the California Public Utilities Commission.\nView original content with multimedia: http://www.prnewswire.com/news-releases/oncor-sempra-energy-settlement-agreement-expands-to-9-texas-stakeholders-300587935.html\nSOURCE Sempra Energy", "external_links": ["http://www.sec.gov/", "http://www.sempra.com/", "http://www.prnewswire.com/news-releases/oncor-sempra-energy-settlement-agreement-expands-to-9-texas-stakeholders-300587935.html"], "published": "2018-01-25T14:50:00.000+02:00", "crawled": "2018-01-25T14:26:04.020+02:00", "highlightTitle": ""}