{"organizations": [], "uuid": "e39d17dbc5fa307d19b1beee926471372a81fe7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/02/23/102447690-463871954.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/11/the-new-tax-bill-could-mean-even-lower-prices-at-walmart.html", "country": "US", "domain_rank": 767, "title": "The new tax bill could mean even lower prices at Walmart", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T20:27:00.000+02:00", "replies_count": 0, "uuid": "e39d17dbc5fa307d19b1beee926471372a81fe7e"}, "author": "Lauren Thomas", "url": "https://www.cnbc.com/2018/01/11/the-new-tax-bill-could-mean-even-lower-prices-at-walmart.html", "ord_in_thread": 0, "title": "The new tax bill could mean even lower prices at Walmart", "locations": [], "entities": {"persons": [{"name": "michael lasser", "sentiment": "none"}, {"name": "lasser", "sentiment": "none"}], "locations": [], "organizations": [{"name": "walmart walmart", "sentiment": "negative"}, {"name": "walmart", "sentiment": "none"}, {"name": "ubs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Getty Images Employee Clara Martinez stocks the shelves at a Walmart store on Feb. 19, 2015, in Miami. \nWalmart is planning to give back a portion of its billions of dollars in savings from new tax legislation to workers — in wages, bonuses and other benefits. But Wall Street still wants to know where the rest of those savings will be spent. \nSome are beginning to speculate Walmart will invest in dropping prices even lower across its stores, something that's always been key to the big-box retailer's brand. \n\"Our sense is WMT will proceed judiciously [with] incremental near-term price investments,\" UBS analyst Michael Lasser wrote in a note to clients. \n\"It's already been deploying 'billions of dollars of price investments,'\" Lasser said. \"Still, the tax change provides fire power in its arsenal to deploy over time. It can now wait & see how the consumable retail landscape evolves [with] the slow rise of hard discounters & the move to online grocery.\" \nThe world's largest private employer made it clear on Thursday it's still in the \"early process\" of looking at the new tax bill, which slashes corporate tax rates to 21 percent, and would provide more details on future investments next month. \nCEO Doug McMillon said in prepared remarks that it would be \"clear and consistent\" for the company to put more money toward goals such as lower prices and technology upgrades. \nWalmart did confirm it would spend roughly $300 million more in fiscal 2018 in order to raise starting hourly wages to $11. Lasser estimates that will shave as much as 10 cents off the retailer's earnings-per-share figure, \"all else being equal.\" \nPayouts of bonuses, which should total roughly $400 million, will also result in a one-time charge that Walmart take in the fourth quarter of this year. \nThat being said, Walmart's earnings should still grow by roughly 14 percent assuming a lower tax rate, Lasser wrote. \nUnlike other retailers, which reported holiday sales in recent days, Walmart did not disclose the specific impact of the tax law changes on its earnings. \nA spokesman confirmed to CNBC that would be discussed when Walmart reports its financial results on Feb. 20. The company is still looking at its effective tax rate, among other changes, he said. \nOverall, most industry experts are applauding Walmart for its actions — what could set a precedent and push other retailers to do more of the same. \n\"The key question is will this step allow WMT to generate incremental sales and traffic,\" Lasser said. \"The evidence suggests it saw a top-line benefit in the past, but it's not clear if it will have the same effect the second time around.\" \nWalmart invested $2.7 billion over two years to improve training and increase pay in a program it announced in 2015. That move was followed by improved sales as shoppers had a better experience when they visited the retailer's stores, citing cleanliness, speed and better customer service. \nRetail Metrics Founder Ken Perkins, who's estimated Walmart's tax savings could amount to roughly $2 billion this year, called Thursday's announcement \"an astute move both from a political and business perspective.\" \n\"Walmart really started to turn a corner a couple of years ago when it started to simultaneously invest in stores, logistics, e-commerce and employee wages,\" Perkins told CNBC. \"The bump up to $11 per hour starting wage coupled with other bonuses and child care leave should bolster retention and moral even further.\" \nWalmart's stock was up less than half a percent Thursday morning, having rallied more than 45 percent from a year ago. Lauren Thomas News Associate for CNBC Related Securities", "external_links": [], "published": "2018-01-11T20:27:00.000+02:00", "crawled": "2018-01-11T19:37:11.009+02:00", "highlightTitle": ""}