{"organizations": [], "uuid": "b7f1eeee1da2d78b0a398896c223d2434e6f5556", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223641116&w=1200&r=LYNXMPEE0J0IU", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-federer-press/meet-the-press-how-federer-finds-an-edge-where-rivals-see-problems-idUSKBN1F90QD", "country": "US", "domain_rank": 408, "title": "Meet the press: how Federer finds an edge where rivals see problems", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T17:15:00.000+02:00", "replies_count": 0, "uuid": "b7f1eeee1da2d78b0a398896c223d2434e6f5556"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-federer-press/meet-the-press-how-federer-finds-an-edge-where-rivals-see-problems-idUSKBN1F90QD", "ord_in_thread": 0, "title": "Meet the press: how Federer finds an edge where rivals see problems", "locations": [], "entities": {"persons": [{"name": "simon", "sentiment": "negative"}, {"name": "federer", "sentiment": "negative"}, {"name": "nick kyrgios", "sentiment": "none"}, {"name": "maria sharapova", "sentiment": "none"}, {"name": "kyrgios", "sentiment": "none"}, {"name": "paul annacone", "sentiment": "none"}, {"name": "sharapova", "sentiment": "none"}, {"name": "roger federer", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE, (Reuters) - Maria Sharapova once used a pithy obscenity to describe them, Nick Kyrgios says he hates them, but every professional tennis player, when requested, has to do them.\nThe post-match press conference can be the bane of a player’s life, especially when they have lost, but while Sharapova and Kyrgios would rather be anywhere else, Roger Federer has found a way to use them to his advantage.\nThe 19-times grand slam champion, who will face the media every other day as long as remains in the Australian Open, has long used the obligatory interaction to process his matches.\n“Sometimes that’s why sometimes my coaches are also watching the press conference, because they feel they also get some insight, some information of how I felt,” Federer told reporters on Saturday.\n“I can replay the match also maybe again through my head. That’s why sometimes I take enjoyment out of doing the press conference.” Paul Annacone, Federer’s coach from 2010 until 2013, said the Swiss is almost unique in the way he deals with the media.\n“It’s typical of Roger’s personality because he doesn’t take things personally,” Annacone told Reuters. “He doesn’t pass judgement very literally, and he knows there’s a lot of different people with a lot of different jobs, so unless you overstep your bounds, he’s just kind of chatting about what he thinks and why, and by the time he gets out of there it’s over, and he’s on to the next thing.”\nFederer said he took a while to learn that they could be useful. “I was very wary, very afraid to be misQuote: d, misunderstood,” he said.\n”We’ve had issues in the Swiss press with other athletes in the past.\n”I just said, ‘look, I don’t want to have a 15-year or 20-year career where I go in the press room, and it’s like a shocker and a horror show every time I look around, I can’t believe this guy is sitting here again’.\n“I just said, ‘I’ll take that out of the equation. I’ll just go in there, give solid answers’. And through time I started to really enjoy myself.”\n“TRICKY QUESTIONS”\nOther players also enjoy press conferences, especially when they have the chance to use their brain.\n“I love tricky questions, when I really need to think about it,” twice Wimbledon champion Petra Kvitova told Reuters.\n“For me that’s better than just normal phrases, like, I tried to play aggressive ... so sometimes I‘m really enjoying it.”\nTennis - Australian Open - Melbourne, Australia, January 14, 2018. Roger Federer of Switzerland reacts during a news conference before the Australian Open tennis tournament. REUTERS/Edgar Su Rafael Nadal and Andy Murray are among those who take their time to give considered answers but others clearly do not enjoy the to-and-fro - some even skipping them from time to time and taking the $5,000 fine instead.\n”I can’t really stand it, to be honest,“ Kyrgios told Reuters. ”I mean, I know that I have to do it but I don’t really like it at all, I don’t really like any media, to be honest. But that’s the way the world is now.\n“That’s how people who aren’t at the event can sort of feel like they’re there ... Whether I like it or not it doesn’t really matter, it’s always going to be here.”\nIn her book, “Unstoppable”, Sharapova describes how difficult it can be to face the press so soon after a bad defeat: “The last thing you want to do, after losing, is talk about losing.”\nFaye Andrews, the co-founder of boutique sports communication agency Emilia Group, said she encourages players to provide context for the defeat.\n“It’s not a judge and a jury, it’s an opportunity for you to take control of the story of the match, for you to tell it on your terms,” said Andrews, who has worked with a number of athletes, including British number one Johanna Konta.\nDIFFICULT PLACE Annacone, who reached a career-high ranking of 12, admitted the press conference room has always been a potentially difficult place but said Federer sees it differently.\n“I‘m a big believer in that the best athletes tend not to let what they can’t control bother them that much,” he said.\n”They might have an initial emotional reaction but it tends not to linger, and that’s Roger.\n“At this stage of his career, especially, he’s so pragmatic about everything that he gets it. Does he agree with everything that he hears? Probably not. But he’s not going to waste any energy on it.”\nAndrews said Federer should be an inspiration to younger players in his dealing with the media.\n“He’s eloquent in three languages ... but it’s also little things, how he interacts with the press in the corridors, how he behaves when the cameras are off,” she said.\n“He has a way with people. He understands that every interaction with him is special to the other person and I think that’s as true in an interview as it is when he’s passing a security guard.”\nEditing by Nick Mulvenney\n ", "external_links": [], "published": "2018-01-20T17:15:00.000+02:00", "crawled": "2018-01-20T17:35:16.014+02:00", "highlightTitle": ""}