{"organizations": [], "uuid": "1797697d255fd5db1c97af21f16ae1cb7abbb810", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223333396&w=1200&r=LYNXMPEE0I0RH", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-mma-ufc-ufc220-preview/ngannous-rags-to-riches-tale-tops-card-at-ufc-220-idUSKBN1F81EA", "country": "US", "domain_rank": 408, "title": "Ngannou's rags-to-riches tale tops card at UFC 220", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-19T20:46:00.000+02:00", "replies_count": 0, "uuid": "1797697d255fd5db1c97af21f16ae1cb7abbb810"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-mma-ufc-ufc220-preview/ngannous-rags-to-riches-tale-tops-card-at-ufc-220-idUSKBN1F81EA", "ord_in_thread": 0, "title": "Ngannou's rags-to-riches tale tops card at UFC 220", "locations": [], "entities": {"persons": [{"name": "ngannou", "sentiment": "negative"}, {"name": "francis ngannou", "sentiment": "negative"}, {"name": "fernand lopez owonyebe", "sentiment": "none"}, {"name": "stipe miocic", "sentiment": "none"}, {"name": "mike tyson", "sentiment": "none"}], "locations": [{"name": "paris", "sentiment": "none"}, {"name": "mma factory", "sentiment": "none"}, {"name": "cameroon", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ufc", "sentiment": "negative"}, {"name": "mma", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Five years after being homeless on the streets of Paris, Francis Ngannou could be crowned UFC heavyweight champion at UFC 220 in Boston on Saturday, but he will have to bring all of his awesome power if he is to beat title holder Stipe Miocic.\nA latecomer to the sport of boxing, Ngannou idolized Mike Tyson and left his home country of Cameroon to pursue his dream of becoming a professional in France, but he quickly wound up penniless and living on the streets.\nHe found salvation at the MMA Factory gym in Paris, where owner Fernand Lopez Owonyebe persuaded him to give mixed martial arts a try.\nIronically, French law outlaws ground strikes in combat sports, effectively making MMA as practiced in the UFC a banned sport there. However, he still managed to make a name for himself on the French and European scenes and land a UFC contract.\nNow, five years after moving to France, the 31-year-old’s stunning knockout power and underrated grappling have earned him a title shot in the UFC.\n“This is just something for me, some way to close the chapter of my childhood, to close that chapter of my teenager (years). It wasn’t easy, it was a tough life,” he told reporters on a recent conference call.\n“But I‘m going to finish with it on January 20 by beating Stipe for the UFC title.”\nThe 35-year-old Miocic, who still serves with the fire department in his native Ohio alongside his fighting career, is aiming to write some history of his own by becoming the first UFC heavyweight champion to make three successful title defense.\n“He (Ngannou) is a great fighter, super-tough, and he’s fought some really good guys, but unfortunately he hasn’t faced someone like me yet,” Miocic told reporters.\nAlso up for grabs at Boston’s TD Garden on Saturday is the light heavyweight title, with Daniel Cormier facing Swiss kickboxer Volkan Oezdemir.\nFormer champion Cormier was reinstated following a humiliating knockout loss to Jon Jones in July 2017 when it was revealed that Jones had failed a dope test in connection with that fight.\nFormer Olympic wrestler Cormier says he is seeking to erase the memory of that loss.\n“My goal is always to go out and dominate, and that’s what I’ve done for the vast majority of my career, so nothing’s really changed,” he said.\n“The only pressure comes from myself because of the way the last fight ended.”\nReporting by Philip O'Connor; Editing by Christian Radnedge\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T20:46:00.000+02:00", "crawled": "2018-01-20T17:45:49.006+02:00", "highlightTitle": ""}