{"organizations": [], "uuid": "779b339da51e835cd659ae43d38173e5a4d2d506", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219466705&w=1200&r=LYNXMPEE0401Q", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/global-markets/asian-shares-approach-2007-peak-dollar-weak-on-soft-inflation-prospects-idINKBN1EU04D", "country": "US", "domain_rank": 408, "title": "Asian shares approach 2007 peak, dollar weak on soft inflation prospects", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T03:15:00.000+02:00", "replies_count": 0, "uuid": "779b339da51e835cd659ae43d38173e5a4d2d506"}, "author": "", "url": "https://in.reuters.com/article/global-markets/asian-shares-approach-2007-peak-dollar-weak-on-soft-inflation-prospects-idINKBN1EU04D", "ord_in_thread": 0, "title": "Asian shares approach 2007 peak, dollar weak on soft inflation prospects", "locations": [], "entities": {"persons": [{"name": "reuters/kim kyung-hoon", "sentiment": "none"}, {"name": "hideyuki sano", "sentiment": "none"}], "locations": [{"name": "asia-pacific", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "none"}, {"name": "tokyo stock exchange", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  tokyo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - World shares continued their strong start to 2018, with Wall Street opening up and European stocks advancing, while the U.S. dollar reversed its losses against the euro after a brief dip following the U.S. jobs report.\nInvestors look at computer screens showing stock information at a brokerage house in Shanghai, May 26, 2015. REUTERS/Aly Song/Files MSCI’s gauge of stocks across the globe gained 0.45 percent, reaching a fresh record high on the day.\nThroughout the first week of 2018, world shares have risen and several benchmarks have broken records. With the world’s largest economies all growing healthily at once and central banks moving slowly to tighten policy, investors have poured money into risk assets.\nU.S. stocks advanced on Friday as investors looked past weaker-than-expected U.S. job gains in December and focused on signs of a pick-up in wage growth.\nNon-farm payrolls increased by 148,000 jobs last month, while economists had expected a rise of 190,000. Average hourly earnings rose 0.3 percent, compared to 0.1 percent in November.\nThe Dow Jones Industrial Average rose 90.05 points, or 0.36 percent, to 25,165.18, the S&P 500 gained 10.18 points, or 0.37 percent, to 2,734.17 and the Nasdaq Composite added 44.90 points, or 0.63 percent, to 7,122.82.\n“December’s non-farm payrolls data does not fit the current narrative of booming U.S. growth. The initial reaction from the market is to ignore. That could be perilous,” said Jacob Deppe, head of trading at online trading platform Infinox in London, in a note.\nThe pan-European FTSEurofirst 300 index gained 0.77 percent, and emerging market stocks rose 0.65 percent.\nMSCI’s broadest index of Asia-Pacific shares outside Japan closed 0.7 percent higher, while Japan’s Nikkei rose 0.89 percent.\nDOLLAR ROSE FOLLOWING DATA A trader monitors share prices at the Bank Mandiri Sekuritas trading floor in Jakarta August 25, 2015. REUTERS/Beawiharta/Files The U.S. dollar rose on Friday, after a brief dip, after investors decided the U.S. December non-farm payrolls report would not stop the Federal Reserve from raising interest rates multiple times this year.\n“It was a little disappointing. The market doesn’t care. The margin of error on this number is always big,” said Paul Nolte, portfolio manager at Kingsview Asset Management in Chicago, referring to the U.S. jobs data.\n“What we’d be concerned about is if we see a couple of prints below 100,000. Until then we’re okay,” he added.\nThe dollar index last rose 0.15 percent, with the euro down 0.27 percent to $1.2034.\nThe Japanese yen weakened 0.41 percent at 113.23 per dollar, while Sterling was last trading at $1.3564, up 0.10 percent on the day.\nBenchmark U.S. Treasury 10-year notes last fell 7/32 in price to yield 2.4763 percent, from 2.453 percent late on Thursday.\nThe 30-year bond last fell 19/32 in price to yield 2.8144 percent, from 2.786 percent late on Thursday.\nOil prices fell on Friday, with U.S. production soaring. Earlier in the week, prices climbed to highs last seen in 2015, boosted by tightening supply and political tensions in OPEC member Iran.\nU.S. crude fell 1.34 percent to $61.18 per barrel and Brent was last at $67.40, down 0.98 percent on the day.\nIn commodities, zinc hit its highest in more than a decade as concerns over market tightness continued. Three-month zinc on the London Metal Exchange was last bid at $3,366.\nAdditional reporting by Maytaal Angel and Dmitry Zhdannikov in London, Gertrude Chavez-Dreyfuss in New York, Sruthi Shankar in Bengaluru, Henning Gloystein in Singapore; Editing by Alison Williams and Nick Zieminski\n ", "external_links": [], "published": "2018-01-05T03:15:00.000+02:00", "crawled": "2018-01-05T03:42:12.001+02:00", "highlightTitle": ""}