{"organizations": [], "uuid": "61c6244a3c57d8a1c3981bab66b075d0c651bd71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220331609&w=1200&r=LYNXMPEE0719W", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-abertis-atlantia-m-a/regulator-rejects-spanish-ministers-complaint-on-atlantia-bid-idUSKBN1EX21F", "country": "US", "domain_rank": 408, "title": "Regulator rejects Spanish ministers' complaint on Atlantia bid", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T20:25:00.000+02:00", "replies_count": 0, "uuid": "61c6244a3c57d8a1c3981bab66b075d0c651bd71"}, "author": "", "url": "https://www.reuters.com/article/us-abertis-atlantia-m-a/regulator-rejects-spanish-ministers-complaint-on-atlantia-bid-idUSKBN1EX21F", "ord_in_thread": 0, "title": "Regulator rejects Spanish ministers' complaint on Atlantia bid", "locations": [], "entities": {"persons": [{"name": "abertis", "sentiment": "none"}], "locations": [{"name": "atlantia", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 6:35 PM / Updated 2 hours ago Regulator rejects Spanish ministers' complaint on Atlantia bid Reuters Staff 3 Min Read \nMADRID (Reuters) - Spain’s market regulator on Monday stood by its 2017 authorization of a 15.6 billion euro ($18.7 billion) bid by Italy’s Atlantia ( ATL.MI ) for Spanish rival Abertis ( ABE.MC ), quashing a Spanish government request to revoke the approval. \nThe regulator’s affirmation bolsters Atlantia’s plan to create the world’s biggest toll road operator with a combined market value of more than 40 billion euros which has met with political hostility from Madrid. \nHochtief ( HOTG.DE ), the German arm of Spanish builder ACS ( ACS.MC ), has presented a rival offer valuing the Spanish company at around 17.1 billion euros, which is under review by the CNMV. \nTwo senior Spanish ministers asked the country’s stock market and merger deal regulator to revoke the approval it granted in October for Atlantia’s bid, which has been cleared by the European Union’s competition regulators. \nThey complained the regulator should not have authorized the bid because the Italian company had not sought permission from the government to take control of Abertis’s satellite business, strategic for Spain because it manages the nation’s satellite communications system. \nLast month, Atlantia bowed to pressure from the ministries and asked them to authorize its bid for Abertis. \nThe regulator said on Monday its authorization complied with Spanish law and that it trusted the takeover bid process could proceed normally. \nThe move clears another regulatory hurdle in a long battle between the Italian infrastructure group and German builder Hochtief to take control of Abertis. \nA source close to the matter said on Monday it could take until mid-February for Hochtief to complete the authorization process. \n“This additional step and the time needed for the approvals outside and inside Spain will take another month or so... I expect the two offers to compete on the market from mid-February,” the source said. \nAtlantia needs to trump Hochtief’s counter-bid, made in October, and is widely expected to sweeten its bid early this year. \nIn December a source said that after the Spanish ministers’ intervention, Atlantia had begun preparing for legal action in case its bid was blocked. \nDLA Piper and Italy’s Gianni, Origoni, Grippo, Cappelli & Partners are among Atlantia’s legal advisers while Credit Suisse, Mediobanca and Santander are its main banks. \nFreshfields and Linklaters are advising ACS and Hochtief on legal matters alongside a pool of investment banks led by JPMorgan and Lazard. \nAbertis has retained Citi and boutique bank AZ Capital while Spanish law firm Uría Menéndez Abogados is its legal adviser. Reporting By Sonya Dowsett, additional reporting by Francesca Landini and Paola Arosio in Milan, writing by Stephen Jewkes; Editing by Adrian Croft", "external_links": [], "published": "2018-01-08T20:25:00.000+02:00", "crawled": "2018-01-08T20:56:00.005+02:00", "highlightTitle": ""}