{"organizations": [], "uuid": "a478db885f109c2df7ac3ca9f257101780ceb716", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 13, "shares": 13, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/01/21/103322876-RTX23AKRb.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/us-stocks-interest-rates-earnings.html", "country": "US", "domain_rank": 767, "title": "Stocks open lower, slip from records as interest rates pop", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.082, "site_type": "news", "published": "2018-01-29T16:30:00.000+02:00", "replies_count": 0, "uuid": "a478db885f109c2df7ac3ca9f257101780ceb716"}, "author": "Fred Imbert", "url": "https://www.cnbc.com/2018/01/29/us-stocks-interest-rates-earnings.html", "ord_in_thread": 0, "title": "Stocks open lower, slip from records as interest rates pop", "locations": [], "entities": {"persons": [{"name": "peter boockvar", "sentiment": "none"}, {"name": "brendan mcdermid", "sentiment": "none"}], "locations": [], "organizations": [{"name": "new york stock exchange", "sentiment": "none"}, {"name": "nasdaq", "sentiment": "none"}, {"name": "bleakley advisory group", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Dow drops 177 points on rising rate fears in biggest decline of the year so far Stocks fell after hitting record highs in the previous session. The benchmark 10-year yield broke above 2.7 percent to reach its highest level since April 2014. This is a major week for Wall Street, with major earnings, a Fed announcement and a jobs report all slated for release. 23 Mins Ago | 02:20 \nU.S. stocks posted the biggest drop of this young year after the 10-year treasury yield shot higher, raising concerns higher interest rates would snuff out the bull market. \nThe S&P 500 declined 0.7 percent to close at 2,853.53, only its fifth down day of the year and by far its biggest. The Dow Jones industrial average fell 177.23 points to close at 26,439.48, also posting its biggest decline of 2018 . The Nasdaq composite pulled back 0.5 percent and closed at 7,466.51. \nThe benchmark 10-year yield broke above 2.7 percent to reach its highest level since April 2014 . Fears of higher inflation are sparking the sharp rise in bond rates this year. \n\"It is not just interest rates that continue to rise; inflation expectations are rising with them,\" said Peter Boockvar, chief investment officer at Bleakley Advisory Group, in a note. He also said 2.8 percent is the next key level to watch on the 10-year. \nThe Cboe Volatility index (Vix), widely considered the best gauge of fear in the market, rose 24.3 percent, or 2.7, to 13.77. \nUtilities, telecommunications and real estate were among the worst-performing sectors on Monday. These sectors are negatively affected by higher interest rates. Meanwhile, shares of Goldman Sachs and Bank of America, two stocks that benefit from higher interest rates, rose 1.6 percent and 0.25 percent, respectively. \nStocks are off to a strong start for 2018. But a strategist at Goldman Sachs said there is a \" high probability \" the stock market experiences a correction in the coming months. Peter Oppenheimer, chief global equity strategist at Goldman Sachs, noted Monday that \"correction signals are flashing\" and is advising clients to prepare for a pullback. \nAnother strategist at Stifel said the Federal Reserve would cause a correction this quarter, as it other central banks in tightening global monetary policy . Brendan McDermid | Reuters A trader on the floor of the New York Stock Exchange. \nStocks closed at record highs on Friday, with the Dow surging more than 200 points, while the S&P 500 and Nasdaq climbed more than 1 percent. Tech was one of the best-performing sectors on Friday after Intel reported strong quarterly results. \n\"Last week reinforced that tech remains a critically important sector for the market, and tech must remain stable if stocks can rally short term,\" Tom Essaye, founder of The Sevens Report, said in a note. \"We saw that in the price action last week. The whole week's gains came on Monday and Friday.\" \nEquities were also boosted last week by stronger-than-expected quarterly results from major companies. Thus far, the corporate earnings season has been strong. Of the S&P 500 companies that have reported as of Monday morning, 78 percent have reported surpassed bottom-line expectations, while 77 percent have beaten revenue estimates, according to FactSet. \nBoeing, McDonald's, Apple, Chevron, and Facebook are among the companies scheduled to report later this week. \nKim Forrest, senior equity analyst at Fort Pitt Capital, said she is not too worried about the rise in interest rates, noting: \"As long as companies continue to earn, the market will be fine.\" \nThis will be a big week for Wall Street. The Federal Reserve's latest monetary policy decision is expected to be announced Wednesday. Later in the week, the U.S. government will release the latest employment figures. \n—Reuters contributed to this report. WATCH: Bias is upward for the stock market show chapters", "external_links": [], "published": "2018-01-29T16:30:00.000+02:00", "crawled": "2018-01-29T16:32:44.017+02:00", "highlightTitle": ""}