{"organizations": [], "uuid": "e5d17055a74557748f07979baddd534bd8ed77de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-south-sudan-war/britain-says-monitoring-south-sudan-peace-violations-eyes-penalties-idUSKBN1F729X", "country": "US", "domain_rank": 408, "title": "Britain says monitoring South Sudan peace violations, eyes penalties", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-19T00:21:00.000+02:00", "replies_count": 0, "uuid": "e5d17055a74557748f07979baddd534bd8ed77de"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-south-sudan-war/britain-says-monitoring-south-sudan-peace-violations-eyes-penalties-idUSKBN1F729X", "ord_in_thread": 0, "title": "Britain says monitoring South Sudan peace violations, eyes penalties", "locations": [], "entities": {"persons": [{"name": "trott", "sentiment": "none"}, {"name": "salva kiir", "sentiment": "none"}, {"name": "chris trott", "sentiment": "none"}, {"name": "riek machar", "sentiment": "none"}], "locations": [{"name": "south sudan", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "addis abba", "sentiment": "none"}, {"name": "sudan", "sentiment": "none"}, {"name": "juba", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "juba", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JUBA (Reuters) - Britain said it was closely monitoring a ceasefire agreed last month between South Sudan’s warring parties and would work with regional partners to identify individuals guilty of violations and take action.\nSouth Sudan has been wracked by a four-year civil war that broke out after a political disagreement between former vice president Riek Machar and incumbent leader Salva Kiir degenerated into military confrontation.\nLast month, the two sides signed a ceasefire deal in Addis Abba.\nIn an interview in South Sudan’s capital Juba this week, British special envoy Chris Trott told Reuters:\n”Anyone that spoils the chances of peace should understand that we are watching...any breach of the peace process.\n“We have seen...violations of the agreement and what we are saying to the parties is that this is unacceptable.”\nHe urged regional countries to report promptly on any violations, identifying individuals, and “we would like you to send the message by doing X or Y”. He did not specify what this might involve.\nTrott was speaking ahead of planned meetings with South Sudanese officials and said he would make it very clear to the government it was expected to honor the ceasefire.\nBritain is among world powers trying to put diplomatic pressure on both the South Sudan government and rebels to end the fighting and agree a peace.\nSince the deal was signed, several violations have occurred, with both sides blaming each other for the breach.\nEarly this month several people were killed after fighting broke out near Juba.\nThe army blamed the rebels who they said attempted to seize a military outpost west of Juba.\nAttorneys defending two jailed members of former vice- president Machar’s staff said they had quit, citing what they called the government’s violation of the agreement by failing to release all political prisoners.\nSouth African national William John Endley and James Gatdet Dak, who served as advisor and spokesman for Machar, were arrested in 2016 and have been in detention since. Both were charged with crimes including conspiracy, treason and publishing materials harmful to the state.\nMonyluak Alor Kuol, head of the two defendants’ legal team told Reuters their clients’ continued prosecution contradicted the spirit of last month’s ceasefire.\n“As lawyers, we cannot encourage impunity (on the part of the government) and that is why we withdrew,” he said.\nWriting by Elias Biryabarema; editing by Ralph Boulton\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T00:21:00.000+02:00", "crawled": "2018-01-19T12:29:23.004+02:00", "highlightTitle": ""}