{"organizations": [], "uuid": "d35929659198af270456e7e2079bf168b1a73098", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKdomesticNews", "section_title": "Reuters: UK", "url": "https://uk.reuters.com/article/uk-britain-climatechange-policy/britain-must-urgently-bridge-policy-gaps-to-meet-emissions-target-advisers-idUKKBN1F601I", "country": "US", "domain_rank": 408, "title": "Britain must urgently bridge policy gaps to meet emissions target – advisers", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T02:18:00.000+02:00", "replies_count": 0, "uuid": "d35929659198af270456e7e2079bf168b1a73098"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-climatechange-policy/britain-must-urgently-bridge-policy-gaps-to-meet-emissions-target-advisers-idUKKBN1F601I", "ord_in_thread": 0, "title": "Britain must urgently bridge policy gaps to meet emissions target – advisers", "locations": [], "entities": {"persons": [{"name": "susanna twidale", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "committee on climate change", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 12:19 AM / Updated 8 hours ago Britain must urgently bridge policy gaps to meet emissions target – advisers Susanna Twidale 3   Britain must urgently lay out further policies to meet its domestic emissions targets, the government’s climate advisers said on Wednesday. \nUnder the Climate Change Act, Britain has committed by 2050 to cut emissions of carbon dioxide and other greenhouse gases by 80 percent compared with 1990 levels, and must produce proposals on how it intends to reach its climate targets, set in five-yearly carbon budgets. \nLast year the government launched a Clean Growth Strategy outlining investment in research and innovation to help reduce emissions, but the advisers said this does not go far enough. \n“Significant gaps still remain. Even if delivered in full, existing and new policies, including those set out in the Clean Growth Strategy, miss the fourth and fifth carbon budgets by… a significant margin,” a report by Britain’s Committee on Climate Change (CCC) said. \nThe fourth budget covers the period from 2023 to 2027 and requires an emissions cut of 51 percent on 1990 levels by 2025. \nThe committee, which is independent of government, is chaired by former British environment secretary John Gummer and includes business and academic experts. \nThe CCC said the government needs to provide more details of how it plans to boost the use of electric vehicles and said the country should invest in projects to capture and store carbon dioxide emissions underground. \nThe Clean Growth Strategy said the government would invest 100 million pounds in carbon capture, but Gummer told a press briefing that this level of funding did not match the importance of the technology in meeting emissions reduction goals. \nGummer also said housebuilders should do more to build energy efficient homes, which would help reduce emissions through lower energy use and help cut household energy bills. \nThe government should also evaluate the risk of low-carbon projects already under development failing to be delivered on time, the CCC said. \n“The timely completion of Hinkley C nuclear power station is one example,” it said. \nHinkley C, being built by EDF, is due to be the first new nuclear plant in Britain in more than 20 years, but has been beset by delays and may not begin generation until 2027, 10 years later than initially planned. \nGreenhouse gas emissions in Britain have fallen by 38 percent since 1990 and the country is on track to meet its third carbon budget (2018-2022). Reporting by Susanna Twidale; Editing by Adrian Croft", "external_links": [], "published": "2018-01-17T02:18:00.000+02:00", "crawled": "2018-01-17T02:40:00.044+02:00", "highlightTitle": ""}