{"organizations": [], "uuid": "5913221e7d42e26a83cd4c8fef2fcdbd97dc0c17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-billabong-international-ltd-m-a-board/boardriders-inc-to-buy-australias-billabong-for-about-155-million-idUSKBN1ET2KL", "country": "US", "domain_rank": 408, "title": "Boardriders Inc to buy Australia's Billabong for about $155 mln", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T01:32:00.000+02:00", "replies_count": 0, "uuid": "5913221e7d42e26a83cd4c8fef2fcdbd97dc0c17"}, "author": "", "url": "https://www.reuters.com/article/us-billabong-international-ltd-m-a-board/boardriders-inc-to-buy-australias-billabong-for-about-155-million-idUSKBN1ET2KL", "ord_in_thread": 0, "title": "Boardriders Inc to buy Australia's Billabong for about $155 mln", "locations": [], "entities": {"persons": [{"name": "billabong", "sentiment": "negative"}, {"name": "stephen coates", "sentiment": "none"}, {"name": "aaron saldanha", "sentiment": "none"}, {"name": "boardriders", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "boardriders inc", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "billabong international ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SYDNEY (Reuters) - Australian surfwear seller Billabong International Ltd ( BBG.AX ) agreed to a buyout from its top shareholder and major lender Oaktree Capital Management LP on Friday, in a deal valuing the company at about A$197.7 million ($155 million).\nThe U.S. private equity firm is betting on cost savings and a pick-up in consumer sentiment with its mid-summer buyout of the struggling firm, allowing it to bring brands such as RVCA, Element and Von Zipper into a portfolio already including Quicksilver, Roxy and DC Shoes.\nOaktree already holds 19 percent of Billabong and made the takeover offer through its majority-controlled sports-apparel business Boardriders Inc, formerly known as Quicksilver.\n“It’s a difficult retail outlook, but it’s probably the perfect time to be picking it up at the bottom of the market - take the costs out, do some marketing and if consumers start spending, watch the stock run up,” market portfolio strategist at stockbroker Blue Ocean Equities Mathan Somasundaram said.\nOaktree, along with Capital Management LP, rescued Billabong in 2013 with a refinancing deal but the turn-around hit headwinds.\nThe company posted a A$77.1 million post-tax loss last year in the face of stagnant wage growth and tough competition from “fast fashion” retailers such as H & M Hennes & Mauritz ( HMb.ST ) and online vendors.\nBillabong Chairman Ian Pollard said in a statement that while Billabong had made progress in recent years, it faced “ongoing risks and uncertainties”.\nThe Gold Coast-based company owed Oaktree and Centrebridge $172.2 million as at 30 June, according to the company’s annual report.\nThe bid price of A$1 per share represents a premium of 4.2 percent to Billabong’s closing price on Thursday and a 28.2 percent premium to the stock price before the offer was announced on Dec. 1, 2017.\nBillabong directors unanimously recommended the offer and shares jumped 2.86 percent to trade at A$0.99 in afternoon trade, suggesting traders believe the deal will receive shareholder support.\nBoardriders, which is roughly 85 percent controlled by Oaktree, said its purchase would complement existing brands, allow for “deeper” partnerships with suppliers and back-office savings.\nThe buyout is subject to shareholder and regulatory approval. Boardriders expects it will complete in the first half of 2018 and said the combined entity will be led by Oaktree Managing Director Dave Tanner.\nReporting by Tom Westbrook in Sydney. Additional reporting by Aaron Saldanha in Bengaluru; Editing by Stephen Coates\n ", "external_links": [], "published": "2018-01-05T01:32:00.000+02:00", "crawled": "2018-01-05T01:48:44.002+02:00", "highlightTitle": ""}