{"organizations": [], "uuid": "330f03d6b22f2feca48f59aa2c1c088de141fc0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 18, "shares": 18, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222853701&w=1200&r=LYNXMPEE0G1XV", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-britain-eu-france/with-eye-on-brexit-talks-may-to-deepen-security-ties-with-france-idUSKBN1F631Z", "country": "US", "domain_rank": 408, "title": "With eye on Brexit talks, May offers France money for border security", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T06:36:00.000+02:00", "replies_count": 0, "uuid": "330f03d6b22f2feca48f59aa2c1c088de141fc0d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-britain-eu-france/with-eye-on-brexit-talks-may-to-deepen-security-ties-with-france-idUSKBN1F631Z", "ord_in_thread": 0, "title": "With eye on Brexit talks, May offers France money for border security", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "william the conqueror", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "calais", "sentiment": "none"}, {"name": "sandhurst", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "daily mail", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "bayeux tapestry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON/PARIS (Reuters) - British Prime Minister Theresa May will offer France on Thursday 44.5 million pounds ($62 million) to bolster security at French border controls, part of measures to deepen cooperation that she hopes will foster goodwill in Brexit talks.\nAt talks with French President Emmanuel Macron at Sandhurst, Britain’s army officer training academy, May wants to show that Britain still has plenty to offer France and other members of the European Union as she negotiates her country’s departure.\nBut after a choreographed drumbeat of new agreements to be signed at what aides said was the 35th Anglo-French summit, the overtures, including the loan of the 11th century Bayeux Tapestry, fell flat in Britain’s euroskeptic media.\n“What a stitch up! Did borrowing the Bayeux Tapestry cost Britain 45 million pounds more to stop migrants at Calais,” the Daily Mail asked, while the Sun mocked up the depiction of how William the Conqueror invaded England in 1066 as a tale of the EU trying to stop Britain leaving the bloc.\nMay has long seen defense and security as one of its strongest arguments to gain leverage in talks to unravel more than 40 years of union. But France and other member states have been cool on allowing Britain to bypass Brussels.\nAfter lobbying from Macron for Britain to help with security at Channel ports which have become a focus for migrants, London said an additional 44.5 million pounds ($62 million) would be sent to France to help improve fencing, CCTV and technology.\n“This is about investing in and enhancing the security of the UK border,” a government spokesman said.\n“Just as we invest in our borders around the rest of the UK, it is only right that we constantly monitor whether there is more we can be doing at the UK border controls in France and Belgium to ensure they are as secure as possible.”\nBritain's Prime Minister, Theresa May, joins Sutton and Cheam Member of Parliament (MP), Paul Scully, as he campaigns for the forthcoming London local elections, in south west London, Britain January 13, 2018. REUTERS/Leon Neal/Pool COOPERATION The move comes alongside a raft of cooperation agreements at a summit where both leaders want to discuss “shared interests and priorities” rather than Brexit, especially after the EU has stepped up calls for Britain to change its mind.\n“While this summit takes place as the UK prepares to leave the EU, this does not mean that the UK is leaving Europe...A strong relationship between our two countries is in the UK, France and Europe’s interests, both now and into the future,” May said in a statement.\nMay’s spokesman said militant attacks in Britain and France underlined the need for cooperation, including Thursday’s first meeting of the five heads of British and French intelligence agencies.\nThe two are expected to commit to joint military operations including a combined expeditionary force.\nBritain will pledge to send three Chinook helicopters to Mali to provide logistical support for a French counter-terrorism operation and to participate in a new European defense initiative, the European Intervention Initiative.\nFrance, in turn, has committed to contribute troops to British-led NATO forces in Estonia in 2019.\nOverall, aides on both sides hope the summit will show the strength of ties between the two countries, something one French official said had become more important after the election of U.S. President Donald Trump.\n“We all share a slight concern about what’s going on in the United States, and in these times you feel the need to turn to people close to you to keep warm,” a French presidential aide said.\nEditing by Richard Balmforth and Angus MacSwan\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T06:36:00.000+02:00", "crawled": "2018-01-18T12:21:31.007+02:00", "highlightTitle": ""}