{"organizations": [], "uuid": "042eb0d489bf77841c146fab1b0a8dd9a9400ead", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1227012086&w=1200&r=LYNXMPEE0U1C9", "site_section": "http://feeds.reuters.com/reuters/topNews?format=xml", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-new-jersey-menendez/u-s-prosecutors-drop-corruption-case-against-sen-menendez-idUSKBN1FK2IN", "country": "US", "domain_rank": 408, "title": "U.S. prosecutors drop corruption case against Sen. Menendez", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T19:25:00.000+02:00", "replies_count": 0, "uuid": "042eb0d489bf77841c146fab1b0a8dd9a9400ead"}, "author": "", "url": "https://www.reuters.com/article/us-new-jersey-menendez/u-s-prosecutors-drop-corruption-case-against-sen-menendez-idUSKBN1FK2IN", "ord_in_thread": 0, "title": "U.S. prosecutors drop corruption case against Sen. Menendez", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - The U.S. Justice Department has dropped corruption charges against Democratic Senator Bob Menendez of New Jersey, according to a court filing on Wednesday, days after the trial judge threw out several counts. \nMenendez, a Democrat who is expected to seek reelection this year, was accused of accepting gifts from a wealthy benefactor, ophthalmologist Salomon Melgen, in exchange for official favors. \nHis first criminal trial last year ended in a mistrial after a jury could not come to a unanimous verdict, and federal prosecutors said this month they would seek to retry him. \n“From the very beginning, I never wavered in my innocence and my belief that justice would prevail,” Menendez said in a statement. “I am grateful that the Department of Justice has taken the time to reevaluate its case and come to the appropriate conclusion.” \nThe Justice Department’s decision to drop the case marks a major political victory not only for Menendez, but also for the Democratic party, which is hoping to regain control of the U.S. Senate in the upcoming midterm elections. \nLast week U.S. District Judge William Walls threw out some of the bribery charges on the grounds that prosecutors had failed to show that about $660,000 in political contributions from Melgen to help benefit Menendez’s 2012 reelection campaign were part of any bribery scheme. \nThe mere fact that some of the money arrived around the same time that Menendez took actions that could benefit Melgen was not enough to prove a “quid pro quo” arrangement, Walls said. \n“Given the impact of the Court’s Jan. 24 Order on the charges and the evidence admissible in a retrial, the United States has determined that it will not retry the defendants on the remaining charges,” the Justice Department said in a statement. \nThe department also said on Wednesday that it was dropping federal charges against Melgen, who was separately convicted of a Medicare fraud in Florida and is still awaiting sentencing in that case. \nReporting by Joseph Ax and Sarah N. Lynch, editing by G Crosse and Susan Thomas\n ", "external_links": [], "published": "2018-01-31T19:25:00.000+02:00", "crawled": "2018-01-31T19:32:23.009+02:00", "highlightTitle": ""}