{"organizations": [], "uuid": "97be9cc699451ceaa4aca98d22500936a8669f83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-solitude-lake-management-officially-announces-expansion-merger-with-lake-masters.html", "country": "US", "domain_rank": 767, "title": "SOLitude Lake Management Officially Announces Expansion, Merger With Lake Masters", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:30:00.000+02:00", "replies_count": 0, "uuid": "97be9cc699451ceaa4aca98d22500936a8669f83"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-solitude-lake-management-officially-announces-expansion-merger-with-lake-masters.html", "ord_in_thread": 0, "title": "SOLitude Lake Management Officially Announces Expansion, Merger With Lake Masters", "locations": [], "entities": {"persons": [], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "lake masters fort myers", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "lake masters", "sentiment": "none"}], "organizations": [{"name": "lake masters aquatic weed control inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FORT MYERS, Fla., Jan. 9, 2018 /PRNewswire/ -- SOLitude Lake Management ® , a leading environmental firm specializing in lake, pond, wetland and fisheries management services and related environmental solutions, has expanded its national presence by uniting with Lake Masters Aquatic Weed Control Inc. based in Florida.\nThe leading provider of algae and aquatic weed control services in Florida, Lake Masters was founded in 1998 to deliver superior lake, pond, wetland and upland preserve expertise. Known for providing value-based services and embracing family-based cultures, SOLitude and Lake Masters find common ground in their ability to serve clients with a variety of premier aquatic and fisheries services.\nThe alignment of the two companies under the SOLitude brand will foster an unparalleled focus on environmental responsibility, superior service offerings, broadened expertise, increased training and development efforts, enhanced technology and additional educational resource offerings to stakeholders in Florida—all while continuing to provide clients with the high level of customer service and performance they have come to know and expect.\nSOLitude welcomes 84 staff members from seven facilities across Florida, including locations in Fort Myers, Fort Lauderdale, Palm City, West Palm Beach, Orlando, Tampa and Melbourne. The team brings with them expanded knowledge of the local community, public waterways and sustainable aquatic management solutions that promote healthy, vibrant ecosystems.\n\"We couldn't be happier to welcome the Lake Masters team to the SOLitude family,\" said Kevin Tucker, CEO of SOLitude Lake Management. \"They've always made it a priority to deliver high-quality solutions, and together we look forward to exceeding the ever-evolving needs of our Florida clients and the local environment.\"\n\"We are excited to join forces with SOLitude and carry on our commitment to environmental stewardship,\" said Bill Kurth, Regional Director of SOLitude's newest market. \"This is a win-win opportunity for all that has allowed us to grow and improve upon what each company built over several decades.\"\nLearn about Lake Masters' journey and transition to SOLitude at www.solitudelakemanagement.com/LMJourney\nSOLitude currently offers services in 33 states, to include freshwater and fisheries management programs, algae and aquatic weed control, mechanical harvesting, hydro-raking, installation and maintenance of fountains and aeration systems, water quality testing and restoration, bathymetry, vegetation studies, biological assessments, habitat assessments, invasive species management and nuisance wildlife management. Services, consulting and aquatic products are available to clients nationwide, including homeowners associations, multi-family and apartment communities, golf courses, commercial developments, ranches, private landowners, reservoirs, recreational and public lakes, municipalities, parks, and state and federal agencies. Learn more at www.solitudelakemanagement.com/services\nMedia Contact:\nTracy Fleming\n888-480-5253\n188451@email4pr.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/solitude-lake-management-officially-announces-expansion-merger-with-lake-masters-300579758.html\nSOURCE SOLitude Lake Management", "external_links": ["http://www.solitudelakemanagement.com/services", "http://www.solitudelakemanagement.com/LMJourney", "http://www.prnewswire.com/news-releases/solitude-lake-management-officially-announces-expansion-merger-with-lake-masters-300579758.html"], "published": "2018-01-09T16:30:00.000+02:00", "crawled": "2018-01-09T17:40:10.003+02:00", "highlightTitle": ""}