{"organizations": [], "uuid": "f3cf4b259e1006705b0c050245a28f393bc6c6ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220277698&w=1200&r=LYNXMPEE070VM", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-germany-crime-soccer/germany-investigates-shots-fired-at-german-turkish-soccer-players-car-idUSKBN1EX1CE", "country": "US", "domain_rank": 408, "title": "Germany investigates shots fired at German-Turkish soccer player's car", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:05:00.000+02:00", "replies_count": 0, "uuid": "f3cf4b259e1006705b0c050245a28f393bc6c6ec"}, "author": "", "url": "https://www.reuters.com/article/us-germany-crime-soccer/germany-investigates-shots-fired-at-german-turkish-soccer-players-car-idUSKBN1EX1CE", "ord_in_thread": 0, "title": "Germany investigates shots fired at German-Turkish soccer player's car", "locations": [], "entities": {"persons": [{"name": "naki", "sentiment": "none"}, {"name": "johannes dimroth", "sentiment": "none"}, {"name": "deniz naki", "sentiment": "none"}, {"name": "tayyip erdogan", "sentiment": "none"}, {"name": "katja schlenkermann-pitts", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "aachen", "sentiment": "none"}], "organizations": [{"name": "pkk", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "die welt", "sentiment": "none"}, {"name": "kurdistan workers party", "sentiment": "none"}, {"name": "interior ministry", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 2:01 PM / Updated 8 minutes ago Germany investigates shots fired at German-Turkish soccer player's car Reuters Staff 3 Min Read \nBERLIN (Reuters) - German prosecutors are investigating shots fired at the car of a German-Turkish soccer player who was an outspoken critic of Turkish President Tayyip Erdogan, while he was driving near the west German city of Aachen late on Sunday, the prosecutors said on Monday. \nDeniz Naki, 28 was given a suspended sentence of 18 months by a Turkish court in April 2017 for “terrorist propaganda” in support of the Kurdistan Workers Party (PKK). He told Die Welt newspaper he assumed the shots were fired by a Turkish agent or someone else who opposed his views. \nKatja Schlenkermann-Pitts, a senior prosecutor in Aachen, said authorities were investigating the incident as an attempted homicide, but said her office could not confirm Naki’s concerns. She said prosecutors were looking “in all directions.” \nThe Interior Ministry had no information on the case, spokesman Johannes Dimroth told a regular government news conference. He said he had no doubt that Naki’s statements would be addressed by prosecutors as part of the investigation. \nThe incident occurred around 11 p.m. on the A4 highway near the town of Dueren, where Naki grew up, as he was returning home after visiting a friend. FILE PHOTO: FC St. Pauli's Deniz Naki celebrates a goal during the German Bundesliga second division soccer match against Greuther Fuerth in Fuerth, Germany, May 2, 2010. REUTERS/Michaela Rehle/File Photo \nIt comes as the German and Turkish foreign ministers are trying to improve difficult relations following Ankara’s crackdown after an abortive coup attempt in 2016 and the arrests of German citizens in Turkey. \nTurkey has repeatedly accused Germany of failing to crack down on supporters of PKK - which it calls a “terrorist organisation” -in Germany, which is home to about three million people of Turkish descent. Germany, for its part, is investigating possible spying by Turkish intelligence agents. Slideshow (2 Images) \nHundreds of militants, security force members and civilians have been killed in Turkey since the collapse of a ceasefire between the Turkish army and PKK in 2015, reviving a conflict that has killed 40,000 since 1984. \n“I could have died,” Naki told the newspaper. “It was so close. I was scared to death.” He said the shots were fired from a black station wagon that was diagonally behind him, and two bullets struck his car.Naki, who said he frequently received menacing messages on social media, vowed not to let the shooting incident stop him from speaking out against the Turkish government. He said he had not received any specific threats in recent weeks. \nNaki, a former national youth soccer player for Germany, now plays for a Kurdish team in Turkey. Reporting by Thorsten Severin, Sabine Siebold and Andrea Shalal, editing by Larry King", "external_links": [], "published": "2018-01-08T16:05:00.000+02:00", "crawled": "2018-01-08T16:12:55.023+02:00", "highlightTitle": ""}