{"organizations": [], "uuid": "59ee14137afe34aea0b1a1553661acbeab8a6849", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224423121&w=1200&r=LYNXMPEE0M0GX", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-singapore-taxes-analysis/as-singapore-ages-low-tax-model-creaks-idUSKBN1FC0TP", "country": "US", "domain_rank": 408, "title": "As Singapore ages, low tax model creaks", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.815, "site_type": "news", "published": "2018-01-23T16:33:00.000+02:00", "replies_count": 0, "uuid": "59ee14137afe34aea0b1a1553661acbeab8a6849"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-singapore-taxes-analysis/as-singapore-ages-low-tax-model-creaks-idUSKBN1FC0TP", "ord_in_thread": 0, "title": "As Singapore ages, low tax model creaks", "locations": [], "entities": {"persons": [], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "institute of policy studies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SINGAPORE (Reuters) - Beneath its modern and glitzy exterior, Singapore is aging. For the first time in its short history, the Southeast Asian nation is expected to have as many people aged 65 and older as under 15 this year, a demographic crux that challenges the low-tax economic model that helped transform Singapore from port town to financial hub in a matter of decades.\nTop government officials have been signaling the need for higher taxes to support future social spending, and with the country forecasting a primary deficit in 2017 that would be the largest in at least 16 years, changes are expected as soon as the budget on Feb. 19.\nThe city-state has some of the lowest tax rates in the world, with room to adjust parts without risking its competitiveness, but not even its citizens, who stand to be better supported by welfare changes, welcome higher taxes.\nA recent study by the Institute of Policy Studies (IPS) showed Singaporeans would rather the government dip into its national reserves than raise taxes.\nBut economists say things will have to change in a country which has one of the highest life expectancies and lowest fertility rates in the world and marginal increases to the likes of the goods and services tax this year may only be the start of a longer-term rethink.\n“People will recognize this period as a period of shifting sands...when things started making the initial shifts,” said Vishnu Varathan, head of economics and strategy for Mizuho Bank in Singapore.\n“This is when they would have felt the tremors coming through to shake-up the tax structure a little bit.”\nThe city-state’s population of seniors is expected to double by 2030, straining the government’s budget for healthcare.\nThe IPS estimates the aging trend represents a drag of 1.5 percentage points on Singapore’s annual GDP per capita growth from 2011 to 2060.\nCHANGE AFOOT One of the reasons the tax issue has come to the fore in Singapore is because efforts to boost productivity have been slow to bear fruit.\nWith restrictions on foreign labor, Singapore has championed investment in automation and artificial intelligence to help gear its economy toward higher-value-added industries with strong productivity growth. But this transition takes time.\nLabor productivity growth was flat around 1-1.5 percent in the years 2013 through 2016, having been at nearly 10 percent in 2010.\nMeanwhile Singapore’s tax revenue, as a percentage of economic output, is below the average of other high income countries, World Bank data shows.\nAs a result, the government is projecting a primary budget deficit of S$5.62 billion ($4.3 billion) in 2017. If realized, that would be the largest since at least 2001 when changes to the classification of some items were brought in.\nSingapore’s projected and realized primary budget balance has often varied and in 2016 the deficit was about half of what was projected.\nTax changes are already happening. An increase in the top rate of income tax from 20 to 22 percent was announced in the 2015 budget and has already kicked in.\nFinance Minister Heng Swee Keat told an IPS forum on Monday that without increased revenue from the country’s reserves in recent years, some taxes could have doubled.\nChanges to the goods and services tax (GST) - which in FY2016/17 accounted for nearly a quarter of total tax revenues - would further firm up government finances.\nEconomists are expecting a rise to 8 or 9 percent from 7 percent, to be announced at the budget - the first hike in a decade.\nA man reads a newspaper as others play checkers in Singapore January 16, 2018. Picture taken January 16, 2018. REUTERS/Calvin Wong And there could be more rises in GST in the years to come.\nA fictional account of a budget in 2065, penned by current central bank governor Ravi Menon in 2015, saw the GST rate raised to 14 percent. Menon said his article did not reflect the views or projections of the Monetary Authority of Singapore.\nThe finance ministry did not immediately respond to a request for comment on expectations for a rise in taxes.\nWhile tax hikes tend to be unpopular with voters, Singapore’s government has until January 2021 to hold its next general election.\nSian Fenner, senior Asia economist at Oxford Economics, said over the next five to seven years there could also be more changes to income taxes, while others have pointed to the possibility of wealth taxes, estate duties, property gains tax or even something more novel such as a sugar tax.\nSingapore’s three main taxes - corporate, income and GST - are relatively low by international standards, but it has stiff taxes on alcohol, tobacco and motor vehicles.\nOne tax unlikely to rise is corporate tax, experts say. At 17 percent, Singapore’s headline corporate tax rate is already slightly above that of its closest rival Hong Kong.\nSlideshow (6 Images) “Singapore will be trying to make sure that whilst it is able to meet its own requirements in terms of fiscal revenue, it is also not killing what has made Singapore such a special place,” said Richard Mackender, a tax partner at Deloitte.\nFor a graphic on Singapore's tax revenues as percentage of GDP lag global average, click reut.rs/2DECkL0\nFor a graphic on Singapore's ageing demographics, click reut.rs/2Di9BuA\nFor a graphic on consumption taxes, click tmsnrt.rs/2Djxwtq\nSTRUCTURAL CHALLENGES Credit ratings agencies have flagged the “structural economic and fiscal costs” related to Singapore’s rapidly aging population, but the three main firms have kept their top Triple-A ranking, in part due to its vast sovereign wealth.\nThe government has other sources of revenue such as returns on assets managed by its sovereign funds. It can also dip into its historical reserves, although this is protected by the Constitution and requires Presidential approval.\nThe government says its overall budget balance - taking into account other sources of revenue - is estimated to be a surplus of S$1.9 billion in 2017.\nBut the longer term structural challenges remain.\nThe Institute of Policy Studies projects that Singapore’s old-age dependency ratio, having been just under nine elder Singaporeans for every 100 persons of working age persons in 1980, will rise to 91 elder per 100 workers by 2080.\n“As expenditure on social needs rise, given the country’s demographic trajectory, there is however a recognition that tax revenues will have to rise in tandem,” the IPS study said.\n($1 = 1.3187 Singapore dollars)\nEditing by Jacqueline Wong\n ", "external_links": ["http://tmsnrt.rs/2Djxwtq", "http://thomsonreuters.com/en/about-us/trust-principles.html", "http://reut.rs/2Di9BuA", "http://reut.rs/2DECkL0"], "published": "2018-01-23T16:33:00.000+02:00", "crawled": "2018-01-24T15:32:04.006+02:00", "highlightTitle": ""}