{"organizations": [], "uuid": "68066fe1b4ff92665c10d36e80342c94ea51ec34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-euro-zone-yields-flat-as-euro-surge-blunts-inflation-bets-ahead-of-ecb-meet-idUSL8N1PK2V9", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Euro zone yields flat as euro surge blunts inflation bets ahead of ECB meet", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T19:16:00.000+02:00", "replies_count": 0, "uuid": "68066fe1b4ff92665c10d36e80342c94ea51ec34"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-euro-zone-yields-flat-as-euro-surge-blunts-inflation-bets-ahead-of-ecb-meet-idUSL8N1PK2V9", "ord_in_thread": 0, "title": "UPDATE 1-Euro zone yields flat as euro surge blunts inflation bets ahead of ECB meet", "locations": [], "entities": {"persons": [{"name": "abhinav ramnarayan", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Euro zone yields flat as ECB meets on Thursday\n* Spanish Portuguese bond yield spreads tightest in years\n* Euro scales $1.24, denting inflation expectations\n* Euro zone periphery govt bond yields tmsnrt.rs/2ii2Bqr (recasts price moves, adds Quote: , updates prices)\nBy Abhinav Ramnarayan\nLONDON, Jan 25 (Reuters) - Euro zone government bond yields were largely steady ahead of a European Central Bank meeting, on expectations a surging euro would hamper inflation and make it hard for policymakers to withdraw stimulus quickly.\nYields on most euro zone government bonds, particularly the higher-rated ones, have risen in recent weeks as a booming euro zone economy fuels inflation expectations and on bets the ECB would withdraw its 2.55 trillion euro bond-buying scheme and hike rates sooner rather than later.\nBut a strengthening euro is weakening that trend; a stronger currency tends to pull consumer prices lower as import costs are reduced.\nThe single currency scaled $1.24 overnight for the first time in over three years, crowning a stellar rise over the past 2-1/2 months from $1.1608 in the first week of November.\nA market gauge of inflation expectations closely watched by the ECB, the five-year five-year forward breakeven rate , closed on Wednesday at 1.765 percent, down from 1.78 percent earlier in the week.\nThis has prompted investors to bet that the ECB will strike a more cautious tone when it meets later on Thursday on potential rate rises and withdrawal of its bond-buying scheme.\n“A stronger euro will shave off a couple of points off the ECB’s inflation forecasts in March – and therefore it undermines the hawks in the ECB,” said ING chief economist Carsten Brzeski.\n“This is why they have to stick to a very cautious balance in the messaging at today’s meeting.”\nAnalysts said ECB President Mario Draghi could use the press conference that follows the meeting to stress that the euro appreciation has been in excess of what is warranted by fundamentals, or to push back against rate hike expectations.\nEuro zone bond yields - which move inversely to price - edged down in early trades on Thursday, but were largely flat by midday.\nThe yield on Germany’s 10-year government bond , the benchmark for the region, was steady at 0.527 percent, some way off the five-month high of 0.54 percent hit in early January.\nLow-rated Spanish, Italian and Portuguese government bonds, seen as the biggest beneficiaries of ECB largesse, slightly outperformed the rest of the market with yields down 1-2 basis points (bps).\nThe Portugal-Germany bond yield spread at one stage was at its tightest since March 2010 at 116.5 bps while the equivalent Spain-Germany spread was its tightest since April 2010 at 83 bps.\n“The most interesting thing for this meeting will be exactly how they are going to try and clarify some of their comments that came out after the December minutes that were interpreted as hawkish,” said Alessio de Longis, portfolio manager for OppenheimerFunds’ global multi-asset group.\n“The ECB will be mostly focused on managing the rise in bond yields and the rise in the currency, because both of them will lead to a tightening in financial conditions that will occur before they get to an actual exit strategy.”\nReporting by Abhinav Ramnarayan; Additional reporting by Fanny Potkin; Editing by William Maclean and Mark Potter\n ", "external_links": ["http://tmsnrt.rs/2ii2Bqr", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T19:16:00.000+02:00", "crawled": "2018-01-26T21:08:18.002+02:00", "highlightTitle": ""}