{"organizations": [], "uuid": "2b630b36cb17cf0db6f21da645f86d363867102f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-goldcorp-achieves-2017-production-and-cost-guidance-202020-plan-on-track.html", "country": "US", "domain_rank": 767, "title": "Goldcorp Achieves 2017 Production and Cost Guidance; 20/20/20 Plan on Track", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.047, "site_type": "news", "published": "2018-01-16T14:00:00.000+02:00", "replies_count": 0, "uuid": "2b630b36cb17cf0db6f21da645f86d363867102f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-goldcorp-achieves-2017-production-and-cost-guidance-202020-plan-on-track.html", "ord_in_thread": 0, "title": "Goldcorp Achieves 2017 Production and Cost Guidance; 20/20/20 Plan on Track", "locations": [], "entities": {"persons": [{"name": "david garofalo", "sentiment": "none"}], "locations": [{"name": "us vancouver", "sentiment": "none"}], "organizations": [{"name": "goldcorp", "sentiment": "negative"}, {"name": "goldcorp inc.", "sentiment": "negative"}, {"name": "aisc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TSX: G NYSE: GG\nAll amounts in $US\nVANCOUVER, Jan. 16, 2018 /PRNewswire/ - GOLDCORP INC. (TSX: G, NYSE: GG) (\"Goldcorp\" or the \"Company\") is pleased to report its preliminary gold production for the fourth quarter and full year 2017 of 646,000 and 2,569,000 ounces, respectively, exceeding the midpoint of gold production guidance of 2,500,000 ounces. All-in sustaining costs (\"AISC\") for the full year are expected to be in line with the improved midpoint guidance of $825 per ounce. Goldcorp's complete 2017 financial results will be released on February 14, 2018. 1,2\n\"Since we restructured our business during the first half of 2016 to drive a culture of accountability and sound operating principles, we have delivered consistent, predictable and low-cost gold production,\" said David Garofalo, President and Chief Executive Officer of Goldcorp. \"We are well underway to deliver on our 5-year plan of growing gold production and gold reserves by 20% and reducing AISC by 20% by 2021. With the most robust growth pipeline among global senior gold companies, we are making an initial investment of $100 million in our long-term portfolio 'Beyond 20/20' . Together with an enhanced exploration budget of $125 million, the objective of Beyond 20/20 is to maximize the net asset value of our existing mines and projects by continuing to grow low-cost gold production from our growing gold reserves.\"\nGoldcorp will host its Investor Day on Tuesday, January 16, 2018 at 8:00am Eastern Time. The Company will provide a detailed update of its 20/20/20 plan, its exploration program and Beyond 20/20. The event will be available by webcast at www.goldcorp.com .\n2018 Guidance in line with 20/20/20 plan 2\nGoldcorp expects to produce 2.5 million ounces (+/- 5%) of gold in 2018, in line with previous guidance; AISC are expected to decline further to approximately $800 per ounce (+/- 5%) as the Company continues to realize savings from its program targeting $250 million of annual sustainable efficiencies.\nThe Company's 20/20/20 plan remains unchanged. As previously guided, gold production is expected to increase 20% to 3 million ounces by 2021. AISC are expected to decrease by 20% to approximately $700 per ounce over the same period driven by increased gold production and the ongoing focus on cost efficiencies and productivity improvements. Building on the successful conversion of 4.7 million ounces of gold into reserves at the Century project in 2017, gold reserves are expected to increase by 20% to 60 million ounces by 2021 supported by the exploration potential and ongoing programs at Coffee, Norte Abierto (formerly Cerro Casale/Caspiche), Cerro Negro and Pueblo Viejo.\nComplete production and cost guidance to 2021 is provided below. For more detailed guidance on mines and projects, please refer to our website at www.goldcorp.com .\n20/20/20 Outlook\nProduction (+/- 5%)\nUnits\n2018E\n2019E\n2020E\n2021E\nGold Production 1,2\nMoz\n2.5\n2.7\n3.0\n3.0\nSilver Production 1,2\nMoz\n30\n50\n40\n35\nZinc Production 1,2\nMlbs\n300\n425\n450\n400\nLead Production 1,2\nMlbs\n160\n300\n250\n150\nGold Equivalent Production 1,2\nMoz\n3.3\n4.0\n4.1\n4.1\nCosts (+/- 5%)\nAISC 1,2,3,4\n$/oz\n800\n750\n700\n700\nBy-product Cash Costs 1,2,5\n$/oz\n450\n400\n400\n400\nCapital Expenditures (+/- 5%)\nSustaining Capital 1,2,6\n$M\n550\n575\n575\n575\nGrowth Capital 1,2,6\n$M\n525\n250\n300\n300\nUnspent 2017 Pyrite Leach Project Capital 1\n$M\n125\n-\n-\n-\nBeyond 20/20 Capital 1,2,7\n$M\n100\n-\n-\n-\nOther 2018 Financial Estimates\nCorporate Administration ($M) 1 (including non-cash stock compensation of $40M)\n$140\nExploration Investment ($M) 1,2,8\n$125\nDepreciation ($/oz) 1,2\n$485\nTax rate (%) 1,2\n40 – 45%\nFootnotes\nGuidance projections used in this document (\"Guidance\") are considered \"forward-looking statements\" and represent management's good faith estimates or expectations of future production results as of the date hereof. Guidance is based upon certain assumptions, including, but not limited to, metal prices, oil prices, certain exchange rates and other assumptions. 2018-2019 guidance assumes Au=$1,300/oz, Ag=$19.00/oz, Cu=$2.75/lb, Zn=$1.30/lb, Pb=$1.10/lb, $1.25 CAD/USD, 19.00 MXN/USD. 2020-2021 guidance assumes Au=$1,300/oz, Ag=$18.00/oz, Cu=$3.00/lb, Zn=$1.15/lb, Pb=$1.00/lb, $1.25 CAD/USD, 19.00 MXN/USD. Such assumptions may prove to be incorrect and actual results may differ materially from those anticipated. Consequently, Guidance cannot be guaranteed. As such, investors are cautioned not to place undue reliance upon Guidance and forward-looking statements as there can be no assurance that the plans, assumptions or expectations upon which they are placed will occur.\nThe Company has included certain performance measures, including non-GAAP performance measures, in this release, which have been calculated on an attributable (or Goldcorp's share) basis. Attributable performance measures include the Company's mining operations and projects, and the Company's share of Pueblo Viejo, Alumbrera, Leagold and NuevaUnión. The Company believes that disclosing certain performance measures on an attributable basis is a more relevant measurement of the Company's operating and economic performance, and reflects the Company's view of its core mining operations. The Company believes that, in addition to conventional measures prepared in accordance with GAAP, the Company and certain investors use this information to evaluate the Company's performance and ability to generate cash flow; however, these performance measures do not have any standardized meaning. Accordingly, it is intended to provide additional information and should not be considered in isolation or as a substitute for measures of performance prepared in accordance with GAAP.\nThe Company's projected all-in sustaining costs are not based on GAAP total production cash costs, which forms the basis of the Company's by-product cash costs. The projected range of all-in sustaining costs is anticipated to be adjusted to include sustaining capital expenditures, corporate administrative expense, mine-site exploration and evaluation costs and reclamation cost accretion and amortization, and exclude the effects of expansionary capital, tax payments, dividends and financing costs. Projected GAAP total production cash costs for the full year would require inclusion of the projected impact of future included and excluded items, including items that are not currently determinable, but may be significant, such as sustaining capital expenditures, reclamation cost accretion and amortization and tax payments. Due to the uncertainty of the likelihood, amount and timing of any such items, we do not have information available to provide a quantitative reconciliation of projected all-in sustaining costs to a total production cash costs projection.\nAll-in sustaining costs is a non-GAAP performance measure that the Company believes more fully defines the total costs associated with producing gold; however, this performance measure has no standardized meaning. Accordingly, it is intended to provide additional information and should not be considered in isolation or as a substitute for measures of performance prepared in accordance with GAAP. The Company reports this measure on a gold ounces sold basis. The Company's all-in sustaining cost definition follows the guidance note released by the World G", "external_links": ["http://www.goldcorp.com/"], "published": "2018-01-16T14:00:00.000+02:00", "crawled": "2018-01-16T17:05:49.000+02:00", "highlightTitle": ""}