{"organizations": [], "uuid": "a76f081134da679af9cbaeb1f576656c4c0a7e6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-oil-cashflow/big-oil-flush-with-cash-again-but-no-party-yet-idUSKBN1FD1YB", "country": "US", "domain_rank": 408, "title": "Big Oil flush with cash again, but no party yet", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:16:00.000+02:00", "replies_count": 0, "uuid": "a76f081134da679af9cbaeb1f576656c4c0a7e6b"}, "author": "", "url": "https://www.reuters.com/article/us-oil-cashflow/big-oil-flush-with-cash-again-but-no-party-yet-idUSKBN1FD1YB", "ord_in_thread": 0, "title": "Big Oil flush with cash again, but no party yet", "locations": [], "entities": {"persons": [{"name": "ron bo", "sentiment": "negative"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 2:20 PM / in a few seconds Big Oil flush with cash again, but no party yet Ron Bousso 5 Min Read \nLONDON (Reuters) - The world’s top oil companies are expected to generate more cash in 2018 than at any other time this decade after three painful years of cuts, but it isn’t party time yet. \nThe shift in sentiment has been rapid as crude prices have risen by more than 50 percent over the past six months to reach $70 a barrel, a level not seen since the crash year of 2014, thanks to global supply cuts led by OPEC. \nOnly a year ago, many investors still fretted over the sustainability of the sector’s lavish dividend payouts in a weak energy market. Now the focus on company boards is gradually switching from slashing jobs and investment to boosting shareholders’ returns and growth. \nWith memories of the 2014 price collapse still fresh and oil forecast to recover only slowly, frugality remains high on the agenda of boards and investors to ensure that the energy majors produce enough cash to pay dividends while reducing debt that ballooned during the downturn. \n“The companies will need to demonstrate over time that lower capital spending can be sustained and that their dividends will remain fully covered,” said Jonathan Waghorn, energy fund manager at Guinness Asset Management, which holds shares of Chevron, Total and BP. \n“We are cautiously optimistic on their ability to do this, given the dramatic cost reductions in the industry.” \nOil majors responded to the crisis by transforming their businesses, nearly halving spending, culling tens of thousands of jobs and diluting share value. \nIn 2017, most companies showed they can adapt to a world of lower prices and even generate thin profits with oil at $50-$55 a barrel, without borrowing. \nThis year, when prices are expected to hold around $60 a barrel, the majors will generate more cash than they did in 2011 when a barrel of crude traded at an average of $112, according to BMO Capital Markets analyst Brendan Warn. \nDutch Shell appears the strongest performer among the group in terms of organic free cash flow - money available to return to shareholders in dividends and share buybacks after deducting capital spending, excluding revenue from disposals. \nShell alone will account for a quarter of the roughly $80 billion of organic free cash flow that the top seven oil majors are expected to generate in 2018, Warn said. \nThis follows the Anglo-Dutch company’s scrapping at the end of last year of its scrip program. These allow investors to opt to receive dividends in shares, saving the companies cash upfront but diluting their earnings per share. \nShell’s organic free cash flow yield, the ratio between cash flow and market capitalization, is set to double in 2019 from 2011-2014 to 8.84 percent, according to BMO. \nThe comparative yield for Exxon, though a larger company than Shell, will be only 5.39 percent, BMO forecast. BP’s yield will rise in 2019 to 6.55 percent while that of Chevron will reach 7.16 percent. GROWTH \nThe priority for boards and many investors is boosting share value through buying back stock, reversing the years of dilution caused by the scrip programs. For Exxon and Chevron the focus will be more on boosting dividends. \n“With the scrips coming off and share buybacks to commence, we expect an uplift in shareholder distributions by around $24 billion, led by Shell,” Warn said \nExecutives will also try to reduce debt levels that soared in recent years as companies borrowed to maintain dividends. \n“The best use of excess fund flow now would be a little further debt reduction for those companies that need it, and then an end to the scrip dividend,” said Darren Sissons, partner and portfolio manager at Toronto-based Campbell, Lee & Ross Investment Management. \nWith whatever is left, Sissons expects boards to invest a “small but increasing allocation to growth initiatives” such as exploration for new oil and gas resources, renewables and chemicals. \nDespite the past cuts in exploration budgets, the majors’ output will increase until 2020 as projects approved during the boom years earlier in the decade come on stream. Thereafter, the outlook is less certain but chief executives have made clear their current focus is on raising returns, not volume. \nForecasts of a sharp rise in electric vehicle purchases have weighed on the long-term outlook for the oil companies, many of which are increasingly focusing on supplying gas to the power sector as well as making small investments in renewables. Reporting by Ron Bousso; editing by David Stamp", "external_links": [], "published": "2018-01-24T16:16:00.000+02:00", "crawled": "2018-01-24T16:34:02.002+02:00", "highlightTitle": ""}