{"organizations": [], "uuid": "7917dd9dfeebf51b558db39727d5bbdd06b682da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-893664998.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/23/sessions-mueller-russia/", "country": "US", "domain_rank": 1196, "title": "Sessions Interviewed by Mueller In Russia Investigation | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.198, "site_type": "news", "published": "2018-01-23T02:00:00.000+02:00", "replies_count": 0, "uuid": "7917dd9dfeebf51b558db39727d5bbdd06b682da"}, "author": "Grace Donnelly", "url": "http://fortune.com/2018/01/23/sessions-mueller-russia/", "ord_in_thread": 0, "title": "Sessions Interviewed by Mueller In Russia Investigation | Fortune", "locations": [], "entities": {"persons": [{"name": "robert mueller", "sentiment": "negative"}, {"name": "attor", "sentiment": "negative"}, {"name": "mueller", "sentiment": "negative"}, {"name": "jeff sessions", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "sergey i. kislyak", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Grace Donnelly January 23, 2018 \nSpecial counsel Robert Mueller’s office has confirmed that Attorney General Jeff Sessions was interviewed for several hours last week as part of the investigation into Russia’s interference in the 2016 presidential election and whether President Donald Trump has obstructed justice since taking office, a spokeswoman from the Justice Department told the New York Times . \nThis is the first time in the course of the investigation that the special counsel has questioned a member of Trump’s cabinet. \nSessions recused himself from the inquiry into the 2016 election in March following the news that he had failed to disclose to Congress that he met twice with Russian ambassador Sergey I. Kislyak during the campaign. Mueller was appointed to lead the investigation in May. It upset Trump so much that Sessions offered to resign, though the president rejected his offer several days later. \nThe attorney general is a key witness to both the Trump campaigns alleged ties to Russia and the president’s possible efforts to obstruct the Russia probe — the two major issues for Mueller and his team. \nSessions and Trump have clashed repeatedly, with the president publicly criticizing his attorney general in tweets and comments. Speculation about Session’s job security circulated again earlier this month after two conservative lawmakers called for his resignation based on a mishandling of the Justice Department and its investigation into Russian meddling. \nThe investigation has brought charges against four people close to President Trump so far: former national security adviser Michael Flynn, former campaign operative Paul Manafort, former foreign policy campaign aide George Papadopoulos, and Rick Gates, a member of Trump’s inaugural committee. \nSteve Bannon, former White House strategist and Trump’s 2016 campaign manager, have also agreed to be interviewed by the Mueller team, according to CNN . \n", "external_links": [], "published": "2018-01-23T02:00:00.000+02:00", "crawled": "2018-01-25T00:24:47.015+02:00", "highlightTitle": ""}