{"organizations": [], "uuid": "e11e03dc710d418d13da31a2fb678d82bb8b8a04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222822122&w=1200&r=LYNXMPEE0G1QF", "site_section": "http://feeds.reuters.com/reuters/peopleNews\r", "section_title": "Reuters: People News", "url": "https://www.reuters.com/article/us-people-sorrentino/jersey-shore-star-sorrentino-to-plead-guilty-in-tax-case-idUSKBN1F62S6", "country": "US", "domain_rank": 408, "title": "'Jersey Shore' star Sorrentino to plead guilty in tax case", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T22:17:00.000+02:00", "replies_count": 0, "uuid": "e11e03dc710d418d13da31a2fb678d82bb8b8a04"}, "author": "", "url": "https://www.reuters.com/article/us-people-sorrentino/jersey-shore-star-sorrentino-to-plead-guilty-in-tax-case-idUSKBN1F62S6", "ord_in_thread": 0, "title": "'Jersey Shore' star Sorrentino to plead guilty in tax case", "locations": [], "entities": {"persons": [{"name": "sorrentino", "sentiment": "negative"}, {"name": "marc", "sentiment": "none"}, {"name": "susan wigenton", "sentiment": "none"}, {"name": "henry klingeman", "sentiment": "none"}, {"name": "michael d‘alessio", "sentiment": "none"}, {"name": "jonathan stempel", "sentiment": "none"}, {"name": "michael sorrentino", "sentiment": "none"}, {"name": "marc sorrentino", "sentiment": "none"}, {"name": "michael", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "newark", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "mtv", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 8:18 PM / Updated 4 minutes ago 'Jersey Shore' star Sorrentino to plead guilty in tax case Jonathan Stempel 3 Min Read \n(Reuters) - Former reality TV celebrity Michael “The Situation” Sorrentino is expected to plead guilty in a tax evasion case where U.S. prosecutors accused him and his brother of hiding millions of dollars he made while starring in the MTV series “Jersey Shore.” \nIn a letter dated Wednesday, prosecutors said Sorrentino and his brother Marc “have agreed to plead guilty,” and will enter their pleas on the morning of Jan. 19 before U.S. District Judge Susan Wigenton in Newark, New Jersey. \nThe pleas avert a trial scheduled to begin on Feb. 8. \nBoth brothers faced nine criminal charges, including alleged conspiracy to defraud the United States. It was not immediately clear which charges they will plead guilty to. \nHenry Klingeman, a lawyer for Michael Sorrentino, confirmed the hearing schedule but declined further comment. Michael D‘Alessio, a lawyer for Marc Sorrentino, did not immediately respond to requests for comment. A spokesman for Interim U.S. Attorney Craig Carpenito in New Jersey declined to comment. \n“Jersey Shore” ran from 2009 to 2012, and featured young Italian-Americans partying, tanning and complaining about their jobs at a beachfront T-shirt stand. FILE PHOTO: Reality television personality Michael \"The Situation\" Sorrentino arrives at the 2011 American Music Awards in Los Angeles, California, U.S., November 20, 2011. REUTERS/Danny Moloshok/File Photo \nMichael Sorrentino, now 35, popularized the phrase “gym, tan, laundry” to describe the pre-party routine of cast members. \nProsecutors accused the Sorrentinos of trying to avoid taxes on $8.9 million of Michael Sorrentino’s income from 2010 to 2012, including by trying to label purchases of clothes, vehicles other personal items as business expenses. \nMichael Sorrentino also faced charges including filing a false return for his company Situation Nation Inc, and having, on several days, made multiple cash deposits of less than $10,000 in different bank accounts to avoid federal reporting requirements. \nThe brothers’ accountant, Gregg Mark, pleaded guilty in December 2015 to filing fraudulent tax returns on their behalf. Mark has yet to be sentenced, his lawyer Jack Arseneault said in an email. \nMichael Sorrentino faces a maximum 10 years in prison on two counts related to the bank deposits, and five years for alleged tax evasion. Marc Sorrentino faces up to 20 years in prison on a grand jury obstruction charge. \nThe case is U.S. v. Sorrentino et al, U.S. District Court, District of New Jersey, No. 14-cr-00558. Reporting by Jonathan Stempel in New York; Editing by Bernadette Baum", "external_links": [], "published": "2018-01-17T22:17:00.000+02:00", "crawled": "2018-01-17T22:44:01.000+02:00", "highlightTitle": ""}