{"organizations": [], "uuid": "7f90bb12476b6d0f6c5b88518e14fe49a0fa2ecd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-gryphon-investorsa-dessert-holdings-acquires-atlanta-cheesecake-company.html", "country": "US", "domain_rank": 767, "title": "Gryphon Investors‘ Dessert Holdings Acquires Atlanta Cheesecake Company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.144, "site_type": "news", "published": "2018-01-09T15:00:00.000+02:00", "replies_count": 0, "uuid": "7f90bb12476b6d0f6c5b88518e14fe49a0fa2ecd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-gryphon-investorsa-dessert-holdings-acquires-atlanta-cheesecake-company.html", "ord_in_thread": 0, "title": "Gryphon Investors‘ Dessert Holdings Acquires Atlanta Cheesecake Company", "locations": [], "entities": {"persons": [{"name": "lawler", "sentiment": "negative"}], "locations": [{"name": "build north america", "sentiment": "none"}, {"name": "mn", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "st. paul", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}, {"name": "ga", "sentiment": "none"}, {"name": "minn.", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "kennesaw", "sentiment": "none"}], "organizations": [{"name": "gryphon investors‘ dessert holdings acquires atlanta cheesecake company", "sentiment": "neutral"}, {"name": "atlanta cheesecake company", "sentiment": "none"}, {"name": "gryphon", "sentiment": "none"}, {"name": "dessert company st. paul", "sentiment": "none"}, {"name": "dessert holdings", "sentiment": "none"}, {"name": "gryphon investors to house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Combines with The Original Cakerie and Lawler's Desserts To Build North America’s Leading National Premium Dessert Company\nST. PAUL, Minn., VANCOUVER, British Columbia & LONDON, Ontario--(BUSINESS WIRE)-- Dessert Holdings, headquartered in St. Paul, MN, today announced that it has acquired Atlanta Cheesecake Company (“ACC”, “the Company”). Dessert Holdings is the holding company formed by private equity firm Gryphon Investors to house its premium dessert brands platform. Atlanta Cheesecake Company, founded in 1988, is based in Kennesaw, GA. ACC is a respected manufacturer of high-end frozen cheesecakes for in-store bakeries and frozen food sections at prominent grocery and club food stores in North America. Terms of the transaction were not disclosed.\nDessert Holdings plans to operate ACC alongside The Original Cakerie, which Gryphon acquired in December 2015, and Lawler’s Desserts, which Gryphon acquired in July 2016. The Original Cakerie is a leading manufacturer of high-quality frozen desserts for retail and foodservice customers across North America. Lawler’s Desserts is a manufacturer of gourmet cheesecakes, cakes and pies and does business with nationally-recognized restaurant chains, foodservice distributors and major grocery retailers.\nLike The Original Cakerie and Lawler’s Desserts, ACC will operate with its own brand and product lines as it continues to serve its customers’ needs. The ACC management team will remain in place and the company will retain its manufacturing facility in Kennesaw.\nDennis O’Brien, Partner at Gryphon, said, “Dessert Holdings is continuing to pursue a strategy of both organic growth and acquisitions, and ACC represents a strong strategic fit for our premium desserts platform. With the cheesecake category growing at approximately four percent annually, driven by premium products, ACC will help Dessert Holdings establish a critical position in this fragmented but exciting market segment. ”\n“ACC is a perfect complement to the other companies and brands in our platform, expanding our product offerings, geographic footprint, and retail customer network,” said Paul Lapadat, CEO of Dessert Holdings. \"I look forward to working with the ACC team as we continue to build the preeminent premium dessert company for the retail and foodservice industry across North America.”\nMeg Sapp, President of ACC, added, “As a family-owned business, it is so important to us that we have the respect of our customers and our community. We are confident that the team at Dessert Holdings shares our values and our commitment to delivering innovative desserts of the highest quality, and we look forward to a partnership that will bring Atlanta Cheesecake Company products to even more people.”\nAbout Atlanta Cheesecake Company\nAtlanta Cheesecake Company began as a family business in 1988 on the Van der Blom family farm in Anniston, Alabama. From its original offering – Granny Boozers Gourmet Cheesecake - the company has grown to offer over 140 dessert varieties today. The company now operates out of a 94,000 square foot facility in Kennesaw, Georgia and delivers products to well-known grocery retailers in North America. Atlanta Cheesecake Company is committed to the highest standards in food quality and safety, using the finest all-natural ingredients, and traditional scratch-baking techniques to guarantee decadent, delicious, down-home desserts every time.\nAbout Dessert Holdings\nDessert Holdings, based in St. Paul, Minnesota, is an umbrella company that consists of several premium dessert companies and brands: The Original Cakerie, Lawler’s Desserts and Atlanta Cheesecake Company. The Original Cakerie, founded in 1979, is a leading manufacturer of high-quality frozen desserts for retail and foodservice customers across Canada and the U.S. Lawler’s Desserts, a manufacturer of gourmet cheesecakes, layer cakes, pies and other premium desserts, is based in Humble, TX. Atlanta Cheesecake Company, headquartered in Kennesaw, GA, is a manufacturer of premium cheesecakes sold through the retail trade in the in-store bakery or frozen aisle. Together, the companies serve over 250 customers in Canada, the United States, Mexico and Europe. Dessert Holdings is a portfolio company of Gryphon Investors, a San Francisco-based middle market private equity firm.\nAbout Gryphon Investors\nBased in San Francisco, Gryphon Investors ( www.gryphoninvestors.com ) is a leading private equity firm focused on profitably growing and competitively enhancing middle-market companies in partnership with experienced management. For 20 consecutive quarters, Gryphon has been ranked in Preqin’s prestigious quarterly PE report as one of North America’s top-decile buyout firms based on consistency of strong investment returns. Managing over $2.6 billion of equity investments and capital since 1997, the firm has an extensive track record of leading equity investments of $50 million to $200 million per portfolio company in enterprises with sales ranging from approximately $100 million to $500 million. Gryphon prioritizes investment opportunities where it can form proactive partnerships with owners and executives to build leading companies, utilizing Gryphon’s capital, specialized professional resources, and operational expertise. Gryphon closed its fourth private equity buyout fund, Gryphon IV, in November 2016 at $1.1 billion, and raised a $100 million captive mezzanine fund, Gryphon Mezzanine Partners, in August 2017.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180109005640/en/\nOwen Blicksilver Public Relations\nCaroline Luz, 203-656-2829\ncaroline@blicksilverpr.com\nSource: Gryphon Investors", "external_links": ["http://www.businesswire.com/news/home/20180109005640/en/"], "published": "2018-01-09T15:00:00.000+02:00", "crawled": "2018-01-09T15:27:36.004+02:00", "highlightTitle": ""}