{"organizations": [], "uuid": "04182023a652409e2dd4dbad365bdd608c8a53b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-vietnam-security/vietnam-oil-executives-apologize-to-communist-party-in-corruption-trial-idUSKBN1F60R1", "country": "US", "domain_rank": 408, "title": "Vietnam oil executives apologize to Communist Party in corruption trial", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T09:52:00.000+02:00", "replies_count": 0, "uuid": "04182023a652409e2dd4dbad365bdd608c8a53b8"}, "author": "", "url": "https://www.reuters.com/article/us-vietnam-security/vietnam-oil-executives-apologize-to-communist-party-in-corruption-trial-idUSKBN1F60R1", "ord_in_thread": 0, "title": "Vietnam oil executives apologize to Communist Party in corruption trial", "locations": [], "entities": {"persons": [{"name": "trinh xuan thanh", "sentiment": "none"}, {"name": "dinh la thang", "sentiment": "none"}, {"name": "nguyen phu trong", "sentiment": "none"}, {"name": "nguyen tan dung", "sentiment": "none"}], "locations": [{"name": "vietnam", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "hanoi", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "communist party", "sentiment": "negative"}, {"name": "petrovietnam", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "petrovietnam construction", "sentiment": "none"}, {"name": "mi nguyen", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HANOI (Reuters) - Vietnamese executives on trial for losses at a scandal-hit state oil firm used their final statement in court on Wednesday to apologize to the ruling Communist Party, media said, as Vietnam’s biggest corruption trial for years draws to a close.\nThe trial of 22 former PetroVietam employees, which ends on Monday, is part of a crackdown on fraud and mismanagement that government critics say is politically motivated and targeting those close to former prime minister Nguyen Tan Dung.\nThe crackdown intensified last year after Dung lost a power struggle in 2016 against Communist Party General Secretary Nguyen Phu Trong.\nThe defendants included Dinh La Thang, a former politburo official and chairman of PetroVietnam, and Trinh Xuan Thanh, the former chairman of PetroVietnam Construction whom Germany accuses Vietnam of kidnapping from a Berlin park in a scene reminiscent of Cold War disappearances.\nDinh La Thang, the most senior Vietnamese politician to be put on trial in decades, said he would like to “bow and say sorry” to the Communist Party, to which he remained “absolutely loyal”, according to the VNExpress newspaper.\nThang, who faces 14 to 15 years in jail over allegations of deliberate misconduct, Quote: d an earlier comment from General Secretary Trong, who said officials accused of wrongdoings should be encouraged to correct their own mistakes instead of being “beaten to death”, VNExpress reported.\n“I trust the party leadership and the fair and objective judgment of the court,” Thang said.\nForeign media were not permitted to attend the trial.\nIn his final statement, Trinh Xuan Thanh also asked the People’s Court of Hanoi to send his apology to General Secretary Trong. Thanh faces a life sentence over allegations of misconduct and embezzlement.\n“The lawyers have said clearly that the evidence was fuzzy and conflicting,” the Phap Luat newspaper Quote: d Thanh as saying in reference to the charges.\nGermany says Thanh was seeking asylum there but was forcibly repatriated by Vietnam last August. Germany expelled two diplomats over the incident, but Vietnam says police arrested Thanh after he turned himself in voluntarily.\nIn his final statement, Thanh thanked prison officials for helping him gain the weight he lost at the start of his detention.\nIn a separate case linked to the crackdown on fraud and mismanagement, a fugitive Vietnamese tycoon Phan Van Anh Vu, 42, was arrested in Hanoi this month after being deported from Singapore. Vu, who was also trying to get to Germany, told his lawyers he worked for Vietnamese intelligence.\nEditing by James Pearson, Robert Birsel\n ", "external_links": [], "published": "2018-01-17T09:52:00.000+02:00", "crawled": "2018-01-17T10:15:23.000+02:00", "highlightTitle": ""}