{"organizations": [], "uuid": "dd2e2e582d0fcb21a57d045e1493dcf0aa7120b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 26}, "facebook": {"likes": 63, "shares": 63, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/23/104790117-Photo-Oct-23-2-10-35-PM.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/saudi-prince-alwaleed-says-corruption-detention-was-a-misunderstanding.html", "country": "US", "domain_rank": 767, "title": "Saudi Prince Alwaleed says corruption detention was a 'misunderstanding'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.749, "site_type": "news", "published": "2018-01-29T10:49:00.000+02:00", "replies_count": 0, "uuid": "dd2e2e582d0fcb21a57d045e1493dcf0aa7120b9"}, "author": "Holly Ellyatt", "url": "https://www.cnbc.com/2018/01/29/saudi-prince-alwaleed-says-corruption-detention-was-a-misunderstanding.html", "ord_in_thread": 0, "title": "Saudi Prince Alwaleed says corruption detention was a 'misunderstanding'", "locations": [], "entities": {"persons": [{"name": "alwaleed", "sentiment": "negative"}, {"name": "prince alwaleed bin talal", "sentiment": "negative"}], "locations": [{"name": "ritz-carlton", "sentiment": "none"}, {"name": "riyadh", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "12 Hours Ago | 02:39 \nSaudi Arabian billionaire businessman Prince Alwaleed bin Talal has been freed after a high-profile detention during a crackdown on corruption, describing his arrest as a \"misunderstanding.\" \nSpeaking to Reuters just ahead of his release Saturday , Alwaleed said that there were no charges against him following his arrest as part of a nationwide crackdown on corruption last November. \n\"There are no charges. There are just some discussions between me and the government. Rest assured this is a clean operation that we have and we're just in discussion with the government on various matters that I cannot divulge right now. But rest assured we are at the end of the whole story. And I'm very comfortable because I'm in my country, I'm in my city, so I feel at home. It's no problem at all. Everything's fine,\" he said. \nThe interview, given from his suite in the Ritz-Carlton hotel in Riyadh where he and many other of the detainees had been kept for the last two months , was the first that the prince had given since being detained. $100 billion embezzlement \nIn the November crackdown, the Saudi government arrested and detained several hundred businessmen, senior officials and Saudi royals like Alwaleed, many within the Ritz-Carlton hotel. Multiple reports, citing anonymous sources, have suggested that detainees handed over assets in order to buy their freedom. \nAlwaleed, the billionaire owner of international investment company Kingdom Holding, told Reuters that he had accepted the interview request with the news agency because he was upset by media reports that had suggested he'd been sent to prison and tortured. \"All lies. It's very unfortunate,\" he said. \nThe crackdown was overseen by Saudi Crown Prince Mohammed bin Salman who is leading a reform drive in the country aimed at diversifying the economy away from oil and reforming Saudi society. show chapters 8:09 AM ET Wed, 24 Jan 2018 | 02:24 \nSaudi's Attorney General said in November that the government estimated that \"at least $100 billion has been misused through systematic corruption and embezzlement over several decades\" and said 208 individuals had been arrested as part of the crackdown, with seven released without charge. \nSpeaking to CNBC at the World Economic Forum (WEF) in Davos, Saudi Finance Minister Mohammed Al-Jadaan was asked whether the government had recovered any of the $100 billion. \n\"Did we recover $100 billion? I can't comment on that. Did we recover some of that? Yes. And I have said it previously, we are using some of it. And by the way these are very smart people and they don't leave cash in their bank accounts. We are unlikely to recover cash in a significant amount in the short term … We have recovered some cash and we are using it to finance the recent allowances (to state employees) that were announced by the King earlier this month.\" Unknown financial settlement \nAsked what kind of financial settlement was being discussed to ensure his release, Alwaleed told Reuters that there was \"not necessarily\" a settlement but added that he couldn't divulge any information as to the terms of his release. However, he said that a Bloomberg report that the government wanted a \"big percentage of Kingdom Holding and would like to get $6 billion\" was false. \nShares of the Riyadh-listed company jumped to its 10 percent daily limit in an unusually active session on Sunday. Alwaleed told Reuters the company would remain under his ownership and that no assets would be transferred to the state . show chapters 11 Hours Ago | 01:17 \nAsked what the accusations had been against him, Alwaleed gave a broad answer. \n\"Look, I'm a high-profile person: nationally, regionally and internationally, correct? I'm involved in so many projects. I have nothing to hide at all. I'm so comfortable, I'm so relaxed. I shave here, like at home … All the discussions are in general terms. I told the government I'd stay as much as they want, because I want the truth to come out on all my dealings and on all things that are around me.\" \nAsked which dealings the government had said were inappropriate, Alwaleed said: \"There is nothing to do with inappropriate or appropriate. Everything was appropriate.\" ", "external_links": [], "published": "2018-01-29T10:49:00.000+02:00", "crawled": "2018-01-29T10:49:45.001+02:00", "highlightTitle": ""}