{"organizations": [], "uuid": "f387ad6d82e30341cebc5a34559b1e37337ddbeb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/03/104927017-GettyImages-897614888.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/03/china-newspaper-peoples-daily-bashes-bitcoin-talks-bubble.html", "country": "US", "domain_rank": 767, "title": "China newspaper People's Daily bashes bitcoin, talks 'bubble'", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T04:51:00.000+02:00", "replies_count": 0, "uuid": "f387ad6d82e30341cebc5a34559b1e37337ddbeb"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/03/china-newspaper-peoples-daily-bashes-bitcoin-talks-bubble.html", "ord_in_thread": 0, "title": "China newspaper People's Daily bashes bitcoin, talks 'bubble'", "locations": [], "entities": {"persons": [{"name": "wei liang", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}], "organizations": [{"name": "communist party", "sentiment": "negative"}, {"name": "people's daily", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "China's ruling Communist Party mouthpiece lashed out at bitcoin on Wednesday, labelling the volatile cryptocurrency a bubble and a modern-day tulip mania.\nA People's Daily commentary written under the name \"Wei Liang\" said it was an established fact that bitcoin was a bubble.\n\"Irrespective of whether it is assessed on price or value, bitcoin is flooded with froth,\" it said. \"Its so-called advantages – scarcity, authenticity, strong liquidity, transparency and decentralisation – are only covers for speculation and cannot support its volatile price.\"\nIt said bitcoin's bubbles were created by a combination of hype, mystery, decentralisation and possible insider trading, suggesting that a small group of bitcoin owners were speculating on its price and manipulating general investors.\nThe commentary compared bitcoin to the seventeenth century mania in which prices for tulip bulbs skyrocketed and then collapsed . It also said there would be more \"bubble breaking\" in bitcoin after governments around the world tightened regulation.\nThe central government sees bitcoin as a source of risk. It banned domestic cryptocurrency exchanges last year after failing to regulate the fast growth of initial coin offerings, the virtual currency equivalent of an initial public offering.\nMore from the South China Morning Post :\nChina's bitcoin crackdown raises cryptocurrency demand as they move to peer-to-peer platforms\nBitcoin's all the rage with millennials but it's certainly no passing fad\nBitcoin bubble embodies our bipolar year of optimism and doubt\nThe assessment in the party mouthpiece comes after a roller-coaster ride for bitcoin last year – its price ballooned by about 20 times during the year but also plunged 40 per cent in one day .\nIn December, it rocketed to near US$20,000 and briefly plunged below US$13,000 at least twice, according to Coinbase, one of the world's biggest bitcoin exchanges.\nBitcoin investors are on alert to see whether Beijing will take further action against cryptocurrencies, such as shutting down bitcoin \"mines\", the energy-hungry operations that create bitcoin by solving mathematical problems using vast banks of computers.\nChina's crackdown has so far appeared to have little effect on bitcoin's price, with investors from neighbouring South Korea and Japan taking over in the trade where Chinese investors left off.\nChinese investors have also taken to unregulated peer-to-peer exchanges, where sellers and buyers of bitcoin negotiate prices on a one-on-one basis.\nThere were just four such platforms in October after the crackdown, but the number had risen to 21 by the end of November, according to the state-run National Committee of Experts on Internet Financial Security Technology. The platforms include two formed by Huobi and OKCoin, China's two biggest bitcoin exchanges before the crackdown.\nIt's just one of the opportunities for new business that former China-based exchange operators have been exploring in the last few months.\nIn December, Huobi partnered with Japanese financial group SBI to launch two exchanges in Japan. ViaBTC also launched CoinEX, a Hong Kong-based exchange that uses Bitcoin Cash, a spin-off of bitcoin.\nshow chapters Bitcoin bull: Bitcoin could easily top $50K in 2018 20 Hours Ago | 06:15", "external_links": [], "published": "2018-01-04T04:51:00.000+02:00", "crawled": "2018-01-04T05:11:43.005+02:00", "highlightTitle": ""}