{"organizations": [], "uuid": "8ba5ec400f312ae7bfa8231a6e6116c002f898bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-southsudan-diplomacy/south-sudan-ceasefire-body-says-leaders-breaking-peace-deal-could-face-sanctions-idUSKBN1FE1IG", "country": "US", "domain_rank": 408, "title": "South Sudan ceasefire body says leaders breaking peace deal could face sanctions", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T13:51:00.000+02:00", "replies_count": 0, "uuid": "8ba5ec400f312ae7bfa8231a6e6116c002f898bd"}, "author": "", "url": "https://www.reuters.com/article/us-southsudan-diplomacy/south-sudan-ceasefire-body-says-leaders-breaking-peace-deal-could-face-sanctions-idUSKBN1FE1IG", "ord_in_thread": 0, "title": "South Sudan ceasefire body says leaders breaking peace deal could face sanctions", "locations": [], "entities": {"persons": [{"name": "nikki haley", "sentiment": "none"}, {"name": "salva kiir", "sentiment": "none"}, {"name": "festus mogae", "sentiment": "none"}, {"name": "riek machar", "sentiment": "none"}, {"name": "denis dumo", "sentiment": "none"}], "locations": [{"name": "south sudan", "sentiment": "none"}, {"name": "sudan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "botswana", "sentiment": "none"}], "organizations": [{"name": "u.n. security council", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "min read  juba", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 52 AM / in 2 minutes South Sudan ceasefire body says leaders breaking peace deal could face sanctions Denis Dumo 3 Min Read \nJUBA (Reuters) - An internationally backed ceasefire monitoring team in South Sudan said it has asked the U.N. Security Council to say whether leaders violating a peace treaty should face asset freezes, regional travel bans, or an arms embargo. \nThe statement comes a day after Nikki Haley, the U.S. ambassador to the United Nations, urged the body to impose an arms embargo and spoke of growing international frustration with the South Sudanese government. \nSouth Sudan has been riven by civil war since 2013 after clashes between troops loyal to former vice president Riek Machar and President Salva Kiir. The fighting took on ethnic overtones, killing tens of thousands of people, causing widespread hunger and forced a third of the population to flee. \nThe ceasefire monitoring commission, chaired by former Botswana president Festus Mogae, is supposed to oversee a largely ignored 2015 peace deal. Both sides have repeatedly violated it. A ceasefire negotiated in December was violated within hours, the monitors have said. \n“We cannot stand by as South Sudanese leaders sign an agreement one day and authorize or allow its violation with impunity the next,” Mogae said in the statement on Thursday after addressing the U.N. Security Council via videolink from Juba. \nSouth Sudan’s government spokesman Michael Makuei Lueth told Reuters on Thursday that the ceasefire monitors were unfair and relied on second-hand information. \n“This is very unfortunate and it is a misleading report and the United Nations Security Council (UNSC) should not have listened to such report,” he said. “They are working hard to weaken the government so that the rebels become stronger and they take over.” \nRebel deputy spokesman Lam Paul Gabriel said they would welcome any intervention by the international community to enforce the tattered ceasefire. \n“We welcome his idea to make sure those who violated the ceasefire are held responsible,” he said. “We need proper investigations to find out who is responsible for the violation of the ceasefire this time.” \nHaley had warned bluntly that the administration was running out of patience with South Sudan’s leaders. \n“Things are going backwards in South Sudan,” she said, noting that despite promises from Kiir, aid workers still faced huge fees and restrictions and that the government had promoted three generals sanctioned for severe human rights abuses. \n“The time has come to acknowledge the hard reality that the leaders of South Sudan are not just failing their people, they are betraying them,” she said. “It’s long past time that the Security Council establish an arms embargo on South Sudan.” Editing by Alison Williams", "external_links": [], "published": "2018-01-25T13:51:00.000+02:00", "crawled": "2018-01-25T14:02:23.017+02:00", "highlightTitle": ""}