{"organizations": [], "uuid": "167cbd1aa9e1b8cc4140e61e68a6a825aa15866b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220172768&w=1200&r=LYNXMPEE0708V", "site_section": "http://www.reuters.com/rssFeed/newIssuesNews\r", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-oilfield-ipos/u-s-oilfield-service-firms-dust-off-ipo-plans-as-crude-prices-surge-idUSKBN1EX0AH", "country": "US", "domain_rank": 408, "title": "U.S. oilfield service firms dust off IPO plans as crude prices surge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T07:04:00.000+02:00", "replies_count": 0, "uuid": "167cbd1aa9e1b8cc4140e61e68a6a825aa15866b"}, "author": "", "url": "https://www.reuters.com/article/us-usa-oilfield-ipos/u-s-oilfield-service-firms-dust-off-ipo-plans-as-crude-prices-surge-idUSKBN1EX0AH", "ord_in_thread": 0, "title": "U.S. oilfield service firms dust off IPO plans as crude prices surge", "locations": [], "entities": {"persons": [{"name": "liz hampton", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "ipo", "sentiment": "negative"}, {"name": "min read  houston", "sentiment": "none"}, {"name": "liberty oilfield services", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "van eck vectors oil services etf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 5:03 AM / in 9 hours U.S. oilfield service firms dust off IPO plans as crude prices surge Liz Hampton 4 Min Read \nHOUSTON (Reuters) - U.S. oilfield service companies are gearing up for initial public offerings, according to regulatory filings and analysts, after several shelved equity sales last year during a weak period for oil prices. \nOil is trading near its highest level since early 2015, fueling demand for service firms to bring new shale wells to production. Energy executives surveyed last month said they would increase drilling sharply at prices above $60 a barrel. Crude CLC1 recently traded at about $61.50 a barrel. \nInvestors’ appetite for the shares will be tested soon. Liberty Oilfield Services, which provides hydraulic fracturing services to shale producers, last week filed to raise about $160 million by selling 10.7 million shares at about $15 a share. \nIf its IPO performs well, it could open the gates for several other companies aiming to raise funds for new expansion or to buy rivals. Since August, the Van Eck Vectors Oil Services ETF ( OIH.P ) is up nearly 28 percent, behind the 32 percent gain in the SPDR S&P Oil and Gas Exploration and Production ETF ( XOP.P ). \nDenver, Colorado-based Liberty was one of four oilfield firms that shelved IPOs last year after producers trimmed spending budgets as crude dipped to $45 a barrel. Liberty did not respond to requests for comment. Other service firms also have updated their filings, signaling they may try again. \n“We could see a quick ramp up (in IPOs) because there are so many in a good position to go quickly once market conditions improve,” said A.J. Ericksen, a partner with law firm Baker Botts who focuses on mergers and acquisitions and capital markets. His firm represents the underwriters in Liberty’s public offering. \nUnderpinning the improving market for fracking services, there are some 7,300 drilled-but-uncompleted wells across the United States as of November, the U.S. Energy Information Administration recently reported. Those are wells that have yet to be hydraulically fractured. \nBJ Services, FTS International and Nine Energy Service, all of which offer hydraulic fracturing of shale wells, last year filed registration statements with the U.S. Securities and Exchange Commission but did not proceed. Fracking involves pumping sand and liquids at high pressure into a well to release trapped oil and gas. \nRepresentatives from the three companies did not respond to requests for comment. \nIn late October, FTS amended its registration filing and said its average pricing was up by more than 50 percent since late 2016. It also said it expects to reactivate six pressure-pumping fleets through mid-2018, suggesting strong demand for hydraulic fracturing. \nNine Energy Service in late December also filed an amended registration form, a possible sign it is positioning itself to go public this year. BJ Services, which named a new chief financial officer in November, has not updated its filing since July. \n“Everyone that filed in 2017 but took no additional action is probably a candidate (to go public) in 2018,” said Richard Spears, vice president of oilfield service research firm Spears & Associates. He estimates as many as five oilfield service companies could go public in the first quarter of this year. \nPressure pumping firm Keane Group ( FRAC.N ) went public a year ago at $19 a share, just as energy prices were moving higher after OPEC agreed to curb production. After falling to $12.51 last May as crude prices slipped, its shares have recovered and currently trade around $18.52. \n“We look at Keane as the closest peer to Liberty. So if Keane is trading well, that should bode well for Liberty,” said Kathleen Smith, who manages exchange-traded funds for IPO specialist Renaissance Capital. Reporting by Liz Hampton; Editing by Gary McWilliams and Cynthia Osterman", "external_links": [], "published": "2018-01-08T07:04:00.000+02:00", "crawled": "2018-01-08T08:09:40.044+02:00", "highlightTitle": ""}