{"organizations": [], "uuid": "eee7791f397da159bfbae7a12060f724409830da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/zinc-tightness-ahome/column-new-year-new-highs-for-zinc-as-market-tightens-further-andy-home-idUSL8N1P33GY", "country": "US", "domain_rank": 408, "title": "COLUMN-New year, new highs for zinc as market tightens further: Andy Home", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:23:00.000+02:00", "replies_count": 0, "uuid": "eee7791f397da159bfbae7a12060f724409830da"}, "author": "", "url": "https://www.reuters.com/article/zinc-tightness-ahome/column-new-year-new-highs-for-zinc-as-market-tightens-further-andy-home-idUSL8N1P33GY", "ord_in_thread": 0, "title": "COLUMN-New year, new highs for zinc as market tightens further: Andy Home", "locations": [], "entities": {"persons": [{"name": "andy", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "lme", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "tmsnrt.rs/2CE7Qrl LME SPREADS TIGHTER AGAIN \nLME time-spreads eased steadily over the last two months of 2017 to the point that the benchmark cash-to-three-months period CMZN0-3 was valued at $10 contango in the middle of December, compared with $91 backwardation in October. \nThis loosening spread structure looked anomalous given the daily declines in LME-registered stocks. \nEither it was signalling more metal was on its way to the LME warehouse network or it was no more than a temporary mismatch of short and long positioning across the front part of the curve. \nIt’s the latter interpretation that now looks the most likely. \nAbsolutely zero fresh metal has arrived in the LME storage system and time-spreads have tightened up again. \nThat cash-to-three-month period, for example, closed last week valued at $26 backwardation. \nMore LME spread tightness looks almost inevitable. \nNot only is headline inventory still ticking lower on a near daily basis but Friday’s LME stocks report showed 25,075 tonnes of net new cancellations as metal is prepared for physical load-out. \nAll the cancellation action took place at New Orleans, which shouldn’t come as a shock since the U.S. port now holds all but 1,700 tonnes of the 180,325 tonnes left in the entire system. \nExcluding cancelled tonnage, LME “live” stocks are now just 139,250 tonnes. \nSure, that’s still higher than last year’s July low point of 69,850 tonnes, but with no arrivals since the middle of October, exchange stocks liquidity is fast becoming a focal point of zinc’s narrative of supply deficit. \nGraphic on China’s net imports of refined zinc: \ntmsnrt.rs/2CWEwNH CHINESE ZINC IMPORTS BOOM \nOne possible reason for so little metal being available for LME delivery, despite the reappearance of a premium for cash metal, is a sharp pick-up in Chinese imports. \nChina’s pull on metal from the rest of the world was distinctly subdued in the first half of 2017, net imports actually falling by 40 percent year-on-year to 170,000 tonnes. \nIndeed, China’s lack of import appetite was a significant wrinkle in zinc’s bull story. \nThe trend turned in July, however, with imports of refined zinc accelerating sharply. \nNovember itself saw net imports hit 122,600 tonnes, the largest monthly tally ever, eclipsing the previous record of 120,000 tonnes dating from March 2009. \nThe November count was boosted by the import of 50,903 tonnes of zinc from Spain, making it the second largest supplier in the first 11 months of 2017 after Australia, a more traditional source for Chinese importers. \nChina imported less than 10,000 tonnes of zinc from Spain in both 2015 and 2016 and even if November’s flood turns out to be a one-off, there is a sense of metal moving from off-exchange statistical shadows to plug supply-chain gaps. \nThe Shanghai zinc contract is backwardated beyond the first three trading months and registered stocks are also close to historical lows. \nThere was some rebuild over the last week but at 77,383 tonnes, inventory held in Shanghai Futures Exchange sheds is 82,000 tonnes lower than this time last year and 130,000 tonnes lower than in January 2015. \nChina is itself a major producer of zinc, both at the mined and the refined metal level. \nBut the country’s ability to respond to physical tightness and higher prices has been severely constrained by the ongoing environmental campaign. \nWhile China’s zinc mines “used to be the swing producers in previous cycles”, Goldman Sachs analysts argue that the country’s zinc production in this particular price cycle “has disappointed and is likely to only increase slowly going forward.” THE ONLY WAY IS UP? \nThe steady attrition of LME stocks and the sharp pick-up in Chinese imports have reinvigorated the bull argument for higher zinc prices. \nBut, judging by the LME options market, the optimism comes with a sell-by date. \nCall options confer the right to buy and, not entirely surprisingly, there is open interest on strikes such as $4,000, $4,400 and $4,500 in each of the next five months. \nBeyond June, however, open interest almost totally disappears above the $3,800 strike, suggesting Goldman is not the only one looking for prices to peak around the middle of the year. \nThe only outlier on the 2018 call options heat map is the four lots (100 tonnes) of open interest on the $5,000 strike in December. \nIt’s a relatively small bet but a big call that zinc’s bull charge is going to be extended for longer and further than consensus. \nBullish exuberance? \nQuite possibly, but until the LME stocks trend turns, tightness in both physical and paper markets looks set to the defining feature of the zinc market over the coming weeks and months. Editing by David Evans", "external_links": [], "published": "2018-01-08T15:23:00.000+02:00", "crawled": "2018-01-08T15:54:34.005+02:00", "highlightTitle": ""}