{"organizations": [], "uuid": "dbfa5bb5d897ff8e5167b4ba51358892defb5982", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222770133&w=1200&r=LYNXMPEE0G199", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/india-exploration/india-to-auction-55-oil-and-gas-exploration-blocks-idINKBN1F623T", "country": "US", "domain_rank": 408, "title": "India to auction 55 oil and gas exploration blocks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T18:15:00.000+02:00", "replies_count": 0, "uuid": "dbfa5bb5d897ff8e5167b4ba51358892defb5982"}, "author": "", "url": "https://in.reuters.com/article/india-exploration/india-to-auction-55-oil-and-gas-exploration-blocks-idINKBN1F623T", "ord_in_thread": 0, "title": "India to auction 55 oil and gas exploration blocks", "locations": [], "entities": {"persons": [{"name": "narendra modi", "sentiment": "none"}, {"name": "atanu chakraborty", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "directorate general of hydrocarbons", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 4:15 PM / Updated 3 hours ago India to auction 55 oil and gas exploration blocks Reuters Staff 2 Min Read \nNEW DELHI (Reuters) - India will begin the auction of 55 oil and gas exploration blocks from Thursday under new rules, the country’s first licensing round after eight years, as it seeks to unlock its vast hydrocarbon resources, the upstream regulator said. \nThe world’s third biggest oil importer last year eased rules and allowed companies to carve out areas where they want to drill to attract greater interest and quickly monetise as much as 220 billion barrels of oil and gas resources. \nThe identified blocks, spread over a 59,000 sq. km area, will now go under the hammer with some advantages given to companies that first identified the area. \n“We are now putting up the blocks for bidding to ensure transparency and greater participation,” Atanu Chakraborty, head of India’s Directorate General of Hydrocarbons, told Reuters. \nIndia imports nearly three-quarters of its energy requirements but Prime Minister Narendra Modi has set a target of cutting the country’s fuel import dependency to two-thirds by 2022 and to half by 2030. \nIn previous licensing rounds, India had muted response from global oil firms but Chakraborty is hopeful of getting a good response as oil prices are moving up. A man climbs an an oil tanker parked outside a fuel depot in Mumbai, October 6, 2017. REUTERS/ Danish Siddiqui/Files \n“With oil prices now looking up, we anticipate good interest and more people would come in for exploration,” he said. \nThe last date to submit bids is on April 3 and the contracts are expected to be signed by the end of July, he said. Oil tankers are seen parked at a yard outside a fuel depot on the outskirts of Kolkata February 3, 2015. REUTERS/Rupak De Chowdhuri/Files \n“This is the biggest offering (of blocks) in the last decade and we are offering a high-quality area, as the companies themselves have chosen it,” he said. \nAbout 65 percent of the 55 blocks are on land and mostly in the northeastern state of Assam and western states of Gujarat and Rajasthan. \nIndia is estimated to hold 42 billion tonnes or 315 billion barrels of oil and gas resources, he said. \n“Of this, 220 billion barrels are yet to be discovered,” he said. Reporting by Nidhi Verma and Neha Dasgupta, editing by David Evans", "external_links": [], "published": "2018-01-17T18:15:00.000+02:00", "crawled": "2018-01-17T18:35:03.000+02:00", "highlightTitle": ""}