{"organizations": [], "uuid": "e1a4e312094901ce9dd81cf094bd6553db28fe21", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 23, "shares": 23, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225139518&w=1200&r=LYNXMPEE0O0WP", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-usa-stocks/stock-futures-higher-with-ecb-earnings-on-tap-idUSKBN1FE1OO", "country": "US", "domain_rank": 408, "title": "Stock futures higher with ECB, earnings on tap", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T14:37:00.000+02:00", "replies_count": 0, "uuid": "e1a4e312094901ce9dd81cf094bd6553db28fe21"}, "author": "", "url": "https://www.reuters.com/article/us-usa-stocks/stock-futures-higher-with-ecb-earnings-on-tap-idUSKBN1FE1OO", "ord_in_thread": 0, "title": "Stock futures higher with ECB, earnings on tap", "locations": [], "entities": {"persons": [{"name": "mario draghi", "sentiment": "none"}, {"name": "chuck mikolajczak", "sentiment": "none"}, {"name": "draghi", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "neutral"}, {"name": "intel corp", "sentiment": "none"}, {"name": "european central bank", "sentiment": "none"}, {"name": "dow components 3m co", "sentiment": "none"}, {"name": "caterpillar inc", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 12:39 PM / Updated 6 minutes ago Dow and S&P 500 reach records; market cools after Trump talks up dollar Noel Randewich 4 Min Read \nNEW YORK (Reuters) - The Dow Jones Industrial Average and S&P 500 closed at their highest levels ever on Thursday although Wall Street relinquished bigger gains after President Donald Trump said he wants a strong dollar. \nThe U.S. currency .DXY erased losses against a basket of major currencies after Trump told CNBC in an interview in Davos, Switzerland, that he wants to see a strong dollar. \nThe dollar had suffered its biggest daily percentage drop in seven months on Wednesday after U.S. Treasury Secretary Steven Mnuchin said he welcomed a weaker currency. A weaker dollar tends to benefit large U.S. multinational companies. \nBiogen Inc ( BIIB.O ) surged 2.09 percent after the drugmaker reported fourth-quarter revenue that beat Wall Street estimates on higher sales of recently launched drug Spinraza. The rise lifted the S&P healthcare sector .SPXHC 0.89 percent as one of the best-performing S&P groups. \nShares of Caterpillar Inc ( CAT.N ) fell as much as 3.5 percent and rose as much as 2.8 percent in the wake of its quarterly earnings. The stock ended 0.61 percent higher. \n“If growth continues the way we expect, we should see a rotation out of these mega-cap tech companies and into more of the higher-leveraged value companies,” said Jack Ablin, chief investment officer at BMO Private Bank in Chicago. \n“And Caterpillar is it.” \nRobust quarterly earnings and economic data have given Wall Street a strong start to 2018, with the three major indexes up more than 6 percent year to date. But the market’s relentless rise over the past year has some investors worried about a correction. \n“It’s a market that ignores all bad news and thrives on good news. It’s scary. The correction is going to be cruel, cold and brutal when it happens,” said Jake Dollarhide, chief executive officer of Longbow Asset Management in Tulsa. \nS&P 500 companies on average are expected to have increased their fourth-quarter earnings by 12.7 percent, according to Thomson Reuters I/B/E/S. \nOf the S&P 500 companies that have already posted results, 78.8 percent have topped expectations, versus an average of 72 percent over the previous four quarters. \n“It’s non-stop positive reinforcement that keeps pushing the market up,” said Frank Davis, director of sales and trading at LEK Securities in New York. \nThe Dow Jones Industrial Average .DJI rose 0.54 percent to end at 26,392.79, its highest close ever. \nThe S&P 500 .SPX ended 0.06 percent higher at 2,839.25, also its highest ever close. Earlier, it gained as much as 0.39 percent. \nThe Nasdaq Composite .IXIC declined 0.05 percent to 7,411.16. \nFord Motor Co ( F.N ) slumped 3.98 percent after the automaker posted a lower-than-expected quarterly net profit. Its bottom line was hurt by rising commodity costs and unfavorable currency exchange rates, and Ford said it expected more pain to come from higher raw material prices in 2018. \nIn extended trade, Intel ( INTC.O ) jumped 2.45 percent after the chipmaker reported its quarterly results. Starbucks ( SBUX.O ) fell 3.6 percent in extended trade following its report. \nVolume on U.S. exchanges was 7.2 billion shares, compared to the 6.7 billion average over the last 20 trading days. Additional reporting by Chuck Mikolajczak in New York, Editing by Chizu Nomiyama and Nick Zieminski", "external_links": [], "published": "2018-01-25T14:37:00.000+02:00", "crawled": "2018-01-25T14:53:56.045+02:00", "highlightTitle": ""}