{"organizations": [], "uuid": "774137c8f0ab567580a730b3d5e7511a4785d8bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222697631&w=1200&r=LYNXMPEE0G0NF", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/eurozone-currencies-hedging/analysis-euro-surge-threatens-profitable-bond-trades-idINKBN1F6182", "country": "US", "domain_rank": 408, "title": "Analysis: Euro surge threatens profitable bond trades", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T12:55:00.000+02:00", "replies_count": 0, "uuid": "774137c8f0ab567580a730b3d5e7511a4785d8bb"}, "author": "", "url": "https://in.reuters.com/article/eurozone-currencies-hedging/analysis-euro-surge-threatens-profitable-bond-trades-idINKBN1F6182", "ord_in_thread": 0, "title": "Analysis: Euro surge threatens profitable bond trades", "locations": [], "entities": {"persons": [{"name": "saikat chatterjee", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 10:55 AM / Updated 30 minutes ago Analysis: Euro surge threatens profitable bond trades Saikat Chatterjee 6 Min Read \nLONDON (Reuters) - The euro’s sizzling January rally is undermining one of the most profitable bond market trades of recent years by potentially raising hedging costs and thereby eroding profits of overseas investors. \nJapanese and U.S. investors have long bought European sovereign bonds despite many offering a negative yield. They are attracted by the juicy return obtained from hedging the purchases via foreign exchange derivatives known as cross currency basis swaps. \nBut as the European Central Bank shifts closer to policy “normalisation”, these holdings could come under pressure from a stronger euro and force investors to look elsewhere. European bond yields would then shoot higher, posing a challenge for policymakers who want to keep borrowing costs low to boost the ongoing recovery. \n“The whole idea of these trades via the currency derivatives markets is that a big interest rate differential exists in them but that argument of buying European bonds may diminish sharply if we see a precipitous fall in the U.S. dollar,” said Shaniel Ramjee, a multi-asset portfolio manager at Pictet Asset Management in London. \nSuch flows are large. By last year, Japanese investors had amassed an $845 billion position in European bond markets, according to data from Japan’s Ministry of Finance. Analysts estimate they own more than 12 percent of the French government bond market, for example. \nA rapid unwind of these positions would impose fresh uncertainty on global bond market, which are already battling with the withdrawal of global central bank stimulus, high oil prices and waves of new bond supply. SIMPLE \nAt its heart, the trade looks relatively simple. \nThere is a greater demand for U.S. dollars in the currency swaps markets where investors exchange foreign exchange exposure among different currencies. So there exists a premium for obtaining the dollar in them, helping U.S.-based investors extract a small but sizeable return when investing overseas. \nIn short, U.S.-based investors can buy European bonds and swap their currency exposure into dollars, locking in a profit despite deeply negative bond yields in Europe. \nFor example, three-month euro/dollar cross currency basis swaps yield 30 basis points which translates into a 1.2 percent yield on an annualised basis. Even accounting for an outright loss on a minus 0.10 percent yield on German five-year government bonds, the trade offers investors a currency-hedged yield of 0.7 percent. \nSmall wonder then that investors have piled in. Net inflows into developed European debt from U.S. domiciled bond funds jumped to $15 billion last year, its highest annual rate in four years, according to data from funds tracker EPFR. \nFurthermore, that yield rises if investors venture into other parts of the European debt market such as investment grade corporate bonds or riskier sovereign debt, where yields are also near record lows. \nAndrea Cicione, head of strategy at TS Lombard estimates, that Japanese investors can get a yield pick up of 25 basis points for German bunds, 52 basis points for French debt and 165 basis points for Italian bonds respectively. The signature of the President of the European Central Bank (ECB), Mario Draghi, is seen on the new 50 euro banknote during a presentation by the German Central Bank (Bundesbank) at its headquarters in Frankfurt, Germany, March 16, 2017. REUTERS/Kai Pfaffenbach/Files \n“That is far more than what investing in Japanese bonds can give them,” Cicione said. Ten-year yields in Japan were trading around 9 basis points on Wednesday. STEEPER CURVES \nBut the underlying assumptions behind this trade are being called into question. \nThe selloff in the dollar that began in early December has gathered pace, pushing the dollar index, which measures the currency’s value against a basket of its rivals, to a three-year low. \nDriving down the dollar has been a growing view that central banks such as the ECB and the Band of Japan may start unwinding easy monetary policy quicker than expected. \nThat means that interest rate differentials available through the currency swaps markets so central to this trade may start to fade and cause these flows to reverse. \nStephen Jefferies, a managing director at JP Morgan, notes that even though U.S. yields have gone up substantially in the last week - the two-year yield is above 2 percent for the first time in nearly a decade - the yen has also strengthened which indicates that these kinds of investment flows are coming under some pressure. \nMoreover, yields available to investors via these swaps have also shrunk dramatically in recent years, indicating any slight shift in policy stance from any of the major central banks could erase any gains. \nFor example, the hedged yield available for a Japanese investor buying a 10-year German government bond has now shrunk to 0.25 basis points from more than 120 basis points three years ago. \nAnd among the major global central banks, none is more keenly watched for any signs of unwinding its easy policy stance than the Bank of Japan, whose huge bond buying plan has flattened domestic yield curves and sent domestic investors to look to global bond markets in search for yield. \nJapan’s central bank caused a flutter in global bond markets last week as yields on benchmark Japanese ten-year bonds hit six-month highs above 0.80 percent after it made a small cut to its regular bond purchases. \nInvestors say a further rise in Japanese yields would prompt domestic investors to unwind their overseas investments, particularly in European bonds, pushing up yields sharply. \n“Watching the BOJ is quite important because if they start to move on that, that’s the last major central bank liquidity provider disappearing. That would have an impact on Europe,” said David Zahn, head of European fixed income at Franklin Templeton. \n($1 = 110.7700 yen)", "external_links": [], "published": "2018-01-17T12:55:00.000+02:00", "crawled": "2018-01-17T13:18:33.005+02:00", "highlightTitle": ""}