{"organizations": [], "uuid": "3ab58fb3156afd09f364c287aba9febee59c12eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219003163&w=1200&r=LYNXMPEE0209P", "site_section": "https://www.reuters.com/news/world", "section_title": "World News | Reuters.com", "url": "https://www.reuters.com/article/us-olympics-2018-northkorea-factbox/factbox-north-koreas-participation-in-previous-games-hosted-by-south-korea-idUSKBN1ES0EE", "country": "US", "domain_rank": 408, "title": "Factbox: North Korea's participation in previous games hosted by South Korea", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T16:00:00.000+02:00", "replies_count": 0, "uuid": "3ab58fb3156afd09f364c287aba9febee59c12eb"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-olympics-2018-northkorea-factbox/factbox-north-koreas-participation-in-previous-games-hosted-by-south-korea-idUSKBN1ES0EE", "ord_in_thread": 0, "title": "Factbox: North Korea's participation in previous games hosted by South Korea", "locations": [], "entities": {"persons": [{"name": "lee hee-beom", "sentiment": "none"}], "locations": [{"name": "south korea seoul", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "koreas", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL (Reuters) - North Korea reopened a border hotline with Seoul on Wednesday to discuss sending a delegation to the Winter Olympics in South Korea’s Pyeongchang next month.\nShould the North attend the event, the two Koreas may march under a single flag at a sports opening ceremony for the first time in more than a decade and even compete as a single nation, experts and officials have suggested.\nSuch a move would be a powerful symbol of reconciliation amid a tense standoff over Pyongyang’s defiant pursuit of nuclear and missiles programmes.\nGames organising chief Lee Hee-beom previously raised the possibility of the two Koreas forming unified teams in figure skating and ice hockey for the Games to be held in the mountain village of Pyeongchang, just 80 km (50 miles) from the inter-Korean border.\nThe two Koreas have competed as a single nation in international table tennis and soccer games before but have never joined forces for multi-sports events such as the Olympics or Asian Games.\nSouth and North Korea marched together at the opening ceremony of the 2000 Sydney Olympics for the first time, after the two Koreas held its first-ever summit under South Korea’s liberal Kim Dae-jung government.\nLee, president of the Pyeongchang Organizing Committee for the 2018 Winter Olympic Games, also proposed North Korean athletes entering the South by crossing the heavily armed land border between the two Koreas.\nThat would be the first time that North Korean athletes would arrive the South by road, the organizer said. North Korea has not responded to Lee’s proposals.\nNorth Korea participated in the international multi-sports events hosted by South Korea three times - in 2002, 2003 and 2014.\nThe North boycotted the Seoul Olympics held in 1988. Nine months before those Games, North Korean agents detonated a bomb on Korean Air Flight 858, killing all 104 passengers and 11 crew.\n2002 ASIAN GAMES, BUSAN (Sept 29-Oct 14)\nNorth Korea sent a 606-member delegation, including 184 athletes, 288 cheerleaders and 134 officers to the 2002 Asian Games in the South Korean port city of Busan.\nAthletes from the two Koreas paraded together at the opening and closing ceremonies, a spectacle not seen since the 2007 Asian Winter Games in China as relations chilled under nearly a decade of conservative rule in the South.\nThe contingent traveled to the via North Korean flights and a cruise ship, using the vessel as their accommodation.\nThe female cheerleaders proved a huge attraction in South Korea with their good looks and tightly choreographed gymnastic routines, and became a feature of subsequent events in 2004 and 2005. Ri Sol Ju, now North Korean leader Kim Jong Un’s wife, came to South Korea in 2005 as a North Korean cheerleader for the Asian Athletics Championships in Incheon, a lawmaker previously told reporters after being briefed by intelligence officials.\n2003 SUMMER UNIVERSIADE, DAEGU (Aug 21-Aug 31)\nA combined 528 North Koreans, including 303 cheerleaders and 94 athletes, attended the Games. The two Koreas marched together at the ceremonies.\nNorth Korean athletes flew into South Korea and stayed at Daegu Bank Institute, a training facility for the local bank.\n2014 ASIAN GAMES, INCHEON (Sept 19-Oct 4)\nPyongyang sent a total of 273 North Korean athletes and officials to the Games. They stayed at the athletes’ village.\nBut Pyongyang dropped its plan to send a cheerleading squad amid deteriorating inter-Korean relations under the previous Park Geun-hye administration. Ahead of the Games, the North also threatened to pull out of the event, accusing the South of plotting to block its athletes from taking part.\nThe two Koreas did not march together at the ceremonies.\nThe North sent its most senior delegation ever to attend its closing ceremony with just 24 hours’ notice. Kim allowed three of his top aides to fly aboard his personal jet to attend the event, while the athletes, who arrived in five installments including from Japan and Switzerland, took regular commercial flights of North Korea’s Air Koryo.\nReporting by Hyunjoo Jin and Haejin Choi in SEOUL; Additional reporting by Hyonhee Shin; Editing by Soyoung Kim and Lincoln Feast\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-03T16:00:00.000+02:00", "crawled": "2018-01-03T19:36:55.003+02:00", "highlightTitle": ""}