{"organizations": [], "uuid": "1e0237912847af6566267230ba17baeab74e1471", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-veritas-appoints-michael-cremen-as-senior-vice-president-of-americas-sales.html", "country": "US", "domain_rank": 767, "title": "Veritas Appoints Michael Cremen as Senior Vice President of Americas Sales", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T16:00:00.000+02:00", "replies_count": 0, "uuid": "1e0237912847af6566267230ba17baeab74e1471"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-veritas-appoints-michael-cremen-as-senior-vice-president-of-americas-sales.html", "ord_in_thread": 0, "title": "Veritas Appoints Michael Cremen as Senior Vice President of Americas Sales", "locations": [], "entities": {"persons": [{"name": "micha", "sentiment": "negative"}, {"name": "michael cremen", "sentiment": "negative"}, {"name": "cremen", "sentiment": "none"}], "locations": [{"name": "americas sales mountain view", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "americas", "sentiment": "none"}, {"name": "americas sales", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "veritas", "sentiment": "negative"}, {"name": "veritas technologies", "sentiment": "negative"}, {"name": "financial services", "sentiment": "none"}, {"name": "ibm global technology services", "sentiment": "none"}, {"name": "ibm", "sentiment": "none"}, {"name": "hitachi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOUNTAIN VIEW, Calif., Jan. 17, 2018 /PRNewswire/ -- Veritas Technologies today announced that Michael Cremen has joined the company as senior vice president of Americas Sales. Cremen will lead a team of sales, technical and services professionals, committed to helping customers harness the power of their data, while accelerating market share across the Americas region, the largest geographical market for the company.\nCremen is an accomplished business executive with a strong background in information management, data analytics, and cloud-based solutions. His experience spans across strategic initiatives that organizations are driving today, including digital transformation, regulatory compliance and customer experience. Previously, Cremen managed an extensive business portfolio for IBM Global Technology Services that focused on selling, delivering and managing large-scale transformational solutions to Financial Services customers in North America.\nPrior to IBM, Cremen served as executive vice president of global sales for a subsidiary of Hitachi, leading a multi-billion dollar sales and services organization comprised of 4,500 people in 130 countries. At Hitachi, Cremen played a key role in redefining the sales strategy, transforming the go-to-market organization and advancing market leadership.\n\"Michael's experience in building high-performance teams and driving profitable growth for industry-leading technology companies makes him a valuable addition to the Veritas senior leadership team,\" said Scott Genereux, executive vice president of Worldwide Field Operations, Veritas. \"I am thrilled to welcome a leader with strong technological expertise and experience in driving performance, developing people and building an extraordinary culture as Veritas continues to grow as a world leader in multi-cloud data management.\"\nCremen holds a bachelor's degree in finance from The College of New Jersey, an MBA in marketing from Monmouth University and is a graduate of the Tuck School of Business at Dartmouth's Executive Development Program.\nAbout Veritas Technologies\nVeritas Technologies empowers businesses of all sizes to discover the truth in information—their most important digital asset. Using the Veritas platform, customers can accelerate their digital transformation and solve pressing IT and business challenges including multi-cloud data management, data protection, storage optimization, compliance readiness and workload portability—with no cloud vendor lock-in. Eighty-six percent of Fortune 500 companies rely on Veritas today to reveal data insights that drive competitive advantage. Learn more at www.veritas.com or follow us on Twitter at @veritastechllc.\nVeritas, the Veritas Logo, NetBackup, Backup Exec and Enterprise Vault are trademarks or registered trademarks of Veritas Technologies LLC or its affiliates in the U.S. and other countries. Other names may be trademarks of their respective owners.\nPR Contact\nVeritas Technologies:\nDayna Fried +1 925 493 9020\ndayna.fried@veritas.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/veritas-appoints-michael-cremen-as-senior-vice-president-of-americas-sales-300583694.html\nSOURCE Veritas Technologies", "external_links": ["https://www.veritas.com/", "http://www.prnewswire.com/news-releases/veritas-appoints-michael-cremen-as-senior-vice-president-of-americas-sales-300583694.html"], "published": "2018-01-17T16:00:00.000+02:00", "crawled": "2018-01-17T16:46:55.010+02:00", "highlightTitle": ""}