{"organizations": [], "uuid": "34794a51fff83ee541c49c096e2a4c446cc43ffc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/funds-fidelity-commodities/fidelity-retirement-funds-take-multiyear-hit-from-commodities-bet-idUSL1N1OX0VO", "country": "US", "domain_rank": 408, "title": "Fidelity retirement funds take multiyear hit from commodities bet", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T16:33:00.000+02:00", "replies_count": 0, "uuid": "34794a51fff83ee541c49c096e2a4c446cc43ffc"}, "author": "", "url": "https://www.reuters.com/article/funds-fidelity-commodities/fidelity-retirement-funds-take-multiyear-hit-from-commodities-bet-idUSL1N1OX0VO", "ord_in_thread": 0, "title": "Fidelity retirement funds take multiyear hit from commodities bet", "locations": [], "entities": {"persons": [{"name": "tim mclaughlin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "fidelity", "sentiment": "negative"}, {"name": "fidelity investments", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 34 PM / in 17 minutes Fidelity retirement funds take multiyear hit from commodities bet Tim McLaughlin 4 Min Read \nBOSTON, Jan 4 (Reuters) - Fidelity Investments’ bet on commodities for its flagship retirement funds has declined 38 percent over the past five years, while top rivals have avoided the sector altogether or made money with more-conservative strategies. \nThe Boston-based company inserted its new Fidelity Series Commodity Strategy Fund into its Freedom Funds in 2009 to diversify their portfolios from stocks and bonds while giving them a weapon against inflation. But U.S. inflation has been weak for years, while stocks have been surging. \nRealized losses in the Commodity Strategy Fund have totaled $3.26 billion since 2012, according to its financial statements. In that time, energy prices collapsed, gold and silver prices declined, and bouts of excess supply plagued the coffee and sugar markets, according to Fidelity’s disclosures. The fund invests in futures contracts that cover commodities such as hogs, oil and wheat, as well as swaps with counterparties such as Goldman Sachs Group Inc and JPMorgan Chase & Co, according to U.S. regulatory filings. \nEven with the commodity funds’ losses, returns for Freedom Funds, which dial down risk as investors approach their estimated target date for retirement, exceeded those of more than 90 percent of peers because of larger, winning bets on stocks, according to three-year performance data from research firm Morningstar Inc. \nFidelity’s allocation to commodities in the Freedom Funds is $4 billion, or nearly 2 percent of $224 billion in net assets. That is down from highs of $12 billion and up to 10 percent of assets in some of the most aggressive Freedom Fund portfolios in 2013. \nMorningstar analyst Jeff Holt said some managers of target-date retirement funds had lost patience with their commodities bets. \n“We’re in a multiyear bull market for equities, and diversification from that doesn’t look that great,” Holt said. \nFidelity said in a statement that it was sticking with its commodities strategy as its portfolio managers take a long-term view. \n“The target date team has confidence in all of the investment strategies that are included in the portfolios,” the company said. \nAnd the tide could be turning for commodities. The commodity fund eked out a 0.92 percent gain in 2017 as energy prices rallied during the second half of the year. Oil rose to its highest since May 2015 on Thursday, helped by large anti-government rallies in Iran and ongoing supply cuts led by the Organization of the Petroleum Exporting Countries and Russia. Brent crude, the international benchmark, traded as high as $68.27. \nUnlike Fidelity, target-date portfolios managed by T. Rowe Price Group Inc use a fund with no direct exposure to commodities. Instead of investing in futures contracts like the Fidelity commodity fund does, T. Rowe primarily buys shares of publicly traded companies that own or are involved in natural resources, precious metals or real estate, spokesman Bill Weeks said. \nThe surging stock market is one reason why the $3.3 billion T. Rowe Real Assets Fund has generated an average annual return of 3.07 percent over the past five years, compared with average annual losses of 9.07 percent for Fidelity’s commodity fund, according to Morningstar. \nVanguard Group, the largest target-date fund provider, does not invest in commodities for those retirement portfolios. The increased costs and complexity associated with commodities outweigh their benefits, said Senior Investment Analyst Scott Donaldson. \n“People may think because they own commodities, they own barrels of oil and bushels of wheat,” Donaldson said. “But what they really own are financial derivatives. These can be complex, confusing and expensive.” (Reporting by Tim McLaughlin; Editing by Lisa Von Ahn)", "external_links": [], "published": "2018-01-04T16:33:00.000+02:00", "crawled": "2018-01-04T16:42:42.000+02:00", "highlightTitle": ""}