{"organizations": [], "uuid": "83eac8f09cc6ae8d02b9bdc49e85e893569a0353", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-revenue-enhancement-and-administration-specialist-grs-rebrands-as-avenu.html", "country": "US", "domain_rank": 767, "title": "Revenue Enhancement and Administration Specialist GRS Rebrands as Avenu", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.993, "site_type": "news", "published": "2018-01-16T23:10:00.000+02:00", "replies_count": 0, "uuid": "83eac8f09cc6ae8d02b9bdc49e85e893569a0353"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-revenue-enhancement-and-administration-specialist-grs-rebrands-as-avenu.html", "ord_in_thread": 0, "title": "Revenue Enhancement and Administration Specialist GRS Rebrands as Avenu", "locations": [], "entities": {"persons": [{"name": "avenu", "sentiment": "none"}, {"name": "craig adler", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "herndon", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "avenu", "sentiment": "none"}], "organizations": [{"name": "avenu insights & analytics", "sentiment": "none"}, {"name": "government revenue solutions", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New identity highlights ability to identify, secure revenue for local governments\nHERNDON, Va.--(BUSINESS WIRE)-- Avenu changed its name from Government Revenue Solutions (GRS) to better reflect how the company enables cities, towns, and counties across the U.S. to enhance their fiscal posture. Avenu is a portfolio company of Mill Point Capital.\nOperating as Avenu Insights & Analytics (Avenu), the company identifies and recovers general fund revenue on behalf of cities and counties. Their limited resources prevent these local governments from collecting all the funds they’re owed for permits, license fees, and taxes for sales and use, property, utility and franchise, and hotel and short-term rentals.\nThese customers also use Avenu’s administrative expertise to expedite payment via an automated system, and achieve better audit results because Avenu pinpoints improper or underreported revenue. Last year Avenu’s legacy companies discovered and delivered $1.3 billion to local governments.\nAccording to Craig Adler, executive chairman of Avenu, “local governments operate in an environment with aging infrastructure, a new tax law that will decrease their revenue, underfunded pensions and other everyday obligations. They need every dollar of revenue to continue providing citizen services.”\nCEO Paul Colangelo says the new brand signifies innovation that is critical for local governments.\n“Avenu’s technology evaluates large data sets, shows trends and clusters of opportunity to collect more revenue, and then provides the platform for businesses to pay and stay compliant. It’s a level of standardization and sophistication expected by the 89,000 local governments across the U.S. and their constituents.”\nThe other leaders of GRS—Doug Jensen, Kennon Walthall, and Patrick Scott—will continue in their roles and are a key part of Avenu’s strategy. One of Avenu’s legacy companies, MuniServices, will continue to retain its legal structure.\nAbout Avenu\nAvenu provides local governments with ways to achieve more predictable revenue that supports growth, fuels modernization and ensures compliance with mandated but underfunded programs. Avenu’s revenue enhancement and administrative solutions find and recover license, permit and other fees that cities and counties struggle to collect. The insights and improved fiscal posture enables governments to deliver expected services and sustain a high quality of life for residents. www.avenuinsights.com\nAbout Mill Point Capital\nMill Point Capital is a middle-market private equity firm focused on control-oriented investments in the business services and industrial sectors. The firm works with Executive Partners to leverage its investment professionals' experience while providing strategic and operational guidance designed to drive long-term value creation in its portfolio companies. Mill Point is based in New York, NY. For more information, please visit www.millpoint.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116006666/en/\nAvenu\nChris Ourand, 571-441-2891\nDirector of Marketing\nSource: Avenu", "external_links": ["http://www.businesswire.com/news/home/20180116006666/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.millpoint.com&esheet=51744048&newsitemid=20180116006666&lan=en-US&anchor=www.millpoint.com&index=2&md5=7be4ad5c5cd52a41c024fe4437969275", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.avenuinsights.com&esheet=51744048&newsitemid=20180116006666&lan=en-US&anchor=www.avenuinsights.com&index=1&md5=8992ccc0610b0bfb3a93d6859d5c2056"], "published": "2018-01-16T23:10:00.000+02:00", "crawled": "2018-01-17T02:06:14.005+02:00", "highlightTitle": ""}