{"organizations": [], "uuid": "5ae7297637079b1515d751af08b36981f37ed9ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-levine-leichtman-capital-partners-announces-seven-promotions.html", "country": "US", "domain_rank": 767, "title": "Levine Leichtman Capital Partners Announces Seven Promotions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.996, "site_type": "news", "published": "2018-01-08T18:05:00.000+02:00", "replies_count": 0, "uuid": "5ae7297637079b1515d751af08b36981f37ed9ce"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-levine-leichtman-capital-partners-announces-seven-promotions.html", "ord_in_thread": 0, "title": "Levine Leichtman Capital Partners Announces Seven Promotions", "locations": [], "entities": {"persons": [{"name": "lauren leichtman", "sentiment": "none"}, {"name": "monica holec", "sentiment": "none"}, {"name": "matt", "sentiment": "none"}, {"name": "michael weinberg", "sentiment": "none"}, {"name": "arthur levine", "sentiment": "none"}, {"name": "robert poletti", "sentiment": "none"}, {"name": "matthew frankel", "sentiment": "none"}, {"name": "andrew schwartz", "sentiment": "none"}, {"name": "frankel", "sentiment": "none"}, {"name": "aaron perlmutter", "sentiment": "none"}, {"name": "leichtman", "sentiment": "none"}, {"name": "stephen hogan", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "levine leichtman capital partners announces seven promotions", "sentiment": "negative"}, {"name": "levine leichtman capital partners", "sentiment": "negative"}, {"name": "bear, stearns & co", "sentiment": "none"}, {"name": "american capital", "sentiment": "none"}, {"name": "university of southern california", "sentiment": "none"}, {"name": "llcp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 08, 2018 (GLOBE NEWSWIRE) -- Levine Leichtman Capital Partners (“LLCP”), a Los Angeles-based private equity firm, has announced that Matthew Frankel has been promoted to Partner of the Firm. Mr. Frankel joins the current Partners of LLCP: Lauren Leichtman, Arthur Levine, Robert Poletti, Stephen Hogan, Aaron Perlmutter and Michael Weinberg. LLCP also announced that Monica Holec and Andrew Schwartz have been promoted to Senior Managing Director.\nMr. Frankel joined Levine Leichtman Capital Partners in 2010, and participates in new deal execution and portfolio management. Prior to joining LLCP, Mr. Frankel worked as a Vice President at American Capital and an investment banker for Bear, Stearns & Co. Inc. Mr. Frankel received a B.S. in Business Administration from the University of Southern California.\n“Matt has been a valuable member of the LLCP team and we are pleased to include him as partner of the Firm,” said Lauren Leichtman, co-founder and CEO of Levine Leichtman Capital Partners. Ms. Leichtman added, “His leadership and ability to work collaboratively with our portfolio company management teams to build value has contributed to the success of LLCP.”\nMs. Holec joined Levine Leichtman Capital Partners in 2010. Since that time, she has been instrumental in raising capital from a global investor base in five of LLCP’s Funds, and has lead the charge of expanding and solidifying the Firm’s relationships with Limited Partners.\nMr. Schwartz joined Levine Leichtman Capital Partners as a Director in 2011. He has been integral in leading several successful investments, including the recent exits of Champion Manufacturing and FSC Franchise Co. As a senior member of the Firm’s Corporate Finance Group, Mr. Schwartz will continue working closely with the management of LLCP portfolio companies, as well as leading deal execution of new investment opportunities.\n“Monica and Andrew have been important members of the Levine Leichtman Capital Partners team. Monica has been responsible for our loyal, global investor following and Andrew has contributed to several successful investments and realizations for our funds. We are excited for their continued growth within the Firm,” said Lauren Leichtman, LLCP’s co-founder.\nLevine Leichtman also announced the promotions of Karen Lin, Weston Richter and Andrew Alexander to Associate Director. Paul Hamilton was promoted to Senior Associate.\nFor more information, visit http://www.llcp.com .\nAbout Levine Leichtman Capital Partners\nLLCP is a Los Angeles, California based private investment firm that has managed approximately $9.0 billion of institutional capital since its inception. LLCP invests in middle market companies located in the United States and Europe. LLCP is currently making new investments through Levine Leichtman Capital Partners VI, L.P., LLCP Lower Middle Market Fund, L.P., Levine Leichtman Capital Partners Private Capital Solutions, L.P., Levine Leichtman Capital Partners Europe, L.P. and LLCP Co-Investment Fund, L.P. LLCP has offices in Los Angeles, New York, Dallas, Chicago, London and the Netherlands.\nContact: David Wolmer 310-275-5335\nSource:Levine Leichtman Capital Partners", "external_links": ["https://www.globenewswire.com/Tracker?data=RyCNXXv-WC_dyPpkv3YwRZI5h6lcFQ4Mgwr8ZxemDfTGSpVBgjtX61KLYgGH4mTPsQJ761WaVqhgRqgB_0HVmw=="], "published": "2018-01-08T18:05:00.000+02:00", "crawled": "2018-01-08T21:14:41.000+02:00", "highlightTitle": ""}