{"organizations": [], "uuid": "a60877e3ef7854367c6908c9ba6c27ebc6dcdb1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/Reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-iran-rallies/iran-holds-pro-government-rallies-after-sixth-day-of-protests-idUKKBN1ES0FY", "country": "US", "domain_rank": 408, "title": "Iran holds pro-government rallies after sixth day of protests", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T10:17:00.000+02:00", "replies_count": 0, "uuid": "a60877e3ef7854367c6908c9ba6c27ebc6dcdb1d"}, "author": "", "url": "https://uk.reuters.com/article/uk-iran-rallies/iran-holds-pro-government-rallies-after-sixth-day-of-protests-idUKKBN1ES0FY", "ord_in_thread": 0, "title": "Iran holds pro-government rallies after sixth day of protests", "locations": [], "entities": {"persons": [{"name": "bozorgmehr sharafedin", "sentiment": "none"}, {"name": "khamenei", "sentiment": "none"}, {"name": "ayatollah ali khamenei", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "gorgan", "sentiment": "none"}, {"name": "kermanshah", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "ilam", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 8:17 AM / Updated an hour ago Iran stages pro-government rallies after sixth day of protests Bozorgmehr Sharafedin 6 Min Read \nLONDON (Reuters) - Thousands of Iranians took part in pro-government rallies in several cities on Wednesday in a state-sponsored show of force after six days of street unrest that has shaken the clerical leadership and left 21 people dead. \nState television broadcast live pictures of rallies in the southwestern cities of Kermanshah and Ilam and in the northern city of Gorgan, where marchers waved Iranian flags and pictures of Supreme Leader Ayatollah Ali Khamenei. \nIn the Shi‘ite holy city of Qom, demonstrators chanted “death to American mercenaries”. There were also rallies in Isfahan, Iran’s third largest city, and Abadan and Khorramshahr in the oil-rich southwest, state TV footage showed. \nMarchers voiced support for Khamenei, chanting, “The blood in our veins is a gift to our leader,” and, “We will not leave our leader alone.” They accused the United States, Israel and Britain of inciting the unrest and shouted, “The seditionist rioters should be executed!” \nThe anti-government protests, which erupted last week out of frustration over economic hardship among the youth and working class, have grown into the boldest challenge to the Islamic Republic’s established order in almost a decade. \nThe demonstrations, organised on social media, have largely been held after dusk. They continued into Tuesday night with video footage posted on social media showing demonstrators on the streets and riot police deployed in several cities including Ahvaz in the southwest. \nHours earlier, Khamenei had accused Iran’s foes of fomenting the protests, some of which have criticised him by name and called for him to step down. \nThe outburst of dissent is the most serious since 2009, when Iranians took to the streets over accusations of vote-rigging in the re-election of then-President Mahmoud Ahmadinejad. \nHundreds have been arrested across the sprawling country and a judicial official warned some could face the death penalty. \nThe demonstrations have put pressure on President Hassan Rouhani, who championed a deal struck with world powers in 2015 to curb Iran’s disputed nuclear programme in return for the lifting of most international sanctions against Tehran. \nMany of those protesting are frustrated at what they see as the failure so far of his government to deliver on promises of more jobs and investment as a payoff from the nuclear accord. \nRouhani, who has said the demonstrators have a right to protest, told Turkish President Tayyip Erdogan in a phone call on Wednesday that he hoped the unrest would end in a few days. \n“We are certain about Iran’s security and stability ... People are free in Iran to protest within the framework of law,” Rouhani was quoted as saying by the state news agency IRNA. TOUGH CHOICE ON SANCTIONS \nU.S. President Donald Trump has asserted in tweets that Iranians have lost patience with alleged corruption and what he called a terrorist regime. People take part in pro-government rallies, Iran, January 3, 2018. Tasnim News Agency/Handout via REUTERS \nThe six days of demonstrations in a string of Iranian cities began over economic conditions, and Trump must decide by mid-January whether to continue waiving U.S. sanctions on Iran’s oil exports under the terms of the nuclear deal that he opposed. \nIf he reimposes sanctions on oil, it could increase the economic pain for Iran’s leaders - but also send the wrong message about U.S. support for Iran’s people, analysts say. \nMajor General Mohammad Ali Jafari, commander of Iran’s elite Revolutionary Guards, said on Wednesday, “If the Americans’ sympathy with Iranians were real, they would have not imposed cruel sanctions on the our nation.” \nReferring to Rouhani’s policy of detente with the West, Jafari told Fars news agency that “friendship with the United States” would never bring prosperity and that the Guards were ready to help the government overcome economic challenges. ROUHANI UNDER PRESSURE Slideshow (5 Images) \nResentment over economic stagnation and alleged graft within the clerical and security hierarchies sparked the protests after Iranians took to social media to vent their outrage. \nAnger has been building up since last month. Thousands of Iranians joined a hashtag campaign on Twitter and other sites to express frustration over the slow pace of reforms. \nUnder the “#I am regretful” hashtag, they expressed disappointment with Rouhani, who was elected on promises of tackling high unemployment and granting more social freedoms. \nThey focussed on Rouhani’s latest budget bill. It has allocated, as usual, billions of dollars to religious universities and institutions while the government said it did not have enough cash to help the unemployed, including 28.8 percent of youth who are jobless. \nBoth the arch-conservative Khamenei and the pragmatist Rouhani have pledged to curb corruption and create economic prosperity for all Iranians. \nBut there have been few changes. The elite Revolutionary Guards, for example, still control a vast economic empire. \nWhile more than 20 million out of 80 million Iranians live below the poverty line, the wealthy, including relatives of government officials, import tens of thousands of luxury cars every year, causing widespread resentment. \nWhile young, impoverished Iranians have dominated the current protests across the Islamic Republic, some members of the urban middle class are also taking part. \nThe demonstrations have evolved into rare political rallies that call for the overthrow of all Iranian leaders. \nIn an attempt to control the flow of information and calls for anti-government gatherings, Tehran authorities have restricted access to the Telegram messaging app and Instagram, owned by Facebook Inc FB.O.. Reporting by Bozorgmehr Sharafedin; editing by Michael Georgy and Mark Heinrich", "external_links": [], "published": "2018-01-03T10:17:00.000+02:00", "crawled": "2018-01-03T10:23:36.023+02:00", "highlightTitle": ""}