{"organizations": [], "uuid": "72e74003ac1c8c40591e3a216e1ed6d621d1a80c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKdomesticNews", "section_title": "Reuters: UK", "url": "https://uk.reuters.com/article/uk-britain-harassment/hostesses-harassed-at-men-only-charity-gala-in-london-ft-says-idUKKBN1FD14I", "country": "US", "domain_rank": 408, "title": "Hostesses harassed at men-only charity gala in London - FT says", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T12:07:00.000+02:00", "replies_count": 0, "uuid": "72e74003ac1c8c40591e3a216e1ed6d621d1a80c"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-harassment/hostesses-harassed-at-men-only-charity-gala-in-london-ft-says-idUKKBN1FD14I", "ord_in_thread": 0, "title": "Hostesses harassed at men-only charity gala in London - FT says", "locations": [], "entities": {"persons": [{"name": "madison marriage", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "ft", "sentiment": "negative"}, {"name": "financial times", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "presidents club", "sentiment": "none"}, {"name": "presidents club charitable trust", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 10:07 AM / Updated 3 hours ago Men-only gala where hostesses were groped faces backlash in Britain Estelle Shirbon 5 Min Read \nLONDON (Reuters) - The London charity behind a men-only fundraising gala where specially hired hostesses were groped and harassed, according to a Financial Times report, faced a swift backlash on Wednesday with donations being returned and politicians denouncing it. \nThe FT article by a reporter who went undercover at the Presidents Club gala last week described braying men in tuxedos fondling women, putting their hands up their skirts, pulling them into their laps, making lewd comments and offering to take them to hotel rooms. \nOne of the 130 hostesses, who were required to wear skimpy black dresses with matching underwear and to sign non-disclosure agreements before entertaining the 360 male guests, said a diner had exposed his penis to her during the event. \n“Women were bought as bait for men, for rich men, not a mile from where we stand, as if that is acceptable behaviour. It is totally unacceptable,” lawmaker Jess Phillips told parliament during a hastily convened debate about the issue. \nShe was one of several visibly furious women politicians who lined up to denounce the event as despicable. \nTwo London children’s hospitals, Great Ormond Street and Evelina, said they would return donations received from the Presidents Club, while corporate sponsor WPP, the advertising group, said it was severing ties with the organisation. \n“We would never knowingly accept donations raised in this way,” Great Ormond Street said in a statement. \nBy the end of the day, the previously little known Presidents Club announced it would shut itself down. \n“The trustees have decided that the Presidents Club will not host any further fundraising events. Remaining funds will be distributed in an efficient manner to children’s charities and it will then be closed,” the charity said in a statement. \nThe FT said the event, an annual fixture on the London social calendar for three decades, was attended by business executives, financiers, politicians and other powerful men. \nComing at a time of intense public debate about sexual harassment in the workplace, the report conjured up an image of sections of the British establishment that many found shocking and badly out of touch with modern values. \n“I thought that things had changed. However, it is absolutely clear that things have not changed,” Anne Milton, junior education minister, told parliament. \n“I think that there is an association between wealthy people and this sort of behaviour, and we have to send a clear message that it is unacceptable.” \nThe Bank of England, which was dragged into the story because one of the prizes offered up for auction at the event was tea with Governor Mark Carney, said it had not approved the prize or had any contact with the organisers. \n“The Governor is deeply dismayed that such an event could take place,” the Bank said in a statement. \nAlso on offer for big donors was lunch with Boris Johnson, Britain’s foreign secretary. The Foreign Office declined immediate comment. Prime Minister Theresa May’s spokesman said Johnson had not known about the prize. \n“YOU LOOK FAR TOO SOBER” \nLuxury goods businessman David Meller, one of co-chairmen of the Presidents Club Charitable Trust, stepped down as a non-executive board member at the education ministry as the fallout from the FT report intensified. \nMay’s spokesman said she had been uncomfortable reading about the event, pointedly saying that as a woman she would not have been invited. \nOne of the people who did attend was Conservative member of parliament Nadhim Zahawi, who is also a junior minister in the education department. Milton told parliament Zahawi had not stayed long, prompting jeers from opposition lawmakers. \nZahawi said on Twitter the behaviour described in the FT report was truly shocking and he condemned it. “I will never attend a men-only function ever,” he added. \nThe FT report said lots put up for auction at the gala, which was held at the prestigious Dorchester Hotel, included a night at a strip club and a course of plastic surgery, with the invitation “Add spice to your wife”. \nAt an after-party, held in a smaller room off the main lobby of the Dorchester, a man described as a prominent society figure had grabbed a hostess by the waist and pulled her in against his stomach. Related Coverage May 'uncomfortable' reading reports of alleged sexual harassment at charity gala \n“You look far too sober,” the man was reported as saying. “I want you to down that glass, rip off your knickers and dance on that table.” \nThe FT said the Presidents Club trust had two joint chairmen, London property developer Bruce Ritchie and Meller, who also runs a chain of schools. \nReuters contacted Ritchie’s Residential Land company, Meller’s luxury goods firm Meller Designs and his educational trust to seek comment. No one was made available to speak about it. \nThe Dorchester Hotel said it was deeply concerned over allegations. “We are in discussions with the organisers and an investigation is underway.” \nThe Charity Commission, the not-for-profit sector regulator, said it would be urgently investigating the Presidents Club. Editing by Ralph Boulton and Angus MacSwan", "external_links": [], "published": "2018-01-24T12:07:00.000+02:00", "crawled": "2018-01-24T12:38:41.019+02:00", "highlightTitle": ""}