{"organizations": [], "uuid": "5d20cfaf849cb4ad19dba55d42f382314a74fa77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/05/104568577-GettyImages-690949474-manufacturing-siemens.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/women-more-at-risk-of-losing-jobs-thanks-to-tech-automation-wef.html", "country": "US", "domain_rank": 767, "title": "Women more at risk of losing jobs thanks to tech, automation: WEF", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.067, "site_type": "news", "published": "2018-01-22T13:49:00.000+02:00", "replies_count": 0, "uuid": "5d20cfaf849cb4ad19dba55d42f382314a74fa77"}, "author": "Ryan Browne", "url": "https://www.cnbc.com/2018/01/22/women-more-at-risk-of-losing-jobs-thanks-to-tech-automation-wef.html", "ord_in_thread": 0, "title": "Women more at risk of losing jobs thanks to tech, automation: WEF", "locations": [], "entities": {"persons": [{"name": "luke sharrett", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "kentucky", "sentiment": "none"}, {"name": "louisville", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "wef", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "siemens rail automation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "More than half of workers expected to be affected by technological disruption are female, according to a study by the World Economic Forum .\nAccording to research released Monday, 57 percent of the 1.4 million U.S. jobs at risk of being displaced by automation in the next eight years belong to women.\nWomen whose jobs are at risk of being lost have fewer opportunities to transition to more high-skilled occupations, the report highlighted. Even with reskilling — which WEF defines as \"giving workers the skills and capabilities needed for the future workplace\" — women still have fewer options than men to find alternative careers.\nHowever, the report added that career transitions brought about by a need for new skills presented an opportunity to reduce gender pay inequality. The combination of reskilling and moving into new careers would increase the pay of women whose jobs are at risk by 74 percent, WEF said, versus a 53 percent increase for men.\n\"Work provides people with meaning, identity and opportunity,\" Saadia Zahidi, head of education, gender and work system initiative at the World Economic Forum, said in a statement. \"We need to break out of the current paralysis and recognize that skills are the great redistributor. Equipping people with the skills they need to make job transitions is the fuel needed for growth — and to secure stable livelihoods for people in the midst of technological change.\"\nThis year, the World Economic Forum in Davos, Switzerland is being chaired entirely by women for the first time in its 48-year history. The co-chairs of the meeting of world leaders in politics and business include International Monetary Fund Director Christine Lagarde , IBM Chief Executive Ginni Rometty and Norwegian Prime Minister Erna Solberg.\nFollow CNBC International on Twitter and Facebook .", "external_links": [], "published": "2018-01-22T13:49:00.000+02:00", "crawled": "2018-01-22T13:52:57.000+02:00", "highlightTitle": ""}