{"organizations": [], "uuid": "f85c4e4c20c598792232f06d2df8ca6ed9979438", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222363499&w=1200&r=LYNXMPEE0F0HW", "site_section": "http://feeds.reuters.com/reuters/UKStocksAndSharesNews/", "section_title": "Reuters: Stocks & Shares News", "url": "https://uk.reuters.com/article/uk-europe-view-tuesday/daily-briefing-uk-french-pact-in-focus-with-macron-in-calais-idUKKBN1F50SB", "country": "US", "domain_rank": 408, "title": "Daily Briefing: UK-French pact in focus with Macron in Calais", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T10:31:00.000+02:00", "replies_count": 0, "uuid": "f85c4e4c20c598792232f06d2df8ca6ed9979438"}, "author": "", "url": "https://uk.reuters.com/article/uk-europe-view-tuesday/daily-briefing-uk-french-pact-in-focus-with-macron-in-calais-idUKKBN1F50SB", "ord_in_thread": 0, "title": "Daily Briefing: UK-French pact in focus with Macron in Calais", "locations": [], "entities": {"persons": [{"name": "macron", "sentiment": "negative"}, {"name": "mac", "sentiment": "negative"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "calais", "sentiment": "none"}, {"name": "romania", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "cour de cassation", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "le touquet", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "calais reuters", "sentiment": "none"}, {"name": "social democrats", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 8:32 AM / Updated 25 minutes ago Daily Briefing: UK-French pact in focus with Macron in Calais Reuters Staff 5 Min Read \nLONDON (Reuters) - French President Emmanuel Macron visits the northern port of Calais today ahead of a UK-French summit in London on Thursday where the issue of immigration will feature. French President Emmanuel Macron delivers his speech during the traditional New Year ceremony at the Cour de Cassation, France's highest judicial court, at the Paris courthouse in Paris, France, January 15, 2018 \nDespite the dismantling of the so-called \"Jungle\" camp a year and a half ago, migrants keep flocking into the port city in northern France, hoping to cross the Channel to Britain. France has long felt that Britain is shirking its responsibilities in the matter and there have been hints that it wants changes to the existing Le Touquet agreement covering border control . The discussion will not be any easier given Britain's plans to exit the European Union. \nRomania's ruling Social Democrats meet today to discuss options for a new prime minister to replace Mihai Tudose, who resigned on Monday after the party leadership withdrew backing for him . Tudose is the second premier ousted by the party in less than seven months; his resignation came after tensions rose between him and the party's powerful president, Liviu Dragnea. The latter retains a tight grip over both the ruling party and government despite being barred from becoming prime minister himself because of a conviction in a vote-rigging case. \nThe Bank of France confirmed late on Monday it already held some currency reserves in yuan , hours after the German central bank said it was looking to move some of its reserves into the Chinese currency - a statement which had pushed the yuan to its strongest level in more than two years against the dollar. The French central bank said it would not reveal a breakdown of its reserves, and did not say when it first included the yuan. Romania's Prime Minister Mihai Tudose leaves a meeting of the Social Democrat Party in Bucharest, Romania, January 15, 2018 \nThis raises the question of how many other European central banks are holding, or plan to hold, the yuan. For now, it’s all somewhat symbolic move and any volumes will be small. The European Central Bank has also foreshadowed this phenomenon by doing its own transaction in June. \nMARKETS \nAs U.S. markets re-open following Monday’s Martin Luther King holiday, traders will be familiar with what they see – world stocks at all-time highs, a soft dollar, perky bond yields and buoyant oil prices. Some of those trades have succumbed to light profit taking in early trading on Tuesday, but the broader trends appear to be intact as investors continue to price in global central bank policy “normalization” against a backdrop of solid and even strengthening economic growth. ECB policymaker Ardo Hansson went so far as to say on Monday that quantitative easing could stop altogether in September. \nEuro/dollar hit a three-year high of $1.2296 on Monday, a rise of some 2.5 percent this year so far, but has retreated since to about $1.2245. Some speculation about glitches in the German coalition talks was keeping traders a bit warier first thing. Major European bourses are expected to open higher this morning, with a heavier news flow and the U.S. markets re-opening. \nIn the UK, all eyes will be on inflation, which is expected to have eased to 3.0 percent from a 3.1 percent peak in November, taking some pressure off the Bank of England to quickly follow up last year’s interest rate rise. Sterling held most of its recent gains against the dollar after clearing $1.38 on Monday for the first time since the 2016 Brexit referendum. Bitcoin’s new year travails continued; it dropped another 10 percent in early trading. Editing by Larry King", "external_links": [], "published": "2018-01-16T10:31:00.000+02:00", "crawled": "2018-01-16T11:04:48.017+02:00", "highlightTitle": ""}