{"organizations": [], "uuid": "17ce683980b543b9ab61697a17aabb58a53a148b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/myanmar-journalists/reuters-reporters-accused-under-official-secrets-act-due-in-myanmar-court-idUSL4N1PH27J", "country": "US", "domain_rank": 408, "title": "Reuters reporters accused under Official Secrets Act due in Myanmar court", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.019, "site_type": "news", "published": "2018-01-23T07:01:00.000+02:00", "replies_count": 0, "uuid": "17ce683980b543b9ab61697a17aabb58a53a148b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/myanmar-journalists/reuters-reporters-accused-under-official-secrets-act-due-in-myanmar-court-idUSL4N1PH27J", "ord_in_thread": 0, "title": "Reuters reporters accused under Official Secrets Act due in Myanmar court", "locations": [], "entities": {"persons": [{"name": "kyaw soe oo", "sentiment": "none"}, {"name": "khin maung zaw", "sentiment": "none"}], "locations": [{"name": "myanmar", "sentiment": "none"}, {"name": "yangon", "sentiment": "none"}, {"name": "yangon", "sentiment": "none"}, {"name": "rakhine", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "united nations", "sentiment": "none"}, {"name": "ministry of information", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "YANGON, Jan 23 (Reuters) - Two Reuters journalists detained in Myanmar are due to appear in court on Tuesday, when a judge could review a bail request for the pair accused of violating the country’s colonial-era Official Secrets Act.\nWa Lone, 31, and Kyaw Soe Oo, 27, had worked on Reuters coverage of a crisis in Rakhine state, where an army crackdown on insurgents since the end of August has triggered the flight of 688,000 Rohingya Muslims, according to the United Nations.\nThe reporters were detained on Dec. 12 after they had been invited to meet police officers over dinner in the country’s largest city, Yangon.\n“There will be an argument for bail from both the defence lawyers and prosecutors,” said Khin Maung Zaw, a lawyer representing the two journalists.\nThe prosecution has previously objected to the bail application.\nThe court would then hear evidence from the first police witness, who would be cross-examined by defence lawyers, Khin Maung Zaw said.\nThe Ministry of Information has cited police as saying the two journalists were “arrested for possessing important and secret government documents related to Rakhine State and security forces”. It has said they “illegally acquired information with the intention to share it with foreign media”.\nReuters President and Editor-In-Chief Stephen J. Adler has said the court’s decision to pursue charges was “a wholly unwarranted, blatant attack on press freedom”.\nThe pair last appeared in court on Jan. 10, when prosecutors sought charges against them under the Official Secrets Act, which carries a maximum prison sentence of 14 years.\nThe reporters have told relatives they were arrested almost immediately after being handed some documents at a restaurant by two policemen they had not met before.\nGovernment officials from some of the world’s major nations, including the United States, Britain and Canada, as well as top U.N. officials, have called for the reporters to be freed.\nFormer U.S. President Bill Clinton has called for the immediate release of the journalists.\nThe two journalists were accused under Section 3.1 (c) of the Official Secrets Act, which dates back to 1923 when Myanmar, then known as Burma, was a province of British India. (Reporting By Yimou Lee; Editing by Alex Richardson)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T07:01:00.000+02:00", "crawled": "2018-01-23T18:19:12.000+02:00", "highlightTitle": ""}