{"organizations": [], "uuid": "9f7faf2f2132c96e37b2f8f9c21b227b131e9e68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225359122&w=1200&r=LYNXMPEE0P067", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-ironore-poll/under-steels-shadow-iron-ore-seen-tumbling-13-percent-in-2018-reuters-poll-idUSKBN1FF0CL", "country": "US", "domain_rank": 408, "title": "Under steel's shadow, iron ore seen tumbling 13 percent in 2018: Reuters poll", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-26T11:57:00.000+02:00", "replies_count": 0, "uuid": "9f7faf2f2132c96e37b2f8f9c21b227b131e9e68"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-ironore-poll/under-steels-shadow-iron-ore-seen-tumbling-13-percent-in-2018-reuters-poll-idUSKBN1FF0CL", "ord_in_thread": 0, "title": "Under steel's shadow, iron ore seen tumbling 13 percent in 2018: Reuters poll", "locations": [], "entities": {"persons": [{"name": "vivek dhar", "sentiment": "none"}], "locations": [{"name": "manila", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "commonwealth bank of australia", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MANILA (Reuters) - The price of steelmaking ingredient iron ore will drop 13 percent this year to around $60 a ton, pressured by plentiful supply, potentially slower demand in top consumer China and reduced profits on churning out steel, a Reuters poll showed.\nWhile China’s crackdown on pollution and curbs on steel output are set to continue in 2018, analysts said disruptions to the steel market could be more limited than last year, when the campaigns lifted steel prices and spurred a temporary rally in iron ore.\nBenchmark 62-percent grade iron ore for delivery to top market China will average $62 a ton in 2018, down from around $71 last year, according to the median estimate in a Reuters poll of 18 analysts. [L4N1PK3MN]\n“Through the year, iron ore supply growth, particularly in China and outside Australia and Brazil, should weigh on prices,” said Commonwealth Bank of Australia analyst Vivek Dhar, who sees the commodity averaging $55 in October-December and $60 for the whole of 2018.\nChinese steel prices surged nearly 50 percent in 2017, but spot iron ore prices eventually dropped 8 percent on the year despite shadowing steel higher for months, dragged down by record stockpiles of the raw material.\nThose stronger iron ore prices for most of 2017 boosted China’s output of the commodity by 7 percent and increased China-bound shipments from smaller suppliers India and Iran by double-digit percentages, bolstering exports dominated by Brazil and Australia.\nVale, the world’s No. 1 producer, is expected to add the most output among top suppliers in 2018, with plans to increase to 390 million tonnes from 365 million tonnes as it ramps up its massive S11D mine in Brazil.\nWhile most top iron ore exporters have been focusing on margins over volume, Clarksons Platou Securities said it doesn’t “expect Chinese steel production to grow enough to absorb all of the world’s expansions”, seeing “a gradual decline in pricing”.\nDIMINISHING EFFECTS Slowing growth in China’s property sector could cut steel production in the country to 820 million tonnes from last year’s record 831.7 million tonnes, said Barclays, which sees iron ore falling to an average $50 a ton in the second quarter from $70 in January-March.\nChinese steel output rose last year despite government-imposed curbs and a pollution crackdown, with mills chasing strong margins amid a rally in prices for the construction material.\nThose margins, which touched their strongest in two decades at up to 2,000 yuan ($316) a ton, are likely to drop as winter production restrictions, in place from the middle of November, are lifted in mid-March.\nChinese steel prices have already fallen 4 percent from December’s three-month high, with spot iron prices down 5 percent from this year’s peak, standing at $75 on Thursday.\n“As previously idled capacity comes online during the March-April period, we think the ensuing drop in profitability will trigger a selloff in the iron ore price,” Barclays said.\nAnd unlike 2017, the impact of fresh restrictions on steel production may be reduced this year, limiting any boost to prices of steel and iron ore.\n“The effects of the curbs will diminish as steel producers would try everything possible to increase their production in advance,” said Cao Ying, analyst at SDIC Essence Futures.\nReporting by Manolo Serapio Jr.; Additional reporting by Swati Verma in Bengaluru and Ruby Lian in Shanghai; Editing by Joseph Radford\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-26T11:57:00.000+02:00", "crawled": "2018-01-26T11:47:56.002+02:00", "highlightTitle": ""}