{"organizations": [], "uuid": "e18874353d42154d55cfac06280e3077ae8e2573", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-allergan-provides-2018-preliminary-financial-outlook-for-select-income-statement-categories-and-other-updates-at-36th-annual-j.html", "country": "US", "domain_rank": 767, "title": "Allergan Provides 2018 Preliminary Financial Outlook for Select Income Statement Categories and Other Updates at 36th Annual J. P. Morgan Conference", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.234, "site_type": "news", "published": "2018-01-09T00:30:00.000+02:00", "replies_count": 0, "uuid": "e18874353d42154d55cfac06280e3077ae8e2573"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-allergan-provides-2018-preliminary-financial-outlook-for-select-income-statement-categories-and-other-updates-at-36th-annual-j.html", "ord_in_thread": 0, "title": "Allergan Provides 2018 Preliminary Financial Outlook for Select Income Statement Categories and Other Updates at 36th Annual J. P. Morgan Conference", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DUBLIN, Allergan plc (NYSE: AGN), a leading global pharmaceutical company, is providing its 2018 preliminary financial outlook and other financial updates at the 36th annual J.P. Morgan Healthcare Conference in San Francisco today.\nCommenting on the Company's 2018 outlook, Allergan Chairman and CEO Brent Saunders said, \"While we face loss of exclusivity revenue headwinds in 2018, Allergan is in a solid position to unlock value in the near- and long-term. Our confidence is driven by the durable growth prospects for our businesses, the efforts we are taking to right-size the organization, our therapeutic area leadership, deep and high-potential pipeline and strong cash flows and balance sheet. Together, these elements provide a formidable foundation for Allergan to deliver value for shareholders in 2018 and beyond.\"\n2018 Outlook\nToday, the Company is providing the following preliminary financial outlook for 2018. The outlook includes the following assumptions:\nNo generic entry for RESTASIS ® prior to the second quarter of 2018. Additional impact of generic entries: ESTRACE ® (generic already in market); NAMENDA XR ® (early first quarter of 2018); DELZICOL ® (early second quarter of 2018); ACZONE ® (highly genericized market). Ongoing cost reductions of $300 million – $400 million from Fiscal Year 2017 non-GAAP operating expenses. Expected 2018 non-GAAP tax rate of no more than ~15%.\nThe following represents 2018 financial outlook for select income statement categories:\nFull Year 2018 Select Outlook\nGAAP\nNON-GAAP\nTotal Net Revenues\n~$15.0 - $15.3 billion\n~$15.0 - $15.3 billion\nTax Rate\nNo more than ~65%\nNo more than ~15%\nPerformance Net Income Per Share*\n$(0.84)**\n≥$15.25\n* Refer to Table in the Appendix of this press release for GAAP to non-GAAP reconciliation.\n** 2018 GAAP loss per share from continuing operations attributable to shareholders under a scenario of non-GAAP performance net income per share of $15.25 .\nAllergan will provide additional 2018 financial outlook measures as part of its fourth quarter and full year 2017 earnings report and call on Tuesday, February 6, 2018.\nOther Financial Updates\nIn addition to the above 2018 preliminary financial outlook, the Company is providing the following financial updates:\n2017 Tax Cut and Jobs Act Impact\nOn December 22, 2017 the Tax Cut and Jobs Act (\"TCJA\") was enacted into law by President Donald Trump. Allergan is providing the following guidance on the expected impact of the TCJA on the Company.\nOverall, Allergan anticipates the future impact of the TCJA will be broadly neutral to the Company's non-GAAP effective tax rate over time, with a moderate increase for 2018 as compared to full year 2017. The Company will provide further information on its expected effective tax rate as determined under GAAP and our non-GAAP effective tax rate as part of our fourth quarter and full-year 2017 earnings report.\nAllergan Share Repurchase Program\nOn September 25, 2017, the Company's Board of Directors authorized a $2.0 billion share repurchase program. Allergan repurchased approximately 20 percent of the authorized repurchase amount in the three months ended December 31, 2017.\nTeva Securities Divestiture\nAllergan continues to prudently divest its remaining holding in securities of Teva Pharmaceuticals International Ltd. (\"Teva\"), including, as previously disclosed, through its Forward Sale Agreement with J.P. Morgan for 25 million of the 100 million Teva securities with a February 2018 maturity date.\nAllergan plans to sell its remaining position in 2018 through Forward Sale Agreements and/or open market sales. Such sales will be disclosed in amendments to the Company's Schedule 13D as required by law.\nAbout Allergan plc\nAllergan plc (NYSE: AGN), headquartered in Dublin, Ireland, is a bold, global pharmaceutical company and a leader in a new industry model – Growth Pharma. Allergan is focused on developing, manufacturing and commercializing branded pharmaceutical, device, biologic, surgical and regenerative medicine products for patients around the world.\nAllergan markets a portfolio of leading brands and best-in-class products for the central nervous system, eye care, medical aesthetics and dermatology, gastroenterology, women's health, urology and anti-infective therapeutic categories.\nAllergan is an industry leader in Open Science, a model of research and development, which defines our approach to identifying and developing game-changing ideas and innovation for better patient care. With this approach, Allergan has built one of the broadest development pipelines in the pharmaceutical industry with 55+ mid-to-late stage pipeline programs currently in development.\nAllergan's success is powered by our more than 18,000 global colleagues' commitment to being Bold for Life. Together, we build bridges, power ideas, act fast and drive results for our customers and patients around the world by always doing what is right.\nWith commercial operations in approximately 100 countries, Allergan is committed to working with physicians, healthcare providers and patients to deliver innovative and meaningful treatments that help people around the world live longer, healthier lives every day.\nFor more information, visit Allergan's website at www.Allergan.com .\nForward-Looking Statement\nStatements contained in this press release that refer to future events or other non-historical facts are forward-looking statements that reflect Allergan's current perspective on existing trends and information as of the date of this release. Actual results may differ materially from Allergan's current expectations depending upon a number of factors affecting Allergan's business. These factors include, among others, the difficulty of predicting the timing or outcome of FDA approvals or actions, if any; the impact of competitive products and pricing; market acceptance of and continued demand for Allergan's products; the impact of uncertainty around timing of generic entry related to key products, including RESTASIS ® , on our financial results; uncertainty associated with financial projections, projected cost reductions, projected synergies, restructurings, increased costs, and adverse tax consequences; difficulties or delays in manufacturing; and other risks and uncertainties detailed in Allergan's periodic public filings with the Securities and Exchange Commission, including but not limited to Allergan's Annual Report on Form 10-K for the year ended December 31, 2016 and Allergan's Quarterly Report on Form 10-Q for the period ended September 30, 2017. Except as expressly required by law, Allergan disclaims any intent or obligation to update these forward-looking statements.\nNon-GAAP Financial Measures\nIn this press release, the Company presents items not prepared in accordance with GAAP, or non-GAAP financial measures (as defined in Regulation G promulgated by the U.S. Securities and Exchange Commission), that exclude certain significant charges or credits that ", "external_links": ["http://www.prnewswire.com/news-releases/allergan-provides-2018-preliminary-financial-outlook-for-select-income-statement-categories-and-other-updates-at-36th-annual-j-p-morgan-conference-300579320.html", "http://www.allergan.com/"], "published": "2018-01-09T00:30:00.000+02:00", "crawled": "2018-01-09T09:40:11.222+02:00", "highlightTitle": ""}