{"organizations": [], "uuid": "abb6cb66ee9f51600e1ab504f64fd2541685db04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226999345&w=1200&r=LYNXMPEE0U1A2", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-fox-nfl/fox-pays-over-3-billion-for-thursday-night-football-rights-source-idUKKBN1FK2EI", "country": "US", "domain_rank": 408, "title": "Fox pays over $3 billion for Thursday Night Football rights - source", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T18:26:00.000+02:00", "replies_count": 0, "uuid": "abb6cb66ee9f51600e1ab504f64fd2541685db04"}, "author": "", "url": "https://uk.reuters.com/article/uk-fox-nfl/fox-pays-over-3-billion-for-thursday-night-football-rights-source-idUKKBN1FK2EI", "ord_in_thread": 0, "title": "Fox pays over $3 billion for Thursday Night Football rights - source", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 4:27 PM / Updated 19 minutes ago Fox pays more than $3 billion for Thursday Night Football rights -source Jessica Toonkel , Sonam Rai 3 Min Read \n(Reuters) - Twenty-First Century Fox Inc has agreed to pay more than $3 billion (2.12 billion pounds) to air Thursday night National Football League games on the Fox broadcast network for the next five seasons, a source familiar with the situation told Reuters. \nThe agreement, which was announced on Wednesday morning without financial terms, underscores Fox’s aim to be a leader in sports after it closes the sale of some film and television assets to Walt Disney Co. \nBut investors panned the deal, sending Fox shares down 4 percent to $36.91 in afternoon trading. Fox already airs Sunday NFL matchups, and the new investment comes as ratings and ad revenues for NFL games have been declining. \nFox will pay about $60 million per Thursday night game, up from the $45 million CBS Corp and Comcast Corp’s NBC paid for broadcast rights this season, according to the source. \n“The news underscores the preeminent pricing power of the pro sports league, coming after relatively steep declines in NFL TV ratings,” CFRA analyst Tuna Amobi said. \nFox’s strategy is to focus on sports and news after it sells other assets to Disney in a proposed $52.4 billion agreement announced in December. \n“These opportunities come very infrequently,” Twenty-First Century Fox President Peter Rice told reporters on a conference call. “You either have the rights to the most-watched content in media, or you don‘t. If you lose that action and don’t take that opportunity, this won’t come up for another five years.” \nFox will broadcast 11 Thursday night games each year between weeks four and 15, excluding Thanksgiving night. The contests will be simultaneously broadcast via NFL Network and in Spanish on Fox Deportes. \nNFL games are among the most popular programming on television, but overall ratings dropped about 10 percent during the just-completed regular season. Advertising revenue for regular season Thursday night games fell 3 percent from the prior year, according to Standard Media Index. \nBut Fox is optimistic Thursday night football will help Fox grow its business, Rice said on the call. \n“Every deal we have done, people have said that we overpaid, and every single point we have built up our business,” Rice said. “I think we get tremendous value here.” \nThe NFL and Fox are looking for a digital partner to stream Thursday night games online, NFL Commissioner Roger Goodell said on the call, noting it had received multiple bids and expects an announcement soon. Reporting by Sonam Rai in Bengaluru, Jessica Toonkel in New York and Lisa Richwine in Los Angeles; Editing by Meredith Mazzilli", "external_links": [], "published": "2018-01-31T18:26:00.000+02:00", "crawled": "2018-01-31T18:51:12.017+02:00", "highlightTitle": ""}