{"organizations": [], "uuid": "5a193fce79b66f5a92a8ba7e10bf5dded07d86f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-veru-reports-fiscal-2017-fourth-quarter-full-year-financial-results.html", "country": "US", "domain_rank": 767, "title": "Veru Reports Fiscal 2017 Fourth-Quarter, Full-Year Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T15:00:00.000+02:00", "replies_count": 0, "uuid": "5a193fce79b66f5a92a8ba7e10bf5dded07d86f0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-veru-reports-fiscal-2017-fourth-quarter-full-year-financial-results.html", "ord_in_thread": 0, "title": "Veru Reports Fiscal 2017 Fourth-Quarter, Full-Year Financial Results", "locations": [], "entities": {"persons": [{"name": "mitchell steiner", "sentiment": "none"}, {"name": "veru", "sentiment": "none"}], "locations": [{"name": "miami", "sentiment": "none"}], "organizations": [{"name": "nda", "sentiment": "negative"}, {"name": "veru inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "-- Fiscal 2017 Marked by Actions to Advance Drug Pipeline; First New Drug Application (NDA) on Track for Submission in First Half of 2018; Three Additional NDAs Expected to be Filed: Two in 2019 and One in 2020 --\nCompany to Host Investor Conference Call on Friday, January 5, 2018, 8 AM Eastern Time\nMIAMI, Jan. 02, 2018 (GLOBE NEWSWIRE) -- Veru Inc. (NASDAQ:VERU) today announced its financial results for the fiscal 2017 fourth quarter and full year ended September 30, 2017.\n“Our fiscal 2017 financial results reflect the risk and volatility associated with being a single product company and, more importantly, validate the strategic rationale for the acquisition completed late last year, which brought a pipeline of multiple high-value, low-risk product candidates,” said Mitchell Steiner, M.D., President and Chief Executive Officer of Veru. “While revenues from FC2 were disappointing due in part to the sales cycle and dependence on a few global public-sector customers, the past year was marked by a number of critical accomplishments and actions, including the excellent progress we made advancing the development of our pipeline toward commercialization. These efforts included meeting with the FDA to streamline and clarify the regulatory pathway for approval of almost all of our drug candidates.\n“Following is a summary of our progress for products added as a result of the acquisition: Tamsulosin DRS, a novel formulation of a widely prescribed drug for benign prostatic hyperplasia (BPH), completed the first and second stages of a bioequivalence clinical trial; VERU-944, for hot flashes in men receiving hormone therapy for prostate cancer, completed the necessary steps required to initiate a Phase 2 clinical trial in early 2018; and VERU-111, a New Chemical Entity (NCE) for advanced prostate and other cancers, completed a significant portion of the required preclinical work as well as established the process to manufacture the drug in preparation of commencing human clinical trials in 2018.\n“More recently, we monetized a portion of outstanding accounts receivable and completed the acquisition of two exciting new drug candidates, which not only address large patient populations but also further expand our portfolio of products for the urology and oncology markets. Importantly, the FDA has agreed that for each product a single bioequivalence study would be acceptable for a 505(b)(2) NDA filing. We also are encouraged by positive preclinical data that showed additional efficacy of our VERU-111 product for a number of different cancer types. The new data will be presented at national scientific meetings in 2018.\n“Looking ahead, we expect to file with the FDA the Company’s first New Drug Application (NDA) for Tamsulosin DRS in the first half of 2018. Moreover, we plan to submit three additional NDAs: two in 2019 and another NDA in 2020. Regarding sales of our commercial products, we are seeing traction following the implementation of several initiatives to grow our US revenue for FC2 and we are optimistic about potential near-term orders for FC2 from two large international public-sector customers.”\nFiscal 2017 Fourth Quarter Results\nFor the fiscal 2017 fourth quarter, net revenues increased to $3.7 million from $3.6 million for the fourth quarter of fiscal 2016. Gross profit was $1.8 million, or 49% of net revenues, compared with $1.9 million, or 52% of net revenues, for the fourth quarter of fiscal 2016. Selling, general and administrative (SG&A) expenses were $3.1 million compared with $1.7 million for the prior year fourth quarter. Research and development (R&D) expenses were $1.5 million compared with a de minimis amount in the prior year fourth quarter. Operating loss was $2.8 million compared with $293,000 for the fourth quarter of fiscal 2016. Net loss was $4.7 million, or $0.10 per share, compared with $1.8 million, or $0.06 per share, for the fourth quarter of fiscal 2016.\nFiscal 2017 Full-Year Results\nFor the fiscal 2017 full year, net revenues, which were primarily derived from sales of FC2, were $13.7 million compared with $22.1 million for fiscal 2016. Unit sales of FC2 were 26 million compared with 42 million in fiscal 2016. Financial results for fiscal 2016 included $6 million of net revenues based on unit sales of 11.5 million to Brazil. Excluding Brazil from the prior year total, net revenues and unit sales were down 15 percent and 13 percent, respectively. Gross profit was $7.0 million, or 51% of net revenues, compared with $13.3 million, or 60% of net revenues for fiscal 2016. SG&A expenses were $11.1 million compared with $8.7 million for the prior year. R&D expenses were $3.5 million compared with $99,000 in the prior fiscal year. Operating loss was $8.5 million versus operating income of $3.0 million for fiscal 2016. Net loss was $8.6 million, or $0.25 per share, compared to net income of $345,000, or $0.01 per diluted share, for fiscal 2016.\nAs of September 30, 2017, net working capital was $4.8 million compared with $12.9 million as of the September 30, 2016. During the year ended September 30, 2017, the Company generated approximately $1 million of cash from operating activities, versus cash used in operating activities of $1.7 million in the prior fiscal year. As of September 30, 2017, cash was $3.3 million, short-term accounts receivable were $3.6 million and long-term accounts receivable was $7.8 million.\nConference Call Event Details\nVeru Inc. will host a conference call on Friday, January 5, 2018 at 8 a.m. ET to review the company’s performance. Interested investors may access the call by dialing 877-317-6789 from the U.S., or 412-317-6789 from outside the U.S., and asking to be joined into the call.\nIn addition, investors may access a replay of the conference call the same day beginning at approximately noon ET by dialing 877-344-7529 for US callers, or 412-317-0088 from outside the U.S., passcode 10114690. The replay will be available for one week, after which, the recording will be available via the company’s website at https://veruhealthcare.com/investors .\nAbout Veru Inc.\nVeru Inc. (Veru) is a biopharmaceutical company focused on urology and oncology. Veru utilizes FDA's 505(b)(2) regulatory approval pathway to develop and commercialize drug candidates. FDA's 505(b)(2) regulatory approval pathway is designed to allow for potentially expedited, lower cost and lower risk regulatory approval based on a previously established safety and efficacy profile of the product. Veru is developing products under the 505(b)(1) pathway as well, which is the traditional new drug application (NDA) pathway. The company is currently developing drug product candidates: Tamsulosin DRS, slow release granules, and Tamsulosin XR capsules for lower urinary tract symptoms of benign prostatic hyperplasia (BPH) (NDA planned 2018), Solifenacin DRG, slow release granules, for overactive bladder (urge incontinence, urgency and frequency of urination) (NDA planned 2019), Tadalafil/finasteride combination capsule for restricted urination because of an enlarged prostate (NDA planned 2019), VERU-944 (cis-clomiphene citrate) for hot flashes in men associated with prostate ca", "external_links": ["https://www.globenewswire.com/Tracker?data=dXDK6YU9OfUkGvxuDmIo3If3nX_vcT9pnXF51YjxiPquQDX9jn_iU1YdSMcwVAkfR0Hp4HL8glldNrbvmGMeyw==", "https://www.globenewswire.com/Tracker?data=wdvHTTELk2L_zePnpz0daDHaauII1znhenhN390hxpQvmsuBR8fOszV5KwsvnsresDTB5cSTwqANYrpMo44cDdjOHAcgnxoKH_pnu8QcYLs=", "https://www.globenewswire.com/Tracker?data=wdvHTTELk2L_zePnpz0daJsilZi3CrMLu_4_jcQQK-vmmrftFvRZXrewhwga1fkxEGp7oMmMkZTtjnwifTRSvw==", "https://www.globenewswire.com/Tracker?data=wdvHTTELk2L_zePnpz0daE9UnKiXJ4m--l8_UfvuVZVykstq9fyGYuzLI5DAiPa6cCVHvkaSY4zYgaYq1f3ePg==", "https://veruhealthcare.com/investors", "https://www.globenewswire.com/NewsRoom/AttachmentNg/9c96f1a7-e104-47d4-8011-8c19496681c2", "https://www.globenewswire.com/Tracker?data=8q_KTRBqt41QQQRZaRRfHX8g9GnH8DL0apIZ50PbUdxDDlEu0728LYRzJETAU5dpcVDxAzOROLCbs_opW5PEnB6QHBHBBCncYthnwd_1mWvLPhpW5LAcjan20Q_kjHhy", "https://www.globenewswire.com/Tracker?data=8q_KTRBqt41QQQRZaRRfHX8g9GnH8DL0apIZ50PbUdwKybd94fYB8dkBqRQODIP4bHbZ24YnbaDw6L4a1GzUGoh1i7SPmtclDbfvUZbi77jwkakvaCoo0q2Kq9Asvwal", "https://www.globenewswire.com/Tracker?data=hFJBt28uy6Ns8ItHi295u5pYlZIbX3ixXk_--QPwlGyXo9ejd1_3uJmjYnc9ZV_DKyqx5kwKX1OxGD5rJeonS3PQgbDCaQbmCkyLXpZHsjZpMikVUsGvmXQHoIZlq13d", "https://www.globenewswire.com/Tracker?data=hFJBt28uy6Ns8ItHi295u5pYlZIbX3ixXk_--QPwlGxUDzpp-IWv9mCXaWDAmT-0DKXQQsjxQivWxYPx7ztYso3u050WixGC15bOjavbBJ8="], "published": "2018-01-02T15:00:00.000+02:00", "crawled": "2018-01-02T16:20:05.000+02:00", "highlightTitle": ""}