{"organizations": [], "uuid": "97f541cb322c660644b4ae5e759d9c4d517d2749", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/india", "section_title": "India", "url": "https://www.reuters.com/article/us-india-rights-lawmaking/indias-digital-id-project-could-violate-rights-of-millions-campaigners-say-idUSKBN1F41JI", "country": "US", "domain_rank": 408, "title": "India's digital ID project could violate rights of millions, campaigners say", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-15T20:34:00.000+02:00", "replies_count": 0, "uuid": "97f541cb322c660644b4ae5e759d9c4d517d2749"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-india-rights-lawmaking/indias-digital-id-project-could-violate-rights-of-millions-campaigners-say-idUSKBN1F41JI", "ord_in_thread": 0, "title": "India's digital ID project could violate rights of millions, campaigners say", "locations": [], "entities": {"persons": [{"name": "aadhaar", "sentiment": "none"}, {"name": "aakar patel", "sentiment": "none"}], "locations": [{"name": "mumbai india", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "human rights watch", "sentiment": "none"}, {"name": "unique identification authority of india", "sentiment": "none"}, {"name": "amnesty international india", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI India’s ambitious biometric identity project could lead to millions of people being denied access to essential services and benefits in violation of their human rights, campaigners said, ahead of key court hearings on the legitimacy of the program.\nIndia launched Aadhaar, now the world’s biggest biometric database, in 2009 to streamline welfare payments and cut wastage in public spending.\nThe government has since made the card mandatory to access a range of services, including benefits such as state subsidies, pensions and scholarships.\nThis “can obstruct access to several constitutional rights, including the rights of people to food, healthcare, education and social security,” said Aakar Patel, executive director at Amnesty International India.\n“The government has a legal and moral obligation to ensure that nobody is denied their rights simply because they don’t have an Aadhaar card,” he said in a joint statement with Human Rights Watch (HRW) at the weekend.\nOfficials at the Unique Identification Authority of India (UIDAI), which oversees the program, did not respond to an e-mail seeking comment.\nThe Supreme Court has been holding hearings on the legitimacy of the government’s demand to make Aadhaar mandatory for a range of services, despite the court ruling in 2014 that the ID cannot be a requirement for welfare programs.\nThe top court is scheduled to resume hearings on Jan. 17.\nCampaigners and technology experts have raised concerns about privacy and the safety of the data, the susceptibility of biometrics to failure, and the misuse of data for profiling or increased surveillance.\nThere have been reports of biometrics failing when fingerprints have faded, and of deaths linked to denial of subsidized food when Aadhaar verification failed.\nOfficials in Jharkhand state in October said Aadhaar was not necessary to get subsidized grains, after the death of an 11-year-old girl who campaigners say died of hunger because her family’s ration card was canceled when it was not linked to their Aadhaar card.\n“It is ironic that a 12-digit number aimed to end corruption and help the poor has become the very reason many have been deprived of fundamental rights,” Meenakshi Ganguly, HRW’s south Asia director, said in the statement.\nReporting by Rina Chandran @rinachandran. Editing by Ros Russell. Please credit the Thomson women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org to see more stories.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T20:34:00.000+02:00", "crawled": "2018-01-15T22:19:42.005+02:00", "highlightTitle": ""}