{"organizations": [], "uuid": "fd19368cd4f1d7af3bc59c6dbccee90a24bf7748", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-895708324.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/17/trump-administration-medicaid-work-requirement/", "country": "US", "domain_rank": 1196, "title": "Commentary: Medicaid Work Requirement a Bad Move | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.666, "site_type": "news", "published": "2018-01-17T02:00:00.000+02:00", "replies_count": 0, "uuid": "fd19368cd4f1d7af3bc59c6dbccee90a24bf7748"}, "author": "Lindsay Koshgarian", "url": "http://fortune.com/2018/01/17/trump-administration-medicaid-work-requirement/", "ord_in_thread": 0, "title": "Commentary: Medicaid Work Requirement a Bad Move | Fortune", "locations": [], "entities": {"persons": [], "locations": [{"name": "kentucky", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "medicaid", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nThe Trump administration moved recently to allow states to require “proof of work” for Medicaid recipients. \nThe idea is punitive and counter-productive—not to mention hypocritical. \nThe new work requirements would affect a minority of Medicaid recipients: The two-thirds of Medicaid recipients who are elderly, have disabilities, are children, or are pregnant won’t be required to work. Neither, supposedly, will “medically frail” people with conditions like cancer in Kentucky, the one state that already has a plan in place. \nBut it’s worth taking a closer look at who would be affected, and how. \nA solid majority of non-senior, non-disabled adults on Medicaid already work—and nearly eight in 10 live in households where at least one adult works. There are very good reasons to believe that cutting off health insurance for those who don’t would make it harder for them to get jobs. \nTellingly, of those who don’t work, the most common reason (36%) is illness or non-covered disability . Their stories are highly individual, but one thing they probably have in common is that taking away their health care will make it less likely, not more, that they’ll join the workforce anytime soon. \nThen there’s the burden of proof. Medicaid recipients who do work could lose coverage just because they fail to jump through the bureaucratic hoops correctly to prove they have a job. \nIt’s worth looking at the Medicaid work rules in their political context. \nRepublicans in Congress, for example, just passed a massive tax cut for corporations. They failed to demand any proof that those corporations would actually bring business or jobs back to the U.S. Already, it’s starting to look like corporations may not deliver , with major announcements of job cuts at big companies like AT&T (T) and Wal-Mart (WMT) . \nYet individual Medicaid recipients will have to provide proof of their work status to hold onto their health insurance? That hardly seems fair. \nThis isn’t just a snarky comparison. The cost of the $2 trillion tax giveaway could cover 55 million Medicaid recipients over the next 10 years. \nWorse still, coming off their tax vote, Republicans ranging from Paul Ryan to Marco Rubio and President Trump announced that the next legislative priority would be some variation on entitlement reform or welfare reform . That means that fresh off a huge tax cut for corporations and millionaires, poorer people could be thrown off their health care. \nLet’s be clear: This isn’t about getting more people to work. It’s an effort to cover the cost of tax cuts for rich people by cutting the Medicaid rolls. \nThis has a double appeal for Republicans: It mitigates some of the tax bill’s estimated $2 trillion contribution to the national debt. And it plays to the ideological concerns of Paul Ryan and others who follow the moral compass of Ayn Rand, holding dear the notion that in an advanced society, we owe each other nothing. \nThis is a dire mistake. By covering millions of Americans more affordably than private insurance could, Medicaid is actually a highly functional, effective program. The real problem is that we have an economy that still leaves far too many Americans working to barely survive. \nIn 2016, nearly 1.5 million restaurant and food workers and nearly 1 million construction workers were covered by Medicaid . A combination of fair wage laws and a truly universal health system would go a long way toward fixing what’s really wrong with the current system. \n\nAnd for that minority of Medicaid recipients who don’t work but could, maybe we should try something novel: a jobs program. Proposals like the one from the Congressional Progressive Caucus would raise taxes on corporations and inheritances to a sustainable level, and use those funds in large part to pay for a new, 21st-century infrastructure push that could strengthen our economy, decrease our reliance on fossil fuels, and provide good-paying jobs. \nBut that would require something that’s anathema to the Paul Ryans in Congress: taking responsibility for a system that’s broken. \nLindsay Koshgarian directs the National Priorities Project at the Institute for Policy Studies. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-17T02:00:00.000+02:00", "crawled": "2018-01-18T04:53:12.005+02:00", "highlightTitle": ""}