{"organizations": [], "uuid": "afba12555315e9f7630735e880b7b9969291c1d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/15/104946671-rsz_gettyimages-621052060.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/15/cranberries-singer-dolores-oriordan-dies-suddenly-at-age-46.html", "country": "US", "domain_rank": 767, "title": "Cranberries singer Dolores O'Riordan dies suddenly at age 46", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.758, "site_type": "news", "published": "2018-01-15T19:58:00.000+02:00", "replies_count": 0, "uuid": "afba12555315e9f7630735e880b7b9969291c1d6"}, "author": "Hulton Archive", "url": "https://www.cnbc.com/2018/01/15/cranberries-singer-dolores-oriordan-dies-suddenly-at-age-46.html", "ord_in_thread": 0, "title": "Cranberries singer Dolores O'Riordan dies suddenly at age 46", "locations": [], "entities": {"persons": [{"name": "dolores o'riordan", "sentiment": "negative"}, {"name": "o'riordan", "sentiment": "none"}, {"name": "lindsey holmes", "sentiment": "none"}, {"name": "holmes", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "limerick", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "limerick group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Dolores O'Riordan, lead singer of Irish rock band The Cranberries, died suddenly on Monday. She was 46.\nO'Riordan died in London, where she was recording, publicist Lindsey Holmes said.\n\"No further details are available at this time,\" Holmes said, adding that the singer's family was \"devastated\" by the news.\nFormed in Limerick, Ireland at the end of the 1980s, The Cranberries became international stars in the 90s with hits including \"Zombie\" and \"Linger\" that fused the alternative rock edge with Celtic-infused pop tunefulness.\nIrish President Michael D. Higgins said O'Riordan and the band \"had an immense influence on rock and pop music in Ireland and internationally.\"\n\"To all those who follow and support Irish music, Irish musicians and the performing arts, her death will be a big loss,\" he said in a statement.\nO'Riordan was The Cranberries' chief lyricist and co-songwriter, and her powerful, sometimes wailing, voice was key to the band's distinctive sound.\nThe group's 1993 debut album \"Everybody Else Is Doing It, So Why Can't We?\" sold millions of copies and produced the hit single \"Linger.\"\nThe follow-up, \"No Need to Argue,\" sold in even greater numbers and contained \"Zombie,\" a howl against Northern Ireland's violent Troubles that topped singles charts in several countries.\nThe band released three more studio albums before splitting up in 2003. O'Riordan released a solo album, \"Are You Listening,\" in 2007, and another, \"No Baggage,\" in 2009.\nThe members of The Cranberries reunited that year, releasing the album \"Roses\" in 2012.\nThe Cranberries released the acoustic album \"Something Else\" in 2017 and had been due to tour Europe and North America. The tour was cut short because O'Riordan was suffering from back problems.\nIn 2014, O'Riordan was accused of assaulting three police officers and a flight attendant during a flight from New York to Ireland. She pleaded guilty and was fined 6,000 euros ($6,600).\nMedical records given to the court indicated she was mentally ill at the time of the altercation.\nAfter her court hearing O'Riordan urged other people suffering mental illness to seek help.\nO'Riordan is survived by her ex-husband, the former Duran Duran tour manager Don Burton, and their three children.", "external_links": [], "published": "2018-01-15T19:58:00.000+02:00", "crawled": "2018-01-15T19:59:20.004+02:00", "highlightTitle": ""}