{"organizations": [], "uuid": "8a312f296108f23365b05c324da2fd9b2096d1a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/domesticNews\r", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-new-york-hazing-death/four-face-prison-time-in-fraternity-hazing-death-in-pennsylvania-idUSKBN1EX1FT", "country": "US", "domain_rank": 408, "title": "Four face prison time in fraternity hazing death in Pennsylvania", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T19:32:00.000+02:00", "replies_count": 0, "uuid": "8a312f296108f23365b05c324da2fd9b2096d1a4"}, "author": "", "url": "https://www.reuters.com/article/us-new-york-hazing-death/four-face-prison-time-in-fraternity-hazing-death-in-pennsylvania-idUSKBN1EX1FT", "ord_in_thread": 0, "title": "Four face prison time in fraternity hazing death in Pennsylvania", "locations": [], "entities": {"persons": [{"name": "michael", "sentiment": "none"}, {"name": "deng", "sentiment": "none"}, {"name": "david dekok", "sentiment": "none"}, {"name": "chun", "sentiment": "none"}], "locations": [{"name": "pennsylvania", "sentiment": "none"}, {"name": "pa", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "stroudsburg", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "min read  harrisburg", "sentiment": "none"}], "organizations": [{"name": "delta psi", "sentiment": "none"}, {"name": "baruch college", "sentiment": "none"}, {"name": "city university of new york", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "monroe county court of common pleas", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 5:34 PM / in 40 minutes College fraternity banned from Pennsylvania for hazing death David DeKok 3 Min Read \nSTROUDSBURG, Pa. (Reuters) - A Pennsylvania court on Monday banned a national college fraternity from operating in the state for 10 years because of the death of a student during an alcohol-fueled hazing incident in 2013. \nThe court also fined Pi Delta Psi $112,500 for the death of Chun “Michael” Deng, a 19-year-old freshman from New York’s Baruch College, who was knocked unconscious by fraternity members who waited an hour before taking him to a hospital. \nA jury in November found Pi Delta Psi, an Asian-American cultural fraternity, guilty of aggravated assault and involuntary manslaughter, marking what prosecutors and defense lawyers called the first time a U.S. fraternity was criminally convicted in a pledge hazing death. \n“I would like to apologize on behalf of the fraternity to the Deng family,” Wes Niemoczynski, lawyer for the fraternity, said. “What happened to Michael Deng was horrific..” \nBut he said the penalty would “strangle” the Pi Delta Psi financially and that he would appeal. \nAssistant District Attorney Kimberly Metzger, the lead prosecutor, dismissed the apology. \n“This fraternity has not really accepted responsibility for the death of Michael Deng,” Metzger said. \nDeng, 19, died in December 2013 from head injuries suffered during a hazing initiation for prospective members, or pledges, called “the glass ceiling” at a rented home in Pennsylvania’s Pocono Mountains. \nFour former Pi Delta Psi members are to be sentenced for their role in Deng’s death on Monday afternoon at Monroe County Court of Common Pleas in Stroudsburg, Pennsylvania. \nSheldon Wong, 25, Charles Lai, 27, Raymond Lam, 24, and Kenny Kwan, 28, pleaded guilty in May to felony charges of voluntary manslaughter and hindering apprehension. \nDuring the incident, Deng, a nationally competitive handball player, was blindfolded, wore a 30-pound (14-kg) backpack and ran a gauntlet of fraternity members who tackled and knocked him unconscious on snow-covered ground, police said. \nAccording to court documents, Wong was in charge of the pledging and, when the hazing went awry, Lai ran an attempted cover-up. Kwan was the last one to tackle the blindfolded Deng, while Lam “got physical” with Deng and fled before police arrived, court documents said. \nJudge Margherita Patti-Worthington could sentence the four to up to 27 years in prison, although state guidelines call for 22 to 36 months. \nThe fraternity has two chapters in the state, an active one at Pennsylvania State University in University Park and an inactive one at Carnegie Mellon University in Pittsburg. \nIn a separate case, 26 members of Pennsylvania State University’s Beta Theta Pi fraternity face charges including involuntary manslaughter, aggravated assault, hazing and furnishing alcoholic beverages to a minor under 21 after the death of Timothy Piazza, 19. Editing by Gina Cherelus, Steve Orlofsky and Susan Thomas", "external_links": [], "published": "2018-01-08T19:32:00.000+02:00", "crawled": "2018-01-08T19:49:36.009+02:00", "highlightTitle": ""}