{"organizations": [], "uuid": "2f0cbe17cddc5f1f4a01bafff449f0b35f657549", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218854257&w=1200&r=LYNXMPEE010SW", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-che-conte/conte-confident-luiz-will-stay-at-chelsea-in-january-window-idUKKBN1ER1H9", "country": "US", "domain_rank": 408, "title": "Conte confident Luiz will stay at Chelsea in January window", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T19:33:00.000+02:00", "replies_count": 0, "uuid": "2f0cbe17cddc5f1f4a01bafff449f0b35f657549"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-che-conte/conte-confident-luiz-will-stay-at-chelsea-in-january-window-idUKKBN1ER1H9", "ord_in_thread": 0, "title": "Conte confident Luiz will stay at Chelsea in January window", "locations": [], "entities": {"persons": [{"name": "conte", "sentiment": "positive"}, {"name": "luiz", "sentiment": "positive"}, {"name": "david luiz", "sentiment": "none"}, {"name": "antonio conte", "sentiment": "none"}, {"name": "david", "sentiment": "none"}], "locations": [{"name": "janua", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "stamford bridge", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "chelsea", "sentiment": "positive"}, {"name": "brighton & hove albion", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "west bromwich albion", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 5:35 PM / Updated an hour ago Conte confident Luiz will stay at Chelsea in January window Reuters Staff 3 Min Read \n(Reuters) - Chelsea manager Antonio Conte says he expects his entire squad to remain at the club in the January transfer window -- including out-of-favour defender David Luiz. FILE PHOTO - Soccer Football - Premier League - Chelsea vs Brighton & Hove Albion - Stamford Bridge, London, Britain - December 26, 2017 Chelsea manager Antonio Conte at the end of the match REUTERS/Hannah Mckay \nThe Brazilian was dropped for Chelsea’s league matches against Manchester United, West Bromwich Albion and Liverpool in November before sustaining a knee injury that has kept him out of the reigning Premier League champions’ recent games. \nConte has maintained that Luiz’s omission was for tactical reasons but media reports have constantly suggested there is a rift between the Brazilian and his manager, and the 30-year-old has been linked with several top clubs. \n“David improved a lot his physical condition in the last couple of days. He worked with us and I think he could be in contention for the Norwich game (on Saturday),” Conte told a news conference ahead of Wednesday’s league game at Arsenal. \n“I‘m very happy to work with these players. I don’t see a problem.” \nHowever, he did not rule out completely the possibility that some unsettled players might move on. “I understand if some players are not playing regularly and want to leave,” he said. \nBut he added: “My expectation is all the players we have in the squad will stay here and continue to work. Our squad is not big and for this reason it’s impossible to send on loan or sell one player if we don’t sign another player.” \nThe Italian also dismissed reports that Chelsea were trying to sign Juventus defender Giorgio Chiellini, whose contract with the Serie A side expires at the end of June. \n“Giorgio is a fantastic player but I think he wants to finish his career at Juventus. I think it’s right to finish his career in this way,” Conte -- a former Juventus manager -- added. \n“A lot of speculation is normal when the transfer window starts. It’s a difficult moment for every coach.” \nConte also said that Chelsea would not recall any of their players who are on loan at other clubs in January. \nChampions Chelsea, who are third in the league, travel to fifth-placed Arsenal followed by an FA Cup tie at Norwich City on Saturday. Reporting by Aditi Prakash in Bengaluru,; Editing by Neville Dalton", "external_links": [], "published": "2018-01-02T19:33:00.000+02:00", "crawled": "2018-01-02T20:04:37.010+02:00", "highlightTitle": ""}