{"organizations": [], "uuid": "240ae80beec888af65ba47afbc6cd637134fe7fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-russia-wto/u-s-quizzes-moscow-at-wto-over-made-in-russia-laws-idUSKBN1FD1KY", "country": "US", "domain_rank": 408, "title": "U.S. quizzes Moscow at WTO over 'made in Russia' laws", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T20:15:00.000+02:00", "replies_count": 0, "uuid": "240ae80beec888af65ba47afbc6cd637134fe7fa"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-russia-wto/u-s-quizzes-moscow-at-wto-over-made-in-russia-laws-idUSKBN1FD1KY", "ord_in_thread": 0, "title": "U.S. quizzes Moscow at WTO over 'made in Russia' laws", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "geneva", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}, {"name": "wto", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GENEVA (Reuters) - The United States asked Russia to explain how laws prioritizing the purchase of domestically produced goods can comply with World Trade Organization rules, according to a filing published on Wednesday.\nWTO rules generally ban policies that discriminate against importers, and since the global financial crisis a series of disputes have arisen over governments telling manufacturers to source a certain proportion of their inputs from national firms.\nThe U.S. statement on “made in Russia” listed 10 measures it said Moscow had taken since 2015 to prioritize Russian goods and services, and posed four questions about how the system worked.\n“The United States has already asked Russia for information on a number of these measures, but has not yet received any answers,” it said.\nThe United States, traditionally quick to challenge any apparent breach of the rules, has under President Donald Trump focused particularly on perceptions of unfair trading in state-dominated economies, with China and Vietnam already singled out.\nIt has also imposed high tariffs on a range of imported goods, this week adding solar panels and washing machines to the list, as part of a protectionist agenda billed by Trump as a way of safeguarding American jobs.\nRussia’s economy took a hit in 2014 after the United States and the European Union imposed sanctions over Moscow’s annexation of Crimea, and ramped them up as pro-Russian separatist unrest spread to eastern Ukraine. Russia retaliated by limiting food imports from a range of Western countries.\nUntil 2015 state-backed firms were required to prioritize Russian-made goods, but under law enacted that July other firms - including those with big projects and minority state funding - were also expected to do so.\nIn 2014, Russia had also made it a priority for state-owned firms to source industrial products locally and gave the government a role in setting the terms of purchasing contracts, it said.\n“Taken together, these laws grant the Government of Russia the authority to restrict the purchasing decisions of a large part of the Russian economy, separate and distinct from government procurement,” the U.S. statement said.\nThe trade ministry in Moscow did not immediately respond to a request from Reuters for comment.\nAt the end of 2017, President Vladimir Putin signed a law authorizing “made in Russia” requirements for aircraft and ships when purchased by one of the defined entities, it said.\nReporting by Tom Miles; editing by John Stonestreet\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T20:15:00.000+02:00", "crawled": "2018-01-24T15:13:10.031+02:00", "highlightTitle": ""}