{"organizations": [], "uuid": "fb53f56e224756309c0f45501972c9c6b3ec2427", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104932952-GettyImages-902386128.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/08/read-oprah-winfreys-golden-globes-speech.html", "country": "US", "domain_rank": 767, "title": "Read Oprah Winfrey’s Golden Globes speech", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T13:39:00.000+02:00", "replies_count": 0, "uuid": "fb53f56e224756309c0f45501972c9c6b3ec2427"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/08/read-oprah-winfreys-golden-globes-speech.html", "ord_in_thread": 0, "title": "Read Oprah Winfrey’s Golden Globes speech", "locations": [], "entities": {"persons": [{"name": "oprah winfrey", "sentiment": "negative"}, {"name": "cecil b. demille", "sentiment": "negative"}, {"name": "sidney poitier", "sentiment": "none"}, {"name": "oprah", "sentiment": "none"}, {"name": "winfrey", "sentiment": "none"}, {"name": "reese", "sentiment": "none"}, {"name": "anne bancroft", "sentiment": "none"}, {"name": "reese witherspoon", "sentiment": "none"}, {"name": "seth meyers", "sentiment": "none"}], "locations": [{"name": "milwaukee", "sentiment": "none"}], "organizations": [{"name": "golden globes", "sentiment": "negative"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oprah Winfrey accepted the Golden Globes' Cecil B. DeMille Award for lifetime achievement with a rousing acceptance speech that began as a personal reflection and ended as a call to arms.\nMore from The New York Times:\nPresident Oprah? After the Golden Globes, Some Have a 2020 Vision\nThe Golden Globe Gets (Halfway) Woke\nSeth Meyers's Golden Globes Opening Monologue: Transcript\nAfter being introduced by Reese Witherspoon, she acknowledged the significance of becoming the first black woman to win the award, and said she hoped that the raised voices of her fellow actresses might lead to a world in which \"nobody ever has to say, 'Me too,' again.\"\nHere is a full transcript of Ms. Winfrey's speech:\nAh! Thank you. Thank you all. O.K., O.K. Thank you, Reese. In 1964, I was a little girl sitting on the linoleum floor of my mother's house in Milwaukee, watching Anne Bancroft present the Oscar for best actor at the 36th Academy Awards. She opened the envelope and said five words that literally made history: \"The winner is Sidney Poitier.\" Up to the stage came the most elegant man I had ever seen. I remember his tie was white, and of course his skin was black. And I'd never seen a black man being celebrated like that. And I've tried many, many, many times to explain what a moment like that means to a little girl — a kid watching from the cheap seats, as my mom came through the door bone-tired from cleaning other people's houses. But all I can do is Quote: and say that the explanation's in Sidney's performance in \"Lilies of the Field\": \"Amen, amen. Amen, amen.\" In 1982, Sidney received the Cecil B. DeMille Award right here at the Golden Globes, and it is not lost on me that at this moment there are some little girls watching as I become the first black woman to be given this same award.\nIt is an honor, and it is a privilege to share the evening with all of them, and also with the incredible men and women who've inspired me, who've challenged me, who've sustained me and made my journey to this stage possible. Dennis Swanson, who took a chance on me for \"A.M. Chicago\"; Quincy Jones, who saw me on that show and said to Steven Spielberg, \"Yes, she is Sophia in 'The Color Purple'\"; Gayle, who's been the definition of what a friend is; and Stedman, who's been my rock — just a few to name. I'd like to thank the Hollywood Foreign Press Association, because we all know that the press is under siege these days.\nBut we also know that it is the insatiable dedication to uncovering the absolute truth that keeps us from turning a blind eye to corruption and to injustice. To tyrants and victims and secrets and lies. I want to say that I value the press more than ever before, as we try to navigate these complicated times. Which brings me to this: What I know for sure is that speaking your truth is the most powerful tool we all have. And I'm especially proud and inspired by all the women who have felt strong enough and empowered enough to speak up and share their personal stories. Each of us in this room are celebrated because of the stories that we tell. And this year we became the story. But it's not just a story affecting the entertainment industry. It's one that transcends any culture, geography, race, religion, politics or workplace.\nSo I want tonight to express gratitude to all the women who have endured years of abuse and assault, because they — like my mother — had children to feed and bills to pay and dreams to pursue. They're the women whose names we'll never know. They are domestic workers and farmworkers; they are working in factories and they work in restaurants, and they're in academia and engineering and medicine and science; they're part of the world of tech and politics and business; they're our athletes in the Olympics and they're our soldiers in the military.\nAnd they're someone else: Recy Taylor, a name I know and I think you should know, too. In 1944, Recy Taylor was a young wife and a mother. She was just walking home from a church service she'd attended in Abbeville, Ala., when she was abducted by six armed white men, raped and left blindfolded by the side of the road, coming home from church. They threatened to kill her if she ever told anyone, but her story was reported to the N.A.A.C.P., where a young worker by the name of Rosa Parks became the lead investigator on her case and together they sought justice. But justice wasn't an option in the era of Jim Crow. The men who tried to destroy her were never persecuted. Recy Taylor died 10 days ago, just shy of her 98th birthday. She lived, as we all have lived, too many years in a culture broken by brutally powerful men. And for too long, women have not been heard or believed if they dared to speak their truth to the power of those men. But their time is up. Their time is up. Their time is up.\nAnd I just hope that Recy Taylor died knowing that her truth — like the truth of so many other women who were tormented in those years, and even now tormented — goes marching on. It was somewhere in Rosa Parks's heart almost 11 years later, when she made the decision to stay seated on that bus in Montgomery. And it's here with every woman who chooses to say, \"Me too.\" And every man — every man — who chooses to listen. In my career, what I've always tried my best to do, whether on television or through film, is to say something about how men and women really behave: to say how we experience shame, how we love and how we rage, how we fail, how we retreat, persevere, and how we overcome. And I've interviewed and portrayed people who've withstood some of the ugliest things life can throw at you, but the one quality all of them seem to share is an ability to maintain hope for a brighter morning — even during our darkest nights.\nSo I want all the girls watching here and now to know that a new day is on the horizon! And when that new day finally dawns, it will be because of a lot of magnificent women, many of whom are right here in this room tonight, and some pretty phenomenal men, fighting hard to make sure that they become the leaders who take us to the time when nobody ever has to say, 'Me too' again. Thank you.\"\nWatch: Oprah Winfrey Receives Cecil B. de Mille Award at the 2018 Golden Globes", "external_links": [], "published": "2018-01-08T13:39:00.000+02:00", "crawled": "2018-01-08T14:10:39.008+02:00", "highlightTitle": ""}