{"organizations": [], "uuid": "1ec667a73cc564a789094bfc377e519716aeb519", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219005223&w=1200&r=LYNXMPEE020DC", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/china-pollution-beijing/beijing-meets-2017-air-pollution-target-set-under-2013-clean-up-plan-idINKBN1ES0JN", "country": "US", "domain_rank": 408, "title": "Beijing meets 2017 air pollution target set under 2013 clean-up plan", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T11:20:00.000+02:00", "replies_count": 0, "uuid": "1ec667a73cc564a789094bfc377e519716aeb519"}, "author": "", "url": "https://in.reuters.com/article/china-pollution-beijing/beijing-meets-2017-air-pollution-target-set-under-2013-clean-up-plan-idINKBN1ES0JN", "ord_in_thread": 0, "title": "Beijing meets 2017 air pollution target set under 2013 clean-up plan", "locations": [], "entities": {"persons": [], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "beijing municipal environmental protection bureau", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - China’s smog-prone capital Beijing met its air quality targets last year following a crackdown on polluters and a sustained period of favourable weather, the local environmental agency said in a statement on Wednesday.\nPeople walk on a smoggy street from pollution on the last day of 2017, in Shanghai, China December 31, 2017. REUTERS/Aly Song The yearly average concentrations of particulate matter with a length of 2.5 microns or less, known as PM2.5 and which damage the lungs when inhaled, dropped by 35.6 percent in 2017 from 2012 to 58 micrograms per cubic metre, the Beijing Municipal Environmental Protection Bureau said.\nThe figures were in line with Reuters estimates made last week.\nThe Chinese capital was ordered to cut PM2.5 concentrations to less than 60 micrograms as part of a 2013 action plan designed to head off public anger about rising pollution.\nThe city has since closed nearly 2,000 factories in the cement, foundry and furniture-making sectors, shut down coal-fired power plants and eliminated over 2 million high-emission vehicles over the past five years.\nBeijing, along with 27 other northern Chinese cities, is part of a government campaign that started in October to ensure the 2017 targets were met.\nAs the region prepared to switch on residential winter heating systems, it started phasing out coal-fired boilers and switching to gas- or electric-powered equipment. It has also shut or curbed production at heavy industrial plants to limit smog build-ups.\nBut the city’s environment agency acknowledged that drier and windier weather conditions played a role in meeting air quality targets for the year, especially in the fourth quarter.\nThe government blamed bad weather for the near-record levels of smog last January and February, which saw PM2.5 readings spike by 26.7 percent in the key Beijing-Tianjin-Hebei region in the first quarter of 2017.\nThe province of Hebei, which surrounds Beijing and is a major source of smog drifting over the capital, also saw PM2.5 concentrations decline 7.1 percent from a year ago to 65 micrograms in 2017, the province’s environmental protection bureau said on Tuesday.\nBut the region is still some distance away from meeting its official PM2.5 standard of 35 micrograms. The World Health Organization recommends levels of no more than 10 micrograms.\n“Current air pollutant levels remain a lot higher than the national air quality standard, indicating the improvement in air quality will still be a long-term process,” Beijing’s environment agency said.\nReporting by Muyu Xu in Beijing and David Stanway in Shanghai\n ", "external_links": [], "published": "2018-01-03T11:20:00.000+02:00", "crawled": "2018-01-03T11:35:40.028+02:00", "highlightTitle": ""}