{"organizations": [], "uuid": "ec5771b75e4a043abd7a4027098aab50763e0b67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1220063695&w=1200&r=LYNXMPEE060JO", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-cup/newport-provide-cup-heroics-to-beat-leeds-west-ham-held-idUKKBN1EW0OH", "country": "US", "domain_rank": 408, "title": "Newport provide Cup heroics to beat Leeds, West Ham held", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T19:11:00.000+02:00", "replies_count": 0, "uuid": "ec5771b75e4a043abd7a4027098aab50763e0b67"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-cup/newport-provide-cup-heroics-to-beat-leeds-west-ham-held-idUKKBN1EW0OH", "ord_in_thread": 0, "title": "Newport provide Cup heroics to beat Leeds, West Ham held", "locations": [], "entities": {"persons": [{"name": "martyn herman", "sentiment": "none"}, {"name": "reuters/rebecca naden", "sentiment": "none"}, {"name": "mark hughes", "sentiment": "none"}, {"name": "shawn mccoulsky", "sentiment": "none"}], "locations": [{"name": "newport", "sentiment": "none"}, {"name": "stoke city", "sentiment": "none"}, {"name": "newport county", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "west ham", "sentiment": "negative"}, {"name": "leeds", "sentiment": "negative"}, {"name": "leeds united - rodney parade", "sentiment": "none"}, {"name": "shrewsbury town", "sentiment": "none"}, {"name": "coventry city", "sentiment": "none"}, {"name": "west ham united", "sentiment": "none"}, {"name": "leeds united", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 4:23 PM / Updated 14 minutes ago Arsenal crash out to Forest, Newport stun Leeds Martyn Herman 4 Min Read \nLONDON (Reuters) - Holders Arsenal crashed out of the FA Cup to second-tier Nottingham Forest and Newport County stunned former winners Leeds United as the FA Cup third round burst into life on Sunday. Soccer Football - FA Cup Third Round - Nottingham Forest vs Arsenal - The City Ground, Nottingham, Britain - January 7, 2018 Nottingham Forest's Ben Brereton shoots at goal as Arsenal's Rob Holding challenges Action Images via Reuters/Carl Recine \nThe biggest story of the round was saved until the final kickoff of the weekend as Arsenal suffered a 4-2 defeat at the City Ground where American Eric Lichaj scored twice for the second-tier side who sacked manager Mark Warburton a week ago. \nThirteen-times FA Cup winners Arsenal paid dearly for fielding a weakened side as they lost in the third round for the first time in manager Arsene Wenger’s two-decade reign. \nUntil then fourth-tier Newport County had staked a claim for the biggest upset of the weekend with a 2-1 win over Leeds -- substitute Shawn McCoulsky heading a last-minute winner the day after his 21st birthday. \nOn Saturday 1987 winners Coventry City, who are now languishing in the fourth tier, knocked out Premier League strugglers Stoke City by the same score -- a result that cost Stoke boss Mark Hughes his job. \nTop flight West Ham United also flirted with danger at League One (third-tier) high-flyers Shrewsbury Town on Sunday, escaping with a 0-0 draw after being largely outplayed. \n“We were terrible today and Shrewsbury were really good,” West Ham keeper Joe Hart, who began his career at Shrewsbury, said. “There was some terrible football played today.” \nEight-times winners Tottenham Hotspur had no trouble at home to third-tier AFC Wimbledon as Harry Kane struck twice in two minutes in the second half of a 3-0 home win. \nArsenal made nine changes to the side that drew impressively with Chelsea on Wednesday, although they still started heavy favourites against a Forest side featuring seven under 23s. \nThey could have few complaints though. \nLichaj gave Forest the lead and although Per Mertesacker levelled for the visitors, Lichaj scored a stunning volley to put Forest back ahead just before halftime. \nPenalties by Ben Brereton and Kieran Dowell sealed victory for caretaker boss Gary Brazil’s side, even if Dowell’s strike caused controversy because it appeared he had made double contact with the ball. Soccer Football - FA Cup Third Round - Newport County AFC vs Leeds United - Rodney Parade, Newport, Britain - January 7, 2018 Newport County's Shawn McCoulsky celebrates scoring their second goal with team mates REUTERS/Rebecca Naden \nDanny Welbeck had pulled Arsenal back to 3-2. \n“This has got to be something we build on,” Brazil, trying to revive the former English and European champions from the lower regions of the Championship, said. \n“This football club should be playing against the Arsenals of this world, and they should be beating them.” \nWenger, who watched from the stands because of a three-match touchline ban, refused to blame his team selection. Slideshow (13 Images) \n“We played a very good Forest team who were sharp and focused. The challenges were decisive. Overall our performance wasn’t good enough,” he said. \n“When you don’t win the selection is always questioned. I believe we had an experienced team -- eight or nine internationals. It would be easy to think that was the problem.” \nEarlier in the day Rodney Parade in south Wales had supplied some old-fashioned Cup magic as Newport became the latest underdogs to embarrass once mighty Leeds -- sparking a joyful pitch invasion by the home faithful. \nGaetano Berardi’s deflected ninth-minute strike had looked like winning the tie for Leeds, who were knocked out by minor league Sutton United last season, but Conor Shaughnessy’s own goal 15 minutes from time set up a thrilling climax. \nMcCoulsky ensured it was one of the best days in modest Newport’s history with an unstoppable header. \n“I can’t remember most of it, it was a blur to be honest. It is definitely one of my best goals, to knock Leeds out of the FA Cup is what dreams are made of,” he said. \nLeeds also suffered a shock Cup defeat across the other side of the Severn Bridge in 2002, falling to Cardiff at a time when Leeds were Premier League title contenders. \nTo complete a dismal day for Leeds they had substitute Samuel Saiz sent off in stoppage time. Reporting by Martyn Herman; Editing by Toby Davis and Pritha Sarkar", "external_links": [], "published": "2018-01-07T19:11:00.000+02:00", "crawled": "2018-01-07T19:26:23.000+02:00", "highlightTitle": ""}