{"organizations": [], "uuid": "47ed339b41e1d1cf9978141e75b4d3d0b8a07444", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/cnbc-interview-with-jll-president-ceo-christian-ulbrich-from-the-world-economic-forum-2018.html", "country": "US", "domain_rank": 767, "title": "CNBC Interview with JLL President & CEO Christian Ulbrich from the World Economic Forum 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T14:09:00.000+02:00", "replies_count": 0, "uuid": "47ed339b41e1d1cf9978141e75b4d3d0b8a07444"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/cnbc-interview-with-jll-president-ceo-christian-ulbrich-from-the-world-economic-forum-2018.html", "ord_in_thread": 0, "title": "CNBC Interview with JLL President & CEO Christian Ulbrich from the World Economic Forum 2018", "locations": [], "entities": {"persons": [{"name": "christian ulbrich", "sentiment": "negative"}, {"name": "akiko fujita", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "cnbc interview", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Following are excerpts from a CNBC interview with Christian Ulbrich, JLL President & CEO, and CNBC's Akiko Fujita from the World Economic Forum 2018.\nAF: And to talk much more about Brexit, as well as other factors affecting the global property markets right now, we are joined by Christian Ulbrich, who is the CEO of JLL. Welcome!\nCU: Good morning.\nAF: Let's start on Brexit here, because there's no question the uncertainty surrounding the entire process has affected property markets right now. What are you seeing right now, in terms of where the decisions are being made, and how certain people are about the direction the UK will take, post-Brexit?\nCU: Well, I mean, there is still a strong element of uncertainty, we saw that after the vote in 2016, where the market really stalled. In 2017, we saw a bit of a rebound, because people had to play catchup with their decisions, but the real impact is still to come-,\nAF: Mm.\nCU: So, I would be quite cautious on the outlook for 2018. You can't just leave a market of 500 million consumers, without having an impact.\nAF: Mm.\nCU: So, real estate is a long-term investment, so people will be cautious to take their decisions going forward. In 2017, we saw a lot of money coming from Hong Kong in to the safe haven of London, which was not Brexit-related, that was just the safe haven element, but now, as the whole date is coming closer, the impact of a Brexit will come more in to real estate again.\nAF: Yes. You talk about the money coming in from Asia, you're talking about your Top 30 Cities index here, it's interesting, London overtook New York as the biggest global city for investments. Aside from the money coming in from Asia, what other factors are people seeing in putting their money in what is a very uncertain market?\nCU: Well, London is the global city, and we have a great governance, a very strong legal system, strong transparency in that market, so, these factors will still be there after a Brexit, and so that has been a big driver in 2017. But, going forward, you will see that the economy will have an impact. Now, the UK, on its own, will have the opportunity to drive their regulation their own way, their tax system their own way, so there will still-, there will still be a very strong influx of money, but, in-, in absolute terms, they will, kind of, lose out against other global cities.\nAF: Mm. One of the other things I thought was interesting in this index, investors viewing cities less by national or regional clusters. They're looking at it in a bit more a scientific way, here, it seems like there are identities being formed. What shifts are you seeing on that front, and how much of that is driven by the workplace, by these companies perhaps moving away from some of the big cities?\nCU: Yeah, well, I mean, if you are a leader of a city, you have to look at your right benchmarks, and, if we stick with London, the benchmark for London is not Manchester or Birmingham. The benchmark could be Singapore or Paris, or New York. And so you have that with all kinds of city clusters, so you have to look, what is your benchmark? And so, you have these tech clusters, and you look at other cities where you have tech clusters, and-, and talent plays an important role for a city's future going forward. You have to attract the best talent in, and, what has shifted, over the last ten years-, ten years ago, the talent would move to the company-,\nAF: Mm.\nCU: Whereas, today, the company has to move to the talent. So, companies really have to analyze, where do they find the best talent, and that's where they have to move to, and that is driven by clusters. So, when you are looking at the Silicon Valley, you have companies competing for talent in the Silicon Valley, but you also-, you also see, now, talent moving in to Houston, so companies have to move to Houston. So, that would be a comparison for that type of talent, and-, and that is a big shift.\nAF: When you look at the moves last year, at real estate prices globally, coming on the back of a tough year here for property funds, you know, especially given that so much money was poured in to the equity markets. There's a sense, here, that perhaps things could be getting a bit more frothy. Do you see the pendulum swinging back, especially in the US, where, perhaps, commercial real estate is expected to be a big beneficiary of the Trump tax reform?\nCU: Yes, what we saw last year is that the transaction volume actually came down 10 to 15% in the US-,\nAF: Mm.\nCU: And there is, clearly, some type of a correlation with these extremely low interest rates, and the influx of money in to real estate. So, with the expectations that interest rates are continuing to rise, you will see a bit of investors reflecting on whether they should still allocate so much more money in to real estate than they did in the past. Now, we believe this is a very strong macro trend, that the influx in to real estate will continue to grow, but maybe at a slower pace than we have seen over the last couple of years. With regards to the tax reform, we will have to see how that really plays out. I think we-, we should be quite cautious, in drawing conclusions too early. There will be benefits for companies, going forward, but, as we know, many global companies first have to pay a big amount of money before they have the benefits, and so, let's see how that plays out. We-, we have seen, over the last couple of days, other decisions which are clearly not as favorable for global economy, and, I don't think, for the US economy, so, I want to wait how that is playing out later on.\nAF: Yes, no question we have seen the hits that some of these companies have taken on that write-down-,\nCU: Right.\nAF: At least it coming in the earnings. Thanks so much for joining us today, Christian Ulbrich, joining us from JLL, and Willem, I'll toss it back to you in London.\nENDS", "external_links": [], "published": "2018-01-24T14:09:00.000+02:00", "crawled": "2018-01-24T15:09:45.015+02:00", "highlightTitle": ""}