{"organizations": [], "uuid": "0d1e85c5b3362c3758897fec81f54e1e1a6b736e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219703450&w=1200&r=LYNXMPEE0419N", "site_section": "http://feeds.reuters.com/Reuters/PoliticsNews\r", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-epa-pruitt/u-s-epa-chief-pruitt-interested-in-attorney-general-job-sources-idUSKBN1EU24B", "country": "US", "domain_rank": 408, "title": "EPA chief Pruitt interested in attorney general job: sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T00:19:00.000+02:00", "replies_count": 0, "uuid": "0d1e85c5b3362c3758897fec81f54e1e1a6b736e"}, "author": "", "url": "https://www.reuters.com/article/us-usa-epa-pruitt/u-s-epa-chief-pruitt-interested-in-attorney-general-job-sources-idUSKBN1EU24B", "ord_in_thread": 0, "title": "EPA chief Pruitt interested in attorney general job: sources", "locations": [], "entities": {"persons": [{"name": "valerie volcovici", "sentiment": "negative"}, {"name": "pruitt", "sentiment": "negative"}, {"name": "bara", "sentiment": "none"}, {"name": "jeff sessions", "sentiment": "none"}, {"name": "scott pruitt", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "david shepardson", "sentiment": "none"}, {"name": "jahan wilcox", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "oklahoma", "sentiment": "none"}], "organizations": [{"name": "epa", "sentiment": "negative"}, {"name": "u.s. environmental protection agency", "sentiment": "none"}, {"name": "republican trump", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - U.S. Environmental Protection Agency chief Scott Pruitt, the conservative former attorney general of Oklahoma, is interested in replacing Attorney General Jeff Sessions if that job becomes available, sources with knowledge of the matter said on Friday.\nPresident Donald Trump has openly criticized Sessions for months, provoking speculation that the attorney general might resign or be fired. The EPA chief would likely accept the position if it were offered by Trump, a source close to Pruitt told Reuters, speaking on condition of anonymity.\nJahan Wilcox, an EPA spokesman, in an email denied that Pruitt was interested in serving as attorney general.\n“This is not true,” Wilcox said.\n“Administrator Pruitt is solely focused on implementing President Trump’s agenda to protect the environment,” Wilcox added.\nThe White House did not respond to a request for comment.\nAs EPA chief, Pruitt has worked to overturn a number of environmental policies put in place under Republican Trump’s Democratic predecessor Barack Obama and was instrumental in the U.S. decision to walk away from the 2015 Paris global climate change accord.\nPruitt was the runner-up to Sessions for the attorney general post when Trump was first assembling his Cabinet, according to the source.\nEnvironmental Protection Agency Administrator Scott Pruitt speaks during an interview for Reuters at his office in Washington, U.S., July 10, 2017. REUTERS/Yuri Gripas Another source said Pruitt felt that serving as attorney general -- the top U.S. law enforcement post -- would be a better fit for him than his current job or running either for governor or senator in his home state.\nNews organization Politico first reported Pruitt’s interest in the attorney general job.\nTrump has been at odds with Sessions since the attorney general recused himself in March from the federal investigation into potential collusion between the Trump’s presidential campaign and Russia in the 2016 U.S. election. Pressure on Sessions has been rising, and some conservative Republican lawmakers have called on him to resign.\nThe White House said Pruitt will attend a weekend meeting at the Camp David presidential retreat in Maryland with Trump, other Cabinet members and Republican congressional leaders to lay out legislative priorities for the year and discuss a strategy for the November congressional elections.\nSessions will not attend, his office said.\nPruitt served as Oklahoma’s attorney general prior to taking the EPA job, suing the EPA 14 times, each time taking the side of industry. As EPA chief, he has spearheaded an aggressive de-regulatory agenda that has begun to unwind Obama administration policies on climate change, air pollution and water pollution.\nEnvironmental activists expressed alarm over the potential of Pruitt as attorney general.\n“If Scott Pruitt becomes attorney general, he’d go from tearing down public health protections at EPA at the behest of polluters, to looking the other way at the Justice Department when they break the law,” Environmental Working Group President Ken Cook said.\nReporting by Valerie Volcovici and David Shepardson; Additional reporting by Roberta Rampton; Editing by Will Dunham\n ", "external_links": [], "published": "2018-01-06T00:19:00.000+02:00", "crawled": "2018-01-06T00:32:22.030+02:00", "highlightTitle": ""}