{"organizations": [], "uuid": "0cae9347e334e927a1fb00a335bdd218c1b65f16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226240177&w=1200&r=LYNXMPEE0S0JI", "site_section": "http://feeds.reuters.com/reuters/UKStocksAndSharesNews/", "section_title": "Reuters: Stocks & Shares News", "url": "https://uk.reuters.com/article/uk-europe-view-monday/daily-briefing-next-move-on-brexit-idUKKBN1FI0SJ", "country": "US", "domain_rank": 408, "title": "Daily Briefing: Next move on Brexit", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T10:47:00.000+02:00", "replies_count": 0, "uuid": "0cae9347e334e927a1fb00a335bdd218c1b65f16"}, "author": "", "url": "https://uk.reuters.com/article/uk-europe-view-monday/daily-briefing-next-move-on-brexit-idUKKBN1FI0SJ", "ord_in_thread": 0, "title": "Daily Briefing: Next move on Brexit", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "ann taylor", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "brexit reuters", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "house of lords constitution committee", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 8:48 AM / Updated an hour ago Daily Briefing: Next move on Brexit Reuters Staff 7 Min Read \nLONDON (Reuters) - EU countries are scheduled to sign off on a joint negotiating stance in talks with Britain on the two-year transition phase intended to create a soft landing for Brexit. \nAccording to a draft of the mandate seen by Reuters last week, they are ready to offer some flexibility: a readiness to amend a period set to last just 21 months; to consider letting London sign trade deals with other countries around the world before 2021; and to launch new EU-British partnerships in areas like security and defence during the transition. “We acknowledge the scale, challenge and unprecedented nature of the task of converting existing EU law into UK law, but as it stands this bill is constitutionally unacceptable” Ann Taylor, chairwoman of the House of Lords Constitution Committee \nMeanwhile PM Theresa May is facing a new challenge at home as lawmakers in the House of Lords upper chamber demand changes to the legislation setting out Brexit. Its Constitution Committee said the bill contained \"fundamental flaws\", including ministerial powers it considers too sweeping. Not enough to halt the Brexit process but it could cause delays as the clock keeps ticking. \nRomania’s new government cabinet, the third in just a year, should easily win a vote of confidence in parliament today given the ruling PSD party’s strong majority. PM Viorica Dancila’s team will however be mainly judged by voters and investors by its ability to tackle high-level corruption. \nEyebrows have already been raised at her decision to create a new ministry to handle EU funds and nominate as its head a lawmaker whom anti-corruption prosecutors have tried to investigate . \nTheir attempt to investigate Rovana Plumb, the official in question, was one of several blocked by Romanian parliament - a practice which the EU has sharply criticised. She has denied any wrongdoing in the land transfer case under scrutiny. \nRussian opposition leader Alexei Navalny was released from police custody late on Sunday after he made a brief appearance at a rally in Moscow calling for the boycott of a March presidential election that he said would be a rigged. \nNavalny has little chance of influencing the election, likely to be won comfortably by President Vladimir Putin, and so has opted to call for a boycott in an effort to make the final turnout look embarrassingly low. However, the numbers of supporters attending Sunday’s protests across Russia appeared lower than previous demonstrations staged by him, reporters on the ground said. FILE PHOTO: Romania's prime minister designate Viorica Dancila delivers a speech in Bucharest \nMARKETS \nAfter all the Davos-speak and dollar wobbles of last week, U.S. stocks went on to stage one of their best days in almost a year on Friday – with the S&P500 gaining more than 1 percent to new records ahead of the big week for tech sector earnings. \nMicrosoft and Facebook report Wednesday and Apple, Amazon and Alphabet on Thursday with annual aggregate earnings for the fourth quarter now tracking above 13 percent with almost a quarter of the S&P500 now reported. \nThe stock market acceleration, which saw the S&P gain of more than 1 percent in a day for only the fifth time in a year, took MSCI’s all-country world index year-to-date gains above 7 percent – on course for a record 15th straight month of gains and clocking the longest winning streak of weekly gains since 1999. \nThe heat of the equities rally is fuelling the tax-cut related ‘melt up’ speculation and starting to unnerve bond markets, where 10-year Treasury have topped 2.70 percent for the first time since 2014. \nGerman bond yields are moving higher too despite last week’s European Central Bank meeting warning about the impact on inflation of a rising euro. Five-year German bund yields moved into positive territory early on Monday for the first time since late 2015, egged on by comments from Dutch central bank chief Knot that the ECB should be clear on ending asset purchases after September . \nAlthough the ViX equity volatility gauge ended lower just above 11 percent on Friday, the more febrile bond market environment and some firming of the dollar – as U.S. President Trump on Friday tried to row back on his Treasury Secretary’s endorsement of a weak currency – stalled Asia’s stock markets on Monday. Shanghai and HK ended in the red, with China’s blue chips recording their worst day in two months. \nJapan’s Nikkei ended flat, however, while South Korea’s Kospi bucked the trend to gain almost 1 percent ahead of the big tech sector week. European stocks are marked higher ahead of heavy week of earnings this side of the Atlantic too. \nThe dollar index was about 0.2 percent higher, while euro/dollar was probing back below $1.24. Oil and commodities prices were firm, with Brent holding above $70 and zinc prices capturing attention with gains to more than 10 year highs. Editing by Toby Chopra", "external_links": [], "published": "2018-01-29T10:47:00.000+02:00", "crawled": "2018-01-29T12:11:52.023+02:00", "highlightTitle": ""}