{"organizations": [], "uuid": "a1fb180efee5919b28341cfaf358399d72713ab1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226379417&w=1200&r=LYNXMPEE0S1G8", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-italy-election-candidates-5star/italys-5-star-presents-super-competent-candidates-for-election-idUKKBN1FI2FA", "country": "US", "domain_rank": 408, "title": "Italy's 5-Star presents 'super-competent' candidates for election", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T21:03:00.000+02:00", "replies_count": 0, "uuid": "a1fb180efee5919b28341cfaf358399d72713ab1"}, "author": "", "url": "https://uk.reuters.com/article/uk-italy-election-candidates-5star/italys-5-star-presents-super-competent-candidates-for-election-idUKKBN1FI2FA", "ord_in_thread": 0, "title": "Italy's 5-Star presents 'super-competent' candidates for election", "locations": [], "entities": {"persons": [{"name": "massimiliano di giorgio", "sentiment": "none"}, {"name": "silvio berlusconi", "sentiment": "none"}, {"name": "luigi di maio", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}], "organizations": [{"name": "min read  rome", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 6:58 PM / Updated 2 hours ago Italy's 5-Star presents 'super-competent' candidates for election Massimiliano Di Giorgio 3 Min Read \nROME (Reuters) - University professors, a businessman who lost his savings in a 2015 state bank bailout and a former Olympic athlete will run as candidates for the 5-Star Movement in Italy’s election, the anti-establishment group announced on Monday. \n5-Star, which has ridden a wave of dissatisfaction with conventional politics to become Italy’s most popular party, is fighting accusations of incompetence and inexperience from its mainstream rivals ahead of the March 4 ballot. \n“These aren’t competent people, they are super-competent,” 5-Star’s leader Luigi Di Maio told a news conference. \n“We firmly believe you need to put both head and heart into public policy. You need abilities but you also need sensitivity, humanity.” \nOpinion polls suggest 5-Star will get more votes than any other party but come in behind a centre-right alliance headed by former premier Silvio Berlusconi. Neither group looks set to win enough votes for a working majority, raising the chances there will be more talks to form alliances. \nCandidates presented on Monday included Lorenzo Fioramonti, a 40-year-old economics professor at the University of Pretoria, who has met foreign officials on 5-Star’s behalf in the past and is due to travel with Di Maio to London’s financial centre in the coming days. \nFioramonti enthusiastically backed 5-Star’s criticism of European Union rules, especially the Fiscal Compact which imposes budget cuts on high-debt countries like Italy. \n“I imagine changing the treaties, parameters and other things that are strangling our economy today,” said Fioramonti, who will run in a dilapidated suburb of Rome. \n5-Star has backed away from a pledge to hold a referendum on the euro, which had rattled financial markets. \nIn the Rome constituency where Prime Minister Paolo Gentiloni will run for the Democratic Party (PD), 5-Star’s candidate will be Angelo Cirulli, a businessman who was among thousands of retail investors to lose their savings during a state rescue of four regional banks. \n“Only 5-Star listened to us and shared our criticism,” Cirulli told the news conference. \nOlympic bronze medallist and judo coach Felice Mariani will also run for the movement, as will the head of Rome’s order of lawyers. Writing by Isla Binnie; editing by Ralph Boulton", "external_links": [], "published": "2018-01-29T21:03:00.000+02:00", "crawled": "2018-01-29T21:22:00.046+02:00", "highlightTitle": ""}