{"organizations": [], "uuid": "dd5bd9847cb9b77affd4e294fcb83bc996977f3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-myriad-receives-fda-approval-of-bracanalysis-cdxa-as-companion-diagnostic-for-lynparzaa-olaparib-in-patients-with.html", "country": "US", "domain_rank": 767, "title": "Myriad Receives FDA Approval of BRACAnalysis CDx® as Companion Diagnostic for Lynparza™ (olaparib) In Patients with Metastatic Breast Cancer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-12T19:16:00.000+02:00", "replies_count": 0, "uuid": "dd5bd9847cb9b77affd4e294fcb83bc996977f3d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-myriad-receives-fda-approval-of-bracanalysis-cdxa-as-companion-diagnostic-for-lynparzaa-olaparib-in-patients-with.html", "ord_in_thread": 0, "title": "Myriad Receives FDA Approval of BRACAnalysis CDx® as Companion Diagnostic for Lynparza™ (olaparib) In Patients with Metastatic Breast Cancer", "locations": [], "entities": {"persons": [{"name": "johnathan lancaster", "sentiment": "none"}, {"name": "merck", "sentiment": "none"}, {"name": "lynparza", "sentiment": "none"}], "locations": [{"name": "lake city", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "myriad genetics, inc.", "sentiment": "neutral"}, {"name": "fda", "sentiment": "neutral"}, {"name": "myriad genetics", "sentiment": "none"}, {"name": "u.s. food and drug administration", "sentiment": "none"}, {"name": "astrazeneca", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SALT LAKE CITY, Jan. 12, 2018 (GLOBE NEWSWIRE) -- Myriad Genetics, Inc. (NASDAQ:MYGN), a leader in molecular diagnostics and personalized medicine, today announced that the U.S. Food and Drug Administration (FDA) approved BRACAnalysis CDx® for use as a companion diagnostic by healthcare professionals to identify patients with HER2-negative metastatic breast cancer who have a germline BRCA mutation and are candidates for treatment with the PARP inhibitor Lynparza (olaparib), marketed by AstraZeneca and Merck, known as MSD outside of the U.S. and Canada. BRACAnalysis CDx is the first and only FDA-approved test for use in this indication.\n“This important advance underscores the need for patients with HER2-negative metastatic breast cancer to know their BRCA status with an FDA approved test to help ensure that they will receive the best available therapy,” said Johnathan Lancaster, M.D., Ph.D., chief medical officer of Myriad Genetics. “As shown in the OlympiAD study, Myriad’s BRACAnalysis CDx test was proven to accurately identify those patients who had a germline BRCA mutation and may benefit from Lynparza.”\nThe approval also adds to the body of knowledge about the clinical use and value of companion diagnostics to enable personalized medicine for people with cancer.\n“We congratulate AstraZeneca and Merck on obtaining FDA approval of Lynparza for patients with metastatic breast cancer, which is the first approval of a PARP inhibitor outside of ovarian cancer. As the pioneers in identifying likely responders to PARP inhibitors, we are excited to broaden the use of BRACAnalysis CDx as the companion diagnostic for this important new indication,” said Mark C. Capone, president and CEO, Myriad Genetics. “We will be actively working with all stakeholders to raise awareness so that patients can be immediately tested to determine if they are likely to benefit from Lynparza.”\nApproximately one in eight women are diagnosed with breast cancer in the United States, and one-third are diagnosed with or will progress to the metastatic stage of the disease.\n“There are more than 155,000 patients with metastatic breast cancer in the United States, and we estimate that 125,000 do not know their BRCA status,” said Lancaster. “This new FDA approval of BRACAnalysis CDx for patients with metastatic breast cancer significantly expands the population who can access BRCA testing and potentially benefit from PARP inhibition therapy.”\nThe collaboration with AstraZeneca to develop a novel companion diagnostic test to identify candidates for treatment with olaparib began in 2007. The new metastatic breast cancer indication is the second FDA approval of BRACAnalysis CDx for use in conjunction with Lynparza. In Dec. 2014, Myriad received FDA approval for BRACAnalysis CDx to help identify patients with advanced ovarian cancer who are eligible for fourth-line treatment with olaparib. BRACAnalysis CDx is Myriad’s first FDA-approved companion diagnostic and was the first-ever laboratory developed test approved by the FDA.\nAbout BRACAnalysis CDx®\nBRACAnalysis CDx is an in vitro diagnostic device intended for the qualitative detection and classification of variants in the protein coding regions and intron/exon boundaries of the BRCA1 and BRCA2 genes using genomic DNA obtained from whole blood specimens collected in EDTA. Single nucleotide variants and small insertions and deletions (indels) are identified by polymerase chain reaction (PCR) and Sanger sequencing. Large deletions and duplications in BRCA1 and BRCA2 are detected using multiplex PCR. Results of the test are used as an aid in identifying breast and ovarian cancer patients with deleterious or suspected deleterious germline BRCA variants, who are or may become eligible for treatment with Lynparza® (olaparib). Detection of deleterious or suspected deleterious germline BRCA variants by the BRACAnalysis CDx test in ovarian cancer patients is also associated with enhanced progression-free survival (PFS) from Zejula® (niraparib)maintenance therapy. This assay is for professional use only and is to be performed only at Myriad Genetic Laboratories, a single laboratory site located at 320 Wakara Way, Salt Lake City, UT 84108. Learn more at: http://myriadmychoice.com/ .\nAbout Lynparza\nLynparza (olaparib) is an innovative, first-in-class oral poly ADP-ribose polymerase (PARP) inhibitor that exploits tumor DNA damage response (DDR) pathway deficiencies to preferentially kill cancer cells. Lynparza is the foundation of AstraZeneca’s industry-leading portfolio of compounds targeting DNA damage response (DDR) mechanisms in cancer cells. Lynparza is currently approved in the United States for the maintenance treatment of adult patients with recurrent epithelial ovarian, fallopian tube or primary peritoneal cancer, who are in a complete or partial response to platinum-based chemotherapy and for the treatment of adult patients with deleterious or suspected deleterious germline BRCA-mutated advanced ovarian cancer who have been treated with three or more prior lines of chemotherapy. Patients are selected for therapy based on Myriad’s FDA-approved companion diagnostic. It is also approved by regulatory health authorities in the EU for use as monotherapy for the maintenance treatment of adult patients with platinum-sensitive relapsed BRCA-mutated (germline and/or somatic) high grade serous epithelial ovarian, fallopian tube or primary peritoneal cancer who are in response (complete or partial) to platinum-based chemotherapy.\nIn July 2017, AstraZeneca and Merck announced a global strategic oncology collaboration to jointly co-develop and co-commercialize Lynparza.\nAbout Myriad Genetics\nMyriad Genetics Inc., is a leading personalized medicine company dedicated to being a trusted advisor transforming patient lives worldwide with pioneering molecular diagnostics. Myriad discovers and commercializes molecular diagnostic tests that: determine the risk of developing disease, accurately diagnose disease, assess the risk of disease progression, and guide treatment decisions across six major medical specialties where molecular diagnostics can significantly improve patient care and lower healthcare costs. Myriad is focused on five strategic imperatives: Stabilizing hereditary cancer revenue, growing new product volume, expanding reimbursement coverage for new products, increasing RNA kit revenue internationally and improving profitability with Elevate 2020. For more information on how Myriad is making a difference, please visit the Company's website: www.myriad.com .\nMyriad, the Myriad logo, BART, BRAC Analysis , Colaris, Colaris AP, myPath, myRisk, Myriad myRisk, myRisk Hereditary Cancer, myChoice, myPlan, BRACAnalysis CDx, Tumor BRACAnalysis CDx, myChoice HRD, EndoPredict, Vectra, GeneSight, riskScore and Prolaris are trademarks or registered trademarks of Myriad Genetics, Inc. or its wholly owned subsidiaries in the United States and foreign countries. MYGN-F, MYGN-G.\nSafe Harbor Statement\nThis press release con", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/2d4060a7-2af2-4830-ad77-4831d2c21b49", "https://www.globenewswire.com/Tracker?data=yHgTYd6Ttmxxca_tHKuiIrIxgfV2cXcIGr8qJtgf9qlM7MdlaT-yS-TZKGBtdw5t3qGQjDG5uhJZfeDaNtTl-8msGJAjAMyLxc9xRvyLc8X9Ces8b7ym7f07DDrB-tiUwiPtiVze5liSGJhjuSUWs-er_IRkuCIe7PO1kTqJKBPIhemTakDdbPY6AJWjqPCJ", "https://www.globenewswire.com/Tracker?data=rV76fxJvLw9mMeDRturk0wliutqbw6B2GekaPB357nnC56My6Tzvehn5-tPp_ZxGyFgJ7yK-53HxXX64L_oksaYmWVNktF39kGPwydCfk3M=", "http://myriadmychoice.com/"], "published": "2018-01-12T19:16:00.000+02:00", "crawled": "2018-01-12T21:00:30.021+02:00", "highlightTitle": ""}