{"organizations": [], "uuid": "dcf7ca459a7591128dbee1ffce0a555caf729878", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-marine-products-corporation-reports-fourth-quarter-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "Marine Products Corporation Reports Fourth Quarter 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.931, "site_type": "news", "published": "2018-01-24T14:45:00.000+02:00", "replies_count": 0, "uuid": "dcf7ca459a7591128dbee1ffce0a555caf729878"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-marine-products-corporation-reports-fourth-quarter-2017-financial-results.html", "ord_in_thread": 0, "title": "Marine Products Corporation Reports Fourth Quarter 2017 Financial Results", "locations": [], "entities": {"persons": [{"name": "sunesta sportdecks", "sentiment": "none"}, {"name": "robalo", "sentiment": "none"}], "locations": [{"name": "cayman", "sentiment": "none"}], "organizations": [{"name": "marine products corporation", "sentiment": "negative"}, {"name": "sunesta sportdecks", "sentiment": "none"}, {"name": "marine products", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 24, 2018 /PRNewswire/ -- Marine Products Corporation (NYSE: MPX) announced its unaudited results for the quarter ended December 31, 2017. Marine Products is a leading manufacturer of fiberglass boats under two brand names: Chaparral and Robalo. Chaparral's sterndrive models include H2O Sport and Ski & Fish Boats, SSi and SSX Sportboats, Sunesta Sportdecks and Signature Cruisers. In addition, Chaparral manufactures SunCoast Sportdeck outboards, Vortex Jet Boats and the Surf Series of Chaparral SSi and SSX Sportboats and Sunesta Sportdecks. Robalo builds outboard sport fishing boats which include center console, dual console, walkaround cabin and Cayman bay boat models.\nFor the quarter ended December 31, 2017, Marine Products generated net sales of $65,591,000, a 14.6 percent increase, compared to $57,238,000 in the same period of the prior year. The increase in net sales was due to an 11.7 percent increase in the average selling price per boat, as well as an increase in parts and accessories sales. In addition, unit sales for the quarter increased by 4.0 percent compared to the prior year. During the quarter we generated higher unit sales among our Chaparral Surf Series models, our larger Chaparral SSX Sportboats, and our Robalo Explorer models. Average selling prices increased during the quarter due to a model mix which included larger boats.\nGross profit for the quarter was $14,366,000, a 17.7 percent increase compared to gross profit of $12,203,000 in the same period of the prior year. Gross profit for the fourth quarter increased compared to the prior year due to higher net sales and a favorable model mix. Gross margin was 21.9 percent in the fourth quarter of 2017, compared to 21.3 percent in 2016. Gross margin improved during the fourth quarter of 2017 as compared to the prior year due to the increase in average selling prices and improved manufacturing efficiencies.\nOperating profit for the quarter was $7,470,000, an increase of 42.7 percent, compared to $5,234,000 in the fourth quarter of last year. Selling, general and administrative expenses were $6,896,000 in the fourth quarter of 2017, a slight decrease compared to the fourth quarter of 2016. Selling, general and administrative expenses decreased due to lower warranty expense consistent with favorable warranty claims experiences, partially offset by higher incentive compensation consistent with improved operating results. Selling, general and administrative expenses were 10.5 percent of net sales during the fourth quarter of 2017, a decrease compared to 12.2 percent of net sales in the same period of the prior year.\nNet income for the fourth quarter of 2017 was $3,356,000, or $0.10 per diluted share. During the fourth quarter of 2017, Marine Products recorded a net discrete tax provision of $1,685,000 as a component of tax expense related to the \"Tax Cuts and Jobs Act (\"Tax Reform\")\" enacted during the quarter. The adjustment resulted primarily from the revaluation of deferred tax items using the lower corporate tax rates effective on January 1, 2018. Excluding the impact of Tax Reform, net income for the quarter ended December 31, 2017 was $5,041,000, an increase of $1,319,000 or 35.4 percent, compared to net income of $3,722,000 for the fourth quarter of 2016. [1] Excluding the impact of Tax Reform, diluted earnings per share were $0.15 in the fourth quarter of 2017, an increase of $0.05 per diluted share or 50.0 percent compared to the prior year.\nNet sales for the twelve months ended December 31, 2017 were $267,316,000, an increase of 10.8 percent compared to the prior year. Net income for the twelve months ended December 31, 2017 was $19,300,000 or $0.55 earnings per diluted share. Net income for the twelve months ended December 31, 2017, excluding the impact of Tax Reform, was $20,985,000 or $0.60 earnings per diluted share, an increase of $4,240,000 or 25.3 percent compared to net income of $16,745,000 or $0.44 earnings per diluted share in the prior year. In addition, diluted earnings per share for the year ended December 31, 2017 were positively impacted by $0.05 due to a lower share count resulting from the partial tender offer completed last year.\nDuring 2018, Marine Products Corporation estimates that its annual effective tax rate will be approximately in the low 20 percent range. Since Marine Products believes that it will generate continued positive financial results, the Company believes that it will benefit from this lower tax rate through increased earnings and operating cash flow in 2018.\nRichard A. Hubbell, Marine Products' President and Chief Executive Officer stated, \"Our fourth quarter 2017 financial results were driven by higher volumes and a model mix which included larger boats, both of which favorably impacted our financial results. During our annual dealer conference held a few months ago, our dealers were optimistic about the 2018 retail selling season and were impressed with our model lineup. Early indications of attendance during the winter boat show season are favorable, and we believe that we will enjoy a strong 2018 retail selling season. Our dealer inventories and backlog are slightly higher than at this time in 2016 as we prepare to support dealer demand in the coming months. In addition, we are pleased to report continued market share gains in both our sterndrive, and outboard sport fishing boat product lines. For the 12-month period ending in September 2017, Chaparral's market share increased to 16.7 percent of the sterndrive market in its size category, and Robalo's market share increased to 5.3 percent of its market, and was the fourth largest brand in this category,\" concluded Hubbell.\nMarine Products Corporation will hold a conference call today, January 24, 2018 at 8:00 a.m. Eastern Time to discuss the results for the quarter. Interested parties may listen in by accessing a live webcast in the investor relations section of Marine Products' website at www.marineproductscorp.com . The live conference call can also be accessed by calling (800) 289-0438 or (323) 994-2083 for international callers and using the conference ID #6463754. A replay will be available in the investor relations section of Marine Products' website beginning approximately two hours after the call.\nMarine Products Corporation (NYSE: MPX) designs, manufactures and distributes premium-branded Chaparral sterndrive, jet drive and outboard pleasure boats, and Robalo outboard sport fishing boats. The Company continues to diversify its product lines through product innovation. With premium brands, a solid capital structure, and a strong independent dealer network, Marine Products Corporation is prepared to capitalize on opportunities to increase its market share and to generate superior financial performance to build long-term shareholder value. For more information on Marine Products Corporation visit our website at www.marineproductscorp.com .\nCertain statements and information included in this press release constitute \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements include statements that look forward in time or express management's beliefs, expectations or hopes. In particular, such statements include, without limitation, our belief that we will continue to generate positive financial results; our estimate that our annual effective tax rate will be in the low 20 percent range during 2018 and that this rate will favorably impact our earnings and operating cash flow, and that favorable dealer reception to our 2018 models and winter boat show attendance indicate that we will enjoy a strong 2018 retail selling season. These statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of Marine Products Corporation to be materially different from any future results, performance or achievements expressed or implied in such forward-looking statements. These risks include possible decreases in the level of consumer confidence and available funds impacting discretionary spending, increased interest rates and fuel prices, weather conditions, changes in consumer preferences, deterioration in the quality of Marine Products' network of independent boat dealers or availability of financing of their inventory, continued weakness in the sterndrive recreational boat market, and competition from other boat manufacturers and dealers. Additional discussion of factors that could cause the actual results to differ materially from management's projections, forecasts, estimates and expectations is contained in Marine Products' Form 10-K, filed with the Securities and Exchange Commission for the year ending December 31, 2016.\nFor information contact:\nBEN M. PALMER\nJIM LANDERS\nChief Financial Officer\nVice President, Corporate Finance\n(404) 321-7910\n(404) 321-2162\nirdept@marineproductscorp.com\njlanders@marineproductscorp.com\n[1] Net Income Excluding the Impact of Tax Reform is a financial measure which does not conform to generally accepted principles (GAAP). Additional disclosure regarding this non-GAAP financial measure is disclosed in Appendix A to this press release.\nMARINE PRODUCTS CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS (In thousands except per share data)\nPeriods ended December 31, (Unaudited)\nFourth Quarter\nTwelve Months\n2017\n2016\n% BETTER\n(WORSE)\n2017\n2016\n% BETTER\n(WORSE)\nNet Sales\n$\n65,591\n$\n57,238\n14.6\n%\n$\n267,316\n$\n241,330\n10.8\n%\nCost of Goods Sold\n51,225\n45,035\n(13.7)\n208,296\n190,863\n(9.1)\nGross Profit\n14,366\n12,203\n17.7\n59,020\n50,467\n16.9\nSelling, General and Administrative Expenses\n6,896\n6,969\n1.0\n29,261\n27,415\n(6.7)\nOperating Profit\n7,470\n5,234\n42.7\n29,759\n23,052\n29.1\nInterest Income (Expense)\n40\n(9)\nN/M\n229\n355\n(35.5)\nIncome Before Income Taxes\n7,510\n5,225\n43.7\n29,988\n23,407\n28.1\nIncome Tax Provision\n4,154\n1,503\n(176.4)\n10,688\n6,662\n(60.4)\nNet Income\n$\n3,356\n$\n3,722\n(9.8)\n%\n$\n19,300\n$\n16,745\n15.3\n%\nEARNINGS PER SHARE\nBasic\n$\n0.10\n$\n0.10\n0.0\n%\n$\n0.55\n$\n0.44\n25.0\n%\nDiluted\n$\n0.10\n$\n0.10\n0.0\n%\n$\n0.55\n$\n0.44\n25.0\n%\nAVERAGE SHARES OUTSTANDING\nBasic\n34,676\n36,411\n34,843\n37,857\nDiluted\n34,676\n36,411\n34,843\n37,857\nMARINE PRODUCTS CORPORATION AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nAt December 31, (Unaudited)\n(in thousands)\n2017\n2016\nASSETS\nCash and cash equivalents\n$\n7,684\n$\n2,619\nMarketable securities\n2,636\n4,109\nAccounts receivable, net\n3,051\n1,087\nInventories\n38,006\n42,488\nIncome taxes receivable\n714\n29\nPrepaid expenses and other current assets\n2,096\n1,823\nTotal current assets\n54,187\n52,155\nProperty, plant and equipment, net\n14,218\n13,334\nGoodwill\n3,308\n3,308\nOther intangibles, net\n465\n465\nMarketable securities\n10,395\n5,221\nDeferred income taxes\n3,649\n5,278\nOther assets\n9,678\n8,766\nTotal assets\n$\n95,900\n$\n88,527\nLIABILITIES AND STOCKHOLDERS' EQUITY\nAccounts payable\n$\n5,362\n$\n5,163\nAccrued expenses and other liabilities\n13,999\n12,239\nTotal current liabilities\n19,361\n17,402\nLong-term pension liabilities\n6,732\n5,614\nOther long-term liabilities\n203\n66\nTotal liabilities\n26,296\n23,082\nCommon stock\n3,457\n3,486\nCapital in excess of par value\n-\n-\nRetained earnings\n68,127\n64,141\nAccumulated other comprehensive loss\n(1,980)\n(2,182)\nTotal stockholders' equity\n69,604\n65,445\nTotal liabilities and stockholders' equity\n$\n95,900\n$\n88,527\nAppendix A\nMarine Products Corporation has used the non-GAAP financial measures of net income and diluted earnings per share excluding the impact of Tax Reform in today's earnings release, and anticipates using these non-GAAP financial measures in today's earnings conference call. These measures should not be considered in isolation or as a substitute for net income, earnings per share, or other performance measures prepared in accordance with GAAP.\nManagement believes that presenting the operating results without the impact of Tax Reform enables us to compare our operating performance consistently over various time periods.\nA non-GAAP financial measure is a numerical measure of financial performance, financial position, or cash flows that either 1) excludes amounts, or is subject to adjustments that have the effect of excluding amounts, that are included in the most directly comparable measure calculated and presented in accordance with GAAP in the statement of operations, balance sheet or statement of cash flows, or 2) includes amounts, or is subject to adjustments that have the effect of including amounts, that are excluded from the most directly comparable measure so calculated and presented. Set forth below is a reconciliation of this non-GAAP measure with its most comparable GAAP measures. This reconciliation also appears on Marine Products Corporation's investor website, which can be found on the Internet at www.marineproductscorp.com .\nReconciliation of Net Income and Diluted Earnings Per Share to Net Income and Diluted Earnings Per Share excluding\nthe impact of Tax Reform:\nPeriods ended December 31, (Unaudited)\nFourth Quarter\nTwelve Months\n(in thousands except per share data)\n2017\n2016\n% BETTER\n(WORSE)\n2017\n2016\n% BETTER\n(WORSE)\nNet Income\n$ 3,356\n$ 3,722\n(9.8)\n%\n$ 19,300\n$ 16,745\n15.3\n%\nImpact of Tax Reform\n1,685\n-\nN/M\n1,685\n-\nN/M\nNet income excluding the impact of Tax Reform\n$ 5,041\n$ 3,722\n35.4\n$ 20,985\n$ 16,745\n25.3\nDiluted Earnings Per Share\n$ 0.10\n$ 0.10\n0.0\n$ 0.55\n$ 0.44\n25.0\nImpact of Tax Reform\n0.05\n-\nN/M\n0.05\n-\nN/M\nDiluted Earnings Per Share excluding the impact of Tax Reform\n$ 0.15\n$ 0.10\n50.0\n%\n$ 0.60\n$ 0.44\n36.4\n%\nDiluted Average Shares Outstanding\n34,676\n36,411\n34,843\n37,857\nView original content: http://www.prnewswire.com/news-releases/marine-products-corporation-reports-fourth-quarter-2017-financial-results-300587161.html\nSOURCE Marine Products Corporation", "external_links": ["http://www.prnewswire.com/news-releases/marine-products-corporation-reports-fourth-quarter-2017-financial-results-300587161.html", "http://www.marineproductscorp.com/"], "published": "2018-01-24T14:45:00.000+02:00", "crawled": "2018-01-24T15:10:37.010+02:00", "highlightTitle": ""}