{"organizations": [], "uuid": "e456f70e2e1711373f102348eb52f74d49a82193", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/erica-joy-baker_grit.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/18/job-market-hiring-grit-diversity/", "country": "US", "domain_rank": 1196, "title": "How Your Life Experience Could Help You Land a Great Job | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.416, "site_type": "news", "published": "2018-01-18T02:00:00.000+02:00", "replies_count": 0, "uuid": "e456f70e2e1711373f102348eb52f74d49a82193"}, "author": "Ellen Mcgirt", "url": "http://fortune.com/2018/01/18/job-market-hiring-grit-diversity/", "ord_in_thread": 0, "title": "How Your Life Experience Could Help You Land a Great Job | Fortune", "locations": [], "entities": {"persons": [{"name": "erica joy baker", "sentiment": "neutral"}, {"name": "ellen mcgirt", "sentiment": "neutral"}, {"name": "baker", "sentiment": "none"}], "locations": [{"name": "silicon vall", "sentiment": "none"}, {"name": "alaska", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}, {"name": "patreon", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Ellen McGirt January 18, 2018 \nErica Joy Baker has had a succession of dream jobs in Silicon Valley—at Google , at Slack, and now as a senior engineering manager at Patreon, a crowdfunding platform that connects artists with donor-fans. But back in the day, in 1998, she was just an 18-year-old computer geek, sitting in her dream class at her dream school, getting the stink eye from her computer science professor and trying not to cry. \nThe military brat from Fairbanks had been a self-taught tinkerer, whiling away adolescent hours poking around Microsoft Windows registries and prying the backs off computer cases. Her skills earned her a ticket out of Alaska, to a Florida campus just a short drive from the beach. “I was super fed up with being in a seriously cold place,” she recalls. \nBut as one of two black students and the only black woman in an entry-level class of hundreds, Baker felt a cold shoulder and took it personally. The professor, a white man, ignored her questions, even as he engaged enthusiastically with white male students. “Every time I talked to him, he made it clear that he didn’t think I should be there,” she says. Her teenage brain wondered if this was a sign of things to come. “I thought, Well, maybe he’s right. Maybe computer science wasn’t for me.” \nBaker quit school after a year and went back to Alaska. But so many of the elements that hinted at her future success were hidden in plain sight—if only someone had bothered to ask about them. Snubbed by a computer science professor at her dream school, Erica Joy Baker fought her way back to top engineering jobs in Silicon Valley. Leah Fasten \nHer biological dad, who grew up in Florida, had been so poor that he sometimes skipped school to sell oranges by the roadside to raise cash for food. She moved with her family three times before she was 10, but she thrived where other kids crumpled. And she had a knowledge bank about computer systems on par with any of her college classmates. Indeed, that expertise helped her land an IT internship in the University of Alaska system, where she enrolled after returning home—which soon became a real job. “I wasn’t even 20, and I was making $41,000 a year, more than my [step]father,” she recalls, still sounding incredulous. “And I planned to keep going.” \nIn 2005, Baker came across a Google job ad on Craigslist; by 2006 she had been hired as an IT field tech. The ensuing years brought big wins and promotions, but also stinging setbacks, as managers waved off her contributions or ignored her concerns, giving her something like the professor’s stink eye all over again. “I can’t say for sure why, or that Google missed every opportunity with me, but they did miss most of them,” Baker says. \nRead more: 6 CEOs Who Beat the Odds to Reach the Corner Office \nAfter nine years, the sum of the fizzles and false starts led her to look elsewhere. She found better environments at Slack and Patreon, where leadership made a stronger effort to be inclusive—and where, not coincidentally, she became a key player in the exponential growth of two of the Valley’s hotter startups. \nToday, Baker is a board member for nonprofits that help girls and underrepresented minorities get a foothold in tech. And her journey has given her insight with profound implications for businesses. “In the tech industry, our interview processes have always been geared to finding a specific kind of person,” says Baker, who has been on both sides of the interview table. “That person usually ends up being a white guy from a very specific set of schools. Like, not me.” And, as she candidly tells gatherings of folks like herself: not you either. To get in the door, she says, “you have to be prepared to show them who you are.” Professions where grit matters most. \nIt’s not just tech: In every company, there’s a tendency to cling to an ideal candidate, exemplified by the person at the top of the org chart. “If you only look for that person, you will find them,” says Joelle Emerson, founder and CEO of Paradigm, a consultancy focused on making companies more inclusive. But there’s a danger inherent in the self-replicating, check-the-boxes approach: Companies risk becoming homogeneous and insular, cut off from the insights and ideas they need to innovate and compete. More ominously, it’s a threat to the social fabric, widening the divide between the economic elite and everybody else. \nThat’s why growing numbers of employers and talent scouts are considering signs of potential that standard credentials don’t capture—and that transcend lines of race, income, and class. As Geoff Colvin notes in this issue (see “ How to Profit from the Ultra-Tight Job Market Right Now ”), they’re increasingly skeptical of educational attainment as a proxy for performance. They’re looking for accomplishments that fall outside conventional rubrics: “maker” portfolios of designs and inventions; entrepreneurial achievements; a rich volunteer life; and, more broadly, an ability to creatively manage the sometimes-difficult elements of the life they were born into. In this search, “grit,” the term popularized in the 2016 bestseller of the same name by psychology professor Angela Duckworth, has become the hot shorthand. It’s loosely defined as courage, perseverance, resilience, creativity, a knack for problem–solving and an openness to learning. \n“I pattern-match for grit,” says Arlan Hamilton, founder of Backstage Capital, an early-stage investment fund that backs black, female, and LGBTQ entrepreneurs. In her experience, grittier candidates accept feedback better, work harder, and bounce back faster from setbacks than entrepreneurs who went from prep school to the Ivy League to an MBA and beyond. Imagine a candidate who’s a 40-year-old, black single mom who graduated from college while working full-time. She probably knows some things about planning, resolve, multitasking, and stretching a quarter into a dollar, Hamilton says. “And I can make a good bet that she won’t give up.” \nRead more: How to Make Your Next Job Interview Count \nGrit isn’t a panacea. Unless carefully considered, the search for grit can become a check-the-box diversity exercise of its own: Without thoughtful efforts to find strong candidates and create environments that support them, it’s doomed to disappoint. (It can also fuel ugly stereotypes in which success for the downtrodden depends on charity from white saviors.) That’s why Fortune recommends a reframing: Think of grit less as an antidote to a hard-knock life and more as an ongoing quest to master life complexity —an experience all of us share. When recognition of that complexity shapes hiring, it opens transformative opportunities to people from groups underrepresented in top professions: ethnic minorities, stay-at-home parents, working-class kids, veterans. And in a world locked in a tight global battle for talent, it helps companies find people who are resilient and creative in the face of obstacles. \n“People who go to the right schools at the right time, get to know the right people and get the right interview, that’s their path, and they glide over it,” says Baker. The people who didn’t have access to that path? “Maybe their life looks slanted, or diagonal, or they had to double back, but they got to that same place. You know what? Those are the people who succeed.” \nCompanies struggle to find such cand", "external_links": [], "published": "2018-01-18T02:00:00.000+02:00", "crawled": "2018-01-19T19:30:54.018+02:00", "highlightTitle": ""}