{"organizations": [], "uuid": "aa25ea33d44e079fdae4251fc767119d06809f04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-amwins-group-inc-to-acquire-seacoast-brokers-llc-and-trident-claims-management-llc.html", "country": "US", "domain_rank": 767, "title": "AmWINS Group, Inc. to Acquire Seacoast Brokers, LLC and Trident Claims Management, LLC", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.998, "site_type": "news", "published": "2018-01-03T11:00:00.000+02:00", "replies_count": 0, "uuid": "aa25ea33d44e079fdae4251fc767119d06809f04"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-amwins-group-inc-to-acquire-seacoast-brokers-llc-and-trident-claims-management-llc.html", "ord_in_thread": 0, "title": "AmWINS Group, Inc. to Acquire Seacoast Brokers, LLC and Trident Claims Management, LLC", "locations": [], "entities": {"persons": [{"name": "m. steven decarlo", "sentiment": "none"}], "locations": [{"name": "charlotte", "sentiment": "none"}, {"name": "seacoast", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "south carolina-based", "sentiment": "none"}], "organizations": [{"name": "llc addition of specialty mga", "sentiment": "negative"}, {"name": "amwins group, inc.", "sentiment": "neutral"}, {"name": "acquire seacoast brokers, llc", "sentiment": "neutral"}, {"name": "seacoast brokers", "sentiment": "none"}, {"name": "mga", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Addition of Specialty MGA Will Significantly Expand AmWINS' Personal Lines Capabilities\nCHARLOTTE, N.C.--(BUSINESS WIRE)-- AmWINS Group, Inc. (“AmWINS”), a global distributor of specialty insurance products and services, is pleased to announce that it has reached a definitive agreement to acquire Seacoast Brokers, LLC (“Seacoast”), a South Carolina-based personal lines specialty MGA that designs, distributes and services surplus lines homeowners’ business throughout the United States, and Trident Claims Management, LLC (“Trident”), a licensed third-party claims administrator which manages claims on all Seacoast-issued policies. The transaction will close following regulatory approval.\n“The addition of Seacoast to our AmWINS Access division significantly increases our personal lines products and services,” said M. Steven DeCarlo, CEO of AmWINS. “Seacoast’s history of offering innovative products and superior customer service mirrors our commitment to providing industry-leading solutions for our retail clients and carrier partners.”\nSeacoast provides homeowners’ products to insurance agents covering residential properties predominantly for secondary, seasonal, vacation and investment use which are located in catastrophe-prone and/or resort-oriented communities. Seacoast partners with A.M. Best 'A'-rated insurance companies that specialize in catastrophe property products for the personal lines segment of the industry.\n\"We are excited to join the AmWINS family, and we are looking forward to expanding our geographic footprint by offering our products, services and technology solutions to AmWINS’ retail clients across the U.S.,” said Brian Hover, President of Seacoast. “Our clients will now have access to all of AmWINS’ products, including its proprietary product offerings. Our employees will also benefit from the stability and support that comes with joining such an established and respected team.”\nAmWINS Access is a nationwide delegated authority business focused on small commercial property and casualty and personal lines. AmWINS Access provides the capabilities and market access of the largest P&C wholesaler in the United States, combined with local underwriting expertise, industry-leading technology, and access to a wide range of binding authority markets and exclusive products.\n\"In keeping with AmWINS Access’ focus on innovative tools, service and speed of execution, our clients will benefit from Seacoast’s retailer-facing technology, which provides bindable Quote: s within minutes,” said David Lavins, Senior Vice President at AmWINS Group. \"In addition, Trident significantly expands our services by adding claims administration capabilities.”\nTerms of the transaction were not disclosed. Robinson Bradshaw & Hinson, P.A. is acting as legal counsel to AmWINS in connection with the transaction. TigerRisk Capital Markets & Advisory is acting as financial advisor and Lewis Rice, LLC is acting as legal counsel to Seacoast and Trident.\nAbout AmWINS Group, Inc.\nAmWINS Group, Inc. is the largest independent wholesale distributor of specialty insurance products in the United States, dedicated to serving retail insurance agents by providing property and casualty products, specialty group benefit products and administrative services. Based in Charlotte, N.C., the company operates through more than 100 offices globally and handles premium placements in excess of $14 billion dollars annually. To learn more, visit www.amwins.com .\nAbout Seacoast Brokers, LLC\nSeacoast, a subsidiary of DBH Global, Inc., is a personal lines specialty MGA that designs, distributes and services surplus lines homeowners’ business throughout the United States. Formed in 2001 and based in Hilton Head Island, South Carolina, Seacoast provides quality homeowner products to independent insurance agents covering residential properties for predominantly, secondary, seasonal, vacation and investment use which are located in catastrophe-prone and/or resort-oriented communities. Seacoast partners with A.M. Best 'A'-rated insurance companies that provide catastrophe and non-catastrophe products for the personal lines industry. To learn more, visit www.seacoastbrokers.com .\nAbout Trident Claims Management, LLC\nEstablished in 2011, Trident is a licensed third-party claims administrator which manages claims on all policies issued by Seacoast Brokers. Trident’s strong customer satisfaction is a result of its dedicated focus on its core specialization in homeowners’ risks and unparalleled claims service.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180103005335/en/\nAmWINS Group, Inc.\nLisa Kuszmar, 704-749-2780\nLisa.Kuszmar@amwins.com\nSource: AmWINS Group, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.seacoastbrokers.com&esheet=51736813&newsitemid=20180103005335&lan=en-US&anchor=www.seacoastbrokers.com&index=2&md5=86a3f70546c502a996ba86993bc1dda3", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.amwins.com&esheet=51736813&newsitemid=20180103005335&lan=en-US&anchor=www.amwins.com&index=1&md5=01eb46045ec4d9fc840428a6f50fae94", "http://www.businesswire.com/news/home/20180103005335/en/"], "published": "2018-01-03T11:00:00.000+02:00", "crawled": "2018-01-03T12:07:24.000+02:00", "highlightTitle": ""}