{"organizations": [], "uuid": "5e319d2c9df3e52b93ba6a600fe4f3d8db94cb63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/business-wire-kb-home-reports-2017-fourth-quarter-and-full-year-results.html", "country": "US", "domain_rank": 767, "title": "KB Home Reports 2017 Fourth Quarter and Full Year Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T00:10:00.000+02:00", "replies_count": 0, "uuid": "5e319d2c9df3e52b93ba6a600fe4f3d8db94cb63"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/business-wire-kb-home-reports-2017-fourth-quarter-and-full-year-results.html", "ord_in_thread": 0, "title": "KB Home Reports 2017 Fourth Quarter and Full Year Results", "locations": [], "entities": {"persons": [{"name": "jeffrey mezger", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fourth Quarter Revenues Up 18% to $1.4 Billion; Diluted EPS Increases to $.84 from $.40\nHomebuilding Operating Income Margin Improves Significantly\nNet Order Value Grows 9% to $935.4 Million; Backlog Value Rises 9% to $1.7 Billion\nLOS ANGELES--(BUSINESS WIRE)-- KB Home (NYSE: KBH) today reported results for its fourth quarter and year ended November 30, 2017.\n“Our strong fourth quarter and full year results demonstrate the progress we have achieved in the first year of our three-year Returns-Focused Growth Plan,” said Jeffrey Mezger, chairman, president and chief executive officer. “For the quarter, we significantly increased our earnings with double-digit revenue growth, a substantially expanded gross profit margin, and a new record-low selling, general and administrative expense ratio. During 2017, we delivered steady improvement in our financial and operational performance, which included enhancing our profitability, strengthening our balance sheet, increasing our cash flow, generating better returns, and decreasing our debt to capital ratio. Notably, we ended 2017 with both our return on equity and net debt to capital ratio within the target ranges for 2019 that we established more than a year ago.”\n“As we look to 2018, we expect conditions will remain favorable in most of our served markets, with solid demand for housing driven by healthy employment, rising household incomes and strong consumer confidence, and continued limited supply,” said Mezger. “With a robust backlog of approximately $1.7 billion, we believe we are well positioned to continue our momentum towards achieving our Returns-Focused Growth Plan targets. Our main priorities for 2018 are to further accelerate our financial performance, grow our community count, and enhance long-term stockholder value.”\nThree Months Ended November 30, 2017 (comparisons on a year-over-year basis)\nTotal revenues increased 18% to $1.40 billion. Deliveries grew 9% to 3,340 homes. Average selling price rose 8% to $416,500. Homebuilding operating income grew to $131.9 million from $56.0 million. This included total inventory-related charges of $7.1 million, compared to $36.1 million. Homebuilding operating income margin increased to 9.4% from 4.7%. Excluding inventory-related charges, the improvement was 220 basis points to 9.9%. Housing gross profit margin expanded to 18.1% from 16.5%. Housing gross profit margin excluding inventory-related charges increased 160 basis points to 18.6%. Adjusted housing gross profit margin, a metric that excludes the amortization of previously capitalized interest and inventory-related charges, advanced 190 basis points to 23.5%. Selling, general and administrative expenses improved 50 basis points to 8.7% of housing revenues, a fourth-quarter record for the Company. Land sales generated profits of $.3 million, compared to losses of $30.4 million. The land sale losses in the 2016 fourth quarter included $30.6 million of inventory impairment charges related to planned land sales. Financial services pretax income totaled $5.7 million, compared to a loss of $.7 million. This year-over-year improvement was primarily due to income from KBHS Home Loans, LLC, the Company’s mortgage banking joint venture that became operational in 2017. Income tax expense totaled $53.0 million and represented an effective tax rate of 38.6%, compared to 31.8%. The effective tax rates for the 2017 and 2016 fourth quarters were favorably impacted by $1.1 million and $4.8 million, respectively, of federal energy tax credits earned from building energy-efficient homes. Net income grew to $84.3 million, or $.84 per diluted share, from $37.5 million, or $.40 per diluted share.\nTwelve Months Ended November 30, 2017 (comparisons on a year-over-year basis)\nTotal revenues increased 22% to $4.37 billion. Housing revenues grew 21% to $4.34 billion. Land sale revenues rose to $21.1 million from $7.4 million, partly due to the Company’s ongoing focus on improving its asset efficiency. Deliveries increased 11% to 10,909 homes. Average selling price rose 9% to $397,400, with increases in each of the Company’s four regions. Homebuilding operating income grew to $283.4 million from $152.4 million. This included total inventory-related charges of $25.2 million, compared to $52.8 million. Homebuilding operating income margin excluding inventory-related charges increased 140 basis points to 7.1%. Selling, general and administrative expenses as a percentage of housing revenues improved 110 basis points to 9.8%. Income tax expense totaled $109.4 million and represented an effective tax rate of 37.7%, compared to 29.3%. The effective tax rates for 2017 and 2016 were favorably impacted by $4.9 million and $15.2 million, respectively, of federal energy tax credits. The Tax Cuts and Jobs Act, enacted on December 22, 2017, made significant revisions to federal income tax laws, including lowering the corporate income tax rate from 35% to 21%, effective January 1, 2018. While the Company continues to assess the potential impacts of the new law, taking this income tax rate reduction into account, the Company currently believes its effective tax rate for 2018 will be approximately 27%, excluding the impact of the non-cash charge described below. In the 2018 first quarter, the Company expects to record a one-time, non-cash charge to its provision for income taxes of approximately $115 million for the accounting re-measurement of its deferred tax assets based on the lower federal corporate income tax rate. However, the Company anticipates that the lower federal income tax rate will have a favorable impact on its future net income and earnings per share. In addition, the Company expects its deferred tax assets will continue to provide significant tax cash savings in 2018 and beyond, by shielding a substantial amount of future pretax income. Net income increased to $180.6 million, or $1.85 per diluted share, from $105.6 million, or $1.12 per diluted share.\nBacklog and Net Orders (comparisons on a year-over-year basis)\nNet order value for the fourth quarter rose 9% to $935.4 million on a 2% increase in net orders to 2,296. Each of the Company’s four regions posted a year-over-year increase in net order value for the quarter. Company-wide, net orders per community for the fourth quarter averaged 3.4 per month. Ending backlog value grew 9% to $1.66 billion, with the number of homes in backlog roughly flat at 4,411. The fourth quarter cancellation rate as a percentage of gross orders increased to 28% from 25%. Average community count for the quarter decreased slightly to 228. Ending community count was down 5% to 224.\nBalance Sheet as of November 30, 2017 (comparisons to November 30, 2016)\nThe Company had total liquidity of $1.18 billion, including cash and cash equivalents of $720.6 million. Net cash provided by operating activities was $513.2 million, compared to $188.7 million. There were no cash borrowings outstanding under the Company’s unsecured revolving credit facility. Inventories decreased to $3.26 billion. Investments in land acquisition and development totaled $1.52 billion for the year ended November 30, 2017. Lots owned or controlled totaled 46,371, of which 75% were owned. Notes payable decreased to $2.32 billion from $2.64 billion, primarily due to the Company’s retirement of $265.0 million in aggregate principal amount of its 9.100% senior notes due 2017, in", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.kbhome.com&esheet=51740085&newsitemid=20180110005378&lan=en-US&anchor=www.kbhome.com&index=1&md5=cdfecd481d9295ee0e65f3c6c1487d72", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.kbhome.com&esheet=51740085&newsitemid=20180110005378&lan=en-US&anchor=www.kbhome.com&index=2&md5=c0b7d72d3a5f9b596bbcbbefabc1f923", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.twitter.com%2Fkbhome&esheet=51740085&newsitemid=20180110005378&lan=en-US&anchor=Twitter.com%2FKBHome&index=4&md5=5be72d1b720d5acfe3b21c7d661ac65e", "http://www.businesswire.com/news/home/20180110005378/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.facebook.com%2Fkbhome&esheet=51740085&newsitemid=20180110005378&lan=en-US&anchor=Facebook.com%2FKBHome&index=3&md5=5c3bbd298b6b85ff44203ffaddff07a5"], "published": "2018-01-11T00:10:00.000+02:00", "crawled": "2018-01-11T01:30:06.015+02:00", "highlightTitle": ""}