{"organizations": [], "uuid": "6d4ed6707e7327fd47065e79baf9f11c4f5a1521", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-miragen-therapeutics-expands-board-of-directors-with-appointment-of-arlene-morris.html", "country": "US", "domain_rank": 767, "title": "miRagen Therapeutics Expands Board of Directors with Appointment of Arlene Morris", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T15:00:00.000+02:00", "replies_count": 0, "uuid": "6d4ed6707e7327fd47065e79baf9f11c4f5a1521"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-miragen-therapeutics-expands-board-of-directors-with-appointment-of-arlene-morris.html", "ord_in_thread": 0, "title": "miRagen Therapeutics Expands Board of Directors with Appointment of Arlene Morris", "locations": [], "entities": {"persons": [{"name": "arlene morris", "sentiment": "negative"}, {"name": "arlene", "sentiment": "none"}, {"name": "william s. marshall", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}], "locations": [{"name": "boulder", "sentiment": "none"}, {"name": "colo.", "sentiment": "none"}], "organizations": [{"name": "miragen’s board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOULDER, Colo., Jan. 05, 2018 (GLOBE NEWSWIRE) -- miRagen Therapeutics, Inc. (NASDAQ:MGEN), a clinical-stage biopharmaceutical company focused on the discovery and development of RNA-targeted therapies, announced today that it has appointed biotechnology industry veteran Arlene Morris to the role of independent board member on its Board of Directors, effective January 3, 2018. Ms. Morris has extensive experience in the pharmaceutical and biotechnology industries serving in numerous executive management and board roles. Her appointment increases miRagen’s Board from seven directors to eight directors.\n“With more than 25 years of exceptional leadership experience in the biotech industry, we are delighted to welcome Arlene to our Board,” said miRagen President and CEO William S. Marshall, Ph.D. “Arlene has a strong track record in leading companies through strategic market developments, and we are thankful to count her as a valued advisor as miRagen continues to advance our mission of bringing novel therapies to patients in need.”\n“miRagen has the opportunity to leverage its unique expertise and approach surrounding microRNA biology to discover and develop drug candidates across a range of important disease areas. I look forward to working with the Board and management as miRagen advances its pipeline and refines its growth strategy,” said Arlene Morris.\nMs. Morris currently serves as Chief Executive Officer at Willow Advisors, LLC, a consultancy advising biotech companies on financing, strategy and business development. From April 2012 until May 2015 she was Chief Executive Officer of Syndax Pharmaceuticals, Inc., a privately-held oncology company focused on the development and commercialization of therapies for treatment-resistant cancers. She also served as a member of the Syndax Pharmaceuticals board of directors from June 2011 until May 2015. From 2003 to January 2011, Ms. Morris served as the President, Chief Executive Officer and a member of the board of directors of Affymax, Inc., a publicly-traded biotechnology company. Ms. Morris has also held various management and executive positions at Clearview Projects, Inc., a corporate advisory firm; Coulter Pharmaceutical, Inc., a publicly-traded pharmaceutical company; Scios Inc., a publicly-traded biopharmaceutical company; and Johnson & Johnson, a publicly-traded healthcare company. She is currently a member of the board of directors of Viveve Medical, Inc., a publicly-traded medical device company; Palatin Technologies, a publicly-traded biotechnology company; and Neovacs, SA, a French publicly-traded biotechnology company. She was recently a director of Biodel Inc., a publicly-traded specialty pharmaceutical company, from 2015 until its merger with Albireo Limited in 2016; and Dimension Therapeutics, a publicly-traded gene therapy company, until it was acquired by Ultragenyx in 2017. She also serves as Board Chair for the Foundation for Research and Development at the Medical University of South Carolina and as a Trustee of Carlow University. Ms. Morris received a B.A. in Biology and Chemistry from Carlow College.\nAbout miRagen Therapeutics, Inc.\nmiRagen Therapeutics, Inc. is a clinical-stage biopharmaceutical company discovering and developing proprietary RNA-targeted therapies with a specific focus on microRNAs and their role in diseases where there is a high unmet medical need. miRagen’s two lead product candidates, MRG-106 and MRG-201, are currently in clinical development. miRagen’s clinical product candidate for the treatment of certain cancers, MRG-106, is an inhibitor of microRNA-155, which is found at abnormally high levels in malignant cells of several blood cancers, as well as certain cells involved in inflammation. miRagen’s clinical product candidate for the treatment of pathological fibrosis, MRG-201, is a replacement for microRNA-29, which is found at abnormally low levels in a number of pathological fibrotic conditions, including cutaneous, cardiac, renal, hepatic, pulmonary and ocular fibrosis, as well as systemic sclerosis. miRagen is also developing MRG-110, an inhibitor of microRNA-92, under a license and collaboration agreement with Servier. MRG-110 is being developed for the treatment of heart failure and other ischemic disease. In addition to these programs, miRagen is developing a pipeline of preclinical product candidates. The goal of miRagen’s translational medicine strategy is to progress rapidly to first-in-human studies once it has established the pharmacokinetics, pharmacodynamic, safety and manufacturability of the product candidate in preclinical studies. For more information, please visit www.miragen.com .\nFor information on clinical trials please visit www.clinicaltrials.gov .\nNote Regarding Forward-Looking Statements\nThis press release may contain forward-looking statements that involve substantial risks and uncertainties for purposes of the safe harbor provided by the Private Securities Litigation Reform Act of 1995. All statements contained in this press release other than statements of historical fact, including statements regarding miRagen’s strategy, future operations, future financial position, future revenue, projected expenses, prospects, plans and objectives of management or the expected features of or potential indications for miRagen’s product candidates are forward-looking statements. The words “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “intend,” “plan,” “expect,” “predict,” “potential,” “opportunity,” “goals,” or “should,” and similar expressions are intended to identify forward-looking statements. Such statements are based on management’s current expectations and involve risks and uncertainties. Actual results and performance could differ materially from those projected in the forward-looking statements as a result of many factors, including, without limitation: that miRagen has incurred losses since its inception, and anticipates that it will continue to incur significant losses for the foreseeable future; future financing activities may cause miRagen to restrict its operations or require it to relinquish rights; miRagen may fail to demonstrate safety and efficacy of its product candidates; miRagen’s product candidates are unproven and may never lead to marketable products; miRagen’s product candidates are based on a relatively novel technology, which makes it difficult to predict the time and cost of development and of subsequently obtaining regulatory approval, if at all; miRagen’s product candidates may cause undesirable side effects or have other properties that could delay or prevent the regulatory approval; and the results of miRagen’s clinical trials to date are not sufficient to show safety and efficacy of miRagen’s product candidates and may not be indicative of future clinical trial results.\nmiRagen has based these forward-looking statements largely on its current expectations and projections about future events and trends. These forward-looking statements are subject to a number of risks, uncertainties and assumptions, including those described under the heading “Risk Factors” in miRagen’s Annual Report on Form 10-K and subsequent periodic reports filed with the Securities and Exchange Commission. Moreover, miRagen operates in a very competitive and rapidly changing environment. New risks emerge from time to time. It is not possible for its management to predi", "external_links": ["https://www.globenewswire.com/Tracker?data=dQjSAd2g7wD5cIYdqlGZ8FrZzB2bmBKMb4-gYiB9GYst1kfnT9L7SB4leGMTu66VH1MdwQUqJ4OjBcpkcaNKnQ==", "https://www.globenewswire.com/Tracker?data=Wdmkw_FTygFUIiGBDZwID9E_ITUza9dKedCMYndn51VyxgraquYGUG2W26UpCEq5EyljhdsJUSVkShnEE-JL-Q==", "https://www.globenewswire.com/Tracker?data=WKOblHbWVgubISv1tHO6ZnWfP5ajwU9oA83AvS8acJqM4FWVhCBydDzWANT9G4n5mnfM4GWSS7plRY5v489ZFV4ZV31zjNCuij7QNjZ88so=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/86257094-97be-4412-8d2b-491f1d8758e7"], "published": "2018-01-05T15:00:00.000+02:00", "crawled": "2018-01-05T17:50:20.015+02:00", "highlightTitle": ""}