{"organizations": [], "uuid": "ea98cee261ed3a0e034a10cfa531d543300cca2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-spark-energy-inc-announces-pricing-of-series-a-preferred-stock.html", "country": "US", "domain_rank": 767, "title": "Spark Energy, Inc. Announces Pricing of Series A Preferred Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-24T02:28:00.000+02:00", "replies_count": 0, "uuid": "ea98cee261ed3a0e034a10cfa531d543300cca2e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-spark-energy-inc-announces-pricing-of-series-a-preferred-stock.html", "ord_in_thread": 0, "title": "Spark Energy, Inc. Announces Pricing of Series A Preferred Stock", "locations": [], "entities": {"persons": [], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "spark energy, inc.", "sentiment": "neutral"}, {"name": "spark energy, inc", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 23, 2018 (GLOBE NEWSWIRE) -- Spark Energy, Inc. (“Spark” or the “Company”) (NASDAQ:SPKE), an independent retail energy services company, announced the pricing of a public offering of 2,000,000 shares of its 8.75% Series A Fixed-to-Floating Rate Cumulative Redeemable Perpetual Preferred Stock (“Series A Preferred Stock”) at a public offering price of $25.25.\nThe underwriters have been granted a 30-day option to purchase up to 250,000 additional shares of Series A Preferred Stock from Spark, exercisable in whole or in part, at the public offering price less the underwriting discount. The offering is scheduled to close on January 26, 2018.\nSpark intends to use the net proceeds of approximately $48.7 million (or approximately $54.8 million if the underwriters exercise in full their option to purchase an additional 250,000 shares of Series A Preferred Stock), after deducting underwriting discounts and an advisory fee, but before estimated offering expenses, for merger and acquisition opportunities, international expansion and general corporate purposes, including to repay a portion of borrowings outstanding under Spark’s senior secured borrowing base credit facility.\nB. Riley FBR, Inc., Janney Montgomery Scott LLC, BB&T Capital Markets, a division of BB&T Securities, LLC, and Ladenburg Thalmann & Co. Inc. acted as joint book-running managers of the offering. Boenning & Scattergood, Inc., Incapital LLC, National Securities Corporation, a wholly owned subsidiary of National Holdings, Inc. (NASDAQ:NHLD), and USCA Securities LLC acted as co-managers.\nThe offering may be made only by means of a prospectus and related prospectus supplement meeting the requirements of Section 10 of the Securities Act of 1933, as amended. A copy of the prospectus supplement and accompanying base prospectus meeting such requirements relating to this offering may be obtained from any of the underwriters, including the offices of:\nB. Riley FBR, Inc.\nAttn: Syndicate Prospectus Department\n1300 17 th Street N., Suite 1400\nArlington, VA 22209\nPhone: (800) 846-5050\nEmail: prospectuses@brileyfbr.com Janney Montgomery Scott LLC\nAttn: Taxable Fixed Income Department\n1717 Arch Street, 19 th Floor\nPhiladelphia, Pennsylvania 19103\nPhone: (215) 665-6130\nEmail: TFI@janney.com BB&T Capital Markets\nAttn: Prospectus Department\n901 East Byrd Street, Suite 300\nRichmond, VA 23219\nEmail: prospectusrequests@bbandtcm.com Ladenburg Thalmann & Co.\nAttn: Syndicate Department\n277 Park Avenue, 26th Floor\nNew York, NY 10172\nEmail: prospectus@ladenburg.com You may also obtain these documents for free when they are available by visiting the Securities and Exchange Commission's (“SEC”) Web site at www.sec.gov .\nThe shelf registration statement relating to these securities has previously been filed with the SEC and declared effective. This press release shall not constitute an offer to sell or the solicitation of an offer to buy the securities described herein, nor shall there be any sale of these securities in any state or jurisdiction in which such an offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Spark Energy, Inc.\nSpark Energy, Inc. is an established and growing independent retail energy services company founded in 1999 that provides residential and commercial customers in competitive markets across the United States with an alternative choice for their natural gas and electricity. Headquartered in Houston, Texas, Spark currently operates in 19 states and serves 94 utility territories. Spark offers its customers a variety of product and service choices, including stable and predictable energy costs and green product alternatives.\nCautionary Note Concerning Forward Looking Statements\nThis press release includes regarding future events. These rely on a number of assumptions concerning future events and are subject to a number of uncertainties and factors, many of which are outside the control of Spark, and a variety of risks that could cause results to differ materially from those expected by the management of Spark. Spark undertakes no obligation to update or revise to reflect changed assumptions, the occurrence of unanticipated events or changes to future operating results over time.\nContact: Spark Energy, Inc.\nInvestors:\nChristian Hettick, 832-200-3727\nMedia:\nEric Melchor, 281-833-4151\nSource:Spark Energy, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/3ba00f4f-8e45-4894-898d-237159cbc687", "https://www.globenewswire.com/Tracker?data=ExDcOudEObTOXQcuVz1oOGQ15Joj5LMO2f_NEuKuyyTx-eZljgZO5gnkUcFflCT30-c-IgltI4pToFICkR4p5A=="], "published": "2018-01-24T02:28:00.000+02:00", "crawled": "2018-01-24T03:29:03.043+02:00", "highlightTitle": ""}