{"organizations": [], "uuid": "6d3af5813a4d13d942069f9383ff3b06fb5b4823", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-amelia-resources-llc-announces-the-sale-of-85000-net-acres-in-the-louisiana-austin-chalk-play.html", "country": "US", "domain_rank": 767, "title": "Amelia Resources LLC Announces the Sale of 85,000 Net Acres in the Louisiana Austin Chalk Play", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.555, "site_type": "news", "published": "2018-01-04T02:00:00.000+02:00", "replies_count": 0, "uuid": "6d3af5813a4d13d942069f9383ff3b06fb5b4823"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-amelia-resources-llc-announces-the-sale-of-85000-net-acres-in-the-louisiana-austin-chalk-play.html", "ord_in_thread": 0, "title": "Amelia Resources LLC Announces the Sale of 85,000 Net Acres in the Louisiana Austin Chalk Play", "locations": [], "entities": {"persons": [{"name": "amelia", "sentiment": "none"}, {"name": "kirk barrell", "sentiment": "none"}], "locations": [{"name": "louisiana austin chalk play new orleans", "sentiment": "none"}, {"name": "austin chalk", "sentiment": "none"}, {"name": "tuscaloosa trend", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "louisiana", "sentiment": "none"}, {"name": "austin chalk of texas", "sentiment": "none"}], "organizations": [{"name": "amelia resources llc", "sentiment": "negative"}, {"name": "austin chalk", "sentiment": "none"}, {"name": "amelia resources", "sentiment": "none"}, {"name": "louisiana austin chalk", "sentiment": "none"}, {"name": "frac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW ORLEANS--(BUSINESS WIRE)-- Amelia Resources LLC announces the sale of 85,000 net acres in the Louisiana Austin Chalk play.\nAmelia Resources announced today that it has sold 85,000 net acres of newly acquired leases in the Louisiana Austin Chalk play to an undisclosed large U.S.-based operator for $87 million.\nAmelia's President, Kirk Barrell, said, \"With the rapid emergence of this exciting new play, this focused package of leases presents a large new player an excellent acreage foundation to build upon. Frac design improvements in the Austin Chalk of Texas along with very high initial flow rates are bringing more attention to this play across both Texas and Louisiana. We are excited to deliver an operator to the play with significant experience in drilling and completing these same reservoirs in Texas.\"\nWith 27 years of experience across the Tuscaloosa Trend, Amelia Resources has evaluated over 2,000 wells in the Austin Chalk across Texas and Louisiana. Utilizing a diverse dataset of well logs, geochemistry, seismic, and petrophysics, the company has confirmed and defined the most economically attractive areas of the play.\nAmelia’s buyer has acquired this large acreage block in the updip, normally pressured region of the play. Barrell stated, \"Our acreage block is geologically focused targeting a shallower, normally pressured, oil-rich, porous reservoir across unfaulted monoclinal dip. With the Tuscaloosa Marine Shale (TMS) occurring 700 feet below the Austin Chalk, the updip region of the play presents a potential ‘stack play’ opportunity.\" The company plans to debut a second large acreage package at the NAPE Summit in Houston, February 5–9, 2018.\nAmelia Resources LLC is a privately held exploration and production company. The company generates drilling prospects and is actively engaged in several projects across the onshore Gulf Coast. Amelia was founded in 2003 by Kirk Barrell and has offices in New Orleans and St. Francisville, Louisiana. The company leverages its 27 years of geological and geophysical experience to obtain strategic positions in drilling projects. Updates on the Austin Chalk and TMS projects are provided by the company at www.tuscaloosatrend.blogspot.com .\nCAUTIONARY STATEMENT: This press release contains certain forward-looking statements regarding various oil and gas discoveries, oil and gas exploration, development and production activities, anticipated and potential production and flow rates and the economic potential of properties. Accuracy of these forward-looking statements depends on assumptions about events that change over time and is thus susceptible to periodic change based on actual experience and new developments. Amelia Resources LLC cautions readers that it assumes no obligation to update or publicly release any revisions to the forward-looking statements in this press release and, except to the extent required by applicable law, does not intend to update or otherwise revise these statements more frequently than quarterly. Important factors that might cause future results to differ from these forward-looking statements include adverse conditions such as high temperature and pressure that could lead to mechanical failures or increased costs, variations in the market prices of oil and natural gas, drilling results, unanticipated fluctuations in flow rates of producing wells, oil and natural gas reserves expectations, the ability to satisfy future cash obligations and environmental costs, and other general exploration and development risks and hazards.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180103006307/en/\nAmelia Resources LLC\nKirk A. Barrell, 281-798-6741\nSource: Amelia Resources LLC", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.tuscaloosatrend.blogspot.com&esheet=51737645&newsitemid=20180103006307&lan=en-US&anchor=www.tuscaloosatrend.blogspot.com&index=1&md5=16bb039c82cce4ed9d42930a2b5406e9", "http://www.businesswire.com/news/home/20180103006307/en/"], "published": "2018-01-04T02:00:00.000+02:00", "crawled": "2018-01-04T05:25:49.004+02:00", "highlightTitle": ""}