{"organizations": [], "uuid": "0de35fa0390fbb8a5a5bc5b3aed049d056375fb3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 15, "shares": 15, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222960262&w=1200&r=LYNXMPEE0H0GA", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-northkorea-flag/two-koreas-one-flag-emblematic-of-once-better-ties-idUSKBN1F70RP", "country": "US", "domain_rank": 408, "title": "Two Koreas' 'one flag' emblematic of once better ties", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T09:51:00.000+02:00", "replies_count": 0, "uuid": "0de35fa0390fbb8a5a5bc5b3aed049d056375fb3"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-northkorea-flag/two-koreas-one-flag-emblematic-of-once-better-ties-idUSKBN1F70RP", "ord_in_thread": 0, "title": "Two Koreas' 'one flag' emblematic of once better ties", "locations": [], "entities": {"persons": [{"name": "joyce lee", "sentiment": "none"}, {"name": "kor", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "olympic stadium", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "two koreas", "sentiment": "negative"}, {"name": "min read  seoul", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL (Reuters) - North and South Korea’s plan to march together under the same blue-and-white Korean peninsula flag at the Pyeongchang Winter Olympics next month marks the revival of an emblem of warmer ties between the old foes from years past.\nThe two countries will be hoping for some of the same sort of “feel good factor” they enjoyed at the Olympics in 2000, when they were greeted by a standing ovation in Sydney’s Olympic Stadium after marching in under the unified flag for the first time.\nThe “Korean Unification Flag,” showing the Korean peninsula in blue against a white background, traces its origin to 1989, when North and South Korea agreed to use a new flag for a possible joint team in the 1990 Asian Games.\nWhile plans for a joint team at those games fell apart, the flag made its first public appearance in 1991 when Seoul and Pyongyang formed a unified team to contest the world table tennis championship in Japan.\nWhen the unified Korean women’s team won gold there, the flag was raised in triumph, accompanied by “Arirang”, a traditional Korean folk song played in lieu of the national anthem of either of the two.\nThe emotional scene later formed the basis of a popular movie in the South.\nDuring the South’s “Sunshine” policy era of engaging North Korea between 1998 and 2008, athletes from both countries used the single flag to march together at several major games, including the 2004 Athens Summer Olympics and the 2006 Torino Winter Olympics in Italy, as well as the Sydney Olympics.\nFILE PHOTO: For the first time in Olympic history athletes from North and South Korea joined hands and marched together under one flag during the opening ceremony of the XXVII Summer Olympic Games, Sydney, Australia September 15, 2000. REUTERS/David Gray/File Photo The two Koreas competed separately in the 2000 games with their own flags and national anthems, as well as in the subsequent Olympics.\nIn 2007, a large “unification” flag was displayed at the border when then-South Korean president Roh Moo-hyun walked into North Korea for a summit with former North Korean leader Kim Jong Il.\nHowever, the flag has not been seen at a high-profile public event since 2008, when South Korea’s conservative Lee Myung-bak administration took power. Relations chilled dramatically in 2010 after the sinking of a South Korean warship that the South blamed on the North. Pyongyang denied any involvement, but the relationship has continued to suffer as the North accelerated its nuclear and missile programs in defiance of U.N. sanctions.\nAlthough the two Koreas have agreed to compete together and use the single flag at the Pyeongchang Winter Olympics, the matter has not been finalised, an official from the games’ organizing committee told Reuters.\nSouth and North Korean representatives will discuss the matter with the International Olympic Committee (IOC) when they meet on Saturday in Lausanne, Switzerland.\nAlthough some South Koreans oppose using the flag instead of South Korea’s “Taegukgi” flag at the Pyeongchang Olympics, the flag is still a powerful symbol of peace, said Jang Man-jae, the owner of a company that makes the unification flag.\n“Although ideologies are different, the flag can give us a sense of unity, which is a good thing,” said Jang.\n“I would feel uncomfortable making North Korea’s national flag but this flag, I can definitely keep making it.”\nEditing by Soyoung Kim and Lincoln Feast\n ", "external_links": [], "published": "2018-01-18T09:51:00.000+02:00", "crawled": "2018-01-18T10:06:41.027+02:00", "highlightTitle": ""}