{"organizations": [], "uuid": "1b249f5b2a415ec6dab4ab2287154274e18caa9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/23/104961898-dilly_dilly.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/23/how-do-you-turn-an-ad-into-a-meme-two-words-dilly-dilly.html", "country": "US", "domain_rank": 767, "title": "How do you turn an ad into a meme? Two words: Dilly dilly", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T17:33:00.000+02:00", "replies_count": 0, "uuid": "1b249f5b2a415ec6dab4ab2287154274e18caa9f"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/23/how-do-you-turn-an-ad-into-a-meme-two-words-dilly-dilly.html", "ord_in_thread": 0, "title": "How do you turn an ad into a meme? Two words: Dilly dilly", "locations": [], "entities": {"persons": [{"name": "bud light", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In 1995, a nation was rapt as three frogs croaked the syllables in \" Budweiser .\" Four years later, Budweiser prompted countless television viewers to wag their tongues and ask their friends, \" Whassup ?\"\nSince then, the list of commercial catchphrases to earn a cultural foothold has been short. But a nonsense phrase from an advertisement set in medieval times has broken through to become a common barroom cheer and online force to an extent that in some ways has exceeded its pre-social-web predecessors.\nDilly dilly.\nIn an advertisement that debuted in August, citizens of a fictional world approach their king, presenting increasing quantities of Bud Light as offerings. The king names each person a \"friend of the crown,\" then leads the banquet hall in a call-and-response toast in which they all repeat \"dilly dilly.\" When a man instead smugly presents \"a spiced honey mead wine that I have really been into lately,\" he is shuffled off to the \"pit of misery.\"\nThe implication is that Bud Light is for you and all of your friends; fancy craft beer is only for yourself.\nThe ad was one of six produced by Wieden & Kennedy, an advertising agency, and executives at Budweiser say they gravitated to it immediately. But no one anticipated how much \"dilly dilly\" would spread, especially in the sports world.\nSeemingly every N.F.L. touchdown was greeted by cries of \"dilly dilly\" on social media. And fans tweeted that players who performed poorly should be sent to the pit of misery .\nBarstool Buffalo Tweet\nRead more from The New York Times:\n21st Century Fox Bid for Sky Is Provisionally Rejected by U.K. Regulator\n2018 Oscar Nominations: 'The Shape of Water' Leads the Race\nMegyn Kelly vs. Jane Fonda: The Rematch\nBrandon Henderson, a creative director at Wieden & Kennedy, said he realized the phrase might take off when he saw a student write it on a sign in the background of ESPN's \"College GameDay.\"\nJohn Parker, another creative director, said he thought he had heard something familiar when he was watching a fourth-quarter play of a \"Thursday Night Football\" game in November. He was watching with his wife as Ben Roethlisberger, the Pittsburgh Steelers quarterback, called out in code to direct his teammates.\n\"Did he just say 'dilly dilly'?\" he asked his wife. He rewound, and sure enough — yes, he did.\nThe ad makers had succeeded in creating a genuine meme, which can't simply be bought by expanding an advertising budget. Attention in social media is harder to buy than a 30-second spot after a punt.\nAnd while memes churn through popular culture at a rapid pace, they are rarely spawned from television advertisements, a medium that has been hit hard by cord-cutting and ad-skipping technology.\n\"Consumers today have so many more options and things to occupy their time,\" said Andy Goeler, Bud Light's vice president of marketing. \"They're not waiting for the next ad to come on either their mobile phone or TV. It's much harder today to break through and to connect with that consumer base out there because of all of the multiple options they're exposed to.\"\nStill, the fact that Bud Light invests in big-ticket live television events — namely major football games — offered \"dilly dilly\" a better chance at viral success, Mr. Henderson said. The chances of simply ginning up a meme without that help would be much lower.\n\"Once people see it a couple of times, they take it online and they use it socially and it grows from there,\" he said. \"If we tried to take this thing immediately into social media, I don't know if it would have taken off.\"\nMr. Goeler said he believed that \"dilly dilly\" had surpassed the popularity of \"whassup\" and the frogs, and he said that the success had prompted Budweiser to expand the campaign. Additional advertisements were created to introduce new characters into the \"Game of Thrones\"-inspired universe, including a trilogy that will culminate in a Super Bowl ad, he said.\n\"Dilly dilly\" does have a history, notably in the folk song \"Lavender Blue,\" which Burl Ives recorded in 1949 . Another version of the song appeared in the 2015 Disney film \"Cinderella,\" though the creative directors at Wieden & Kennedy said they were unaware of the song when they wrote the spot.\nThe creative directors gave credit for the phrase to Alex Ledford, a senior copywriter, and N. J. Placentra, a senior art director. The pair were trying several nonsense phrases when one uttered \"dilly dilly,\" and it made them laugh.\nThey claim to have destroyed records of the other phrases they tried, though Mr. Henderson was skeptical.\n\"They have a list that they either will not share or they have actually lost,\" he said.\nAttempts by The New York Times to retrieve the list were unsuccessful.", "external_links": [], "published": "2018-01-23T17:33:00.000+02:00", "crawled": "2018-01-23T19:21:26.002+02:00", "highlightTitle": ""}