{"organizations": [], "uuid": "6cdcc7f8fd40540da6bce898ac89ab3ea4c51311", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-seneca-foods-reports-a-sales-increase-of-7-point-1-percent-or-69-point-6-million-for-the-nine-months-ended-december-30-2017.html", "country": "US", "domain_rank": 767, "title": "Seneca Foods Reports a Sales Increase of 7.1% or $69.6 Million for the Nine Months Ended December 30, 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.907, "site_type": "news", "published": "2018-01-26T01:00:00.000+02:00", "replies_count": 0, "uuid": "6cdcc7f8fd40540da6bce898ac89ab3ea4c51311"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-seneca-foods-reports-a-sales-increase-of-7-point-1-percent-or-69-point-6-million-for-the-nine-months-ended-december-30-2017.html", "ord_in_thread": 0, "title": "Seneca Foods Reports a Sales Increase of 7.1% or $69.6 Million for the Nine Months Ended December 30, 2017", "locations": [], "entities": {"persons": [{"name": "sene", "sentiment": "negative"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "marion", "sentiment": "none"}], "organizations": [{"name": "seneca foods corporation", "sentiment": "negative"}, {"name": "truitt bros., inc.", "sentiment": "none"}, {"name": "fifo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MARION, N.Y., Jan. 25, 2018 (GLOBE NEWSWIRE) -- Seneca Foods Corporation (NASDAQ:SENEA) (NASDAQ:SENEB) today announced financial results for the third quarter and nine months ended December 30, 2017.\nHighlights (vs. year-ago, third quarter results):\nNet sales increased $23.0 million, or 6.2% to $392.7 million. The increase in sales attributed to favorable sales mix and higher selling price variance of $34.5 million partially offset by a sales volume decrease of $11.5 million. Results for the quarter include the Truitt Bros., Inc. acquisition which contributed $28.2 million in net sales. Net earnings decreased to $7.7 million or $0.78 per diluted share. A tax rate change occurred during the quarter which reduced the tax provision by $3,040,000 due to the recently passed Tax Cut and Jobs Act.\n“Due to a significant LIFO charge for the quarter and nine month periods, we are reporting slightly lower earnings than the prior year periods. FIFO net earnings and sales are up compared to the prior year. Overall, operating earnings, excluding LIFO and plant restructuring charges, are ahead of the prior year,” stated Kraig Kayser, President and Chief Executive Officer.\nFinancial Results for the Third Quarter of 2018\nThe Company reported net earnings for the fiscal third quarter of 2018 of $7.7 million, or $0.78 per diluted share, compared to net earnings of $8.2 million, or $0.82 per diluted share, in the fiscal third quarter of 2017. Net sales for the third quarter ended December 30, 2017, increased from the third quarter ended December 31, 2016, by 6.2%, to $392.7 million. The increase is attributable to favorable sales mix and higher selling price variance of $34.5 million partially offset by a sales volume decrease of $11.5 million. Results for the quarter include the Truitt Bros., Inc. acquisition which contributed $28.2 million in net sales.\nOperating earnings, excluding LIFO and plant restructuring impact, was $12.6 million and $11.3 million for the quarter ended December 30, 2017 and December 31, 2016, respectively. A reconciliation of reported operating income to operating earnings excluding LIFO and plant restructuring charges is provided below.\nHighlights (vs. year-ago, year-to-date results):\nNet sales increased $69.6 million, or 7.1% to $1,049.2 million. The increase in sales attributed to favorable sales volume variance of $32.9 million and favorable sales mix and higher selling price variance of $36.7 million. Year-to-date results include the Truitt Bros., Inc. acquisition which contributed $69.4 million in net sales. Net earnings decreased to $5.8 million or $0.58 per diluted share.\nFinancial Results for the Fiscal 2018 Nine Months Year-to-Date\nDuring nine months ended December 30, 2017, the Company reported that net earnings for the nine months of 2018 was $5.8 million, or $0.58 per diluted share, compared to net earnings of $14.3 million, or $1.43 per diluted share, in the first nine months of 2017. Net sales for the first nine months of fiscal 2018 increased from the first nine months of fiscal 2017 by 7.1%, to $1,049.2 million. The increase is attributable to increased sales volume of $32.9 million and higher selling prices/more favorable sales mix of $36.7 million.\nOperating earnings, excluding LIFO and plant restructuring impact, was $32.9 million and $29.1 million for the nine months ended December 30, 2017 and December 31, 2016, respectively. A reconciliation of reported operating income to operating earnings excluding LIFO and plant restructuring charges is provided below.\nAbou t Seneca Foods Corporation\nSeneca Foods is North America’s leading provider of packaged fruits and vegetables, with facilities located throughout the United States. Its high quality products are primarily sourced from over 2,000 American farms. Seneca holds the largest share of the retail private label, food service, and export canned vegetable markets, distributing to over 90 countries. Products are also sold under the highly regarded brands of Libby’s®, Aunt Nellie’s®, Green Valley®, CherryMan®, READ®, Seneca Farms® and Seneca labels, including Seneca snack chips. In addition, Seneca provides contract packing services mostly through its wholly owned subsidiary Truitt Bros., Inc. Also, Seneca provides vegetable products under a contract packing agreement with B&G Foods North America, under the Green Giant label. Seneca’s common stock is traded on the Nasdaq Global Stock Market under the symbols “SENEA” and “SENEB”. SENEA is included in the S&P SmallCap 600, Russell 2000 and Russell 3000 indices.\nNon-GAAP Financial Measures —Operating Earnings Excluding LIFO and Plant Restructuring Impact, EBITDA and FIFO EBITDA\nOperating earnings excluding LIFO and plant restructuring, EBITDA and FIFO EBITDA are non-GAAP financial measures. The Company believes these non-GAAP financial measures provide a basis for comparison to companies that do not use LIFO or have plant restructuring in order to enhance the understanding of the Company’s historical operating performance. The Company does not intend for this information to be considered in isolation or as a substitute for other measures prepared in accordance with GAAP.\nSet forth below is a reconciliation of reported net earnings to EBITDA and FIFO EBITDA (earnings before interest, income taxes, depreciation, amortization, and non-cash charges and credits related to the LIFO inventory valuation method). The Company does not intend for this information to be considered in isolation or as a substitute for other measures prepared in accordance with GAAP.\nQuarter Ended Nine Months Ended In millions In millions 12/30/2017 12/31/2016 12/30/2017 12/31/2016 FY 2018 FY 2017 FY 2018 FY 2017 Operating income, as reported: $ 11.5 $ 13.9 $ 13.9 $ 26.7 LIFO charge (credit) 1.0 (3.9 ) 18.8 (0.4 ) Plant restructuring charge 0.1 1.3 0.2 2.8 Operating income, excluding LIFO and plant restructuring impact $ 12.6 $ 11.3 $ 32.9 $ 29.1\nNine Months Ended EBITDA and FIFO EBITDA: December 30, 2017 December 31, 2016 (In thousands) Net earnings $ 5,776 $ 14,263 Income tax (benefit) expense (2,524 ) 6,217 Interest expense, net of interest income 10,662 6,709 Depreciation and amortization 23,112 18,209 Interest amortization (214 ) (270 ) EBITDA 36,812 45,128 LIFO charge 18,835 (434 ) FIFO EBITDA $ 55,647 $ 44,694\nForward-Looking Information\nThe information contained in this release contains, or may contain, forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These statements appear in a number of places in this release and include statements regarding the intent, belief or current expectations of the Company or its officers (including statements preceded by, followed by or that include the words “believes,” “expects,” “anticipates” or similar expressions) with respect to various matters.\nBecause such statements are subject to risks and uncertainties, actual results may differ materially from those expressed or implied by such forward-looking statements. Investors are cautioned not to place undue reliance on such statements, which speak only as of the date the statements were made. Among the factors that could cause actual results to differ materially are:\ngeneral economic and business conditions; cost and availability of commodities and other raw materials such as vegetables, steel and packaging materials; transportation costs; climate and weather affecting growing conditions and crop yields; availability of financing; leverage and the Company’s ability to service and reduce its debt; foreign currency exchange and interest rate fluctuations; effectiveness of the Company’s marketing and trade promotion programs; changing consumer preferences; competition; product liability claims; the loss of significant customers or a substantial reduction in orders from these customers; changes in, or the failure or inability to comply with, United States, foreign and local governmental regulations, including environmental and health and safety regulations; and other risks detailed from time to time in the reports filed by the Company with the SEC.\nExcept for ongoing obligations to disclose material information as required by the federal securities laws, the Company does not undertake any obligation to release publicly any revisions to any forward-looking statements to reflect events or circumstances after the date of the filing of this report or to reflect the occurrence of unanticipated events.\nContact:\nTimothy J. Benjamin, Chief Financial Officer\n315-926-8100\nSeneca Foods Corporation\nUnaudited Selected Financial Data\nFor the Periods Ended December 30, 2017 and December 31, 2016\n(In thousands of dollars, except share data)\nThird Quarter Year-to-Date Fiscal 2018 Fiscal 2017 Fiscal 2018 Fiscal 2017 Net sales $ 392,714 $ 369,705 $ 1,049,209 $ 979,566 Plant restructuring expense (note 2) $ 101 $ 1,316 $ 157 $ 2,778 Other operating income (expense) net (note 3) $ (17 ) $ (1,153 ) $ 2,615 $ (1,172 ) Operating income (note 1) $ 11,471 $ 13,890 $ 13,893 $ 26,689 Earnings from equity investment - (333 ) (21 ) (500 ) Interest expense, net 4,012 2,414 10,662 6,709 Earnings before income taxes $ 7,459 $ 11,809 $ 3,252 $ 20,480 Income taxes (benefit) expense (268 ) 3,628 (2,524 ) 6,217 Net earnings $ 7,727 $ 8,181 $ 5,776 $ 14,263 Earnings attributable to common stock (note 4) $ 7,690 $ 8,100 $ 5,730 $ 14,116 Basic earnings per common share $ 0.79 $ 0.83 $ 0.59 $ 1.44 Diluted earnings per common share $ 0.78 $ 0.82 $ 0.58 $ 1.43 Weighted average shares outstanding basic 9,739,865 9,770,245 9,781,826 9,790,234 Weighted average shares outstanding diluted 9,809,255 9,839,915 9,851,216 9,859,904 Note 1: The effect of the LIFO inventory valuation method on third quarter pre-tax results decreased operating earnings by $994,000 for the three month period ended December 30, 2017 and increased operating earnings by $3,941,000 for the three month period ended December 31, 2016. The effect of the LIFO inventory valuation method on year-to-date pre-tax results decreased operating earnings by $18,835,000 for the nine month period ended December 30, 2017 and increased operating earnings by $434,000 for the nine month period ended December 31, 2016. Note 2: The nine month period ended December 30, 2017 included a restructuring charge primarily for severance and moving costs of $157,000. The nine month period ended December 31, 2016 included a restructuring charge primarily for severance and moving costs of $2,778,000. Note 3: Other operating income for the nine month period ended December 30, 2017 of $2,615,000 represents a net gain on the sale of unused fixed assets of $1,590,000 and a bargain purchase gain of $1,078,000 for the Truitt Bros. acquisition. Other loss for the nine month period ended December 31, 2016 of $1,172,000 represents a charge for impairment of a long-term asset of $1,052,000, a net loss on the sale of unused fixed assets of $149,000 and a gain of $29,000 to adjust a previously recorded environmental charge. Note 4: The Company uses the \"two-class\" method for basic earnings per share by dividing the earnings attributable to common shareholders by the weighted average of common shares outstanding during the period.\nSource:Seneca Foods Corp.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/9769338e-6ac5-43b4-b088-e2978bb5dbc8"], "published": "2018-01-26T01:00:00.000+02:00", "crawled": "2018-01-26T01:44:42.010+02:00", "highlightTitle": ""}