{"organizations": [], "uuid": "2d5aec507a75f5db7da8bbe93fac07dfd2413b15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 237, "shares": 237, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225742890&w=1200&r=LYNXMPEE0Q09A", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-europe-nordstream-usa/u-s-s-tillerson-says-nord-stream-2-pipeline-would-undermine-europes-energy-security-idUSKBN1FG0CY", "country": "US", "domain_rank": 408, "title": "U.S.'s Tillerson says Nord Stream 2 pipeline would undermine Europe's energy security", "performance_score": 2, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-27T18:34:00.000+02:00", "replies_count": 0, "uuid": "2d5aec507a75f5db7da8bbe93fac07dfd2413b15"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-europe-nordstream-usa/u-s-s-tillerson-says-nord-stream-2-pipeline-would-undermine-europes-energy-security-idUSKBN1FG0CY", "ord_in_thread": 0, "title": "U.S.'s Tillerson says Nord Stream 2 pipeline would undermine Europe's energy security", "locations": [], "entities": {"persons": [{"name": "tillerson", "sentiment": "negative"}, {"name": "rex tillerson", "sentiment": "none"}, {"name": "marcin goettig", "sentiment": "none"}, {"name": "lidia kelly", "sentiment": "none"}, {"name": "mark potter", "sentiment": "none"}], "locations": [{"name": "warsaw", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "warsaw", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "thomson reuters trust principles", "sentiment": "none"}, {"name": "state", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 10:34 AM / in 2 hours U.S. says planned Russian pipeline would threaten European energy security Marcin Goettig , Lidia Kelly 3 Min Read \nWARSAW (Reuters) - The United States sees the planned Nord Stream 2 gas pipeline between Russia and Germany as a threat to Europe’s energy security, U.S. Secretary of State Rex Tillerson said on Saturday. \nPoland, Ukraine and Baltic states fear the pipeline would increase Europe’s dependence on Russian gas and provide the Kremlin with billions of dollars of additional revenue to finance a further military build-up on European Union’s borders. \n“Like Poland, the United States opposes the Nord Stream 2 pipeline. We see it as undermining Europe’s overall energy security and stability,” Tillerson said at a joint news conference with the Polish foreign minister in Warsaw. \n“Our opposition is driven by our mutual strategic interests,” he said. \nThe United States has already sanctioned Russian companies over Moscow’s involvement in the Ukraine crisis, and foreign companies investing in or helping Russian energy exploration. \nPoland, an EU member since 2004, sees Russia as its biggest potential threat, especially since Moscow annexed the Crimean peninsula from neighboring Ukraine in 2014. \nRussia is also engaged in the long civil war in Syria, which has killed hundreds of thousands of people, driven millions from their homes, and fueled a refugee crisis in the European Union. \n“SUPPLY SECURITY” \nNordic nations have already voiced security concerns over the pipeline being laid near their shores under the Baltic. \nBut Germany and Austria have focused more on the commercial benefits of having more cheap gas, arguing there could be little harm from an additional pipe. \n“Any additional gas infrastructure can contribute to increased supply security in Europe,” Germany’s economy ministry spokesman said, adding Berlin’s stance was that Nord Stream 2 was a commercial venture that must comply with relevant laws. \nGerman energy groups Uniper and Wintershall, Austria’s OMV, Anglo-Dutch group Shell and France’s Engie have invested in the 1,225 km (760 mile) pipeline, which is to pump more Russian gas via the Baltic Sea. \nPoland, which spent four decades under Soviet domination after World War Two, still imports Russian gas to meet about two-thirds of its consumption. \nBut it has invested in a liquefied natural gas (LNG) terminal on the Baltic coast to diversify supplies and plans to build a gas link to Norway. \nPoland, whose main trade partner is Germany but main security ally Washington, signed in November a long-term deal to buy LNG from the United States. \n“We are proud to support Poland’s energy diversification and security,” Tillerson said. Reporting by Marcin Goettig and Lidia Kelly in WARSAW, additional reporting by Thomas Escritt in BERLIN, writing by Marcin Goettig; Editing by Andrew Bolton/Jeremy Gaunt", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-27T18:34:00.000+02:00", "crawled": "2018-01-27T12:50:23.012+02:00", "highlightTitle": ""}