{"organizations": [], "uuid": "327d91a893702ffe28690d960aaeea34420b8160", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-digital-technologies-in-chemical-plant-operations-beginning-to-drive-profits-fueling-further-investments-accenture-research.html", "country": "US", "domain_rank": 767, "title": "Digital Technologies in Chemical Plant Operations Beginning to Drive Profits, Fueling Further Investments, Accenture Research Finds", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T15:59:00.000+02:00", "replies_count": 0, "uuid": "327d91a893702ffe28690d960aaeea34420b8160"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-digital-technologies-in-chemical-plant-operations-beginning-to-drive-profits-fueling-further-investments-accenture-research.html", "ord_in_thread": 0, "title": "Digital Technologies in Chemical Plant Operations Beginning to Drive Profits, Fueling Further Investments, Accenture Research Finds", "locations": [], "entities": {"persons": [{"name": "digi", "sentiment": "negative"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "digital technologies", "sentiment": "negative"}, {"name": "accenture research finds greater", "sentiment": "negative"}, {"name": "accenture", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "acn", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Greater connectivity also prompts concerns over cybersecurity risks\nNEW YORK--(BUSINESS WIRE)-- Digital adoption is increasing in chemical companies’ plants as more firms recognize the technologies’ financial and operational value, according to Accenture’s (NYSE:ACN) new “ Digital Technology in Chemical Plant Operations ” survey. Yet, digital technologies are still in the early stages of deployment on the plant floor.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180124005171/en/\n(Graphic: Business Wire)\nThat may be changing, however. The survey of 360 chemical executives from 12 countries revealed 80 percent of respondents are investing more, or significantly more, in digital technologies for their plant environments, and 85 percent expect overall digital investment to increase in the next three years. Moreover, 92 percent of chemical executives are satisfied with the benefits received from their digital investments, with effective plant management the top cited benefit, followed by improved product quality.\nAn overwhelming number of respondents (95 percent) are also seeing the tangible financial value of utilizing digital in their operations. Just under one-third (31 percent) saw an operating profit improvement in production/manufacturing operations of 10 to 20 percent, with an additional 20 percent seeing gains of 20 to 40 percent. This is supported by our recent Industry X.0 research , which showed that combining technologies like augmented reality/virtual reality, autonomous vehicles, big data analytics and digital twin to increase operational efficiency could realize initial savings of more than US$90,000 per chemical company employee.\nAlthough many chemical companies have started pilot programs across their operations, full deployment of digital technologies remains limited. Even for technologies where executives see more widespread adoption, including cloud, robotics, artificial intelligence, mobility/wearables and cybersecurity, less than one-third of respondents cited using each technology broadly.\nWhen it comes to pilot programs, analytics is the technology in which chemical companies are investing most often, cited by 43 percent of respondents. Just under half (46 percent) listed analytics in their top three digital investment areas over the next three years, as it provides a way to drive more value from the large amounts of generated data. In fact, half (51 percent) saw analytics as one of the top three technologies with the most return-on-investment potential in the next 12 months, more than for other technologies. Of this group of chemical executives, one in three plans to allocate 21 to 40 percent of their digital budget to analytics.\n“In the chemical industry, there is a growing understanding of the potential for the digital reinvention of industry – or Industry X.0 – where businesses use advanced digital technologies to transform their core operations, worker and customer experiences and business models,” said Tracey Countryman, managing director and lead for Industry X.0, Accenture Resources. “By harnessing this reinvention, chemical companies can release value trapped in the enterprise not only by realizing efficiencies through smart connected assets but also through new digitally-enabled sources of revenue.”\nMeanwhile, chemical firms’ plant operations are becoming increasingly connected, leaving them open to the growing threat of cyberattacks. In the past 12 months, 73 percent of respondents had more than 30 attempted breaches of their plant operations, more than half (54 percent) suggested more than 30 attacks were successful, and 50 percent indicated it took days, weeks or even months to detect them.\nYet, faced with this challenge, chemical companies’ abilities to identify, handle and respond to the threats are severely lacking. Currently, only 42 percent can manage the financial risk due to a cybersecurity event targeting their plant operations, or minimize the disruption. Even less (39 percent) can identify the cause of a breach, and only a third (33 percent) are able to monitor for breaches.\nThe repercussions of successful cyberattacks could be considerable. “Commercial consequences” was cited as the top cybersecurity risk to plant operations by 16 percent of respondents. This encompasses production loss and breach of customer supply contracts, which demonstrates that successful cyberattacks could have a serious impact on the bottom line. Environment, health and safety (15 percent) and operational reliability (14 percent) risks were ranked second and third, respectively. The former suggests cyberattacks on plant operations could present a threat to the security and health of employees and the wider public.\n“ Chemical companies must invest urgently to bolster cybersecurity resilience and response capabilities for their industrial operations,” said Robert Boyce, managing director and cybersecurity lead, Chemicals & Natural Resources, Accenture. “ As chemical plants typically have legacy operational technology systems, the technology across sites is not standardized and there are gaps in their security controls, leaving them exposed. Agile and adaptive capabilities are needed that can effectively react to and intervene with cyber threats to protect industrial operations.”\nResearch Methodology\nAccenture conducted an online survey of 360 C-level and top management executives and functional leaders in the chemical industry. The survey focused on chemical companies with a total annual revenue ranging from US$500 million to more than US$20 billion that are currently leveraging digital technology in their core operations. The survey was fielded in mid-March through mid-April 2017 and included respondents from Canada, France, Germany, Japan, the Netherlands, Saudi Arabia, Singapore, Switzerland, Turkey, the United Arab Emirates, the U.K. and the U.S.\nAbout Accenture\nAccenture is a leading global professional services company, providing a broad range of services and solutions in strategy, consulting, digital, technology and operations. Combining unmatched experience and specialized skills across more than 40 industries and all business functions – underpinned by the world’s largest delivery network – Accenture works at the intersection of business and technology to help clients improve their performance and create sustainable value for their stakeholders. With approximately 435,000 people serving clients in more than 120 countries, Accenture drives innovation to improve the way the world works and lives. Visit us at www.accenture.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124005171/en/\nAccenture\nGuy Cantwell, +1 281 900 9089\nguy.cantwell@accenture.com\nor\nMatt Corser, +44 755 784 9009\nmatthew.corser@accenture.com\nSource: Accenture", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fnewsroom.accenture.com%2Fnews%2Fcompanies-that-harness-digital-technologies-to-boost-efficiency-and-grow-their-business-could-raise-their-market-capitalization-by-6-billion-on-average-accenture-finds.htm&esheet=51747796&newsitemid=20180124005171&lan=en-US&anchor=Industry+X.0+research&index=2&md5=46484d8649f2a913ac641d2a83e71fab", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.accenture.com&esheet=51747796&newsitemid=20180124005171&lan=en-US&anchor=www.accenture.com&index=5&md5=0a01db961e944406c940989908a1fa51", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.accenture.com%2Fus-en%2Finsight-data-achieving-centric-security-2017&esheet=51747796&newsitemid=20180124005171&lan=en-US&anchor=Agile+and+adaptive+capabilities&index=4&md5=cf7c9fb9f921260137f8c3451666a04f", "http://www.businesswire.com/news/home/20180124005171/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.accenture.com%2Findustry-x0&esheet=51747796&newsitemid=20180124005171&lan=en-US&anchor=Industry+X.0&index=3&md5=bf0bd76756db8f035b124a900a022a5e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.accenture.com%2Fus-en%2Finsight-power-plant-operations&esheet=51747796&newsitemid=20180124005171&lan=en-US&anchor=Digital+Technology+in+Chemical+Plant+Operations&index=1&md5=7afeee9fa7cf287bf00eb3503f310ee0"], "published": "2018-01-24T15:59:00.000+02:00", "crawled": "2018-01-24T17:52:23.000+02:00", "highlightTitle": ""}