{"organizations": [], "uuid": "eac26ab5fb27924329cf70b9588e1d1f4d8e1333", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222813142&w=1200&r=LYNXMPEE0G1NS", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-children-schools/most-states-dont-require-that-kids-be-checked-for-health-issues-idUKKBN1F62NY", "country": "US", "domain_rank": 408, "title": "Most states don’t require that kids be checked for health issues", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T21:38:00.000+02:00", "replies_count": 0, "uuid": "eac26ab5fb27924329cf70b9588e1d1f4d8e1333"}, "author": "", "url": "https://uk.reuters.com/article/us-health-children-schools/most-states-dont-require-that-kids-be-checked-for-health-issues-idUKKBN1F62NY", "ord_in_thread": 0, "title": "Most states don’t require that kids be checked for health issues", "locations": [], "entities": {"persons": [{"name": "redlener", "sentiment": "none"}, {"name": "anne harding", "sentiment": "none"}, {"name": "irwin redlener", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "children’s health fund", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "hbl", "sentiment": "none"}, {"name": "columbia university’s mailman school of public health", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 7:38 PM / Updated 43 minutes ago Most states don’t require that kids be checked for health issues Anne Harding 4 Min Read \n(Reuters Health) - - Most U.S. states don’t require that children be screened for health conditions that can affect learning, according to new research supported by the Children’s Health Fund (CHF). \n“There are many children, especially in low income communities, that are not succeeding academically because they have health conditions that are known to interfere with learning, but nobody is screening for them or treating them,” Dr. Irwin Redlener, Co-Founder of Children’s Health Fund and Professor of Health Policy and Management at Columbia University’s Mailman School of Public Health, told Reuters Health in a telephone interview. “That is something that has to be fixed.” \nThe study was published online January 17 in the scientific journal PLoS One. \nRedlener and his colleagues focused on seven conditions clearly linked to worse academic performance if left untreated. Known as Health Barriers to Learning (HBL), they include impaired vision, hearing problems, uncontrolled asthma, mental health and behavioral problems, dental pain, persistent hunger, and lead poisoning. \nWhile children who have annual checkups will be screened regularly for these conditions, 20 percent of school-aged children did not receive a well-child exam in the past year, the researchers say. Poor families, Hispanic children and children without health insurance are more likely to miss check-ups. \nStates can help fill these gaps by requiring children to undergo health screening in order to be attend school, Redlener and his colleagues say. They looked at laws on school health exams for each state and the District of Columbia, grading them from A to F based on whether the state required students to undergo comprehensive health exams, whether or not it required school health forms, and how many HBLs were addressed. \nOverall, 80% of states had requirements for student vision screening, 75% required at least one hearing screening, and 49% required a comprehensive health exam. \nThirteen of the 25 states that required thorough check-ups also required that health forms be filled out, while the remaining 12 made forms available but did not require them to be filled out, or did not make it clear that they were required. \nEight states got “Fs” because they had no laws requiring comprehensive physical exams, student health forms in addition to immunization forms, or screening for any of the seven health barriers to learning. States that failed were Alabama, Idaho, Mississippi, North Dakota, South Carolina, South Dakota, Wisconsin, and Wyoming. Twenty-one states got Ds, 15 got Cs and six scored a “B”. \nNew York, California and Texas, the country’s most populous states, scored “C,” “C” and “D,” respectively. \nFifty-seven percent of children in the U.S., or nearly 42 million, live in a state that got a D or an F grade, the researchers note. Just 12% - about 9 million - live in states that scored an A or a B. \nRedlener and his colleagues would like to see laws in every state requiring regular school health screenings for all seven HBLs. “This is going to be the first annual survey of the states to see if things are improving in terms of more states requiring this kind of health screening,” Redlener said. \nSOURCE: bit.ly/2DGQzPo PLoS One, online January 17, 2018.", "external_links": [], "published": "2018-01-17T21:38:00.000+02:00", "crawled": "2018-01-17T22:32:56.000+02:00", "highlightTitle": ""}