{"organizations": [], "uuid": "87af7ea60f895e329e3929cb8f2ec694f5d1cbdb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-congress-train/train-carrying-u-s-republican-lawmakers-hits-truck-minor-injuries-source-idUKKBN1FK2HK", "country": "US", "domain_rank": 408, "title": "Train carrying U.S. Republican lawmakers hits truck; minor injuries - source", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T19:05:00.000+02:00", "replies_count": 0, "uuid": "87af7ea60f895e329e3929cb8f2ec694f5d1cbdb"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-congress-train/train-carrying-u-s-republican-lawmakers-hits-truck-minor-injuries-source-idUKKBN1FK2HK", "ord_in_thread": 0, "title": "Train carrying U.S. Republican lawmakers hits truck; minor injuries - source", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " 06 PM / Updated 9 minutes ago Train carrying U.S. Republican lawmakers hits truck in Virginia, one dead Reuters Staff 3   An Amtrak passenger train carrying Republican members of the U.S. Congress from Washington to a retreat in West Virginia slammed into a garbage truck on Wednesday in Crozet, Virginia, killing at least one person aboard the truck, authorities said. \nThere was one confirmed fatality and one serious injury in the collision, the White House said. Republican Senator Bill Cassidy, who was on the train, said on Twitter that three people were in the truck and one was killed. Of the other two, Cassidy said, one had sustained major injuries and one had minor injuries. \n“There are no serious injuries among members of Congress or their staff,” White House spokesman Sarah Sanders said. \nA spokeswoman for the Congressional Institute, the conference’s sponsor, said one member of Congress was sent to the hospital, and there were some minor injuries, MSNBC reported. \nThe train was taking lawmakers to an annual retreat being held this year in White Sulphur Springs, West Virginia, just west of the Virginia state line. \nAmtrak said in a statement the collision occurred at 11:20 a.m. and local law enforcement was investigating the incident. Crozet is a tiny town between the college town of Charlottesville, Virginia, and White Sulphur Springs. \nImmediately after the crash, a law enforcement team dressed in black surrounded the train with automatic weapons drawn and searched the surrounding area for possible attackers as first responders treated the injured, said a local emergency worker, speaking on condition of anonymity. \n“They surrounded the train on both sides and set up a perimeter with their automatic weapons pointing out and then searched the woods around the train,” the worker said. “At least five members of Congress helped firefighters and EMTs (emergency medical technicians) treat the three injured people who had been in the truck.” \nPassengers had a “few bumps and bruises,” one passenger on the train told Reuters. U.S. Representative Carlos Curbelo told MSNBC there were minor injuries but “most people are OK.” \nCassidy, a doctor, said he and other physicians tended to the patients until emergency personnel showed up. \n“We’re fine, but our train hit a garbage truck. Members with medical training are assisting the drivers of the truck,” Representative Greg Walden wrote on Twitter. Related Coverage Amtrak says no injuries reported to crew, passengers in crash \nThe Republican retreat, an opportunity for lawmakers to discuss both legislation and politics in the run-up to November’s congressional elections, was scheduled to run until midday Friday. \nPresident Donald Trump was scheduled to attend on Thursday. Vice President Mike Pence was due to attend on Wednesday. \nA dispatcher for the Albemarle County Police Department said police and fire and rescue units had been sent to the crash site but had no information about injuries. Reporting By Richard Cowan, Ian Simpson, Katanga Johnson, Makini Brice, Susan Cornwell; Writing by John Whitesides; Editing by Will Dunham", "external_links": [], "published": "2018-01-31T19:05:00.000+02:00", "crawled": "2018-01-31T19:34:33.100+02:00", "highlightTitle": ""}