{"organizations": [], "uuid": "a74d3732b17fd0eac998ca0449141cfe5be232f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226811939&w=1200&r=LYNXMPEE0U06H", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-australia-economy-inflation/australia-inflation-stays-subdued-in-fourth-quarter-rate-hike-still-distant-idUSKBN1FK0E5", "country": "US", "domain_rank": 408, "title": "Australia inflation stays subdued in fourth quarter, rate hike still distant", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T12:10:00.000+02:00", "replies_count": 0, "uuid": "a74d3732b17fd0eac998ca0449141cfe5be232f3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-australia-economy-inflation/australia-inflation-stays-subdued-in-fourth-quarter-rate-hike-still-distant-idUSKBN1FK0E5", "ord_in_thread": 0, "title": "Australia inflation stays subdued in fourth quarter, rate hike still distant", "locations": [], "entities": {"persons": [], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "rba", "sentiment": "none"}, {"name": "reserve bank of australia", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SYDNEY (Reuters) - Australian consumer prices remained subdued last quarter as core inflation ended a second whole year below the central bank’s target, leading investors to widen the odds on a hike in interest rates anytime soon.\nThe local dollar fell a quarter of a U.S. cent as the headline consumer price index (CPI) rose 0.6 percent in the December quarter, missing forecasts for a 0.7 percent rise.\nAnnual CPI inflation ran at 1.9 percent, again under estimates. Key measures of underlying inflation favored by the Reserve Bank of Australia (RBA) averaged around 1.9 percent for the year, dead on expectations.\nCore inflation has now undershot the RBA’s long-term target band of 2 percent to 3 percent for eight straight quarters, the longest period on record.\nA major headwind has been wages growth, which slowed to historic lows even as employment boomed, a phenomenon shared with much of the developed world.\n“Global competition, increased automation, decreased unionization, reduced collective bargaining and the increased casualisation of the workforce have largely contained pay increases,” said Ryan Felsman, a senior economist at CommSec.\n“There is increasing uncertainty about the size and timing of how wage pressures might eventually pass through to prices.”\nAs a result, the central bank has kept interest rates at an all-time low of 1.5 percent since mid-2016, and appears in no hurry to raise them.\nInvestors assumed the benign inflation result would only add to the patience of policy makers and pushed out the likely timing of a first hike.\nInterest rate futures imply around a 50-50 chance of a move by August. A hike to 1.75 percent is now not fully priced in until December, compared to November before the data.\nTHE AMAZON EFFECT The Australian Bureau of Statistics reported the main price increases in the fourth quarter were petrol, which jumped more than 10 percent, domestic holidays, fruit and tobacco.\nTobacco is a serial offender due to steep annual increases in taxes. Excluding that rise, inflation ran at only 1.5 percent for the year.\nThe main price falls in the quarter were for traveling abroad, telecoms and computers and televisions.\nA fierce price war has broken out in Australian retail in recent years driven by an influx of foreign chains, with no sign of a cease-fire any time soon.\nIf anything, the struggle is only heating up as online behemoth Amazon launched late last year vowing to beat all the competition - a disinflationary trend that policymakers now refer to as the “Amazon effect”.\nAdding to downside pressure will be strength in the local dollar, which climbed from as low as $0.7500 in early December to reach a 2-1/2-year peak of $0.8136 last week.\nIf sustained, the rise will lower prices for many imported goods that have already been depressed by globalization and the ascent of industrial giants such as China.\nPrices for such tradable goods and services edged up 0.5 percent in the December quarter, but were still down 0.3 percent for the year.\nReporting by Wayne Cole; Editing by Sam Holmes\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T12:10:00.000+02:00", "crawled": "2018-01-31T16:29:50.003+02:00", "highlightTitle": ""}