{"organizations": [], "uuid": "61500267bac0631258eca52d4677da3721eff056", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223895340&w=1200&r=LYNXMPEE0K0LR", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-iran-nuclear-eu-usa/spurned-by-trump-europeans-ponder-how-to-meet-iran-ultimatum-idUSKBN1FA0S4", "country": "US", "domain_rank": 408, "title": "Spurned by Trump, Europeans ponder how to meet Iran ultimatum", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T17:34:00.000+02:00", "replies_count": 0, "uuid": "61500267bac0631258eca52d4677da3721eff056"}, "author": "", "url": "https://www.reuters.com/article/us-iran-nuclear-eu-usa/spurned-by-trump-europeans-ponder-how-to-meet-iran-ultimatum-idUSKBN1FA0S4", "ord_in_thread": 0, "title": "Spurned by Trump, Europeans ponder how to meet Iran ultimatum", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "john irish", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "arshad mohammed", "sentiment": "none"}, {"name": "robin emmott", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS/BRUSSELS/WASHINGTON (Reuters) - A day before Donald Trump’s Jan. 12 ultimatum to “fix” the Iran nuclear deal, European powers met Iran’s foreign minister to show support for it, but the effort failed to soften Trump’s aversion to the accord, U.S. and European officials said.\nThe gathering in Brussels may even have reinforced the U.S. president’s antipathy, according to three U.S. officials involved in the discussions.\nTrump instead gave the European allies, Britain, France, Germany, and the U.S. Congress 120 days to come up with a tougher approach on Tehran or see U.S. sanctions reimposed, they said.\nWith Trump warning of a last chance for “the worst deal ever negotiated”, Britain, France and Germany have begun talks on a plan to satisfy him by addressing Iran’s ballistic missile tests and its regional influence while preserving the 2015 accord that curbed Iran’s nuclear ambitions for at least a decade.\nIt is hard to say what might mollify the Trump administration, which is split between those who would like to tear up the agreement and those who wish to preserve it and which has said inconsistent things about its demands to keep the accord, U.S. and European officials said.\nUnder U.S. law, Trump must decide again whether to renew the U.S. sanctions relief every 120 days, giving Congress, as well as U.S. and European diplomats, until mid-May to see if there is a way to finesse the issue.\nBut the Brussels meeting has left European powers wary that whatever they agree, it may not be enough.\n“We’re going to work in the spirit that we’re ready to talk about everything, from the nuclear accord to Iran’s ballistic missiles,” said a senior European diplomat. “But we want to compartmentalise the subjects; we’re not going to mix them.”\nAt stake is not just an historic accord negotiated - before Trump took office - by the United States, China, France, Russia, Britain, Germany and the European Union, and one that Europe sees as its biggest diplomatic achievement in decades.\nA collapse of the nuclear deal could see a breakdown in the relations between the United States and Europe that have underpinned the West’s security since World War Two, European diplomats and the senior U.S. official said, and could confirm Europe’s fears that it can no longer count on U.S. leadership.\nBritain, France, Germany and the EU’s foreign policy chief, Federica Mogherini, are adamant that the deal cannot be renegotiated, while Russian Foreign Minister Sergei Lavrov also ruled that out this month, speaking at the United Nations.\nInitial contacts between the three European powers in Washington, European capitals and at the EU’s headquarters in Brussels suggest that Paris, London and Berlin will present a package of measures to the United States to allay Trump’s concerns about Iran but that do not reopen the nuclear accord.\nBALLISTIC THREAT The strategy could include threatening Iran with targeted economic sanctions if it does not agree to curtail its ballistic weapons arsenal, which the West believes contains longer-range missiles potentially capable of carrying nuclear warheads.\nBritain's Foreign Secretary Boris Johnson attends a news conference with French Foreign Minister Jean-Yves Le Drian, German counterpart Sigmar Gabriel and European Union's foreign policy chief Federica Mogherini after meeting Iran's Foreign Minister Mohammad Javad Zarif (unseen) in Brussels, Belgium January 11, 2018. REUTERS/Francois Lenoir European diplomats favor creating a high-level working group with Iran to discuss the missile issue, while reminding Trump that NATO’s ballistic missile defense shield in southeastern Europe will boast a new site in Poland this year.\nWashington wants U.N. nuclear inspectors to be able to visit military sites as part of the International Atomic Energy Agency’s verification of the nuclear deal. The IAEA says it does not distinguish between military and non-military sites and has repeatedly said Iran is honoring its commitments under the deal.\nDiplomats say the IAEA has not yet inspected a military site, and if Washington wants it to do so it needs to provide new information showing that this is necessary.\nFor its part, Iran has said its military sites are beyond the IAEA’s purview and repeatedly denied that its nuclear program has military dimensions, namely to develop bombs.\nAnother part of the potential European strategy is pressure on Iran to rein in Middle East proxies such as Hezbollah, and to stop arming Houthi fighters combating government forces in Yemen’s war, which has devastated the country.\nThere is discussion to push Iran to embrace U.N-backed peace talks for Syria, where Tehran is sharply at odds with the West in its support for President Bashar al-Assad and whose departure the United States and its EU allies have long sought.\nThat could dovetail with U.S. legislative efforts to change the nuclear deal’s so-called sunset provisions as they expire from 2025, so that if Iran were eventually to launch a nuclear arms program, U.S. sanctions would kick in again.\nIn the U.S. Congress, the leaders of the Senate Foreign Relations Committee are working with the White House to write legislation they hope can meet Trump’s demand to eliminate “the disastrous flaws” in the pact.\n“Presented the right way, it could be just enough to allow Trump to claim a diplomatic victory and sign legislation from Congress,” said a senior EU diplomat.\nMogherini will brief EU foreign ministers on Monday, while U.S. Secretary of State Rex Tillerson will meet his British and French counterparts in London and Paris this week on a trip where Iran “will dominate” many conversations, an aide said.\n“RAGING DISAGREEMENTS”\nWhile Britain, Germany and France appear united, Mogherini has so far been unwilling to consider EU sanctions on Iran over its ballistic missiles to avoid jeopardizing the nuclear deal.\nIran already rejected a call in November by French President Emmanuel Macron for talks on its missiles, saying they were solely defensive in nature. “Their concept of dialogue is to explain that they are right,” a Western diplomat said of Iran.\nBritain, France and Germany also face a divided U.S. government - current and former U.S. officials said it is unclear whether Trump wants to save the pact or has set the Europeans and Congress an impossible task, giving him an excuse to end the deal and for someone to take the fall.\n”There are these raging disagreements within the (Trump) administration,“ ” said a former U.S. official. “While one group wants to keep the agreement, the other wants this outreach to the Europeans and the Congress to fail and to be able to blame it on them.”\nAdditional reporting by Andrea Shalal in Berlin, Michelle Nichols in New York, Francois Murphy in Vienna, John Walcott and Patricia Zengerle in Washington; editing by Mark Heinrich, William Maclean\n ", "external_links": [], "published": "2018-01-21T17:34:00.000+02:00", "crawled": "2018-01-21T17:50:54.013+02:00", "highlightTitle": ""}