{"organizations": [], "uuid": "7172025b1da10f69e95e514462c3061a1b25e6d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-sparta-systems-appoints-stephen-mccarthy-as-vp-of-digital-innovation.html", "country": "US", "domain_rank": 767, "title": "Sparta Systems Appoints Stephen McCarthy as VP of Digital Innovation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-08T17:00:00.000+02:00", "replies_count": 0, "uuid": "7172025b1da10f69e95e514462c3061a1b25e6d1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-sparta-systems-appoints-stephen-mccarthy-as-vp-of-digital-innovation.html", "ord_in_thread": 0, "title": "Sparta Systems Appoints Stephen McCarthy as VP of Digital Innovation", "locations": [], "entities": {"persons": [{"name": "stephen mccarthy", "sentiment": "negative"}, {"name": "mccarthy", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}], "organizations": [{"name": "sparta systems", "sentiment": "negative"}, {"name": "digital innovation hamilton", "sentiment": "negative"}, {"name": "sparta", "sentiment": "none"}, {"name": "johnson & johnson", "sentiment": "none"}, {"name": "j&j", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HAMILTON, N.J., Jan. 8, 2018 /PRNewswire/ -- Sparta Systems, a global leader of quality management system (QMS) software , today announced that Stephen McCarthy has been appointed to the newly created role of VP of digital innovation. Mr. McCarthy has nearly three decades of experience within the healthcare industry and has held several high-profile positions within Johnson & Johnson (J&J), the most recent of which was as VP of quality systems shared services for the company's pharmaceutical, medical device, and consumer segments.\nDuring his tenure at J&J, Mr. McCarthy led a team of over 280 employees, implementing complex systems and quality process transformations across the enterprise, delivering multimillion-dollar value propositions, and greatly increasing product safety and supply chain continuity. In this new role, Mr. McCarthy supports Sparta's mission of helping the industries Sparta serves improve product quality and safety, streamline operations, and lower risk and ensure compliance, using innovative cloud solutions that support an all-digital strategy. His experience makes him uniquely qualified to help customers along their journey and further the industry.\n\"Having spent nearly thirty years within the healthcare industry, I know what it's like to walk in the shoes of a quality analyst, engineer, manager, director, and VP. I've been faced with enormous decisions over the course of my career, and know that it's solutions like the ones that Sparta provides that enable healthcare providers and manufacturers to make the right call when a patient's health and even life hang in the balance,\" said McCarthy.\nMr. McCarthy went on to say, \"I chose to join Sparta because of the tremendous amount of respect both I and those in the healthcare industry have for the company and its solutions – particularly its innovative new cloud QMS solution which has been so well received and broadly adopted. Without those solutions quality teams would be at a loss, unable to ensure product safety, quality, efficacy, or supply chain reliability. I'm thrilled by the opportunity to help drive business and digital transformation and innovation across the broader healthcare industry through Sparta's solutions.\"\nEileen Martinson, CEO of Sparta Systems, said, \"Stephen is a recognized leader in business transformation and large-scale technological deployments. His unique insights and experiences will help clients to get the most value out of their quality management systems. We are truly excited about the unique perspective and experience he brings and look forward to helping him transition from former customer to a member of our leadership team.\"\nTo learn more about Sparta and its mission, visit www.spartasystems.com/our-mission\nAbout Sparta Systems\nFounded in 1994, Sparta Systems is the world's premier provider of cloud and on-premise quality management software. We offer the solutions, analytics, and expertise that speed up quality and compliance. Our solutions help to lower risk, increase efficiency, and keep consumers safe while allowing manufacturers, suppliers, and distributors to collaborate in a seamless and integrated environment. Sparta is privately owned and headquartered in Hamilton N.J, with offices across Europe and Asia. We support close to 1 million users across 700+ implementations, in more than 30 countries. Companies in life sciences, consumer products, discrete manufacturing and more, rely on Sparta. Learn why at www.spartasystems.com\nCONTACT: Kerin Norton, sparta@shiftcomm.com\nView original content: http://www.prnewswire.com/news-releases/sparta-systems-appoints-stephen-mccarthy-as-vp-of-digital-innovation-300578600.html\nSOURCE Sparta Systems", "external_links": ["http://www.spartasystems.com/our-mission", "http://www.prnewswire.com/news-releases/sparta-systems-appoints-stephen-mccarthy-as-vp-of-digital-innovation-300578600.html", "https://www.spartasystems.com/products/123compliance-qms", "http://www.spartasystems.com/", "https://www.spartasystems.com/products", "https://www.spartasystems.com/solutions/qms-by-process"], "published": "2018-01-08T17:00:00.000+02:00", "crawled": "2018-01-08T19:05:17.006+02:00", "highlightTitle": ""}