{"organizations": [], "uuid": "3cc916341d32e00faf0a50025227177d57fca815", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223902665&w=1200&r=LYNXMPEE0K0N8", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-germany-france/merkel-macron-to-deepen-franco-german-cooperation-strengthen-eu-idUKKBN1FA0US", "country": "US", "domain_rank": 408, "title": "Merkel, Macron to deepen Franco-German cooperation, strengthen EU", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T18:16:00.000+02:00", "replies_count": 0, "uuid": "3cc916341d32e00faf0a50025227177d57fca815"}, "author": "", "url": "https://uk.reuters.com/article/uk-germany-france/merkel-macron-to-deepen-franco-german-cooperation-strengthen-eu-idUKKBN1FA0US", "ord_in_thread": 0, "title": "Merkel, Macron to deepen Franco-German cooperation, strengthen EU", "locations": [], "entities": {"persons": [{"name": "macron", "sentiment": "negative"}, {"name": "merkel", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "macron", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "eu reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "elysee treaty", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 4:21 PM / Updated 32 minutes ago Merkel, Macron to deepen Franco-German cooperation, strengthen EU Reuters Staff 3 Min Read \nBERLIN/PARIS (Reuters) - Chancellor Angela Merkel and President Emmanuel Macron said on Sunday they wanted to deepen Franco-German cooperation and give the European Union a fresh push towards closer integration. \nAfter meeting in Paris on Friday, Merkel and Macron talked up the prospect of agreeing reforms to the euro zone, saying they were committed to strengthening the bloc. \n“We are doing that in order to bring the people in our countries even closer together. And we do it to give the whole of Europe a new boost, to make it even stronger,” Merkel said in a joint video podcast. \nIn a joint statement on the occasion of the 55th anniversary of the Franco-German Cooperation Treaty, also known as the Elysee Treaty, Merkel and Macron said they had agreed to draw up a new treaty this year. \n“We want to consolidate and renew our cooperation with a view to moving ahead with a prosperous and competitive Europe, more sovereign, united and democratic,” the two leaders said. \nThey want their new bilateral compact to define common positions on all key European and international issues. \nSigned on January 23, 1963 between Charles de Gaulle and Konrad Adenauer, the Elysee Treaty sealed the reconciliation between the two countries following World War Two and defined the organization and principles of their bilateral relation, including twice-yearly meetings between their heads of state. \nIn a speech on Europe at the Paris Sorbonne university in September, days after the German election, Macron had said he wanted to work on a new treaty. \nNearly four months later, Merkel is still trying to form a coalition government, making it hard for her to respond to Macron’s proposals for EU reform. \nGermany’s center-left Social Democrats (SPD) decided on Sunday to start formal coalition talks with Merkel’s conservatives. \nIn their statement, Merkel and Macron said a new treaty would more deeply integrate their countries’ economies, boost sustainable development and the shift to a digital economy, and favour economic, fiscal and social convergence. \nThey want to boost defense, security and intelligence cooperation, and draft a joint response to the challenges of uncontrolled migration. Reporting by Michael Nienaber in Berlin and Geert De Clercq in Paris; Editing by John Stonestreet, William Maclean", "external_links": [], "published": "2018-01-21T18:16:00.000+02:00", "crawled": "2018-01-21T19:03:15.033+02:00", "highlightTitle": ""}