{"organizations": [], "uuid": "25a1fad11497fec79711f7eee7534f775481df84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/08/11/103864092-GettyImages-542228990.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/the-money-lesson-lebron-james-uncles-taught-him-when-he-was-a-kid.html", "country": "US", "domain_rank": 767, "title": "The money lesson LeBron James' uncles taught him when he was a kid", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.201, "site_type": "news", "published": "2018-01-29T16:58:00.000+02:00", "replies_count": 0, "uuid": "25a1fad11497fec79711f7eee7534f775481df84"}, "author": "Kathleen Elkins", "url": "https://www.cnbc.com/2018/01/29/the-money-lesson-lebron-james-uncles-taught-him-when-he-was-a-kid.html", "ord_in_thread": 0, "title": "The money lesson LeBron James' uncles taught him when he was a kid", "locations": [], "entities": {"persons": [{"name": "lebron james", "sentiment": "negative"}, {"name": "james", "sentiment": "none"}, {"name": "david liam kyle", "sentiment": "none"}], "locations": [{"name": "akron", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "maverick cater", "sentiment": "none"}, {"name": "cleveland cavaliers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Before LeBron James exploded onto the basketball scene, he and his single mom were struggling to make ends meet. Raised on welfare in Akron, Ohio, they moved from one apartment to the next every few months and fed themselves with food stamps.\nWhile he didn't have much as a kid, he learned how to manage the little money he did have, thanks to early money lessons from his uncles.\n\"My uncles always taught me — they taught me how to have a savings account,\" James told Maverick Cater on a new episode of \" Kneading Dough .\" \"They'd give me a dollar and they'd be like, 'Listen nephew, go spend 35 cents of it and keep the other 65.' Or, if they gave me two dollars, they'd be like, 'Go ahead and spend a dollar of it, but stash the other dollar.'\n\"So I'm always in my head about stashing and keeping my money sacred and to myself because I didn't know when my uncle was going to give me another dollar here and another 50 cents here.\"\nDavid Liam Kyle | NBAE | Getty Images LeBron James #23 of the Cleveland Cavaliers It was an early lesson in the important of paying yourself first , no matter your income.\nWhether you have $1 like James did as a kid, or $86 million , like the NBA star has now, put at least a small portion into a savings or investment account.\nThe key to doing so is to make it automatic : Have a percentage of your income automatically taken out of your paycheck and sent straight to your savings. That way you'll never even see the money and learn to live without it.\nAnd when your earnings increase, don't boost your spending — instead, up your savings rate.\nToday, despite having earned millions over his NBA career, James still plays it safe with his money . He turns off data roaming on his phone to avoid the extra charges, refuses to buy mobile apps and uses the free version of Pandora with commercials.\nThat's not to say he never treats himself. James splurges on something that matters to him: his car collection. As he told Carter, \"That's the one thing that I love, I love cars.\"\nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: LeBron James may be the cheapest player in the NBA—but he still has one big money regret \n\nVideo by Luqman Adeniyi \nshow chapters LeBron James admits to being the cheapest player in the NBA      10:36 AM ET Tue, 17 Oct 2017 | 00:57", "external_links": [], "published": "2018-01-29T16:58:00.000+02:00", "crawled": "2018-01-29T16:58:28.007+02:00", "highlightTitle": ""}