{"organizations": [], "uuid": "7026c2899124ba3ae09777cac0240385f2f2495f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226670314&w=1200&r=LYNXMPEE0T1B9", "site_section": "http://feeds.reuters.com/Reuters/PoliticsNews", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-congress-pruitt/epa-chief-in-2016-called-trump-a-threat-to-u-s-constitution-idUSKBN1FJ2HV", "country": "US", "domain_rank": 408, "title": "EPA chief in 2016 called Trump a threat to U.S. Constitution", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T19:45:00.000+02:00", "replies_count": 0, "uuid": "7026c2899124ba3ae09777cac0240385f2f2495f"}, "author": "", "url": "https://www.reuters.com/article/us-usa-congress-pruitt/epa-chief-in-2016-called-trump-a-threat-to-u-s-constitution-idUSKBN1FJ2HV", "ord_in_thread": 0, "title": "EPA chief in 2016 called Trump a threat to U.S. Constitution", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}, {"name": "scott pruitt", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "pruitt", "sentiment": "none"}, {"name": "jeb bush", "sentiment": "none"}, {"name": "valerie volcovici", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "oklahoma", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "epa", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "pat campbell show", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "environmental protection agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - Scott Pruitt, the head of the Environmental Protection Agency, on Tuesday sought to distance himself from comments he made in a 2016 radio interview in which said Donald Trump would pose a threat to the U.S. Constitution if he ever became president.\nThe recording of the interview was released on Tuesday by the liberal group Documented, which tracks corporate influence in politics, just as Pruitt appeared before his first Senate hearing since becoming confirmed last year as the top U.S. environmental official.\n“I believe that Donald Trump in the White House will be more abusive to the Constitution (than then-President Barack Obama), and that’s saying a lot,” Pruitt said in February 2016 during his appearance on the Pat Campbell Show in Oklahoma.\nPruitt, then Oklahoma’s attorney general, at the time was supporting Jeb Bush, the former Florida governor who was among those vying with Trump for the Republican presidential nomination.\nPruitt went on to say in the interview that if Trump were elected, the businessman-turned-politician would take “unapologetic steps to use executive power to confront Congress in a way that is truly unconstitutional.”\nDuring the Senate Environment and Public Works Committee hearing, Democratic Senator Sheldon Whitehouse asked Pruitt if he recalled the interview. Pruitt said he did not.\nRegarding the content of his 2016 remarks, Pruitt said at the hearing he does not “echo that today at all.”\nFILE PHOTO: U.S. President Donald Trump listens to EPA Administrator Scott Pruitt after announcing his decision that the United States will withdraw from the Paris Climate Agreement, in the Rose Garden of the White House in Washington, U.S., June 1, 2017. REUTERS/Kevin Lamarque/File Photo In a e-mailed statement issued after the hearing, Pruitt said after getting to know the president, “Trump is the most consequential leader of our time. No one has done more to advance to rule of law than President Trump.”\nPruitt has provoked controversy as Trump’s EPA chief, praised by conservatives and criticized by liberals for rolling back environmental regulations put in place under Democrat Obama and for his role in Trump’s decision to abandon the 2015 Paris global climate change accord.\nHe is one of several Trump appointees who were critical of the president when he was a candidate. For example, Energy Secretary Rick Perry in 2015 said Trump was a “cancer on conservatism” and would ruin the Republican Party.\nAt Tuesday’s hearing, Democrats also pressed Pruitt on his EPA agenda of rolling back environmental regulations, and asked him for details on how he would carry out two of his stated priorities: combating lead in drinking water and cleaning up so-called Superfund industrial pollution sites.\nDemocratic Senator Tammy Duckworth questioned Pruitt’s commitment to prioritizing a “war on lead” in drinking water by asking him if he will fight against proposed White House budget cuts to the EPA’s lead risk-reduction program.\nPruitt said he would work with Congress to make progress on the issue.\nRepublicans at the hearing praised Pruitt for cutting back what they called regulatory red tape that was choking rural communities.\n“He has balanced the need to prioritize environmental protection with the desires of Americans to have thriving and economically sustainable communities,” said Senator John Barrasso, the committee’s Republican chairman.\nReporting by Valerie Volcovici; Editing by Will Dunham\n ", "external_links": [], "published": "2018-01-30T19:45:00.000+02:00", "crawled": "2018-01-30T20:16:38.011+02:00", "highlightTitle": ""}