{"organizations": [], "uuid": "e7f502e2287a76803897e8eaa1df2da1f08c5b4d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180101&t=2&i=1218512583&w=1200&r=LYNXMPEE000LU", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-cricket-test-zaf-ind-steyn/cricket-steyn-waits-to-see-if-he-will-get-chance-to-break-test-record-idUKKBN1EQ0O7", "country": "US", "domain_rank": 408, "title": "Cricket - Steyn waits to see if he will get chance to break test record", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T04:46:00.000+02:00", "replies_count": 0, "uuid": "e7f502e2287a76803897e8eaa1df2da1f08c5b4d"}, "author": "", "url": "https://uk.reuters.com/article/uk-cricket-test-zaf-ind-steyn/cricket-steyn-waits-to-see-if-he-will-get-chance-to-break-test-record-idUKKBN1EQ0O7", "ord_in_thread": 0, "title": "Cricket - Steyn waits to see if he will get chance to break test record", "locations": [], "entities": {"persons": [{"name": "steyn", "sentiment": "negative"}, {"name": "shaun pollock", "sentiment": "none"}, {"name": "mark gleeson", "sentiment": "none"}, {"name": "dale steyn", "sentiment": "none"}, {"name": "ross taylor", "sentiment": "none"}], "locations": [{"name": "new zealand", "sentiment": "none"}, {"name": "centurion", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "centurion park", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 1, 2018 / 2:47 AM / Updated 7 hours ago Cricket - Steyn waits to see if he will get chance to break test record Mark Gleeson 3 Min Read \nCAPE TOWN (Reuters) - Dale Steyn has been close to the milestone for more than a year now but, at the age of 34, time is running out for the speed merchant to become South Africa’s most prolific wicket taker. Cricket - New Zealand v South Africa - second cricket test match - Centurion Park, Centurion, South Africa - 30/8/2016. South Africa's Dale Steyn celebrates the dismissal of New Zealand's Ross Taylor. REUTERS/Siphiwe Sibeko Picture Supplied by Action Images \nSteyn’s 417 test-wicket haul is just four shy of the South African record held by Shaun Pollock but the target remains both tantalisingly close and frustratingly elusive at the same time. \nStanding between him and the tag of the country’s best ever bowler have been a serious shoulder injury and a lengthy spell on the sidelines. \nAfter his latest piece of rotten luck, some doubt that Steyn will get his long-awaited opportunity when South Africa take on India in a three-test series starting at Newlands on Friday. \nIt has been 14 months since Steyn’s last test and the rustiness of the lay-off, plus the absence of a decent examination of his shoulder in match conditions, could see him left out, local media suggested. \n“There is significant, ill-advised risk associated with any fast-track return,” wrote local cricket columnist Rob Houwing this week (www.sport24.co.za) after the pace bowler missed out on the Boxing Day test against Zimbabwe. \nSteyn’s shoulder travails began against England in Durban in December 2015 but it was just under a year later in Perth in November 2016 that extensive damage was done as he broke the right shoulder and tore three major muscles on the second day of the first test against Australia. \nHe went home to Cape Town for surgery, followed by lengthy rehabilitation and abortive comebacks before he was gently eased back into Twenty20 action in November and then 12 wicketless overs in whites just before Christmas. \nSteyn was due to return in the one-off test against Zimbabwe in Port Elizabeth last week but on the opening morning of the day-night match was unluckily ruled out by a bout of influenza. \nIn his absence, South Africa’s four-man seam attack easily bowled out Zimbabwe twice and, although India are an altogether different proposition, there is a temptation for the selectors to stick with them. \nSteyn, whose test average is a staggering 22.3, can, however, point to a prolific record at Newlands with 65 wickets in 13 tests at an average of 21.93 –- 12 against India. \nHe -- and legions of supporters enthralled by his passionate approach to the game -- wait to see whether he will get to bowl this time. Editing by Clare Fallon", "external_links": [], "published": "2018-01-01T04:46:00.000+02:00", "crawled": "2018-01-01T08:15:38.009+02:00", "highlightTitle": ""}