{"organizations": [], "uuid": "ff0cd59450e1f7f1ec5c9431cb05d2b9b0cc6ccc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-summit-companies-acquires-alliance-fire-protection-establishing-a-presence-in-arizona.html", "country": "US", "domain_rank": 767, "title": "Summit Companies Acquires Alliance Fire Protection, Establishing a Presence in Arizona", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-19T15:00:00.000+02:00", "replies_count": 0, "uuid": "ff0cd59450e1f7f1ec5c9431cb05d2b9b0cc6ccc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-summit-companies-acquires-alliance-fire-protection-establishing-a-presence-in-arizona.html", "ord_in_thread": 0, "title": "Summit Companies Acquires Alliance Fire Protection, Establishing a Presence in Arizona", "locations": [], "entities": {"persons": [], "locations": [{"name": "arizona st. paul", "sentiment": "none"}, {"name": "minn.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "tempe", "sentiment": "none"}], "organizations": [{"name": "summit companies acquires alliance fire protection", "sentiment": "negative"}, {"name": "alliance fire protection special systems, inc.", "sentiment": "none"}, {"name": "ci capital partners", "sentiment": "none"}, {"name": "ci capital", "sentiment": "none"}, {"name": "arizona-based alliance fire protection co.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ST. PAUL, Minn., Jan. 19, 2018 /PRNewswire/ -- Summit Companies (\"Summit\"), a leading fire and life safety service and installation company, announced today that it has completed the acquisition of Arizona-based Alliance Fire Protection Co. and Alliance Fire Protection Special Systems, Inc. (\"Alliance\"), establishing a new region for the company in Arizona. Summit Companies is owned by management and CI Capital Partners. Terms of the transaction were not disclosed.\nAlliance designs, engineers and installs commercial, industrial and multi-family residential fire protection systems for new construction projects and renovations, and provides ongoing maintenance and inspection services of these systems. Alliance was founded in 1981 and is based in Tempe, Arizona. Alliance is the sixth add-on acquisition completed since CI Capital invested in the company in September 2017 and Summit Companies' first add-on acquisition outside of its core Midwestern geography. Summit Companies is pursuing additional add-on acquisitions in other regions of the United States.\n\"We are focused on building a national business to better serve our customers, and our acquisition strategy is essential in achieving that goal,\" stated Summit CEO, Jeff Evrard. \"Alliance has an excellent reputation in the Arizona market, making this acquisition an ideal first step to increasing our presence in the Southwestern United States. We welcome the entire Alliance team to the Summit family and are excited to grow the Arizona region through organic growth and future acquisitions.\"\n\"Over our 35 year history, Alliance has built a legacy of high quality work and reliability while providing a critical service to our customers,\" said Lyle \"Jag\" Amdahl, President of Alliance. \"We are thrilled to form this partnership and move to the next chapter in our company's evolution.\"\n\"Through five add-on acquisitions in Summit's core Midwestern market and the establishment of a new region with the acquisition of Alliance, Jeff and the rest of Summit's management team have made tremendous progress accelerating their acquisition strategy in a short amount of time,\" said Timothy Hall, Managing Director, CI Capital Partners. \"We look forward to continuing to support their efforts.\"\nAbout Summit Companies\nFounded in 1999, Summit provides complete fire and life safety services designed to protect buildings, assets and people. The company has expertise across the entire spectrum of fire and life safety categories including both wet and dry suppression, clean agent suppression, alarm and security monitoring, fire extinguishers, kitchen hoods and special hazard systems. Summit has the experience and capabilities to handle projects from a small tenant remodel to a large industrial facility. The company services 35,000+ commercial, industrial, government, healthcare and multi-family residential facilities annually. Learn more at www.SummitCoUS.com .\nAbout Alliance Fire Protection\nAlliance Fire Protection began operations as a fire sprinkler company, and quickly earned a reputation for high quality workmanship. Through the years the company has expanded into all aspects of commercial and industrial fire protection, but the drive for quality still lives in all aspects of operations. Today, Alliance is truly a full service fire protection company. We are proud to offer the following: design and engineering, sprinkler fabrication, installation, service and inspections, off-site monitoring, and training programs. Learn more at www.afpc.com .\nAbout CI Capital Partners\nCI Capital Partners LLC, a leading North American private equity investment firm with approximately $2.4 billion in assets under management, has been investing in middle-market companies since 1993. CI Capital forms partnerships with experienced management teams and entrepreneurs to build substantial businesses through add-on acquisitions, organic growth and operational improvements. Since inception, CI Capital and its portfolio companies have made over 260 acquisitions representing over $9 billion in enterprise value.\nMedia Contact:\nDaniel Yunger\nKEKST&Co.\n212.521.4800\nView original content: http://www.prnewswire.com/news-releases/summit-companies-acquires-alliance-fire-protection-establishing-a-presence-in-arizona-300585175.html\nSOURCE Summit Companies", "external_links": ["http://www.summitcous.com/", "http://www.prnewswire.com/news-releases/summit-companies-acquires-alliance-fire-protection-establishing-a-presence-in-arizona-300585175.html", "http://www.afpc.com/"], "published": "2018-01-19T15:00:00.000+02:00", "crawled": "2018-01-19T16:02:31.006+02:00", "highlightTitle": ""}