{"organizations": [], "uuid": "e74af16b9ed315968a28960e98206cf0e4de117b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221472714&w=1200&r=LYNXMPEE0B13N", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-olympics-2018-figs-scandal/years-after-salt-lake-city-scandal-french-judge-finds-peace-idUSKBN1F11L8", "country": "US", "domain_rank": 408, "title": "Years after Salt Lake City scandal, French judge finds peace", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.146, "site_type": "news", "published": "2018-01-12T21:21:00.000+02:00", "replies_count": 0, "uuid": "e74af16b9ed315968a28960e98206cf0e4de117b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-olympics-2018-figs-scandal/years-after-salt-lake-city-scandal-french-judge-finds-peace-idUSKBN1F11L8", "ord_in_thread": 0, "title": "Years after Salt Lake City scandal, French judge finds peace", "locations": [], "entities": {"persons": [{"name": "le gougne", "sentiment": "negative"}, {"name": "yelena berezhnaya", "sentiment": "none"}, {"name": "anton sikharulidze", "sentiment": "none"}, {"name": "david pelletier", "sentiment": "none"}, {"name": "jamie sale", "sentiment": "none"}], "locations": [{"name": "salt lake city", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "strasbourg", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "le gougne", "sentiment": "none"}, {"name": "la source au lotus", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOSCOW (Reuters) - Former French figure skating judge Marie-Reine Le Gougne, who was at the epicenter of the 2002 Salt Lake City Games scandal that redefined the sport, has since traded the limelight for the tranquillity of a wellbeing center.\nFar from the clamor and glamor of international figure skating and next month’s Pyeongchang Olympics, Le Gougne has found serenity at the relaxation center she runs in the historic quarter of her native Strasbourg.\n“My life was devastated,” Le Gougne, who opened La Source au Lotus in 2012, told Reuters in an interview.\n“I simply didn’t want to live anymore.”\nLe Gougne allegedly succumbed to pressure from her federation to award a gold medal score to Russian pair Yelena Berezhnaya and Anton Sikharulidze, leaving Canadians Jamie Sale and David Pelletier with the silver.\nThe scandal, purportedly part of a vote-trading scheme within the ice dancing events, ushered in sweeping reforms in judging that endure to this day.\nA revised system based on points that rewards skaters for executing difficult elements was introduced to replace the more dramatic 6.0 scale, aimed to better represent performances and safeguard against the manipulation of scores.\nLe Gougne, who insists she had called for reforms to the judging system at the time, said she was made a scapegoat for a result that displeased the figure skating establishment.\n“The ideal culprit was ‘la French judge’,” said Le Gougne, adding that the subsequent changes to the judging system “were done completely at my expense”.\nLe Gougne said the 6.0 system inherently put judges “under terrible pressure”.\n“When the world’s best skaters are doing quadruple jumps, how can you represent that with only one little mark -- 5.9, 5.8, 5.8, 5.9 -- and a second little artistic mark?” she said.\n“When it was close we were pulling our hair out trying to rank skaters with only little two marks.”\nDays after the competition, Sale and Pelletier were awarded a duplicate gold medal to share with the Russian pair.\nWORST-CASE SCENARIO The International Skating Union (ISU) suspended Le Gougne for three years and barred her from the 2006 Turin Olympics. She has not judged a competition since.\n“I have been absolutely incapable of watching a competition on television since February 11, 2002,” Le Gougne said, referring to the date of the pairs free skate at Salt Lake City.\n“And that’s just on TV. You can imagine that watching live is impossible.”\nWhen Le Gougne recalls the 2002 Games, her sharp voice cracks.\n“I knew the nine countries and the nine judges,” she said.\n“I knew very well who would vote in favor of the Russians and who would vote in favor of the Canadians. I was almost certain that I was the one who would award the Olympic title. What I feared would happen really did.”\nLe Gougne said judges at the time were regularly courted by interest groups including the “pro-Canadians, pro-Russians and even the pro-Chinese”.\nWhen asked if she had been pressured by Didier Gailhaguet, president of the French Federation of Ice Sports, who was also suspended over the scandal, Le Gougne said: “Gailhaguet came to see me. I told him, ‘Piss off, I don’t want to know. Leave me alone. Let me judge my competition.'”\nGailhaguet, who holds the same position, did not respond to a request for comment.\nLe Gougne remains unrepentant. She maintains that if the competition had taken place today, she would still put the Russian pair in first.\n“The technical density, the complexity of the Russians’ performance, was much superior to that of the Canadians,” she said. “The Canadians’ performance was of course magnificent, but it was easier to carry out.”\nInterviewed individually by Reuters, Sale and Pelletier dismissed Le Gougne’s claims.\n“For her to tell you today that she would still do the same thing, I call complete BS,” Sale said. “That’s actually comical... That makes her so not credible. It’s a joke.”\nThe judging scandal deprived the pair of their moment of podium glory, leaving an indelible mark on them.\n”I don’t feel like a victim and I don’t complain,“ Pelletier said. ”But we were robbed of a moment that is part of the Olympic experience.\n“If you receive a medal a year, six months or five days later, the emotion is gone. It’s emotional, of course, but it’s not the same.”\nReporting by Gabrielle Tétrault-Farber; Editing by John O'Brien\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T21:21:00.000+02:00", "crawled": "2018-01-13T14:35:23.023+02:00", "highlightTitle": ""}