{"organizations": [], "uuid": "2640135b9e24c93ff4d00e371620e754e63554ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226841421&w=1200&r=LYNXMPEE0U08Y", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-siemens-results/siemens-first-quarter-profit-dips-on-power-and-gas-business-declines-idUSKBN1FK0JM", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Siemens Q1 profit dips on Power and Gas business declines", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T08:21:00.000+02:00", "replies_count": 0, "uuid": "2640135b9e24c93ff4d00e371620e754e63554ff"}, "author": "", "url": "https://www.reuters.com/article/us-siemens-results/siemens-first-quarter-profit-dips-on-power-and-gas-business-declines-idUSKBN1FK0JM", "ord_in_thread": 0, "title": "UPDATE 1-Siemens Q1 profit dips on Power and Gas business declines", "locations": [], "entities": {"persons": [{"name": "joe kaeser", "sentiment": "none"}], "locations": [{"name": "munich", "sentiment": "none"}], "organizations": [{"name": "siemens", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MUNICH (Reuters) - German engineering group Siemens posted a 14 percent decline in quarterly industrial profit, dragged down by continued weak demand from the power and gas sector while it ramps up investments in factory software.\nIndustrial profit at the trains-to-turbines group came to 2.21 billion euros ($2.75 billion) in the fiscal first quarter to end-December, taking a hit from a near halving of profits at the Power and Gas division.\nThat compares with a consensus for 2.19 billion euros in a Reuters poll of analysts.\nLarge gas turbines are increasingly unloved in a world moving to renewable energy and Siemens has turned more of its focus to industrial automation, where it is market leader.\n“The declining market for fossil power generation is not a temporary slump. Instead it reveals the expected dramatic development that we’ll only be able to address and we must address by taking strategic measures,” Chief Executive Joe Kaeser said as the group published results on Wednesday.\nThe profit margin from industrial business shrank to 11 percent from 13.2 percent in the year-earlier period.\nThe group is in talks with labor representatives about where to cut 6,900 positions as part of a restructuring program announced last year.\nSiemens expects to book reserves for severances in fiscal 2018, and for cost reductions to filter through in fiscal 2019, CEO Kaeser told analysts. Negotiations for job cuts in Germany will likely be completed by summer, Kaeser said.\nSLIMMING DOWN\nSiemens CEO Joe Kaeser attends a news conference ahead of the company's annual shareholders meeting in Munich, Germany, January 31, 2018. REUTERS/Michael Dalder Arch-rival General Electric, which is struggling to reverse steep declines in some of its units and is looking to sell $20 billion of assets, reported an industrial margin of 11.2 percent for the December quarter.\nBoth conglomerates are slimming down - U.S. based GE faster than Siemens. In the last year the German group has hived off its wind-power unit into a joint venture and agreed to do the same with its trains and signaling unit.\nIt also plans to list its medical imaging and diagnostics division on the stock exchange in the first half of this year, though analysts at Barclays noted on Wednesday that its growth has underperformed that of peers.\nThe reorganization has made investors more optimistic, pushing up Siemens shares by more than 5 percent so far this year, outperforming a 1.4 percent gain by the STOXX 50 index.\nThe stock rose 1 percent to 122.42 euros by 0928 GMT on Wednesday.\nSiemens’s quarterly group sales rose 3 percent to 19.82 billion euros, broadly in line with consensus, while new orders jumped 14 percent to 22.48 billion euros, compared with the average analyst forecast for 20.81 billion euros.\nSeparately, Siemens said U.S. tax reforms resulting in a lowering of the corporate tax rate led to a net positive effect of 437 million euros in the fiscal first quarter.\nKaeser defended his move to compliment U.S. President Donald Trump on his reforms during a dinner held at the World Economic Forum in Davos.\n“You need to recognize when something has been achieved,” Kaeser said, adding that his charm offensive was also in the interests of 65,000 Siemens staff in the United States.\nAs a result of the tax reforms, Siemens said it assumes a tax rate at the lower end of the forecast range of 27 to 33 percent for fiscal 2018.\nReporting by Georgina Prodhan and Edward Taylor; Editing by Maria Sheahan and Elaine Hardcastle\n ", "external_links": [], "published": "2018-01-31T08:21:00.000+02:00", "crawled": "2018-01-31T08:31:46.066+02:00", "highlightTitle": ""}