{"organizations": [], "uuid": "0d8288f544063be6ce15a2d45b67f0709d2f2314", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226813819&w=1200&r=LYNXMPEE0U06O", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-trump-breakingviews/breakingviews-trump-policy-agenda-starts-to-stick-to-the-script-idUSKBN1FK0EL", "country": "US", "domain_rank": 408, "title": "Breakingviews - Trump policy agenda starts to stick to the script", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T12:20:00.000+02:00", "replies_count": 0, "uuid": "0d8288f544063be6ce15a2d45b67f0709d2f2314"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-trump-breakingviews/breakingviews-trump-policy-agenda-starts-to-stick-to-the-script-idUSKBN1FK0EL", "ord_in_thread": 0, "title": "Breakingviews - Trump policy agenda starts to stick to the script", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "accusa", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "reuters breakingviews", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters Breakingviews) - Donald Trump’s policy agenda is starting to stick to the script, even if the U.S. president himself doesn’t always. Trump’s first State of the Union address on Tuesday touched on immigration and infrastructure, but the speech contained few surprises and avoided some divisive pet topics. A consistent policy platform is emerging from the noise.\nThe president called on Congress to pass a bill that generates $1.5 trillion for infrastructure upgrades, in addition to simplified procedures for project approvals. He also pressed the administration’s case for changes to the immigration system, including beefed-up border security measures and a path to citizenship for 1.8 million individuals brought into the United States illegally.\nThe president included an assortment of other policy proposals, such as more defense spending, efforts to tackle the opioid epidemic and job training. He also reiterated the administration’s pledge to seek fair and reciprocal trade deals with other nations, a nod to ongoing trade investigations and treaty re-negotiations. Accusations of media bias, a meme in Trump’s rhetoric, were absent.\nIn sum, few surprises. That in itself is remarkable. Last year, investors and pundits were grasping for clues as to what the administration might do. The president himself whipsawed from an inauguration address on “American carnage” to, weeks later, a more even-keeled speech to a joint session of Congress.\nToday, the broad outlines of Trump’s legislative and regulatory agenda are reasonably clear. Of course, there are still unknowns. Tariffs on washing machines and solar panels could be only the beginning of tough actions against trade partners, for instance. But in most areas, a combination of self-imposed moderation and institutional constraint have prevailed. Last year’s tax cuts have prodded companies like Apple and Walmart into politically helpful pledges over investment and wage hikes.\nThere’s still scope for disruptive, ad hoc policy proclamations. But as it stands, investors would be entitled to feel Trump’s agenda has at least become more predictable.\nBreakingviews Reuters Breakingviews is the world's leading source of agenda-setting financial insight. As the Reuters brand for financial commentary, we dissect the big business and economic stories as they break around the world every day. A global team of about 30 correspondents in New York, London, Hong Kong and other major cities provides expert analysis in real time.\nSign up for a free trial of our full service at https://www.breakingviews.com/trial and follow us on Twitter @Breakingviews and at www.breakingviews.com . All opinions expressed are those of the authors.", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-31T12:20:00.000+02:00", "crawled": "2018-01-31T16:07:56.000+02:00", "highlightTitle": ""}