{"organizations": [], "uuid": "7eb7240ed48b9c381738ba11614c3ef19c31cff2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 9}, "facebook": {"likes": 22, "shares": 22, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222878409&w=1200&r=LYNXMPEE0H01G", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-autoshow-detroit-gm-china/big-portion-of-future-gm-electric-vehicles-for-china-market-executive-idUSKBN1F702M", "country": "US", "domain_rank": 408, "title": "Big portion of future GM electric vehicles for China market: executive", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T02:43:00.000+02:00", "replies_count": 0, "uuid": "7eb7240ed48b9c381738ba11614c3ef19c31cff2"}, "author": "", "url": "https://www.reuters.com/article/us-autoshow-detroit-gm-china/big-portion-of-future-gm-electric-vehicles-for-china-market-executive-idUSKBN1F702M", "ord_in_thread": 0, "title": "Big portion of future GM electric vehicles for China market: executive", "locations": [], "entities": {"persons": [{"name": "paul lienert", "sentiment": "none"}, {"name": "nick carey", "sentiment": "none"}, {"name": "de nysschen", "sentiment": "none"}, {"name": "mary barra", "sentiment": "none"}, {"name": "tsien", "sentiment": "none"}, {"name": "matt tsien", "sentiment": "none"}, {"name": "johan de nysschen", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "gm", "sentiment": "negative"}, {"name": "gm china", "sentiment": "none"}, {"name": "general motors", "sentiment": "none"}, {"name": "min read  detroit", "sentiment": "none"}, {"name": "general motors co", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "cadillac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT (Reuters) - General Motors Co’s China unit will sell a “substantial portion” of the automaker’s future electric vehicles, GM China President Matt Tsien said on Wednesday.\nIn a briefing at GM headquarters, Tsien said, “China is at the heart of our electrification strategy.”\nTsien did not say which GM brands would sell electric vehicles in China.\nBut Cadillac President Johan de Nysschen told Reuters at the Detroit auto show the luxury brand “will play a central role” in GM’s electrification strategy, including China.\nCadillac will be “the technology spearhead for General Motors,” de Nysschen said, adding the brand will be “at the forefront” of rolling out new electric vehicles in the United States and China.\nThe broader electrification strategy, detailed in mid-November by Chief Executive Mary Barra, includes the introduction in 2021 of a new dedicated electric vehicle architecture and an advanced battery system, which will support the development of at least 20 new models in the United States and China.\nThe automaker has promised investors it will produce profitable electric vehicles by 2021 and that the 20 new battery electric and fuel cell vehicles will join its global lineup by 2023.\nBarra said GM aims to sell 1 million pure electric vehicles worldwide by 2026.\nCadillac’s de Nysschen said the new electric vehicle architecture “will feature prominently” in U.S. and Chinese plans.\nGM has a long way to go to reach Barra’s lofty target.\nLast year, GM China and local partners sold 4 million vehicles - about 40 percent of the automaker’s global tally - but only 11,000 were pure electric vehicles, sold under GM’s local Baojun brand.\nThe automaker sold about 50,000 pure electric vehicles worldwide in 2017, most of them the Chevrolet Bolt EV, or roughly 0.5 percent of its global sales.\nTsien said plug-in electric vehicles, including hybrids, are expected to account for about 20 percent of the industry’s projected 35 million vehicle sales in China in 2025.\nNext year, a new Chinese quota system will require that 8 percent of an automaker’s sales be plug-in electrics.\nTsien said GM expected to meet that quota, which would require selling more than 300,000 battery electrics and plug-in hybrids in 2019 or purchasing offsetting credits from other manufacturers.\nThe automaker’s new electric vehicle will support models for “multiple brands in multiple segments,” Tsien said, and the flexible battery system will enable GM to offer a variety of driving ranges in those models.\nAdditional reporting by Norihiko Shirouzu in Detroit; Editing by Matthew Lewis\n ", "external_links": [], "published": "2018-01-18T02:43:00.000+02:00", "crawled": "2018-01-18T02:56:32.000+02:00", "highlightTitle": ""}