{"organizations": [], "uuid": "bab1507f9ad32eec48c630b08ad1220d497c00e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-myanmar-journalists-factbox/factbox-latest-international-reaction-to-arrest-of-reuters-reporters-in-myanmar-idUSKBN1EZ11K", "country": "US", "domain_rank": 408, "title": "Factbox: Latest international reaction to arrest of Reuters reporters in Myanmar", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T18:44:00.000+02:00", "replies_count": 0, "uuid": "bab1507f9ad32eec48c630b08ad1220d497c00e2"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-myanmar-journalists-factbox/factbox-latest-international-reaction-to-arrest-of-reuters-reporters-in-myanmar-idUSKBN1EZ11K", "ord_in_thread": 0, "title": "Factbox: Latest international reaction to arrest of Reuters reporters in Myanmar", "locations": [], "entities": {"persons": [{"name": "kyaw soe oo", "sentiment": "none"}, {"name": "zaw htay", "sentiment": "none"}], "locations": [{"name": "myanmar", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "rakhine", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}, {"name": "ministry of information", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - The Myanmar government sought on Wednesday to charge two arrested Reuters journalists under its Official Secrets Act, which carries a maximum sentence of 14 years, according to their lawyer.\nMany nations, including the United States, Canada and several European countries, as well as top United Nations and EU officials have demanded the release of the reporters - Wa Lone, 31, and Kyaw Soe Oo, 27.\nThey were arrested on Dec. 12 after they had been invited to meet police officers over dinner. Family members have said the two told them they were arrested almost immediately after being handed some documents by the officers they had gone to meet.\nThe two had worked on Reuters coverage of a crisis in the western state of Rakhine, where - according to U.N. estimates - about 655,000 Rohingya Muslims have fled from a fierce military crackdown on militants.\nMyanmar’s Ministry of Information has said the reporters “illegally acquired information with the intention to share it with foreign media”.\nGovernment spokesman Zaw Htay declined to comment on the charges but said the two had their rights under an independent judicial system.\n“The judge will be decide whether they are guilty or not according to the law,” he told Reuters.\nReuters President and Editor-In-Chief Stephen J. Adler said he was extremely disappointed that the authorities were seeking to prosecute the pair.\n“We view this as a wholly unwarranted, blatant attack on press freedom,” he said in a statement on Wednesday. “Our colleagues should be allowed to return to their jobs reporting on events in Myanmar. We believe time is of the essence and we continue to call for Wa Lone and Kyaw Soe Oo’s prompt release.”\nHere are the latest comments on their detention from governments, politicians, human rights groups, journalists and press freedom advocates around the world:\n-- The U.S. embassy in Myanmar said in a statement it was “very disappointed” by the decision to pursue charges against the two.\n“For democracy to succeed and flourish, journalists must be able to do their jobs. We call for their immediate release,” the embassy said.\n-- France expressed its concern after Wednesday’s court appearance.\n“We call for the respect of their fundamental rights, their immediate release by the Burmese authorities and the free access of the media to (Rakhine State),” the French foreign ministry said in a statement.\n-- Representatives of the European Union delegation in Myanmar and several EU member states attended the court hearing and the EU said it continued to expect the Myanmar authorities to ensure the full protection of the journalists’ rights.\n“The EU considers this case an important test for Myanmar’s commitment to press freedom, an independent judiciary and the development of democratic institutions. A free press that can work without intimidation and fear of undue arrest and prosecution is a fundamental element of any democratic society,” the EU delegation in Myanmar said.\n-- Denmark’s embassy in Myanmar called on Wednesday for the immediate release of Wa Lone and Kyaw Soe Oo.\n“It is indeed very disappointing that an old draconian law from the colonial era is being used by a democratically elected government to suppress press freedom,” it said in a statement.\n-- Japan said it was concerned about the issue and that it could be raised when Foreign Minister Taro Kano visits Myanmar this week.\n“The Japanese government has conveyed its concern about this matter to the government of Myanmar and going forward, wants to discuss and make appeals at appropriate opportunities, including Foreign Minister Kono’s visit to Myanmar,” Chief Cabinet Secretary Yoshihide Suga said on Wednesday.\n-- Amnesty International demanded the immediate release of the two journalists, saying they had been arbitrarily detained.\n“They have done absolutely nothing but carry out their legitimate work as journalists,” said James Gomez, Amnesty International’s Director for Southeast Asia and the Pacific, in a statement on Wednesday.\n“This is clearly an attempt by the authorities to silence investigations into military violations and crimes against Rohingya in Rakhine State, and to scare other journalists away from doing the same.”\n-- Phil Robertson, deputy Asia director for New York-based Human Rights Watch, said the case was a “throwback to the rights abusing practices” of the military.\n“If Aung San Suu Kyi and her government really cared about democratic reforms and governance, they could use their parliamentary majority to quickly reform this antiquated colonial law and bring it into compliance with international human rights standards,” he in an e-mail to Reuters on Wednesday.\n-- Former U.S. President Bill Clinton called on Monday for the immediate release of the two journalists. “A free press is critical to a free society - the detention of journalists anywhere is unacceptable,” Clinton said in a Twitter post.\n-- The Committee to Protect Journalists has said Myanmar should cease all legal proceedings against the two Reuters journalists and release them from jail.\n“The proceedings against Wa Lone and Kyaw Soe Oo are a transparent attempt to intimidate the media and to prevent coverage of the unfolding tragedy of the Rohingya people in Myanmar’s Rakhine state,” said Steven Butler, CPJ’s Asia program coordinator in a statement on Monday.\n“The two reporters should not be in jail for trying to uncover the truth about this story of vital public interest.”\n-- Samantha Power, former U.S. ambassador to the United Nations, called the arrests “an outrage and a symptom of a world without credible U.S. leadership” in a Twitter post.\nCompiled by Raju Gopalakrishnan; Edited by Martin Howell and Alex Richardson\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T18:44:00.000+02:00", "crawled": "2018-01-10T15:53:09.017+02:00", "highlightTitle": ""}