{"organizations": [], "uuid": "97e274321b24a08fd874e06e60d4d70bf8ac704a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-grossman-marketing-group-acquires-new-york-promotional-products-distributor.html", "country": "US", "domain_rank": 767, "title": "Grossman Marketing Group Acquires New York Promotional Products Distributor", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.055, "site_type": "news", "published": "2018-01-17T20:23:00.000+02:00", "replies_count": 0, "uuid": "97e274321b24a08fd874e06e60d4d70bf8ac704a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-grossman-marketing-group-acquires-new-york-promotional-products-distributor.html", "ord_in_thread": 0, "title": "Grossman Marketing Group Acquires New York Promotional Products Distributor", "locations": [], "entities": {"persons": [{"name": "grossman", "sentiment": "none"}, {"name": "david grossman", "sentiment": "none"}, {"name": "ben grossman", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "somerville", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "norwalk", "sentiment": "none"}, {"name": "east hartford", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "grossman marketing group", "sentiment": "negative"}, {"name": "grossman marketing group acquires new york promotional products distributor", "sentiment": "negative"}, {"name": "boston celtics", "sentiment": "none"}, {"name": "logos in print", "sentiment": "none"}, {"name": "business wire", "sentiment": "none"}, {"name": "fleet business products", "sentiment": "none"}, {"name": "premier marketing group", "sentiment": "none"}, {"name": "boston bruins", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SOMERVILLE, Mass.--(BUSINESS WIRE)-- Grossman Marketing Group, a 108-year-old, fourth-generation, promotional products and print company, has acquired Logos in Print, a promotional products distributor headquartered in New York. The new acquisition is the fourth in the past four years, fueling Grossman’s full-service marketing operations and client base in the Northeast.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180117006151/en/\nGrossman Marketing Group co-presidents David Grossman (left) and Ben Grossman announced their acquisition of Logos in Print, a New York distributor. It marks Grossman's fourth acquisition in the past 4 years. (Photo: Business Wire)\nThe acquisition of Logos in Print comes on the heels of three other recent acquisitions: ASAP, a Norwalk, CT promotional products firm; Fleet Business Products of East Hartford, CT; and Premier Marketing Group of Manchester, ME.\nGrossman Marketing Group boasts a “who’s who” client list, including major sports teams (Boston Celtics and Boston Bruins), hospitals and health care entities (Massachusetts General Hospital, Brigham & Women’s Hospital, athenahealth, Novocure) and businesses (Hewlett-Packard, John Hancock, L.L. Bean, Zipcar), as well as The International Academy of Arts and Sciences.\nBen Grossman, co-president of Grossman Marketing Group, said the acquisition of Logos in Print enhances the company’s growing presence in health care and education, particularly in New York, New Jersey and Connecticut. Logos in Print has won many prestigious awards, including Promotional Products Association International’s Golden Pyramid Awards for creativity and excellence.\nSaid Grossman: “Logos in Print is a great fit for us and will complement our existing products and services, which include full-service graphic design, a network of company-owned warehouses and production facilities, multi-media solutions, and a dedicated technology team building best-in-class e-commerce programs for our clients.”\nAs a premier promotional products distributor, Logos in Print has working relationships with more than 3,000 suppliers, offering hundreds of thousands of promotional items -- from apparel, bags and drinkware to writing instruments, golf and fitness products, and high tech accessories.\nSince 1972, Cecile and Michael McBride, owners of Logos in Print, have been providing promotional products to major hospitals, universities and businesses in the New York Tri-State Area. The McBrides said they are thrilled their company has been acquired by such a well-respected company as Grossman Marketing Group.\nSaid Michael McBride: “Grossman shares our mission, which is to help businesses create long-lasting relationships with clients through the power of promotional products. These products, a $21 billion industry, leave a lasting impression on customers at a far better cost per impression than almost every major marketing vehicle.”\nFor information on Grossman Marketing Group’s unparalleled project management and top-notch creative and fulfillment capabilities, visit www.grossmanmarketing.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180117006151/en/\nGrossman Marketing Group:\nAlan Eisner\nalanseisner@hotmail.com\nSource: Grossman Marketing Group", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.grossmanmarketing.com&esheet=51744703&newsitemid=20180117006151&lan=en-US&anchor=www.grossmanmarketing.com&index=1&md5=4fea220637ff58d24bcb19566089a1bb", "http://www.businesswire.com/news/home/20180117006151/en/"], "published": "2018-01-17T20:23:00.000+02:00", "crawled": "2018-01-17T21:27:17.008+02:00", "highlightTitle": ""}