{"organizations": [], "uuid": "c7f76ba26f10e31ecd7ea3ceca1f1b24921439a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224833802&w=1200&r=LYNXMPEE0N1G9", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-cmed-m-a-auroracannabis/cannabis-producer-aurora-to-buy-cannimed-for-1-1-billion-canadian-dollars-idUSKBN1FD1T6", "country": "US", "domain_rank": 408, "title": "Canada's Aurora Cannabis buys CanniMed, creating world's biggest weed producer", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.123, "site_type": "news", "published": "2018-01-24T21:28:00.000+02:00", "replies_count": 0, "uuid": "c7f76ba26f10e31ecd7ea3ceca1f1b24921439a7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-cmed-m-a-auroracannabis/cannabis-producer-aurora-to-buy-cannimed-for-1-1-billion-canadian-dollars-idUSKBN1FD1T6", "ord_in_thread": 0, "title": "Canada's Aurora Cannabis buys CanniMed, creating world's biggest weed producer", "locations": [], "entities": {"persons": [{"name": "chris damas", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "aurora", "sentiment": "none"}], "organizations": [{"name": "aurora cannabis inc", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "aurora cannabis", "sentiment": "negative"}, {"name": "newstrike resources ltd", "sentiment": "none"}, {"name": "cannimed therapeutics inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 1:28 PM / in 5 minutes Canada's Aurora Cannabis to buy rival to create world's most valuable weed firm Nichola Saminather 4 Min Read \n(Reuters) - Canada’s No. 2 marijuana producer Aurora Cannabis Inc has agreed to buy smaller rival CanniMed Therapeutics Inc for C$1.1 billion ($852 million) as companies jostle to benefit from the country’s legalization of recreational marijuana use later this year. \nThe agreement to create the world’s top marijuana producer by market value follows months of tensions between the companies. Aurora had originally made a hostile bid capped at C$24 per share for CanniMed, and increased it to C$43 in the new offer. \nThe deal marked the world’s biggest marijuana industry transaction, bringing the value of cannabis deals so far this year to $1.2 billion, more than double 2017’s total, itself a record, according to Thomson Reuters data. \n(Factbox on top global marijuana deals:) \nThe activity has been largely concentrated in Canada, which is set to legalize recreational use of marijuana by mid-2018, becoming the second country in the world to do so after Uruguay. \nWith countries including Australia and Germany allowing medical marijuana and many others moving closer to doing so, Canada’s early move gives it an edge. While several U.S. states have legalized cannabis for medical or recreational use, the substance remains illegal at the federal level. \nBy buying CanniMed, Aurora hopes to bolster its capacity to meet domestic demand and increase distribution around the world. \n“The action is where the medical cannabis export markets are, which are much larger than Canada,” said Chris Damas, editor of the BCMI Cannabis Report. “CanniMed has patents, they have relationships with different universities, research and clinical trials, and export relations with other countries, and Aurora wants to add to their own relationships in Europe.” \n‘QUITE A JOURNEY’ \nCanadian cannabis stocks have been on a tear in anticipation of the surge in demand, but have prompted fears of a bubble and predictions for corrections from many market commentators. But so far the sector has continued on a relentless upward path. FILE PHOTO: A marijuana plant is seen at the The Global Marijuana March in Toronto, May 7, 2011. REUTERS/Mark Blinch/File Photo \nCanniMed rose 11.7 percent to close at C$41.90 after jumping as much as 23 percent. Aurora shares reversed earlier gains to end 5.5 percent lower at C$13.98. \nStill, Aurora shares are up 395 percent over the past three months, while CanniMed has risen 257 percent. \nCanniMed was itself engaged in a friendly deal to buy Newstrike Resources Ltd, but called it off on Wednesday. \nNewstrike shares tumbled 19.2 percent before it was halted as the company prepared to raise C$51.48 million to “fund strategic growth opportunities.” The stock fell 17 percent on Tuesday. \n“It’s been quite a journey, but the things we’re going to do together in 2018 and beyond will be amazing,” Aurora Chief Corporate Officer Cam Battley told Reuters. “Newstrike wasn’t really on our radar screen. Our interest was primarily in CanniMed.” \nThe deal would give the combined entity a market value of C$7.4 billion, overtaking current world leader Canopy Growth Corp’s C$6.7 billion. Canopy shares closed down 4.8 percent at C$34.87 in their third session of losses. \n“If I were Canopy, I’d be concerned,” Damas said. “The bigger Aurora gets, the more competition (Canopy is) going to face in both Canada and overseas.” \nStill, Canopy will retain its leading position, with capacity at existing and planned facilities exceeding those of both Aurora and CanniMed. \nThe new combined entity’s market value would also top some older and well-established Canadian companies, including Bombardier Inc, which is valued at about C$7.1 billion. \nAurora’s revised offer of 3.4 of its shares for each CanniMed security, equates to C$43.00, based on an implied share price for Aurora of C$12.65, a 15 percent premium to CanniMed’s closing price on Tuesday. \nThe deal requires shareholder and regulatory approvals. Aurora has received support from 36 percent of CanniMed shareholders, it said. Reporting by Nichola Saminather in Toronto and Anirban Paul in Bengaluru; Editing by Jeffrey Benkoe and Richard Chang", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T21:28:00.000+02:00", "crawled": "2018-01-24T21:19:43.054+02:00", "highlightTitle": ""}