{"organizations": [], "uuid": "825d732b7ee68de310607ccdded5ef84ea21cb6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/cnbc-interview-with-the-european-commission-vp-jyrki-katainen-from-the-world-economic-forum-2018.html", "country": "US", "domain_rank": 767, "title": "CNBC Interview with the European Commission VP Jyrki Katainen from the World Economic Forum 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-26T08:00:00.000+02:00", "replies_count": 0, "uuid": "825d732b7ee68de310607ccdded5ef84ea21cb6e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/cnbc-interview-with-the-european-commission-vp-jyrki-katainen-from-the-world-economic-forum-2018.html", "ord_in_thread": 0, "title": "CNBC Interview with the European Commission VP Jyrki Katainen from the World Economic Forum 2018", "locations": [], "entities": {"persons": [{"name": "jyrki katainen", "sentiment": "negative"}, {"name": "davos", "sentiment": "none"}, {"name": "phillips", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "finland", "sentiment": "none"}], "organizations": [{"name": "cnbc interview", "sentiment": "negative"}, {"name": "european commission", "sentiment": "negative"}, {"name": "ecb", "sentiment": "none"}, {"name": "commission", "sentiment": "none"}, {"name": "eu commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Following are excerpts from a CNBC Interview with the European Commission VP Jyrki Katainen from the World Economic Forum 2018\nSS: Let me get straight to our next guest, Jyrki Katainen, who is the EU Commission Vice-President. I'm really pleased you're here, actually, because you've been here since-, in the role since Jul 2014-,\nJK: Mm.\nSS: When, in the July-, or, should I say, a 2014/2015 Davos would all have been about the European woes, and where we were at. So, look, congratulations to Finland, to the Commission, for Europe, and getting itself back on track. But there's got to be some missing ingredient at the moment, because, otherwise, we wouldn't have crisis-level ECB, otherwise we wouldn't have a broken down Phillips curve at the moment. So, from your point of view, and I should remind our viewers, you're the Commissioner for Jobs, Growth, Investment and Competitiveness, what's missing?\nJK: Well, we still have to work with our economic structures in member states. Even though many indicators are very good for Europe at the moment, Europe is back, realistically, and we have managed to widen and deepen internal market, which will boost investments and job creation in Europe, but still, in many member states, we have to do reforms. Keep moving in the same path which we have followed for a couple of the last years. And the French President is a good example of this, Emmanuel Macron has done major reforms in order to reform the country to become more competitive.\nSS: Jyrki, Margrethe Vestager would never sit on her laurels, I mean, she's a tour de force-,\nJK: Mm.\nSS: And she's always beating down companies on regulation, and anti-competitive practices, as well, and I'm sure you're of the same vein, as well. So, just tell me where your biggest focus is on-, on who's not doing enough reform, who's not creating the structural changes that are needed to be?\nJK: Well, France is doing a lot. Germany, we wait for the new government to-, to appear in Germany, they will continue reform in Germany, smaller Nordic countries have already reformed, but some southern European countries must accelerate their reform approach, for instance, Italy. But, when looking at Spain and Portugal, they have reformed themselves quite significantly, and we can see the results, already, now. Growth is back, and investments are back, and job creation is positive. But then, we have to look what-, what we can do together at the EU level, and there, the single market, deepening and widening the single market, is very important. For instance, Capital Markets Union, or Digital Single Market, they are two good examples what-, what we can do. Also, trade policy. Europe has become a leading power in trade policy, and so, we are very close to conclude our negotiations with Mercosur, in a couple of months' time, we hope to-, to conclude negotiations with Mexico. Last year, we concluded with Canada and Japan. So, trade is very important for the European growth, and it's also a very important tool, to govern globalization.\nGC: One of the problems, though, I think, is that sometimes the national governments feel that it's one-way traffic with the criticism. I had a sit down with Mr. Gentiloni, and we talked about the migrant issue-,\nJK: Mm.\nGC: And about the challenge that his government has had-,\nJK: Mm.\nGC: In dealing with that issue, primarily on its own. And he was very frank about the failings that he thought he saw, as far as the Commission was concerned, and the lack of a joined up response to help Italy with this crisis. Is that fair criticism?\nJK: Italy has faced amazing challenges with migration flows, and Italy is-, the Italian government, and Prime Minister Gentiloni, has done a lot in order to address this. The other member states have wanted to help, but, I must admit that all the member states have not been ready to help. So, my question is, obviously, one of the things where we need more Europe, because the people, from elsewhere, are not coming to Italy, as such, they are coming to Europe, to-, to seek a more secure environment-,\nSS: So-,\nJK: To live, and-, and new jobs, and such, so that's why Europe must be ready to help, together, and show solidarity to Italy, and to Greece, to cope with the issue.\nSS: Has-, has the Commission got a problem? And we can talk about Poland, but in this specific case, you're referring to Mr. Orbán-,\nJK: Yes.\nSS: You're referring to Hungary, as well. Has Europe got a problem with countries that have come in from the east, or come in from Central Europe, who just don't want to abide by the greater rules?\nJK: We have to find a common tone in this. There are some Central and Eastern European countries which doesn't have any culture on-, on taking migrants, for instance, and to a certain extent, I understand this. But, we have to accept the truth, that refugees coming to Europe are not primarily targeting one specific country. They are coming-, they are fleeing cruelties, they are fleeing war, and they want to get a more secure life in Europe. And that's why we have to show solidarity towards the countries who are in the front row, so, either by paying, or redistributing people who are-, who have come to Europe, and-, because we cannot let Italy and Greece to deal with the issue alone.\nSS: Mm. Sure.\nGC: It still seems that this issue is politically toxic, though, and we look at the challenge that Angela Merkel has had, subsequent to Germany being very welcoming. And, as we run in to the Italian election, in March, migration and other social issues are front and centre for a change-,\nJK: Mm.\nGC: It's not about the economy, per se.\nJK: Mm.\nGC: So, how do we win that battle? How do we overcome these prejudices?\nJK: We have-, we need very thorough discussion in our member states. That, first of all, this is a humanitarian issue. We all have a human responsibility towards the people who are fleeing cruelties and-, and war. The second thing is that we need-, we need to be very pragmatic, how to organize the migration issue. So, every human being has a human responsibility, and then we need to be very pragmatic, to organize, so that the migration flows aren't overwhelming in one country, and that's why we must show solidarity and-, and share the amount of people who are coming to Europe.\nSS: Let me move on, if I may-, we've got so many issues we need to talk about, I'm just going to go for one of my hobby horses, where the money's going to be after Brexit. I spoke to-, again, a fantastic one, the President of Lithuania, yesterday, Ms. Grybauskaitė, and I said, 'Look, there's a money problem post-Brexit, isn't there?' She goes, 'Look, €10, €15 billion, what's the problem?' And I'm like, 'That's a lot of money, President!'\nJK: Mm.\nSS: You know. So, you're in charge of jobs, growth, investment. Is there going to be a money gap, a black hole, post-Brexit? Because let's-, forget about negotiations, for a moment, from my point of view. Europe's got to find extra money at a time when it doesn't want to find extra money. Have you got a problem?\nJK: Well, it is certainly a problem, and we have to address it. If I should bet something, we need to adjust the budget, to a certain extent, but also, we need fresh money from member states. But we also have to look how money is spent, how we could get more out of less, and one, it's not a magic wand, but, one solution is to use more financial instruments, instead of grants. So, in some areas, we could use guarantees, loans, or equity-, make-, do equity investments-,\nSS: Okay.\nJK: Instead of providing, kind of, free money, or grant financing. So, this is what we are planning, or exploring, at the moment, but it-, it's going to be very tough-, tough negotiation-,\nSS: Yes.\nJK: But, as a former Finance Minister, I tend to think that, 'Never miss a good crisis.' Now we have a crisis, and it's better to-, to look how we can change the way we spend money.\nGC: Very pleased to see you, thanks very much for coming and joining us here-,\nJK: Thank you very much.\nGC: Jyrki Katainen, the Vice-President of the Commission.\nENDS", "external_links": [], "published": "2018-01-26T08:00:00.000+02:00", "crawled": "2018-01-26T16:55:38.005+02:00", "highlightTitle": ""}