{"organizations": [], "uuid": "06e43d7c9d2e9d434498ea7c0e84339ee1b7a189", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-set-for-biggest-monthly-loss-in-nearly-2-years-as-outlook-weakens-idUSL4N1PQ3QZ", "country": "US", "domain_rank": 408, "title": "FOREX--Dollar set for biggest monthly loss in nearly 2 years as outlook weakens", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T16:44:00.000+02:00", "replies_count": 0, "uuid": "06e43d7c9d2e9d434498ea7c0e84339ee1b7a189"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-set-for-biggest-monthly-loss-in-nearly-2-years-as-outlook-weakens-idUSL4N1PQ3QZ", "ord_in_thread": 0, "title": "FOREX--Dollar set for biggest monthly loss in nearly 2 years as outlook weakens", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "saikat chatterjee", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "boj", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "u.s. federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Yen briefly slips after BOJ resumes medium-tenor bond purchases\n* Graphic: World FX rates in 2017 tmsnrt.rs/2egbfVh\nBy Saikat Chatterjee\nLONDON, Jan 31 (Reuters) - The dollar fell by a quarter of a percent on Wednesday, putting it on track for its biggest monthly drop in nearly two years as U.S. President Donald Trump’s first State of the Union address failed to offer any comfort to ailing dollar bulls.\nAgainst a basket of rivals, the greenback was down 0.25 percent in early London trading, taking its losses to 3.5 percent in January, its biggest monthly drop since March 2016.\nTrump called on the U.S. Congress to pass legislation to ensure at least $1.5 trillion in new infrastructure spending and urged lawmakers to work toward bipartisan compromises, but pushed a hard line on immigration.\nThe new round of weakness comes after a period of consolidation earlier this week as financial markets expected the U.S. Federal Reserve to take a more confident stance about the outlook of the economy but keep policy unchanged.\n“We are still seeing a broad round of dollar weakness and that may be also be because of an undertone of risk aversion in the markets,” said Commerzbank currency strategist Esther Reichelt, in Frankfurt.\nA market gauge of risk perked up to its highest levels since August 2017 and has nearly doubled this month.\nThe dollar’s weakness also coincided with a time when global growth has picked up across the world, especially in the eurozone and Japan. For a series of charts on the dollar, see\nThe dollar’s woes are in sharp contrast to the general mood of optimism with investor flows data painting an upbeat picture.\nIn the opening weeks of 2018, Europe recorded the highest equity inflows across all major regions, on top of a strong 2017 which saw the region cornering over one-third of all global equity fund flows.\nTuesday’s preliminary data showed the euro zone economy expanded at its fastest rate in a decade in 2017 with sentiment remaining high at the start of 2018 despite a slight dip from a 17-year peak.\nThe yen slipped briefly after the Bank of Japan increased its buying of medium-term Japanese government bonds (JGBs) in a move seen as a warning shot against further rises in bond yields.\nThe dollar reached its intraday high of 109.095 yen shortly after the BOJ announcement. The dollar later pared its gains and was last trading at 108.68 yen, steady on the day.\nThe BOJ’s move came after the 10-year JGB yield had risen to a 6-1/2-month high of 0.095 percent on Tuesday. The central bank’s policy guidance is to control the 10-year yield “around zero percent”.\nBOJ officials have said that any changes to bond-buying operations are fine-tuning and are not meant to telegraph hints on policy.\nFor Reuters Live Markets blog on European and UK stock markets see reuters://realtime/verb=Open/url=http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets (Reporting by Saikat Chatterjee; Editing by Angus MacSwan)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets", "http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T16:44:00.000+02:00", "crawled": "2018-01-31T17:53:09.005+02:00", "highlightTitle": ""}