{"organizations": [], "uuid": "25eac3a7b25c40feb221748c71057919353d1e89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 432, "shares": 432, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220485213&w=1200&r=LYNXMPEE080H5", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-politics/mays-attempt-to-reassert-authority-branded-a-shambles-idUKKBN1EY0S7", "country": "US", "domain_rank": 408, "title": "May's attempt to reassert authority branded a shambles", "performance_score": 4, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T10:49:00.000+02:00", "replies_count": 0, "uuid": "25eac3a7b25c40feb221748c71057919353d1e89"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-politics/mays-attempt-to-reassert-authority-branded-a-shambles-idUKKBN1EY0S7", "ord_in_thread": 0, "title": "May's attempt to reassert authority branded a shambles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 8:50 AM / Updated 36 minutes ago 'Farce' - no new start for Britain's May with reshuffle Elizabeth Piper 5 Min Read \nLONDON (Reuters) - A government reshuffle by British Prime Minister Theresa May was dismissed even by some of her allies on Tuesday as a failure that one said left her attempt to reassert her authority in “smoke and wreckage”. \nOne former minister, George Osborne, sacked by May when she came to power in July 2016, led the criticism, calling the moves a “farce”. \nBut other more loyal members of her governing Conservatives also questioned the prime minister’s ability to put the party back on track for election success after a year of scandals, gaffes and divisions over Brexit. \nA cabinet reshuffle is meant to offer a chance for a leader to assert authority on a team. May had hoped the limited changes would not only re-energise her domestic agenda but also strengthen her hand in talks to leave the European Union. \nInstead, it did little more than demonstrate May’s weakness, with the only high-profile moves derailed when one minister quit rather than take a new job and another talked May out of changing his role. \nMay said her reshuffle helped the government look “more like the country it serves”. \n“It allows a new generation of gifted ministers to step up and make life better for people across the whole UK,” she said in a statement. \nBut for Osborne, it was simply a “farce”. \n“You have to hand it to this prime minister: she’s given us the hat-trick of the worst reshuffle, the worst party conference speech and the worst manifesto in modern history,” the former finance minister wrote in his newspaper, London’s Evening Standard. \n“If they were not facing one of the worst oppositions we’ve ever had, the Tories would be finished.” \nBut while his criticism was to be expected, even loyal lawmakers and commentators asked why the prime minister had launched a reshuffle from a weakened position, unable to force her will. \n“She should not have been in the position of having to plead with a minister whose talents she needs, faced with a choice of giving in or sacking him,” the Conservative home website, which airs the views of the party, wrote in an editorial. Britain's Prime Minister Theresa May leads her first cabinet meeting of the new year following a reshuffle at 10 Downing Street, London January 9, 2018. REUTERS/Daniel Leal-Olivas/Pool \nBut, it added, in the “smoke and wreckage this morning, there are a few points of hope and light”. PALE, MALE, STALE \nOn Tuesday, May moved to promote younger, black and women lawmakers to junior roles in government, hoping to rid the party of its reputation of being “pale, stale and male”. \nBut by playing very much to her own party rather than the country, some critics said May risks losing the chance to revitalise what her aides call her “reform agenda”, already hampered by Brexit, a scandal over sexual harassment and struggling public services. Britain's Prime Minister Theresa May leads her first cabinet meeting of the new year following a reshuffle at 10 Downing Street, London January 9, 2018. REUTERS/Daniel Leal-Olivas/Pool \nMonday’s reshuffle was blown off course when Health Secretary Jeremy Hunt convinced May at a lengthy meeting not to move him to a different job. Newspapers said he refused to accept a new post, although a source close to May denied that, and said Hunt simply persuaded her. \nThen education minister Justine Greening refused to take a job at the pensions department and quit instead. \nLosing the only gay minister in the cabinet threatens what May hoped to be the narrative of her reshuffle: that she was ushering in a new, more diverse team to counter accusations that the Conservative Party is out of touch. \nThe resignation of the newly appointed board member of a new universities watchdog over sexist tweets also did little to help distance May from scandals over sexual harassment last year that brought down two ministers. \nBut aides had long said Monday’s moves were less important that those on Tuesday, when May promoted lawmakers to junior positions in preparation of a wider reshuffle after Brexit. \n“Today I expect the rest of the picture to show that it’s more about preparing the ground for a post-Brexit reshuffle at a senior level,” Crispin Blunt, a Conservative lawmaker, told Reuters. \nAnd few predicted the furore to lead to her downfall. \n“Once everyone is in place, there won’t be any trouble,” a senior Conservative member said on condition of anonymity. “It’ll be more of the same, she will take one step at a time ... and suddenly, we’ll be in 2019.” additional reporting by Michael Holden; Editing by Peter Graff and Angus MacSwan", "external_links": [], "published": "2018-01-09T10:49:00.000+02:00", "crawled": "2018-01-09T11:02:58.004+02:00", "highlightTitle": ""}