{"organizations": [], "uuid": "457708abb4c9684c2463569963d3c1d4fd64ccb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-sonic-prices-170-million-securitized-senior-notes.html", "country": "US", "domain_rank": 767, "title": "Sonic Prices $170 Million Securitized Senior Notes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-24T01:11:00.000+02:00", "replies_count": 0, "uuid": "457708abb4c9684c2463569963d3c1d4fd64ccb6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-sonic-prices-170-million-securitized-senior-notes.html", "ord_in_thread": 0, "title": "Sonic Prices $170 Million Securitized Senior Notes", "locations": [], "entities": {"persons": [], "locations": [{"name": "oklahoma city", "sentiment": "none"}], "organizations": [{"name": "sonic corp.", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OKLAHOMA CITY--(BUSINESS WIRE)-- Sonic Corp. (NASDAQ:SONC), the nation's largest chain of drive-in restaurants, today announced that certain of its subsidiaries (the “Co-Issuers”) have priced $170 million of Series 2018-1 Class A-2 Fixed Rate Senior Secured Notes (\"Senior Notes\"). The Senior Notes will have an expected life of seven years and bear interest at 4.026% per annum, payable monthly.\nThe net proceeds from the sale of the Senior Notes will be used to repay in full the amount drawn on the Series 2016-1 Variable Funding Senior Secured Notes, Class A-1 (the “Variable Funding Notes”), together with related fees and expenses. The Co-Issuers will retain $100 million in undrawn capacity on the Variable Funding Notes. Sonic Corp. expects the Senior Notes and Variable Funding Notes transactions to close on February 1, 2018.\nThe Co-Issuers are indirect subsidiaries of Sonic Corp. that own substantially all of the Sonic system's franchising assets and real estate. The servicing and repayment of the Senior Notes will be made solely from the cash flows derived from these indirect subsidiaries' assets. Neither Sonic Corp., the ultimate parent of each of the subsidiaries involved in the securitization, nor any other subsidiary of Sonic Corp., will be liable for any obligations under the Senior Notes.\nThe Senior Notes will not be registered under the Securities Act and may not be offered or sold in the United States absent registration or an applicable exemption from registration requirements. This is not an offer to sell or a solicitation of an offer to buy the Senior Notes.\nAbout Sonic\nSONIC, America's Drive-In is the nation's largest drive-in restaurant chain serving approximately 3 million customers every day. Nearly 94 percent of SONIC's 3,500 drive-in locations are owned and operated by local business men and women. For 65 years, SONIC has delighted guests with signature menu items, 1.3 million drink combinations and friendly service by iconic Carhops. Since the 2009 launch of SONIC's Limeades for Learning philanthropic campaign in partnership with DonorsChoose.org , SONIC has donated $9.5 million to public school teachers nationwide to fund essential learning materials and innovative teaching resources to inspire creativity and learning in today's youth. To learn more about Sonic Corp. (NASDAQ/NM: SONC), please visit sonicdrivein.com and please visit or follow us on Facebook and Twitter. To learn more about SONIC's Limeades for Learning initiative, please visit Limeadesforlearning.com .\nThis press release contains forward-looking statements within the meaning of the federal securities laws. Forward-looking statements reflect management’s expectations regarding future events and operating performance and speak only as of the date hereof. These forward-looking statements involve a number of risks and uncertainties. Factors that could cause actual results to differ materially from those expressed in, or underlying, these forward-looking statements are detailed in the company’s annual and quarterly report filings with the Securities and Exchange Commission. The company undertakes no obligation to publicly release revisions to these forward-looking statements to reflect events or circumstances after the date hereof or to reflect the occurrence of unforeseen events, except as required to be reported under the rules and regulations of the Securities and Exchange Commission.\nSONC-F\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006566/en/\nSonic Corp.\nCorey Horsch, (405) 225-4800\nVice President of Investor Relations and Treasurer\nSource: Sonic Corp.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sonicdrivein.com&esheet=51747852&newsitemid=20180123006566&lan=en-US&anchor=sonicdrivein.com&index=1&md5=d4fec2cb4cfd203b792fb2fdd844f04e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.Limeadesforlearning.com&esheet=51747852&newsitemid=20180123006566&lan=en-US&anchor=Limeadesforlearning.com&index=2&md5=82be43e1ef0b72a75e5e7fc051184f14", "http://www.businesswire.com/news/home/20180123006566/en/"], "published": "2018-01-24T01:11:00.000+02:00", "crawled": "2018-01-24T01:23:26.000+02:00", "highlightTitle": ""}