{"organizations": [], "uuid": "3421d83dba056b82efd6580d940697178e843f93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 494, "shares": 494, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220370279&w=1200&r=LYNXMPEE071H8", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-congress/house-foreign-affairs-chairman-royce-will-not-run-for-re-election-idUSKBN1EX2DJ", "country": "US", "domain_rank": 408, "title": "U.S. Rep. Royce is latest House Republican to announce retirement", "performance_score": 4, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T06:15:00.000+02:00", "replies_count": 0, "uuid": "3421d83dba056b82efd6580d940697178e843f93"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-congress/house-foreign-affairs-chairman-royce-will-not-run-for-re-election-idUSKBN1EX2DJ", "ord_in_thread": 0, "title": "U.S. Rep. Royce is latest House Republican to announce retirement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - Republican U.S. Representative Ed Royce said on Monday he will not run for a 14th term representing his southern California district, a seat that could be a key to Democratic efforts to win back control of the House of Representatives.\nRoyce is the latest in a wave of some 30 House Republicans who have announced they are retiring, running for another office or resigning. Democrats need to win 24 seats in the November mid-term elections to retake the majority in the House, which Republicans have controlled since 2011.\nRoyce, chairman of the powerful House Foreign Affairs Committee, was first elected in 1992 and has been easily re-elected since.\nBut political analysts have rated his district, comprising suburbs southeast of Los Angeles, as a battleground in the November elections, after voters there backed Democrat Hillary Clinton with a margin of 9 percentage points over Republican Donald Trump in the 2016 presidential race.\nAfter Royce announced his retirement, the non-partisan Cook Political Report said it had moved the district from “leans Republican” to “leans Democratic.”\nRoyce is in his last year as committee chairman, because Republicans in Congress impose term limits on committee leadership.\nIf Republicans maintain control of the House, Representative Michael McCaul, a foreign affairs committee member who is currently chairman of the House Homeland Security Committee, is seen as a possible new leader of the foreign affairs panel, congressional aides said.\nA spokeswoman for McCaul declined to comment.\nIf Democrats were to win control of the House, Representative Eliot Engel, currently the foreign affairs ranking Democrat, is expected to take the gavel.\nIn a statement, Engel praised Royce, “a dear friend,” for working with Democrats to produce bipartisan legislation.\nAs chairman, Royce has helped pass new sanctions on Iran, North Korea and Russia, increased pressure on Syria’s government and pushed for aid to Ukraine.\nRoyce said in a statement he wanted to focus his last year leading the foreign affairs panel “on the urgent threats facing our nation,” which he listed as the North Korean and Iranian governments, Russian efforts to “weaponize information to fracture western democracies” and terrorist threats in Africa and Central Asia.\nHis announcement came the same day Trump sent to the Senate his nomination of Royce’s wife, Marie, as an assistant secretary in the State Department, which is overseen by the foreign affairs panel.\nReporting by Patricia Zengerle; Editing by Leslie Adler and Tom Brown\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T06:15:00.000+02:00", "crawled": "2018-01-09T09:40:33.675+02:00", "highlightTitle": ""}