{"organizations": [], "uuid": "1cd402ace6c987e56dd658c7eb1e15fd256eb97f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-901262368.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/08/warmer-temperatures-post-bomb-cyclone-frozen-east-coast/", "country": "US", "domain_rank": 1196, "title": "Warmer Temperatures Finally Headed to East Coast After Bomb Cyclone | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.191, "site_type": "news", "published": "2018-01-09T17:02:00.000+02:00", "replies_count": 0, "uuid": "1cd402ace6c987e56dd658c7eb1e15fd256eb97f"}, "author": "Sarah Gray", "url": "http://fortune.com/2018/01/08/warmer-temperatures-post-bomb-cyclone-frozen-east-coast/", "ord_in_thread": 0, "title": "Warmer Temperatures Finally Headed to East Coast After Bomb Cyclone | Fortune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Sarah Gray January 8, 2018 \nThe “bomb cyclone” that brought Arctic chill to the East Coast last week is being replaced by a bomb heat wave—relatively speaking. \nTemperatures in Boston will climb to the low 50s by Friday, National Weather Service meteorologist Kim Buttrick told the Boston Globe . The warm temperatures could mean some street flooding from all the melting ice and snow. \nAreas of Florida that had been under freeze warnings at the end of last week are also returning to seasonable norms near 70 degrees, according to local news station Fox 13 . \nWinter storm Grayson brought icy conditions, snow, and coastal flooding to the East Coast last week followed by record cold temperatures . The difficult conditions were responsible for 22 deaths nation-wide, according to CBS News. \nThe cold also caused pipes to burst at Boston Medical Center, a water main break at JFK airport , and dangerous road conditions Monday morning in Atlanta ahead of the NCAA football championship game. \nA number of cities reached record low temperatures this past week, including Burlington, Vt. at minus 20 degrees, Portland, Maine at minus 11, Worcester, Mass. at minus nine degrees, Providence, R.I. at minus 3 degrees, and Hartford, Conn. at minus 9 degrees. \nBoston tied for its low record of minus 2 degrees, which was set in 1896, according to the Boston Globe . \nLow temperatures also hit states in the South that are unaccustomed to freezing weather: Around 100 baby sea turtles had to be rescued in Florida due to the cold, NBC News reported . \nBut now, the frigid temperatures are beginning to lift. A local news station for coastal North Carolina cheered the arrival of warm weather, giving this article the headline: “LET THE BIG THAW BEGIN!” Temperatures for Wilmington, N.C. are expected to rise from the 40s on Monday into the 70s by Friday. \nBut the thaw won’t last. Boston, for example, could get more snow over the weekend. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-09T17:02:00.000+02:00", "crawled": "2018-01-09T09:36:12.573+02:00", "highlightTitle": ""}