{"organizations": [], "uuid": "bc08f79fb86532cad50be4b78fe2b4dcab9dc890", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/business-wire-imperva-appoints-mike-burns-as-cfo.html", "country": "US", "domain_rank": 767, "title": "Imperva Appoints Mike Burns as CFO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T15:00:00.000+02:00", "replies_count": 0, "uuid": "bc08f79fb86532cad50be4b78fe2b4dcab9dc890"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/business-wire-imperva-appoints-mike-burns-as-cfo.html", "ord_in_thread": 0, "title": "Imperva Appoints Mike Burns as CFO", "locations": [], "entities": {"persons": [{"name": "mike burns", "sentiment": "negative"}, {"name": "mike", "sentiment": "none"}, {"name": "chris hylen", "sentiment": "none"}, {"name": "burns", "sentiment": "none"}], "locations": [{"name": "redwood shores", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "gigamon", "sentiment": "none"}, {"name": "imperva", "sentiment": "none"}], "organizations": [{"name": "imperva, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Seasoned Financial Executive Focused on Profitable Growth\nREDWOOD SHORES, Calif.--(BUSINESS WIRE)-- Imperva, Inc. (NASDAQ:IMPV), a leading cybersecurity company that delivers best-in-class solutions to protect data and applications – wherever they reside - in the cloud, on-premises, and in hybrid environments, today announced the appointment of Mike Burns as the company’s chief financial officer, effective immediately.\n“Mike joins Imperva at a very exciting time. His successful track record in growing companies and highly relevant experience will be instrumental in executing the company’s profitable growth strategy,” said Chris Hylen, president and chief executive officer of Imperva. “With Mike at the finance helm, we are well positioned to meet our near and long-term corporate objectives.”\nMr. Burns has more than 20 years of senior leadership experience in finance and operations with high-growth public technology companies. Most recently, he served as chief financial officer of Gigamon where the company doubled revenue and expanded operating profit during his tenure. Prior to that, he served as chief financial officer of Volterra Semiconductor for six years. Earlier in his career, Mr. Burns held several senior finance roles at Intel Corporation, including finance director of Intel Capital. He earned his B.A. in Economics and M.S. in Industrial Engineering from Stanford University, and his MBA from the UC Berkeley Haas School of Business.\n“I am thrilled to join Imperva given its leadership in the enterprise data and application security industry,” said Mr. Burns. “I look forward to working with Chris and the entire team as we execute on our next phase of growth and deliver strong results over time for our employees and shareholders.”\nAs CFO, Mr. Burns will report directly to Mr. Hylen and will oversee Imperva’s finance, accounting, investor relations, and facilities & administration.\nDisclosure of non-stockholder approved employment inducement grants made in reliance on NASDAQ rules: In connection with the appointment of Mr. Burns as Imperva’s new CFO, the compensation committee of Imperva’s board of directors approved an award to Mr. Burns of an aggregate of 146,400 restricted stock units (RSUs) to be granted pursuant to the Imperva, Inc. 2015 Equity Inducement Plan, as amended, which is a non-stockholder approved plan. Mr. Burns’ RSUs will be in two separate awards. The first award will cover 48,800 RSUs that vest at the rate of 25% of the shares on February 15, 2019, and then 6.25% of the shares quarterly thereafter, subject to his continued provision of services to Imperva. The second award will be subject to performance criteria for 2018 and will be eligible for 48,800 shares at target performance and will be eligible for a total of 97,600 shares at maximum performance, in each case subject to time-based vesting at a rate of 12.5% of the shares on February 15, 2019, and then 12.5% of the shares quarterly thereafter, subject to his continued provision of services to Imperva. The RSUs are being granted as an inducement material to Mr. Burns’ employment in accordance with NASDAQ Listing Rule 5635(c)(4). In connection with Mr. Burns’ employment, the compensation committee also agreed to additional compensation arrangements which will be set forth in a current report on Form 8-K to be filed with the Securities and Exchange Commission.\nCautionary Statement Regarding Forward Looking Statements\nThis press release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are not historical facts but instead represent only Imperva’s belief regarding future events, many of which, by their nature, are inherently uncertain and outside Imperva’s control, such as the company’s belief about future growth, profitability and positioning for future success, and expectations regarding Mr. Burns’ contributions to achievement of the company’s objectives. Except for Imperva’s ongoing obligation to disclose material information as required by federal securities laws, Imperva is not under any obligation (and expressly disclaims any obligation) to update or alter any projections, goals, assumptions, or other statements, whether written or oral, that may be made from time to time, whether as a result of new information, future events or otherwise. Factors that could cause actual results to differ, possibly materially, from such forward-looking statements include the factors set forth in Imperva’s filings with the United States Securities and Exchange Commission.\nAbout Imperva\nImperva® (NASDAQ:IMPV) is a leading cybersecurity company that delivers best-in-class solutions to protect data and applications – wherever they reside - in the cloud, on-premises, and in hybrid environments. The company’s SecureSphere, CounterBreach, Incapsula and Camouflage product lines enable organizations to discover assets and risks, protect information wherever it lives – in the cloud and on-premises – and comply with regulations. The Imperva Defense Center, a research team comprised of some of the world’s leading experts in data and application security, continually enhances Imperva products with up-to-the-minute threat intelligence, and publishes reports that provide insight and guidance on the latest threats and how to mitigate them. Imperva is headquartered in Redwood Shores, California. Learn more: www.imperva.com , our blog, on Twitter.\n© 2018 Imperva, Inc. All rights reserved. Imperva, the Imperva logo, CounterBreach, Incapsula, SecureSphere, ThreatRadar, and Camouflage along with its design are trademarks of Imperva, Inc. and its subsidiaries.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180102005089/en/\nInvestor Relations\nSeth Potter, 646-277-1230\nIR@imperva.com\nSeth.Potter@icrinc.com\nSource: Imperva, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180102005089/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.imperva.com&esheet=51736174&newsitemid=20180102005089&lan=en-US&anchor=www.imperva.com&index=1&md5=eebbe0171fbf5bd7b5d076026367e0d6"], "published": "2018-01-02T15:00:00.000+02:00", "crawled": "2018-01-02T16:56:45.004+02:00", "highlightTitle": ""}