{"organizations": [], "uuid": "1ea90b687eacafe5d757bcf677af320c41ba2a75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-capsule8-hires-security-industry-veteran-as-new-vice-president-of-sales.html", "country": "US", "domain_rank": 767, "title": "Capsule8 Hires Security Industry Veteran as New Vice President of Sales", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-16T17:30:00.000+02:00", "replies_count": 0, "uuid": "1ea90b687eacafe5d757bcf677af320c41ba2a75"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-capsule8-hires-security-industry-veteran-as-new-vice-president-of-sales.html", "ord_in_thread": 0, "title": "Capsule8 Hires Security Industry Veteran as New Vice President of Sales", "locations": [], "entities": {"persons": [{"name": "john viega", "sentiment": "none"}, {"name": "steve roge", "sentiment": "none"}, {"name": "veracode", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "roge", "sentiment": "none"}], "locations": [{"name": "sales brooklyn new york", "sentiment": "none"}, {"name": "veracode", "sentiment": "none"}, {"name": "mimecast", "sentiment": "none"}], "organizations": [{"name": "capsule8 hires security industry veteran", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brooklyn New York, Jan. 16, 2018 (GLOBE NEWSWIRE) -- Capsule8 , the pioneer behind real-time attack disruption for cloud-native environments, today announced security industry veteran Steve Roge as its new vice president of sales. Roge brings more than 20 years of Security-as-a-Service experience to the company and will be leading the charge for Capsule8’s growing sales and business development team as it prepares for the general availability of Capsule8 Protect .\nMost notably, Roge served as Vice President of Strategic Accounts at Veracode where he was responsible for Veracode’s largest book of business and was a key team member responsible for helping to grow the company’s revenue from zero to $77M during his tenure. Roge’s security experience also includes serving as Vice President of Enterprise Accounts at Mimecast.\n\"Steve’s energy is palpable, and his experience and expertise match well with both Capsule8’s mission and the team’s passion for leading the transformation taking place in cybersecurity,\" said John Viega, co-founder and CEO, Capsule8. “As organizations are trying to figure out how to tackle the challenges of securing the cloud-native world of containers, microservices, and Linux, Capsule8 is leading the way. Steve's enthusiasm and experience will be huge in paving our path in the industry.”\n\"Capsule8 has the best and brightest team out there and has built a platform that solves a huge and growing security problem. These are problems faced by Fortune 500 companies and enterprises everywhere that are looking to build out a next-gen infrastructure,\" said Roge. “There is no other technology out there right now that can do what Capsule8 does, and we have a huge opportunity in 2018 and beyond to remove the security barrier that has been hindering cloud-native adoption and help these companies tackle this challenge head-on.\"\nEarlier in his career, Roge held sales leadership roles at a host of technology companies including @stake, Symantec, and Sapient Corporation. Roge holds a BA in Communications from Michigan State University and is an event advisor for Best Buddies International, as well as co-chair of the Mass Down Syndrome Congress.\nAbout Capsule8\nFounded in fall 2016 and headquartered in Brooklyn, NY, Capsule8 is developing the industry’s first and only real-time attack disruption platform purpose-built for the cloud-native world of Linux, containers and microservices. Founded by experienced hackers and seasoned security entrepreneurs, and funded by Bessemer Venture Partners and ClearSky, Capsule8 is making it possible for Linux-powered enterprises to modernize without compromise. Learn more at www.Capsule8.com .\nLisa Mokaba Communications Director lisa@capsule8.com\nSource: Capsule8", "external_links": ["https://www.globenewswire.com/Tracker?data=5M-pUGteGsL8oHPi9WGhOPoH6y7INIdGSvu6wMo9bp-E5d13zmp640tX__POMdMVbPBJE_KemR4AMAjoKOWicNhj_YsN_iHZGQGB116Qoic=", "https://www.globenewswire.com/Tracker?data=ivFBjeMTevUZSsK14qaCSobDxccxNNxwCAhMcTRznV8Eu6zCfRsK8M_ixYc1Cj3hRH9qP5wjCIfPz1vT3w8c4g==", "https://www.globenewswire.com/Tracker?data=5M-pUGteGsL8oHPi9WGhOJuNUeOdAmsMrOqKvcGjM5mXGJDwwvmLRbT8NTj25EOUPgP1z1lI7w92vvZ9Du6Hsg==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/db4c365b-d50f-430b-b500-65c345f22793"], "published": "2018-01-16T17:30:00.000+02:00", "crawled": "2018-01-16T18:33:50.001+02:00", "highlightTitle": ""}