{"organizations": [], "uuid": "af292ec301145f31d4c0ce012ab22cb2027bbfd0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-cannimed-therapeutics-reminds-shareholders-to-vote-the-green-proxy-for-the-acquisition-of-newstrike-resources.html", "country": "US", "domain_rank": 767, "title": "CanniMed Therapeutics Reminds Shareholders to Vote the GREEN Proxy FOR the Acquisition of Newstrike Resources", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T15:00:00.000+02:00", "replies_count": 0, "uuid": "af292ec301145f31d4c0ce012ab22cb2027bbfd0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-cannimed-therapeutics-reminds-shareholders-to-vote-the-green-proxy-for-the-acquisition-of-newstrike-resources.html", "ord_in_thread": 0, "title": "CanniMed Therapeutics Reminds Shareholders to Vote the GREEN Proxy FOR the Acquisition of Newstrike Resources", "locations": [], "entities": {"persons": [], "locations": [{"name": "aurora", "sentiment": "none"}, {"name": "saskatchewan", "sentiment": "none"}, {"name": "saskatoon", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "acquisition of newstrike resources", "sentiment": "negative"}, {"name": "newstrike resources ltd.", "sentiment": "none"}, {"name": "cannimed therapeutics inc.", "sentiment": "none"}, {"name": "kingsdale advisors", "sentiment": "none"}, {"name": "green", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CanniMed Shares Have Traded Above Aurora’s Offer Price for 15 Straight Days. Do Not Tender Your Shares for Less Than They Are Worth.\nSASKATOON, Saskatchewan--(BUSINESS WIRE)-- CanniMed Therapeutics Inc. ( “CanniMed” or the “Company” ) (TSX:CMED) reminds shareholders that the only way to see real value for their CanniMed shares is to vote the GREEN proxy FOR CanniMed’s acquisition of Newstrike Resources Ltd. ( “Newstrike” ).\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180117005491/en/\nFigure 1 - CanniMed’s share price has traded above Aurora’s capped offer for the last 15 days. (Photo: Business Wire)\nVOTING MADE EASY\nEvery vote is important no matter how many shares you own. We have a team standing by to help make it easy to quickly vote your GREEN proxy or voting instruction form, even if you have never voted before.\nShareholders must vote their GREEN proxy before 10:00 am (EST) on January 19 th , 2018. If you need help voting, please contact Kingsdale Advisors at 1-888-518-1554 toll-free in North America, or 416-867-2272 outside North America or by email at contactus@kingsdaleadvisors.com .\nNEWSTRIKE REPRESENTS A HIGHLY STRATEGIC AND ACCRETIVE ACQUISITION\nFollowing the completion of the Newstrike acquisition, CanniMed will be more valuable as a company that offers both medical and recreational cannabis products. On a standalone basis CanniMed provides $1.34 EBITDA 1 per share and, with Newstrike, CanniMed shareholders are expected to see 14.6% accretion to $1.54 EBITDA ii per share.\nConversely, by tendering to Aurora’s hostile bid, CanniMed shareholders will see a 48.4% dilution to $0.69 EBITDA i per share based on Aurora’s January 16, 2018 last 20 day VWAP. This means Aurora is offering shareholders $0.85 or 55% less than what a combined CanniMed and Newstrike offers shareholders. As Aurora’s 20 Day VWAP increases, EBITDA per share dilution deteriorates even more for CanniMed’s shareholders due to the capped offer price.\nThe recent significant run up in Newstrike’s share price makes the acquisition even more attractive, coupled with Newstrike’s recent approval by Health Canada for a cannabis sales license. The combined company will have an established path to 45,000 kg of cannabis production representing $300 - $500 million in revenue iii .\nCANNIMED SHARES ARE TRADING ABOVE AURORA’S OFFER\nShareholders should be aware of CanniMed’s recent share price performance following a series of positive announcements including a strategic international cannabis distribution agreement with Fagron NV, a supply agreement with Newstrike, the launch of CanniMed Topical Cream and an application by CanniMed’s US subsidiary for licenses in Michigan to produce and process medical cannabis.\nCanniMed’s share price has traded above Aurora’s capped offer for the last 15 days. The market has clearly recognized that Aurora’s hostile bid is insufficient, with CanniMed shares trading above the capped offer price of $24.00 consistently since January 2, 2018.\nCanniMed shareholders will own less of Aurora than they should be entitled to. Aurora’s hostile bid only gives CanniMed shareholders minimal ownership of the combined company even though CanniMed has more current production and an equal number of patients. Since the offer was announced, Aurora has participated in the market upturn, while simultaneously preventing CanniMed shareholders from realizing the same value due to the capped $24.00 consideration under Aurora’s hostile bid. While Aurora’s share price has increased, given this $24.00 cap, the consideration available to CanniMed shareholders does not change and ownership in the combined company has been reduced.\nAurora’s hostile bid has prevented CanniMed shareholders from realizing significant value. CanniMed has traded in-line with the index since announcing its intention to enter the recreational market through accretive acquisitions. However, the overhang of Aurora’s hostile bid has prevented CanniMed from participating in the broader market rally and realizing any positive momentum from the Newstrike acquisition.\nVOTE GREEN. DO NOT TENDER.\nThe CanniMed Board and management will vote their GREEN proxies in support of CanniMed’s acquisition of Newstrike and will not tender to Aurora’s hostile bid. The Board strongly recommends shareholders join them in doing the same, no matter how many shares are owned. Here’s how:\n1. To vote FOR the Newstrike acquisition vote GREEN. Follow the instructions on the GREEN VIF or form of proxy by January 19th, 2018 at 10:00 am (EST). Shareholders with questions or need help voting should call Kingsdale Advisors toll-free at 1-888-518-1554 or by email at contactus@kingsdaleadvisors.com .\n2. Ignore and recycle any Blue proxy forms received.\n3. To reject Aurora’s bid, simply do nothing. Do not tender your shares. If you have tendered your shares in error or now wish to withdraw, simply ask your broker or Kingsdale Advisors at 1-888-518-1554 or contactus@kingsdaleadvisors.com to assist with this process. Shareholders are also encouraged to visit www.NewstrikeNotAurora.com for more details.\nAdvisors\nKingsdale Advisors is acting as strategic shareholder and communications advisor. AltaCorp Capital Inc. is acting as financial advisor to the Board and Borden Ladner Gervais LLP is acting as legal advisor to the Board. Cormark Securities Inc. is acting as financial advisor to the Special Committee and Stikeman Elliott LLP is acting as legal advisor to the Special Committee.\nAbout CanniMed Therapeutics Inc.\nCanniMed is a Canadian-based, international plant biopharmaceutical company and a leader in the Canadian medical cannabis industry, with 17 years of pharmaceutical cannabis cultivation experience, state-of-the-art, GMP-compliant production process and world class research and development platforms with a wide range of pharmaceutical-grade cannabis products. In addition, the Company has an active plant biotechnology research and product development program focused on the production of plant-based materials for pharmaceutical, agricultural and environmental applications.\nThe Company, through its subsidiaries, was the first producer to be licensed under the Marihuana for Medical Purposes Regulations, the predecessor to the current Access to Cannabis for Medical Purposes Regulations. It was the sole supplier to Health Canada under the former medical marijuana system for 13 years, and has been producing safe and consistent medical marijuana for thousands of Canadian patients, with no incident of product diversion or recalls.\nFor more information, please visit our websites: www.cannimed.ca (patients) and www.cannimedtherapeutics.com (investors).\nNon-IFRS Measure: Earnings before Interest, Taxes, Depreciation and Amortization (“EBITDA”)\nCanniMed uses EBITDA as a supplemental financial measure of its operational performance. In addition, analysts use 2019 estimated EBITDA in their published reports. CanniMed believes EBITDA to be an important measure of its and other companies’ capacity to generate cash flow from operations as it excludes the effects of items which primarily reflect the impact of long-term investment and decisions and finance strategies, rather than the performance of CanniMed’s and other companies’ day-to-day operations. CanniMed measures EBITDA as net earnings (loss) from continuing operations plus income taxes expense (recovery), interest expense and depreciation and", "external_links": ["http://www.businesswire.com/news/home/20180117005491/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cannimed.ca&esheet=51744422&newsitemid=20180117005491&lan=en-US&anchor=www.cannimed.ca&index=2&md5=2ba366d4c60711945c45aefa57d0c8bc", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.NewstrikeNotAurora.com&esheet=51744422&newsitemid=20180117005491&lan=en-US&anchor=www.NewstrikeNotAurora.com&index=1&md5=c7c8d328ea78e4663d34d0adafe8afe7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fsedar.com%2F&esheet=51744422&newsitemid=20180117005491&lan=en-US&anchor=sedar.com&index=4&md5=4440a1f6544cc3807ff7bcbc21f2ac9c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cannimedtherapeutics.com&esheet=51744422&newsitemid=20180117005491&lan=en-US&anchor=www.cannimedtherapeutics.com&index=3&md5=bfb328791a51e77565fcc01966f8d6b3"], "published": "2018-01-17T15:00:00.000+02:00", "crawled": "2018-01-17T15:50:45.057+02:00", "highlightTitle": ""}