{"organizations": [], "uuid": "3200b97922b08bcb55b57ba12b3007f323307711", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/18/reuters-america-update-4-amazons-review-of-toronto-could-escalate-tension-with-trump.html", "country": "US", "domain_rank": 767, "title": "UPDATE 4-Amazon's review of Toronto could escalate tension with Trump", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T23:42:00.000+02:00", "replies_count": 0, "uuid": "3200b97922b08bcb55b57ba12b3007f323307711"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/18/reuters-america-update-4-amazons-review-of-toronto-could-escalate-tension-with-trump.html", "ord_in_thread": 0, "title": "UPDATE 4-Amazon's review of Toronto could escalate tension with Trump", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "shauna brail", "sentiment": "none"}, {"name": "jeff bezos", "sentiment": "none"}], "locations": [{"name": "amazon", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "washington post", "sentiment": "none"}, {"name": "amazon.com inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "u.s. postal service", "sentiment": "none"}, {"name": "university of toronto", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Recasts to focus on potential political repercussions for Amazon if it were to select Toronto; adds list of cities affected)\nTORONTO, Jan 18 (Reuters) - Amazon.com Inc inclusion of Canada's largest city on a list of 20 finalists for a massive new campus could escalate tensions between the tech giant and U.S. President Donald Trump.\nAmazon said on Thursday that Toronto and 19 U.S. locales made the first cut in a contest to find a second headquarters where it promises to invest $5 billion and create 50,000 jobs.\nAs it reviews Toronto, Amazon must weigh whether advantages including Canada's open immigration policy, top technical schools and universal healthcare outweigh any potential blowback from Trump, who has heavily pressured U.S. companies to invest domestically.\n\"There could be consequences politically for making a decision to invest outside of the U.S.,\" said Shauna Brail, director of the University of Toronto's urban studies program.\nTrump has already criticized Amazon and its founder Jeff Bezos, who owns the Washington Post, in tweets suggesting the U.S. Postal Service ought to raise shipping rates for the online retailer and describing the newspaper as a purveyor of fake news.\nAmazon said Thursday it expects to make a decision this year. It is unclear how choosing Toronto might affect worsening trade relations between Ottawa and Washington. Other bidders include Washington and two surrounding communities: Montgomery County, Maryland and Northern Virginia.\n\"The international politics is for Amazon to deal with,\" said Toby Lennox, CEO of Toronto Global, which submitted the bid for Toronto and surrounding cities with support of provincial and federal governments. \"We are just going to put forward our best offer possible.\"\nCanadian federal officials declined to discuss what steps the government might take to campaign on behalf of Toronto or comment on how that might affect relations between Canada and the United States.\n\"Canada is a beacon of stability, reliability and openness,\" Economic Minister Navdeep Bains said in an emailed statement. \"We offer a low-risk, business-friendly environment with the lowest business taxes and costs in the G7.\"\nAmazon is already expanding in one major Canadian city. In November unveiled plans to open a second corporate office in Vancouver, doubling staff to 2,000 by early 2020.\nThe company disclosed that it was considering boosting investment in Canada just a day after Apple's said it would boost investment in the United States. The iPhone maker promised to open a new U.S. campus, hire 20,000 people and spend $30 billion in a five-year U.S. investment plan.\nThe search for a second North American headquarters after Seattle set off a frenzied competition, with some 238 initial submitting applications, offering incentives including big tax breaks.\nToronto's bid shied away from promising tax breaks, while New Jersey offered $7 billion in financial incentives for Amazon to choose Newark. Atlanta's suburb of Stonecrest offered 345 acres of industrial land to create a new city called Amazon, making Bezos mayor for life.\nHere is the full list of candidates:\nAtlanta\nAustin, Texas\nBoston\nChicago\nColumbus, Ohio\nDallas\nDenver\nIndianapolis\nLos Angeles\nMiami\nMontgomery County, Maryland\nNashville, Tennessee\nNewark\nNew York City\nNorthern Virginia\nPhiladelphia\nPittsburgh\nRaleigh, North Carolina\nToronto\nWashington\n(Reporting by Alastair Sharp in Toronto; Additional reporting by Supantha Mukherjee and Shariq Khan in Bengalaru, Jeffrey Dastin in San Francisco; Editing by Nick Zieminski and Jim Finkle)", "external_links": [], "published": "2018-01-18T23:42:00.000+02:00", "crawled": "2018-01-20T19:03:38.043+02:00", "highlightTitle": ""}