{"organizations": [], "uuid": "01543f7f704099c4a446aa609846e3b5594bb18c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/12/104943194-GettyImages-890300868.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/12/as-cryptocurrencies-flourish-employers-hunt-for-workers-with-blockchain-skills.html", "country": "US", "domain_rank": 767, "title": "As cryptocurrencies flourish, employers hunt for workers with blockchain skills", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T17:01:00.000+02:00", "replies_count": 0, "uuid": "01543f7f704099c4a446aa609846e3b5594bb18c"}, "author": "Seema Mody", "url": "https://www.cnbc.com/2018/01/12/as-cryptocurrencies-flourish-employers-hunt-for-workers-with-blockchain-skills.html", "ord_in_thread": 0, "title": "As cryptocurrencies flourish, employers hunt for workers with blockchain skills", "locations": [], "entities": {"persons": [{"name": "chris barber", "sentiment": "none"}, {"name": "rich pearson", "sentiment": "none"}], "locations": [{"name": "upwork", "sentiment": "none"}], "organizations": [{"name": "upwork", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As the cryptocurrency universe grows, businesses are on the hunt for job candidates with experience in blockchain, the technology that supports popular digital tokens like bitcoin and ethereum.\nUpwork, a freelancing firm, says blockchain is its fastest growing skill category. In the fourth quarter 2017, it had 2,200 blockchain-related job posts, up 2,194 percent from the same period one year ago, when it only had 96 posts.\n\"We're seeing thousands of blockchain related jobs posted every month,\" Rich Pearson, senior vice president at Upwork, told CNBC. \"On average those jobs get filled about every three days.\"\nThe job listings on Upwork vary from requests for help launching cryptocurrencies to searches for consultants to help companies understand how to build prototypes or take advantage of the blockchain technology.\nAndrey Rudakov | Bloomberg | Getty Images An employee checks power supply units and cooling fans used in cryptocurrency mining machine systems at the SberBit mining 'hotel' in Moscow, Russia, on Saturday, Dec. 9, 2017.\nGetting a blockchain professional is not cheap. The hourly pay rate ranges from $50 to more than $200.\nChris Barber, 39, who previously worked at an engineering firm as a project manager but for the past year has been working as a blockchain consultant, charges $225 an hour.\n\"I thought this was a great opportunity to reinvent my career. I started charging $50/hour then due to high interest I increased my rate,\" Barber told CNBC.\nBarber is currently working with a man in Dubai who wants to build a short term rental market replacement using blockchain. He is in the process of creating a smart contract code to support this idea.\nLinkedIn has also seen a rise in bitcoin-related posts on its site as well as more people mentioning their skills in the emerging technology on their profiles.\nLinkedIn says there are now 28 times as many people citing cryptocurrency skills on their profiles and 5.5 times as many people with bitcoin skills as there were in October 2013.\nAnd from 2014 to 2017, LinkedIn has seen a 9.4-time increase in bitcoin-related postings within the financial services and insurance industry sector, as well as a 4.6-time increase for the software technology industry.\nExperts say the surge in the price of bitcoin has played an instrumental role in raising the level of interest. Coinbase, a digital currency exchange and the largest private company in the cryptocurrency industry with a reported valuation of $1 billion, doubled its headcount in 2017 to 200 employees.\nLast year the price of bitcoin soared more than 1200 percent, to nearly $20,000. But it has since traded down to around $13,000.\nStill, some prominent money managers, such as Bill Miller , have invested in digital currencies. And what was once considered a fringe phenomenon also got a bigger dose of legitimacy late last year when major derivatives exchanges introduced bitcoin futures, products that attract professional traders into the sector.\nBitcoin's price dropped a few years ago after one of the biggest exchanges was hacked and $460 million was stolen. The fear of new hacks could force another wave of negative sentiment and a selloff, says Paul Puey, the CEO of Edge, a firm that designs secure blockchain applications.\n\"Of course this would depend on unforeseen events,\" he said. But the growth of other exchanges and services around blockchain and digital currencies should blunt any negative consequences, he added.\n\"Fortunately this year we have a much much larger ecosystem of exchanges and services compared to 2013/2014, hence why even having Coinbase get compromised wouldn't have as drastic of an affect,\" Puey said. \"And as usual, after every \"correction\" is another minimum 10x price ramp. This could easily happen by end of this year or early next year.\"", "external_links": [], "published": "2018-01-12T17:01:00.000+02:00", "crawled": "2018-01-12T17:08:04.017+02:00", "highlightTitle": ""}