{"organizations": [], "uuid": "08af563695681e5a8c561dabd8362464b79385f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180101&t=2&i=1218641880&w=1200&r=LYNXMPEE0010D", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-bur-liv-klopp/van-dijk-wont-be-rushed-into-liverpool-line-up-klopp-idUKKBN1EQ169", "country": "US", "domain_rank": 408, "title": "Van Dijk won't be rushed into Liverpool line-up - Klopp", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T20:18:00.000+02:00", "replies_count": 0, "uuid": "08af563695681e5a8c561dabd8362464b79385f7"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-bur-liv-klopp/van-dijk-wont-be-rushed-into-liverpool-line-up-klopp-idUKKBN1EQ169", "ord_in_thread": 0, "title": "Van Dijk won't be rushed into Liverpool line-up - Klopp", "locations": [], "entities": {"persons": [{"name": "klopp simon evans", "sentiment": "negative"}, {"name": "klopp", "sentiment": "negative"}, {"name": "van dijk", "sentiment": "negative"}, {"name": "juergen klopp", "sentiment": "none"}, {"name": "virgil van dijk", "sentiment": "none"}], "locations": [{"name": "engla", "sentiment": "none"}, {"name": "burnley", "sentiment": "none"}, {"name": "leicester city - anfield", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "burnley", "sentiment": "none"}], "organizations": [{"name": "liverpool", "sentiment": "negative"}, {"name": "southampton", "sentiment": "none"}, {"name": "reds", "sentiment": "none"}, {"name": "everton", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 1, 2018 / 6:19 PM / Updated 9 minutes ago Van Dijk won't be rushed into Liverpool line-up - Klopp Simon Evans 3 Min Read \nBURNLEY, England (Reuters) - Liverpool manager Juergen Klopp says he is in no rush to introduce new signing Virgil van Dijk into his starting line-up, despite having completed the signing of the world’s most expensive defender early in the transfer window. Soccer Football - Premier League - Liverpool vs Leicester City - Anfield, Liverpool, Britain - December 30, 2017 Liverpool's Virgil van Dijk sits in the stands before the match REUTERS/Phil Noble \nThe transfer of the highly-rated Dutch international centre back was announced last week after the two clubs, who had failed to agree terms during acrimonious dealings in the close season, finally reached an agreement. \nLiverpool did not reveal the transfer fee but Southampton announced it was “a new world-record for a defender” with English media reporting that it was a 75 million pounds ($100.5 million) deal. \nBut with the Reds on a 16-match unbeaten run in all competitions after the 2-1 New Year’s Day win at Burnley and an FA Cup derby clash with Everton on Friday, Klopp has little time to integrate the former Celtic man into his team. \nAsked whether Van Dijk could make his debut in the third round tie at Anfield, Klopp said: ”I don’t know. We made a few tests. No rush. He is on fire, really wants but we have to make sure he can perform. \n“Centre half is a position which depends on the others in the pitch. That means you have to tune it so you work together. Pre-season is for that usually,” he added. Soccer Football - Premier League - Liverpool vs Leicester City - Anfield, Liverpool, Britain - December 30, 2017 Liverpool's Virgil Van Dijk sits in the stand Action Images via Reuters/Carl Recine \nKlopp suggested that the 26-year-old might be given more time to get used to his team mates. \n“After Friday, we have a little bit more time. It is a long-term project. It is not important when his first game (is) but how many good games he plays,” he said. \nThe Liverpool boss said that he was not surprised by the solid displays from Dejan Lovren and Ragnar Klavan, who also combined for the late winner at Turf Moor. \n“I never thought we had a defence problem or thought we need an extra player, though Virgil will help us a lot. We are fourth in the table, absolutely OK. We need to keep the distance not bigger to the teams ahead of us, if we can make it smaller then it is better,” he said. \nThe German’s options in midfield have also increased with Adam Lallana making his first start of the season at Burnley and delivering an impressive performance. \n“Outstanding. Especially after 1-0, he played really good football. He was really enjoying the game. He was really strong in the beginning, then average, then back again. Good news for all of us,” he said. Reporting by Simon Evans; Editing by Christian Radnedge", "external_links": [], "published": "2018-01-01T20:18:00.000+02:00", "crawled": "2018-01-01T20:29:56.012+02:00", "highlightTitle": ""}