{"organizations": [], "uuid": "36090f4645b2c614471e9466feade77e0b760149", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223252156&w=1200&r=LYNXMPEE0I08O", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/japan-economy-cpi/japans-december-core-inflation-likely-steady-boj-policy-seen-unchanged-idINKBN1F80GT", "country": "US", "domain_rank": 408, "title": "Japan's December core inflation likely steady, BOJ policy seen unchanged", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T08:06:00.000+02:00", "replies_count": 0, "uuid": "36090f4645b2c614471e9466feade77e0b760149"}, "author": "", "url": "https://in.reuters.com/article/japan-economy-cpi/japans-december-core-inflation-likely-steady-boj-policy-seen-unchanged-idINKBN1F80GT", "ord_in_thread": 0, "title": "Japan's December core inflation likely steady, BOJ policy seen unchanged", "locations": [], "entities": {"persons": [], "locations": [{"name": "japan", "sentiment": "none"}], "organizations": [{"name": "boj", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "oj", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 6:08 AM / Updated 12 minutes ago Japan's December core inflation likely steady, BOJ policy seen unchanged Reuters Staff 3   Japan’s consumer prices are expected to have posted a 12th straight month of gains in December, a Reuters poll found, although the persistently modest inflation will pressure the central bank to maintain its stimulus to meet its 2 percent target. \nEconomists project the Bank of Japan will keep its short-term interest rate at minus 0.1 percent and the 10-year government bond yield target at around zero percent next week, the poll showed. \nData next week also includes exports for December, which was seen growing for a 13th straight month, thanks to overseas demand for semiconductor manufacturing equipment, steel and cars. \nThe nationwide core consumer price index (CPI), which includes oil products but excludes volatile fresh food prices, likely grew 0.9 percent in December from a year ago, the same rate as November, the poll of 20 economists showed. \nEconomists say price gains in electricity and gas slowed, while those of petroleum products continued to support consumer inflation. \nAnalysts forecast core consumer prices in Tokyo, available a month before the nationwide data, rose 0.8 percent in January, also unchanged from December. \n“We expect the core CPI index will stay around the same level in the following few months,” said Yoshiki Shinke, chief economist a t Dai-ichi Life Research Institute. \n“Oil prices and an annual wage negotiations in spring will be closely watched for the outlook for consumer information.” \nPrime Minister Shinzo Abe has been pushing Japanese companies to raise wages by 3 percent or more to support consumer spending, thus encouraging inflation. \nThe internal affairs ministry will announce consumer prices data at 8:30 a.m. Tokyo time on Jan. 26 (2330 GMT on Jan. 25) \nThe poll showed exports grew 10.1 percent in December compared with a year ago, up for 13 straight month but the expected pace of growth is slower than 16.2 percent in November. \nImports were expected to show a 12.3 percent increase, which would make trade surplus at 530.0 billion yen ($4.78 billion), the poll showed. \n“Exports continued to grow but recovery in domestic demand and rises in import costs due to higher oil prices shrank trade surplus,” said Takumi Tsunoda, senior economist at Shinkin Central Bank Research Institute. \nThe finance ministry will release trade data at 8:50 a.m. on Jan. 24 (2350 GMT on Jan. 23). \nThe BOJ is set to maintain upbeat price forecasts next week and paint a slightly better picture of the economy than it did three months ago, signalling its conviction the country is making slow but steady progress in eradicating deflation. \n($1 = 110.8700 yen)", "external_links": [], "published": "2018-01-19T08:06:00.000+02:00", "crawled": "2018-01-19T08:22:46.020+02:00", "highlightTitle": ""}