{"organizations": [], "uuid": "77e0290d7682569e7a270f455cc6c8febd5d87b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224182483&w=1200&r=LYNXMPEE0L1DT", "site_section": "http://feeds.reuters.com/reuters/UKOddlyEnoughNews/", "section_title": "Reuters: Oddly Enough", "url": "https://uk.reuters.com/article/us-saudi-camels/prize-camels-keep-tradition-alive-in-changing-saudi-but-please-no-botox-idUKKBN1FB1WL", "country": "US", "domain_rank": 408, "title": "Prize camels keep tradition alive in changing Saudi, but please no Botox!", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T17:06:00.000+02:00", "replies_count": 0, "uuid": "77e0290d7682569e7a270f455cc6c8febd5d87b7"}, "author": "", "url": "https://uk.reuters.com/article/us-saudi-camels/prize-camels-keep-tradition-alive-in-changing-saudi-but-please-no-botox-idUKKBN1FB1WL", "ord_in_thread": 0, "title": "Prize camels keep tradition alive in changing Saudi, but please no Botox!", "locations": [], "entities": {"persons": [{"name": "stephen kalin", "sentiment": "none"}, {"name": "fawzan al-madi", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 2:57 PM / Updated 32 minutes ago Prize camels keep tradition alive in changing Saudi, but please no Botox! Stephen Kalin 3 Min Read \nAL-RUMAHIYA, Saudi Arabia (Reuters) - The dromedaries paraded down a dusty racetrack as judges rated the size of their lips, cheeks, heads and knees. Crowds of men watched from the bleachers, hooting when the beasts representing their own tribe loped down the track. \nA dozen beasts have been disqualified from this year’s Saudi “camel beauty contest” because their handlers used Botox to make them more handsome. \n“The camel,” explained the chief judge of the show, Fawzan al-Madi, “is a symbol of Saudi Arabia. We used to preserve it out of necessity, now we preserve it as a pastime.” \nMuch is changing in Saudi Arabia: the country is getting its first movie theaters. Soon women will be permitted to drive. The authorities eventually hope to diversify the economy away from the oil that has been its lifeblood for decades. \nBut as they seek to transform the conservative kingdom, the Saudi authorities are trying to smooth the path for reform by emphasizing traditional aspects of their culture. And for the Bedouin of Arabia, nothing is more essential than the camel, used for centuries for food, transport, as a war machine and companion. A man cheers as he rides a camel during King Abdulaziz Camel Festival in Rimah Governorate, north-east of Riyadh, Saudi Arabia January 19, 2018. Picture taken January 19, 2018. REUTERS/Faisal Al Nasser \nSo, the authorities have ramped up the country’s annual month-long camel festival, which was relocated last year from the remote desert to the outskirts of the capital. On a rocky desert plateau, the government has erected a permanent venue to host the headline events: races and show competitions with combined purses of 213 million riyals. ($57 million) \nThe pavilion features an auction where top camels can fetch millions of riyals. Slideshow (9 Images) \nThere are food stalls and souvenir shops, a petting zoo featuring the world’s tallest and shortest camels, a museum with life-size sand sculptures of camels, tents for tasting camel’s milk and viewing camel-hair textiles, and a planetarium showing how Arabs rode camels through the desert guided by the stars. \nOrganizers say this “heritage village” will expand in coming years as Crown Prince Mohammed bin Salman - who is heir to the throne, defense minister and head of oil and economic policy - takes the reins through a newly-created official Camel Club established by royal decree last year. \nHalfway through this year’s festival, attendance is up about a third from last year, with about 300,000 people making the 1-1/2 hour trip from Riyadh so far, said Fahd al-Semmari, a Camel Club board member. \n“The vision is for the (festival) to become a global, pioneering forum for all classes of people to come for entertainment, knowledge and competition.” Reporting by Stephen Kalin; Editing by Peter Graff", "external_links": [], "published": "2018-01-22T17:06:00.000+02:00", "crawled": "2018-01-22T17:45:10.002+02:00", "highlightTitle": ""}