{"organizations": [], "uuid": "a6c8988abb9e6d6253268d20ebde8654d4bf174d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221896412&w=1200&r=LYNXMPEE0D09T", "site_section": "http://feeds.reuters.com/reuters/UKCricketNews/", "section_title": "Reuters: Cricket News", "url": "https://uk.reuters.com/article/uk-cricket-odi-aus-eng/roy-smashes-180-as-england-win-by-five-wickets-in-melbourne-idUKKBN1F30GK", "country": "US", "domain_rank": 408, "title": "Cricket-Roy smashes 180 as England win by five wickets in Melbourne", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T13:46:00.000+02:00", "replies_count": 0, "uuid": "a6c8988abb9e6d6253268d20ebde8654d4bf174d"}, "author": "", "url": "https://uk.reuters.com/article/uk-cricket-odi-aus-eng/roy-smashes-180-as-england-win-by-five-wickets-in-melbourne-idUKKBN1F30GK", "ord_in_thread": 0, "title": "Cricket-Roy smashes 180 as England win by five wickets in Melbourne", "locations": [], "entities": {"persons": [{"name": "roy", "sentiment": "negative"}, {"name": "jason roy", "sentiment": "none"}, {"name": "alex hales", "sentiment": "none"}, {"name": "joe root", "sentiment": "none"}, {"name": "david warner", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "melbourne    melbourne", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "melbourne cricket ground", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 11:53 AM / Updated 7 hours ago Roy smashes 180 as England win by five wickets in Melbourne Reuters Staff 3 Min Read \nMELBOURNE (Reuters) - Opener Jason Roy smashed England’s highest individual score in one-day internationals to guide his side to a comfortable five-wicket victory against Australia in the opening match of the series at the Melbourne Cricket Ground on Sunday. England captain Joe Root celebrates with teammates after the dismissal of Australia's David Warner during the one-day international match at Melbourne Cricket Ground in Melbourne, Australia, January 14, 2018. AAP/Joe Castro/via REUTERS \nThe 27-year old hit 180 and combined in a third-wicket stand of 221 with test skipper Joe Root, who made an unbeaten 91, to make the seemingly steep 305-run chase look easy and help England to their first win on the tour. \nRoy surpassed team mate Alex Hales’s previous ODI best of 171 during his 151-ball knock as England cruised home with seven balls to spare in a morale-boosting victory, after a demoralising 4-0 loss in the Ashes tests. \nAfter being put in to bat in the opening ODI of the five-match series, Australia opener Aaron Finch compiled his ninth hundred in the 50-over format to help the hosts to a total of 304 for eight. \nYet the target proved insufficient as Roy hit 16 fours and five sixes in a belligerent knock, his fourth ODI hundred. \nRoy, who celebrated his century with a leap in the air, reached fifty in 32 balls and gave England a rollicking start in their chase with an opening stand of 53 with Jonny Bairstow in under five overs. England's Mark Wood celebrates after dismissing Australia's David Warner during the one-day international match at Melbourne Cricket Ground in Melbourne, Australia, January 14, 2018. AAP/Joe Castro/via REUTERS \nEngland stuttered a bit after fast bowler Mitchell Starc dismissed Roy, with the touring side also losing captain Eoin Morgan and Jos Buttler soon after. Root, however, remained unbeaten to take them home. \nAustralia had earlier lost David Warner for two to a fast and sharply-rising delivery from paceman Mark Wood while in-form skipper Steve Smith (23) and Travis Head also fell cheaply as the hosts were reduced to 78-3 in the 14th over. England's wicket keeper Jos Buttler celebrates with team mate Joe Root after taking a catch to dismiss Australia's Steve Smith during the one-day international match at Melbourne Cricket Ground in Melbourne, Australia, January 14, 2018. AAP/Joe Castro/via REUTERS \nFinch, who hit 10 fours and three sixes in his 107, and all-rounder Mitchell Marsh then gave Australia a platform to build on with a stand of 118. \nFinch and Marsh, who made 50, fell in quick succession and it was left to Marcus Stoinis and Tim Paine to provide Australia’s late assault and give them a defendable total. \nStoinis smashed 60 in 40 balls while Paine contributed a useful 27 as the pair added 80 for the sixth wicket to help the hosts get past the 300-run mark. \nBrisbane will host the second match of the series on Friday. Reporting by Sudipto Ganguly in Mumbai; editing by Toby Davis", "external_links": [], "published": "2018-01-14T13:46:00.000+02:00", "crawled": "2018-01-14T14:00:07.079+02:00", "highlightTitle": ""}