{"organizations": [], "uuid": "a10d8f5a72284e15084b3d0c69dda3265f842c51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-bonti-announces-close-of-15-point-5-million-series-c-funding-and-appointment-of-david-ramsay-as-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "Bonti Announces Close of $15.5 Million Series C Funding and Appointment of David Ramsay as Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T16:44:00.000+02:00", "replies_count": 0, "uuid": "a10d8f5a72284e15084b3d0c69dda3265f842c51"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-bonti-announces-close-of-15-point-5-million-series-c-funding-and-appointment-of-david-ramsay-as-chief-financial-officer.html", "ord_in_thread": 0, "title": "Bonti Announces Close of $15.5 Million Series C Funding and Appointment of David Ramsay as Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "musculoske", "sentiment": "negative"}, {"name": "david ramsay", "sentiment": "negative"}, {"name": "bonti", "sentiment": "negative"}], "locations": [{"name": "newport beach", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "fda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Latest Financing to Enable Continued Clinical Development of Lead Product EB-001 to Treat Musculoskeletal Pain\nNEWPORT BEACH, Calif.--(BUSINESS WIRE)-- Bonti, a privately-held, clinical-stage biotechnology company, today announced it successfully closed a $15.5 million Series C financing, bringing the cumulative investment in the Company to over $36 million. Capital from the round will be used to continue developing EB-001, a unique botulinum neurotoxin, for its targeted therapeutic and aesthetic indications with significant addressable unmet needs in patients. In conjunction with this funding and in preparation for the rest of 2018 and beyond, the Company also announced the appointment of David Ramsay as Chief Financial Officer (CFO).\nFunds from the latest round are expected to enable completion of an ongoing first Phase 2 pain study, LANTERN-1 ( L ong- A cting N euro T oxin- E R elief, N on-opioid), initiation and completion of a second Phase 2 pain study (LANTERN-2) and preparing for an End of Phase 2 FDA meeting. The Series C proceeds will also be used for market research and for working capital.\nIn addition, Bonti will be appointing David Ramsay as Chief Financial Officer, effective February 2018. Mr. Ramsay is currently a Bonti director and was formerly CFO at Halozyme Therapeutics, Inc. (NASDAQ: HALO), where he was responsible for leading the finance, accounting, reporting, tax, treasury, investor relations, information technology and commercial organizations. He was part of the management team that helped guide the company through the successful development and commercialization of its first products.\n“We’re grateful both to our new investors who joined this funding round and to our existing investors who participated in this financing,” remarked Fauad Hasan, CEO and co-founder. “As happened in our previous fundraising efforts, participation in this round exceeded our Series C target, highlighting the strong interest and excitement for Bonti’s vision, for our rapid progress to date and for our team. We plan to continue executing effectively to exceed major development milestones and to briskly advance the pipeline for our lead candidate, EB-001, in 2018.” He added, “It’s also tremendously exciting to welcome David Ramsay to our senior management team. We eagerly anticipate leveraging his vast knowledge and experience to help propel our enterprise forward.”\n“There remains an urgency to find novel, non-narcotic alternatives to treat pain to help combat the devastating opioid epidemic raging in the United States currently,” commented Jonathan Lim, M.D., Chairman and co-founder of Bonti and Managing Partner of City Hill Ventures, LLC, which led this Series C investment round. “Investments and innovation are critical to advance development of new therapies, such as Bonti’s EB-001, to provide patients and healthcare providers better healthcare options for post-surgical pain and other unmet needs. It is a privilege to be part of this effort to foster the development of this unique neuromodulator platform with transformative potential for patients.”\nAbout EB-001\nBonti’s lead product candidate, EB-001, is an investigational botulinum neurotoxin serotype E (BoNT/E). EB-001 has a mechanism of action similar to the marketed botulinum neurotoxin serotype A (BoNT/A) products though it has a differentiated clinical profile. EB-001 has a fast onset of action (within 24 hours) and a short duration of effect (about 3 – 4 weeks). Currently marketed BoNT/A products have an onset of action around 3 – 7 days and a duration of effect around 3 – 4 months. The unique target clinical profile of EB-001 may be well suited for a vast range of aesthetic and therapeutic uses, including for the treatment of post-surgical and non-surgical musculoskeletal pain, with currently unmet needs.\nAbout Bonti\nBonti, based in Newport Beach, California, is a rapidly emerging biotechnology company founded by world class neurotoxin experts with proven prior success at Allergan. This team, with deep neurotoxin, aesthetic and pain expertise, is uniquely qualified to develop treatment paradigms driven by a novel neurotoxin platform designed to become an innovative leader in both aesthetic and therapeutic markets. By turning the science of neurotoxins into beneficial patient and healthcare provider solutions, Bonti seeks to improve lives by successfully addressing key unmet needs in markets with significant addressable opportunities.\nFor more information, please visit http://bonti.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123005911/en/\nBonti\nOrlando Rodrigues\nMedia Relations\n760.212.5727\norlando@bonti.com\nSource: Bonti", "external_links": ["http://www.businesswire.com/news/home/20180123005911/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fbonti.com&esheet=51747466&newsitemid=20180123005911&lan=en-US&anchor=http%3A%2F%2Fbonti.com&index=1&md5=744c84c81c3f5a9a7d04b4e5d3e0a9f9"], "published": "2018-01-23T16:44:00.000+02:00", "crawled": "2018-01-23T17:45:17.003+02:00", "highlightTitle": ""}