{"organizations": [], "uuid": "907ca792a3f53d65b2e06370e56bb391ea658a3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/europe-stocks/live-markets-what-you-need-to-know-idUSL8N1PE15I", "country": "US", "domain_rank": 408, "title": "LIVE MARKETS-What you need to know", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T15:51:00.000+02:00", "replies_count": 0, "uuid": "907ca792a3f53d65b2e06370e56bb391ea658a3f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/europe-stocks/live-markets-what-you-need-to-know-idUSL8N1PE15I", "ord_in_thread": 0, "title": "LIVE MARKETS-What you need to know", "locations": [], "entities": {"persons": [{"name": "danilo masoni", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "carpetright", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "epfr global", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* European shares seen lower at end of directionless week * In Asia, stocks brush off Wall St losses * China economy grew faster than expected in Q4 Jan 19 (Reuters) - Welcome to the home for real time coverage of European equity markets brought to you by Reuters stocks reporters and anchored today by Danilo Masoni. Reach him on Messenger to share your thoughts on market moves: danilo.masoni.thomsonreuters.com@reuters.net WHAT YOU NEED TO KNOW (0750 GMT) European shares are expected to open little changed at the end of a directionless week that has seen the top pan-regional STOXX 600 benchmark steady around a 2 ½ year peak as confidence over economic and earnings growth helped consolidate a strong start of the year. In spite of the flat weekly performance EPFR Global said it was a good week for European equity funds with inflows into Sweden and the UK more than offsetting outflows from France and Italy. Futures were last up 0.1 percent. On the corporate front earnings are in focus. In the UK shares in Carpetright and Dignity could be heavily hit after both groups issued a profit warning, while French spirits group Remy Cointreau are seen rising after like-for-like sales growth slowed to 3.2 percent but topped expectations. For other possible stock movers see the post below on overnight headlines. (Danilo Masoni) **** OVERNIGHT HEADLINES (0744 GMT) Nestle nominates three board directors to help advance strategy Deutsche Bank CEO says overhaul will take time UK's Carpetright warns on profit after post-Christmas sales fall Software AG takes hit on U.S. tax reform Peugeot CEO: UK plants uncompetitive,open to S.America alliance British Land names Simon Carter as next CFO BASF says 2017 adjusted EBIT up 32 percent on basic chemicals UK's esure CEO steps down, finance chief at helm in interim Thyssenkrupp CEO says will sharpen strategy - Handelsblatt Daimler, Bosch hit by walkouts in sector-wide labour dispute Airbus says supplier bottlenecks easing as deliveries rise HSBC to pay $100 mln to settle U.S. probe into currency rigging TF1 announces deal to buy Aufeminin From Springer Late timing of Chinese New Year weighs on Remy Cointreau Q3 At AstraZeneca, fewer drug projects bring big productivity jump Italy's Geox to name top Gucci executive as new CEO (Tom Pfeiffer) EUROPE'S STOCK FUTURES FLAT (0710 GMT) Futures have opened with marginal gains in Europe, reversing earlier indications from spreadbetters for a dip. Both however suggest the market is lacking of clear direction and could move sideways through the session. (Danilo Masoni) \"IT WAS A GOOD WEEK FOR EUROPE EQUITY FUNDS\" (0640 GMT) That's what Cameron Brandt, Research Director at EPFR Global, said in his latest weekly update on fund flows. The positive week came despite the broader European market was little changed in percentage terms with the STOXX 600 up less than 0.1 percent so far this week. At the country level there were divergences: \"flows into Sweden and UK Equity Funds hit 12 and 39-week highs while France Equity Funds saw their three-week inflow streak snapped and Italy Equity Funds experienced net redemptions for the 11th time in the past 12 weeks,\" he added. On sectors globally, cyclicals dominated. Financials, Industrials and Technology Sector Funds all took in over $600 million during the week ending Jan. 17 while Real Estate Sector Funds recorded their biggest outflow since late October, he said. (Danilo Masoni)", "external_links": [], "published": "2018-01-19T15:51:00.000+02:00", "crawled": "2018-01-19T14:24:17.046+02:00", "highlightTitle": ""}