{"organizations": [], "uuid": "328c9f43ed1c4adf1d5baeeab6b1ad01cd53b41c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221125103&w=1200&r=LYNXMPEE0A0W2", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-usa-stocks/futures-pick-up-as-bond-market-worries-ease-idUSKBN1F01JX", "country": "US", "domain_rank": 408, "title": "Futures pick up as bond market worries ease", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T14:39:00.000+02:00", "replies_count": 0, "uuid": "328c9f43ed1c4adf1d5baeeab6b1ad01cd53b41c"}, "author": "", "url": "https://www.reuters.com/article/us-usa-stocks/futures-pick-up-as-bond-market-worries-ease-idUSKBN1F01JX", "ord_in_thread": 0, "title": "Futures pick up as bond market worries ease", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "shankar", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "futures", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "exxon mobil", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "chevron", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Wall Street closed at record highs on Thursday as rising oil prices lifted energy stocks and investors bet on a strong U.S. corporate earnings season. \nThe S&P energy sector .SPNY closed up 2 percent as Brent crude LCOc1 went above $70 a barrel for the first time since December 2014, boosted by a surprise drop in U.S. production and lower crude inventories. \nThe consumer discretionary sector .SPLRCD saw strong gains in media and retail stocks, while the industrials index .SPLRCI was helped by airlines after news from No. 2 U.S. carrier Delta Air Lines ( DAL.N ). \n“The unifying factor of today’s move and this whole week is a heightened confidence in the pace of economic activity. That helps explain the demand picture, which has oil up at $70,” said Scott Clemons, chief investment strategist at Brown Brothers Harriman in New York. \nThe Dow Jones Industrial Average .DJI rose 205.6 points, or 0.81 percent, to 25,574.73, the S&P 500 .SPX gained 19.33 points, or 0.70 percent, to 2,767.56 and the Nasdaq Composite .IXIC added 58.21 points, or 0.81 percent, to 7,211.78. \nWall Street had dropped on Wednesday, the first daily decline for S&P and Nasdaq in 2018, after a report China would slow U.S. government bond purchases and a report that U.S. President Donald Trump would end a key trade agreement. \nThe major indexes pared gains briefly in late afternoon trading on Thursday after New York Fed President William Dudley said tax cuts could lead to economic overheating. He predicted above-trend GDP growth with rising inflation in 2018. \n“Dudley is touching on something that investors should fear,” said Brian Battle, director of trading at Performance Trust Capital Partners in Chicago. “The only threat to the stock market right now is high interest rates. If rates are higher, the present value of equities are too high.” \nInvestors are betting on bullish quarterly earnings reports from big companies and details on savings from federal tax cuts. The reporting season kicks off in earnest on Friday, with results from the big U.S. banks JPMorgan Chase & Co ( JPM.N ) and Wells Fargo & Co ( WFC.N ). \nEarnings for S&P 500 companies are expected to have increased by 11.8 percent in the recently-ended quarter, with the biggest gain from the energy sector, according to Thomson Reuters I/B/E/S. \n“This market feels this week like a deep breath before the onslaught of earnings reports,” Clemons said. “This is a wait-and-see mode with a healthy amount of optimism.” \nDelta Air Lines ( DAL.N ) shares closed up 4.8 percent at $58.52 after it predicted a double benefit from the U.S. corporate tax cut - savings on its own bill and an uptick in business travel as companies to spend tax savings. It also reported an upbeat quarterly profit. \nDelta helped the Dow Jones U.S. Airlines index .DJUSAR close up 4.2 percent. The Dow Jones Transport index .DJT rose 2.3 percent - its biggest one-day percentage gain since Nov. 29. \nAdvancing issues outnumbered declining ones on the NYSE by a 3.40-to-1 ratio; on Nasdaq, a 3.18-to-1 ratio favored advancers. \nThe S&P 500 posted 107 new 52-week highs and 8 new lows; the Nasdaq Composite recorded 176 new highs and 18 new lows. \nOn U.S. exchanges 6.74 billion shares changed hands, above the 6.39 billion average for the last 20 trading days. \nAdditional reporting by Sruthi Shankar in Bengaluru; Editing by Leslie Adler and Nick Zieminski\n ", "external_links": [], "published": "2018-01-11T14:39:00.000+02:00", "crawled": "2018-01-11T14:53:02.049+02:00", "highlightTitle": ""}