{"organizations": [], "uuid": "14a2d162c738da09de437f5d5e0236a55283b65b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/china-yuan-internationalisation/signs-point-to-revival-in-international-use-of-chinas-yuan-idUSL4N1P71VA", "country": "US", "domain_rank": 408, "title": "Signs point to revival in international use of China's yuan", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T09:25:00.000+02:00", "replies_count": 0, "uuid": "14a2d162c738da09de437f5d5e0236a55283b65b"}, "author": "", "url": "https://www.reuters.com/article/china-yuan-internationalisation/signs-point-to-revival-in-international-use-of-chinas-yuan-idUSL4N1P71VA", "ord_in_thread": 0, "title": "Signs point to revival in international use of China's yuan", "locations": [], "entities": {"persons": [{"name": "michelle chen", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "bundesbank", "sentiment": "none"}, {"name": "il&fs transportation networks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 26 AM / Updated 19 minutes ago Signs point to revival in international use of China's yuan Reuters Staff \n* Signs include first offshore yuan bond sale in over a year \n* Yuan deposits in Hong Kong are highest in a year \n* German central bank says to place some reserves in yuan \n* Chinese currency is rallying, hits two-year peak \n* No fresh Beijing push on internationalisation of yuan-sources \nBy Michelle Chen \nHONG KONG, Jan 23 (Reuters) - The sale of a 900-million-yuan ($140 million) offshore bond has added to signs that the international use of the Chinese currency is recovering after several years in the doldrums. \nThe bond issue by India’s IL&FS Transportation Networks was the first sale of a high-yield offshore yuan bond in more than a year. \nYuan deposits in Hong Kong, the biggest offshore centre for the Chinese currency, are their highest in a year and Germany’s central bank, the Bundesbank, said it is looking to place some of its reserves in yuan, one of the first central banks outside of Asia to make such a move. \nThe signs are emerging as the yuan continues to rally, rising this month to its strongest against the dollar in more than two years. Broader trends, including China’s ambitious Belt and Road project to build an economic superhighway across Asia and beyond, are supporting the currency’s internationalisation, analysts and Chinese officials say. \n“This high-yield dim sum bond issuance is a sign which shows the offshore yuan market has started to recover after backsliding for two years,” said Liao Qun, China chief economist at Citic Bank International in Hong Kong. \n“Negative factors that hindered the internationalisation process, such as strong yuan depreciation expectations, have been cleared and now it’s time to see this process gaining momentum again,” Liao said. \nTo be sure, sources in China involved in internal discussions of policy but who are not part of the decision-making process, said there was no sense of urgency in Beijing to push forward the yuan’s internationalisation, the name given to the process under which China permits increased use of the closely controlled currency outside China. \n“We will follow the tide,” said a policy source, who declined to be identified. “We won’t push it forward too forcefully. This will be a long process.” \nIn 2015, interest in the yuan offshore collapsed after China’s dramatic intervention to head off a financial crisis as its stock markets crashed. Regulators tightened China’s financial borders to stop a flood of capital flowing out of the country. The outflows were brought under control in 2017, and they are growing once again. \nIL&FS, an Indian infrastructure firm, completed the sale of its three-year yuan bond earlier this month priced to yield 8 percent. Order books for the bond reached more than 2 billion yuan, underscoring strong demand for the asset. \n“Demand for dim sum bonds is increasing as the yuan has been gaining growth momentum, so it’s good timing for companies which need to raise funds in this market,” said Chao Li, a director of Standard Chartered’s Asia Bond Syndicate, which was involved in the deal. \nYuan deposits in Hong Kong, the biggest offshore yuan hub, rose to 559.2 billion yuan in November, their highest since November 2016, while cross-border yuan trade settlement hit a 17-month high, Hong Kong Monetary Authority data shows. \nAnalysts said more broadly, China’s Belt and Road project will help support more use of the yuan. Yin Yong, a vice-governor of the People’s Bank of China, was quoted on Jan. 15 by Xinhua as saying that the Belt and Road initiative was providing strategic opportunities for yuan internationalisation. \nNathan Chow, an analyst at DBS in Hong Kong, said many Belt and Road projects are expected to “step up pace, which will benefit the yuan’s internationalisation.” \nThe central bank also introduced measures this month to encourage companies to increase their use of yuan for settling cross-border trade deals and support foreigners’ use of the currency for direct investments in China. \nHowever, the China policy sources said they don’t expect any significant relaxation of capital controls on currency flows, which would limit any offshore growth in the currency’s availability. \nThe yuan rose 6.8 percent against the U.S. dollar in 2017, its best annual performance since 2008, reversing three straight years of depreciation. \nChina International Capital Corporation (CICC) has forecast that the yuan would rise this year to 6.28 per dollar. On Tuesday it fetched around 6.4 per dollar. ($1=6.4 yuan) Reporting by Michelle Chen; Editing by Neil Fullick", "external_links": [], "published": "2018-01-23T09:25:00.000+02:00", "crawled": "2018-01-23T09:48:29.006+02:00", "highlightTitle": ""}