{"organizations": [], "uuid": "04a1f2f7c52f3a2ec1e8b57948c84de7facb29d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-tmac-resources-appoints-jason-neal-as-president-and-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "TMAC Resources Appoints Jason Neal as President and Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:01:00.000+02:00", "replies_count": 0, "uuid": "04a1f2f7c52f3a2ec1e8b57948c84de7facb29d9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-tmac-resources-appoints-jason-neal-as-president-and-chief-executive-officer.html", "ord_in_thread": 0, "title": "TMAC Resources Appoints Jason Neal as President and Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "jason neal", "sentiment": "negative"}, {"name": "terry macgibbon", "sentiment": "none"}, {"name": "jason", "sentiment": "none"}, {"name": "macgibbon", "sentiment": "none"}], "locations": [{"name": "toronto", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "hope bay", "sentiment": "none"}], "organizations": [{"name": "tmac resources", "sentiment": "negative"}, {"name": "tmac resources inc.", "sentiment": "negative"}, {"name": "bmo capital markets", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "tmac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO--(BUSINESS WIRE)-- TMAC Resources Inc. (TSX:TMR) (“ TMAC ” or the “ Company ”) is pleased to announce the appointment of Jason Neal as President and Chief Executive Officer of the Company effective February 15, 2018.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180116005645/en/\nTMAC Resources Appoints Jason Neal as President and Chief Executive Officer (Photo: Business Wire)\nTerry MacGibbon, Executive Chairman of TMAC, stated, “Over the past several months we have been building out and adding great talent to the Company’s executive, management and operational teams. We are extremely pleased to welcome Jason Neal to TMAC as our new President and Chief Executive Officer and to the Company’s Board of Directors. I will continue in the role of Executive Chairman and look forward to assisting and mentoring Jason and the entire TMAC team to grow the Hope Bay project into Canada’s next great gold mining district.”\nMr. MacGibbon went on to say, “Jason is joining us from BMO Capital Markets, where he has been Co-Head and Managing Director of the Global Metals & Mining Group. In his 21 years working with BMO he has advised companies globally in our industry on growth and financing strategies as well as lead the teams which have executed such initiatives. He has built and manages a large team of professionals and has participated in the management of Investment & Corporate Banking more broadly at BMO Capital Markets. I have known and worked closely with Jason over the past 15 years and have great respect for his team building, management and analytical skills and am most excited about Jason bringing his energy, strategic thinking and discipline to TMAC as we continue to grow the Company. Jason will have overall responsibility for our strategic planning, vision, growth, leadership and ensuring that we effectively carry out strategic plans approved by the Board. He will ensure that we have appropriate policies and programs to provide for safe, effective operations that drive sustainable value for all of our stakeholders and also ensure that we maintain and grow our great relationship with the Kitikmeot Inuit Association and the territory of Nunavut. Jason will lead the development and production of our second mine at Madrid and our third mine at Boston, as well as pursue appropriate strategic growth initiatives in the future.”\nJason Neal, stated, “I am excited to be joining Terry, the TMAC Board and the entire TMAC team, which has already accomplished so much since going public in 2015. I have been involved with the Hope Bay project since the late 1990’s as an investment banker during the Miramar, Newmont and TMAC eras, including leading TMAC’s IPO team in 2015, and now look forward to dedicated focus as CEO. The Hope Bay project is one of Canada’s most prospective and under-explored gold belts and I look forward to leading TMAC’s accomplished team to make it Canada’s next great gold mining district.”\nJason Neal is a veteran mining investment banker, having joined BMO Capital Markets at the start of 1997 after graduating from Simon Fraser University with a Bachelor of Business Administration, and working his entire career focused exclusively on the metals and mining industry. Jason was promoted to Co-Head and Managing Director of the Global Metals and Mining Group in 2010, providing leadership to a team operating in offices located in Toronto, Vancouver, London, New York, Beijing and Melbourne.\nABOUT TMAC RESOURCES\nTMAC holds a 100% interest in Hope Bay located in the Kitikmeot region of Nunavut, Canada. TMAC is an emerging gold producer with the Doris mine pouring first gold in the first quarter of 2017 and achieving commercial production in the second quarter of 2017. The Madrid and Boston properties are expected to commence production in 2020 and 2022, respectively. The Company has an experienced, expert board of directors combined with exploration, development and operating teams with extensive track records of discovering, developing and operating high grade, profitable underground mines. TMAC’s shares trade on the Toronto Stock Exchange under the trading symbol TMR.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116005645/en/\nTMAC Resources Inc.\nTerry MacGibbon, 416-628-0216\nExecutive Chairman\nor\nAnn Wilkinson, 416-628-0216\nVice President, Investor Relations\nwww.tmacresources.com\nor\nRenmark Financial Communications Inc.\nDaniel Gordon, 416-644-2020 or 514-939-3989\ndgordon@renmarkfinancial.com\nwww.renmarkfinancial.com\nSource: TMAC Resources Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.tmacresources.com&esheet=51743441&lan=en-US&anchor=www.tmacresources.com&index=1&md5=a77ec4f1b966c6d6fd440c2e8226984b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.renmarkfinancial.com&esheet=51743441&lan=en-US&anchor=www.renmarkfinancial.com&index=2&md5=20dfa49f37aa8077bea429bc73dd6bc3", "http://www.businesswire.com/news/home/20180116005645/en/"], "published": "2018-01-16T14:01:00.000+02:00", "crawled": "2018-01-16T17:06:47.004+02:00", "highlightTitle": ""}