{"organizations": [], "uuid": "a2cb914e6a9ac53a08ea140a3096ade359355907", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/new-jersey-nuclear-subsidies/n-j-stops-fast-track-pursuit-of-nuclear-subsidy-bill-for-now-idUSL1N1OZ1U8", "country": "US", "domain_rank": 408, "title": "N.J. stops fast-track pursuit of nuclear subsidy bill, for now", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T23:58:00.000+02:00", "replies_count": 0, "uuid": "a2cb914e6a9ac53a08ea140a3096ade359355907"}, "author": "", "url": "https://www.reuters.com/article/new-jersey-nuclear-subsidies/n-j-stops-fast-track-pursuit-of-nuclear-subsidy-bill-for-now-idUSL1N1OZ1U8", "ord_in_thread": 0, "title": "N.J. stops fast-track pursuit of nuclear subsidy bill, for now", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 9:59 PM / in 10 minutes N.J. stops fast-track pursuit of nuclear subsidy bill, for now Reuters Staff 3 Min Read \nJan 4 (Reuters) - * A bill to subsidize New Jersey’s nuclear power plants that could have cost ratepayers about $300 million a year was abandoned in the state legislature late Wednesday, according to organizations interested in the plan. \n* Assembly Speaker Vincent Prieto, a Democrat, decided not to advance the bill, which was designed to stop the reactors from retiring early in the current low power and natural gas price environment. \n* The reactors in question include Public Service Enterprise Group Inc’s Salem and Hope Creek plants in New Jersey, which PSEG said it might be forced to close in a couple of years if it does not receive some kind of assistance \n* After a joint legislative committee voted unanimously to support the bill on Dec. 20, which was introduced earlier in the month, some energy analysts thought the state legislature would pass it during the ongoing lame duck session and New Jersey Governor Chris Christie, a Republican, would sign it into law before he leaves office on Jan. 16. \n* The Natural Resources Defense Council, an environmental group and opponent of the bill, said in a statement on Thursday that Prieto’s move provides Governor-elect Phil Murphy, a Democrat, the opportunity to develop an energy plan that will increase investment in energy efficiency and renewables, while keeping the state’s nuclear plants running. \n* PSEG said in a statement on Thursday that it “will continue to educate New Jersey’s legislators and policymakers on the economic threat facing the nuclear plants that serve our state.” \n* New Jersey is one of several states exploring ways to keep reactors in service to preserve carbon-free energy, jobs and taxes as cheap and abundant gas from shale fields keep power prices low, making it less profitable or even unprofitable for generators to keep the units operating. \n* Ohio, Pennsylvania and Connecticut have also considered proposals to protect reactors. In 2016, New York and Illinois adopted rules to subsidize some reactors in danger of closing \n* PSEG has said economic studies show the loss of its plants would result in $400 million a year in higher electricity rates, 14 million tons a year of additional air pollution and the loss of 5,800 or more jobs (Reporting by Scott DiSavino; editing by Jonathan Oatis)", "external_links": [], "published": "2018-01-04T23:58:00.000+02:00", "crawled": "2018-01-05T00:13:03.004+02:00", "highlightTitle": ""}