{"organizations": [], "uuid": "e871a6ab4aacb17de65493bd074ae122a4acd21a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/europe-stocks/live-markets-carillion-peers-rise-idUSL8N1PA20V", "country": "US", "domain_rank": 408, "title": "LIVE MARKETS-Carillion peers rise", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T17:49:00.000+02:00", "replies_count": 0, "uuid": "e871a6ab4aacb17de65493bd074ae122a4acd21a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/europe-stocks/live-markets-carillion-peers-rise-idUSL8N1PA20V", "ord_in_thread": 0, "title": "LIVE MARKETS-Carillion peers rise", "locations": [], "entities": {"persons": [{"name": "kier", "sentiment": "none"}, {"name": "kit rees", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "kier group", "sentiment": "none"}, {"name": "ubs", "sentiment": "none"}, {"name": "serco", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* European stocks slip * Carillion suspended * Metso drops after profit warning Jan 15 (Reuters) - Welcome to the home for real time coverage of European equity markets brought to you by Reuters stocks reporters and anchored today by Kit Rees. Reach her on Messenger to share your thoughts on market moves: kit.rees.thomsonreuters.com@reuters.net CARILLION PEERS RISE (0938 GMT) Shares in UK's Carillion are suspended, and in terms of sector fallout it's interesting to note that peers Interserve and Serco in the business support services sector are up 1.9 percent and 4.6 percent respectively. Also Kier Group, which has a JV with Carillion on HS2 and the smart motorways programme, has said it does not expect to see an adverse financial impact from these JV contracts. Kier's shares are up 1.4 percent at a session high. Some analysts are not expecting a big impact on the sector, though. \"The impact will likely be small given the fragmented nature of the market,\" analysts at UBS say in a note. \"There is some risk of financial losses in joint ventures as well as the potential adverse financial impact on the supply chain which may impact others in the sector.\" (Kit Rees) EUROPEAN SNAPSHOT: EUROPE DIPS (0838 GMT) European shares are lower and don't seem set to join the global rally which has led Asian shares to hit historic highs on Monday after Wall Street extended its record-breaking run. Here are Europe's main indexes after the open: (Julien Ponthus) WHAT WE'RE WATCHING AHEAD OF THE OPEN (0752 GMT) European stocks futures are pointing to a slightly higher open, following on from a subdued session in Asia while oil prices could weigh as they pull away from $70 a barrel. While it’s a quiet day in terms of company results, construction stocks will be in focus after Carillion collapsed after banks refused to lend it any more money. Elsewhere retailers will be in focus after an update from Metro, while autos will also be ones to watch as the Detroit Auto Show gets under way. (Kit Rees) Here are the headlines catching our eye: Britain's Carillion collapses as banks refuse to lend it any more money Aker BP to raise dividends for 2018 by $100 mln, further increase ahead Metro Christmas sales solid in Germany, down in Russia LVMH watch, jewellery sales up more than 10 pct in 2017 British bookmaker sees 2017 profit beating estimates Melrose looks to win over GKN shareholders after spurned 7 bln stg bid VW brand car sales hit record 6.23 mln in 2017 Virtual becomes reality as British shop visits fall in December Airbus in talks on 70-80 mln euro deal to end German probe -paper (Kit Rees) EUROPEAN STOCKS FUTURES NUDGE HIGHER (0708 GMT) European stocks futures have opened slightly higher, with FTSE futures flat as Brent crude oil prices dip under $70 a barrel. Here's a snapshot: (Kit Rees)", "external_links": [], "published": "2018-01-15T17:49:00.000+02:00", "crawled": "2018-01-15T22:25:25.020+02:00", "highlightTitle": ""}