{"organizations": [], "uuid": "696cfed0edc2840d5660ba9129630240ffd716a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.goldreview.com/?feed=linkfeed", "section_title": "Gold Review » Gold Review", "url": "https://uk.reuters.com/article/global-precious/precious-gold-jumps-to-near-4-month-high-as-dollar-slips-sharply-idUKL4N1P531X", "country": "US", "domain_rank": 408, "title": "Gold hits near 4-month high as dollar slides on China report", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T20:59:00.000+02:00", "replies_count": 0, "uuid": "696cfed0edc2840d5660ba9129630240ffd716a0"}, "author": "cmullen", "url": "https://uk.reuters.com/article/global-precious/precious-gold-jumps-to-near-4-month-high-as-dollar-slips-sharply-idUKL4N1P531X", "ord_in_thread": 0, "title": "Gold hits near 4-month high as dollar slides on China report", "locations": [], "entities": {"persons": [{"name": "jan harvey", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 11:17 AM / Updated 8 hours ago PRECIOUS-Gold hits near 4-month high as dollar slides on China report Reuters Staff 4 Min Read \n* Dollar index posts biggest 1-day drop in a month * Drop in U.S. unit helps gold shrug off rise in bond yields * GRAPHIC-2018 asset returns: tmsnrt.rs/2jvdmXl (Releads, updates prices, adds comment) By Jan Harvey LONDON, Jan 10 (Reuters) - Gold jumped to its highest in nearly four months on Wednesday as a report that Chinese officials had recommended slowing or halting U.S. Treasury purchases sparked a broad-based sell-off of the dollar, lifting assets priced in the U.S. currency. The dollar, already under pressure versus the yen after the Bank of Japan moved to trim its long-dated government bond purchases earlier this week, slid 0.6 percent versus a currency basket, its biggest one-day drop in a month. Spot gold was up 0.9 percent at $1,324.84 an ounce at 1211 GMT, having earlier touched its highest since Sept. 15 at $1,326.56. U.S. gold futures for February delivery were up $12.30 an ounce at $1,326.00. \"Gold is fuelled by the weak dollar after the China news came out,\" Commerzbank analyst Daniele Briesemann said. \"U.S. Treasury yields are continuing to rise - that should be a headwind for gold, but it seems to be ignored after the news late morning. It all comes down to the weak dollar.\" \"Maybe with the opening of the U.S. we could see more gains in gold due to an even weaker dollar,\" he added. The U.S. currency slumped on Wednesday after a report that China was reconsidering its stance on U.S. treasury purchases, with the greenback posting its biggest single-day drop against the Japanese yen in nearly eight months. Officials reviewing China's foreign-exchange holdings have recommended slowing or halting purchases of U.S. Treasuries, Bloomberg News reported, citing people familiar with the matter. Major government bond yields hit multi-month highs on Wednesday as investors reevaluated the likelihood of continued easy-money policies by the world's major central banks following the BoJ move. The 10-year U.S. Treasury yield hit 2.57 percent for the first time since March. The dollar's slide helped gold shrug off the impact of rising global Treasury yields, which increase the opportunity cost of holding non-interest bearing bullion. \"If the reports turn out to be true and China no longer sees Treasuries as an attractive option, the repercussions could be significant as the country is one of the biggest holders of U.S. debt,\" OANDA said in a note. \"The tightening effect of such measures would likely have an impact on how many times the Federal Reserve raises interest rates this year, which is why we've seen a corresponding drop in the dollar.\" Among other metals, palladium was down 0.2 percent at $1,098.22 an ounce, after hitting a record high on Tuesday at $1,111.40. Tightening emissions standards and a switch away from diesel cars to more palladium-heavy gasoline models has shored up demand expectations for the autocatalyst metal. Silver was up 1.2 percent at $17.15 an ounce, while platinum was 0.4 percent higher at $969.40 an ounce. (Additional reporting by Nallur Sethuraman in Bengaluru; Editing by Edmund Blair and Jane Merriman)", "external_links": [], "published": "2018-01-10T20:59:00.000+02:00", "crawled": "2018-01-10T22:24:38.014+02:00", "highlightTitle": ""}