{"organizations": [], "uuid": "813461c8950766272f2eb4d6233c58eb0b856b1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-steel-dynamics-reports-fourth-quarter-and-annual-2017-results.html", "country": "US", "domain_rank": 767, "title": "Steel Dynamics Reports Fourth Quarter and Annual 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T02:00:00.000+02:00", "replies_count": 0, "uuid": "813461c8950766272f2eb4d6233c58eb0b856b1e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-steel-dynamics-reports-fourth-quarter-and-annual-2017-results.html", "ord_in_thread": 0, "title": "Steel Dynamics Reports Fourth Quarter and Annual 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "ind.", "sentiment": "none"}, {"name": "wayne", "sentiment": "none"}], "organizations": [{"name": "steel dynamics reports fourth quarter", "sentiment": "negative"}, {"name": "steel dynamics, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FORT WAYNE, Ind., Jan. 22, 2018 /PRNewswire/ --\nAnnual 2017 Results:\nRecord company-wide safety performance Record steel shipments of 9.7 million tons Record fabrication shipments of over 627,000 tons Record net sales of $9.5 billion Record operating income of $1.1 billion and pretax income of $935 million Record EBITDA of $1.4 billion\nSteel Dynamics, Inc. (NASDAQ/GS: STLD) today announced fourth quarter and annual 2017 financial results. The company reported fourth quarter 2017 net sales of $2.3 billion and net income of $305 million, or $1.28 per diluted share, which includes the following items:\nLower pretax earnings of $7 million, or $0.02 per diluted share, related to debt refinancing and repayment charges, Lower pretax earnings of approximately $27 million, or $0.07 per diluted share, related to the company's two flat roll division planned outages, which resulted in higher costs and lower value-add shipments, as indicated in the company's December 15, 2017 guidance press release, A tax benefit of approximately $16 million, or $0.07 per diluted share, related to certain discrete valuation allowance reductions, state tax refunds and equity-based compensation, and An additional one-time tax benefit of $181 million, or $0.76 per diluted share, resulting from the company's revaluation of its deferred tax assets and liabilities in connection with the recently enacted U.S. Federal \"Tax Cuts and Jobs Act of 2017\" (TCJA). The company currently estimates the related reduction in its corporate tax rate will result in an effective tax rate of between 24 percent and 25 percent for 2018.\nComparatively, prior year fourth quarter net sales were $1.9 billion, with net income of $20 million, or $0.08 per diluted share, which included non-cash goodwill and asset impairment charges of $0.31 per diluted share and debt refinancing and repayment charges of $0.04 per diluted share. Sequential third quarter 2017 net sales were $2.4 billion, with net income of $153 million, or $0.64 per diluted share, which includes debt refinancing and repayment charges of $0.02 per diluted share.\nAnnual 2017 net income was $813 million, or $3.36 per diluted share. Excluding the one-time TCJA tax benefit and debt refinancing costs, the company still achieved record annual net income of $641 million, or $2.65 per diluted share. Comparatively, annual 2016 net income was $382 million, or $1.56 per diluted share. Excluding charges related to litigation settlements, non-cash goodwill and asset impairment, and debt refinancing, annual 2016 adjusted net income was $472 million, or $1.92 per diluted share.\n\"The performance of the entire Steel Dynamics team was exceptional this year,\" said Mark D. Millett, President and Chief Executive Officer. \"We performed at the top of our industry, both operationally and financially, and most importantly, we did it safely. We achieved numerous annual records, including steel and fabrication shipments, operating income of $1.1 billion, and EBITDA of $1.4 billion. Based on our strong cash flow generation from operations of $740 million in 2017, we maintained near-record liquidity of over $2.2 billion, while simultaneously investing in our company through organic growth, a sustained positive dividend profile and the continuation of our share repurchase program. We have a firm foundation for our continued growth. In recognition of the team's tremendous achievements during the year, we were pleased to award each non-executive employee a special cash performance bonus in December which totaled $7 million.\n\"In spite of the continuation of elevated levels of steel imports, which were over 15 percent higher than in 2016,\" continued Millett, \"the domestic steel industry benefited in 2017 from an improvement in underlying demand, as the automotive sector remained strong, and the construction and energy sectors continued to improve. Our steel operations achieved record annual operating income of $1.1 billion. Supported by improved domestic steel utilization, the metals recycling team maintained volume, increased metal spread and reduced costs throughout the year, resulting in annual 2017 operating income of $85 million, more than double last year's performance.\n\"Our fabrication platform also had a solid year with annual 2017 operating income of $87 million, achieving record shipments which substantially offset margin compression caused by higher average raw material steel costs,\" said Millett. \"Our fabrication order backlog and customer sentiment remains strong. We believe this is a positive indication that the non-residential construction market is continuing to strengthen.\"\nFourth Quarter 2017 Comments\nFourth quarter 2017 operating income for the company's steel operations decreased 26 percent to $207 million sequentially, based on a four percent decline in shipments, product mix shift, and metal spread compression. During October, the company successfully completed an equipment upgrade and facility expansion at the Butler Flat Roll Division and an equipment upgrade with additional value-add product opportunities at the Columbus Flat Roll Division. However, the longer than typical planned outages resulted in higher costs and lower value-add shipments, reducing fourth quarter 2017 pretax earnings by approximately $27 million. The company's average overall steel product price decreased more than consumed raw material scrap costs, resulting in steel metal spread compression. The fourth quarter 2017 average product selling price for the company's steel operations decreased $17 to $761 per ton. The average ferrous scrap cost per ton melted decreased $5 to $300 per ton.\nFourth quarter 2017 operating income attributable to the company's flat roll products decreased 30 percent when compared to the sequential third quarter, based on lower shipments, the prolonged outages, and metal spread compression. Operating income from long products decreased eight percent as a result of lower shipments, as merchant steel volumes remained under pressure from prefabricated steel imports and excess domestic production capability. Prefabricated steel imports increased more than 80 percent in a five year timeframe. The company's steel production utilization rate was 89 percent in the fourth quarter 2017, compared to 92 percent in the sequential third quarter and compared to the domestic industry utilization rate of approximately 73 percent.\nFourth quarter 2017 operating income from the company's metals recycling operations was $22 million, compared to $21 million in the sequential third quarter. Despite decreased shipments and lower average quarterly ferrous pricing, ferrous metal spread remained steady and non-ferrous metal spread improved.\nThe company's fabrication operations fourth quarter 2017 operating income was $22 million, consistent with sequential third quarter results. The fabrication group achieved another quarter of record shipments and maintains a strong order backlog.\nDuring the second half of 2017, the company successfully refinanced $350 million of senior notes, reducing its ongoing interest burden, extending its debt maturity profile, and further supporting continued growth. These actions reduced third and fourth quarter 2017 pretax income by $8 million and $7 million, respectively, due to the required call premium and other associated finance expenses, and are expected to provide an estimated annual interest savings of approximately $8 million.\nAnnual 2017 Comparison\nAnnual 2017 net sales were a record $9.5 billion compared to $7.8 billion in 2016. Each of the company's three operating platforms achieved higher average annual selling values and the steel and fabrication operating platforms also each achieved record shipments. Annual 2017 operating income was a record $1.1 billion compared to adjusted 2016 operating income of $861 (which excludes non-cash goodwill and asset impairment charges of $133 million). The improvement in annual earnings resulted from record results for the company's steel operations and significant increase in the metals recycling financial performance. The average 2017 selling price for the company's steel operations increased $107 to $765 per ton. The average 2017 ferrous scrap cost per ton melted increased $73 to $293 per ton.\nOutlook\n\"We remain confident that current and anticipated macroeconomic and market conditions are in place to benefit domestic steel consumption in 2018,\" said Millett. \"Domestic steel inventory levels have moderated. World steel demand and pricing have structurally improved and domestic steel demand remains healthy. We believe North American automotive steel consumption will be steady, and we continue to gain momentum in that sector. We also believe that there will be continued additional growth in the construction and energy sectors. We believe the recent tax reform will also provide a stimulus for additional domestic fixed asset investment and growth. In combination with our own SDI expansion initiatives, we believe there are firm drivers for growth in 2018.\"\n\"We continue to strengthen our financial position through strong cash flow generation and the execution of our long-term strategy. We are well-positioned for growth, and remain focused on delivering shareholder value through organic and strategic growth opportunities,\" concluded Millett.\nConference Call and Webcast\nSteel Dynamics, Inc. will hold a conference call to discuss fourth quarter and annual 2017 operating and financial results on Tuesday, January 23, 2018, at 10:00 a.m. Eastern Time. You may access the call and find dial-in information on the Investors section of the company's website at www.steeldynamics.com . A replay of the call will be available on our website until 11:59 p.m. Eastern Time on January 28, 2018.\nAbout Steel Dynamics, Inc.\nSteel Dynamics, Inc. is one of the largest domestic steel producers and metals recyclers in the United States based on estimated annual steelmaking and metals recycling capability, with facilities located throughout the United States, and in Mexico. Steel Dynamics produces steel products, including hot roll, cold roll, and coated sheet steel, structural steel beams and shapes, rail, engineered special-bar-quality steel, cold finished steel, merchant bar products, specialty steel sections and steel joists and deck. In addition, the company produces liquid pig iron and processes and sells ferrous and nonferrous scrap.\nNote Regarding Non-GAAP Financial Measures\nThe company reports its financial results in accordance with U.S. generally accepted accounting principles (GAAP). Management believes that Adjusted Operating Income, Adjusted Net Income, Adjusted Diluted Earnings Per Share, EBITDA and Adjusted EBITDA, non-GAAP financial measures, provide additional meaningful information regarding the company's performance and financial strength. Non-GAAP financial measures should be viewed in addition to, and not as an alternative for, the company's reported results prepared in accordance with GAAP. In addition, because not all companies use identical calculations, EBITDA included in this release may not be comparable to similarly titled measures of other companies.\nForward-Looking Statements\nThis press release contains some predictive statements about future events, including statements related to conditions in the steel and metallic scrap markets, Steel Dynamics' revenues, costs of purchased materials, future profitability and earnings, and the operation of new or existing facilities. These statements, which we generally precede or accompany by such typical conditional words as \"anticipate,\" \"intend,\" \"believe,\" \"estimate,\" \"plan,\" \"seek,\" \"project\" or \"expect,\" or by the words \"may,\" \"will,\" or \"should,\" are intended to be made as \"forward-looking,\" subject to many risks and uncertainties, within the safe harbor protections of the Private Securities Litigation Reform Act of 1995. These statements speak only as of this date and are based upon information and assumptions, which we consider reasonable as of this date, concerning our businesses and the environments in which they operate. Such predictive statements are not guarantees of future performance, and we undertake no duty to update or revise any such statements. Some factors that could cause such forward-looking statements to turn out differently than anticipated include: (1) the effects of uncertain economic conditions; (2) cyclical and changing industrial demand; (3) changes in conditions in any of the steel or scrap-consuming sectors of the economy which affect demand for our products, including the strength of the non-residential and residential construction, automotive, appliance, pipe and tube, and other steel-consuming industries; (4) fluctuations in the cost of key raw materials (including steel scrap, iron units, and energy costs) and our ability to pass-on any cost increases; (5) the impact of domestic and foreign import price competition; (6) unanticipated difficulties in integrating or starting up new or acquired businesses; (7) risks and uncertainties involving product and/or technology development; and (8) occurrences of unexpected plant outages or equipment failures.\nMore specifically, we refer you to Steel Dynamics' more detailed explanation of these and other factors and risks that may cause such predictive statements to turn out differently, as set forth in our most recent Annual Report on Form 10-K under the headings Special Note Regarding Forward-Looking Statements and Risk Factors, in our quarterly reports on Form 10-Q or in other reports which we from time to time file with the Securities and Exchange Commission. These are available publicly on the SEC website, www.sec.gov , and on the Steel Dynamics website, www.steeldynamics.com : Investors: SEC Filings.\nSteel Dynamics, Inc.\nCONSOLIDATED STATEMENTS OF INCOME (UNAUDITED)\n(in thousands, except per share data)\nThree Months Ended\nYear Ended\nThree Months\nDecember 31,\nDecember 31,\nEnded\n2017\n2016\n2017\n2016\nSeptember 30, 2017\nNet sales\n$\n2,336,479\n$\n1,910,596\n$\n9,538,797\n$\n7,777,109\n$\n2,443,382\nCosts of goods sold\n2,015,655\n1,600,654\n7,956,783\n6,442,245\n2,046,864\nGross profit\n320,824\n309,942\n1,582,014\n1,334,864\n396,518\nSelling, general and administrative expenses\n96,209\n94,110\n394,631\n374,009\n97,056\nProfit sharing\n21,595\n19,563\n91,309\n71,285\n21,175\nAmortization of intangible assets\n7,073\n7,406\n29,193\n28,765\n7,272\nAsset impairment charge\n-\n132,839\n-\n132,839\n-\nOperating income\n195,947\n56,024\n1,066,881\n727,966\n271,015\nInterest expense, net of capitalized interest\n32,380\n36,149\n134,399\n146,037\n34,177\nOther expense (income), net\n2,215\n17,055\n(2,753)\n17,796\n2,526\nIncome before income taxes\n161,352\n2,820\n935,235\n564,133\n234,312\nIncome tax expense (benefit)\n(141,819)\n(1,012)\n129,439\n204,127\n83,300\nNet income\n303,171\n3,832\n805,796\n360,006\n151,012\nNet loss attributable to noncontrolling interests\n1,562\n16,180\n6,945\n22,109\n2,246\nNet income attributable to Steel Dynamics, Inc.\n$\n304,733\n$\n20,012\n$\n812,741\n$\n382,115\n$\n153,258\nBasic earnings per share attributable to\nSteel Dynamics, Inc. stockholders\n$\n1.28\n$\n0.08\n$\n3.38\n$\n1.57\n$\n0.64\nWeighted average common shares outstanding\n237,177\n243,687\n240,132\n243,576\n239,066\nDiluted earnings per share attributable to\nSteel Dynamics, Inc. stockholders, including the effect\nof assumed conversions when dilutive\n$\n1.28\n$\n0.08\n$\n3.36\n$\n1.56\n$\n0.64\nWeighted average common shares\nand share equivalents outstanding\n238,677\n245,511\n241,781\n245,298\n240,880\nDividends declared per share\n$\n0.155\n$\n0.1400\n$\n0.620\n$\n0.5600\n$\n0.155\nSteel Dynamics, Inc.\nCONSOLIDATED BALANCE SHEETS\n(in thousands)\nDecember 31,\nDecember 31,\nAssets\n2017\n2016\n(unaudited)\nCurrent assets\nCash and equivalents\n$\n1,028,649\n$\n841,483\nAccounts receivable, net\n868,837\n729,784\nInventories\n1,519,347\n1,275,211\nOther current assets\n91,509\n83,197\nTotal current assets\n3,508,342\n2,929,675\nProperty, plant and equipment, net\n2,675,904\n2,787,215\nRestricted cash\n16,939\n18,060\nIntangible assets, net\n256,909\n283,977\nGoodwill\n386,893\n393,351\nOther assets\n10,745\n11,454\nTotal assets\n$\n6,855,732\n$\n6,423,732\nLiabilities and Equity\nCurrent liabilities\nAccounts payable\n$\n489,448\n$\n395,196\nIncome taxes payable\n3,696\n5,593\nAccrued expenses\n346,580\n308,394\nCurrent maturities of long-term debt\n28,795\n3,632\nTotal current liabilities\n868,519\n712,815\nLong-term debt\n2,353,145\n2,353,194\nDeferred income taxes\n305,949\n448,375\nOther liabilities\n21,811\n20,649\nTotal liabilities\n3,549,424\n3,535,033\nCommitments and contingencies\nRedeemable noncontrolling interests\n111,240\n111,240\nEquity\nCommon stock\n644\n641\nTreasury stock, at cost\n(665,297)\n(416,829)\nAdditional paid-in capital\n1,141,534\n1,132,749\nRetained earnings\n2,874,693\n2,210,459\nTotal Steel Dynamics, Inc. equity\n3,351,574\n2,927,020\nNoncontrolling interests\n(156,506)\n(149,561)\nTotal equity\n3,195,068\n2,777,459\nTotal liabilities and equity\n$\n6,855,732\n$\n6,423,732\nSteel Dynamics, Inc.\nCONSOLIDATED STATEMENTS OF CASH FLOWS (UNAUDITED)\n(in thousands)\nThree Months Ended\nYear Ended\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nOperating activities:\nNet income\n$\n303,171\n$\n3,832\n$\n805,796\n$\n360,006\nAdjustments to reconcile net income to net cash provided by\noperating activities:\nDepreciation and amortization\n74,931\n73,139\n298,999\n296,109\nAsset impairment charge\n-\n132,839\n-\n132,839\nEquity-based compensation\n11,639\n10,069\n36,197\n31,656\nDeferred income taxes\n(153,748)\n(33)\n(135,899)\n53,846\nOther adjustments\n6,013\n17,450\n14,068\n20,676\nChanges in certain assets and liabilities:\nAccounts receivable\n54,179\n43,193\n(139,054)\n(106,617)\nInventories\n(31,157)\n(13,236)\n(242,883)\n(115,575)\nOther assets\n5,891\n198\n4,188\n12,053\nAccounts payable\n(37,189)\n(10,699)\n96,062\n106,521\nIncome taxes receivable/payable\n(39,692)\n(54,881)\n(33,889)\n(13,921)\nAccrued expenses\n(2,037)\n5,536\n36,021\n75,176\nNet cash provided by operating activities\n192,001\n207,407\n739,606\n852,769\nInvesting activities:\nPurchases of property, plant and equipment\n(37,189)\n(74,992)\n(164,935)\n(198,160)\nAcquisition of businesses, net of cash acquired\n(674)\n(14,286)\n(6,192)\n(123,351)\nOther investing activities\n1,636\n2,851\n32,022\n8,618\nNet cash used in investing activities\n(36,227)\n(86,427)\n(139,105)\n(312,893)\nFinancing activities:\nIssuance of current and long-term debt\n118,593\n400,000\n620,041\n473,903\nRepayment of current and long-term debt\n(278,575)\n(656,855)\n(609,914)\n(728,993)\nDividends paid\n(36,728)\n(34,128)\n(145,565)\n(135,767)\nPurchase of treasury stock\n(15,088)\n(25,034)\n(252,242)\n(25,034)\nOther financing activities\n(17,291)\n(14,969)\n(25,655)\n(9,534)\nNet cash used in financing activities\n(229,089)\n(330,986)\n(413,335)\n(425,425)\nIncrease (decrease) in cash and equivalents\n(73,315)\n(210,006)\n187,166\n114,451\nCash and equivalents at beginning of period\n1,101,964\n1,051,489\n841,483\n727,032\nCash and equivalents at end of period\n$\n1,028,649\n$\n841,483\n$\n1,028,649\n$\n841,483\nSupplemental disclosure information:\nCash paid for interest\n$\n55,226\n$\n53,074\n$\n135,381\n$\n150,679\nCash paid for income taxes, net\n$\n49,701\n$\n55,826\n$\n296,493\n$\n159,950\nSteel Dynamics, Inc.\nSUPPLEMENTAL INFORMATION\n(dollars in thousands)\nFourth Quarter\nYear to Date\n2017\n2016\n2017\n2016\n1Q 2017\n2Q 2017\n3Q 2017\nExternal Net Sales\nSteel\n$\n1,669,384\n$\n1,393,329\n$\n6,931,764\n$\n5,634,711\n$\n1,721,333\n$\n1,758,242\n$\n1,782,805\nFabrication\n220,515\n173,015\n823,782\n701,041\n194,096\n197,866\n211,305\nMetals Recycling\n354,460\n282,783\n1,410,040\n1,169,342\n363,836\n343,529\n348,215\nOther\n92,120\n61,469\n373,211\n272,015\n88,951\n91,083\n101,057\nConsolidated\n$\n2,336,479\n$\n1,910,596\n$\n9,538,797\n$\n7,777,109\n$\n2,368,216\n$\n2,390,720\n$\n2,443,382\nOperating Income\nSteel\n$\n207,358\n$\n217,778\n$\n1,113,884\n$\n941,126\n$\n352,423\n$\n273,818\n$\n280,285\nFabrication\n21,601\n17,766\n87,459\n91,167\n23,767\n20,188\n21,903\nMetals Recycling\n22,379\n9,511\n84,826\n40,304\n21,341\n19,988\n21,118\nMetals Recycling Impairment Charge\n-\n(5,500)\n-\n(5,500)\n-\n-\n-\nOperations\n251,338\n239,555\n1,286,169\n1,067,097\n397,531\n313,994\n323,306\nNon-cash Amortization of Intangible Assets\n(7,073)\n(7,406)\n(29,193)\n(28,765)\n(7,424)\n(7,424)\n(7,272)\nProfit Sharing Expense\n(21,595)\n(19,563)\n(91,309)\n(71,285)\n(27,231)\n(21,308)\n(21,175)\nNon-segment Operations\n(26,723)\n(29,223)\n(98,786)\n(111,742)\n(28,310)\n(19,909)\n(23,844)\nMinnesota Impairment Charge\n-\n(127,339)\n-\n(127,339)\n-\n-\n-\nConsolidated Operating Income\n195,947\n56,024\n1,066,881\n727,966\n334,566\n265,353\n271,015\nNon-cash Impairment Charge\n-\n132,839\n-\n132,839\n-\n-\n-\nAdjusted Operating Income\n$\n195,947\n$\n188,863\n$\n1,066,881\n$\n860,805\n$\n334,566\n$\n265,353\n$\n271,015\nAdjusted EBITDA\nEarnings Before Taxes\n$\n161,352\n$\n2,820\n$\n935,235\n$\n564,133\n$\n304,252\n$\n235,319\n$\n234,312\nNet Interest Expense\n28,990\n34,752\n124,250\n141,148\n32,333\n31,629\n31,298\nDepreciation\n66,460\n64,199\n264,317\n261,281\n66,269\n65,014\n66,574\nAmortization of Intangible Assets\n7,073\n7,406\n29,193\n28,765\n7,424\n7,424\n7,272\nNon-controlling Interest\n1,562\n16,180\n6,945\n22,109\n2,152\n985\n2,246\nEBITDA\n265,437\n125,357\n1,359,940\n1,017,436\n412,430\n340,371\n341,702\nNon-cash Adjustments\nUnrealized Hedging (Gain) Loss\n7,325\n(143)\n4,688\n484\n(637)\n724\n(2,724)\nInventory Valuation\n198\n154\n2,955\n986\n162\n2,359\n236\nAsset Impairment Charge\n-\n119,764\n-\n119,764\n-\n-\n-\nEquity-based Compensation\n11,636\n10,069\n34,560\n30,230\n9,074\n6,975\n6,875\nFinancing Expenses\n1,242\n3,104\n2,635\n3,104\n-\n-\n1,393\nAdjusted EBITDA\n$\n285,838\n$\n258,305\n$\n1,404,778\n$\n1,172,004\n$\n421,029\n$\n350,429\n$\n347,482\nOther Operating Information\nSteel\nAverage External Sales Price (Per ton)\n$\n761\n$\n680\n$\n765\n$\n658\n$\n743\n$\n779\n$\n778\nAverage Ferrous Cost (Per ton melted)\n$\n300\n$\n220\n$\n293\n$\n220\n$\n264\n$\n303\n$\n305\nFlat Roll Shipments\n1,659,049\n1,565,157\n6,865,413\n6,631,089\n1,735,954\n1,737,404\n1,733,006\nLong Product Shipments\nStructural and Rail Division\n339,597\n319,265\n1,339,558\n1,299,551\n350,555\n311,421\n337,985\nEngineered Bar Products Division\n191,652\n134,262\n757,027\n507,163\n192,140\n180,787\n192,448\nRoanoke Bar Division\n107,319\n112,007\n470,071\n496,808\n125,869\n116,231\n120,652\nSteel of West Virginia\n66,724\n75,453\n294,908\n311,335\n77,229\n76,054\n74,901\nShipments (Tons)\n2,364,341\n2,206,144\n9,726,977\n9,245,946\n2,481,747\n2,421,897\n2,458,992\nExternal Shipments (Tons)\n2,184,135\n2,041,078\n9,015,013\n8,558,331\n2,305,080\n2,246,569\n2,279,229\nSteel Production (Tons)\n2,437,851\n2,237,200\n9,995,082\n9,503,465\n2,544,082\n2,476,159\n2,536,990\nMetals Recycling\nNonferrous Shipments (000's of pounds)\n271,036\n274,790\n1,086,799\n1,103,505\n283,603\n270,444\n261,716\nFerrous Shipments (Gross tons)\n1,172,015\n1,175,625\n4,952,973\n5,070,380\n1,338,599\n1,222,777\n1,219,582\nExternal Ferrous Shipments (Gross tons)\n429,512\n446,232\n1,844,115\n1,957,764\n485,414\n466,506\n462,683\nFabrication\nAverage External Sales Price (Per ton)\n$\n1,335\n$\n1,310\n$\n1,314\n$\n1,249\n$\n1,291\n$\n1,311\n$\n1,317\nShipments (Tons)\n165,338\n132,186\n627,274\n562,725\n150,402\n151,052\n160,482\nView original content: http://www.prnewswire.com/news-releases/steel-dynamics-reports-fourth-quarter-and-annual-2017-results-300586148.html\nSOURCE Steel Dynamics, Inc.", "external_links": ["http://www.sec.gov/", "http://www.prnewswire.com/news-releases/steel-dynamics-reports-fourth-quarter-and-annual-2017-results-300586148.html", "http://www.steeldynamics.com/"], "published": "2018-01-23T02:00:00.000+02:00", "crawled": "2018-01-23T04:04:34.063+02:00", "highlightTitle": ""}