{"organizations": [], "uuid": "f7e66921875f9ee5461c767e568f7a3fc6e46c60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-atscale-appoints-former-cloudera-executive-kip-bowes-as-vp-customer-success.html", "country": "US", "domain_rank": 767, "title": "AtScale Appoints former Cloudera executive Kip Bowes as VP Customer Success", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T17:00:00.000+02:00", "replies_count": 0, "uuid": "f7e66921875f9ee5461c767e568f7a3fc6e46c60"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-atscale-appoints-former-cloudera-executive-kip-bowes-as-vp-customer-success.html", "ord_in_thread": 0, "title": "AtScale Appoints former Cloudera executive Kip Bowes as VP Customer Success", "locations": [], "entities": {"persons": [{"name": "kip bowes", "sentiment": "negative"}, {"name": "atscale", "sentiment": "none"}, {"name": "kip", "sentiment": "none"}, {"name": "bowes", "sentiment": "none"}, {"name": "ryan floyd", "sentiment": "none"}], "locations": [{"name": "san mateo", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}, {"name": "big data analytics", "sentiment": "none"}, {"name": "amazon clouds", "sentiment": "none"}, {"name": "storm ventures", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN MATEO, Calif., AtScale, the only company to provide enterprises with a universal semantic platform for BI-on-the-Data-Lake, announced today the appointment of Kip Bowes as its Vice President of Customer Success. In this role, Bowes will be responsible for onboarding AtScale's growing roster of large enterprise customers.\n\"In just a few years, AtScale has grown from a Big Data Analytics startup to a major company with technology that every enterprise Chief Data Officer requires to succeed in the implementation of their data analytics strategy,\" said Ryan Floyd, managing director of Storm Ventures. \"We are excited for Kip to join AtScale. He brings incredible experience and our fast growing base of data-driven enterprises will appreciate his expertise as they seek to gain ROI from their Big Data.\"\nThe AtScale Intelligence platform runs on all Hadoop distributions as well as the Microsoft, Google and Amazon Clouds. Find out more by going to www.atscale.com/try\nBowes comes to AtScale with more than 20 years of experience in organizational strategy, new business development, and solutions delivery for top technology companies. Kip previously ran the Services organization for the Western US, China, and APJ at Cloudera, helping drive dramatic growth up to and through the company's Initial Public Offering (IPO).\nIn addition, Kip has led Services teams at Oracle, Endeca, Tibco, Macromedia, and Allaire Corp. Kip earned a BS in Computer Science from Baldwin-Wallace College and an MBA from Rice University.\n\"While working at Cloudera, I watched AtScale make a large impact on the BI on Big Data market and achieve impressive results for enterprise customers,\" said Bowes. \"I'm passionate about spreading cutting-edge technology and driving customer success: AtScale is the perfect place to fulfill both.\"\nThis appointment comes after a momentous year for AtScale, during which the company completed a $25 million Series C financing round, released three new products that support the Cloud -- making it the only company to support BI-on-the-Data-Lake, might it be on Hadoop, non Hadoop, on-premises or on any cloud (Microsoft, Amazon or Google).\nAbout AtScale\nAtScale makes BI work on Big Data. With AtScale, business users get interactive and multi-dimensional analysis capabilities, directly on Big Data, at maximum speed, using the tools they already know, own and love - from Microsoft Excel to Tableau Software to QlikView. Built by Big Data veterans from Yahoo!, Google and Oracle, AtScale is already enabling the BI on Big Data Revolution at major corporations across healthcare, telecommunications, retail and online industries. To see how AtScale can help your company, go to www.atscale.com/try\n releases/atscale-appoints-former-cloudera-executive-kip-bowes-as-vp-customer-success-300584398.html\nSOURCE AtScale", "external_links": ["http://www.atscale.com/try", "http://www.prnewswire.com/news-releases/atscale-appoints-former-cloudera-executive-kip-bowes-as-vp-customer-success-300584398.html"], "published": "2018-01-18T17:00:00.000+02:00", "crawled": "2018-01-18T19:55:26.000+02:00", "highlightTitle": ""}