{"organizations": [], "uuid": "98c97b342d8d26d93e56b4dd54a5bee02846487e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 14, "shares": 14, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/technologyNews/", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-russia-cryptocurrencies-bill/russias-finance-ministry-ready-to-regulate-not-ban-crypto-fx-idUSKBN1FE0Y0", "country": "US", "domain_rank": 408, "title": "Russia's finance ministry ready to regulate, not ban crypto-FX", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T11:08:00.000+02:00", "replies_count": 0, "uuid": "98c97b342d8d26d93e56b4dd54a5bee02846487e"}, "author": "", "url": "https://www.reuters.com/article/us-russia-cryptocurrencies-bill/russias-finance-ministry-ready-to-regulate-not-ban-crypto-fx-idUSKBN1FE0Y0", "ord_in_thread": 0, "title": "Russia's finance ministry ready to regulate, not ban crypto-FX", "locations": [], "entities": {"persons": [{"name": "andrey ostroukh", "sentiment": "none"}, {"name": "toby chopra", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 9:09 AM / in 4 minutes Russia ready to regulate, not ban cryptocurrencies Reuters Staff 2 Min Read \nMOSCOW (Reuters) - Russia’s Finance Ministry said on Thursday it was working on legislation to regulate cryptocurrency transactions without fully banning them or legalising digital FX as a means of payment in Russia. \nRussia had initially said it would ban crypto-currencies as they could be used to launder money and finance terrorism. But as such currencies and particularly Bitcoin grew popular worldwide, Russian authorities have changed tack. \nThe ministry said it had prepared a bill that would permit trade in cryptocurrencies through digital exchanges which met certain conditions and would also cover initial coin offerings (ICOs). \nDoing this, the ministry said, would reduce the risk of fraud and make it possible to tax cryptocurrency transactions to support the state budget. \nThe ministry highlighted that digital currencies and tokens would not be allowed to replace the Russian rouble. \n“It should be noted, that the use of cryptocurrencies in the territory of the Russian Federation as a means of payment is not being suggested,” the ministry said in a statement. \nAuthorities around the world, particularly in Asia, have attempted to rein in the global boom in trading bitcoin and other cryptocurrencies - a form of digital money created and maintained by its users. \nChinese authorities have banned initial coin offerings and shut down local trading platforms, while South Korea - where speculation on cryptocurrencies is also rife - is working on plans to ban virtual coin exchanges. \nThe Russian ministry stopped short, however, of proposing a full ban. \n“Trades with cryptocurrencies have become so widespread, a legal ban on such activity would lead to the creation of conditions for the use of cryptocurrencies as an instrument to service illegal businesses, launder criminal incomes, and finance terrorism,” the Russian ministry said. Reporting by Andrey Ostroukh and Jack Stubbs; Editing by Toby Chopra", "external_links": [], "published": "2018-01-25T11:08:00.000+02:00", "crawled": "2018-01-25T11:27:46.022+02:00", "highlightTitle": ""}