{"organizations": [], "uuid": "b745040f61314c0fd4efc96b55b3e3a583c9c4e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/deals-day/deals-of-the-day-mergers-and-acquisitions-idUSL3N1PC3LA", "country": "US", "domain_rank": 408, "title": "Deals of the day-Mergers and acquisitions", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T13:06:00.000+02:00", "replies_count": 0, "uuid": "b745040f61314c0fd4efc96b55b3e3a583c9c4e6"}, "author": "", "url": "https://www.reuters.com/article/deals-day/deals-of-the-day-mergers-and-acquisitions-idUSL3N1PC3LA", "ord_in_thread": 0, "title": "Deals of the day-Mergers and acquisitions", "locations": [], "entities": {"persons": [], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "juno therapeutics inc", "sentiment": "none"}, {"name": "celgene corp", "sentiment": "none"}, {"name": "dalian wanda group", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "gkn", "sentiment": "none"}, {"name": "grab", "sentiment": "none"}, {"name": "japan tobacco inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 11:06 AM / Updated 9 minutes ago Deals of the day-Mergers and acquisitions Reuters Staff 3 Min Read \n(Adds Pampa Energia, Henri Selmer, Qatar Airways; Updates Vale) \nJan 17 (Reuters) - The following bids, mergers, acquisitions and disposals were reported by 2100 GMT on Wednesday: \n** Chinese bidders are circling a diabetes care business owned by the world’s largest healthcare company Johnson & Johnson in a deal that could fetch up to $4 billion, five people with direct knowledge told Reuters. \n** Brazil’s Vale is in talks with Anglo American BHP Billiton Plc on options for their joint venture Samarco, and it may be easier for Vale to resolve that miner’s problems as sole owner, a Vale director said. \n** British engineering company GKN rejected a 7.4 billion pound ($10.2 billion) cash-and-stock takeover offer from turnaround specialists Melrose. \n** Turnaround specialist Melrose raised the pressure on GKN by turning hostile in its pursuit of the British engineering company, making a firm 7.4 billion pound ($10.2 billion) offer for the business after meeting its shareholders. \n** Celgene Corp is in talks to buy Juno Therapeutics Inc, which is working on an experimental gene therapy drug to treat cancer, the Wall Street Journal reported on Tuesday, citing sources familiar with the matter. \n** A start-up airline in the United States has offered a 25 percent stake to Qatar Airways, Chief Executive Akbar al-Baker said on Wednesday, giving the Gulf carrier a second chance to buy into a U.S. airline. \n** Argentine group Pampa Energia said it has agreed to sell $360 million in oil assets to local company Vista Oil & Gas, which is headed by the former head of state oil company YPF, Miguel Galuccio. \n** Dalian Wanda Group has agreed to sell its interests in the high-profile London luxury development project, One Nine Elms, for 59 million pounds ($81 million), the latest in a string of asset sales that underscore financial strains hitting the Chinese conglomerate. \n** Southeast Asian ride-hailing firm Grab said it has acquired an India-based payments startup, iKaaz, to help expand its digital payments platform GrabPay. \n** Japan Tobacco Inc, which is on the hunt for overseas acquisitions to offset a shrinking home market, is working on several possible deals as it targets growth in Asia and other emerging markets, its new chief executive said. \n** An attempt by Qatar-owned film company Miramax to buy Weinstein Co has complicated plans to sell the studio to a group of investors led by former Obama administration official Maria Contreras-Sweet, the Los Angeles Times reported on Tuesday, citing people familiar with the matter. \n** French payments specialist Ingenico agreed to buy New Zealand payment network Paymark for NZ$190 million ($137.5 million). \n** Its saxophones are played by the most famous jazzmen around the world and have even been sent into space, but growing competition from China pushed the French family company Henri Selmer Paris to sell a majority stake to an investment fund. (Compiled by Ahmed Farhatha and Arunima Banerjee in Bengaluru)", "external_links": [], "published": "2018-01-17T13:06:00.000+02:00", "crawled": "2018-01-17T13:22:04.032+02:00", "highlightTitle": ""}