{"organizations": [], "uuid": "b3399c6f336238771065e54186e7f97b98af389d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-colin-roy-appointed-chairman-of-highview-power.html", "country": "US", "domain_rank": 767, "title": "Colin Roy Appointed Chairman of Highview Power", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.141, "site_type": "news", "published": "2018-01-11T16:31:00.000+02:00", "replies_count": 0, "uuid": "b3399c6f336238771065e54186e7f97b98af389d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-colin-roy-appointed-chairman-of-highview-power.html", "ord_in_thread": 0, "title": "Colin Roy Appointed Chairman of Highview Power", "locations": [], "entities": {"persons": [{"name": "colin roy", "sentiment": "negative"}, {"name": "roy", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "highview power", "sentiment": "negative"}, {"name": "highview", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 11, 2018 (GLOBE NEWSWIRE) -- Highview Power, a leader in true long duration energy storage solutions for utilities, announced today that prominent corporate financier Colin Roy has been appointed to be the company’s chairman. A pioneer of modern corporate finance and mergers and acquisitions practices in Europe, Roy brings to Highview over 20 years of executive leadership in multinational corporations and has successfully scaled up several businesses from scratch to market leading positions. Additionally, Highview is announcing the opening of its New York offices to meet the growing demand for long duration energy storage in the United States.\n“I have long been a believer in Highview’s liquid air energy storage technology. It precisely addresses the three real requirements of the energy storage market; long duration, large scale, and environmentally friendly,” said Roy. “Everyone knows that energy storage is going to be the next big thing. But only a true long duration energy storage solution can balance the grid and make intermittent generation both reliable and bankable. Utilities and grid operators need anywhere from four hours to days of energy storage capacity at large scale, which Highview’s liquid air technology delivers at lower cost than commercially available alternatives. I am proud to join the leadership team at Highview at this critical time of our expansion into the U.S. and the negotiation of our first commercial orders.”\nColin Roy was previously the CEO of Greenhill & Co. Europe and was one of the co-founders of New York-based Greenhill & Co, Inc. Prior to this, he played a leading role in establishing the German investment banking franchises of Merrill Lynch and SG Warburg (now UBS). During this time he was a lead advisor on many of Europe’s most significant restructurings, privatizations, and M&A transactions, including the mergers of Mannesmann and Vodafone and of Bayer and Schering.\n\"Colin Roy is an incredibly experienced executive, so his keen insight will be invaluable as LAES technology builds momentum as the only freely locatable energy storage system engineered for long duration use cases,” said Highview Power CEO Gareth Brett. “The recent decision in the UK to impose more stringent de-rating factors in capacity market auctions for short duration storage clearly places a premium on long duration solutions and we believe that markets in the United States will soon follow suit.”\nHighview Power’s proprietary liquid air energy storage (LAES) technology is based on the principle of air liquefaction, which enables the easy storage of gases in cryogenic liquid form. The process involves a 700-fold expansion in volume from liquid back to gas, which releases the stored energy, powering turbines and generating electricity. This enables Highview’s system to store energy in increments measured in days rather than hours, at half the cost of lithium-ion batteries, and all while releasing zero emissions in the process. It utilizes long-proven technology with a system lifespan of over 30 years.\nAbout Highview Power\nHighview Power is a designer and developer of true long duration energy storage solutions for utilities and distributed power systems. The company’s proprietary technology uses liquid air as the storage medium and its custom designed Liquid Air Energy Storage (LAES) solutions can deliver anywhere from 10 MW/40 MWh to more than 200 MW/1.2 GWh of energy. LAES has been developed using proven components from mature industries to deliver pumped-hydro capabilities without geographical constraints and it can be configured to convert waste heat and cold to power. For more information, please visit: www.highview-power.com\nMedia Contact:\nMercom Communications www.mercomcapital.com\nWendy Prabhu HighviewPower@MercomCapital.com\n1.512.215.4452\nSource:Highview Power Storage, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/137ae3f9-5a3e-4328-a2d6-50e00f80ec8c", "https://www.globenewswire.com/Tracker?data=-GzW4Qdt36NGYQ3R1Krdx72LZLJ6ComFPUuJs6XA95LaOYp2B_ieYRV8GZgy0xbB6S3gB2u1Qr_dK2ixHhhdyCR8yF_K_sSfoipO2kFNW-c="], "published": "2018-01-11T16:31:00.000+02:00", "crawled": "2018-01-11T18:51:25.039+02:00", "highlightTitle": ""}