{"organizations": [], "uuid": "cb6beca48c5dbfdaeffb5bab761aa5d0961018b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219454348&w=1200&r=LYNXMPEE04002", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-germany-turkey/lets-make-up-turkish-foreign-minister-tells-germany-idUKKBN1EU00A", "country": "US", "domain_rank": 408, "title": "Let's make up, Turkish foreign minister tells Germany", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T02:04:00.000+02:00", "replies_count": 0, "uuid": "cb6beca48c5dbfdaeffb5bab761aa5d0961018b2"}, "author": "", "url": "https://uk.reuters.com/article/uk-germany-turkey/lets-make-up-turkish-foreign-minister-tells-germany-idUKKBN1EU00A", "ord_in_thread": 0, "title": "Let's make up, Turkish foreign minister tells Germany", "locations": [], "entities": {"persons": [{"name": "ge", "sentiment": "negative"}, {"name": "funke", "sentiment": "none"}, {"name": "sigmar gabriel", "sentiment": "none"}, {"name": "cavusoglu", "sentiment": "none"}, {"name": "mevlut cavusoglu", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 12:08 AM / Updated 7 hours ago Let's make up, Turkish foreign minister tells Germany Reuters Staff 3 Min Read \nBERLIN (Reuters) - Turkish Foreign Minister Mevlut Cavusoglu called on Friday for a fresh start in his country’s rocky relationship with Germany, holding out the prospect of closer economic cooperation, particularly in transport and energy, if ties improved. Turkish Foreign Minister Mevlut Cavusoglu attends a news conference in Ankara, Turkey, October 24, 2017. REUTERS/Umit Bektas/File Photo \nIn a column written for the Funke media group of newspapers for publication on Friday ahead of a meeting with his German counterpart Sigmar Gabriel, Cavusoglu called for an end to the “current crisis spiral in our relationship”. \n“Both sides have an interest in a new start in the bilateral relationship as we live in a time full of challenges,” he wrote. “It is not the time for bullhorn diplomacy.” \nCavusoglu said Germany needed to develop a more “empathetic” tone in its dealings with Turkey. Berlin did not seem to fully understand the “trauma” caused by a failed coup against President Tayyip Erdogan in 2016. \nLast month, Gabriel said Turkey’s decision to release a sixth German citizen from jail gave hope that relations between the two NATO allies could improve after plumbing new lows following the coup attempt. \nGerman politicians have been outspoken critics of Turkey’s security crackdown since the coup. Tens of thousands of Turks have been jailed, including around a dozen German citizens. Germany is home to some 3 million people of Turkish heritage. \nAnkara has criticised Berlin for not handing over asylum seekers it accuses of involvement in the failed coup. \nCavusoglu said an improved relationship could mean that the two countries could work more closely in areas including security and trade. \nHe said trade between Germany and Turkey amounted to 174 billion euros (£155 billion) in the last five years, with major opportunities in the coming decade from big infrastructure projects, in particular in transport and renewable energy. \nHe stressed the importance of Turkey’s role in stemming a wave of migrants to Germany under a deal with the European Union in 2016 and said he hoped that the EU would live up to its commitments to make it easier for Turks to get visas in return. Reporting by Emma Thomasson; editing by Ralph Boulton", "external_links": [], "published": "2018-01-05T02:04:00.000+02:00", "crawled": "2018-01-05T02:32:08.017+02:00", "highlightTitle": ""}