{"organizations": [], "uuid": "6c6e3bccaa7e099cc29d66b04efc2d43dea6382d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-alliqua-biomedical-inc-announces-definitive-asset-purchase-agreement-with-celularity-inc.html", "country": "US", "domain_rank": 767, "title": "Alliqua BioMedical, Inc. Announces Definitive Asset Purchase Agreement with Celularity, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.017, "site_type": "news", "published": "2018-01-06T00:30:00.000+02:00", "replies_count": 0, "uuid": "6c6e3bccaa7e099cc29d66b04efc2d43dea6382d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-alliqua-biomedical-inc-announces-definitive-asset-purchase-agreement-with-celularity-inc.html", "ord_in_thread": 0, "title": "Alliqua BioMedical, Inc. Announces Definitive Asset Purchase Agreement with Celularity, Inc.", "locations": [], "entities": {"persons": [{"name": "celularity", "sentiment": "none"}, {"name": "david johnson", "sentiment": "none"}], "locations": [{"name": "pa.", "sentiment": "none"}, {"name": "yardley", "sentiment": "none"}, {"name": "alliqua", "sentiment": "none"}], "organizations": [{"name": "alliqua biomedical, inc", "sentiment": "neutral"}, {"name": "celularity, inc", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "celularity", "sentiment": "none"}, {"name": "celularity, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "YARDLEY, Pa., Jan. 05, 2018 (GLOBE NEWSWIRE) -- Alliqua BioMedical, Inc. (NASDAQ:ALQA) (“Alliqua or the “Company”), a regenerative technologies company committed to restoring tissue and rebuilding lives, today announced a definitive agreement with Celularity, Inc. (“Celularity”), under which Celularity will acquire all of the property, assets and rights relating to the Company’s advanced biologic wound care business - including Biovance® amniotic membrane allograft and Interfyl® Human Connective Tissue Matrix - and the Company’s UltraMist® Therapy System and other therapeutic ultrasound platform products for an aggregate cash consideration of $29.0 million. No debt or significant liabilities are being assumed by Celularity in the transaction. Alliqua BioMedical’s Board of Directors unanimously approved entering into the agreement.\n“This is a transformative transaction for Alliqua,” said David Johnson, Chief Executive Officer of Alliqua. “First, we will be able to strengthen our balance sheet by paying our debt in full. Second, we believe we will have an appropriate amount of working capital to drive our operating business forward in a positive way. Finally, we will evaluate the appropriate options to allocate capital to maximize shareholder value.”\n“The acquisition of Alliqua’s commercial infrastructure and product portfolio in the field of regeneration advances Celularity’s goal of bringing back under one entity the proprietary end-to-end regenerative pipeline that was pioneered by Celularity’s predecessor company, Anthrogenesis Corporation,” mentioned Dr. Robert Hariri, Founder and CEO of Celularity. “This acquisition further positions Celularity to become the world leader in cell therapy and regenerative medicine, which have the potential to treat or cure many of today’s most debilitating illnesses.”\nThe asset purchase agreement includes all intellectual property and all license, marketing, development and supply agreements related to these businesses. The Company’s contract manufacturing assets and operations are not included in the asset purchase agreement. The transaction is subject to certain customary closing conditions, including, among other things, Alliqua BioMedical stockholder approval. There are no financing conditions associated with the transaction.\nCowen served as Alliqua’s exclusive financial advisor in connection with this transaction.\nThe above description of the definitive agreement does not purport to be complete and is qualified in its entirety by reference to the definitive agreements, which Alliqua included as an exhibit to its Form 8-K filed today with the Securities and Exchange Commission.\nAdditional Information and Where to Find It\nThis communication is being made in respect of the proposed asset purchase transaction involving Alliqua and Celularity. Alliqua will prepare a proxy statement statement for its stockholders containing the information with respect to the asset purchase transaction specified in Schedule 14A promulgated under the Securities Exchange Act of 1934, as amended, and describing the proposed asset purchase transaction. When completed, a definitive proxy statement will be mailed to Alliqua's stockholders. Alliqua and Celularity may be filing other documents with the SEC as well. INVESTORS ARE URGED TO CAREFULLY READ THE PROXY STATEMENT REGARDING THE PROPOSED ASSET PURCHASE TRANSACTION AND ANY OTHER RELEVANT DOCUMENTS IN THEIR ENTIRETY WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT THE PROPOSED ASSET PURCHASE TRANSACTION. You may obtain copies of all documents filed with the SEC regarding this transaction, free of charge, at the SEC's website, http://www.sec.gov .\nAbout Alliqua BioMedical, Inc.\nAlliqua is a regenerative technologies company committed to restoring tissue and rebuilding lives. Through its sales and distribution network, together with its proprietary products, Alliqua offers solutions that allow clinicians to utilize the latest advances in regenerative technologies to bring improved patient outcomes to their practices.\nAlliqua currently markets the human biologic regenerative technologies, Biovance® and Interfyl®. The Company also markets its UltraMist® Therapy System, which delivers painless, noncontact low-frequency ultrasound below the wound bed to promote the healing process.\nAlliqua can provide a custom manufacturing solution to partners in the medical device and cosmetics industry, utilizing its hydrogel technology. The Company has locations in Yardley, Pennsylvania, Langhorne, Pennsylvania and Eden Prairie, Minnesota.\nFor additional information, please visit http://www.alliqua.com . To receive future press releases via email, please visit http://ir.stockpr.com/alliqua/email-alerts .\nAbout Celularity, Inc.\nCelularity, headquartered in Warren, New Jersey, is a biotechnology company that has leading-edge technology and an associated intellectual property portfolio that uniquely positions Celularity to harness the power of the placenta. Their asset portfolio consists of more than 800 granted patents worldwide, as well as pre-clinical and clinical assets including CAR constructs for allogeneic CAR-T/NK products, and commercial stage biosourcing and functional regeneration businesses. For more information, please visit www.celularity.com . Follow Celularity on Social Media: @Celularity.\nLegal Notice Regarding Forward-Looking Statements:\nThis release contains forward-looking statements. Forward-looking statements are generally identifiable by the use of words like \"may,\" \"will,\" \"should,\" \"could,\" \"expect,\" \"anticipate,\" \"estimate,\" \"believe,\" \"intend,\" or \"project\" or the negative of these words or other variations on these words or comparable terminology. The reader is cautioned not to put undue reliance on these forward-looking statements, as these statements are subject to numerous factors and uncertainties outside of our control that can make such statements untrue, including, but not limited to, the asset purchase transaction not being timely completed, if completed at all; prior to the completion of the asset purchase transaction, Alliqua’s or Celularity's respective businesses experiencing disruptions due to transaction-related uncertainty or other factors making it more difficult to maintain relationships with employees, business partners or governmental entities; and the parties being unable to successfully implement integration strategies or realize the anticipated benefits of the acquisition, including the possibility that the expected synergies and cost reductions from the proposed acquisition will not be realized or will not be realized within the expected time period. In addition, other factors that could cause actual results to differ materially are discussed in our filings with the SEC, including our most recent Annual Report on Form 10-K filed with the SEC, and our most recent Form 10-Q filings with the SEC. Investors and security holders are urged to read these documents free of charge on the SEC's web site at http://www.sec.gov . We undertake no obligation to publicly update or revise our forward-looking statements as a result of new information, future events or otherwise.\nCONTACT: Investor Relations Alliqua: Westwicke Partners on behalf of Alliqua Biomedical, Inc. Mike Piccinino, CFA +1-443-213-0500 AlliquaBiomedical@westwicke.com\nSource:Alliqua BioMedical, Inc", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/c5518e08-ad59-4b2e-96ba-28ca82864a90", "http://ir.stockpr.com/alliqua/email-alerts"], "published": "2018-01-06T00:30:00.000+02:00", "crawled": "2018-01-06T00:55:26.007+02:00", "highlightTitle": ""}