{"organizations": [], "uuid": "2e1af862a96d96a6e93edb9b22db363d4f4d9f07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/geberit-results/update-1-geberit-sales-pick-up-in-q4-germany-still-tough-idUSL8N1PD0RL", "country": "US", "domain_rank": 408, "title": "UPDATE 2-German labour shortage, refugee factor weigh on Geberit sales growth", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T14:35:00.000+02:00", "replies_count": 0, "uuid": "2e1af862a96d96a6e93edb9b22db363d4f4d9f07"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/geberit-results/update-1-geberit-sales-pick-up-in-q4-germany-still-tough-idUSL8N1PD0RL", "ord_in_thread": 0, "title": "UPDATE 2-German labour shortage, refugee factor weigh on Geberit sales growth", "locations": [], "entities": {"persons": [{"name": "christian buhl", "sentiment": "none"}, {"name": "john revill", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}, {"name": "zurich", "sentiment": "none"}], "organizations": [{"name": "geberit", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Shortage of fitters still a problem in Germany\n* Full year sales growth rate beats guidance\n* Sees no more impact from refugees homes in Germany (Adds CEO comments, analysts)\nBy John Revill\nZURICH, Jan 18 (Reuters) - A shortage of qualified fitters and the use of cheaper installations in homes built for refugees in Germany weighed on Geberit’s sales growth in 2017, the company said on Thursday.\nThe Swiss sanitary products maker reported a sharp deceleration in sales growth last year as Germany -- by far its biggest market with 30 percent of its sales -- struggled.\nNevertheless, its annual sales rose to 2.91 billion Swiss francs ($3.03 billion), matching the average estimate in a Reuters poll of analysts.\nThe 3.5 percent increase in currency- and acquisition-adjusted terms beat guidance of around 3 percent the company gave in October, sending the stock higher.\nChief Executive Christian Buhl said lower prices in Germany were a one-time effect from new apartments built to house refugees last year. Germany took in more than a million migrants and refugees in 2015-16, many fleeing wars in the Middle East.\nHe could not quantify how much the use of cheaper piping and toilets for such homes had subdued prices, but did not expect the situation to affect Geberit this year.\n“We had more projects on the lower end due to the refugee buildings,” he told reporters on a call.\n“The majority of these buildings are built now. We expect a normal market environment in 2018.”\nAnalysts said it was unlikely that many of the new refugee buildings would feature Geberit’s shower toilets, which can cost more than 3,000 Swiss francs ($3,120) each.\n“Geberit is pursuing an up-selling strategy, but if you have a shift in Germany from single family homes to multi-family accommodation, that is going to be detrimental to the company’s sales,” said Bernd Pomrehn, an analyst at Bank Vonotbel.\nAnother problem was the shortage of qualified fitters in Germany.\n“More than 50 percent of installer companies have open jobs currently and they are looking desperately for people,” Buhl said.\n“We hear constantly the same issue - ‘I don’t find people... my son doesn’t want to take over the business.’ We believe that is a clear capacity constraint in the German market.”\nGeberit, whose results are seen as a signal for the condition of the broader building suppliers market, said it expected a broadly favourable development in the European construction market this year.\nMarta Bruska, an analyst from Baader Helvea, remained cautious about the stock she rates at sell.\n“We question if more than 16 percent organic growth in a mature Swiss market is sustainable in 2018 and point out that Geberit’s other important markets are likely to cool down – Germany and Nordics are both likely to perform worse in 2018 than in 2017,” she said.\n$1 = 0.9614 Swiss francs Reporting by John Revill; Editing by Michael Shields\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T14:35:00.000+02:00", "crawled": "2018-01-19T12:43:48.014+02:00", "highlightTitle": ""}