{"organizations": [], "uuid": "66a18a9e18d32071745dd6918858b28e6aa8f738", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/11", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-enterprise-reports-record-2017-results.html", "country": "US", "domain_rank": 767, "title": "Enterprise Reports Record 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:00:00.000+02:00", "replies_count": 0, "uuid": "66a18a9e18d32071745dd6918858b28e6aa8f738"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-enterprise-reports-record-2017-results.html", "ord_in_thread": 0, "title": "Enterprise Reports Record 2017 Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON--(BUSINESS WIRE)-- Enterprise Products Partners L.P. (“Enterprise”) (NYSE: EPD) today announced its financial results for the three months and twelve months ended December 31, 2017.\nEnterprise reported a 10 percent increase in operating income to $3.9 billion for 2017 compared to $3.6 billion for 2016. Total gross operating margin for 2017 increased 8 percent to a record $5.7 billion from $5.2 billion in 2016. Net cash flow provided by operating activities for 2017 increased 14 percent to $4.6 billion from $4.1 billion in 2016. Distributable cash flow, excluding proceeds from asset sales, increased 10 percent to a record $4.5 billion in 2017 from $4.1 billion in 2016. Total gross operating margin and distributable cash flow are non-generally accepted accounting principle (“non-GAAP”) financial measures that are defined and reconciled later in this press release.\nEnterprise declared distributions with respect to 2017 representing a 4.5 percent increase compared to those declared with respect to 2016. Distributable cash flow provided 1.2 times coverage of the distributions declared with respect to 2017. Enterprise retained $867 million of distributable cash flow in 2017 to reinvest in the growth of the partnership.\n“Enterprise reported record operating and financial results in 2017 as the energy industry began to emerge from a challenging three-year commodity cycle,” stated Jim Teague, chief executive officer of Enterprise’s general partner. “We posted record liquid pipeline volumes and marine terminal volumes. Our strong financial performance in 2017 provided us the financial flexibility to provide our partners with 4.5 percent distribution growth and 1.2 times distribution coverage for the year while self-funding approximately 55 percent of the equity portion of our $3.1 billion of investments in organic growth capital projects and acquisitions during the year. Based on expected distributable cash flow growth from new projects and our existing assets, we believe we can deliver on our goal of providing our partners moderate distribution growth and fully self-funding the equity portion of our growth capital investments in 2019, assuming $2.5 billion to $3.0 billion in growth capital expenditures. We believe we can accomplish this while maintaining one of the strongest investment grade balance sheets in the midstream sector.”\nTeague added, “During 2017, Enterprise completed construction and either began service or commissioning activities on projects representing $4.5 billion of capital investment. In the fourth quarter, we began limited service on our Midland-to-ECHO pipeline moving a single grade of crude oil from the Permian Basin to the Houston refining and export market. We expect to be in full service on this pipeline early in the second quarter of 2018. Also during the quarter, we began commissioning activities at our new propane dehydrogenation, or PDH, facility. This plant has been running near full capacity and is in the latter stages of the commissioning phase. During 2017, other major growth projects completed include an expansion of our ATEX ethane pipeline; expansion of our propylene pipeline infrastructure on the U.S. Gulf Coast; and expansion of our refined products and crude oil marine terminals in Beaumont.”\n“Enterprise currently has another $5.5 billion of growth projects under construction. In 2018, we expect to complete projects representing $2.7 billion of capital investment. These major projects include: completing the Midland-to-ECHO crude oil pipeline system and bringing it into full commercial service; our ninth NGL fractionator at Mont Belvieu; two natural gas processing plants at our Orla Complex in the Delaware Basin; and expansion of Enterprise’s NGL, crude oil and refined products storage facilities,” said Teague.\n“Our success in 2017 would not have been possible without the daily creativity and hustle by our team of over 6,700 employees. This success included the best year in our history in terms of safety achievement. Our employees are the foundation of our safe and reliable operations and the heart of our customer service. Looking ahead, we are excited about the potential for 2018. We are actively working to develop and underwrite growth capital projects in all four of our business segments. I would also like to thank our debt and equity investors for their continued support as we invest to expand Enterprise’s integrated midstream energy system,” Teague concluded.\nFourth Quarter and Full Year Financial Highlights\nThree months ended\nDecember 31,\nTwelve months ended\nDecember 31,\n2017 2016 2017 2016 ($ in millions, except per unit amounts) Operating income $ 1,079 $ 923 $ 3,929 $ 3,581 Net income (1)\n$ 797 $ 670 $ 2,856 $ 2,553 Fully diluted earnings per unit (1)\n$ 0.36 $ 0.31 $ 1.30 $ 1.20 Net cash flow provided by operating activities (2)\n$\n1,820\n$\n1,408\n$\n4,640\n$\n4,067\nTotal gross operating margin (3)\n$ 1,520 $ 1,357 $ 5,680 $ 5,248 Adjusted EBITDA (3)\n$ 1,542 $ 1,355 $ 5,615 $ 5,256 Distributable cash flow (3)(4)\n$ 1,257 $ 1,031 $ 4,502 $ 4,103 (1) Net income and fully diluted earnings per unit for the fourth quarters of 2017 and 2016 include non-cash impairment charges of approximately $15 million, or $0.01 per unit, and $24 million, or $0.01 per unit, respectively. For the years ended December 31, 2017 and 2016, net income and fully diluted earnings per unit include non-cash impairment and related charges of $50 million, or $0.02 per unit, and $54 million, or $0.03 per unit, respectively. (2) Net cash flow provided by operating activities includes the impact of timing of cash receipts and payments related to operations. For the fourth quarters of 2017 and 2016, the net effect of changes in operating accounts, which are a component of net cash flow provided by operating activities, were net increases of $518 million and $309 million, respectively. For the years ended December 31, 2017 and 2016, the net effect of changes in operating accounts were a net increase of $6 million and a net decrease of $181 million, respectively. (3) Total gross operating margin, adjusted earnings before interest, taxes, depreciation and amortization (“Adjusted EBITDA”) and distributable cash flow are non-GAAP financial measures that are defined and reconciled later in this press release. (4) Distributable cash flow included proceeds from asset sales of $34 million and $3 million for the fourth quarters of 2017 and 2016, respectively, and $40 million and $47 million for the years ended December 31, 2017 and 2016, respectively. Enterprise increased its cash distribution with respect to the fourth quarter of 2017 by 3.7 percent over the fourth quarter of 2016 to $0.425 per unit, or $1.70 per unit on an annualized basis. This is the 54 th consecutive quarterly increase and the 63 rd increase since the partnership’s initial public offering in 1998. This distribution will be paid on February 7, 2018 to unitholders of record as of the close of business on January 31, 2018; Excluding proceeds from asset sales, Enterprise reported a 19 percent increase in distributable cash flow to a record $1.2 billion for the fourth quarter of 2017 compared to the fourth quarter of 2016, which provided 1.3 times coverage of the $0.425 per unit cash distribution. Enterprise retained $335 million of distributable cash flow in the fourth quarter of 2017.\nFourth Quarter Volume Highlights\nThree months ended December 31,\n2017 2016 NGL, crude oil, refined products & petrochemical\npipeline volumes (million BPD)\n6.0\n5.3\nMarine terminal volumes (million BPD) 1.7 1.3 Natural gas pipeline volumes (TBtu/d) 12.9 11.5 NGL fractionation volumes (MBPD) 863 846 Fee-based natural gas processing volumes (Bcf/d) 4.3 4.4 Equity NGL production volumes (MBPD) 153 156 As used in this press release, “NGL” means natural gas liquids, “BPD” means barrels per day, “MBPD” means thousand barrels per day, “Bcf/d” means billion cubic feet per day; and “TBtu/d” means trillion British thermal units per day.\nCapital investments were $1.0 billion in the fourth quarter of 2017, including $80 million of sustaining capital expenditures. Total capital investments for 2017 was $3.4 billion, which included $244 million of sustaining capital expenditures. Affiliates of privately held Enterprise Products Company (“EPCO”), which collectively own Enterprise’s general partner and approximately 32 percent of Enterprise’s outstanding limited partner interests, have indicated to Enterprise management that they plan to purchase $100 million of Enterprise common units through the partnership’s distribution reinvestment plan (“DRIP”) with the February 2018 distribution.\nTeague said, “Enterprise completed 2017 with a record fourth quarter. Operationally, our record performance included liquids pipeline volumes of 6.0 million barrels per day; marine terminal volumes of 1.7 million barrels per day; NGL fractionation volumes of 863,000 barrels per day; as well as near record onshore natural gas pipeline volumes of 12.9 trillion Btus per day. In NGLs, this performance was largely attributable to an increase in NGL volumes on our pipelines serving the Permian and Marcellus shale plays and record ethane export volumes of 135,000 barrels per day. In our crude oil business, our Midland-to-ECHO crude oil pipeline began commissioning and limited service in November 2017. We also benefited from record crude oil export volumes of 451,000 barrels per day during the fourth quarter. In our natural gas business, we had record volumes on our gathering and Acadian Gas systems serving the Haynesville shale and a resurgence of volume in the Jonah/Pinedale and Piceance regions.\n“This operational performance, coupled with higher natural gas processing margins and lower turnaround expenses in our petrochemical segment, led to record quarterly financial performance in terms of operating income, gross operating margin, Adjusted EBITDA, and distributable cash flow excluding proceeds from asset sales,” stated Teague.\nReview of Fourth Quarter 2017 Segment Performance\nNGL Pipelines & Services – Gross operating margin for the NGL Pipelines & Services segment increased 11 percent to $872 million for the fourth quarter of 2017 from $784 million for the fourth quarter of 2016.\nEnterprise’s natural gas processing and related NGL marketing business reported gross operating margin of $225 million for the fourth quarter of 2017 compared to $228 million for the fourth quarter of 2016. Gross operating margin from our natural gas processing business increased $41 million primarily due to higher average processing margins from our Rocky Mountain and Louisiana gas plants and the receipt of $19 million of business interruption insurance proceeds related to an event and resulting downtime at our Pascagoula processing plant in June 2016. Total fee-based processing volumes were 4.3 Bcf/d for the fourth quarter of 2017 compared to 4.4 Bcf/d for the fourth quarter of 2016, while total equity NGL production decreased to 153 MBPD this quarter from 156 MBPD for the fourth quarter of 2016.\nGross operating margin from Enterprise’s NGL marketing activities decreased $44 million for the fourth quarter of 2017 compared to the same quarter in 2016 due to lower average sales margins and volumes. Approximately $14 million of this decrease is attributable to higher non-cash, mark-to-market loss activity in the fourth quarter of 2017 compared to the fourth quarter of 2016.\nGross operating margin from the partnership’s NGL pipelines and storage business increased 20 percent, to $495 million for the fourth quarter of 2017 from $413 million for the fourth quarter of 2016. NGL pipeline volumes were a record 3.3 million BPD for the fourth quarter of 2017 compared to 3.1 million BPD for the same quarter of 2016. Total NGL marine terminal volumes increased 28 percent to 564 MBPD for the fourth quarter of 2017 compared to 440 MBPD for the fourth quarter of 2016.\nEnterprise’s ATEX ethane pipeline reported a $22 million increase in gross operating margin for the fourth quarter of 2017 compared to the fourth quarter of 2016, primarily due to a 31 MBPD increase in volume. Average transportation volumes on the ATEX pipeline were 144 MBPD for the fourth quarter of 2017 versus 113 MBPD for the same quarter of 2016. Gross operating margin from the partnership’s ethane export terminal at Morgan’s Point and related Houston Ship Channel pipeline increased $24 million, primarily due to a 121 MBPD increase in ethane loadings during the fourth quarter of 2017 compared to the fourth quarter of 2016.\nGross operating margin from the Mid-America and Seminole pipelines, and related assets increased by $16 million to $143 million for the fourth quarter of 2017 compared to the same quarter in 2016. Aggregate volumes on these pipelines increased 60 MBPD to 1.0 million BPD for the fourth quarter of 2017. Enterprise’s NGL storage business reported a $14 million increase in gross operating margin for the fourth quarter of 2017 compared to the fourth quarter of 2016, primarily due to higher storage fees.\nGross operating margin from the partnership’s NGL fractionation business increased 6 percent to $152 million for the fourth quarter of 2017 compared to the fourth quarter of 2016. This increase was primarily due to higher fees, product blending, and higher fractionation volumes from Enterprise’s Mont Belvieu and Hobbs NGL fractionators. Total NGL fractionation volumes were a record 863 MBPD for the fourth quarter of 2017 compared to 846 MBPD for the fourth quarter of 2016.\nCrude Oil Pipelines & Services – Gross operating margin for the Crude Oil Pipelines & Services segment increased 34 percent to $296 million for the fourth quarter of 2017 from $221 million for the fourth quarter of 2016. Total crude oil pipeline volumes were a record 2.0 million BPD for the fourth quarter of 2017 compared to 1.4 million BPD for the fourth quarter of 2016. Total crude oil marine terminal volumes increased to 703 MBPD for the fourth quarter of 2017 from 468 MBPD for the fourth quarter of 2016.\nEnterprise’s Midland-to-ECHO crude oil pipeline, which began commissioning and providing limited services in November 2017, contributed $63 million in gross operating margin on average volumes of 333 MBPD for the quarter. This pipeline is expected to begin full commercial service with committed shippers after construction of all pump stations, connections and related storage facilities are completed in the second quarter of 2018.\nEnterprise’s South Texas and Eagle Ford Crude Oil Pipeline Systems reported an aggregate $36 million increase in gross operating margin for the fourth quarter of 2017 compared to the fourth quarter of 2016, primarily due to higher volumes. The South Texas system includes the Rancho II pipeline, which benefited from volumes delivered on the Midland-to-ECHO pipeline. Total volumes on the South Texas and Eagle Ford pipelines, net to our interest, increased 144 MBPD this quarter to 504 MBPD compared to the fourth quarter of 2016. Gross operating margin from the EFS Midstream assets increased $10 million for the fourth quarter of 2017 compared to the fourth quarter of 2016, primarily due to higher fees.\nGross operating margin from Enterprise’s terminal on the Houston Ship Channel and its Beaumont terminals increased $6 million on an increase in crude oil loadings. Average loading volumes increased to 389 MBPD in the fourth quarter of 2017 from 90 MBPD in the fourth quarter of 2016.\nGross operating margin from Enterprise’s crude oil marketing and related activities decreased $50 million for the fourth quarter of 2017 compared to the same quarter in 2016. This decrease was primarily due to lower sales margins and a $14 million increase in non-cash, mark-to-market losses compared to the fourth quarter of 2016.\nNatural Gas Pipelines & Services –The Natural Gas Pipelines & Services segment reported gross operating margin of $179 million for the fourth quarter of 2017 compared to $201 million for the fourth quarter of 2016. Total natural gas transportation volumes were 12.9 TBtu/d for the fourth quarter of 2017 compared to 11.5 TBtu/d for the fourth quarter of 2016.\nThe partnership’s Texas Intrastate system reported a $31 million decrease in gross operating margin this quarter compared to the fourth quarter of 2016. Gross operating margin for the fourth quarter of 2016 included the benefit of a $28 million lump sum payment associated with the termination of certain transportation contracts. Natural gas pipeline volumes for the Texas Intrastate system were 4.4 TBtu/d for both of the fourth quarters of 2017 and 2016.\nThe partnership’s Haynesville and BTA natural gas gathering systems reported an aggregate $11 million increase in gross operating margin for the fourth quarter of 2017 compared to the same quarter in 2016 due to higher volumes. Total volumes for these systems increased 0.6 TBtu/d to a record 0.8 TBtu/d in the fourth quarter of 2017 compared to the fourth quarter of 2016. We acquired the BTA gathering system as part of the Azure acquisition in April 2017.\nPetrochemical & Refined Products Services – Gross operating margin for the Petrochemical & Refined Products Services segment increased 16 percent to $172 million for the fourth quarter of 2017 compared to the fourth quarter of 2016. Total petrochemical and refined products transportation volumes for the fourth quarter of 2017 were 766 MBPD compared to 840 MBPD reported for the fourth quarter of 2016.\nGross operating margin for Enterprise’s butane isomerization and related operations increased $21 million for the fourth quarter of 2017 compared to the fourth quarter of 2016, primarily due to downtime and costs associated with the turnaround of two processing units in the fourth quarter of 2016. Butane isomerization volumes were 108 MBPD for the fourth quarter of 2017 compared to 94 MBPD for the same quarter of 2016.\nGross operating margin for Enterprise’s octane enhancement and high-purity isobutylene business increased $16 million for the fourth quarter of 2017 compared to the fourth quarter of 2016, primarily due to lower operating costs and higher sales volumes. Total plant production volumes were 27 MBPD for the fourth quarter of 2017 compared to 26 MBPD for the fourth quarter of 2016.\nHigher transportation fees on our TE Products pipeline and related terminals led to a $7 million increase in gross operating margin for the fourth quarter of 2017 compared to the fourth quarter of 2016. Enterprise’s Houston and Beaumont products terminals and related marketing activities reported a $13 million decrease in gross operating margin for the fourth quarter of 2017 compared to the same quarter of 2016, primarily due to higher maintenance expenses as a result of Hurricane Harvey.\nThe partnership’s propylene fractionation business reported a $3 million decrease in gross operating margin for the fourth quarter of 2017 compared to the fourth quarter of 2016, primarily due to higher PDH commissioning costs. Propylene fractionation volumes were 81 MBPD for the fourth quarter of 2017 compared to 67 MBPD for the fourth quarter of last year.\nCapitalization\nTotal debt principal outstanding at December 31, 2017 was $24.8 billion, including $3.2 billion of junior subordinated notes, to which the debt rating agencies ascribe partial equity content. At December 31, 2017, Enterprise had consolidated liquidity of approximately $3.7 billion, which was comprised of unrestricted cash on hand and available borrowing capacity under our revolving credit facilities.\nTotal capital spending in the fourth quarter of 2017 was $1.0 billion, which includes $80 million of sustaining capital expenditures. Capital spending for the year was $3.4 billion, which included $244 million of sustaining capital expenditures. For 2018, we currently expect to invest approximately $3 billion for growth capital projects and approximately $325 million for sustaining capital expenditures.\n2017 K-1 Tax Packages\nThe Enterprise K-1 tax packages are expected to be made available online through our website at www.enterpriseproducts.com by noon (CT) on February 23, 2018 and will be mailed beginning that day as well.\nConference Call to Discuss Fourth Quarter 2017 Earnings\nEnterprise will host a conference call today to discuss fourth quarter 2017 earnings. The call will be broadcast live over the Internet beginning at 9:00 a.m. (CT) and may be accessed by visiting the partnership’s website.\nUse of Non-GAAP Financial Measures\nThis press release and accompanying schedules include the non-GAAP financial measures of total gross operating margin, distributable cash flow and Adjusted EBITDA. The accompanying schedules provide definitions of these non-GAAP financial measures and reconciliations to their most directly comparable financial measure calculated and presented in accordance with GAAP. Our non-GAAP financial measures should not be considered as alternatives to GAAP measures such as net income, operating income, net cash flow provided by operating activities or any other measure of financial performance calculated and presented in accordance with GAAP. Our non-GAAP financial measures may not be comparable to similarly-titled measures of other companies because they may not calculate such measures in the same manner as we do.\nCompany Information and Use of Forward-Looking Statements\nEnterprise Products Partners L.P. is one of the largest publicly traded partnerships and a leading North American provider of midstream energy services to producers and consumers of natural gas, NGLs, crude oil, refined products and petrochemicals. Our services include: natural gas gathering, treating, processing, transportation and storage; NGL transportation, fractionation, storage and export and import terminals; crude oil gathering, transportation, storage and export and import terminals; petrochemical and refined products transportation, storage, export and import terminals and related services; and a marine transportation business that operates primarily on the United States inland and Intracoastal Waterway systems. The partnership’s assets include approximately 50,000 miles of pipelines; 260 million barrels of storage capacity for NGLs, crude oil, refined products and petrochemicals; and 14 Bcf of natural gas storage capacity.\nThis press release includes forward-looking statements. Except for the historical information contained herein, the matters discussed in this press release are forward-looking statements that involve certain risks and uncertainties, such as the partnership’s expectations regarding future results, capital expenditures, project completions, liquidity and financial market conditions. These risks and uncertainties include, among other things, insufficient cash from operations, adverse market conditions, governmental regulations and other factors discussed in Enterprise’s filings with the U.S. Securities and Exchange Commission. If any of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results or outcomes may vary materially from those expected. The partnership disclaims any intention or obligation to update publicly or reverse such statements, whether as a result of new information, future events or otherwise.\nEnterprise Products Partners L.P.\nExhibit A Condensed Statements of Consolidated Operations – UNAUDITED ($ in millions, except per unit amounts) For the Three Months Ended December 31,\nFor the Year Ended December 31,\n2017 2016 2017 2016 Revenues\n$ 8,426.6 $ 6,478.8 $ 29,241.5 $ 23,022.3 Costs and expenses:\nOperating costs and expenses 7,414.3 5,608.7 25,557.5 19,643.5 General and administrative costs 43.7 39.1 181.1 160.1 Total costs and expenses 7,458.0 5,647.8 25,738.6 19,803.6 Equity in income of unconsolidated affiliates\n110.8 92.2 426.0 362.0 Operating income\n1,079.4 923.2 3,928.9 3,580.7 Other income (expense):\nInterest expense (245.6 ) (247.0 ) (984.6 ) (982.6 ) Other, net (30.9 ) 3.8 (63.0 ) (21.7 ) Total other expense (276.5 ) (243.2 ) (1,047.6 ) (1,004.3 ) Income before income taxes\n802.9 680.0 2,881.3 2,576.4 Provision for income taxes (5.6 ) (10.3 ) (25.7 ) (23.4 ) Net income\n797.3 669.7 2,855.6 2,553.0 Net income attributable to noncontrolling interests\n(23.3 ) (10.9 ) (56.3 ) (39.9 ) Net income attributable to limited partners\n$ 774.0 $ 658.8 $ 2,799.3 $ 2,513.1 Per unit data (fully diluted):\nEarnings per unit $ 0.36 $ 0.31 $ 1.30 $ 1.20 Average limited partner units outstanding (in millions) 2,167.0 2,116.6 2,154.3 2,089.1 Supplemental financial data:\nNet cash flows provided by operating activities $ 1,819.7 $ 1,407.8 $ 4,639.6 $ 4,066.8 Total debt principal outstanding at end of period $ 24,780.1 $ 23,901.6 $ 24,780.1 $ 23,901.6 Non-GAAP distributable cash flow (1) $ 1,256.9 $ 1,031.1 $ 4,502.3 $ 4,102.8 Non-GAAP Adjusted EBITDA (2) $ 1,542.0 $ 1,355.1 $ 5,615.3 $ 5,255.9 Gross operating margin by segment: NGL Pipelines & Services $ 871.5 $ 784.3 $ 3,258.3 $ 2,990.6 Crude Oil Pipelines & Services 295.5 220.9 987.2 854.6 Natural Gas Pipelines & Services 178.5 201.3 714.5 734.9 Petrochemical & Refined Products Services 172.0 148.7 714.6 650.6 Total segment gross operating margin (3) 1,517.5 1,355.2 5,674.6 5,230.7 Net adjustment for shipper make-up rights (4) 2.6 2.1 5.8 17.1 Non-GAAP total gross operating margin (5) $ 1,520.1 $ 1,357.3 $ 5,680.4 $ 5,247.8 Capital spending: Capital expenditures $ 983.6 $ 574.3 $ 3,101.8 $ 2,984.1 Cash used for business combinations, net -- -- 198.7 1,000.0 Investments in unconsolidated affiliates 17.7 18.9 50.5 138.8 Other investing activities -- -- -- 0.4 Total capital spending, cash and non-cash $ 1,001.3 $ 593.2 $ 3,351.0 $ 4,123.3 (1) See Exhibit D for reconciliation to GAAP net cash flow provided by operating activities. (2) See Exhibit E for reconciliation to GAAP net cash flow provided by operating activities. (3) Within the context of this table, total segment gross operating margin represents a subtotal and corresponds to measures similarly titled within the financial statement footnotes provided in our quarterly and annual filings with the U.S. Securities and Exchange Commission (“SEC”). (4) Gross operating margin by segment for NGL Pipelines & Services and Crude Oil Pipelines & Services reflects adjustments for non-refundable deferred transportation revenues relating to the make-up rights of committed shippers on certain major pipeline projects. These adjustments are included in managements’ evaluation of segment results. However, these adjustments are excluded from non-GAAP total gross operating margin in compliance with guidance from the SEC. (5) See Exhibit F for reconciliation to GAAP total operating income.\nEnterprise Products Partners L.P.\nExhibit B\nSelected Operating Data – UNAUDITED For the Three Months Ended December 31,\nFor the Year Ended December 31,\n2017 2016 2017 2016 Selected operating data: (1)\nNGL Pipelines & Services, net: NGL pipeline transportation volumes (MBPD) 3,287 3,062 3,168 2,965 NGL marine terminal volumes (MBPD) 564 440 516 436 NGL fractionation volumes (MBPD) 863 846 831 828 Equity NGL production (MBPD) (2) 153 156 158 141 Fee-based natural gas processing (MMcf/d) (3) 4,341 4,384 4,572 4,736 Crude Oil Pipelines & Services, net: Crude oil pipeline transportation volumes (MBPD) 1,987 1,402 1,820 1,388 Crude oil marine terminal volumes (MBPD) 703 468 531 495 Natural Gas Pipelines & Services, net: Natural gas pipeline transportation volumes (BBtus/d) (4) 12,943 11,476 12,305 11,874 Petrochemical & Refined Products Services, net: Propylene fractionation volumes (MBPD) 81 67 80 73 Butane isomerization volumes (MBPD) 108 94 107 108 Standalone DIB processing volumes (MBPD) 81 84 82 89 Octane additive and related plant production volumes (MBPD) 27 26 26 22 Pipeline transportation volumes, primarily refined products\nand petrochemicals (MBPD)\n766 840 792 837 Refined products and petrochemicals marine terminal volumes\n(MBPD)\n394 417 406 389 Total, net: NGL, crude oil, petrochemical and refined products\npipeline transportation volumes (MBPD)\n6,040 5,304 5,780 5,190 Natural gas pipeline transportation volumes (BBtus/d) 12,943 11,476 12,305 11,874 Equivalent pipeline transportation volumes (MBPD) (5) 9,446 8,324 9,018 8,315 NGL, crude oil, refined products and petrochemical\nmarine terminal volumes (MBPD)\n1,661 1,325 1,453 1,320 (1) Operating rates are reported on a net basis, which takes into account our ownership interests in certain joint ventures, and include volumes for newly constructed assets from the related in-service dates and for recently purchased assets from the related acquisition dates. (2) Represents the NGL volumes we earn and take title to in connection with our processing activities. (3) Volumes reported correspond to the revenue streams earned by our gas plants. “MMcf/d” means million cubic feet per day. (4) “BBtus/d” means billion British thermal units per day. (5) Represents total NGL, crude oil, refined products and petrochemical transportation volumes plus equivalent energy volumes where 3.8 million British thermal units (“MMBtus”) of natural gas transportation volumes are equivalent to one barrel of NGLs transported. Enterprise Products Partners L.P.\nExhibit C Selected Commodity Price Information Polymer Refinery Natural Normal Natural Grade Grade WTI LLS Gas, Ethane, Propane, Butane, Isobutane, Gasoline, Propylene, Propylene, Crude Oil, Crude Oil, $/MMBtu $/gallon $/gallon $/gallon $/gallon $/gallon $/pound $/pound $/barrel $/barrel (1) (2) (2) (2) (2) (2) (3) (3) (4) (4) 2016 by quarter: 1st Quarter $2.09 $0.16 $0.38 $0.53 $0.53 $0.76 $0.31 $0.18 $33.45 $35.11 2nd Quarter $1.95 $0.20 $0.49 $0.62 $0.63 $0.96 $0.33 $0.19 $45.59 $47.35 3rd Quarter $2.81 $0.19 $0.47 $0.63 $0.67 $0.98 $0.38 $0.24 $44.94 $46.52 4th Quarter $2.98 $0.24 $0.58 $0.83 $0.90 $1.08 $0.36 $0.24 $49.29 $50.53 YTD 2016 Averages $2.46 $0.20 $0.48 $0.65 $0.68 $0.94 $0.34 $0.21 $43.32 $44.88 2017 by quarter: 1st Quarter $3.32 $0.23 $0.71 $0.98 $0.94 $1.10 $0.47 $0.32 $51.91 $53.52 2nd Quarter $3.19 $0.25 $0.63 $0.76 $0.75 $1.07 $0.41 $0.28 $48.28 $50.31 3rd Quarter $2.99 $0.26 $0.77 $0.91 $0.92 $1.10 $0.42 $0.28 $48.20 $51.62 4th Quarter $2.93 $0.25 $0.96 $1.04 $1.04 $1.32 $0.49 $0.35 $55.40 $61.07 YTD 2017 Averages $3.11 $0.25 $0.77 $0.92 $0.91 $1.15 $0.45 $0.31 $50.95 $54.13 (1) Natural gas prices are based on Henry-Hub Inside FERC commercial index prices as reported by Platts, which is a division of McGraw Hill Financial, Inc. (2) NGL prices for ethane, propane, normal butane, isobutane and natural gasoline are based on Mont Belvieu Non-TET commercial index prices as reported by Oil Price Information Service. (3) Polymer-grade propylene prices represent average contract pricing for such product as reported by IHS Chemical, a division of IHS Inc. (“IHS Chemical”). Refinery grade propylene prices represent weighted-average spot prices for such product as reported by IHS Chemical. (4) Crude oil prices are based on commercial index prices for West Texas Intermediate (“WTI”) as measured on the New York Mercantile Exchange and for Louisiana Light Sweet (“LLS”) as reported by Platts. The weighted-average indicative market price for NGLs (based on prices for such products at Mont Belvieu, Texas, which is the primary industry hub for domestic NGL production) was $0.80 per gallon during the fourth quarter of 2017 versus $0.60 per gallon for the fourth quarter of 2016.\nFluctuations in our consolidated revenues and cost of sales amounts are explained in large part by changes in energy commodity prices. Energy commodity prices fluctuate for a variety of reasons, including supply and demand imbalances and geopolitical tensions.\nA change in our consolidated marketing revenues due to higher energy commodity sales prices may not result in a similar change in gross operating margin or cash available for distribution, since our consolidated cost of sales amounts would also change due to comparable increases in the purchase prices of the underlying energy commodities.\nEnterprise Products Partners L.P.\nExhibit D\nDistributable Cash Flow – UNAUDITED ($ in millions) For the Three Months Ended December 31,\nFor the Year Ended December 31,\n2017 2016 2017 2016 Net income attributable to limited partners (GAAP) $ 774.0 $ 658.8 $ 2,799.3 $ 2,513.1 Adjustments to GAAP net income attributable to limited partners to derive non-\nGAAP distributable cash flow:\nAdd depreciation, amortization and accretion expenses 422.6 396.7 1,644.0 1,552.0 Add distributions received from unconsolidated affiliates 130.0 118.0 483.0 451.5 Subtract equity in income of unconsolidated affiliates (110.8 ) (92.2 ) (426.0 ) (362.0 ) Subtract sustaining capital expenditures (1) (79.8 ) (72.6 ) (243.9 ) (252.0 ) Subtract net gains attributable to asset sales (9.6 ) (0.2 ) (10.7 ) (2.5 ) Add cash proceeds from asset sales 33.9 2.6 40.1 46.5 Add non-cash expense or subtract benefit attributable to changes in fair\nvalue of the Liquidity Option Agreement\n31.3 (3.5 ) 64.3 24.5 Add non-cash expense attributable to changes in\nfair value of derivative instruments\n37.0 2.9 22.8 45.0 Add monetization of interest rate derivative instruments -- 6.1 30.6 6.1 Add deferred income tax expense 5.0 1.3 6.1 6.6 Add non-cash asset impairment and related charges 14.6 24.4 49.8 53.5 Add or subtract other miscellaneous adjustments to derive non-GAAP\ndistributable cash flow, as applicable\n8.7 (11.2 ) 42.9 20.5 Distributable cash flow (non-GAAP) 1,256.9 1,031.1 4,502.3 4,102.8 Adjustments to non-GAAP distributable cash flow to derive GAAP net cash flow\nprovided by operating activities:\nAdd sustaining capital expenditures reflected in distributable cash flow 79.8 72.6 243.9 252.0 Subtract cash proceeds from asset sales reflected in distributable cash flow (33.9 ) (2.6 ) (40.1 ) (46.5 ) Subtract monetization of interest rate derivative instruments -- (6.1 ) (30.6 ) (6.1 ) Add or subtract the net effect of changes in operating accounts, as applicable 517.6 308.8 5.5 (180.9 ) Add or subtract miscellaneous non-cash and other amounts to reconcile non-\nGAAP distributable cash flow with GAAP net cash flow provided by\noperating activities, as applicable\n(0.7 ) 4.0 (41.4 ) (54.5 ) Net cash flow provided by operating activities (GAAP) $ 1,819.7 $ 1,407.8 $ 4,639.6 $ 4,066.8 (1) Sustaining capital expenditures are capital expenditures (as defined by GAAP) resulting from improvements to and major renewals of existing assets. Such expenditures serve to maintain existing operations but do not generate additional revenues. Distributable cash flow\nOur management compares the distributable cash flow we generate to the cash distributions we expect to pay our partners. Using this metric, management computes our distribution coverage ratio. Distributable cash flow is an important non-GAAP liquidity measure for our limited partners since it serves as an indicator of our success in providing a cash return on investment. Specifically, this liquidity measure indicates to investors whether or not we are generating cash flows at a level that can sustain or support an increase in our quarterly cash distributions. Distributable cash flow is also a quantitative standard used by the investment community with respect to publicly traded partnerships because the value of a partnership unit is, in part, measured by its yield, which is based on the amount of cash distributions a partnership can pay to a unitholder. The GAAP measure most directly comparable to distributable cash flow is net cash flow provided by operating activities.\nEnterprise Products Partners L.P.\nExhibit E Adjusted EBITDA – UNAUDITED ($ in millions) For the Three Months Ended December 31,\nFor the Year Ended December 31,\n2017 2016 2017 2016 Net income (GAAP) $ 797.3 $ 669.7 $ 2,855.6 $ 2,553.0 Adjustments to GAAP net income to derive non-GAAP Adjusted EBITDA: Subtract equity in income of unconsolidated affiliates (110.8 ) (92.2 ) (426.0 ) (362.0 ) Add distributions received from unconsolidated affiliates 130.0 118.0 483.0 451.5 Add interest expense, including related amortization 245.6 247.0 984.6 982.6 Add provision for income taxes 5.6 10.3 25.7 23.4 Add depreciation, amortization and accretion in costs and expenses 400.8 378.7 1,565.9 1,486.9 Add non-cash asset impairment and related charges 14.6 24.4 49.8 53.5 Subtract net gains attributable to asset sales (9.6 ) (0.2 ) (10.7 ) (2.5 ) Add non-cash expense or subtract benefit attributable to changes in fair\nvalue of the Liquidity Option Agreement\n31.3 (3.5 ) 64.3 24.5 Add losses attributable to unrealized changes in the fair market\nvalue of commodity derivative instruments\n37.2 2.9 23.1 45.0 Adjusted EBITDA (non-GAAP) 1,542.0 1,355.1 5,615.3 5,255.9 Adjustments to non-GAAP Adjusted EBITDA to derive GAAP net cash flow\nprovided by operating activities:\nSubtract interest expense, including related amortization, reflected in\nAdjusted EBITDA\n(245.6 ) (247.0 ) (984.6 ) (982.6 ) Subtract provision for income taxes reflected in\nAdjusted EBITDA\n(5.6 ) (10.3 ) (25.7 ) (23.4 ) Subtract distributions received for return of capital from\nunconsolidated affiliates\n(12.5 ) (19.1 ) (49.3 ) (71.0 ) Add deferred income tax expense 5.0 1.3 6.1 6.6 Add or subtract the net effect of changes in operating accounts, as applicable\n517.6 308.8 5.5 (180.9 ) Add miscellaneous non-cash and other amounts to reconcile non-GAAP\nAdjusted EBITDA with GAAP net cash flow provided by operating\nactivities\n18.8 19.0 72.3 62.2 Net cash flow provided by operating activities (GAAP) $ 1,819.7 $ 1,407.8 $ 4,639.6 $ 4,066.8 Adjusted EBITDA\nAdjusted EBITDA is commonly used as a supplemental financial measure by our management and external users of our financial statements, such as investors, commercial banks, research analysts and rating agencies, to assess the financial performance of our assets without regard to financing methods, capital structures or historical cost basis; the ability of our assets to generate cash sufficient to pay interest and support our indebtedness; and the viability of projects and the overall rates of return on alternative investment opportunities.\nSince Adjusted EBITDA excludes some, but not all, items that affect net income or loss and because these measures may vary among other companies, the Adjusted EBITDA data presented in this press release may not be comparable to similarly titled measures of other companies. The GAAP measure most directly comparable to Adjusted EBITDA is net cash flow provided by operating activities.\nEnterprise Products Partners L.P.\nExhibit F Total Gross Operating Margin – UNAUDITED ($ in millions) For the Three Months Ended December 31,\nFor the Year Ended December 31,\n2017 2016 2017 2016 Total gross operating margin (non-GAAP) $ 1,520.1 $ 1,357.3 $ 5,680.4 $ 5,247.8 Adjustments to reconcile non-GAAP total gross operating margin to\nGAAP total operating income:\nSubtract depreciation, amortization and accretion expense\namounts not reflected in gross operating margin\n(392.0 ) (371.1 ) (1,531.3 ) (1,456.7 ) Subtract non-cash asset impairment and related charges not\nreflected in gross operating margin\n(14.6 ) (24.1 ) (49.8 ) (52.8 ) Add net gains attributable to asset sales\nnot reflected in gross operating margin\n9.6 0.2 10.7 2.5 Subtract general and administrative costs not reflected in\ngross operating margin\n(43.7 ) (39.1 ) (181.1 ) (160.1 ) Total operating income (GAAP) $ 1,079.4 $ 923.2 $ 3,928.9 $ 3,580.7 Total gross operating margin\nWe evaluate segment performance based on our financial measure of gross operating margin. Gross operating margin is an important performance measure of the core profitability of our operations and forms the basis of our internal financial reporting. We believe that investors benefit from having access to the same financial measures that our management uses in evaluating segment results.\nThe term “total gross operating margin” represents GAAP operating income exclusive of (i) depreciation, amortization and accretion expenses, (ii) impairment charges, (iii) gains and losses attributable to asset sales, and (iv) general and administrative costs. Total gross operating margin includes equity in the earnings of unconsolidated affiliates, but is exclusive of other income and expense transactions, income taxes, the cumulative effect of changes in accounting principles and extraordinary charges. Total gross operating margin is presented on a 100 percent basis before any allocation of earnings to noncontrolling interests. The GAAP financial measure most directly comparable to total gross operating margin is operating income.\nTotal gross operating margin excludes amounts attributable to shipper make-up rights as described in footnote (4) to Exhibit A of this press release.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005321/en/\nEnterprise Products Partners L.P.\nRandy Burkhalter, 713-381-6812\nVice President, Investor Relations\nor\nRick Rainey, 713-381-3635\nVice President, Media Relations\nSource: Enterprise Products Partners L.P.", "external_links": ["http://www.businesswire.com/news/home/20180131005321/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.enterpriseproducts.com&esheet=51751263&newsitemid=20180131005321&lan=en-US&anchor=www.enterpriseproducts.com&index=1&md5=59e251d134bb5012af5d0dd5863a0242"], "published": "2018-01-31T14:00:00.000+02:00", "crawled": "2018-01-31T18:59:57.002+02:00", "highlightTitle": ""}