{"organizations": [], "uuid": "488ab2d5e8b462b18bee529b026890f588bd885a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-corporate-bond-pricing-initiative-bondcliq-hires-paul-faust-former-blackrock-executive.html", "country": "US", "domain_rank": 767, "title": "Corporate Bond Pricing Initiative, BondCliQ, Hires Paul Faust, Former BlackRock Executive", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T23:44:00.000+02:00", "replies_count": 0, "uuid": "488ab2d5e8b462b18bee529b026890f588bd885a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-corporate-bond-pricing-initiative-bondcliq-hires-paul-faust-former-blackrock-executive.html", "ord_in_thread": 0, "title": "Corporate Bond Pricing Initiative, BondCliQ, Hires Paul Faust, Former BlackRock Executive", "locations": [], "entities": {"persons": [{"name": "paul faust", "sentiment": "negative"}, {"name": "faust", "sentiment": "none"}, {"name": "chris white", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "blackrock", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ex-Head of BlackRock Fixed Income Trading will help develop the system to improve price integrity and liquidity in the corporate bond market.\nNEW YORK--(BUSINESS WIRE)-- BondCliQ, the corporate bond market’s first central market system, announces the addition of former BlackRock executive, Paul Faust, as Head of Strategy and Product Development. Paul will be responsible for working with sell-side dealers on integrating their pre-trade Quote: s into the US corporate bond market’s first consolidated Quote: screen.\n“The credit market is finally coming around to understanding that the block liquidity freeze is really a data issue, not an e-trading issue,” said Faust. “I couldn’t be more excited to join BondCliQ’s efforts to improve the institutional market for both dealers and buy-side institutions.”\n“Paul’s background as a buy-side and sell-side trader is critical to ensuring that we build the right solution for the market,” said BondCliQ CEO, Chris White. “In addition, Paul has experience developing best-in-class front end technology through his involvement with the Aladdin OMS, making him a perfect addition to our team.”\nPaul Faust’s hire is the latest sign of the growing momentum at the 18-month old startup that has already launched a post-trade data visualization screen which is being used by 3 of the 10 top US asset managers. The consolidated pre-trade screen is in beta, with launch due next quarter fueled by 8 dealers who are already contributing their pre-trade Quote: s and an additional 8 dealers in the procurement process.\nAbout BondCliQ:\nBondCliQ is the first central market system for US corporate bonds and is designed to improve institutional trading in the $10 trillion credit market. The concept is certified by history as a key building block to market modernization and provides meaningful benefits to all market participants including sell-side, buy-side, platforms and regulators. The BondCliQ central market system:\nCentralizes and organizes institutional pre-trade Quote: s Creates a formalized price formation process Establishes a competitive environment for institutional market making Empowers market makers to become more active trading participants\nThe BondCliQ Team is uniquely qualified to bring an innovative solution to the US corporate bond market because of their invaluable experience in fixed income technology and market development including senior roles at Goldman Sachs, NYSE, MarketAxess and TruMid. To read more visit www.bondcliq.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180118006349/en/\nBondCliQ\nTim Reed, CMO\ntim@bondcliq.com\nSource: BondCliQ", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.bondcliq.com&esheet=51745559&newsitemid=20180118006349&lan=en-US&anchor=www.bondcliq.com&index=1&md5=e5a27c7bff8ab41728ea0f124ca00377", "http://www.businesswire.com/news/home/20180118006349/en/"], "published": "2018-01-18T23:44:00.000+02:00", "crawled": "2018-01-19T01:24:01.004+02:00", "highlightTitle": ""}