{"organizations": [], "uuid": "250591e70acaf38bd0c8c26aa150843243a0f7f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-fair-isaac-corporation-announces-date-for-reporting-of-first-quarter-fiscal-2018-financial-results.html", "country": "US", "domain_rank": 767, "title": "Fair Isaac Corporation Announces Date for Reporting of First Quarter Fiscal 2018 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T00:15:00.000+02:00", "replies_count": 0, "uuid": "250591e70acaf38bd0c8c26aa150843243a0f7f9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-fair-isaac-corporation-announces-date-for-reporting-of-first-quarter-fiscal-2018-financial-results.html", "ord_in_thread": 0, "title": "Fair Isaac Corporation Announces Date for Reporting of First Quarter Fiscal 2018 Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "san jose", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "pacific", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "fair isaac corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "thomson", "sentiment": "none"}, {"name": "thomson streetevents network", "sentiment": "none"}, {"name": "fico", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN JOSE, Calif., FICO (NYSE:FICO), a leading predictive analytics and decision management software company, will announce its first quarter fiscal 2018 results on January 25, 2018, after the market closes and will host a conference call on January 25 at 5:00 p.m. Eastern Time (4:00 p.m. Central/ 2:00 p.m. Pacific).\nThis call will be webcast and can be accessed at FICO's website at www.fico.com/investors . A replay of the webcast will be available through January 25, 2019 and can be accessed at our Past Events page.\nThe webcast will also be distributed through the Thomson StreetEvents Network to both institutional and individual investors. The webcast can be accessed via Thomson's password-protected event management site, StreetEvents ( www.streetevents.com ).\nAbout FICO\nFICO (NYSE: FICO) powers decisions that help people and businesses around the world prosper. Founded in 1956 and based in Silicon Valley, the company is a pioneer in the use of predictive analytics and data science to improve operational decisions. FICO holds more than 165 US and foreign patents on technologies that increase profitability, customer satisfaction and growth for businesses in financial services, telecommunications, health care, retail and many other industries. Using FICO solutions, businesses in more than 100 countries do everything from protecting 2.6 billion payment cards from fraud, to helping people get credit, to ensuring that millions of airplanes and rental cars are in the right place at the right time.\nLearn more at http://www.fico.com\nJoin the conversation at https://twitter.com/fico & http://www.fico.com/en/blogs/\nFICO is a registered trademark of Fair Isaac Corporation in the US and other countries.\nStatement Concerning Forward-Looking Information\nExcept for historical information contained herein, the statements contained in this news release that relate to FICO or its business are forward-looking statements within the meaning of the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially, including the success of the company's Decision Management strategy and reengineering initiative, the maintenance of its existing relationships and ability to create new relationships with customers and key alliance partners, its ability to continue to develop new and enhanced products and services, its ability to recruit and retain key technical and managerial personnel, competition, regulatory changes applicable to the use of consumer credit and other data, the failure to realize the anticipated benefits of any acquisitions, continuing material adverse developments in global economic conditions, and other risks described from time to time in FICO's SEC reports, including its Annual Report on Form 10-K for the year ended September 30, 2017. If any of these risks or uncertainties materializes, FICO's results could differ materially from its expectations. FICO disclaims any intent or obligation to update these forward-looking statements.\nFICO is a trademark or registered trademark of Fair Isaac Corporation in the United States and other countries.\n with multimedia: releases/fair-isaac-corporation-announces-date-for-reporting-of-first-quarter-fiscal-2018-financial-results-300584851.html\nSOURCE FICO", "external_links": ["http://www.streetevents.com/", "http://phx.corporate-ir.net/phoenix.zhtml?c=67528&p=irol-irhome", "http://www.fico.com/en/blogs/", "http://www.fico.com/", "https://twitter.com/fico", "http://www.prnewswire.com/news-releases/fair-isaac-corporation-announces-date-for-reporting-of-first-quarter-fiscal-2018-financial-results-300584851.html", "http://phx.corporate-ir.net/phoenix.zhtml?c=67528&p=irol-calendarPast"], "published": "2018-01-19T00:15:00.000+02:00", "crawled": "2018-01-19T00:34:38.004+02:00", "highlightTitle": ""}