{"organizations": [], "uuid": "62f6d888cbf359eca6a5be20025e4bf97806c28a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/26/104970191-RTX4INZZ.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/at-davos-top-execs-discuss-the-metoo-movement-and-women-at-work.html", "country": "US", "domain_rank": 767, "title": "At Davos, top execs discuss the #MeToo movement and women at work", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.044, "site_type": "news", "published": "2018-01-26T16:26:00.000+02:00", "replies_count": 0, "uuid": "62f6d888cbf359eca6a5be20025e4bf97806c28a"}, "author": "Jenna Goudreau", "url": "https://www.cnbc.com/2018/01/26/at-davos-top-execs-discuss-the-metoo-movement-and-women-at-work.html", "ord_in_thread": 0, "title": "At Davos, top execs discuss the #MeToo movement and women at work", "locations": [], "entities": {"persons": [{"name": "denis balibouse", "sentiment": "negative"}, {"name": "christine lagarde", "sentiment": "negative"}, {"name": "erna solberg", "sentiment": "negative"}, {"name": "chetna sinha", "sentiment": "none"}, {"name": "isabelle kocher", "sentiment": "none"}, {"name": "ginni rometty", "sentiment": "none"}, {"name": "fabiola gianotti", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "imf", "sentiment": "negative"}, {"name": "cern", "sentiment": "none"}, {"name": "international trade union confederation", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "ibm", "sentiment": "none"}, {"name": "ituc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Women's equality is a hot topic this week at the World Economic Forum in Davos, Switzerland, where global business and government leaders gather annually to discuss pressing social and economic issues.\nDozens of panels and events have been held on gender, diversity and inclusion, and two specifically focused on sexual harassment .\nOn the main drag outside the conference hall, you'll find The Equality Lounge from women's advocacy group the Female Quotient. The windows are emblazoned with slogans like \"Gender equality is a social and economic issue\" and \"Diversity is good for business.\" There's also an interactive exhibit called \"Women at Work: Myth vs. Reality\" by consumer goods company Procter & Gamble.\nThis year's gathering is also the first to be chaired by all women , including IMF chief Christine Lagarde and IBM CEO Ginni Rometty, and features the biggest ever percentage of female attendees, though they are still in the minority at 20 percent.\nTWEET\nMeanwhile, world leaders like Prime Minister Justin Trudeau of Canada and French President Emmanuel Macron spoke on women's advancement around the world, putting it at the center of their agendas.\nAs these leaders grapple with recent stunning revelations from the #MeToo movement and persistent pay and leadership gaps, there seems clear consensus that something needs to be done. The question is: Where do we go from here? How can businesses and governments address deeply ingrained bias and institutional barriers to women's success and equality at work?\nCNBC Make It caught up with several top executives at major corporations to find out what they're thinking about these issues and where real change might come from.\n\"Being a husband and a father of six daughters, with a mother, two grandmothers and three sisters, I think it's spectacular what's happening with the #MeToo movement,\" says Christopher Nassetta, CEO of Hilton. \"What we need to do in government and in business, and in every aspect of our lives, is to continue to make sure that we create an open environment for this to be discussed and that we continue to shine the bright lights on these issues wherever they still exist.\"\nNassetta says companies should lead by example, and that boards and senior leaders should set the tone that sexual harassment in the workplace \"is unacceptable behavior and, when they find the behavior, root it out and deal with it immediately on a zero-tolerance basis.\"\n\"I think it's spectacular what's happening with the #MeToo movement.\" -Christopher Nassetta, CEO of Hilton When it comes to issues of pay inequality and advancing women up the ladder, he says: \"There's no silver bullet. It's hard.\"\nIn industries where there's no pipeline for women to advance into senior leadership positions, \"we have to build it,\" he says, by actively recruiting, training and developing women.\nOne strategy that's worked for Hilton, Nassetta says, is setting three-year goals against increasing all types of diversity and tying executive compensation, including his own, to achieving those goals.\n\"In business, you have metrics, you measure against them, you compensate people for them, and you'd be amazed at what happens,\" he says. \"I'd like to believe that you wouldn't have to do that, and hopefully when we wake up in 10, 20 years we won't have to do that, but in the meantime you do. We do it.\"\nBeatriz Perez, chief public affairs and sustainability officer at Coca-Cola, notes that this conversation is getting a lot of coverage today but that the movement started years ago. \"There are so many women who fought hard fights that have cleared the pathway for people like me,\" she says.\nshow chapters Arianna Huffington: Women's March, #MeToo and Time's Up will be historic moments for changes in the workplace 8:58 AM ET Sat, 20 Jan 2018 | 01:15 It's now time for companies to catch up, says Perez, by investigating what's happening within their own employee base and closing the pay gap. She also emphasizes the importance of thoughtful hiring, making sure that candidate pools as well as interview panels are diverse to reduce unconscious bias.\nSalesforce has been a leader in this space. For the past two years, the company has annually analyzed the salaries of its almost 30,000 employees and spent nearly $6 million in an attempt to eliminate statistically significant differences in pay. It has also beefed up its parental leave policy and increased access to its high-potential leadership program, which in 2015 resulted in a 33 percent increase in the number of women who were promoted, according to the company.\nSalesforce President Keith Block says: \"For me personally and for our company, equality is a core value. Period. That to me is table stakes for being a good human being and being a good organization.\"", "external_links": [], "published": "2018-01-26T16:26:00.000+02:00", "crawled": "2018-01-26T16:29:05.003+02:00", "highlightTitle": ""}