{"organizations": [], "uuid": "b003e8a2001ff8afb1d86d66620205b4d0e00139", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-lionbridge-strengthens-executive-team-with-new-cmo-and-cro.html", "country": "US", "domain_rank": 767, "title": "Lionbridge Strengthens Executive Team with New CMO and CRO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T17:00:00.000+02:00", "replies_count": 0, "uuid": "b003e8a2001ff8afb1d86d66620205b4d0e00139"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-lionbridge-strengthens-executive-team-with-new-cmo-and-cro.html", "ord_in_thread": 0, "title": "Lionbridge Strengthens Executive Team with New CMO and CRO", "locations": [], "entities": {"persons": [{"name": "jim weber", "sentiment": "none"}, {"name": "jaime punishill", "sentiment": "none"}, {"name": "weber", "sentiment": "none"}, {"name": "punishill", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "waltham", "sentiment": "none"}], "organizations": [{"name": "lionbridge strengthens executive team", "sentiment": "negative"}, {"name": "lionbridge technologies, inc.", "sentiment": "neutral"}, {"name": "cmo", "sentiment": "none"}, {"name": "lionbridge", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WALTHAM, Mass., Jan. 19, 2018 /PRNewswire/ -- Lionbridge Technologies, Inc. , the world's most trusted translation and global digital communications company, today announced it has strengthened its leadership team with the appointment of Jaime Punishill as Chief Marketing Officer (CMO) and Jim Weber in the company's newly created position of Chief Revenue Officer (CRO). Both Punishill and Weber will play key roles in the strategic evolution and growth of Lionbridge as a leader in digital communications, translation and localization.\nAs CMO, Punishill will lead global marketing efforts for Lionbridge, including the evolution of its brand, content, demand generation, digital and product marketing. Further extending the capabilities of the Lionbridge leadership team, the organization has created the position of CRO to deliver the companies entire set of products and services to its customers, as well as to drive revenue into new and existing markets and geographies. Weber will focus on aligning efforts throughout the company to increase revenue and customer satisfaction.\n\"We're thrilled to have Jim and Jaime join our team,\" said John Fennelly, CEO, Lionbridge. \"They are both great collaborators and will enable greater alignment across our large global team. Jaime will lead our innovation teams and drive our expansion into digital marketing, infusing a forward-thinking approach into all programs to help our client CMOs think and work differently in our increasingly digital business economy, and Jim will play a critical role in helping us expand our customer base as well as increase the excellent level of service we already provide to our global customers.\"\nPunishill brings 25 years of experience in emotive marketing, customer strategy and innovation. Most recently, Punishill was Head of Brand Strategy and Digital Marketing at TIAA, a leader in financial services, where he led the relaunch of the TIAA brand. Prior to TIAA, Punishill was the Global Head of Content and Digital Distribution at Thomson Reuters where he designed and built a suite of market leading products using market data, news and analytic insight. He has also held leadership positions at Citibank, Capgemini and Forrester Research.\n\"Today's marketers must deliver an emotionally resonant and consistent branded experience to a global customer base. Lionbridge's linguistic, cultural, creative and machine learning expertise provides unique capabilities for organizations striving to become global brands,\" said Punishill. \"I look forward to driving Lionbridge's own marketing efforts to serve as a beacon and resource to our valued clients around the world as they chart their experiential transformations.\"\nWeber brings more than 20 years of proven experience to Lionbridge, having previously served as CRO of HireRight where he oversaw the sales and account management teams. At HireRight, Weber was responsible for building deeper relationships with customers and driving global revenue growth. He has also held senior sales roles at Thomson Reuters, Barclays Global Investors, California Federal Bank and First Nationwide Bank.\n\"Entering 2018, Lionbridge is uniquely positioned for success and I am impressed with both the breadth of capabilities and the broad customer base,\" said Weber. \"The opportunity to accelerate both growth and innovation in all markets is a key focus, and I look forward to playing my role in supporting a more prosperous and strategic way forward for the organization.\"\nTo learn more about the leaders spearheading Lionbridge's innovation, visit the executive leadership page: https://www.lionbridge.com/en-us/about/management-team .\nAbout Lionbridge\nLionbridge enables more than 4,500 of the world's leading brands to increase global market share and drive deep engagement with their customers and communities. Our innovative cloud technology platforms and our global crowd of more than 400,000 professional cloud workers, provide detail-critical business processes, including translation, online marketing, global content management and application testing solutions, which ensure global brand consistency, local relevancy and technical usability across all touch points of the customer lifecycle. Based in Waltham, Mass., Lionbridge maintains solution centers in 27 countries. To learn more, visit www.lionbridge.com\nMedia Contact:\nLauren Palazzo\nText100\nNALionbridge@text100.com\n+1-617-399-4909\nView original content: http://www.prnewswire.com/news-releases/lionbridge-strengthens-executive-team-with-new-cmo-and-cro-300585124.html\nSOURCE Lionbridge Technologies, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/lionbridge-strengthens-executive-team-with-new-cmo-and-cro-300585124.html", "http://www.lionbridge.com/", "https://www.lionbridge.com/en-us/about/management-team"], "published": "2018-01-19T17:00:00.000+02:00", "crawled": "2018-01-19T21:01:18.093+02:00", "highlightTitle": ""}