{"organizations": [], "uuid": "f10121fee0fe7e52dda9c79fe64a0752a68ff4c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180110.html", "section_title": "Archive News &amp; Video for Wednesday, 10 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-bond-yields-hit-multi-month-highs-on-report-china-may-slow-u-s-bond-purchases-idUSL8N1P53BU", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Bond yields hit multi-month highs on report China may slow U.S. bond purchases", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T20:58:00.000+02:00", "replies_count": 0, "uuid": "f10121fee0fe7e52dda9c79fe64a0752a68ff4c7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-bond-yields-hit-multi-month-highs-on-report-china-may-slow-u-s-bond-purchases-idUSL8N1P53BU", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Bond yields hit multi-month highs on report China may slow U.S. bond purchases", "locations": [], "entities": {"persons": [{"name": "ritvik carvalho", "sentiment": "none"}, {"name": "antoine bouvet", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "none"}, {"name": "mizuho", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}, {"name": "central bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Global bond yields hit multi-month highs\n* Dollar hits 6-week low versus yen\n* World stocks broadly flat after pullback in Asia\nBy Ritvik Carvalho\nLONDON, Jan 10 (Reuters) - Major government bond yields hit multi-month highs on Wednesday, extending earlier gains on a report that Chinese officials have recommended slowing or halting purchases of U.S. government bonds.\nThe yield on 10-year U.S. Treasury hit a 10-month high of 2.59 percent in European trade and was up 4 basis points on the day, pushing the dollar to a six-week low against the Japanese yen.\n“The latest rise (in yields) is caused by the news that Chinese officials are recommending lower purchases of U.S. Treasuries for their FX reserves,” said Mizuho strategist Antoine Bouvet, referring to a Bloomberg report.\n“The market is pricing in this possibility, but we still don’t have much have detail on this.”\nGermany’s 10-year bond yield hit its highest level since the October European Central Bank meeting when policymakers first announced the extension of its bond-buying scheme, with one trader citing heavy supply as the latest trigger for the move.\nA combination of factors has pushed global bond yields higher in recent weeks, with global growth and higher oil prices leading investors to speculate that the world’s major central banks might withdraw from their stimulus programmes sooner rather than later.\nSome investors saw a reduction of bond purchases by the Bank of Japan this week as a potential indication of this.\nAnalysts also said the rise in yields across the board is fuelling speculation among investors as to whether this is the start of a sustained bear market for bonds.\nRabobank analysts on Tuesday sent out a research note asking the question: “Have we finally entered a bond bear market?”\nA global recovery and potential central bank action are possible drivers of a sustained sell-off in bonds, they wrote, although they stopped short of saying that this trend had begun.\nAnalysts also said rising oil prices could have sparked the rise in long-term yields this week, as it could fan inflation further down the road and force central banks to quicken the pace of interest rate rises.\n“If you look at what markets are pricing in (from the Fed), maybe they’re being a little too conservative when it comes to the path of future interest rate rises, particularly when you look at what inflation could potentially start to do, given the sharp rises in commodity prices we’ve seen since the middle of the summer,” said Michael Hewson, chief markets analyst at CMC Markets in London.\nOil prices extended gains, with U.S. crude futures hitting a three-year high on a tight supply balance due to OPEC-led production cuts and a sharper fall in U.S. crude inventories.\nU.S. West Texas Intermediate (WTI) crude traded at $63.53 a barrel, up nearly 1 percent on the day, after having risen as high as $63.59 earlier.\nBrent crude rose 0.4 percent to $69.25 per barrel, staying near its highest level since mid 2015.\nAgainst a basket of currencies, the dollar fell 0.6 percent, its biggest drop in a month, its losses sustained mostly due to a stronger yen.\nThe yen rose to its highest in over a month against the dollar, extending the previous day’s gains after the Bank of Japan trimmed the amount of long-dated bonds it is buying. That left it 1.6 percent higher against the dollar for the week.\nWhile the yen’s move the previous day was in line with the BoJ’s subtle reduction in its bond buying over the past year, or ‘stealth tapering’, the reaction highlighted how sensitive markets are to a pullback in Japan’s massive stimulus.\n“Japanese yields have been rising and this has been reinforcing the move on the yen,” Thu Lan Nguyen, a Frankfurt-based FX strategist at Commerzbank.\nNguyen, however, called the market expectations of an early end to an expansionary BOJ policy “premature” because the bank can defend its 10-year yield target without buying so many bonds, and because inflation pressures in Japan remain low.\nThe Japanese government bond yield ticked up to 0.080 percent, the top of its range in the past several months.\nSHARES MIXED European shares fell, with most sectors except financials in the red as concerns grew over the direction of the bond market.\nThe pan-European STOXX 600 index fell half a percent.\nThe MSCI world equity index, which tracks shares in 47 countries, was up 0.1 percent.\nFor Reuters Live Markets blog on European and UK stock markets open a news window on Reuters Eikon by pressing F9 and type in ‘Live Markets’ in the search bar.\nAsian shares flinched from testing their 2007 record peak as investors booked profits in high-tech shares.\nMSCI’s broadest index of Asia-Pacific shares outside Japan slipped 0.5 percent after six straight days of gains that had taken it within a stone’s throw of the record high touched in November 2007.\nJapan’s Nikkei also shed 0.3 percent, slipping from 26-year highs hit the day before.\nReporting by Ritvik Carvalho; additional reporting by Abhinav Ramnarayan, Tommy Wilkes, and Dhara Ranasinghe in LONDON and Asia markets team; Editing by Catherine Evans and Gareth Jones\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T20:58:00.000+02:00", "crawled": "2018-01-11T12:47:12.003+02:00", "highlightTitle": ""}