{"organizations": [], "uuid": "a10e93da1b141f5ff61a41166da7d7f05706101a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-gigcapital-inc-executive-chairman-of-the-board-of-directors-and-chief-executive-officer-dr-avi-katz-to-participate-as-a.html", "country": "US", "domain_rank": 767, "title": "GigCapital, Inc. Executive Chairman of the Board of Directors and Chief Executive Officer Dr. Avi Katz to Participate as a Panelist at The SPAC Conference on February 15, 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T14:00:00.000+02:00", "replies_count": 0, "uuid": "a10e93da1b141f5ff61a41166da7d7f05706101a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-gigcapital-inc-executive-chairman-of-the-board-of-directors-and-chief-executive-officer-dr-avi-katz-to-participate-as-a.html", "ord_in_thread": 0, "title": "GigCapital, Inc. Executive Chairman of the Board of Directors and Chief Executive Officer Dr. Avi Katz to Participate as a Panelist at The SPAC Conference on February 15, 2018", "locations": [], "entities": {"persons": [{"name": "avi katz", "sentiment": "neutral"}], "locations": [{"name": "palo alto", "sentiment": "none"}, {"name": "delaware", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}], "organizations": [{"name": "gigcapital, inc.", "sentiment": "neutral"}, {"name": "gigcapital, inc", "sentiment": "neutral"}, {"name": "spac", "sentiment": "neutral"}, {"name": "nyse", "sentiment": "neutral"}, {"name": "special purpose acquisition company", "sentiment": "none"}, {"name": "tkp conference center", "sentiment": "none"}, {"name": "inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PALO ALTO, Calif.--(BUSINESS WIRE)-- GigCapital, Inc., (NYSE:GIG.U), a Delaware corporation that is an emerging-growth blank check company formed for the purpose of entering into a merger, share exchange, asset acquisition, stock purchase, recapitalization, reorganization or similar business combination with one or more businesses, also known as a Special Purpose Acquisition Company, or SPAC, today announced that Executive Chairman of the Board of Directors and Chief Executive Officer, Dr. Avi Katz, is scheduled to participate as a panelist in The SPAC Conference on February 15, 2018.\nEvent: The SPAC Conference Date: Thursday, February 15, 2018 Location: TKP Conference Center – New York City Panel Time: 9:10 a.m. Eastern Time Panel Topic: The SPAC Solution: A Look Toward the Future Additional information on The SPAC Conference is available on the conference website at https://spacconference.com/agenda/\nAbout GigCapital, Inc.\nGigCapital, Inc. (NYSE: GIG.U), a Delaware corporation, is a blank check, emerging-growth company (known also as a Special Purpose Acquisition Company, or SPAC), based in Palo Alto, California. The Company was formed in October 2017 for the purpose of entering into a merger, share exchange, asset acquisition, stock purchase, recapitalization, reorganization or similar business combination with one or more businesses, as soon as the appropriate opportunity is identified.\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, including statements regarding our or our management team's expectations, hopes, beliefs, intentions, plans, prospects or strategies regarding the future, including possible business combinations. Any statements contained herein that are not statements of historical fact may be deemed to be forward-looking statements. In addition, any statements that refer to projections, forecasts or other characterizations of future events or circumstances, including any underlying assumptions, are forward-looking statements. The words “anticipate,” “believe,” “continue,” “could,” “estimate,” “expect,” “intends,” “may,” “might,” “plan,” “possible,” “potential,” “predict,” “project,” “should,” “would” and similar expressions may identify forward-looking statements, but the absence of these words does not mean that a statement is not forward-looking. The forward-looking statements contained in this presentation are based on our current expectations and beliefs concerning future developments and their potential effects on us. There can be no assurance that future developments affecting us will be those that we have anticipated. These forward-looking statements involve a number of risks, uncertainties (some of which are beyond our control) or other assumptions that may cause actual results or performance to be materially different from those expressed or implied by these forward-looking statements. Should one or more of these risks or uncertainties materialize, or should any of our assumptions prove incorrect, actual results may vary in material respects from those projected in these forward-looking statements. Additional factors that could cause actual results to differ are discussed under the heading “Risk Factors” and in other sections of GigCapital’s filings with the SEC, and in GigCapital’s current and periodic reports filed or furnished from time to time with the SEC. All forward-looking statements in this press release are made as of the date hereof, based on information available to GigCapital as of the date hereof, and GigCapital assumes no obligation to update any forward-looking statement.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180118005020/en/\nInvestors\nDarrow Associates, Inc.\nJim Fanucchi, 408-404-5400\nir@gigcapitalglobal.com\nSource: GigCapital, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.gigcapitalglobal.com%2F&esheet=51740493&newsitemid=20180118005020&lan=en-US&anchor=GigCapital%2C+Inc.&index=3&md5=c42a91b22861dd1260ede172d0c8d004", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.gigcapitalglobal.com%2F&esheet=51740493&newsitemid=20180118005020&lan=en-US&anchor=GigCapital%2C+Inc.%2C&index=1&md5=dc9214dafa6cd4b28de1603ffd145468", "http://www.businesswire.com/news/home/20180118005020/en/", "https://spacconference.com/agenda/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fspacconference.com%2Fagenda%2F&esheet=51740493&newsitemid=20180118005020&lan=en-US&anchor=https%3A%2F%2Fspacconference.com%2Fagenda%2F&index=2&md5=8053a71e22ca36c8b377a785cfca38e2"], "published": "2018-01-18T14:00:00.000+02:00", "crawled": "2018-01-18T13:23:30.003+02:00", "highlightTitle": ""}