{"organizations": [], "uuid": "0112597dba4168cfe9615a152960c9f953694a0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225125612&w=1200&r=LYNXMPEE0O0RU", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-davos-meeting-canada-cenbank/bank-of-canadas-poloz-says-even-he-doesnt-know-future-of-rate-hikes-idUSKBN1FE1I4", "country": "US", "domain_rank": 408, "title": "Bank of Canada's Poloz says even he doesn't know future of rate hikes", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T13:44:00.000+02:00", "replies_count": 0, "uuid": "0112597dba4168cfe9615a152960c9f953694a0b"}, "author": "", "url": "https://www.reuters.com/article/us-davos-meeting-canada-cenbank/bank-of-canadas-poloz-says-even-he-doesnt-know-future-of-rate-hikes-idUSKBN1FE1I4", "ord_in_thread": 0, "title": "Bank of Canada's Poloz says even he doesn't know future of rate hikes", "locations": [], "entities": {"persons": [{"name": "poloz", "sentiment": "negative"}, {"name": "stephen poloz", "sentiment": "none"}, {"name": "jeremy gaunt", "sentiment": "none"}, {"name": "andrea hopkins", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "ottawa", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "poloz", "sentiment": "negative"}, {"name": "bank of canada", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "reuters) - bank of canada", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 11:51 AM / Updated 19 minutes ago Bank of Canada's Poloz says even he doesn't know future of rate hikes Andrea Hopkins 3 Min Read \nOTTAWA (Reuters) - Bank of Canada Governor Stephen Poloz said on Thursday that even he did not know what potential there may be for further interest rate hikes this year, reiterating that policymakers remained both data dependent and alert to developments with NAFTA. \n“That’s a question even I don’t know the answer to. We’re being very open about that. So we’ve explained to people that there are a number of important issues that force us to not be mechanical or to use a rule or to plan ahead in that way. We’ve said we are totally data dependent,” Poloz said in an interview with CNBC at the World Economic Forum in Davos, Switzerland. \nThe Bank of Canada raised rates last week for the third time in seven months but gave no clear direction on the future path of monetary policy, which was made hard to gauge by uncertainty over the future of the North American Free Trade Agreement. \nPoloz said NAFTA is the “number one” thing that keeps him up at night, followed by high household debt and the risk of cyber attacks. \n“One of the most important (issues) is with the level of debt we have today, compared to what we had 10 years ago. We are absolutely certain the economy will prove to be more sensitive to higher interest rates than in the past,” Poloz said. \nAsked if the central bank was also “NAFTA dependent,” Poloz said: “Oh yes, very.” But he said it was impossible to do the arithmetic ahead of time to know what policy response may be needed if the trade deal is terminated or significantly altered. \n“If the economy began to slow as a result, then we’d be able to put those pieces together, then it would go into the mix, the inflation target would be at risk, and we’d be cutting rates into that. But a lot of things could move at the time,” Poloz said, citing a foreign exchange, fiscal or trade policy adjustment. \nU.S. President Donald Trump has threatened to pull out of NAFTA. The sixth and penultimate round of negotiations to update NAFTA opened in Montreal on Tuesday with time running out for Canada and Mexico to settle big differences with the United States. \nPoloz declined to comment directly on the Canadian dollar, saying the “exchange rate is what markets drive it to be” and that companies can adapt to changes in the currency’s value. Reporting by Andrea Hopkins; Editing by Bernadette Baum and Chizu Nomiyama", "external_links": [], "published": "2018-01-25T13:44:00.000+02:00", "crawled": "2018-01-25T14:11:04.007+02:00", "highlightTitle": ""}