{"organizations": [], "uuid": "6c54146c19e76ceb94daa74cb788c48932e6d6c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-china-rights/detained-chinese-rights-lawyer-charged-with-subversion-of-state-power-wife-idUSKBN1FJ0HO", "country": "US", "domain_rank": 408, "title": "Detained Chinese rights lawyer charged with subversion of state power: wife", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T07:30:00.000+02:00", "replies_count": 0, "uuid": "6c54146c19e76ceb94daa74cb788c48932e6d6c2"}, "author": "", "url": "https://www.reuters.com/article/us-china-rights/detained-chinese-rights-lawyer-charged-with-subversion-of-state-power-wife-idUSKBN1FJ0HO", "ord_in_thread": 0, "title": "Detained Chinese rights lawyer charged with subversion of state power: wife", "locations": [], "entities": {"persons": [{"name": "christian shepherd", "sentiment": "none"}, {"name": "xu yan", "sentiment": "none"}, {"name": "yu wensheng", "sentiment": "none"}, {"name": "yu", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "xuzhou", "sentiment": "none"}, {"name": "jiangsu", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - The wife of detained Chinese rights lawyer Yu Wensheng said on Tuesday her husband had been charged with “inciting subversion of state power” and that police have summonsed her after she gave interviews to foreign media.\nYu, who has been an outspoken critic of a Chinese government crackdown on his fellow rights lawyers and activists, was taken by authorities from outside his home in Beijing on Jan. 19 shortly after he was stripped of his legal license.\nYu’s wife, Xu Yan, said police informed her on Saturday that her husband was being charged with “inciting subversion of state power” rather than the original lighter charge of “obstructing a public service”, she told Reuters on Tuesday.\nFor the last two days, police in Xuzhou city in southeastern Jiangsu province have repeatedly called to ask her to come to the police station to speak with them in connection with her husband’s crimes, she said.\nThe police told her that the reason she is wanted is because she had given interviews with the foreign media, she said.\nA man who answered the phone at the Xuzhou city public security bureau told Reuters he was unaware of the case.\nIt is unclear why Yu is being held in Xuzhou. It is not uncommon for sensitive rights cases to be transferred to different jurisdictions.\nPresident Xi Jinping has presided over a sweeping wave of detentions and arrest of rights lawyers and activists, which has come to be known as the “709” incident after the date July 9, 2015, when the crackdown began in earnest.\nIn response, the families and friends of the rights lawyers and activists have often taken up their loved one’s cause in the wake of their detention, sometimes becoming high-profile activists in their own right.\nAn edited video of Yu’s detention showing him punching and swearing at the police officers was posed on YouTube on Jan. 22, and has since been shared repeatedly on Twitter.\nXu Yan said the video was an attempt to smear her husband.\nThe day before Yu was detained he had circulated a call for reform to China’s state constitution, which said China should delete a preamble that grants the ruling Communist Party primacy in leadership.\nReporting by Christian Shepherd; Editing by Michael Perry\n ", "external_links": [], "published": "2018-01-30T07:30:00.000+02:00", "crawled": "2018-01-30T07:43:27.053+02:00", "highlightTitle": ""}