{"organizations": [], "uuid": "2e7bd09228bd23c418a933cbc7ca7ce0d3e6c372", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 78}, "facebook": {"likes": 228, "shares": 228, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/28/104973024-gallery-02.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/28/coincheck-nem-hack-unlikely-last-for-cryptocurrency-space-analyst.html", "country": "US", "domain_rank": 767, "title": "Coincheck: NEM hack unlikely last for cryptocurrency space: Analyst", "performance_score": 2, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.682, "site_type": "news", "published": "2018-01-29T06:38:00.000+02:00", "replies_count": 0, "uuid": "2e7bd09228bd23c418a933cbc7ca7ce0d3e6c372"}, "author": "Cheang Ming", "url": "https://www.cnbc.com/2018/01/28/coincheck-nem-hack-unlikely-last-for-cryptocurrency-space-analyst.html", "ord_in_thread": 0, "title": "Coincheck: NEM hack unlikely last for cryptocurrency space: Analyst", "locations": [], "entities": {"persons": [{"name": "nicholas colas", "sentiment": "none"}, {"name": "colas", "sentiment": "none"}], "locations": [], "organizations": [{"name": "datatrek research", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The more than $500 million cryptocurrency heist at a major Japanese exchange last week is unlikely to be the last such hack, according to a Wall Street analyst. \n\"I think [the attack] does highlight the fact that the industry still has a long way to go in terms of basic issues of security,\" Nicholas Colas, co-founder of DataTrek Research, told CNBC's \"Squawk Box\" on Monday. \n\"This is certainly not the first, nor will it be the last, such hack attack on cryptocurrencies and, all things considered, I think they're taking it fairly well in terms of price,\" Colas added. \nHis comments came after Japanese exchange Coincheck announced Friday that around 523 million of its NEM coins had been directed to another account. Those coins were reportedly worth approximately 58 billion yen ($534.8 million) when the hack was detected.\nThe exchange later said in a blog post on Sunday that it would be making reparations to roughly 260,000 affected users, adding that it offered its apologies for the \"immense distress\" caused to customers following the hack. Around 46.3 billion yen ($425 million) will be returned in total, although Coincheck said the method and period of reparation had yet to be decided.\nAFP | Getty Images In this picture taken on early January 27, 2018, Coincheck president Koichiro Wada (L) bows in apology at the end a press conference in Tokyo. Japan's government said on January 29 it would impose administrative measures on virtual currency exchange Coincheck after hackers stole hundreds of millions of dollars in digital assets from the Tokyo-based firm. Coincheck management said in a press conference last week that it held the NEM coins in a \"hot\" wallet, referring to a method of storage that is linked to the internet — a method that was \"not industry standard,\" according to Colas. \n\"Keeping 100 percent of your crypto assets online is a bad idea for an institution, or frankly, for an individual who has a large amount invested in it as well,\" he said. \nAs for who the hackers could be, the analyst ventured that a group — rather than an individual — was more likely to be responsible. \n\"The typical hackers in cryptos have been organized groups [as opposed to] lone attackers. Because, obviously, once you get the coin, you've got to figure out how to atomize it and monetize it in some way and that's a bigger challenge than typically one person can do,\" Colas explained.\nIn the latest development in the saga, Japanese financial regulators on Monday indicated that they had plans to enforce \"administrative punishment\" against Coincheck following the massive hack, Reuters reported. \nLocal news agency Kyodo reported Monday afternoon that the Tokyo Metropolitan Police intended to carry out voluntary questioning of those associated with the exchange. \n— CNBC's Evelyn Cheng contributed to this report.", "external_links": [], "published": "2018-01-29T06:38:00.000+02:00", "crawled": "2018-01-29T06:38:00.016+02:00", "highlightTitle": ""}