{"organizations": [], "uuid": "9f673c877e3810cf3193a5cf0a854e2542b94bdd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222103457&w=1200&r=LYNXMPEE0E0HG", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-regis/former-england-and-west-brom-striker-regis-dies-aged-59-idUKKBN1F40ZQ", "country": "US", "domain_rank": 408, "title": "Former England and West Brom striker Regis dies, aged 59", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T11:37:00.000+02:00", "replies_count": 0, "uuid": "9f673c877e3810cf3193a5cf0a854e2542b94bdd"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-regis/former-england-and-west-brom-striker-regis-dies-aged-59-idUKKBN1F40ZQ", "ord_in_thread": 0, "title": "Former England and West Brom striker Regis dies, aged 59", "locations": [], "entities": {"persons": [{"name": "regis", "sentiment": "negative"}, {"name": "cyrille regis", "sentiment": "none"}, {"name": "danny wallaceat st mary", "sentiment": "none"}, {"name": "hardik vyas", "sentiment": "none"}], "locations": [{"name": "west brom", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "southampton", "sentiment": "none"}, {"name": "west bromwich albion", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "chester city", "sentiment": "none"}], "organizations": [{"name": "professional footballers’ association", "sentiment": "none"}, {"name": "southampton", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "wolverhampton wanderers", "sentiment": "none"}, {"name": "aston villa", "sentiment": "none"}, {"name": "coventry city", "sentiment": "none"}, {"name": "pfa", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 9:34 AM / Updated 6 hours ago Former England striker Regis dies aged 59 Reuters Staff 3 Min Read \nLONDON (Reuters) - English soccer mourned former West Bromwich Albion, Coventry City and England striker Cyrille Regis on Monday as a role model and pioneer for the country’s black footballers after his death at 59. FILE PHOTO: Football - Leyton Orient v Milton Keynes Dons - Sky Bet Football League One - The Matchroom Stadium, Brisbane Road - 12/10/13 Ex player Cyrille Regis at a tribute to former Orient player and team mate Laurie Cunningham Action Images via Reuters/Steven Paston/File Photo \nLocal media said he died of a heart attack on Sunday. \nBorn in French Guiana but moving to London as a boy, Regis joined West Brom in 1977 and scored 112 goals in 297 appearances for the club before going to Coventry in 1984, where he won the FA Cup three years later. \nHe went on to play for Aston Villa, Wolverhampton Wanderers, Wycombe Wanderers and Chester City before hanging up his boots in 1996. \nApart from being a powerful and talented striker, Regis inspired a generation of black players at a time when they were a rarity in the top echelons of English soccer and were regularly subjected to racial abuse from crowds. \n“Devastated this morning my hero my pioneer the man behind the reason I wanted to play football has passed away,” former England striker Andy Cole said on Twitter. \nTogether with Brendon Batson and the late Laurie Cunningham, Regis formed part of a West Brom trio nicknamed “The Three Degrees” by manager Ron Atkinson after the American female singers visited The Hawthorns. \n“He got five international caps but today he would get 60 or 70 at least,” Atkinson told BBC West Midlands radio. Fans leave tributes to Cyrille Regis at the Jeff Castle gates of West Bromwich Albion football club's The Hawthorns stadium in West Bromwich, Britain January 15, 2018. REUTERS/Darren Staples \n“I think he was the best centre forward I’ve ever had and I’ve had some top players. But I also think he was a better bloke than a player. He was an unbelievable guy.” \nRegis quickly became a fan favourite and scourge of rival defences as an explosive striker with a powerful physical presence. Slideshow (5 Images) \nHis spectacular strike against Norwich City in the FA Cup won Match of the Day’s Goal of the Season award for 1981-82. \n“What a man. What a centre forward! One of my earliest football memories was walking into WBA for a trial as a 13-year-old kid, seeing Cyrille Regis and being in awe of him. RIP big man,” former England striker Alan Shearer said on Twitter. \nKnown to the fans as “Smokin’ Joe” and “The Big C”, Regis encountered more racism as he moved into international contention. \nOn one occasion he received a bullet in the mail along with a threat that he would get one in the knee if he played for England at Wembley. \n“The racism was quite abhorrent but I turned a negative into a positive,” he recalled. “I chased harder and played harder, I wanted to score goals and win points.” \nRegis returned to West Brom as a coach before becoming a football agent. Reporting by Alan Baldwin in London/Hardik Vyas in Bengaluru,; Editing by Ed Osmond", "external_links": [], "published": "2018-01-15T11:37:00.000+02:00", "crawled": "2018-01-15T11:55:52.020+02:00", "highlightTitle": ""}