{"organizations": [], "uuid": "7789f204c32a3ca83aea58bd9aa1a137c1bf9d37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224561930&w=1200&r=LYNXMPEE0M1O2", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-trump-texts/u-s-attorney-general-orders-probe-of-fbi-agents-texts-lawmaker-idUSKBN1FC2OQ", "country": "US", "domain_rank": 408, "title": "U.S. Attorney General orders probe of FBI agents' texts: lawmaker", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T21:02:00.000+02:00", "replies_count": 0, "uuid": "7789f204c32a3ca83aea58bd9aa1a137c1bf9d37"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-texts/u-s-attorney-general-orders-probe-of-fbi-agents-texts-lawmaker-idUSKBN1FC2OQ", "ord_in_thread": 0, "title": "U.S. Attorney General orders probe of FBI agents' texts: lawmaker", "locations": [], "entities": {"persons": [{"name": "lisa lambert", "sentiment": "none"}, {"name": "susan thomas", "sentiment": "none"}, {"name": "jeff sessions", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bob goodlatte", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "fbi", "sentiment": "negative"}, {"name": "federal bureau of investigation", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "fox news channel", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 7:02 PM / Updated 36 minutes ago U.S. attorney general orders probe of FBI agents' text messages Sarah N. Lynch 3 Min Read \nWASHINGTON (Reuters) - U.S. Attorney General Jeff Sessions has ordered an investigation into missing text messages exchanged between two Federal Bureau of Investigation staffers who are accused of expressing views against President Donald Trump, the Justice Department has confirmed. \nTexts between FBI agent Peter Strzok and FBI lawyer Lisa Page exchanged between Dec. 14, 2016, and May 17, 2017, are among a broader batch of missing phone messages that the FBI’s system failed to store due to a software upgrade glitch on many Samsung 5 cell phones. \nRepublicans have said the texts, which referred to Trump as an “idiot” and a “loathsome human,” raise concerns the FBI is biased against Trump and may have given Hillary Clinton, his Democratic presidential rival, favorable treatment after deciding not to recommend criminal charges in connection with the investigation of her use of a private email system while she was secretary of state. \nStrzok and Page were involved in that investigation and were briefly assigned to work with special counsel Robert Mueller on the investigation of Russian meddling in the 2016 presidential election. \nMedia reports said the texts between them were exchanged on FBI-issued phones during the course of an alleged extramarital affair. \nMueller was appointed on May 17, the same day when some of the text messages were not properly stored. \n“We will leave no stone unturned to confirm with certainty why these text messages are not now available to be produced and will use every technology available to determine whether the missing messages are recoverable from another source,” Sessions said in a statement. \nSix different congressional committees learned about the missing texts last Friday after they had initially requested copies of Strzok and Page’s texts between July 2015 and July 2017. \nThe failures by the FBI’s system to store the messages were initially uncovered by the Justice Department’s inspector general, who is in the midst of a broad review into whether the FBI made missteps in its handling of the Clinton investigation. \nAfter the inspector general informed Mueller over the summer about the texts, Strzok was removed from the team and reassigned. Page completed her 45-day detail on Mueller’s team in July. \n“I am pleased to hear that Attorney General Jeff Sessions is going to launch an investigation into what happened to those texts, and I hope they are uncovered,” Republican Representative Bob Goodlatte told Fox News Channel. “They illustrate a conspiracy on the part of some people and we want to know a lot more about that.” Reporting by Sarah N. Lynch; Additional reporting by Lisa Lambert; Editing by Susan Thomas and Bill Trott", "external_links": [], "published": "2018-01-23T21:02:00.000+02:00", "crawled": "2018-01-23T21:13:42.008+02:00", "highlightTitle": ""}