{"organizations": [], "uuid": "6e5b41afd9a2bde2cf4ee10916bc6715af778f29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/business-wire-emagin-corporation-comments-on-preliminary-fourth-quarter-2017-revenues.html", "country": "US", "domain_rank": 767, "title": "eMagin Corporation Comments on Preliminary Fourth Quarter 2017 Revenues", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T16:01:00.000+02:00", "replies_count": 0, "uuid": "6e5b41afd9a2bde2cf4ee10916bc6715af778f29"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/business-wire-emagin-corporation-comments-on-preliminary-fourth-quarter-2017-revenues.html", "ord_in_thread": 0, "title": "eMagin Corporation Comments on Preliminary Fourth Quarter 2017 Revenues", "locations": [], "entities": {"persons": [{"name": "eman", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "hopewell junction", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "-Company Notes Significant Increase in Backlog Entering 2018-\nHOPEWELL JUNCTION, N.Y.--(BUSINESS WIRE)-- eMagin Corporation, or the “Company,” (NYSE American: EMAN) a leader in the development, design and manufacture of Active Matrix OLED microdisplays for high resolution imaging products, today announced preliminary revenues for the fourth quarter of 2017 and backlog at year end.\nPreliminary revenues in the quarter are estimated to be between $6.2 million to $6.4 million, representing a 35% to 39% increase from the year ago period. Compared to the third quarter, preliminary revenues are estimated to be up 44% to 49% from $4.3 million. The improvement in preliminary revenues reflects both the expected pickup in military demand as well as contributions from commercial programs. At December 31, 2017, our backlog of open orders scheduled for delivery through December 31, 2018 was $9.8 million, an increase of 53% from the backlog of $6.4 million at the end of 2016. As of December 31, 2017, the Company had cash of $3.5 million and a revolving credit loan balance of $4.0 million, compared to cash of $2.0 million and a revolving credit loan balance of $1.1 million as of September 30, 2017.\n“As expected, our sales increased, reflecting strong third quarter military business bookings and contributions from our commercial contracts,” said Andrew Sculley, President and Chief Executive Officer. “Our core military business is improving as we see the ramp-up of new programs which is driving the increase in our backlog and is expected to continue throughout 2018. We look forward to sharing additional details of our fourth quarter results on our year end conference call in March.”\nAbout eMagin Corporation\nA leader in OLED microdisplay technology, OLED microdisplay manufacturing know-how and mobile display systems, eMagin manufactures high-resolution OLED microdisplays and integrates them with magnifying optics to deliver virtual images comparable to large-screen computer and television displays in portable, low-power, lightweight personal displays. eMagin’s microdisplays provide near-eye imagery in a variety of products from military, industrial, medical and consumer OEMs. More information about eMagin is available at www.emagin.com .\nForward-Looking Statements and Statement on Preliminary Results\nThe foregoing information reflects our estimate with respect to total revenues based on currently available information which is preliminary and unaudited, is not a comprehensive statement of our financial results and is subject to completion of our financial closing procedures. Our final results that will be issued upon completion of our closing procedures may vary from these preliminary estimates.\nThis press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, including those regarding eMagin Corporation’s expectations, intentions, strategies and beliefs pertaining to future events or future financial performance. Actual events or results may differ materially from those in the forward-looking statements as a result of various important factors, including those described in the Company’s most recent filings with the SEC. For a more complete description of the risks that could cause our actual results to differ from our current expectations, please see the section entitled “Risk Factors” in eMagin’s Annual Report on Form 10-K for the fiscal year ended December 31, 2016 and Current Report on Form 8-K filed with the SEC on May 19, 2017.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180119005146/en/\neMagin Corporation\nJeffrey Lucas, 845-838-7931\nChief Financial Officer\njlucas@emagin.com\nor\nAffinity Growth Partners\nBetsy Brod, 212-661-2231\nBetsy.brod@affinitygrowth.com\nSource: eMagin Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.emagin.com&esheet=51745747&newsitemid=20180119005146&lan=en-US&anchor=www.emagin.com&index=1&md5=49fb2a7fb15493d5aefd68b93a306291", "http://www.businesswire.com/news/home/20180119005146/en/"], "published": "2018-01-19T16:01:00.000+02:00", "crawled": "2018-01-19T18:21:53.000+02:00", "highlightTitle": ""}