{"organizations": [], "uuid": "409a8e0a6ce51c2983e7da4602250a390ad24ee8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-advanced-energy-announces-fourth-quarter-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "Advanced Energy Announces Fourth Quarter and Full Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.021, "site_type": "news", "published": "2018-01-31T00:05:00.000+02:00", "replies_count": 0, "uuid": "409a8e0a6ce51c2983e7da4602250a390ad24ee8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-advanced-energy-announces-fourth-quarter-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "Advanced Energy Announces Fourth Quarter and Full Year 2017 Results", "locations": [], "entities": {"persons": [{"name": "yuval wasserman", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "fort collins", "sentiment": "none"}, {"name": "colo.", "sentiment": "none"}], "organizations": [{"name": "advanced energy", "sentiment": "negative"}, {"name": "gaap", "sentiment": "none"}, {"name": "advanced energy industries, inc.", "sentiment": "none"}, {"name": "non-gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Q4 Revenue increased 32.4% y/y and 1.5% q/q to $179.2 million Q4 GAAP loss per share from continuing operations was $0.73 (due to tax expense related to U.S. tax reform) Q4 Non-GAAP EPS from continuing operations was $1.31\nFORT COLLINS, Colo., Jan. 30, 2018 (GLOBE NEWSWIRE) -- Advanced Energy Industries, Inc. (Nasdaq:AEIS), today announced financial results for the fourth quarter and full year ended December 31, 2017. The company reported fourth quarter sales of $179.2 million. Fourth quarter GAAP loss from continuing operations was $29.0 million, or $0.73 per share. Non-GAAP income from continuing operations was $52.4 million, or $1.31 per diluted share.\n“Capped off by a strong fourth quarter in our semiconductor business, 2017 was a record-breaking year across the board as revenue and non-GAAP earnings grew to their highest levels in the company’s history,” said Yuval Wasserman, president and CEO of Advanced Energy. “Key to maintaining our market-leading position and continually outpacing the markets we serve is our ongoing innovation and technology leadership. We continued to demonstrate the sustainability of our model, allowing us to achieve our strategic and aspirational goals.”\nFourth Quarter Results\nSales were $179.2 million in the fourth quarter of 2017 compared with $176.6 million in the third quarter of 2017 and $135.3 million in the fourth quarter of 2016.\nGAAP loss from continuing operations was $29.0 million or $0.73 per share in the fourth quarter of 2017 compared with income from continuing operations of $83.8 million or $2.09 per diluted share in the prior quarter, and income from continuing operations of $40.4 million or $1.01 per diluted share in the fourth quarter of 2016. The fourth quarter 2017 results were impacted by one-time tax expenses of $6.4 million associated with the write-down of solar inverter business and $72.9 million associated with the recently enacted U.S. tax reform, which the company will continue to evaluate during the measurement period.\nNon-GAAP income from continuing operations was $52.4 million or $1.31 per diluted share in the fourth quarter of 2017, including $0.03 of favorable items. This compares with $48.0 million or $1.19 per diluted share in the prior quarter, and $42.6 million or $1.06 per diluted share in the same period last year. A reconciliation of non-GAAP measures is provided in the tables below.\nThe company generated $49.6 million of operating cash from continuing operations in the fourth quarter of 2017.\nFull Year 2017\nSales were $671.0 million in 2017 compared with $483.7 million in 2016, an increase of 39%.\nGAAP income from continuing operations was $136.1 million or $3.39 per diluted share in 2017 compared with $116.9 million or $2.92 per diluted share in 2016. Full year 2017 results were impacted by a one-time tax benefit of $33.8 million associated with the write-down of the solar inverter business and a one-time tax expense of $72.9 million associated with the recently enacted U.S. tax reform, which the company will continue to evaluate during the measurement period.\nNon-GAAP income from continuing operations was $191.5 million or $4.77 per diluted share in 2017 compared with $124.6 million or $3.11 per diluted share in 2016. A reconciliation of non-GAAP measures is provided in the tables below.\nThe company generated $190.0 million in cash from continuing operations and ended the year with $410.4 million in cash and marketable securities.\nDiscontinued Operations\nThe company’s financial statements for all periods presented reflect results for the continuing precision power business, with the discontinued inverter business included in discontinued operations for both the balance sheet and income statement. Further financial detail regarding the amounts related to the discontinued inverter business are available in the company’s 2016 Annual Report on Form 10-K.\nFirst Quarter 2018 Guidance\nBased on the company's current view, beliefs and assumptions, guidance for the first quarter of 2018 is within the following ranges and does not incorporate any potential adjustments during the measurement period associated with U.S. tax reform.\n﻿ Q1 2018 Revenues $183M - $193M GAAP operating margins from continuing operations 30.0% - 32.0% GAAP EPS from continuing operations $1.19 - $1.29 Non-GAAP operating margins from continuing operations 32.0% - 34.0% Non-GAAP EPS from continuing operations $1.27 - $1.37 Fourth Quarter 2017 Conference Call\nManagement will host a conference call tomorrow morning, Wednesday, January 31, 2018 at 6:30 a.m. Mountain Time/ 8:30 a.m. Eastern Time to discuss Advanced Energy's financial results. Domestic callers may access this conference call by dialing 855-232-8958. International callers may access the call by dialing 315-625-6980. Participants will need to provide the operator with the Conference ID Number 5097049, which has been reserved for this call. For a replay of this teleconference, please call 855-859-2056 or 404-537-3406 and enter Conference ID Number 5097049. The replay will be available for one week following the conference call. A webcast will also be available on the company’s Investor Relations web page at http://ir.advanced-energy.com .\nAbout Advanced Energy\nAdvanced Energy (NASDAQ:AEIS) is a global leader in innovative power and control technologies for high-growth, precision power solutions for thin films processes and industrial applications. Advanced Energy is headquartered in Fort Collins, Colorado, with dedicated support and service locations around the world. For more information, go to www.advanced-energy.com .\nAdvanced Energy and the Advanced Energy logo are trademarks of Advanced Energy Industries, Inc. or one of its Affiliates in the United States and elsewhere.\nFor more information, contact:\nTom McGimpsey\nAdvanced Energy Industries, Inc.\n(970) 407-6326\ntom.mcgimpsey@aei.com Annie Leschin/Rhonda Bennetto\nAdvanced Energy Industries, Inc.\n(970) 407-6555\nir@aei.com Non-GAAP Measures\nThis release includes GAAP and non-GAAP income and per-share earnings data and other GAAP and non-GAAP financial information. Advanced Energy’s non-GAAP measures exclude the impact of non-cash related charges such as stock based compensation and amortization of intangible assets, as well as non-recurring items such as acquisition-related costs. Additionally, the fourth quarter and full year 2017 results exclude estimated income tax expense associated with U.S. tax reform. For the first quarter ending March 31, 2018 guidance, the company expects stock based compensation of $2.7 million and amortization of intangibles of $1.5 million. The non-GAAP measures included in this release are not in accordance with, or an alternative for, similar measures calculated under generally accepted accounting principles and may be different from non-GAAP measures used by other companies. In addition, these non-GAAP measures are not based on any comprehensive set of accounting rules or principles. Advanced Energy believes that these non-GAAP measures provide useful information to management and investors to evaluate business performance without the impacts of certain non-cash charges and other charges which are not part of the company’s usual operations. The company uses these non-GAAP measures to assess performance against business objectives, make business decisions, develop budgets, forecast future periods, assess trends and evaluate financial impacts of various scenarios. In addition, management's incentive plans include these non-GAAP measures as criteria for achievements. Additionally, the company believes that these non-GAAP measures, in combination with its financial results calculated in accordance with GAAP, provide investors with additional perspective. While some of the excluded items may be incurred and reflected in the company’s GAAP financial results in the foreseeable future, the company believes that the items excluded from certain non-GAAP measures do not accurately reflect the underlying performance of its continuing operations for the period in which they are incurred. The use of non-GAAP measures has limitations in that such measures do not reflect all of the amounts associated with the company’s results of operations as determined in accordance with GAAP, and these measures should only be used to evaluate the company’s results of operations in conjunction with the corresponding GAAP measures. Please refer to the Form 8-K regarding this release furnished today to the Securities and Exchange Commission.\nForward-Looking Statements\nThe company’s guidance with respect to anticipated financial results for the first quarter ending March 31, 2018, potential future growth and profitability, our future business mix, expectations regarding future market trends and the company’s future performance within specific markets (e.g., statements regarding anticipated semiconductor and industrial market growth) and other statements herein or made on the above-announced conference call that are not historical information are within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements are subject to known and unknown risks and uncertainties that could cause actual results to differ materially from those expressed or implied by such statements. Such risks and uncertainties include, but are not limited to: (a) the effects of global macroeconomic conditions upon demand for our products and services; (b) the volatility and cyclicality of the industries the company serves, particularly the semiconductor industry; (c) delays in capital spending by end-users in our served markets; (d) the accuracy of the company’s estimates related to fulfilling solar inverter product warranty and post-warranty obligations; (e) the company’s ability to realize its plan to avoid additional costs after the solar inverter wind-down; (f) the accuracy of the company's assumptions on which its financial statement projections are based; (g) the impact of product price changes, which may result from a variety of factors; (h) the timing of orders received from customers; (i) the company’s ability to realize benefits from cost improvement efforts including avoided costs, restructuring plans and inorganic growth; (j) the company’s ability to obtain in a timely manner the materials necessary to manufacture its products; (k) unanticipated changes to management's estimates, reserves or allowances; and (l) changes and adjustments to the tax expense and benefits related to the recently enacted U.S. tax reform. These and other risks are described in Advanced Energy's Form 10-K, Forms 10-Q and other reports and statements filed with the Securities and Exchange Commission (the “SEC”). These reports and statements are available on the SEC's website at www.sec.gov . Copies may also be obtained from Advanced Energy's investor relations page at http://ir.advanced-energy.com or by contacting Advanced Energy's investor relations at 970-407-6555. Forward-looking statements are made and based on information available to the company on the date of this press release. Aspirational goals and targets discussed on the conference call or in the presentation materials should not be interpreted in any respect as guidance. The company assumes no obligation to update the information in this press release.\nADVANCED ENERGY INDUSTRIES, INC. CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS (UNAUDITED) (in thousands, except per share data) Three Months Ended Twelve Months Ended December 31, September 30, December 31, 2017 2016 2017 2017 2016 Sales: Product $ 154,172 $ 115,885 $ 152,363 $ 578,650 $ 410,580 Service 25,042 19,458 24,212 92,362 73,124 Total sales 179,214 135,343 176,575 671,012 483,704 Cost of sales: Product 68,833 54,710 72,146 267,587 192,694 Service 12,206 9,115 12,195 47,044 37,863 Total cost of sales 81,039 63,825 84,341 314,631 230,557 Gross profit 98,175 71,518 92,234 356,381 253,147 54.8 % 52.8 % 52.2 % 53.1 % 52.3 % Operating expenses: Research and development 16,257 11,121 14,629 57,999 44,445 Selling, general and administrative 22,682 20,864 24,692 93,262 77,678 Amortization of intangible assets 1,174 987 1,240 4,350 4,167 Total operating expenses 40,113 32,972 40,561 155,611 126,290 Operating income 58,062 38,546 51,673 200,770 126,857 Other (expense) income, net 559 81 153 (2,579 ) 1,219 Income from continuing operations before income taxes 58,621 38,627 51,826 198,191 128,076 Provision for income taxes 87,628 (1,809 ) (31,968 ) 62,090 11,128 Income (loss) from continuing operations, net of income taxes (29,007 ) 40,436 83,794 136,101 116,948 Income (loss) from discontinued operations, net of income taxes (583 ) 3,845 70 1,760 10,506 Net income (loss) $ (29,590 ) $ 44,281 $ 83,864 $ 137,861 $ 127,454 Basic weighted-average common shares outstanding 39,642 39,699 39,786 39,754 39,720 Diluted weighted-average common shares outstanding 40,051 40,029 40,172 40,176 40,031 Earnings per share: Continuing operations: Basic earnings (loss) per share $ (0.73 ) $ 1.02 $ 2.11 $ 3.42 $ 2.94 Diluted earnings (loss) per share $ (0.73 ) $ 1.01 $ 2.09 $ 3.39 $ 2.92 Discontinued operations: Basic earnings (loss) per share $ (0.01 ) $ 0.10 $ 0.00 $ 0.04 $ 0.26 Diluted earnings (loss) per share $ (0.01 ) $ 0.10 $ 0.00 $ 0.04 $ 0.26 Net income: Basic earnings (loss) per share $ (0.75 ) $ 1.12 $ 2.11 $ 3.47 $ 3.21 Diluted earnings (loss) per share $ (0.75 ) $ 1.11 $ 2.09 $ 3.43 $ 3.18\nADVANCED ENERGY INDUSTRIES, INC. CONDENSED CONSOLIDATED BALANCE SHEETS (in thousands) December 31, December 31, 2017 2016 ASSETS Unaudited Current assets: Cash and cash equivalents $ 407,283 $ 281,953 Marketable securities 3,104 4,737 Accounts receivable, net 87,429 75,667 Inventories, net 78,450 55,770 Income taxes receivable 1,295 1,482 Other current assets 8,129 9,324 Current assets of discontinued operations 9,535 9,401 Total current assets 595,225 438,334 Property and equipment, net 17,795 13,337 Deposits and other 3,051 1,835 Goodwill and intangibles, net 87,311 70,196 Deferred income tax assets 18,841 32,197 Non-current assets of discontinued operations 11,085 15,630 Total assets $ 733,308 $ 571,529 LIABILITIES AND STOCKHOLDERS' EQUITY Current liabilities: Accounts payable $ 48,177 $ 46,255 Other accrued expenses 50,092 35,372 Current liabilities of discontinued operations 7,850 13,419 Total current liabilities 106,119 95,046 Non-current liabilities of continuing operations 91,271 63,252 Non-current liabilities of discontinued operations 15,277 21,157 Long-term liabilities 106,548 84,409 Total liabilities 212,667 179,455 Stockholders' equity 520,641 392,074 Total liabilities and stockholders' equity $ 733,308 $ 571,529 December 31, 2016 amounts are derived from the December 31, 2016 audited Consolidated Financial Statements.\nADVANCED ENERGY INDUSTRIES, INC. CONDENSED CONSOLIDATED STATEMENT OF CASH FLOWS (in thousands) Twelve Months Ended December 31, 2017 2016 CASH FLOWS FROM OPERATING ACTIVITIES: Net income $ 137,861 $ 127,454 Income from discontinued operations, net of income taxes 1,760 10,506 Income from continuing operations, net of income taxes 136,101 116,948 Adjustments to reconcile net income to net cash provided by operating activities: Depreciation and amortization 9,424 7,813 Stock-based compensation expense 12,549 6,332 Provision for deferred income taxes 28,765 3,570 Loss on foreign exchange hedge 3,489 — Net loss on disposal of assets 122 319 Changes in operating assets and liabilities, net of assets acquired (494 ) (7,838 ) Net cash provided by operating activities from continuing operations 189,956 127,144 Net cash used in operating activities from discontinued operations (7,255 ) (7,857 ) Net cash provided by operating activities 182,701 119,287 CASH FLOWS FROM INVESTING ACTIVITIES: Purchases of marketable securities (107 ) (763 ) Proceeds from sale of marketable securities 1,903 7,884 Acquisitions, net of cash acquired (17,347 ) — Purchase of foreign exchange hedge (3,489 ) — Purchases of property and equipment (9,042 ) (6,821 ) Net cash (used in) provided by investing activities from continuing operations (28,082 ) 300 Net cash used in investing activities from discontinued operations — — Net cash (used in) provided by investing activities (28,082 ) 300 CASH FLOWS FROM FINANCING ACTIVITIES: Purchase and retirement of common stock (29,993 ) — Net (payments) proceeds related to stock-based award activities (1,315 ) 2,175 Other financing activities 1 (4 ) Net cash (used in) provided by financing activities from continuing operations (31,307 ) 2,171 Net cash used in financing activities from discontinued operations — (29 ) Net cash (used in) provided by financing activities (31,307 ) 2,142 EFFECT OF CURRENCY TRANSLATION ON CASH 2,208 (1,932 ) INCREASE IN CASH AND CASH EQUIVALENTS 125,520 119,797 CASH AND CASH EQUIVALENTS, beginning of period 289,517 169,720 CASH AND CASH EQUIVALENTS, end of period 415,037 289,517 Less cash and cash equivalents from discontinued operations 7,754 7,564 CASH AND CASH EQUIVALENTS FROM CONTINUING OPERATIONS, end of period $ 407,283 $ 281,953\nADVANCED ENERGY INDUSTRIES, INC. SELECTED OTHER DATA (UNAUDITED) (in thousands) Reconciliation of Non-GAAP measure - operating expenses and operating income, excluding certain items Three Months Ended Twelve Months Ended December 31, September 30, December 31, 2017 2016 2017 2017 2016 Gross Profit from continuing operations, as reported $ 98,175 $ 71,518 $ 92,234 $ 356,381 $ 253,147 Operating expenses from continuing operations, as reported 40,113 32,972 40,561 155,611 126,290 Adjustments: Stock-based compensation (1,842 ) (2,033 ) (3,453 ) (12,549 ) (6,332 ) Amortization of intangible assets (1,174 ) (987 ) (1,240 ) (4,350 ) (4,167 ) Acquisition-related costs — — — (150 ) — Non-GAAP operating expenses from continuing operations 37,097 29,952 35,868 138,562 115,791 Non-GAAP operating income from continuing operations $ 61,078 $ 41,566 $ 56,366 $ 217,819 $ 137,356\nReconciliation of Non-GAAP measure - operating expenses and operating income, excluding certain items Three Months Ended Twelve Months Ended December 31, September 30, December 31, 2017 2016 2017 2017 2016 Gross Profit from continuing operations, as reported 54.8 % 52.8 % 52.2 % 53.1 % 52.3 % Operating expenses from continuing operations, as reported 22.4 24.4 23.0 23.2 26.1 Adjustments: Stock-based compensation (1.0 ) (1.6 ) (2.0 ) (2.0 ) (1.3 ) Amortization of intangible assets (0.7 ) (0.7 ) (0.7 ) (0.6 ) (0.9 ) Acquisition-related costs — — — — — Non-GAAP operating expenses from continuing operations 20.7 22.1 20.3 20.6 23.9 Non-GAAP operating income from continuing operations 34.1 % 30.7 % 31.9 % 32.5 % 28.4 %\nReconciliation of Non-GAAP measure - income excluding certain items Three Months Ended Twelve Months Ended December 31, September 30, December 31, 2017 2016 2017 2017 2016 Income (loss) from continuing operations, net of income taxes, as reported $ (29,007 ) $ 40,436 $ 83,794 $ 136,101 $ 116,948 Adjustments: Stock-based compensation 1,842 2,033 3,453 12,549 6,332 Amortization of intangible assets 1,174 987 1,240 4,350 4,167 Loss on foreign exchange hedge — — — 3,489 — Acquisition-related costs — — — 150 — Incremental expense associated with start-up of the Asia regional headquarters — — 1,133 1,133 — Nonrecurring tax (benefit) expense associated with inverter business 6,357 — (40,194 ) (33,837 ) — Tax Cuts and Jobs Act Impact 72,867 — — 72,867 — Tax effect of Non-GAAP adjustments (813 ) (881 ) (1,426 ) (5,264 ) (2,854 ) Non-GAAP income from continuing operations, net of income taxes $ 52,420 $ 42,575 $ 48,000 $ 191,538 $ 124,593\nReconciliation of Non-GAAP measure - per share earnings excluding certain items Three Months Ended Twelve Months Ended December 31, September 30, December 31, 2017 2016 2017 2017 2016 Diluted earnings (loss) per share from continuing operations, as reported $ (0.73 ) $ 1.01 $ 2.09 $ 3.39 $ 2.92 Add back: per share impact of Non-GAAP adjustments, net of tax 2.04 0.05 (0.90 ) 1.38 0.19 Non-GAAP per share earnings from continuing operations $ 1.31 $ 1.06 $ 1.19 $ 4.77 $ 3.11\nReconciliation of Q1 2018 Guidance Low End High End Revenue $183 million $193 million Reconciliation of Non-GAAP operating margin GAAP operating margin 30 % 32 % Stock-based compensation 1 % 1 % Amortization of intangible assets 1 % 1 % Non-GAAP operating margin 32 % 34 % Reconciliation of Non-GAAP earnings per share GAAP earnings per share $ 1.19 $ 1.29 Stock-based compensation 0.07 0.07 Amortization of intangible assets 0.04 0.04 Tax effects of excluded items (0.03 ) (0.03 ) Non-GAAP earnings per share $ 1.27 $ 1.37\nSource:Advanced Energy Industries, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=7wOaVm0jagRkitEqALkujUuXzjd4BNh89-mhKXRIOurxzf6vRVbv7hT3tSWMbVQsDU6XXEywFf-mGGT0otS0OhiCq4ka4dhr94fbvsG6eqg=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/8e786d9e-844e-437f-899f-554eaef515af", "https://www.globenewswire.com/Tracker?data=nd233GlWpMs-ZhJscAwiKu9gHHILCnfFRYFSiRaJjVDrCltE6E4hLqBifpBl6jL5OnuQm6E3Qxdnqu_Nw9KyBgxbmbW8QXjDzau2V7m-Mw90bBdUZxw55dGxvw9pO5Jx"], "published": "2018-01-31T00:05:00.000+02:00", "crawled": "2018-01-31T03:09:45.000+02:00", "highlightTitle": ""}