{"organizations": [], "uuid": "8fac871529884a88af969910fd4676b952dff7a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 41, "shares": 41, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222010105&w=1200&r=LYNXMPEE0E00L", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-japan-economy-boj/bojs-kuroda-repeats-resolve-to-maintain-massive-stimulus-idUSKBN1F401Z", "country": "US", "domain_rank": 408, "title": "BOJ's Kuroda sounds more positive on prices, yen hits four-month high", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T08:33:00.000+02:00", "replies_count": 0, "uuid": "8fac871529884a88af969910fd4676b952dff7a3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-japan-economy-boj/bojs-kuroda-repeats-resolve-to-maintain-massive-stimulus-idUSKBN1F401Z", "ord_in_thread": 0, "title": "BOJ's Kuroda sounds more positive on prices, yen hits four-month high", "locations": [], "entities": {"persons": [{"name": "kuroda", "sentiment": "negative"}, {"name": "haruhiko kuroda", "sentiment": "negative"}], "locations": [{"name": "tokyo", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "bank of japan", "sentiment": "negative"}, {"name": "boj", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO (Reuters) - Bank of Japan Governor Haruhiko Kuroda offered a positive view on the economy and inflation on Monday, sending the yen to a four-month high against the dollar on simmering speculation it may exit its ultra-loose monetary policy earlier than expected.\nFinancial markets ignored Kuroda’s reminder that the BOJ will maintain its massive stimulus in a sign of how nervous investors have become on when it might follow the footsteps of other central banks in dialing back crisis-mode stimulus.\nThe BOJ also offered its most optimistic view on regional areas of Japan in nearly a decade in a quarterly report, underscoring its conviction a broadening recovery will help accelerate inflation to its ambitious 2 percent target.\nKuroda said in a speech to BOJ regional branch managers that core consumer inflation was “moving around 1 percent,” a slight change from three months ago when he said core consumer prices were around zero.\n“The economy is expected to continue expanding moderately,” he added, reiterating his optimism on prospects for a sustained recovery.\nThe comments sent the dollar falling as low as 110.58 yen JPY= , as some traders bought the yen on expectations the BOJ could dial back stimulus earlier than expected - a view that heightened after a slight cut in its debt purchases last week.\n“Kuroda’s change in language merely reflects recent price gains, but people have become sensitive to even the subtlest difference since the BOJ cut bond purchases,” said Shuji Tonouchi, senior market economist at Mitsubishi UFJ Morgan Stanley Securities.\n“Members of the government are also making more positive comments about escaping deflation. Policymakers are gradually changing their tone.”\nKuroda also said a moderate economic expansion now under way will help accelerate inflation toward the BOJ’s 2 percent target, signaling its desire to maintain the status quo on monetary policy for the time being.\nRECOVERY BROADENING In the quarterly report, the BOJ raised its assessment for three of Japan’s nine regional economies and maintained its rosy view for the remaining six regions.\nThe central bank said two regions were seeing their economies “expanding,” the first time it has used such an upbeat assessment for as many regions since April 2007.\nShinichi Uchida, head of the BOJ’s Nagoya branch in central Japan, said conditions for wage increases were falling into place as firms face intensifying labor shortages.\n“We’re seeing some positive moves toward an end to deflation,” Uchida told a news conference, adding that companies were benefiting from robust domestic and overseas demand.\nJapan’s economy grew an annualized 2.5 percent in July-September to mark a seventh straight quarter of growth thanks to robust exports and capital expenditure.\nCore consumer prices in November rose 0.9 percent from a year earlier, far from the BOJ’s 2 percent target but posting the 11th straight month of gains, offering policymakers some hope firms are finally starting to raise prices on brightening prospects.\nJapan’s economy minister raised eyebrows last week when he talked up the government’s progress in reflating the economy and suggested it is possible to declare an end to deflation before consumer prices reach the BOJ’s inflation target.\nGiven the rising cost of prolonged easing, such as the hit to bank profits from ultra-low interest rates, the BOJ has been sending subtle yet intentional hints it could edge away from crisis-mode policy earlier than expected.\nBut a small cut to its regular bond purchases last week pushed global yields and the yen higher, underscoring the challenge the BOJ faces in communicating its policy intentions.\n“Japan’s financial system remains stable and monetary conditions are very accommodative,” Kuroda said in the speech, holding off from repeating recent warnings about the rising cost of ultra-easy policy.\nEditing by Chris Gallagher, Simon Cameron-Moore and Jacqueline Wong\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T08:33:00.000+02:00", "crawled": "2018-01-15T07:04:16.021+02:00", "highlightTitle": ""}