{"organizations": [], "uuid": "4336672c2383565087e4d15be84cd63752cf0667", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222942691&w=1200&r=LYNXMPEE0H0CF", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/zimbabwe-mnangagwa/zimbabwe-to-hold-elections-in-four-to-five-months-mnangagwa-idINKBN1F70M3", "country": "US", "domain_rank": 408, "title": "Zimbabwe's Mnangagwa says to hold elections in four to five months", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T08:40:00.000+02:00", "replies_count": 0, "uuid": "4336672c2383565087e4d15be84cd63752cf0667"}, "author": "", "url": "https://in.reuters.com/article/zimbabwe-mnangagwa/zimbabwe-to-hold-elections-in-four-to-five-months-mnangagwa-idINKBN1F70M3", "ord_in_thread": 0, "title": "Zimbabwe's Mnangagwa says to hold elections in four to five months", "locations": [], "entities": {"persons": [{"name": "mnangagwa", "sentiment": "negative"}, {"name": "mugabe", "sentiment": "none"}, {"name": "emmerson mnangagwa", "sentiment": "none"}, {"name": "robert mugabe", "sentiment": "none"}], "locations": [{"name": "zimbabwe", "sentiment": "none"}, {"name": "mozambique", "sentiment": "none"}, {"name": "harare", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "herald", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HARARE (Reuters) - Zimbabwe will hold elections in four to five months, a newspaper on Thursday Quote: d President Emmerson Mnangagwa as saying, the first time since independence the southern African state will conduct a vote that does not involve Robert Mugabe.\nThe vote, a litmus test of Mnangagwa’s democratic credentials, will be crucial to unlocking badly needed financial assistance and repairing relations with Western powers and international financial institutions.\nMnangagwa told the Financial Times newspaper in an interview he was willing to meet a key opposition demand to invite the United Nations, European Union and Commonwealth to monitor the polls - the first time since 2000 that these organisations would have been allowed in.\nMnangagwa, a protege of Mugabe, came to power in November after a de-facto military coup when the 93-year-old was forced to resign after the military confined him to his Harare mansion.\nIt was the culmination of a power struggle between Mnangagwa and former first lady Grace Mugabe, who was being groomed by her husband as his potential successor.\nNow Mnangagwa, 75, is under pressure himself to deliver on the economy and show that he is breaking with the policies of Mugabe, whose 37-year rule since independence in 1980 turned a promising country into an economic basket case and international pariah.\nHe promised the elections for the presidency, parliament and local government would be peaceful, and told business leaders their investments would be secure and their profits safe.\n“Zimbabwe is going for elections in four to five months’ time and we have to preach peace, peace and peace because we know it is good for us and we have no doubt that we will have peaceful elections,” Mnangagwa was Quote: d as saying by the official Herald newspaper during an official trip to Mozambique.\nIn the Financial Times interview Mnangagwa added: “I would want that the United Nations should come, the EU should come. If the Commonwealth were requesting to come, I am disposed to consider their application.”\nUnder the constitution, Zimbabwe should hold elections between July 22 and Aug. 22, but parliament can choose to dissolve itself, triggering an earlier vote. The ruling ZANU-PF holds a two-thirds majority in parliament.\nDAVOS TRIP Since 2000, which coincided with Mugabe’s often violent seizure of land from white farmers, elections in Zimbabwe have been marred by political violence and disputes.\nBut the 2018 vote could catch the opposition flat-footed.\nMnangagwa’s main rival Morgan Tsvangirai is suffering from cancer, which has helped expose divisions in his Movement for Democratic Change party as officials scramble to take over leadership of the party.\nThe economy is suffering acute shortages of cash dollars, increases in prices of basic goods, high unemployment and low levels of foreign investment, making it the biggest challenge for Mnangagwa.\nAt a function ahead of next week’s World Economic Forum meeting in Davos, Mnangagwa said the extent of economic problems required Zimbabweans to work together as he promised to safeguard all investments in the country.\n“All investments will be safe and secure in Zimbabwe. Foreign investors will be able to repatriate profits,” he told a gathering of government officials and business leaders.\nTo reinforce that Mnangagwa plans to govern differently to Mugabe, the government said in a document published on Thursday that it was considering setting up a special tribunal to determine compensation for former white commercial farmers.\nIn the past 18 years, there has been little investment in agriculture, the backbone of the economy, due to disputes over compensation between former white farmers and the government.\nAnalysts say resolving the emotive land issue could unlock foreign investment in agriculture and help mend ties between Harare and the West, which imposed sanctions over the seizures and alleged vote rigging by Mugabe.\nMnangagwa said he was going to the Davos meetings, the first such trip by any Zimbabwean leader, to “dispel the perception” that Zimbabwe is “an isolated island”.\nReporting by MacDonald Dzirutwe; Editing by Alison Williams and Gareth Jones\n ", "external_links": [], "published": "2018-01-18T08:40:00.000+02:00", "crawled": "2018-01-18T08:53:22.001+02:00", "highlightTitle": ""}