{"organizations": [], "uuid": "b98d7ad7a2bb1ebbb2d8ad21be4efb7207fba259", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-mongolia-airport/mongolia-delays-launch-of-500-million-airport-until-2019-idUSKBN1ET0QH", "country": "US", "domain_rank": 408, "title": "Mongolia delays launch of $500-million airport until 2019", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T10:10:00.000+02:00", "replies_count": 0, "uuid": "b98d7ad7a2bb1ebbb2d8ad21be4efb7207fba259"}, "author": "", "url": "https://www.reuters.com/article/us-mongolia-airport/mongolia-delays-launch-of-500-million-airport-until-2019-idUSKBN1ET0QH", "ord_in_thread": 0, "title": "Mongolia delays launch of $500-million airport until 2019", "locations": [], "entities": {"persons": [{"name": "jadamba bat-erdene", "sentiment": "none"}, {"name": "chinggis khan", "sentiment": "none"}], "locations": [{"name": "mongolia", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "ulaanbaatar", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 8:12 AM / Updated 40 minutes ago Mongolia delays launch of $500-million airport until 2019 Reuters Staff 3 Min Read \nULAANBAATAR (Reuters) - Mongolia has delayed until 2019 the completion of a long-awaited $500-million airport project, originally expected this year, the transport minister said, a setback in efforts to diversify a mining-dependent economy. \nTo reduce its dependence on commodities such as coal and copper, Mongolia has ambitions to become an air freight hub for northern Asia and wants to develop tourism. \nBut the new airport is unlikely to open this year as originally scheduled, Roads and Transportation Minister Jadamba Bat-Erdene said, as Mongolia negotiates a management contract with Japanese investors. \n“The airport was expected to be operational this year, but plans are for it to be operational within the next year, due to management issues,” he said on the ministry’s official website. \n“It is planned to set up a joint management team headed by Japan,” he said in the statement, without elaborating. \nThe new airport is intended to replace the Chinggis Khan (Genghis Khan) International Airport, and take the name of the country’s 13th-century ruler, regarded as a national symbol. \nMongolia will be able to receive 3 million passengers a year by 2024 at the new airport, about 50 km (31 miles) from Ulaanbaatar, the capital. Its predecessor, a one-way runway built near a mountain range, is prone to disruptions and flight cancellations. \nJapan’s Mitsubishi Corp. and Chiyoda are leading construction, with Samsung C&T acting as a subcontractor. \nThe Chinese Export-Import Bank is providing $140 million to finance a 32.2-km (20-mile) road to the airport. Now under construction, the road is set to be completed by October. \nThe International Monetary Fund encouraged Mongolia to diversify away from mining as part of a $5.5-billion bailout agreed last year to stabilize its crisis-hit economy. \nCoal was the biggest driver of growth in 2017, but exports were hit by transport bottlenecks at the border with China, Mongolia’s biggest customer. \nAlthough the airport could generate non-mining growth, its success could depend on Mongolia allowing more airlines into the market and ending favorable treatment for the state carrier, analysts have said. Reporting by Terrence Edwards; Editing by David Stanway and Clarence Fernandez", "external_links": [], "published": "2018-01-04T10:10:00.000+02:00", "crawled": "2018-01-04T10:28:02.024+02:00", "highlightTitle": ""}