{"organizations": [], "uuid": "ecf12be5252956cd21a663ba5d3e1082f838c981", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/12/16/103245522-GettyImages-169117083.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/03/dollar-bounce-short-lived-as-euro-nears-3-year-high.html", "country": "US", "domain_rank": 767, "title": "Dollar bounce short-lived as euro nears 3-year high", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T16:03:00.000+02:00", "replies_count": 0, "uuid": "ecf12be5252956cd21a663ba5d3e1082f838c981"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/03/dollar-bounce-short-lived-as-euro-nears-3-year-high.html", "ord_in_thread": 0, "title": "Dollar bounce short-lived as euro nears 3-year high", "locations": [], "entities": {"persons": [{"name": "stephen gallo", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "bmo capital markets", "sentiment": "none"}, {"name": "fed", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The dollar fell on Thursday, failing to hold the previous day's gains on the back of upbeat U.S. data, as the euro resumed a rally that has taken it near its highest level in three years.\nA stronger-than-expected U.S. private-sector jobs report briefly helped the dollar pare losses versus the euro and extend gains against the yen. But those moves were short-lived.\n\"The market quickly faded the mini-rally in the dollar as the trend gave way to what we have been seeing for the past several weeks, which is dollar weakness,\" said Sireen Harajli, currency strategist at Mizuho Corporate Bank in New York.\nShe added that while the ADP number was better than forecast and will probably lead to high expectations for the U.S. non-farm payrolls report on Friday, the market does not seem to be willing to push the dollar higher.\nU.S. private employers added 250,000 jobs in December, data from ADP Research Institute showed , the biggest monthly increase since March. Economists surveyed by Reuters had forecast a gain of 190,000 jobs.\nU.S. employers announced plans to cut 32,423 jobs in December, bringing the year's total to a low not seen since 1990, the December Challenger report showed. Cuts in 2017 totaled 418,770, 20 percent below 2016's number.\nInvestors are now focused on Friday's U.S. non-farm payrolls report, which is expected to show job gains of 190,000 for December.\nJames Chen, head of FX research at Forex.com in Bedminster, New Jersey said his firm's U.S. payrolls forecast is between 200,000-220,000 given the strong employment data in other economic indicators.\n\"Any result falling within or above this range is likely to give the U.S. dollar a boost, as it would help confirm the Fed's optimistic outlook for the economy and the path to higher interest rates in 2018,\" Chen said.\nThe dollar index , which measures the currency against a basket of six major rivals, had slipped to its lowest since Sept. 20 on Tuesday, as optimism about the euro zone economy drove the euro above $1.20 for the first time in 3-1/2 months.\nThe index was last down 0.3 percent at 91.88.\nThe dollar had bounced on Wednesday after strong manufacturing and construction data, as well as somewhat hawkish Federal Reserve minutes.\nThe dollar rose against the yen , however, up 0.22 percent at 112.74 yen on strong risk appetite across markets.\nAfter earlier hitting a low of $1.2005, the euro recovered to trade as high as $1.2089. The euro last changed hands at $1.2066, up 0.45 percent.\nBitcoin , meanwhile, pared losses in late trading, down just 0.74 percent at $15,022.63 on the Bitstamp exchange. It has lost more than a quarter of its value since hitting record highs in mid-December.", "external_links": [], "published": "2018-01-04T16:03:00.000+02:00", "crawled": "2018-01-04T15:19:26.005+02:00", "highlightTitle": ""}