{"organizations": [], "uuid": "f922772dc9c9e4d42911727ada8f37598031b2d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-first-bancorp-reports-fourth-quarter-and-annual-results.html", "country": "US", "domain_rank": 767, "title": "First Bancorp Reports Fourth Quarter and Annual Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.016, "site_type": "news", "published": "2018-01-29T16:30:00.000+02:00", "replies_count": 0, "uuid": "f922772dc9c9e4d42911727ada8f37598031b2d8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-first-bancorp-reports-fourth-quarter-and-annual-results.html", "ord_in_thread": 0, "title": "First Bancorp Reports Fourth Quarter and Annual Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "southern pines", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "asheville", "sentiment": "none"}], "organizations": [{"name": "nasdaq", "sentiment": "negative"}, {"name": "first bancorp", "sentiment": "negative"}, {"name": "first bancorp reports fourth quarter", "sentiment": "negative"}, {"name": "first bank", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "ssb", "sentiment": "none"}, {"name": "asheville savings bank", "sentiment": "none"}, {"name": "asb bancorp, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SOUTHERN PINES, N.C., Jan. 29, 2018 /PRNewswire/ -- First Bancorp (NASDAQ – FBNC), the parent company of First Bank, announced today net income available to common shareholders of $14.2 million, or $0.48 per diluted common share, for the three months ended December 31, 2017, an increase of 20.0% in earnings per share from the $8.4 million, or $0.40 per diluted common share, recorded in the fourth quarter of 2016.\nFor the year ended December 31, 2017, the Company recorded net income available to common shareholders of $46.0 million, or $1.82 per diluted common share, an increase of 36.8% in earnings per share from the $27.3 million, or $1.33 per diluted common share, in 2016. On October 1, 2017, the Company acquired ASB Bancorp, Inc., the parent company of Asheville Savings Bank, SSB, headquartered in Asheville, North Carolina, which operated through 13 branches in the Asheville area. As of the acquisition date, Asheville Savings Bank reported total assets of approximately $798 million, including $606 million in loans and $679 million in deposits.\nAlso affecting comparability with periods in 2016 was the Company's March 3, 2017 acquisition of Carolina Bank Holdings, Inc., the parent company of Carolina Bank, which operated eight branches and three mortgage loan offices, primarily in the Triad region of North Carolina. As of the acquisition date, Carolina Bank had total assets of $682 million, including $497 million in loans and $585 million in deposits.\nNet Interest Income and Net Interest Margin\nNet interest income for the fourth quarter of 2017 was $48.9 million, a 56.1% increase from the $31.3 million recorded in the fourth quarter of 2016. Net interest income for the year ended December 31, 2017 amounted to $164.7 million, a 33.5% increase from the $123.4 million recorded in 2016. The increase in net interest income was primarily due to the acquisitions of Carolina Bank and Asheville Savings Bank, as well as higher amounts of loans outstanding as a result of organic growth.\nAlso contributing to the increase in net interest income was a higher net interest margin. The Company's net interest margin (tax-equivalent net interest income divided by average earning assets) amounted to 4.01% for the fourth quarter of 2017 compared to 3.94% for the fourth quarter of 2016. For the year ended December 31, 2017, the Company's net interest margin was 4.08% compared to 4.03% for 2016. Asset yields have increased primarily as a result of three Federal Reserve interest rate increases during the past year. Funding costs have also increased, but to a lesser degree. On a linked quarter basis, the Company's net interest margin of 4.01% was a decline from the third quarter margin of 4.16%, which was caused by lower discount accretion associated with the Company's legacy acquisitions as well as higher levels of low yielding interest-bearing cash during the period, resulting from the Company's decision to restructure the Asheville Savings Bank securities portfolio.\nThe net interest margins for both periods were impacted by loan discount accretion associated with acquired loan portfolios. The Company recorded loan discount accretion amounting to $2.0 million in the fourth quarter of 2017, compared to $0.9 million in the fourth quarter of 2016. For the full year of 2017 and 2016, loan discount accretion amounted to $7.1 million and $4.5 million, respectively. The increase in loan discount accretion from 2016 is primarily due to the loan discounts recorded in the acquisitions of Carolina Bank and Asheville Savings Bank. See the Financial Summary for a table that presents the impact of loan discount accretion on net interest income.\nExcluding the effects of loan discount accretion, the Company's net interest margin was 3.84% for the fourth quarter of 2017, compared to 3.83% for the fourth quarter of 2016. On a linked quarter basis, the 3.84% margin was a decline from the 3.99% margin realized for the third quarter of 2017. The decline was caused by higher levels of low yielding interest-bearing cash as well as a lower weighted average note rate associated with the loans acquired from Asheville Savings Bank. See the Financial Summary for a reconciliation of the Company's net interest margin to the net interest margin excluding loan discount accretion, and other information regarding this ratio.\nProvision for Loan Losses and Asset Quality\nThe Company recorded no provisions for loan losses in the fourth quarters of 2017 or 2016. For the year ended December 31, 2017, the Company recorded a provision for loan losses of $0.7 million compared to a negative provision for loan losses of $23,000 in 2016.\nThe low level of provision for loan losses in both years was primarily due to stable and improving loan quality. The Company's nonperforming assets to total assets ratio was 0.96% at December 31, 2017 compared to 1.64% at December 31, 2016. The Company experienced net loan charge-offs of $1.2 million in 2017, compared to $3.7 million in 2016. The ratio of annualized net charge-offs to average loans for the year ended December 31, 2017 was 0.04%, compared to 0.14% for 2016.\nNoninterest Income\nTotal noninterest income was $14.9 million and $9.5 million for the three months ended December 31, 2017 and December 31, 2016, respectively. For the year ended December 31, 2017, noninterest income amounted to $48.9 million compared to $25.6 million for 2016.\nCore noninterest income for the fourth quarter of 2017 was $15.1 million, an increase of 55.2% from the $9.7 million reported for the fourth quarter of 2016. For 2017, core noninterest income amounted to $49.3 million, a 40.9% increase from the $35.0 million recorded in 2016. Core noninterest income includes i) service charges on deposit accounts, ii) other service charges, commissions, and fees, iii) fees from presold mortgage loans, iv) commissions from sales of insurance and financial products, v) SBA consulting fees, vi) SBA loan sale gains, and vii) bank-owned life insurance income.\nThe primary reason for the increase in core noninterest income in 2017 was the acquisition of Carolina Bank and Asheville Savings Bank, as well as income derived from the Company's SBA consulting fees and SBA loan sale gains, which began during the middle of 2016.\nFees from presold mortgage loans increased to $1.6 million for the fourth quarter of 2017 from $0.5 million in the fourth quarter of 2016. For the year ended December 31, 2017, fees from presold mortgage loans increased to $5.7 million from the $2.0 million recorded in 2016. The increases were primarily due to the acquisition of Carolina Bank in March 2017, which had a significant mortgage loan operation.\nCommissions from sales of insurance and financial products amounted to $2.0 million in the fourth quarter of 2017, compared to $1.0 million in the fourth quarter of 2016. For the years ended December 31, 2017 and 2016, commissions from sales of insurance and financial products amounted to $5.3 million and $3.8 million, respectively. The increase was primarily due to the acquisition of an insurance agency during the third quarter of 2017.\nThe financial results for the year ended December 31, 2016 reflect indemnification asset expense of $10.3 million, whereas none was recorded in 2017. The FDIC loss-share agreements associated with this item of expense were terminated in September 2016, and thus all indemnification asset income/expense ceased at that time.\nOther gains and losses for the 2017 periods presented represent the net effects of miscellaneous gains and losses that are non-routine in nature. In the third quarter of 2016, the Company recorded a net gain of $1.4 million as a result of a branch exchange transaction.\nNoninterest Expenses\nNoninterest expenses amounted to $43.6 million in the fourth quarter of 2017 compared to $28.2 million recorded in the fourth quarter of 2016. Noninterest expenses for the year ended December 31, 2017 amounted to $145.2 million compared to $106.8 million in 2016.\nThe increase in noninterest expenses in 2017 related primarily to the Company's acquisition of Carolina Bank and Asheville Savings Bank. The Company expects to complete the data conversion of the Asheville Savings Bank customer accounts in March 2018 and to also consolidate three overlapping branches in the Asheville market at that time.\nAlso impacting expenses were other growth initiatives, including continued growth of the Company's SBA consulting firm and SBA lending division, as well as the acquisition of an insurance agency during the third quarter of 2017. Salary expense for the fourth quarter of 2017 was also impacted by approximately $1.1 million related to one-time bonuses granted to a majority of the Company's employees.\nMerger and acquisition expenses amounted to $3.2 million and $0.1 million for the three months ended December 31, 2017 and 2016, respectively. For the year ended December 31, 2017 and 2016, merger and acquisition expenses amounted to $8.1 million and $1.4 million, respectively. Merger and acquisition expenses represent transaction related costs associated primarily with the acquisitions of Carolina Bank and Asheville Savings Bank.\nIncome Taxes\nThe Company's effective tax rate for the fourth quarter of 2017 was 29.5% compared to 33.3% in the third quarter of 2017. The lower effective tax rate was due to the 2017 Tax Cuts and Jobs Act, which was signed into law in December 2017. The impact to the Company of revaluing its net deferred tax liability was to reduce income tax expense by approximately $1.3 million in the fourth quarter of 2017. The Company expects to be favorably impacted in 2018 by the reduction in the federal tax rate, with a projected effective tax rate of approximately 21%.\nBalance Sheet and Capital\nTotal assets at December 31, 2017 amounted to $5.5 billion, a 53.5% increase from a year earlier. Total loans at December 31, 2017 amounted to $4.0 billion, a 49.1% increase from a year earlier, and total deposits amounted to $4.4 billion at December 31, 2017, a 49.5% increase from a year earlier.\nIn addition to the growth realized from the acquisitions of Carolina Bank in March 2017 and Asheville Savings Bank in October 2017, the Company experienced strong organic loan and deposit growth during 2017. For 2017, organic loan growth (i.e. excluding loan balances assumed from Carolina Bank and Asheville Savings Bank) amounted to $228.0 million, or 8.4%. For 2017, organic deposit growth amounted to $195.1 million, or 6.6%. The strong growth was a result of ongoing internal initiatives to enhance loan and deposit growth, including the Company's recent expansion into higher growth markets. The loan growth noted above has been driven by the recently-entered North Carolina markets of Charlotte, Raleigh, and the Triad.\nThe Company remains well-capitalized by all regulatory standards, with an estimated Total Risk-Based Capital Ratio at December 31, 2017 of 12.50%, a decline from 13.36% at December 31, 2016, but still in excess of the 10.00% minimum to be considered well-capitalized. The Company's tangible common equity to tangible assets ratio was 8.23% at December 31, 2017, an increase of seven basis points from a year earlier.\nComments of the CEO and Other Business Matters\nRichard H. Moore, CEO of First Bancorp, commented on today's report, \"We are pleased to report a year of significant growth, outstanding earnings and the accomplishment of several significant strategic initiatives. In 2018, we will remain focused on providing the best possible community banking experience to our customers.\" Mr. Moore added, \"In that regard, we continue to carefully plan for the upcoming data conversion of the Asheville Savings Bank customer accounts to the First Bank system and the smooth transition of those offices to the First Bank name, both of which are scheduled for the weekend of March 16, 2018.\"\nThe following is a list of business development and other miscellaneous matters affecting the Company during the fourth quarter of 2017 not previously discussed:\nOn December 15, 2017, the Company announced a quarterly cash dividend of $0.08 cents per share payable on January 25, 2018 to shareholders of record on December 31, 2017. This is the same dividend rate as the Company declared in the fourth quarter of 2016.\nFirst Bancorp is a bank holding company headquartered in Southern Pines, North Carolina, with total assets of approximately $5.5 billion. Its principal activity is the ownership and operation of First Bank, a state-chartered community bank that operates 104 branches in North Carolina and South Carolina. First Bank also operates six mortgage loan production offices in the central region of North Carolina. First Bank provides SBA loans to customers through its nationwide network of lenders – for more information on First Bank's SBA lending capabilities, please visit www.firstbanksba.com . First Bancorp's common stock is traded on The NASDAQ Global Select Market under the symbol \"FBNC.\"\nPlease visit our website at www.LocalFirstBank.com .\nThis press release contains forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934 and the Private Securities Litigation Reform Act of 1995, which statements are inherently subject to risks and uncertainties. Forward-looking statements are statements that include projections, predictions, expectations or beliefs about future events or results or otherwise are not statements of historical fact. Such statements are often characterized by the use of qualifying words (and their derivatives) such as \"expect,\" \"believe,\" \"estimate,\" \"plan,\" \"project,\" \"anticipate,\" or other statements concerning opinions or judgments of the Company and its management about future events. Factors that could influence the accuracy of such forward-looking statements include, but are not limited to, the financial success or changing strategies of the Company's customers, the Company's level of success in integrating acquisitions, actions of government regulators, the level of market interest rates, and general economic conditions. For additional information about the factors that could affect the matters discussed in this paragraph, see the \"Risk Factors\" section of the Company's most recent annual report on Form 10-K available at www.sec.gov . Forward-looking statements speak only as of the date they are made, and the Company undertakes no obligation to update or revise forward-looking statements. The Company is also not responsible for changes made to the press release by wire services, internet services or other media.\nFirst Bancorp and Subsidiaries\nFinancial Summary – Page 1\nThree Months Ended\nDecember 31,\nPercent\n($ in thousands except per share data – unaudited)\n2017\n2016\nChange\nINCOME STATEMENT\nInterest income\nInterest and fees on loans\n$ 48,830\n31,021\nInterest on investment securities\n2,888\n1,998\nOther interest income\n1,358\n271\nTotal interest income\n53,076\n33,290\n59.4%\nInterest expense\nInterest on deposits\n2,500\n1,310\nInterest on borrowings\n1,716\n687\nTotal interest expense\n4,216\n1,997\n111.1%\nNet interest income\n48,860\n31,293\n56.1%\nProvision for loan losses\n−\n−\nn/m\nNet interest income after provision for loan losses\n48,860\n31,293\n56.1%\nNoninterest income\nService charges on deposit accounts\n3,337\n2,611\nOther service charges, commissions, and fees\n4,415\n3,044\nFees from presold mortgage loans\n1,574\n542\nCommissions from sales of insurance and financial products\n1,996\n946\nSBA consulting fees\n850\n1,301\nSBA loan sale gains\n2,238\n739\nBank-owned life insurance income\n654\n526\nForeclosed property gains (losses), net\n(92)\n(436)\nSecurities gains (losses), net\n−\n−\nOther gains (losses), net\n(110)\n200\nTotal noninterest income\n14,862\n9,473\n56.9%\nNoninterest expenses\nSalaries expense\n19,987\n13,787\nEmployee benefit expense\n3,680\n2,920\nOccupancy and equipment related expense\n3,883\n2,962\nMerger and acquisition expenses\n3,249\n145\nIntangibles amortization expense\n1,731\n377\nOther operating expenses\n11,087\n7,992\nTotal noninterest expenses\n43,617\n28,183\n54.8%\nIncome before income taxes\n20,105\n12,583\n59.8%\nIncome tax expense\n5,928\n4,228\n40.2%\nNet income\n14,177\n8,355\n69.7%\nPreferred stock dividends\n−\n−\nNet income available to common shareholders\n$ 14,177\n8,355\n69.7%\nEarnings per common share – basic\n$ 0.48\n0.41\n17.1%\nEarnings per common share – diluted\n0.48\n0.40\n20.0%\nADDITIONAL INCOME STATEMENT INFORMATION\nNet interest income, as reported\n$ 48,860\n31,293\nTax-equivalent adjustment (1)\n610\n544\nNet interest income, tax-equivalent\n$ 49,470\n31,837\n55.4%\n(1) This amount reflects the tax benefit that the Company receives related to its tax-exempt loans and securities, which carry interest rates lower than similar taxable investments due to their tax-exempt status. This amount has been computed assuming a 37% tax rate and is reduced by the related nondeductible portion of interest expense.\nn/m – not meaningful\nFirst Bancorp and Subsidiaries\nFinancial Summary – Page 2\nTwelve Months Ended\nDecember 31,\nPercent\n($ in thousands except per share data – unaudited)\n2017\n2016\nChange\nINCOME STATEMENT\nInterest income\nInterest and fees on loans\n$ 163,738\n121,322\nInterest on investment securities\n9,987\n8,782\nOther interest income\n3,657\n883\nTotal interest income\n177,382\n130,987\n35.4%\nInterest expense\nInterest on deposits\n7,544\n5,170\nInterest on borrowings\n5,127\n2,437\nTotal interest expense\n12,671\n7,607\n66.6%\nNet interest income\n164,711\n123,380\n33.5%\nProvision (reversal) for loan losses\n723\n(23)\nn/m\nNet interest income after provision for loan losses\n163,988\n123,403\n32.9%\nNoninterest income\nService charges on deposit accounts\n11,862\n10,571\nOther service charges, commissions, and fees\n14,610\n11,913\nFees from presold mortgage loans\n5,695\n2,033\nCommissions from sales of insurance and financial products\n5,300\n3,790\nSBA consulting fees\n4,024\n3,199\nSBA loan sale gains\n5,479\n1,433\nBank-owned life insurance income\n2,321\n2,052\nForeclosed property gains (losses), net\n(531)\n(625)\nFDIC indemnification asset expense, net\n−\n(10,255)\nSecurities gains (losses), net\n(235)\n3\nOther gains (losses), net\n383\n1,437\nTotal noninterest income\n48,908\n25,551\n91.4%\nNoninterest expenses\nSalaries expense\n66,786\n51,252\nEmployee benefit expense\n14,389\n10,812\nOccupancy and equipment related expense\n14,141\n11,446\nMerger and acquisition expenses\n8,073\n1,431\nIntangibles amortization expense\n4,240\n1,211\nOther operating expenses\n37,528\n30,669\nTotal noninterest expenses\n145,157\n106,821\n35.9%\nIncome before income taxes\n67,739\n42,133\n60.8%\nIncome tax expense\n21,767\n14,624\n48.8%\nNet income\n45,972\n27,509\n67.1%\nPreferred stock dividends\n−\n(175)\nNet income available to common shareholders\n$ 45,972\n27,334\n68.2%\nEarnings per common share – basic\n$ 1.82\n1.37\n32.8%\nEarnings per common share – diluted\n1.82\n1.33\n36.8%\nADDITIONAL INCOME STATEMENT INFORMATION\nNet interest income, as reported\n$ 164,711\n123,380\nTax-equivalent adjustment (1)\n2,590\n2,054\nNet interest income, tax-equivalent\n$ 167,301\n125,434\n33.4%\n(1) This amount reflects the tax benefit that the Company receives related to its tax-exempt loans and securities, which carry interest rates lower than\nsimilar taxable investments due to their tax-exempt status. This amount has been computed assuming a 37% tax rate and is reduced by the related\nnondeductible portion of interest expense.\nn/m - not meaningful\nFirst Bancorp and Subsidiaries\nFinancial Summary – Page 3\nThree Months Ended\nDecember 31,\nTwelve Months Ended\nDecember 31,\nPERFORMANCE RATIOS (annualized)\n2017\n2016\n2017\n2016\nReturn on average assets (1)\n1.01%\n0.94%\n1.00%\n0.80%\nReturn on average common equity (2)\n8.04%\n9.17%\n8.62%\n7.73%\nNet interest margin – tax-equivalent (3)\n4.01%\n3.94%\n4.08%\n4.03%\nNet charge-offs to average loans\n0.13%\n0.12%\n0.04%\n0.14%\nCOMMON SHARE DATA\nCash dividends declared – common\n$ 0.08\n0.08\n$ 0.32\n0.32\nStated book value – common\n23.38\n17.66\n23.38\n17.66\nTangible book value – common\n14.69\n13.85\n14.69\n13.85\nCommon shares outstanding at end of period\n29,639,374\n20,844,505\n29,639,374\n20,844,505\nWeighted average shares outstanding – basic\n29,657,638\n20,146,230\n25,210,606\n19,964,727\nWeighted average shares outstanding – diluted\n29,749,378\n20,852,861\n25,291,382\n20,732,917\nCAPITAL RATIOS\nTangible common equity to tangible assets\n8.23%\n8.16%\n8.23%\n8.16%\nCommon equity tier I capital ratio - estimated\n10.72%\n10.92%\n10.72%\n10.92%\nTier I leverage ratio\n9.58%\n10.17%\n9.58%\n10.17%\nTier I risk-based capital ratio - estimated\n11.94%\n12.49%\n11.94%\n12.49%\nTotal risk-based capital ratio - estimated\n12.50%\n13.36%\n12.50%\n13.36%\nAVERAGE BALANCES ($ in thousands)\nTotal assets\n$ 5,554,545\n3,539,363\n$ 4,590,786\n3,422,267\nLoans\n4,048,224\n2,683,493\n3,420,939\n2,603,327\nEarning assets\n4,899,421\n3,214,719\n4,101,949\n3,108,918\nDeposits\n4,390,879\n2,905,501\n3,696,730\n2,827,513\nInterest-bearing liabilities\n3,618,312\n2,380,614\n3,025,401\n2,324,823\nShareholders' equity\n699,558\n369,037\n533,205\n360,715\n(1) Calculated by dividing annualized net income available to common shareholders by average assets.\n(2) Calculated by dividing annualized net income available to common shareholders by average common equity.\n(3) See footnote 1 on page 1 of Financial Summary for discussion of tax-equivalent adjustments.\nTREND INFORMATION\n($ in thousands except per share data)\nFor the Three Months Ended\nINCOME STATEMENT\nDec. 31,\n2017\nSept. 30,\n2017\nJune 30,\n2017\nMar. 31,\n2017\nDec. 31,\n2016\nNet interest income – tax-equivalent (1)\n$ 49,470\n42,341\n40,609\n34,881\n31,837\nTaxable equivalent adjustment (1)\n610\n702\n693\n585\n544\nNet interest income\n48,860\n41,639\n39,916\n34,296\n31,293\nProvision for loan losses\n−\n−\n−\n723\n−\nNoninterest income\n14,862\n12,362\n11,875\n9,809\n9,473\nNoninterest expense\n43,617\n34,384\n35,084\n32,072\n28,183\nIncome before income taxes\n20,105\n19,617\n16,707\n11,310\n12,583\nIncome tax expense\n5,928\n6,531\n5,553\n3,755\n4,228\nNet income\n14,177\n13,086\n11,154\n7,555\n8,355\nEarnings per common share – basic\n0.48\n0.53\n0.45\n0.34\n0.41\nEarnings per common share – diluted\n0.48\n0.53\n0.45\n0.34\n0.40\n(1) See footnote 1 on page 1 of Financial Summary for discussion of tax-equivalent adjustments.\nFirst Bancorp and Subsidiaries\nFinancial Summary – Page 4\nCONSOLIDATED BALANCE SHEETS\n($ in thousands - unaudited)\nAt Dec. 31,\n2017\nAt Sept. 30,\n2017\nAt Dec. 31,\n2016\nOne\nYear\nChange\nAssets\nCash and due from banks\n$ 114,301\n82,758\n71,645\n59.5%\nInterest bearing deposits with banks\n375,189\n326,089\n234,348\n60.1%\nTotal cash and cash equivalents\n489,490\n408,847\n305,993\n60.0%\nInvestment securities\n461,773\n322,080\n329,042\n40.3%\nPresold mortgages\n12,459\n17,426\n2,116\n488.8%\nTotal loans\n4,042,369\n3,429,755\n2,710,712\n49.1%\nAllowance for loan losses\n(23,298)\n(24,593)\n(23,781)\n(2.0%)\nNet loans\n4,019,071\n3,405,162\n2,686,931\n49.6%\nPremises and equipment\n116,233\n95,762\n75,351\n54.3%\nIntangible assets\n257,507\n160,301\n79,475\n224.0%\nForeclosed real estate\n12,571\n9,356\n9,532\n31.9%\nBank-owned life insurance\n99,162\n88,081\n74,138\n33.8%\nOther assets\n78,771\n83,822\n52,284\n50.7%\nTotal assets\n$ 5,547,037\n4,590,837\n3,614,862\n53.5%\nLiabilities\nDeposits:\nNon-interest bearing checking accounts\n$ 1,196,161\n1,016,947\n756,003\n58.2%\nInterest bearing checking accounts\n884,254\n683,113\n635,431\n39.2%\nMoney market accounts\n982,822\n793,919\n683,680\n43.8%\nSavings accounts\n454,860\n396,192\n209,074\n117.6%\nBrokered deposits\n239,659\n215,615\n136,466\n75.6%\nInternet time deposits\n7,995\n7,995\n−\nn/m\nOther time deposits > $100,000\n347,862\n296,006\n287,939\n20.8%\nOther time deposits\n293,342\n241,454\n238,760\n22.9%\nTotal deposits\n4,406,955\n3,651,241\n2,947,353\n49.5%\nBorrowings\n407,543\n397,215\n271,394\n50.2%\nOther liabilities\n39,560\n29,880\n28,014\n41.2%\nTotal liabilities\n4,854,058\n4,078,336\n3,246,761\n49.5%\nShareholders' equity\nCommon stock\n432,794\n263,493\n147,287\n193.8%\nRetained earnings\n264,331\n251,790\n225,921\n17.0%\nStock in rabbi trust assumed in acquisition\n(3,581)\n(3,571)\n−\nn/m\nRabbi trust obligation\n3,581\n3,571\n−\nn/m\nAccumulated other comprehensive loss\n(4,146)\n(2,782)\n(5,107)\n18.8%\nTotal shareholders' equity\n692,979\n512,501\n368,101\n88.3%\nTotal liabilities and shareholders' equity\n$ 5,547,037\n4,590,837\n3,614,862\n53.5%\nn/m = not meaningful\nFirst Bancorp and Subsidiaries\nFinancial Summary - Page 5\nFor the Three Months Ended\nYIELD INFORMATION\nDec. 31,\n2017\nSept. 30,\n2017\nJune 30,\n2017\nMar. 31,\n2017\nDec. 31,\n2016\nYield on loans\n4.79%\n4.84%\n4.78%\n4.71%\n4.60%\nYield on securities – tax-equivalent (1)\n3.35%\n3.73%\n3.55%\n3.41%\n3.09%\nYield on other earning assets\n1.23%\n1.38%\n0.96%\n0.86%\n0.53%\nYield on all interest earning assets\n4.35%\n4.49%\n4.38%\n4.32%\n4.19%\nRate on interest bearing deposits\n0.31%\n0.29%\n0.26%\n0.24%\n0.24%\nRate on other interest bearing liabilities\n1.62%\n1.75%\n1.54%\n1.28%\n1.15%\nRate on all interest bearing liabilities\n0.46%\n0.45%\n0.40%\n0.34%\n0.33%\nTotal cost of funds\n0.35%\n0.34%\n0.30%\n0.26%\n0.25%\nNet interest margin – tax-equivalent (2)\n4.01%\n4.16%\n4.08%\n4.07%\n3.94%\nAverage prime rate\n4.30%\n4.25%\n4.04%\n3.79%\n3.55%\n(1) See footnote 1 on page 1 of Financial Summary for discussion of tax-equivalent adjustments.\n(2) Calculated by dividing annualized tax-equivalent net interest income by average earning assets for the period. See footnote 1 on page 1 of Financial\nSummary for discussion of tax-equivalent adjustments.\nFor the Three Months Ended\nNET INTEREST INCOME PURCHASE\nACCOUNTING ADJUSTMENTS\n($ in thousands)\nDec. 31,\n2017\nSept. 30,\n2017\nJune 30,\n2017\nMar. 31,\n2017\nDec. 31,\n2016\nInterest income – increased by accretion of loan\ndiscount\n$ 2,003\n1,745\n1,968\n1,360\n898\nInterest expense – reduced by premium\namortization of deposits\n140\n85\n103\n57\n38\nInterest expense – increased by discount\naccretion of borrowings\n(46)\n(43)\n(29)\n(9)\n−\nImpact on net interest income\n$ 2,097\n1,787\n2,042\n1,408\n936\nFirst Bancorp and Subsidiaries\nFinancial Summary – Page 6\nASSET QUALITY DATA ($ in thousands)\nDec. 31,\n2017\nSept. 30,\n2017\nJune 30,\n2017\nMar. 31,\n2017\nDec. 31,\n2016\nNonperforming assets\nNonaccrual loans\n$ 20,968\n23,350\n22,795\n25,684\n27,468\nTroubled debt restructurings - accruing\n19,834\n20,330\n21,019\n21,559\n22,138\nAccruing loans > 90 days past due\n-\n-\n-\n-\n-\nTotal nonperforming loans\n40,802\n43,680\n43,814\n47,243\n49,606\nForeclosed real estate\n12,571\n9,356\n11,196\n12,789\n9,532\nTotal nonperforming assets\n$ 53,373\n53,036\n55,010\n60,032\n59,138\nPurchased credit impaired loans not included\nabove (1)\n$ 23,165\n15,034\n16,846\n19,167\n-\nAsset Quality Ratios\nNet quarterly charge-offs to average loans -\nannualized\n0.13%\n-0.07%\n-0.06%\n0.13%\n0.12%\nNonperforming loans to total loans\n1.01%\n1.27%\n1.30%\n1.44%\n1.83%\nNonperforming assets to total assets\n0.96%\n1.16%\n1.21%\n1.35%\n1.64%\nAllowance for loan losses to total loans\n0.58%\n0.72%\n0.71%\n0.72%\n0.88%\n(1) In the March 3, 2017 acquisition of Carolina Bank Holdings, Inc. and the October 1, 2017 acquisition of ASB Bancorp, Inc., the Company acquired\n$19.3 million and $9.9 million, respectively, in purchased credit impaired loans in accordance with ASC 310-30 accounting guidance. These loans\nare excluded from the nonperforming loan amounts.\nFirst Bancorp and Subsidiaries\nFinancial Summary - Page 7\nFor the Three Months Ended\nNET INTEREST MARGIN, EXCLUDING\nLOAN DISCOUNT ACCRETION –\nRECONCILIATION\n($ in thousands)\nDec. 31,\n2017\nSept. 30,\n2017\nJune 30,\n2017\nMar. 31,\n2017\nDec. 31,\n2016\nNet interest income, as reported\n$ 48,860\n41,639\n39,916\n34,296\n31,293\nTax-equivalent adjustment\n610\n702\n693\n585\n544\nNet interest income, tax-equivalent (A)\n$ 49,470\n42,341\n40,609\n34,881\n31,837\nAverage earning assets (B)\n$ 4,899,421\n4,040,257\n3,989,593\n3,478,525\n3,214,719\nTax-equivalent net interest\nmargin, annualized – as reported – (A)/(B)\n4.01%\n4.16%\n4.08%\n4.07%\n3.94%\nNet interest income, tax-equivalent\n$ 49,470\n42,341\n40,609\n34,881\n31,837\nLoan discount accretion\n2,003\n1,745\n1,968\n1,360\n898\nNet interest income, tax-equivalent, excluding\nloan discount accretion (A)\n$ 47,467\n40,596\n38,641\n33,521\n30,939\nAverage earnings assets (B)\n$ 4,899,421\n4,040,257\n3,989,593\n3,478,525\n3,214,719\nTax-equivalent net interest margin, excluding\nof loan discount accretion,\nannualized – (A) / (B)\n3.84%\n3.99%\n3.88%\n3.91%\n3.83%\nNote: The measure \"tax-equivalent net interest margin, excluding impact of loan discount accretion\" is a non-GAAP performance measure. Management of the Company believes that it is useful to calculate and present the Company's net interest margin without the impact of loan discount accretion for the reasons explained in the remainder of this paragraph. Loan discount accretion is a non-cash interest income adjustment related to the Company's acquisition of loans and represents the portion of the fair value discount that was initially recorded on the acquired loans that is being recognized into income over the lives of the loans. At December 31, 2017, the Company had a remaining loan discount balance of $26.9 million compared to $12.7 million at December 31, 2016. For the related loans that perform and pay-down over time, the loan discount will also be reduced, with a corresponding increase to interest income. Therefore management of the Company believes it is useful to also present this ratio to reflect the Company's net interest margin excluding this non-cash, temporary loan discount accretion adjustment to aid investors in comparing financial results between periods. The Company cautions that non-GAAP financial measures should be considered in addition to, but not as a substitute for, the Company's reported GAAP results.\nView original content: http://www.prnewswire.com/news-releases/first-bancorp-reports-fourth-quarter-and-annual-results-300589265.html\nSOURCE First Bancorp", "external_links": ["http://www.sec.gov/", "https://localfirstbank.com/", "http://www.prnewswire.com/news-releases/first-bancorp-reports-fourth-quarter-and-annual-results-300589265.html", "http://www.firstbanksba.com/"], "published": "2018-01-29T16:30:00.000+02:00", "crawled": "2018-01-29T19:27:28.005+02:00", "highlightTitle": ""}