{"organizations": [], "uuid": "7cd9394a1b623152e41342ea523dedc79c7035cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224794719&w=1200&r=LYNXMPEE0N13N", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-federer/federer-dispatches-berdych-to-reach-semi-final-idUKKBN1FD1LB", "country": "US", "domain_rank": 408, "title": "Federer dispatches Berdych to reach semi-final", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T14:18:00.000+02:00", "replies_count": 0, "uuid": "7cd9394a1b623152e41342ea523dedc79c7035cc"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-federer/federer-dispatches-berdych-to-reach-semi-final-idUKKBN1FD1LB", "ord_in_thread": 0, "title": "Federer dispatches Berdych to reach semi-final", "locations": [], "entities": {"persons": [{"name": "berdych", "sentiment": "negative"}, {"name": "federer", "sentiment": "negative"}, {"name": "tomas berdych", "sentiment": "none"}, {"name": "roger federer", "sentiment": "none"}], "locations": [{"name": "hawkeye", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 12:16 PM / Updated 6 hours ago Wary Federer through to semis after Hawkeye hiccup Martyn Herman 4 Min Read \nMELBOURNE (Reuters) - A momentary loss of Roger Federer’s trademark cool enlivened an otherwise routine victory by the defending champion over Tomas Berdych as the Swiss player moved into the semi-finals of the Australian Open on Wednesday. \nFederer’s ninth successive defeat of the burly Czech, this time 7-6(1) 6-3 6-4, was not all smooth sailing for the 36-year-old who snapped at umpire Fergus Murphy in the first set. \nHis mini-rant about malfunctioning Hawkeye technology when Berdych served for the opening set said much about the struggle Federer was having to contain the 19th seeded powerhouse. \nBut in the end all was well for Federer, who reached his record-extending 43rd grand slam semi-final where he will face 21-year-old South Korean sensation Chung Hyeon. \nIt is the 11th time Federer has reached the final four of a slam without dropping a set and, with Rafa Nadal out of action, he is clear favourite to win a 20th grand slam title and sixth Australian Open. \nFederer had dropped only two sets in his previous eight matches against Berdych but came desperately close to losing the opener on Rod Laver Arena when the 32-year-old served at 5-3, having secured an early break. \nBerdych had one set point but Federer blazed a backhand past him to snuff out the danger, before breaking with an equally sublime swish of his matt black racket to break. \nThe main talking point of the match had arrived a few points earlier though with Berdych 15-40 down. Federer thought a serve was out despite no call and immediately challenged. \nUnfortunately, however, the usual video playback failed and Federer was told by Murphy that the serve was in. \nWhen announcing that Federer had lost his challenge, the Swiss saw red and marched to the chair. Tennis - Australian Open - Quarterfinals - Rod Laver Arena, Melbourne, Australia, January 24, 2018. Roger Federer of Switzerland reacts during his match against Tomas Berdych of Czech Republic. REUTERS/Toru Hanai \n“Are you comfortable with this?” he said, as the crowd booed. “You can’t steal my challenge. You’re okay with this?” \nFederer then dumped a forehand in the net before re-focussing and taking the set into a tiebreak in which he allowed Berdych one point -- taking the set with an impudent drop shot. \nLater, with his 92nd Australian Open victory in the bag, Federer played down the incident. \n“I hung around, got a bit lucky, a bit angry, a bit frustrated at the umpire,” Federer said in the now obligatory comedy duo on-court interview with Jim Courier. Tennis - Australian Open - Quarterfinals - Rod Laver Arena, Melbourne, Australia, January 24, 2018. Switzerland's Roger Federer celebrates winning his match against Czech Republic's Tomas Berdych. REUTERS/Edgar Su \nAfter the first-set dramas it was routine with Federer breaking decisively for 5-3 with an easy backhand winner after Berdych’s half volley sat up begging. \nBerdych could have thrown in the towel when he fell behind in the third set, but kept Federer on his toes by breaking back. \nIt only delayed the inevitable, though, as Federer broke again and completed the job with a love service game. Related Coverage Bogeyman Chung set to give rivals nightmares - coach \n“Coming back from 5-2 in the first set, it was clearly big tonight,” Federer, the oldest man to reach the semis here since Ken Rosewall in 1977, told reporters. \nFederer’s said Nadal’s retirement in the fifth set against Marin Cilic the previous evening, scuppering a repeat of last year’s epic final, had played on his mind. \n“I feel that’s exactly the moment when you stumble. That’s why I think I was actually very nervous going into this match tonight, and that’s why I struggled early on,” he said. \n“I knew the danger of Berdych. Seeing what happened to so many other top seeds here in the draw, I was a bit wary.” Reporting by Martyn Herman; Editing by Christian Radnedge and Alexander Smith", "external_links": [], "published": "2018-01-24T14:18:00.000+02:00", "crawled": "2018-01-24T14:46:17.004+02:00", "highlightTitle": ""}