{"organizations": [], "uuid": "47fbda527eb5ca7a17f08c3e94794959d39d3fea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/04/the-associated-press-judge-weighs-whether-nc-schools-conspired-to-depress-wages.html", "country": "US", "domain_rank": 767, "title": "Judge weighs whether NC schools conspired to depress wages", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T11:58:00.000+02:00", "replies_count": 0, "uuid": "47fbda527eb5ca7a17f08c3e94794959d39d3fea"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/04/the-associated-press-judge-weighs-whether-nc-schools-conspired-to-depress-wages.html", "ord_in_thread": 0, "title": "Judge weighs whether NC schools conspired to depress wages", "locations": [], "entities": {"persons": [{"name": "hill", "sentiment": "none"}, {"name": "catherine eagles", "sentiment": "none"}, {"name": "danielle seaman", "sentiment": "none"}], "locations": [{"name": "greensboro", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "duke university", "sentiment": "none"}, {"name": "university of north carolina", "sentiment": "none"}, {"name": "seaman", "sentiment": "none"}, {"name": "eagles", "sentiment": "none"}, {"name": "duke", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GREENSBORO, N.C. (AP) — A federal judge is deciding whether an alleged conspiracy between two neighboring research universities potentially depressed the wages of thousands of medical professionals in North Carolina.\nU.S. District Judge Catherine Eagles listened for three hours Thursday to arguments on whether a former radiology professor's anti-trust lawsuit should be expanded to cover thousands of doctors, nurses and other employees at Duke University in Durham.\nEagles said she would issue her decision later on whether to make the case a class-action to include a larger group. Eagles said she was inclined to expand Dr. Danielle Seaman's litigation to include about 2,000 Duke medical faculty but exclude nurses and other medical workers, whose pay lawyers had argued varied depending on how much doctors earned.\nThe judge also agreed Thursday to drop the University of North Carolina from the lawsuit. The Chapel Hill public university's hospital, medical school and administrators agreed in a settlement to provide documents Seaman's lawyers could use in the ongoing case against Duke, a private school about 10 miles away.\nSeaman's lawyers made the deal in part because, as a public institution, UNC could invoke constitutional limits on federal lawsuits against states. UNC won't pay any money in the settlement and promised not to participate in any unlawful restraints on competition.\nEagles said Seaman's lawyers had emails and other documents showing administrators at the two schools may have conspired to hold down salaries for highly paid medical experts.\n\"They did a pretty bad job of not putting this in writing,\" Eagles said.\nBoth UNC and Duke deny the existence of the no-hire agreement that Seaman claims was reached by top administrators to prevent lateral transfers, but which didn't cover promotions.\nDoctors did move from teaching into private practice, demonstrating that an alleged agreement between the two medical behemoths didn't control the local labor market, Duke attorney Derek Ludwin told the judge.\n\"Plaintiffs have given you no reason to think all or many of these class members were not part of a free market for employment,\" he said.\nSeaman's lawyer, Dean Harvey, said evidence showed the heads of the two medical schools discussed the agreement not to poach each other's medical professors at two meetings in 2004, but the agreement may have dated to the 1990s. A statistical analysis estimated the conspiracy shaved about 8 percent off the earnings of Duke physicians, said Harvey, whose San Francisco law firm got $415 million from Google Inc., Intel Corp., Adobe Systems Inc. and Apple Inc., in 2015 after accusing them of agreeing not to hire each other's best workers.\nThe case springs from Seaman's thwarted effort to move from her position at Duke to a similar job at UNC.\n\"I agree that you would be a great fit for our cardiothoracic imaging division. Unfortunately, I just received confirmation today from the Dean's office that lateral moves of faculty between Duke and UNC are not permitted. There is reasoning for this 'guideline' which was agreed upon between the deans of UNC and Duke a few years back. I hope you understand,\" UNC cardiothoracic imaging chief Dr. Paul Molina wrote in a 2015 email.\nDisappointed, Seaman wrote that \"there are only two academic centers in this area where I could work, and I am already at one of them.\"\nMolina then said the agreement was hatched to reduce competition and costs after a previous effort by Duke to recruit UNC faculty.\n\"Dear Danielle, ... In answer to your question, the 'guideline' was generated in response to an attempted recruitment by Duke a couple of years ago of the entire UNC bone marrow transplant team; UNC had to generate a large retention package to keep the team intact,\" his email said.\nFollow Emery P. Dalesio at http://twitter.com/emerydalesio . His work can be found at http://bigstory.ap.org/content/emery .", "external_links": [], "published": "2018-01-04T11:58:00.000+02:00", "crawled": "2018-01-05T00:03:53.002+02:00", "highlightTitle": ""}