{"organizations": [], "uuid": "cdcc7200649ac00cfc7b1e07db316ba0e5615459", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220719625&w=1200&r=LYNXMPEE0905V", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/usa-immigration/u-s-judge-blocks-trump-move-to-end-daca-program-for-immigrants-idINKBN1EZ0B3", "country": "US", "domain_rank": 408, "title": "Trump blasts DACA ruling, calls U.S. court system 'broken and unfair'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T22:45:00.000+02:00", "replies_count": 0, "uuid": "cdcc7200649ac00cfc7b1e07db316ba0e5615459"}, "author": "", "url": "https://in.reuters.com/article/usa-immigration/u-s-judge-blocks-trump-move-to-end-daca-program-for-immigrants-idINKBN1EZ0B3", "ord_in_thread": 0, "title": "Trump blasts DACA ruling, calls U.S. court system 'broken and unfair'", "locations": [], "entities": {"persons": [{"name": "richard cowan", "sentiment": "none"}, {"name": "william als", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mica rosenberg", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "daca", "sentiment": "negative"}, {"name": "deferred action for childhood arrivals", "sentiment": "none"}, {"name": "u.s. district court", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON/NEW YORK (Reuters) - U.S. President Donald Trump blasted the federal court system as “broken and unfair” on Wednesday after a judge blocked his administration’s move to end a programme protecting young immigrants brought to the United States illegally by their parents.\nA U.S. District Court judge in San Francisco ruled late on Tuesday that Deferred Action for Childhood Arrivals (DACA), which Trump has said he will end, should remain in effect until legal challenges brought in multiple courts are resolved.\nUnder the administration’s plan, the programme for young people commonly known as “Dreamers” would be phased out over a two-year period, beginning in March.\n“It just shows everyone how broken and unfair our Court System is when the opposing side in a case (such as DACA) ... almost always wins before being reversed by higher courts,” the Republican president wrote on Twitter.\nU.S. District Judge William Alsup, who made the ruling, is in the Northern District of California. The administration did not immediately appeal the decision, which would typically next go to the 9th U.S. Circuit Court of Appeals, but the Justice Department said in a statement it would “continue to vigorously defend this position, and looks forward to vindicating its position in further litigation.”\nSome legal experts predicted the Trump administration would be successful if it appealed the ruling to the Supreme Court. In December, the highest court granted an administration request to block an earlier Alsup order that called for the release of internal documents related to the government’s DACA decision.\nSeveral experts also said Tuesday’s court ruling could complicate negotiations between congressional Democrats and Republicans trying to reach a deal to resolve the legal status of nearly 700,000 young immigrants covered by the programme.\n“The ruling could deflate the pressure on Congress to act in the next week and in our view there remains just as much urgency as ever for a lasting fix,” said Michael Tan from the American Civil Liberties Union. Dreamers “don’t need a protracted legal battle,” he added.\nAt a White House meeting on Tuesday before the court ruling, Trump urged lawmakers to quickly reach a bipartisan DACA deal before moving on to even tougher negotiations on a comprehensive immigration bill. White House spokeswoman Sarah Sanders said the issue should be resolved as part of the legislative process.\n“President Trump is committed to the rule of law, and will work with members of both parties to reach a permanent solution that corrects the unconstitutional actions taken by the last administration,” Sanders said after the court ruling, referring to the administration of Democratic President Barack Obama.\n‘URGENCY’\nFILE PHOTO: Students gather in support of DACA (Deferred Action for Childhood Arrivals) at the University of California Irvine Student Center in Irvine, California, U.S., October 11, 2017. REUTERS/Mike Blake/File Photo Democratic Senate leader Chuck Schumer also urged a quick legislative solution. The talks on DACA have become embroiled in negotiations on funding for the federal government, which expires on Jan. 19.\n“The ruling last night in no way diminishes the urgency of solving the DACA issue,” Schumer said on the Senate floor. “On this, we agree with the White House.”\nJohn Cornyn, the Senate’s No. 2 Republican, condemned the ruling, but said it would not affect congressional negotiations.\n”We’re reading the court’s opinion. It strikes me as wildly wrong,“ Cornyn told reporters. ”If President Obama can create the Deferred Action programme, then certainly President Trump can uncreate it or end it.”\nCornyn said various attempts in the past few months to strike a deal “were basically getting nowhere.”\nTrump, in office nearly a year, has a history of attacking courts that rule against him.\nAfter his first version of a travel ban affecting several Muslim-majority countries was blocked, he called it a “ridiculous” decision by a “so-called judge.” During his presidential campaign he attacked the integrity of a Mexican-American judge presiding over a lawsuit involving Trump University.\nAlsup said in his ruling the federal government did not have to process new applications from people who had never before received protection under the DACA programme. However, he ordered the government to continue processing renewal applications from people who had previously been covered.\nA majority of those protected under DACA are from Mexico and Central America and have spent most of their lives in the United States, attending school and participating in society.\nTrump put their fate in doubt in early September when he announced he was ending the DACA programme created by Obama, which allowed them to live and work in the United States legally, and said it was up to Congress to come up with a solution.\nIn his ruling, Alsup Quote: d previous tweets by the president in support of Dreamers. “In September,” Alsup wrote, “President Trump stated his support for DACA, tweeting: ‘Does anybody really want to throw out good, educated and accomplished young people who have jobs, some serving in the military? Really!'”\nAdditional reporting by Blake Brittain, Yeganeh Torbati and Susan Cornwell in Washington; Writing by John Whitesides; Editing by Mohammad Zargham, Sue Horton, Jonathan Oatis and Frances Kerry\n ", "external_links": [], "published": "2018-01-10T22:45:00.000+02:00", "crawled": "2018-01-10T23:17:54.012+02:00", "highlightTitle": ""}