{"organizations": [], "uuid": "52881c2a429b242eb9c9bb3f8e3c6c3e5d106d0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-pmcf-announces-sale-of-plymouth-packaging-to-westrock-company-nyse-wrk.html", "country": "US", "domain_rank": 767, "title": "PMCF Announces Sale of Plymouth Packaging to WestRock Company (NYSE: WRK)", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-26T01:15:00.000+02:00", "replies_count": 0, "uuid": "52881c2a429b242eb9c9bb3f8e3c6c3e5d106d0c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-pmcf-announces-sale-of-plymouth-packaging-to-westrock-company-nyse-wrk.html", "ord_in_thread": 0, "title": "PMCF Announces Sale of Plymouth Packaging to WestRock Company (NYSE: WRK)", "locations": [], "entities": {"persons": [{"name": "plymouth packagin", "sentiment": "negative"}], "locations": [{"name": "mich.", "sentiment": "none"}, {"name": "southfield", "sentiment": "none"}, {"name": "battle creek", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}], "organizations": [{"name": "westrock company", "sentiment": "negative"}, {"name": "plymouth packaging", "sentiment": "negative"}, {"name": "p&m corporate finance", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "plymouth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SOUTHFIELD, Mich., Jan. 25, 2018 /PRNewswire/ -- P&M Corporate Finance (PMCF) is pleased to announce the sale of Plymouth Packaging, Inc. (\"Plymouth\", \"Box on Demand\" or the \"Company\") to WestRock Company (\"WestRock\", NYSE: WRK). Headquartered in Battle Creek, Michigan, Plymouth is an innovator in the corrugated packaging industry and pioneered an on-demand packaging system that uses corrugated fanfold materials and proprietary box making machinery. Plymouth's \"Box on Demand\" systems provide customers with the ability to make right-sized corrugated boxes at their facilities to cost effectively package a wide range and variability of products, reducing both packaging and shipping costs when compared to traditional corrugated boxes. Plymouth has successfully installed these integrated packaging systems at a large number of companies across a variety of end markets including e-commerce, building products, furniture, industrial and many others.\nPlymouth serves its Box on Demand customers across North America from three strategically located corrugated fanfold manufacturing facilities as well as numerous distribution centers. These facilities are equipped with industry leading corrugated fanfold manufacturing technology including many custom and proprietary modifications. In addition to its Box on Demand product offering, Plymouth has traditional corrugated box manufacturing capabilities and operates a niche, short to medium volume sheet plant that serves the Southeast Michigan market. Also included in the transaction were Plymouth's ownership stake in Panotec, its Box on Demand machinery manufacturer based in Italy, and the Company's investment in Alliance Sheets, one of the largest corrugators in the United States.\nPlymouth was founded in 1991 by Paul Magnell and was owned by the Magnell family prior to the sale. Greg Magnell served as president of the Company and will continue in his leadership role under WestRock's ownership. \"We are excited to become part of WestRock and believe there is a strong cultural fit with our two organizations,\" said Greg Magnell. \"The combination provides access to a much broader geographic footprint and significant additional resources that will help this business continue to grow and serve our customers.\"\nThe Magnells selected John Hart and PMCF's Plastics & Packaging Group to serve as Plymouth's M&A advisor / investment banker in the transaction. Greg Magnell noted, \"We are very happy with our decision to hire PMCF as our M&A advisor. John and his team are clearly experts in the packaging industry and knew how to best position a unique company like ours to the right group of prospective buyers. They provided heavy senior level involvement throughout each stage of the process and were instrumental in making this a successful transaction for us. We would highly recommend PMCF to other packaging companies considering a transaction.\"\nAbout PMCF\nPMCF is an award-winning middle market investment bank providing global merger and acquisition advisory services to private, public, and private equity owned companies. PMCF provides a broad range of services including sale advisory, acquisition advisory, capital raising, and strategic advisory. The firm has dedicated industry teams providing services to the plastics and packaging, medical technology, industrials, and business services industries. PMCF has offices in Chicago and Detroit and around the globe via its Corporate Finance International associates. PMCF is an affiliate of Plante Moran one of the nation's largest professional services firms. For more information, visit www.pmcf.com .\nJohn Hart\nManaging Director, Plastics & Packaging Group\n248.223.3468\njohn.hart@pmcf.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/pmcf-announces-sale-of-plymouth-packaging-to-westrock-company-nyse-wrk-300588610.html\nSOURCE P&M Corporate Finance", "external_links": ["http://www.prnewswire.com/news-releases/pmcf-announces-sale-of-plymouth-packaging-to-westrock-company-nyse-wrk-300588610.html", "http://www.pmcf.com/"], "published": "2018-01-26T01:15:00.000+02:00", "crawled": "2018-01-26T01:26:09.000+02:00", "highlightTitle": ""}