{"organizations": [], "uuid": "2adce6360b8222ea9898112495db20c31e1c4062", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-coram-deo-academy-names-accomplished-executive-ret-colonel-and-phd-dr-alan-marshall-as-president.html", "country": "US", "domain_rank": 767, "title": "Coram Deo Academy Names Accomplished Executive, Ret. Colonel and PhD, Dr. Alan Marshall, as President", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-08T20:48:00.000+02:00", "replies_count": 0, "uuid": "2adce6360b8222ea9898112495db20c31e1c4062"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-coram-deo-academy-names-accomplished-executive-ret-colonel-and-phd-dr-alan-marshall-as-president.html", "ord_in_thread": 0, "title": "Coram Deo Academy Names Accomplished Executive, Ret. Colonel and PhD, Dr. Alan Marshall, as President", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FLOWER MOUND, Texas, Jan. 8, 2018 /PRNewswire/ -- Coram Deo Academy (CDA), the largest classical and the largest university model school in the country, is continuing its mission to train wise thinkers and servant leaders who will shape the culture for the glory of God. CDA announced today that it has appointed Dr. Alan Marshall to fill the role of President. CDA's Board of Directors recognized the need for an executive leader to help keep tuition affordable while shepherding it through the next phase of growth and maturation.\nBeginning in April, 2017, the Board worked closely with the leading executive search firm Carter Baldwin to identify the ideal person for this role. Chairman of the Board Brian Shaw, said, \"We knew that for CDA to continue to successfully fulfill its mission to help shape the culture, we needed a strong leader with a proven background in organizational leadership, development, and above all, a passion for the Kingdom of God. By executing a detailed and thorough search process, we are very confident in the opportunities for the school over the years to come.\"\nDr. Marshall's educational and executive accomplishments include a Bachelor's degree from the United States Air Force Academy and Master's degrees in Aeronautical Sciences from Embry-Riddle Aeronautical University and in Applied Math from the University of Washington. He received his Ph.D. in Organizational Leadership from Regent University. His executive training includes The Harvard Kennedy School Leadership Decision Making course. Dr. Marshall faithfully served in the United States Air Force for over two decades. He has also served as an Assistant Professor and Course Director at the Air Force Academy. He retired in 2014 as a Colonel and the Director of Safety in Air Combat Command at Langley Air Force Base located in Virginia.\nDr. Marshall joins Coram Deo Academy after most recently serving as the Head of School at Sandhills Christian School in Southern Pines, NC.\nAs Dr. Marshall and his family transition to Coram Deo Academy, he notes that he and his wife, Kendra, are \"very excited to make North Texas our new home.\" Preparing to lead CDA, he notes, \"We want to stay on mission to develop wise thinkers and servant leaders who shape the culture for the glory of God. I am excited to be a part of this chapter at Coram Deo Academy.\"\nView original content: http://www.prnewswire.com/news-releases/coram-deo-academy-names-accomplished-executive-ret-colonel-and-phd-dr-alan-marshall-as-president-300579164.html\nSOURCE Coram Deo Academy", "external_links": ["http://www.prnewswire.com/news-releases/coram-deo-academy-names-accomplished-executive-ret-colonel-and-phd-dr-alan-marshall-as-president-300579164.html"], "published": "2018-01-08T20:48:00.000+02:00", "crawled": "2018-01-09T09:40:36.023+02:00", "highlightTitle": ""}