{"organizations": [], "uuid": "66446b9b12e707de874a79c4893499f9a317ac04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104965159-bdb-tmm-promoimage.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/15837362/device/rss/rss.html", "section_title": "U.S. News", "url": "https://www.cnbc.com/2018/01/24/billion-dollar-buyer-houston-based-mattress-company-gets-a-surprise.html", "country": "US", "domain_rank": 767, "title": "'Billion Dollar Buyer': Houston-based mattress company gets a surprise", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T21:51:00.000+02:00", "replies_count": 0, "uuid": "66446b9b12e707de874a79c4893499f9a317ac04"}, "author": "Marlon Jackson", "url": "https://www.cnbc.com/2018/01/24/billion-dollar-buyer-houston-based-mattress-company-gets-a-surprise.html", "ord_in_thread": 0, "title": "'Billion Dollar Buyer': Houston-based mattress company gets a surprise", "locations": [], "entities": {"persons": [{"name": "harvey", "sentiment": "negative"}, {"name": "youval meicler", "sentiment": "none"}, {"name": "rachael gordon", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "better night's sleep program", "sentiment": "none"}, {"name": "children's charity", "sentiment": "none"}, {"name": "texas mattress makers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hurricane Harvey devastated the Houston area with raging floods in August. Before the hurricane struck, the nation's fourth-most-populous city prepared for the unknown. But residents never thought Harvey would have such an affect on their community, infrastructure and psyche.\nHarvey's havoc shook the city to its core, but like the rushing waters that came before, that fear and helplessness receded in the hearts and minds of Houstonians — and they got to work.\nThis was the case for one mattress retailer, Texas Mattress Makers. Although the effects of Harvey knocked the company's operations out for more than a week, when the owners returned, they weren't just trying to get their business up and running, they were also trying to help others in need.\nOwner Youval Meicler and step-daughter Rachael Gordon answered the call of residents by working with each person's financial ability to provide them new mattresses. They are also long-time donors to Houston's Children's Charity, where they've provided hundreds of beds to the organization's \"A Better Night's Sleep Program.\" The program gives new mattress to children who sleep in makeshift beds or even on the floor.\nDuring the most recent episode of CNBC's \"Billion Dollar Buyer,\" Tilman Fertitta — owner of the Houston Rockets NBA franchise and CEO of Landry's — made a surprise donation to the charity via Texas Mattress Makers. Fertitta dug deeper in his pockets and purchased an extra 500 mattress. His donation, valued at $500,000, would ensure 500 children affected by Hurricane Harvey would not have to worry about a good night's sleep.\nCNBC caught up with Meicler and Gordon to discuss their further involvement with the charity, what it meant to have Fertitta make such a generous donation and the status of Houston today.\nWhat was business like for Texas Mattress Makers before Harvey hit?\nMeicler: Harvey hit at the end of August, so business was actually very good and it was right before Labor Day, so usually business is good but when Harvey hit, it just shut down the city. It was devastating for the next 2½ weeks.\nIt's been close to six months since Hurricane Harvey hit. What is the state of Houston and its surrounding areas?\nMeicler: It's really interesting. Part of the city is like nothing happened. The parts of the city that weren't really affected by it, everything is normal but if you drive through the areas that were affected, like our neighborhood ... there's no one there.\nThere's a large part of the city that's still immensely affected by the storm — and that's folks that had private homes with insurance. I can't even begin to tell you the devastation that the folks that had homes that were not in flood areas, that never had flood insurance, how they're coping with it and the folks that lived in apartments that were low-income and lost everything. I want you to imagine that you walk into your house and you lose everything within 24 hours, all the contents, all your personal belongings, it's devastating.\nWhen Hurricane Harvey hit Houston, were you worried that you might be put out of business? What was the actual impact?\nMeicler: I was never afraid that we were going to lose anything or it's going to be bad. … We lost and we suffered the least amount ... because of where our location is. We suffered the wind aspect of the storm not the water aspect.\nIn the show, Tilman Fertitta bought 500 mattresses for Hurricane Harvey flood victims, specifically through the Houston Children's Charity. What did that mean to you and your community?\nMeicler: A large segment of every city, you have low income folks so when you have someone like Tilman that donates 500 sets of bedding, it's not only beds it's a mattress and it's a box spring and it's a bed frame and it's pillows and sheets.\nGordon: Honestly it was pretty amazing to see how they stepped up, Tillman's donation and Houston Children's Charity and just the community in general. I know they raised a large amount of money in order to get these children and their families back in beds and we did a lot of distribution. He's involved in Houston Children's Charity and had a lot of distributions that are at our facility and we got to see a lot of these children and these families get their life back together, so that was extraordinary. And that donation from Tillman was definitely unexpected ... and to be an even bigger part of this charity, we were honored.\nTexas Mattress Makers was involved with the Houston Children's Charity before being on the show. Please explain.\nGordon: We've been involved with the charity for the past I think four years now and mainly as a sponsor of their Better Night's Sleep program.\nWhat is that?\nGordon : Houston Children's Charity [has] been around for over 20 years, and they have several programs that help the children and their families in this community in different ways, and one of their big programs is their Better Night's Sleep, which they give a bed, a box spring, a bed frame, sheets and pillows ... a brand new one which is unheard of. … They actually go out and get a new bed for these children who are sleeping on the floor in boxes. The statistic of how many children in this community alone [who] are sleeping on the floor is kind of outrageous and so this program has been around for a little bit over 10 years. ... And so we got involved. … We had a little meeting with now the president, Laura Ward, and she went over the need in this community, and since we work in a mattress manufacturing business it felt right. We wanted to do something, and so we became involved and now we're a very close sponsor for them and our relationship is very important to us. We value it because of what they do in this community and I know Tilman is the executive chair, and just what they do for the children living in this community and being able to be a part of that is really an honor.\nWhat's next for Texas Mattress Makers?\nMeicler: We are a firm believer that when you live in a community, you have to give back, that's just a matter of us doing business on a daily basis. … We give a lot more back than we ever say that we do, that's just my belief you know. Not everything that you do everybody needs to know, it's between you and God.\nAs far as the outlook of the business, we're blessed. We are going to do really well, we run a business, we sell mattresses. We approach it in a totally different manner than all the other stores or large manufacturers, and our business is continuously growing and I expect it to do nothing else but that.\nOur involvement with the Houston Children's Charity is only going to grow and get bigger because the charity itself is an immense charity. They're very well organized they have the wherewithal to take care of the needs of the population that they're servicing. … We're proud to be part of it.\nAs an immigrant from Israel, what is your definition of the American Dream?\nMeicler: The honest explanation is if you would have asked me 38 years ago that I would wake up everyday to go to work, and I would 38 years later have what I have today, I don't know that I could wrap my brains around it. This is the greatest country in the world. If you get up in the morning and you live by a certain standard, and certain morals and you just get up and go to work and do the best you possibly can, then you're going to be successful no matter what you do, and I am living proof of that. I would have never in my life [have] thought that this would be my life ever …. ever …. ever.\nThis interview has been edited and condensed.\nLearn more about Texas Mattress Makers on an all new episode of \"Billion Dollar Buyer,\" Wednesday at 10P ET/PT on CNBC.", "external_links": [], "published": "2018-01-24T21:51:00.000+02:00", "crawled": "2018-01-24T23:51:54.000+02:00", "highlightTitle": ""}