{"organizations": [], "uuid": "f3e9d96afe5f9d51c6e2444800d21284437e6f2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/07/25/103815418-GettyImages-545229504.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/23/verizon-earnings-q4-2017.html", "country": "US", "domain_rank": 767, "title": "Verizon earnings Q4 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T14:00:00.000+02:00", "replies_count": 0, "uuid": "f3e9d96afe5f9d51c6e2444800d21284437e6f2a"}, "author": "Anita Balakrishnan", "url": "https://www.cnbc.com/2018/01/23/verizon-earnings-q4-2017.html", "ord_in_thread": 0, "title": "Verizon earnings Q4 2017", "locations": [], "entities": {"persons": [{"name": "lowell mcadam", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "verizon", "sentiment": "negative"}, {"name": "verizon communications verizon", "sentiment": "negative"}, {"name": "verizon foundation", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Getty Images Lowell McAdam, CEO, Verizon Communications Verizon reported quarterly earnings on Tuesday that missed expectations, but revenue that topped estimates.\nResults EPS: 86 cents per share vs. 88 cents per share expected by a Thomson Reuters consensus estimate Revenue: $33.96 billion vs. $33.26 billion expected by a Thomson Reuters consensus estimate Net increase of 1.2 million retail postpaid connections (431,000 phone, 647,000 smartphones) That means that Verizon's earnings are about flat, but sales are up slightly from last year. A year ago, Verizon reported adjusted earnings of 86 cents per share on revenue of $32.3 billion.\nShares rose about 1 percent in premarket trading.\nVerizon also hinted that an employment announcement is on the way.\n\"Verizon will announce later today how employees will further share in the company's success, and the company will also be increasing contributions to the Verizon Foundation by $200 million to $300 million over the next two years,\" the company said in a statement. \"These two initiatives have a projected EPS impact of 5 to 6 cents for each of the next two years.\"\nWall Street looks for color on taxes, iPhone sales Like many American companies, Verizon is dissecting the recent U.S. tax overhaul. Scotiabank analyst Jeff Fan pointed to tax reform as a potential positive for the company on Monday.\nThe company expanded on that on Tuesday, revealing that it expected savings from tax reform will add $3.5 billion to $4 billion to its operating cash flow this year, boosting earnings by 55 to 65 cents a share for the full year. That's on top of a previously announced one-time increase of about $16.8 billion under the new tax scheme.\nBut it comes as the company is expecting low single-digit percentage growth in adjusted earnings in 2018, after a slew of acquisitions and divestitures aimed at transforming the company. Verizon , like its rivals, is grappling with how to transform its phone-based service into a data-and-internet focused product.\nVerizon added a net of 47,000 Fios Internet connections but lost a net of 29,000 Fios Video customers as streaming offerings like Netflix gain popularity.\nMore consumers are moving away from contracts and hopping providers based on the latest mobile phone offerings. Eighty percent of Verizon's main phone base is now on unsubsidized plans, compared with about 67 percent in the year-ago period.\nThis holiday shopping season was unusual in that regard, since Apple released its flagship phone later than usual, but telecom providers have wooed customers with perks such as international data.\nNonetheless, CEO Lowell McAdam emphasized his customers' loyalty, noting that the company has managed to hang on to many of its customers over the past 11 quarters. Verizon said on Tuesday it expects to hit year-over-year wireless service revenue growth, on an adjusted basis, by the middle part of 2018.\nWall Street has cast Verizon as a potential merger candidate amid a flurry of dealmaking and consolidation in the industry, including tie-ups at Time Warner and Disney and off-and-on talks between Sprint and T-Mobile. But McAdam reaffirmed on Tuesday that Verizon will not be seeking a large media merger.\nWhile \"it's nice to be loved,\" McAdam said on an earnings conference call with analysts, \"there is nothing going on\" with Verizon as far as media acquisitions.\nThe company now has Oath, a digital content and advertising arm that includes Yahoo and AOL, and is planning to roll out 5G broadband this year. The 5G rollout will be part of $17 billion to $17.8 billion in capital expenditures planned for the year.\nEarlier this month, Verizon announced the acquisition of Niddel , a cybersecurity company. The new company will join Verizon after disclosures of breaches at Yahoo that affected billions of customers over the past few years.\nOath revenues were $2.2 billion during the quarter.\nDisclosure: CNBC has a content-sharing agreement with Yahoo Finance.\n— CNBC's Kevin Breuninger contributed to this report.", "external_links": [], "published": "2018-01-23T14:00:00.000+02:00", "crawled": "2018-01-23T14:41:05.017+02:00", "highlightTitle": ""}