{"organizations": [], "uuid": "665e905bf67b5c69f155dd132fc141b2e352fdd3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219097243&w=1200&r=LYNXMPEE020ZU", "site_section": "https://www.reuters.com/finance/markets/europe", "section_title": "European Stock Market News | Reuters.com", "url": "https://www.reuters.com/article/us-europe-weather-swiss/gusts-derail-swiss-train-storms-hit-dutch-air-traffic-skier-killed-in-france-idUSKBN1ES1CO", "country": "US", "domain_rank": 408, "title": "Gusts derail Swiss train, storms hit Dutch air traffic, skier killed in France", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.062, "site_type": "news", "published": "2018-01-03T23:48:00.000+02:00", "replies_count": 0, "uuid": "665e905bf67b5c69f155dd132fc141b2e352fdd3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-europe-weather-swiss/gusts-derail-swiss-train-storms-hit-dutch-air-traffic-skier-killed-in-france-idUSKBN1ES1CO", "ord_in_thread": 0, "title": "Gusts derail Swiss train, storms hit Dutch air traffic, skier killed in France", "locations": [], "entities": {"persons": [{"name": "burglind", "sentiment": "none"}], "locations": [{"name": "france zurich", "sentiment": "none"}, {"name": "lenk", "sentiment": "none"}, {"name": "stans", "sentiment": "none"}, {"name": "st gallen", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "lucerne", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "mob", "sentiment": "none"}, {"name": "srf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ZURICH (Reuters) - Gusting winds blew a train off its tracks, injuring eight people, as winter storm Burglind battered Switzerland on Wednesday, bringing trees down on power lines cutting electricity to thousands of homes.\nThe wind derailed the lead car on the Montreux-Bernese Oberland (MOB) regional train around midday near Lenk in central Switzerland, an MOB spokesman said.\n“I have never seen anything like it,” he added.\nGusts on the Pilatus peak near Lucerne hit 195 kph (122 mph), the highest there since records began in 1981, broadcaster SRF reported.\nThe Swiss weather service issued strong gale warnings for much of the country. Many roads were closed, passenger ferry traffic was halted in some areas and several air flights were canceled.\nMedia websites featured pictures and video of the havoc: a light airplane was overturned in Stans, wind tore scaffolding from a construction site near Lucerne, and tractor-trailers were blown onto their sides on some major motorways.\nSeveral people were stranded on a ski lift in St Gallen canton when trees toppled onto the gondola lines, police said.\nWorkers inspect the carriage of the Montreux Oberland Bernois (MOB) train lying on its side, after if was pushed out of the tracks by gusts of wind during storm Eleanor (Burglind) near Lenk, Switzerland January 3, 2018 REUTERS/Stefan Wermuth In the capital Bern, the Christmas tree on display at the main railway station snapped at mid-morning, but no one was injured by the 13-metre high trunk that weighs 2.4 tonnes, Swiss broadcaster RTS said, showing a photo of it on the pavement.\nIn the Netherlands, a storm disrupted air travel at Amsterdam’s Schiphol airport, Europe’s third busiest.\nMore than a fifth of the originally planned 1,200 incoming and outgoing flights were canceled as wind gusts reached speeds of up to 120 kph (75 mph).\nSlideshow (7 Images) Storms also prompted authorities to close all five major sea barriers to prevent flooding in the lowlands.\nIn France, a skier was killed when a tree fell on him on a ski slope and at least 15 others were injured in storms in northern and eastern regions that cut power to some 225,000 homes, local authorities said.\nHouseholds in the Normandy region were the worst hit by storm Eleanor, Enedis, a unit of state-controlled EDF said, while the area around Paris and northeastern Picardie and Champagne-Ardenne were also among those affected.\nThe latest weather warning and strong winds come after winter storm Carmen battered western France on New Year’s day, with some 40,000 households in the Brittany region temporarily losing power.\nHomes and businesses on Ireland’s west coast suffered flood damage and 27,000 were left without electricity on Wednesday when Eleanor brought heavy rain and winds of up to 155 kph (96 mph) per hour, hitting the fourth largest city, Galway, particularly hard.\nReporting by Michael Shields in Zurich and Stephanie Nebehay in Geneva, Bart Meijer in Amsterdam, Padraic Halpin in Dublin and Sarah White in Paris; Editing by Richard Balmforth\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-03T23:48:00.000+02:00", "crawled": "2018-01-03T19:33:57.000+02:00", "highlightTitle": ""}