{"organizations": [], "uuid": "a6c35329886a492831e9323c08419c663badeb01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219228015&w=1200&r=LYNXMPEE0302B", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-global-oil/oil-prices-near-levels-last-seen-in-2014-2015-as-market-tightens-idUSKBN1ET058", "country": "US", "domain_rank": 408, "title": "Oil prices hit fresh highs as market tightens", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.038, "site_type": "news", "published": "2018-01-04T09:31:00.000+02:00", "replies_count": 0, "uuid": "a6c35329886a492831e9323c08419c663badeb01"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-global-oil/oil-prices-near-levels-last-seen-in-2014-2015-as-market-tightens-idUSKBN1ET058", "ord_in_thread": 0, "title": "Oil prices hit fresh highs as market tightens", "locations": [], "entities": {"persons": [], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Oil rose on Thursday to its highest since May 2015, on concern about supply risks due to unrest in Iran and another decline in U.S. inventories as refining activity hit a 12-year high. \nU.S. oil stocks fell more than expected, continuing a steady drawdown of supplies in the world’s largest oil consumer, though stocks of distillates and gasoline rose on heavy refining activity driven in part by year-end adjustments. \nHowever, cold weather across much of the country was expected to keep demand high, as heating oil prices were just off highs not seen since early 2015. \nBrent crude LCOc1, the international benchmark, rose 5 cents to $67.92 a barrel as of 1:53 a.m. EST (1853 GMT) after hitting a high of $68.27 earlier in the session. U.S. crude CLc1 rose 34 cents to $61.97, after earlier hitting $62.21, its highest since May 2015. \nFreezing weather in the United States has spurred short-term demand, especially for heating oil. Heating oil futures were down 0.8 percent to $2.0712 a gallon; the contract hit highs not seen since February 2014 earlier in the week. \nU.S. crude stocks USOILC=ECI fell by 7.4 million barrels in the last week of 2017, exceeding expectations, as refiners boosted activity to their highest rate since 2005, the U.S. Energy Information Administration said on Thursday. \nFILE PHOTO: A pumpjack brings oil to the surface in the Monterey Shale, California, April 29, 2013. REUTERS/Lucy Nicholson/File Photo “The draw was fairly in line with what we’ve seen in the latter half of 2017,” said Matt Smith, director of commodity research at ClipperData in Louisville, Kentucky. U.S. crude stocks have dropped by more than 78 million barrels since the middle of 2017 to 424.5 million, the lowest since September 2015. \nAnti-government protests since last week in Iran, OPEC’s third-largest producer, have added a geopolitical risk premium to oil prices, though the country’s production and exports have not been affected, sources said. \nApart from a spike in May 2015, oil is trading at its highest since December 2014 - the month after a decision by the Organization of the Petroleum Exporting Countries to stop cutting output to support prices. \nAnalysts at JBC Energy said the price reaction to the Iranian unrest was overdone, while Swiss bank Julius Baer said prices projected “an overly rosy picture” that left the market at risk of profit-taking. \nOPEC, supported by Russia and other non-members, began to reduce output a year ago to remove a glut built up in the previous two years. Compliance has been high, aided by involuntary declines in Venezuela, where the economy is collapsing, plus unrest in Nigeria and Libya. \nProducers have decided to extend the supply pact until the end of 2018. \nOPEC’s cuts are helping reduce global inventories, even as production continues to rise in the United States, where OPEC efforts are spurring more output from shale. U.S. production rose to 9.78 million barrels in the last week. [EIA/S] \nAddtional reporting by Henning Gloystein; Editing by David Goodman and Rosalba O'Brien\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-04T09:31:00.000+02:00", "crawled": "2018-01-04T07:52:18.006+02:00", "highlightTitle": ""}