{"organizations": [], "uuid": "4559c4e6a69207b461c431ec33c3a2df6f5a8813", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-jpmorgan-chase-financial-company-llc-announces-pricing-of-cash-settled-equity-linked-notes-linked-to-the-common-stock-of.html", "country": "US", "domain_rank": 767, "title": "JPMorgan Chase Financial Company LLC Announces Pricing of Cash-Settled Equity Linked Notes Linked to Common Stock of Voya Financial, Inc. Due May 1, 2023", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-31T05:00:00.000+02:00", "replies_count": 0, "uuid": "4559c4e6a69207b461c431ec33c3a2df6f5a8813"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-jpmorgan-chase-financial-company-llc-announces-pricing-of-cash-settled-equity-linked-notes-linked-to-the-common-stock-of.html", "ord_in_thread": 0, "title": "JPMorgan Chase Financial Company LLC Announces Pricing of Cash-Settled Equity Linked Notes Linked to Common Stock of Voya Financial, Inc. Due May 1, 2023", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "voya", "sentiment": "none"}], "organizations": [{"name": "jpmorgan chase financial company llc", "sentiment": "negative"}, {"name": "common stock of voya financial, inc", "sentiment": "neutral"}, {"name": "jpmorgan chase & co.", "sentiment": "none"}, {"name": "voya financial, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- JPMorgan Chase Financial Company LLC (the “ Issuer ”) today announces the pricing of its public offering of $350 million of cash-settled equity linked notes linked to the common stock of Voya Financial, Inc. (“ Voya ”) due May 1, 2023 (the “ Notes ”). JPMorgan Chase & Co. will fully and unconditionally guarantee the Issuer’s obligations under the Notes.\nThe Notes will bear interest at a rate of 0.25% per year, payable semiannually in arrears on May 1 and November 1 of each year, beginning November 1, 2018 and will mature on May 1, 2023 unless earlier converted (for cash) at the option of the holder. The Notes will be cash-settled only at maturity or upon early conversion. The amount of cash payable at maturity or upon early conversion will be based on the volume-weighted average price of the common stock of Voya.\nThe threshold price (the “ Threshold Price ”) of the Notes will be set at a 32.5% premium to the initial reference price (the “ Initial Reference Price ”) of the Notes, which will equal the arithmetic average of the volume-weighted average prices of one share of Voya common stock over the five consecutive trading days beginning on, and including, January 31, 2018. The Threshold Price and Initial Reference Price are expected to be announced after the end of the five trading day period.\nThe Notes will be issued in minimum denominations of $100,000 and integral multiples of $1,000 in excess thereof at an issue price of 100% of the principal amount. Settlement and delivery of the Notes is expected to take place on February 2, 2018.\nJ.P. Morgan Securities LLC acted as Sole book runner.\nAbout JPMorgan Chase & Co.\nJPMorgan Chase & Co. (NYSE: JPM) is a leading global financial services firm with assets of $2.5 trillion and operations worldwide. The Firm is a leader in investment banking, financial services for consumers and small businesses, commercial banking, financial transaction processing, and asset management. A component of the Dow Jones Industrial Average, JPMorgan Chase & Co. serves millions of customers in the United States and many of the world's most prominent corporate, institutional and government clients under its J.P. Morgan and Chase brands. Information about JPMorgan Chase & Co. is available at www.jpmorganchase.com .\nInvestment suitability must be determined individually for each investor, and the Notes may not be suitable for all investors. This information is not intended to provide and should not be relied upon as providing accounting, legal, regulatory or tax advice.\nInvestors should consult with their own advisors as to these matters.\nJPMorgan Chase & Co. and JPMorgan Chase Financial Company LLC have filed a registration statement (including a prospectus) with the SEC for any offerings to which these materials relate.\nBefore you invest, you should read the prospectus in that registration statement and the other documents relating to any offerings to which these materials relate that JPMorgan Chase & Co. and JPMorgan Chase Financial Company LLC have filed with the SEC for more complete information about JPMorgan Chase & Co., JPMorgan Chase Financial Company LLC and any offering to which these materials relate.\nYou may get these documents without cost by visiting EDGAR on the SEC Web site at www.sec.gov . Alternatively, JPMorgan Chase & Co., JPMorgan Chase Financial Company LLC or any agent or any dealer participating in the any offerings to which these materials relate will arrange to send you the prospectus and each prospectus supplement as well as any product supplement, underlying supplement and pricing supplement if you so request by calling toll-free 866-535-9248.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130006520/en/\nJPMorgan Chase Financial Company LLC\nJessica Francisco, 212-270-1719\nJessica.francisco@jpmorgan.com\nSource: JPMorgan Chase Financial Company LLC", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51751382&newsitemid=20180130006520&lan=en-US&anchor=www.sec.gov&index=2&md5=0bac24fdf95c55330d4cc6f9127eb14c", "http://www.businesswire.com/news/home/20180130006520/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.jpmorganchase.com%2F&esheet=51751382&newsitemid=20180130006520&lan=en-US&anchor=www.jpmorganchase.com&index=1&md5=7230496c164710044cca2ca6eb6d1f01"], "published": "2018-01-31T05:00:00.000+02:00", "crawled": "2018-01-31T05:31:24.000+02:00", "highlightTitle": ""}