{"organizations": [], "uuid": "89be32a4f11b0d213152343f9157a5465ee6aad2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-lima-one-capital-appoints-jeff-tennyson-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "Lima One Capital Appoints Jeff Tennyson Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-29T20:53:00.000+02:00", "replies_count": 0, "uuid": "89be32a4f11b0d213152343f9157a5465ee6aad2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-lima-one-capital-appoints-jeff-tennyson-chief-executive-officer.html", "ord_in_thread": 0, "title": "Lima One Capital Appoints Jeff Tennyson Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "john warren", "sentiment": "none"}, {"name": "jeff tennyson", "sentiment": "none"}, {"name": "jeff", "sentiment": "none"}, {"name": "tennyson", "sentiment": "none"}], "locations": [{"name": "s.c.", "sentiment": "none"}, {"name": "greenville", "sentiment": "none"}, {"name": "lima", "sentiment": "none"}, {"name": "greenville", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}], "organizations": [{"name": "lima one capital appoints jeff tennyson", "sentiment": "negative"}, {"name": "lima one capital", "sentiment": "negative"}, {"name": "sc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GREENVILLE, S.C., Jan. 29, 2018 /PRNewswire/ -- Lima One Capital, an institutionally-backed, specialty finance company that focuses on investment property lending, has hired industry-veteran Jeff Tennyson as Chief Executive Officer. Lima One Capital Founder, John Warren will remain Chairman and devote his time to advising the company's executive leadership team and leading the strategic growth of the company. Tennyson will relocate to the Greenville, SC headquarters and lead the day-to-day business along with the executive team currently in place.\n\"We have had tremendous growth and success at Lima One Capital. I am very proud of our associates that have worked so hard to make us the nation's premier lender for real estate investors and I am proud that we have done it headquartered in South Carolina,\" said John Warren. \"I have decided to focus on more strategic growth opportunities for our company and have brought on an experienced lending executive to take Lima One to new levels of growth and success. Jeff's experience and leadership in mortgage lending and his success in growing financial services businesses provide Lima One with a perfect background for our next CEO.\"\nJeff Tennyson brings more than 30-years of industry experience to his new position. Prior to Lima One Capital, Tennyson was President at Clayton Holdings, CEO of B2R Finance, and served as CEO of EquiFirst, a wholesale mortgage provider, during his 12-year tenure at the company.\n\"I am honored to have been selected by John and the board to follow him as CEO of Lima One Capital,\" said Tennyson. \"John and his team have built a terrific company with innovative lending products and best-in-class service assisting real estate investors across the nation. I am very impressed with our people, the management team, the lending platform, and the bright future of Lima One Capital.\"\nAbout Lima One Capital\nLima One Capital is a specialty finance company, founded by Marines, that originates first-mortgage loans to real estate investors on non-owner occupied investment properties ­ nationwide. Lima One's core loan products are the Rental30, a 30-year, fixed-rate, fully amortizing loan for landlords purchasing or refinancing residential rental properties, the FixNFlip, a 13-month bridge loan for investors who are buying and rehabilitating properties, and a Multifamily program for the purchase or refinance of 5+ unit fix-and-flip properties.\nLima One Capital is headquartered in Greenville, SC, and has over 80 full-time employees and hundreds of contract workers. The company has been recognized as \"The Fastest Growing Company\" in the state of South Carolina, one of the \"Best Places to Work\" in South Carolina, and the \"Most Ethical Company\" in South Carolina.\nMedia Contact : Drew Dezen | 864-233-3776 x14 | Drewd@jdpr.com\nView original content: http://www.prnewswire.com/news-releases/lima-one-capital-appoints-jeff-tennyson-chief-executive-officer-300589611.html\nSOURCE Lima One Capital", "external_links": ["http://www.prnewswire.com/news-releases/lima-one-capital-appoints-jeff-tennyson-chief-executive-officer-300589611.html", "http://www.limaonecapital.com/"], "published": "2018-01-29T20:53:00.000+02:00", "crawled": "2018-01-29T20:42:26.014+02:00", "highlightTitle": ""}