{"organizations": [], "uuid": "0c732befaf90db72abb3845b2e60929bf9c2b56d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-landec-corporation-reports-second-quarter-and-first-half-fiscal-2018-results.html", "country": "US", "domain_rank": 767, "title": "Landec Corporation Reports Second Quarter and First Half Fiscal 2018 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T00:05:00.000+02:00", "replies_count": 0, "uuid": "0c732befaf90db72abb3845b2e60929bf9c2b56d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-landec-corporation-reports-second-quarter-and-first-half-fiscal-2018-results.html", "ord_in_thread": 0, "title": "Landec Corporation Reports Second Quarter and First Half Fiscal 2018 Results", "locations": [], "entities": {"persons": [{"name": "molly hemmeter", "sentiment": "none"}], "locations": [{"name": "santa clara", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "landec corporation reports second quarter", "sentiment": "negative"}, {"name": "o olive, inc.", "sentiment": "none"}, {"name": "inc.", "sentiment": "none"}, {"name": "landec", "sentiment": "none"}, {"name": "landec corporation", "sentiment": "none"}, {"name": "lifecore biomedical, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Second Quarter Meets Revenue Expectations and Revised Net Income Expectations\nCompany Reiterates Full Year Fiscal 2018 Guidance\nSANTA CLARA, Calif., Jan. 03, 2018 (GLOBE NEWSWIRE) -- Landec Corporation (NASDAQ:LNDC), a leading innovator of diversified health and wellness solutions within the branded natural food and biomaterial markets, reported results for the fiscal 2018 second quarter and first six months ended November 26, 2017.\n“We continue to make progress toward our long-term strategic plan of driving growth and profitability through internal innovation capabilities within our natural food business, which includes Apio, Inc. and O Olive, Inc., and at Lifecore Biomedical, Inc., our biomaterials business,” commented Molly Hemmeter, Landec’s President and CEO.\n“At Apio, our Eat Smart ® packaged fresh vegetables revenue increased 9% and 8% in the second quarter and first half of fiscal 2018, respectively, compared to the same periods last year. This growth is primarily due to increased Eat Smart salad sales which increased 29% in the second quarter and 22% in the first half of fiscal 2018, compared to the same periods last year. The Eat Smart salad growth was primarily driven by a 64% increase in salad revenues from the U.S. retail channel. The U.S. retail All Commodity Volume (ACV) for Eat Smart multi-serve salad kits for the 52-weeks ending October 28, 2017 doubled from 17% to 34% and was sequentially up 600 basis points from 28% for the 52-weeks ended July 29, 2017. This increase in ACV was driven by expanded distribution in key U.S. accounts such as Walmart, Kroger, Market Fresh and other accounts.\n“Increasing our Eat Smart share of multi-serve salad kits in U.S. retail accounts is one of our key long-term growth objectives. The annual U.S. retail market for multi-serve salad kits is approximately $1.4 billion, representing over 75% of the approximate $1.8 billion North American multi-serve salad kit market, including Costco. The market share of Eat Smart multi-serve salad kits in U.S. retail increased to 5.3% for the 52-weeks ended October 27, 2017 from 3.8% for the 52-weeks ended October 26, 2016, an increase of 150 basis points, demonstrating continuous distribution gains as well as room for additional growth,” said Hemmeter.\n“We are pleased to announce that Target Corporation is our newest Eat Smart salad customer. Starting this month, Apio will begin shipping nine Eat Smart salad products, including five single-serve Shake Ups!™ salads and four multi-serve salad kits, to approximately 330 of Target’s top selling stores in the U.S. During calendar year 2017, we entered the single-serve salad category with three products. Due to their success, two additional single-serve salads, the Sweet Kale Salad and the Asian Sesame Salad, were added to the Eat Smart Shake Ups! offerings. As our distribution continues to grow, we are able to reach more consumers with easy and delicious ways to eat vegetables and to grow awareness of the Eat Smart brand,” added Hemmeter.\n“Lifecore met expectations through the first six months of fiscal 2018 with revenues of $26.3 million and operating income of $3.1 million. Lifecore’s growth is being fueled by the expansion of its business beyond its historical capabilities as a premium supplier of hyaluronic acid (HA) to become a fully integrated contract development and manufacturing organization (CDMO), providing differentiated fermentation, formulation and aseptic fill services for difficult-to-handle medical materials. At O Olive, operating performance was consistent with expectations with revenues of $2.2 million for the first six months of fiscal 2018 and an operating loss of $242,000. We are currently focused on integrating the Eat Smart salesforce with the O Olive organization to leverage the Eat Smart customer base and relationships throughout North America in order to gain new customers and new distribution at O Olive,” stated Hemmeter.\nSummary of Second Quarter 2018 Results Compared to Second Quarter of 2017\nRevenues were essentially flat at $136.5 million Gross profit decreased 17% to $15.8 million Gross profit margin decreased 240 basis points to 11.5% Net income decreased 63% to $487,000 or $0.02 per share\nRevenues in the second quarter of fiscal 2018 were essentially flat at $136.5 million compared to $135.9 million in the year-ago quarter. The slight increase was primarily due to a $9.2 million or 9% increase in revenues in Apio’s packaged fresh vegetables business and a $2.2 million or 18% increase in revenues at Lifecore. These increases were offset by an $11.7 million or 46% decrease in Apio’s lower-margin export business which was greater than planned, but consistent with the Company’s strategic initiative to transition to higher-margin business.\nGross profit and net income during our second fiscal quarter were negatively impacted by $3.9 million from the aftermath of the hurricanes and tropical storms which resulted in higher produce sourcing costs during our second fiscal quarter. As outlined in the Company’s press release on November 29, 2017, the most significant impact during the quarter was on the supply and quality of green beans leading to extensive green bean shortages throughout the industry. During the month of November, these shortages resulted in the highest average procurement cost for green beans in over 15 years, which were 26% higher than the second highest average price for the month of November in 2008. After Hurricane Irma, with knowledge of a potential shortage of green beans during the fall, the Apio procurement team planted green beans in alternative geographical areas to fill that gap. Subsequent to those plantings, unexpected additional storms in the Southeast U.S. exacerbated the impact on the fall transition crop, as well as on the alternative planting areas. In addition, the extreme heat and tropical storms in the Western U.S. and Mexico have impacted yields, and thus the Company’s sourcing costs for several West Coast produce items such as brussel sprouts and broccoli.\nNet income in the second quarter of fiscal 2018 was $487,000 or $0.02 per share compared to $1.3 million or $0.05 per share in the year-ago quarter. The decrease was a result of (1) a $2.6 million decrease in gross profit in Apio’s packaged fresh vegetables business primarily due to $3.9 million in incremental produce sourcing costs as a result of the hurricanes and tropical storms during the quarter, (2) a $1.0 million decrease in export gross profit due to lower export revenues, and (3) a $617,000 increase in consolidated operating expenses due to an increase in R&D activities partially offset by lower SG&A expenses. These decreases in net income were partially offset by: (1) a $1.3 million increase in the fair market value of the Company’s Windset investment during the second quarter of fiscal 2018 compared to no increase in the year-ago quarter, (2) a $1.2 million write-off of unamortized debt issuance costs from the refinancing of debt during the second quarter of last year, (3) a $279,000 increase in gross profit at Lifecore, and (4) a $486,000 decrease in income tax expenses.\nFiscal Six Months 2018 Results\nRevenues in the fi", "external_links": ["https://www.globenewswire.com/Tracker?data=sf-_MXCV3dXDx5yMB6RVpUM-8G0gnu6BF5PRajunnnFFB3Vo1foTarzv4rEwAhBNEzPYH5mIMvpj3IWQIobwtgAyNRCY5tM8GgmA29a9ZDuTembz7odTuh5OBLRUo6uE", "http://ir.Landec.com/events.cfm", "https://www.globenewswire.com/Tracker?data=MS8OEpArBhw7yn_HH-2h5TtMK2JbBCiRNc0x7ePhYnfwe41QzNZF68lGFK7B3NPBPo9S9mMfmxl46T2ZiJOCcg==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/f11cbbb8-c0aa-492b-b9c7-e1ee273b513a", "https://www.globenewswire.com/Tracker?data=sf-_MXCV3dXDx5yMB6RVpUM-8G0gnu6BF5PRajunnnF2TwrFuwAFiRCeKayyx6HVzyxh8ZR7yOL0UkjEDg9bZFYl-3hbvx-EJI8oazCdJWek9LOLTBwdUDMYqgF0yWzg"], "published": "2018-01-04T00:05:00.000+02:00", "crawled": "2018-01-04T00:33:59.010+02:00", "highlightTitle": ""}