{"organizations": [], "uuid": "5dfe73de155ff86d879eb00ae0c3dbb04836b804", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-futures-dip-as-bond-yields-apple-again-weighs-idUSL4N1PP4FL", "country": "US", "domain_rank": 408, "title": "CORRECTED-US STOCKS-Futures dip as bond yields, Apple again weigh", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T20:32:00.000+02:00", "replies_count": 0, "uuid": "5dfe73de155ff86d879eb00ae0c3dbb04836b804"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-futures-dip-as-bond-yields-apple-again-weighs-idUSL4N1PP4FL", "ord_in_thread": 0, "title": "CORRECTED-US STOCKS-Futures dip as bond yields, Apple again weigh", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "tanya agrawal", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "nasdaq", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Corrects to “rise in bond yields” from “drop in bond yields” in first paragraph)\n* Futures down: Dow 163 pts, S&P 12.75 pts, Nasdaq 33.75 pts\nBy Tanya Agrawal\nJan 30 (Reuters) - U.S. stock index futures were lower for a second straight day on Tuesday, with Dow futures falling more than 150 points, weighed down once again by a rise in bond yields and a dip in Apple.\nU.S. Treasury yields surged to more than three-year highs on expectations that central banks globally will reduce stimulus as the economic outlook improves. A rise in yields makes borrowing cash more expensive.\nThe rising yields and a 2.1 percent slide in Apple’s shares on Monday pushed the bluechip Dow Jones Industrial Average and the benchmark S&P 500 to their biggest one-day percentage declines in about five months.\nApple was down another 1.1 percent in premarket trading on Tuesday, still feeling the effects of news that the company will halve production of its $999 iPhone X smartphone.\nApple is among the list of companies due to report results on Thursday in what is a very event-heavy week.\nPresident Donald Trump’s State of the Union speech later in the day will be monitored for comments on trade, while the Federal Reserve’s two-day monetary policy meet also starts on Tuesday.\nSome economists expect the central bank to raise its economic assessment, which could lead to four interest rates hikes this year, instead of the three hikes priced into trades.\nAt 6:57 a.m. ET (1157 GMT), Dow e-minis were down 163 points, or 0.62 percent, with 49,407 contracts changing hands.\nS&P 500 e-minis were down 12.75 points, or 0.45 percent, with 225,518 contracts traded.\nNasdaq 100 e-minis were down 33.75 points, or 0.48 percent, on volume of 56,919 contracts.\nThe market’s blistering rise this year has also led to rising fears of a pullback. The CBOE Volatility Index, the most widely followed barometer of expected near-term stock volatility, topped 14 for the first time since Dec. 1.\nShares of Harley-Davidson skidded 7.2 percent after its 2017 shipments came in at the low end of its estimate and its forecast a drop in shipments this year.\nMetLife dropped 8.1 percent in premarket trading a day after the insurer said the SEC is looking into the company’s failure to pay some workers’ pensions. (Reporting by Tanya Agrawal in Bengaluru; Editing by Savio D‘Souza)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T20:32:00.000+02:00", "crawled": "2018-01-31T16:16:53.007+02:00", "highlightTitle": ""}