{"organizations": [], "uuid": "3f552cba45d84738e84f581956973cd005d167f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223447662&w=1200&r=LYNXMPEE0I1NV", "site_section": "http://www.reuters.com/rssFeed/newIssuesNews\r", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-trump-pence/in-year-of-drama-and-chaos-pence-quietly-advances-conservative-agenda-idUSKBN1F82NO", "country": "US", "domain_rank": 408, "title": "In year of drama and chaos, Pence quietly advances conservative agenda", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T23:32:00.000+02:00", "replies_count": 0, "uuid": "3f552cba45d84738e84f581956973cd005d167f1"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-pence/in-year-of-drama-and-chaos-pence-quietly-advances-conservative-agenda-idUSKBN1F82NO", "ord_in_thread": 0, "title": "In year of drama and chaos, Pence quietly advances conservative agenda", "locations": [], "entities": {"persons": [{"name": "pence", "sentiment": "negative"}, {"name": "yasmeen abutaleb", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "nikki haley", "sentiment": "none"}, {"name": "jared kushner", "sentiment": "none"}, {"name": "jeff mason", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "white house situation room", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "pence", "sentiment": "none"}], "organizations": [{"name": "united nations", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 9:32 PM / Updated 10 minutes ago In year of drama and chaos, Pence quietly advances conservative agenda Yasmeen Abutaleb , Jeff Mason 7 Min Read \nWASHINGTON (Reuters) - In the run-up to President Donald Trump’s decision last month to recognize Jerusalem as Israel’s capital, Vice President Mike Pence, a conservative Christian who had long advocated for the move, did something he does only selectively: speak up. \nAs intelligence and diplomatic officials warned against the change, Pence made a forceful “closing argument” in favor of it at a White House Situation Room meeting, leading a group that included senior adviser Jared Kushner and U.S. Ambassador to the United Nations Nikki Haley, a senior administration official said. \nPence helped persuade Trump to fulfill a campaign promise and upend long-standing U.S. policy by declaring he recognized Jerusalem as the capital of Israel, over objections from Arab nations and many Western allies. \nIn a year marked by chaos and infighting in Trump’s White House, Pence has been one of the most effective administration officials in advancing his own policy goals. \nHis behind-the-scenes influence - described in interviews with more than two dozen conservative activists, lawmakers and administration officials - adds another dimension to a man often ridiculed for his public obsequiousness to his boss. \nAs Pence has put his stamp on policy, he has strengthened his ties with conservative activists, donors and lawmakers - alliances that would serve him well should he decide to launch his own presidential bid in the future. \nBut while he is a darling of conservative Republicans, Pence is often to the right of mainstream America on social issues like gay rights. In 2015, as governor of Indiana, he was forced to revise a state “religious liberty” law he had signed which opponents say allowed discrimination against gays. \nPence, who leaves on Friday for a trip to Egypt, Jordan and Israel, has made a mark on domestic policy as vice president. The former congressman staunchly opposes abortion rights and passionately supports de-regulation of business and shrinking the size of government. \nWhile heading up the presidential transition a year ago, he placed several advocates who oppose abortion rights in key positions at the Health and Human Services department. \nHHS has made several decisions that have advanced the social conservative agenda, including broadening exemptions for employers who cite religious or moral reasons for refusing to cover birth control. \nPence led the charge for reinstating the so-called Mexico City policy that requires foreign non-governmental organizations that receive U.S. funding to vow to not discuss or perform abortions. The policy expanded under the Trump administration to apply to the majority of U.S. global health assistance, which totals more than $8 billion. \nFor months, Pence has pushed for redirecting aid money from the United Nations to the U.S. Agency for International Development so it can be directed to Christians in the Middle East. \nEarlier this month, USAID, citing Pence’s remarks, said it renegotiated the terms of an agreement so that $5 million will go to addressing the needs of “vulnerable religious and ethnic minority communities” in Iraq. \nPence has also been central to the administration’s legislative efforts, including the tax cuts passed last year. Several conservative activists said he helped generate momentum by bringing in conservative groups to get their input and support. U.S. Vice President Mike Pence watches as U.S. President Donald Trump speaks before signing a proclamation to honor Martin Luther King Jr. in the Roosevelt Room of the White House in Washington, U.S., January 12, 2018. REUTERS/Joshua Roberts \nEarly last year, when thousands of activists began arriving in the U.S. capital for the annual “March for Life” anti-abortion rights event Trump, then a Washington novice, asked Pence about it. The vice president described its importance in marking the anniversary of the 1973 Roe vs. Wade Supreme Court decision that legalized abortion. \nThe discussion prompted Trump to send Pence to speak at the march and on Friday Trump himself addressed this year’s event via satellite. He criticized U.S. abortion laws as among the most permissive in the world. AGREEING TO DISAGREE \nIn an administration where staff such as Steve Bannon, the president’s former strategist, and Reince Priebus, the former chief of staff, have seen their stars rise and fall, Pence’s lasting influence owes to a number of factors, his associates say. \nAs vice president, he cannot be fired and therefore has less incentive than other aides to engage in building fiefdoms and jockeying for power. Advisers say that is not his style anyway. \n“Inside of palace intrigue, there’s often power centers. And I don’t think there’s a Mike Pence power center,” said Marc Short, Trump’s legislative affairs director and a former Pence aide. “He’s here to serve the president’s interests, and so therefore there’s not an alternative agenda that people have to worry about.” \nHis mild-mannered style has helped him to stay out of the fray. For example, with outsized personalities like Bannon – who was fired in August – Pence avoided tensions by agreeing to disagree when differences arose. \nPence’s deference has endeared him to Trump, who highly values loyalty. The vice president is careful to praise his boss and hew to his positions, even in closed-door meetings when Trump is not present. \nCritics of Pence say he effectively validates Trump’s often erratic behavior by quietly accepting the president’s combative instincts. \nPence and others were widely mocked for a Cabinet meeting in which Trump went round the room to hear senior officials lavish praise on him. Pence said at the meeting it was “the greatest privilege of my life” to serve as Trump’s vice president. \nCongressional Democrats complain that Pence has not made a serious effort to work with them. \nPence has solidified relationships with outside groups and Republican lawmakers whose help the administration needs in enacting its policy agenda. \n“The people that he talks to or interacts with and the way he treats them is (as if) they’re the most important person in the room,” said Republican Representative Mark Meadows, chairman of the conservative Freedom Caucus. \nThe lawmaker recounted an instance, during an Oval Office meeting, in which Pence gave up his seat and moved to another one so that Meadows could sit next to Trump. Reporting by Yasmeen Abutaleb and Jeff Mason; Editing by Caren Bohan and Alistair Bell", "external_links": [], "published": "2018-01-19T23:32:00.000+02:00", "crawled": "2018-01-19T23:36:15.010+02:00", "highlightTitle": ""}