{"organizations": [], "uuid": "63a9580f431e5cdbcc190786f801a566f444e971", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-hungarys-10-year-bonds-erase-two-months-of-gains-idUSL8N1PH2PR", "country": "US", "domain_rank": 408, "title": "CEE MARKETS-Hungarian bonds erase months of gains, stocks hit record high", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T17:22:00.000+02:00", "replies_count": 0, "uuid": "63a9580f431e5cdbcc190786f801a566f444e971"}, "author": "", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-hungarys-10-year-bonds-erase-two-months-of-gains-idUSL8N1PH2PR", "ord_in_thread": 0, "title": "CEE MARKETS-Hungarian bonds erase months of gains, stocks hit record high", "locations": [], "entities": {"persons": [{"name": "sandor peto", "sentiment": "none"}], "locations": [{"name": "budapest", "sentiment": "none"}, {"name": "romania", "sentiment": "none"}, {"name": "hungary", "sentiment": "none"}, {"name": "budapest", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "irs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 11:20 AM / Updated 16 minutes ago CEE MARKETS-Hungarian bonds erase months of gains, stocks hit record high Reuters Staff 7 Min Read * Hungarian bonds extend losses on disappointing IRS tender * Hungary's 10-year yield back at Nov levels, off record lows * Hungarian stocks lead regional rise, hit record high * Czech central bank chief sees Feb. 1 rate hike (Adds Budapest stocks, Romania's failed auction) By Sandor Peto BUDAPEST, Jan 22 (Reuters) - Hungarian stocks surged to record highs on Monday and government bonds extended losses as investors continued to close positions after Thursday's disappointing interest rate swap tender. The central bank's tender of five- and 10-year swaps was the first in a programme announced two months ago. The bank allocated a smaller-than-expected amount and the swaps were not as cheap as banks had hoped for. Its pledges to flatten the curve had led to expectations for a big drop in yields. But the yield on 10-year bonds rose 3 basis points to 2.2 percent, 27 basis points above levels before the tender - back where it was when the swaps scheme and linked mortgage note programme was announced. Analysts saw little chance that the bi-weekly tenders can lead long-term yields back to the record lows reached in the past weeks. Ten-year interest rate swaps traded around 1.8 percent , after dipping below 1.5 percent before the tender. Some retreat in spot and IRS yields is possible, but a rise in rates on the horizon in Europe and in the United States will make increasingly difficult to push yields lower, analysts said. Hungarian stocks, meanwhile, led a regional rise. Budapest's main index surged almost two percent. \"The index and OTP (Central Europe's biggest independent bank) got to technical levels, and hit record highs,\" said Zoltan Varga, analyst of Equilor brokerage. In such periods, stops are closed and new buyers come.\" Elsewhere, the Czech central bank is likely to continue to raise interest rates at its meeting on Feb. 1, its governor, Jiri Rusnok, was quoted as saying on Monday. It also plans to put a brake on mortgage lending, the opposite of the Hungarian central bank's plans, which are less concerned with inflation. The Czech crown firmed after Rusnok's comments, which came as no surprise, to 25.378 against the euro by 1439 GMT, approaching five-year highs. Romania's leu eased 0.2 percent to 4.668, touching its weakest levels this year and approaching record highs. The government rejected all bids at a tender of 6-year bonds, after a surge in Romanian yields in the market. Romanian assets have been depressed by concern that the economy is overheating and by uncertainty over domestic politics. Tens of thousands of people protested in Bucharest on Saturday against corruption and what the protesters called attempts by government to weaken judicial independence . CEE SNAPSHOT AT MARKETS 1539 CET CURRENCI ES Latest Previous Daily Change bid close change in 2018 Czech <EURCZK= 25.3780 25.4010 +0.09% +0.65% crown > Hungary <EURHUF= 309.5000 309.3700 -0.04% +0.46% forint > Polish <EURPLN= 4.1718 4.1745 +0.06% +0.11% zloty > Romanian <EURRON= 4.6680 4.6605 -0.16% +0.25% leu > Croatian <EURHRK= 7.4345 7.4345 +0.00% -0.06% kuna > Serbian <EURRSD= 118.6800 118.4500 -0.19% -0.15% dinar > Note: calculated from 1800 CET daily change Latest Previous Daily Change close change in 2018 Prague 1130.67 1123.620 +0.63% +4.87% 0 Budapest 40771.49 40021.89 +1.87% +3.54% Warsaw 2614.70 2601.82 +0.50% +6.24% Bucharest 8417.15 8361.95 +0.66% +8.56% Ljubljana <.SBITOP 836.12 832.69 +0.41% +3.69% > Zagreb 1866.61 1873.74 -0.38% +1.29% Belgrade <.BELEX1 776.31 775.29 +0.13% +2.17% 5> Sofia 707.85 711.69 -0.54% +4.49% BONDS Yield Yield Spread Daily (bid) change vs Bund change in Czech spread Republic 2-year <CZ2YT=R 0.5400 -0.0130 +114bps -1bps R> 5-year <CZ5YT=R 1.0270 0.0000 +117bps -1bps R> 10-year <CZ10YT= 1.7730 -0.0220 +120bps -3bps RR> Poland 2-year <PL2YT=R 1.5570 -0.0060 +216bps -1bps R> 5-year <PL5YT=R 2.6600 0.0170 +280bps +0bps R> 10-year <PL10YT= 3.3310 0.0120 +275bps +0bps RR> FORWARD RATE AGREEMEN T 3x6 6x9 9x12 3M interban k Czech Rep 1.04 1.19 1.38 0.77 <PRIBOR= > Hungary 0.09 0.14 0.23 0.02 Poland 1.76 1.79 1.87 1.72 Note: FRA are for ask prices quotes", "external_links": [], "published": "2018-01-22T17:22:00.000+02:00", "crawled": "2018-01-22T17:45:22.024+02:00", "highlightTitle": ""}