{"organizations": [], "uuid": "51637ee03f82e430c9a82dafac1593f65c3666cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222577912&w=1200&r=LYNXMPEE0G01H", "site_section": "http://feeds.reuters.com/Reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-missiles-falsealarm-congress/u-s-house-panel-to-hold-hearing-on-emergency-alerts-after-hawaii-error-idUSKBN1F603B", "country": "US", "domain_rank": 408, "title": "U.S. House panel to hold hearing on emergency alerts after Hawaii error", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T02:45:00.000+02:00", "replies_count": 0, "uuid": "51637ee03f82e430c9a82dafac1593f65c3666cc"}, "author": "", "url": "https://www.reuters.com/article/us-usa-missiles-falsealarm-congress/u-s-house-panel-to-hold-hearing-on-emergency-alerts-after-hawaii-error-idUSKBN1F603B", "ord_in_thread": 0, "title": "U.S. House panel to hold hearing on emergency alerts after Hawaii error", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - A U.S. House of Representatives panel said on Tuesday it planned a hearing to review a false missile alert sent in Hawaii over the weekend that stirred panic and anger in the Pacific island state.\nThe House Energy and Commerce Committee said in a statement that the hearing by one of its subcommittees would discuss safety communications and receive an update from the Federal Communications Commission “on its investigation into the recent false emergency alert event in Hawaii.”\nAuthorities blamed human error on the false alarm in Hawaii that was not corrected for 38 minutes. FCC Chairman Ajit Pai said on Sunday that Hawaii apparently did not have adequate safeguards in place and that government officials must work to prevent future incidents.\nThe employee who mistakenly sent the missile alert has been temporarily reassigned.\nAn electronic sign reads \"There is no threat\" in Oahu, Hawaii, U.S., after a false emergency alert that said a ballistic missile was headed for Hawaii, in this January 13, 2018 photo obtained from social media. Instagram/@sighpoutshrug/via REUTERS “The public needs to be able to trust that the emergency alert they receive is legitimate. We need to make sure that a mistake like what happened in Hawaii never happens again,” the top Democrats and Republicans on the panel said in a statement.\nHouse Energy and Commerce Committee Chairman Greg Walden, a Republican, said on Tuesday in an interview on the sidelines of the Detroit auto show that he wanted to know if additional checks and balances were needed for alerts of international significance.\n”An incoming missile is different than an amber alert. How should that be triggered or allowed? You’d think there would be another authentication along the way before something like that went out,” Walden said.\nWalden, who has spoken to Pai about the probe, said the government needed “to make sure our technologies and processes are up to date.”\nTo prevent a repeat of the incident, Hawaii’s Emergency Management Agency has said it will require two employees to activate the alert system - one to issue the warning and another to confirm it. The agency also has incorporated a way of issuing an immediate false-alarm notice in the event of an error.\nReporting by David Shepardson in Detroit; Editing by Peter Cooney\n ", "external_links": [], "published": "2018-01-17T02:45:00.000+02:00", "crawled": "2018-01-17T03:01:03.211+02:00", "highlightTitle": ""}