{"organizations": [], "uuid": "fa80db9074ddf58b27ae51de7356796b38606e64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-semtech-appoints-chris-chang-to-executive-management-team.html", "country": "US", "domain_rank": 767, "title": "Semtech Appoints Chris Chang to Executive Management Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:00:00.000+02:00", "replies_count": 0, "uuid": "fa80db9074ddf58b27ae51de7356796b38606e64"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-semtech-appoints-chris-chang-to-executive-management-team.html", "ord_in_thread": 0, "title": "Semtech Appoints Chris Chang to Executive Management Team", "locations": [], "entities": {"persons": [{"name": "chris chang", "sentiment": "negative"}, {"name": "chang", "sentiment": "none"}, {"name": "sil", "sentiment": "none"}, {"name": "marvell", "sentiment": "none"}], "locations": [{"name": "camarillo", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "semtech corporation", "sentiment": "negative"}, {"name": "semtech", "sentiment": "negative"}, {"name": "alien technology corporation", "sentiment": "none"}, {"name": "amd", "sentiment": "none"}, {"name": "business development prior", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMARILLO, Calif., Jan. 09, 2018 (GLOBE NEWSWIRE) -- Semtech Corporation (Nasdaq:SMTC), a leading supplier of high performance analog and mixed-signal semiconductors and advanced algorithms, today announced Chris Chang has joined the Company as Senior Vice President, Corporate Marketing and Business Development. In this newly-created role, he is leading corporate marketing, driving strategic growth initiatives and overseeing China operations.\nSemtech Appoints Chris Chang to Executive Management to lead Corporate Marketing and Business Development\nPrior to joining Semtech, Mr. Chang was Chief Executive Officer at Alien Technology Corporation, a global leader in RFID technology. As CEO, he successfully executed a turnaround in the company’s financial performance, drove double digit revenue growth and profitability while simultaneously achieving historical sales records by accelerating expansion in the U.S., China, and Europe markets. Mr. Chang has also held key executive positions in sales and finance functions at other prominent high technology corporations including Marvell, AMD, Silicon Graphics, and Eastman Kodak.\n“With Chris’ extensive expertise in marketing and business development, he will drive Semtech’s growth as we develop new products and establish new markets,” said Mohan Maheswaran, Semtech's President and CEO. “Chris shares our values and our focus on innovation, and has shown to be an extraordinary leader throughout his career.”\n“Joining Semtech is an honor and I look forward to working with our global team to further grow and expand our markets,” said Chris Chang, Senior Vice President, Corporate Marketing and Business Development at Semtech. “I have always admired Semtech’s outstanding business achievements and superior corporate culture and will use my industry expertise to help contribute to the Company’s continued success and market leadership.”\nAbout Semtech\nSemtech Corporation is a leading supplier of high performance analog and mixed-signal semiconductors and advanced algorithms for high-end consumer, enterprise computing, communications, and industrial equipment. Products are designed to benefit the engineering community as well as the global community. The Company is dedicated to reducing the impact it, and its products, have on the environment. Internal green programs seek to reduce waste through material and manufacturing control, use of green technology and designing for resource reduction. Publicly traded since 1967, Semtech is listed on the Nasdaq Global Select Market under the symbol SMTC. For more information, visit www.semtech.com .\nForward-Looking and Cautionary Statements\nAll statements contained herein that are not statements of historical fact, including statements that use the words “will,” “designed to” or other similar words or expressions, that describe Semtech Corporation’s or its management’s future plans, objectives or goals are “forward-looking statements” and are made pursuant to the Safe-Harbor provisions of the Private Securities Litigation Reform Act of 1995, as amended. Such forward-looking statements involve known and unknown risks, uncertainties and other factors that could cause the actual results of Semtech Corporation to be materially different from the historical results and/or from any future results or outcomes expressed or implied by such forward-looking statements. Such factors are further addressed in Semtech Corporation’s annual and quarterly reports, and in other documents or reports, filed with the Securities and Exchange Commission ( www.sec.gov ) including, without limitation, information under the captions “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and “Risk Factors.” Semtech Corporation assumes no obligation to update any forward-looking statements in order to reflect events or circumstances that may arise after the date of this release, except as required by law.\nSemtech, the Semtech logo and LoRa are registered trademarks or service marks, and LoRaWAN is a trademark or service mark, of Semtech Corporation or its affiliates.\nSMTC-P\nRonda Grech\nSemtech Corporation\n(805) 250-1263\nrgrech@semtech.com\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/3a691ae6-2a3c-4569-9d8d-34062f702913\nThe photo is also available at Newscom, www.newscom.com , and via AP PhotoExpress.\nSource:Semtech Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/76fa965c-2abf-4c3b-a448-dfe38ecd2f2e", "https://www.globenewswire.com/Tracker?data=uHqf30nqxJAkcuqSJLNaVdHd9J9WFMfWQx6EwB1fFGMLlzqzPiKITOFJR5dlphf1PDiczV7uMgK7kTmUQBZ9u_lH7E2hGUQ9I605NuipJxE=", "https://www.globenewswire.com/Tracker?data=R6N6DBQifBssywDyVxWXtj7nU1zqkTmPF64-iVlMQ5MqbkLpUj6-o5CbP-rDD7I7-KKFBrSgTaUPIMhXP1H21A==", "https://www.globenewswire.com/Tracker?data=R6N6DBQifBssywDyVxWXthi-S0Id_kxk0ViEGnWKzH6YTesHDa4Cdzz9RmHYEno-nShc_E2ygnMxWlYv7M9mKQ==", "https://www.globenewswire.com/Tracker?data=dC7_aay-S5NXg0Nv7HcyZg-EoV5gn9uD1BMktoWvnS4CckCZIX4K1vqZ5FINQg-yWeeDbnXs-iFeegaV8K5QYwzfk4ZP4si8na2GhfwIHrKlG92WTaEKTecQWF2VNKcG-K-L19Z3ZwCHKO19BjBrmttlA0vTkzqM_-10rFuFFT4AXreJY8mxTYRDmmD-p6JuYJ-unG24kc6TTxzimR5DFKl89a9XZi1RNi_4TGyQT9AyiMeNKyKU6DdGUhsWEaUeFt8UJAm51mGv9PU9Imvepg==", "http://www.globenewswire.com/NewsRoom/AttachmentNg/3a691ae6-2a3c-4569-9d8d-34062f702913", "https://www.globenewswire.com/NewsRoom/AttachmentNg/3a691ae6-2a3c-4569-9d8d-34062f702913/en", "https://www.globenewswire.com/Tracker?data=h5ivujNHD-dpZiSiRSXg394Q8TYKiXLo5MG0xR8NVyDzIPstpHlZ-mGc-ZGM1eNTrRWAF9NFdrgM8EKIpL81qQ==", "https://www.globenewswire.com/Tracker?data=78uLd0MdXIOrI21HOMX2eChFSBP_5zd7nmJwitlGbQlLBdmHWDDY5oTQT1LZ2JcO8UeCxEl8gLUM2osaRIDAeg=="], "published": "2018-01-09T16:00:00.000+02:00", "crawled": "2018-01-09T17:54:23.026+02:00", "highlightTitle": ""}