{"organizations": [], "uuid": "fb9e92a9d57b16062286704603b7baa33f6805ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220577858&w=1200&r=LYNXMPEE0813J", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-czech-election-president/zeman-leads-polls-in-final-days-before-czech-presidential-election-idUKKBN1EY1X5", "country": "US", "domain_rank": 408, "title": "Zeman leads polls in final days before Czech presidential election", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T18:12:00.000+02:00", "replies_count": 0, "uuid": "fb9e92a9d57b16062286704603b7baa33f6805ac"}, "author": "", "url": "https://uk.reuters.com/article/uk-czech-election-president/zeman-leads-polls-in-final-days-before-czech-presidential-election-idUKKBN1EY1X5", "ord_in_thread": 0, "title": "Zeman leads polls in final days before Czech presidential election", "locations": [], "entities": {"persons": [{"name": "zeman", "sentiment": "negative"}, {"name": "andrej babis", "sentiment": "none"}, {"name": "robert muller", "sentiment": "none"}, {"name": "milos zeman", "sentiment": "none"}], "locations": [{"name": "czech republic", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "prague castle", "sentiment": "none"}, {"name": "prague", "sentiment": "none"}, {"name": "prague", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 21 PM / Updated 12 minutes ago Zeman leads polls in final days before Czech presidential election Robert Muller 4 Min Read \nPRAGUE (Reuters) - Czechs will vote for a new president on Friday and Saturday with the strongly anti-immigration incumbent Milos Zeman leading opinion polls but possibly facing a tough challenger in the run-off round two weeks later. FILE PHOTO - Prime Minister Andrej Babis and Czech President Milos Zeman shake hands during the cabinet's inauguration at Prague Castle in Prague, Czech Republic December 13, 2017. REUTERS/David W Cerny \nCzech presidents have limited powers, but they appoint a range of senior officials and their role is pivotal when governments are formed, a process the EU and NATO member country is going through at the moment. \nThe head of state is also an influential opinion maker and represents the country abroad - a role that Zeman, 73, has used to beef up relations with China and Russia while devoting less time to the country’s western allies. \nZeman has sharply criticised immigration from Muslim countries and linked it to security threats. His reelection would reflect a eurosceptic stance by most Czechs and the public’s rejection of accepting migrants and refugees. \nAll polls project Zeman, a former prime minister and Social Democrat party chairman, as a winner in the first round. However, with little chance to surpass 50 percent, he is expected to face a runoff against a potentially strong opponent. \nOne factor hurting Zeman, a heavy smoker with self-professed affinity for alcohol, has been his health. He has difficulties walking connected with diabetes and has at times looked frail. His doctors said on Tuesday he was fit for another term. \nZeman had a 47.6 percent chance for victory as of Jan 7, according to kdovyhrajevolby.cz website which combines polls with bookmakers’ odds. The most serious challenger Jiri Drahos, former head of the Czech Academy of Sciences, scored 44.9 percent. \n“I want to bring a completely different style of presidency, bring people together, not label them, a clear embedding of the Czech Republic in Europe, with NATO and the EU as allies, not China,” Drahos, 68, said in an interview at www.dvtv.cz news website earlier in January. \nMichal Horacek, 65, a writer and former successful businessman, is another candidate who could threaten Zeman while a late bid from former centre-right Prime Minister Mirek Topolanek has made him a potential surprise. CHANGING VIEWS \nZeman has shifted from an enthusiastic European federalist to chiming with parties opposing the country’s western integration, such as the Communists and the far-right SPD. He has also retained wide appeal by meeting with voters and sniping at what he sees as elitist intellectual circles and the press. \n“He has a chance to win in the second round if his opponent fails to convince a substantial part of the anti-Zeman camp, which is very diverse,” said political analyst Petr Just. \nZeman has called for the removal of EU sanctions imposed over Russia’s annexation of Ukraine’s Crimea region and involvement in the armed conflict in eastern Ukraine. \nZeman is in the centre of domestic politics at the moment, as Prime Minister Andrej Babis, whose ANO party won an October election, seeks support for his minority government. \nA confidence vote is scheduled for Wednesday that Babis may lose, but Zeman has said he would give him another chance. \nThe prospect of the two leaders cooperating attracts some but puts off others who are looking for a politically experienced counterweight to Babis. \n“It is a factor for me, so I would prefer a candidate who is well oriented in politics,” said Tomas Gurtler, a retail entrepreneur, adding he would most probably vote for Topolanek. Reporting by Robert Muller; Editing by Jan Lopatka and Peter Graff", "external_links": [], "published": "2018-01-09T18:12:00.000+02:00", "crawled": "2018-01-09T18:38:14.051+02:00", "highlightTitle": ""}