{"organizations": [], "uuid": "477c18e6f4c8a861b14d006be25eb77c3d5b9f45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222246370&w=1200&r=LYNXMPEE0E1H8", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-russia-security-denmark/denmark-will-increase-defense-spending-to-counter-russia-pm-idUSKBN1F42LT", "country": "US", "domain_rank": 408, "title": "Denmark will increase defense spending to counter Russia: PM", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T23:46:00.000+02:00", "replies_count": 0, "uuid": "477c18e6f4c8a861b14d006be25eb77c3d5b9f45"}, "author": "", "url": "https://www.reuters.com/article/us-russia-security-denmark/denmark-will-increase-defense-spending-to-counter-russia-pm-idUSKBN1F42LT", "ord_in_thread": 0, "title": "Denmark will increase defense spending to counter Russia: PM", "locations": [], "entities": {"persons": [{"name": "maris kucinskis", "sentiment": "none"}, {"name": "vladimir) putin", "sentiment": "none"}, {"name": "lars lokke rasmussen", "sentiment": "none"}], "locations": [{"name": "denmark", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "copenhagen", "sentiment": "none"}, {"name": "crimea", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "riga", "sentiment": "none"}, {"name": "baltic sea", "sentiment": "none"}, {"name": "estonia", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "baltic nato", "sentiment": "none"}, {"name": "min read  riga", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RIGA (Reuters) - The Danish government expects to win backing for a substantial increase in defense spending next month, to counter Russia’s intensified military activity in eastern and northern Europe, the NATO-member’s prime minister said Monday.\nDenmark last week deployed 200 troops to a UK-led NATO mission in Estonia aimed at deterring Russia from attacking the Baltic NATO members.\nRussia annexed Ukraine’s Crimea peninsula in 2014 and backs separatist rebels in eastern Ukraine in a war that has killed more than 10,000 people.\n“Russia’s behavior has created an unpredictable and unstable security environment in the Baltic Sea region,” Prime Minister Lars Lokke Rasmussen said at a joint news conference with Latvian Prime Minister Maris Kucinskis on Monday in Riga.\n“When I received (Vladimir) Putin in Copenhagen during my first term as prime minister back in 2010, everybody thought that it would be the beginning of a new and much better and much more friendly cooperation between Europe and Russia. And that we could decrease our military spending,” he said.\n“But given the Russian aggression and what happened in Crimea, I think we simply have to be realistic about things and invest more in our security.”\nIn 2016, Russia moved nuclear-capable Iskander-M missiles to its enclave of Kaliningrad on the Baltic Sea and deployed its S-400 air missile defense system there.\nIn April last year, Denmark said Russia had hacked its defense computer network and gained access to employees’ emails in 2015 and 2016.\nRussia has accused the West of “whipping up hysteria” over its recent military exercises.\nDenmark’s center-right minority government needs to persuade parliament to back a proposed 20-percent hike of the defense budget over a five-year period. Rasmussen said he expected a “very big majority” to do so.\n“We want to look at ourselves as a core NATO member. And in order to behave like such a member, we need to increase our expenditures,” he said, adding that the Danish military needed a “substantial increase”.\n“Five years ago we thought that the defense line, so to speak, would not be in Europe, but would be international operations. Now we realize that we need to have the capability to do both,” he said.\nReporting by Gederts Gelzis; writing by Jacob Gronholt-Pedersen; editing by Andrew Roche\n ", "external_links": [], "published": "2018-01-15T23:46:00.000+02:00", "crawled": "2018-01-16T00:00:13.024+02:00", "highlightTitle": ""}