{"organizations": [], "uuid": "3328bf8ad1238b368377f0628c939a7af3dd021a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/25/reuters-america-update-2-starbucks-disappoints-after-holiday-drink-sales-lose-steam.html", "country": "US", "domain_rank": 767, "title": "UPDATE 2-Starbucks disappoints after holiday drink sales lose steam", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T01:04:00.000+02:00", "replies_count": 0, "uuid": "3328bf8ad1238b368377f0628c939a7af3dd021a"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/25/reuters-america-update-2-starbucks-disappoints-after-holiday-drink-sales-lose-steam.html", "ord_in_thread": 0, "title": "UPDATE 2-Starbucks disappoints after holiday drink sales lose steam", "locations": [], "entities": {"persons": [{"name": "kevin johnson", "sentiment": "none"}], "locations": [{"name": "americas", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "starbucks corp", "sentiment": "negative"}, {"name": "chestnut praline latte and gingerbread latte", "sentiment": "none"}, {"name": "starbucks", "sentiment": "none"}, {"name": "consensus metrix", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds CEO comments)\nJan 25 (Reuters) - Starbucks Corp on Thursday warned that 2018 global cafe sales growth would be at the low end of its forecast, after holiday drinks fell flat with U.S. customers during what is traditionally its blockbuster quarter.\nShares of the world's largest coffee chain slid 5.2 percent following the announcement to $57.30, after closing at $60.55 in regular trade.\nSales at established Americas region cafes in the quarter to Dec. 31 were up just 2 percent, with visits unchanged from a year ago. Analysts polled by research firm Consensus Metrix expected a sales rise of 3.3 percent.\n\"Holiday (limited-time offers) and merchandise did not resonate with our customers as planned,\" Chief Executive Kevin Johnson said on a conference call with analysts.\nStarbucks offers holiday-themed drinks such as the Chestnut Praline Latte and Gingerbread Latte as well as gift cards, mugs, coffee and tea gift boxes and teddy bears to woo holiday shoppers.\nBut U.S. cafe sales growth has cooled as Starbucks continues to add stores, while competition mounts from both high-end and low-priced coffee sellers.\nThe chain is also working to eliminate bottlenecks that can happen when users of its industry-leading mobile app flood crowded cafes with orders.\nStarbucks said it now expects 2018 global same-store sales growth at the low end of its previously-issued view of 3 to 5 percent.\nHowever, it raised its fiscal 2018 earnings forecast to a range of $2.48 to $2.53 per share, excluding items, up from $2.30 to $2.33 per share previously, thanks to a U.S. corporate tax cut.\nTo deal with the mobile ordering bottlenecks, Starbucks is adding staff at peak hours in the stores with the heaviest use, including a new position dedicated to meeting mobile users, Chief Executive Kevin Johnson told Reuters.\n\"Putting that one role in place allowed us to keep partners on the bar in production mode,\" Johnson said. He did not say how many roles had been added.\nJohnson also blamed an ongoing shift towards online holiday shopping and fewer visits in the afternoon and evening hours for the disappointing results in the quarter.\nCHINA GROWTH?\nStarbucks has turned to China for growth, planning to more than triple its over 3,000-store network within a decade. It recently opened a massive, showcase Reserve Roastery in Shanghai.\nChina same-store sales were up 6 percent and the company's acquisition of 1,300 stores in China helped net income in the quarter to rise to $2.25 billion, or $1.57 per share, from $751.8 million, or 51 cents per share, a year ago.\nBut for the time being, investors want Johnson, who is still overshadowed by his predecessor and current Executive Chairman Howard Schultz, to deliver more robust growth in Starbucks' home market, with roughly 14,000 stores.\nThe stock is up 3.2 percent from a year ago, versus the 44 percent, turnaround-fueled gain at McDonald's Corp.\n(Additional reporting by Nichola Groom in Los Angeles, Editing by Rosalba O'Brien)", "external_links": [], "published": "2018-01-26T01:04:00.000+02:00", "crawled": "2018-01-26T11:21:40.011+02:00", "highlightTitle": ""}