{"organizations": [], "uuid": "25328325fdf28cfdff17a62255aa998d42912d40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-accelera-solutions-announces-appointment-of-dennis-groh-as-executive-director-of-corporate-relationships.html", "country": "US", "domain_rank": 767, "title": "Accelera Solutions Announces Appointment of Dennis Groh as Executive Director of Corporate Relationships", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-29T21:47:00.000+02:00", "replies_count": 0, "uuid": "25328325fdf28cfdff17a62255aa998d42912d40"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-accelera-solutions-announces-appointment-of-dennis-groh-as-executive-director-of-corporate-relationships.html", "ord_in_thread": 0, "title": "Accelera Solutions Announces Appointment of Dennis Groh as Executive Director of Corporate Relationships", "locations": [], "entities": {"persons": [{"name": "groh", "sentiment": "negative"}, {"name": "dennis groh", "sentiment": "negative"}, {"name": "dennis \"denny", "sentiment": "neutral"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "fairfax", "sentiment": "none"}, {"name": "woodbridge", "sentiment": "none"}, {"name": "accelera", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}], "organizations": [{"name": "accelera solutions", "sentiment": "negative"}, {"name": "esn", "sentiment": "none"}, {"name": "usaf", "sentiment": "none"}, {"name": "accelera solutions, inc.", "sentiment": "none"}, {"name": "u.s. army", "sentiment": "none"}, {"name": "engineering services network", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FAIRFAX, Va., Jan. 29, 2018 /PRNewswire/ -- Dennis \"Denny\" Groh has been appointed as Executive Director of Corporate Relations at Accelera Solutions, Inc. a full service cloud engineering and solution's company.\nMr. Groh has more than 35 years of experience in managing acquisition and information resources in the public and private sectors. At Accelera, his duties will include facilitation of business development initiatives and opportunities to lead Accelera toward new business growth goals and objectives. This includes establishing new business alliances, cultivating strategies for establishing partnerships and leading new business expansion projects.\nPrior to joining Accelera Solutions, Mr. Groh was Vice President and Chief Marketing Officer for Engineering Services Network in Woodbridge, Virginia. Through his guidance he led ESN's growth from $17.5 M to $52M in targeted accounts in the VA, USAF, and the U.S. Army. His extensive background includes senior-level management posts as Vice President of the Corporate Development and Vice President of the Government-Wide Acquisition Contracts programs at STG, as well as senior management roles at Siemens and Computer Sciences Corporation. Mr. Groh was also Vice President of Business Development at Boeing Information Services where he lead the win for the single award billion dollar DISN Integration Contract.\nMr. Groh retired from Federal Government Services in 2003, as the Assistant Commissioner at GSA, where he was responsible for managing the Federal Government's $1 Billion per year FTS2000 and FTS 2001 long distance telecommunications programs supporting more than 150 government agencies around the world. Additionally his prior senior executive service (SES) government experience included his position as Director of DITCO and Director of the Acquisition Management Office at the Defense Information Systems Agency (DISA) supporting 65 Departments/Agencies, around the world.\nAccelera President and COO Mr. Steve Weiss, said, \"We are extremely pleased to have someone with Denny's caliber and experience to be part of our senior management and leadership team. His experience and relationships speak for themselves.\"\nMr. Groh received his BA from McKendree University and his Master's in human relations and procurement management from Webster University.\nAbout Accelera Solutions, Inc.\nAccelera Solutions serves as the IT industry's experts in secure cloud, mobility and virtualization. Incorporate in 2002, we have served more than 2,700 clients in government and commercial sectors with designing, implementing and managing secure IT solutions with a niche focus on public, private and hybrid cloud. Whether it's migrating applications to the cloud or implementing remote application solutions to support a global workforce, we leverage proven methodologies to ensure our client's mandates, policies, and compliance challenges are met. By bringing together our years of experience with proven solutions that ensure IT runs efficiently, affordably, and more reliable, the Accelera Advantage is apparent in everything we do.\nAccelera Solutions Public Relations/Media Contact :\nAndrew Schreiner\nPrincipal Marketing Manager\n12150 Monument Drive\nSuite 800\nFairfax, Virginia 22033\nDirect: 703-622-4213\nandrews@accelerasolutions.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/accelera-solutions-announces-appointment-of-dennis-groh-as-executive-director-of-corporate-relationships-300589600.html\nSOURCE Accelera Solutions, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/accelera-solutions-announces-appointment-of-dennis-groh-as-executive-director-of-corporate-relationships-300589600.html"], "published": "2018-01-29T21:47:00.000+02:00", "crawled": "2018-01-30T00:25:13.000+02:00", "highlightTitle": ""}