{"organizations": [], "uuid": "d86f101f3ea54bca4f0b2842c68d24741b5f510f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223743721&w=1200&r=LYNXMPEE0K016", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-golf-laquinta/cook-fires-up-with-64-for-one-stroke-lead-after-three-rounds-idUKKBN1FA00H", "country": "US", "domain_rank": 408, "title": "Cook fires up with 64 for one-stroke lead after three rounds", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T02:48:00.000+02:00", "replies_count": 0, "uuid": "d86f101f3ea54bca4f0b2842c68d24741b5f510f"}, "author": "", "url": "https://uk.reuters.com/article/uk-golf-laquinta/cook-fires-up-with-64-for-one-stroke-lead-after-three-rounds-idUKKBN1FA00H", "ord_in_thread": 0, "title": "Cook fires up with 64 for one-stroke lead after three rounds", "locations": [], "entities": {"persons": [{"name": "cook", "sentiment": "neutral"}, {"name": "austin cook", "sentiment": "none"}, {"name": "jon rahm", "sentiment": "none"}, {"name": "scott piercy", "sentiment": "none"}, {"name": "martin piller", "sentiment": "none"}, {"name": "andrew landry", "sentiment": "none"}], "locations": [{"name": "stadium", "sentiment": "none"}, {"name": "palm springs", "sentiment": "none"}, {"name": "la quinta", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}], "organizations": [{"name": "cook", "sentiment": "neutral"}, {"name": "careerbuilder", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "golf channel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 12:49 AM / Updated 15 hours ago Cook fires up with 64 for one-stroke lead after three rounds Reuters Staff 3 Min Read \n(Reuters) - Austin Cook expressed comfort playing with the lead after surging to a one-shot advantage in the third round at the CareerBuilder Challenge in southern California on Saturday. \nCook picked up six strokes in a six-hole stretch from the fourth hole en route to an eight-under-par 64 at La Quinta, the easiest of the three courses used for the pro-am event in the Palm Springs area. \nHe posted a 19-under 197 total, one shot ahead of fellow Americans Martin Piller and Andrew Landry, and two in front of Scott Piercy and Spaniard Jon Rahm. \nThe 26-year-old Cook broke through for his maiden victory at the RSM Classic in Georgia in November and said he expected that experience would hold him in good stead on Sunday when everyone will play the same course, the Stadium at PGA West. \n”I‘m a lot more comfortable knowing I can have a lead and keep a lead until Sunday,“ he told Golf Channel. ”I‘m just excited to be in this situation again. \n“It was hard to prepare for three golf courses in two days but I think I‘m doing an alright job so far. Good ball striking, good putting equals low rounds.” Jan 20, 2018; La Quinta, CA, USA; Austin Cook hits out of the rough on the 18th during the third round of the CareerBuilder Challenge golf tournament at La Quinta Country Club. Mandatory Credit: Joe Camporeale-USA TODAY Sports \nLandry (70) stayed in contention as he remained bogey-free through 54 holes. He and Piercy (67) are both seeking their first tour victory. \nSpanish world number three Rahm struggled with his swing but a 70 at the Stadium Course was enough to remain within striking distance. \n”Things have been a little worse and worse (each round),“ he said. ”First day everything was outstanding. Yesterday my driver was a little shaky but my iron shots were perfect. \n“Today my driver was shaky, my iron shots were shaky and a course like this is really punishing but luckily the holes I found the fairway I was able to convert and make birdies.” \nRahm narrowly avoided major trouble at the water-surrounded par-three 17th when his ball took one bounce into the hazard, where it struck a rock and then ricocheted back towards the green. \nThough still in the hazard, his ball was playable almost up against a rock but affording him a short backswing and while the recovery attempt was not without risk -- another player had attempted a similar shot only to get into further trouble -- Rahm chipped his ball out and two putted for bogey. Reporting by Andrew Both in Cary, North Carolina; Editing by Greg Stutchbury", "external_links": [], "published": "2018-01-21T02:48:00.000+02:00", "crawled": "2018-01-21T08:11:19.016+02:00", "highlightTitle": ""}