{"organizations": [], "uuid": "4e297b81d9da47c51eeda7a0293d726cd59d48bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XE407_cmonfl_SOC_20180125170446.jpg", "site_section": "https://www.wsj.com/europe", "section_title": "The Wall Street Journal &amp; Breaking News, Business, Financial and Economic News, World News and Video", "url": "https://www.wsj.com/articles/the-nfls-ratings-woes-finally-hit-networks-ad-business-1516918712", "country": "US", "domain_rank": 387, "title": "The NFL’s Ratings Woes Finally Hit Networks’ Ad Business", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T01:18:00.000+02:00", "replies_count": 0, "uuid": "4e297b81d9da47c51eeda7a0293d726cd59d48bf"}, "author": "Alexandra Bruell", "url": "https://www.wsj.com/articles/the-nfls-ratings-woes-finally-hit-networks-ad-business-1516918712", "ord_in_thread": 0, "title": "The NFL’s Ratings Woes Finally Hit Networks’ Ad Business", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "83 COMMENTS Advertising revenue from in-game NFL programming declined 1.2% to $2.42 billion during the 2017 regular season, according to Standard Media Index, as the league feels the impact of declining viewership.\nSMI’s figures include NFL advertising across NBC, CBS, FOX and ESPN, from Sept. 7 to Dec. 31.\nThe price of 30-second spots increased 1.2% from $499,000 to $505,000, according to SMI. At the same time, the delivery of “make goods” grew from 21% to 23% of the units due to lower ratings. Media companies typically give advertisers make goods, or extra commercial space, when they don’t hit their agreed-upon audience or ratings targets.\nRelated\nOverexposure, Not Anthem Protests, Blamed for NFL’s Ratings Woes Budweiser Benches Famous Clydesdales for Super Bowl LII “For the first time since we have been tracking the market we saw a slight drop of in-game dollars,” said SMI Chief Executive James Fennessy in a statement. “Despite a fairly significant fall in ratings, CPM’s were strong and demand continued to be high.”\nAccording to SMI, NFL ad revenue was up 9.6% in 2015, and 3% in 2016.\nViewership of NFL games was down 9.7% compared with the 2016 regular season, according to Nielsen. Industry insiders have chalked up the ratings woes to a range of possible factors, from off-the-field controversies and backlash to players’ protests during the national anthem to there being too much football on TV . Many believe cord-cutting has led to a structural and long-term downshift in viewing.\nThe NFL is still attractive real estate for advertisers. The cost of NFL commercial space increased about 6% to 7% this year in the “upfront” marketplace, the spring bazaar when the lion’s share of ad space is sold, according to media buyers.\nBut the early pricing didn’t translate into overall revenue growth by the end of the year. Much of the NFL’s inventory is bought in the so-called scatter market throughout the season. The NFL’s ability to deliver the audience it guaranteed in those early deals is also a key factor.\nAccording to the latest SMI data, the NFL was hit by declines from the league’s top advertisers. Automotive and consumer electronics advertisers, which represent the biggest NFL spenders by category, both cut back in 2017. Autos were down 5.4% and consumer electronics were down 3%.\nOn the other hand, industries that make up less of the NFL’s total ad revenue increased their total ad spending in the season. Insurance was up 30%, alcoholic beverages 16% and quick-serve restaurants 6.4%.\nWrite to Alexandra Bruell at alexandra.bruell@wsj.com", "external_links": [], "published": "2018-01-26T01:18:00.000+02:00", "crawled": "2018-01-26T00:27:21.004+02:00", "highlightTitle": ""}