{"organizations": [], "uuid": "6a37dbd0e715c6b703fa8327b65e6f89193aba5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/9", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-dtt-announces-appointment-of-mike-coffey-as-new-ceo.html", "country": "US", "domain_rank": 767, "title": "DTT Announces Appointment of Mike Coffey as New CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T21:55:00.000+02:00", "replies_count": 0, "uuid": "6a37dbd0e715c6b703fa8327b65e6f89193aba5e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-dtt-announces-appointment-of-mike-coffey-as-new-ceo.html", "ord_in_thread": 0, "title": "DTT Announces Appointment of Mike Coffey as New CEO", "locations": [], "entities": {"persons": [{"name": "chi", "sentiment": "negative"}, {"name": "mike coffey", "sentiment": "negative"}, {"name": "coffey", "sentiment": "none"}, {"name": "mike", "sentiment": "none"}, {"name": "wyless", "sentiment": "none"}, {"name": "sam naficy", "sentiment": "none"}, {"name": "naficy", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "wyless", "sentiment": "none"}], "organizations": [{"name": "dtt", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, DTT announced today the appointment of Mike Coffey as Chief Executive Officer. Mr. Coffey is a two-time CEO with 15+ years of executive experience in technology enabled companies, and will lead DTT's day to day operations. Sam Naficy, DTT's previous CEO and founder remains dedicated to DTT and will assume the position as Chairman of the Board of Directors.\n\"I'm thrilled to transition into a new role at such an exciting time for the company,\" said Mr. Naficy. \"Being Chairman of the Board will allow me to focus on strategy and M&A opportunities. While I will miss working in a direct capacity at DTT, I couldn't be more confident that Mike will successfully lead our growth and deliver significant benefits for our customers and our team.\"\nMr. Coffey comes to DTT after successfully having held executive leadership positions across Internet of Things, SaaS, and Managed Services businesses. Most recently, Mr. Coffey was the CEO of Wyless, an IoT and M2M business. As CEO, Mr. Coffey transformed Wyless through new product innovation and a customer focus while later completing a sale to KORE Wireless, where he then served as COO. Previously, Mr. Coffey was the CEO of RISI, where he successfully grew this niche SaaS data business into the leader in its industry.\n\"I am extremely excited because of DTT's stellar reputation,\" said Mr. Coffey. \"I knew there was an excellent opportunity for DTT to leverage my skills and experience with technology enabled businesses into new growth opportunities. I'm looking forward to spending the first few months learning more about the company, getting to know the DTT team and our tremendous customers, and ensuring we work together to continue providing truly innovative loss prevention solutions to the hospitality and retail industries.\"\nDTT also recently announced the closing of an $80 Million Facility with Capital One as well as the acquisition of LP Innovations Inc. (LPI), a company headquartered in Milford, Massachusetts that provides loss prevention solutions to the retail industry. \"The acquisition of LPI will provide truly unparalleled solutions for both existing DTT and LPI customers as we look to expand our service offerings for both companies,\" said Mr. Naficy.\nAbout DTT\nFounded in 1999 by Sam Naficy, DTT provides video surveillance solutions to the hospitality and retail industries. DTT has supported more than 36,000 clients while protecting trillions of dollars in assets and overseeing nearly 2 million employees. Brands that use DTT include McDonald's, SUBWAY®, Dairy Queen, Burger King, Arby's, Taco Bell, KFC, and Auntie Anne's, among others. More information at: www.dttusa.com\nAbout Mike Coffey\nMike Coffey is a technology executive who has led companies ranging in size from $20m to $175m, and has successfully negotiated multiple exits, resulting in tremendous shareholder profit. Most recently, Mr. Coffey served as the COO of KORE Wireless, after having successfully negotiated the sale of Wyless into KORE in 2017. Prior to serving as the CEO of Wyless, Mr. Coffey was the CEO of RISI.\nAbout LP Innovations, Inc.\nFounded in 1998, LP Innovations, Inc. has quickly become the leading provider of loss prevention solutions and field services to retailers across all verticals. Based in Milford, Massachusetts, LP Innovations, Inc. develops holistic, results-driven programs and products to eliminate losses and increase profitability for their clients. Through the application of best practices and 30 years of cross-industry experience, LPI has developed a team of loss prevention experts, servicing over 70 companies and 8,000 locations in the US and Canada.\n releases/dtt-announces-appointment-of-mike-coffey-as-new-ceo-300583369.html\nSOURCE DTT", "external_links": ["http://www.dttusa.com/", "http://www.prnewswire.com/news-releases/dtt-announces-appointment-of-mike-coffey-as-new-ceo-300583369.html"], "published": "2018-01-16T21:55:00.000+02:00", "crawled": "2018-01-17T02:22:13.024+02:00", "highlightTitle": ""}