{"organizations": [], "uuid": "a41372a9ac78b43d320b753b9a93251c666f8235", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/01/16/101341746-51792937.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/money-habits-of-self-made-billionaire-ikea-founder-ingvar-kamprad.html", "country": "US", "domain_rank": 767, "title": "Money habits of self-made billionaire IKEA founder Ingvar Kamprad", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.203, "site_type": "news", "published": "2018-01-29T20:03:00.000+02:00", "replies_count": 0, "uuid": "a41372a9ac78b43d320b753b9a93251c666f8235"}, "author": "Emmie Martin", "url": "https://www.cnbc.com/2018/01/29/money-habits-of-self-made-billionaire-ikea-founder-ingvar-kamprad.html", "ord_in_thread": 0, "title": "Money habits of self-made billionaire IKEA founder Ingvar Kamprad", "locations": [], "entities": {"persons": [{"name": "ingvar kamprad", "sentiment": "negative"}, {"name": "kamprad", "sentiment": "none"}], "locations": [{"name": "sweden", "sentiment": "none"}], "organizations": [{"name": "ikea", "sentiment": "negative"}, {"name": "volvo", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nearly 75 years after he founded IKEA, revolutionizing the way affordable furniture is designed and distributed, Swedish business magnate Ingvar Kamprad died on Saturday at the age of 91.\nKamprad built a global company and became a self-made billionaire in the process. Upon his death, Kamprad was the eighth-richest person in the world, worth an estimated $58.7 billion, according to Bloomberg .\nDespite his wealth, the the business titan was known for his frugal habits , which included flying coach and driving a 20-year-old Volvo. Here are four ways the billionaire insisted on saving money.\nHe drove a cheap car For two decades, Kamprad drove a 1993 Volvo 240 GL . He only gave it up when someone persuaded him that driving it was too dangerous. Originally, the car was worth around $22,000 , but at the time he got rid of it, it wouldn't go for more than a few thousand dollars.\nshow chapters The richest person in 34 states is a self-made millionaire or billionaire      11:27 AM ET Tue, 8 Aug 2017 | 00:49 He purchased clothes from flea markets In 2014, when Kamprad returned to Sweden after 40 years of tax exile, The Telegraph reported that he said on television, \"If you look at me now, I don't think I'm wearing anything that wasn't bought at a flea market.\"\nThe self-made billionaire learned to being prudent with money growing up in Smaland, a small town in Southern Sweden. \"It is in the nature of Smaland to be thrifty,\" he said.\nHe got his hair cut in foreign countries Kamprad kept himself on a tight budget. After paying around $27 (€22) for a haircut in the Netherlands in 2008, he told a Swedish newspaper that the price was too high to fit within his usual hair cut budget, The Guardian reported .\n\"Normally, I try to get my haircut when I'm in a developing country. Last time it was in Vietnam,\" he said.\nSven Nackstrand | AFP | Getty Images The founder of Swedish do-it-yourself furniture giant Ikea, Ingvar Kamprad. He flew coach No first class tickets or private jets for this billionaire CEO. Kamprad always flew economy and stayed at budget hotels while traveling.\nThese habits not only represented a tenet of Kamprad's personal philosophy towards consumerism but were also meant to serve as a model for his employees.\n\"His cut-rate flights, hotels and meals were taken in part as an exemplar to his executives, who were expected to follow suit, to regard employment by Ikea as a life's commitment — and to write on both sides of a piece of paper,\" The New York Times reports .\nIn 1976, Kamprad penned and distributed \" The Testament of a Furniture Dealer ,\" a pamphlet of guidelines that IKEA employees still follow to this day. In it, he detailed pieces of his frugal philosophy, stating that \"wasting resources is a mortal sin at IKEA.\" \nDon't miss: \nFoo Fighters' Dave Grohl puts every paycheck directly in the bank and drives a 'family car' Here's just how deeply 68% of Americans don't want to talk about money Nicholas Cage once blew $150 million on a private island and a dinosaur skull—here's everything he bought Like this story? Like CNBC Make It on Facebook ! \nshow chapters Dallas Cowboys running back Alfred Morris drives a $2 car      9:47 AM ET Thu, 19 Oct 2017 | 00:49", "external_links": [], "published": "2018-01-29T20:03:00.000+02:00", "crawled": "2018-01-29T20:06:26.008+02:00", "highlightTitle": ""}