{"organizations": [], "uuid": "453f3de6583a176d097b249e4c1685516e7303ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-edgewell-personal-care-announces-agreement-to-acquire-jack-black-l-l-c.html", "country": "US", "domain_rank": 767, "title": "Edgewell Personal Care Announces Agreement to Acquire Jack Black, L.L.C.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.044, "site_type": "news", "published": "2018-01-18T17:00:00.000+02:00", "replies_count": 0, "uuid": "453f3de6583a176d097b249e4c1685516e7303ab"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-edgewell-personal-care-announces-agreement-to-acquire-jack-black-l-l-c.html", "ord_in_thread": 0, "title": "Edgewell Personal Care Announces Agreement to Acquire Jack Black, L.L.C.", "locations": [], "entities": {"persons": [{"name": "neiman marcus", "sentiment": "none"}, {"name": "dillard", "sentiment": "none"}, {"name": "jack black", "sentiment": "none"}], "locations": [{"name": "st. louis", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "tx", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "edgewell personal care company", "sentiment": "negative"}, {"name": "epc", "sentiment": "negative"}, {"name": "edgewell personal care announces agreement to acquire jack black, l.l.c.", "sentiment": "neutral"}, {"name": "edgewell", "sentiment": "none"}, {"name": "amazon luxury beauty", "sentiment": "none"}, {"name": "jack black, l.l.c.", "sentiment": "none"}, {"name": "ulta beauty", "sentiment": "none"}, {"name": "nordstrom", "sentiment": "none"}, {"name": "bloomingdale", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ST. LOUIS, Edgewell Personal Care Company (NYSE: EPC) announced today an agreement to acquire Jack Black, L.L.C., a leading U.S. based luxury men's skincare products company.\nFounded in Dallas, TX in 2000, Jack Black was an early pioneer and innovator in the growing men's skincare industry and today is the #1 brand in the U.S. men's prestige skincare market.* Addressing men's every day personal care needs, the brand offers a full range of products including skincare, body care, shaving, hair care, fine fragrance, razors, and gift sets.\nJack Black's largest markets are in the U.S. and Canada, where it is a top selling brand at retailers such as Nordstrom, ULTA Beauty, Neiman Marcus, Bloomingdale's, Dillard's and Sephora. Additionally, Jack Black boasts industry-leading eCommerce growth and penetration via the online platforms of its prestige retail partners, Amazon Luxury Beauty, and its own website, getJackBlack.com .\n\"As a challenger company in men's grooming, Edgewell has continuously pressed beyond category conventions to bring unique solutions and innovation, such as Schick Hydro and Bulldog skincare, to satisfy men's everyday grooming needs,\" said Colin Hutchison, Edgewell's Chief Operating Officer. \"Similarly, Jack Black is a breakthrough brand, driving the growth of the luxury men's category through product innovation and cultivation of a highly engaged, loyal and growing customer base. The Jack Black brand is a strong and complementary addition to Edgewell's portfolio based on its unique brand positioning, prestige channel footprint, and product assortment. This acquisition creates opportunities to expand our personal care portfolio in growing categories in the U.S. and globally, while nurturing the strong brand equity that the Jack Black founders have developed.\"\n\"We are delighted to be joining Edgewell's family of brands. This is an excellent home for Jack Black, and we look forward to continuing to drive strong growth in North America and expanding our global presence,\" said Curran Dandurand, CEO of Jack Black. \"We've built our leadership position in the U.S. by providing superior skin care products using the best ingredients, that work as advertised, and are never tested on animals. We're very excited about the future and about sharing our products with more people throughout the world.\"\nTerms of the transaction were not disclosed. The transaction is expected to close in the second quarter of 2018. The acquisition is subject to customary closing conditions, including U.S. antitrust clearance. The transaction will be funded from operating cash and is expected to be EPS neutral in fiscal 2018. Edgewell will discuss the acquisition in further detail on its earnings call scheduled for February 8, 2018.\nMoelis & Company served as financial advisor to Edgewell.\nPiper Jaffray & Co. served as financial advisor to Jack Black, L.L.C.\n*Source: The NPD Group, Inc./Beauty Trends® US Prestige Skincare Retail Dollar Sales, January 2016-December 2016.\nAbout Edgewell Personal Care\nEdgewell is a leading pure-play consumer products company with an attractive, diversified portfolio of established brand names such as Schick® and Wilkinson Sword® men's and women's shaving systems and disposable razors; Edge® and Skintimate® shave preparations; Playtex®, Stayfree®, Carefree® and o.b.® feminine care products; Banana Boat® and Hawaiian Tropic® sun care products; Playtex® infant feeding, Diaper Genie®; Bulldog® male skincare and grooming products; and Wet Ones® moist wipes. The Company has a broad global footprint and operates in more than 50 markets, including the U.S., Canada, Mexico, Germany, Japan and Australia, with approximately 6,000 employees worldwide.\nAbout Jack Black, L.L.C.\nFounded in Dallas, TX in 2000 by Curran Dandurand, Jeff Dandurand and Emily Dalton, Jack Black, L.L.C. is the leading provider of men's prestige grooming and skin care products. Jack Black products are created with a simple commitment to our customers: Nothing complicated. Nothing cosmetic. Just superior skincare. Fragrance-free, colorant-free, cruelty-free, sulfate-free, and dermatologist-tested, Jack Black products take an honest, effective approach to helping you look and feel your best.\nView original content with multimedia: http://www.prnewswire.com/news-releases/edgewell-personal-care-announces-agreement-to-acquire-jack-black-llc-300584315.html\nSOURCE Edgewell Personal Care", "external_links": ["http://www.prnewswire.com/news-releases/edgewell-personal-care-announces-agreement-to-acquire-jack-black-llc-300584315.html"], "published": "2018-01-18T17:00:00.000+02:00", "crawled": "2018-01-18T19:53:44.000+02:00", "highlightTitle": ""}