{"organizations": [], "uuid": "939071efe2e777087f1f15418581e313e481debb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/14/reuters-america-oil-dips-away-from-2014-highs-on-rising-u-s-rig-count-but-analysts-say-market-supported.html", "country": "US", "domain_rank": 767, "title": "Oil dips away from 2014 highs on rising U.S. rig count, but analysts say market supported", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T02:21:00.000+02:00", "replies_count": 0, "uuid": "939071efe2e777087f1f15418581e313e481debb"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/14/reuters-america-oil-dips-away-from-2014-highs-on-rising-u-s-rig-count-but-analysts-say-market-supported.html", "ord_in_thread": 0, "title": "Oil dips away from 2014 highs on rising U.S. rig count, but analysts say market supported", "locations": [], "entities": {"persons": [{"name": "rivkin se", "sentiment": "none"}, {"name": "william o'loughlin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "opec", "sentiment": "none"}, {"name": "wti", "sentiment": "none"}, {"name": "anz", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "market supported@\nSINGAPORE, Jan 15 (Reuters) - Oil prices dipped on Monday as rising drilling activity in the United States pointed to higher future output, although output cuts led by OPEC and Russia as well as healthy demand kept crude near December 2014 highs reached last week.\nBrent crude futures, the international benchmark for oil prices, were at $69.72 per barrel at 0008 GMT, down 15 cents, or 0.2 percent, from their last close.\nU.S. West Texas Intermediate (WTI) crude futures were at $64.27 a barrel, down 3 cents.\nBoth Brent and WTI last week reached levels not seen since December 2014, at the start of the oil price slump.\nANZ bank said oil prices had recently risen \"on the back of data continuing to show the market is tightening.\"\nDespite the sharp price rises since December, some analysts have been warning of a downward correction.\n\"Many believe that oil prices above $60 will self-correct as this level of prices will encourage substantially more drilling in U.S. shale which will lead to increased supply,\" said William O'Loughlin, investment analyst at Australia's Rivkin Securities.\nU.S. energy companies added 10 oil rigs in the week to Jan. 12, taking the number to 752, energy servicing firm Baker Hughes said on Friday.\nThat was the biggest increase since June 2017, and ANZ bank said the jump came \"as shale producers quickly reacted to the strong rise in prices in 2018.\"\nThe picture was similar in Canada, where energy firms almost doubled the number of rigs drilling for oil last week to 185, the highest level in 10 months.\nThe high prices for crude, which is the most important feedstock in the petroleum industry, have also crimped profit margins for oil refiners, resulting in a decline in new crude orders.\nOverall, however, oil markets have been well supported by production cuts led by the Organization of the Petroleum Exporting Countries (OPEC) and Russia which are aimed at propping up crude prices.\nThe cuts started in January last year and are set to last through 2018, and they have coincided with healthy demand growth, pushing up crude prices by more than 13 percent since early December.\nAttracted by tighter supplies and strong consumption, financial investors have raised their net long U.S. crude futures positions, which would profit from higher prices, to a new record, the U.S. Commodity Futures Trading Commission (CFTC) said on Friday.\n(Reporting by Henning Gloystein; editing by Richard Pullin)", "external_links": [], "published": "2018-01-15T02:21:00.000+02:00", "crawled": "2018-01-15T13:02:58.003+02:00", "highlightTitle": ""}