{"organizations": [], "uuid": "fcf4204f7b81af3902f63229bde7e9389bbd66a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-singlepoint-signs-loi-to-acquire-bitcoin-beyond-enabling-retailers-to-accept-bitcoin-payments-using-their-existing-web.html", "country": "US", "domain_rank": 767, "title": "SinglePoint Signs LOI to Acquire Bitcoin Beyond Enabling Retailers to Accept Bitcoin Payments Using their Existing Web-Enabled POS Devices -- CFN Media", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T17:00:00.000+02:00", "replies_count": 0, "uuid": "fcf4204f7b81af3902f63229bde7e9389bbd66a5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-singlepoint-signs-loi-to-acquire-bitcoin-beyond-enabling-retailers-to-accept-bitcoin-payments-using-their-existing-web.html", "ord_in_thread": 0, "title": "SinglePoint Signs LOI to Acquire Bitcoin Beyond Enabling Retailers to Accept Bitcoin Payments Using their Existing Web-Enabled POS Devices -- CFN Media", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Seattle, WA., Jan. 31, 2018 (GLOBE NEWSWIRE) -- CFN Media Group (\"CannabisFN\"), the leading creative agency and media network dedicated to legal cannabis, announces publication of an article discussing SinglePoint, Inc. (OTC: SING) and their announced move to acquire 100% of Bitcoin Beyond\nMarijuana’s mixed legality across the country means that major financial institutions are reluctant to loan and manage money for cannabis businesses. And this reluctance is likely to increase given Attorney General Jeff Sessions’ recent announcement that he’s rescinding an Obama-era memo that protected legal marijuana states from federal interference.\nThe lack of bank involvement not only makes it more difficult to start and manage a canna-business from a financial standpoint, but it also means that many of these businesses are sitting on large amounts of cash. This, of course, makes them more vulnerable to theft and violence, and nearly requires that canna-businesses pay exorbitant amounts in security and protection services, with many paying for full-time guards to monitor the premises. This costly and potentially dangerous problem is leading an increasing number of cannabis entrepreneurs and investors to look at cryptocurrency as a safer and more viable alternative to cannabis money management.\nIn response to the cannabis industry’s growing demand for electronic payment processing, on January 23rd, SinglePoint, Inc. (OTC: SING) announced its move to acquire 100% of Bitcoin Beyond. Bitcoin Beyond is a platform that allows retailers to accept bitcoin payments via their existing web-enabled point-of-sale device, which means that they won’t have to add additional systems to accept and manage bitcoin payments. The acquisition, which is valued at approximately $1 million in stock, will give SinglePoint the ability to provide a full purchasing experience from start to finish. This, in turn, is expected to afford marijuana merchants and bitcoin users a wide range of safer and more secure purchasing and payment options throughout the entire cannabis industry.\nSinglePoint President, Wil Raston, is enthusiastic about the acquisition stating, “We are thrilled with this opportunity. Acquiring Bitcoin Beyond put us ahead of what we believe merchants have access to now. This platform has by far the easiest user interface we have seen in the market, and we are confident merchants will be quick to adopt this solution as it stands as the sole alternative to traditional options offered to the cannabis industry.”\nDesigned with over a decade of combined expertise (precisely 14 years) in both payment processing and online wallet solutions, the Bitcoin Beyond platform is founded on a familiar, comfortable, and widely used technology stack.\nThe platform employs best practices in both protection and security while ensuring the encryption of all private merchant data so that all payment activity is safe, protected and secure. This user-friendly and top-of-the-line technology also means that Bitcoin Beyond can be seamlessly integrated with payment frameworks that are already in place, making it incredibly simple for merchants to add bitcoin and other cryptocurrency payment options.\nPlease follow the link to read the full article: http://www.cannabisfn.com/singlepoint-sign…bled-pos-devices/\nFor more information, visit the company’s website at www.singlepoint.com .\nAbout CFN Media\nCFN Media (CannabisFN) is the leading creative agency and media network dedicated to legal cannabis. We help marijuana businesses attract investors, customers (B2B, B2C), capital, and media visibility. Private and public marijuana companies and brands in the US and Canada rely on CFN Media to grow and succeed.\nLearn how to become a CFN Media client company, brand or entrepreneur: http://www.cannabisfn.com/featuredcompany\nDownload the CFN Media iOS mobile app to access the world of cannabis from the palm of your hand: https://itunes.apple.com/us/app/cannabisfn/id988009247?ls=1&mt=8\nOr visit our homepage and enter your mobile number under the Apple App Store logo to receive a download link text on your iPhone: http://www.cannabisfn.com\nDisclaimer:\nCannabisFN.com is not an independent financial investment advisor or broker-dealer. You should always consult with your own independent legal, tax, and/or investment professionals before making any investment decisions. The information provided on http://www.cannabisfn.com (the ‘Site’) is either original financial news or paid advertisements drafted by our in-house team or provided by an affiliate. CannabisFN.com , a financial news media and marketing firm enters into media buys or service agreements with the companies that are the subject of the articles posted on the Site or other editorials for advertising such companies. We are not an independent news media provider. We make no warranty or representation about the information including its completeness, accuracy, truthfulness or reliability and we disclaim, expressly and implicitly, all warranties of any kind, including whether the Information is complete, accurate, truthful, or reliable. As such, your use of the information is at your own risk. Nor do we undertake any obligation to update the items posted. CannabisFN.com received compensation for producing and presenting high quality and sophisticated content on CannabisFN.com along with financial and corporate news.\nThe above article is sponsored content. Emerging Growth LLC, which owns CannabisFN.com and CFN Media, has been hired to create awareness. Please follow the link below to view our full disclosure outlining our compensation: http://www.cannabisfn.com/legal-disclaimer/\nContact: CFN Media Frank Lane 206-369-7050 flane@cannabisfn.com\nSource: CFN Media", "external_links": ["https://www.globenewswire.com/Tracker?data=XIsLDyGgotDLKm0UlXCLOZRSBJEo6dr69Aas9OCoGfGTz6fH8eki0846U_4v8HqWTaFhxV9DmOdXsrj2pZ4DgmSQoUW_leNy0nbOQ3_tA6MzGtVyWxJ8EHa5KAWUfML48q8G-80Kc9YGh2ne5rX6T5S8JDXiGJgwzBtOAYBNKXo=", "http://www.cannabisfn.com/legal-disclaimer/", "https://www.globenewswire.com/Tracker?data=_L72fbFhFxaAdUtq_9Qt5EE3UVay_PotxtDNwIzbVUWrozsNM02shjorH3IEzSF-8PjBGDqkp-kcbzMAZPrz9tS3RuYJ7yUzXRgO3-Dlm5JqaBddJglXKFNVbhYMlg-LBiXlYujwUOKTjvvD8uO-T8j3O358l-g3HXHvXZVxO56TqYjv32zJR7N4nSBP4cpIL2zeIBNrQ6aukGqbxP_FVMEZE01ia47jvxNO4Q9mOhNHwmqTD5IX-Nys7G5nF6_7IVECTla8EigchjOhPD9cdQJPNJoJCbDP7UKrZGQJ5wIH5-uESDtM94OU2K7jMPqr", "https://www.globenewswire.com/Tracker?data=WQwckqJp0e-N5CKe5EgDZc9zM2cC-B6Cg-8CaJB8m1WzFQLfmDI77JAXPmSWAT8Ae8rcoeziukSgfhZcf5nig7DfCozgnxyyArS4i8LUFUg=", "https://www.globenewswire.com/Tracker?data=JEnexe6ZI8hdPVlNgn_KBMur1bJfLyEMifC7JzoQwKazl9H0oewudMcKtyuSJknMJ_cgD6tmlgzYuwHnrNmwOoqYWRX7EJSopiw216Yo_nwXarejIc1JOIHrwLfhniuslHB3WZgLLSRmNDowIR-ewMNcNuUiakiBi04C8mV3ynU=", "https://www.globenewswire.com/Tracker?data=_L72fbFhFxaAdUtq_9Qt5EE3UVay_PotxtDNwIzbVUWxsJqfqPaiwBYNAaGwiIOQXID_NoVGJhh14h0f_OTn8ZpzuQDpO8RynY9ruUpi2_M=", "https://www.globenewswire.com/Tracker?data=JEnexe6ZI8hdPVlNgn_KBEQQEwgN7hzCesm5RaXq3m6NZXOJNOEFnkKDpUKGBB73qGiLEOkPFfwTDiA17CO6wr1j2ThlQhvVam75t1cejcUmmsCgWUDDwHftfGluOU07OaKPMNMPCKP-ED9PeLjjFSDcX4oZYXiqo0OJfASEwuw=", "http://www.cannabisfn.com/featuredcompany", "http://www.cannabisfn.com/singlepoint-sign…bled-pos-devices/", "https://itunes.apple.com/us/app/cannabisfn/id988009247?ls=1&mt=8", "https://www.globenewswire.com/Tracker?data=gorwxJ0DjbSE_1y9cIFX_13M7qgoyUB4-WeZgrR2xSNnQ685uo2Cx6twWIQ-Q3g_8xa2CynYe5YNs-baiJktAE2AVYe88ZLRVvdZYqJuFcw=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/e55ff390-fb28-44ce-ba6d-810bc1cdafd3", "https://www.globenewswire.com/Tracker?data=_L72fbFhFxaAdUtq_9Qt5EE3UVay_PotxtDNwIzbVUXGiZLjCNinuAnaO8yHJUftzXzCdwwjYzFwBowPl7FTe2gavIdNUPatLS3pmhIrciG7XCi292YbXTEN2H44ZivB", "https://www.globenewswire.com/Tracker?data=_L72fbFhFxaAdUtq_9Qt5EE3UVay_PotxtDNwIzbVUV1T10zwXy_rQPxSUbJtHtozuKb2ETpOnAoSlAlvuM1TUw26HghPydlv1SHThHjc73DYR-j0JT6xwSVe7cyB7A9"], "published": "2018-01-31T17:00:00.000+02:00", "crawled": "2018-01-31T18:48:07.010+02:00", "highlightTitle": ""}