{"organizations": [], "uuid": "997b6d11dbf6de002a8f903cc70edfcb4aa2d7c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-euro-falls-from-three-year-high-bitcoin-plunges-idUSL8N1PB4FJ", "country": "US", "domain_rank": 408, "title": "FOREX-Euro falls from three-year high, bitcoin plunges", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.208, "site_type": "news", "published": "2018-01-16T21:50:00.000+02:00", "replies_count": 0, "uuid": "997b6d11dbf6de002a8f903cc70edfcb4aa2d7c1"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-euro-falls-from-three-year-high-bitcoin-plunges-idUSL8N1PB4FJ", "ord_in_thread": 0, "title": "FOREX-Euro falls from three-year high, bitcoin plunges", "locations": [], "entities": {"persons": [{"name": "angela merkel", "sentiment": "none"}, {"name": "merkel", "sentiment": "none"}, {"name": "jemima kelly", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "world fx", "sentiment": "none"}, {"name": "european central bank", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "cdu", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds Quote: , updates prices)\n* Euro takes breather after setting 3-year high on Monday\n* Cryptocurrencies plunge on crackdown fears\n* Graphic: World FX rates in 2017 tmsnrt.rs/2egbfVh\nBy Jemima Kelly\nLONDON, Jan 16 (Reuters) - The euro fell from a three-year high on Tuesday as investors sold the currency on doubts that the European Central Bank would ditch its pledge to keep buying bonds at next week’s meeting.\nSources close to the ECB told Reuters that the central bank was unlikely to tweak its policy message so soon, as rate setters need more time to assess the outlook for the economy and the euro.\nAfter its best three-day performance in nearly two years, the euro fell as low as $1.2208 on the story. It had already faced pressure from uncertainty over whether German Chancellor Angela Merkel’s would manage to form a “grand coalition” to govern.\nMembers of the centre-left Social Democrats (SPD) in one of Germany’s regions voted against talks with Merkel’s conservative Christian Democrats (CDU) on Monday, and fresh headlines on that development triggered a fall in the euro in early European trading on Tuesday.\nBy 1330 GMT, the euro was trading down 0.3 percent on the day at $1.2223.\nThe euro had climbed 2.7 percent between Thursday and Monday, making gains not seen since February 2016, and hit as high as $1.22965, its strongest since December 2014.\n“This is just some pull-back after strong gains in recent days, and some headline risk came through this morning raising concern over whether the new government would be formed in Germany,” said MUFG currency analyst Lee Hardman, in London.\n“I don’t think that’s a big deal for the euro but the fact the euro did weaken on the news just highlights the fact that we’ve had very strong gains in recent days so there’s just a risk of a small correction,” Hardman said.\nSpeculators boosted net long positions in the euro to a record high in the week to Jan. 12, according to futures data published on Friday.\nAlthough the euro’s strength has raised concerns that it could encourage the ECB to talk down the currency, most investors are sanguine about that.\n“We still think that the euro is appreciating for good, endogenous, flow-related reasons, and we believe that a majority of ECB members will share this assessment,” wrote Pictet economist Frederik Ducrozet in a note to clients.\nThe dollar’s index against a basket of six major currencies climbed 0.3 percent to 90.509, up from Monday’s three-year low of 90.279, with the U.S. currency helped by the pull-back in the euro.\nAgainst the yen, the dollar rose 0.2 percent to 110.75 yen , edging away from Monday’s four-month low of 110.32 yen.\nBitcoin slid as much as 18 percent to a four-week trough near $11,000 after reports suggested it was still possible that South Korea could ban trading in cryptocurrencies, driving fears of a wider regulatory crackdown.\nOther cryptocurrencies also plunged, though they and bitcoin had recouped some of their earlier losses by 1330 GMT. (Reporting by Jemima Kelly; Additional reporting by Masayuki Kitano in Singapore; Editing by Edmund Blair and Keith Weir)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T21:50:00.000+02:00", "crawled": "2018-01-16T23:11:49.010+02:00", "highlightTitle": ""}