{"organizations": [], "uuid": "bbde5378fabed7a75508a7f0c36d2efc470caf20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-honduras-quake/magnitude-7-8-quake-strikes-off-central-america-usgs-idUKKBN1EZ090", "country": "US", "domain_rank": 408, "title": "Magnitude 7.6 quake strikes off Central America - USGS", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T05:19:00.000+02:00", "replies_count": 0, "uuid": "bbde5378fabed7a75508a7f0c36d2efc470caf20"}, "author": "", "url": "https://uk.reuters.com/article/uk-honduras-quake/magnitude-7-8-quake-strikes-off-central-america-usgs-idUKKBN1EZ090", "ord_in_thread": 0, "title": "Magnitude 7.6 quake strikes off Central America - USGS", "locations": [], "entities": {"persons": [{"name": "lisa shumaker", "sentiment": "none"}, {"name": "sandra maler", "sentiment": "none"}], "locations": [{"name": "central america", "sentiment": "none"}, {"name": "cayman islands", "sentiment": "none"}, {"name": "pacific tsunami warning center", "sentiment": "none"}, {"name": "barra patuca", "sentiment": "none"}, {"name": "honduras", "sentiment": "none"}, {"name": "caribbean sea", "sentiment": "none"}, {"name": "george town", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "usgs", "sentiment": "negative"}, {"name": "usgs reuters", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. geological survey", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 3:07 AM / Updated an hour ago Strong quake in Caribbean Sea shakes Honduras, Mexico and Belize, no tsunami Gustavo Palencia 3 Min Read \nTEGUCIGALPA (Reuters) - An earthquake of magnitude 7.6 that struck near remote islands belonging to Honduras on Tuesday was felt across northern Central America but there were no immediate reports of casualties or major damage. \nThe quake rattled windows in the Honduran capital of Tegucigalpa roughly 323 miles (519 km) to the east and was felt at least as far north as the Mexican state of Quintana Roo, but no damage was immediately reported. \nRodrigo Anaya Rodriguez was in a hammock inside his house near the popular tourist site of Bacalar Lake near Mexico’s Caribbean coast when he felt three tremors. \n“It felt like a bulldozer was driving past,” he said. “It didn’t last long but was very violent.” \nHe ran to his balcony and saw electricity posts and cables swaying. \nIn Honduras, firefighters said some residents in southern neighbourhoods fled their homes after feeling the shaking. \nThe country operates a small naval base on Great Swan Island, about 27 miles (44 km) west of the quake’s epicentre, but it was not immediately clear how the tremors affected the station. \n“We have reports that it was felt in the majority of the country, but we don’t have reports of damage,” said Lizandro Rosales, director of Honduras’ contingencies commission. \nThe U.S. Geological Survey said the quake, initially reported as a magnitude 7.8, was centred 125 miles (202 km)northeast of Barra Patuca in Honduras and 191 miles (307 km)southwest of George Town in the Cayman Islands. \nThe quake was very shallow, at only 6.2 miles (10 km), which would have amplified its effect. \nThe Pacific Tsunami Warning Center initially warned that tsunami waves up to 1 metre (3 feet) above tide level could hit parts of Honduras, Belize and Puerto Rico along with the U.S. and British Virgin Islands. \nAbout two hours after the quake, the centre said the threat had passed, withdrawing all tsunami advisories connected with the quake. \nThe tremors were felt in Belize’s capital, Belize City, but there were no immediate reports of damage. \nBelize’s minister in charge of emergency management, Edmond Castro, spoke on local radio to urge people living in low lying coastal areas and islands to stay alert for potentially dangerous waves. Additional reporting by Sandra Maler in Washington; Daina Beth Solomon, Adriana Barrera and Frank Jack Daniel in Mexico City; Jose Sanchez in Belize City; Editing by Lisa Shumaker and Simon Cameron-Moore", "external_links": [], "published": "2018-01-10T05:19:00.000+02:00", "crawled": "2018-01-10T05:39:41.062+02:00", "highlightTitle": ""}