{"organizations": [], "uuid": "32521f0fd023d85082ce7c3313f89525e9d0e86b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-shire-announces-business-update-at-36th-annual-j-p-morgan-healthcare-conference.html", "country": "US", "domain_rank": 767, "title": "Shire Announces Business Update at 36th Annual J.P. Morgan Healthcare Conference", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-08T17:31:00.000+02:00", "replies_count": 0, "uuid": "32521f0fd023d85082ce7c3313f89525e9d0e86b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-shire-announces-business-update-at-36th-annual-j-p-morgan-healthcare-conference.html", "ord_in_thread": 0, "title": "Shire Announces Business Update at 36th Annual J.P. Morgan Healthcare Conference", "locations": [], "entities": {"persons": [{"name": "shire", "sentiment": "none"}], "locations": [{"name": "ireland", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}], "organizations": [{"name": "shire announces business update", "sentiment": "negative"}, {"name": "j.p. morgan healthcare conference shire announces business update", "sentiment": "negative"}, {"name": "j.p. morgan healthcare conference projects", "sentiment": "negative"}, {"name": "shire", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}, {"name": "shire plc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Shire Announces Business Update at 36 th Annual J.P. Morgan Healthcare Conference\nProjects continued strong growth as the global leader in rare diseases, led by the immunology franchise Will operate as two divisions: Rare Disease and Neuroscience, to enable increased focus, investment and growth Target Non GAAP Net Debt to EBITDA* ratio of less than 2.5x by end of 2018\nDublin, Ireland - January 8, 2018 - Shire plc (LSE: SHP, NASDAQ: SHPG) ('Shire' or the 'Company'), continues to progress its strategy as the leading global biotech company focused on rare diseases. Shire expects continued revenue growth driven by a diverse portfolio of leading brands including those within its Immunology franchise, which grew 21% in the first three quarters of 2017 on a pro forma basis. In addition, Shire continues to have a promising late stage pipeline with fifteen programs currently in Phase 3. The Company projects total revenues to reach $17-18 billion by 2020.\nIn August 2017, Shire announced that it was conducting a strategic review of its neuroscience business. Following the first stage of this review, the Board has concluded that the neuroscience business warrants additional focus and investment and that there is a strong business rationale for creating two distinct business divisions within Shire: a Rare Disease Division and a Neuroscience Division. Each division will benefit from sharper management focus, greater strategic clarity, and an increased ability to deploy resources to key growth priorities. The Board believes this will be an important first step in enabling both divisions to maximize mid- to long-term product sales, cash generation, and innovation.\nShire expects to report the operational performance metrics of each division separately beginning with the first quarter of 2018. The second stage of the review will include continuing to evaluate all strategic alternatives, including the merits of an independent listing for each of the two divisions. The Company will give an update on the second stage of the review in the second half of 2018.\nIn addition, the Company confirms that its debt repayment schedule remains on track and announces a target Non GAAP Net Debt to EBITDA ratio of below 2.5x by the end of 2018, excluding the effect of any bolt-on acquisitions or licensing transactions.\nFlemming Ornskov, M.D., M.P.H., Chief Executive Officer, Shire said: \"Shire has undergone a significant transformation over the last five years creating two market-leading businesses with distinct profiles and future needs. Simultaneously, Shire has established a strong track record of growth and execution. Our new Rare Disease and Neuroscience Divisions will be well positioned for growth, profitability, innovation, and serving the needs of patients. We are also pleased with our continued progress on delevering and will now be targeting a Non GAAP Net Debt to EBITDA[*] ratio of below 2.5x by the end of 2018.\"\nRationale for Divisional Structure\nThe rare disease and neuroscience businesses have distinct strategic priorities. Following the creation of the two divisions, Rare Disease and Neuroscience will be better positioned to deliver their full potential, enabling them to maximize mid- to long-term product sales, innovation, and profitability. Shire will use 2018 to optimize the portfolio for each of these two divisions, which may include business development activities such as partnerships, licensing agreements, and bolt-on acquisitions.\nRare Disease division: Shire's rare disease business has a recognized track record of sustained growth and will build on its leading market position, investing both organically and inorganically to further enhance its innovative pipeline.\nApproximately 70% of Shire's revenues, as of September 30, 2017 on a trailing 12 month basis, were from rare disease products, and multiple franchises continue to be poised for growth in 2018. Shire expects increased demand for HYQVIA and CUVITRU from our Immunology franchise, which grew 21% in the first three quarters of 2017 on a pro forma basis. Shire expects to continue to be the leader in the Hematology space with key brands such as ADVATE and ADYNOVATE, and the anticipated introduction of MyPKFit in the US in 2018. Shire also anticipates that Internal Medicine will see an increased demand for NATPARA (hypoparathyroidism) and GATTEX (short bowel syndrome), while Ophthalmics should benefit from US and global growth of XIIDRA (dry eye disease), The Rare Disease division will have a robust late-stage pipeline including SHP643 for hereditary angioedema, SHP620 for CMV infection in transplant patients, which just received breakthrough designation from the FDA as well as orphan drug designation, SHP607 for the prevention of respiratory morbidity in premature infants, and SHP621 for eosinophilic esophagitis, all of which are subject to positive pivotal data and regulatory approval. Neuroscience division: Neuroscience has long delivered strong top-line growth and continued leadership in ADHD, beginning more than twenty years ago with ADDERALL and later ADDERALL XR. Since then, Shire has continued to grow in the space through innovation resulting in products like INTUNIV, VYVANSE, and the recent launch of MYDAYIS in the US.\nThe Neuroscience division will build on this industry-leading platform with a focus on neuropsychiatry more broadly. Shire expects it will drive growth in the future by expanding internationally and into adjacencies through disciplined R&D and business development. Shire will continue to launch and grow in key international markets with both VYVANSE and INTUNIV to treat both pediatric and adult ADHD. The division's pipeline will include SHP680 for multiple neurological conditions and BUCCOLAM in the US.\nDelevering targets\nShire has remained highly cash generative in 2017 and made good progress with its plans to reduce its Non GAAP Net Debt* following the acquisition of Baxalta in 2016. With continued strong cash generation, Shire anticipates its Non GAAP Net Debt* to further decline during the course of 2018 and today announces a target Non GAAP Net Debt to EBITDA* ratio of below 2.5x by the end of 2018, excluding the effect of any bolt-on acquisitions or licensing transactions. Shire also reiterates that its 2018 capital allocation priorities remain unchanged-investing in organic growth, reducing leverage, maintaining a progressive dividend policy, and in the event of surplus capital the consideration of selective in-licensing and bolt-on business development opportunities, as well as the consideration of share buybacks.\n* Non GAAP EBITDA consists of Operating Income from Continuing Operations less Amortization, Depreciation and certain Non GAAP adjustments. Non GAAP net debt represents cash and cash equivalents less short- and long-term borrowings, capital leases and other debt.\nLive audio webcast:\nA live audio webcast of Dr. Ornskov's J.P. Morgan Healthcare Conference presentation and the questions & answers session will be available on Shire's Investor website at http://investors.shire.com/presentations-and-reports today at 10:30am PST / 1:30pm EST / 6:30pm GMT. Subsequently, a replay of the webcast will be available on this same website for approximately 90 days.\nFor further information from Shire please contact:\n", "external_links": ["http://investors.shire.com/presentations-and-reports", "https://www.globenewswire.com/Tracker?data=rrDpLhvcZo1CFUbwX39ov9fecymDzwivh5STAIZf9OzCN0rTb99TO8EA8c27uv-pv1q1yMvetKgx6_0WyVj4jprttPT4EBh1FYm-wdfE0rvFhikhis4PEoDEsWsO94OltT71E-fpeE8A0_ceWgwn9sUiHu0nUYciN0LE0ycYhFI=", "https://www.globenewswire.com/Tracker?data=VwcrudQg99I6C40hLJt3Xv1-08bDx_cCZ4diAszEXrso0KZZSUIV6BkXVpXuw04LKjk-QE8jg4BcBgFZ1GSpew=="], "published": "2018-01-08T17:31:00.000+02:00", "crawled": "2018-01-08T18:53:07.012+02:00", "highlightTitle": ""}