{"organizations": [], "uuid": "69c3b2dabff9d2b3af64e0c09cef5d22f15f45ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-parsley-energy-provides-operational-update-highlights-successful-wolfcamp-c-results.html", "country": "US", "domain_rank": 767, "title": "Parsley Energy Provides Operational Update; Highlights Successful Wolfcamp C Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-30T00:15:00.000+02:00", "replies_count": 0, "uuid": "69c3b2dabff9d2b3af64e0c09cef5d22f15f45ba"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-parsley-energy-provides-operational-update-highlights-successful-wolfcamp-c-results.html", "ord_in_thread": 0, "title": "Parsley Energy Provides Operational Update; Highlights Successful Wolfcamp C Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas, Jan. 29, 2018 /PRNewswire/ -- Parsley Energy, Inc. (NYSE: PE) (\"Parsley,\" \"Parsley Energy,\" or the \"Company\") today provided an operational update that discloses certain full-year 2017 results and highlights strong indications from the Company's Wolfcamp C delineation program.\nFourth Quarter and Full-Year 2017 Results\nParsley expects to report full-year 2017 net production of approximately 68 MBoe per day, up 78% relative to full-year 2016 net production, concluding a year of robust and efficient production growth. The Company expects to report analogous growth in 2017 net oil production, up 75% versus 2016 net oil production to approximately 45 MBo per day. Full-year expected production is based on anticipated 4Q17 net production of 80-81 MBoe per day and 51-52 MBo per day.\nIn line with stated plans, Parsley completed 41 wells in the fourth quarter of 2017. The Company expects to report fourth quarter capital expenditures of approximately $410-420 million, translating to full-year 2017 capital expenditures of approximately $1.2 billion. Fourth quarter development spending increased relative to third quarter spending, driven by more completions, longer laterals, and material quarter-over-quarter increases in facilities and infrastructure spending and non-operated development.\n2018 Capital Program Update\nParsley continues to expect best-in-class volume growth in 2018, albeit from a lower than anticipated starting point, impeded by the impact of freezing weather at the beginning of the year, and accounting for the recent divestiture of non-operated properties with approximately 600 Boe per day of associated production. Accordingly, Parsley now expects average net oil production of 65-70 MBo per day in 2018, representing year-over-year growth of 50% at the midpoint. The Company expects corresponding total production volumes of 98-108 MBoe per day in 2018.\nNotwithstanding the recent increase in oil prices, Parsley continues to expect to place approximately 40 gross horizontal wells on production per quarter during 2018. While sustained oil price strength would bias expectations toward the higher end of the previously issued guidance for 2018 capital expenditures of $1.35-1.55 billion given the likelihood of service and equipment cost inflation, the Company expects that it would be accompanied by a disproportionate increase in cash flow generation on a steady development pace.\nPositive Wolfcamp C Results\nParsley placed several Wolfcamp C wells on production during 2017, marking an important delineation success for the Company. These five wells have registered strong peak 30-day production rates, averaging 198 Boe (122 Bo) per day per thousand lateral feet. In addition, the Char Hughes 28-2-4803H, turned to production two weeks ago with a lateral length of approximately 11,000 feet in central Reagan County, achieved a peak 24-hour production rate of more than 1,000 Bo per day, extending the areal delineation of the Wolfcamp C target to the southeast corner of Parsley's Midland Basin acreage.\nDivestiture of Non-Operated Properties\nAs part of an ongoing initiative to high-grade the Company's acreage portfolio, Parsley recently closed the divestiture of a portion of its non-operated properties. In aggregate, the Company divested approximately 10,000 net (63,000 gross) acres in Martin, Howard, Reagan, Irion, Dawson, and Pecos Counties for approximately $57 million.\n\"By any measurement 2017 was a transformational year for Parsley Energy, with a substantial resource discovery, sizable acquisitions, a peer-leading activity ramp, and compelling volume growth through which we are benefitting disproportionately from higher oil prices,\" said Bryan Sheffield, Parsley's Chairman and CEO. \"Our focus now turns to a simplified 2018 development program that applies 2017 delineation and testing results and will increasingly be characterized by more familiar areas, proven configurations, and calibrated designs as we move through the year. With our ambitious activity ramp and delineation agenda behind us, Parsley Energy remains positioned to deliver superior corporate returns and debt-adjusted production growth as we develop our premier acreage portfolio from a position of financial strength, including ample liquidity and a substantial hedge position.\"\nFourth Quarter 2017 Earnings Conference Call\nAs previously announced, on February 22nd the Company will host a conference call to discuss 4Q17 and full-year 2017 results and 2018 capital plans.\nAbout Parsley Energy, Inc.\nParsley Energy, Inc. is an independent oil and natural gas company focused on the acquisition and development of unconventional oil and natural gas reserves in the Permian Basin in West Texas. For more information, visit the Company's website at www.parsleyenergy.com .\nForward Looking Statements\nCertain statements contained in this news release constitute \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. In particular, the fourth quarter and full-year 2017 results presented in this news release are preliminary estimates derived from Parsley Energy's internal records and are based on the most current information available to management. Parsley Energy's normal reporting processes with respect to such preliminary results have not been fully completed and, during the course of its review process on these preliminary estimates, Parsley Energy could identify items that would require it to make material adjustments and which could affect its final results. These forward-looking statements represent Parsley Energy's expectations or beliefs concerning future events, and it is possible that the results described in this news release will not be achieved. These forward-looking statements are subject to risks, uncertainties and other factors, many of which are outside of Parsley Energy's control, which could cause actual results to differ materially from the results discussed in the forward-looking statements. Any forward-looking statement speaks only as of the date on which it is made, and, except as required by law, Parsley Energy does not undertake any obligation to update or revise any forward-looking statement, whether as a result of new information, future events or otherwise. New factors emerge from time to time, and it is not possible for Parsley Energy to predict all such factors. When considering these forward-looking statements, you should keep in mind the risk factors and other cautionary statements found in the Company's filings with the SEC, including its Annual Report on Form 10-K. The risk factors and other factors noted in the Company's SEC filings could cause its actual results to differ materially from those contained in any forward-looking statement.\nView original content with multimedia: http://www.prnewswire.com/news-releases/parsley-energy-provides-operational-update-highlights-successful-wolfcamp-c-results-300589689.html\nSOURCE Parsley Energy, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/parsley-energy-provides-operational-update-highlights-successful-wolfcamp-c-results-300589689.html", "http://www.parsleyenergy.com/"], "published": "2018-01-30T00:15:00.000+02:00", "crawled": "2018-01-30T04:47:11.000+02:00", "highlightTitle": ""}