{"organizations": [], "uuid": "257c4ef186a6d0cfbfef64a9792bfa5cd48fb069", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-amazon-com-slavery/amazon-pulls-kids-clothes-bearing-slavery-gets-shit-done-slogan-idUSKBN1FB1OW", "country": "US", "domain_rank": 408, "title": "Amazon pulls kids clothes bearing 'Slavery gets shit done' slogan", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.117, "site_type": "news", "published": "2018-01-22T21:22:00.000+02:00", "replies_count": 0, "uuid": "257c4ef186a6d0cfbfef64a9792bfa5cd48fb069"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-amazon-com-slavery/amazon-pulls-kids-clothes-bearing-slavery-gets-shit-done-slogan-idUSKBN1FB1OW", "ord_in_thread": 0, "title": "Amazon pulls kids clothes bearing 'Slavery gets shit done' slogan", "locations": [], "entities": {"persons": [], "locations": [{"name": "london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "neutral"}, {"name": "thomson reuters foundation", "sentiment": "neutral"}, {"name": "amazon.com", "sentiment": "none"}, {"name": "asi", "sentiment": "none"}, {"name": "jakub sobik of asi", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "amazon.com inc", "sentiment": "none"}, {"name": "international justice mission", "sentiment": "none"}, {"name": "ijm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Thomson Reuters Foundation) - Children’s clothes bearing the slogan ‘Slavery gets shit done’ have been pulled from sale by online retail giant Amazon.com Inc after criticism from shoppers and anti-slavery groups.\nA range of products featuring the slogan, from mugs and bags to T-shirts modeled by young children, were listed by third-party sellers and have been removed from sale, Amazon said.\n“All Marketplace sellers must follow our selling guidelines and those who don’t will be subject to action including potential removal of their account,” an Amazon spokesman said in a statement. “The products in question are no longer available.”\nWhile the slavery-themed products are no longer available to buy on Amazon’s UK website, bags bearing the slogan were still on sale on the U.S.-based Amazon.com on Monday.\nThe sale of such items by a major retailer trivializes the global drive to end modern slavery, said charities Anti-Slavery International (ASI) and International Justice Mission (IJM) UK.\n“If it is meant to be funny, it fails miserably,” Jakub Sobik of ASI told the Thomson Reuters Foundation by phone.\nMore than 40 million people were living as modern slaves last year - either trapped in forced labor or forced marriages - according to the United Nations International Labour Organization (ILO) and human rights group Walk Free Foundation.\n“Children the same age as those modeling the T-shirts will be forced to work long hours for no pay in desperate conditions where starvation, beatings and sleep deprivation are common,” said David Westlake, chief executive of IJM UK.\n“Rather than trivializing slavery, companies and the global community must recognize the vast injustice of modern slavery and work together to end it for good,” he added.\nThe imagery linked to slavery, and the issues it raises over history and identity, has stirred increasing debate with deep division over the fate of slavery-era statues in the United States, and worldwide outrage about slogans and pictures used by big brands.\nBritish supermarket Waitrose this month pulled a brand of coffee off its shelves after shoppers noticed the packaging featured images of 19th-century slaves working on plantations.\nReporting By Kieran Guilbert, Editing by Ros Russell; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T21:22:00.000+02:00", "crawled": "2018-01-23T17:53:33.024+02:00", "highlightTitle": ""}