{"organizations": [], "uuid": "9325742f8be3c9adb2b88a4246368ca5936ee26d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/business-wire-gamco-expects-to-report-fourth-quarter-earnings-of-0-point-44-to-0-point-46-per-fully-diluted-share.html", "country": "US", "domain_rank": 767, "title": "GAMCO Expects to Report Fourth Quarter Earnings of $0.44 to $0.46 Per Fully Diluted Share", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T19:06:00.000+02:00", "replies_count": 0, "uuid": "9325742f8be3c9adb2b88a4246368ca5936ee26d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/business-wire-gamco-expects-to-report-fourth-quarter-earnings-of-0-point-44-to-0-point-46-per-fully-diluted-share.html", "ord_in_thread": 0, "title": "GAMCO Expects to Report Fourth Quarter Earnings of $0.44 to $0.46 Per Fully Diluted Share", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.y.", "sentiment": "none"}], "organizations": [{"name": "gamco", "sentiment": "negative"}, {"name": "gamco investors, inc.", "sentiment": "none"}, {"name": "gbl", "sentiment": "none"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Includes $8.2 million, or $0.27 per diluted share, charge for the Tax Cuts and Jobs Act\nRYE, N.Y.--(BUSINESS WIRE)-- GAMCO Investors, Inc. (“GAMCO”) (NYSE:GBL) announced today that it expects to report fourth quarter earnings of between $0.44 to $0.46 per fully diluted share. This fourth quarter range reflects the estimated impact of the Tax Cuts and Jobs Act (“the Act”) on GAMCO’s results. The Company’s net deferred tax assets are expected to be reduced by $8.2 million, or $0.27 per diluted share, from the Act’s lower corporate tax rate.\nThe Company’s preliminary estimate, given no material changes in the business, of its 2018 effective tax rate is between 33% and 36% reflecting the estimated impact of the Act. The lower Federal tax rate benefit of the Act will likely be muted by the Act’s change to named executive officer compensation deductibility which removes the performance based compensation exception.\nAssets under Management were $43.1 billion at December 31, 2017, up 7.8% from $40.0 billion at December 31, 2016 and unchanged from the $43.1 billion at September 30, 2017.\nWe will be issuing further details on our financial results in early February.\nAbout GAMCO Investors, Inc.\nGAMCO Investors, Inc., through its subsidiaries, manages open-end funds and closed-end funds (Gabelli Funds, LLC) and private advisory accounts (GAMCO Asset Management Inc.).\nSPECIAL NOTE REGARDING FORWARD-LOOKING INFORMATION\nThe financial results set forth in this press release are preliminary. Our disclosure and analysis in this press release, which do not present historical information, contain “forward-looking statements” within the meaning of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements convey our current expectations or forecasts of future events. You can identify these statements because they do not relate strictly to historical or current facts. They use words such as “anticipate,” “estimate,” “expect,” “project,” “intend,” “plan,” “believe,” and other words and terms of similar meaning. They also appear in any discussion of future operating or financial performance. In particular, these include statements relating to future actions, future performance of our products, expenses, the outcome of any legal proceedings, and financial results. Although we believe that we are basing our expectations and beliefs on reasonable assumptions within the bounds of what we currently know about our business and operations, the economy, the effects of the Tax Cuts and Jobs Act, and other conditions, there can be no assurance that our actual results will not differ materially from what we expect or believe. Therefore, you should proceed with caution in relying on any of these forward-looking statements. They are neither statements of historical fact nor guarantees or assurances of future performance.\nForward-looking statements involve a number of known and unknown risks, uncertainties and other important factors, some of which are listed below, that are difficult to predict and could cause actual results and outcomes to differ materially from any future results or outcomes expressed or implied by such forward-looking statements. Some of the factors that could cause our actual results to differ from our expectations or beliefs include a decline in the securities markets that adversely affect our assets under management, negative performance of our products, the failure to perform as required under our investment management agreements, a general downturn in the economy that negatively impacts our operations, and the ongoing impacts of the Tax Cuts and Jobs Act with respect to tax rates and the non-deductibility of certain portions of NEO compensation. We also direct your attention to the more specific discussions of these and other risks, uncertainties and other important factors contained in our Form 10-K and other public filings. Other factors that could cause our actual results to differ may emerge from time to time, and it is not possible for us to predict all of them. We do not undertake to update publicly any forward-looking statements if we subsequently learn that we are unlikely to achieve our expectations whether as a result of new information, future developments or otherwise, except as may be required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180126005422/en/\nGAMCO Investors, Inc.\nKieran Caterina or Diane M. LaPointe\nSVPs and Co-Chief Accounting Officers\n914-921-5149 or 7763\nor\nFor further information please visit\nwww.gabelli.com\nSource: GAMCO Investors, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180126005422/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.gabelli.com&esheet=51749573&lan=en-US&anchor=www.gabelli.com&index=1&md5=53fc010ef53f8f36b6a85a8e8fc977f5"], "published": "2018-01-26T19:06:00.000+02:00", "crawled": "2018-01-26T20:03:24.012+02:00", "highlightTitle": ""}