{"organizations": [], "uuid": "103a71219e0011516ea40a7e554790f792b63224", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-ritchie-bros-acquires-collector-car-auctioneer-leake-auction-company.html", "country": "US", "domain_rank": 767, "title": "Ritchie Bros. acquires collector car auctioneer Leake Auction Company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.079, "site_type": "news", "published": "2018-01-16T15:00:00.000+02:00", "replies_count": 0, "uuid": "103a71219e0011516ea40a7e554790f792b63224"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-ritchie-bros-acquires-collector-car-auctioneer-leake-auction-company.html", "ord_in_thread": 0, "title": "Ritchie Bros. acquires collector car auctioneer Leake Auction Company", "locations": [], "entities": {"persons": [{"name": "ritchie", "sentiment": "negative"}, {"name": "greg owens", "sentiment": "none"}, {"name": "nancy sevenoaks", "sentiment": "none"}, {"name": "richard", "sentiment": "none"}], "locations": [{"name": "vancouver", "sentiment": "none"}], "organizations": [{"name": "leake auction company", "sentiment": "negative"}, {"name": "new sectors & ventures", "sentiment": "none"}, {"name": "ritchie bros.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Oklahoma-based collector car auction company has been in business since 1972\nVANCOUVER, Jan. 16, 2018 /PRNewswire/ - Today, Ritchie Bros. announces the acquisition of Leake Auction Company, an Oklahoma-based collector car auctioneer, established in 1972.\n\"Ritchie Bros. continues to expand and bring its professional auctions to other sectors and asset categories,\" said Greg Owens, Group President (New Sectors & Ventures), Ritchie Bros. \"Ritchie Bros. has had success selling collector cars through its live unreserved auctions for years—we know there is significant customer overlap between our industry and the collector car auction sector. The acquisition of Leake Auction Company, which has been utilizing IronPlanet's online bidding software for two years, seems like a natural area for us. We believe this will help us deepen brand loyalty with our customer base and introduce our auction expertise to a whole new sector and group of customers.\"\nThe Leake Auction Company is family owned and operated—all employees at the company, including Richard and Nancy Sevenoaks, will be retained as part of the acquisition and handle day-to-day operations going forward. Leake currently conducts auctions primarily in the Oklahoma and Texas regions, with bidding available in person, by phone and increasingly online.\n\"We are thrilled to be a part of the Ritchie Bros. organization,\" said Richard Sevenoaks, President of Leake Auction Company. \"We know they operate with the highest level of integrity and professionalism. With their expertise in auctions and geographic reach they can help us significantly grow this business.\"\nAlso joining the Ritchie Bros./Leake team is Muffy Bennett, former Barrett-Jackson Division Manager and CEO of Bennett Automotive Specialists.\n\"Muffy brings a wealth of industry experience and contacts to our company in this sector,\" said Greg Owens. \"Along with the Leake team, she shares our same passion for customer service, consistency and integrity. With Ritchie Bros. and Leake working together, customers can expect unparalleled service and commitment.\"\nThe next Leake Auction event is scheduled for February 23 – 24 in Oklahoma City, OK—for more information about the auction, visit LeakeCar.com .\nAbout Ritchie Bros.:\nEstablished in 1958, Ritchie Bros. (NYSE and TSX: RBA) is a global asset management and disposition company, offering customers end-to-end solutions for buying and selling used heavy equipment, trucks and other assets. Operating in a multitude of sectors, including construction, transportation, agriculture, energy, oil and gas, mining, and forestry, the company's selling channels include: Ritchie Bros. Auctioneers , the world's largest industrial auctioneer offers live auction events with online bidding; IronPlanet , an online marketplace with featured weekly auctions and providing its exclusive IronClad Assurance ® equipment condition certification; Marketplace e , an online marketplace offering multiple price and timing options; Mascus, a leading European online equipment listing service; and Ritchie Bros. Private Treaty , offering privately negotiated sales. The company also offers sector-specific solutions including GovPlanet , TruckPlanet, Kruse Energy Auctioneers , and Cat ® auctions, plus equipment financing and leasing through Ritchie Bros. Financial Services . For more information about the unprecedented choice provided by Ritchie Bros., visit RitchieBros.com .\nPhotos and video for embedding in media stories are available at rbauction.com/media .\nSOURCE Ritchie Bros. Auctioneers", "external_links": ["http://www.truckplanet.com/", "http://www.leakecar.com/", "http://www.ironplanet.com/", "http://www.govplanet.com/", "http://kruseenergy.com/", "https://www.mascus.com/", "https://www.ritchiebros.com/", "https://www.rbauction.com/media?utm_campaign=creat-news-web-RBA&utm_medium=PR&utm_source=news_sites", "http://www.ironplanet.com/marketplace-e", "https://www.rbauction.com/privatetreaty", "https://www.rbauction.com/", "https://www.rbauction.com/financial-services"], "published": "2018-01-16T15:00:00.000+02:00", "crawled": "2018-01-16T16:53:12.012+02:00", "highlightTitle": ""}