{"organizations": [], "uuid": "a898ac498824cb59a717e2f3dc14a4df5276656c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets/indices", "section_title": "Market Indices | Reuters.com", "url": "https://www.reuters.com/article/global-precious/precious-gold-steady-u-s-govt-shutdown-worries-investors-idUSL4N1PH1EK", "country": "US", "domain_rank": 408, "title": "PRECIOUS-Gold steady; U.S. govt shutdown worries investors", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-22T11:30:00.000+02:00", "replies_count": 0, "uuid": "a898ac498824cb59a717e2f3dc14a4df5276656c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-precious/precious-gold-steady-u-s-govt-shutdown-worries-investors-idUSL4N1PH1EK", "ord_in_thread": 0, "title": "PRECIOUS-Gold steady; U.S. govt shutdown worries investors", "locations": [], "entities": {"persons": [{"name": "sethuraman n r jan", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "u.s. senate", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Platinum hits highest since early September * SPDR Gold holdings rose over 2 percent last week (Updates prices, adds details) By Maytaal Angel LONDON, Jan 22 (Reuters) - Gold steadied on Monday as the dollar wallowed near three-year lows following a U.S. government shutdown, although bullishness in the wider financial markets capped the precious metal's gains. Platinum hit another four-month high, narrowing the price gap to sister metal palladium to below $100 per ounce. Global stock markets shrugged off the shutdown in Washington, with investors seemingly confident the conflict between President Donald Trump and the Democrats can be resolved swiftly. \"We did see gold reach four-month highs last week on fears an agreement wouldn't be reached. The fact that gold is a bit soft ... suggests it was largely in the price,\" said Mitsubishi analyst Jonathan Butler. He also noted that equities continue to \"defy gravity\", denting the appeal of gold as a safe haven. \"Gold is supported at $1,330 for now. We could go a bit higher as this (U.S.) brinkmanship gets extended ... but overall we may have seen the high watermark of the gold price in relation to the U.S. government shutdown issue.\" Spot gold edged up 0.1 percent to $1,332.63 an ounce by 1509 GMT. The precious metal fell 0.5 percent last week, its first weekly decline in six weeks, having hit four-month highs last Monday. U.S. gold futures were down 0.1 percent at $1,332.30. Platinum rose 0.3 percent to $1,015.60 an ounce, after touching its highest since Sept. 8 at $1,018.80, while palladium fell 1 percent to $1,093.60 an ounce. \"Recent implementation of more stringent emissions standards in China is expected to boost demand for (platinum),\" SP Angel said in a note. \"Stockpiles in warehouses tracked by the New York Mercantile Exchange have shrunk to their lowest since 2016. With 70 percent of global supply sourced in South Africa, improving rand-dollar exchange is raising the relative cost of producing the metal,\" it added. The U.S. Senate is set to vote at 12 p.m. (1700 GMT) on advancing a measure to provide temporary government funding through Feb. 8. U.S. Treasury yields rose as investors saw limited economic fallout from the standoff in Washington and instead focused on a global economy motoring ahead. Rising yields tend to weigh on gold by increasing the opportunity cost of holding non-yielding bullion. Holdings of SPDR Gold Trust , the world's largest gold-backed exchange-traded fund, rose over 2 percent last week, their best week since the week ended Sept. 3. Silver was down 0.1 percent at $16.99 an ounce. (Additional reporting by Nallur Sethuraman in Bengaluru; Editing by Dale Hudson)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T11:30:00.000+02:00", "crawled": "2018-01-22T06:01:32.009+02:00", "highlightTitle": ""}