{"organizations": [], "uuid": "2aa2b3967314de5b5df82a18cc767dd19e1bdc56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-shutdown-terrible-say-gop-dems-but-both-threatened-it.html", "country": "US", "domain_rank": 767, "title": "Shutdown? Terrible, say GOP, Dems. But both threatened it", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T08:29:00.000+02:00", "replies_count": 0, "uuid": "2aa2b3967314de5b5df82a18cc767dd19e1bdc56"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-shutdown-terrible-say-gop-dems-but-both-threatened-it.html", "ord_in_thread": 0, "title": "Shutdown? Terrible, say GOP, Dems. But both threatened it", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "gop", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — Threatening to shutter the federal government unless demands are met — who would do that?\nMembers of both parties, it turns out. And both sides have complained loudly when the other resorted to a shutdown threat.\nSome of the same Republicans who claim to abhor the bare-knuckle tactic now playing out in Washington have used it themselves. And some of the Democrats who refused to vote Thursday for federal funding without an immigration deal have decried such hostage-taking in the not-so-distant past.\nHere's a look at some past budget standoffs and politicians' shifting outrage over using shutdown threats as a negotiating tactic.\nPresident Donald Trump in May griped via Twitter that Congress' negotiating process was frustrating his drive to enact his agenda. Looming ahead was the budget fight.\n\"Our country needs a good 'shutdown' in September to fix mess!\" he tweeted.\nOn Thursday, Trump appeared to feel differently about the impact of a government shutdown.\n\"A government shutdown will be devastating to our military ... something the Dems care very little about!\" he tweeted.\nAs an Indiana congressman in the wake of the GOP's House takeover in 2011, then-Rep. Mike Pence, now Trump's vice president, said he would be willing to shut the government down over reducing government spending and over his amendment to defund Planned Parenthood. In either case, he said, a government shutdown would be the Democrats' fault.\n\"If liberals in the Senate would rather play political games and shut down the government instead of making a small down payment on fiscal discipline and reform, I say: Shut it down,\" he said at a March 31, 2011, rally as Tea Partyers around him shouted, \"Cut it or shut it!\"\nAsked a few days later whether he'd be willing to close the government if he didn't get his amendment to defund Planned Parenthood, Pence replied, \"Of course I would.\"\nIn 2013, Republican Sen. Ted Cruz, contemplating a run for president, vowed to speak on the Senate floor against President Barack Obama's health care law until he was \"no longer able to stand.\" Cruz's move forced a 16-day government shutdown. Democratic leaders criticized his strategy.\n\"I join the American people in their disgust at what happened in terms of the shutdown of government,\" Democratic House Leader Nancy Pelosi, D-Calif., said on ABC's \"This Week.\" ''It's an unthinkable tactic to use in the political debate.\"\nEarlier that same year, Sen. Chuck Schumer, D- N.Y., called Rep. Mark Meadows of North Carolina and other House conservatives \"fanatics.\"\n\"No matter how strongly one feels about an issue, you shouldn't hold millions of people hostage. That's what the other side is doing. That's wrong and we can't give in to that,\" he said in The New York Observer.\nA few days later, on ABC's \"This Week,\" Schumer said the technique produces negotiations held \"with a gun held to your head. And you just can't do it.\"\n\"Someone goes into your house, takes your wife and children hostage and then says, let's negotiate over the price of your house. You know, we could do the same thing on immigration. We believe strongly in immigration reform. We could say, 'we're shutting down the government, we're not gonna raise the debt ceiling, until you pass immigration reform.' It would be governmental chaos,\" he said.\nAhead of a 2013 shutdown, Meadows argued that the founding fathers intended for government funding to be leverage in policy debate. Meadows urged Republicans to use the budget to try to repeal the Obama-era health care law. In a leader to GOP leaders, he quoted James Madison from Federalist No. 58: \"The power over the purse may, in fact, be regarded as the most complete and effectual weapon ... for obtaining a redress of every grievance.\"\nIn 2018, he was the leader of the House Freedom Caucus, demanding more military spending and a promise from GOP leaders for a House vote on an immigration bill that's far more restrictive than bipartisan measures that have emerged in Congress.\n\"I don't get squeezed. I squeeze others,\" he said.\nFollow Kellman on Twitter at http://www.twitter.com/APLaurieKellman", "external_links": [], "published": "2018-01-19T08:29:00.000+02:00", "crawled": "2018-01-19T09:50:04.057+02:00", "highlightTitle": ""}