{"organizations": [], "uuid": "909636cb490cc6114ffb6871897fd012eb395c17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222664859&w=1200&r=LYNXMPEE0G0FF", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-spain-politics-catalonia/future-of-catalonia-unclear-as-its-parliament-meets-for-first-time-since-election-idUKKBN1F60TB", "country": "US", "domain_rank": 408, "title": "Future of Catalonia unclear as its parliament meets for first time since election", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T10:17:00.000+02:00", "replies_count": 0, "uuid": "909636cb490cc6114ffb6871897fd012eb395c17"}, "author": "", "url": "https://uk.reuters.com/article/uk-spain-politics-catalonia/future-of-catalonia-unclear-as-its-parliament-meets-for-first-time-since-election-idUKKBN1F60TB", "ord_in_thread": 0, "title": "Future of Catalonia unclear as its parliament meets for first time since election", "locations": [], "entities": {"persons": [{"name": "carles puigdemont", "sentiment": "none"}, {"name": "sonya dowsett", "sentiment": "none"}], "locations": [{"name": "catalonia", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "barcelona", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 8:17 AM / Updated an hour ago In challenge to Madrid, Catalan assembly elects separatist speaker Luis Fernandez 4 Min Read \nBARCELONA (Reuters) - Catalonia’s parliament picked a separatist speaker on Wednesday, signalling the possible return of sacked nationalist Carles Puigdemont as the region’s leader and the renewal of full-blown political confrontation with Madrid. \nThe new regional assembly was meeting for the first time, and the decision to appoint Roger Torrent shattered the fragile calm that has characterised relations with central government since it was elected in December. \n“The will of the Catalan people is to have President Puigdemont back” as head of government, pro-independence lawmaker Elsa Artadi told Reuters after the legislature - where secessionists hold a slim majority - picked Torrent as speaker. \nPuigdemont is in self-imposed exile in Belgium, where he fled in October to avoid arrest and the threat of jail after Spanish Prime Minister Mariano Rajoy fired him from the same job for leading Catalonia’s independence bid. \nA first vote to choose a new leader is likely on Jan. 31, and Catalonia’s two main pro-independence parties reaffirmed late on Tuesday they would back Puigdemont. \nRajoy said he would not allow him to be reappointed - and rule - from Brussels. But in a possible sign of how such an arrangement might work, Puigdemont’s party posted a photo of a smiling Torrent speaking on a mobile in parliament, with a caption saying it was taken as the ex-leader congratulated him on his appointment. \n“I am sure you will exercise the post with nobility and bravery, protecting institutions and the country,” Puigdemont told Torrent in a Tweet. LEADERSHIP BY SKYPE? \nTriggering one of Spain’s biggest political crises since its return to democracy four decades ago, the previous Puigdemont-led Catalan administration made a unilateral declaration of independence in October following an illegal referendum. \nThe government in Madrid then imposed direct rule on the region and called elections there. \nRajoy on Monday dismissed the possibility of long-distance rule by Puigdemont as absurd and said Madrid would stay in charge of Catalonia if the ex-leader tried to govern from abroad. Deputies attend the start of the first session of Catalan Parliament after the regional elections in Barcelona, Spain, January 17, 2018. REUTERS/Albert Gea \nThe prime minister said he would contest in the courts any move to elect Puigdemont remotely. \nThe Catalan parliament’s own legal experts have also ruled that any president must be physically present in the assembly to be elected. \nBut pro-independence supporters remained defiant as they attached yellow ribbons to metal fences outside parliament and waved red and yellow Catalan flags. Slideshow (5 Images) \n“I know that we are going to have a lot of problems with the Spanish government but we are going to do it,” demonstrator Dolors Esplugas said. “On Jan. 31, Carles Puigdemont is going to be appointed.” \nInside parliament, the seats of lawmakers absent abroad or in jail were also marked with giant yellow ribbons. \nNot all are in sympathy, however, in a region split almost down the middle between pro and anti-separatists. \n“It is a lie to say that Catalonia will be better off if we leave Spain,” said Joaquim Quintana, a visibly angry 62-year old Barcelona resident. Related Coverage Factbox: What's next for Catalonia and would-be leader Puigdemont? \nThe decision on whether Puigdemont can be elected region president while being in Brussels lies in the hands of the Catalan parliamentary committee, which was voted in on Wednesday with a majority for the secessionists with four of seven members. \nThat happened despite the secession movement, which won a slim majority in December elections, being weakened by the fact that of its five lawmakers are in Brussels while three are in custody for their role in the independence referendum. \nThe Catalan crisis has led to thousands of companies, including two of the country’s top banks, moving their headquarters from Catalonia to elsewhere in Spain. \nPuigdemont’s former spokesman told Catalunya Radio that he wanted to come back to be sworn in as president “but everything has to be taken into account.” Additional reporting by Inmaculada Sanz; Writing by Sonya Dowsett and Ingrid Melander; Editing by Julien Toyer and John Stonestreet", "external_links": [], "published": "2018-01-17T10:17:00.000+02:00", "crawled": "2018-01-17T10:46:05.006+02:00", "highlightTitle": ""}