{"organizations": [], "uuid": "5e972aa5692fc56d80c79120e41b5fc08c203012", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223634163&w=1200&r=LYNXMPEE0J0CZ", "site_section": "http://feeds.feedburner.com/Reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-eu-macron/britain-able-to-have-bespoke-deal-with-eu-macron-idUKKBN1F90H1", "country": "US", "domain_rank": 408, "title": "Britain able to have bespoke deal with EU - Macron", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T16:37:00.000+02:00", "replies_count": 0, "uuid": "5e972aa5692fc56d80c79120e41b5fc08c203012"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-eu-macron/britain-able-to-have-bespoke-deal-with-eu-macron-idUKKBN1F90H1", "ord_in_thread": 0, "title": "Britain able to have bespoke deal with EU - Macron", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "macron", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "neutral"}, {"name": "eu - mac", "sentiment": "neutral"}, {"name": "bbc", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 20, 2018 / 11:48 AM / Updated an hour ago Britain able to have bespoke deal with EU - Macron Reuters Staff 3 Min Read \nLONDON (Reuters) - French President Emmanuel Macron said on Saturday Britain would be able to have a bespoke deal with the European Union after Brexit, one of Prime Minister Theresa May’s objectives. \nBut in an interview with the BBC, Macron said London’s financial centre could not enjoy the same level of access to the EU under May’s current Brexit plan, which envisages Britain leaving the EU’s single market and customs union. \nMacron has said in the past Britain could have pacts with the EU along the lines of those with Canada or Norway but not its own, special deal. \nBut asked in the interview whether that was fair, given how long Britain had been part of the EU, Macron said: “No, it’s not a question to be fair or unfair. I take that as a reference. But for sure, you will have your own solution.” \nAsked whether there would be a bespoke, special solution for Britain, he replied: ”Sure, but you will ... I take these two references because this special way should be consistent with the preservation of the single market and our collective interests. \n“And you should understand that you cannot by definition have the full access to the single market if you don’t tick the box.” French President Emmanuel Macron reacts during a meeting with German Chancellor Angela Merkel (not pictured) at Elysee Palace in Paris, France, January 19, 2018. REUTERS/Christophe Petit Tesson/Pool \nMacron insisted Britain would not get full access to the EU’s single market without accepting its basic principles of freedom of movement and willingness to abide by EU jurisdiction. \n“As soon as you decide not to join these preconditions, it’s not full access,” he said. “So it’s something perhaps between this full access ... and a trade agreement.” French President Emmanuel Macron and German Chancellor Angela Merkel pose during their meeting at the Elysee Palace in Paris, France, January 19, 2018. REUTERS/Christophe Petit Tesson/Pool \nMacron repeated a warning he made during a visit to Britain on Thursday that full access to the EU single market for Britain’s financial services was not possible. \n“It depends on the proposals made by the UK,” he said. “But for sure, full access for financial services to the single market is not feasible, given the functioning of the single market - so by definition it’s not a full access.” \nBritain and the EU struck a divorce deal last month that paved the way for talks on future trade ties and boosted hopes of an orderly Brexit. \nThe BBC released extracts on Saturday of the Macron interview which it will broadcast in full in the Andrew Marr Show on Sunday. Reporting by Stephen Addison; Editing by Janet Lawrence", "external_links": [], "published": "2018-01-20T16:37:00.000+02:00", "crawled": "2018-01-20T17:04:57.036+02:00", "highlightTitle": ""}