{"organizations": [], "uuid": "73a420f403eccea19be9f7458815257fba84b793", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-united-community-banks-inc-announcesasubordinated-notes-offering.html", "country": "US", "domain_rank": 767, "title": "United Community Banks, Inc. Announces Subordinated Notes Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-09T18:00:00.000+02:00", "replies_count": 0, "uuid": "73a420f403eccea19be9f7458815257fba84b793"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-united-community-banks-inc-announcesasubordinated-notes-offering.html", "ord_in_thread": 0, "title": "United Community Banks, Inc. Announces Subordinated Notes Offering", "locations": [], "entities": {"persons": [{"name": "sandler o’neill", "sentiment": "none"}], "locations": [{"name": "s.c.", "sentiment": "none"}, {"name": "greenville", "sentiment": "none"}], "organizations": [{"name": "united community banks, inc.", "sentiment": "neutral"}, {"name": "united community banks, inc", "sentiment": "neutral"}, {"name": "llc", "sentiment": "none"}, {"name": "navitas credit corp.", "sentiment": "none"}, {"name": "nlfc holdings corp.", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "morgan stanley & co", "sentiment": "none"}, {"name": "united community bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GREENVILLE, S.C., Jan. 09, 2018 (GLOBE NEWSWIRE) -- United Community Banks, Inc. (NASDAQ:UCBI) (“United”), the holding company of United Community Bank, today announced its plans to issue $85,000,000 aggregate principal amount of subordinated notes due January 2028 (collectively, the “Notes”) in an underwritten public offering.\nMorgan Stanley & Co. LLC and Sandler O’Neill + Partners, L.P. are acting as joint book-running managers for the offering.\nUnited intends to use the net proceeds from this offering for the financing of the cash consideration payable by United in connection with its acquisition of NLFC Holdings Corp. and its wholly-owned subsidiary Navitas Credit Corp., and for general corporate purposes, which may include the potential repayment or redemption of trust preferred securities and other indebtedness and other acquisitions.\nThe offering is subject to market conditions, and there can be no assurance as to whether the offering will be completed, or as to the actual size or terms of the offering.\nA shelf registration statement relating to the public offering of the Notes was filed previously by United with the Securities and Exchange Commission (“SEC”) and is effective. A prospectus supplement related to the offering has been filed with the SEC and is available on the SEC’s website located at www.sec.gov . The offering may be made only by means of a prospectus and a related prospectus supplement and pricing supplement, copies of which may be obtained, when available, from Morgan Stanley & Co. LLC, by calling 1-866-718-1649.\nTHIS NEWS RELEASE DOES NOT CONSTITUTE AN OFFER TO SELL OR THE SOLICITATION OF AN OFFER TO BUY ANY SECURITIES OF UNITED, NOR SHALL THERE BE ANY SALE OF THESE SECURITIES IN ANY JURISDICTION IN WHICH SUCH AN OFFER, SOLICITATION OR SALE WOULD BE UNLAWFUL PRIOR TO REGISTRATION OR QUALIFICATION UNDER THE SECURITIES LAWS OF ANY SUCH JURISDICTION.\nAbout United Community Banks, Inc.\nUnited Community Banks, Inc. (UCBI) is a bank holding company based in Blairsville, Georgia, with $11.9 billion in assets. The company’s banking subsidiary, United Community Bank, is one of the Southeast’s largest full-service banks, operating 156 offices in Georgia, North Carolina, South Carolina and Tennessee. The bank specializes in personalized community banking services for individuals, small businesses and corporations. Services include a full range of consumer and commercial banking products including a mortgage, advisory and treasury management. Respected national research firms consistently recognize United Community Bank for outstanding customer service. For the last four years, J.D. Power has ranked United Community Bank first in customer satisfaction in the Southeast. In 2017, for the fourth consecutive year, Forbes magazine included United on its list of the 100 Best Banks in America. Additional information about the company and the bank's full range of products and services can be found at www.ucbi.com .\nCaution About Forward-Looking Statements\nCertain Statements in this press release may constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are statements that include projections, predictions, expectations, or beliefs about future events or results or otherwise and are not statements of historical fact. Such statements are often characterized by the use of qualified words (and their derivatives) such as “may,” “believe,” “expect,” “anticipate,” “intend,” “will,” “should,” “plan,” “estimate,” “predict,” “continue” and “potential” or the negative of these terms or words of similar meaning or other statements concerning opinions or judgments of United and its management about future events. Although United believes that its expectations with respect to forward-looking statements are based upon reasonable assumptions within the bounds of its existing knowledge of its business and operations, there can be no assurance that actual results, performance, or achievements of United will not differ materially from any future results, performance, or achievements expressed or implied by such forward-looking statements; such statements are not guarantees of future performance. Forward-looking statements are subject to numerous assumptions, risks and uncertainties that change over time and could cause actual results or financial condition to differ materially from those expressed in or implied by such statements. Actual future results and trends may differ materially from historical results and or those anticipated depending on a variety of factors, including, but not limited to the factors and risk influences contained in the cautionary language included under the headings “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and “Risk Factors” in United’s Form 10-K for the year ended December 31, 2016 and other periodic reports subsequently filed by United with the SEC, available on the SEC website, www.sec.gov . United does not intend to or assume any obligation to update or revise any forward-looking statements that may be made from time to time by or on behalf of United. For any forward-looking statements made in this presentation, United claims the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995.\nFor more information:\nJefferson Harralson\nChief Financial Officer\n(864) 240-6208\nJefferson_Harralson@ucbi.com\nSource:United Community Banks, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/1159dbe6-2f97-41d6-b86b-9563903eb55b"], "published": "2018-01-09T18:00:00.000+02:00", "crawled": "2018-01-09T18:52:37.012+02:00", "highlightTitle": ""}