{"organizations": [], "uuid": "a616a2338d7427448b85d948a43dc9927bb2b9cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKMotorSportsNews/", "section_title": "Reuters: Motor Sports News", "url": "https://uk.reuters.com/article/motor-f1-williams-drivers/motor-racing-williams-pin-their-hopes-on-youngest-line-up-idUKL3N1PB4PY", "country": "US", "domain_rank": 408, "title": "Motor racing-Williams pin their hopes on youngest line-up", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T20:53:00.000+02:00", "replies_count": 0, "uuid": "a616a2338d7427448b85d948a43dc9927bb2b9cc"}, "author": "", "url": "https://uk.reuters.com/article/motor-f1-williams-drivers/motor-racing-williams-pin-their-hopes-on-youngest-line-up-idUKL3N1PB4PY", "ord_in_thread": 0, "title": "Motor racing-Williams pin their hopes on youngest line-up", "locations": [], "entities": {"persons": [{"name": "lance stroll", "sentiment": "none"}, {"name": "carlos sainz", "sentiment": "none"}, {"name": "williams", "sentiment": "none"}, {"name": "sergey sirotkin", "sentiment": "none"}, {"name": "jolyon palmer", "sentiment": "none"}, {"name": "sirotkin", "sentiment": "none"}, {"name": "alan baldwin", "sentiment": "none"}, {"name": "fernando alonso", "sentiment": "none"}, {"name": "mclaren", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "motor racing-williams", "sentiment": "negative"}, {"name": "ferrari", "sentiment": "none"}, {"name": "renault", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "red bull and force india", "sentiment": "none"}, {"name": "mercedes", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 6:56 PM / Updated 19 minutes ago Motor racing-Williams pin their hopes on youngest line-up Alan Baldwin 3 Min Read \nLONDON, Jan 16 (Reuters) - Former world champions Williams have put their faith in the youngest and least experienced driver lineup on the Formula One starting grid, and it could come back and bite them. \nCanadian Lance Stroll (19) and Russian rookie Sergey Sirotkin (22), the latter announced on Tuesday, will be the rawest pairing to start a season for the team who were third overall in 2015 but have been fifth for the past two years. \nWinners of nine constructors’ and seven drivers’ crowns between 1980 and 1997, Williams finished far behind Mercedes, Ferrari, Red Bull and Force India last year and 2018 could be even tougher with McLaren and Renault likely to be on the rise. \nSirotkin was a development driver for Renault last year but was passed over in favour of Spaniard Carlos Sainz when it came to choosing a replacement for under-performing Briton Jolyon Palmer. \nUnlike McLaren, who have two times world champion Fernando Alonso and have just ditched Honda for Renault power after three dismal seasons, Williams now have no previous grand prix winners in one of their race cars. \nThey do have Robert Kubica in a reserve role but the Pole, a race winner with BMW-Sauber in 2008, also has questions to answer after a 2011 rally accident partly severed his right arm and left it with limited movement. \nHe has not raced in F1 since then. \nIf some suspect financial clout played a part in the lineup, with Sirotkin backed by Russian oligarch Boris Rotenberg while Stroll’s father is also a billionaire, the team pointed to an extensive evaluation process. \n“I‘m confident Lance and Sergey can deliver the best results for the team,” said deputy principal Claire Williams. “The Williams philosophy has always been to promote and develop young talent and Sergey fits right into that ethos.” \nThat much is true, with now-retired world champions Jacques Villeneuve, Jenson Button and Nico Rosberg all starting out with the team. \nBut a Stroll-Sirotkin pairing remains a long way from the 1980s when team mates Nigel Mansell and Nelson Piquet, two greats with no love lost between them, raced for wins. \nStroll, who last year at 18 became the youngest Formula One racer to step onto the podium in his rookie season and also the youngest to start on the front row, is now the team’s more experienced driver. \nSirotkin remains something of an unknown quantity, even if he performed strongly in testing. \n“Ultimately, Sergey impressed the team with his driving pace and talent, technical feedback and work ethic, both at the factory and trackside in Abu Dhabi,” said chief technical officer Paddy Lowe. \nThe season starts in Australia on March 25. (Reporting by Alan Baldwin, editing by Christian Radnedge)", "external_links": [], "published": "2018-01-16T20:53:00.000+02:00", "crawled": "2018-01-16T21:19:42.000+02:00", "highlightTitle": ""}