{"organizations": [], "uuid": "920a55750b0d39f43f1e2c25ea436807ac9d088b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222148690&w=1200&r=LYNXMPEE0E0WR", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-canada-rates-poll/bank-of-canada-to-start-2018-with-a-hike-despite-nafta-risks-idUSKBN1F41PD", "country": "US", "domain_rank": 408, "title": "Bank of Canada to start 2018 with a hike, despite NAFTA risks", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-15T21:34:00.000+02:00", "replies_count": 0, "uuid": "920a55750b0d39f43f1e2c25ea436807ac9d088b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-canada-rates-poll/bank-of-canada-to-start-2018-with-a-hike-despite-nafta-risks-idUSKBN1F41PD", "ord_in_thread": 0, "title": "Bank of Canada to start 2018 with a hike, despite NAFTA risks", "locations": [], "entities": {"persons": [{"name": "stephen poloz", "sentiment": "none"}, {"name": "brian depratto", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "nafta", "sentiment": "negative"}, {"name": "bank of canada", "sentiment": "negative"}, {"name": "boc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OTTAWA/BENGALURU (Reuters) - The Bank of Canada will kick off 2018 by hiking interest rates, buoyed by robust job growth, even as uncertainty around the fate of the North American Free Trade Agreement lingers, a Reuters poll found.\nAnalysts expect the BoC to raise rates three times this year, starting on Wednesday with a 25 basis point increase that will take the benchmark borrowing cost to 1.25 percent.\nThe central bank raised rates twice back-to-back last year as it removed monetary stimulus it put in place in 2015 amid a collapse in the price of oil, a major export for Canada.\nBank of Canada Governor Stephen Poloz said last month he is increasingly confident the economy will need less stimulus over time, even as he reiterated labor market slack poses a downside risk.\nDecember’s unexpectedly large increase in jobs, as well as a survey showing Canadian companies remain optimistic about future sales are both likely to be factors in the central bank’s decision to hike this week, said Brian DePratto, senior economist at TD.\n“The ongoing strength in the Canadian economy no longer justifies emergency level interest rates.”\nExpectations of a January rate hike were initially dampened by a Reuters report last week that Canada is increasingly convinced President Donald Trump will soon announce the United States intends to pull out of NAFTA.\nGiven Canada sends over three quarters of exports south of the border, its economy could be hit if Washington scraps the trade agreement which Trump has repeatedly blamed for American job losses and big trade deficits for his country.\nBut market odds of a hike have bounced back up to 77 percent while the poll gave a median 70 percent chance of an increase. BOCWATCH\nAnalysts expect the strong economic growth Canada saw in 2017 will outweigh the ongoing trade uncertainty in the near-term. The country likely posted average annual growth of 3 percent last year, outperforming even the most optimistic forecasts at the start of 2017.\nStill, eight of 31 analysts polled said they expect the Bank to hold rates steady on Wednesday as it waits for inflation to pick up and to see how the next round of NAFTA negotiations later this month proceed.\n“Although the data recently has pointed to a stronger labor market... there are no indications that inflation is about to take off. More importantly, the downside risks to the economy have amplified,” said Jean-Paul Lam, professor of economics at University of Waterloo.\nBut waiting too long to raise rates could also stoke imbalances in Canada’s economy fueled in large part by a hot housing market and the growing indebtedness of Canadians.\nThe household debt-to-income ratio stood at 171.1 percent in the third quarter last year.\nThe median forecast in the Reuters poll is for one rate increase apiece in the third and fourth quarters, bringing the benchmark to 1.75 percent by the end of 2018. Analysts predict another hike in the first quarter of 2019.\nEconomic growth is expected to average 2.2 percent this year, slightly higher than the 2.1 percent forecast in the previous poll in October. Expectations for 2019 were unchanged at 1.8 percent.\nMeanwhile, the unemployment rate is expected to remain below 6 percent following blockbuster gains the labor market made last year.\nAlthough domestic inflation is expected to average 1.9 percent this year, slightly below the Bank of Canada’s 2 percent target, some analysts said it was more likely the global economy would gather momentum this year and push world-wide inflation higher than currently anticipated.\nPolling and analysis by Anu Bararia\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T21:34:00.000+02:00", "crawled": "2018-01-15T16:49:26.041+02:00", "highlightTitle": ""}