{"organizations": [], "uuid": "e3431b9ed1cae63e31b37c91db2850b1c317800c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-iran-english/iran-bans-english-in-primary-schools-after-leaders-warning-idUKKBN1EW0L2", "country": "US", "domain_rank": 408, "title": "Iran bans English in primary schools after leader's warning", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T16:29:00.000+02:00", "replies_count": 0, "uuid": "e3431b9ed1cae63e31b37c91db2850b1c317800c"}, "author": "", "url": "https://uk.reuters.com/article/uk-iran-english/iran-bans-english-in-primary-schools-after-leaders-warning-idUKKBN1EW0L2", "ord_in_thread": 0, "title": "Iran bans English in primary schools after leader's warning", "locations": [], "entities": {"persons": [{"name": "mehdi navid-adham", "sentiment": "none"}, {"name": "john stonestreet", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}], "organizations": [{"name": "high education council", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 2:32 PM / Updated 14 minutes ago Iran bans English in primary schools after leaders' warning Reuters Staff 3 Min Read \nDUBAI (Reuters) - Iran has banned the teaching of English in primary schools, a senior education official said, after Islamic leaders warned that early learning of the language opened the way to a Western “cultural invasion”. \n“Teaching English in government and non-government primary schools in the official curriculum is against laws and regulations,” Mehdi Navid-Adham, head of the state-run High Education Council, told state television late on Saturday. \n“This is because the assumption is that, in primary education, the groundwork for the Iranian culture of the students is laid,” Navid-Adham said, adding that non-curriculum English classes may also be blocked. \nThe teaching of English usually starts in middle school in Iran, around the ages of 12 to 14, but some primary schools, below that age, also have English classes. \nSome children also attend private language institutes after their school day. And many children from more privileged families attending non-government schools receive English tuition from daycare through high school. \nIran’s Islamic leaders have often warned about the dangers of a “cultural invasion”, and Supreme Leader Ayatollah Ali Khamenei voiced outrage in 2016 over the “teaching of the English language spreading to nursery schools”. \nKhamenei, who has the final say in all state matters, said in that speech to teachers: “That does not mean opposition to learning a foreign language, but (this is the) promotion of a foreign culture in the country and among children, young adults and youths.” \n“Western thinkers have time and again said that instead of colonialist expansionism ... the best and the least costly way would have been inculcation of thought and culture to the younger generation of countries,” Khamenei said, according to the text of the speech posted on a website run by his office (Leader.ir). \nWhile there was no mention of the announcement being linked to more than a week of protests against the clerical establishment and government, Iran’s Revolutionary Guards have said that that unrest was also fomented by foreign enemies. \nIranian officials said 22 people were killed and more than 1,000 arrested during the protests that spread to more than 80 cities and rural towns, as thousands of young and working-class Iranians expressed their anger at graft, unemployment and a deepening gap between rich and poor. \nA video of the announcement of the ban was widely circulated on social media on Sunday, with Iranians calling it “The filtering of English”, jokingly likening to the blocking of the popular app Telegram by the government during the unrest. Reporting by Dubai newsroom; Editing by John Stonestreet and Alison Williams", "external_links": [], "published": "2018-01-07T16:29:00.000+02:00", "crawled": "2018-01-07T17:02:47.007+02:00", "highlightTitle": ""}