{"organizations": [], "uuid": "708e0088a76bcc4d11ba98371ccb01593c11502d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224066026&w=1200&r=LYNXMPEE0L0EW", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-ynap-m-a-cmpne-financiere/richemont-offers-to-buy-yoox-net-a-porter-shares-for-38-euros-each-idUSKBN1FB0K9", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Richemont offers 2.8 bln euros to buy Yoox Net-A-Porter", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T09:33:00.000+02:00", "replies_count": 0, "uuid": "708e0088a76bcc4d11ba98371ccb01593c11502d"}, "author": "", "url": "https://www.reuters.com/article/us-ynap-m-a-cmpne-financiere/richemont-offers-to-buy-yoox-net-a-porter-shares-for-38-euros-each-idUSKBN1FB0K9", "ord_in_thread": 0, "title": "UPDATE 1-Richemont offers 2.8 bln euros to buy Yoox Net-A-Porter", "locations": [], "entities": {"persons": [{"name": "johann rupert", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}, {"name": "zurich", "sentiment": "none"}], "organizations": [{"name": "richemont", "sentiment": "negative"}, {"name": "yoox net-a-porter", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "net-a-porter", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ynap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ZURICH (Reuters) - Cartier owner Richemont ( CFR.S ) on Monday offered up to 2.8 billion euros ($3.4 billion) for full control of Yoox Net-a-Porter (YNAP) ( YNAP.MI ) to compete better in an expanding online market for luxury goods.\nRichemont, which like many rivals in the watch industry and high fashion world has been slow to move into selling online, offered 38 euros per share for YNAP, an almost 26 percent premium to the e-commerce portal’s closing price on Friday.\nThe terms of the deal value YNAP as a whole at 5.3 billion euros, YNAP CEO Federico Marchetti said.\nIn 2015, the all-share merger that combined Yoox with Richemont’s then wholly owned Net-a-Porter had valued the group at about 3 billion euros, according to Exane analyst Luca Solca.\nRichemont said it would invest in expanding YNAP. The deal also gives it a way to further develop web sales for its own brands, which also include pen and accessories maker Montblanc and watchmaker Baume & Mercier.\nThe Swiss company -- which owns 49 percent of YNAP but only 25 percent of voting rights -- already sold some of its brands such as clothing label Chloe on the site.\nThe platform planned to do more in jewelry and high-end watches after the Richemont takeover, a source close to YNAP said.\nTop labels had long been wary that e-commerce could erode the value of brands, but an increasingly important younger and tech-savvy clientele - so-called millennials -- now make up about a third of the luxury market. Thriving online sales in China have pushed many to belatedly shift on to the internet.\nShares in YNAP were up nearly 25 percent by 1350 GMT. Richemont stock was down 1.8 percent.\nLUXURY GROWTH Analysts expecting online transactions to rise steadily and represent a quarter of all luxury goods sales by 2025, up from 9 percent at present.\nLVMH ( LVMH.PA ), owner of Louis Vuitton, launched its own multi-brand online venture last year.\nLuxury watchmakers, once skeptical that people would pay thousands of euros to buy their products on a website, are also adapting. Last year Richemont teamed up with YNAP to sell Cartier’s Panthere watches in a temporary online pop-up store, including models worth up to 133,000 pounds ($185,000).\n“This news is yet another sign of significant long-term changes that the distribution model of the hard luxury segment, especially watches, is undergoing,” analysts at Berenberg said in a note.\nYNAP, which runs four different websites as well as online stores for brands such as Armani and Valentino, had weathered the luxury sector’s slowdown in recent years and established itself as a leader in the sector.\nBut it is faces competition from smaller groups, such as Matchesfashion or Mytheresa, as well as luxury labels that are finally developing their own sites and new players in growth markets like Asia.\nCEO SET TO STAYYNAP had recently flagged it might be open to a partnership in China to boost its presence there, where British rival Farfetch has teamed up with the second biggest e-commerce firm, JD.com and retail giants like Alibaba ( BABA.N ) are launching specialisted luxury sites.\nYNAP CEO Marchetti, expected to stay in charge after the platform is delisted from the stock exchange, said the deal would bring additional resources from the Swiss company.\n“This means investing even more in product, technology, logistics, people and marketing,” Marchetti said in a statement.\nMarchetti said in November that YNAP’s revenue growth in 2017 would come in at the lower end of its 17 to 20 percent guidance due to hiccups in the transfer of products between warehouses for one of its e-shops.\nAnalysts said drawing YNAP under Richemont’s sole control, even if it continued to be managed separately, could mean the retailer would lose independent customers.\nBut the source close to YNAP said there was no reason going in-house with Richemont should scare off third parties.\n“The firm wants to stay separate as a multi-brand website,” the source said, adding that this model already existed elsewhere, with department stores and online platforms owned by LVMH such as Le Bon Marche, Sephora and website 24 Sevres stocking products from rival labels.\nReporting by John Miller in Zurich, Giulia Segreti and Francesca Landini in Milan and Sarah White in Paris; Editing by Edmund Blair and Keith Weir\n ", "external_links": [], "published": "2018-01-22T09:33:00.000+02:00", "crawled": "2018-01-22T10:06:18.008+02:00", "highlightTitle": ""}