{"organizations": [], "uuid": "697568d0a48617fae6a1cab815ff0587cd601026", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221217907&w=1200&r=LYNXMPEE0A1O3", "site_section": "http://feeds.reuters.com/reuters/healthNews\r", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-portugal-marijuana/portuguese-doctors-back-marijuana-medicine-as-bill-enters-parliament-idUSKBN1F02MM", "country": "US", "domain_rank": 408, "title": "Portuguese doctors back marijuana medicine as bill enters parliament", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T21:09:00.000+02:00", "replies_count": 0, "uuid": "697568d0a48617fae6a1cab815ff0587cd601026"}, "author": "", "url": "https://www.reuters.com/article/us-portugal-marijuana/portuguese-doctors-back-marijuana-medicine-as-bill-enters-parliament-idUSKBN1F02MM", "ord_in_thread": 0, "title": "Portuguese doctors back marijuana medicine as bill enters parliament", "locations": [], "entities": {"persons": [{"name": "miguel guimaraes", "sentiment": "none"}, {"name": "andrei khalip", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "portugal", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "min read  lisbon", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "doctor’s association", "sentiment": "none"}, {"name": "doctors’ association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 7:10 PM / Updated 2 hours ago Portuguese doctors back marijuana medicine as bill enters parliament Andrei Khalip 4 Min Read \nLISBON (Reuters) - Portugal’s influential Doctors’ Association called for the legalization of marijuana-based medicines on Thursday, the same day parliament started to debate a draft bill that goes even further in seeking to allow patients to grow pot at home. \nAlthough Portugal boasts one of the world’s most liberal policies on drugs and has legal marijuana plantations destined for export, it has trailed several EU countries such as Italy and Germany, as well as Canada and parts of the United States in the last few years on medical marijuana. \nSeveral EU countries allow for doctor-prescribed cannabis-based medicines to be legally acquired to treat chronic pain, post traumatic stress disorder, alleviate side effects from cancer therapy, and help with some other ailments. \nMiguel Guimaraes, the head of the Doctor’s Association, told Reuters that he advocated legalizing marijuana-derived medicines based on scientific evidence, but criticized the part of the draft law that would permit domestic growing of the plant. \nThe bill’s sponsor, the Left Bloc party, agreed to change the part of the draft legislation dealing with cultivation at home, saying it was prepared to make concessions to have “a workable legislation that would benefit patients”. \nThe move by the far left party makes more likely the passage of a law legalizing medication derived from the plant, with support from the country’s ruling Socialists and other parties. \nGuimaraes said “the parliament bills should follow scientific evidence and restrict themselves at this stage to medicines, researched formulas”, adding though that Portugal should conduct further clinical studies on cannabis used for smoking. \n“Portugal can have an excellent opportunity here for clinical trials since we already have two instances where plantations have been authorized ... It is an extremely promising area at an international level,” he said. \nThe Left Bloc had argued that the situation with Portugal exporting legal marijuana while its own patients were unable to buy it legally was unnatural and hypocritical. \nPortugal led the world when it decriminalized the use of all drugs in 2001 to fight a deadly heroin addiction epidemic, focusing instead on treatment and prevention, a move that has been lauded at home and abroad as a success as it sharply reduced deaths and HIV infections. \nLast year, pharmaceuticals regulator INFARMED authorized a medical marijuana plantation in Cantanhede in central Portugal with a high content of psychoactive ingredient THC for export. \nIn November the project’s Canadian owner Tilray imported the first baby plants which are now being grown there, mostly targeting the German market, according to its CEO Brendan Kennedy. Tilray estimates the EU’s potential market at 30-40 billion euros on an annual basis, serving 10 million patients. \nPortugal on the Atlantic coast has a warm temperate subtropical climate, with mild winters, warm summers and lots of sunny days, which is often compared to that of California and makes it an ideal place for cannabis cultivation. Reporting By Andrei Khalip, Editing by William Maclean", "external_links": [], "published": "2018-01-11T21:09:00.000+02:00", "crawled": "2018-01-11T21:24:56.025+02:00", "highlightTitle": ""}