{"organizations": [], "uuid": "2fee9e3b6048a26116d5640cf163b7704bdceec7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-mali-security/gunmen-kill-at-least-14-mali-soldiers-in-attack-army-sources-idUKKBN1FG0J0", "country": "US", "domain_rank": 408, "title": "Gunmen kill at least 14 Mali soldiers in attack - army sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T15:01:00.000+02:00", "replies_count": 0, "uuid": "2fee9e3b6048a26116d5640cf163b7704bdceec7"}, "author": "", "url": "https://uk.reuters.com/article/uk-mali-security/gunmen-kill-at-least-14-mali-soldiers-in-attack-army-sources-idUKKBN1FG0J0", "ord_in_thread": 0, "title": "Gunmen kill at least 14 Mali soldiers in attack - army sources", "locations": [], "entities": {"persons": [], "locations": [{"name": "mali", "sentiment": "none"}, {"name": "bamako", "sentiment": "none"}, {"name": "west africa", "sentiment": "none"}, {"name": "soumpi", "sentiment": "none"}, {"name": "timbuktu", "sentiment": "none"}, {"name": "sahel", "sentiment": "none"}, {"name": "bamako", "sentiment": "none"}], "organizations": [{"name": "islamic state", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 1:04 PM / Updated 34 minutes ago Gunmen kill at least 14 Mali soldiers in attack on army camp Adama Diarra 3 Min Read \nBAMAKO (Reuters) - Mali’s President Ibrahim Boubacar Keita on Saturday said his people would not be frightened by “barbaric attacks” after unidentified gunmen killed at least 14 soldiers in a pre-dawn assault on a military camp. \nWest Africa’s arid Sahel region is suffering a spike in violence by militant groups, some with links to al Qaeda and Islamic State, that is drawing an increasingly aggressive response from countries including France and the United States. \nA group of around 30 heavily armed fighters attacked the military camp in Soumpi, located in the centre of the country near the southern boundary of Mali’s Timbuktu region, according to an army statement read on state radio. \nIt said 14 soldiers were killed and 15 others were wounded, adding that 17 of the attackers had been killed in the battle. \nThere was no immediate claim of responsibility for the attack. \n“The soldiers abandoned their position. The enemy carried away material,” said one army officer, who said the camp had been overrun and asked not to be named as they were not authorised to speak to the media. \nIslamist fighters seized control of Mali’s northern desert regions in 2012 before being driven back by a French-led intervention a year later. \nBut despite the presence of a U.N. peacekeeping mission and troops operating under a regional French anti-militant mission, violence is again on the rise and attacks are spreading further south towards the capital, Bamako. \n“These barbaric attacks will not scare us. On the contrary, they reinforce our determination to fight against the terrorists,” President Keita said, speaking in the central Mali village of Boni where 26 people were killed on Thursday. \nThose victims were travelling from neighbouring Burkina Faso in a civilian passenger vehicle when it struck a landmine. \nIn a separate incident on the same day in the nearby town of Youwarou, the Malian military said its forces repelled an attack by suspected Islamist fighters. \nMali and its western neighbour Senegal plan to deploy 1,000 troops soon in an operation to pacify central Mali and contain jihadists who had previously been confined to its Saharan expanses in the north. \nBut analysts doubt they will be able to do so purely through military means. The Islamists exploit the grievances of Fulani cattle herders and their disputes with local farmers over access to grazing lands. \nThe government’s periodic crackdowns on suspected jihadists have therefore tended to target the Fulani, driving some of them into the arms of the armed groups. Additional reporting by Tiemoko Diallo; Writing by Joe Bavier; Editing by Jeremy Gaunt and Louise Heavens", "external_links": [], "published": "2018-01-27T15:01:00.000+02:00", "crawled": "2018-01-27T15:26:50.043+02:00", "highlightTitle": ""}