{"organizations": [], "uuid": "2b32558d32e28032ea2cff8c411e77509f61c82d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222724085&w=1200&r=LYNXMPEE0G0UM", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-interserve-report-breakingviews/breakingviews-uk-poorly-placed-to-fight-carillion-domino-effect-idUSKBN1F61J3", "country": "US", "domain_rank": 408, "title": "UK poorly placed to fight Carillion domino effect", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-17T20:56:00.000+02:00", "replies_count": 0, "uuid": "2b32558d32e28032ea2cff8c411e77509f61c82d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-interserve-report-breakingviews/breakingviews-uk-poorly-placed-to-fight-carillion-domino-effect-idUSKBN1F61J3", "ord_in_thread": 0, "title": "UK poorly placed to fight Carillion domino effect", "locations": [], "entities": {"persons": [{"name": "interserve", "sentiment": "none"}, {"name": "carillion", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "interserve", "sentiment": "negative"}, {"name": "financial times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters Breakingviews) - The UK government is worried Interserve will follow Carillion into oblivion. A similar threat in the banking sector would surely prompt the state to deploy familiar tools to contain contagion. But the government’s dual role as client and bailout-wary market promoter complicates matters in the construction and support-services sectors.\nInterserve, a British company which manages incinerators and helps offenders get back to work, is on what the government calls “financial health watch” after Carillion was forced into liquidation on Monday, according to the Financial Times. Interserve’s share price initially slumped by 8 per cent on the news. Despite staging a minor recovery, the company’s mounting debt pile has made it a target of hedge funds which are betting it will be the next domino to fall.\nThe cynicism is understandable. Like Carillion, Interserve was hired by the UK government to fulfil a number of long-running contracts providing installations like gasification plants for local councils that have left them haemorrhaging cash. The company has said its end-of-2017 debt pile is 513 million pounds, nearly double what it was the previous year. This year alone analysts expect the company’s debt to rise to 600 million pounds, making it 4.5 times EBITDA – a breach of its banking covenants. The embattled outsourcer now has until the end of March to agree new terms with its banks.\nIn 2008, when dealing with tottering lenders, the UK government first tried private solutions. With Interserve, this won’t be easy – JPMorgan says stabilising the company’s leverage would require a rights issue of 292 million pounds – against a current market capitalisation of less than 170 million pounds.\nIf Interserve and other troubled groups can’t do this, the UK government could theoretically keep them going by applying a state insurance wrapper around their debt, thus keeping any Carillion contagion at bay. The Credit Guarantee Scheme, another crisis-era tool, kept Royal Bank of Scotland alive a decade ago by allowing the lender to keep issuing affordable debt. But RBS was a bank whose collapse would have meant the implosion of the UK economy. Helping out bust contractors – even ones for which it is a client – would hurt the government’s status as a promoter of free markets.\nThe good news is that Interserve’s smaller pension deficit and relatively upbeat prospects this year mean a Carillion repeat may not happen. The bad news is that a slew of bust contractors would still make a mess of the UK economy – and the state has less flexibility to stop it.\nBreakingviews Reuters Breakingviews is the world's leading source of agenda-setting financial insight. As the Reuters brand for financial commentary, we dissect the big business and economic stories as they break around the world every day. A global team of about 30 correspondents in New York, London, Hong Kong and other major cities provides expert analysis in real time.\nSign up for a free trial of our full service at https://www.breakingviews.com/trial and follow us on Twitter @Breakingviews and at www.breakingviews.com . All opinions expressed are those of the authors.", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-17T20:56:00.000+02:00", "crawled": "2018-01-18T01:05:33.002+02:00", "highlightTitle": ""}