{"organizations": [], "uuid": "bbb9bca4373d1bf6cbf794ce2d10d209c0f9b272", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-840898046.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/30/data-sheet-mark-zuckerberg-facebook-local-news/", "country": "US", "domain_rank": 1196, "title": "Data Sheet—Facebook: Mark Zuckerberg's Plan for Local News | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.274, "site_type": "news", "published": "2018-01-30T10:34:00.000+02:00", "replies_count": 0, "uuid": "bbb9bca4373d1bf6cbf794ce2d10d209c0f9b272"}, "author": "Aaron Pressman", "url": "http://fortune.com/2018/01/30/data-sheet-mark-zuckerberg-facebook-local-news/", "ord_in_thread": 0, "title": "Data Sheet—Facebook: Mark Zuckerberg's Plan for Local News | Fortune", "locations": [], "entities": {"persons": [{"name": "mark zuckerberg", "sentiment": "negative"}, {"name": "adam lashinsky", "sentiment": "negative"}, {"name": "aaron pressman", "sentiment": "negative"}, {"name": "zuckerberg", "sentiment": "none"}], "locations": [{"name": "silicon valley", "sentiment": "none"}], "organizations": [{"name": "harvard", "sentiment": "none"}, {"name": "daily illini", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "air force", "sentiment": "none"}, {"name": "university of illinois", "sentiment": "none"}, {"name": "urbana-champaign", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Aaron Pressman and Adam Lashinsky 8:34 AM EST \nThis is the web version of Data Sheet, Fortune’s daily newsletter on the top tech news. To get it delivered daily to your in-box, sign up here . \nMy hunch is that Mark Zuckerberg has never covered a local hearing on a telephone utility’s desire to raise rates. He probably hasn’t sat in an airless room listening to citizens berating the Air Force’s decision to close a local base. Zuckerberg likely hasn’t waded into an animal-rights protest at a dry cleaner’s shop that stores fur coats in the summertime. While he was designing a proto-“Hot or Not” web site at Harvard he undoubtedly didn’t ponder a feminist art professor’s attack on male-dominant statues on campus. \nI covered all these topics in my very first experience as a reporter, with the outstanding college newspaper The Daily Illini at the University of Illinois at Urbana-Champaign—home to a computer science department that begat oodles of Silicon Valley luminaries. (I studied history.) \nThis is all relevant today because the Facebook boss said Monday his company would begin to promote local over national news. He said people in his travels across the land “kept telling (him) … how much we all have in common if we can get past some of the most divisive national issues.” We can make great progress, as these simple folk relayed to Zuckerberg, “if we could turn down the temperature” on this prickly national fare in favor of “concrete” concerns at the local level. \nIt can’t be easy being a clueless billionaire or the head of the company that has helped decimate the news industry’s business model without being willing to accept the responsibility of being branded a media company. \nThe suggestion that local issues are less contentious than national ones merely because they somehow involve a bunch of happy neighbors cordially engaging in the American democratic experiment is laughable. It’d even be amusing if the stakes weren’t so high. First Facebook decides to de-emphasize news altogether. Then it proposes a popularity contest to determine quality. Now it hopes to calm criticism of its own culpability in poisoning the political well by deflecting what its users see away from national topics. \nThe tech backlash pendulum will swing back one day. But not today. Adam Lashinsky @adamlashinsky NEWSWORTHY \nLead balloon . As expected, the wireless industry and all of telecom world in Washington, D.C. attacked a leaked plan from the Trump National Security Council to build a federally-owned 5G mobile network . But the White House didn’t completely back down, with press secretary Sarah Huckabee Sanders simply saying : “We’re in the very earliest stages of the conversation.” \nMy complication had a little complication. Another day, another rumor about how Michael Dell plans to revamp his sprawling tech empire and lower its $50 billion debt burden. Instead of going public on its own—the last rumor—Dell may be acquired by its own VMWare subsidiary, which is already public, CNBC reported . Dell’s board will meet next month to consider a “slew of options,” including the reverse merger, CNBC said. Rumor merger mania also hit Microsoft , which could buy video game publisher Electronic Arts to bolster its Xbox business, according to the gaming news website Polygon. \nFresh start . J.P. Morgan Chase , Amazon, and Berkshire Hathaway said they were partnering to create a new company to provide healthcare to their employees that would rely on technology solutions to reduce costs and improve service. The effort is in the “early planning stages” and the three partners did not disclose many details, such as the name of the new company. But the stocks of major health insurers Anthem and UnitedHealth dropped 5% in premarket trading on Tuesday. \nIt’s not easy being green. Amazon also opened its biosphere-like campus addition on Monday. Dubbed the Spheres, the huge glass and steel domes contain 40,000 plants including a 55-foot-tall ficus tree. CEO Jeff Bezos took a tour, commenting: “The plants look happy.” (Headline song reference .) \nOops . The thousand dollar iPhone isn’t selling nearly as well as Apple expected, leading to a 50% production cut in the first quarter, Japan’s Nikkei newspaper reported (and also confirmed by the Wall Street Journal ). But looking further into the future, the company will be increasingly relying on its in-house microprocessor designs with three more Mac computers expected this year to contain custom chips, Bloomberg reported . The story details all of Apple’s various chip lines and ends by noting: “Apple watchers believe it’s just a matter of time before the company designs the entire CPU, at which point Intel would lose its fifth-largest customer.” \nYou complete me . German software giant SAP is acquiring Callidus Software , which makes cloud-based HR and sales apps, for $2.4 billion. CFO Luka Mucic said SAP generally avoids acquisitions except to add “those pieces that we were missing in the cloud.” FOOD FOR THOUGHT \nBill Gates is an avid reader and book reviewer. For years, he’s said that Steven Pinker’s book about the world’s improving conditions, The Better Angels of Our Nature , was his all-time favorite. But Pinker has a new book, called Enlightenment Now , which Gates says is even better. It’s filled with amazing factoids, as Gates recounts on his blog: \nYou’re 37 times less likely to be killed by a bolt of lightning than you were at the turn of the century—and that’s not because there are fewer thunderstorms today. It’s because we have better weather prediction capabilities, improved safety education, and more people living in cities. \nTime spent doing laundry fell from 11.5 hours a week in 1920 to an hour and a half in 2014. This might sound trivial in the grand scheme of progress. But the rise of the washing machine has improved quality of life by freeing up time for people—mostly women—to enjoy other pursuits. That time represents nearly half a day every week that could be used for everything from binge-watching Ozark or reading a book to starting a new business. \nYou’re way less likely to die on the job. Every year, 5,000 people die from occupational accidents in the U.S. But in 1929—when our population was less than two-fifths the size it is today—20,000 people died on the job. People back then viewed deadly workplace accidents as part of the cost of doing business. Today, we know better, and we’ve engineered ways to build things without putting nearly as many lives at risk. IN CASE YOU MISSED IT ", "external_links": [], "published": "2018-01-30T10:34:00.000+02:00", "crawled": "2018-01-30T17:45:29.008+02:00", "highlightTitle": ""}