{"organizations": [], "uuid": "66d585b4e64ba7ee29f6a6226715e9511722fa2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180124.html", "section_title": "Archive News &amp; Video for Wednesday, 24 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-index-slides-to-3-year-lows-on-broad-based-weakness-idUSL4N1PJ21P", "country": "US", "domain_rank": 408, "title": "FOREX -Dollar index slides to 3-year lows on broad-based weakness", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.033, "site_type": "news", "published": "2018-01-24T13:47:00.000+02:00", "replies_count": 0, "uuid": "66d585b4e64ba7ee29f6a6226715e9511722fa2d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-index-slides-to-3-year-lows-on-broad-based-weakness-idUSL4N1PJ21P", "ord_in_thread": 0, "title": "FOREX -Dollar index slides to 3-year lows on broad-based weakness", "locations": [], "entities": {"persons": [{"name": "masayuki kitano", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "boj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Euro hits 3-year high; sterling hits post-Brexit vote high\n* Dollar/yen touches lowest level since mid-September\n* Speculation of eventual BOJ stimulus exit supports yen (Updates prices)\nBy Masayuki Kitano\nSINGAPORE, Jan 24 (Reuters) - The dollar slid to three-year lows against a basket of major peers on Wednesday, pressured by simmering concerns that the U.S. currency’s yield advantage will start to erode as major central banks head toward unwinding their massive stimulus.\nThe dollar index , which measures the greenback’s value against a basket of six major currencies, fell below the 90.00 threshold for the first time since December 2014. It was last down 0.2 percent at 89.935.\nThe dollar fell broadly, with the euro hitting a fresh three-year peak, while sterling rose to its highest level since Britain’s June 2016 vote to leave the European Union.\nAgainst the yen, the dollar fell below the 110 threshold for the first time in four months.\nThe yen has gained a lift in recent weeks, after the Bank of Japan trimmed its buying of long-dated government bonds in market operations earlier this month, sparking speculation of an eventual exit from its large stimulus.\nAnalysts said such speculation continued to support the yen, even after BOJ Governor Haruhiko Kuroda on Tuesday stressed the importance of patiently continuing with powerful monetary easing.\n“The dilemma here for the Bank of Japan is how do they temper investor expectations?” said Stephen Innes, head of trading in Asia-Pacific for Oanda in Singapore.\n“This is the issue that’s on the table right now beyond the broader negative downtrend in the dollar,” he said.\nAt one point, the dollar slipped to around 109.80 yen, its lowest level since Sept. 15. It last changed hands at 109.92 yen, down 0.3 percent on the day.\nThe greenback has shed nearly 2.5 percent against the yen this month, putting it on track for its biggest monthly drop since January 2017.\n“On the BOJ, they have just reaffirmed pretty much what we already know and what the market already knows, that they’ll continue to maintain an aggressive, powerful easing stance,” said Peter Dragicevich, G10 FX strategist for Nomura in Singapore.\nThat stance, however, has been factored in and market players are looking ahead to what the BOJ might do next, Dragicevich said.\n“They are looking at the next potential, kind of incremental steps, whenever they may come,” he added.\nThe euro climbed to as high as $1.2335, its strongest level since December 2014, and was last up 0.2 percent at $1.2318.\nEuro zone consumer confidence jumped much more than expected in January, data from the European Commission showed on Tuesday, helping to support the common currency.\nInvestors are also focusing on the European Central Bank’s meeting on Thursday for clues on the outlook for monetary policy.\nThe euro has rallied this year, boosted by growing optimism that a strengthening economy would prompt the ECB to signal a quicker end to years of efforts to stimulate the economy than previously forecast.\nSterling, which has rallied recently on the back of growing optimism around Britain’s chances of securing a favourable Brexit deal, gained 0.2 percent to $1.4023. The pound earlier touched $1.4049. (Reporting by Masayuki Kitano; Editing by Sam Holmes and Richard Borsuk)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T13:47:00.000+02:00", "crawled": "2018-01-25T13:26:29.000+02:00", "highlightTitle": ""}