{"organizations": [], "uuid": "c51f249a32fc6271cbe959ae0f77968cbd2c169a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/10/104834369-GettyImages-458736054.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/23/russia-has-learned-its-lesson-about-oil-price-volatility-wealth-fund-chief-says.html", "country": "US", "domain_rank": 767, "title": "Russia has 'learned its lesson' about oil price volatility, wealth fund chief says", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.675, "site_type": "news", "published": "2018-01-23T09:38:00.000+02:00", "replies_count": 0, "uuid": "c51f249a32fc6271cbe959ae0f77968cbd2c169a"}, "author": "Natasha Turak", "url": "https://www.cnbc.com/2018/01/23/russia-has-learned-its-lesson-about-oil-price-volatility-wealth-fund-chief-says.html", "ord_in_thread": 0, "title": "Russia has 'learned its lesson' about oil price volatility, wealth fund chief says", "locations": [], "entities": {"persons": [{"name": "tomohiro ohsumi", "sentiment": "negative"}, {"name": "dmitriev", "sentiment": "none"}, {"name": "kirill dmitriev", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "apec", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "rdif", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Davos - World Economic Forum Russia has 'learned its lesson' about oil price volatility, wealth fund chief says Speaking from the World Economic Forum in Davos, RDIF CEO Kirill Dmitriev emphasized the importance of diversification in the Russian economy RDIF is the $10 billion sovereign wealth fund created by Russia's government to co-invest in the Russian economy alongside other countries SHARES Tomohiro Ohsumi | Bloomberg | Getty Images Kirill Dmitriev, CEO of the Russian Direct Investment Fund at the APEC CEO forum in Beijing, China, on Nov. 10, 2014. \nRussia has \"learned its lesson\" about oil price volatility, the chief executive of the Russian Direct Investment Fund (RDIF) told CNBC Tuesday. \nSpeaking from the World Economic Forum in Davos, RDIF CEO Kirill Dmitriev emphasized the importance of diversification in the Russian economy. \n\"For the Russian economy we continue to focus on diversification. We expect technology to make up 25 percent of our portfolio,\" Dmitriev said. \"Infrastructure and tech still need to be important and I think Russia learned its lesson about oil price volatility, so diversification and investment in those areas is very key.\" \nRDIF is the $10 billion sovereign wealth fund created by Russia's government to co-invest in the Russian economy alongside other countries. Dmitriev was made chief of the fund in 2011 to improve foreign investment flows and investor confidence in the country. \nThe head of the Kremlin's investment vehicle was positive about the country's growth forecast, despite the pressure of U.S. sanctions issued in both 2014 and 2016 over Russia's annexation of Crimea peninsula and alleged Russian interference in the latest U.S. election. \n\"Russia saw major increases of FDI (foreign direct investment) last year of 25 percent, which is one of the highest levels of FDI in (our) history, and it's related to Russia resuming growth,\" Dmitriev said. \"We had almost 2 percent GDP growth last year, we'll have more than 2 percent next year.\" \nThe World Bank reported Russia's 2017 GDP growth at 1.7 percent for 2017, and forecasts the same for 2018. show chapters 12 Hours Ago | 03:19 'Russian economy is feeling quite strong right now' \n\"Oil prices are stable, our stock market is at one of its peak levels,\" he continued. \"Obviously there are some political challenges, some uncertainty, but there is no question the Russian economy is feeling quite strong right now.\" \nThe multibillion dollar fund has been under U.S. government sanctions since 2015 because of ties to its parent, Russian bank Vnesheconombank (VEB), which has been dubbed the \"bank of spies\" by members of the U.S. intelligence community. VEB is also under U.S. sanctions, according to the U.S. Treasury Department . \nIn 2016, RDIF was able to transfer its management company away to another Russian entity in order to distance itself from VEB and reassure investors of its independence. The fund has emphasized that joint projects, not sanctions, should be investors' focus. \nAttracting foreign investment is a major priority for the Russian government. Russia's economy plunged into recession between 2014 and 2017, when both the imposition of U.S. sanctions and a nearly 50 percent drop in global oil prices caused the ruble to collapse. \nFinancial bodies observed a moderate recovery for the Russian Federation at the end of 2017 thanks to higher commodity prices, strengthening global demand and lower interest rates.", "external_links": [], "published": "2018-01-23T09:38:00.000+02:00", "crawled": "2018-01-23T09:38:15.000+02:00", "highlightTitle": ""}