{"organizations": [], "uuid": "3601353d33e2e7078877448cca1db0fddf10c2a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-free-research-reports-on-these-restaurants-stocks--del-taco-restaurants-habit-restaurants-bjs-restaurants-and-bloomin-brands.html", "country": "US", "domain_rank": 767, "title": "Free Research Reports on These Restaurants Stocks -- Del Taco Restaurants, Habit Restaurants, BJ's Restaurants, and Bloomin' Brands", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.029, "site_type": "news", "published": "2018-01-16T14:20:00.000+02:00", "replies_count": 0, "uuid": "3601353d33e2e7078877448cca1db0fddf10c2a4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-free-research-reports-on-these-restaurants-stocks--del-taco-restaurants-habit-restaurants-bjs-restaurants-and-bloomin-brands.html", "ord_in_thread": 0, "title": "Free Research Reports on These Restaurants Stocks -- Del Taco Restaurants, Habit Restaurants, BJ's Restaurants, and Bloomin' Brands", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "bj", "sentiment": "negative"}, {"name": "del taco restaurants", "sentiment": "negative"}, {"name": "bjri", "sentiment": "none"}, {"name": "wallstequities.com on del taco restaurants inc.", "sentiment": "none"}, {"name": "habit restaurants inc.", "sentiment": "none"}, {"name": "restaurants inc.", "sentiment": "none"}, {"name": "bloomin' brands inc.", "sentiment": "none"}, {"name": "taco", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 16, 2018 /PRNewswire/ -- WallStEquities.com strives to bring the best free research to the investment community. Today we are offering reports on TACO, HABT, BJRI, and BLMN which can be accessed for free by signing up to www.wallstequities.com/registration . Insights from TDn2K ™ data through The Restaurant Industry Snapshot ™ said that same-store sales growth in the US Restaurants industry for Q4 was 0.4%, a very robust 2.6 percentage point improvement from Q3 results. This is the first quarter of growth in the last two years. Restaurant same-store sales posted 0.3% growth for the month of December 2017. This was the second-best month based of sales growth since March 2016. This morning, research coverage has been initiated by WallStEquities.com on Del Taco Restaurants Inc. (NASDAQ: TACO), The Habit Restaurants Inc. (NASDAQ: HABT), BJ's Restaurants Inc. (NASDAQ: BJRI), and Bloomin' Brands Inc. (NASDAQ: BLMN). All you have to do is sign up today for this free limited time offer by clicking the link below.\nwww.wallstequities.com/registration\nDel Taco Restaurants\nLast Friday, Lake Forest, California headquartered Del Taco Restaurants Inc.'s stock climbed slightly by 0.52%, to close the day at $13.47. A total volume of 161,106 shares was traded. The Company's shares have advanced 12.25% in the last month. The stock is trading 9.90% above its 50-day moving average and 1.87% above its 200-day moving average. Additionally, shares of the Company, which develops, franchises, owns, and operates Del Taco quick-service Mexican-American restaurants in the US, have a Relative Strength Index (RSI) of 80.53.\nOn December 20 th , 2017, Del Taco Restaurants announced its revamped Buck and Under Menu, which now features an even larger assortment of items priced at just $0.69, $0.89, and $1. The Company introduces new products with bold flavor profiles created specifically for the value menu, such as the Salsa Chicken Taco and Mini Cheddar Quesadilla. Get the full research report on TACO for free by clicking below at:\nwww.wallstequities.com/registration/?symbol=TACO\nHabit Restaurants\nShares in Irvine, California headquartered The Habit Restaurants Inc. saw a drop of 5.85%, finishing Friday's session at $8.85. The stock recorded a trading volume of 450,795 shares. The Company's shares are trading below their 50-day moving average by 7.48%. Furthermore, shares of Habit Restaurants, which operates fast casual restaurants under The Habit Burger Grill name, have an RSI of 37.67. Find your free research report on HABT at:\nwww.wallstequities.com/registration/?symbol=HABT\nBJ's Restaurants\nHuntington Beach, California-based BJ's Restaurants Inc.'s stock finished 0.13% lower at $37.70 last Friday at the close. A total volume of 308,533 shares was traded. The Company's shares have advanced 3.57% in the past month, 24.42% in the previous three months, and 4.58% over the past year. The stock is trading above its 50-day and 200-day moving averages by 7.43% and 4.18%, respectively. Additionally, shares of BJ's Restaurants, which owns and operates casual dining restaurants in the US, have an RSI of 58.60.\nOn December 19 th , 2017, BJ's Restaurants announced the opening of its restaurant in Taylor, Michigan on December 18 th , 2017. The new BJ's Restaurant & Brewhouse opened on a freestanding pad at the Southland Center and is part of a recent retail addition that includes a 50,000-square-foot Cinemark theater. The restaurant is approximately 7,500 square feet, seats approximately 230 guests, and features the Company's extensive menu, including its signature deep-dish pizza, award-winning handcrafted beer, and famous Pizookie ® dessert.\nOn January 03 rd , 2018, research firm Stifel upgraded the Company's stock rating from 'Hold' to 'Buy' while revising its previous target price from $32 a share to $44 a share. Sign up today for the free research report on BJRI at:\nwww.wallstequities.com/registration/?symbol=BJRI\nBloomin' Brands\nTampa, Florida headquartered Bloomin' Brands Inc.'s shares ended the session 0.09% higher at $22.35. The stock recorded a trading volume of 1.17 million shares. The Company's shares have advanced 4.59% in the last month, 26.20% over the previous three months, and 25.63% over the past year. The stock is trading 10.36% above its 50-day moving average and 14.91% above its 200-day moving average. Moreover, shares of Bloomin' Brands, which through its subsidiaries, owns and operates casual, upscale casual, and fine dining restaurants primarily in the US and internationally, have an RSI of 70.37.\nOn January 08 th , 2018, Bloomin' Brands announced that Ramin Eivaz joined the Company as Senior Vice President of Digital Marketing, Analytics & CRM. This newly created position will lead a team that will integrate brand marketing and digital analytics for an enhanced customer experience. Wall St. Equities' research coverage also includes the downloadable free report on BLMN at:\nwww.wallstequities.com/registration/?symbol=BLMN\n--\nWall St. Equities :\nWall St. Equities (WSE) produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. WSE has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below.\nWSE has not been compensated; directly or indirectly; for producing or publishing this document.\nPRESS RELEASE PROCEDURES :\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third-party research service company (the \"Reviewer\") represented by a credentialed financial analyst [for further information on analyst credentials, please email info@wallstequities.com . Rohit Tuli, a CFA® charterholder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on publicly available information which is believed to be reliable. Content is researched, written and reviewed on a reasonable-effort basis. The Reviewer has not performed any independent investigations or forensic audits to validate the information herein. The Reviewer has only independently reviewed the information provided by the Author according to the procedures outlined by WSE. WSE is not entitled to veto or interfere in the application of such procedures by the third-party research service company to the articles, documents or reports, as the case may be. Unless otherwise noted, any content outside of this document has no association with the Author or the Reviewer in any way.\nNO WARRANTY\nWSE, the Author, and the Reviewer ", "external_links": ["https://wallstequities.com/legal-disclaimer/", "http://www.wallstequities.com/registration/?symbol=BJRI", "http://www.wallstequities.com/registration/?symbol=TACO", "http://www.wallstequities.com/registration/?symbol=BLMN", "http://www.prnewswire.com/news-releases/free-research-reports-on-these-restaurants-stocks----del-taco-restaurants-habit-restaurants-bjs-restaurants-and-bloomin-brands-300582989.html", "http://www.wallstequities.com/registration/?symbol=HABT", "http://www.wallstequities.com/registration"], "published": "2018-01-16T14:20:00.000+02:00", "crawled": "2018-01-16T17:06:16.008+02:00", "highlightTitle": ""}