{"organizations": [], "uuid": "5aea7615d447677e61616c5b940f1563aa3b8bf0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-delek-us-holdings-and-alon-usa-partners-announce-expected-closing-date-and-unitholder-consent-deadline-for-alon-usa.html", "country": "US", "domain_rank": 767, "title": "Delek US Holdings and Alon USA Partners Announce Expected Closing Date and Unitholder Consent Deadline for Alon USA Partners Acquisition", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.941, "site_type": "news", "published": "2018-01-09T01:30:00.000+02:00", "replies_count": 0, "uuid": "5aea7615d447677e61616c5b940f1563aa3b8bf0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-delek-us-holdings-and-alon-usa-partners-announce-expected-closing-date-and-unitholder-consent-deadline-for-alon-usa.html", "ord_in_thread": 0, "title": "Delek US Holdings and Alon USA Partners Announce Expected Closing Date and Unitholder Consent Deadline for Alon USA Partners Acquisition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BRENTWOOD, Tenn., Jan. 08, 2018 (GLOBE NEWSWIRE) -- Delek US Holdings, Inc. (NYSE:DK) (“Delek US”) and Alon USA Partners, LP (NYSE:ALDW) (“Alon Partners”) today announced that Delek US’ Registration Statement on Form S-4 has been declared effective by the Securities and Exchange Commission (“SEC”) and that Alon Partners has filed a definitive consent statement with the SEC with respect to the proposed acquisition. The consent process will conclude on February 5, 2018.\nA subsidiary of Delek US currently owns approximately 51.0 million common units of Alon Partners, or approximately 81.6 percent of the outstanding units. This subsidiary has executed a written consent adopting and approving in all respects the merger agreement and the transactions contemplated thereby, including the merger (the “AAI Written Consent”). The delivery of the AAI Written Consent is sufficient to adopt the merger agreement and to approve the acquisition of Alon Partners by Delek US without the receipt of written consent from any other holder of Alon Partners common units. Delek US expects the closing of the acquisition to occur on February 7, 2018, subject to the satisfaction or waiver of the remaining customary conditions to closing.\nAbout Delek US Holdings, Inc .\nDelek US Holdings, Inc. is a diversified downstream energy company with assets in petroleum refining, logistics, asphalt, renewable fuels and convenience store retailing. The refining assets consist of refineries operated in Tyler and Big Spring, Texas, El Dorado, Arkansas and Krotz Springs, Louisiana with a combined nameplate crude throughput capacity of 302,000 barrels per day. Delek US, through its subsidiaries, currently owns 100 percent of the general partner and approximately 81.6 percent of the limited partner interests in Alon Partners, which owns the crude oil refinery in Big Spring, Texas, with a crude oil throughput capacity of 73,000 barrels per day and an integrated wholesale marketing business.\nThe logistics operations primarily consist of Delek Logistics Partners, LP (NYSE:DKL). Delek US and its affiliates also own approximately 63 percent (including a 2 percent general partner interest) of Delek Logistics Partners, LP. Delek Logistics Partners, LP is a growth-oriented master limited partnership focused on owning and operating midstream energy infrastructure assets.\nThe asphalt operations consist of owned or operated asphalt terminals serving markets from Tennessee to the West Coast through a combination of non-blended asphalt purchased from third parties and production at the Big Spring, Texas and El Dorado, Arkansas refineries. The renewables operations consist of plants in Texas and Arkansas that produce biodiesel fuel and a renewable diesel facility in California.\nThe convenience store retail business is the largest 7-Eleven licensee in operates approximately 300 convenience stores in central and west Texas and New Mexico.\nAbout Alon USA Partners\nAlon USA Partners, LP is a Delaware limited partnership in which Delek US currently owns 100 percent of the general partner and approximately 81.6 percent of the limited partner interests. Alon Partners owns and operates a crude oil refinery in Big Spring, Texas, with a crude oil throughput capacity of 73,000 barrels per day. Alon Partners refines crude oil into finished products, which are marketed primarily in central and west Texas, Oklahoma, New Mexico and Arizona through its integrated wholesale distribution network to retail convenience stores owned by Delek US and other third-party distributors.\nSafe Harbor Provisions Regarding Forward-Looking Statements\nThis press release contains forward-looking statements that are based upon current expectations and involve a number of risks and uncertainties. Statements concerning current estimates, expectations and projections about future results, performance, prospects, opportunities, plans, actions and events and other statements, concerns, or matters that are not historical facts are “forward-looking statements,” as that term is defined under the federal securities laws. These forward-looking statements include, but are not limited to, statements regarding the proposed merger with Alon Partners including the timing, closing and success thereof ; the ability of Delek US to simplify its corporate structure, reduce costs, reallocate cash flow, capture synergies including relating to costs of capital, refinance debt, increased daily trading volume; future dropdowns and the success thereof; continued safe and reliable operations; integration and transition plans, synergies, opportunities, anticipated future performance and financial position, and other factors.\nInvestors are cautioned that the following important factors, among others, may affect these forward-looking statements. These factors include but are not limited to: risks and uncertainties related to the expected timing and likelihood of completion of the proposed merger, including the occurrence of any event, change or other circumstances that could give rise to the termination of the merger agreement, the risk that the parties may not be able to satisfy the conditions to the proposed transaction in a timely manner or at all, the risk that any announcements relating to the proposed transaction could have adverse effects on the market price of Delek US’ common stock or Alon Partners’ common units, the risk that the proposed transaction and its announcement could have an adverse effect on the ability of Delek US and Alon Partners to retain customers and retain and hire key personnel and maintain relationships with their suppliers and customers and on their operating results and businesses generally, the risk that the combined company may be unable to achieve cost-cutting synergies or it may take longer than expected to achieve those synergies, uncertainty related to timing and amount of future share repurchases and dividend payments, risks and uncertainties with respect to the quantities and costs of crude oil we are able to obtain and the price of the refined petroleum products we ultimately sell; gains and losses from derivative instruments; management’s ability to execute its strategy of growth through acquisitions and the transactional risks associated with acquisitions and dispositions; acquired assets may suffer a diminishment in fair value as a result of which we may need to record a write-down or impairment in carrying value of the asset; changes in the scope, costs, and/or timing of capital and maintenance projects; operating hazards inherent in transporting, storing and processing crude oil and intermediate and finished petroleum products; our competitive position and the effects of competition; the projected growth of the industries in which we operate; general economic and business conditions affecting the southern United States; and other risks contained in Delek US’ and Alon Partners’ filings with the SEC.\nForward-looking statements should not be read as a guarantee of future performance or results and wil", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/868a1c5d-8c22-44e4-abdf-3dc8125a4c4d", "https://www.globenewswire.com/NewsRoom/AttachmentNg/05a6ab7c-dc21-467b-8547-686f553e9d61/en"], "published": "2018-01-09T01:30:00.000+02:00", "crawled": "2018-01-09T10:13:59.467+02:00", "highlightTitle": ""}