{"organizations": [], "uuid": "b8fba6744342e2f0278af77a86d0668fb81298a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-geoffrey-b-davis-joins-gt-biopharmas-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Geoffrey B. Davis Joins GT Biopharma's Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T16:30:00.000+02:00", "replies_count": 0, "uuid": "b8fba6744342e2f0278af77a86d0668fb81298a6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-geoffrey-b-davis-joins-gt-biopharmas-board-of-directors.html", "ord_in_thread": 0, "title": "Geoffrey B. Davis Joins GT Biopharma's Board of Directors", "locations": [], "entities": {"persons": [{"name": "geoffrey b. davis joins gt biopharma", "sentiment": "negative"}, {"name": "geoffrey b. davis", "sentiment": "none"}, {"name": "geoff", "sentiment": "none"}, {"name": "anthony j. cataldo", "sentiment": "none"}, {"name": "kathleen clarence-smith", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}, {"name": "barker davis", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "gt biopharma inc.", "sentiment": "negative"}, {"name": "life sciences", "sentiment": "none"}, {"name": "ropes & gray", "sentiment": "none"}, {"name": "gt biopharma's board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, January 16, 2018 /PRNewswire/ --\nGT Biopharma Inc. (OTCQB: GTBP) and (Euronext Paris: GTBP.PA) today announced that Geoffrey B. Davis will join GT Biopharma's Board of Directors effective immediately. Mr. Davis is the founding partner of Barker Davis, a law firm focused on Life Sciences transactions, and formerly a partner at Ropes & Gray, where he played a significant role in establishing the firm's internationally recognized Life Sciences group.\n\"As a veteran life sciences attorney, Geoff's experience will complement the seasoned biotechnology management team that we added over the last 6 months. His appointment represents another milestone for GT Biopharma and significant accomplishment towards our goal of creating a premier company in the biotech community,\" said Anthony J. Cataldo, Executive Chairman of GT Biopharma.\n\"We are extremely pleased to welcome Geoff to GT Biopharma's Board of Directors,\" said Dr. Kathleen Clarence-Smith, Chief Executive Officer of GT Biopharma. \"We expect Geoff's substantial experience and expertise, particularly in the completion of business development transactions, to be a significant asset to the company, as we continue to execute on our strategy, focused on becoming a leading biopharmaceutical company.\"\nMr. Davis has extensive experience representing biotechnology, biomedical, medical device and pharmaceutical companies. During his more than 25 years as a partner at Ropes & Gray, Geoff played a significant role in establishing the firm's internationally-recognized Life Sciences group. His work includes numerous corporate partnering and licensing transactions for major pharmaceutical and medical device companies, as well as for public and private biotechnology companies and major medical centers. He has also worked extensively on public and private financings for biomedical companies of all sizes, ranging from newly organized companies to established industry leaders, on behalf of both companies and their investment bankers.\nMr. Davis received his B.A., cum laude, from Yale University and his J.D., cum laude, from Harvard Law School.\nAbout GT Biopharma, Inc.\nGT Biopharma, Inc. is an immuno-oncology biotechnology company focused on innovative treatments based on the company's proprietary Tri and Tetra-specific Natural Killer Cell Engagers (TriKEs™ and TetraKEs) and bispecific antibody-drug conjugate (ADC) platforms. GT's lead oncology drug candidate, OXS-1550 (DT2219) is a novel bispecific scFv recombinant fusion protein-drug conjugate composed of the variable regions of the heavy and light chains of anti-CD19 and anti-CD22 antibodies and a modified form of diphtheria toxin as its cytotoxic drug payload. OXS-1550 has demonstrated success in early human clinical trials in patients with relapsed/refractory B-cell lymphoma or leukemia. In addition, GT's TriKE platform will address a number of cancer types. GT's nervous system platform is focused on acquiring or discovering and patenting late-stage, de-risked, and close-to-market improved treatments for nervous system diseases (Neurology and Pain) and shepherding them through the approval process to the NDA. GT Biopharma's neurology products currently include PainBrake, as well as treatments for the symptoms of myasthenia gravis, and motion sickness.\nExcept for historical information contained herein, the statements in this release are forward-looking and made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are inherently unreliable and actual results may differ materially. Examples of forward-looking statements in this news release include statements regarding the effectiveness of the Company's products, the potential outcome of clinical studies, the future success of development activities and the future growth and operating and financial performance of the Company. Factors which could cause actual results to differ materially from these forward-looking statements include such factors as the Company's ability to accomplish its business initiatives, obtain regulatory approval and protect its intellectual property; significant fluctuations in marketing expenses and ability to achieve or grow revenue, or recognize net income, from the sale of its products and services, as well as the introduction of competing products, or management's ability to attract and maintain qualified personnel necessary for the development and commercialization of its planned products, and other information that may be detailed from time to time in the Company's filings with the United States Securities and Exchange Commission. The Company undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.\nContact:\nWestwicke Partners\nJohn Woolford\n+1(443)-213-0506\njohn.woolford@westwicke.com\nSOURCE GT Biopharma Inc.", "external_links": [], "published": "2018-01-16T16:30:00.000+02:00", "crawled": "2018-01-16T19:33:58.010+02:00", "highlightTitle": ""}