{"organizations": [], "uuid": "574e3cd07b3c90447df1ded8e4826e78f8c4f5c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 19, "shares": 19, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225115439&w=1200&r=LYNXMPEE0O0JF", "site_section": "http://feeds.reuters.com/reuters/UKPersonalFinanceNews", "section_title": "Reuters: Money", "url": "https://uk.reuters.com/article/uk-britain-economy-lending/uk-mortgage-approvals-hit-lowest-since-2013-in-december-uk-finance-idUKKBN1FE15H", "country": "US", "domain_rank": 408, "title": "UK mortgage approvals hit lowest since 2013 in December - UK Finance", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T13:14:00.000+02:00", "replies_count": 0, "uuid": "574e3cd07b3c90447df1ded8e4826e78f8c4f5c0"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-economy-lending/uk-mortgage-approvals-hit-lowest-since-2013-in-december-uk-finance-idUKKBN1FE15H", "ord_in_thread": 0, "title": "UK mortgage approvals hit lowest since 2013 in December - UK Finance", "locations": [], "entities": {"persons": [{"name": "andy bruce", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "uk finance", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 10:06 AM / Updated 7 hours ago UK mortgage approvals hit lowest since 2013 in December - UK Finance Andy Bruce 2 Min Read \nLONDON (Reuters) - British banks approved the fewest mortgages since April 2013 last month and growth in consumer credit slowed, industry figures showed on Thursday, pointing to a weaker housing market this year. \nBanks approved 36,115 mortgages for house purchase in December, down some 19 percent from with a year ago and weaker than the 39,007 approved in November, trade association UK Finance said. \nBritain’s economy slowed last year as higher inflation triggered by the June 2016 referendum to leave the European Union ate into households’ disposable income, causing the housing market to cool in much of the country. \nThursday’s figures are the first to show what happened to lending after the Bank of England raised interest rates for the first time in 10 years in November, when the government also announced it would scrap a property purchase tax for most first-time buyers. \n“December’s marked drop in mortgage approvals suggests that already pressurised housing market activity took a further hit from the Bank of England raising interest rates in early-November,” said economist Howard Archer from the EY ITEM Club consultancy. \nNor was there much sign that the government’s property tax changes in November - which included scrapping purchase taxes for most first-time buyers - had lifted total demand. \nUK Finance described the figures as showing “a healthy mortgage market in a traditionally quiet month” and said there was an underlying upward trend in the number of first-time buyers, boosted by previous government initiatives. \nAnnual growth in consumer credit slowed to 0.7 percent from 0.8 percent, the weakest reading since UK Finance started publishing a new version of this figure in April last year. \nMore comprehensive lending figures from the Bank of England are due on Tuesday. Reporting by Andy Bruce, editing by David Milliken and Toby Chopra", "external_links": [], "published": "2018-01-25T13:14:00.000+02:00", "crawled": "2018-01-25T13:41:06.021+02:00", "highlightTitle": ""}