{"organizations": [], "uuid": "f762fdc728f8a4faafa030dd2e9b52ec7d45c435", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/finland-security/finnish-government-calls-for-urgent-approval-of-intelligence-bill-idUSL8N1PK4CK", "country": "US", "domain_rank": 408, "title": "Finnish government calls for urgent approval of intelligence bill", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:18:00.000+02:00", "replies_count": 0, "uuid": "f762fdc728f8a4faafa030dd2e9b52ec7d45c435"}, "author": "", "url": "https://www.reuters.com/article/finland-security/finnish-government-calls-for-urgent-approval-of-intelligence-bill-idUSL8N1PK4CK", "ord_in_thread": 0, "title": "Finnish government calls for urgent approval of intelligence bill", "locations": [], "entities": {"persons": [], "locations": [{"name": "helsinki", "sentiment": "none"}, {"name": "finland", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 3:20 PM / Updated 29 minutes ago Finnish government calls for urgent approval of intelligence bill Reuters Staff 3 Min Read \nHELSINKI, Jan 25 (Reuters) - Finland’s government on Thursday urged opposition parties to back an intelligence bill being fast-tracked through parliament due to fears about spying by foreign governments and security concerns in the wake of the country’s first militant attack. \nThe bill would give authorities new powers to monitor citizens online and allow the intelligence service to track communications beyond Finland’s borders. \nIt requires changes to the constitutional law on privacy protection and fast-track approval, which is rare, demands the backing of five-sixths of parliament. \n“The weakening of Finland’s security situation and the need to prepare for activities threatening the national security of Finland have created an exceptional situation in which there is an immediate need to urgently amend the constitution,” the government said in a statement. \nTwo people were killed and eight wounded in an August knife attack by a suspected Moroccan asylum seeker. A trial is expected to start in the coming weeks. \nFinnish Security Intelligence Service (Supo) also last year raised its threat level to “elevated” from “low”. \nIf the bill fails to reach the required majority, the constitutional changes would also need the approval of a new parliament following next year’s general election. \n“For too long, we have lagged behind other Western countries with our intelligence legislation, so there’s no need to drag this out,” defense minister Jussi Niinisto told a news conference. \n“From what I’ve heard from other parties, the laws are deemed necessary ... so we should enact them as soon as possible, before the country faces a serious security threat.” \nThe governing coalition controls 105 seats in parliament and needs the support of the 35 lawmakers in the opposition to reach the necessary 166 votes. \nThe bill aims to also boost powers for military intelligence and establish a new authority and a parliamentary committee to oversee intelligence operations. \nThe lawmakers are expected to vote on the bill in the spring after a review by a parliament committee overseeing constitutional law. (Reporting by Tuomas Forsell; Editing by Jussi Rosendahl and Matthew Mpoke Bigg)", "external_links": [], "published": "2018-01-25T17:18:00.000+02:00", "crawled": "2018-01-25T17:56:22.003+02:00", "highlightTitle": ""}