{"organizations": [], "uuid": "b952e845cfb28d86b4514822c5071594c1068c38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/constellation-brands-marijuana-investment.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/05/constellation-brands-canada-canopy-growth-investment/", "country": "US", "domain_rank": 1196, "title": "Constellation Brands Invests in Canadian Marijuana Company | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.961, "site_type": "news", "published": "2018-01-05T15:19:00.000+02:00", "replies_count": 0, "uuid": "b952e845cfb28d86b4514822c5071594c1068c38"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/05/constellation-brands-canada-canopy-growth-investment/", "ord_in_thread": 0, "title": "Constellation Brands Invests in Canadian Marijuana Company | Fortune", "locations": [], "entities": {"persons": [{"name": "robert mondavi", "sentiment": "none"}, {"name": "corona", "sentiment": "none"}, {"name": "ethan miller", "sentiment": "none"}, {"name": "rob sands", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "constellation brands invests in canadian marijuana company", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "est  constellation brands inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Marijuana The Owner of Corona Beer Just Made a Bet on Legal Marijuana Marijuana plants are grown at Essence Vegas' 54,000-square-foot marijuana cultivation facility on July 6, 2017 in Las Vegas, Nevada. Ethan Miller—Getty Images By Bloomberg 1:19 PM EST \nConstellation Brands Inc. isn’t quite sure whether legal cannabis is friend or foe to the alcohol industry. Either way, it wants in. \nThe maker of Robert Mondavi wine, Corona beer and Svedka vodka is still waiting for the chips to fall into place after entering the up-and-coming (and turbulent) marijuana industry last year by taking a minority stake in Canada’s Canopy Growth. The rapid increase of the cannabis market has caused analysts to question whether drinkers could shift their spending to smoking as prohibitions on the plant’s recreational use are removed. \n“It’s probably not worth getting in a big debate right now about whether it’s cannibalistic or complementary,” Constellation Chief Executive Rob Sands said on a call with analysts Friday. “There’s just not enough information to really say how that’s going to effect beverage alcohol generally moving forward. What we do know is it’s going to be a big market worldwide.” \nThe Victor, New York-based company’s cannabis investment is being closely watched since it’s the first time that big alcohol has entered the so-called Green Rush. The scrutiny only intensified this week after U.S. Attorney General Jeff Sessions rescinded the Obama-era policy that let federal prosecutors look the other way while states set up their own markets for marijuana. The announcement followed California’s launch of a legal marketplace on Jan. 1. \nFor now, Sands says Constellation and Canopy are developing a nonalcoholic cannabis beverage for release when Canada’s government legalizes pot drinks, expected in 2019. \nConstellation could certainly use a new growth source. Its sales of wine and spirits have persistently fallen, and investors are starting to notice. \nShares of the company fell as much as 4.2 percent to $216.25 on Friday, the most intraday in more than 10 months, after it reported declines in volume and sales for wine and spirits. Constellation has ridden the strength of its imported Mexican beer to become an investor darling — 15 analysts recommend buying the shares and none recommend selling them — but even growth in that category was less than what some had expected. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-05T15:19:00.000+02:00", "crawled": "2018-01-05T22:10:06.034+02:00", "highlightTitle": ""}