{"organizations": [], "uuid": "e102d7ba35fb499c0a8a55bed1036d4a962f9e9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180106&t=2&i=1219832738&w=1200&r=LYNXMPEE050BB", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-spain/costa-scores-and-is-sent-off-on-home-debut-for-atletico-idUKKBN1EV0G3", "country": "US", "domain_rank": 408, "title": "Costa scores and is sent off on home debut for Atletico", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T16:03:00.000+02:00", "replies_count": 0, "uuid": "e102d7ba35fb499c0a8a55bed1036d4a962f9e9b"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-spain/costa-scores-and-is-sent-off-on-home-debut-for-atletico-idUKKBN1EV0G3", "ord_in_thread": 0, "title": "Costa scores and is sent off on home debut for Atletico", "locations": [], "entities": {"persons": [{"name": "diego costa", "sentiment": "none"}, {"name": "jose luis munuera montero", "sentiment": "none"}, {"name": "angel correa", "sentiment": "none"}, {"name": "djene dakonam", "sentiment": "none"}], "locations": [{"name": "costa", "sentiment": "none"}, {"name": "la liga", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "getafe", "sentiment": "none"}, {"name": "getafe - wanda metropolitano", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "costa", "sentiment": "negative"}, {"name": "atletico", "sentiment": "negative"}, {"name": "atletico reuters staf", "sentiment": "negative"}, {"name": "min read  madrid", "sentiment": "none"}, {"name": "wanda metropolitano", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "soccer football - la liga santander", "sentiment": "none"}, {"name": "atletico madrid", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 6, 2018 / 2:06 PM / Updated 43 minutes ago Celebrating Costa scores, sent off on Atletico return Reuters Staff 3 Min Read \nMADRID (Reuters) - Atletico Madrid’s Diego Costa scored on his home debut in a 2-0 win over Getafe and was immediately sent off for an over-zealous celebration as the former Chelsea striker marked a typically eventful return to La Liga on Saturday. Soccer Football - La Liga Santander - Atletico Madrid vs Getafe - Wanda Metropolitano, Madrid, Spain - January 6, 2018 Atletico Madrid's Diego Costa shoots at goal REUTERS/Javier Barbancho \nThe Spain striker hit the second goal in the 67th minute, after Angel Correa put Atletico ahead in the 18th, and rushed to the home fans behind the goal at the Wanda Metropolitano, creating a mini-surge as supporters ran down to embrace their returning hero who also played for the club from 2010-1024. \nLeaving the pitch to celebrate with the fans automatically incurs a booking and, as Costa had already been shown a yellow card for elbowing Djene Dakonam seven minutes earlier, referee Jose Luis Munuera Montero had no choice but to send him off. \nAtletico are second in the standings on 39 points, six behind leaders Barcelona who host Levante on Sunday. \nCosta, who returned to Atletico from Chelsea for 57 million pounds ($77.34 million) in September but could not play until January due to a ban on the club registering new players, will be suspended for Atletico’s next Liga game at Eibar on Jan. 13. \nThe 29-year-old had scored his first goal in his second spell at Atletico in a 4-0 win at Lleida Esportiu in the King’s Cup on Wednesday less than six minutes after coming on. HEROIC FIGURE \nCosta was a heroic figure at Atletico’s old home the Vicente Calderon for firing them to their first league title in 18 years in 2014, although their new 68,000-capacity stadium was far from full for his homecoming. Soccer Football - La Liga Santander - Atletico Madrid vs Getafe - Wanda Metropolitano, Madrid, Spain - January 6, 2018 Atletico Madrid's Diego Costa in action with Getafe’s Djene Dakonam REUTERS/Javier Barbancho \nThe early kick off on epiphany, one of the most important days of the Christmas period in Spain, and persistent rain could explain the low turnout, though Costa lifted the mood with an early shot from outside the area that whistled over the bar. \nAtletico had failed to score in their last league outing at Espanyol where they lost 1-0 but Costa brought extra aggression to their front line on Saturday, even though it was his strike partner Antoine Griezmann who played in Correa for the opener. Slideshow (3 Images) \nCosta was involved in an altercation with visiting defender Juan Cala at halftime in response to Getafe landing some meaty challenges on their opponents, setting the tone for a tension- filled second period which eventually saw the striker dismissed. \nAtletico coach Diego Simeone said he had no complaints about Costa’s sending off but also praised the striker for the galvanising impact he had on his side. \n“I’d like to focus on all the good things Costa did, his presence made us more direct, he strikes fear into opponents, everyone can see that and that makes us all so happy,” Simeone told reporters. \n“The referee is here to follow the rules and not make emotional decisions.” \nThird-placed Valencia host Girona later on Saturday before Sevilla play Real Betis in a local derby, while champions Real Madrid visit Celta Vigo on Sunday. \n($1 = 0.7370 pounds)", "external_links": [], "published": "2018-01-06T16:03:00.000+02:00", "crawled": "2018-01-06T16:38:13.050+02:00", "highlightTitle": ""}