{"organizations": [], "uuid": "740d5f1714727535007f18c6b3d48e85ea67dbf3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221165597&w=1200&r=LYNXMPEE0A19R", "site_section": "http://feeds.reuters.com/reuters/UKTennisNews/", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-zverev-becker/zverev-must-be-patient-says-becker-idUKKBN1F0221", "country": "US", "domain_rank": 408, "title": "INTERVIEW-Tennis-Zverev must be patient, says Becker", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T17:00:00.000+02:00", "replies_count": 0, "uuid": "740d5f1714727535007f18c6b3d48e85ea67dbf3"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-zverev-becker/zverev-must-be-patient-says-becker-idUKKBN1F0221", "ord_in_thread": 0, "title": "INTERVIEW-Tennis-Zverev must be patient, says Becker", "locations": [], "entities": {"persons": [{"name": "zverev", "sentiment": "negative"}, {"name": "becker martyn herman", "sentiment": "negative"}, {"name": "boris becker", "sentiment": "none"}, {"name": "becker", "sentiment": "none"}, {"name": "rafael nadal", "sentiment": "none"}, {"name": "reuters/tony o'brien", "sentiment": "none"}, {"name": "alexander zverev", "sentiment": "none"}, {"name": "roger federer", "sentiment": "none"}], "locations": [{"name": "wimbledon", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 3:24 PM / Updated 5 hours ago Zverev must be patient, says Becker Martyn Herman 3 Min Read \n(Reuters) - Boris Becker was a man in a hurry when he took Wimbledon by storm to win the title as a precocious 17-year-old in 1985 but says today’s game requires a little more patience. FILE PHOTO: Tennis - ATP World Tour Finals - The O2 Arena, London, Britain, November 14, 2017. Germany's Alexander Zverev in action during his group stage match against Switzerland's Roger Federer. Action Images via Reuters/Tony O'Brien/File Photo \nAlexander Zverev, Germany’s latest tennis hope and the man many predict can go some way to emulating Becker’s feats, found that out last year when, despite rising to fourth in the world rankings, the grand slams proved frustrating. \nA third-round defeat in the Australian Open by Rafael Nadal in five sets was nothing to be ashamed of and he also made the second week of Wimbledon, reaching the last 16. \nBut at the U.S. Open, when he was being lauded a potential champion, he buckled under the expectations and blew out in the second round to fellow youngster Borna Coric, playing what he described as his worst match of the season. \nHe will arrive in Melbourne as the fourth seed for the Australian Open, but Becker has urged caution, saying Zverev needs to be ready to play the long game. \n“For him the important thing is to get comfortably into the second week, get to the quarter-final and feel good about his game and then he will be very dangerous,” Becker, who will be working as an analyst for Eurosport during the tournament, told Reuters by telephone. \n”The tough thing when you are young is that you don’t have any patience. You want it to happen yesterday. Playing a grand slam over two weeks is tough for a 20-year-old to keep the concentration and keep the rhythm going. \n”It’s easier when you’re older and you have done it before. When you are 19 or 20 you want to play the final tomorrow! FILE PHOTO: Tennis - Australian Open - Melbourne Park, Melbourne, Australia, January 10, 2018. Germany's Alexander Zverev hits a shot during a practice session ahead of the Australian Open tennis tournament. REUTERS/David Gray/File Photo \n“But it’s a two-week process.” \nBecker, who stormed past Kevin Curren to win Wimbledon in 1985 and went on to win a total of six grand slams and top the rankings, is confident that Zverev will win a major. \n“He has all the tools,” he said. “He has shown last year when he won two Masters beating Novak (Djokovic) in one final and Roger (Federer) in another, which is as hard as it gets,” Becker said. \n“He has the quality to do it over a week, but needs a bit more experience to do it over two weeks.” \nZverev, who could face his older brother Mischa in the third round, is one of a number of rising stars who are trying to dislodge one of the greatest men’s generations ever. \nBecker believes Australian Nick Kyrgios is beginning to show the mentality to have a deep run in Melbourne. \nBlocking the way though is the 36-year-old reigning champion Federer who shows no sign of being ready to hand over power. \n“He must be celebrated and enjoyed because we’ll never see a player like him again, at least not in my lifetime,” Becker said. \n“What I hope is that he, Nadal, Djokovic and (Andy) Murray are all still at the top when the 20 somethings take over, not after they have declined.” Reporting by Martyn Herman, editing by Pritha Sarkar", "external_links": [], "published": "2018-01-11T17:00:00.000+02:00", "crawled": "2018-01-11T17:35:16.010+02:00", "highlightTitle": ""}