{"organizations": [], "uuid": "8672d1745ba7852247429ea1199c0c0ccae89a9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-evio-inc-announces-the-appointment-of-new-president-albert-lustig.html", "country": "US", "domain_rank": 767, "title": "EVIO Inc. Announces the Appointment of New President, Albert Lustig", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T16:30:00.000+02:00", "replies_count": 0, "uuid": "8672d1745ba7852247429ea1199c0c0ccae89a9b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-evio-inc-announces-the-appointment-of-new-president-albert-lustig.html", "ord_in_thread": 0, "title": "EVIO Inc. Announces the Appointment of New President, Albert Lustig", "locations": [], "entities": {"persons": [{"name": "albert lustig", "sentiment": "negative"}, {"name": "al lustig", "sentiment": "none"}, {"name": "william waldrop", "sentiment": "none"}, {"name": "lustig", "sentiment": "none"}], "locations": [{"name": "ore.", "sentiment": "none"}], "organizations": [{"name": "evio inc", "sentiment": "neutral"}, {"name": "pfizer", "sentiment": "none"}, {"name": "evio", "sentiment": "none"}, {"name": "pfizer inc", "sentiment": "none"}, {"name": "evio, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEND, Ore., Jan. 03, 2018 (GLOBE NEWSWIRE) -- EVIO, Inc. (OTCQB:EVIO), a life sciences company and leading provider of quality control testing and advisory services to the regulated cannabis industry, is pleased to announce the appointment of Al Lustig as President of EVIO, Inc., reporting to William Waldrop, EVIO Chief Executive Officer. Lustig’s primary responsibility will be to drive EVIO’s growth in both new and existing markets by developing and executing national and international sales and operational strategies.\nLustig joins EVIO after completing a successful 30-year career at Pfizer Inc. Lustig joined Pfizer in 1986 as a Professional Sales Representative and quickly ascended to positions of increased responsibility, leading to State Director. During his tenure at Pfizer, Lustig built, led and helped manage many district, regional and national sales organizations that consistently exceeded all performance expectations. Lustig redefined traditional business models that resulted in the successful introductions of new and innovative pharmaceuticals, generating both billions in sales and improving the lives of millions of patients. While at Pfizer, he also led many cross functional teams and partnered with senior leadership to help integrate Sales, Marketing, Medical, Operations, Strategy & Analytics and Government Relations across business operations.\nWilliam Waldrop, EVIO CEO states, “As we embark upon our next stage of rapid growth, Al’s history of recognized success in corporate growth and sales leadership at Pfizer, one of the world’s largest bio-pharmaceutical companies, makes him the perfect fit to help lead EVIO into 2018 and beyond. We look forward to leveraging Al’s leadership and expertise from the pharmaceutical sector. Current EVIO President and Chief Operating Officer Lori Glauser has resigned from her position as President to make room for Al in the Senior Leadership team. Ms. Glauser will remain with the company as Chief Operating Officer, leading both our advisory services division and laboratory expansion.”\nAbout EVIO, Inc.\nEVIO, Inc. is a life sciences company focused on analyzing cannabis as a means for improving quality of life. The Company provides analytical testing services, advisory services and performs product research in its accredited laboratory testing facilities. The Company’s EVIO Labs division operating coast-to-coast provides state-mandated ancillary services to ensure the safety and quality of the nation's cannabis supply.\nFor more information, visit www.eviolabs.com .\nSafe Harbor Statement\nAny statements in this press release that are not statements of historical fact maybe considered to be forward-looking statements. Statements may contain certain forward-looking statements pertaining to future anticipated or projected plans, performance and developments, as well as other statements relating to future operations and results. Words such as \"may,\" \"will,\" \"expect,\" \"believe,\" \"anticipate,\" \"estimate,\" \"intends,\" \"goal,\" \"objective,\" \"seek,\" \"attempt,\" or variations of these or similar words, identify forward-looking statements. These forward-looking statements by their nature are estimates of future results only and involve substantial risks and uncertainties, including but not limited to risks associated with the uncertainty of future financial results, additional financing requirements, development of new products, our ability to complete our product testing and launch our product commercially, the acceptance of our product in the marketplace, the uncertainty of the laws and regulations relating to cannabis, the impact of competitive products or pricing, technological changes, the effect of economic conditions and other uncertainties detailed from time to time in our reports filed with the Securities and Exchange Commission, available at www.sec.gov or www.eviolabs.com .\nCompany Contact:\nEVIO Inc.\nBend, OR\nwww.EVIOlabs.com\n888.544.EVIO\ninfo@EVIOlabs.com\nCommunications Contact:\nNetworkNewsWire (NNW)\nNew York, New York\nwww.NetworkNewsWire.com\n212.418.1217 Office\nEditor@NetworkNewsWire.com\nSource:EVIO, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=a8sCqLr2dbVRo9TdVlCYXcpFcf8XaPw2VJJWC5L8hSpSdy2CnROsu1cQudYIns9IoWVfZxbdws-fPKLrymh2VQ==", "https://www.globenewswire.com/Tracker?data=ctVPmOFqf-jGkE3tuSTMj_T3AQlFHSgmYOVFKeXoe2BH2XJuZY7lFtp_dcWW9_OI_4eQ6FhA0ixj0KCLkMcl6Q==", "https://www.globenewswire.com/Tracker?data=XvhldqmpgG1pMgTp2yu6OS-cDrMJcVMnNdILwPbLYkUl2THJcC-Q55TGN7_myfHV9wXEU1dQe92f0EmqlvRmcpNg7MXBqnKczSklqGle8zU=", "https://www.globenewswire.com/Tracker?data=jy0VLV6zIM6lIl8nypv0iEtgQrGuVmOVHSDUTcuH1tRBFd2g-U9NVqECnNxxAzvWEzTTqp7xiV4YKrEFVB1_SA==", "https://www.globenewswire.com/Tracker?data=ctVPmOFqf-jGkE3tuSTMjycZNut1NybjWoXQTdhTil_v4Sv_uBgmtOotFM8Ju3PPll5_ImV8LzHKdIwPh_GaYg=="], "published": "2018-01-03T16:30:00.000+02:00", "crawled": "2018-01-03T16:28:13.002+02:00", "highlightTitle": ""}