{"organizations": [], "uuid": "e1ba347d3fb9e63b7d03ea66c0cb33626d087906", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222778326&w=1200&r=LYNXMPEE0G1BP", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-senate-fdic/u-s-banking-official-critiques-senate-bill-aimed-at-easing-bank-rules-idUSKBN1F627S", "country": "US", "domain_rank": 408, "title": "U.S. banking official critiques Senate bill aimed at easing bank rules", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T00:52:00.000+02:00", "replies_count": 0, "uuid": "e1ba347d3fb9e63b7d03ea66c0cb33626d087906"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-senate-fdic/u-s-banking-official-critiques-senate-bill-aimed-at-easing-bank-rules-idUSKBN1F627S", "ord_in_thread": 0, "title": "U.S. banking official critiques Senate bill aimed at easing bank rules", "locations": [], "entities": {"persons": [{"name": "hoenig", "sentiment": "none"}, {"name": "thomas hoenig", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "senate", "sentiment": "negative"}, {"name": "senate banking committee", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "federal deposit insurance corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - A top official at a leading U.S. bank regulator is airing concerns about a Senate bill that would ease banking rules, saying parts of it could “significantly weaken” critical protections.\nThomas Hoenig, the vice chair of the Federal Deposit Insurance Corporation, warned lawmakers that efforts to ease new rules around leverage and proprietary trading could encourage banks to take on excessive amounts of risk, and put the stability of the financial system at risk.\nHoenig said he was broadly supportive of the bill primarily aimed at easing rules for smaller banks, crafted by Republicans and moderate Democrats on the Senate Banking Committee, but has concerns about a pair of key sections.\nIn particular, Hoenig warned Congress’s attempts to relax burdens around the Volcker Rule and the supplementary leverage ratio would do more harm than good.\nHoenig wrote in a Jan. 9 letter the two provisions “will remove important safeguards that could jeopardize the strides we have made towards stable, long-term economic growth.”\nIn particular, Hoenig cried foul over language that would exempt smaller, simpler banks from the Volcker Rule that bans proprietary trading.\nHoenig warned that as written, the bill could encourage those banks to take on more risk, and instead advocated for a different approach.\nRather than exempting some banks from the Volcker Rule altogether, Hoenig suggested a softer regulatory approach that would make it easier for banks to continue compliance.\nUnder the current rule, banks must prove to regulators a trade is not profit-seeking proprietary trading in order to complete it. Under Hoenig’s approach, the burden would be placed on bank supervisors, assuming trades are permitted unless regulators prove otherwise.\nHoenig also took issue with a provision that would allow custody banks to greatly reduce their capital. The bill would allow banks to exclude central bank reserves they hold for purposes of calculating the supplemental leverage ratio, a key regulatory restriction put in place to ensure banks have adequate capital.\nBut Hoenig argued such a change is precisely the wrong move, warning that custody banks are central cogs in the financial system and should be holding more capital, not less.\nHoenig’s warning may not lead lawmakers to alter the bill, which was carefully crafted to garner support from both parties.\nAn appointee of President Barack Obama, Hoenig’s term at the FDIC expires in April. His replacement has not yet been nominated by .\nThe bill was approved by the Senate Banking Committee in December and could be taken up by the full Senate in the coming weeks.\nReporting by Pete Schroeder; Editing by Bernadette Baum\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T00:52:00.000+02:00", "crawled": "2018-01-17T19:42:23.018+02:00", "highlightTitle": ""}