{"organizations": [], "uuid": "e77136aed7f2b03a71679bd8277808e3b5ad9b1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/britain-politics/rpt-update-3-britains-may-to-change-government-ministers-soon-senior-figures-reported-to-be-safe-idUSL8N1P30O5", "country": "US", "domain_rank": 408, "title": "RPT-UPDATE 3-Britain's May to change government ministers soon, senior figures reported to be safe", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T14:55:00.000+02:00", "replies_count": 0, "uuid": "e77136aed7f2b03a71679bd8277808e3b5ad9b1b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/britain-politics/rpt-update-3-britains-may-to-change-government-ministers-soon-senior-figures-reported-to-be-safe-idUSL8N1P30O5", "ord_in_thread": 0, "title": "RPT-UPDATE 3-Britain's May to change government ministers soon, senior figures reported to be safe", "locations": [], "entities": {"persons": [{"name": "william james", "sentiment": "negative"}, {"name": "william schomberg", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "none"}, {"name": "damian green", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats Jan 7 story with no changes to text)\nBy William James and William Schomberg\nLONDON, Jan 7 (Reuters) - British Prime Minister Theresa May said on Sunday she would announce changes to her ministerial team soon, with media reports saying her foreign, finance, interior and Brexit ministers would keep their jobs in a reshuffle starting on Monday.\nAfter running a poorly received campaign at a national election last year that badly damaged her authority, May is leading a delicately balanced minority government tasked with delivering Britain’s exit from the European Union. She is also under pressure to tackle a range of domestic policy problems.\nMay said ministerial changes were necessary following the departure of her long-standing ally and de-facto deputy prime minister, Damian Green, whom she forced to resign in December after he made misleading statements about pornography found pornography on computers in his parliamentary office.\n“Obviously, Damian Green’s departure before Christmas means that some changes do have to be made, and I will be making some changes,” she told the BBC in an interview recorded on Saturday for broadcast on Sunday.\nMay said the reshuffle would come soon, but did not give any further details.\nThe Sunday Times said foreign minister Boris Johnson, finance minister Philip Hammond, interior minister Amber Rudd and Brexit minister David Davis would not lose their jobs in the reshuffle. The report did not cite any sources.\nMay is also expected to announce a new first secretary of state to replace Green -- an important post with responsibility for maintaining unity in a cabinet still divided over the best approach to Brexit.\nMonday’s edition of the Daily Telegraph reported May would create a new post to provide regular updates to the Cabinet on preparations for leaving the EU without a trade deal -- an outcome the government says it wants to avoid, but is nevertheless drawing up contingency plans for.\nThe Sunday Times said changes were aimed at bringing younger women and non-white lawmakers into the Cabinet in attempt to appeal to improve the party’s image and regenerate support among voters.\nMay also said she was abandoning plans to give lawmakers a vote on overturning a ban on fox hunting with dogs -- one of several promises she made during last year’s snap election which went down badly with voters.\nMay earned plaudits in Europe and at home in December by securing progress in the complicated process of leaving the European Union, but her government has been criticised in recent days for rising rail fares and postponing hospital operations.\nThe Conservative Party is running neck and neck with the left-wing Labour Party in opinion polls and has been split by differences about what kind of relationship Britain should seek with the EU after it leaves the bloc in 2019.\nThe Sunday Times said the ministers who were expected to lose their jobs or move to different roles included Conservative Party chairman Patrick McLoughlin, education minister Justine Greening, business minister Greg Clark and Andrea Leadsom, the government’s leader in the lower house of parliament. (Reporting by William James and William Schomberg; Editing by Jeremy Gaunt and Sandra Maler)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T14:55:00.000+02:00", "crawled": "2018-01-09T16:52:25.039+02:00", "highlightTitle": ""}