{"organizations": [], "uuid": "2b458a6cc9ea89cbcd37f9cd16647603719d2e9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-global-cities-tech-inequality/wi-fi-but-no-water-can-smart-tech-help-a-citys-poor-idUSKBN1EU0JF", "country": "US", "domain_rank": 408, "title": "Wi-Fi but no water: Can smart tech help a city's poor?", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T14:48:00.000+02:00", "replies_count": 0, "uuid": "2b458a6cc9ea89cbcd37f9cd16647603719d2e9a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-global-cities-tech-inequality/wi-fi-but-no-water-can-smart-tech-help-a-citys-poor-idUSKBN1EU0JF", "ord_in_thread": 0, "title": "Wi-Fi but no water: Can smart tech help a city's poor?", "locations": [], "entities": {"persons": [], "locations": [{"name": "barcelona", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "barcelona", "sentiment": "negative"}, {"name": "thomson reuters foundation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BARCELONA (Thomson Reuters Foundation) - In the picturesque Barcelona district of El Born, residents can get a better night’s sleep nowadays because garbage trucks pass only when bins in the street are full, thanks to high-tech sensors that detect when they need to be emptied.\nMeanwhile, a few streets away, magnetic sensors under the road surface allow drivers to find out in advance if a parking space is free - saving them time and cutting back on vehicle emissions.\nOther high-technology solutions for street lamps, traffic lights and parking meters have been deployed in Spain’s second-largest city in recent years.\nOne theater is even decked with a smart vertical garden on its outer wall, which collects its own rainwater via a solar-powered system on the roof.\nAs one of Europe’s richest cities, most of Barcelona’s inhabitants already have good access to municipal services and a high quality of life.\nBut in poorer parts of the world, urban experts say efforts to improve cities with cutting-edge technology can run into challenges, particularly when applied in slums.\n“A 24-hour smart water meter can only be possible if you’re connected to the water system in the first place,” said Ayona Datta, a reader in urban futures at King’s College London.\nIn developing countries, technology may be introduced across a city to make transport or water services more efficient, but will likely only work in its richer areas, she added.\nThe idea of giving the same thing to everyone in both middle-class and low-income neighborhoods can be problematic, she said.\n“IT companies will sell (smart technology) as a package without any kind of customization at a grassroots level,” she said.\nSmart technology installed like this is “giving the icing on the cake to people who are already connected”, Datta told the Thomson Reuters Foundation.\nIn many cases, those who lack access to electricity or the internet cannot benefit from high-tech infrastructure, she added.\n“You really need to engage with the social context (and) social issues first,” she emphasized.\nINDIA CONTROVERSY In India, dozens of smart cities are planned as the South Asian nation seeks ways of coping with rapid growth in its urban population.\nBy 2050, India will have an additional 300 million urban residents, according to UN-Habitat, the U.N. agency that deals with cities.\nBut one high-profile “smart city” strategy for Dholera, in Gujarat state, has sparked opposition.\nIt involves a new 920-km (572-mile) metropolis on the edge of the ancient port city, set to run mostly on solar power and intended to become a global manufacturing hub.\nCritics say it will displace subsistence farmers, is at risk of inundation due to being built on a floodplain, and will cost more than planned.\n“A lot of smart city projects are real estate projects,” said Nancy Odendaal, an associate professor of urban planning at the University of Cape Town.\n“On the African continent this becomes particularly poignant as it is seen as the last frontier for property speculation and development,” she added.\nGENTRIFICATION In most of Africa, smart cities tend to be “top-down” projects to create satellite cities, like Konza Technopolis in Kenya and Eko Atlantic City in Nigeria, Odendaal noted.\nDubbed “Africa’s Dubai”, Eko Atlantic is being built on Victoria Island next to Lagos. Developers say it will become a new financial headquarters for Nigeria as well as solving chronic housing shortages in Lagos.\nDetractors argue that shiny urban centers like Eko Atlantic are designed for a wealthy elite, and do nothing to help poor communities living on their doorstep.\nElsewhere, smart city strategies have received a mixed reception.\nRwanda’s capital Kigali was praised for becoming one of the first cities in Africa to roll out free wireless internet in some areas in 2013.\nHowever, it has also been criticized for building new housing ordinary Rwandans cannot afford.\nIn South Africa’s Cape Town, some people see smart city projects as an excuse for gentrification - “just another way of turning old neighborhoods into swish, consumer zones”, said Odendaal.\n“KNOW YOUR CITY” Some of the most effective schemes are those that harness technology but are not marketed by governments as “smart”, she said.\nThey include Map Kibera, which began as a free, open digital map of Africa’s largest slum in the Kenyan capital, Nairobi. It has grown into an interactive project pinpointing local services and providing information about security in Kibera.\nIts developers, Map Kibera Trust, say the initiative gives visibility to marginalized communities, with two other Nairobi slums replicating the idea.\nNon-governmental groups like Slum Dwellers International (SDI) are also doing useful work at grassroots level, said Odendaal.\nThe network of community-based organizations representing the urban poor in 32 countries across Africa, Asia and Latin America runs a “Know Your City” campaign.\nSlum residents collect data and information about where they live, which is held in a central database and can be used by governments and other decision-makers.\nSDI says the data is owned by the community, and gives an “informed and united” voice to the urban poor.\n“Smart technology has very utopian intentions but it’s really about how it’s implemented on the ground,” said Datta. “It is very universal but has to be rooted in the context of a place in order for it to work.”\nCommunity-led initiatives can function especially well, as in India where local people have started sharing photos of suspected sex offenders on instant messaging service WhatsApp, she said.\n“Smart technology has had all sorts of unintended consequences,” she added. “What emerges can exist completely outside of state regulation.”\nReporting by Sophie Davies; editing by Megan Rowling. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, climate change, resilience, women's rights, trafficking and property rights. Visit news.trust.org/\n ", "external_links": ["http://news.trust.org/", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-05T14:48:00.000+02:00", "crawled": "2018-01-05T09:48:51.049+02:00", "highlightTitle": ""}