{"organizations": [], "uuid": "60624cca3ada9303dc9e5d24eb05875d72cb27d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223295140&w=1200&r=LYNXMPEE0I0HF", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-britain-economy-retail/retail-sales-slide-in-december-capping-tough-year-for-consumers-idUKKBN1F80XD", "country": "US", "domain_rank": 408, "title": "UK retail sales slide in December, capping tough year for consumers", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T15:25:00.000+02:00", "replies_count": 0, "uuid": "60624cca3ada9303dc9e5d24eb05875d72cb27d7"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-economy-retail/retail-sales-slide-in-december-capping-tough-year-for-consumers-idUKKBN1F80XD", "ord_in_thread": 0, "title": "UK retail sales slide in December, capping tough year for consumers", "locations": [], "entities": {"persons": [{"name": "william schomberg", "sentiment": "none"}, {"name": "andy bruce", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "office for national statistics", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 9:35 AM / Updated 2 hours ago UK retail sales slide in December, capping tough year for consumers Andy Bruce , William Schomberg 4 Min Read \nLONDON (Reuters) - British shop sales slid by much more than expected in December, capping off the weakest year for retail since 2013 as consumers squeezed by the Brexit hit to prices continued to keep a tight grip on spending. \nRetail sales volumes dropped 1.5 percent from November, the Office for National Statistics (ONS) said, well below economists’ forecasts of a monthly dip of 0.6 percent in a Reuters poll, and more than reversing a 1.0 percent rise in November. \nThat marked the biggest month-on-month fall since June 2016, the month Britons voted to leave the European Union, as well as the weakest December performance for seven years. \nBritain’s economy slowed in 2017 as higher inflation - caused by the post-referendum fall in the pound - hurt the spending power of consumers, although forecasts of a bigger hit to growth were confounded. \nFriday’s data pushed the pound down against the dollar and British government bond prices hit a session high. \nThe Bank of England, which is considering when to follow up on November’s first rate hike in a decade, expects the squeeze will ease in 2018 as inflation cools and wage growth ticks higher. Recent surveys of consumers suggest they do not share the central bank’s optimism right now. \n“The longer-term picture is one of slowing growth, with increased prices squeezing people’s spending,” ONS statistician Rhian Murphy said about Friday’s data. \nMany shoppers brought forward their Christmas spending into November to take advantage of Black Friday sales promotions, the ONS said. \nBlack Friday promotions have become commonplace in Britain only in the last few years, making it difficult for the ONS to adjust its data so figures for November and December can be compared easily from year to year. People shop for last-minute purchases before Christmas on Oxford Street in London, Britain December 23, 2017. REUTERS/Mary Turner \nBut whatever distortions were caused by Black Friday sales, analysts were doubtful it did retailers any good. \n“All of this discounting is likely to have decimated profit margins and retailers will be counting the cost,” said Richard Lim, chief executive at consultancy Retail Economics. \nOn Friday, Britain’s biggest floor coverings retailer Carpetright ( CPRC.L ) lost almost half of its stock market value after it warned on its full-year profits, blaming a drop in consumer confidence. \nRetailers have reported mixed fortunes over the Christmas period. \nLast week Britain’s biggest retailer Tesco ( TSCO.L ) missed forecasts for Christmas trading as strong food sales were undermined by weak demand for general goods such as DVDs and computer games. Discount supermarkets saw strong growth. \nLooking at the fourth quarter as a whole, which smooths out monthly volatility in the data, the ONS said sales growth slowed to 0.4 percent, compared with 0.8 percent in the third quarter. \nAs a result, retail sales will contribute almost nothing to economic growth in the last three months of 2017. \nRetail sales volumes for 2017 as a whole grew by 1.9 percent, a far cry from the 4.7 percent increase in 2016 and marking the weakest full-year performance since 2013. \nIn annual terms, retail sales volumes grew 1.4 percent in December, weaker than all forecasts in the Reuters poll. Sales in November grew 1.5 percent. Related Coverage", "external_links": [], "published": "2018-01-19T15:25:00.000+02:00", "crawled": "2018-01-19T16:11:28.009+02:00", "highlightTitle": ""}