{"organizations": [], "uuid": "e00ee8e567abe7525d3bf844f24ad4e1764650a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224249485&w=1200&r=LYNXMPEE0L1U4", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-turkey-politicia/syrian-kurds-will-likely-not-attend-russias-sochi-congress-politician-idUSKBN1FB2LL", "country": "US", "domain_rank": 408, "title": "Syrian Kurds will likely not attend Russia's Sochi congress: politician", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.127, "site_type": "news", "published": "2018-01-23T02:44:00.000+02:00", "replies_count": 0, "uuid": "e00ee8e567abe7525d3bf844f24ad4e1764650a4"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-turkey-politicia/syrian-kurds-will-likely-not-attend-russias-sochi-congress-politician-idUSKBN1FB2LL", "ord_in_thread": 0, "title": "Syrian Kurds will likely not attend Russia's Sochi congress: politician", "locations": [], "entities": {"persons": [{"name": "aldar khalil", "sentiment": "none"}], "locations": [{"name": "beirut", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "kurdish-run afrin", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "movement for a democratic society", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIRUT (Reuters) - Syrian Kurdish officials will likely not attend a Syrian peace congress planned by Russia which has been rendered meaningless by “Russian collusion” with Turkey in its attack in the Afrin region, a Syrian Kurdish politician said on Monday.\nRussia plans to host the congress in Sochi on Jan. 29-30.\nOfficials in the Kurdish-led administration that governs swathes of northern Syria had previously said they had been invited to the Sochi meeting, and would attend.\nBut Aldar Khalil, co-leader of a Movement for a Democratic Society, told Reuters the likelihood that Kurdish officials would not go to Sochi was now greater than the likelihood of them attending the meeting.\n“Naturally in light of the Turkish attack on our areas and the Russian collusion with them (Turkey), and the Russian support for them, Sochi no longer has any meaning in order to participate in it,” he added.\nHe was referring to a Turkish offensive in the Kurdish-run Afrin region of northwestern Syria, launched with the stated aim of crushing the YPG militia which controls the area.\nThe YPG, an ally of the United States in its campaign against Islamic State, has accused Russia of giving Turkey a greenlight for the attack by withdrawing its own forces from Afrin in recent days.\nKhalil, seen as one of the most influential Syrian Kurdish politicians, said that while Kurdish officials had been invited earlier in the preparations for Sochi, they had subsequently received no formal invitations or details about the meeting.\nTurkish President Tayyip Erdogan said on Monday that Turkey had an agreement with Russia regarding its military campaign against the YPG in Afrin and that Ankara would not take a step back from the operation.\nThe Kremlin said that Russian officials are in contact with the Turkish leadership over the Afrin military operation.\nKremlin spokesman Dmitry Peskov declined to comment when asked if Moscow had known in advance about the operation. He said Russia continued to believe in the fundamental importance of Syria’s territorial integrity.\nThe main Syrian Kurdish groups have been left out of U.N.-led peace talks on Syria, in line with the wishes of Turkey which views the YPG as an extension of the Kurdistan Workers’ Party (PKK), which has fought a three-decade-long insurgency in Turkey and is listed as a terrorist group by the United States, the European Union and Turkey.\nEditing by Janet Lawrence and William Maclean\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T02:44:00.000+02:00", "crawled": "2018-01-23T17:59:51.000+02:00", "highlightTitle": ""}