{"organizations": [], "uuid": "c3d74d5c6d2e56fc6409726e88fa09481af13ee4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928319-GettyImages-814600256.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/22/facebook-says-democracy-can-be-harmed-on-its-platform.html", "country": "US", "domain_rank": 767, "title": "Facebook says democracy can be harmed on its platform", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T16:31:00.000+02:00", "replies_count": 0, "uuid": "c3d74d5c6d2e56fc6409726e88fa09481af13ee4"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/22/facebook-says-democracy-can-be-harmed-on-its-platform.html", "ord_in_thread": 0, "title": "Facebook says democracy can be harmed on its platform", "locations": [], "entities": {"persons": [{"name": "cass sunstein", "sentiment": "none"}, {"name": "samidh chakrabarti", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "contrite facebook", "sentiment": "none"}, {"name": "harvard university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Getty Images Mark Zuckerberg, chief executive officer and founder of Facebook in July 2017 \nFacebook warned on Monday that it could offer no assurance that social media was on balance good for democracy, but the company said it was trying what it could to stop alleged meddling in elections by Russia or anyone else. \nThe sharing of false or misleading headlines on social media has become a global issue, after accusations that Russia tried to influence votes in the United States, Britain and France. Moscow denies the allegations. \nFacebook, the largest social network with more than 2 billion users, addressed social media's role in democracy in blog posts from a Harvard University professor, Cass Sunstein, and from an employee working on the subject. \n\"I wish I could guarantee that the positives are destined to outweigh the negatives, but I can't,\" Samidh Chakrabarti, a Facebook product manager, wrote in his post. \nFacebook, he added, has a \"moral duty to understand how these technologies are being used and what can be done to make communities like Facebook as representative, civil and trustworthy as possible.\" \nContrite Facebook executives were already fanning out across Europe this week to address the company's slow response to abuses on its platform, such as hate speech and foreign influence campaigns. \nU.S. lawmakers have held hearings on the role of social media in elections, and this month Facebook widened an investigation into the run-up to Britain's 2016 referendum on EU membership. \nChakrabarti expressed Facebook's regrets about the 2016 U.S. elections, when according to the company Russian agents created 80,000 posts that reached around 126 million people over two years. \nThe company should have done better, he wrote, and he said Facebook was making up for lost time by disabling suspect accounts, making election ads visible beyond the targeted audience and requiring those running election ads to confirm their identities. \nTwitter and Alphabet 's Google and YouTube have announced similar attempts at self-regulation. \nChakrabarti said Facebook had helped democracy in ways, such as getting more Americans to register to vote. \nSunstein, a law professor and Facebook consultant who also worked in the administration of former U.S. President Barack Obama, said in a blog post that social media was a work in progress and that companies would need to experiment with changes to improve. \nAnother test of social media's role in elections lies ahead in March, when Italy votes in a national election already marked by claims of fake news spreading on Facebook. Related Securities", "external_links": [], "published": "2018-01-22T16:31:00.000+02:00", "crawled": "2018-01-22T15:54:02.000+02:00", "highlightTitle": ""}