{"organizations": [], "uuid": "119bddd22127f257de5ebe3acb3efde7c167ddd2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-blue-medora-expands-leadership-team-to-support-continued-growth.html", "country": "US", "domain_rank": 767, "title": "Blue Medora Expands Leadership Team to Support Continued Growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-16T19:00:00.000+02:00", "replies_count": 0, "uuid": "119bddd22127f257de5ebe3acb3efde7c167ddd2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-blue-medora-expands-leadership-team-to-support-continued-growth.html", "ord_in_thread": 0, "title": "Blue Medora Expands Leadership Team to Support Continued Growth", "locations": [], "entities": {"persons": [{"name": "blue medora", "sentiment": "negative"}, {"name": "bill cordero", "sentiment": "none"}, {"name": "medora", "sentiment": "none"}, {"name": "patrick", "sentiment": "none"}, {"name": "nathan owen", "sentiment": "none"}, {"name": "pat) deane", "sentiment": "none"}], "locations": [{"name": "mich.", "sentiment": "none"}], "organizations": [{"name": "blue medora", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GRAND RAPIDS, Mich., Jan. 16, 2018 (GLOBE NEWSWIRE) -- Blue Medora today announces two executive appointments, strengthening the leadership team of its growing business. Patrick (Pat) Deane has joined as Blue Medora’s first full-time Chief Financial Officer and Bill Cordero has joined as its Vice President of Worldwide Channels.\nBlue Medora is a leading innovator in IT monitoring integration solutions for the most common application performance, cloud and database management platforms.\nThe two appointments are significant in strengthening Blue Medora’s back office operations and dramatically extending its go to market capabilities around the globe, as Blue Medora continues to attract record numbers of new customers. Many of these customers are looking to adopt monitoring integration software as a more comprehensive service.\n“We are thrilled to bring these two seasoned executives on board as part of Blue Medora’s continued growth and expansion,” explains Nathan Owen, CEO and co-founder of Blue Medora. “On the heels of our recent Series B1 funding, we are now in a position to establish new levels of capabilities to scale the business. Welcoming Pat and Bill in these key roles is going to play an important role in that growth.”\nPat Deane brings a deep, strategic financial and operational leadership with over 25 years of experience building and transforming technology and other rapid-growth firms with revenues approaching $500M and acquisition values exceeding $230M. He also has a proven track record raising nearly $50M in capital and debt through PE, VCs, corporate, grants, and other funding sources and then applying rock-solid treasury skills to maximize capital efficiencies. Most recently he was President of BizFlex Solutions in Grand Rapids. “Blue Medora has demonstrated the ability to operate a high-velocity operation from the Midwest focused on customers and innovation. Having led similarly fast growing organizations on both coasts, I am excited to work with the team and prepare our business for success at scale,” said Deane.\nBill Cordero is an industry veteran with over 15 years of sales leadership and experience building world class Channel businesses for leading companies including Rubrik, Netscreen Technologies, StorSimple and Data Domain. “The opportunity to build the global channel for Blue Medora is immense, based on market leading products solving very real monitoring integration challenges. With an already strong bench of partners in place, I look forward to expanding our reach to create a world class channel organization.”\nBlue Medora continues to advance delivering IT monitoring integration as-a-Service. Since its founding, Blue Medora has innovated deep performance inspection capabilities across disparate enterprise technologies, at tremendous scale and quality. Blue Medora’s IT system data portfolio now stands at more than 50 different technologies, enhancing the monitoring and analytics engines of VMware, New Relic, Oracle and others. This “full stack” approach solves unique challenges for customers seeking best of breed telemetry and management across multiple IT teams, operating across hybrid/heterogeneous environments.\nAbout Blue Medora\nBlue Medora software extends the leading cloud management, APM and IT operational analytics platforms by bringing in critical health, performance and relationship data on the underlying compute, storage and network infrastructure. Blue Medora also offers its own heterogeneous database performance-monitoring platform, SelectStar that combines comprehensive database and cloud infrastructure monitoring to help organizations track and optimize critical database performance and availability metrics.\nBlue Medora’s products enable IT operations and DevOps teams to work collaboratively and proactively to avoid downtime, resolve performance problems and make better decisions using more comprehensive analytics. Blue Medora believes true visibility into business-critical applications is only achieved when enterprise technology teams unlock the potential of their data.\nAnn O'Leary\nBlue Medora\nann.oleary@bluemedora.com\nP: +1 650 996 0778\nSource: Blue Medora", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/861b4ba3-5986-456b-a0e9-6fe445458448", "https://www.globenewswire.com/Tracker?data=cabOvxiUUywbMNUhiHJQKaXnJgZhM8JySJlLNocoQs071-DEw5uOgINJypM1VeCG0o9HOeOKv63mMr_HNJEqGw==", "https://www.globenewswire.com/Tracker?data=cabOvxiUUywbMNUhiHJQKRuSJRdawUw3CjHHjFXRLVTGc8ClKvkMua_dXJFqbzHteNstgZMUYCjtBMh4zqrruQ==", "https://www.globenewswire.com/Tracker?data=gjk8xit_hGJMMwmX1YR_NNSQ9Yht9OIcV-W1705p4zV6WLZmqeeZWPhHbV-aL9s57kIqpVoXAvvykB12zMxiYOq_EmIepRB35-AqRBbawcY="], "published": "2018-01-16T19:00:00.000+02:00", "crawled": "2018-01-16T18:26:20.001+02:00", "highlightTitle": ""}