{"organizations": [], "uuid": "fc677de75c6d5e91d73ccd22d5dc26f9ae6fd581", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104938337-_Y2A0140.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/22/money-secrets-that-wealthy-successful-people-know.html", "country": "US", "domain_rank": 767, "title": "Money secrets that wealthy, successful people know", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T23:39:00.000+02:00", "replies_count": 0, "uuid": "fc677de75c6d5e91d73ccd22d5dc26f9ae6fd581"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/22/money-secrets-that-wealthy-successful-people-know.html", "ord_in_thread": 0, "title": "Money secrets that wealthy, successful people know", "locations": [], "entities": {"persons": [{"name": "warren buffett", "sentiment": "none"}, {"name": "robert kiyosaki", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ask most personal finance experts, and they'll tell you the secret to becoming rich is no secret at all: Work hard, live below your means and save every dime. There's no shame in a modest lifestyle — even Warren Buffett lives frugally.\nIf your goal is to join the 1-percenters, though, it helps to approach money like the ultra-wealthy do.\n1. Salary isn't the whole story Climbing the corporate ladder will only get you so far; at some point, you reach your earning potential and plateau. The rich know that in order to grow wealth, it's important to make your money work hard for you — not the other way around. In fact, Robert Kiyosaki, author of the No. 1 best-selling personal finance book, \"Rich Dad, Poor Dad,\" built his entire money philosophy around this concept.\nMore from GOBankingRates:\nWhat first-time investors need to know\n10 things wealthy people do every day\n10 things Mark Cuban says to do with your money\nGenerating income from passive, rather than active, income sources is the best way to do this. Investments that yield passive income include dividend-paying securities, rental properties, profits from a business you do not directly manage on a daily basis and royalties on creative work or inventions.\nLearn the resolutions you need to stick to in order to get rich this year .\n2. Take advantage of time not timing No one can predict what the market will do tomorrow. The wealthy know this and make no attempt to moonlight as day traders.\n\"Time is more important to investment success than timing,\" said Peter Lazaroff, a certified financial planner for Plancorp, LLC. \"Most of the population believes that timing the market's moves is the key to growing rich through the stock market. The wealthy, however, understand that time and compound returns are the most important factors in growing wealth.\"\nThough it might seem counterintuitive, getting rich requires investors to adopt an unsexy buy-and-hold strategy, ride out market fluctuations and ignore speculation.\nshow chapters Former single mother, now multimillionaire: Here's when I knew I was wealthy 1:01 PM ET Tue, 14 March 2017 | 00:58 3. Put it in writing The difference between having an idea and putting it on paper is often what separates the uber-successful from average folks. And if you equate success with wealth, it might be time to start writing down your goals, both large and small, in order to become rich.\nThomas Corley, author of \"Rich Habits: The Daily Success Habits of Wealthy Individuals,\" noted that 67 percent of the wealthy people he surveyed wrote down their goals, while 81 percent kept a to-do list. If your goal is to become a multimillionaire, write it down, along with an action plan for making it happen.\n4. Understand value over cost Justin J. Kumar, a senior portfolio manager at Arlington Capital Management, said, \"The wealthy person has three best friends: her attorney, her accountant and her advisor. The wealthy tend to use the law and tax code to their advantage when figuring out how to maximize their wealth, especially over multiple generations, and they are not afraid to spend money up front for counsel to get these answers.\"\nKumar explained that it's common for middle-income Americans to cut corners in order to save money, yet ultimately find the results lacking. \"The wealthy look at value over cost, but they are still prudent in their decisions,\" he said.\n5. Eat out less People who are concerned with saving money often skip the daily latte. The rich enjoy small splurges such as Starbucks whenever they want and instead look at saving from a broader perspective .\nAuthor Paul Sullivan and colleague Brad Klontz, a clinical psychologist with an academic appointment at Kansas State University, conducted research on the differences in spending habits of the 1 percent and the 5 percent. The 1 percent spent 30 percent less on eating out and saved it for retirement instead. \"And that, more than the cost of a Starbuck's latte, is what, over time, separates the wealthy from everyone else on the wrong side of the thin green line,\" Sullivan wrote in Fortune.\n6. Be your own boss Employees work to make their bosses rich. If you're aiming for true wealth, consider starting your own business. According to Forbes, nearly all of the 1,426 people on its list of billionaires made their fortunes through a business they or a family member had a hand in creating.\n\"Many middle-class workers think that starting a business is too risky,\" said Robert Wilson, a financial advisor and frequent contributor to CNN, NBC and CBS. \"The wealthy understand that what's risky is allowing your time and earnings to be dictated by a boss who couldn't care less about whether you get what you want for your life.\"\nshow chapters Rich people use these 6 mental tricks to make more money 12:09 PM ET Fri, 2 June 2017 | 01:10 7. Use other people's money To the average person, \"it takes money to make money\" sounds like a tired cliche used to justify irrational spending. For the rich, it's a golden rule of wealth. The key is leveraging other people's money to increase your own wealth .\n\"Trading time for dollars is a loser's game, especially as technology destroys many jobs that don't require a highly skilled human being,\" said Wilson. \"Using money from banks or investors and hiring people to work for you is a time-tested formula for building wealth, not to mention the tax laws, which heavily favor businesses.\"\nWhether you're fundraising to start a business or flipping real estate for a profit, relying on other people's money to do the heavy lifting greatly increases the return. Of course, it's also riskier than relying on your own funds. But according to the sage words of the great Warren Buffett, \"Risk comes from not knowing what you're doing.\"\n8. Have a saving strategy Everyone knows that saving money is an essential part of being rich, but saving is sometimes easier said than done. While the average person might put aside money here and there, wealthy people decide on a fixed amount they will save from every paycheck and put it directly into a savings or retirement account .\n\"Take a percentage of what you earn, no matter how little you earn or how much you earn,\" said Tony Robbins, life and business strategist and author of the book \"Unshakeable: Your Financial Freedom Playbook\" in an interview with GOBankingRates. \"A percentage of that has to be set aside that you're going to keep for you and your family ... When you get a 15, 20 percent savings rate and you put it in a place where it's compounding, you're going to be financially free.\"\n9. Change your thinking \"There's no shortage of money on planet Earth, only a shortage of people who think correctly about it,\" said Grant Cardone, international sales expert, best-selling author and radio show host of The Cardone Zone in an Entrepreneur article. \"To become a millionaire, you must end the poverty thinking.\"\nIn addition to banishing fears of scarcity, you have to truly believe you'll be rich to get rich, he said.\n\"I went from nothing — no money, just ideas and a lot of hard work — to create a net worth that probably cannot be destroyed in my lifetime. The first step was making a decision and setting a target,\" said Cardone. \"Every day for years, I wrote down this statement: 'I am worth over $100,000,000!' \"\nSet a goal and focus your thinking on believing that you can achieve it. Learn the money mantras to live by if you want to be rich .\nshow chapters This engineer quit his day job to build 'secret doors' 4:39 PM ET Fri, 24 Feb 2017 | 00:59 10. Invest in yourself Successful people know that it's worth investing time, money and energy to improve yourself. That can entail reading a self-improvement book, taking a class or learning new skills .\n\"I invested in sales training when I was 25,\" said Cardone in a CNBC article. \"That made my income-producing ability skyrocket. Investing in yourself is the best investment you can make.\"\n11. Only take a job if there's potential for growth Even if you are not earning a large salary right away, it's important to be at a company where you can climb the ladder .\n\"The rich are able to get in with the right company where there is opportunity for growth,\" said Cardone in the CNBC post. \"My VP of sales Jarrod Glandt started working for me over seven years ago for $2,500 a month. He wasn't making anything but he was in the right vehicle. He grew his skillset and was able to multiply his monthly income many times over because he knew I was looking to expand.\"\n12. Don't pay with credit cards If you want to be wealthy, it's important to never live above your means. One way to ensure that is to only spend money you actually have, rather than charging purchases on a credit card.\n\"Cut up your credit cards ,\" said billionaire and \"Shark Tank\" star Mark Cuban in a personal blog post. \"If you use a credit card, you don't want to be rich… Cash is king for those wanting to get rich.\"\n13. Pursue your passion Rich people get rich when they do something they are passionate about. If you don't love what you do, you won't put in the time and effort needed to become successful .\nJim Koch traded in a stable job at Boston Consulting Group in 1984 to start Boston Beer Co., the business that created Samuel Adams Boston Lager. Koch was driven by his personal love of beer to start the now multi-million-dollar business.\n\"The most common thing I remind people of is to only pursue something you love, because a small business is going to be very demanding of your time, your energy — it just eats your life. And if you're doing something you love, then you will accept and even enjoy that,\" Koch told Business Insider. \"If you're just doing it to get rich, you're going to lose heart.\"\n14. Buck trends When it comes to investing strategy, don't be afraid to go against the grain.\nBillionaire Warren Buffet amassed his wealth by investing in companies that he saw potential in, even if they had been overlooked by others. \"I will tell you the secret of getting rich on Wall Street. Close the doors,\" he said in the book \"Buffett: The Making of an American Capitalist.\" \"You try to be greedy when others are fearful, and you try to be very fearful when others are greedy.\"\nCasey Bond contributed to the reporting for this article.\nDon't miss: Self-made millionaire: Forget skipping Starbucks. Here are 5 real ways to get rich\nLike this story? Like CNBC Make It on Facebook !\nThis article originally appeared on GOBankingRates.\nshow chapters This survival silo for the super rich costs $3M per floor 6:33 PM ET Wed, 25 Jan 2017 | 02:53", "external_links": [], "published": "2018-01-22T23:39:00.000+02:00", "crawled": "2018-01-23T00:30:33.001+02:00", "highlightTitle": ""}