{"organizations": [], "uuid": "2e4208c28d4f219d916a7fcec606aee21963f5dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/cnbc-interview-with-mark-weinberger-eys-global-chairman-from-the-world-economic-forum-2018.html", "country": "US", "domain_rank": 767, "title": "CNBC Interview with Mark Weinberger, EY’s Global Chairman, from the World Economic Forum 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-23T09:59:00.000+02:00", "replies_count": 0, "uuid": "2e4208c28d4f219d916a7fcec606aee21963f5dc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/cnbc-interview-with-mark-weinberger-eys-global-chairman-from-the-world-economic-forum-2018.html", "ord_in_thread": 0, "title": "CNBC Interview with Mark Weinberger, EY’s Global Chairman, from the World Economic Forum 2018", "locations": [], "entities": {"persons": [{"name": "mark weinberger", "sentiment": "negative"}, {"name": "akiko fujita", "sentiment": "none"}, {"name": "akiko", "sentiment": "none"}, {"name": "nancy", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}], "organizations": [{"name": "cnbc interview", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Following are excerpts from a CNBC interview with Mark Weinberger, Global Chairman of EY and CNBC's Akiko Fujita, from the World Economic Forum 2018.\nAF: Ah, hi there, Nancy. Well, now we've got another big business leader joining us here on set. We are joined by Mark Weinberger, who is Global Chairman and CEO of EY. Great to have you on today!\nMW: Thank you, Akiko, good to see you.\nAF: Yes, everybody keeps talking about all the snow, and just how warm it is on set in contrast.\nMW: I know-,\nAF: Nice to have that, right?\nMW: It's-, you've got a nice setup here, I must say.\nAF: Yes. So you've been-, this is your sixth year here-,\nMW: Yes.\nAF: At Davos, you're an old hand, I guess we could say, but what is-, what's the discussion that's happening this year, in terms of, you know, where we are in the global economic cycle. Markets getting a bit too frothy, perhaps? Some concerns on that front. Potential geopolitical risks. What's the sentiment among CEOs here in Davos this year?\nMW: So, good question, Akiko. This year, we're probably more optimistic, with, obviously, synchronized growth around the world, broad-based growth around the world, we're seeing confidence, increased investment by businesses more, they've restructured themselves, profitability up, financial markets up, jobs and hiring is up. All extremely positive. Certainly, though, we can't ignore the fact that there's still a lot of turmoil out there, and last year we were talking about very different issues, one year does not completely change the scenario. So, I think this year, we're going to talk a lot about some of the good things that have happened, certainly accommodative monetary policy, but also have to focus on the things that created the uncertainties last year, like income inequality-,\nAF: Mm.\nMW: Like the need to make sure technology innovation continues in an inclusive way, not just letting the rich get richer, and the left rest out-, the rest left out. So, that's going to be a lot of the discussion, I'm expecting, while we're here, and of course, always, we'll talk about women, and trying to get them more embedded in to the workforce.\nAF: You talk about the contrast from last year. This time last year, the focus was-, or the concern was about whether protectionism was really taking hold here. There were concerns about elections coming up, over in Europe, as well. It does seem like those concerns have subsided. Where do you think that is right now, in terms of risk?\nMW: Well, I think they've subsided, as you said. Remember, last year, coming in, we had-, right off the heels of Brexit, right off the heels of Donald Trump, who'd never had any role in the United States government before, coming and taking over, right off the heels, or going in to, this past year, many elections that people were worried about, in France, in Germany, and Austria. That's all now behind us. So, they have obviously been resolved in a way that nationalism did not result in-, in the nationalistic candidates winning. But, we can't lose sight of the fact that, in each one of those elections, there were increased seats by the nationalist parties. And so there is still this underlying sentiment, and, Akiko, that's what I really think we can't lose sight of. We can't be complacent, and think, all of a sudden, just because there wasn't, last year, a huge change in governance and move towards complete protectionism, we're going to see, this year, trade wars, we're going to see continue nationalistic policies, we're seeing it today, and we have to stay focused on that.\nAF: Let's talk about the US, because you are the Committee Chair, for the Business Roundtable Tax and Fiscal Policy, just coming on the back of that big tax bill being passed over in the US. You're talking with CEOs that you work with closely about what exactly this means, and how you use that investment-,\nMW: Yes.\nAF: That comes from the tax cuts. What's the discussion right now?\nMW: So, there's no doubt that this is a landmark change in tax policy in the United States. Now, it doesn't make the United States a tax haven. It comes up with a 21% rate. Changes to a more international system, where you're not going to have worldwide taxation, just taxation on your domestic earnings, so you can move capital back. It comes with incentives for investment in-, in plant and equipment, called expensing. All of those things means corporations will have more cashflow, and to your point, there's a question, will they just give it to shareholders, in the form of dividends and stock buybacks? Or will they invest in capital equipment, increasing productivity and hiring? We've seen 200 plus US businesses, already, give bonuses to their employees, increase their pension funds, announce big investment plans in-, in plant and equipment. I think you will continue to see that. You will also see, though, where investment isn't-, and opportunity's not there, they will use that money to give money back to their shareholders in some form, which include pension funds, and many other things. So, I think we're going to see, over the next several months, that playing out.\nAF: What, specifically, has EY done? You've argued that this tax bill will create more jobs, lead to more growth. What are the specific numbers you're looking at, at EY?\nMW: So, EY is a partnership, so we don't have the corporate relief that was given, but we're going to hire 65,000 people again this year, that's what we hired last year, across the world. Some 15,000 in the United States, 25,000 across Europe. Our fastest growth will be in-, in Asia. We're seeing-, last year, we grew nearly 20% in India, 30% in China. So, it's really, like, the economy's growing across the world, we're growing. What's different for us, Akiko, is that we're going to be hiring, in addition to traditional tax and audit and consulting and M&A skills, data scientists, and digital experts. We now have 21,000 people who are experts in data and science, and that's changing our hiring needs.\nAF: Let's talk about one more thing, which has been a passion project of years, which is gender equality.\nMW: Yeah.\nAF: This year here at Davos, the first time in 48 years, Davos is being Co-Chaired by all women. There's no question, there is a broader debate that's happening here, but I wonder what is waiting on the other end, and how companies address this issue.\nMW: Yeah, there's no doubt that this is sending a great signal, with the several Co-Chairs here all being women, but it's not just those at the top that we need to be looking at. We need to be looking at-, we still need more women to be participating in the corporate ranks here. Like any business, you can look and measure a company's diversity by just at the top, but what really matters is giving women, and all minorities, an opportunity in the ranks, to get operating experience, get on the biggest accounts, learn the new skillsets so they can rise to the top, and hire more. And I think that's what we've got to work on, when we-, when we look at skillset development.\nAF: Okay, Mark, unfortunately we're out of time, but it's great to have you on set early this morning. Thank you so much, and Nancy, we'll toss it back to you.", "external_links": [], "published": "2018-01-23T09:59:00.000+02:00", "crawled": "2018-01-23T11:59:51.001+02:00", "highlightTitle": ""}