{"organizations": [], "uuid": "bbe87c2497e74b3c3bde8a070a97c8570db2fe91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-sbg-technology-solutions-ceo-carlos-del-toro-elected-president-of-the-white-house-fellows-foundation-and-association.html", "country": "US", "domain_rank": 767, "title": "SBG Technology Solutions' CEO, Carlos Del Toro, Elected President of the White House Fellows Foundation and Association", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-29T15:27:00.000+02:00", "replies_count": 0, "uuid": "bbe87c2497e74b3c3bde8a070a97c8570db2fe91"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-sbg-technology-solutions-ceo-carlos-del-toro-elected-president-of-the-white-house-fellows-foundation-and-association.html", "ord_in_thread": 0, "title": "SBG Technology Solutions' CEO, Carlos Del Toro, Elected President of the White House Fellows Foundation and Association", "locations": [], "entities": {"persons": [{"name": "carlos", "sentiment": "negative"}, {"name": "del toro", "sentiment": "none"}, {"name": "lyndon b. johnson", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "alexandria", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "carlos del toro", "sentiment": "negative"}, {"name": "white house fellows foundation and association", "sentiment": "negative"}, {"name": "sbg technology solutions", "sentiment": "negative"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ALEXANDRIA, Va., Jan. 29, 2018 /PRNewswire/ -- President and CEO of SBG Technology Solutions, Carlos Del Toro, has recently been elected President of the White House Fellows Foundation and Association ( www.whff.org ). The White House Fellows Foundation and Association is instrumental in ensuring the ongoing success of the White House Fellows program and provides support to advance a legacy of leadership and contributions to the public good.\nFounded in 1964 by Lyndon B. Johnson, the White House Fellows program is one of America's most prestigious programs for leadership and public service. White House Fellowships offer exceptional young men and women first-hand experience working at the highest levels of the federal government.\nSelected individuals typically spend a year working as a full-time, paid Fellow to senior White House Staff, Cabinet Secretaries and other top-ranking government officials. Fellows also participate in an education program consisting of roundtable discussions with renowned leaders from the private and public sectors, and trips to study U.S. policy in action both domestically and internationally. Fellowships are awarded on a strictly non-partisan basis.\nAs a White House Fellow from 1998-1999, Carlos Del Toro served as a Special Assistant to the Director and Deputy Director of the Office of Management and Budget. On the appointment to lead the White House Fellows Foundation and Association, Carlos Del Toro said, \"I am deeply humbled and honored to be elected as President and I am passionate about further strengthening the bonds that make the White House Fellowship the premier leadership program in the nation.\"\nIn his role as President, Carlos Del Toro will serve on the President's Commission on White House Fellows. He also aims to foster enhanced relationships between current fellows, alumni, commissioners, and other stakeholders to further strengthen the program. In addition to focusing on recruiting talented candidates to apply to the program, Carlos Del Toro is responsible for leading and planning several significant events for White House Fellows and alumni.\nFollowing a 27-year career in the Navy, Carlos Del Toro founded SBG Technology Solutions in 2004. Today, SBG Technology Solutions has successfully matured into one of the premier small government contractors in the country. SBG provides advanced and cost effective technology solutions to a wide array of federal agencies and commercial clients including the Army, Army National Guard, Defense Threat Reduction Agency, Defense Intelligence Agency, Department of Veterans Affairs, Department of Defense, Department of Homeland Security, and the Navy. SBG's sterling reputation supporting government customers over the past thirteen years has solidified its reputation as an innovative and reliable business partner. Additional information about SBG Technology Solutions can be found at, http://sbgts.com/ .\nFor information about the White House Fellows program, please visit https://www.whitehouse.gov/get-involved/fellows/\nView original content with multimedia: http://www.prnewswire.com/news-releases/sbg-technology-solutions-ceo-carlos-del-toro-elected-president-of-the-white-house-fellows-foundation-and-association-300589410.html\nSOURCE SBG Technology Solutions", "external_links": ["http://www.whff.org/", "https://www.whitehouse.gov/get-involved/fellows/", "http://sbgts.com/", "http://www.prnewswire.com/news-releases/sbg-technology-solutions-ceo-carlos-del-toro-elected-president-of-the-white-house-fellows-foundation-and-association-300589410.html"], "published": "2018-01-29T15:27:00.000+02:00", "crawled": "2018-01-29T16:38:13.002+02:00", "highlightTitle": ""}