{"organizations": [], "uuid": "1c4026bce79de96b3c6c33fa031c3e9d066352dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1219928763&w=1200&r=LYNXMPEE0600K", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-golf-sentry/johnson-grabs-lead-in-tournament-of-champions-idUKKBN1EW00T", "country": "US", "domain_rank": 408, "title": "Johnson grabs lead in Tournament of Champions", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T03:02:00.000+02:00", "replies_count": 0, "uuid": "1c4026bce79de96b3c6c33fa031c3e9d066352dc"}, "author": "", "url": "https://uk.reuters.com/article/uk-golf-sentry/johnson-grabs-lead-in-tournament-of-champions-idUKKBN1EW00T", "ord_in_thread": 0, "title": "Johnson grabs lead in Tournament of Champions", "locations": [], "entities": {"persons": [{"name": "reu", "sentiment": "negative"}, {"name": "johnson", "sentiment": "negative"}, {"name": "brian", "sentiment": "none"}, {"name": "jon rahm", "sentiment": "none"}, {"name": "dustin johnson", "sentiment": "none"}, {"name": "brian harman", "sentiment": "none"}], "locations": [{"name": "kapalua plantation", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}, {"name": "maui", "sentiment": "none"}, {"name": "kapalua resort", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "pga", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 1:07 AM / Updated 7 hours ago Johnson grabs lead in Tournament of Champions Reuters Staff 2 Min Read \n(Reuters) - World number one Dustin Johnson put the hammer down and surged to a two-shot lead after the third round at the Sentry Tournament of Champions in Hawaii on Saturday. Jan 6, 2018; Maui, HI, USA; PGA golfer Dustin Johnson tees off on the 18th hole during the third round of the Sentry Tournament of Champions golf tournament at Kapalua Resort - The Plantation Course. Mandatory Credit: Brian Spurlock-USA TODAY Sports \nBoosted by an eagle at the par-four 12th, where he flicked a 70-yard shot into the hole, Johnson matched the day’s best score with a seven-under-par 66. \nJohnson, who drove the ball prodigious distances, posted a 16-under 203 total, while joint halfway leader Brian Harman remained in the hunt with a steady 69 to stand alone at 14-under on another breezy day at the Kapalua Plantation course on Maui. \nSpaniard Jon Rahm played the final five holes in five under to match Johnson’s 66 and trail by four shots. \n“I drove it really well, obviously that’s a big bonus around here, and I hit a lot of good iron shots and I feel like I‘m rolling it well (on the greens),” Johnson told Golf Channel. \nHis eagle did not hurt his score either. Jan 6, 2018; Maui, HI, USA; PGA golfers Dustin Johnson (left) and Pat Perez walk the 18th hole during the third round of the Sentry Tournament of Champions golf tournament at Kapalua Resort - The Plantation Course. Mandatory Credit: Brian Spurlock-USA TODAY Sports \n“I landed my shot perfect and it got on the green and tracked to the hole,” he said of the shot, which he landed some 30 yards short of the cup and watched as he ball rolled down the steep slope and into the hole. \nJohnson had been in similar imperious form early last season before he had to withdraw from the Masters following a fall down some stairs. \nA bruised back kept him out of action for four weeks and by time he regained his form the majors had passed, and attention had turned to the likes of Justin Thomas and Jordan Spieth. \nJohnson, however, is showcasing similarly good form in Hawaii and is determined not to repeat the experience of last October when he surrendered a six-shot lead in the final round at the HSBC Champions in Shanghai. \n“That was just kind of a fluke day,” he said. \n”I was playing a new set of irons and I wasn’t that comfortable with them. I‘m a lot more comfortable with them now. I feel like I can control the ball very well. \n“I’ve got a good game plan around here. I‘m not going to play any different tomorrow.” Reporting by Andrew Both in Cary, North Carolina; Editing by Greg Stutchbury", "external_links": [], "published": "2018-01-07T03:02:00.000+02:00", "crawled": "2018-01-07T03:47:51.005+02:00", "highlightTitle": ""}