{"organizations": [], "uuid": "1b402a05ca8af111c9a4a8e04bfbcbd313a9e90f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-lanes-2018-food-beverage-beat-now-available.html", "country": "US", "domain_rank": 767, "title": "LANE's 2018 Food & Beverage Beat Now Available", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T16:00:00.000+02:00", "replies_count": 0, "uuid": "1b402a05ca8af111c9a4a8e04bfbcbd313a9e90f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-lanes-2018-food-beverage-beat-now-available.html", "ord_in_thread": 0, "title": "LANE's 2018 Food & Beverage Beat Now Available", "locations": [], "entities": {"persons": [{"name": "lane", "sentiment": "negative"}, {"name": "wendy lane stevens", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "portland", "sentiment": "none"}, {"name": "ore.", "sentiment": "none"}], "organizations": [{"name": "finn partners company", "sentiment": "negative"}, {"name": "lane", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PORTLAND, Ore. and NEW YORK, Jan. 19, 2018 /PRNewswire/ -- LANE , a Finn Partners Company, has released its 2018 Food & Beverage Beat. The agency's ninth annual report (found here: http://www.lanepr.com/2018-food-beverage-beat/ ) reveals trends that are rising – and some that are receding – in the food and beverage industry in the year ahead. LANE tapped six experts to weigh in on issues that will resonate with consumers and the industry, from flavors that will dominate menus, to the implications of price versus value, to perceptions about beer in cans.\n\"The food and beverage industry is a constant source of innovation and inspiration. Chefs, proprietors and producers are constantly evolving their offerings to not only meet the changing tastes of consumers but deliver some unexpected surprises that capture the imagination and grow into the next big thing,\" said Wendy Lane Stevens, managing partner at LANE. \"We're excited to share what some influential voices consider to be critical to the direction of the industry in the coming year.\"\nKey findings indicate continued focus on individual, environmental health\nEthnic foods provide an introduction to a wide variety of flavors, textures and preparations, and consumers will be hungering for new culinary experiences in 2018. Experts think exploration of ethnic cuisines will increase, particularly with culinary offerings from regions in the Middle East, Africa and Southeast Asia that have been relatively underrepresented. As a result, diners can expect to encounter more spice and more vegan and vegetarian options. Additionally, this exploration dovetails nicely with Americans' desire to adopt more plant-based foods into their diets, for both health and environmental reasons. Restaurants should do their part, as some adopt efforts to \"close the loop\" by composting food waste to grow fresh produce for their establishments.\nThe seemingly growing disparity between America's haves and have-nots should also command attention in the coming year as it relates to diet, nutrition and overall health. Panelists anticipate more discussion around price and nutritional value, as well as the trade-offs of low-cost food in terms of health issues such as obesity and diabetes. While this may be the year for Americans to head back to the kitchen to cook something good, it will be important to recognize the barriers facing those without the means to take advantage of better-for-you ingredients.\nSome additional trends and issues anticipated to take center stage in 2018 include the following:\nA slight shift away from prescribed diets and toward more intuitive eating and drinking as consumers start paying closer attention to what their bodies indicate they need. Persistent popularity of meal planning and meal prep services as consumers continue to be pressed for time but are inspired to cook meals at home that are simple, nutritious and delicious. Greater attention paid to hard cider, craft beer in cans, Pacific Northwest wines and a Brazilian spirit, cachaça. Continued importance of technology in driving consumers to try restaurants, bars and other establishments, but balanced by an increased realization that loyalty depends on creating an individualized experience and customized feel.\nLANE drew upon the expertise of half a dozen individuals with unique perspectives on the industry, who weighed in with viewpoints from the culinary, medical and media fields. The following individuals participated in the 2018 Food & Beverage Beat panel:\nJulie Arnan , a Seattle-based freelance writer specializing in the \"good life.\" She recently passed the introductory course of the Court of Master Sommeliers and is working toward sommelier certification. A lexis (Lexi) Davidson , the voice behind Lexi's Clean Kitchen —the go-to food blog for clean and delicious recipes that shows readers that a healthy lifestyle can be simple, fun and satisfying. Pete Dunlop , a Portland-based writer, author and marketing professional. He has written for numerous beer-centric publications, and his blog, Beervana Buzz , covers local, regional and national beer topics. Douglas Katz , the owner and executive chef of fire food and drink ; owner of The Katz Club Diner in Cleveland Heights; and chef/partner of Provenance, Provenance Cafe and Catering by Provenance at the Cleveland Museum of Art. Heidi Larsen , a magazine designer turned photographer / writer / recipe creator / influencer at FoodieCrush.com , the blog and online magazine featuring mostly seasonal, often healthy recipes created to inspire people to cook real simple, real good food. Walter C. Willett , M.D., Dr. P.H., a professor of epidemiology and nutrition at Harvard T.H. Chan School of Public Health and a professor of medicine at Harvard Medical School. A National Academy of Medicine member, he has published over 1,800 articles .\nFor each expert's full take on the state of the food and beverage industry in 2018, access the complete 2018 Food & Beverage Beat at http://www.lanepr.com/2018-food-beverage-beat/ . For further information on LANE and its expertise within the industry, please visit lanepr.com .\nAbout LANE, a Finn Partners Company\nLANE, a Finn Partners Company, is focused on driving business and sales success for clients through strategic communications counsel. With offices in New York and Portland, Oregon, and a presence in Seattle, Washington, LANE provides integrated public relations services for clients in a host of industries, including financial services, consumer, travel and hospitality, food and beverage, and technology. Founded in 1990, the agency has won several awards, including the 2011 Silver SABRE Award, the 2010 Bronze Bulldog Award for best new product launch and the 2009 PRWeek Young PR Professional of the Year. For more information about LANE, visit www.lanepr.com . Connect with LANE on Twitter , Instagram and LinkedIn .\nAbout Finn Partners\nFounded in 2011 on the core principles of innovation and collaborative partnership, Finn Partners has more than tripled in size in six years, becoming one of the fastest-growing independent public relations agencies in the world. The full-service marketing and communications company's record-setting pace is a result of organic growth and integrating new companies and new people into the Finn Partners world through a common philosophy. With 575 professionals, Finn Partners provides its clients with global access and capabilities in the U.S., Europe and Asia, in addition to PROI Worldwide. Headquartered in New York, Finn Partners also has offices located in Chicago, Detroit, Fort Lauderdale, Frankfurt, Jerusalem, London, Los Angeles, Munich, Nashville, Paris, Portland, San Francisco, Shanghai, Singapore and Washington, D.C. Find us at finnpartners.com and follow us on Twitter and Instagram at @finnpartners.\nMedia Contact:\nWendy Lane Stevens\n503-221-0480\nwendy@lanepr.com\nView original content: http://www.prnewswire.com/news-releases/lanes-2018-food--beverage-beat-now-available-300585020.html\nSOURCE LANE", "external_links": ["http://www.beervanabuzz.com/", "https://www.instagram.com/juliearnan/", "https://lexiscleankitchen.com/", "http://linkedin.com/company/lane", "http://www.lanepr.com/", "https://firefoodanddrink.com/", "http://www.lanepr.com/2018-food-beverage-beat/", "https://www.foodiecrush.com/", "http://www.twitter.com/lanepr", "http://www.instagram.com/lanepr_", "http://www.prnewswire.com/news-releases/lanes-2018-food--beverage-beat-now-available-300585020.html", "https://www.hsph.harvard.edu/walter-willett/publications/"], "published": "2018-01-19T16:00:00.000+02:00", "crawled": "2018-01-19T16:05:08.043+02:00", "highlightTitle": ""}