{"organizations": [], "uuid": "93c03ccea73b8378eace3d9027bfcc9a7e2eda6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-index-wallows-at-3-year-lows-euro-buoyed-by-ecb-taper-hopes-idUSL3N1PA223", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar index wallows at 3-year lows, euro buoyed by ECB taper hopes", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.013, "site_type": "news", "published": "2018-01-15T13:15:00.000+02:00", "replies_count": 0, "uuid": "93c03ccea73b8378eace3d9027bfcc9a7e2eda6f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-index-wallows-at-3-year-lows-euro-buoyed-by-ecb-taper-hopes-idUSL3N1PA223", "ord_in_thread": 0, "title": "FOREX-Dollar index wallows at 3-year lows, euro buoyed by ECB taper hopes", "locations": [], "entities": {"persons": [{"name": "masafumi yamamoto", "sentiment": "none"}, {"name": "lisa twaronite", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "mizuho securities", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Hopes of further ECB tapering push euro to over 3-year highs\n* Dollar skids to lowest since September against yen\n* Speculators’ net short USD bets rise in latest week -CFTC\nBy Lisa Twaronite\nTOKYO, Jan 15 (Reuters) - The dollar languished at three-year lows against a basket of currencies on Monday, while the euro stood tall on investors’ hopes that European Central Bank policymakers could be poised to further trim their monetary stimulus.\nThe dollar index, which tracks the greenback against a basket of currencies, slipped 0.2 percent to 90.807 after falling as far as 90.773 earlier in the session, its lowest since January 2015.\nThe euro added 0.1 percent to $1.2206, in sight of a peak of $1.2218 on Friday, its highest since December 2014, leaving some strategists to ponder where its next top might be.\n“I think the strength of the euro is overdone,” said Masafumi Yamamoto, chief currency strategist at Mizuho Securities.\n“The strength of the euro itself will delay the ECB’s normalization. The ECB is conducting verbal tightening, so they don’t need to move on interest rates.”\nAgainst the yen, the dollar slipped to its lowest levels since mid-September, as comments from Japan’s central bank governor highlighted Japan’s economic recovery.\nWhile Bank of Japan Governor Haruhiko Kuroda reiterated the central bank’s resolve to maintain its massive stimulus programme until 2 percent inflation is achieved stably, he also said the country’s economy was expected to continue moderately expanding.\nCore consumer prices are rising around 1 percent, Kuroda said in a speech to BOJ regional branch managers. This was a slight change from his previous speech to branch managers, when he said core consumer prices were around zero.\nThe dollar was 0.3 percent lower at 110.73 yen, after earlier falling as far as 110.63.\n“We continue to see dollar/yen sellers, to be honest,” said Bart Wakabayashi, branch manager for State Street Bank in Tokyo.\n“Let’s see if we start to see some rumblings from Japanese officials, about yen strength,” he said. “We might see some comments to calm market expectations of yen strength.”\nSterling edged up 0.1 percent to $1.3739, probing its highest levels against the dollar since the Brexit vote in June, 2016.\nThe British currency jumped on Friday, after a media report that the Netherlands and Spain were open to a deal for Britain to remain as close as possible to the European Union.\nThe pound shrugged off a denial from officials from the Spanish and Dutch finance ministries, who said there was no new agreement between the countries on how Britain should leave the EU.\nSpeculators’ net short dollar positions rose in the latest week through Jan. 9 to their largest since mid-October, according to calculations by Reuters and Commodity Futures Trading Commission data released on Friday. (Reporting by Lisa Twaronite; Editing by Richard Borsuk)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T13:15:00.000+02:00", "crawled": "2018-01-16T13:26:02.009+02:00", "highlightTitle": ""}