{"organizations": [], "uuid": "feaeadadb5e6e3f907ef85b181f2c771ce4b7314", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226764250&w=1200&r=LYNXMPEE0U01B", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-afghanistan-taliban-study/taliban-active-in-70-percent-of-afghanistan-bbc-study-finds-idUKKBN1FK03E", "country": "US", "domain_rank": 408, "title": "Taliban active in 70 percent of Afghanistan, BBC study finds", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T02:37:00.000+02:00", "replies_count": 0, "uuid": "feaeadadb5e6e3f907ef85b181f2c771ce4b7314"}, "author": "", "url": "https://uk.reuters.com/article/uk-afghanistan-taliban-study/taliban-active-in-70-percent-of-afghanistan-bbc-study-finds-idUKKBN1FK03E", "ord_in_thread": 0, "title": "Taliban active in 70 percent of Afghanistan, BBC study finds", "locations": [], "entities": {"persons": [], "locations": [{"name": "afghanistan", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "taliban", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 12:38 AM / Updated 19 minutes ago Taliban active in 70 percent of Afghanistan, BBC study finds Reuters Staff 3 Min Read \nWASHINGTON (Reuters) - The Taliban are openly active in 70 percent of Afghanistan’s districts, fully controlling 4 percent of the country and demonstrating an open physical presence in another 66 percent, according to a BBC study published on Tuesday. \nThe BBC estimate, which it said was based on conversations with more than 1,200 individual sources in all districts of the South Asian country, was significantly higher than the most recent assessment by the NATO-led coalition. \nThe coalition said on Tuesday that the Taliban contested or controlled only 44 percent of Afghan districts as of October 2017. \nAfghanistan has been reeling over the past nine days from a renewed spate of violence that is adding scrutiny to the latest, more aggressive U.S.-backed strategy to bolster Afghan forces battling the Taliban in a 16-year-old war. \nA bomb hidden in an ambulance struck the city centre and killed more than 100 people, just over a week after an attack on the Hotel Intercontinental, also in Kabul, which left more than 20 people dead, including four U.S. citizens. \nThe BBC counted 399 districts in Afghanistan, but the NATO-led force counted 407. The reason for the discrepancy was not immediately clear. \nThe BBC study said the Afghan government controlled 122 districts, or about 30 percent of the country. Still, it noted, that did not mean that they were free from Taliban attacks. \n“Kabul and other major cities, for example, suffered major attacks - launched from adjacent areas, or by sleeper cells - during the research period, as well as before and after,” the report said. \nAsked about the BBC’s study, the Pentagon did not comment directly, but pointed to the latest figures by the NATO-led coalition asserting that about 56 percent of Afghanistan’s territory was under Afghan government control or influence. \nCaptain Thomas Gresback, a spokesman for the coalition in Kabul, said the BBC estimate overstated the militants’“influence impact”. \n“This is a criminal network, not a government in waiting,” Gresback said in an emailed statement. \n“What really matters is not the number of districts held, but population controlled. RS assesses that around 12 percent of the population is actually under full Taliban control,” he said, referring to the Resolute Support mission. \nThe study by Britain’s public broadcaster quoted a spokesman for Afghan President Ashraf Ghani playing down the findings. \nThe BBC study also said Islamic State had a presence in 30 districts, but noted it did not fully control any of them. Reporting by Phil Stewart, addional reporting by Robert Birsel in KABUL; Editing by G Crosse and Nick Macfie", "external_links": [], "published": "2018-01-31T02:37:00.000+02:00", "crawled": "2018-01-31T02:57:41.027+02:00", "highlightTitle": ""}