{"organizations": [], "uuid": "fe481be0bef63c18009da1f4dd2e5e9a9d6be176", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222487266&w=1200&r=LYNXMPEE0F1A7", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-italy-election-renzi/whats-up-with-italys-renzi-asks-fiat-chief-marchionne-idUKKBN1F52AH", "country": "US", "domain_rank": 408, "title": "What's up with Italy's Renzi, asks Fiat chief Marchionne", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T19:49:00.000+02:00", "replies_count": 0, "uuid": "fe481be0bef63c18009da1f4dd2e5e9a9d6be176"}, "author": "", "url": "https://uk.reuters.com/article/uk-italy-election-renzi/whats-up-with-italys-renzi-asks-fiat-chief-marchionne-idUKKBN1F52AH", "ord_in_thread": 0, "title": "What's up with Italy's Renzi, asks Fiat chief Marchionne", "locations": [], "entities": {"persons": [{"name": "marchionne", "sentiment": "negative"}, {"name": "renzi", "sentiment": "negative"}, {"name": "marchionne crispian ba", "sentiment": "negative"}, {"name": "matteo renzi", "sentiment": "none"}, {"name": "sergio marchionne", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "milan", "sentiment": "none"}], "organizations": [{"name": "fiat", "sentiment": "negative"}, {"name": "ferrari", "sentiment": "none"}, {"name": "min read  rome", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}, {"name": "fiat chrysler", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "fiat chrysler automobiles", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 5:51 PM / Updated 2 hours ago What's up with Italy's Renzi, asks Fiat chief Marchionne Crispian Balmer 3 Min Read \nROME (Reuters) - Italy’s centre-left leader Matteo Renzi is no longer the politician he once was, the chief executive of Fiat Chrysler Automobiles said on Tuesday, indicating their once strong ties had withered. FILE PHOTO: Italian Prime Minister Matteo Renzi (L) receives a Ferrari's Formula One replica from FCA Chief Executive and Ferrari Chairman Sergio Marchionne during Ferrari's sport car maker debut at the Milan's stock exchange, downtown Milan, January 4, 2016. REUTERS/Stefano Rellandini/File Photo \nRenzi resigned as prime minister in 2016 after losing a referendum on electoral reform. Although he remained in charge of the ruling Democratic Party (PD), he has struggled to regain the political initiative and is trailing in the opinion polls ahead of a March 4 national election. \n“I always liked him as a person. I don’t understand what has happened to him,” Fiat Chrysler’s Sergio Marchionne told Italian reporters at the Detroit auto show. “The Renzi that I used to support hasn’t been seen for a while,” he added. \nThere was no immediate response from Renzi. As head of one of Italy’s iconic companies, Marchionne’s comment will carry far in the country. \nRenzi raised eyebrows when he struck up a close rapport with Marchionne during his three years in government, defying the leftist tradition of standing arm-in-arm with the unions rather than big bosses. \nAn unapologetic Renzi explained the shift by saying his priority was to help job creators and accused unions of looking after the interests of pensioners rather than workers. \nHardliners quit the PD last year, complaining that the party had shifted too far to the right. They have created a breakaway group called Free and Equal which has hurt Renzi in the polls. \nAfter winning 40 percent in European parliamentary elections in 2014, the PD is now predicted to win only around 23 percent backing in March against some 37 percent for the centre-right bloc and 27 for the anti-establishment 5-Star Movement. \n“Renzi has squandered political capital and has failed basically,” said Giovanni Orsina, professor of modern history at Rome’s Luiss University, predicting further schisms within the PD if it loses more ground in the forthcoming election. \nWhile Renzi’s own approval rating has dropped in line with that of his party, other PD heavyweights still enjoy strong support -- notably Prime Minister Paolo Gentiloni, who emerged as Italy’s most respected politician in a weekend poll. \nThe Ixe survey said Gentiloni had a 35-percent approval rating, against 27 percent for the next most popular leader, the head of 5-Star, Luigi Di Maio. \nRenzi hinted on Sunday that he might not thrust himself forward once more as prime minister should the PD pull off a shock win in March, raising speculation that he might endorse instead the mild-mannered Gentiloni in an effort to win votes. \nFrench President Emmanuel Macron and European economic and financial affairs commissioner Pierre Moscovici have both warmly praised Gentiloni in recent days, making clear that he is their preferred candidate to regain power. \n“It is up to Italians to decide how to vote, but let me say that Europe has been very lucky to have Gentiloni and I hope we can continue the work that we have started,” Macron told a news conference in Rome last week. Reporting by Crispian Balmer Additional reporting by Agnieszka Flak in Milan Editing by Jeremy Gaunt", "external_links": [], "published": "2018-01-16T19:49:00.000+02:00", "crawled": "2018-01-16T20:07:39.009+02:00", "highlightTitle": ""}