{"organizations": [], "uuid": "33936d9632dfc50e2fce6c4a5aafb213bb3ad9bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-strattec-security-corporation-reports-fiscal-2018-second-quarter-operating-results.html", "country": "US", "domain_rank": 767, "title": "STRATTEC SECURITY CORPORATION Reports Fiscal 2018 Second Quarter Operating Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.069, "site_type": "news", "published": "2018-01-26T00:00:00.000+02:00", "replies_count": 0, "uuid": "33936d9632dfc50e2fce6c4a5aafb213bb3ad9bb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-strattec-security-corporation-reports-fiscal-2018-second-quarter-operating-results.html", "ord_in_thread": 0, "title": "STRATTEC SECURITY CORPORATION Reports Fiscal 2018 Second Quarter Operating Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "milwaukee", "sentiment": "none"}], "organizations": [{"name": "strattec security corporation", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MILWAUKEE, STRATTEC SECURITY CORPORATION (NASDAQ:STRT) today reported operating results for the fiscal second quarter ended December 31, 2017.\nNet sales for the Company’s fiscal second quarter ended December 31, 2017 were $103.2 million, compared to net sales of $98.9 million for the prior year quarter ended January 1, 2017. Net income for the current year quarter was $2.9 million, compared to net income of $398,000 in the prior year quarter. Diluted earnings per share for the current year quarter were $0.78 compared to diluted earnings per share of $0.11 in the prior year quarter.\nFor the six months ended December 31, 2017, net sales were $205.6 million compared to net sales of $199.2 million during the prior year six month period. Net income during the current year six month period was $5.3 million compared to net income of $1.9 million during the prior year six month period. Diluted earnings per share were $1.44 for the current year six month period ended December 31, 2017 compared to diluted earnings per share of $0.53 for the prior year six month period ended January 1, 2017.\nNet sales to each of our customers or customer groups in the current year quarter and prior year quarter were as follows (in millions):\nThree Months Ended December 31, 2017 January 1, 2017 Fiat Chrysler Automobiles $ 22.0 $ 22.8 General Motors Company 21.4 22.2 Ford Motor Company 16.1 14.3 Tier 1 Customers 16.5 17.3 Commercial and Other OEM Customers 19.8 13.6 Hyundai / Kia 7.4 8.7 TOTAL $ 103.2 $ 98.9 The sales to Fiat Chrysler Automobiles in the current year quarter decreased compared to the prior year quarter due to a combination of lower content on the components we supply on certain vehicles, the discontinuation of the Chrysler 200 in December 2016 and lower production volume on the Chrysler Pacifica minivan. The decrease in sales to General Motors Company in the current year quarter was primarily attributed to lower vehicle production volumes and content on products we supplied Opel Automotive GmbH as part of our General Motors business in the prior year quarter. We now supply these products directly to Opel Automotive which sales are now included under “Commercial and Other OEM Customers” above. Sales to Ford Motor Company increased in the current year quarter due to a combination of higher production volumes and content on components we supply compared to the prior year quarter. Sales to Tier 1 Customers decreased in the current year quarter due to lower sales on our driver control products. Sales to Commercial and Other OEM Customers during the current year quarter increased in comparison to the prior year quarter mainly due to new customer programs at Honda of America Manufacturing, Inc. These customers, along with the Tier 1 Customers, primarily represent purchasers of vehicle access control products, such as latches, fobs, driver controls and door handles, that we have developed in recent years to complement our historic core business of locks and keys. The decrease in sales to Hyundai / Kia in the current year quarter was principally due to lower levels of production on vehicles for which components we supply.\nThe gross profit margins were 12.3 percent in the current year quarter compared to 13.8 percent in the prior year quarter. The decrease in gross profit margin in the current year quarter compared to the prior year quarter was attributed to a continuation from our previous quarter of higher production and expediting costs associated with new product launches occurring in fiscal year 2018, in particular in connection with the start-up of our new paint facility in Leon, Mexico. The gross profit margins in the current quarter were also impacted by an unfavorable Mexican Peso to U.S. Dollar exchange rate affecting our operations in Mexico.\nEngineering, Selling and Administrative expenses as a percentage of net sales decreased to 9.8 percent in the current year quarter from 11.4 percent in the prior year quarter. Overall, expenses were lower in the current year quarter primarily due to utilizing fewer third party vendors for a portion of our new product development work as compared to the prior year quarter.\nIncluded in “Other Income, Net” in the current year quarter compared to the prior year quarter were the following items (in thousands of dollars):\nDecember 31, January 1, 2017 2017 Equity Earnings of VAST LLC Joint Venture $ 1,404 $ 642 Equity Earnings (Loss) of STRATTEC Advanced Logic LLC Joint Venture 69 (413 ) Net Foreign Currency Transaction (Loss) Gain (64 ) 568 Other 173 (142 ) $ 1,582 $ 655\nThe increase in equity earnings of VAST LLC in the current year quarter compared to the prior year quarter relates primarily to higher sales and profitability at our VAST China operations.\nThe estimated impact of the new Federal tax law change “Tax Cuts and Jobs Act” in the current year quarter reduced income tax expense by $545,000 and increased diluted earnings per share by $0.15. The higher income tax provision in the prior year quarter compared to the current year quarter related to a dividend paid from our Mexican subsidiaries to our U.S. parent company that increased our income tax expense by $424,000 in the prior year quarter and reduced diluted earnings per share by $0.12.\nFrank Krejci, President and CEO commented: “Profitability was negatively impacted beginning last fiscal year, in part due to additional engineering expenses related to record amounts of new business won. While the additional engineering activities continue at a significantly lower level, we are now in the manufacturing development and start- up phases of this new business and look forward to moving into full production. In addition, we continue to ramp up our new Leon, Mexico facility for painting and assembling vehicle door handles.\nLast quarter, our Invis-A-Rise Power Liftgate system for the Honda Odyssey made us a finalist for the prestigious PACE Awards, which will be announced in April. Its quiet operation and cleaner look, due to the elimination of added spindles which are now commonplace, make it a market leading design.\nInnovation at STRATTEC was demonstrated again this quarter. Our power system to both raise and lower the tail gate on new pick-up trucks, like the 2019 Chevrolet Silverado, debuted at the Detroit Auto Show. The product was prominently featured in a Motor Trend magazine article about exciting new designs and was also noted in Automotive News”.\nSTRATTEC designs, develops, manufactures and markets automotive Access Control Products, including mechanical locks and keys, electronically enhanced locks and keys, steering column and instrument panel ignition lock housings, latches, power sliding side door systems, power lift gate systems, power deck lid systems, door handles and related products. These products are provided to customers in North America, and on a global basis through a unique strategic relationship with WITTE Automotive of Velbert, Germany and ADAC Automotive of Grand Rapids, Michigan. Under this relationship, STRATTEC, WITTE and ADAC market our companies' products to global customers under the “VAST” brand name. STRATTEC’s history in the automotive business spans over 110 years.\nCertain statements contained in this release are “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. These statements may be identified by the use of forward-looking words or phrases such as “anticipate,” “believe,” “could,” “expect,” “intend,” “may,” “planned,” “potential,” “should,” “will,” and “would.” Such forward-looking statements in this release are inherently subject to many uncertainties in the Company’s operations and business environment. These uncertainties include general economic conditions, in particular, relating to the automotive industry, consumer demand for the Company’s and its customers’ products, competitive and technological developments, customer purchasing actions, changes in warranty provisions and customer product recall policies, foreign currency fluctuations, and costs of operations (including fluctuations in the cost of raw materials). Shareholders, potential investors and other readers are urged to consider these factors carefully in evaluating the forward-looking statements and are cautioned not to place undue reliance on such forward-looking statements. The forward-looking statements made herein are only made as of the date of this press release and the Company undertakes no obligation to publicly update such forward-looking statements to reflect subsequent events or circumstances occurring after the date of this release. In addition, such uncertainties and other operational matters are discussed further in the Company’s quarterly and annual filings with the Securities and Exchange Commission.\nSTRATTEC SECURITY CORPORATION Condensed Results of Operations (In Thousands except per share amounts) (Unaudited) Second Quarter Ended Six Months Ended December 31, 2017 January 1, 2017 December 31, 2017 January 1, 2017 Net Sales $ 103,182 $ 98,945 $ 205,642 $ 199,189 Cost of Goods Sold 90,536 85,251 179,533 170,692 Gross Profit 12,646 13,694 26,109 28,497 Engineering, Selling & Administrative Expenses 10,152 11,243 20,194 22,526 Income from Operations 2,494 2,451 5,915 5,971 Interest Income 3 39 7 80 Interest Expense (253 ) (98 ) (456 ) (176 ) Other Income, Net 1,582 655 2,695 475 Income Before Provision for Income Taxes and Non-Controlling Interest 3,826 3,047 8,161 6,350 (Benefit) Provision for Income Taxes (9 ) 1,410 1,057 2,308 Net Income 3,835 1,637 7,104 4,042 Net Income Attributable to Non-Controlling Interest (953 ) (1,239 ) (1,766 ) (2,102 ) Net Income Attributable to STRATTEC SECURITY CORPORATION $ 2,882 $ 398 $ 5,338 $ 1,940 Earnings Per Share: Basic $ 0.79 $ 0.11 $ 1.47 $ 0.54 Diluted $ 0.78 $ 0.11 $ 1.44 $ 0.53 Average Basic Shares Outstanding 3,631 3,589 3,621 3,583 Average Diluted Shares Outstanding 3,715 3,667 3,698 3,664 Other Capital Expenditures $ 6,778 $ 8,883 $ 14,349 $ 16,329 Depreciation & Amortization $ 3,572 $ 2,887 $ 6,667 $ 5,647\nSTRATTEC SECURITY CORPORATION Condensed Balance Sheet Data (In Thousands) December 31, 2017 July 2, 2017 (Unaudited) ASSETS Current Assets: Cash and cash equivalents $ 8,385 $ 8,361 Receivables, net 60,587 64,933 Inventories, net 42,287 35,476 Other current assets 23,278 20,235 Total Current Assets 134,537 129,005 Investment in Joint Ventures 19,724 16,840 Other Long Term Assets 18,740 16,278 Property, Plant and Equipment, Net 115,521 111,591 $ 288,522 $ 273,714 LIABILITIES AND SHAREHOLDERS’ EQUITY Current Liabilities: Accounts Payable $ 37,405 $ 39,679 Other 24,792 28,216 Total Current Liabilities 62,197 67,895 Accrued Pension and Post Retirement Obligations 2,408 2,495 Borrowings Under Credit Facility 46,000 30,000 Other Long-term Liabilities 2,061 610 Shareholders’ Equity 324,909 319,798 Accumulated Other Comprehensive Loss (33,676 ) (32,888 ) Less: Treasury Stock (135,801 ) (135,822 ) Total STRATTEC SECURITY CORPORATION Shareholders’ Equity 155,432 151,008 Non-Controlling Interest 20,424 21,626 Total Shareholders’ Equity 175,856 172,714 $ 288,522 $ 273,714\nSTRATTEC SECURITY CORPORATION Condensed Cash Flow Statement Data (In Thousands) (Unaudited) Second Quarter Ended Six Months Ended December 31, 2017 January 1, 2017 December 31, 2017 January 1, 2017 Cash Flows from Operating Activities: Net Income $ 3,835 $ 1,637 $ 7,104 $ 4,042 Adjustments to Reconcile Net Income to Cash Provided by Operating Activities: Equity Earnings in Joint Ventures (1,473 ) (229 ) (2,499 ) (291 ) Depreciation and Amortization 3,572 2,887 6,667 5,647 Foreign Currency Transaction Gain (556 ) (1,808 ) (419 ) (2,497 ) Unrealized Loss on Peso Forward Contracts 821 664 1,079 1,563 Deferred Income Taxes (1,710 ) - (1,710 ) - Stock Based Compensation Expense 250 364 621 792 Change in Operating Assets/Liabilities (4,027 ) 1,433 (9,772 ) 893 Other, net (28 ) 24 (33 ) (148 ) Net Cash Provided by Operating Activities 684 4,972 1,038 10,001 Cash Flows from Investing Activities: Investment in Joint Ventures - (100 ) - (100 ) Loan to Joint Venture - (550 ) - (1,400 ) Repayment of Loan to Joint Venture 150 - 150 75 Additions to Property, Plant and Equipment (6,778 ) (8,883 ) (14,349 ) (16,329 ) Proceeds Received on Sale of Property, Plant and Equipment 2 - 2 - Net Cash Used in Investing Activities (6,626 ) (9,533 ) (14,197 ) (17,754 ) Cash Flow from Financing Activities: Borrowings on Line of Credit Facility 6,000 13,000 18,000 21,000 Payments on Line of Credit Facility - (17,000 ) (2,000 ) (21,000 ) Dividends Paid to Non-Controlling Interest of Subsidiary - - (2,017 ) (1,764 ) Contribution from Non-Controlling Interest - - - 2,940 Dividends Paid (509 ) (503 ) (1,017 ) (1,006 ) Exercise of Stock Options and Employee Stock Purchases 165 86 190 160 Net Cash Provided by (Used in) Financing Activities 5,656 (4,417 ) 13,156 330 Effect of Foreign Currency Fluctuations on Cash 173 99 27 136 Net (Decrease) Increase in Cash & Cash Equivalents (113 ) (8,879 ) 24 (7,287 ) Cash and Cash Equivalents: Beginning of Period 8,498 17,069 8,361 15,477 End of Period $ 8,385 $ 8,190 $ 8,385 $ 8,190\nContact: Pat Hansen\nSenior Vice President and\nChief Financial Officer\n414-247-3435\nwww.strattec.com\nSource:Strattec Security Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/19f16d0b-afdc-40cc-ab3c-4ac73539dda7"], "published": "2018-01-26T00:00:00.000+02:00", "crawled": "2018-01-26T02:05:35.000+02:00", "highlightTitle": ""}