{"organizations": [], "uuid": "3d8f47c2f3a5619d476335f7c0cf664d1281816d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-inphi-to-present-at-the-20th-annual-needham-growth-conference-jan-18.html", "country": "US", "domain_rank": 767, "title": "Inphi to Present at the 20th Annual Needham Growth Conference Jan. 18", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-18T00:30:00.000+02:00", "replies_count": 0, "uuid": "3d8f47c2f3a5619d476335f7c0cf664d1281816d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-inphi-to-present-at-the-20th-annual-needham-growth-conference-jan-18.html", "ord_in_thread": 0, "title": "Inphi to Present at the 20th Annual Needham Growth Conference Jan. 18", "locations": [], "entities": {"persons": [], "locations": [{"name": "santa clara", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "lotte new york palace hotel", "sentiment": "none"}, {"name": "china long haul", "sentiment": "none"}, {"name": "metro", "sentiment": "none"}], "organizations": [{"name": "inphi corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "inphi inphi corporation", "sentiment": "none"}, {"name": "ford tamer", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SANTA CLARA, Calif., Jan. 17, 2018 (GLOBE NEWSWIRE) -- Inphi Corporation (NYSE:IPHI), a leader in high-speed data movement interconnects, today announced that Ford Tamer, president and CEO will be presenting at the 20 th Annual Needham Growth Conference on Thursday, Jan. 18 at 11:20 a.m. Eastern time at the Lotte New York Palace Hotel. Due to the ongoing slowdown in the China Long Haul and Metro markets - including associated inventory absorption, Q1 is expected to continue to be challenging. However, despite near term challenges, we currently expect 2H of 2018 will show improvement because of new products and new design wins with new cloud customers.\nThe presentation will be available via webcast at its referenced start time. Please visit the following link to listen to the webcast: http://investors.inphi.com\nThe company has also separately announced today its Q4 2017 earnings release date will be on Feb. 7 th , 2018 after the market close.\nAbout Inphi\nInphi Corporation is a leader in high-speed data movement. We move big data - fast, throughout the globe, between data centers, and inside data centers. Inphi's expertise in signal integrity results in reliable data delivery, at high speeds, over a variety of distances. As data volumes ramp exponentially due to video streaming, social media, cloud-based services, and wireless infrastructure, the need for speed has never been greater. That's where we come in. Customers rely on Inphi's solutions to develop and build out the Service Provider and Cloud infrastructures, and data centers of tomorrow. To learn more about Inphi, visit www.inphi.com .\nInphi, the Inphi logo and Think fast are registered trademarks of Inphi Corporation. All other trademarks used herein are the property of their respective owners.\nCautionary Note Concerning Forward-Looking Statements\nStatements in the press release which are not historical facts, are “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements may be identified by terms such as expect, will, and continue, and the negative of these terms or other similar expressions, and include statements relating to the Company’s current expectations regarding Q1 and 2H of 2018. These statements are based on current expectations and assumptions that are subject to risks and uncertainties. Actual results could differ materially from those anticipated as a result of various factors, including: the Company’s dependence on a limited number of customers for a substantial portion of revenue and lack of long-term purchase commitments from our customers; development of the markets that the Company targets; market demand for the Company’s products; and other risks inherent in fabless semiconductor businesses. For a discussion of these and other related risks, please refer to Inphi Corporation’s recent SEC filings, including its Annual Report on Form 10-K for the year ended December 31, 2016, which are available on the SEC’s website at www.sec.gov . Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date thereof. Inphi Corporation undertakes no obligation to update forward-looking statements for any reason, except as required by law, even as new information becomes available or other events occur in the future.\nCorporate Contact:\nKim Markle\n408-217-7329\nkmarkle@inphi.com\nInvestor Contact:\nDeborah Stapleton\n650-815-1239\nDeb@stapleton.com\nSource:Inphi Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/fcdef269-eec1-4089-b816-e91e99a21056", "http://www.inphi.com/"], "published": "2018-01-18T00:30:00.000+02:00", "crawled": "2018-01-18T00:28:30.022+02:00", "highlightTitle": ""}