{"organizations": [], "uuid": "a02b77ab720fd587029111be160448e2618d96a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews/", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-surgery-research/canada-europe-surpass-u-s-in-published-surgical-research-idUSKBN1EY2H4", "country": "US", "domain_rank": 408, "title": "Canada, Europe surpass U.S. in published surgical research", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T22:09:00.000+02:00", "replies_count": 0, "uuid": "a02b77ab720fd587029111be160448e2618d96a7"}, "author": "", "url": "https://www.reuters.com/article/us-health-surgery-research/canada-europe-surpass-u-s-in-published-surgical-research-idUSKBN1EY2H4", "ord_in_thread": 0, "title": "Canada, Europe surpass U.S. in published surgical research", "locations": [], "entities": {"persons": [{"name": "mary gillis", "sentiment": "none"}, {"name": "weste", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "stanford university", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "american college of surgeons", "sentiment": "none"}, {"name": "new england journal of medicine", "sentiment": "none"}, {"name": "jama surgery", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters Health) - The U.S., once the world leader in published randomized controlled trials by surgeons, is now outpaced by Canada, the UK and other countries, according to a report in JAMA Surgery.\nResearchers from Stanford University evaluated 659 randomized controlled trial reports published by surgeons from 39 countries. Papers published between 2003 and 2015 were extracted from top medical and surgical journals including The New England Journal of Medicine, Annals of Surgery and Journal of the American College of Surgeons.\nIn randomized controlled trials, participants are assigned by chance to separate groups with the purpose of comparing a new treatment to a different treatment or a sham treatment. These studies provide the highest level of evidence and are considered the gold standard. They can last weeks, months or even years.\nWhile the U.S. led the field in absolute number of publications (157, or 23.8%), the UK, Canada and nearly all Western European countries published significantly more randomized controlled trials when adjusted for population.\nIn 2013-2015, for example, for every 100,000 citizens, the U.S. published 0.03 papers reporting on randomized controlled trials, while Canada published 0.05, the UK published 0.07, Switzerland published 0.10, and the Netherlands published 0.20.\nIn the same period, for every billion U.S. dollars spent by governments on research and development, the U.S. published 0.07 randomized controlled trials, Canada published 2.4, the Netherlands published 6.5, Switzerland published 7.4, and Denmark published 14.4.\n“We reported the total number of studies this way to normalize the publication rates,” co-author Dr. Jared Forrester explained in an email. “Three published studies in the United States versus the same amount in Switzerland means a very different thing given the available money and human resources.”\n“There are massive problems with surgical clinical trials in the U.S.,” Dr. Andrew Vickers of Memorial Sloan Kettering Cancer Center in New York City told Reuters Health in a phone interview. “They are incredibly time consuming, expensive and there are impossible regulations enacted by governing bodies necessary to overcome in order to get funded.”\n“There’s a need to radically shift the culture to one of simplification, in more ways than one,” insists Vickers, who was not involved in the Stanford study.\nA proposal sometimes goes through no less than six ethics committees, each of which add their own modifications to the original study that must be considered before funding approval, said Vickers.\nAdding to the complexity are rigorous subject exclusion criteria and extensive documentation that make it difficult to accrue participants, which can result in trial discontinuation altogether. Furthermore, not all randomized control trials get published.\n“This is especially true when researchers’ hypotheses are disproved,” said coauthor Dr. Sherry Wren in a phone interview. “But a negative trial is important because it still answers questions.”\n“Despite the outcome, when funded, we have an obligation to deliver on our initial investment through completion of our hypothesis testing and disseminate the results,” Forrester agreed.\nBy showing a decline in published randomized control trials by U.S. researchers, the authors hope to bring attention to the critical need for dedicated surgical research funds.\n“If we want to establish ourselves once again as the preeminent leaders in biomedical research, we need to rise to the occasion. This requires a strongly funded environment. We see this paper as a call-to-arms toward the current system for all U.S. based surgical researchers,” Wren said.\nSOURCE: bit.ly/2CVR6jf JAMA Surgery, online December 27, 2017.\n ", "external_links": [], "published": "2018-01-09T22:09:00.000+02:00", "crawled": "2018-01-09T22:24:19.005+02:00", "highlightTitle": ""}