{"organizations": [], "uuid": "167c4cd09db890a04d1064e6a4256603eec342b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221969599&w=1200&r=LYNXMPEE0D0KF", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-autoshow-detroit-volkswagen-vehiclere/volkswagen-brand-car-sales-hit-6-23-million-record-in-2017-idUKKBN1F30WN", "country": "US", "domain_rank": 408, "title": "Volkswagen brand car sales hit 6.23 million record in 2017", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T22:09:00.000+02:00", "replies_count": 0, "uuid": "167c4cd09db890a04d1064e6a4256603eec342b7"}, "author": "", "url": "https://uk.reuters.com/article/uk-autoshow-detroit-volkswagen-vehiclere/volkswagen-brand-car-sales-hit-6-23-million-record-in-2017-idUKKBN1F30WN", "ord_in_thread": 0, "title": "Volkswagen brand car sales hit 6.23 million record in 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "sao bernardo do campo", "sentiment": "none"}, {"name": "americas", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}], "organizations": [{"name": "volkswagen", "sentiment": "negative"}, {"name": "vw", "sentiment": "none"}, {"name": "new volkswagen", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 10 PM / Updated 6 minutes ago Volkswagen brand car sales hit 6.23 million record in 2017 Reuters Staff 3 Min Read \nDETROIT (Reuters) - Volkswagen’s ( VOWG_p.DE ) core autos division increased vehicle sales to a new record last year, as rising demand for VW brand models in the Americas and the key Chinese market offset a decline in western Europe. New Volkswagen vehicles are seen at a parking lot of the VW factory in Sao Bernardo do Campo, Brazil January 5, 2017. REUTERS/Paulo Whitaker \nAlthough the emissions test-cheating scandal of September 2015 has cost the German group billions of euros in fines and penalties, it does not seem to have caused major damage to the carmaker’s popularity with consumers. \nDeliveries rose 4.2 percent in 2017 to 6.23 million Volkswagen (VW) brand cars, the automaker said on Sunday at the Detroit auto show, helped by an expanding line-up of sport-utility vehicles including the all-new Atlas and Teramont models. \nSales in December rose 5.6 percent to a new record of 594,100 cars. \nHigher deliveries at the mass-market brand, accounting for almost 60 percent of VW group sales, may have helped the Wolfsburg-based company beat Toyota ( 7203.T ) for a second year in the global sales race. VW’s premium divisions, Audi ( NSUG.DE ) and Porsche, had already posted record 2017 deliveries last week. A Volkswagen logo is pictured at the International Auto Show in Mexico City, Mexico November 23, 2017. REUTERS/Henry Romero \nToyota said last month it expected to sell 10.35 million cars worldwide in 2017 across its Toyota, Lexus, Daihatsu and Hino brands, up 2 percent from 2016, and 10.5 million this year. VW is due to announce 2017 deliveries for the group as a whole on Jan. 17. \nIn China, VW’s largest market, accounting for about half the core brand’s deliveries, sales rose 5.9 percent last year to 3.18 million cars. In the United States, they were up 5.2 percent to 339,700. \nDeliveries fell 2.5 percent to 1.43 million in the higher-margin but diesel-heavy western European market as customers reacted to a backlash against diesel technology in the wake of VW’s emissions trickery. \nSales of the VW brand, which is pushing a turnaround plan to revive profits, may continue to outpace rivals, according to industry forecaster IHS Markit. \nDeliveries of VW passenger cars and light commercial vehicles could increase 14.6 percent to 7.75 million units by 2025 from 6.76 million last year, IHS data indicated. \nThat compares with gains of 11.6 percent to 9.65 million at Toyota and 3.7 percent to 5.84 million at Ford ( F.N ). Reporting by Andreas Cremer; Editing by Douglas Busvine and Kevin Liffey", "external_links": [], "published": "2018-01-14T22:09:00.000+02:00", "crawled": "2018-01-14T22:24:29.001+02:00", "highlightTitle": ""}