{"organizations": [], "uuid": "0b6553dab66db0394be115978b1133e82364f605", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226958723&w=1200&r=LYNXMPEE0U100", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-austria-politics-scandal/austria-plans-to-dissolve-fraternity-at-centre-of-neo-nazi-scandal-idUKKBN1FK1YN", "country": "US", "domain_rank": 408, "title": "Austria plans to dissolve fraternity at centre of neo-Nazi scandal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T15:50:00.000+02:00", "replies_count": 0, "uuid": "0b6553dab66db0394be115978b1133e82364f605"}, "author": "", "url": "https://uk.reuters.com/article/uk-austria-politics-scandal/austria-plans-to-dissolve-fraternity-at-centre-of-neo-nazi-scandal-idUKKBN1FK1YN", "ord_in_thread": 0, "title": "Austria plans to dissolve fraternity at centre of neo-Nazi scandal", "locations": [], "entities": {"persons": [{"name": "kurz", "sentiment": "none"}, {"name": "wiener neustadt", "sentiment": "none"}, {"name": "alexander van der bellen", "sentiment": "none"}, {"name": "sebastian kurz", "sentiment": "none"}, {"name": "udo landbauer", "sentiment": "none"}, {"name": "landbauer", "sentiment": "none"}], "locations": [{"name": "austria", "sentiment": "none"}, {"name": "lower austria", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "freedom party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  vienna", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 1:51 PM / Updated 18 minutes ago Austria plans to dissolve fraternity at centre of neo-Nazi scandal Reuters Staff 3 Min Read \nVIENNA (Reuters) - Austria’s Chancellor Sebastian Kurz said on Wednesday the government would disband a fraternity over its anti-Semitic songbook amid growing calls for a prominent far-right politician to resign for having been the group’s deputy leader. \nDays before last Sunday’s regional election in the province of Lower Austria, a weekly newspaper reported the songbook’s contents, adding that its deputy leader was Udo Landbauer, the lead candidate for the anti-immigrant Freedom Party (FPO), junior coalition partner to Kurz’s conservatives. \nLandbauer left the Germania zu Wiener Neustadt fraternity soon afterwards but has refused to quit the party or his provincial assembly seat, despite calls for him to do so, including from President Alexander Van der Bellen. \nProsecutors have opened an investigation into four unspecified people under a law banning Holocaust denial and other Nazi-related offences. \n“I have agreed in the government and in particular with the interior minister that he will introduce a dissolution procedure against Germania,” Kurz told reporters before a weekly cabinet meeting on Wednesday. \n“I believe this is the right thing to do because where such a thing occurs there is not only individual responsibility, there is also collective responsibility,” he added. \nLyrics in the songbook joke about the extermination of Jews in gas chambers, but Landbauer says he did not know of the anti-Semitic and neo-Nazi content, since the book was published in 1997, well before he joined, and he had only seen copies with those passages redacted or pages torn out. \nThe Freedom Party has stopped short of forcing him out, saying he has assured it he did nothing wrong. \nIn Austria, right-wing student fraternities sometimes espouse ideas that echo traits of Nazi ideology, like the concept of an expanded Germany including Austria. \nThe Freedom Party was founded by former Nazis in the 1950s but says it has left has abandoned Nazi ideology. It rails against Islam but denounces anti-Semitism and openly courts Jewish voters, with limited success. \nAustria’s main Jewish body has repeated its long-standing policy of having no dealings with the Freedom Party or its ministers. It has also called on Landbauer to resign. \nIn a surprising twist to the scandal, the Social Democrats (SPO) said they had expelled a member for having illustrated the same songbook after prosecutors placed him under investigation. \n“The person was excluded from the provincial party leadership as well as the SPO,” it said in a statement on Tuesday evening, without naming the person. Reporting by Francois Murphy; Editing by Raissa Kasolowsky", "external_links": [], "published": "2018-01-31T15:50:00.000+02:00", "crawled": "2018-01-31T16:12:05.051+02:00", "highlightTitle": ""}