{"organizations": [], "uuid": "c8ea39c6cde71ee94328c1932e3908949ad92963", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/12/104277475-GettyImages-631880238.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/09/dollar-bolstered-by-higher-us-treasury-yields.html", "country": "US", "domain_rank": 767, "title": "Dollar bolstered by higher US Treasury yields", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.984, "site_type": "news", "published": "2018-01-10T04:03:00.000+02:00", "replies_count": 0, "uuid": "c8ea39c6cde71ee94328c1932e3908949ad92963"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/09/dollar-bolstered-by-higher-us-treasury-yields.html", "ord_in_thread": 0, "title": "Dollar bolstered by higher US Treasury yields", "locations": [], "entities": {"persons": [], "locations": [{"name": "japan", "sentiment": "none"}], "organizations": [{"name": "u.s. treasury", "sentiment": "negative"}, {"name": "us treasury", "sentiment": "negative"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "boj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Cryptocurrency Dollar dented by report China may halt bond buys The dollar was down 0.4 percent in broad sell-off, and down as much as 1 percent against the yen. Published 18 Hours Ago SHARES Matt Cardy | Getty Images \nThe U.S. dollar fell against a basket of major currencies on Wednesday after a report that China was ready to slow or halt its U.S. treasury purchases, with the greenback on track to post its biggest single-day drop against the Japanese yen in seven weeks. \nOfficials reviewing China's foreign-exchange holdings have recommended slowing or halting purchases of U.S. government bonds, Bloomberg News reported, citing people familiar with the matter. \nThe dollar was down 1.11 percent at 111.39 yen , after earlier falling to 111.29 yen, its weakest since late November. \n\"If the reports turn out to be true and China no longer sees Treasuries as an attractive option, the repercussions could be significant as the country is one of the biggest holders of U.S. debt,\" Craig Erlam, senior market analyst at OANDA in London, said in a note. \nAgainst a basket of currencies, the dollar was down 0.15 percent. \n\"The dollar was already notably weak ahead of today, despite the fact that U.S. data remained strong and yields continued to rise,\" said Boris Schlossberg, managing director of FX strategy at BK Asset Management in New York. \n\"This change of dynamic suggests we may be in the midst of a regime change in the market where the dollar actually falls as U.S. yields rise on fears of deficit expansion and debasement of the currency,\" said. \nThe dollar had been on the back foot even before the news report as the Bank of Japan 's move to trim its purchases of long-dated government bonds (JGB) this week reverberated across currency markets. On Tuesday, the dollar fell 0.39 percent against the yen. \n\"All of last year there was this fantastic correlation between U.S. 10-year yields and dollar-yen and people put on what is known as pairs trades,\" said Greg Anderson, global head of FX strategy at BMO Capital Markets in New York. \n\"You could be long dollar-yen and you could be long U.S. treasuries and you were getting yield on both sides of that. But that correlation has broken apart fantastically over the last couple of days,\" he said. \n\"All those people that would have had that trade on are stopped out.\" \nU.S. Treasury yields jumped to 10-month highs on Wednesday. \nSterling was slightly weaker against the greenback as investors locked in profits after its recent rally, though some decent economic data kept losses in check. Related Securities", "external_links": [], "published": "2018-01-10T04:03:00.000+02:00", "crawled": "2018-01-10T03:59:33.024+02:00", "highlightTitle": ""}