{"organizations": [], "uuid": "0af97ae258754b33860ef0ccfb7057fc6b9888ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/europe-stocks/live-markets-futures-point-to-pull-back-in-european-stocks-idUSL8N1PP18C", "country": "US", "domain_rank": 408, "title": "LIVE MARKETS-Futures point to pull-back in European stocks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T09:10:00.000+02:00", "replies_count": 0, "uuid": "0af97ae258754b33860ef0ccfb7057fc6b9888ee"}, "author": "", "url": "https://www.reuters.com/article/europe-stocks/live-markets-futures-point-to-pull-back-in-european-stocks-idUSL8N1PP18C", "ord_in_thread": 0, "title": "LIVE MARKETS-Futures point to pull-back in European stocks", "locations": [], "entities": {"persons": [{"name": "helen reid", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "msci world", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 7:13 AM / in 20 minutes LIVE MARKETS-Futures point to pull-back in European stocks Reuters Staff 4 Min Read Jan 30 (Reuters) - Welcome to the home for real time coverage of European equity markets brought to you by Reuters stocks reporters and anchored today by Helen Reid. Reach her on Messenger to share your thoughts on market moves: helen.reid.thomsonreuters.com@reuters.net FUTURES POINT TO PULL-BACK IN EUROPEAN STOCKS (0710 GMT) As expected futures have gapped significantly at the open - down 0.5 to 0.7 percent across the board now. Looks like the risk-off mood across the Atlantic will sour today's trading in Europe as well. The chipmakers and Apple suppliers will again be ones to watch, as will all those cyclical sectors leading the rally year-to-date. (Helen Reid) CORRECTION BECOMING INCREASINGLY LIKELY, SAYS GS (0656 GMT) The S&P 500 has had the longest period since 1929 without a correction of more than 5 percent, Goldman Sachs finds, saying a correction is overdue. The MSCI World has also entered its longest period ever without a correction of more than 5 percent. \"As inflows into equities rise strongly alongside increasing optimism, the equity market becomes more vulnerable to disappointments,\" GS writes. They're staying bullish, though - seeing a sharp correction as more likely than a full-blown bear market. One interesting observation they make is that this year the S&P 500 and the VIX volatility index have been rising together. \"The increase in volatility amid a market rally may, in part, reflect increasing risks, and may also reflect a bullish willingness to spend premium to add to upside exposure.\" GS recommends buying on dips, but would also buy hedges as protection. If you're more of a glass half full kind of person, then you can keep looking at global growth - running at above 5%, the strongest pace since 2010 - and global earnings - where expectations are finally being revised up sharply. (Helen Reid) SAP ANNOUNCES $2.4 BLN ACQUISITION, ALTICE TO FURTHER CUT SHARE CAPITAL (0636 GMT) With tech a notable focus yesterday, and ahead of the U.S. giants reporting later this week, all eyes will be on results from European firms in the sector to see how they stack up. Germany's SAP, Europe's top tech company, just announced a $2.4 billion acquisition of U.S. cloud software company Callidus Software Inc - a sweetener on 2017 results which came in at the lower end of market expectations. The firm's guidance was in line with analysts' expectations - but we'll have to see what they make of this purchase. At the intersection of health and tech, Dutch firm Philips reported Q4 sales growth in line with expectations. Elsewhere in stocks to watch today there's telecoms and cable group Altice which is reducing its share capital to help improve returns while it restructures. And it's a sad day for Volkswagen whose position as world's top-selling carmaker was just nabbed by the Renault-Nissan alliance. (Helen Reid)", "external_links": [], "published": "2018-01-30T09:10:00.000+02:00", "crawled": "2018-01-30T09:33:22.004+02:00", "highlightTitle": ""}