{"organizations": [], "uuid": "7d75ca0f57142664791f6e8eed020ce61bef298e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/20/the-associated-press-the-latest-gop-says-trump-trying-to-cushion-shutdown-impact.html", "country": "US", "domain_rank": 767, "title": "The Latest: GOP says Trump trying to cushion shutdown impact", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T19:42:00.000+02:00", "replies_count": 0, "uuid": "7d75ca0f57142664791f6e8eed020ce61bef298e"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/20/the-associated-press-the-latest-gop-says-trump-trying-to-cushion-shutdown-impact.html", "ord_in_thread": 0, "title": "The Latest: GOP says Trump trying to cushion shutdown impact", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}, {"name": "steve daines", "sentiment": "none"}, {"name": "ryan zinke", "sentiment": "none"}, {"name": "zinke", "sentiment": "none"}, {"name": "martin luther king jr.", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "yellowstone national park", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "montana", "sentiment": "none"}, {"name": "wyoming", "sentiment": "none"}, {"name": "yellowstone", "sentiment": "none"}, {"name": "glacier national park", "sentiment": "none"}], "organizations": [{"name": "gop", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "interior", "sentiment": "none"}, {"name": "ebenezer baptist church", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — The Latest on how the government shutdown is affecting national parks (all times local):\n6:25 p.m.\nA Republican senator from Montana says the Trump administration is trying to minimize the effects of the government shutdown by keeping at least some national parks open, but former President Barack Obama tried to make shutdowns painful for the American people.\nSen. Steve Daines said Saturday that Interior Secretary Ryan Zinke, a former Montana congressman, wants to keep Montana's Glacier National Park and Yellowstone National Park open.\nMost of Yellowstone is in Wyoming but three of the five entrances are in Montana.\nOn Saturday, Zinke tweeted, \"Not all national parks are fully open but we're working hard to make as much accessible as is safely possible.\"\nThe administration promised to keep as many sites open as possible during the shutdown, which began at midnight Friday on the East Coast. But by mid-day Saturday, the pattern was spotty.\n4:30 p.m.\nMartin Luther King Jr.'s childhood home, historic Ebenezer Baptist Church and the visitor center at MLK National Historic Site in Atlanta are closed amid the federal government shutdown.\nThe Atlanta Journal-Constitution reports a smattering of people wandered the park's grounds during the closures Saturday. Freedom Hall, which is privately owned, remained open for visitors to take in exhibits about King, Rosa Parks and Gandhi, but employees said attendance had dropped dramatically for a Saturday.\nStill, some were trying to make the best of what was their first visit to the historic site.\nAric Dupre, who traveled from Cincinnati for a weekend vacation with his wife, Kat, said they were disappointed. He says they have other plans, but their morning was shot.\nKennesaw Mountain National Battlefield Park about 20 miles northwest of Atlanta remained open Saturday. People were spotted jogging and climbing the mountain.\n2:45 p.m.\nA monument and museum dedicated to the victims of the 1995 Oklahoma City bombing is open to visitors amid the government shutdown.\nKari Watkins, executive director of the Oklahoma City National Memorial and Museum, said Saturday the center is affiliated with the National Park Service but is owned and operated by the Oklahoma City National Memorial Foundation.\nWatkins says Park Service rangers aren't on site but are being replaced by museum and memorial staff members.\nThe memorial includes a reflecting pond and metal chairs in honor of the 168 people who died in the bombing.\n10:30 a.m.\nYosemite National Park in California is open to visitors despite the government shutdown but there'll be nobody to greet them, help them navigate the trails or even make sure they're in the right campground.\nSpokesman Scott Gediman says the park that boasts the famous granite cliffs of Half Dome and El Capitan can't pay all of its people so rangers are being furloughed.\nThe visitor center is closed, along with some restrooms because there's nobody to clean them. Campground visitors with reservations may find someone else in their spot because nobody will be checking.\nGediman says rangers and other staff are coming in to receive their furlough letters, then going home and waiting to see how long they'll be out of work.\nSome medical staff remains on the job and Gediman says privately operated concessions such as stores, hotels and restaurants are open.\n10:35 a.m.\nVisitors can still ride snowmobiles and snow coaches into Yellowstone National Park to gaze at the geysers and buffalo herds, despite the federal government shutdown.\nThe historic park in northwest Wyoming was open under a blanket of fresh snow on Saturday.\nVisitor centers and other facilities run by the National Park Service were closed, but privately operated hotels, tour services and gift shops were open.\nXanterra (zan-TEHR'-uh) Parks & Resorts and other private companies that serve visitors at Yellowstone said they would groom Yellowstone's snow-packed roads for up to a week to keep them open for snowmobiles and snow coaches — small buses with tank-like tracks.\n10 a.m.\nThe snowy mountains and frozen lakes of Rocky Mountain National Park are still accessible to visitors, despite the federal government shutdown.\nBut across the country in New York, the nation's most famous monuments to immigration — the Statue of Liberty and Ellis Island — were closed Saturday.\nThe National Park Service oversees both natural wonders and historic landmarks across the nation. The park service's parent agency, the Interior Department, had vowed to keep as many parks and public lands open as possible during the shutdown, which began at midnight Friday on the East Coast.\nBut by mid-day Saturday, the pattern was spotty.\nThe USS Constitution, the 220-year-old warship anchored at Charlestown Navy Yard in Boston, was open, but Boston's Bunker Hill Monument was closed.", "external_links": [], "published": "2018-01-20T19:42:00.000+02:00", "crawled": "2018-01-21T10:37:38.175+02:00", "highlightTitle": ""}