{"organizations": [], "uuid": "491bc7a465177fdd8dda92d4eaed17234cea46cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/880680570.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/17/reese-witherspoon-and-nicole-kidman-reportedly-getting-1-million-per-episode-for-big-little-lies/", "country": "US", "domain_rank": 1196, "title": "Reese Witherspoon, Nicole Kidman Getting 'Big Little Lies' Raise | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-08T02:00:00.000+02:00", "replies_count": 0, "uuid": "491bc7a465177fdd8dda92d4eaed17234cea46cc"}, "author": "Tom Huddleston Jr.", "url": "http://fortune.com/2018/01/17/reese-witherspoon-and-nicole-kidman-reportedly-getting-1-million-per-episode-for-big-little-lies/", "ord_in_thread": 0, "title": "Reese Witherspoon, Nicole Kidman Getting 'Big Little Lies' Raise | Fortune", "locations": [], "entities": {"persons": [{"name": "tom huddleston jr", "sentiment": "neutral"}, {"name": "nicole kidman", "sentiment": "neutral"}, {"name": "reese witherspoon", "sentiment": "neutral"}, {"name": "witherspoon", "sentiment": "none"}, {"name": "kidman", "sentiment": "none"}, {"name": "shailene woodley", "sentiment": "none"}, {"name": "zoë kravitz", "sentiment": "none"}], "locations": [], "organizations": [{"name": "hbo", "sentiment": "negative"}, {"name": "apple", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Tom Huddleston Jr. January 17, 2018 \nHBO’s Big Little Lies cleaned up during TV’s awards season and now the television show’s two biggest stars are heading for a major payday. \nActresses Reese Witherspoon and Nicole Kidman (who both also executive produce the series) will reportedly earn roughly $1 million apiece for each episode of the upcoming second season of Big Little Lies , according to The Hollywood Reporter . That’s considerably more than the $250,000 and $350,000 per episode that Witherspoon and Kidman pulled in respectively for the show’s first season, which aired in early 2017. Actresses Shailene Woodley and Zoë Kravitz are also reportedly getting “sizable” raises, according to THR , though their specific salaries were not reported. \nThe show’s second season is expected to air sometime in 2019. \nThe new report cites anonymous sources saying that Witherspoon and Kidman will also be paid executive producer fees along with a percentage of the second season’s eventual profits, and that the two actresses used Witherspoon’s recent lucrative dealings with Apple as leverage while negotiating their new salaries with HBO. Witherspoon and actress Jennifer Aniston are reportedly each getting $1.25 million per episode for their upcoming drama series about the world of morning TV talk shows for the tech giant, which is rapidly ramping up its push into original programming . Witherspoon has multiple TV projects in the works with Apple. \nGet Data Sheet , Fortune’s technology newsletter. \nTime Warner’s HBO announced plans for a second season of Big Little Lies at the end of 2017, and the series’ first season won multiple honors at the 2017 Emmy Awards and the 2018 Golden Globe Awards, including being tapped as the best limited TV series at both events. HBO programming president Casey Bloys told THR that the premium cable network wanted new deals for the actresses in place in order to move forward with the show’s second season, though he declined to blame Apple. “Every outlet has to make their own decisions about economics that make sense for them,” Bloys told THR . “I’m not going to shake my fist and say, ‘Darn it, Apple!’ If that’s what made sense for them for that show, God bless.” \nNews of the raise for the Big Little Lies cast also came on the same day as a THR feature that details actress Ellen Pompeo’s negotiation process with Walt Disney’s ABC for her show Grey’s Anatomy . Pompeo recently signed a deal that pays her roughly $20 million per season, making her the highest-paid actress on a primetime TV drama. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-08T02:00:00.000+02:00", "crawled": "2018-01-18T04:31:40.003+02:00", "highlightTitle": ""}