{"organizations": [], "uuid": "d80db30fbff84e8e8566afcedbfcb99fa983026c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/infosys-results/indias-infosys-posts-38-pct-jump-in-q3-profit-on-tax-deal-idUSL4N1P73E8", "country": "US", "domain_rank": 408, "title": "UPDATE 2-New Infosys CEO to set out priorities by April", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T18:39:00.000+02:00", "replies_count": 0, "uuid": "d80db30fbff84e8e8566afcedbfcb99fa983026c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/infosys-results/indias-infosys-posts-38-pct-jump-in-q3-profit-on-tax-deal-idUSL4N1P73E8", "ord_in_thread": 0, "title": "UPDATE 2-New Infosys CEO to set out priorities by April", "locations": [], "entities": {"persons": [{"name": "salil parekh", "sentiment": "none"}, {"name": "tanvi mehta bengaluru", "sentiment": "none"}, {"name": "sankalp phartiyal", "sentiment": "none"}, {"name": "parekh", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}], "organizations": [{"name": "infosys", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "infosys ltd", "sentiment": "none"}, {"name": "u.s. internal revenue service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* New CEO to take three months to review company\n* Third quarter profit surges 38 percent\n* Company trying to put internal feud behind it (Adds details from press conference, management Quote: s)\nBy Sankalp Phartiyal and Tanvi Mehta\nBENGALURU, Jan 12 (Reuters) - The new chief executive of Infosys Ltd said he would lay out updated strategic priorities for India’s second-biggest software services exporter by April after the company maintained its full-year revenue outlook.\nInfosys reported a rise in net profit of 38.3 percent from a year earlier to 51.29 billion rupees ($806 million) for the quarter to Dec. 31, way above analysts’ estimates. The figures -- the company’s third quarter -- were helped by tax benefits from a deal with the U.S. Internal Revenue Service.\nChief Executive Salil Parekh, who joined the company in January, said he planned to engage with clients, employees, partners, senior executives and the company’s board over the next three months to build a “comprehensive view”.\nParekh, who is only the second outsider to lead the Bengaluru-headquartered company, said the market offered tremendous opportunities in newer areas such as data, analytics, machine learning and artificial intelligence. The challenge would be to position the company in those areas.\n“It’s an opportunity with a strong foundation to build a transformation story at Infosys. Hopefully to make it stronger with all of the team at Infosys,” Parekh told a news conference.\nHe would also hope to stay connected with the co-founders, he added.\nInfosys saw a management shake up with Parekh’s predecessor Vishal Sikka quitting last year after a long-drawn public feud with the company’s main founder over alleged corporate governance lapses. The feud also led to changes in its board with a former CEO and co-founder Nandan Nilekani taking over as non-executive chairman.\nU.S. WORRIES On Thursday, Infosys’ bigger rival and top Indian software exporter Tata Consultancy Services Ltd reported a 3.6 percent fall in net profit due to a muted performance in its financial services sector for the third quarter.\nIndia’s $154 billion software outsourcing sector gets the majority of its revenue from the North American and the European markets. But a slowdown in key segments including financial services and uncertainties over employee visas in the United States have weighed on the company’s growth.\nThe results come as Indian outsourcers anticipate changes to work visa rules in their biggest market, the United States. Indian IT services firms use H-1B visas to fly engineers and developers to the U.S. to service clients.\nInfosys’ profit in the third quarter was driven by an Advance Pricing Agreement it sealed with US IRS, which the company said added about 6.29 rupees to its consolidated basic earnings per share in the quarter to take it to 22.55 rupees.\nIt also maintained its revenue growth forecast for the year to March at 5.5 percent to 6.5 percent in constant currency terms.\nThe financial services sector, which contributes over a quarter of its revenues, witnessed muted growth in the three months to the end of December, said Pravin Rao, chief operating officer of Infosys.\n“But we remain very confident about this sector and we believe that the calendar year 2018 will be much better than calendar year 2017 for the financial services,” Rao said. ($1 = 63.6400 Indian rupees) (Reporting by Sankalp Phartiyal and Tanvi Mehta in Bengaluru; Additional reporting by Jessica Kuruthukulangara in Bengaluru; Writing by Promit Mukherjee in Mumbai; Editing by Muralikumar Anantharaman and Keith Weir)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T18:39:00.000+02:00", "crawled": "2018-01-13T14:43:20.016+02:00", "highlightTitle": ""}