{"organizations": [], "uuid": "bc79cb2f36e1ac7c61d0b1064769c5ab99329a97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222191837&w=1200&r=LYNXMPEE0E17G", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-autoshow-detroit-breakingviews/breakingviews-shareholders-leave-autos-2-0-on-the-hard-shoulder-idUSKBN1F4281", "country": "US", "domain_rank": 408, "title": "Shareholders leave Autos 2.0 on the hard shoulder", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T01:03:00.000+02:00", "replies_count": 0, "uuid": "bc79cb2f36e1ac7c61d0b1064769c5ab99329a97"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-autoshow-detroit-breakingviews/breakingviews-shareholders-leave-autos-2-0-on-the-hard-shoulder-idUSKBN1F4281", "ord_in_thread": 0, "title": "Shareholders leave Autos 2.0 on the hard shoulder", "locations": [], "entities": {"persons": [], "locations": [{"name": "detroit", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "general motors", "sentiment": "none"}, {"name": "volkswagen", "sentiment": "none"}, {"name": "toyota", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}, {"name": "honda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT Shareholders are leaving Auto 2.0 in the hard shoulder. As the industry gathers in Detroit for its annual confab, carmakers are revving up their plans for the next generation of vehicles. Ford on Sunday said it’s more than doubling its electric battery investment to more than $11 billion by 2022. A day earlier, General Motors revealed it had asked regulators to approve its driverless car. Toyota, Volkswagen and others are tanking up, too. Investors, though, aren’t buying it.\nMost of the world’s major carmakers trade in a narrow range between 7 and 9 times this year’s expected earnings, according to Thomson Reuters data. That suggests the industry is not only failing to grow, but in decline. Only Toyota and Honda are worth more than the 10 times net income that implies an expanding business, based on their estimated calendar-year results.\nIn a usual cycle, such skepticism would be expected. Vehicle sales in North America are retreating from record highs and European growth remains sluggish. Meanwhile, interest rates are rising, albeit slowly, making car loans more expensive.\nThis time round, though, the industry is grappling with what are likely to be fundamental changes to the business model. The wealth of data captured from connecting vehicles to the internet could represent more $120 billion-a-year revenue opportunity, reckon UBS analysts – think everything from improved diagnostics to traffic info to infotainment and shopping.\nAnd autonomous cars may alter how we own and use transportation – and how vehicle manufacturers make money. GM reckons it could bring in 10 times or more the average $31,000 in revenue it currently earns over the lifetime of a vehicle from owning and operating its own fleets of self-driving taxis and ride-sharing vehicles. It’s hoping to roll out its first commercial fleet of self-driving taxis in cities next year.\nThere are admittedly questions about how fast such new technologies will be accepted and adopted. Sourcing raw materials for electric batteries is an issue, too. Miner Glencore reckons cobalt supplies will have to triple by 2030 to meet automakers’ planned demands.\nNone of these concerns weighs on Tesla. It trades at 230 times unadjusted 2020 earnings, the first year it’s expected to turn a profit, despite missing several production targets as Chief Executive Elon Musk tries to turn it into a mass producer.\nMusk, of course, has a cult following. If shareholders in his longer-lived rivals had the same belief in them, carmaker valuations would soar.\n ", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-16T01:03:00.000+02:00", "crawled": "2018-01-15T22:20:50.012+02:00", "highlightTitle": ""}