{"organizations": [], "uuid": "ee955f65beb176c353b10535af9ac7f9a13da7c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224429983&w=1200&r=LYNXMPEE0M0LR", "site_section": "https://www.reuters.com/subjects/euro-zone", "section_title": "Euro Zone | Reuters.com", "url": "https://www.reuters.com/article/us-eu-banks-npls-france/bank-bad-loan-woes-require-long-term-solutions-frances-le-maire-idUSKBN1FC14R", "country": "US", "domain_rank": 408, "title": "Bank bad loan woes require long-term solutions: France's Le Maire", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-23T18:28:00.000+02:00", "replies_count": 0, "uuid": "ee955f65beb176c353b10535af9ac7f9a13da7c8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-eu-banks-npls-france/bank-bad-loan-woes-require-long-term-solutions-frances-le-maire-idUSKBN1FC14R", "ord_in_thread": 0, "title": "Bank bad loan woes require long-term solutions: France's Le Maire", "locations": [], "entities": {"persons": [{"name": "bruno le maire", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "le maire brussels", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european central bank", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (Reuters) - Efforts to reduce the bad loans held by European banks will take time, the French finance minister said on Tuesday, warning against new measures to cut bad debt faster that are backed by Germany and the European Central Bank.\nNon-performing loans (NPLs) have been a burden for banks in the European Union’s southern countries since the 2008-09 global financial crisis, as firms and households struggled to pay back their debt.\nCutting banks’ holdings of NPLs is considered crucial to strengthen economic growth in Europe and to complete a banking union, the bloc’s flagship project to shield itself against future financial crises.\nBut the EU countries are divided over the pace at which the nearly 1 trillion euros ($1.2 trillion) of NPLs should be cut. Germany and the ECB are calling for faster cuts while Italy, which last year significantly cut its high exposure, urges a more gradual approach to avoid fire sales of bank assets.\n“We have to continue at the same pace,” France’s Bruno Le Maire said on arriving to a meeting of EU finance ministers in Brussels that will discuss bad loans.\nLast week, the European Commission said NPLs are going down in the 28 countries of the EU but remain high [nL8N1PD2YM].\nThe ECB supervisory arm, chaired by French regulator Daniele Nouy, has called for higher provisioning against bad loans, a move that would force banks to offload their dud loans faster but could create large holes in the balance sheets of the most exposed lenders.\nGermany has supported a faster reduction of NPLs because this would lower risks in Europe’s banks and could pave the way for EU reforms meant to use common resources to protect bank depositors.\nLast week, Le Maire said that France was prepared to address Germany’s concerns and in particular the way that non-performing loans are handled in a bid to make progress on the banking union [nL8N1PD55I].\nBut on Tuesday, he seemed to take a line closer to the Italian view. He praised efforts made by the Italian government in cutting bad loans and stressed that solutions of the problem were for the “long-term”.\n“We have to continue our efforts. They are long-term efforts. It’s difficult. It takes time and it requires choices that are not always easy,” Le Maire told reporters.\nThe Commission will make new legislative proposals in March to facilitate shedding bad loans and avoid a new build-up. The ECB is considering stricter requirements, which could have an impact on the stock of NPLs.\n“We sometimes tend to forget what has been already done and to propose new things without noticing that part of the route has been already done,” Le Maire said when asked whether clear targets were needed to cut existing bad loans.\n($1 = 0.8173 euros)\nReporting by Francesco Guarascio; editing by Philip Blenkinsop, Larry King\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T18:28:00.000+02:00", "crawled": "2018-01-23T20:38:44.089+02:00", "highlightTitle": ""}