{"organizations": [], "uuid": "014b75f8affe532cfc5bd0c98e6106ba4ef729b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219242560&w=1200&r=LYNXMPEE030AS", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-iran-rallies/nobel-peace-laureate-ebadi-urges-iranians-to-keep-up-protests-idUSKBN1ET0IR", "country": "US", "domain_rank": 408, "title": "Nobel peace laureate Ebadi urges Iranians to keep up protests", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T08:22:00.000+02:00", "replies_count": 0, "uuid": "014b75f8affe532cfc5bd0c98e6106ba4ef729b0"}, "author": "", "url": "https://www.reuters.com/article/us-iran-rallies/nobel-peace-laureate-ebadi-urges-iranians-to-keep-up-protests-idUSKBN1ET0IR", "ord_in_thread": 0, "title": "Nobel peace laureate Ebadi urges Iranians to keep up protests", "locations": [], "entities": {"persons": [{"name": "ebadi", "sentiment": "negative"}, {"name": "shirin ebadi", "sentiment": "none"}, {"name": "ayatollah ali khamenei", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}], "organizations": [{"name": "asharq al-awsat", "sentiment": "none"}, {"name": "revolutionary guards", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  dubai", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 6:23 AM / a minute ago Iranian army commander offers to help police suppress unrest Michael Georgy 7 Min Read \nDUBAI (Reuters) - Iran’s army chief declared on Thursday that police had quelled anti-government unrest that has killed 21 people but that his troops were ready to intervene if needed, as authorities staged more pro-government rallies. \nThe protests, which seem spontaneous and without a unifying leader, erupted a week ago in Iran’s second city of Mashhad over economic hardships - mostly high youth unemployment, high living costs and alleged corruption. \n(For a map of protests in Iran, click tmsnrt.rs/2CGK4eQ ) \n“Although this blind sedition was so small that a portion of the police force was able to nip it in the bud ... you can rest assured that your comrades in the Islamic Republic’s army would be ready to confront the dupes of the Great Satan (United States),” Major General Abdolrahim Mousavi was quoted in official media as saying. \nIran’s vastness as well as restrictions on independent media make it hard to determine the breadth and depth of the unrest. \nThe semi-official labor news agency ILNA said the government on Thursday lifted restrictions on Instagram, one of the social media tools used to mobilize protesters. But access to a more widely used messaging app, Telegram, remained blocked, suggesting authorities remained uneasy about protest threats. \nIn the latest protests, which generally occur after nightfall, social media video showed demonstrators in Khorramabad in southwestern Iran on Wednesday evening throwing stones at riot police, who were retreating. \nIn other social media footage, hundreds poured into streets of the northwestern city of Orumiyeh near the Turkish border, chanting anti-government slogans. \nNone of the videos could be authenticated by Reuters. \nThe student news agency ISNA quoted Interior Minister Abdolreza Rahmani Fazli as saying on Thursday that “at most 42,000 people attended the protests, which is not much” in a nation of 80 million people. \nOn Wednesday, the commander of the elite Revolutionary Guards, Major General Mohammad Ali Jafari, said the number of “troublemakers” did not exceed 15,000 nationwide. \nAmnesty International said on Thursday that more than a thousand Iranians had been arrested and detained in jails “notorious for torture and other ill-treatment over the past seven days”, with many being denied access to families and lawyers. \nIranian Nobel Peace laureate Shirin Ebadi, in an interview with Reuters, urged the United States and the international community to support protests in Iran with political sanctions and not economic measures that could hit the general population. \nShe called for a ban on “sales of arms or any tools that can be used to suppress people,” and restriction on Iran’s dozens of radio and television stations, that she said were part of a “wrongful” foreign policy, and “spread hatred and lies” in different languages. \nA senior U.S. official said on Wednesday that the United States aimed to collect “actionable information” that could allow it to pursue sanctions against Iranian individuals and organizations involved in a crackdown on protesters. \nU.S. President Donald Trump - who has criticized Iran for its ballistic missile program and human rights record - said on Wednesday he would throw support behind Iranian protesters at an “appropriate time”. \nThe United States on Thursday sanctioned five Iranian-based entities it said were owned or controlled by a industrial firm responsible for developing and producing Iran’s solid-propellant ballistic missiles. People protest in Tehran, Iran December 30, 2017 in in this picture obtained from social media. REUTERS \nNikki Haley, the U.S. ambassador to the United Nations, said earlier this week Washington was seeking emergency sessions on Iran’s turmoil at the U.N. Security Council in New York and the U.N. Human Rights Council in Geneva. \nRussia rejected the idea, with Deputy Foreign Minister Sergei Ryabkov calling it “harmful and destructive”, according to RIA news agency. \nHe said Iran’s domestic affairs had nothing to do with the U.N. Security Council’s role, which was the “maintenance of international peace and security”. RARE ANTI-GOVERNMENT OUTBURSTS \nAs unrest spread across Iran, mainly in smaller cities and towns, protesters said they were tired of official anti-Western rhetoric and it was time for Supreme Leader Ayatollah Ali Khamenei and the government of President Hassan Rouhani to quit. \n”I voted for Khatami and Rouhani, hoping for change. Hoping for freedom. Hoping to live like a normal human being. But nothing has changed,” said Maryam Azemi, 48, a mother of two in the city of Karaj near Tehran. \n”I don’t trust anyone anymore. We waited so long for change in this country. We tried peaceful ways to bring change, like voting, but look at us now. The officials are competing with each other to rip us off.” \nProtests have drawn largely young people and workers but have begun to draw in members of the educated middle class that formed the backbone of a pro-reform revolt almost a decade ago. \nAfter six days of demonstrations, Jafari said on Wednesday that Revolutionary Guards units had been deployed to put down protests in three provinces that have been hotbeds of unrest. That was the clearest sign yet that authorities were taking the protests seriously. \nThe Revolutionary Guards, the sword and shield of Iran’s Shi‘ite theocracy, were instrumental in suppressing an uprising over alleged election fraud in 2009 in which dozens were killed. STATE-SPONSORED COUNTER-DEMONSTRATIONS \nState television broadcast live pictures of pro-government rallies on Thursday, including Ghaemshahr in northern Iran and Mashhad in the northeast, and Shahin Shahr in central Iran. Marchers carried posters saying, “No to riots”, and “Death to seditionists”, as well as portraits of Khamenei. \nState media said three Iranian security agents were killed on Wednesday near the Iraqi border in a clash that led to the dismantling of a team of “counter-revolutionaries” who had planned to cause explosions and provoke unrest. \nThe intelligence ministry said several “terrorists” were killed in the clash and one was arrested. Kurdish rebels are known to be active in the area. \nFew believe the protests pose an existential threat to the clerical elite, backed by pervasive security services, that have dominated Iran since the 1979 Islamic Revolution that overthrew a U.S.-backed monarchy. \nBut protesters have become increasingly bold in challenging Khamenei, who blamed the most sustained challenge to his 29 years in power for nearly a decade on “seditionists” and foreign agents. \n“I don’t want to harm my country but when I see those who run this country are so corrupt, I feel like I am being suffocated. They just talk. They accuse ‘the enemies’ of everything,” said protester Reza, 43, a father of three in the central city of Isfahan. \n“I am not an enemy. I am an Iranian. I love my country. Stop stealing my money, my children’s money,” he told Reuters by telephone. Additional reporting by Bozorgmehr Sharafedin in London and Denis Pinchuk in Moscow; editing by Mark Heinrich", "external_links": [], "published": "2018-01-04T08:22:00.000+02:00", "crawled": "2018-01-04T08:32:14.025+02:00", "highlightTitle": ""}