{"organizations": [], "uuid": "874139de0ad548e1795ef27082019a6995ef07e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/cnbc-interview-with-the-international-trade-union-confederations-general-secretary-sharan-burrow-from-the-world-economic-forum-2018.html", "country": "US", "domain_rank": 767, "title": "CNBC Interview with the International Trade Union Confederation’s General Secretary, Sharan Burrow from the World Economic Forum 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T08:00:00.000+02:00", "replies_count": 0, "uuid": "874139de0ad548e1795ef27082019a6995ef07e2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/cnbc-interview-with-the-international-trade-union-confederations-general-secretary-sharan-burrow-from-the-world-economic-forum-2018.html", "ord_in_thread": 0, "title": "CNBC Interview with the International Trade Union Confederation’s General Secretary, Sharan Burrow from the World Economic Forum 2018", "locations": [], "entities": {"persons": [{"name": "sharan burrow", "sentiment": "negative"}, {"name": "gene", "sentiment": "negative"}, {"name": "davos", "sentiment": "none"}, {"name": "steve sedgwick", "sentiment": "none"}, {"name": "geoffrey", "sentiment": "none"}, {"name": "geoff cutmore", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}], "organizations": [{"name": "cnbc interview", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}, {"name": "international trade union confederation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Following are excerpts from a CNBC interview with the International Trade Union Confederation's General Secretary, Sharan Burrow and CNBC's Steve Sedgwick and Geoff Cutmore from the World Economic Forum 2018.\nSS: Let's get back on Davos matters. Automation is a key topic here at Davos this year, as companies across sectors explore new ways to harness artificial intelligence. But, Labour leaders have pointed to concerns over how developments in AI will work, and impact workers across traditional industries. We'll come to that in a few moments' time, but I want to start off on a more generic question with, I think we can say our long-term friend, Sharan Burrow, General Secretary of the International Trade Union Confederation. Nice to see you again.\nSB: Thank you.\nSS: So, look, you and I, and Geoffrey, and others, had a-, a really nice chat, before Davos, about what we didn't like about it, what we wanted to change, more specifically, what you wanted to change, as well. How has this meeting been for you? Any better?\nSB: Well, I think the theme said it all. A fractured world. We have a fractured world, no one can deny it, although there's a group here that think that everything's rosy, you know, growth is on, we're back to business as usual, mind you, not as high as it was before the crisis, and then we had signs of deterioration, certainly unemployment, growing inequality, so that's just increased, massively. So, the fractured world, whether it's militarism, the rise of the alpha male, the, you know, sense of despair from women, around misogyny, ongoing misogyny, but, I do think that, what we are seeing her, is a growing group of people who want a different world, for their children, their grandchildren, and they are right across the spectrum. So, while you do have the 'business as usual' crowd, and that's a shame, because I don't think the growth projections should be taken as bolshie, I actually think, you know, the Barclays chief said it, we're probably at risk of being somewhere around 2006, an people have their eyes closed-,\nSS: Mm-hm.\nSB: But, I have to say, I am delighted with the conversations we've had about a new social contract, about the fact that we have to have just transitions for workers, both in terms of climate shifts, and the-, and the shift to renewable energies, and industry processes, but also around automation, AI, technology, across the board.\nSS: Sure.\nGC: The supertanker tends to turn very slowly, when it comes to changes here at the World Economic Forum, but this year, of course, we've had an all-female Co-Chair team. Does that mean that, as we move forward, maybe next year, we end up with an agenda that looks much more focused on the whole issue of equality between the sexes?\nSB: Well, I certainly-, first of all, let me say it's been a lot of fun, having an all [female] Co-Chair team, the conversations were just terrific, and the diversity amongst the women, I mean, wouldn't you love to run CERN? Like, Fabiola was a real treat, you know. So, Chetna, of course, you know, an amazing, you know, social entrepreneur in-, in India, but, of course, you know, women like Isabelle, and the-, the Norwegian Prime Minister, and Christine, I mean, it was a very, very interesting team. So, I must say, for me, personally, it's been a delight. I think, for the agenda, it shows that we all have to work together, if we're going to have a future that's sustainable, that has some justice, that does something about massive inequality. I though Will.i.am said it best in a session I was at this week, that was a serious discussion, not an entertainment piece, and-, and he actually said, 'If you think that inequality is generating such distortion in terms of the way we look at where people have opportunities today, if we don't actually mitigate technology in the interests of people, then it'll be-, it won't be 1%, it'll be from here to the moon.'\nSS: Sharan, you're going to be speaking after Mr. Trump speaks, this afternoon, as well. Look, Mr. Trump is speaking up for forgotten workers across America, he's looking after American jobs. He's appealing to a heartland that hasn't been enfranchised by globalization, as well. I-, I'm pretty sure, politically, you stand at a different end of the spectrum from Mr. Trump, but you must appreciate a lot of what the appeal is of him, and if he delivers a fraction of what he's promised to American people, for American jobs, you can kind of see why he is so successful in gaining the Presidency.\nSB: Well, democracy hasn't delivered the dividends to working people. You know, we have inequality that's historic, we have more displacement of people in the world, we have a growing fear of each other, and people are frightened for their jobs. You know, 85% of people tell us they want the rules of the global economy rewritten, so, I understand why the message is attractive. But, frankly, it's masquerading as a workers' champion, when there is no commitment in America to change the corporate model, there's no minimum living wage, on which you can live with dignity, it's a huge fight in the richest country in the world. Collective bargaining, and the fundamental human right, freedom of association, is seen as an anathema to American business, and people just-, it doesn't seem to register that there's no universal social safety net that people can touch.\nSS: Is that a no, you don't agree with Mr. Trump? [Laughter].\nSB: I certainly don't agree with Mr. Trump. I feel, you know, I mean, he's managed to, with the rise of other alpha male leaders, to unleash a wave of misogyny around the world, as if it's legitimate, in 2018. He's actually, you know, promised American workers something he can't and won't deliver-,\nSS: Sharan, we've got to go, but, actually, I wish I could have this conversation with you, because I disagree. I don't think there's just alpha males. I think Justin Trudeau is not alpha male, I think Macron is not alpha male, and we've got some terrific women leaders, as well, like Frau Merkel, and Christine Lagarde, and you, and so-, and Erna Solberg, who you just mentioned. So, I kind of-, I hear what you're saying, there is a constituency, but I also think there's a lot of, actually, very positive role models out there, as well. Sorry to disagree-,\nSB: Well, Justin-, Justin Trudeau is fantastic, so are the other people you managed , in terms of all admitting that globalization hasn't worked for working people, and it's certainly not working to include women-,\nSS: Yeah-,\nSB: But you can't deny that if you have, you know, people who think it's okay to talk about women-,\nSS: I hear you.\nSB: To disregard the rights of workers, we're in trouble as an inclusive world.\nSS: Sharan, you're right, and it's-, we'll have a longer conversation again another time. I'm glad we had a very good couple of conversations on a previous show, as well, which is still online, at CNBC, if you want to watch those, as well. Sharan Burrow, General Secretary of the International Trade Union Confederation. Always a pleasure, and thank you very much indeed for bringing so many key issues to light for us, as well.\nSB: Thank you.\nGC: Sharan, thank you.\nSB: Thanks a lot.\nSS: Thank you.\nENDS", "external_links": [], "published": "2018-01-26T08:00:00.000+02:00", "crawled": "2018-01-26T16:56:14.015+02:00", "highlightTitle": ""}