{"organizations": [], "uuid": "b2982afea7d22a89a1bb40f49a1c6ee88f15ac06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/cnbc-interview-with-jean-pascal-tricoire-schneider-electric-ceo-from-the-world-economic-forum-2018.html", "country": "US", "domain_rank": 767, "title": "CNBC Interview with Jean-Pascal Tricoire, Schneider Electric CEO, from the World Economic Forum 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T11:45:00.000+02:00", "replies_count": 0, "uuid": "b2982afea7d22a89a1bb40f49a1c6ee88f15ac06"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/cnbc-interview-with-jean-pascal-tricoire-schneider-electric-ceo-from-the-world-economic-forum-2018.html", "ord_in_thread": 0, "title": "CNBC Interview with Jean-Pascal Tricoire, Schneider Electric CEO, from the World Economic Forum 2018", "locations": [], "entities": {"persons": [{"name": "jean-pascal tricoire", "sentiment": "negative"}, {"name": "steve sedgwick", "sentiment": "none"}, {"name": "geoff cutmore", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "cnbc interview", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}, {"name": "schneider electric", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Following are excerpts from a CNBC interview with Jean-Pascal Tricoire, CEO of Schneider Electric, and CNBC's Steve Sedgwick and Geoff Cutmore from the World Economic Forum 2018.\nSS: Right. New research from the World Economic Forum says the majority of US jobs at risk for displacement by automation are currently held by women. I find that quite staggering. Some 1.4 million positions are at risk, in America alone. The impact of robots in the workplace is amongst the hot topics here at Davos. Let's speak about this, amongst other things, Jean-Pascal Tricoire, who is the CEO of Schneider Electric. I did a-, good morning to you, sir.\nJT: Good morning.\nSS: I did a closed-door session in Paris, with a lot of very big energy CEOs, and one of them turned round, one of the biggest in the world turned around and said, 'Well, we've got to be honest with people. People are going to lose a lot of jobs from digitalization.' Do you agree with him?\nJT: No. I don't agree with that. I just think it's going to be displacement. So, what you see today is acceleration of a few trends. One is absolute digitization of every facility, for more efficiency, I'm now speaking about energy. The other one is Industry 4.0. That means this convergence of IT technologies with operational technology, massive injection of artificial intelligence-,\nSS: Mm.\nJT: On the one side, of course, it is going to obsolete jobs, but, on the other side, it's creating a lot of new opportunities. To just make one example, buildings. 80% inefficient.\nSS: Mm.\nJT: If you want to go back to those buildings with digital technology, to make them far more efficient, 30%, 50% of energy efficiency, plenty of service, tech jobs on the ground, to deploy those technologies. And that's new jobs. And actually, when we put figures behind that, we see a sector which is going to grow by 10%, at least, in Europe, for instance, just take that example.\nSS: Why can't it be done by machines? I mean, there's this wonderful device, it's very expensive, it comes from America, and it's called a SAM, which is a Semi-Automated Mason. And it can put, in a straight line, albeit, at the moment, it can put more bricks in, in one day, by a power of about six, than a normal bricklayer.\nJT: Because 90% of the buildings you are going to retrofit are already built, and you need just to wire, to plug, to put those-, those digital things together, and that creates new jobs, very interesting jobs, new capabilities. We just need to skill people, we just need to empower 'prosumers', professional consumers, because this is where the change will come. It won't come by institutions, it will come by people who'll say, 'I want to consume less, I want to save, I want to consume green, I want to shop better, I want to store my energy.' There are plenty, plenty of new things that we are pioneering and deploying today, and-, and I see a massive acceleration. It's true, also, in industry. I mean, people speak about robots, but robots work with people, and it's not only about robots. It's about bringing more help, augmented capabilities to shop floor operators, by bringing them indications, improving their security with augmented reality, and all of this is now, but-,\nGC: I just wanted to move on, because we've got limited time. One of the issues that's come up here, this year, in the surveys, is how much more focused on geopolitical risks CEOs are. As we come in to the beginning of the year here, we've had a pushback on a Chinese bid for a US business. We've had Donald Trump roll out sanctions here on Chinese electrical goods. You did double-digit growth in China, over recent years. Are you worried that we are seeing the early salvoes of a growing dispute between the United States and China, and companies like yours could get trapped in the middle?\nJT: Well, of course, we prefer an open world, where countries cooperate smoothly together. It's always better for everybody, by the way. It's better for companies, it's better for people, an open world is-, is always better. At the same time, we've always developed our business as very multi-local, because our solution has to be market-specific, segment-specific. Every country is different, in terms of culture, in ways to approach things. We are in a brick and mortar and digital world, so we have to be very adapted to each market we touch, so, to a point where we can adapt to any kind of new situation. But what we sell, and the way we sell in China, is profoundly different from what we do in the US, or what we do in Europe.\nSS: Is there a different attitude to-, you're based in Hong Kong.\nJT: Yes.\nSS: Now, there's a reason for that, because you're-, you're looking eastwards, you're looking at Asia. Is there a different attitude in that part of the world, than there is in this part of the world?\nJT: Yes. Of course. I mean, because-, because the problem-, when you wake up in the morning, you don't face the same reality. At the end of the day, anywhere, there is an underlying very strong trend, which is more globalization, because we are all connected through the same tools, we all travel more, we-, we connect with institutions which are more international, but, at the same time, we don't see the world in the same manner. And the beauty of things like Davos, or all the other international meetings, is to help people understand the other people's points of view, and try to find connecting points.\nGC: Yes. And the dim sum's not as great in this part of the world. It's much better in Hong Kong.\nJT: I-, I confirm, but speak about the formula\nGC: Yes.\nSS: Well, you're both either current or former inhabitants of Hong Kong-,\nGC: Absolutely-,\nSS: So I'll take your word for it.\nGC: Jean-Pascal, it's been a pleasure. All too brief, but thanks so much for coming and seeing us.\nJT: Thanks. Thanks you very much.\nGC: So, Jean-Pascal Tricoire, the CEO of Schneider Electric.\nENDS", "external_links": [], "published": "2018-01-23T11:45:00.000+02:00", "crawled": "2018-01-23T11:59:28.000+02:00", "highlightTitle": ""}