{"organizations": [], "uuid": "c33e36ffc478e440f1c92dd61f46c5b1f2f4fdbb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225264676&w=1200&r=LYNXMPEE0O1LV", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-viacom-cbs-m-a-exclusive/exclusive-viacom-cbs-ceos-have-discussed-potential-merger-sources-idUKKBN1FE2XX", "country": "US", "domain_rank": 408, "title": "Exclusive - Viacom, CBS CEOs discuss potential merger: sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T23:57:00.000+02:00", "replies_count": 0, "uuid": "c33e36ffc478e440f1c92dd61f46c5b1f2f4fdbb"}, "author": "", "url": "https://uk.reuters.com/article/uk-viacom-cbs-m-a-exclusive/exclusive-viacom-cbs-ceos-have-discussed-potential-merger-sources-idUKKBN1FE2XX", "ord_in_thread": 0, "title": "Exclusive - Viacom, CBS CEOs discuss potential merger: sources", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 8:42 PM / Updated 2 hours ago Exclusive - Viacom, CBS CEOs discuss potential merger: sources Jessica Toonkel 4 Min Read \n(Reuters) - Viacom Inc Chief Executive Bob Bakish and CBS Corp CEO Leslie Moonves have had an exploratory discussion about merging the two media companies, sources familiar with the situation told Reuters on Thursday. \nThe discussion is a potential first step toward a recombination of CBS and Viacom. The boards of both companies have regularly scheduled meetings in the next several weeks and are expected to discuss the potential merger, the sources said. \nThe discussion between Bakish and Moonves, which took place earlier this month, was preliminary and no decisions have been made, but it signals that Moonves, who has had reservations about a potential deal between the companies, could be more open to the idea. \nThe sources wished to remain anonymous because they are not permitted to speak to the media. Viacom and CBS declined to comment. A spokeswoman for Shari Redstone declined to comment. \nCBS and Viacom explored and decided against a merger in 2016, at the urging of its controlling shareholders, ailing 94 year-old media mogul Sumner Redstone and his daughter Shari Redstone. Those merger talks failed due to concerns by CBS’ directors and Moonves over the financial sense for CBS shareholders and governance issues. \nShari Redstone has continued to discuss with executives at both companies her desire to merge the two, which has gained steam since Walt Disney Co announced in December it would acquire a majority of Twenty-First Century Fox Inc’s assets, sources have told Reuters. \nA combined company with CBS, which owns cable networks including Showtime as well as the CBS TV Network and CBS TV Studios, and Viacom, whose businesses include Paramount Pictures, Comedy Central, Nickelodeon and MTV, would have more negotiating leverage with cable and satellite companies. FILE PHOTO - Leslie Moonves, Chairman and CEO, CBS Corporation, speaks during the Milken Institute Global Conference in Beverly Hills, California, U.S., May 3, 2017. REUTERS/Lucy Nicholson \n“Scale matters now and is going to continue to matter in the future,” Shari Redstone told an audience at a luncheon at the Paley Center for Media in New York City last fall when asked about a potential CBS merger. \nIn a world with video streaming service Netflix Inc, which has a market capitalization of $113 billion and is dominating the media landscape, there is more pressure than ever on CBS and Viacom to merge, said Rich Greenfield, an analyst at BTIG. \nCBS and Viacom combined would have a market value of more than $37 billion. FILE PHOTO - The CBS television network logo is seen outside their offices on 6th avenue in New York, U.S. on May 19, 2016. REUTERS/Shannon Stapleton/File Photo \n“There is an urgent need for scale,” he said. “And both companies are facing challenges that a combination could help address,” Greenfield said. “It is eat or be eaten.” \nBakish is expected to have a senior role at the combined company if the two companies agree to a merger, sources said. \nSince he took over Viacom in late 2016, Bakish, 54, has improved relations with distributors, found financing for Paramount Pictures after Chinese investors dropped out and shuffled programming. \nEven so, Viacom’s stock has been trading around $33 a share, below the $35 to $38.80 range it was trading at when it and CBS explored a merger in late 2016. \nViacom shares were last up 1.8 percent in afternoon trade. CBS shares were up 0.5 percent. Reporting By Jessica Toonkel in New York; Editing by Meredith Mazzilli", "external_links": [], "published": "2018-01-25T23:57:00.000+02:00", "crawled": "2018-01-26T00:59:54.000+02:00", "highlightTitle": ""}