{"organizations": [], "uuid": "47cd370c682f5dad46da1fab4f1ccc4535c76de0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220250951&w=1200&r=LYNXMPEE070O2", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/jaguarlandrover-sales/jaguar-land-rover-reports-record-2017-sales-warns-on-uk-outlook-idINKBN1EX119", "country": "US", "domain_rank": 408, "title": "Jaguar Land Rover reports record 2017 sales, warns on UK outlook", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T14:06:00.000+02:00", "replies_count": 0, "uuid": "47cd370c682f5dad46da1fab4f1ccc4535c76de0"}, "author": "", "url": "https://in.reuters.com/article/jaguarlandrover-sales/jaguar-land-rover-reports-record-2017-sales-warns-on-uk-outlook-idINKBN1EX119", "ord_in_thread": 0, "title": "Jaguar Land Rover reports record 2017 sales, warns on UK outlook", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "jaguar land rover", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "jaguar", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "tata", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 12:10 PM / in 4 hours Jaguar Land Rover warns on UK outlook after record 2017 global sales Costas Pitas 3 Min Read \nLONDON (Reuters) - Jaguar Land Rover’s sales rose 7 percent to a record 621,109 vehicles in 2017 but Britain’s biggest carmaker said it faced tough conditions in its home market due to weakening consumer confidence and a planned diesel tax rise on new cars. A tyre is seen on Jaguar Land Rover's I-PACE concept car on display ahead of it's 2018 production launch as Jaguar's first fully electric SUV at their 'Tech Fest' in London, September 7, 2017. REUTERS/Toby Melville/File Photo \nThe company has embarked on a major turnaround plan since being bought by India’s Tata group in 2008. This includes investment in new models and expansion of production with the aim of building around 1 million vehicles a year by the turn of the decade. \nIt said growth in China, its largest market, and in the United States helped to offset difficult conditions in Britain and the rest of Europe, where demand was flat. \n“We have once again delivered year-on-year sales increases thanks to a world-class product range and new models such as the E-PACE and Velar, as well as China-specific models such as the XFL,” group sales operations director Andy Goss said on Monday. \n“But we are facing tough times in key markets such as the UK where consumer confidence and diesel taxes will hit us.” \nHowever, the company does expect domestic sales to rise this year from 2017’s 118,000 vehicles. \nBritain’s car industry body said last week that 2017 sales across the sector recorded their biggest drop since 2009, blaming plans to increase a levy on new diesel cars and weakening consumer confidence in the wake of Brexit. \nAround 90 percent of Jaguar Land Rover’s (JLR) sales in Britain are diesel models, which compares with around 45 percent globally. \nBritain’s finance minister Philip Hammond said in November that the vehicle excise duty would rise from April for those buying almost any new diesel car, potentially costing hundreds of pounds more for top-end models. \n“It’s difficult to fathom the latest decision in the budget,” Goss told reporters. \nMajor carmakers are scrambling to meet tougher emissions targets and growing demand for cleaner technologies. JLR said last year that all of its new cars would be available in an electric or hybrid version from 2020. \nThe British government hopes the JLR will build electric vehicles in the UK but JLR’s first such model, the I-PACE, will be made in Austria. JLR, based in central-England, builds roughly one in three of the 1.7 million cars produced in Britain each year. \nGoss told reporters that the firm would decide this year whether to build electric models in Britain. \n“We would understand why that would make sense but it is one of many options,” he said. “Within the next twelve months, we have to make that decision.” Editing by Jane Merriman", "external_links": [], "published": "2018-01-08T14:06:00.000+02:00", "crawled": "2018-01-08T14:28:56.020+02:00", "highlightTitle": ""}