{"organizations": [], "uuid": "aa0edd295c0f2e677dfd99057a5a2ddaf89a975f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 86}, "facebook": {"likes": 935, "shares": 935, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104939707-GettyImages-115959941.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/treasurys-bond-markets-move-because-us-depends-on-china-as-buyer.html", "country": "US", "domain_rank": 767, "title": "Treasurys: Bond markets move because US depends on China as buyer", "performance_score": 9, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.038, "site_type": "news", "published": "2018-01-11T08:03:00.000+02:00", "replies_count": 0, "uuid": "aa0edd295c0f2e677dfd99057a5a2ddaf89a975f"}, "author": "Huileng Tan", "url": "https://www.cnbc.com/2018/01/11/treasurys-bond-markets-move-because-us-depends-on-china-as-buyer.html", "ord_in_thread": 0, "title": "Treasurys: Bond markets move because US depends on China as buyer", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "none"}, {"name": "bloomberg news", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. bonds sold off on Wednesday — and that may have been the point.\nMarkets took a hit following a Bloomberg News report that cited unnamed sources as saying that officials in Beijing have recommended China , the largest holder of U.S. Treasurys , to slow or even halt its purchases of that debt.\nU.S. stocks on Wednesday snapped a six-day winning streak, and Treasury yields, already in an upswing, moved higher with the 10-year reaching 2.597 percent, their highest level since March 15. Bond yields rise when bond prices fall.\nChina's foreign exchange regulator publicly refuted the Bloomberg report on Thursday , saying it cited \"false information.\" But the jolt to markets may have been designed as a warning to Washington, which is clashing with China over trade and other issues.\nPolitical message? China holds $1.2 trillion of U.S. debt — more than any country. When it buys U.S. bonds, it is effectively lending money to the United States. Washington uses bond sales to China and others to help finance itself.\nThe curve thrown into markets this week comes as President Donald Trump appears poised to counter China on its huge trade surplus with the United States, and as Washington loses patience with Beijing over its handling of the North Korea nuclear crisis.\nshow chapters China wants to signal it is a 'major player' 16 Hours Ago | 02:34 On Thursday, the Chinese regulator soothed market worries when it said it was already diversifying its foreign exchange reserves, and its Treasury holdings are \"market driven.\"\nBut China is sending another message as well, Rajeev de Mello, head of Asian fixed income at Schroders Investment Management, told CNBC on Thursday.\nChina \"will not just lay passive if the U.S. administration imposes tariffs,\" he said. \"I think that's the position they want to be in, that they are a major player and not a small country on the receiving end of the U.S. big stick.\"\nBeijing's indication that it's not \"tied to U.S. bond-buying\" indicates more \"hardball' between the world's two biggest economies, said Vishnu Varathan, Mizuho Bank economist.\n\"It has to be seen as a prelude to possible trade tension, without being a very explicit threat,\" added Jens Nordvig of Exante Data.\nMaking 'the Treasury's job harder' In a note Wednesday, brokerage firm Jefferies said that \"If China stops buying Treasuries, the market could suffer.\"\nU.S. spending is seen rising this year, and most independent analysts expect U.S. tax revenue to fall under the GOP's new tax plan.\nshow chapters Bill Gross: Here's why the 25-year bull market for bonds is over 2:48 PM ET Wed, 10 Jan 2018 | 03:45 Treasury financing needs are going to rise significantly in 2018 compared with recent history, said Jefferies, so the Treasury Department is going to be looking for as many sources of demand as it can find. \"China turning away from the market potentially makes Treasury's job harder.\"\nThe reports out of China affected a market that bond investor Bill Gross, among others, have already said is under pressure . Broadly, central banks are moving away from global bond markets, with the Bank of Japan already trimming purchases of Japanese government debt. (Japan is the second-biggest holder of U.S. Treasurys, after China.)\nChina faces limits to how much it can do While China can certainly diversify its reserves, the People's Bank of China (PBOC) does have to deal with certain constraints, said London-based Capital Economics.\n\"The PBOC may be able to find better returns elsewhere, but the ability to liquidate assets at that sort of rate (that's possible with U.S. Treasurys) is a powerful draw. This explains why the share of reserves allocated to the U.S. market appears to have been stable over time,\" the research house said in a note on Wednesday.\nshow chapters China has 'very little' option but to hold US Treasurys 19 Hours Ago | 03:21 China's foreign exchange reserves are growing again , so Beijing will have few options but to buy U.S. Treasurys, added Mark Jolley, a strategist at CCB International Securities. China needs to invest its foreign exchange reserves in order to help it manage the value of its own currency, the yuan .\nBeijing may harbor genuine worries about the value of U.S. bonds, because of higher U.S. debt stemming from the recent tax reforms , among other reasons. But China is \"unlikely to shoot itself in the foot with imminent and large-scale selling of its U.S. Treasurys,\" said Mizuho's Varathan.\nRather than dumping bonds, Beijing will probably reduce Treasury holdings incrementally, thereby limiting the impact on the market, said Varathan.\nInstead of moving out of U.S. bonds, Beijing is conveying a message that will serve as a \"Sino-U.S. bargaining chip,\" Varathan said.\nWe've been here before This is not the first time China has threatened to back away from Treasurys.\nIn 2009, amid the Global Financial Crisis and early in Barack Obama's first term in office, former Chinese Premier Wen Jiabao told reporters that China has \"lent a huge amount of money to the U.S.\" and \"of course we are concerned about the safety of our assets. To be honest, I am definitely a little worried.\"\nChina was the largest holder of U.S. sovereign debt at that time, too.\nIts Treasury holdings are greater now than they were then.\n— CNBC's Sri Jegarajah, Fred Imbert, and Patti Domm contributed to this article.", "external_links": [], "published": "2018-01-11T08:03:00.000+02:00", "crawled": "2018-01-11T08:04:23.003+02:00", "highlightTitle": ""}