{"organizations": [], "uuid": "119b388364047d319b4fe99d215cf5be0ee47723", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-nutanix-announces-proposed-400-million-convertible-senior-notes-offering.html", "country": "US", "domain_rank": 767, "title": "Nutanix Announces Proposed $400 Million Convertible Senior Notes Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T00:02:00.000+02:00", "replies_count": 0, "uuid": "119b388364047d319b4fe99d215cf5be0ee47723"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-nutanix-announces-proposed-400-million-convertible-senior-notes-offering.html", "ord_in_thread": 0, "title": "Nutanix Announces Proposed $400 Million Convertible Senior Notes Offering", "locations": [], "entities": {"persons": [{"name": "nutanix", "sentiment": "none"}], "locations": [{"name": "san jose", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "nutanix", "sentiment": "none"}], "organizations": [{"name": "nutanix, inc.", "sentiment": "neutral"}, {"name": "nutanix", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN JOSE, Calif.--(BUSINESS WIRE)-- Nutanix, Inc. (“Nutanix”) (NASDAQ: NTNX) today announced its intention to offer, subject to market conditions and other factors, $400 million aggregate principal amount of convertible senior notes due 2023 (the “notes”) in a private placement to qualified institutional buyers pursuant to Rule 144A under the Securities Act of 1933, as amended (the “Act”). Nutanix also expects to grant the initial purchasers an option to purchase up to an additional $60 million aggregate principal amount of the notes within a 13-day period from, and including, the initial issuance date of the notes.\nThe notes will be unsecured senior obligations of Nutanix. Interest will be payable semi-annually in arrears. The notes will be convertible at the option of holders, subject to certain conditions and during certain periods, into cash, shares of Nutanix’s Class A common stock (the “common stock”) or a combination of cash and shares of common stock, at the election of Nutanix. The interest rate, initial conversion rate and other terms of the notes are to be determined upon pricing of the offering.\nNutanix intends to use a portion of the net proceeds of the offering to pay the cost of the convertible note hedge transactions described below (after such cost is partially offset by the proceeds to Nutanix of the warrant transactions described below) and to use the remaining proceeds of the offering for general corporate purposes, including working capital, capital expenditures and potential acquisitions. From time to time, we evaluate potential acquisitions of businesses, technologies or products. Currently, however, we do not have any definitive agreements with respect to any pending material acquisitions.\nIn connection with the pricing of the notes, Nutanix plans to enter into convertible note hedge and warrant transactions with one or more of the initial purchasers or their affiliates or other financial institutions (the “option counterparties”). The convertible note hedge transactions are generally expected to reduce potential dilution to the common stock upon any conversion of notes and/or offset any cash payments Nutanix is required to make in excess of the principal amount of converted notes, as the case may be. However, the warrant transactions could separately have a dilutive effect to the extent that the market value per share of common stock exceeds the strike price of any warrants. If the initial purchasers exercise their option to purchase additional notes, Nutanix may enter into additional convertible note hedge and additional warrant transactions relating to the additional notes. In connection with establishing their initial hedge of the convertible note hedge and warrant transactions, the option counterparties or their respective affiliates expect to purchase shares of the common stock and/or enter into various derivative transactions with respect to the common stock concurrently with or shortly after the pricing of the notes. This activity could increase (or reduce the size of any decrease in) the market price of the common stock or the notes at that time.\nIn addition, the option counterparties and/or their respective affiliates may modify their hedge positions by entering into or unwinding various derivatives with respect to the common stock and/or purchasing or selling the common stock in secondary market transactions following the pricing of the notes and prior to the maturity of the notes (and are likely to do so during any observation period related to a conversion of notes or following any repurchase of notes by Nutanix on any fundamental change or repurchase date or otherwise). This activity could also cause or avoid an increase or a decrease in the market price of the common stock or the notes, which could affect the ability of noteholders to convert the notes and, to the extent the activity occurs during any observation period related to a conversion of notes, it could affect the amount and value of the consideration that noteholders will receive upon conversion of such notes.\nThis announcement is neither an offer to sell nor a solicitation of an offer to buy any of these securities and shall not constitute an offer, solicitation, or sale in any jurisdiction in which such offer, solicitation, or sale is unlawful. Any offer of the securities will be made only by means of a private offering memorandum. The notes and the shares of the common stock issuable upon conversion of the notes, if any, will not be registered under the Act or any state securities law, and unless so registered, may not be offered or sold in the United States except pursuant to an applicable exemption from the registration requirements of the Act and applicable state securities laws.\nAbout Nutanix\nNutanix makes infrastructure invisible, elevating IT to focus on the applications and services that power their business. The Nutanix Enterprise Cloud OS software leverages web-scale engineering and consumer-grade design to natively converge compute, virtualization and storage into a resilient, software-defined solution with rich machine intelligence. The result is predictable performance, cloud-like infrastructure consumption, robust security, and seamless application mobility for a broad range of enterprise applications and services.\nForward-Looking Statements\nThis press release includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. These statements involve risks and uncertainties that could cause actual results to differ materially, including, but not limited to, whether Nutanix will offer the notes, the anticipated terms of the offering, whether Nutanix will be able to consummate the offering, the final terms of the offering, the satisfaction of customary closing conditions with respect to the offering of the notes, prevailing market conditions, the anticipated use of the net proceeds of the offering of the notes which could change as a result of market conditions or for other reasons, whether the convertible note hedge and warrant transactions will be entered into or become effective, and the impact of general economic, industry or political conditions in the United States or internationally. Forward-looking statements may be identified by the use of the words “may,” “will,” “expect,” “intend,” and other similar expressions. These forward-looking statements are based on estimates and assumptions by Nutanix’s management that, although believed to be reasonable, are inherently uncertain and subject to a number of risks. Actual results may differ materially from those anticipated or predicted by Nutanix’s forward-looking statements. All forward-looking statements are subject to other risks detailed in our Quarterly Report on Form 10-Q for the quarter ended October 31, 2017 and the risks discussed in our other filings with the Securities and Exchange Commission. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date hereof. All forward-looking statements are qualified in their entirety by this cautionary statement, and we undertake no oblig", "external_links": ["http://www.businesswire.com/news/home/20180116006737/en/"], "published": "2018-01-17T00:02:00.000+02:00", "crawled": "2018-01-17T02:05:36.020+02:00", "highlightTitle": ""}