{"organizations": [], "uuid": "cbc4999966f98b4741a4ab52765fec7733186296", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-endeavour-closes-the-sale-of-its-non-core-nzema-mine.html", "country": "US", "domain_rank": 767, "title": "Endeavour Closes the Sale of its Non-Core Nzema Mine", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-03T16:49:00.000+02:00", "replies_count": 0, "uuid": "cbc4999966f98b4741a4ab52765fec7733186296"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-endeavour-closes-the-sale-of-its-non-core-nzema-mine.html", "ord_in_thread": 0, "title": "Endeavour Closes the Sale of its Non-Core Nzema Mine", "locations": [], "entities": {"persons": [{"name": "ja", "sentiment": "negative"}], "locations": [{"name": "pdf format george town", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "ghana", "sentiment": "none"}], "organizations": [{"name": "bcm international ltd", "sentiment": "none"}, {"name": "endeavour mining corporation", "sentiment": "none"}, {"name": "nzema mine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ENDEAVOUR CLOSES THE SALE OF ITS NON-CORE NZEMA MINE\nView News Release in PDF Format\nGeorge Town, January 3, 2018 - Endeavour Mining Corporation (TSX:EDV OTCQX: EDVMF) (\"Endeavour\") is pleased to announce that on December 29, 2017, it completed the sale of its 90% interest in the non-core Nzema Mine in Ghana to BCM International Ltd (\"BCM\"), as previously announced on August 9, 2017.\nEndeavour received a payment of US$38.5 million upon closing, corresponding to the first two payments less adjustments. Additional deferred payments of up to US$25 million are expected to be received over the course of 2018 and 2019, based upon reaching certain agreed upon milestones related to mine free cash flow generation.\nABOUT BCM INTERNATIONAL\nBCM International is one of Africa's largest mining and civil contractors, with offices across eight countries and a long history in Ghana, where it is headquartered.\nBCM International has deep mining expertise, with in house technical staff capable of taking a mine from start-up through commissioning and set-up of the technical disciplines of the mine through to ongoing production.\nTheir experience gained in Ghana over more than 20 years working with local cultural and business practices, workforce management, local business relationships, tax and corporate compliance matters, banking relationships and many other logistical issues is core to the company's business.\nENDEAVOUR CONTACT INFORMATION\nMartino De Ciccio\nVP - Strategy & Investor Relations\n+44 203 011 2719\nmdeciccio@endeavourmining.com DFH Public Affairs in Toronto\nJohn Vincic, Senior Advisor\n(416) 206-0118 x.224\njvincic@dfhpublicaffairs.com\nBrunswick Group LLP in London\nCarole Cable, Partner\n+44 7974 982 458\nccable@brunswickgroup.com\nABOUT ENDEAVOUR\nEndeavour Mining is a TSX listed intermediate African gold producer with a solid track record of operational excellence, project development and exploration in the highly prospective Birimian greenstone belt in West Africa. Endeavour is focused on offering both near-term and long-term growth opportunities with its project pipeline and its exploration strategy, while generating immediate cash flow from its operations.\nEndeavour operates 5 mines across Côte d'Ivoire (Agbaou and Ity), Burkina Faso (Houndé, Karma), and Mali (Tabakoto). Endeavour's high-quality development projects (recently commissioned Houndé, Ity CIL and Kalana) have the combined potential to deliver an additional 600koz per year at an AISC well below $700/oz between 2018 and 2020. In addition, its exploration program aims to discover 10-15Moz of gold by 2021 which represents more than twice the reserve depletion during the period.\nFor more information, please visit www.endeavourmining.com .\nCorporate Office: 5 Young St, Kensington, London W8 5EH, UK\nThis news release contains \"forward-looking statements\" including but not limited to, statements with respect to Endeavour's plans and operating performance, the estimation of mineral reserves and resources, the timing and amount of estimated future production, costs of future production, future capital expenditures, and the success of exploration activities. Generally, these forward-looking statements can be identified by the use of forward-looking terminology such as \"expects\", \"expected\", \"budgeted\", \"forecasts\", and \"anticipates\". Forward-looking statements, while based on management's best estimates and assumptions, are subject to risks and uncertainties that may cause actual results to be materially different from those expressed or implied by such forward-looking statements, including but not limited to: risks related to the successful integration of acquisitions; risks related to international operations; risks related to general economic conditions and credit availability, actual results of current exploration activities, unanticipated reclamation expenses; changes in project parameters as plans continue to be refined; fluctuations in prices of metals including gold; fluctuations in foreign currency exchange rates, increases in market prices of mining consumables, possible variations in ore reserves, grade or recovery rates; failure of plant, equipment or processes to operate as anticipated; accidents, labour disputes, title disputes, claims and limitations on insurance coverage and other risks of the mining industry; delays in the completion of development or construction activities, changes in national and local government regulation of mining operations, tax rules and regulations, and political and economic developments in countries in which Endeavour operates. Although Endeavour has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements. Please refer to Endeavour's most recent Annual Information Form filed under its profile at www.sedar.com for further information respecting the risks affecting Endeavour and its business. AISC, all-in sustaining costs at the mine level, cash costs, operating EBITDA, all-in sustaining margin, free cash flow, net free cash flow, free cash flow per share, net debt, and adjusted earnings are non-GAAP financial performance measures with no standard meaning under IFRS, further discussed in the section Non-GAAP Measures in the most recently filed Management Discussion and Analysis.\nAttachments:\nhttp://www.globenewswire.com/NewsRoom/AttachmentNg/810dccda-1869-4255-a56e-f73b429ea247\nSource: Endeavour Mining Corporation", "external_links": ["http://www.globenewswire.com/NewsRoom/AttachmentNg/810dccda-1869-4255-a56e-f73b429ea247", "https://www.globenewswire.com/Tracker?data=71OmfbOyhgOcCW0cPD3O37pRrv6ROwgxfDk1woThRnC1HiDxUdz6vvQHnlJYGy6zOIS4xy0t69gAkv-93LMEzXklTnKwyXYFZ2rXFSFf9PwkyZbzz2YVYtsNDs8dj5FrgCWa1LQG84LjILUdDdRFKw==", "https://www.globenewswire.com/Tracker?data=4TcngwC0OifsJ0D0J3r2e_COCoa2LuWhv3IEb2b6F84pVsFdSrs3S1LH8TUqGbZePHiCs0TchapfcR1XY3En_zVIiN_LOw3yL3f1t1IG6Cnn2kRUltWGdL4_iEJaWh37v-kD0rpiQEzD9UnaHeQ-BWqC6CKn1jHbo2tEf1CDZI5vZHiCvg6iyBjGkYThPnDHrcuq6Xgp50oWaMu3T2vIBzKo1NWIraKbWles2eUxRi5I3srJVpGAbyFWrC-_WCsV9toucP1bHYzMix2uAfJE4A==", "https://www.globenewswire.com/Tracker?data=Lf4t0vNog1pjtFKV34c0JDEALfPkORo_0KyqA15DLlsIFscVqZ4KUjh195fR2IRSvsWIpEFTd6Lb9LhbRQWmCDGcvk6TV0_JJ75e1Ue6vCs="], "published": "2018-01-03T16:49:00.000+02:00", "crawled": "2018-01-03T16:27:37.013+02:00", "highlightTitle": ""}