{"organizations": [], "uuid": "21bed4755aa5721635a0b53c9ae93f32a76fd2b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180116.html", "section_title": "Archive News &amp; Video for Tuesday, 16 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-dow-hits-26000-for-first-time-on-earnings-optimism-idUSL3N1PB4QG", "country": "US", "domain_rank": 408, "title": "US STOCKS-Dow hits 26,000 for first time on earnings optimism", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.734, "site_type": "news", "published": "2018-01-17T02:17:00.000+02:00", "replies_count": 0, "uuid": "21bed4755aa5721635a0b53c9ae93f32a76fd2b9"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-dow-hits-26000-for-first-time-on-earnings-optimism-idUSL3N1PB4QG", "ord_in_thread": 0, "title": "US STOCKS-Dow hits 26,000 for first time on earnings optimism", "locations": [], "entities": {"persons": [{"name": "sruthi shankar jan 16", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "citigroup", "sentiment": "negative"}, {"name": "unitedhealth", "sentiment": "negative"}, {"name": "ge", "sentiment": "negative"}, {"name": "citigroup inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Citigroup, UnitedHealth jump after Q4 results\n* GE slides after saying it would take $6.2 bln charge in Q4\n* Merck gains on positive Keytruda lung cancer data\n* Indexes up: Dow 0.59 pct, S&P 0.23 pct, Nasdaq 0.25 pct (Updates to early afternoon)\nBy Sruthi Shankar\nJan 16 (Reuters) - The Dow Jones Industrial Average raced past the 26,000 mark for the first time on Tuesday as fourth-quarter earnings season got off to a strong start following upbeat results from UnitedHealth and Citigroup.\nThe blue-chip index, however, eased from its peak as a pullback in oil prices weighed on energy stocks.\nUnitedHealth rose 2.5 percent after the largest U.S. health insurer reported results that beat estimates and raised its 2018 earnings outlook.\nCitigroup Inc rose 1.13 percent after the lender reported a profit that topped expectations as strength in consumer businesses made up for lower revenue from bond and currency trading.\nHopes of strong earnings, supported by a steep cut in corporate taxes, and solid global economic growth have bolstered Wall Street’s optimism in the start to 2018.\n“There is really nothing in (the market‘s) way at this point,” said Paul Nolte, portfolio manager at Kingsview Asset Management in Chicago.\n“Investors are liking the fact that companies are talking up earnings, more than they have done in the past. We’re going to see better earnings over the next 12 months and you need to buy stocks now to take advantage of that.”\nMore than three quarters of the 30 S&P 500 companies that have reported so far have topped profit estimates, according to Thomson Reuters I/B/E/S.\nAt 12:31 p.m. ET (1731 GMT), the Dow Jones Industrial Average was up 152.72 points, or 0.59 percent, at 25,955.91. If the index closes above 26,000, it would be the fastest 1,000-point gain ever.\nUnitedHealth, Merck and Goldman Sachs were the top boosts to the Dow.\nThe S&P 500 was up 6.52 points, or 0.23 percent, at 2,792.76 and the Nasdaq Composite was up 18.21 points, or 0.25 percent, at 7,279.27.\nThe CBOE Volatility index, a widely followed measure of market anxiety, rose to a more than 1 month high at 11.27.\nSix of the 11 major S&P sectors were higher, led by a 1.31 percent rise in the real estate index and a 0.81 percent gain in the healthcare index.\nMerck surged more than 7 percent after early results from a key study showed its blockbuster drug Keytruda and two chemotherapy medicines helped lung cancer patients live longer and stopped the disease from advancing.\nThe S&P energy index fell 0.65 percent as Brent crude oil shed some of its recent gains, falling nearly $1 per barrel.\nGeneral Motors rose 2 percent after the company said it expected earnings in 2018 to be largely flat, compared with 2017, but that profits should pick up pace in 2019.\nGeneral Electric fell about 4 percent after raising the prospect of breaking itself up and announced more than $11 billion in charges from its long-term care insurance portfolio and new U.S. tax laws.\nViacom fell 5.4 percent after sources told Reuters CBS Corp and the company were not in active merger discussions.\nAdvancing issues outnumbered decliners on the NYSE by 1,555 to 1,350. On the Nasdaq, 1,488 issues rose and 1,448 fell. (Reporting by Sruthi Shankar in Bengaluru; Editing by Anil D‘Silva)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T02:17:00.000+02:00", "crawled": "2018-01-17T20:00:12.006+02:00", "highlightTitle": ""}