{"organizations": [], "uuid": "c85faa2503ba202b7ee1421bad7b14d22d79c14c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WH332_unilev_TOP_20171124154656.jpg", "site_section": "https://www.wsj.com/europe", "section_title": "The Wall Street Journal &amp; Breaking News, Business, Financial and Economic News, World News and Video", "url": "https://www.wsj.com/articles/cmo-today-unilevers-imitation-strategy-diageo-halts-snap-ads-are-ads-coming-to-alexa-1514984190", "country": "US", "domain_rank": 387, "title": "CMO Today: Unilever’s Imitation Strategy; Diageo Halts Snap Ads; Are Ads Coming to Alexa?", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-03T15:56:00.000+02:00", "replies_count": 0, "uuid": "c85faa2503ba202b7ee1421bad7b14d22d79c14c"}, "author": "Lara O’Reilly", "url": "https://www.wsj.com/articles/cmo-today-unilevers-imitation-strategy-diageo-halts-snap-ads-are-ads-coming-to-alexa-1514984190", "ord_in_thread": 0, "title": "CMO Today: Unilever’s Imitation Strategy; Diageo Halts Snap Ads; Are Ads Coming to Alexa?", "locations": [], "entities": {"persons": [{"name": "alexa", "sentiment": "negative"}, {"name": "saabira chaudhuri", "sentiment": "none"}, {"name": "atkins", "sentiment": "none"}, {"name": "rob lowe", "sentiment": "none"}, {"name": "dj khaled", "sentiment": "none"}], "locations": [], "organizations": [{"name": "diageo", "sentiment": "negative"}, {"name": "unilever", "sentiment": "negative"}, {"name": "wsj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Good morning. It’s the start of January, so you know what that means: Lots of diet and exercise ads making us feel guilty about our end-of-2017 excesses. This year we’ve got a couple of notable new brand ambassadors attempting to whip us into shape. First, a “Major Key” alert: Weight Watchers struck lucky by signing up DJ Khaled as a “social media ambassador,” which immediately gave its shares a boost. Atkins has enlisted actor Rob Lowe as its pitchman to present the brand as a lifestyle, not just a diet. SoulCycle, meanwhile, is reinventing the wheel (sorry) in an ad campaign that encourages us to “screw” our sanctimonious New Year’s resolutions .\nImitation Is the Best Form of Flattery If you can’t beat ‘em, imitate ‘em. That’s been the Unilever strategy when it comes to taking on the smaller, niche or locally made brands to which shoppers are increasingly gravitating. This piece from WSJ’s Saabira Chaudhuri is a must-read marketing case study on how a CPG behemoth is reacting to a new batch of nimble competitors . One of the most fun highlights in the piece comes from Unilever’s shampoo division, which faces new threats from online beauty services like Birchbox and specialty stores. Knowing that women tend to be skeptical of shampoo quality if the prices are low, the marketing team at the lower-end Suave brand pulled a prank. They repackaged the product into a small, understated bottle, renamed it “evaus” (“Suave” backward) and sent it out to beauty bloggers. The big reveal came during a “casting call” to advertise the brand, where bloggers’ reactions were filmed as they were told the truth about their “boutique” new products. Lots of takeaways for marketers across all sectors whose companies face disruption from a siege of new upstarts.\nDrink (and Target) Responsibly An interesting story for you out of the U.K. that may have wider implications: British alcohol giant Diageo has suspended all its Snapchat advertising globally . The decision came after the Advertising Standards Authority ruled its Captain Morgan brand didn’t take enough care to ensure people under the U.K. legal drinking age of 18 didn’t see its June “Sponsored Lens” campaign that turned one’s selfie into a pirate with clinking drink glasses. The ASA called into question Snap’s age-targeting options at the time, which relied on the birth dates users self-report when they register for the app. Not long after the Captain Morgan campaign ran, Snap introduced more interest-based targeting selections to assist marketers in ruling out users who might have lied about their age. The ruling could raise questions about the accuracy of self-reported user data more broadly—although platforms with first-party logins would likely argue that their data is more accurate than extrapolating from panels, as happens with other media.\n—A Message to Booze Rudy—\nSomething not covered by the ASA: Augmented-reality ad formats tend to be designed to be messaged to others. Even if advertisers age-gate their initial targeting, there’s little stopping someone sending a photo or video of themselves using the ad to someone underage. It’s yet another consideration for alcohol marketers when it comes to deciding which channels are safe to use. And with Snapchat specifically, it’s something alcohol brands have been assessing for a while .\nIs There An Echo In Here? SEO experts, listen up. Literally. We know that Amazon has been squirreling away over the past couple of years, quietly building its ad business. Now, CNBC reports Amazon has been in talks with companies including Procter & Gamble and Clorox to bring voice ads to its Echo devices . The idea is that if a consumer asks Alexa for ideas on how to remove a stain, for example, brands could pay for the voice assistant to recommend their product. Another experiment might see Amazon using information on users’ past shopping behavior to recommend other products from that manufacturer. It seems the talks are in early stages: Amazon told CNBC it has no plans to bring ads to Alexa. Nevertheless, use of voice-powered devices is only going up. Amazon says its Echo Dot was the top-selling product from any manufacturer across all categories on Amazon.com this holiday season. Marketers: Time to get your voice skills in order.\nTransparency Is the Mother of Re-Invention Ad tech company Rocket Fuel marked the end of an era this summer when fellow ad tech firm Sizmek announced plans to acquire it for $125.5 million, a fraction of Rocket Fuel’s peak valuation of around $2 billion. Sizmek on Wednesday announced the next era for the merged company will be “ total transparency ,” I reported for CMO Today. It will now offer an a la carte pricing menu so its clients can see exactly how much they’re paying for each aspect of their media buy, from tech platform fees to data costs. Sizmek also says it’ll give clients more specific data about how its “AI” model works. Trust and transparency in the ad tech ecosystem have been top of mind for marketers who in recent months have been seizing more control over their contracts and media placements and demanding more visibility into the fees they are charged for their online ad buys. There were plenty of transparency-related announcements from ad tech companies last year. Expect that theme to continue in the months to come as firms in the space look to get rid of the perception that they are mysterious “black boxes.”\nBest of the rest Vice Media has placed its president, Andrew Creighton, and chief digital officer, Mike Germano, on leave after sexual harassment allegations were made against them in a New York Times investigation last month. [ New York Times ]\nMargrethe Vestager, the European commissioner for competition, said she is focusing on how companies stockpile and use big data and whether they can exclude new competitors from markets if they control exclusive information that can help them win customers or cut costs. [ WSJ ]\nJPMorgan created its own proprietary algorithm to ensure its ads don’t end up next to unsavory YouTube videos. The algorithm filters out channels based on data such as total video view count, the topics the channel focuses on and the comments users leave. [ Business Insider ]\nYouTube said a video from popular social media star Logan Paul, which appeared to show him and his friends discovering a man’s body hanging from a tree in a Japanese forest known for suicides, violated its policies. Mr. Paul has apologized, saying he had intended for the video to “raise awareness for suicide and suicide prevention.” [ CNN ]\nVideo ad tech company Videology is reportedly seeking a buyer. [ Business Insider ]\nA profile of Tenor, the GIF search company that in September began selling sponsored GIF campaigns to advertisers including AT&T, Nissan, Wendy’s and Dunkin’ Donuts. [ Axios ]\nAbout Us Follow us on Twitter: @wsjCMO , @larakiara , @VranicaWSJ , @alexbruell , @BenMullin , @srabil , @asharma\nSubscribe to our morning newsletter, delivered straight to your inbox, at http://on.wsj.com/CMOTodaySignup .\nWrite to Lara O’Reilly at lara.o'reilly@wsj.com", "external_links": ["http://adage.com/article/cmo-strategy/spot-soulcycle-f-resolutions/311773", "http://www.businessinsider.com/jpmorgan-frustrated-youtube-brand-safety-ads-2017-12", "https://twitter.com/srabil", "https://twitter.com/VranicaWSJ", "http://www.businessinsider.com/videology-seeks-buyer-as-google-and-other-tech-giants-dominate-ad-tech-industry-2018-1", "http://adage.com/article/cmo-strategy/booze-brands-rush-snapchat-navigating-age-risks/304880/", "https://twitter.com/larakiara", "https://twitter.com/BenMullin", "https://twitter.com/asharma", "https://twitter.com/wsjCMO", "https://www.cnbc.com/2018/01/02/amazon-alexa-is-opening-up-to-more-sponsored-product-ads.html", "https://digiday.com/marketing/alcohol-brands-reluctant-advertise-snapchat/", "https://twitter.com/alexbruell", "https://www.nytimes.com/2018/01/02/business/vice-media-executives-on-leave.html", "http://money.cnn.com/2018/01/02/technology/logan-paul-youtube-response/index.html", "https://www.axios.com/tenor-is-tapping-media-companies-to-build-its-business-out-of-gifs-2521749534.html", "http://adage.com/article/cmo-strategy/atkins-hires-rob-lowe-promote-lifestyle-a-diet/311791/"], "published": "2018-01-03T15:56:00.000+02:00", "crawled": "2018-01-04T04:23:18.001+02:00", "highlightTitle": ""}