{"organizations": [], "uuid": "abbe89a20a9aaacb1900cb61bd6c3f1cf7da6f40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/09/softbank.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/19/data-sheet-softbank-uber-statement/", "country": "US", "domain_rank": 1196, "title": "Data Sheet—Softbank's Uber Investment Explained | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.938, "site_type": "news", "published": "2018-01-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "abbe89a20a9aaacb1900cb61bd6c3f1cf7da6f40"}, "author": "Aaron Pressman", "url": "http://fortune.com/2018/01/19/data-sheet-softbank-uber-statement/", "ord_in_thread": 0, "title": "Data Sheet—Softbank's Uber Investment Explained | Fortune", "locations": [], "entities": {"persons": [{"name": "fortun", "sentiment": "negative"}, {"name": "adam lashinsky", "sentiment": "negative"}, {"name": "aaron pressman", "sentiment": "negative"}, {"name": "marcelo claure", "sentiment": "none"}, {"name": "rajeev misra", "sentiment": "none"}, {"name": "misra", "sentiment": "none"}], "locations": [], "organizations": [{"name": "softbank", "sentiment": "negative"}, {"name": "board", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "sprint", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Aaron Pressman and Adam Lashinsky January 19, 2018 \nThis is the web version of Data Sheet, Fortune’s daily newsletter on the top tech news. To get it delivered daily to your in-box, sign up here . \nSoftBank issued a brief statement Thursday in the name of the CEO of its investment arm, Rajeev Misra. In its entirety it read: \n“We are very pleased to have successfully closed the Uber investment and appreciate the support and professionalism of the Board, management team and shareholders who made this transaction possible. Uber has a very bright future under its new leadership. It is now part of a wider SoftBank network ranging from Sprint to WeWork. I look forward to SoftBank helping Uber become an even bigger global success.” \nSome facts, per Bloomberg , (with some of my comments): \n—The investment totaled $9.3 billion, partly directly into Uber at a valuation of about $70 billion, partly to buy out other investors at a significant discount. The blended valuation is $54 billion. (A come down but still giant.) \n—Two SoftBank representatives, Misra and Sprint CEO Marcelo Claure, will join the board. But there are four additional vacancies to what will be a 17-member body. (Awkward, from a governance perspective.) \n—The investment ends preferred voting rights held by early investors, including longtime CEO Travis Kalanick. (A sign Uber might end its soap-opera period.) \nThe most interesting parts of SoftBank’s statement are what it didn’t say. It praised the “professionalism” of the board, management team and investors in closing the deal—an all but explicit knock on the lack of professionalism by the board, management team, and investors (read: Benchmark Capital) during much of 2017. It also mentioned an office space and a phone company in its “SoftBank network” but not Uber competitors Didi and Grab, the strange bedfellows SoftBank has now made for Uber. \nMaybe it’s premature to say Uber might be ending its soap-opera period. \n*** \nI apologize for saying yesterday that Microsoft had “won” its antitrust suit with the Justice Department. True, the feds didn’t break up Microsoft, the way they did AT&T . It’s also true that Microsoft’s enemies thought the consent decree it signed was too weak. But to say Microsoft emerged victorious for having settled with Justice wasn’t altogether right. Thank you to Pallavi Guniganti for pointing this out to me on Twitter. \n*** \nFor the 11th consecutive year Apple ranks No. 1 on Fortune’s list of World’s Most Admired Companies. The full list, published today, is here . Adam Lashinsky @adamlashinsky NEWSWORTHY \nFinally . IBM reported quarterly revenue of $22.5 billion, slightly more than Wall Street expected and 4% more than a year earlier. That ends a streak of 22 consecutive quarters of declining revenue at Big Blue. Newer growth areas including cloud services grew 17%, but without a weaker U.S. dollar total revenue growth would have been just 1%. The news failed to impress investors and IBM shares dropped 3% in premarket trading on Friday. \nNot quite finally . The Securities and Exchange Commission says it’s too soon to put cryptocurrencies into the investor-friendly exchange-traded funds format, as it rejected several pending proposals. Meanwhile, digital currency prices including bitcoin and ethereum rallied on Thursday, ending a two-day plunge. Bitcoin, which had dropped below $10,000 for the first time since late November, was trading at around $12,000 on Friday morning. \nRough ride. Buses that carry Apple and Google employees from San Francisco to the companies’ offices in Silicon Valley had to be rerouted after several had their windows smashed while driving on the I-280 highway. Police suspect a pellet gun was used in the attacks. No injuries have been reported. \nNobody home . Google added a two-factor authentication security feature to Gmail seven years ago, but fewer than 10% of users have opted to turn it on, software engineer Grzegorz Milka disclosed at a conference this week. Asked why Google didn’t force people to use 2FA, Milka said it would be too hard to use for some. “It’s about how many people would we drive out if we force them to use additional security.” \nDisappearing workforce. Messaging service Snap laid off about two dozen employees, Cheddar reported . Most were in the content division that works with major publishers to create original videos. \nMore talk. Heading for its public listing, music streaming giant Spotify is trying to attract more podcast-like content around news, culture and entertainment. A new format called Spotlight will combine spoken programming, playlists and some visual content for use by partner publishers including Buzzfeed and Cheddar. IN CASE YOU MISSED IT ", "external_links": [], "published": "2018-01-19T02:00:00.000+02:00", "crawled": "2018-01-20T15:15:16.031+02:00", "highlightTitle": ""}