{"organizations": [], "uuid": "1b44453a4da620279c847109228e36c8bb5554de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220897685&w=1200&r=LYNXMPEE091BL", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-pope-chile/pope-francis-to-face-protests-in-chile-over-bishop-appointment-idUSKBN1EZ2EJ", "country": "US", "domain_rank": 408, "title": "Pope Francis to face protests in Chile over bishop appointment", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T20:13:00.000+02:00", "replies_count": 0, "uuid": "1b44453a4da620279c847109228e36c8bb5554de"}, "author": "", "url": "https://www.reuters.com/article/us-pope-chile/pope-francis-to-face-protests-in-chile-over-bishop-appointment-idUSKBN1EZ2EJ", "ord_in_thread": 0, "title": "Pope Francis to face protests in Chile over bishop appointment", "locations": [], "entities": {"persons": [{"name": "pope francis", "sentiment": "negative"}, {"name": "dave sherwood", "sentiment": "none"}, {"name": "francis", "sentiment": "none"}, {"name": "juan barros", "sentiment": "none"}], "locations": [{"name": "chile", "sentiment": "none"}, {"name": "south america", "sentiment": "none"}, {"name": "argentina", "sentiment": "none"}, {"name": "osorno", "sentiment": "none"}], "organizations": [{"name": "roman catholic", "sentiment": "none"}, {"name": "vatican", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  santiago", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SANTIAGO (Reuters) - Chileans protesting Pope Francis’s 2015 appointment of a Roman Catholic bishop accused of protecting an alleged pedophile threaten to cast a shadow over the pontiff’s visit to South America next week.\nParishioners in Osorno, a small city 800 kilometers (497 miles) south of the Chilean capital, say Vatican representatives denied their requests to meet with Francis. They plan to protest every day of the Pope’s Jan. 15 - 18 stay in Chile.\nPope Francis, who hails from neighboring Argentina and once briefly lived in Chile, has defended Osorno Bishop Juan Barros and says allegations that he covered up abuses by one of Chile’s most notorious sexual predators were unfounded.\nPlanned demonstrations in Chile, a staunchly Catholic country, have rekindled accusations Francis has not done enough to root out sexual abuse in the Church, especially holding bishops accountable for covering up or mishandling sexual abuse.\n“We believe the victims of sexual abuse have been marginalized (by the Church),” said Juan Carlos Claret, a spokesman for Osorno parishioners. “It’s a reality that we in Osorno have been living with for almost four years and we plan to keep the issue alive.”\nProtests will kick off during the Pope’s public appearances in the Chilean capital on Tuesday, dimming the gleam of the first leg of his return to Latin America, where he is especially popular. The trip will also take him to neighboring Peru.\n“This is an otherwise remarkable pope who has obviously done a tremendous amount of good in the Catholic Church. But when it comes to the issue of child sexual abuse, he is as recalcitrant as any old-school bishop,” said Anne Barrett Doyle, co-director of Boston-based research group BishopAccountability.org.\nA database compiled by the group and published on its website Wednesday lists nearly 70 Chilean priests, deacons, religious bothers and a nun who have been accused of molesting children, including some that remain in active ministry.\nWhile other groups are likely to protest during the Pope’s trip, particularly indigenous Mapuche in central Chile who criticize the church for visiting ancestral lands they say were confiscated, the Osorno critique and the focus on sexual abuse is lobbied directly at Francis.\nIn 2015, the Pope inflamed tensions and shocked even his many admirers, when he told a group of tourists at St. Peter’s Square in Vatican City that the community of Osorno “suffered for being dumb.” He said the accusations against Barros had been cooked up by leftists.\nFILE PHOTO: Bishop Juan Barros (C) attends his first religious service as citizens (back R) protest against him at the Osorno cathedral, south of Santiago, Chile March 21, 2015. REUTERS/Carlos Gutierrez/File Photo ‘BETRAYED BY THE CHURCH’\nThe accused priest, Father Fernando Karadima, has denied allegations of abuse and the bishop said he was unaware of any wrongdoing.\nA 2011 Vatican investigation found Karadima guilty of abusing teenage boys over many years and ordered him to retire to a “life of prayer and penitence.”\nSlideshow (2 Images) Barros has long drawn suspicions from many Chileans because of his close links with Karadima. Both were members of a priestly society in Santiago and Karadima served as Barros’ mentor during the bishop’s youth.\nAt least one of Karadima’s alleged victims has said that Barros was present during the sexual abuse.\nClaret said Barros, who continues to serve as Bishop in Osorno, surrounded by volcanoes and lakes in a remote region of northern Patagonia, has divided the community and made healing for abuse victims impossible.\n“Within our group, there are victims of sexual abuse. They feel betrayed by the Church,” Claret said.\nClaret said that his group had sold empanadas, a traditional Chilean pastry, since August to help pay for as many as 30 parishioners to go to the Santiago protests.\nFor Doyle, who plans to attend the demonstrations, the Chile situation is unique in the context of the global sexual abuse crisis that enveloped the Church for nearly two decades.\n“I have never seen a reaction as powerful and anguished as the people of Osorno against this bishop,” she said.\nAdditional reporting by Antonio De la Jara; Editing by Caroline Stauffer, Philip Pullella and Andrew Hay\n ", "external_links": [], "published": "2018-01-10T20:13:00.000+02:00", "crawled": "2018-01-10T20:32:15.002+02:00", "highlightTitle": ""}