{"organizations": [], "uuid": "430119a3e53fe8219cd119b97ff800b13f52be27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/britain-stocks/update-1-britains-ftse-dips-as-pound-gain-weighs-on-exporters-idUSL8N1PK6C8", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Britain's FTSE dips as pound gain weighs on exporters", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T19:01:00.000+02:00", "replies_count": 0, "uuid": "430119a3e53fe8219cd119b97ff800b13f52be27"}, "author": "", "url": "https://www.reuters.com/article/britain-stocks/update-1-britains-ftse-dips-as-pound-gain-weighs-on-exporters-idUSL8N1PK6C8", "ord_in_thread": 0, "title": "UPDATE 1-Britain's FTSE dips as pound gain weighs on exporters", "locations": [], "entities": {"persons": [{"name": "kit rees", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "rolls-royce", "sentiment": "none"}, {"name": "british american tobacco", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "diageo", "sentiment": "none"}, {"name": "smith & nephew", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 5:02 PM / Updated 44 minutes ago UPDATE 1-Britain's FTSE dips as pound gain weighs on exporters Reuters Staff \n* FTSE falls 0.4 pct as sterling rally continues \n* Upgrades boost Smith & Nephew, Next \n* Forex curbs Diageo sales growth (Shows FTSE fell on the day, adds closing prices, comment) \nBy Kit Rees \nLONDON, Jan 25 (Reuters) - The UK’s top share index fell for a third straight day as a deepening global sell-off in the dollar strengthened sterling and dented earnings prospects for British companies exposed to the U.S. currency. \nThe blue chip FTSE 100 index closed down 0.4 percent at 7,612.61 points on Thursday, with the pound on track for its best month against the dollar in almost nine years and at its highest since the June 2016 Brexit referendum. \nDrinks maker Diageo dipped 0.2 percent after saying it expected foreign exchange swings to take a bigger than expected bite out of sales and profits. \nAmong other big dollar earners, aerospace company Rolls-Royce fell 2.3 percent and British American Tobacco fell 2.1 percent. \n“A good marker is if we hold above 1.40 in cable, then that could be the line in the sand between more durable strength and something that’s going to be consistently an issue for the big multinationals listed in the UK who have lots of foreign earnings,” said Jasper Lawler, head of research at London Capital Group, referring to the sterling/dollar exchange rate. \nWith nearly a quarter of the FTSE 100 made up of energy and mining companies, some see rising commodity prices attenuating the impact of sterling’s rally. \n“The current strength in the commodity complex might actually drive the FTSE 100 to overcome the traditional negative correlation between UK large caps and cable (GBP/USD), in our view,” said Edmund Shing, head of equity derivatives strategy at BNP Paribas. \nChanges in broker ratings were the main driver behind individual moves on the FTSE, as analysts mulled over recent company updates. \nMedical technology firm Smith & Nephew was the biggest gainer, up 4.1 percent after JPMorgan raised its view on the stock to “overweight” from “neutral”. \nJPMorgan analysts said a pull-back in the firm’s shares offered a compelling entry point, highlighting forex and tax rates as two important tailwinds for Smith & Nephew. \nShares in retailer Next also advanced, up 3.1 percent after RBC raised its rating on the stock to “outperform” from “sector perform”, citing an improved sales outlook and recent sterling strength versus the dollar. \nSoftware firm Sage Group declined a further 2.3 percent following Wednesday’s disappointing figures for revenue growth in the first quarter. \nEarnings were front and centre of the action among British mid caps, which declined 0.3 percent. \nKier Group jumped 15 percent following an upbeat trading statement, while UK lender Close Brothers rose 8.1 percent after saying it expected to see a rise in first-half profit. \nMeanwhile Renishaw dropped 15 percent after giving a half-year update. Reporting by Kit Rees; Editing by Alison Williams", "external_links": [], "published": "2018-01-25T19:01:00.000+02:00", "crawled": "2018-01-25T19:34:12.000+02:00", "highlightTitle": ""}