{"organizations": [], "uuid": "ffc061b53153981343aa931fefe9a1676750e40f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225230090&w=1200&r=LYNXMPEE0O1GJ", "site_section": "http://feeds.reuters.com/reuters/healthNews\r", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-zika-birthdefects/more-birth-defects-seen-in-u-s-areas-where-zika-was-present-idUSKBN1FE2PC", "country": "US", "domain_rank": 408, "title": "More birth defects seen in U.S. areas where Zika was present", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T20:17:00.000+02:00", "replies_count": 0, "uuid": "ffc061b53153981343aa931fefe9a1676750e40f"}, "author": "", "url": "https://www.reuters.com/article/us-health-zika-birthdefects/more-birth-defects-seen-in-u-s-areas-where-zika-was-present-idUSKBN1FE2PC", "ord_in_thread": 0, "title": "More birth defects seen in U.S. areas where Zika was present", "locations": [], "entities": {"persons": [{"name": "zika", "sentiment": "negative"}, {"name": "julie steenhuysen", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "americas", "sentiment": "none"}, {"name": "puerto rico", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "u.s. centers for disease control and prevention", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO (Reuters) - The mosquito-born Zika virus may be responsible for an increase in birth defects in U.S. states and territories even in women who had no lab evidence of Zika exposure during pregnancy, U.S. health officials said on Thursday.\nAreas in which the mosquito-borne virus has been circulating, including Puerto Rico, southern Florida and part of south Texas, saw a 21 percent rise in birth defects strongly linked with Zika in the last half of 2016 compared with the first half of that year, the U.S. Centers for Disease Control and Prevention said in its weekly report on death and disease.\nResearchers said it was not clear if the increase was due to local transmission of Zika alone or if there were other contributing factors.\nThe Zika outbreak was first detected in Brazil in 2015 and spread through the Americas. It has been linked to thousands of suspected cases of microcephaly, a rare birth defect marked by unusually small head size, eye abnormalities and nerve damage resulting in joint problems and deafness.\nFor the report, the CDC examined existing birth defect reporting systems in 14 U.S. states and Puerto Rico to look for birth defects possibly associated with Zika.\nThey divided these areas into three groups: places with local Zika transmission, places with higher levels of travel-associated Zika, and places with lower rates of travel-related Zika.\nOverall, they found three cases of birth defects potentially related to Zika per 1,000 live births out of 1 million births in 2016, about the same as the prior reporting period in 2013-2014.\nWhen they looked specifically in areas with local Zika transmission and looked only at birth defects most strongly linked with Zika, they saw an increase.\n“We saw this significant 21 percent increase in the birth defects most strongly linked to Zika in parts of the U.S. that had local transmission of Zika,” Peggy Honein, an epidemiologist and chief of the CDC’s Birth Defects Branch, said in a telephone interview. “The only area where we saw this increase was in the jurisdictions that had local transmission.”\nCDC researchers anticipate another increase in possible Zika-related birth defects when 2017 data are analyzed because many pregnant women exposed to Zika in late 2016 gave birth in 2017.\nReporting by Julie Steenhuysen; Editing by Alistair Bell\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-25T20:17:00.000+02:00", "crawled": "2018-01-25T20:34:06.005+02:00", "highlightTitle": ""}