{"organizations": [], "uuid": "cd8735fdc5909a0ec17f00a03cff96e0bf7e903f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-equipment-leasing-and-finance-association-announces-top-10-equipment-acquisition-trends-for-2018.html", "country": "US", "domain_rank": 767, "title": "Equipment Leasing and Finance Association Announces Top 10 Equipment Acquisition Trends for 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T16:00:00.000+02:00", "replies_count": 0, "uuid": "cd8735fdc5909a0ec17f00a03cff96e0bf7e903f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-equipment-leasing-and-finance-association-announces-top-10-equipment-acquisition-trends-for-2018.html", "ord_in_thread": 0, "title": "Equipment Leasing and Finance Association Announces Top 10 Equipment Acquisition Trends for 2018", "locations": [], "entities": {"persons": [{"name": "ralph petta", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "equipment leasing and finance association announces top", "sentiment": "negative"}, {"name": "equipment acquisition trends", "sentiment": "negative"}, {"name": "elfa", "sentiment": "none"}, {"name": "equipment leasing and finance association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Economic Upturn, Elevated Business Confidence and Tax Reform To Support Strong Investment\nWASHINGTON--(BUSINESS WIRE)-- The Equipment Leasing and Finance Association (ELFA) which represents the $1 trillion equipment finance sector, today revealed its Top 10 Equipment Acquisition Trends for 2018 . Given U.S. businesses, nonprofits and government agencies will spend over $1.6 trillion in capital goods or fixed business investment (including software) this year, financing a majority of those assets, these trends impact a significant portion of the U.S. economy. In 2018, businesses are expected to make their largest capital investments since 2012.\nELFA President and CEO Ralph Petta said, “Equipment acquisition is a key driver of supply chains across all U.S. manufacturing and service sectors. Equipment leasing and financing provide the source of funding for a majority of U.S. businesses—8 out of 10—to acquire the productive assets they need to operate and grow. We are pleased to again provide the Top 10 Equipment Acquisition Trends in order to assist businesses in understanding the market environment and planning their acquisition strategies.”\nELFA distilled recent research data, including the Equipment Leasing & Finance Foundation’s 2018 Equipment Leasing & Finance U.S. Economic Outlook, industry participants’ expertise, and member input from ELFA meetings and conferences in compiling the trends.\nELFA forecasts the following Top 10 Equipment Acquisition Trends for 2018:\nCapital spending will have its strongest performance in six years. Following a significant improvement in equipment and software investment in 2017 over 2016, investment will continue robust growth in 2018. Elevated business confidence, fewer regulations and a broad-based cyclical upturn in the U.S. economy, due in part to the strongest global economy in over a decade, will contribute to a healthy business investment trend before potentially waning toward year end. Look for strengthening positive momentum in financed equipment acquisitions. Although the growth of financed equipment acquisitions last year did not exceed overall equipment and software investment growth, equipment finance industry indicators point to increased financing of equipment acquisitions in 2018. The few persisting industry headwinds should be outweighed by a historically high propensity to finance and a healthy equipment and software investment forecast of 9.1 percent. Tax reform will help unleash pent-up demand by businesses for new equipment. Long awaited corporate tax cuts will have businesses pulling the trigger on the equipment acquisitions they had been putting off. Multiple measures of business confidence, including the Monthly Confidence Index for the Equipment Finance Industry, back the probability for increased equipment spending. Higher interest rates will loom as the economy grows and tax reform is enacted. A rising interest rate environment won’t deter investment in most key equipment verticals, but businesses will keep informed on Fed rate hikes. With the improving economy and its accompanying rise in inflation along with a substantial increase in the national debt owing to the new tax legislation, count on three and possibly four rate increases in 2018. Technological advances in equipment will attract businesses looking to improve efficiencies. New technology will be even more irresistible as businesses look for ways to increase efficiencies and profitability as they take advantage of new market opportunities in the growing economy. Attractive financing options will make the latest equipment that may have been considered previously unaffordable even more accessible. Key equipment verticals will continue to rebound in 2018. With economic growth drivers, including persistent business optimism, stable credit conditions and healthy global demand, the solid investment growth pattern from 2017 will continue for most equipment verticals. Investment is expected to remain steady or strengthen in equipment verticals, including agriculture, aircraft, construction, industrial, trucks, computers and software. Businesses will ramp up efforts to fulfill requirements of new accounting rules for their leased equipment. With the new lease accounting standard taking effect beginning in 2019, businesses with leases on the books will be focusing on compliance in earnest this year. In response, they will find that equipment finance providers are developing strategies and products that are beneficial to lessees under the new framework. Financing options and services for equipment acquisitions will be more innovative and customer driven. A changing business landscape and disruptive technologies will drive equipment finance companies to meet their customers’ unique demands. Expect more tailored financial solutions to help companies innovate and solve business challenges, such as metered usage that enables customers to pay only for what they consume. Wider use of electronic documents and e-signatures for greater convenience will become increasingly available. Trade issues will pose headwinds affecting global demand for U.S. business exports. Businesses seeking equipment to produce export goods will be closely watching potential impacts on foreign trade. A gradual strengthening in the dollar since 2017, if maintained, could be a headwind to trade exports. Tensions could also escalate as U.S. trade negotiations on NAFTA proceed and the Trump administration continues to take a hardline stance on trade relations with China. External “wild cards” will factor into equipment acquisition decisions. Despite a more favorable environment for equipment spending this year than in previous ones, businesses will have to monitor ongoing issues throughout 2018. Tax reform aside, concern about partisan politics in Washington may affect the confidence of the business community over time. The residential housing market may not get a hoped-for recovery in light of the Fed’s planned interest rate increases and home prices rising faster than buyers’ incomes. Major curbs on immigration could be a headwind to growth through labor and skills shortages in several industries, including agriculture, construction and hospitality. Finally, U.S. mid-term election results in November could impact future federal legislation affecting businesses.\nFor a video and an infographic highlighting the Top 10 Equipment Acquisition Trends for 2018, go to www.EquipmentFinanceAdvantage.org/rsrcs/articles/10trends.cfm .\nMore Information\nELFA has an informational website for businesses that want to learn more about how they can incorporate equipment financing into their business strategies. For resources about equipment financing, including a digital toolkit, videos and infographics, go to www.EquipmentFinanceAdvantage.org .\nFor forecast data regarding equipment investment and capital spending in the United States, see the Equipment Leasing & Finance Foundation’s 2018 Equipment Leasing & Finance U.S. Economic Outlook at https://www.leasefoundation.org/industry-resources/u-s-economic-outlook/ .\nAbout ELFA\nThe Equipment Leasing and Finance Association (ELFA) is the trade association that represents companies in the $1 trillion equipment finance sector, which includes financial services companies and manufacturers engaged in financing capital goods. ELFA members are the driving force behind the growth in the commercial equipment finance market and contribute to capital formation in the U.S. and abroad. Its 575 members include independent and captive leasing and finance companies, banks, financial services corporations, broker/packagers and investment banks, as well as manufacturers and service providers. For more information, please visit www.elfaonline.org .\nFollow ELFA:\nTwitter: @ELFAonline\nLinkedIn: www.linkedin.com/groups?gid=89692\nFacebook: https://www.facebook.com/ELFApage\nELFA is the premier source for statistics and analyses concerning the equipment finance sector. Please visit www.elfaonline.org/Data/ for additional information.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123005354/en/\nELFA\nAmy Vogt, Vice President, Communications and Marketing\n202-238-3438\navogt@elfaonline.org\nSource: Equipment Leasing and Finance Association (ELFA)", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.elfaonline.org%2FData%2F&esheet=51747206&newsitemid=20180123005354&lan=en-US&anchor=www.elfaonline.org%2FData%2F&index=10&md5=97efa254b2184b7a9aaedd540a8b75c6", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.EquipmentFinanceAdvantage.org%2Frsrcs%2Farticles%2F10trends.cfm&esheet=51747206&newsitemid=20180123005354&lan=en-US&anchor=www.EquipmentFinanceAdvantage.org%2Frsrcs%2Farticles%2F10trends.cfm&index=4&md5=bf5db0a62c7a04fcb6b0693a39f66478", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.leasefoundation.org%2Findustry-resources%2Fu-s-economic-outlook%2F&esheet=51747206&newsitemid=20180123005354&lan=en-US&anchor=https%3A%2F%2Fwww.leasefoundation.org%2Findustry-resources%2Fu-s-economic-outlook%2F&index=6&md5=d680485767960567aec359ba87b43343", "https://www.facebook.com/ELFApage", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.facebook.com%2FELFApage&esheet=51747206&newsitemid=20180123005354&lan=en-US&anchor=https%3A%2F%2Fwww.facebook.com%2FELFApage&index=9&md5=7a9d6b2662a7956a432210ec5cf5709c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.linkedin.com%2Fgroups%3Fgid%3D89692&esheet=51747206&newsitemid=20180123005354&lan=en-US&anchor=www.linkedin.com%2Fgroups%3Fgid%3D89692&index=8&md5=83acf5c567503c26004ceee7d5cc495d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.elfaonline.org&esheet=51747206&newsitemid=20180123005354&lan=en-US&anchor=www.elfaonline.org&index=7&md5=45cd8bac50617d2d2702a67dbbf339f1", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.EquipmentFinanceAdvantage.org&esheet=51747206&newsitemid=20180123005354&lan=en-US&anchor=www.EquipmentFinanceAdvantage.org&index=5&md5=39c677ef8aabb9d431020017fabcd8e8", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.elfaonline.org%2Fabout%2Fstaff-contact-info%2Fview-executive-staff-bios&esheet=51747206&newsitemid=20180123005354&lan=en-US&anchor=ELFA+President+and+CEO+Ralph+Petta&index=3&md5=84bce8c722c9139308658d18f2978a1c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.elfaonline.org%2F&esheet=51747206&newsitemid=20180123005354&lan=en-US&anchor=Equipment+Leasing+and+Finance+Association&index=1&md5=b07bae5e7b718b35ae56a0c47087f038", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fequipmentfinanceadvantage.org%2Frsrcs%2Farticles%2F10trends.cfm&esheet=51747206&newsitemid=20180123005354&lan=en-US&anchor=Top+10+Equipment+Acquisition+Trends+for+2018&index=2&md5=5c0b5120394e8666fdda44d2be83fbca", "http://www.businesswire.com/news/home/20180123005354/en/", "https://www.leasefoundation.org/industry-resources/u-s-economic-outlook/"], "published": "2018-01-23T16:00:00.000+02:00", "crawled": "2018-01-23T18:43:49.012+02:00", "highlightTitle": ""}