{"organizations": [], "uuid": "f11aa3872d942190889c0ff5fd5fb97a9315eeef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220672599&w=1200&r=LYNXMPEE081P9", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-football-nfl-nep/focused-patriots-ignore-the-noise-ahead-of-titans-clash-idUSKBN1EY2TU", "country": "US", "domain_rank": 408, "title": "Focused Patriots 'ignore the noise' ahead of Titans clash", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T01:50:00.000+02:00", "replies_count": 0, "uuid": "f11aa3872d942190889c0ff5fd5fb97a9315eeef"}, "author": "", "url": "https://www.reuters.com/article/us-football-nfl-nep/focused-patriots-ignore-the-noise-ahead-of-titans-clash-idUSKBN1EY2TU", "ord_in_thread": 0, "title": "Focused Patriots 'ignore the noise' ahead of Titans clash", "locations": [], "entities": {"persons": [{"name": "tita", "sentiment": "negative"}, {"name": "brady", "sentiment": "none"}, {"name": "belichick", "sentiment": "none"}, {"name": "bill belichick", "sentiment": "none"}, {"name": "rob gronkowski", "sentiment": "none"}, {"name": "tom brady", "sentiment": "none"}, {"name": "frank pingue", "sentiment": "none"}, {"name": "robert kraft", "sentiment": "none"}, {"name": "kraft", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 11:52 PM / Updated 13 hours ago Focused Patriots 'ignore the noise' ahead of Titans clash Frank Pingue 3 Min Read \n(Reuters) - The New England Patriots are no stranger to controversy and on Tuesday the players said they would not let a reports of internal turmoil within the organization distract them from their quest to repeat as Super Bowl champions. \nA report last week said there was a rift between Patriots quarterback Tom Brady, coach Bill Belichick and owner Robert Kraft but tight end Rob Gronkowski said he and team mates were not losing any sleep over it ahead of their playoff opener on Saturday. \n“The reputation that coach tries to get us to have is just ignore the noise. Ignore the noise from the outside and I feel like that’s what myself, a lot of other players have been doing,” tight end Rob Gronkowski told reporters. \n“You’ve just got to keep ignoring the noise and just keep our focus on what we’ve been doing all year and that’s preparing hard, studying our opponent, getting ready mentally and physically for the big game.” \nBrady, Belichick and Kraft later issued a joint statement flatly denying the ESPN report. \nThe Patriots, who last year won their second Super Bowl title in three seasons, had a first-round bye after finishing atop the AFC and will host the Tennessee Titans on Saturday in the divisional round of the playoffs. \n“The intensity has been high every single week all year long,” said Gronkowski. “You’ve just got to keep on continuing that, keep on preparing how we have been and get ready for the big game.” Dec 31, 2017; Foxborough, MA, USA; New England Patriots head coach Bill Belichick talks with umpire Butch Hannah (40) during the second quarter at Gillette Stadium. Mandatory Credit: Winslow Townson-USA TODAY Sports \nFew NFL teams have faced controversy over recent years to the extent of the Patriots, and none have enjoyed their level of success. \nJust last season, the Patriots overcame the NFL’s four-game suspension of Brady stemming from a plot to deflate footballs used in the AFC title game two years prior. \nIn 2015, they blocked out the noise over ‘Deflategate’ to beat the Seattle Seahawks in the Super Bowl. \nIn 2013 they dealt with the arrest and subsequent murder conviction of tight end Aaron Hernandez. \nSix years before that, Belichick was fined $500,000 and the Patriots lost a first-round draft pick after an investigation found New England had videotaped an opponent’s signals on the sidelines in what became known as ‘Spygate.’ \nBeyond all that, they have navigated through the mundane ups-and-downs of injuries and bad calls, reaching 11 AFC title games in the Brady-Belichick era practicing the Patriot Way of stressing personal accountability and a business-like approach. \nDefensive back Devin McCourty, who has been a team captain since 2011, said the Patriots were not going to be motivated by the report but were fuelled by a desire to claim the franchise’s sixth Super Bowl title. \n“I mean, I don’t care about it and I think a lot of guys don’t really care about what goes on outside and who writes what and if we suck, if we’re great – it doesn’t matter,” said McCourty. “So, I just think guys are motivated by playing for each other, their families more than an ESPN article.” Reporting by Frank Pingue in Toronto", "external_links": [], "published": "2018-01-10T01:50:00.000+02:00", "crawled": "2018-01-10T02:05:24.012+02:00", "highlightTitle": ""}