{"organizations": [], "uuid": "85dbba8162ec9630b7240186f656febf7e5960bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-crown-baus-capital-otc-cbca-acquires-military-grade-cryptographic-secure-online-communications-system-cannabis-science-otc.html", "country": "US", "domain_rank": 767, "title": "Crown Baus Capital (OTC: CBCA) Acquires Military Grade CryptoGraphic Secure Online Communications System; Cannabis Science (OTC: CBIS) Measures Asset Backed Blockchain CryptoCurrency Usage with CryptoGraphic Systems Integration", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-16T17:57:00.000+02:00", "replies_count": 0, "uuid": "85dbba8162ec9630b7240186f656febf7e5960bd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-crown-baus-capital-otc-cbca-acquires-military-grade-cryptographic-secure-online-communications-system-cannabis-science-otc.html", "ord_in_thread": 0, "title": "Crown Baus Capital (OTC: CBCA) Acquires Military Grade CryptoGraphic Secure Online Communications System; Cannabis Science (OTC: CBIS) Measures Asset Backed Blockchain CryptoCurrency Usage with CryptoGraphic Systems Integration", "locations": [], "entities": {"persons": [], "locations": [{"name": "ca", "sentiment": "none"}], "organizations": [{"name": "cbis", "sentiment": "neutral"}, {"name": "baus capital, inc.", "sentiment": "neutral"}, {"name": "cbca", "sentiment": "none"}, {"name": "financial services", "sentiment": "none"}, {"name": "education", "sentiment": "none"}, {"name": "cbis security team", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEVERLY HILLS, CA, Jan. 16, 2018 (GLOBE NEWSWIRE) -- Crown Baus Capital, Inc., (OTC: CBCA) a global acquisition-based conglomerate targeting five primary industries: High-Tech Incubation, Drug Development, Entertainment & Media, Education, and Financial Services is pleased to announce it has acquired a military grade CryptoGraphic secure Online Communications System, Cannabis Science (OTC: CBIS) measures blockchain CryptoCurrency usage with asset backed, CryptoGraphic systems and general public multiple application usage. The CBIS Security Team (CBISST) will be integrating the CBCA CrytopGraphics system between the two companies adding a unique concept for security and privacy issues to the new and burgeoning blockchain CryptoCurrency industry.\nThis marks the release of the first CryptoGraphic messenger mobile application of its kind. The secure message system introduces “Ghost Chat,” which is a new way to privately communicate with friends, family, and business associates. When you walk into the grocery store and buy some groceries, you don’t need to fill out an application form and submit your ID to pay with cash: you just pay and go. This type of CryptoGraphic interface allows the same type of transaction, only difference is; it’s all done online.\nThe Crown Baus CryptoGraphics systems offers many special and unique features to protect a user’s identity while communicating designed for sending data back and forth over the internet and other “secure” communications ports. For example, with the selection of a built-in countermeasures such as “Self-Destruct” which automatically destroys a message once it’s opened, is a simple example of government or military levels of classified communication protection.\nThis type of CryptoGraphic transaction with connected integration will set a new standard for security and privacy. In today's world privacy and security are hard to come by; this will ease the fears of people tapping in confidential information for all.\nThe CryptoGraphic secure message system takes a different approach. It starts off by eliminating the registration process altogether and assigns every user a unique four-digit ID. This feature, entitled “Ghost Chat,” allows users to chat with one another without sharing their private mobile phone number or personal data. Completely anonymous chats can begin in two clicks, simply by adding the user ID. Once a user logs out the ID is wiped clean and a new ID is assigned on the next use. This secure communication is Ideal for Government and Military usage: Cryptographic Security includes designing and using technically sound cryptosystems. Cryptographic systems are used to protect classified and sensitive data transfers between all Government and Military Agencies.\nThese systems range from highly classified Type 1 Military rated systems to sensitive but unclassified (SBU) commercial off the shelf (COTS) systems. The app’s Self-Destruct: A government or military grade level of communication protection because of the wide-ranging nature of the threats to communication systems. No matter the classification the basic measures for protecting communication from comprise is specifically designed into the app, even to protect communication threats to national security. The secure message system also protects the user’s data by converting text data into binary jpeg files, which adds an additional layer of security to chat stream.\nChat apps have become extremely popular as users use them daily with friends and family from all over the world. While many are using giant text-messaging apps such as WhatsApp, WeChat, Facebook Messenger, and Line, there are growing concerns over the current trending privacy matters worldwide. This sparked several new privacy text-message apps like Wickr, Signal and Telegram to hit the market.\nAbout Crown Baus Capital Corp.\nCrown Baus Capital Corp. is a global acquisition-based conglomerate targeting five primary industries: High-Tech Incubation, Drug Development, Entertainment & Media, Education, and Financial Services. The Company specializes in the vertical integration of industrial, commercial, and retail profit centers, along with partnerships and start-ups, to create synergistic savings and increased value to our shareholders.\nForward-Looking Statements\nThis Press Release includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Act of 1934. A statement containing words such as \"anticipate,\" \"seek,\" intend,\" \"believe,\" \"estimate,\" \"expect,\" \"project,\" \"plan,\" or similar phrases may be deemed \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Some or all of the events or results anticipated by these forward-looking statements may not occur. Factors that could cause or contribute to such differences include the future U.S. and global economies, the impact of competition. Crown Baus Capital Corporation does not undertake any duty nor does it intend to update the results of these forward-looking statements. Safe Harbor Statement. The Private Securities Litigation Reform Act of 1995 provides a 'safe harbor' for forward looking statements. Certain of the statements contained herein, which are not historical facts are forward looking statements with respect to events, the occurrence of which involved risks and uncertainties.\nThese forward-looking statements may be impacted, either positively or negatively, by various factors. Information concerning potential factors that could affect the company is detailed from time to time in the company's reports filed with the Securities and Exchange Commission.\nCrown Baus Capital Corp. Raymond C. Dabney President & CEO, Co-Founder T: +1 (888) 263-0948 info@crownbaus.com\nSource:Crown Baus Capital Corp.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/97d1d50e-8d4b-4e60-9ba9-3d144bdf54c6"], "published": "2018-01-16T17:57:00.000+02:00", "crawled": "2018-01-16T18:35:06.010+02:00", "highlightTitle": ""}