{"organizations": [], "uuid": "be5817d63bbc48c2696f5c0f9009f0e6993af4ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/cnbc-interview-with-phosagro-ceo-andrey-guryev-from-the-world-economic-forum-2018.html", "country": "US", "domain_rank": 767, "title": "CNBC Interview with Phosagro CEO, Andrey Guryev from the World Economic Forum 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T08:00:00.000+02:00", "replies_count": 0, "uuid": "be5817d63bbc48c2696f5c0f9009f0e6993af4ff"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/cnbc-interview-with-phosagro-ceo-andrey-guryev-from-the-world-economic-forum-2018.html", "ord_in_thread": 0, "title": "CNBC Interview with Phosagro CEO, Andrey Guryev from the World Economic Forum 2018", "locations": [], "entities": {"persons": [{"name": "andrey guryev", "sentiment": "negative"}, {"name": "steve sedgw", "sentiment": "negative"}, {"name": "geoff cutmore", "sentiment": "none"}, {"name": "phosagro", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "phosagro", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "cnbc interview", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}, {"name": "moody", "sentiment": "none"}, {"name": "ag", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Following are excerpts from a CNBC interview with Phosagro CEO, Andrey Guryev and CNBC's Steve Sedgwick and Geoff Cutmore from the World Economic Forum 2018.\nGC: Welcome back, everybody, a bit of news on the ratings front this hour. Moody's has upgraded Russia's rating to positive from stable, this is the outlook. The credit ratings agency said the outlook was partly driven by increasing institutional strength, and that it expects recent macro gains in Russia to be sustained over the longer term, which will be great news for Andrey Guryev who joins us, the CEO of Phosagro, because you recently sold a bit of debt in to the market-,\nAG: Yes.\nGC: So, anything that makes Russia, and Russian paper look better, is good for you, I guess.\nAG: Yes, sure. We-, last week, we made a Eurobond issue for 500 million, with a record flow coupon rate, not only for my company, Phosagro, but for Russians, is less than 4%, particularly 3.949%, which I think is absolute record. More than 40% of demand was from the United States, the rest was Europe, about 7% only from Russia. So, basically, more than 100 different investors, funds, good paper, five times oversubscribed. So, basically, it means that it's a huge demand for Russian good corporates debt.\nGC: Which is great, because you can now relax over any funding issues-,\nAG: Yes.\nGC: You may have had for this year. In terms of the underlying business, how are things turning out? I looked at the third quarter net, and that was down 41% year on year. How do you think you're going to do through this year?\nAG: I think we started this year on a very good-, good terms, in terms of prices. Prices started to recover, the prices started to recover at the fourth quarter of 2017, so, basically, we also got the last months of 2017, a good start, a good first quarter in 2018, and basically, I believe that the prices this year may end up, like, you know, an average increase of about 20 or 25%, which is fantastic for the company, particularly if you take in to account that we are growing about 10% average volume-wise every year. Last year, we increased our production more than 12%, 12.5%. In 2018, I believe, like, we will have another 10. So, it's good numbers, it's moving in units of ten.\nGC: Yes, but I know-, we've talked many times, and you're quite a conservative businessman-,\nAG: Yes.\nGC: When it comes to expectations around the economy. Is there anything that you see at the moment, that just makes you a little bit nervous? Because, obviously, you're looking at a better outlook, with better pricing, but I know that you always keep a weathered eye on things that could destabilize that price improvement. What-, what could it be? Geopolitics, with the Americans, again? Or something else?\nAG: It's a very good question. I think I've never seen such a positive Davos. Over the last five years, and it's my fifth year on the Davos so far, and I ask everybody, 'Where do you see any possible destruction for the market in 2018?' Nobody can answer. Really. It's very interesting. So, it means that the economy is growing everywhere-,\nGC: Yes.\nAG: And, of course, there are black-swans, and they can appear any time, but-, and the fact that, I think, structurally everything, I think it's really good.\nGC: Yes. And you think things are going to calm down with the Russians? I saw the Deputy Prime Minster had said that he thought the American officials were hiding from Russian officials and businesspeople here in Davos-,\nAG: [Laughter].\nGC: Have you seen any American officials scurrying away from you, as you walk down the promenade?\nAG: I may be fortunate now, being a businessman, so I don't know so many American officials, but I know American businessmen here, and we have a lot of discussion on the business terms, business-wise, like, in terms of investment, global-, global growth.\nGC: Yes. So, things are normalizing-,\nAG: Yes.\nGC: That would be your read.\nAG: Yes. Yes, I would-, I would think so. I would say so.\nGC: Yes. Yes. Andrey, nice to see you-,\nAG: Thank you.\nGC: Well, we hope it works out well for you-,\nAG: Thank you.\nGC: For 2018, and we'll catch up with you soon again-,\nAG: Okay.\nGC: Andrey Guryev joining us, from Phosagro.\nENDS", "external_links": [], "published": "2018-01-26T08:00:00.000+02:00", "crawled": "2018-01-26T17:57:31.005+02:00", "highlightTitle": ""}