{"organizations": [], "uuid": "d57d23aba7e2f8dc04bb41b2f78a4c446591b637", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223859758&w=1200&r=LYNXMPEE0K0ES", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/volkswagen-emissions/audi-ordered-to-recall-127000-vehicles-over-emissions-paper-idINKBN1FA0J3", "country": "US", "domain_rank": 408, "title": "Audi ordered to recall 127,000 vehicles over emissions - paper", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T14:21:00.000+02:00", "replies_count": 0, "uuid": "d57d23aba7e2f8dc04bb41b2f78a4c446591b637"}, "author": "", "url": "https://in.reuters.com/article/volkswagen-emissions/audi-ordered-to-recall-127000-vehicles-over-emissions-paper-idINKBN1FA0J3", "ord_in_thread": 0, "title": "Audi ordered to recall 127,000 vehicles over emissions - paper", "locations": [], "entities": {"persons": [], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "audi", "sentiment": "negative"}, {"name": "volkswagen", "sentiment": "none"}, {"name": "bild am sonntag", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKFURT (Reuters) - Germany’s KBA automotive watchdog has detected illicit emission-control software in Audi’s latest Euro-6 diesel models and has ordered a recall of 127,000 vehicles, Bild am Sonntag reported.\nAudi, a unit of Volkswagen, said in a statement that the models had been included in a voluntary recall of 850,000 diesel vehicles with V6 and V8 TDI engines announced in July.\n“The engine control software for the vehicles in question will be completely revised, tested and submitted to the KBA for approval”, Audi said in its statement.\nIt did not confirm more details of KBA’s request.\nBild am Sonntag said road transport authority KBA had told Audi to respond by Feb. 2 on how it plans to update vehicle software controlling emissions, making sure the cars are unable to illegally manipulate emission controls.\nAudi said it has been examining its diesel-fuelled cars for potential irregularities for months in close cooperation with the KBA.\n“As part of this systematic and detailed assessment, the KBA has now also issued a notice regarding Audi models with V6 TDI engines,” the carmaker added.\nIn November, Audi announced a recall of 5,000 cars in Europe for a software fix after discovering they emitted too much nitrogen oxide, the polluting gas that parent Volkswagen concealed from U.S. regulators in its devastating 2015 “dieselgate” scandal.\nVolkswagen was found in 2015 to have illegally manipulated engine software so that vehicles would meet nitrogen oxide (NOx) emissions standards in laboratory testing but not in real-world conditions, where they could emit up to 40 times the permitted levels.\nSeveral Audi models were affected and Audi has been accused in media reports of having devised the so-called defeat devices years earlier but not to have installed them in its vehicles at that time. Audi and Volkswagen have never commented on the matter.\nReporting by Arno Schuetze; Editing by Susan Fenton\n ", "external_links": [], "published": "2018-01-21T14:21:00.000+02:00", "crawled": "2018-01-21T14:32:46.015+02:00", "highlightTitle": ""}