{"organizations": [], "uuid": "e066cd6048255acdc883f222ddecab43d24d9d8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-tennessee-abortion/u-s-appeals-court-upholds-tennessee-anti-abortion-vote-idUKKBN1EY2GV", "country": "US", "domain_rank": 408, "title": "U.S. appeals court upholds Tennessee anti-abortion vote", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T22:27:00.000+02:00", "replies_count": 0, "uuid": "e066cd6048255acdc883f222ddecab43d24d9d8b"}, "author": "", "url": "https://uk.reuters.com/article/us-tennessee-abortion/u-s-appeals-court-upholds-tennessee-anti-abortion-vote-idUKKBN1EY2GV", "ord_in_thread": 0, "title": "U.S. appeals court upholds Tennessee anti-abortion vote", "locations": [], "entities": {"persons": [{"name": "bill harbison", "sentiment": "none"}, {"name": "bill haslam", "sentiment": "none"}, {"name": "jonathan stempel", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}], "organizations": [{"name": "min read", "sentiment": "none"}, {"name": "6th u.s. circuit court of appeals", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 8:31 PM / Updated 31 minutes ago U.S. appeals court upholds Tennessee anti-abortion vote Jonathan Stempel 3 Min Read \n(Reuters) - A federal appeals court on Tuesday upheld the validity of a 2014 Tennessee ballot measure that removed the right to an abortion from the state constitution. \nBy a 3-0 vote, the 6th U.S. Circuit Court of Appeals rejected a challenge by eight voters to how the state counted ballots in the election, one of Tennessee’s costliest. The measure, known as Amendment 1, won 53 percent of the vote. \nThe decision by the Cincinnati-based appeals court overturned a April 2016 lower court ruling ordering a recount; that ruling had been put on hold pending the appeal. \nThe appeals ruling may encourage the adoption in Tennessee of tighter abortion restrictions, such as a 48-hour waiting period that Republican Governor Bill Haslam signed into law in 2015. \nRepublicans have big majorities in both houses of Tennessee’s legislature. \nBill Harbison, a lawyer for plaintiffs challenging the vote, did not immediately respond to requests for comment. \nCircuit Judge David McKeague said opponents of Amendment 1 failed to show how their due process and equal protection rights were harmed by Tennessee’s vote-counting practice, or that their votes were diluted relative to the votes of abortion opponents. \n“This is not the ‘exceptional case’ that warrants federal intervention in a lawful state election process,” McKeague wrote. \n“Although the subject of abortion rights will continue to be controversial in Tennessee and across our nation, it is time for uncertainty surrounding the people’s 2014 approval and ratification of Amendment 1 to be put to rest,” he added. \nThe office of Tennessee Republican Attorney General Herbert Slatery, which defended the vote count, did not immediately respond to requests for comment. \nMcKeague was appointed to the appeals court by President George W. Bush. The other panel members, Richard Suhrheinrich and Ronald Gilman, were appointed by Presidents George H.W. Bush and Bill Clinton, respectively. \nAmendment 1 said, “Nothing in this Constitution secures or protects a right to abortion or requires the funding of an abortion,” and said that authorized elected officials may “enact, amend, or repeal statutes regarding abortion.” \nIn ordering a recount, then-Chief Judge Kevin Sharp of the federal court in Nashville called Tennessee’s vote-counting practice “fundamentally unfair.” He also said it did not comply with a state constitutional provision that it take into account the number of votes cast for governor. \nThe case is George et al v Hargett et al, 6th U.S. Circuit Court of Appeals, No. 16-5563. Reporting by Jonathan Stempel in New York; Editing by Leslie Adler", "external_links": [], "published": "2018-01-09T22:27:00.000+02:00", "crawled": "2018-01-09T22:54:57.008+02:00", "highlightTitle": ""}