{"organizations": [], "uuid": "d40b65c545c66057295952c81568083703015e54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-puration-plans-corporate-name-change-in-conjunction-with-extraction-spinoff-and-dividend.html", "country": "US", "domain_rank": 767, "title": "Puration Plans Corporate Name Change in Conjunction With Extraction Spinoff and Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T16:00:00.000+02:00", "replies_count": 0, "uuid": "d40b65c545c66057295952c81568083703015e54"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-puration-plans-corporate-name-change-in-conjunction-with-extraction-spinoff-and-dividend.html", "ord_in_thread": 0, "title": "Puration Plans Corporate Name Change in Conjunction With Extraction Spinoff and Dividend", "locations": [], "entities": {"persons": [], "locations": [{"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "pura", "sentiment": "negative"}, {"name": "puration, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, January 11, 2018 /PRNewswire/ --\nPuration, Inc. (USOTC: PURA) today announced plans to change the company's name in conjunction with the spinoff and dividend strategy announced last week. Management is rapidly advancing on a strategy to unlock shareholder value by dividing its cannabis infused beverage business and patented cannabis extraction business into two separately traded public companies. The first step in the strategy is to structure Puration's extraction capacity into a new subsidiary. The next step will be to spinoff the cannabis extraction subsidiary in conjunction with a Regulation Crowdfunding transaction to capitalize the new independently listed company. The spinoff plan includes a dividend distribution of stock in the new independently listed company to shareholders of the parent company, Puration. Management plans to change the \"Puration,\" parent company name to reflect the cannabis infused beverage operations remaining in the parent company. Similarly, the subsidiary and spinoff company will be named to reflect the cannabis extraction operational focus.\nExtraction and Beverage Industry Experience\nPuration is the sole licensee to U.S. Patent No. 9,199,960, entitled \"METHOD AND APPARATUS FOR PROCESSING HERBACEOUS PLANT MATERIALS INCLUDING THE CANNABIS PLANT.\" The license permits Puration to produce cannabis extracts for infusion into recreational, fitness wellness, alternative medicine and beauty products. Management found the ideal first application of the extraction technology in the introduction of its own cannabis infused beverage. Last year, the company launched EVERx CBD Infused Sports Water which has since become a leading brand name in the CBD infused marketplace and one of the only CBD infused products in the sports nutrition marketplace. Puration recently announced plans to launch new cannabis infused beverage lines into Canada's legal $8 billion market in addition to announcing plans to open a cannabis extraction facility into California's legal $10 billion market.\nUnlocking Shareholder Value\nManagement expects the combination of two stocks, one representing the value of the cannabis infused beverage operation that remains in the parent company, and the other representing the value of patented extraction operation going into the spinoff, will together yield a greater return for shareholders than a single stock representing the integrated value of the two. Look for more updates on the spinoff and dividend plan coming soon. See the article below to learn more about the potential of spinoff's:\n3 Real-World Case Studies: How Spinoffs Unlock Shareholder Value\nFor more information on Puration visit www.aciconglomerated.com\nDisclaimer/Safe Harbor:\nThis news release contains forward-looking statements within the meaning of the Securities Litigation Reform Act. The statements reflect the Company's current views with respect to future events that involve risks and uncertainties. Among others, these risks include the expectation that any of the companies mentioned herein will achieve significant sales, the failure to meet schedule or performance requirements of the companies' contracts, the companies' liquidity position, the companies' ability to obtain new contracts, the emergence of competitors with greater financial resources and the impact of competitive pricing. In the light of these uncertainties, the forward-looking events referred to in this release might not occur. These statements have not been evaluated by the Food and Drug Administration. These products are not intended to diagnose, treat, cure, or prevent any disease.\nFor More Information Contact:\nBrian Shibley,\ninfo@aciconglomerated.com\n+1-800-861-1350\nSOURCE Puration, Inc.", "external_links": ["https://www.drinkeverx.com/", "https://seekingalpha.com/article/4066699-3-real-world-case-studies-spinoffs-unlock-shareholder-value"], "published": "2018-01-11T16:00:00.000+02:00", "crawled": "2018-01-11T19:35:16.026+02:00", "highlightTitle": ""}