{"organizations": [], "uuid": "ec7ae41b6f6c679e5814b43cf34ff4ac1714acdd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-corus-entertainment-announces-fiscal-2018-first-quarter-results.html", "country": "US", "domain_rank": 767, "title": "Corus Entertainment Announces Fiscal 2018 First Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-10T15:00:00.000+02:00", "replies_count": 0, "uuid": "ec7ae41b6f6c679e5814b43cf34ff4ac1714acdd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-corus-entertainment-announces-fiscal-2018-first-quarter-results.html", "ord_in_thread": 0, "title": "Corus Entertainment Announces Fiscal 2018 First Quarter Results", "locations": [], "entities": {"persons": [{"name": "doug murphy", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "corus entertainment", "sentiment": "negative"}, {"name": "corus entertainment inc.", "sentiment": "none"}, {"name": "consolidated", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Free cash flow (1) of $83.2 million for the quarter, up from $33.9 million last year Consolidated revenues decreased 2% for the quarter Consolidated segment profit (1) decreased 7% for the quarter Consolidated segment profit margin (1) of 39% for the quarter Net income attributable to shareholders of $77.7 million ($0.38 per share basic) for the quarter\nTORONTO, Jan. 10, 2018 /PRNewswire/ - Corus Entertainment Inc. (TSX: CJR.B) announced its first quarter financial results today.\n\"Our first quarter results were below expectations, as gains in local Radio advertising and our Nelvana content business combined with better than expected subscriber revenues were more than offset by weak television advertising market conditions\", said Doug Murphy, President and Chief Executive Officer. \"We remain committed to advancing our strategic priorities as Canada's only pure play media and content company. Our ongoing financial discipline balanced with strategic growth investments in content and advanced advertising initiatives position us well over the longer term in a rapidly evolving media and content marketplace.\"\nFinancial Highlights\nThree months ended\nNovember 30,\n(in thousands of Canadian dollars except per share amounts)\n2017\n2016\nRevenues\nTelevision\n415,464\n425,564\nRadio\n41,924\n42,417\n457,388\n467,981\nSegment profit (1)\nTelevision\n168,602\n184,421\nRadio\n13,521\n13,286\nCorporate\n(4,236)\n(5,721)\n177,887\n191,986\nNet income attributable to shareholders\n77,673\n71,146\nAdjusted net income attributable to shareholders (1) (2)\n78,885\n80,826\nBasic earnings per share\n$0.38\n$0.36\nAdjusted basic earnings per share (1) (2)\n$0.38\n$0.41\nDiluted earnings per share\n$0.38\n$0.36\nFree cash flow (1)\n83,215\n33,909\n(1)\nSegment profit, segment profit margin, adjusted net income attributable to shareholders, adjusted basic earnings per share, and free cash flow do not have standardized meanings prescribed by IFRS. The Company believes these non-IFRS measures are frequently used as key measures to evaluate performance. For definitions and explanations, see discussion under the Key Performance Indicators section of the First Quarter 2018 Report to Shareholders.\n(2)\nRefer to page 10 of this press release for details of adjustments to arrive at adjusted net income attributable to shareholders and adjusted basic earnings per share.\nConsolidated Results from Operations\nConsolidated revenues for the three months ended November 30, 2017 were $457.4 million, down 2% from $468.0 million last year and consolidated segment profit was $177.9 million, down 7% from $192.0 million last year. Net income attributable to shareholders for the quarter ended November 30, 2017 was $77.7 million ($0.38 per share basic and diluted), as compared to $71.1 million ($0.36 per share basic and diluted) last year. Net income attributable to shareholders for the first quarter of fiscal 2018 includes business acquisition, integration and restructuring costs of $1.6 million ($nil per share, net of income taxes). Adjusting for the impact of this item results in an adjusted net income attributable to shareholders of $78.9 million ($0.38 per share basic) in the quarter. Net income attributable to shareholders for the prior year quarter includes business acquisition, integration and restructuring costs of $13.2 million ($0.05 per share, net of income taxes). Adjusting for the impact of this item results in an adjusted net income attributable to shareholders of $80.8 million ($0.41 per share basic) for the prior year quarter.\nOperational Results - Highlights\nTelevision\nSegment revenues were down 2% in Q1 2018 Advertising revenues decreased 4% in Q1 2018 Subscriber revenues were flat in Q1 2018 Merchandising, distribution and other revenues increased 7% in Q1 2018 Segment profit (1) decreased 9% in Q1 2018 Segment profit margin (1) of 41% in Q1 2018 compared to 43% in the prior year\nRadio\nSegment revenues were relatively flat in Q1 2018 Advertising revenues were down 1% in Q1 2018 Segment profit (1) increased 2% in Q1 2018 Segment profit margin (1) of 32% in Q1 2018 compared to 31% the prior year\nCorporate\nFree cash flow (1) of $83.2 million for the year, up from $33.9 million in the prior year Net debt to segment profit (1) leverage at 3.5 times Consolidated segment profit margin in Q1 of 39%, down from 41% in the prior year\n(1)\nSegment profit, segment profit margin, and free cash flow do not have standardized meanings prescribed by IFRS. The Company reports on these because they are key measures used to evaluate performance. For definitions and explanations, see discussion under the Key Performance Indicators section of the 2018 Report to Shareholders.\nCorus Entertainment Inc. reports in Canadian dollars.\nThe unaudited consolidated financial statements and accompanying notes for the three months ended November 30, 2017 and Management's Discussion and Analysis are available on the Company's website at www.corusent.com in the Investor Relations section.\nA conference call with Corus senior management is scheduled for January 10, 2018 at 9:00 a.m. ET. While this call is directed at analysts and investors, members of the media are welcome to listen in. The dial-in number for the conference call for local and international callers is 1.416.981.9027 and for North America is 1.800.734.8582. More information can be found on the Corus Entertainment website at www.corusent.com in the Investor Relations section.\nUse of Non-IFRS Financial Measures\nThis press release includes the non-IFRS financial measures of adjusted net income, adjusted basic earnings per share and free cash flow that are not in accordance with, nor an alternate to, generally accepted accounting principles (\"IFRS\") and may be different from non-IFRS measures used by other companies. In addition, these non-IFRS measures are not based on any comprehensive set of accounting rules or principles.\nNon-IFRS financial measures should not be considered as a substitute for, or superior to, measures of financial performance prepared in accordance with IFRS. They are limited in value because they exclude charges that have a material effect on the Company's reported results and, therefore, should not be relied upon as the sole financial measures to evaluate the Company's financial results. The non-IFRS financial measures are meant to supplement, and to be viewed in conjunction with, IFRS financial results. A reconciliation of the Company's non-IFRS measures is included in the Company's most recent Report to Shareholders which is available on Corus' website at www.corusent.com as well as on SEDAR.\nCaution Concerning Forward-Looking Information\nThis press release contains forward-looking information and should be read subject to the following cautionary language:\nTo the extent any statements made in this report contain information that is not historical, these statements are forward-looking statements and may be forward-looking information within the meaning of applicable securities laws (collectively, \"forward-looking information\"). These forward-looking statements relate to, among other things, our objectives, goals, strategies, intentions, plans, estimates and outlook, including advertising, distribution, merchandise and subscription revenues, operating costs and tariff", "external_links": ["http://www.corusent.com/"], "published": "2018-01-10T15:00:00.000+02:00", "crawled": "2018-01-10T16:18:57.004+02:00", "highlightTitle": ""}