{"organizations": [], "uuid": "000e01843dc868db377854083e31ab2b19bcf2eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-forgerock-announces-key-executive-moves-delivers-successful-2017.html", "country": "US", "domain_rank": 767, "title": "ForgeRock Announces Key Executive Moves; Delivers Successful 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.018, "site_type": "news", "published": "2018-01-23T17:00:00.000+02:00", "replies_count": 0, "uuid": "000e01843dc868db377854083e31ab2b19bcf2eb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-forgerock-announces-key-executive-moves-delivers-successful-2017.html", "ord_in_thread": 0, "title": "ForgeRock Announces Key Executive Moves; Delivers Successful 2017", "locations": [], "entities": {"persons": [{"name": "mike ellis", "sentiment": "none"}, {"name": "john fernandez", "sentiment": "none"}, {"name": "selectio", "sentiment": "none"}, {"name": "hermann wimmer", "sentiment": "none"}, {"name": "forgerock", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "global operations", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO, Jan. 23, 2018 (GLOBE NEWSWIRE) -- ForgeRock®, the leading platform provider of digital identity management solutions, today announced several moves in its executive leadership team. Hermann Wimmer, ForgeRock’s current senior vice president for International business, has been named the company’s chief revenue officer. Meanwhile, Mike Ellis has decided to resign as chief executive officer after nearly six years at the helm. He will be replaced on an interim basis by John Fernandez, ForgeRock’s chief financial officer and executive vice president of Global Operations.\nA global leader in identity management, ForgeRock has hundreds of successful customers in every part of the world. The moves announced today build upon the strong momentum the company enjoyed in 2017:\nRevenue increased by nearly 50% in 2017, driven by strong enterprise demand. Customer satisfaction remains high as gross retention rates approach 95%. The successful completion of an $88 million Series D funding round to further accelerate the company’s ongoing global expansion and product innovation. Selection by the Open Banking Implementation Entity to provide a cloud-based Reference Bank Application, which will be used by leading banks and third parties to build their own applications in accordance with Open Banking standards. Key Q4 wins at a number of high profile brands, such as a global leader in transport and logistics and energy sectors, an international state-owned railway company, several financial services firms, and multiple leading automobile manufacturers. The addition of Dave DeWalt, cybersecurity executive, to the board of directors as vice chairman. Also added Arun Mathew, partner at Accel, and Dave Welsh, Head of TMT Growth Equity at KKR to ForgeRock’s board. Hired more than 200 new employees; completed the year with 535 employees.\nAfter leading ForgeRock through a period of transformational growth, chief executive officer Mike Ellis has decided to leave the company after nearly six years at the helm. Under Mike’s leadership, ForgeRock became a global leader in identity management with hundreds of successful customers in every part of the world, and a healthy balance sheet. The company is well positioned to capture the surging market for digital identity driven by global organizations’ requirements for enhanced customer engagement and internet of things (IoT).\nEllis said, “I’m incredibly proud of what the company has accomplished over the years, but I take the most satisfaction in working with the hard-working team of ForgeRockers who’ve helped us build the company to this point. Exciting times lie ahead but now is the time for me to step aside for someone to scale the company even higher to realize its full potential.”\nWimmer Promoted to Chief Revenue Officer\nHermann Wimmer joined ForgeRock early in 2017 and immediately retooled the international sales teams for long term success. Sales for ForgeRock in 2017 were especially strong in international business, and Wimmer was a driving force. As chief revenue officer, Wimmer will lead the company’s global sales force, drive go-to-market strategy, and expand strategic relationships. He will also work even closer with ForgeRock’s product teams to ensure the company is embracing customer requirements at every step in product delivery. Wimmer joined ForgeRock after holding various international roles at Teradata, most recently serving as co-president. He also held management roles at NCR, and the French technology company, Bull.\n“ForgeRock has an incredible opportunity to win the Customer Identity and Access Management (CIAM) market, with best-in-class products, industry-specific solutions, engaged and loyal customers, and great partners,” said Wimmer. “I am excited for this next phase for ForgeRock, and look forward to making our customers wildly successful.”\nForgeRock Extends Product Leadership in CIAM\nForgeRock’s innovation engine delivered major updates across its product portfolio. In December, ForgeRock achieved a major competitive milestone in being selected by the Open Banking Implementation Entity to provide a cloud-based Reference Bank Application, which will be used by leading banks and third parties to build their own applications in accordance with Open Banking standards. ForgeRock becomes a key enabler in making Open Banking a reality, driving the demonstration and testing of the Open Banking API ecosystem.\nForgeRock also delivered updates across its award-winning flagship offering – ForgeRock Identity Platform 5.5. The new release features a new Privacy and Profile Management Dashboard that enables ForgeRock customers to easily bring their online products and services into compliance with the forthcoming General Data Protection Regulation (GDPR). ForgeRock appeared as leaders in the Forrester Wave and KuppingerCole Leadership Compass for Customer IAM, and was recognized in the Gartner Access Management Magic Quadrant for its vision.\nThe new release also introduced new fine-grained authentication technology, giving organizations such as banks, retailers, and communication services providers granular control in continuously assessing and improving secure omnichannel experiences. The ForgeRock Platform also supports push authorization, enabling consumers to more securely and conveniently approve transactions and events, via mobile phone notifications.\nForgeRock also extended its Partner Trust Network to include Technology Partners, making it even easier for new and existing customers to seamlessly integrate complementary technologies to extend and derive the highest value from their ForgeRock Identity solutions.\nIdentity Live and UnSummit Events Rock on in 2018\nForgeRock is pleased to continue its highly popular Identity Live and technical UnSummit series, with events in 2018 planned for Austin, Texas; Berlin; Sydney; Singapore; London and Paris. Identity Live events bring together visionary analysts, executives, technical experts, thought leaders and other identity professionals to share their journeys of digital transformation. The more technically focused UnSummit events are one-day hands-on demos and product deep-dive sessions for identity relationship management practitioners. The 2017 series attracted more than 1,500 attendees. The 2018 dates can be found here .\nAbout ForgeRock\nForgeRock® is the Digital Identity Management company transforming the way organizations interact securely with customers, employees, devices, and things. Organizations adopt the ForgeRock Identity Platform™ as their digital identity system of record to monetize customer relationships, address stringent regulations for privacy and consent (GDPR, HIPAA, FCC privacy, etc.), and leverage the internet of things. ForgeRock serves hundreds of brands, including Morningstar, Vodafone, GEICO, TomTom, and Pearson, as well as governments such as Norway, New Zealand, and Belgium, among many others. Headquartered in San Francisco, California, ForgeRock has offices in Austin, London, Bristol, Grenoble, Munich, Paris, Oslo, Singapore, Sydney and Vancouver, Washington. ForgeRock is privately held, backed by leading global venture capital firms Accel Partners, Foundation Capital, Meritech Capital and KKR. For more information and free downloads, visit www.forgerock.com or follow ForgeRock on social media:\nFacebook ForgeRock |Twitter @ForgeRock |LinkedIn ForgeRock |\nDave De Jear\nForgeRock Communications\ndave.dejear@forgeRock.com\nSource:ForgeRock, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/9d8b6a4c-7a4f-412b-af5d-1996bd13180f", "https://www.globenewswire.com/Tracker?data=UhYLVbq8KuMroIvgOlsc87CdLCsbxAuUJTOZkIbEXz-TmzrHLv0mdLfqpFqC1QuCMH5ncKHkGJ997iAd9jD2LRU3QbgAOeSby_ZxGIyZmcw=", "https://www.globenewswire.com/Tracker?data=CRPFz9JNqJuWdfbByaicQU3N-vVqId_Tgxt9AY2nPFr4X0JvssDjDK4aenPnJ3TUfGgMRqmZOhYrTnSozxZZVw==", "https://www.globenewswire.com/Tracker?data=Fpj8p_HlrgrjqNW4WpQyWqCeyUD91at2jubjRx0Md9LgqsmdU63DuoY0f6sJHhgZLbbAODMg3pP_mNmua5NBzcu7Cbrh8xPqiQ2YCyTz_DHx1RGg8HqnK9R1EPhkG0zkG6ckKzL5F0xJdp1K4aFuF5TPRCOkrkJk5kmmqAKXnhXY-zr5-Y4bqagI_UoJskVLnYU9EFmvLzU1ImPoeMQq0lcxfki8f6CN8OMyeN9OrT3P54B8guOdZNWKaMBgmgAf", "https://www.forgerock.com/about-us/press-releases/open-banking-selects-forgerock-to-provide-cloud-based-reference-bank-application/", "https://www.globenewswire.com/Tracker?data=9Hr-BEy5HDQIj9gDUQzqtL6xPJ-y_zb8WJ_V7kfIM9Uon9kLAnSoSAh1J3Bv3v9sklgtRzw6l53eqIIonpdqqw==", "https://www.forgerock.com/about-us/press-releases/forgerock-series-d-funding/", "https://www.globenewswire.com/Tracker?data=OJljy2Fk9N8nWxVSMPjKFvwXrfVi0bfotaegQfniW-uCCNBscdhVHZdWwtXFKxUr89xHnVNFgoHmdu1oM1xavg-vdhQL9A_8ZsYPnPUEHhKlSzDi9xolrCv0U9bEGk9BGEGfD-ouK3AME5zjdxL2uaoSPAMztYDFPcrF4tdrvMpjSSEoLZQfzLP57WMMh3mnNTyH3glk_dQ0Zl-WkzoJ4EEhUF3ofZHEOVZqXl7KbJY=", "https://www.globenewswire.com/Tracker?data=UhYLVbq8KuMroIvgOlsc82qY47ubufdY6-nFCqiyQMPiGui9XamdtEQWvQK8tKU_zpHDGrhqZew-b-YmmYSzjW9T377mf2tKs3pdCRo1Hx4="], "published": "2018-01-23T17:00:00.000+02:00", "crawled": "2018-01-23T17:49:50.000+02:00", "highlightTitle": ""}