{"organizations": [], "uuid": "779a6a8c51859d36fad8c7d49020b2e2d319adf1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-flashtalking-and-spongecell-announce-merger-providing-the-scale-and-know-how-to-lead-sophisticated-advertisers.html", "country": "US", "domain_rank": 767, "title": "Flashtalking and Spongecell Announce Merger, Providing the Scale and Know-How to Lead Sophisticated Advertisers", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T00:00:00.000+02:00", "replies_count": 0, "uuid": "779a6a8c51859d36fad8c7d49020b2e2d319adf1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-flashtalking-and-spongecell-announce-merger-providing-the-scale-and-know-how-to-lead-sophisticated-advertisers.html", "ord_in_thread": 0, "title": "Flashtalking and Spongecell Announce Merger, Providing the Scale and Know-How to Lead Sophisticated Advertisers", "locations": [], "entities": {"persons": [{"name": "nardone", "sentiment": "none"}, {"name": "john nardone", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "spongecell announce merger", "sentiment": "negative"}, {"name": "spongecell", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 29, 2018 (GLOBE NEWSWIRE) -- Flashtalking, the leading global independent platform for ad management, data activation and unified insights, and top personalized creative company Spongecell, today announced a merger of the two companies, creating a new market leader in data driven dynamic creative. Coming together under the Flashtalking brand, the combined company will provide brands and agencies with the vital knowledge, technology and scale to operate data driven creative in a programmatic world.\n“The market leaders coming together is a response to a very real demand we see from brands and agencies,” said Flashtalking CEO John Nardone. “Increasingly they’re recognizing data driven creative is essential to connect with today’s consumer and have been asking us both to assist with our expertise, technology and processes to deliver better more impactful advertising.”\nNardone continued, “Spongecell has great, knowledgeable people and has built innovative tech that naturally complements our broader dynamic creative capabilities. Together we now deliver the market-leading DCO solution within the context of a complete buy-side ad serving solution: a truly independent technology and analytics partner without media buying conflict or bias, representing a clear and viable alternative to DoubleClick.”\nInvesting in Leadership\nThe companies’ combined capabilities will provide advertisers across all verticals with market-leading dynamic creative expertise, products and services—enabling efficient personalized and data-enabled creative messaging across all forms of display, video, social, and native advertising.\nBut just as important, the combined company provides the scale to continue to invest in the people, product innovation and industry education that large clients and agencies need to advance their own capabilities and expertise in data driven creative.\n“Our companies share the view that personalized creative is no longer optional. It is essential for connecting with today’s distracted consumer, and for digital marketing success,” said Spongecell CEO, Ben Kartzman, who will take on the role of COO in the combined company. “Flashtalking and Spongecell uniting is a natural move for both of us, as advertisers seek scaled solutions from financially stable partners. Clients of both companies can expect increasing investment in both technology and people to drive better outcomes. With this deal, technological wherewithal and market scale meet unrivaled dynamic creative and attribution analytics capability.”\nTerms of the deal were not disclosed. Needham & Company acted as strategic advisor to Spongecell.\nAbout Flashtalking\nFlashtalking equips advertisers and their agencies to create, activate and measure data-driven advertising across digital channels and formats. Our programmatic creative and analytics platform unifies audience, media and creative to deliver personalized messaging while optimizing performance of media and creative. With cookie-less tracking, connected log-file and algorithmic attribution, we can coordinate, augment and analyze data signals to support our clients at the crossroads where data, relevant creative, and unbiased measurement intersect with expertise, service and a deep partner ecosystem.\nBorn in the U.K., headquartered in New York, Flashtalking spans the globe with offices in San Francisco, Los Angeles, Chicago, London, Leeds, Cologne, Hamburg, Amsterdam, and Sydney. For more information visit www.flashtalking.com .\nAbout Spongecell\nSpongecell is a dynamic creative technology company focused on making data-driven creative simple, effective and scalable by integrating data, machine learning and automation in the creative process. We enable marketers to efficiently deliver the most beautiful, relevant and engaging brand content to prospects and customers across all devices and formats. Spongecell is headquartered in New York City and has offices across the United States and Europe. For more information, visit www.spongecell.com .\nContact:\nKendall Allen\nWIT Strategy for Flashtalking\nkallen@witstrategy.com\nSource: Flashtalking", "external_links": ["https://www.globenewswire.com/Tracker?data=Iv8CYG_hRWdm99F-YETSmN4fGxSTZNnR2-2TPe5UjkbRCeLEtFtsOguNIHu6tLcMELnfHhsmFwSM90I2ZEfu1u-DdcS9FdMdseCsc66Ziy0sR3MucCgWgvWWZS2pd_ze5Hy1C4_8KW78OICtxA8Xyb7RseoXypgoZsMUnAJpyLAOzHu04byhVahoBQQnz5Rx", "https://www.globenewswire.com/NewsRoom/AttachmentNg/f17f0f2d-e3f0-468f-bb07-35727b528971", "https://www.globenewswire.com/Tracker?data=FHGDJQUw0sH97_7voP0c-brt8V1_qqgFXImtMnylFFdcpQmiNUbqdr585vnZeaPnPN6btl3VQxjY4wcFJedRCdfeGYsk-zVS44AtSh-JJRQ=", "https://www.globenewswire.com/Tracker?data=9RrXdoqAAxdLiyhGzpbuUmOKFh4tVkbwlz2la6YwupBHhsNvwQZmaQq4p0NetPDpemTdynzpBDx368-3uuL62nfBilQAddAFbWizUzeQ4TIGy4vYemBQs6tKyaxuKFrAp3zy0Yfy7bxFokwITZOQb1GDe-5rN06-Vhu1TmJI4hg3PBV78J6hzQnH8jmu_FwMHn_eK4EX7dk4m5eh3pY-pGh-CZAURh6VOkZW8EMn-fAG7WaeXnF1KXhIlFrBL05qNXE1bOpg7EivCQxNvxZbORDgtvfwvfs_SzVN61Vzo4ZX1zyDyqjSNN5NWf3CQ1pzIg7tzbirnt00xXKZk9A2RQ=="], "published": "2018-01-30T00:00:00.000+02:00", "crawled": "2018-01-30T04:13:24.019+02:00", "highlightTitle": ""}