{"organizations": [], "uuid": "275272a483e0ce9dc7ac454434a3f1c18bf3881e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226950398&w=1200&r=LYNXMPEE0U0XZ", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-germany-politics/german-parties-agree-on-pensions-as-coalition-talks-progress-idUKKBN1FK1VY", "country": "US", "domain_rank": 408, "title": "German parties agree on pensions as coalition talks progress", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T15:21:00.000+02:00", "replies_count": 0, "uuid": "275272a483e0ce9dc7ac454434a3f1c18bf3881e"}, "author": "", "url": "https://uk.reuters.com/article/uk-germany-politics/german-parties-agree-on-pensions-as-coalition-talks-progress-idUKKBN1FK1VY", "ord_in_thread": 0, "title": "German parties agree on pensions as coalition talks progress", "locations": [], "entities": {"persons": [{"name": "angela merkel", "sentiment": "none"}, {"name": "merkel", "sentiment": "none"}, {"name": "thorsten severin", "sentiment": "none"}, {"name": "andreas rinke", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}], "organizations": [{"name": "spd", "sentiment": "none"}, {"name": "min read  berlin", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 1:21 PM / Updated 10 minutes ago German parties agree on climate as coalition talks progress Andreas Rinke , Markus Wacket 4 Min Read \nBERLIN (Reuters) - Chancellor Angela Merkel’s conservatives agreed with their would-be Social Democrat (SPD) partners on Wednesday on climate targets for 2030, a sign of steady progress in coalition talks which both sides aim to conclude within a week. \nMerkel, weakened after losing votes to the far-right in a September election, is pinning her hopes for a fourth term on a re-run of the ‘grand coalition’ with the SPD to end four months of political limbo in Europe’s biggest economy. \nAfter a breakthrough on the contentious issue of family reunions for migrants on Tuesday - although it was overshadowed by a subsequent row over the details - the parties ticked off other, less tricky, issues including climate policy. \nReflecting a blueprint deal reached in exploratory talks earlier this month, the parties effectively dropped the previous government’s target to reduce CO2 emissions by 40 percent by 2020 from 1990 levels. \nWhile ‘recognising’ that goal, documents seen by Reuters show the focus is instead on a legally binding 2030 goal to cut emissions by 55 percent via savings in transport, agriculture, energy and buildings, supported by tax incentives or subsidies. \nAn unexpected intervention on climate policy came from across the Atlantic. Green activist and former Democrat U.S. presidential candidate Al Gore called on the conservatives and Social Democrats to agree to phase out coal by 2030. \n“This is your moment to lead and help solve the climate crisis,” tweeted Gore. \nHe is likely to be disappointed as the parties have only committed to draw up a plan to phase out coal-generated electricity and set a date for its end, without indicating when. PENSIONS, CARE, PAY \nWorking groups are wading through the details of the framework deal on policies from Europe to tax and migrants. \nEarlier, the parties had agreed to cap pension contributions, divided between workers and employers, at 20 percent of an individual’s salary to 2025, party sources said. \nThe SPD, which failed to win voters with a campaign focused on social justice, had before the election wanted a cap of 21.8 percent until 2030 from 18.7 percent. \nIn the blueprint deal, the parties also agreed to stabilise pensions at 48 percent of the average wage by 2025. \nThe parties have also agreed to keep social security payments to below 40 percent of gross pay and to give companies the chance to write down digital investments. \nLate on Tuesday, the parties also agreed on steps to create 8,000 more jobs in the care sector and improve pay. Related Coverage German would-be coalition allies agree to ensure 2030 climate goal is met \nThe SPD are pushing for tweaks that will help its leaders sell a final coalition deal to its 440,000 members, many of whom are against joining Merkel’s conservatives again. \nAny deal will depend on the approval of SPD members who will be balloted after party leaders agree - possibly at the end of the weekend or early next week. \nAlready, the JUSOS youth wing of the SPD has sharply criticised the deal on family reunions for migrants, saying the SPD leaders had not delivered sufficient improvements from the exploratory talks blueprint. \n“If we don’t succeed in getting more out of the negotiations overall, we must break off talks with the conservatives,” JUSOS leader Kevin Kuehnert told Deutschlandfunk radio. Additional reporting by Thorsten Severin; Writing by Madeline Chambers; Editing by William Maclean and Andrew Heavens", "external_links": [], "published": "2018-01-31T15:21:00.000+02:00", "crawled": "2018-01-31T15:48:18.036+02:00", "highlightTitle": ""}