{"organizations": [], "uuid": "c78f61ce6d0fa49ac91fa4c866dcb98d1b07a4fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-ken-chenault-to-join-general-catalyst.html", "country": "US", "domain_rank": 767, "title": "Ken Chenault to Join General Catalyst", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T06:25:00.000+02:00", "replies_count": 0, "uuid": "c78f61ce6d0fa49ac91fa4c866dcb98d1b07a4fb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-ken-chenault-to-join-general-catalyst.html", "ord_in_thread": 0, "title": "Ken Chenault to Join General Catalyst", "locations": [], "entities": {"persons": [{"name": "ken chenault", "sentiment": "negative"}, {"name": "ken", "sentiment": "none"}, {"name": "peter chernin", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "airbnb", "sentiment": "none"}], "organizations": [{"name": "american express", "sentiment": "none"}, {"name": "general catalyst", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "chernin group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 29, 2018 /PRNewswire/ -- General Catalyst, a venture capital firm that makes early-stage and transformational investments, today announced that Ken Chenault, retiring chairman and CEO of American Express, will join the firm as chairman and a managing director.\nKnown for his exceptional leadership, Ken's 17 years at the helm of American Express focused on expansion to key partnerships and consumer customers beyond its core offerings and traditional clientele, placing the company at the forefront of the payments sector. Further, his integrity and reputation as a trusted advisor make him one of the most sought after mentors to emerging leaders, particularly those seeking to build powerful brands and compete on a global scale. He recently was appointed to the boards of Airbnb (General Catalyst is an investor in the company) and Facebook.\n\"Having had the good fortune to work closely with Ken for many years, it is easy to say that he is one of the most deeply gifted and impactful CEOs I've known,\" said Peter Chernin, CEO, The Chernin Group. \"With his strong character, restless curiosity and deep experience across myriad businesses, Ken will be an ideal investor and partner for entrepreneurs.\"\nIn his new role at General Catalyst, Ken will lead new investments in companies with breakout characteristics, including those that are scaling quickly and have the potential to become significant, global institutions. His deep respect for entrepreneurship and innovation, experience mentoring top leadership teams, and his vision and knowledge in areas including payments, security, ecommerce, and travel & leisure will be invaluable to the General Catalyst portfolio of leaders who are changing the world. As chairman, Ken will use his renowned leadership abilities and experience to continue to evolve GC into a formidable and enduring firm.\n\"I am a great admirer of Ken Chenault and his ability to lead and make a difference,\" said Karen Mills, senior fellow at the Harvard Business School. \"When I was the head of the US Small Business Administration, we partnered with Ken and American Express to build 'Small Business Saturday', an effort that he personally drove. Today, Shop Small has become a successful movement, helping millions of small businesses all over the country. We now serve together on the Harvard Corporation, the University's most senior governing board, where he brings wisdom and strategic insight. I'm thrilled to see him join my friends at General Catalyst.\"\nThe General Catalyst team has known Ken as a mentor, advisor, and personal friend over the past 20 years, including through his collaboration with the team in the travel and loyalty sectors, and his work with GC portfolio company founders through American Express' participation in a handful of the firm's investments.\n\"GC is not just a top VC firm with powerful personalities, they are in it to win for all the right reasons,\" said Ken Chenault. \"I have tremendous respect for their integrity and appreciation for one another, and their obvious empathy and admiration for the founders they support. It is clear that they have built a firm that will endure.\"\n\"I have known Ken for many years, including most recently through our work together as Fellows of Harvard College, and I've been actively co-investing with General Catalyst over the last 15 years,\" said Jim Breyer, Founder and CEO, Breyer Capital, a premier investment firm based in Menlo Park, CA. \"Ken's new role at GC and the integrity, connectivity and leadership he will bring to the venture capital and tech communities will be transformative.\"\nAbout General Catalyst\nGeneral Catalyst is a venture capital firm that makes early-stage and transformational investments. We back fearless entrepreneurs who are building market leading technology companies like Airbnb, ClassPass, Datalogix, Datto, Deliveroo, Demandware, Gusto, Illumio, HubSpot, KAYAK, Livongo, Oscar, Snap, Stripe, and Warby Parker. With offices in San Francisco, Palo Alto, New York City and Boston, our portfolio companies benefit from a bicoastal network of talent, customers, and opportunity. For more: www.generalcatalyst.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/ken-chenault-to-join-general-catalyst-300589939.html\nSOURCE General Catalyst", "external_links": ["http://www.generalcatalyst.com/", "http://www.prnewswire.com/news-releases/ken-chenault-to-join-general-catalyst-300589939.html"], "published": "2018-01-30T06:25:00.000+02:00", "crawled": "2018-01-30T08:21:56.007+02:00", "highlightTitle": ""}