{"organizations": [], "uuid": "30e307a09c14cbe6b1d86ba61e1ffdfa5a98f03a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-aegion-corporation-announces-brian-groody-as-president-of-corrosion-protection-platform.html", "country": "US", "domain_rank": 767, "title": "Aegion Corporation Announces Brian Groody as President of Corrosion Protection Platform", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.115, "site_type": "news", "published": "2018-01-29T18:00:00.000+02:00", "replies_count": 0, "uuid": "30e307a09c14cbe6b1d86ba61e1ffdfa5a98f03a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-aegion-corporation-announces-brian-groody-as-president-of-corrosion-protection-platform.html", "ord_in_thread": 0, "title": "Aegion Corporation Announces Brian Groody as President of Corrosion Protection Platform", "locations": [], "entities": {"persons": [{"name": "brian groody", "sentiment": "negative"}, {"name": "groody", "sentiment": "none"}], "locations": [{"name": "st. louis", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "central asia", "sentiment": "none"}, {"name": "aegion", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "aegion corporation", "sentiment": "negative"}, {"name": "corrosion protection platform", "sentiment": "negative"}, {"name": "llc", "sentiment": "none"}, {"name": "schlumberger oilfield services", "sentiment": "none"}, {"name": "aegn", "sentiment": "none"}, {"name": "spitzer industries", "sentiment": "none"}, {"name": "corrosion protection", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ST. LOUIS, Jan. 29, 2018 (GLOBE NEWSWIRE) -- Aegion Corporation (“Aegion” or the “Company”) (Nasdaq:AEGN) today announced that Brian Groody has joined Aegion as President of its Corrosion Protection platform. Mr. Groody will have full P&L responsibility for the Corrosion Protection platform, which generated over $400 million in revenues in 2017. He will also focus on enhancing operational discipline while developing the platform’s long-term strategy.\nMr. Groody most recently served as Executive Vice President of Operations at Strike, LLC, a large midstream engineering and construction firm, where he was responsible for leadership of their pipeline equipment business. Prior to Strike, Mr. Groody was President and CEO of Spitzer Industries where he led the company’s growth strategy in the upstream, midstream and downstream energy construction markets. Mr. Groody’s career began with Schlumberger Oilfield Services where he held a variety of leadership roles in the United States, Africa, Europe, Latin America, Russia and Central Asia over a 17-year period, culminating with responsibility for operations in the Offshore Russia and Central Asia areas.\nCharles R. Gordon, Aegion’s President and CEO said, “Brian’s broad global experience in the oil and gas industry, focus on customer relationships and disciplined approach to achieving strategic goals uniquely qualify him for the role of Corrosion Protection President. I am confident that Brian’s leadership, combined with the depth of the Corrosion Protection management team, position the platform for success in 2018 and beyond.”\nAbout Aegion (NASDAQ: AEGN)\nAegion combines innovative technologies with market-leading expertise to maintain, rehabilitate and strengthen infrastructure around the world. Since 1971, the Company has played a pioneering role in finding transformational solutions to rehabilitate aging infrastructure, primarily pipelines in the wastewater, water, energy, mining and refining industries. Aegion also maintains the efficient operation of refineries and other industrial facilities. Aegion is committed to Stronger. Safer. Infrastructure. ®\nForward-Looking Statements\nThe Private Securities Litigation Reform Act of 1995 provides a \"safe harbor\" for forward-looking statements. Aegion's forward-looking statements in this release represent its beliefs or expectations about future events or financial performance. These forward-looking statements are based on information currently available to Aegion and on management's beliefs, assumptions, estimates or projections and are not guarantees of future events or results. Except as required by law, Aegion does not assume a duty to update forward-looking statements, whether as a result of new information, future events or otherwise. Investors should, however, review additional disclosures made by Aegion from time to time in Aegion's filings with the Securities and Exchange Commission. Please use caution and do not place reliance on forward-looking statements. All forward-looking statements made by Aegion in this news release are qualified by these cautionary statements.\nAegion ® and the Aegion ® logo are the registered trademarks of Aegion Corporation and its affiliates.\nFor more information, contact:\nAura Joyce\nDirector, Marketing & Communications\nAegion Corporation\n636-530-8775\nSource:Aegion Corp", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/4b53c002-d00a-4237-af74-3846b0f05d27"], "published": "2018-01-29T18:00:00.000+02:00", "crawled": "2018-01-29T19:28:11.000+02:00", "highlightTitle": ""}