{"organizations": [], "uuid": "52f0f00d28638dee5f16fee87d401b8806edba41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.newslookup.com/rss/newslookup-usnp.rss", "section_title": "US Newspapers: National", "url": "https://www.reuters.com/article/china-copper-scrap/rpt-as-china-restricts-scrap-metal-companies-look-to-process-copper-abroad-idUSL4N1P32SI", "country": "US", "domain_rank": 408, "title": "RPT-As China restricts scrap, metal companies look to process copper abroad", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T01:00:00.000+02:00", "replies_count": 0, "uuid": "52f0f00d28638dee5f16fee87d401b8806edba41"}, "author": "", "url": "https://www.reuters.com/article/china-copper-scrap/rpt-as-china-restricts-scrap-metal-companies-look-to-process-copper-abroad-idUSL4N1P32SI", "ord_in_thread": 0, "title": "RPT-As China restricts scrap, metal companies look to process copper abroad", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats story that ran on Monday)\nBy Tom Daly\nBEIJING, Jan 8 (Reuters) - As China tightens restrictions on imports of foreign waste, Chinese metal recyclers and even smelters like Jiangxi Copper Co are increasingly looking to use Southeast Asian countries as an alternative location for the processing of copper scrap.\nChina relies on imports for around half of its scrap copper needs but told the World Trade Organization last year that it would stop accepting certain types of foreign solid waste, including metals, from 2018 if they did not meet stricter impurity thresholds.\nAnalysts say this cuts off a key source of supply for the world’s largest copper consumer and boosts refined copper makers, which are likely to see an increase in demand. Shanghai copper futures were roiled last year by China’s moves to ban imports of Category 7 scrap - such as coiled copper cable and waste motors - from 2019, with import quotas already starting to dry up.\nAnd, in a more immediate development, traders in China now find themselves unable to import scrap copper if they cannot show they are scrap end-users.\nManson Zeng, an entrepreneur based in China’s bustling southern Guangdong province, decided to set up a trading platform for waste recyclers after realizing the policy changes would spell the end for his own waste import business.\nHe estimated that several hundred of the platform’s members had gone to Southeast Asian countries to develop their businesses or were preparing moves.\nIn the case of copper, the idea is to perform dismantling work overseas on Category 7 scrap procured from countries like the United States and convert it into higher-grade material that would not be subject to China’s new import restrictions.\nElton Xu, the foreign trade department manager at Zili Copper Industry Co, a recycler of scrap copper in Hangzhou, said his company has started building a new processing factory in Thailand because of the policy changes.\nHaving visited several potential sites in Southeast Asia, Zili decided to set up shop in an industrial park in Rayong on the Gulf of Thailand.\nThe project, due to start up by the end of 2018, “will produce 50,000 tonnes per year of copper blister from 200,000 tonnes of hazardous waste and other complex materials,” Xu said, adding that this would help Zili increase its annual output of copper cathode - used to make copper rods and wire - of 150,000 tonnes. Copper blister is partly purified copper.\nEYEING SOUTHEAST ASIA China’s top three sources of scrap copper in 2017 were Hong Kong, the United States and Australia, which accounted for around 45 percent of imports in the first 11 months of the year.\nBut customs data also point to a booming copper scrap trade between China and Southeast Asia. In the January-November period, Chinese imports of copper scrap from Thailand jumped 94.9 percent year on year to 146,185 tonnes. That followed a 355 percent jump in 2016 from the previous year.\nTwo other emerging Southeast Asian scrapyards, Malaysia and the Philippines, were also among China’s top 10 scrap copper suppliers, the latter’s shipments jumping by over 520 percent.\nA source at one scrap recycler in Malaysia said more Chinese companies had been setting up plants in the country over the past couple of years, importing scrap copper from around the world. But she said they only took high-quality copper scrap.\nVietnam, Indonesia, Myanmar, Laos and India were named by industry sources as possible alternative scrap-processing destinations.\nAnd it is not just small, private players weighing such moves. Even the state-run Jiangxi Copper , which uses scrap as well as copper concentrate to make refined copper, is considering setting up facilities in Southeast Asia because of the import ban, company sources said.\n“We want to find a country where it’s convenient to ship to China,” one Jiangxi Copper official said, adding that the company planned to send out teams to assess conditions on the ground. The official requested anonymity because he was not authorized to speak to the media. A Jiangxi Copper spokeswoman said she was unaware of the plans.\nA shift of Chinese processing capacity “will inevitably happen in other Asian countries, typically less mature economies,” Michael Lion, president of Lion Consulting Asia, said at the Asia Copper Week conference in November. But he said that such facilities “do not exist to the extent they do in China” and “can’t be recreated overnight.”\nScrap companies may be reluctant to invest overseas in case China changes its regulations again after seeing their impact, which could be “enormous”, Lion said.\nSpeaking of China’s new thresholds for impurities, which are 1 percent for nonferrous metals and 0.5 percent for waste electric motors, wires and cables, Lion said “it would be extremely difficult” for any scrap coming into China to conform with the new requirements.\n“At the very best, there is going to be an enormous dislocation and disruption in the copper supply chain.”\nReporting by Tom Daly; Additional reporting by Emily Chow in Kuala Lumpur; Editing by Philip McClellan\n ", "external_links": [], "published": "2018-01-09T01:00:00.000+02:00", "crawled": "2018-01-09T09:40:23.696+02:00", "highlightTitle": ""}