{"organizations": [], "uuid": "6a93e7b55d7e972bbcb5c866a2ddae993ad60ea7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224651976&w=1200&r=LYNXMPEE0N03Z", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-global-oil/oil-firm-on-strong-economy-and-opec-cuts-but-traders-prepare-for-downward-move-idUSKBN1FD05L", "country": "US", "domain_rank": 408, "title": "Oil firm on strong economy and OPEC cuts, but traders prepare for downward move", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.852, "site_type": "news", "published": "2018-01-24T09:34:00.000+02:00", "replies_count": 0, "uuid": "6a93e7b55d7e972bbcb5c866a2ddae993ad60ea7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-global-oil/oil-firm-on-strong-economy-and-opec-cuts-but-traders-prepare-for-downward-move-idUSKBN1FD05L", "ord_in_thread": 0, "title": "Oil firm on strong economy and OPEC cuts, but traders prepare for downward move", "locations": [], "entities": {"persons": [{"name": "stephen innes", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "opec", "sentiment": "negative"}, {"name": "organization of the petroleum exporting countries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - U.S. oil prices rose on Wednesday, boosted by a record 10th straight weekly decline in U.S. crude inventories, though reduced refining activity and rising production signaled U.S. stocks should rise in coming weeks.\nU.S. crude inventories fell by 1.1 million barrels last week, short of expectations, but the 10-week streak of declines represents a record, according to U.S. Energy Information Administration (EIA) data going back to 1982. At 411.6 million barrels, stocks are at their lowest since February 2015. [EIA/S]\nThe steady draw has triggered record buying by speculators, pushing oil benchmarks to three-year highs.\nAlso supporting oil prices was a 0.7 percent drop in the U.S. dollar after Treasury Secretary Steven Mnuchin’s comments that a weaker currency was positive for American trade. [USD/] A weaker dollar makes greenback-denominated commodities less expensive for investors using other currencies.\nU.S. West Texas Intermediate (WTI) futures were up 36 cents at $64.83, after hitting their highest since December 2014, as of 12:44 p.m. EST (1744 GMT). Brent futures slipped five cents to $69.92 a barrel, after also hitting their highest since December 2014.\n“The market has rallied by 50 percent and a lot of investors have been involved for a long time,” said Saxo Bank senior manager Ole Hansen.\nU.S. crude production rose to 9.9 million barrels per day last week, nearing the all-time record of 10.04 million bpd set in 1970, the EIA data showed.\nSpeaking at the World Economic Forum in Davos, Switzerland, Khalid al-Falih, Saudi Arabia’s energy minister, said he is not concerned about the threat of U.S. production, citing declining output from Venezuela and Mexico.\nU.S. refining capacity use declined by 2.1 percentage points as maintenance season began, though gasoline and diesel demand still exceeded year-ago levels, the EIA said.\n“It is only a matter of weeks until lower crude oil processing and rising domestic production lead to crude stock builds,” said Carsten Fritsch, oil analyst at Commerzbank AG in Frankfurt, Germany.\nMoney managers hold more bullish positions in crude futures and options than at any time on record, encouraged by falling global inventories after production cuts by the Organization of the Petroleum Exporting Countries, Russia and others.\nSome investors now appear to be seeking protection against a possible fall in prices. Trading data shows open interest for Brent put options for selling at $70, $69 and $68 a barrel has climbed since the middle of last week.\nSukrit Vijayakar of energy consultancy Trifecta said rising sell options are a result of large long positions built in previous months.\n“We still have ... nine long barrels for every short barrel, so a reversal should be interesting to watch,” he said.\nHowever, traders said oil prices were unlikely to fall far because strong global economic growth has boosted oil demand while supply has been restraint by the OPEC-led deal to limit production.\nAdditional reporting by Amanda Cooper and Henning Gloystein; Editing by Marguerita Choy and David Goodman\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T09:34:00.000+02:00", "crawled": "2018-01-24T04:30:34.002+02:00", "highlightTitle": ""}