{"organizations": [], "uuid": "ddd989c2d8338372d47ff7a1ed0551bf8fdb4081", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226333297&w=1200&r=LYNXMPEE0S14Q", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/us-climatechange-trump/trumps-view-that-ice-caps-setting-records-baffles-scientists-idUKKBN1FI1WK", "country": "US", "domain_rank": 408, "title": "Trump's view that ice caps 'setting records' baffles scientists", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T17:16:00.000+02:00", "replies_count": 0, "uuid": "ddd989c2d8338372d47ff7a1ed0551bf8fdb4081"}, "author": "", "url": "https://uk.reuters.com/article/us-climatechange-trump/trumps-view-that-ice-caps-setting-records-baffles-scientists-idUKKBN1FI1WK", "ord_in_thread": 0, "title": "Trump's view that ice caps 'setting records' baffles scientists", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "doyle", "sentiment": "none"}, {"name": "michael zemp", "sentiment": "none"}], "locations": [{"name": "alps", "sentiment": "none"}, {"name": "andes", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "antarctica", "sentiment": "none"}, {"name": "greenland", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "min read  oslo", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "world glacier monitoring service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 3:18 PM / Updated 17 minutes ago Trump's view that ice caps 'setting records' baffles scientists Alister Doyle 3 Min Read \nOSLO (Reuters) - Scientists puzzled on Monday over U.S. President Donald Trump’s assertion that ice caps are “setting records” when much of the world’s ice from the Alps to the Andes is melting amid global warming. \nTrump cast doubt on mainstream scientific findings about climate change in an interview aired on Britain’s ITV channel on Sunday night, saying “there’s a cooling and there’s a heating”. \n“The ice caps were going to melt, they were going to be gone by now. But now they’re setting records. They’re at a record level,” he said. \nMany people use the term “ice cap” to refer to polar sea ice or vast ice sheets on Greenland and Antarctica. It is also a technical term for smaller masses of ice on land, ending in glaciers. \n“Glaciers and ice caps are globally continuing to melt at extreme rate,” said Michael Zemp, director of the World Glacier Monitoring Service which tracks hundreds of glaciers. \nTrump’s implication that glaciers and ice caps are growing “is simply wrong. Or maybe he is referring to a different planet,” Zemp said. \nMelting ice is contributing to push up world sea levels. \nAndrew Shepherd, a professor of Earth Observation at the University of Leeds, said: “I think despite first appearances he (Trump) has chosen his words carefully.” \n“He was careful to say ‘setting records’ and not specify whether those are record highs or lows. And of course he does not mention time either, so it’s not clear what years he is referring to,” he said. \nSome scientists, in a widely contested projection at the time, wrongly said a few years ago that Arctic sea ice could vanish in summers by around 2015. \nAnd sea ice around Antarctica hit a record high extent in the winter of 2014 in apparent defiance of global warming, satellite data from the U.S. National Snow and Ice Data Center (NSIDC) show. \n“There are, whoever, various reasons for that growth, consistent with climate warming,” said Jack Kohler, of the Norwegian Polar Institute. Some research said shifts in winds may be blowing ice further offshore. \nAround Antarctica, a long-term expansion of sea ice may have abruptly ended. The ice is now at a record small extent for late January, according to NSIDC data dating back to 1979. \nAt the other end of the planet, Arctic sea ice has set repeated lows in recent decades and is also at a record low for the time of year, NSIDC data show. \nIn another broad sense of ice cap, the U.N. panel of climate scientists wrote in their last review in 2014 that “the Greenland and Antarctic ice sheets have been losing mass”. Reporting By Alister Doyle; Editing by Angus MacSwan", "external_links": [], "published": "2018-01-29T17:16:00.000+02:00", "crawled": "2018-01-29T17:55:42.037+02:00", "highlightTitle": ""}