{"organizations": [], "uuid": "1ea4f18bb5c86978970d2ba74b5ac233474b26b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 1}, "linkedin": {"shares": 2}, "facebook": {"likes": 210, "shares": 210, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220357912&w=1200&r=LYNXMPEE071DS", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-cohen-iran-commentary/commentary-cracks-in-russia-iran-alliance-open-options-for-trump-idUSKBN1EX298", "country": "US", "domain_rank": 408, "title": "Commentary: Cracks in Russia-Iran alliance open options for Trump", "performance_score": 2, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.974, "site_type": "news", "published": "2018-01-09T05:08:00.000+02:00", "replies_count": 0, "uuid": "1ea4f18bb5c86978970d2ba74b5ac233474b26b9"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-cohen-iran-commentary/commentary-cracks-in-russia-iran-alliance-open-options-for-trump-idUSKBN1EX298", "ord_in_thread": 0, "title": "Commentary: Cracks in Russia-Iran alliance open options for Trump", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Iran and Russia have made no secret of their mutual desire to sideline the United States in the Middle East. “Our cooperation can isolate America,” Supreme Leader Ayatollah Ali Khamenei told Vladimir Putin during the Russian president’s recent visit to Tehran. Putin, for his part, has praised the Moscow-Tehran relationship as “very productive.”\nCertainly the alliance has paid dividends in Syria, where the Moscow-Tehran military collaboration turned the tide of the war in favor of their mutual ally Bashar al-Assad and compelled the United States to abandon its goal of forcing Assad from power. Nevertheless, while Washington should certainly be wary of the Russian-Iranian relationship, it is less a strategic alliance than a marriage of convenience – and one whose cracks are already showing.\nIn Syria, the ousting of Islamic State seems to have underscored important differences in the goals and tactics of Putin and Khameini. Moscow’s ultimate objectives include preventing regime change, promoting Russian influence in the Middle East, and keeping its military bases in Syria. Achieving these aims, Putin hopes, may lead to diplomatic gains in the West, and encourage the United States to recognize Russia as an equal. However, while Moscow considers Assad to be Syria's legitimate leader, Putin’s main interest lies in preserving and strengthening Syrian state institutions rather than Assad personally; the Russians have even suggested to their Western counterparts that Moscow would accept Assad's departure as long as it occurred as part of an overall peace process.\nThe Iranians, by contrast, consider Assad's departure a \"red line\" and believe that keeping the Syrian leader in power remains crucial to two of its key objectives. The first is to maintain its ability to supply its longtime Shi’ite proxy Hezbollah with weaponry while building a “Sunni free” Shi’ite land corridor from Iran to the Mediterranean – a development Iran fears a new government would not permit. Second, Iran believes that its presence in Syria is critical to Tehran's ability to pressure Israel. Iran wants to retain the ability to strike at the Jewish state from both Lebanon and Syria, hence Iran’s determination to maintain non-state Shi’ite proxy militias in Syria. Iran's hardline Islamic Revolutionary Guards Corps (IRGC) wants to turn these proxies into an institutionalized political and military force similar to Hezbollah in Lebanon - a measure that conflicts with Russia's desire to build up the capabilities of the Syrian state and reduce Syria’s dependence on Iran.\nAs diplomatic negotiations over Syria's future heat up, the differences between Russian and Iranian goals there threaten to intensify. Iran in particular believes that Russia's willingness to work with countries like Turkey could undermine Iranian interests in Syria. Iran’s leaders are also concerned about Putin’s relationship with Donald Trump; reports from Iranian media suggest that Tehran was angry about Putin’s decision to brief the U.S. president about Moscow’s objectives ahead of last November’s Sochi summit between Putin, Turkish President Recep Tayyip Erdogan and Iranian President Hassan Rouhani.\nRussian President Vladimir Putin welcomes Syrian President Bashar al-Assad during a meeting in the Black Sea resort of Sochi, Russia November 20, 2017. Sputnik/Mikhail Klimentyev/Kremlin via REUTERS Russia's willingness to work with multiple partners in Syria is emblematic of Russia's broader approach to the Middle East, which a leading Russian analyst describes as the \"dogma of flexibility\" - something in accord with Putin's transactional approach to foreign policy. One example of this is Moscow's desire to maintain a good relationship with Sunni Saudi Arabia. Putin believes Russian-Saudi cooperation is needed to limit oil production and prop up prices, which he needs to meet his twin objectives of building up Russia's military while also strengthening the Russian state internally. The problem for Putin is that Shi'ite Iran and Sunni Saudi Arabia are locked in a bitter competition for influence across the Middle East, so Iran naturally resents the Kremlin's rapprochement after years of tension between Moscow and Riyadh.\nUnder Putin's leadership, Russia has also developed the best relationship it has ever had with Israel. Putin has visited Israel twice – the first Russian leader ever to do so – and has hosted Israeli Prime Minister Benjamin Netanyahu multiple times to discuss Israel's interests in Syria. Putin reportedly enjoys good personal chemistry with Netanyahu and has instructed both Assad and Hezbollah not to retaliate against Israeli strikes in Syria. Putin even seeks a deal that would prevent foreign powers from using Syria as a base for attacking a neighboring state, which is directly at odds with Iran’s objective of using Syria as a platform to pressure Israel's northern border. However, given the deep Israeli-Iranian hostility, it’s clear that Moscow's good relationship with the Jewish state could exacerbate underlying tensions in the Russian-Iranian relationship.\nExacerbating underlying Russian-Iranian tensions is a longtime historical mistrust between the two countries. Russian-Persian conflicts in the 18th and 19th centuries resulted in Moscow's seizure of the Caucasus – a loss which reverberates in the Iranian psyche even today. After Iran's 1979 Islamic Revolution, the relationship between the two sides was similarly tense, most notably because Russia favored Iraq during the Iraq-Iran war – a conflict that cost Iran approximately one million lives. And while it’s true that Russian-Iranian relations improved significantly after the fall of the Soviet Union, Tehran still remembers Moscow supported sanctions against Iran for its nuclear program and has suspended a number of deals with Iran in order to improve the Russian-American relationship.\nThe Trump administration should seek to use the various Russian-Iranian differences to undermine the two sides’ partnership. First and foremost, this requires Washington to remain active in the Middle East and eliminate the perception that it’s abandoning the region.\nThe United States could also seek to improve relations with Russia, which arguably would be both beneficial in and of itself, while also playing on Iran’s historical distrust of its northern neighbor and Tehran’s fear that Moscow could ultimately sell Iran out for the sake of improving Russia’s relationship with the West. Simply having Trump signal to Putin that the United States is prepared to treat Russia as an equal – one of Putin’s objectives – could go some way towards achieving this. Trump should also remind Putin of the cracks already showing in the Russian-Iranian relationship and ask him whether it’s really in Moscow’s interests to support Iran’s sectarian objectives in Syria.\nIt won’t be easy, but if Washington policy-makers play their cards right they can still undermine the strategic alliance that Moscow and Tehran so clearly want.\nAbout the Author Josh Cohen is a former USAID project officer involved in managing economic reform projects in the former Soviet Union.\nThe views expressed in this article are not those of Reuters News.", "external_links": ["https://www.foreignaffairs.com/articles/syria/2017-11-29/iran-and-russia-growing-apart", "http://studies.aljazeera.net/en/reports/2017/11/rulers-middle-east-171106084046465.html", "http://www.jpost.com/Israel-News/Despite-Syria-Israel-Russia-relations-are-the-warmest-in-history-485062", "https://www.nytimes.com/2017/03/31/us/politics/trump-bashar-assad-syria.html", "http://www.france24.com/en/20171101-putin-russia-tehran-iran-cooperation-syria-rohani-us-nuclear-deal", "http://carnegie.ru/2016/08/18/russia-and-iran-historic-mistrust-and-contemporary-partnership/j3qm?mkt_tok=eyJpIjoiWmpWaE1qWXhPV1E0TmpVMiIsInQiOiJCbGR1RElcL25PMTMwTjFTMDJpeFwvRVF6Ris4WWh5TFU1eFNCWmhGZGZoVjVTTFBxXC9Obm5DVnNaMDBuU25KRGlhSjVpVEZYQ3Nkc2syeVhNUEs4dDVBUm5LTFE1WngrS1JDK05QdnBxbW4yND0ifQ%3D%3D", "https://www.haaretz.com/middle-east-news/1.812927", "http://www.tehrantimes.com/news/402765/Velayati-says-Iran-won-t-allow-Syria-s-disintegration", "https://dayan.org/content/russia-turkey-and-iran-cooperation-and-competition-syria#_edn15", "https://www.theguardian.com/world/2016/oct/08/iran-iraq-syria-isis-land-corridor", "https://www.bloomberg.com/news/articles/2016-12-01/putin-wants-to-work-with-trump-as-equals-to-restore-relations", "https://www.rferl.org/a/russia-against-syria-regime-change/27805448.html", "https://worldview.stratfor.com/article/russia-looks-exit-syria?utm_source=Twitter&utm_medium=social&utm_campaign=article", "https://www.al-monitor.com/pulse/originals/2017/12/russia-leverage-syria-limited-assad-iran.html", "http://carnegieendowment.org/2017/02/13/trump-and-russia-right-way-to-manage-relations-pub-67995", "https://www.theguardian.com/world/2010/sep/23/iran-iraq-war-anniversary", "http://www.aei.org/publication/the-political-economy-of-russian-oil-and-gas/", "https://en.radiofarda.com/a/khamenei-representative-says-bashar-assad-is-red-line/28738175.html", "http://www.thearabweekly.com/Opinion/9652/How-long-can-Putin-dance-with-both-Riyadh-and-Tehran%3F", "http://www.soufangroup.com/tsc-intelbrief-an-emerging-split-between-russia-and-iran-over-syria/", "https://www.middleeastmonitor.com/20170403-tensions-in-russia-iran-ties/", "http://eng.globalaffairs.ru/number/Marriage-of-Convenience-18245"], "published": "2018-01-09T05:08:00.000+02:00", "crawled": "2018-01-09T09:40:35.752+02:00", "highlightTitle": ""}