{"organizations": [], "uuid": "f2b9931b2ee91a95284f6552520b361c1dc5c170", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-sogou-appoints-joe-zhou-as-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "Sogou Appoints Joe Zhou as Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-19T14:15:00.000+02:00", "replies_count": 0, "uuid": "f2b9931b2ee91a95284f6552520b361c1dc5c170"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-sogou-appoints-joe-zhou-as-chief-financial-officer.html", "ord_in_thread": 0, "title": "Sogou Appoints Joe Zhou as Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "joe zhou", "sentiment": "negative"}, {"name": "joe", "sentiment": "none"}, {"name": "sogou", "sentiment": "none"}, {"name": "james deng", "sentiment": "none"}, {"name": "xiaochuan wang", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "sogou", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "sohu", "sentiment": "none"}], "organizations": [{"name": "sogo", "sentiment": "negative"}, {"name": "sogou inc.", "sentiment": "negative"}, {"name": "sohu.com inc.", "sentiment": "none"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING, Jan. 19, 2018 /PRNewswire/ -- Sogou Inc. (\"Sogou\" or the \"Company\") (NYSE:SOGO), an innovator in search and a leader in China's internet industry, today announced the appointment of Joe Zhou as the Company's chief financial officer, effective January 22.\nJames Deng, Sogou's existing CFO, who joined the Company in July 2017 to help guide Sogou through its initial public offering, will remain a financial advisor to the Company for six months in order to ensure a smooth transition, and resume his former role at Sohu.com Inc., Sogou's controlling shareholder.\n\"We are delighted to have Joe Zhou assume the role of chief financial officer,\" said Xiaochuan Wang, CEO of Sogou. \"Joe has made great contributions to Sogou's business growth and capital markets initiatives over the past seven years, including playing an instrumental role in building the finance team after the Company was carved out from Sohu in 2010. This, along with his rich experience working with publicly listed companies, make him ideally placed to continue to develop and implement Sogou's financial strategy. I'd also like to thank James for his significant contribution during the IPO process and his continued support.\"\nJoe Zhou said, \"I am proud to have been with Sogou right through its journey to becoming a public company that is poised for long-term growth. I look forward to collaborating closely with Xiaochuan and the team to elevate our business to the next level.\"\nJoe Zhou joined Sogou in 2010 to oversee the Company's finance function as general manager, and has served as the Company's deputy chief financial officer since July 2017. Prior to joining Sogou, Mr. Zhou worked in various senior roles at PricewaterhouseCoopers (PwC), as well as New Oriental Education & Technology Group and TAL Education Group, both U.S.-listed companies. He holds a Bachelor's degree in accounting from Renmin University of China and is pursuing an Executive MBA at Tsinghua University.\nSafe Harbor Statement\nThis announcement contains forward-looking statements. Statements that are not historical facts, including statements about Sogou's beliefs and expectations, are forward-looking statements. These statements are based on current plans, estimates, and projections, and therefore you should not place undue reliance on them. Forward-looking statements involve inherent risks and uncertainties. We caution you that a number of important factors could cause actual results to differ materially from those contained in any forward-looking statement. Information regarding risks affecting Sogou's business and prospects is included in Sogou's Registration Statement on Form F-1 (Registration Number 333-220928) filed with the Securities and Exchange Commission on November 6, 2017.\nAbout Sogou\nSogou Inc. (NYSE: SOGO) is an innovator in search and a leader in China's internet industry. With a mission to make it easy to communicate and get information, Sogou has grown to become the second largest search engine by mobile queries and the fourth largest Internet company by MAU in China. Sogou has a wide range of innovative products and services including the Sogou Input Method, which is the largest Chinese language input software for both mobile and PC. Sogou is also at the forefront of AI development and has made significant breakthroughs in voice and image technologies, machine translation, and Q&A, which have been successfully integrated into its products and services.\nFor investor enquiries, please contact:\nJessie Zheng\nSogou Investor Relations\nTel: +86-10-5689-8068\nEmail: zhengyan@sogou-inc.com\nFor media enquiries, please contact:\nRachael Layfield\nBrunswick Group\nTel: +86-10-5960-8600\nEmail: sogou@brunswickgroup.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/sogou-appoints-joe-zhou-as-chief-financial-officer-300585191.html\nSOURCE Sogou Inc.", "external_links": ["http://www.prnewswire.com/news-releases/sogou-appoints-joe-zhou-as-chief-financial-officer-300585191.html"], "published": "2018-01-19T14:15:00.000+02:00", "crawled": "2018-01-19T16:02:20.008+02:00", "highlightTitle": ""}