{"organizations": [], "uuid": "67ccfb44089dc7f06ca24383084550b5de80df0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222629813&w=1200&r=LYNXMPEE0G06K", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-global-bitcoin/bitcoin-falls-more-than-7-percent-as-regulation-worries-mount-idUKKBN1F60CG", "country": "US", "domain_rank": 408, "title": "Bitcoin jolted by regulation worries, falls 7 percent on extended selloff", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T07:15:00.000+02:00", "replies_count": 0, "uuid": "67ccfb44089dc7f06ca24383084550b5de80df0b"}, "author": "", "url": "https://uk.reuters.com/article/uk-global-bitcoin/bitcoin-falls-more-than-7-percent-as-regulation-worries-mount-idUKKBN1F60CG", "ord_in_thread": 0, "title": "Bitcoin jolted by regulation worries, falls 7 percent on extended selloff", "locations": [], "entities": {"persons": [], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 4:08 AM / Updated 39 minutes ago Bitcoin jolted by regulation worries, falls 7 percent on extended selloff Reuters Staff 4 Min Read \nTOKYO/SINGAPORE (Reuters) - Bitcoin extended its sharp tumble of the past 24 hours, skidding more than seven percent on Wednesday in a rapid downturn in fortunes as investors were spooked by fears regulators might clamp down on an asset whose value has skyrocketed in the past year. \nThe price of the world’s biggest and best-known cryptocurrency fell to as low as $10,567 on the Luxembourg-based Bitstamp exchange, not far from its six-week nadir of $10,162 touched the previous day. The session’s high was $11,794.07. \nIt led the fall in cryptocurrencies, although others such as Ethereum and Ripple, have also slid sharply this week after reports South Korea and China could ban trading, sparking worries of a wider regulatory crackdown. \n“Cryptocurrencies could be capped in the current quarter ahead of G20 meeting in March, where policymakers could discuss tighter regulations,” said Shuhei Fujise, chief analyst at Alt Design. \nAt its lows on Tuesday, Bitcoin had fallen 25 percent in the session, its biggest daily decline in four months. It was a far cry from its peak close to $20,000 in December, when the virtual currency had risen nearly 2000 percent over the year. \nTuesday’s decline followed reports that South Korea’s finance minister had said banning trading in cryptocurrencies was still an option and that the government plans a set of measures to clamp down on the “irrational” cryptocurrency investment craze. \nSeparately, a senior Chinese central banker said authorities should ban centralised trading of virtual currencies as well as individuals and businesses that provide related services. \n“Bitcoin is deciding whether this is the moment to crash and burn,” said Steven Englander, head of strategy at New York-based Rafiki Capital. \n“My conjecture is that cryptocurrency holders are trying to decide whether to abandon Bitcoin because its limitations mean it will be superseded by better products or bet that it can thrive despite them.” \nBitcoin futures maturing on Wednesday on the Cboe Global Markets Inc’s Cboe Futures Exchange were at $10,740, with 1,586 contracts traded, after having opened at $10,850. The open interest was 2,895 contracts. The Cboe 14 March 2018 contract was quoted at $11,130. \nThe futures are cash-settled contracts based on the auction price of bitcoin in U.S. dollars on the Gemini Exchange, which is owned and operated by virtual currency entrepreneurs Cameron and Tyler Winklevoss. \nThe MVIS CryptoCompare Ripple Index, which covers the performance of a digital assets portfolio which invests in Ripple (XRP), a cryptocurrency developed by Ripple Labs, dropped 15 percent to $7,298 on Wednesday. \nThat equity index has seen a 66 percent slide in its value since the start of the year. Ripple itself was quoted at $1.15 on website CoinMarketCap, down from a high of $3.81 on Jan 4. \n“The run-up in Bitcoin created a mystique of one-way trading which is being shaken but the pricing requires faith that there will always be demand,” Englander wrote. \n“This is far from guaranteed given the existence of alternatives with better characteristics.” Reporting by Hideyuki Sano in TOKYO; Writing by Vidya Ranganathan; Editing by Shri Navaratnam", "external_links": [], "published": "2018-01-17T07:15:00.000+02:00", "crawled": "2018-01-17T07:40:01.001+02:00", "highlightTitle": ""}