{"organizations": [], "uuid": "e7ecb20b67840e2434d0dba146e020ac2cacf20f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 97}, "facebook": {"likes": 23, "shares": 23, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XC942_cmo_pr_SOC_20180123051946.jpg", "site_section": "https://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/wpp-consolidates-five-branding-agencies-into-superunion-1516707001", "country": "US", "domain_rank": 387, "title": "WPP Consolidates Five Branding Agencies Into ‘Superunion’", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T14:30:00.000+02:00", "replies_count": 0, "uuid": "e7ecb20b67840e2434d0dba146e020ac2cacf20f"}, "author": "Lara O’Reilly", "url": "https://www.wsj.com/articles/wpp-consolidates-five-branding-agencies-into-superunion-1516707001", "ord_in_thread": 0, "title": "WPP Consolidates Five Branding Agencies Into ‘Superunion’", "locations": [], "entities": {"persons": [{"name": "addison", "sentiment": "none"}, {"name": "jim prior", "sentiment": "none"}, {"name": "lambie-nairn", "sentiment": "none"}, {"name": "deloitte", "sentiment": "none"}], "locations": [], "organizations": [{"name": "wpp", "sentiment": "negative"}, {"name": "wpp consolidates five branding agencies into ‘superunion", "sentiment": "neutral"}, {"name": "vodafone", "sentiment": "none"}, {"name": "brand union", "sentiment": "none"}, {"name": "superunion global", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}, {"name": "british airways", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Advertising holding company WPP has consolidated five of its branding agencies into one, under the new banner of Superunion, a move designed to help better cater to global clients’ needs and one that will also reduce costs.\nThe new group, initially announced in September, brings together 750 staffers across WPP’s current brand agencies Brand Union, The Partners, Lambie-Nairn, Addison and VBAT.\nSuperunion’s agencies generated a combined $100 million in global billings in 2017, single-digit percentage growth from the previous year, Superunion Global CEO Jim Prior said. The merger will result in some cost savings in areas such as property, but headcount will not be reduced, he added. The agency’s clients include Ford, Vodafone, Deloitte and British Airways.\nAdvertising holding companies built their businesses over the years by acquiring different specialists with their own individual ways of working and separate finances. Now there has been a move across the industry to align the different agencies closer together to streamline those complex structures and allow clients better access to talent and resources across their various groups.\nWPP executives often refer to its approach as “horizontality.” Last year alone the company combined its media agencies Maxus and MEC to form Wavemaker , moved its digital agency Possible into its customer-relationship marketing business Wunderman , and created WPP Health & Wellness out of its four large healthcare agencies.\nOutside WPP, rival Publicis Groupe has an integration strategy called the “Power of One,” and two years ago it restructured its entire organization into four solutions hubs . Also in 2016, Omnicom Media Group launched a media agency network called Hearts & Science .\nSuperunion is WPP's new branding agency network Photo: Superunion Many of the agencies Superunion is combining originated in the U.K., where its business is the largest of the 18 countries in which it operates. But Mr. Prior said “it will be hard to ignore us in the U.S. now” that the company is bigger.\nThe Superunion name is designed to reflect collaboration but also ambition. “You can’t be called Superunion and be average,” Mr. Prior said.\nThe structure will be similar to that of a management consultancy where most teams will be organized around client assignments, rather than by function. All senior management at the five legacy agencies have roles in the new organization, Mr. Prior said.\nCMO Today Newsletter Get your daily dose of media and advertising news with WSJ’s CMO Today newsletter. Sign up here .\nTraditional management consultancies have made big moves on the advertising space in recent years, acquiring creative and design firms to broaden their offer to marketers.\nMr. Prior said management consultancies have different skills that are complementary to those at Superunion, rather than competitive.\n“There’s a lot more humanity, naturally in what we do,” Mr. Prior said. “We are instinct-driven and people-driven; we are not process-driven.”\nSuperunion will still face the same headwinds as other areas of the advertising business. Marketers at previously big-spending consumers-goods firms have been tightening their outlay on external agencies, a factor that contributed to WPP cutting its annual sales forecast for the third time in its financial year last October.\nBrian Wieser, senior analyst at Pivotal Research, says while branding consultancies have very specialized expertise and can hold their own or even outperform management consultancies in the quality of work they do, he added “much of the competition they face is from marketers who do this work in-house rather than with external advisors.”\nWrite to Lara O’Reilly at lara.oreilly@wsj.com", "external_links": ["https://www.campaignlive.co.uk/article/wpp-unveils-wavemaker-name-merged-mec-maxus-agency/1443769", "http://www.thedrum.com/news/2017/02/06/wpp-launches-health-and-wellness-unit"], "published": "2018-01-23T14:30:00.000+02:00", "crawled": "2018-01-23T19:19:09.008+02:00", "highlightTitle": ""}