{"organizations": [], "uuid": "28f5bc79e7ad73d5e019dddf716c6570ca56a86b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/31/104979418-Screen-Shot-2018-01-31-at-9.52.12-AM.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/31/new-york-times-digital-uberas-new-training-wheels-testing-bike-sharing-in-san-francisco.html", "country": "US", "domain_rank": 767, "title": "Uber bike sharing to launch in San Francisco", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T16:55:00.000+02:00", "replies_count": 0, "uuid": "28f5bc79e7ad73d5e019dddf716c6570ca56a86b"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/31/new-york-times-digital-uberas-new-training-wheels-testing-bike-sharing-in-san-francisco.html", "ord_in_thread": 0, "title": "Uber bike sharing to launch in San Francisco", "locations": [], "entities": {"persons": [{"name": "andrew salzberg", "sentiment": "none"}, {"name": "berkshire hathaway", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "uber-waymo trial tests silicon valley culture amazon", "sentiment": "none"}, {"name": "jpmorgan team up to disrupt health care kodak", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "It’s Uber, but for bicycles.\nFor the first time in Uber’s history, the company is offering rides on something other than cars. Starting next week, it will let certain users in San Francisco reserve pedal-assist electric bicycles through its app. The idea is that people will see the bicycles as a cheaper and faster alternative — not a huge stretch of the imagination for anyone who has been stuck in Friday evening gridlock traffic in San Francisco.\nUber is not supplying its own bicycles. It is working with Jump Bikes, a bike-sharing service that secured a permit in January to put 250 motorized bicycles — making it easier to tackle San Francisco’s steep hills — in locations throughout the city.\n“We’re excited about the future of bike sharing in the Uber app, and this is the first step,” said Andrew Salzberg, Uber’s head of transportation policy and research.\nMore from The New York Times:\nSecrets or Knowledge? Uber-Waymo Trial Tests Silicon Valley Culture Amazon, Berkshire Hathaway and JPMorgan Team Up to Disrupt Health Care Kodak's Dubious Cryptocurrency Gamble The pilot program is the latest indication of Uber’s ambitions to move beyond its ride-hailing origins. It is also working on autonomous trucking services, while aggressively expanding into the fast-growing food delivery market with Uber Eats.\nUber said it saw the bicycles as yet another option for riders — alongside car-pooling and rides on the less expensive Uber X or the pricier Uber Black. The company declined to detail whether the San Francisco test was a prelude to a bike-sharing service in other locations.\nUnlike the rows of Ford GoBikes available around the Bay Area or Citi Bikes in New York City, which have designated pickup and drop-off locations, Jump bikes are left on the sidewalk — attached to a public bike rack or (hopefully) out of the way of pedestrians — once riders reach their destination. That’s convenient, but cities like Dallas are grappling with how to deal with bikes left wherever riders feel like abandoning them.\nUber said its app would present selected users with a “bike” option in a drop-down menu. From there, the customer could reserve a bicycle and be charged $2 for 30 minutes and then a per-minute fee after that.\nUber will target people who often travel within the areas of the city where the bikes are available, while allowing other customers to join a wait list for the service, the company said. With 250 bikes, Uber said, it expects to serve “thousands” of people, but it declined to get more specific.", "external_links": [], "published": "2018-01-31T16:55:00.000+02:00", "crawled": "2018-01-31T17:28:21.008+02:00", "highlightTitle": ""}