{"organizations": [], "uuid": "2245fcc2e61b0efca4bed6de45bece34991abea9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 245, "shares": 245, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225614122&w=1200&r=LYNXMPEE0P1D8", "site_section": "http://feeds.reuters.com/Reuters/domesticNews\r", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-kentucky-shooting/kentucky-school-shooting-suspect-did-not-target-victims-local-prosecutor-idUSKBN1FF2WM", "country": "US", "domain_rank": 408, "title": "Kentucky school shooting suspect did not target victims: local prosecutor", "performance_score": 2, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T00:26:00.000+02:00", "replies_count": 0, "uuid": "2245fcc2e61b0efca4bed6de45bece34991abea9"}, "author": "", "url": "https://www.reuters.com/article/us-kentucky-shooting/kentucky-school-shooting-suspect-did-not-target-victims-local-prosecutor-idUSKBN1FF2WM", "ord_in_thread": 0, "title": "Kentucky school shooting suspect did not target victims: local prosecutor", "locations": [], "entities": {"persons": [{"name": "blankenship", "sentiment": "none"}, {"name": "suzannah gonzales", "sentiment": "none"}, {"name": "mark blankenship", "sentiment": "none"}], "locations": [{"name": "kentucky", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}, {"name": "benton", "sentiment": "none"}, {"name": "nashville", "sentiment": "none"}], "organizations": [{"name": "commonwealth", "sentiment": "none"}, {"name": "marshall county high school", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - The teenaged boy who opened fire in a Kentucky high school this week, killing two students and wounding many others, appeared not to have targeted his victims and shot at random, a local prosecutor said on Friday.\nThree security cameras captured the Tuesday morning incident in Marshall County High School’s common area, Commonwealth’s Attorney Mark Blankenship told Reuters in an email on Friday.\n“The video clearly shows what happened,” Blankenship said. “We have no information to indicate that he had any particular target in mind.”\nAuthorities have not yet released the name of the 15-year-old suspect in the attack in Benton, Kentucky, about 120 miles (190 km) northwest of Nashville, Tennessee. Officials also declined to say where the boy is being held or when he is next due in court.\n“This community is so devastated over this,” Blankenship said in a separate phone interview with Reuters on Thursday evening. “There might be someone who would hurt him if they could get to him.”\nThe incident was the latest outbreak of gun violence in a nation where school shootings have become not uncommon.\nFILE PHOTO: Police investigators are seen at the scene of a shooting at Marshall County High School in Benton, Kentucky, U.S., January 23, 2018. REUTERS/Harrison McClary/File Photo The parents of the suspect as well as the parents of the two victims who were fatally shot attended a closed detention hearing on Wednesday, said Blankenship, who observed the proceeding.\n“They seemed to be suffering as bad as the parents of the victims,” Blankenship said. The judge ordered participants not to discuss details of the hearing, Blankenship added.\nThe wounded comprised five female and 13 male students, all 14 to 18 years old, authorities have said.\nBlankenship said he will prosecute the case and seek the stiffest penalty possible if the boy is charged as an adult, though another prosecutor will handle the case if the suspect is charged as a juvenile.\n“This is just as bad as it gets,” Blankenship said. “I don’t know how we couldn’t treat that with the most serious consequences.”\nThe boy faces two counts of murder and at least 12 counts of first-degree assault, Blankenship said. Each murder count carries a punishment of 20 years to life in prison, he said. Each count of assault in the first degree carries 10 to 20 years.\nReporting by Suzannah Gonzales in Chicago; Editing by Scott Malone and Matthew Lewis\n ", "external_links": [], "published": "2018-01-27T00:26:00.000+02:00", "crawled": "2018-01-27T00:37:00.014+02:00", "highlightTitle": ""}