{"organizations": [], "uuid": "74802fe57c6994737c935bebc4ad01a1274b41ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-aspen-reitas-initial-public-offering-is-qualified-by-sec.html", "country": "US", "domain_rank": 767, "title": "Aspen REIT’s Initial Public Offering is Qualified by SEC", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:00:00.000+02:00", "replies_count": 0, "uuid": "74802fe57c6994737c935bebc4ad01a1274b41ed"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-aspen-reitas-initial-public-offering-is-qualified-by-sec.html", "ord_in_thread": 0, "title": "Aspen REIT’s Initial Public Offering is Qualified by SEC", "locations": [], "entities": {"persons": [], "locations": [{"name": "st. regis aspen resort", "sentiment": "none"}, {"name": "aspen", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "aspen resort", "sentiment": "none"}], "organizations": [{"name": "sec", "sentiment": "negative"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "ipo", "sentiment": "none"}, {"name": "ajax", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Investors can now subscribe for shares in the renowned St. Regis Aspen Resort by visiting www.m-vest.com/aspenreit\nNEW YORK--(BUSINESS WIRE)-- Aspen REIT, Inc. ( “Aspen REIT”), a recently-formed, single-asset real estate investment trust (“REIT”), today announced that its offering statement on Form 1-A filed with the Securities and Exchange Commission (“SEC”) in connection with its planned $33.5 million Regulation A+ initial public offering (the “IPO”) has been qualified by the SEC. Aspen REIT is offering 1,675,000 shares at $20.00 per share in the IPO. Aspen REIT has applied to list its common stock on the NYSE American stock exchange under the ticker symbol “AJAX.”\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180124005593/en/\nSt. Regis Aspen Resort in Aspen, Colorado (Photo: Business Wire)\nUpon closing of the IPO, Aspen REIT will be the first single-asset REIT to list on a national securities exchange in the United States. Aspen REIT intends to use substantially all of the net proceeds from the IPO, together with equity in Aspen REIT’s subsidiary operating partnership, to acquire the renowned St. Regis Aspen Resort in Aspen, Colorado (the “St. Regis Aspen”).\nInvestors may subscribe for shares of common stock of Aspen REIT in the IPO or indicate an interest in subscribing for shares at www.m-vest.com/aspenreit .\nMaxim Group LLC is the lead managing selling agent for the offering.\n“Today, any investor can subscribe to become a part owner in the St. Regis Aspen Resort, one of the world’s finest luxury hotels,” said Stephane De Baets, Chief Executive Officer, President and Chairman of Aspen REIT. “Through this first-of-its-kind offering in the United States, we are leveling the playing field for all investors, creating equal opportunity to participate in the upside associated with a first-class resort destination supported by strong fundamentals, an experienced leadership team and a world-class property manager.”\nIndividuals interested in investing and learning more about Aspen REIT and the IPO can register an indication of interest or subscribe for shares by visiting www.m-vest.com/aspenreit , or by calling (800) 645-9144. For additional information on Aspen REIT, the IPO and any other related topics, please review the Form 1-A offering circular that can be found at: www.m-vest.com/aspenreit .\nAbout Aspen REIT\nAspen REIT, Inc. is a recently-formed company that intends to own the St. Regis Aspen Resort, a full-service, 179-room luxury hotel with four onsite food and beverage outlets and 29,000 square feet of indoor and outdoor conference and banquet venues with views of the Rocky Mountains. The St. Regis Aspen is managed by a subsidiary of Marriott International Inc. The St. Regis Aspen is located in the famous resort town of Aspen, Colorado, home of year-round events such as The World Cup ski races, The ESPN Winter X Games, The Food & Wine Classic, and The Aspen Music Festival. Aspen REIT intends to be the first single-asset REIT to list on a national exchange and is externally managed by a majority-owned subsidiary of Elevated Returns LLC, a New York-based real estate asset management and advisory firm.\nCautionary Note Regarding Forward-Looking Statements\nThis press release may include “forward-looking statements.” To the extent that the information presented in this press release discusses financial projections, information, or expectations about the potential closing of the IPO, our business plans, results of operations, the St. Regis Aspen or the Aspen resort market, or otherwise makes statements about future events, such statements are forward-looking. Such forward-looking statements can be identified by the use of words such as “should,” “may,” “intends,” “anticipates,” “believes,” “estimates,” “projects,” “forecasts,” “expects,” “plans,” and “proposes.” Although we believe that the expectations reflected in these forward-looking statements are based on reasonable assumptions, there are a number of risks and uncertainties that could cause actual results to differ materially from such forward-looking statements. You are urged to carefully review and consider any cautionary statements and other disclosures, including the statements made under the heading \"Risk Factors\" and elsewhere in the offering statement that we will file with the SEC. Forward-looking statements speak only as of the date of the document in which they are contained, and Aspen REIT, Inc. does not undertake any duty to update any forward-looking statements except as may be required by law.\nLegal Disclaimer\nThe offering will be made only by means of an offering circular. An offering statement on Form 1-A relating to these securities has been filed with the Securities and Exchange Commission and become qualified on January 23, 2018. The securities offered by Aspen REIT are highly speculative. Investing in shares of Aspen REIT involves significant risks. The investment is suitable only for persons who can afford to lose their entire investment. No public market currently exists for the securities, and if a public market develops following the offering, it may not continue. Aspen REIT intends to list its securities on a national exchange and doing so entails significant ongoing corporate obligations including but not limited to disclosure, filing and notification requirements, as well as compliance with applicable continued quantitative and qualitative listing standards. Prior to any investment in Aspen REIT’s common stock, you should review a copy of the Form 1-A offering circular by clicking on the following link, https://www.sec.gov/Archives/edgar/data/1694997/000110465918003656/a17-17001_5253g1.htm , or by contacting Maxim Group LLC, by phone at 1-800-645-9144 or by visiting www.m-vest.com/aspenreit .\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124005593/en/\nLead Selling Agent:\nMaxim Group LLC\nJoseph Rallo, (800) 537-6923\njrallo@maximgrp.com\nor\nVera Carbone, (800) 537-6923\nvcarbone@maximgrp.com\nor\nMedia:\nICR\nJason Chudoba, 646-277-1249\nJason.Chudoba@icrinc.com\nor\nMatthew Chudoba, 203-682-8217\nMatthew.Chudoba@icrinc.com\nSource: Aspen REIT, Inc.", "external_links": ["https://www.sec.gov/Archives/edgar/data/1694997/000110465918003656/a17-17001_5253g1.htm", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fbit.ly%2Fm-vest-aspenreit&esheet=51747866&newsitemid=20180124005593&lan=en-US&anchor=www.m-vest.com%2Faspenreit&index=2&md5=2b08956529317590069874253def5a27", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fbit.ly%2Fm-vest-aspenreit&esheet=51747866&newsitemid=20180124005593&lan=en-US&anchor=www.m-vest.com%2Faspenreit&index=4&md5=22a0fd12112b00e08e24c3d1bf0de2de", "http://www.businesswire.com/news/home/20180124005593/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.sec.gov%2FArchives%2Fedgar%2Fdata%2F1694997%2F000110465918003656%2Fa17-17001_5253g1.htm&esheet=51747866&newsitemid=20180124005593&lan=en-US&anchor=https%3A%2F%2Fwww.sec.gov%2FArchives%2Fedgar%2Fdata%2F1694997%2F000110465918003656%2Fa17-17001_5253g1.htm&index=5&md5=22ee633e58df1f79c4995f4298a3e4f7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fbit.ly%2Fm-vest-aspenreit&esheet=51747866&lan=en-US&anchor=www.m-vest.com%2Faspenreit&index=1&md5=bdd8fbfaaaf26fb779a815856d1080b5", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fbit.ly%2Fm-vest-aspenreit&esheet=51747866&newsitemid=20180124005593&lan=en-US&anchor=www.m-vest.com%2Faspenreit&index=3&md5=a1fa5f75ce7b89a7d49f57c871441cf7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fbit.ly%2Fm-vest-aspenreit&esheet=51747866&newsitemid=20180124005593&lan=en-US&anchor=www.m-vest.com%2Faspenreit&index=6&md5=a4d8050d05644957d5d4d7d7429ecb85"], "published": "2018-01-24T16:00:00.000+02:00", "crawled": "2018-01-24T17:31:28.023+02:00", "highlightTitle": ""}