{"organizations": [], "uuid": "95f8a0b9d0c372950b0c968edf5e7e2b8c605a52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-aslan-pharmaceuticals-acquires-full-global-commercial-rights-for-varlitinib-from-array-biopharma.html", "country": "US", "domain_rank": 767, "title": "ASLAN Pharmaceuticals Acquires Full Global Commercial Rights for Varlitinib From Array BioPharma", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-03T11:00:00.000+02:00", "replies_count": 0, "uuid": "95f8a0b9d0c372950b0c968edf5e7e2b8c605a52"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-aslan-pharmaceuticals-acquires-full-global-commercial-rights-for-varlitinib-from-array-biopharma.html", "ord_in_thread": 0, "title": "ASLAN Pharmaceuticals Acquires Full Global Commercial Rights for Varlitinib From Array BioPharma", "locations": [], "entities": {"persons": [{"name": "carl firth", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "aslan pharmaceuticals", "sentiment": "negative"}, {"name": "aslan", "sentiment": "negative"}, {"name": "array biopharma inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SINGAPORE, Jan. 03, 2018 (GLOBE NEWSWIRE) -- ASLAN Pharmaceuticals (ASLAN, 6497.TT), a clinical-stage biopharmaceutical company targeting cancers that are both highly prevalent in Asia and orphan indications in the United States and Europe, today announced that Array BioPharma Inc (Array) has granted ASLAN full global rights to develop, manufacture and commercialise varlitinib . The new licensing agreement replaces the prior licensing agreement signed in 2011 to develop and sublicense varlitinib, which did not grant commercial rights to ASLAN.\nDr Carl Firth, Chief Executive Officer of ASLAN Pharmaceuticals, said: “ Acquiring full global commercial rights to varlitinib is a significant positive move for ASLAN. Varlitinib has demonstrated strong efficacy in the studies that we have conducted since signing the original licensing agreement with Array, in biliary tract, gastric, breast and colorectal cancer. Based on this data, we want to take the drug to market and commercialise it ourselves in certain geographies, which was not contemplated under the original agreement. The new agreement allows us to retain much more downstream value from our own commercial and future partnering activities.”\nUnder the terms of the original agreement signed on 12 July 2011, ASLAN was responsible for the development of varlitinib through to proof-of-concept and the identification of a partner to complete phase 3 development and commercialisation. Array was eligible to receive 50% of all varlitinib revenues, including proceeds from outlicensing agreements.\nThe terms of the new agreement grant ASLAN exclusive global rights to commercialise and sublicense varlitinib . ASLAN will make an upfront payment of US$12 million to Array on signature and a further payment of up to US$12 million within the next twelve months, together with up to US$30 million of development and US$75 million of commercial milestones, as well as tiered low double-digit royalties as a percentage of net sales of varlitinib .\nMedia and IR contacts\nChris Fang\nASLAN Pharmaceuticals\nTel: +886 2 2758 3333\nE-mail: media@aslanpharma.com Emma Thompson / Stephanie Tan\nSpurwing Communications\nTel: +65 6340 7287\nEmail: ASLAN@spurwingcomms.com\nRobert H. Uhl\nWestwicke Partners\nTel: +1 858 356 5932\nEmail: robert.uhl@westwicke.com\nAbout varlitinib (ASLAN001)\nVarlitinib (ASLAN001) is a highly potent, oral, reversible, small molecule pan-HER inhibitor that targets the human epidermal growth factor receptors HER1, HER2, HER3 and HER4. These receptors can be mutated or overexpressed in many tumors, which can cause excessive proliferative activity and uncontrolled growth. Therefore, by inhibiting the activation of the HER receptors, varlitinib could inhibit proliferation and control tumor growth. Varlitinib is currently being studied in gastric, biliary tract, breast and colorectal cancers. Varlitinib has been granted orphan drug designation in the United States for gastric cancer and cholangiocarcinoma, a sub-type of biliary tract cancer, and was awarded orphan drug designation for the treatment of biliary tract cancer by the Ministry of Food and Drug Safety in South Korea.\nAbout ASLAN Pharmaceuticals\nASLAN Pharmaceuticals (ASLAN, 6497.TT) is a clinical-stage oncology-focused biopharmaceutical company developing novel therapeutics for global markets. ASLAN targets diseases that are both highly prevalent in Asia and orphan indications in the United States and Europe. Led by a senior management team with extensive experience in global and regional development and commercialization, ASLAN is headquartered in Singapore and has offices in Taiwan and China. ASLAN’s portfolio is comprised of four product candidates which target validated growth pathways applied to new patient segments, novel immune checkpoints and novel cancer metabolic pathways. ASLAN’s partners include Array BioPharma, Bristol-Myers Squibb, Almirall and CSL. For additional information please visit www.aslanpharma.com .\nCautionary statement\nAll materials and information set out herein are for reference only and whilst we make every effort to ensure accuracy and completeness, we cannot guarantee this. We make no recommendation as to the competence or suitability of persons or entities referenced herein (if any). Nothing herein constitutes an invitation or offer to invest in or deal in the securities of ASLAN. Anyone considering investment in ASLAN should refer to the information officially published the Taiwan Stock Exchange Market Observation System (MOPS). This press release contains including, but not limited to, the commercialisation of varlitinib . Statements including words such as “plan,” “anticipate,” or “expect” and statements in the future tense are All attributable to us or any person acting on our behalf are expressly qualified in their entirety by this cautionary statement. Readers are cautioned not to place undue reliance on such , which are inherently unreliable, and you should not rely on them. Any such forward-looking statement will have been based on ASLAN’s expectations, assumptions, estimates and projections about future events on the date(s) made. Actual outcomes are subject to numerous risks and uncertainties, many of which relate to factors beyond ASLAN’s control, that could cause them to differ expressed in a forward-looking statement. ASLAN has no obligation to update or otherwise revise any to reflect the occurrence of unanticipated events or for any other reason.\nSource:ASLAN Pharmaceuticals", "external_links": [], "published": "2018-01-03T11:00:00.000+02:00", "crawled": "2018-01-03T12:07:34.013+02:00", "highlightTitle": ""}