{"organizations": [], "uuid": "9813bb3e3329dbbef655372b55f4d057c5c31f5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 27, "shares": 27, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/domesticNews/", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-weather/thousands-in-california-flee-homes-ahead-of-possible-mudslides-idUSKBN1EY0OO", "country": "US", "domain_rank": 408, "title": "Thousands in California flee homes ahead of possible mudslides", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T09:54:00.000+02:00", "replies_count": 0, "uuid": "9813bb3e3329dbbef655372b55f4d057c5c31f5a"}, "author": "", "url": "https://www.reuters.com/article/us-usa-weather/thousands-in-california-flee-homes-ahead-of-possible-mudslides-idUSKBN1EY0OO", "ord_in_thread": 0, "title": "Thousands in California flee homes ahead of possible mudslides", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES (Reuters) - At least six people died and thousands fled their homes in Southern California on Tuesday as a powerful rainstorm triggered flash floods and mudslides on slopes where a series of intense wildfires had burned off protective vegetation last month.\nThe heavy downpours subsided early Tuesday after prompting evacuation orders for residents along the Pacific Coast north of Los Angeles, but forecasters warned of more rain throughout the day. Rainfall totals ranged from 2 inches to 4-1/2 inches (5 to 11 cm) in the area, said the National Weather Service.\nAt least six people died in the storm and mudslides in Santa Barbara County, the hardest-hit county in the region, incident command spokeswoman Amber Anderson said in a telephone interview. She did not specify the cause of the fatalities, but said they occurred in several locations in Santa Barbara where there were mudslides.\nThe threat of mudslides prompted the county to order 7,000 residents to leave their homes before the rains came and to urge 23,000 others to evacuate voluntarily.\nThe county set up an evacuation shelter at Santa Barbara City College, and also gave residents a place to take their animals. The weather in Southern California was mild this week, so residents who fled their homes did not have to endure the cold snap that has gripped the U.S. Midwest and East Coast in recent weeks.\nA neighborhood in the upscale community of Montecito, where mudslides ravaged homes near the city of Santa Barbara, residents had not been put under mandatory evacuation orders before mud from a creek cascaded toward their homes, Anderson said.\nBoulders block a road after a mudslide in Montecito, California, U.S. in this photo provided by the Santa Barbara County Fire Department, January 9, 2018. Mike Eliason/Santa Barbara County Fire Department/Handout via REUTERS But she could not immediately say whether any of the fatalities were in the area that was not evacuated.\nAn unknown number of people in the county were unaccounted for, Anderson said, and 25 residents have been injured.\nSlideshow (20 Images) Photos posted by the local fire department showed a teenager covered in black mud being led away from the rubble of a house that had been destroyed by the Montecito mudslide. She had been trapped in the home for hours before rescuers came to her aid, the Santa Barbara County Fire Department said on Twitter.\nOther pictures showed ankle-deep mud, logs and boulders in residential areas.\nEmergency workers, using search dogs and helicopters, have rescued dozens of people stranded in rubble, Anderson said.\nLast month’s wildfires, the largest in California history, left the area vulnerable to mudslides. The fires burned away grass and shrubs that hold the soil in place, and also baked a waxy layer into the earth which prevents water from sinking deeply into the ground.\nThe overnight rains forced road closures, including a 30-mile (48-km) stretch of U.S. Highway 101, essentially cutting off traffic between Santa Barbara and Ventura counties northwest of Los Angeles. Ventura County escaped with little damage, the county sheriff’s office said.\nAdditional reporting by Peter Szekely in New York and Brendan O'Brien in Milwaukee; editing by Jeffrey Benkoe and Jonathan Oatis\n ", "external_links": [], "published": "2018-01-09T09:54:00.000+02:00", "crawled": "2018-01-09T10:04:49.014+02:00", "highlightTitle": ""}