{"organizations": [], "uuid": "a6b061615423db1b59734c9b725f7dbb5b42a176", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-metals/metals-zinc-touches-new-decade-peak-on-tight-market-idUSL4N1P73DS", "country": "US", "domain_rank": 408, "title": "METALS-Zinc touches new decade peak on tight market", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T17:20:00.000+02:00", "replies_count": 0, "uuid": "a6b061615423db1b59734c9b725f7dbb5b42a176"}, "author": "", "url": "https://www.reuters.com/article/global-metals/metals-zinc-touches-new-decade-peak-on-tight-market-idUSL4N1P73DS", "ord_in_thread": 0, "title": "METALS-Zinc touches new decade peak on tight market", "locations": [], "entities": {"persons": [{"name": "eric onstad", "sentiment": "none"}, {"name": "xiao fu", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuter", "sentiment": "neutral"}, {"name": "london metal exchange", "sentiment": "none"}, {"name": "lme", "sentiment": "none"}, {"name": "bank of china international", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 3:21 PM / Updated 4 minutes ago METALS-Zinc touches new decade peak on tight market Reuters Staff \n* LME/ShFE arb: bit.ly/2wZSAEz (Updates with closing prices) \nBy Eric Onstad \nLONDON, Jan 12 (Reuters) - Zinc prices edged up to their highest in more than a decade on Friday, supported by potential shortages and low inventories, but some investors voiced concern about the lofty levels. \nBenchmark zinc on the London Metal Exchange climbed to $3,409 a tonne, the strongest since August 2007, before paring gains by the close to $3,383.50, up 0.1 percent. \nZinc has rallied 11 percent since early December and was the top gainer among LME metals last year, surging 32 percent. \n“Global exchange inventories have declined to about six to seven days of global consumption, so stocks are tight, and China’s environmental checks will continue, so that will limit supply growth domestically,” said Xiao Fu, head of commodity market strategy at Bank of China International in London. \n“Fundamentally it’s tight, but people are getting worried at these high price levels. Funds are probably a bit reluctant to chase the rally from here. We think there’s moderate upside, we’re cautiously bullish.” \nLME inventories MZNSTX-TOTAL have tumbled 58 percent over the past 12 months to 180,150 tonnes after closures and suspensions of big mines in recent years. \n* COPPER - LME three-month copper dipped 0.4 percent to finish at $7,109 a tonne, pressured slightly by Chinese data. \n* CHINA TRADE DATA - China’s unwrought copper imports fell 4.3 percent in December from a month earlier, but still recorded their second-highest level in 2017. \n* ALUMINIUM - LME aluminium was the best performer on the exchange, rising 1.8 percent to end at $2,214 a tonne, shrugging off news of higher Chinese exports. \n* CHINA ALUMINIUM EXPORTS: China’s exports of unwrought aluminium and aluminium products rose for a second straight month in December, by 15.8 percent from November. \n* ALCOA - Aluminum producer Alcoa Corp locked out union workers at its smelter in Quebec as an old contract expired at midnight and talks on a new agreement failed. \n“This smelter is a key supplier into the North American market, and U.S. Midwest transaction premiums have already moved above 10c/lb,” Colin Hamilton at BMO Capital Markets said in a note. \n* NICKEL - LME nickel recovered from a sell-off in the previous session to close 0.8 percent firmer at $12,725 a tonne. \nMunro said nickel was the second-biggest long of the LME complex based on Marex estimates. There also was evidence that Chinese investors were seeking to sell into the recent rally, he added. \n* DOLLAR - Base metals got support from a weaker dollar , making commodities priced in the greenback cheaper for buyers using other currencies. \n* PRICES - Lead, untraded at the close, was bid down 0.6 percent at $2,535, and tin rose 0.3 percent to finish trading at $20,275. Additional reporting by James Regan in Sydney; Editing by Dale Hudson and David Evans", "external_links": [], "published": "2018-01-12T17:20:00.000+02:00", "crawled": "2018-01-12T17:37:44.067+02:00", "highlightTitle": ""}