{"organizations": [], "uuid": "411bf3fde2dd469b4a41ea3784f2b63c8afd535b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104959847-Bozoma_Saint_John.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/23/bozoma-saint-john-learned-this-key-lesson-from-arianna-huffington.html", "country": "US", "domain_rank": 767, "title": "Bozoma Saint John learned this key lesson from Arianna Huffington", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.65, "site_type": "news", "published": "2018-01-24T16:30:00.000+02:00", "replies_count": 0, "uuid": "411bf3fde2dd469b4a41ea3784f2b63c8afd535b"}, "author": "Courtney Connley", "url": "https://www.cnbc.com/2018/01/23/bozoma-saint-john-learned-this-key-lesson-from-arianna-huffington.html", "ord_in_thread": 0, "title": "Bozoma Saint John learned this key lesson from Arianna Huffington", "locations": [], "entities": {"persons": [{"name": "bozoma saint john", "sentiment": "negative"}, {"name": "john", "sentiment": "negative"}, {"name": "arianna huffington", "sentiment": "negative"}, {"name": "tim ferriss", "sentiment": "none"}], "locations": [{"name": "the town hall", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "ghana", "sentiment": "none"}], "organizations": [{"name": "uber", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Photo courtesy of Getty SHARES \nAs the first-ever chief brand officer for Uber, Bozoma Saint John credits much of her success to the powerful influence of mentors. \nOn a recent podcast with author and entrepreneur Tim Ferriss, the Ghana native says that \"mentors are like friendships\" and explains that not all mentorships are long-term relationships. \n\"Some of them are long-lasting,\" she says, \"but some of them are for a season and some of them are from far away.\" \nOne mentor who Saint John has recently grown close with is Uber board member Arianna Huffington, who she says has taught her the importance of being present in every conversation. Slaven Vlasic | Getty Images Entertainment | Getty Images Arianna Huffington speaks onstage during the \"THRIVE with Arianna Huffington\" panel at The Town Hall during 2016 Advertising Week New York on September 28, 2016 in New York City. \n\"When I'm in her presence and she is talking to me, I don't think that she is thinking about anything else, except for whatever we're talking about,\" the 41-year-old executive says. \nBeing more present is a lesson Saint John says she's applied to her professional life to help build deeper connections with the people she encounters. \n\"You know you have your phone where you're distracted and you're thinking about something else and you're going on and on,\" she says. \"But whether it's a work environment or casual environment I am trying to be more present so that I can hone in on what people are saying and how I'm responding to them.\" \nSaint John, who previously served as a marketing executive at Apple, also credits Huffington with helping her to secure her leadership role at the ride-hailing company. The two first connected at a dinner in Las Vegas in January 2017. After a conversation about the turbulence at Uber, Huffington put Saint John in touch with then-CEO Travis Kalanick. \n\"It turned into eight hours of conversation,\" Saint John said at 2017's TechCrunch Disrupt . \"And, in leaving that meeting, it felt like, okay, you know actually, I'm really interested in this. This is a really interesting challenge.\" \nRather than being scared away by the company's issues with sexual harassment, diversity and discrimination, Saint John tells Ferriss that she was motivated to be the person to contribute a solution. \n\"I don't want to sit on the sidelines and wait for somebody else to fix it, especially when it comes down to these more sensitive, and what can be catastrophic, challenges,\" she says. \"This is not necessarily about saving a brand. This is about saving an idea that I want our industry, I want my future and I want my daughter's future to be changed because of this moment.\" ", "external_links": ["https://tim.blog/2017/12/27/bozoma-saint-john-2/", "https://techcrunch.com/2017/09/20/bozoma-saint-john-says-uber-didnt-really-poach-her-from-apple/", "https://www.facebook.com/CNBCMakeIt/"], "published": "2018-01-24T16:30:00.000+02:00", "crawled": "2018-01-24T15:56:06.013+02:00", "highlightTitle": ""}