{"organizations": [], "uuid": "612b865870c6e518c1a6774d62993b24ea775758", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-markets-exporters/how-long-can-europes-exporter-stocks-defy-euro-strength-idUKKBN1FE29N", "country": "US", "domain_rank": 408, "title": "How long can Europe's exporter stocks defy euro strength?", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:50:00.000+02:00", "replies_count": 0, "uuid": "612b865870c6e518c1a6774d62993b24ea775758"}, "author": "", "url": "https://uk.reuters.com/article/uk-markets-exporters/how-long-can-europes-exporter-stocks-defy-euro-strength-idUKKBN1FE29N", "ord_in_thread": 0, "title": "How long can Europe's exporter stocks defy euro strength?", "locations": [], "entities": {"persons": [{"name": "remy cointreau", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "diageo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 3:34 PM / Updated 4 hours ago How long can Europe's exporter stocks defy euro strength? Kit Rees 4 Min Read \nLONDON (Reuters) - Shares of European exporter are slightly outperforming their domestically exposed peers despite a strengthening euro, according to a Reuters analysis, as an upswing in global growth is seen supporting all the region’s equities. \nEuropean fourth-quarter results, which get into full swing in the second half of next week, will test that apparent lack of concern over the strengthening regional currency. \nSome cracks may already be showing. Earlier this month, Remy Cointreau ( RCOP.PA ) warned of damage from a stronger euro. Diageo, ( DGE.L ) a big dollar earner in Britain, said on Thursday that a resurgent pound would cut into full-year sales. \nA basket of European stocks that get the bulk of their revenues from abroad gained more than domestically exposed stocks over the past 12 months despite the euro’s rise. The domestic earners basket rose 13 percent, the overseas earners up 16 percent. \nThe euro EUR= rose more than 14 percent against the dollar in 2017, but investors have focused on a robust macroeconomic backdrop in the euro zone and a recovery in earnings growth, which has helped push the Euro stoxx index .STOXXE to a decade high in 2018. \n“The better growth far outweighs the sensitivity to relatively minor moves higher for the euro against the dollar,” said Gautam Batra, head of investments at Mediolanum Asset Management. The euro’s three-year high was striking, he said, but the marginal move higher in the currency was not that big. \nEuro strength has been a concern flagged by brokers this year and last. The currency has also been a concern for European Central Bank President Mario Draghi, who warned on Thursday that the surge in the euro was a source of uncertainty. \nFor a graphic on European Domestic vs. Overseas Earners Price Performance, click reut.rs/2DxXjOB \nWhile the impact of the single currency’s rise is yet to be seen on company earnings, UBS equity strategists said that a stronger euro is not incompatible with an earnings recovery. \n“One of the reasons for the stronger euro has been the improved macro backdrop in Europe -- a boost for European earnings,” UBS strategists said in a note. \nUBS estimates that around half of Europe’s corporate sales exposure is to North America and the rest of the world. Continental Europe gets 44 percent and the UK 7 percent. \nUBS predicted that each 10 percent gain by the euro takes around 6 percent off earnings, similar to Deutsche Bank’s estimate of a hit of 5 percentage points to the STOXX 600 earnings per share for every 10 percent rise in the euro. \nCurrently, 12-month forward earnings growth stands at around 9 percent for the euro zone, according to Thomson Reuters data. \nSo while market participants continue to keep an eye on the currency, for now the global economic upswing is expected to overshadow currency moves. \n“If countries across the world, both emerging and developing, continue to grow at this pace, we should see Europe do quite well in terms of earnings trend because it is such a global index,” said Nandini Ramakrishnan, global market strategist at JPMorgan Asset Management. \nFor a graphic on IBES 12-month Fwd earnings growth, click reut.rs/2Dy7OSg Reporting by Kit Rees and Tom Pfeiffer, editing by Larry King", "external_links": [], "published": "2018-01-25T17:50:00.000+02:00", "crawled": "2018-01-25T18:04:51.013+02:00", "highlightTitle": ""}