{"organizations": [], "uuid": "91e2b9d53a84c90a72077303f396b2b599b58c9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/11/gettyimages-865807250.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/25/wilbur-ross-donald-trump-larry-nassar-ceo-daily-for-january-24-2018/", "country": "US", "domain_rank": 1196, "title": "Wilbur Ross, Trump Testimony, Nassar Sentence: CEO Daily for January 25, 2018 | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.182, "site_type": "news", "published": "2018-01-25T07:48:00.000+02:00", "replies_count": 0, "uuid": "91e2b9d53a84c90a72077303f396b2b599b58c9f"}, "author": "Alan Murray", "url": "http://fortune.com/2018/01/25/wilbur-ross-donald-trump-larry-nassar-ceo-daily-for-january-24-2018/", "ord_in_thread": 0, "title": "Wilbur Ross, Trump Testimony, Nassar Sentence: CEO Daily for January 25, 2018 | Fortune", "locations": [], "entities": {"persons": [{"name": "wilbur ross", "sentiment": "negative"}, {"name": "nassar", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "rosemarie aquilina", "sentiment": "none"}, {"name": "lou anna simon", "sentiment": "none"}, {"name": "andrew mccabe", "sentiment": "none"}, {"name": "robert mueller", "sentiment": "none"}, {"name": "lawrence nassar", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "trump testimony", "sentiment": "negative"}, {"name": "fortune top news  trump", "sentiment": "neutral"}, {"name": "michigan state university", "sentiment": "none"}, {"name": "politico  nassar", "sentiment": "none"}, {"name": "bbc  ecb qe quandary  european central bank", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Top News \nTrump Talks Testimony \nPresident Donald Trump is “looking forward” to testifying under oath to special counsel Robert Mueller in the latter’s Russian collusion probe. Trump also said he didn’t remember asking the FBI’s deputy director, Andrew McCabe, for whom he voted in the 2016 election. Politico \nNassar Sentenced \nFormer U.S. gymnastics team doctor Lawrence Nassar has been sentenced to between 40 and 175 years in prison, after pleading guilty to seven counts of criminal sexual misconduct. Judge Rosemarie Aquilina told the 54-year-old: “I just signed your death warrant.” Meanwhile, Michigan State University head Lou Anna Simon stepped down after being accused of helping Nassar cover up his crimes. BBC \nECB QE Quandary \nEuropean Central Bank officials are arguing over their next moves in the context of a strong Eurozone economy. Some officials want to head towards a wind-down of quantitative easing soon, in order to avoid an abrupt end to the strategy if the economy overheats. Others are more cautious. A decision will be made today. Wall Street Journal \nItalian Train Crash \nAt least three people died and scores were injured after a commuter train heading into Milan derailed this morning. The Trenord train was coming from Cremona, in eastern Lombardy. Bloomberg Around the Water Cooler \nNo Class Actions for Europe \nFacebook arch-nemesis Max Schrems has won a case at the EU’s top court that will allow him to sue the company in his native Austria over privacy violations. However, he failed to win the right to sue on behalf of thousands of other people—effectively ending his hopes of introducing class-action suits to the European stage. Fortune \nGerman Facebook Case \nMeanwhile, the German antitrust agency is floating the idea that Facebook could be banned from collecting and processing personal data from third-party websites, as a possible outcome of its probe into the company. “We are blazing a trail in this case,” cartel office chief Andreas Mundt said. Financial Times \nWhite House Drug Liaison Exits \nTaylor Weyeneth is stepping down as White House liaison to the Office of National Drug Control Policy, due to outrage over his appointment. The 24-year-old only graduated from college in May 2016, and his sole professional experience was working for the Trump campaign. Washington Post \nRussian Solidarity \nThe Russian government promotes strong antipathy to homosexuality and “gay propaganda,” and the Russian establishment has duly professed outrage over a homoerotic parody video made by air-transport cadets. However, citizens young and old have expressed solidarity with the young soldiers by making their own versions of the video. New Yorker SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-25T07:48:00.000+02:00", "crawled": "2018-01-25T18:01:38.007+02:00", "highlightTitle": ""}