{"organizations": [], "uuid": "bb31f67e214ca82fa8aed6bc112b1f999ceb9680", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/07/31/102883297-RTR4LX70.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/01/oil-marks-highest-january-opening-price--since-2014.html", "country": "US", "domain_rank": 767, "title": "Oil marks highest January opening price since 2014", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-02T03:39:00.000+02:00", "replies_count": 0, "uuid": "bb31f67e214ca82fa8aed6bc112b1f999ceb9680"}, "author": "Lucy Nicholson", "url": "https://www.cnbc.com/2018/01/01/oil-marks-highest-january-opening-price--since-2014.html", "ord_in_thread": 0, "title": "Oil marks highest January opening price since 2014", "locations": [], "entities": {"persons": [], "locations": [{"name": "north sea global", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "bakersfield", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "mins ago lucy nicholson | reuters", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oil prices eased on Tuesday after hitting mid-2015 highs in early trading, as major pipelines in Libya and the UK restarted and U.S production soared to the highest in more than four decades.\nIt was the first time since January 2014 that the two crude oil benchmarks opened the year above $60 per barrel, buoyed by large anti-government rallies in Iran and ongoing supply cuts led by OPEC and Russia.\nU.S. West Texas Intermediate (WTI) crude futures ended Tuesday's session down 5 cents at $60.37 a barrel. In early trading WTI hit $60.74, the highest since June 2015.\nBrent crude futures , the international benchmark, were at $66.49 a barrel, down 38 cents by 2:21 p.m. ET (1921 GMT). The session high of $67.29 was the highest since May 2015.\nshow chapters RBC: Geopolitics could play a big factor in oil's direction in 2018 6:42 AM ET Fri, 29 Dec 2017 | 01:17 The spread between U.S. crude and Brent hit the narrowest in nearly two weeks.\nThe 450,000 barrel per day (bpd) capacity Forties pipeline system in the North Sea returned to full operations on Dec. 30 after an unplanned shutdown.\nRepairs have been finished on a Libyan oil pipeline damaged in a suspected attack last week and production is restarting gradually, engineers said.\n\"The resolution of the North Sea pipeline issue is having the expected result that the Brent-WTI spread is narrowing today,\" David Thompson, executive vice-president at Powerhouse, an energy-specialized commodities broker in Washington.\nThompson added that traders have been returning to work from the holidays, boosting volumes.\n\"Despite the day's price weakness, both Brent and WTI remain in solid, long-term bullish trends — $58.95 is nearby support on WTI front-month futures and $65.60 is the corresponding support on front-month Brent futures,\" Thompson said.\nshow chapters Political protests in Iran leave at least 20 dead 7 Hours Ago | 03:04 Iran's Supreme Leader on Tuesday accused the country's enemies of stirring unrest as the death toll from anti-government demonstrations that began last week rose to 21.\nIran is OPEC's third largest crude producer. Iranian oil industry and shipping sources said protests have had no impact on oil production or exports so far.\n\"Geopolitical risks are clearly back on the crude oil agenda after having been absent almost entirely since the oil market ran into a surplus in the second half of 2014,\" Bjarne Schieldrop, chief commodities analyst at SEB, said, also citing Kurdistan and Libya.\nOil markets have been supported by a year of production cuts led by the Middle East-dominated Organization of the Petroleum Exporting Countries (OPEC) and Russia. The cuts started in January 2017 and are scheduled to cover all of 2018.\nU.S. commercial crude oil inventories have fallen by almost 20 percent from their historic highs last March, to 431.9 million barrels.\nshow chapters Shale will not be a bottomless production pit this year: Pro 13 Hours Ago | 02:29 Strong demand growth, especially from China, has also been supporting crude.\nHowever, rising U.S. production, which is on the verge of breaking through 10 million bpd, has tempered the bullish outlook.\n\"We think U.S. tight oil production growth warrants close monitoring as it could spoil OPEC's market-balancing efforts, pushing the market into surplus in 2018,\" Barclays bank said.\nOctober U.S crude production rose 167,000 barrels per day to 9.64 million bpd, according to the EIA's monthly production report. If the figure is not revised next month, it would be the highest monthly level since May 1971.", "external_links": [], "published": "2018-01-02T03:39:00.000+02:00", "crawled": "2018-01-02T03:44:44.006+02:00", "highlightTitle": ""}