{"organizations": [], "uuid": "8076f126fee6beb156783a9ef21e6aafc34f0074", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-mers-antibodies/human-antibodies-made-in-cows-could-be-developed-to-treat-mers-idUKKBN1EY2TA", "country": "US", "domain_rank": 408, "title": "Human antibodies made in cows could be developed to treat MERS", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T01:30:00.000+02:00", "replies_count": 0, "uuid": "8076f126fee6beb156783a9ef21e6aafc34f0074"}, "author": "", "url": "https://uk.reuters.com/article/us-health-mers-antibodies/human-antibodies-made-in-cows-could-be-developed-to-treat-mers-idUKKBN1EY2TA", "ord_in_thread": 0, "title": "Human antibodies made in cows could be developed to treat MERS", "locations": [], "entities": {"persons": [{"name": "kate kelland", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "world health organization", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 11:31 PM / Updated 4 hours ago Human antibodies made in cows could be developed to treat MERS Kate Kelland 3 Min Read \nLONDON (Reuters) - Human antibodies made in genetically engineered cows have proved safe in an early stage clinical trial, U.S. scientists said on Wednesday, and could be developed into a treatment for the fatal viral disease, MERS. \nMERS, or Middle East Respiratory Syndrome, is a SARS-like viral infection first identified in Saudi Arabia in 2012 that has caused deadly outbreaks in the Middle East as well as sporadic cases around the world. \nDespite more than five years of waves of infection, no effective treatment or vaccine has been developed against MERS, which has a 35 percent case fatality rate and has so far killed at least 740 people worldwide. \nMore than 80 percent of MERS cases have been reported in Saudi Arabia, according to the World Health Organization. \nIn research published in the Lancet Infectious Diseases journal on Wednesday, scientists found that human antibodies called SAB-301 generated in so-called transchromosomic cattle -- animals with human DNA incorporated into their genome -- were safe in healthy volunteers. \nThe antibodies also persisted for more time than the MERS virus typically remains in the body, the study found, with antibodies still detected in bloodstream after 90 days. \nThis points a way ahead for the antibodies -- which offer immunity against an invading infection -- to be tested in further trials in people infected with MERS, the researchers said. \n“This is the first study to show the safety and immune effects of a potential treatment for MERS,” said John Beigel at Leidos Biomedical Research, who co-led the U.S. government-funded study. “The data from our study suggest that SAB-301 is safe, and further research into the treatment is warranted.” \nThe idea of using human antibodies has developed in recent years in a variety of severe and emerging diseases, including flu, severe acute respiratory syndrome (SARS), MERS and Ebola. \nBlood plasma harvested from people whose immune systems have successfully fought the disease contains the right antibodies and can be given to other patients to help their immune systems fight the virus. \nBut harvesting human plasma is not always easy or swift when a new disease emerges, so scientists turned to the idea of transchromosomic cattle as a way of manufacturing specific antibodies in larger amounts. \nTranschromosomic cattle have human DNA that codes for human antibodies incorporated into their genome. To make SAB-301, they were injected with a part of the MERS virus, stimulating their immune systems to produce antibodies against it. The antibodies were then extracted from the cattle’s blood and purified. \n“The process of creating antibody treatments by harvesting antibodies from human donors is slow and often small-scale,” said Beigel. “However, the cattle-produced antibodies could be created as soon as three months.” Editing by Catherine Evans", "external_links": [], "published": "2018-01-10T01:30:00.000+02:00", "crawled": "2018-01-10T02:04:46.000+02:00", "highlightTitle": ""}