{"organizations": [], "uuid": "c27c6051367199a335581272a89641b8cdf6c597", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225214983&w=1200&r=LYNXMPEE0O1D3", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-davos-meeting-iraq/iraq-calls-on-investors-to-help-100-billion-reconstruction-drive-idUKKBN1FE2HT", "country": "US", "domain_rank": 408, "title": "Iraq calls on investors to help $100 billion reconstruction drive", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T19:12:00.000+02:00", "replies_count": 0, "uuid": "c27c6051367199a335581272a89641b8cdf6c597"}, "author": "", "url": "https://uk.reuters.com/article/uk-davos-meeting-iraq/iraq-calls-on-investors-to-help-100-billion-reconstruction-drive-idUKKBN1FE2HT", "ord_in_thread": 0, "title": "Iraq calls on investors to help $100 billion reconstruction drive", "locations": [], "entities": {"persons": [{"name": "yara bayoumy", "sentiment": "none"}, {"name": "abadi", "sentiment": "none"}, {"name": "dmitry zhdannikov", "sentiment": "none"}, {"name": "haider al-abadi", "sentiment": "none"}], "locations": [{"name": "iraq", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "kuwait", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "world economic forum", "sentiment": "none"}, {"name": "world bank", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 5:17 PM / Updated 6 minutes ago Iraq calls on investors to help $100 billion reconstruction drive Yara Bayoumy , Dmitry Zhdannikov 4 Min Read \nDAVOS, Switzerland (Reuters) - Iraq called on Thursday for foreign investors to help it rebuild after defeating Islamic State and making progress in reuniting the country, saying it would need up to $100 billion (£70.06 billion) to fix crumbling infrastructure and war-torn cities. \nPrime Minister Haider al-Abadi said help was needed with dozens of projects, as Iraq prepares for a major donors conference in Kuwait next month, which will be held together with the World Bank. \n“It’s a huge amount of money. We know we cannot provide it through our own budget,” Abadi told the World Economic Forum in Davos, Switzerland. \n“We know we cannot provide for it through donations, that’s almost impossible. So that’s why we (have) now resorted to investment and reconstruction through investment. This is a way forward and we can achieve it,” he said. \nAbadi came to Davos in 2016 and pledged to defeat Islamic State before the end of that year. He didn’t come in 2017 as the war on militants took longer than anticipated, although he declared full victory at the end of last year. \nThis year, Abadi has made efforts to resolve a crisis in relations with the country’s semi-autonomous region of Kurdistan, which voted for independence in a referendum last year that was not recognised by Baghdad and has had to surrender major oilfields and chunks of territory to Iraqi troops. \nHe said he had met twice already this year with Kurdish Prime Minister Nechirvan Barzani, adding Barzani had agreed to hand over oil to federal firm Somo while Baghdad and Erbil discuss the exact level of budget transfers. \nErbil started independent oil exports several years ago, accusing Baghdad of not transferring enough money from the federal budget, while Baghdad accused Erbil of not producing and transferring enough oil. \nThe balance of budget allocation versus oil remains the main sticking point in discussions between Baghdad and Erbil and Barzani said on Thursday nothing had been agreed. \n“This is far from the truth, we didn’t discuss this issue in the first place,” Barzani said, according to Kurdish news agency Rudaw. BALANCING BETWEEN U.S. AND IRAN \nAbadi acknowledged Baghdad’s tough balancing act when seeking military or economic support from Washington and Tehran. He also said Saudi Arabia was increasingly interested in building relations with Iraq and warned against an escalation of tensions with Iran. \n“Any change in relation between the U.S. and Iran is harmful for us, is harmful for the region. It means there will be some conflicts, some friction somewhere, and Iraq will not be immune from that,” Abadi said. \nU.S. President Donald Trump has taken a hawkish stance on Iran and threatened to pull out of a 2015 nuclear deal agreed between Tehran and world powers. \nIranian foreign minister Mohammad Javad Zarif has skipped the Davos forum for the first time in many years, pulling out of the programme soon after Trump announced his plans to attend. \nAs Trump arrived in Davos on Thursday, Zarif tweeted: “It was Iran who helped the people of Iraq and Syria defeat ISIS (Islamic State), and it was the U.S. and Saudi Arabia who armed it.” \nAbadi said he asked all sides to keep their differences away from Iraq when helping the country. \nHe also said Iraq, the second largest oil producer in OPEC, would stick to the group’s output cut agreement as it needed a stable price to rebuild its economy. Reporting by Dmitry Zhdannikov and Yara Bayoumy; Editing by Mark Bendeich and Mark Potter", "external_links": [], "published": "2018-01-25T19:12:00.000+02:00", "crawled": "2018-01-25T19:29:11.006+02:00", "highlightTitle": ""}