{"organizations": [], "uuid": "43ecadc2b51beeffcc1de8ffa32b8a31265c92b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221474616&w=1200&r=LYNXMPEE0B14J", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-liv-klopp/liverpool-had-no-option-but-to-sell-coutinho-klopp-idUKKBN1F11UY", "country": "US", "domain_rank": 408, "title": "Liverpool had no option but to sell Coutinho, coach says", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T18:04:00.000+02:00", "replies_count": 0, "uuid": "43ecadc2b51beeffcc1de8ffa32b8a31265c92b2"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-liv-klopp/liverpool-had-no-option-but-to-sell-coutinho-klopp-idUKKBN1F11UY", "ord_in_thread": 0, "title": "Liverpool had no option but to sell Coutinho, coach says", "locations": [], "entities": {"persons": [{"name": "coutinho", "sentiment": "negative"}, {"name": "philippe coutinho", "sentiment": "none"}, {"name": "juergen klopp", "sentiment": "none"}, {"name": "klopp", "sentiment": "none"}], "locations": [{"name": "anfield", "sentiment": "none"}, {"name": "merseyside", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "liverpool", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reds", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "everton - anfield", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 3:10 PM / Updated 24 minutes ago Liverpool had no option but to sell Coutinho, coach says Reuters Staff 4   Liverpool fought “until the last second” to convince Philippe Coutinho to stay at Anfield but ultimately had no other option than sell him to Barcelona, Liverpool manager Juergen Klopp said on Friday. Soccer Football - FA Cup Third Round - Liverpool vs Everton - Anfield, Liverpool, Britain - January 5, 2018 Liverpool manager Juergen Klopp before the match REUTERS/Phil Noble \nAfter months of speculation, the 25-year-old Brazilian joined the Spanish club for 140 million pounds in what he described as his “dream move”. \nThe sale surprised many on Merseyside, particularly after Liverpool fought so hard to keep Coutinho in August when the owners made clear that the Reds should no longer be seen as “a selling club”. \nYet that strident tone changed ahead of the latest transfer window and, in his first public comment since Coutinho’s sale, Klopp made clear that Liverpool felt they had no choice but to negotiate the move. \n“There was no other option,” said Klopp at a news conference ahead of the Premier League game against Manchester City on Sunday. \n”If someone is angry or disappointed it could be the manager but I‘m not. We tried everything to convince Phil to stay here. \n”This was his dream. He would only leave Liverpool for one club. The club was fighting until the last second to keep Phil. It would have been difficult to say no and then use him in the second half of the season. \n“Phil, what a character, but he still wanted to leave. We have to make the best of it. We still have fantastic players here.” \nKlopp stressed that he has lost big-game players previously as a manager and called on everyone to move on from Coutinho’s departure. \n“We lost plenty of players at Dortmund. You always have to react. It’s about the atmosphere in the club. If we get a free kick on Sunday and anyone is thinking ‘Phil!’ that wouldn’t be too cool,” he said POTENTIAL BUSINESS \nAlthough Liverpool have been linked with several high-profile replacements for Coutinho, Klopp gave little away and straight-batted suggestions they are negotiating to bring in Naby Keita from RB Leipzig ahead of his scheduled arrival in the close season. \nKlopp stressed that if the club do any business “we want right before expensive”. \n“First of all we have to replace (Coutinho) internally. We have our eyes open in this window but we won’t do crazy things,” he said. \n“We don’t need to replace him, we need to step up. We have played fantastic football without Phil. We only have to carry on.” \nOn Sunday Liverpool get their first opportunity against the Premier League’s runaway leaders City, who beat them 5-0 in the reverse fixture, a game that saw Sadio Mane sent off. \n“The red card changed the game and maybe for Man City the season,” said Klopp, who confirmed that Mo Salah is likely to return after recovering from the thigh strain that caused him to miss the past two matches. \n”He’s doing fantastically well. If nothing happens in this moment Mo is back. \n“In a football way we should look to clarify something (after the 5-0 defeat). We need to show we can cause them problems and make their life difficult. It’s Anfield, I‘m really looking forward to it.” \nKlopp said his side will not be fazed by City, who have swept all before them this season and enjoy an 18-point advantage over fourth-placed Liverpool. \n”If you are not brave in the things you do, you have another problem,“ he said. ”Use the past, don’t suffer it. You have to show up in a game like this. If you react to the things they do, you will lose. We need to show up. That’s how it is. \n“It’s interesting to play against City. They play really good and if you don’t respect that, you have a problem. But if you are not brave in your game, you will also have a problem.” \nKlopp said that Jordan Henderson and Alberto Moreno, who are both recovering from injury, are back in training but unlikely to feature on Sunday. Reporting by Neil Robinson; Editing by Toby Davis", "external_links": [], "published": "2018-01-12T18:04:00.000+02:00", "crawled": "2018-01-12T18:25:57.069+02:00", "highlightTitle": ""}