{"organizations": [], "uuid": "f37edd26d5286bcbd10d7af0477aee21a12ff901", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222672992&w=1200&r=LYNXMPEE0G0H5", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/uk-global-forex/dollar-stoops-to-three-year-low-euro-shakes-off-merkel-coalition-concerns-idUSKBN1F60DC", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar bounces from 3-year lows as U.S. yields rise", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T10:57:00.000+02:00", "replies_count": 0, "uuid": "f37edd26d5286bcbd10d7af0477aee21a12ff901"}, "author": "", "url": "https://www.reuters.com/article/uk-global-forex/dollar-stoops-to-three-year-low-euro-shakes-off-merkel-coalition-concerns-idUSKBN1F60DC", "ord_in_thread": 0, "title": "FOREX-Dollar bounces from 3-year lows as U.S. yields rise", "locations": [], "entities": {"persons": [{"name": "saika", "sentiment": "negative"}, {"name": "chatterjee", "sentiment": "none"}, {"name": "manuel oliveri", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}, {"name": "credit agricole", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - The dollar rose from a three-year low hit earlier in the day as a rise in U.S. Treasury yields prompted some investors to buy the greenback but the market remained cautious on the outlook for the currency amidst a lack of price pressures.\nYields on 2-year U.S. Treasuries US2YT=RR climbed to 2.06 percent their highest levels since 2008 while 10-year Treasury yields hit 2.60 percent, their highest levels last year.\nThat prompted some investors to trim some of their bearish bets against the dollar which has seen it decline more than 2 percent in the first two weeks of the year after a 10 percent drop .DXY against a basket of currencies in 2017.\n“We are seeing somewhat of a bid in the dollar in the last 12 hours or so on corporate tax repatriation hopes and the rise in U.S. yields but it is likely to be short-lived unless we see inflation pick up meaningfully,” said Manuel Oliveri, an FX strategist at Credit Agricole in London.\nThe dollar rose 0.2 percent to 90.73 against the basket after falling to a December 2014 low of 90.113 in the Asian session.\nApple Inc ( AAPL.O ) said it would make about $38 billion in one-time tax payments on its overseas cash on Wednesday, though market analysts expect the impact on currency markets is going to be limited.\nMorgan Stanley analysts estimate about $40 billion in selling of non-dollar holdings might have an impact on currency markets though most of that may already be currency hedged and take place over a 10-year window.\nFILE PHOTO: A U.S. Dollar note is seen in this June 22, 2017 illustration photo. REUTERS/Thomas White/Illustration/File Photo The euro last stood at $1.2194 EUR= , up 0.1 percent on the day but well below a peak of $1.2323 set on Wednesday, the euro's strongest level since December 2014.\nThe euro had slipped on Wednesday as ECB policymaker Ewald Nowotny told reporters the euro’s recent strength against the dollar is “not helpful,” which encouraged a bout of profit-taking before a policy meeting next week.\nECB policymakers may have been caught off guard by the speed of the euro’s appreciation, said Lee Jin Yang, macro research analyst for Aberdeen Standard Investments in Singapore.\n“Maybe they are trying to manage volatility or slow down the rise,” Lee said.\nElsewhere, the Canadian dollar eased about 0.1 percent to C$1.2450 CAD=D3 , having see-sawed on Wednesday after the Bank of Canada raised interest rates and indicated confidence in the economic outlook but sounded a cautious tone on the future of the North American Free Trade Agreement (NAFTA).\nOn Wednesday, the Canadian dollar had fluctuated in a relatively wide range of C$1.2540 to C$1.2362.\nFor Reuters Live Markets blog on European and UK stock markets see reuters://realtime/verb=Open/url=http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets\nReporting by Saikat Chatterjee; Additional reporting by Masayuki Kitano in TOKYO Editing by Jeremy Gaunt\n ", "external_links": [], "published": "2018-01-18T10:57:00.000+02:00", "crawled": "2018-01-18T11:40:52.000+02:00", "highlightTitle": ""}