{"organizations": [], "uuid": "e653a291f67e2590ced97ab2f92532f877925e19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221130397&w=1200&r=LYNXMPEE0A0X6", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-cry-bur-mee/burnleys-mee-not-panicking-about-winless-run-idUKKBN1F01LW", "country": "US", "domain_rank": 408, "title": "Burnley's Mee not panicking about winless run", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T15:02:00.000+02:00", "replies_count": 0, "uuid": "e653a291f67e2590ced97ab2f92532f877925e19"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-cry-bur-mee/burnleys-mee-not-panicking-about-winless-run-idUKKBN1F01LW", "ord_in_thread": 0, "title": "Burnley's Mee not panicking about winless run", "locations": [], "entities": {"persons": [{"name": "mee", "sentiment": "neutral"}, {"name": "ben mee", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "burnley", "sentiment": "none"}, {"name": "old trafford", "sentiment": "none"}], "organizations": [{"name": "burnley", "sentiment": "neutral"}, {"name": "tottenham hotspur", "sentiment": "none"}, {"name": "huddersfield", "sentiment": "none"}, {"name": "crystal palace", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "arsenal", "sentiment": "none"}, {"name": "reuters/jason cairnduff  sean dyche", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "tottenham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 1:03 PM / Updated 13 minutes ago Burnley's Mee not panicking about winless run Reuters Staff 3 Min Read \nLONDON (Reuters) - Burnley’s six-game winless run in all competitions will not cause panic when they face Crystal Palace in the Premier League on Saturday, defender Ben Mee said. Soccer Football - Premier League - Burnley vs Arsenal - Turf Moor, Burnley, Britain - November 26, 2017 Burnley's Ben Mee looks dejected after the match Action Images via Reuters/Jason Cairnduff \nSean Dyche’s side have lost two and drawn three of their past five Premier League fixtures and were also knocked out of the FA Cup last weekend in a 4-1 defeat at Manchester City. \nHowever, their two league defeats were against Tottenham Hotspur and Liverpool - both chasing Champions League qualification - while one of the draws was at Manchester United, who are second in the table. \n“We haven’t picked up a win, but we’ve been to Old Trafford and drawn, we’ve played against a tough Tottenham side who were very good, and we got a good away draw at Huddersfield as well,” Mee was quoted as saying on the club’s website burnleyfootballclub.com. \n“So we are actually picking up points away from home and we were unlucky in the last minute against Liverpool. We’ve been playing well, so we’re not really taking that too much to heart. \n“I thought we performed really well (at Manchester City) and showed everybody that we can mix it. I think we’ve shown that throughout the season, to be fair. \n“The stats might say no wins in six, but we’ve got three draws out of that and it’s not all doom and gloom.” \nBurnley sat sixth in the Premier League, above Arsenal and level on points with fourth-placed Tottenham, prior to their current winless run. \nThey have now dropped to seventh, five points adrift of sixth-placed Arsenal, seven behind fifth-placed Tottenham and 10 short of fourth-placed Liverpool. \nHowever, Mee believes the club’s improvement on last season -- they were eight points and six places worse off at the same point of the 2016/17 campaign -- remains impressive. \n“Whether we’re getting closer (to the top six teams) or not is difficult to say,” the 28-year-old was quoted as saying by the Lancashire Telegraph. \n“But we’re a team that’s growing and we’re performing really well at a high level at the moment. We’re definitely growing as a club and a team.” \nSaturday’s visit to Selhurst Park will be followed by home league matches against Manchester United and Manchester City either side of a trip to Newcastle United. They then face back-to-back fixtures against relegation-threatened Swansea City and Southampton. \n“It’s going to be exciting times,” Mee said. “We are looking forward. We’ve got some good games coming up and ones we feel we can win.” Reporting by Matt Westby, editing by Pritha Sarkar", "external_links": [], "published": "2018-01-11T15:02:00.000+02:00", "crawled": "2018-01-11T15:26:24.000+02:00", "highlightTitle": ""}