{"organizations": [], "uuid": "3eaff1d1f5d0235cbaf7c01a0548e61a7cf9aefc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/21/104857004-GettyImages-860933692.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/15/european-markets-focus-on-earnings-dollar.html", "country": "US", "domain_rank": 767, "title": "European markets: focus on earnings, dollar", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.786, "site_type": "news", "published": "2018-01-15T08:57:00.000+02:00", "replies_count": 0, "uuid": "3eaff1d1f5d0235cbaf7c01a0548e61a7cf9aefc"}, "author": "Silvia Amaro", "url": "https://www.cnbc.com/2018/01/15/european-markets-focus-on-earnings-dollar.html", "ord_in_thread": 0, "title": "European markets: focus on earnings, dollar", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "rio tinto", "sentiment": "none"}], "organizations": [{"name": "renault", "sentiment": "none"}, {"name": "martin luther king", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Europe finished Monday's session slightly lower, amid a lighter trading day, as stocks paused for breath after two weeks of strong gains.\nThe pan-European STOXX 600 came off its lows, to finish provisionally down 0.17 percent, while major sectors were mostly lower by the market close.\nSymbol Name Price Change %Change Volume FTSE --- DAX --- CAC --- IBEX 35 --- The U.K.'s FTSE 100 slipped 0.12 percent, while France's CAC 40 dipped 0.13 percent and Germany's DAX fell 0.34 percent. In peripheral markets, Italy's FTSE MIB rose 0.49 percent.\nTrade has been lighter than usual on Monday, as markets in the U.S. are closed, in light of Martin Luther King, Jr. Day. The dollar was under pressure, with the index down by 0.64 percent around Europe's close, against a basket of foreign currencies.\nCarillion enters liquidation One of the major news stories Monday was that U.K. construction firm Carillion had entered into liquidation. The company's shares were suspended from trading, but its rivals rose on the news, with Serco up over 7 percent and Interserve rising 2 percent.\nU.K. banking stocks were consequently in focus as HSBC and RBS are seen as some of its top creditors. Both lenders ended trade in the red.\nElsewhere, utilities was the second top-performing sector. Endesa was a top performer, closing up 1.4 percent after Goldman Sachs raised its price target and rating on the stock.\nIn individual stock news, Finnish miner Metso dropped to the bottom of the European benchmark, tumbling 9.84 percent, after the firm reported lower-than-expected sales and profits.\nshow chapters Carillion collapse to have small impact on exposed banks: Analyst 8 Hours Ago | 02:44 On the other hand, Azimut soared 12.76 percent, after it announced that it was doubling its dividend. Vivendi was among the top performing stocks too, rising 2.7 percent following a rating upgrade, giving a boost to the media sector.\nBritish engineer GKN popped more than 4 percent after suitor Melrose said it planned on meeting GKN shareholders, after the engineering firm rejected a multi-million acquisition proposal last week, Reuters reported.\nOver the weekend, news emerged that BNP Paribas was making plans to benefit from the U.K.'s decision to leave the European Union. The French bank has prepared plans to attract mid-sized British companies, the Financial Times reported.\nIn Asia, stocks closed mostly higher but Chinese bonds and equities stumbled after the government announced new steps on banking oversight in an \"arduous\" fight on financial risks, Reuters reported.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.", "external_links": [], "published": "2018-01-15T08:57:00.000+02:00", "crawled": "2018-01-15T08:57:39.005+02:00", "highlightTitle": ""}