{"organizations": [], "uuid": "744527bf3f796afac916a145a62a7808d680f7c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-hennessy-advisors-inc-reports-first-quarter-earnings-of-1-point-04-per-share.html", "country": "US", "domain_rank": 767, "title": "Hennessy Advisors, Inc. Reports First Quarter Earnings of $1.04 Per Share", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.021, "site_type": "news", "published": "2018-01-26T00:15:00.000+02:00", "replies_count": 0, "uuid": "744527bf3f796afac916a145a62a7808d680f7c1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-hennessy-advisors-inc-reports-first-quarter-earnings-of-1-point-04-per-share.html", "ord_in_thread": 0, "title": "Hennessy Advisors, Inc. Reports First Quarter Earnings of $1.04 Per Share", "locations": [], "entities": {"persons": [], "locations": [{"name": "novato", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "hennessy advisors, inc", "sentiment": "neutral"}, {"name": "hennessy advisors, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NOVATO, Calif., Hennessy Advisors, Inc. (NASDAQ:HNNA) today reported results for its first fiscal quarter ended December 31, 2017, and announced an increased quarterly dividend.\nSummary Highlights\nFully diluted earnings per share of $1.04, an increase of 100% over the prior comparable quarter ended December 31, 2016. The Tax Cuts and Jobs Act of 2017, which was passed during our first fiscal quarter, required us to re-assess our deferred tax liability to account for the future impact of a lower corporate tax rate. As a result, we recorded a large, one-time adjustment in the quarter, which created a tax benefit of approximately $4 million. Total revenue of $13.8 million, an increase of 4% over the prior comparable quarter. Total assets under management increased 5% over the prior comparable quarter. Average assets under management, upon which revenue is earned, increased 3% over the prior comparable quarter. Our Board of Directors declared a quarterly dividend of $0.10 per share, an increase of 33%, which will be paid on March 5, 2018, to shareholders of record as of February 9, 2018. On December 1, 2017, we completed the acquisition of two of the three Rainier U.S. Funds. Read more about this by visiting our website at: http://hennessyadvisors.com/press/RainierClose12-1.htm Note: On January 12, 2018, which was after the end of our first fiscal quarter, we completed the acquisition of the final Rainier U.S. Fund. Read more about this by visiting our website at: http://hennessyadvisors.com/press/RainierClose1-12-18.htm\n\"We expect the Tax Cuts and Jobs Act to favorably impact our net income, earnings per share and cash flows in the future due to a lower corporate tax rate. We are working diligently with our professional advisers to better understand those impacts for this fiscal year and beyond,\" said Neil Hennessy, President, Chairman, and CEO of Hennessy Advisors, Inc. \"In the meantime, we remain committed to our business model of pursuing strategic acquisitions, as evidenced by the recent close of the Rainier U.S. Funds transaction. We also remain committed to our dividend program, now in its fourteenth year, and are very pleased to reward our shareholders by increasing our cash dividend,\" he added.\n\"The U.S. stock market continued its steady rise throughout calendar year 2017. I believe we will see even more pro-business policies enacted and fewer regulations in the coming year, and that these changes coupled with the ingenuity of business leaders in the U.S. will drive our economy and the stock market to another year of solid returns in 2018,\" said Mr. Hennessy.\nHennessy Advisors, Inc.\nFinancial Highlights\nPeriod to Period\nThree Months Ended\nFirst Quarter\nDec. 31, 2017\nDec. 31, 2016\n$ Change\n% Change\nTotal Revenue\n$ 13,812,840\n$ 13,294,072\n$ 518,768\n3.9%\nNet Income\n$ 8,186,684\n$ 3,995,598\n$ 4,191,086\n104.9%\nEarnings Per Share (Diluted)\n$ 1.04\n$ 0.52\n$ 0.52\n100.0%\nWeighted Average Number of\nShares Outstanding (Diluted)\n7,842,707\n7,756,053\n86,654\n1.1%\nMutual Fund Average Assets\nUnder Management\n$ 6,756,849,836\n$ 6,539,432,471\n$ 217,417,365\n3.3%\nAt Period Ending Date\nDec. 31, 2017\nDec. 31, 2016\n$ Change\n% Change\nMutual Fund Total Assets\nUnder Management\n$ 6,923,993,186\n$ 6,592,588,760\n$ 331,404,426\n5.0%\nAbout Hennessy Advisors, Inc.\nHennessy Advisors, Inc. is a publicly traded investment manager offering a broad range of domestic equity, multi-asset, and sector and specialty mutual funds. Hennessy Advisors, Inc. is committed to its consistent and repeatable investment process, combining time-tested stock selection strategies with a highly disciplined, team-managed approach, and to superior service to shareholders.\nSupplemental Information\nNothing in this press release shall be considered a solicitation to buy or an offer to sell a security to any person in any jurisdiction where such offer, solicitation, purchase or sale would be unlawful under the securities laws of such jurisdiction.\nCaution Regarding Forward‑Looking Statements\nThis press release contains \"forward-looking statements\" within the meaning of the securities laws, for which we claim the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. In some cases, forward-looking statements can be identified by terminology such as \"expect,\" \"anticipate,\" \"intend,\" \"may,\" \"plan,\" \"will,\" \"should,\" \"could,\" \"would,\" \"assume,\" \"believe,\" \"estimate,\" \"predict,\" \"potential,\" \"project,\" \"continue,\" \"seek\" and similar expressions, as well as statements in the future tense. We have based these forward-looking statements on our current expectations and projections about future events, based on information currently available to us. Forward-looking statements should not be read as a guarantee of future performance or results, and will not necessarily be accurate indications of the times at, or means by, which such performance or results will be achieved. Forward-looking statements are subject to risks, uncertainties, and assumptions, including without limitation, redemptions by mutual fund shareholders, general economic and financial conditions, movement of interest rates, competitive conditions, industry regulation, and fluctuations in the stock market, many of which are beyond the control of our management, and other factors described in the section entitled \"Risk Factors\" and elsewhere in our Annual Report on Form 10‑K for the fiscal year ended September 30, 2017, filed with the Securities and Exchange Commission. Management does not assume responsibility for the accuracy or completeness of these forward-looking statements. There is no regulation requiring an update of any of the forward-looking statements after the date of this press release to conform these statements to actual results or to changes in our expectations.\nAvailable Topic Expert(s): For information on the listed expert(s), click appropriate link.\nNeil Hennessy\nhttp://www.profnetconnect.com/neil_hennessy\n releases/hennessy-advisors-inc-reports-first-quarter-earnings-of-104-per-share-300588403.html\nSOURCE Hennessy Advisors, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/hennessy-advisors-inc-reports-first-quarter-earnings-of-104-per-share-300588403.html", "http://www.profnetconnect.com/neil_hennessy", "http://hennessyadvisors.com/press/RainierClose1-12-18.htm", "http://hennessyadvisors.com/press/RainierClose12-1.htm", "https://profnet.prnewswire.com/Subscriber/ExpertProfile.aspx?ei=100270"], "published": "2018-01-26T00:15:00.000+02:00", "crawled": "2018-01-26T01:22:43.005+02:00", "highlightTitle": ""}