{"organizations": [], "uuid": "95ffaeb63d287bb71934503641fb932f489be3e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/07/reuters-america-update-1-oil-prices-edge-up-on-lower-u-s-rig-count-but-below-recent-highs.html", "country": "US", "domain_rank": 767, "title": "UPDATE 1-Oil prices edge up on lower U.S. rig count, but below recent highs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T05:55:00.000+02:00", "replies_count": 0, "uuid": "95ffaeb63d287bb71934503641fb932f489be3e9"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/07/reuters-america-update-1-oil-prices-edge-up-on-lower-u-s-rig-count-but-below-recent-highs.html", "ord_in_thread": 0, "title": "UPDATE 1-Oil prices edge up on lower U.S. rig count, but below recent highs", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}], "organizations": [{"name": "baker hughes", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Brent has risen by more than 10 pct since December\n* Oil has been supported by OPEC-led cuts, strong economic growth\n* Tensions in OPEC-member Iran have also lifted oil prices\n* But soaring U.S. crude production could undermine rally (Updates prices, adds comments)\nSINGAPORE, Jan 8 (Reuters) - Oil prices firmed on Monday on the back of a slight decline in the number of U.S. rigs drilling for new production, with crude holding just below near three-year highs reached last week.\nU.S. West Texas Intermediate (WTI) crude futures were at $61.62 a barrel at 0344 GMT, 18 cents, or 0.3 percent, above their last settlement, and not far off the $62.21 May 2015 high reached last week.\nBrent crude futures were at $67.77 a barrel, 15 cents, or 0.2 percent, above their last close. Brent hit $68.27 high last week, the highest since May 2015.\nTraders said the gains were due to a slight decline in the number of U.S. rigs drilling for new production, which eased by five in the week to January 5, to 742, according to data from oil services firm Baker Hughes.\nDespite this, U.S. production <C-OUT-T-EIA> is expected to break through 10 million barrels per day (bpd) very soon, largely thanks to soaring output from shale drillers. Only top producers Russia and Saudi Arabia produce more.\n\"The U.S. oil price is now into a range that is anticipated to attract increased shale oil production,\" said Ric Spooner, chief market analyst at CMC Markets in Sydney.\n\"Traders may decide that discretion is the better part of valor while markets wait on evidence of what happens to the rig count and production levels over the next couple of months.\"\nRising U.S. production is the main factor countering production cuts led by the Middle East dominated Organization of the Petroleum Exporting Countries (OPEC) and by Russia, which began in January last year and are set to last through 2018.\nStephen Innes, head of trading for Asia/Pacific at futures brokerage Oanda in Singapore, said \"the OPEC vs shale debate will rage\" this year, being a key price driving factor.\nHowever, Innes added that Middle East turmoil would remain a key focus for oil markets, which he warned had the potential to \"send oil prices rocketing higher.\"\n(Reporting by Henning Gloystein and Florence Tan; editing by Richard Pullin)", "external_links": [], "published": "2018-01-08T05:55:00.000+02:00", "crawled": "2018-01-08T07:46:29.002+02:00", "highlightTitle": ""}