{"organizations": [], "uuid": "5d032cd2936ddc4f7f1581d930bde5425a89d6fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKhealth/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-women-heart/early-puberty-puts-women-at-higher-risk-for-heart-disease-and-stroke-idUKKBN1F52PF", "country": "US", "domain_rank": 408, "title": "Early puberty puts women at higher risk for heart disease and stroke", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T23:08:00.000+02:00", "replies_count": 0, "uuid": "5d032cd2936ddc4f7f1581d930bde5425a89d6fb"}, "author": "", "url": "https://uk.reuters.com/article/us-health-women-heart/early-puberty-puts-women-at-higher-risk-for-heart-disease-and-stroke-idUKKBN1F52PF", "ord_in_thread": 0, "title": "Early puberty puts women at higher risk for heart disease and stroke", "locations": [], "entities": {"persons": [{"name": "li", "sentiment": "negative"}, {"name": "rapaport", "sentiment": "none"}, {"name": "sanne peters", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "george institute for global health", "sentiment": "none"}, {"name": "university of oxford", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 9:11 PM / Updated 3 hours ago Early puberty puts women at higher risk for heart disease and stroke Lisa Rapaport 4 Min Read \n(Reuters Health) - Girls who start menstruating before they’re 12 years old may have a greater risk of heart disease and stroke later in life than their peers who go through puberty later, a U.K. study suggests. \nFor the study, researchers examined data on more than 500,000 middle-aged adults who didn’t have a history of heart disease, including more than 267,000 women. Researchers followed half of the participants for at least seven years, and during that time about 9,000 men and women developed heart disease or experienced a heart attack or stroke. \nWomen typically started menstruating when they were 13 years old. When they got their first period before age 12, women were 10 percent more likely to develop cardiovascular disease than when they started menstruating at age 13 or older, the study found. \nObesity might explain some of this connection, said study co-author Sanne Peters of the George Institute for Global Health at the University of Oxford in the UK. Previous studies have linked early puberty to obesity in both children and adults, Peters said by email. \n“However, there is no straightforward link,” Peters said. “Our findings show that the risk of developing cardiovascular disease increases for both women of healthy weight and women who are overweight or obese, which suggests we need more research to understand the association between an early first menstrual cycle and a greater risk of heart disease and stroke later in life.” \nOther reproductive health factors also appeared to influence the risk of heart disease in women, researchers report in the journal Heart. \nWomen who went through menopause early, before age 47, were 33 percent more likely to develop cardiovascular disease and 42 percent more likely to have a stroke than women who went through menopause later, the study found. \nA history of miscarriages was also linked to a higher risk of cardiovascular disease, with each miscarriage tied to a 6 percent increase in the odds of heart problems. \nWhen women had a stillbirth, they were 22 percent more likely to develop cardiovascular disease and 44 percent more apt to have a stroke than women who didn’t go through this. \nIn addition, those who had a hysterectomy, a surgery to remove the uterus, were 12 percent more likely to get cardiovascular disease, and the increased risk was even higher for women who had their ovaries removed in addition to the uterus. \nThe study wasn’t a controlled experiment designed to prove whether or how puberty timing might directly impact the odds of cardiovascular disease, a heart attack or stroke decades later. \nEven so, the results add to the evidence linking earlier maturation with obesity, high blood pressure and other risk factors for cardiovascular disease, said Jane Mendle, a human development researcher at Cornell University in Ithaca, New York, who wasn’t involved in the study. \n“Early puberty is correlated with many risks and experiences that are independently important for cardiovascular health - such as obesity, smoking, socioeconomic status, and higher life stress,” Mendle said by email. “Likely, it’s a combination of these factors that explain why earlier development is related to heart health.” \nSOURCE: bit.ly/2ENG9Ns Heart, online January 15, 2018.", "external_links": [], "published": "2018-01-16T23:08:00.000+02:00", "crawled": "2018-01-17T00:45:02.005+02:00", "highlightTitle": ""}