{"organizations": [], "uuid": "2374ed37e6536f6384d3d7e5c236afaa46ddd252", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-kenya-forest-climatechange/with-solar-water-trees-grow-into-a-sturdy-business-in-western-kenya-idUSKBN1F70G6", "country": "US", "domain_rank": 408, "title": "With solar water, trees grow into a sturdy business in Western Kenya", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T13:08:00.000+02:00", "replies_count": 0, "uuid": "2374ed37e6536f6384d3d7e5c236afaa46ddd252"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-kenya-forest-climatechange/with-solar-water-trees-grow-into-a-sturdy-business-in-western-kenya-idUSKBN1F70G6", "ord_in_thread": 0, "title": "With solar water, trees grow into a sturdy business in Western Kenya", "locations": [], "entities": {"persons": [{"name": "mohammed", "sentiment": "none"}, {"name": "hakima mohammed", "sentiment": "none"}, {"name": "eston mutitu", "sentiment": "none"}], "locations": [{"name": "western kenya maseno", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}, {"name": "western kenya", "sentiment": "none"}, {"name": "maseno", "sentiment": "none"}, {"name": "mwiyekhe", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "kenya forest research institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MASENO, Kenya (Thomson Reuters Foundation) - Armed with a solar-powered water pump for irrigation and a quarter-acre piece of borrowed land, widow Hakima Mohammed has become a Western Kenya tree tycoon.\nSince 2013, she has sold at least 1.5 million seedling trees, mainly to local small-scale farmers, who are planting them as a way to boost their incomes from wood and fruit sales, particularly in the face of recurring droughts that have shriveled crops.\nIn the process, the 57-year-old has found a way to support herself and her family – and Kenya is getting a hand in its efforts to see at least 10 percent of the country’s land covered in trees by 2030, as part of efforts to rein in drought and meet climate change goals.\n“This is a very good example of entrepreneurship which I would really encourage young men and women to take up, and do the same in other parts of the country,” said Eston Mutitu, a senior research scientist at the Kenya Forest Research Institute.\nMohammed, who lives in Mwiyekhe, a village near Western Kenya’s Maseno township, started her tree nursery in 2013, soon after her husband’s death following a short illness.\nOfficials at the forest institute, where she has been working for nearly 30 years in a low-level position, arranged for her to borrow a plot of land for the sapling nursery, a project she and her husband had talked about trying before his death.\nWith little experience beyond having watered tree nursery beds at the institute, Mohammed went to work planting an initial 20,000 seedling trees, hiring local young men to help her carry water from a nearby stream to irrigate the young plants.\nThat hard work became easier starting in 2016, when she acquired a solar-powered water pump from Futurepump, a company in Kenya that makes pumps available on credit. The bit of technological help has let her dramatically step up the number of seedlings she can raise and sell.\n“This helped me increase productivity and now I have at least 250,000 tree seedlings on my nursery at any given time all round the year, given that I no longer rely on rainfall or manual fetching of the water to sprinkle on the crops,” said the mother of three, who was not educated beyond primary school level.\nPLENTIFUL BUYERS Mohammed’s trees have found a ready market among local farmers who, like her, are less concerned about the environmental impact of planting trees and more interested in the profits they generate.\nOn his three-acre piece of land in Muhanda, a village in Siaya County, farmer Moris Otieno has planted a thousand trees from Mohammed’s nursery, mainly eucalyptus but also grevillea – another Australian native – and cypress.\nUnlike many other tree nurseries in the area, which offer smaller numbers of seedlings of just a few types, Mohammed’s nursery has 30 species of trees that grow well in the region – and farmers can take home as few as 10 or as many as 20,000 seedlings in a single order, she said.\nApart from fruit trees – including grafted avocadoes, mangoes, oranges, pawpaws and loquats – she sees the highest demand for three kinds of eucalyptus trees, as well as grevillea, casuarina (also from Australia) and cypress.\n“We prefer eucalyptus because they grow fast and uniformly, and have high demand in the timber industry,” Otieno said.\nTom Joseph Olumasai Nyangweso, another farmer who lives in Ebunyiri, a village in the heart of Kakamega County, has planted eucalyptus on two of his three acres of land, and grevillea trees throughout the property, many used as a living fence posts.\nBoth men say their move into tree planting is driven by a desire to boost their incomes.\n“In the next three years, I will sell all these trees either to the Kenya Power and Lighting Company to be used as electricity poles, or locally as timber – and that will definitely help me buy another piece of land,” said Otieno, of his three-year-old eucalyptus woodlot.\nIn Western Kenya, a six-year-old eucalyptus tree can fetch up to 6,000 Kenyan shillings ($60) in the local market. For 750 trees - assuming that 50 of them may have structural flaws by then - Otieno could earn up to 4.5 million shillings ($45,000).\nIf he had planted maize each year – the most commonly grown crop in the area – he would likely earn about $8,100 over the same six-year period, based on average harvests and prevailing market prices, he said.\nApart from more expensive grafted fruit trees, all other trees at Hakima’s nursery retail at 10 Kenyan shillings per seedling. She sells not less than 200,000 each rainy season, which earns her at least 2 million shillings ($20,000) – and she cannot meet all the demand, she said.\n“This has helped me take my children to school, where one of them has just finished her undergraduate degree and the other a diploma course. This nursery is also going to be my main source of livelihood when I finally retire sometime next year,” she told the Thomson Reuters Foundation.\nReporting by Isaiah Esipisu; editing by Laurie Goering :; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, climate change, resilience, women's rights, trafficking and property rights. Visit news.trust.org/climate\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://news.trust.org/climate"], "published": "2018-01-18T13:08:00.000+02:00", "crawled": "2018-01-18T12:26:17.000+02:00", "highlightTitle": ""}