{"organizations": [], "uuid": "66df913c3bd5ad94b6c2cf4bc55e110ab122c1ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-rgax-to-acquire-logiq3-group.html", "country": "US", "domain_rank": 767, "title": "RGAx to Acquire LOGiQ3 Group", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.643, "site_type": "news", "published": "2018-01-08T17:25:00.000+02:00", "replies_count": 0, "uuid": "66df913c3bd5ad94b6c2cf4bc55e110ab122c1ac"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-rgax-to-acquire-logiq3-group.html", "ord_in_thread": 0, "title": "RGAx to Acquire LOGiQ3 Group", "locations": [], "entities": {"persons": [], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "apexa", "sentiment": "none"}, {"name": "st. louis", "sentiment": "none"}], "organizations": [{"name": "acquire logiq3 group subsidiary of reinsurance group of america", "sentiment": "negative"}, {"name": "reinsurance group of america", "sentiment": "none"}, {"name": "apexa", "sentiment": "none"}, {"name": "cookhouse lab", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "logiq 3 inc", "sentiment": "none"}, {"name": "tindall associates inc.", "sentiment": "none"}, {"name": "rga", "sentiment": "none"}, {"name": "logiq 3 corp.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Subsidiary of Reinsurance Group of America, Incorporated to Expand Technology and Service Offerings to the Insurance Industry\nST. LOUIS--(BUSINESS WIRE)-- RGAx, a subsidiary of Reinsurance Group of America, Incorporated (NYSE: RGA) today announced that it has agreed to acquire LOGiQ 3 Inc . – a group of companies that provides technology, consulting, and outsourcing solutions to the North American life insurance and reinsurance industry. The LOGiQ 3 Group includes LOGiQ 3 Corp., APEXA, Cookhouse Lab, and Tindall Associates Inc. (TAI).\nLOGiQ 3 Corp. specializes in consulting and outsourcing services for life insurance underwriting, claims, and life and health reinsurance administration. APEXA delivers a centralized online solution for advisor contracting and compliance in Canada. Cookhouse Lab, a joint venture with msg global solutions, aims to accelerate insurance innovation by bringing the industry together through an open and collaborative model. TAI is the U.S. market leader in reinsurance software and consulting services with over 30 years of experience. In a related transaction, RGAx will also acquire the remaining ownership stake in TAI held by msg global solutions.\n“The team at LOGiQ 3 Group are proven industry leaders and innovators with a mission, culture, customer focus, and values that closely align with those of RGAx,” said Dennis Barnes, Chief Executive Officer of RGAx. “The combined business platforms of LOGiQ 3 Group and RGAx will provide a powerful suite of technology and service offerings across the insurance industry value chain.”\n“This acquisition is a strong indicator that LOGiQ 3 Group’s innovative insurance services will continue to expand and add value to our existing and future customers,” said Chris Murumets, Co-Founder and Chief Executive Officer of LOGiQ 3 Inc. “RGAx supports our commitment to provide services that ultimately drive positive change in the industry.”\n“We have a vision of making insurance simpler, better, and remarkable,” adds Simon Bell, Co-Founder and Chief Executive Officer of LOGiQ 3 Inc. “Together, we will be an extraordinary force, bringing new perspectives and helping to solve some of the challenges faced by the industry today.”\nLOGiQ 3 Group, with approximately 100 employees in the U.S., Canada, and the U.K., will maintain a separate operation and retain employees in their current roles. The transactions are expected to close during the first quarter of 2018. Additional terms of the transactions, including the sale prices, are not being disclosed. For more information about the LOGiQ 3 Group of companies, please visit www.logiq3group.com .\nAbout RGAx\nRGAx is a wholly owned subsidiary of Reinsurance Group of America, Incorporated. Formed in 2015, as RGA’s innovation and digital business unit, RGAx has three regional teams around the world: RGAx Americas, RGAx EMEA, and RGAx Asia. RGAx leverages its global platform to build and accelerate transformational businesses in the life insurance industry with a mission to help people live longer, healthier, more financially secure lives. RGAx’s lines of business include data/analytics, digital distribution, customer engagement, and insurance services. For more information, please visit www.rgax.com .\nAbout RGA\nReinsurance Group of America, Incorporated (RGA), a Fortune 500 company, is among the leading global providers of life reinsurance and financial solutions, with total revenues of $12.4 billion for the trailing twelve months and assets of $58.7 billion as of September 30, 2017. Founded in 1973, RGA today is recognized for its deep technical expertise in risk and capital management, innovative solutions, and commitment to serving its clients. With headquarters in St. Louis, Missouri and operations in 26 countries, RGA delivers expert solutions in individual life reinsurance, individual living benefits reinsurance, group reinsurance, health reinsurance, facultative underwriting, product development, and financial solutions. To learn more about RGA and its businesses, visit the company’s website at www.rgare.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108005703/en/\nRGA\nLynn Phillips, 636-736-2351\nVice President, Corporate Communications\nlphillips@rgare.com\nor\nJeff Hopson, 636-736-2068\nSenior Vice President, Investor Relations\njhopson@rgare.com\nor\nLizzie Curry, 636-736-8521\nPublic Relations Manager\nlizzie.curry@rgare.com\nSource: Reinsurance Group of America, Incorporated", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rgare.com&esheet=51739177&newsitemid=20180108005703&lan=en-US&anchor=www.rgare.com&index=5&md5=51aa6ff08934cebb03e54f2271a6fb2c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.logiq3group.com&esheet=51739177&newsitemid=20180108005703&lan=en-US&anchor=LOGiQ3+Inc&index=2&md5=5d6802466e149e67b90f9f04dba8585f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.logiq3group.com&esheet=51739177&newsitemid=20180108005703&lan=en-US&anchor=www.logiq3group.com&index=3&md5=207dd6ca35f2778c2ec5e725af6e9e56", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rgax.com&esheet=51739177&newsitemid=20180108005703&lan=en-US&anchor=www.rgax.com&index=4&md5=ef92b0c33e3933ff6419f045cefcdfdf", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rgare.com&esheet=51739177&newsitemid=20180108005703&lan=en-US&anchor=Reinsurance+Group+of+America%2C+Incorporated&index=1&md5=694ad64e04cb414b73be146d412b4f2c", "http://www.businesswire.com/news/home/20180108005703/en/"], "published": "2018-01-08T17:25:00.000+02:00", "crawled": "2018-01-08T19:05:59.019+02:00", "highlightTitle": ""}