{"organizations": [], "uuid": "b0c00dd1cc68844016927694febb2b50145aaa06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/10/the-associated-press-ohio-imposes-strict-rule-on-workers-back-surgery-opioids.html", "country": "US", "domain_rank": 767, "title": "Ohio imposes strict rule on workers' back surgery, opioids", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T16:33:00.000+02:00", "replies_count": 0, "uuid": "b0c00dd1cc68844016927694febb2b50145aaa06"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/10/the-associated-press-ohio-imposes-strict-rule-on-workers-back-surgery-opioids.html", "ord_in_thread": 0, "title": "Ohio imposes strict rule on workers' back surgery, opioids", "locations": [], "entities": {"persons": [], "locations": [{"name": "columbus", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "minnesota", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "ohio bureau of workers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "COLUMBUS, Ohio (AP) — Ohio residents with work-related back injuries in most cases must try remedies like rest, physical therapy and chiropractic care before turning to spinal fusion surgery and prescription painkillers under a groundbreaking new guideline that is partly meant to reduce the overprescribing of opioids but isn't sitting well with everyone.\nWashington, Colorado and Minnesota already restrict injured-worker payments for the surgery, officials said, but the Ohio policy, which went into effect Jan. 1, goes further by embedding an opioid warning specifically into its surgical restriction. The state has been among the hardest hit by the overdose crisis, which many experts say stems largely from addictions to prescription painkillers that can progress into heroin use.\nAt issue is a procedure in which portions of the patient's spine are fused permanently to address certain conditions, including degenerative disc disease and severe chronic low back pain. Injured Ohio workers get such surgery about 600 times a year.\nThe new rule at the Ohio Bureau of Workers' Compensation, the nation's largest state-run injured-worker fund, requires an injured worker to undergo at least 60 days of alternative care — while avoiding opioid use, if possible — before resorting to spinal fusion surgery, with a few exceptions for the most severe back injuries. By including the opioid warning, it's a more aggressive restriction than other states that also decline to pay right away for the surgery.\nDaniel Resnick, a Madison, Wisconsin-based neurosurgeon and president of the North American Spine Society, said the Ohio rule is overly broad and will result in added hurdles for those in need of spinal fusion surgery.\n\"Lumbar fusion works extremely well for a few things,\" he said. \"It doesn't work well for everything, and it doesn't work well for every patient, but in those cases where it's appropriate, this is an unsophisticated rule that's going to add an administrative burden — added time, added costs — for the patient. They'll be futzing around wasting two months rather than getting the effective treatment they need.\"\nBut the bureau defends the decision.\nStudies have shown that fewer than half of patients are able to return to work after the surgery and that it is often ineffective or followed by complications. Afterward, workers' pain oftentimes continues — or even gets worse.\n\"We now have better knowledge of who responds better to surgery, and we also know that some patients actually require more opioid medication after surgery than they did before surgery,\" said Terrence Welsh, the Ohio injured worker bureau's chief medical officer.\nThat's exactly the opposite of what injured worker funds want. A survey by CompPharma last year showed workers compensation insurers view opioids and addiction as the industry's most pressing concern. Their spending on opioids topped $1.5 billion in 2015.\nAn Associated Press review of more than a decade of opioid prescription data from injured-worker systems in three states — Ohio, California and Texas — found varying degrees of success. The information was provided to the AP through public records requests.\nThe analysis showed:\n— Ohio has touted that 44 percent fewer injured workers received opioids in the past five years, saving $46 million in drug costs, as rules were imposed allowing denial of reimbursement for opioid prescriptions if physicians are believed to be overprescribing or otherwise failing to follow \"best medical practices\" in treating injured workers. Data showed much of that decline coincided with the steep drop in the overall number of injured workers in the state — from 81,000 in 2007 to 38,000 in 2016. The percentage of injured workers on prescription narcotics over that time fell seven percentage points, from 75 to 68 percent.\n— In Texas, opioid prescriptions for workers decreased more than Ohio, as the number of injured workers fell from 183,000 in 2007 to 119,000 to 2016, or 35 percent, while the percentage of workers on opioid prescriptions fell 11 percentage points, from 63 percent to 52 percent.\n— In California, the trend contrasts with Ohio, as data for the same time period showed the percentage of workers on opioid prescriptions rose slightly, from 35 percent to 37 percent, but that was as the injured worker population rose 12 percent, from 332,000 to 368,000.\nChris Tomshack, CEO and founder of HealthSource, a large chiropractic-clinic chain, said narcotic use has been found to increase 41 percent in patients who received fusion surgery and to continue over two years in three-quarters of patients.\n\"Non-invasive treatments for chronic back pain, including chiropractic care, have proven to deliver better outcomes for most patients based on numerous studies,\" said Tomshack, a physician. \"Ohio is taking the lead with its BWC ruling, which will reduce lost productivity and costs to the state, and most importantly, improve the healing process for injured workers.\"\nAssociated Press data journalist Michelle Minkoff in Washington contributed to this report.\nThis story corrects the spelling of the HealthSource CEO's last name to Thomshack instead of Thomshack.", "external_links": [], "published": "2018-01-10T16:33:00.000+02:00", "crawled": "2018-01-11T03:57:19.007+02:00", "highlightTitle": ""}