{"organizations": [], "uuid": "6615c7372c5bd1ac72a4098895458ff8b93e428f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-david-hurwitz-joins-appvance-ai-as-cmo.html", "country": "US", "domain_rank": 767, "title": "David Hurwitz Joins Appvance.ai as CMO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T16:35:00.000+02:00", "replies_count": 0, "uuid": "6615c7372c5bd1ac72a4098895458ff8b93e428f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-david-hurwitz-joins-appvance-ai-as-cmo.html", "ord_in_thread": 0, "title": "David Hurwitz Joins Appvance.ai as CMO", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SUNNYVALE, Calif., Jan. 31, 2018 /PRNewswire/ -- Appvance.ai announced today that David Hurwitz has joined the software test automation company as Chief Marketing Officer. He brings deep experience in both enterprise software development and marketing to the position.\nHurwitz began his career as a software engineer, before becoming a world-class marketeer. Given that engineering background, he has a particular passion for improving the performance and satisfaction of software teams, including those involved with testing.\n\"Software test automation has failed testers, developers, ops and users,\" commented Hurwitz, \"I'm joining Appvance.ai because our AI-driven Appvance IQ is the right system to fix that.\"\nHurwitz's marketing career includes creating the concept of IT Governance solutions with the Clarity system when he served as CMO of Niku Software, and creating the concept of Lean IT while serving as a marketing executive at CA Technologies. Publicly-traded Niku achieved stunning user and commercial success during his tenure, including being voted Best Vendor four consecutive times across two continents at the Gartner PPM Summit. Earlier in his career, he ran marketing and product management for Appvance.ai cofounder and CEO Kevin Surace at Perfect Commerce.\nHurwitz holds a BS in Industrial Engineering from the Rochester Institute of Technology, which he continues to draw upon in helping software teams improve their processes.\nKevin Surace commented: \"I'm thrilled to have the original Marketing Machine join our team. We are delivering transformational productivity benefits to the $80 billion software quality assurance world. David's penetrating insights and transcendent ideas are keys to that mission.\"\nAbout Appvance.ai\nAppvance.ai is the leader in AI-driven test generation, which is revolutionizing how software testing is performed. The company's premier product is Appvance IQ, the world's first AI-driven, unified test automation system. It helps enterprises improve the quality, performance and security of their applications, while transforming the efficiency and output of testing teams.\nAppvance.ai is headquartered in Sunnyvale, California, with offices in Costa Rica and India. Investors in the company include Javelin Ventures, Staenberg Ventures, Social Internet Fund, FundersClub, Three Bridges Ventures and HB Asset Management.\nLearn more at Appvance.ai .\nMedia Contact\nDavid Hurwitz\n189667@email4pr.com\n650-743-9788\nView original content with multimedia: http://www.prnewswire.com/news-releases/david-hurwitz-joins-appvanceai-as-cmo-300590632.html\nSOURCE Appvance.ai", "external_links": ["https://www.linkedin.com/in/marketingmachine/", "http://www.prnewswire.com/news-releases/david-hurwitz-joins-appvanceai-as-cmo-300590632.html", "https://en.wikipedia.org/wiki/Lean_IT", "http://www.appvance.ai/"], "published": "2018-01-31T16:35:00.000+02:00", "crawled": "2018-01-31T18:34:41.007+02:00", "highlightTitle": ""}