{"organizations": [], "uuid": "33f5f43f16f7d201393500043d2098e4a281c283", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/25/reuters-america-update-3-intel-results-beat-estimates-warns-of-potential-security-flaw-fallout.html", "country": "US", "domain_rank": 767, "title": "UPDATE 3-Intel results beat estimates, warns of potential security flaw fallout", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:22:00.000+02:00", "replies_count": 0, "uuid": "33f5f43f16f7d201393500043d2098e4a281c283"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/25/reuters-america-update-3-intel-results-beat-estimates-warns-of-potential-security-flaw-fallout.html", "ord_in_thread": 0, "title": "UPDATE 3-Intel results beat estimates, warns of potential security flaw fallout", "locations": [], "entities": {"persons": [{"name": "brian krzanich", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "intel corp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "fallout@ (Adds more information from CFO about security risk disclosure, adds additional analyst quote)\nJan 25 (Reuters) - Intel Corp on Thursday gave a bullish forecast and blew past Wall Street profit and revenue expectations for the fourth quarter on the strength of data center sales, the business it sees as key to its transformation from a PC supplier.\nIntel stock rose 3.8 percent to $47.06, boosted by a dividend hike and relief that recently disclosed security flaws in some of its widely used chips had little impact. But Intel did acknowledge, for the first time, that the fallout could hurt future results, a concern analysts brushed off.\nIntel also boosted its full-year forecast for 2018 above Wall Street expectations, saying it would boost dividends 10 percent to $1.20 on a yearly basis despite taking a $5.4 billion charge related to recent changes in U.S. tax law.\nIntel Chief Executive Brian Krzanich said the company would start shipping chips later this year with \"silicon-based changes\" to protect against the so-called Spectre and Meltdown security threats.\nRevenue from the company's higher-margin data center business rose about 20 percent to $5.58 billion, beating the average analyst estimate of $5.13 billion, according to Thomson Reuters I/B/E/S. Revenue from Intel's PC group hit $9 billion for the quarter, a 2 percent decline from the year before, but ticked up 3 percent for the year to $34 billion.\nIntel predicted $65 billion in revenue for 2018, well above expectations of a $63.7 billion forecast.\nIn an interview ahead of Intel's earnings call with investors, Chief Financial Officer Bob Swan said the company sees no \"meaningful impact\" on corporate earnings as a result of the security vulnerabilities, reiterating an assessment the company made on Jan. 3.\nThe improved dividend and forecasts are important because they are the first signal of how much success Intel has had in containing fallout from the so-called Spectre and Meltdown security flaws that could allow hackers to steal data from computers. The flaws were disclosed after the close of the currently reported quarter.\nThe problems affect most modern computing chips but analysts believe that Intel, the No.1 maker of microprocessors, is at greater risk because all the variants of the flaws affect its chips, which have a dominant market position in data centers.\nData center revenue growth was twice Wall Street expectations, coming at 20 percent from the year-ago quarter versus investor targets of 10 percent, said Kevin Cassidy, an analyst at Stifel.\nIntel warned in its earnings release that fallout from the discovery of Spectre and Meltdown could hurt future results, as well as customer relationships and the company's reputation.\nIt added that publicity over the two vulnerabilities could prompt outside parties to look for other security flaws, which could also harm the company's business.\nStill, GBH Insights analyst Daniel Ives said that Intel investors would heave a sigh of relief.\n\"The chip vulnerability situation was an overhang over Intels shares and this robust quarter, healthy guidance, and underlying business metrics should help investors sleep a bit easier at night.\"\nDue to the tax charge, the company posted a loss of $687 million, or 15 cents per share, in the fourth quarter ended Dec. 30.\nExcluding items, the chipmaker earned $1.08 per share. Total revenue rose 4.1 percent to $17.05 billion.\nAnalysts on average were expecting a profit of 86 cents per share on a revenue of $16.34 billion, according to Thomson Reuters I/B/E/S. (Reporting by Laharee Chatterjee in Bengaluru, Stephen Nellis in San Francisco and Jim Finkle in Toronto; Editing by Saumyadeb Chakrabarty and Lisa Shumaker)", "external_links": [], "published": "2018-01-26T00:22:00.000+02:00", "crawled": "2018-01-26T11:21:53.005+02:00", "highlightTitle": ""}