{"organizations": [], "uuid": "7e8cc093d128a3d6019468205602f1237c43cbfd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/26/104732454-GettyImages-656907770-jay-clayton.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/sec-halts-one-of-the-largest-icos-ever.html", "country": "US", "domain_rank": 767, "title": "SEC halts one of the largest 'ICOs' ever", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.227, "site_type": "news", "published": "2018-01-30T16:58:00.000+02:00", "replies_count": 0, "uuid": "7e8cc093d128a3d6019468205602f1237c43cbfd"}, "author": "Evelyn Cheng", "url": "https://www.cnbc.com/2018/01/30/sec-halts-one-of-the-largest-icos-ever.html", "ord_in_thread": 0, "title": "SEC halts one of the largest 'ICOs' ever", "locations": [], "entities": {"persons": [{"name": "zach gibson", "sentiment": "none"}, {"name": "jay clayton", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "sec", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "arisebank", "sentiment": "none"}, {"name": "u.s. securities and exchange commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The U.S. Securities and Exchange Commission announced Tuesday it has obtained a court order to halt and freeze the assets of what is likely the largest initial coin offering ever.\nThe complaint was filed in Dallas, Texas, on Thursday and unsealed late Monday. The SEC said Dallas-based AriseBank \"used social media, a celebrity endorsement, and other wide dissemination tactics to raise what it claims to be $600 million of its $1 billion goal in just two months.\"\nThe court approved an emergency asset freeze over AriseBank and its two co-founders. The SEC said that for the first time in connection to an ICO fraud, it has appointed a third-party custodian, or receiver, to secure the firm's cryptocurrency holdings. Those assets include bitcoin , litecoin, bitshares, dogecoin and bitUSD.\nMark Rasmussen, a Dallas-based partner at law firm Jones Day, was appointed as the neutral receiver. Investors seeking additional information can contact mail@arisebankreceiver.com, according to a release.\nIf AriseBank did raise $600 million in an initial coin offering, that would surpass the largest token sales so far.\n\"The ICO is an illegal offering of securities because there is no registration filed or in effect with the SEC, nor is there an applicable exemption from registration,\" the SEC complaint said.\nFundraisers for projects based on the blockchain technology behind bitcoin are called token sales or initial coin offerings. They have raised more than $3.7 billion, but more than 10 percent of those funds have been lost to hackers, according to a study from Ernst and Young. Filecoin, which is building a decentralized storage network, raised the equivalent of roughly $252 million in the largest ICO to date, according to financial research firm Autonomous Next. Overstock.com subsidiary tZero is in the middle of a $250 million token sale, down from initial plans to raise $500 million.\nThe SEC alleges AriseBank \"falsely stated that it purchased [a Federal Deposit Insurance Corporation]-insured bank which enabled it to offer customers FDIC-insured accounts.\"\nAriseBank calls itself a \"decentralized bank\" and announced Thursday it was correcting an announcement made the prior week about the acquisition of an FDIC-insured bank. Two websites for AriseBank were unavailable Tuesday morning, and lawyers for the firm couldn't immediately be reached for comment.\nThe SEC seeks to recover the funds, and wants to bar the co-founders from serving as officers or directors of a public company, or offering digital securities in the future.\nThe Texas Department of Banking announced on Friday that it issued a cease and desist order on AriseBank in early January.\nThe SEC has increased its scrutiny of initial coin offerings in the last several months. Last week, commission chairman Jay Clayton and Commodity Futures Trading Commission Chairman J. Christopher Giancarlo wrote in a Wall Street Journal commentary piece that \"The SEC is devoting a significant portion of its resources to the ICO market.\"\nThe commission issued an investor warning in July, temporarily suspended trading in several small stocks due to questions about claims regarding their involvement in initial coin offerings. Last fall, the SEC also froze the assets of those involved with at least three token sales.\nMany initial coin offerings officially prohibit U.S. residents and citizens from participating out of fear of the SEC.", "external_links": [], "published": "2018-01-30T16:58:00.000+02:00", "crawled": "2018-01-30T16:57:43.002+02:00", "highlightTitle": ""}