{"organizations": [], "uuid": "273343f8162fb555a2129fdb597686ae40099fcc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218718468&w=1200&r=LYNXMPEE0102G", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/global-markets/global-markets-asia-shares-reach-decade-top-on-china-data-dollar-in-doldrums-idINKBN1ER05A", "country": "US", "domain_rank": 408, "title": "Global Markets: Asia shares reach decade top on China data, dollar in doldrums", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T05:33:00.000+02:00", "replies_count": 0, "uuid": "273343f8162fb555a2129fdb597686ae40099fcc"}, "author": "", "url": "https://in.reuters.com/article/global-markets/global-markets-asia-shares-reach-decade-top-on-china-data-dollar-in-doldrums-idINKBN1ER05A", "ord_in_thread": 0, "title": "Global Markets: Asia shares reach decade top on China data, dollar in doldrums", "locations": [], "entities": {"persons": [{"name": "kim jong", "sentiment": "none"}, {"name": "wayne cole", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "global markets", "sentiment": "negative"}, {"name": "msci", "sentiment": "none"}, {"name": "min read  sydney", "sentiment": "none"}, {"name": "tokyo stock exchange", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - European stocks closed lower on Tuesday, the first trading day of 2018, while Wall Street advanced and the U.S. dollar fell to its weakest in over three months against key currencies.\nA trader works on the floor of the New York Stock Exchange shortly after the opening bell in New York, U.S., January 2, 2018. REUTERS/Lucas Jackson MSCI’s gauge of stocks across the globe .MIWD PUS gained 0.61 percent. The index had set scores of record highs and rose by one-fifth in value in 2017.\nMajor stock indexes closed 2017 with their best performance since 2013. In the U.S. market, the advance came amid strong economic growth and corporate earnings, low interest rates and hopes, now realized, of U.S. corporate tax cuts.\nU.S. equity indexes advanced on Tuesday, buoyed by gains in technology and consumer discretionary stocks.\nIncreases in Apple ( AAPL.O ), Facebook ( FB.O ), Alphabet ( GOOGL.O ) and Microsoft ( MSFT.O ) shares pulled the S&P 500 index higher on Tuesday.\n“People are back to looking at what have been the winners. It has been very momentum driven,” said Rick Meckler, president of hedge fund LibertyView Capital Management LLC in Jersey City, New Jersey.\nThe Dow Jones Industrial Average .DJI rose 59.79 points, or 0.24 percent, to 24,779.01, the S&P 500 .SPX gained 17.15 points, or 0.64 percent, to 2,690.76 and the Nasdaq Composite .IXIC added 91.91 points, or 1.33 percent, to 6,995.30.\nIn Europe, equities closed lower after autos stocks fell following weaker car registrations data. Trading was also cautious ahead of the launch of a major reform of European financial markets.\nThe pan-European STOXX 600 index fell 0.21 percent along with euro zone stocks .STOXXE, down 0.19 percent.\nShares rose in Asia. Shanghai blue chips .CSI300 climbed 1.41 percent and MSCI's 24-country emerging market stock index .MSCIEF jumped to a multi-year high after the Caixin index of Chinese industry rose to a four-month high of 51.5 in December, confounding forecasts for a decline.\nFALLING DOLLAR The dollar index .DXY, tracking the greenback against a basket of major currencies, fell 0.23 percent. It was hampered by market expectations of a slower pace of interest rate increases by the Federal Reserve amid a tepid U.S. inflation picture.\nThe dollar had already hit a three-month low .DXY on Friday, bringing its losses for 2017 to 9.8 percent, its worst performance since 2003.\nOther currencies gained. The euro EUR= rose 0.3 percent to $1.2044 and hit a four-month high on Tuesday after data showed that euro zone manufacturers ramped up activity last month at the fastest pace in more than two decades.\nThe Japanese yen strengthened 0.28 percent at 112.35 per dollar, while sterling GBP= was last trading at $1.3594, up 0.69 percent on the day.\nU.S. Treasury yields rose in line with European government yields. A European Central Bank official said the bank’s massive bond purchase program might not continue later this year.\nA reversal of year-end buying has also driven U.S. Treasury yields higher, said Brian Rehling, co-head of global fixed income strategy for Wells Fargo Investment Institute in St. Louis.\n“Lots of institutions buy Treasuries to hold over year-end for liquidity. To see that reversal early in the year is not a surprise,” Rehling said.\nBenchmark U.S. 10-year notes US10YT=RR last fell 16/32 in price to yield 2.4687 percent, from 2.411 percent late on Friday.\nThe 30-year bond US30YT=RR last fell 45/32 in price to yield 2.8105 percent, from 2.741 percent late on Friday.\nU.S. crude CLcv1 fell 0.13 percent to $60.34 per barrel and Brent LCOcv1 was at $66.52, down 0.52 percent. Oil prices earlier had enjoyed their strongest start to a year since 2014 amid large anti-government rallies in Iran and ongoing supply cuts led by OPEC and Russia.\nCopper CMCU3 lost 0.42 percent to $7,216.50 a tonne, but that follows a rise of 31 percent in 2017 to a four-year top.\nSpot gold XAU= added 1.0 percent to $1,315.15 an ounce, after advancing by 13 percent in 2017 for its best performance in seven years.\nAdditional reporting by Marc Jones, Dmitry Zhdannikov and Helen Reid in London, Henning Gloystein in Singapore, Sruthi Shankar in Bengaluru, and Richard Leong and Gertrude Chavez-Dreyfuss in New York; Editing by Bernadette Baum and Nick Zieminski\n ", "external_links": [], "published": "2018-01-02T05:33:00.000+02:00", "crawled": "2018-01-02T06:01:31.006+02:00", "highlightTitle": ""}