{"organizations": [], "uuid": "8fdb1e7f80fa3d3fc2276f8d7a5d1d0523e73e3b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-vinita-bali-to-join-bunge-limited-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Vinita Bali to Join Bunge Limited Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-04T00:05:00.000+02:00", "replies_count": 0, "uuid": "8fdb1e7f80fa3d3fc2276f8d7a5d1d0523e73e3b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-vinita-bali-to-join-bunge-limited-board-of-directors.html", "ord_in_thread": 0, "title": "Vinita Bali to Join Bunge Limited Board of Directors", "locations": [], "entities": {"persons": [{"name": "vinit", "sentiment": "negative"}, {"name": "bali", "sentiment": "none"}], "locations": [{"name": "vinita bali", "sentiment": "none"}, {"name": "n.y.", "sentiment": "none"}, {"name": "bali", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}], "organizations": [{"name": "bunge limited board", "sentiment": "negative"}, {"name": "bg", "sentiment": "negative"}, {"name": "bunge limited", "sentiment": "negative"}, {"name": "pwc india", "sentiment": "none"}, {"name": "syngene international limited", "sentiment": "none"}, {"name": "crisil ltd.", "sentiment": "none"}, {"name": "zyman group", "sentiment": "none"}, {"name": "titan industries ltd.", "sentiment": "none"}, {"name": "cadbury", "sentiment": "none"}, {"name": "coca-cola company", "sentiment": "none"}, {"name": "cadbury india", "sentiment": "none"}, {"name": "tata group", "sentiment": "none"}, {"name": "smith & nephew plc", "sentiment": "none"}, {"name": "britannia industries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WHITE PLAINS, N.Y., Jan. 3, 2018 /PRNewswire/ -- Bunge Limited (NYSE: BG) today announced that Vinita Bali has been appointed to its Board of Directors, effective immediately.\nMs. Bali, 62, served as Chief Executive Officer of Britannia Industries, a publicly listed food company in India, from 2005 to 2014. Prior to that, she was Head of the Business Strategy practice in the U.S. at the Zyman Group, a consulting firm. She started her career in India at a Tata Group company in 1977, and joined Cadbury India in 1980, subsequently working for Cadbury in the United Kingdom, Nigeria and South Africa until 1994. From 1994 to 2003, she held senior positions in marketing and general management at The Coca-Cola Company in the U.S. and Latin America, becoming Global Head of Corporate Strategy in 2001.\nCurrently, Ms. Bali serves as an advisory board member of PwC India, and is a non-executive director on the boards of Smith & Nephew plc, as well as several Indian companies, including CRISIL Ltd., Titan Industries Ltd. and Syngene International Limited. She is a former non-executive director of Syngenta International AG. She also chairs the Board of the Global Alliance for Improved Nutrition (GAIN).\n\"Vinita is an accomplished former CEO in the food and ingredients industry who brings directly relevant experience to our Board of Directors,\" said L. Patrick Lupo, Chairman, Bunge Limited. \"We will greatly benefit from her depth of industry knowledge and emerging markets experience as we continue to grow our Food & Ingredients business.\"\nMs. Bali holds an MBA from the Jamnalal Bajaj Institute of Management Studies at the University of Mumbai, and a BA in Economics from the University of Delhi.\nWebsite Information\nWe routinely post important information for investors on our website, www.bunge.com , in the \"Investors\" section. We may use this website as a means of disclosing material, non-public information and for complying with our disclosure obligations under Regulation FD. Accordingly, investors should monitor the Investors section of our website, in addition to following our press releases, SEC filings, public conference calls, presentations and webcasts. The information contained on, or that may be accessed through, our website is not incorporated by reference into, and is not a part of, this document.\nAbout Bunge Limited\nBunge Limited ( www.bunge.com , NYSE: BG) is a leading global agribusiness and food company operating in over 40 countries with approximately 32,000 employees. Bunge buys, sells, stores and transports oilseeds and grains to serve customers worldwide; processes oilseeds to make protein meal for animal feed and edible oil products for commercial customers and consumers; produces sugar and ethanol from sugarcane; mills wheat, corn and rice to make ingredients used by food companies; and sells fertilizer in South America. Founded in 1818, the company is headquartered in White Plains, New York.\nCautionary Statement Concerning Forward-Looking Statements\nThis press release contains both historical and forward-looking statements. All statements, other than statements of historical fact are, or may be deemed to be, forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements are not based on historical facts, but rather reflect our current expectations and projections about our future results, performance, prospects and opportunities. We have tried to identify these forward-looking statements by using words including \"may,\" \"will,\" \"should,\" \"could,\" \"expect,\" \"anticipate,\" \"believe,\" \"plan,\" \"intend,\" \"estimate,\" \"continue\" and similar expressions. These forward-looking statements are subject to a number of risks, uncertainties and other factors that could cause our actual results, performance, prospects or opportunities to differ materially from those expressed in, or implied by, these forward-looking statements. The following important factors, among others, could affect our business and financial performance: industry conditions, including fluctuations in supply, demand and prices for agricultural commodities and other raw materials and products used in our business; fluctuations in energy and freight costs and competitive developments in our industries; the effects of weather conditions and the outbreak of crop and animal disease on our business; global and regional agricultural, economic, financial and commodities market, political, social and health conditions; the outcome of pending regulatory and legal proceedings; our ability to complete, integrate and benefit from acquisitions, dispositions, joint ventures and strategic alliances; our ability to achieve the efficiencies, savings and other benefits anticipated from our cost reduction, margin improvement and other business optimization initiatives; changes in government policies, laws and regulations affecting our business, including agricultural and trade policies, tax regulations and biofuels legislation; and other factors affecting our business generally. The forward-looking statements included in this release are made only as of the date of this release, and except as otherwise required by federal securities law, we do not have any obligation to publicly update or revise any forward-looking statements to reflect subsequent events or circumstances.\nView original content: http://www.prnewswire.com/news-releases/vinita-bali-to-join-bunge-limited-board-of-directors-300577080.html\nSOURCE Bunge Limited", "external_links": ["http://www.bunge.com/", "http://www.prnewswire.com/news-releases/vinita-bali-to-join-bunge-limited-board-of-directors-300577080.html"], "published": "2018-01-04T00:05:00.000+02:00", "crawled": "2018-01-04T00:35:47.028+02:00", "highlightTitle": ""}