{"organizations": [], "uuid": "f40c64eab7ff0bb4fb96b3b2e9269e4aa09c217b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-neustar-appoints-former-aspect-and-ibm-executive-kenneth-ewell-as-vice-president-of-customer-success-analytics-solutions.html", "country": "US", "domain_rank": 767, "title": "Neustar Appoints Former Aspect and IBM Executive Kenneth Ewell as Vice President of Customer Success, Analytics Solutions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.359, "site_type": "news", "published": "2018-01-16T21:00:00.000+02:00", "replies_count": 0, "uuid": "f40c64eab7ff0bb4fb96b3b2e9269e4aa09c217b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-neustar-appoints-former-aspect-and-ibm-executive-kenneth-ewell-as-vice-president-of-customer-success-analytics-solutions.html", "ord_in_thread": 0, "title": "Neustar Appoints Former Aspect and IBM Executive Kenneth Ewell as Vice President of Customer Success, Analytics Solutions", "locations": [], "entities": {"persons": [{"name": "kenneth ewell", "sentiment": "negative"}, {"name": "ewell", "sentiment": "none"}, {"name": "ted prince", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "rling", "sentiment": "none"}], "organizations": [{"name": "ibm", "sentiment": "negative"}, {"name": "analytics solutions ewell", "sentiment": "negative"}, {"name": "neustar", "sentiment": "negative"}, {"name": "analytics solutions", "sentiment": "none"}, {"name": "neustar , inc.", "sentiment": "none"}, {"name": "svp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ewell will lead all client delivery processes to ensure a seamless connected customer experience\nSTERLING, Va.--(BUSINESS WIRE)-- Neustar , Inc., a trusted, neutral provider of real-time information services, today announced the appointment of Kenneth Ewell as Vice President of Customer Success for its Analytics Solutions. Ewell will be responsible for all client-related service delivery processes for Neustar’s Marketing and Risk Solutions portfolios. He will spearhead the entire customer service delivery process from onboarding through delivery and integrate processes to drive customer success and strategic growth objectives. He will report to Ted Prince, Senior Vice President of Analytics Solutions.\nEwell has extensive technology and portfolio company experience in service performance improvement, go-to-market strategy, organizational design, operations and change management. Previously, he was SVP of Worldwide Professional Services at Aspect, where he led the company’s new and enhanced service delivery framework. Ewell has spent over 30 years in the consulting, customer service and strategic advisory services fields within the telecommunications, technology and private equity sectors.\n“We’re excited to have Ken lead Neustar’s customer delivery and success efforts to ensure our Analytics Solutions’ customers realize maximum value,” said Ted Prince, Senior Vice President, Analytics Solutions. “Ken’s experience across the software and technology sectors, coupled with his strategic advisory knowledge, will undoubtedly offer a fresh perspective that will allow us to improve upon our already strong customer success model.”\n“Neustar’s continued momentum and incredible client roster make it an undeniable leader within the Marketing and Risk Solutions market, I look forward to designing streamlined processes for even faster deployment to keep pace with the remarkable growth of the company,” said Kenneth Ewell.\nIn his previous role at Aspect, Ewell was responsible for navigating a significant business model shift from on-premise to a cloud-based model. While at Waterstone Management Group, he served as Partner and advised major technology clients and portfolio companies of private equity firms. Ewell also spent several years at IBM Global Services and IBM Business Consulting Services, where he managed IBM’s overall service relationship in major accounts and delivered successful consulting engagements.\nAbout Neustar\nNeustar, Inc. is a leading global information services provider driving the connected world forward with trusted, holistic identity resolution. As the only company capable of understanding who is on the other end of every interaction, Neustar is trusted by the world’s great brands to grow and guard their businesses with the most complete knowledge of how to connect people, places and things. The combination of Neustar’s unique, accurate, and real-time identity system and our cloud-based workflow solutions empower our clients to make actionable, precise and valuable decisions across marketing, risk, IT/security, network and operations departments. As the sole provider of the U.S. Number Portability Administration Center (NPAC), Neustar also facilitates the routing of all telephone call and text messages in the U.S. More information is available at https://www.home.neustar\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116006463/en/\nNeustar Media Contact\nCarolin Bachmann, 415-312-2100\nCarolin.bachmann@team.neustar\nSource: Neustar, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.home.neustar&esheet=51743946&newsitemid=20180116006463&lan=en-US&anchor=https%3A%2F%2Fwww.home.neustar&index=2&md5=c118c630a357a99e63bdbaf531db3d55", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.home.neustar&esheet=51743946&newsitemid=20180116006463&lan=en-US&anchor=Neustar&index=1&md5=71ac8218c277e958173994e13c760145", "http://www.businesswire.com/news/home/20180116006463/en/"], "published": "2018-01-16T21:00:00.000+02:00", "crawled": "2018-01-16T21:02:31.006+02:00", "highlightTitle": ""}