{"organizations": [], "uuid": "26f9edd0e86eff3e0a7937f4986d8ecaf111b669", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222135561&w=1200&r=LYNXMPEE0E0RM", "site_section": "http://feeds.reuters.com/reuters/UKFundsNews/", "section_title": "Reuters: Funds News", "url": "https://uk.reuters.com/article/uk-global-markets-fastmoney/commentary-hedge-funds-intensify-bearish-dollar-u-s-bond-bets-idUKKBN1F41IZ", "country": "US", "domain_rank": 408, "title": "Commentary: Hedge funds intensify bearish dollar, U.S. bond bets", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T14:26:00.000+02:00", "replies_count": 0, "uuid": "26f9edd0e86eff3e0a7937f4986d8ecaf111b669"}, "author": "", "url": "https://uk.reuters.com/article/uk-global-markets-fastmoney/commentary-hedge-funds-intensify-bearish-dollar-u-s-bond-bets-idUKKBN1F41IZ", "ord_in_thread": 0, "title": "Commentary: Hedge funds intensify bearish dollar, U.S. bond bets", "locations": [], "entities": {"persons": [{"name": "jamie mcgeever", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "chicago futures trading commission", "sentiment": "none"}, {"name": "bureau of engraving and printing", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 12:29 PM / Updated an hour ago Commentary: Hedge funds intensify bearish dollar, U.S. bond bets Jamie McGeever 5   The direction fast money is flowing at the start of the year could not be clearer as hedge funds and speculators ramp up their bets on a lower dollar and higher U.S. bond yields. United States one dollar bills are seen on a light table at the Bureau of Engraving and Printing in Washington November 14, 2014. REUTERS/Gary Cameron/File Photo \nMost of these bets are currently in the money. The dollar hit a three-year low on Monday, the 10-year Treasury yield last week rose to its highest since March, and the two-year yield is its highest since 2008. \nBut as U.S. currency and yields hit levels not seen in years, the size of bets needed to get them there is also growing. Many of these positions are getting stretched, in some cases close to record levels, casting doubt on how much more they can expand and therefore keep the current trends intact. \nData from the Chicago Futures Trading Commission show that hedge funds’ and speculative accounts’ short dollar position against a basket of major and emerging currencies virtually doubled in the week to Jan. 9, to $10.1 billion from $5.4 billion. \nThat is the largest net short dollar position since the end of October last year. \nThe U.S. currency is on the slide, hitting a three-year low on a trade-weighted basis on Monday. It fell 10 percent last year, its worst year since 2003, but the New Year has brought no cheer - it’s down a further 1.8 percent in just two weeks. \nMost of the FX market’s bearish view on the dollar is rooted in its bullish view on the euro. Net long euro positions leapt to a new record 144,691 contracts from 127,868, according to CFTC. That’s a $21.5 billion bet that the euro will strengthen. \n(For a graphic showing euro positioning, click here: reut.rs/2D3ROau ) \nNo doubt about it, the euro is on the march as investors bring forward estimates of when the ECB will end its stimulus and start tightening policy. With the euro zone economy booming and oil at $70, inflationary pressures could make that sooner than previously thought. \nThe euro is at a three-year high just below $1.22. But in 2007, the last time CFTC euro long positions were at record levels, the euro was trading around $1.35 on its way to a record high above $1.60 a year later. \nCan the euro go on a similar run this time around? That might be difficult given how heavily fast money is betting on higher U.S. interest rates and bond yields. SHORT BONDS \nThe latest CFTC data show hedge funds and speculators doubling down on short Treasuries positions, from short-dated two-year bonds out to longer-dated 10-year bonds. \nNet short two-year Treasury futures positions rose to 267,622 contracts from just under 238,000 the week before. That’s the fourth largest short position since CFTC began compiling the data 20 years ago. \n(For a graphic showing 2-year U.S. Treasuries positioning, click here: reut.rs/2DwY5fI ) \nThe previous three records were all registered since last summer. Since September last year the two-year yield has been marking successive post-crisis peaks, breaking above 2 percent last week for the first time since September 2008. \nIt’s a similar story with five-year Treasury futures. The CFTC net short position rose to 443,765 last week, the third biggest on record. \n(For a graphic showing 5-year U.S. Treasuries positioning, click here: reut.rs/2D5cCyn ) \nThe net short position in 10-year Treasury futures grew to 196,853 contracts, the largest since March last year. There have only been six bigger weekly position swings toward bearish bets in the last decade, and only 10 in the last two decades. \nThis shows speculators are positioning for higher U.S. interest rates and bond yields. The U.S. economy continues to hum along at a decent clip and the Fed seems committed to raising rates further. \n(For a graphic showing 10-year U.S. Treasuries positioning, click here: reut.rs/2DyrBlm ) \nHow much longer the economic cycle (already long in the tooth) can run and how much higher U.S. rates can rise are, of course, two of the most crucial questions upon which the direction of world financial markets rest this year. \nFor now, at least, fast money is telling us the dollar will fall further and U.S. bond yields will continue to rise. \nThe opinions expressed here are those of the author, a columnist for Reuters Reporting by Jamie McGeever; Editing by Toby Chopra", "external_links": [], "published": "2018-01-15T14:26:00.000+02:00", "crawled": "2018-01-15T15:13:30.005+02:00", "highlightTitle": ""}