{"organizations": [], "uuid": "465a174f390daefe2a033ca49672e512dc25bc2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-nucor-reports-results-for-fourth-quarter-and-year-ended-2017.html", "country": "US", "domain_rank": 767, "title": "Nucor Reports Results for Fourth Quarter and Year Ended 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-30T17:00:00.000+02:00", "replies_count": 0, "uuid": "465a174f390daefe2a033ca49672e512dc25bc2e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-nucor-reports-results-for-fourth-quarter-and-year-ended-2017.html", "ord_in_thread": 0, "title": "Nucor Reports Results for Fourth Quarter and Year Ended 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "charlotte", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}], "organizations": [{"name": "nucor", "sentiment": "negative"}, {"name": "nucor corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHARLOTTE, N.C., Jan. 30, 2018 /PRNewswire/ -- Nucor Corporation (NYSE: NUE) announced today consolidated net earnings of $383.9 million, or $1.20 per diluted share, for the fourth quarter of 2017. By comparison, Nucor reported consolidated net earnings of $254.9 million, or $0.79 per diluted share, for the third quarter of 2017 and $159.6 million, or $0.50 per diluted share, for the fourth quarter of 2016.\nNucor reported consolidated net earnings of $1.32 billion, or $4.10 per diluted share, for fiscal 2017 compared to $796.3 million, or $2.48 per diluted share for fiscal 2016.\nEarnings (loss) before income taxes and noncontrolling interests by segment were as follows for the fourth quarter and full year 2017 and 2016 (in thousands):\nThree Months (13 Weeks) Ended\nTwelve Months (52 Weeks) Ended\nDec. 31, 2017\nDec. 31, 2016\nDec. 31, 2017\nDec. 31, 2016\nSteel mills\n$ 349,958\n$ 321,270\n$ 2,084,203\n$ 1,724,168\nSteel products\n74,849\n52,079\n206,805\n249,970\nRaw materials\n26,721\n(18,881)\n129,296\n(95,121)\nCorporate/eliminations\n(129,287)\n(99,428)\n(670,347)\n(580,358)\n$ 322,241\n$ 255,040\n$ 1,749,957\n$ 1,298,659\nIncluded in the fourth quarter of 2017 results was a net benefit of $175.2 million, or $0.55 per diluted share, related to the impacts of U.S. federal tax legislation enacted in the fourth quarter of 2017. Future expenses or benefits related to the new legislation may need to be recorded as additional guidance and clarification of certain aspects of the legislation are provided, but cannot be estimated at this time. Third quarter of 2017 results included a net benefit totaling $13.2 million, or $0.04 per diluted share, related to tax return true-ups and state credits. Also included in the third quarter of 2017 earnings was an expense of $22.5 million, or $0.05 per diluted share, related to certain legal matters. Included in the fourth quarter of 2016 results were the effects of a change in estimate related to the cost of certain inventories that resulted in a benefit of $77.6 million, or $0.16 per diluted share.\nNucor's consolidated net sales decreased 2% to $5.09 billion in the fourth quarter of 2017 compared with $5.17 billion in the third quarter of 2017 and increased 29% compared with $3.96 billion in the fourth quarter of 2016. Average sales price per ton was comparable with the third quarter of 2017 and increased 14% compared to the fourth quarter of 2016. Total tons shipped to outside customers were 6,542,000 tons in the fourth quarter of 2017, a 1% decrease from the third quarter of 2017 and an increase of 13% from the fourth quarter of 2016. Total fourth quarter steel mill shipments decreased 2% from the third quarter of 2017 and increased 18% from the fourth quarter of 2016. Fourth quarter downstream steel products shipments to outside customers decreased 3% from the third quarter of 2017 and increased 13% from the fourth quarter of 2016.\nFor fiscal 2017, Nucor's consolidated net sales increased 25% to $20.25 billion, compared with $16.21 billion for fiscal 2016. Total tons shipped to outside customers in fiscal 2017 were 26,492,000, an increase of 9% from fiscal 2016, while average sales price per ton increased 15%.\nThe average scrap and scrap substitute cost per ton used in the fourth quarter of 2017 was $317, unchanged from the third quarter of 2017 and a 34% increase compared to $236 in the fourth quarter of 2016. The average scrap and scrap substitute cost per ton used for the full year 2017 was $307, a 35% increase from $228 in for the full year 2016.\nOverall operating rates at our steel mills decreased to 81% in the fourth quarter of 2017 as compared to 83% in the third quarter of 2017 and increased compared to 72% in the fourth quarter of 2016. Steel mill operating rates for the full year 2017 increased to 85% as compared to 78% for the full year 2016.\nTotal steel mill energy costs in the fourth quarter of 2017 decreased approximately $2 per ton compared to the third quarter of 2017 and decreased approximately $1 compared to the fourth quarter of 2016. The decrease from the third quarter of 2017 was due to lower electricity unit costs and the decrease from the fourth quarter of 2016 was due to improved steel mill productivity as well as lower unit costs for electricity and natural gas. Energy costs for the full year 2017 increased approximately $1 per ton from the full year 2016 due to higher unit costs for electricity and natural gas.\nOur liquidity position remains strong with $999.1 million in cash and cash equivalents and short-term investments and an untapped $1.5 billion revolving credit facility that does not expire until April 2021.\nIn November, Nucor announced that it will build a full-range merchant bar quality (MBQ) mill at its existing steel mill located in Bourbonnais, Illinois. The MBQ mill is expected to have an annual capacity of approximately 500,000 tons and to cost $180 million. We anticipate the project will take approximately two years to complete. This project will allow Nucor to fully utilize the Company's existing bar mill by optimizing its melt capacity and infrastructure. It will also take advantage of a scrap supply that is currently abundant in the region, as well as the Company's commercial footprint in the central United States.\nAlso in November, Nucor announced that it will build a rebar micro mill in Sedalia, Missouri, about 90 miles east of Kansas City. This project represents at least $250 million in new investments. The new micro mill is expected to start-up in 2019 pending the final approval and awarding of state and local incentives as well as required permits and regulatory approvals. Rebar supply to the Kansas City, upper Midwestern and Plains markets currently travels long distances, giving the micro mill in Sedalia a logistical advantage. This location will also allow the company to take advantage of the scrap supply that is currently abundant in the immediate area provided by Nucor's scrap business, The David J. Joseph Company.\nIn December, Nucor's board of directors declared a cash dividend of $0.38 per share payable on February 9, 2018 to stockholders of record on December 29, 2017. This dividend is Nucor's 179 th consecutive quarterly cash dividend, and it marks 45 consecutive years of an increased base dividend.\nImports continue to negatively impact the U.S. steel industry. Total steel imports in 2017 increased by more than five million net tons, or 15.5%, compared to 2016. Additionally, finished steel imports accounted for an estimated 27% share of the U.S. market. Along with other domestic steel producers, Nucor continues to pursue trade cases to combat unfairly traded imports. In 2017, the United States Department of Commerce made several rulings imposing duties on additional steel products that are favorable to the domestic steel industry. In December, the Commerce Department made a preliminary determination that corrosion-resistant and cold-rolled steel from Vietnam that originated in China evaded U.S. anti-dumping and anti-subsidy orders. As a petitioner in the case, Nucor believes the preliminary determination is an important step in fighting efforts to circumvent trade duties. A final determination is expected to be announced in the next few months. We are encouraged by the steady progress that we are achieving through the prosecution of product and country specific trade cases, although the process is still slower than we believe is appropriate. We attribute this success to date to the overwhelming evidence that many foreign competitors receive support from illegal subsidies.\nThe profitability of the steel mills segment in the fourth quarter of 2017 decreased from the third quarter of 2017 due to margin compression as imports, which surged in the summer of 2017, continued to work through to our end markets. Weakness in plate steel negatively impacted the earnings of the steel mills segment in the fourth quarter of 2017 as compared to the third quarter of 2017. The performance of the steel products segment during the fourth quarter of 2017 improved compared to the third quarter of 2017. The performance of the raw materials segment in the fourth quarter of 2017 was better compared to the third quarter of 2017 due to the improved performance of our direct reduced iron facilities.\nEarnings in the first quarter of 2018 are expected to increase compared to the fourth quarter of 2017, exclusive of the benefit recorded in the fourth quarter of 2017 related to tax reform. We believe there is significant optimism in steel end use markets and are encouraged by positive pricing momentum building throughout the quarter for all of our steel mill products. Coupled with these positive trends, first quarter of 2018 results will be negatively impacted by higher scrap prices and weather related interruptions at some of our sheet mills. We expect decreased earnings in the steel products segment due to typical seasonality. We expect earnings in our raw materials segment in the first quarter of 2018 to improve compared to the fourth quarter of 2017.\nNucor and its affiliates are manufacturers of steel products, with operating facilities primarily in the U.S. and Canada. Products produced include: carbon and alloy steel -- in bars, beams, sheet and plate; hollow structural section tubing; electrical conduit; steel piling; steel joists and joist girders; steel deck; fabricated concrete reinforcing steel; cold finished steel; steel fasteners; metal building systems; steel grating; and wire and wire mesh. Nucor, through The David J. Joseph Company, also brokers ferrous and nonferrous metals, pig iron and HBI/DRI; supplies ferro-alloys; and processes ferrous and nonferrous scrap. Nucor is North America's largest recycler.\nCertain statements contained in this news release are \"forward-looking statements\" that involve risks and uncertainties. The words \"believe,\" \"expect,\" \"project,\" \"will,\" \"should,\" \"could\" and similar expressions are intended to identify those forward-looking statements. Factors that might cause the Company's actual results to differ materially from those anticipated in forward-looking statements include, but are not limited to: (1) competitive pressure on sales and pricing, including competition from imports and substitute materials; (2) the sensitivity of the results of our operations to prevailing steel prices and the changes in the supply and cost of raw materials, including scrap steel; (3) market demand for steel products; and (4) energy costs and availability. These and other factors are discussed in Nucor's regulatory filings with the Securities and Exchange Commission, including those in Nucor's fiscal 2016 Annual Report on Form 10-K, Item 1A. Risk Factors. The forward-looking statements contained in this news release speak only as of this date, and Nucor does not assume any obligation to update them.\nYou are invited to listen to the live broadcast of Nucor's conference call in which management will discuss Nucor's fourth quarter results on January 30, 2018 at 2:00 p.m. eastern time. The conference call will be available over the Internet at www.nucor.com , under Investor Relations.\nTONNAGE DATA\n(in thousands)\nThree Months (13 Weeks) Ended\nTwelve Months (52 Weeks) Ended\nDec. 31, 2017\nDec. 31, 2016\nPercentage Change\nDec. 31, 2017\nDec. 31, 2016\nPercentage Change\nSteel mills total shipments:\nSheet\n2,566\n2,225\n15%\n10,607\n9,735\n9%\nTubular products\n225\n86\n162%\n917\n86\n966%\nBars\n1,982\n1,794\n10%\n8,009\n7,307\n10%\nStructural\n557\n511\n9%\n2,295\n2,332\n-2%\nPlate\n556\n471\n18%\n2,300\n2,041\n13%\nOther\n173\n64\n170%\n590\n440\n34%\n6,059\n5,151\n18%\n24,718\n21,941\n13%\nSales tons to outside customers:\nSteel mills\n4,998\n4,400\n14%\n20,618\n18,846\n9%\nJoist\n140\n123\n14%\n472\n445\n6%\nDeck\n128\n110\n16%\n457\n442\n3%\nCold finished\n126\n98\n29%\n487\n426\n14%\nFabricated concrete\nreinforcing steel\n285\n258\n10%\n1,142\n1,115\n2%\nOther\n865\n826\n5%\n3,316\n3,035\n9%\n6,542\n5,815\n13%\n26,492\n24,309\n9%\nCONDENSED CONSOLIDATED STATEMENTS OF EARNINGS (Unaudited)\n(In thousands, except per share data)\nThree Months (13 Weeks) Ended\nTwelve Months (52 Weeks) Ended\nDec. 31, 2017\nDec. 31, 2016\nDec. 31, 2017\nDec. 31, 2016\nNet sales\n$ 5,092,328\n$ 3,956,538\n$ 20,252,393\n$ 16,208,122\nCosts, expenses and other:\nCost of products sold\n4,571,760\n3,513,112\n17,682,986\n14,182,215\nMarketing, administrative and other expenses\n168,102\n156,082\n687,531\n596,761\nEquity in earnings of unconsolidated affiliates\n(11,860)\n(8,525)\n(41,661)\n(38,757)\nInterest expense, net\n42,085\n40,829\n173,580\n169,244\n4,770,087\n3,701,498\n18,502,436\n14,909,463\nEarnings before income taxes and\nnoncontrolling interests\n322,241\n255,040\n1,749,957\n1,298,659\nProvision for income taxes\n(72,853)\n79,855\n369,386\n398,243\nNet earnings\n395,094\n175,185\n1,380,571\n900,416\nEarnings attributable to\nnoncontrolling interests\n11,203\n15,546\n61,883\n104,145\nNet earnings attributable to\nNucor stockholders\n$ 383,891\n$ 159,639\n$ 1,318,688\n$ 796,271\nNet earnings per share:\nBasic\n$1.20\n$0.50\n$4.11\n$2.48\nDiluted\n$1.20\n$0.50\n$4.10\n$2.48\nAverage shares outstanding:\nBasic\n319,210\n319,921\n319,990\n319,563\nDiluted\n319,967\n320,396\n320,773\n319,822\nCONDENSED CONSOLIDATED BALANCE SHEETS (Unaudited)\n(In thousands)\nDec. 31, 2017\nDec. 31, 2016\nASSETS\nCurrent assets:\nCash and cash equivalents\n$ 949,104\n$ 2,045,961\nShort-term investments\n50,000\n150,000\nAccounts receivable, net\n2,028,545\n1,631,676\nInventories, net\n3,461,686\n2,479,958\nOther current assets\n335,085\n198,798\nTotal current assets\n6,824,420\n6,506,393\nProperty, plant and equipment, net\n5,093,147\n5,078,650\nGoodwill\n2,196,058\n2,052,728\nOther intangible assets, net\n914,646\n866,835\nOther assets\n812,987\n718,912\nTotal assets\n$ 15,841,258\n$ 15,223,518\nLIABILITIES\nCurrent liabilities:\nShort-term debt\n$ 52,833\n$ 17,959\nLong-term debt due within one year\n500,000\n600,000\nAccounts payable\n1,181,346\n838,109\nSalaries, wages and related accruals\n516,660\n428,829\nAccrued expenses and other current liabilities\n573,925\n505,069\nTotal current liabilities\n2,824,764\n2,389,966\nLong-term debt due after one year\n3,242,242\n3,739,141\nDeferred credits and other liabilities\n689,464\n839,703\nTotal liabilities\n6,756,470\n6,968,810\nEQUITY\nNucor stockholders' equity:\nCommon stock\n151,960\n151,734\nAdditional paid-in capital\n2,021,339\n1,974,672\nRetained earnings\n8,463,709\n7,630,916\nAccumulated other comprehensive loss,\nnet of income taxes\n(254,681)\n(317,843)\nTreasury stock\n(1,643,291)\n(1,559,614)\nTotal Nucor stockholders' equity\n8,739,036\n7,879,865\nNoncontrolling interests\n345,752\n374,843\nTotal equity\n9,084,788\n8,254,708\nTotal liabilities and equity\n$ 15,841,258\n$ 15,223,518\nCONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS (Unaudited)\n(In thousands)\nTwelve Months (52 Weeks) Ended\nDec. 31, 2017\nDec. 31, 2016\nOperating activities:\nNet earnings\n$ 1,380,571\n$ 900,416\nAdjustments:\nDepreciation\n635,833\n613,192\nAmortization\n91,228\n73,862\nStock-based compensation\n64,176\n56,511\nDeferred income taxes\n(221,173)\n71,455\nDistributions from affiliates\n49,295\n40,602\nEquity in earnings of unconsolidated affiliates\n(41,661)\n(38,757)\nChanges in assets and liabilities (exclusive of acquisitions and dispositions):\nAccounts receivable\n(329,501)\n(217,736)\nInventories\n(900,946)\n(132,639)\nAccounts payable\n314,817\n236,788\nFederal income taxes\n(107,577)\n3,555\nSalaries, wages and related accruals\n83,625\n133,544\nOther operating activities\n32,576\n9,127\nCash provided by operating activities\n1,051,263\n1,749,920\nInvesting activities:\nCapital expenditures\n(448,555)\n(604,840)\nInvestment in and advances to affiliates\n(59,000)\n(63,167)\nDivestiture of affiliates\n-\n135,000\nDisposition of plant and equipment\n25,315\n18,571\nAcquisitions (net of cash acquired)\n(544,041)\n(474,788)\nPurchases of investments\n(50,000)\n(650,000)\nProceeds from the sale of investments\n150,000\n600,000\nOther investing activities\n7,389\n14,106\nCash used in investing activities\n(918,892)\n(1,025,118)\nFinancing activities:\nNet change in short-term debt\n34,872\n(33,360)\nRepayment of long-term debt\n(600,000)\n-\nIssuance of common stock\n11,145\n15,751\nPayment of tax withholdings on certain stock-based compensation\n(14,408)\n(12,387)\nExcess tax benefits from stock-based compensation\n-\n2,784\nDistributions to noncontrolling interests\n(90,974)\n(99,588)\nCash dividends\n(485,321)\n(481,083)\nAcquisition of treasury stock\n(90,304)\n(5,173)\nOther financing activities\n(3,241)\n(13,297)\nCash used in financing activities\n(1,238,231)\n(626,353)\nEffect of exchange rate changes on cash\n9,003\n8,043\n(Decrease) increase in cash and cash equivalents\n(1,096,857)\n106,492\nCash and cash equivalents - beginning of year\n2,045,961\n1,939,469\nCash and cash equivalents - end of year\n$ 949,104\n$ 2,045,961\nNon-cash investing activity:\nChange in accrued plant and equipment purchases and\nassets acquired by capital lease arrangements\n$ 58,519\n$ 12,837\nView original content: http://www.prnewswire.com/news-releases/nucor-reports-results-for-fourth-quarter-and-year-ended-2017-300590209.html\nSOURCE Nucor Corporation", "external_links": ["http://www.prnewswire.com/news-releases/nucor-reports-results-for-fourth-quarter-and-year-ended-2017-300590209.html", "http://www.nucor.com/"], "published": "2018-01-30T17:00:00.000+02:00", "crawled": "2018-01-30T18:43:28.000+02:00", "highlightTitle": ""}