{"organizations": [], "uuid": "ce4fa86e049c1dacf956045582ff8a9659d1c4e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104933995-studentloanhero_kellermeyer.1910x1000.png", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/08/kellermeyers-stopped-paying-rent-and-now-saves-2000-a-month.html", "country": "US", "domain_rank": 767, "title": "Kellermeyers stopped paying rent and now saves $2,000 a month", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-08T20:39:00.000+02:00", "replies_count": 0, "uuid": "ce4fa86e049c1dacf956045582ff8a9659d1c4e5"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/08/kellermeyers-stopped-paying-rent-and-now-saves-2000-a-month.html", "ord_in_thread": 0, "title": "Kellermeyers stopped paying rent and now saves $2,000 a month", "locations": [], "entities": {"persons": [{"name": "dan", "sentiment": "negative"}, {"name": "tracy kellermeyer", "sentiment": "negative"}, {"name": "kellermeyers", "sentiment": "negative"}, {"name": "las", "sentiment": "negative"}, {"name": "tracy", "sentiment": "none"}], "locations": [{"name": "oregon", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "student", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "In the past year, Dan and Tracy Kellermeyer have lived in Colorado, Arizona, Texas, Oregon, and Las Vegas. While all that travel sounds expensive, the pair has managed not to spend a dime on housing costs.\n\"We came up with the idea that if we could string together back-to-back house-sits, then we could live rent- and utility-free and travel the U.S.,\" says Dan. Now, the nomadic couple shares their housesitting experiences on their blog, Sitters on Tour .\nHere's how the couple got started as housesitting hustlers — and their advice for others looking to do the same.\nMore from Student Loan Hero: \nWhy millennials could be the last generation with crippling student loan debt\nStudent loan payment calculator\nFind the best private student loan rates \nWhen one door closed, another opened Before they became digital nomads, Dan and Tracy rented a townhouse in the suburbs of Chicago. Dan had started working from home as a business analyst, but Tracy got laid off from her job as a program manager for a wellness company.\n\"That was a big turning point in our lives,\" says Dan. \"With the loss of her income, we started thinking outside the box.\" Since Dan's job was already location independent, they brainstormed ways to work and travel at the same time .\n\"We both loved to travel and started reading about how other people were traveling the U.S. and the world while working from home,\" says Dan. \"We still wanted to stay mindful of our budget, so we looked at other options and that's when we found housesitting.\"\nSource: Student Loan Hero Dan and Tracy Kellermeyer Housesitters typically stay in someone's home for weeks or months at a time. They're responsible for taking care of the property, as well as caring for any pets that live there.\nAfter working with their landlord to end their lease early, Dan and Tracy built their profile on TrustedHousesitters and House Sitters America . \"Within a few months, we had our first four-month housesitting gig,\" says Dan.\nSince then, the couple has moved around the Western U.S., building their careers and saving money as they go.\nUsing their savings to pay off student loans Although the costs of moving so frequently would usually add up, Dan and Tracy actually save thousands per month as housesitters. In fact, Dan estimates their full-time housesitting saves the pair over $24,000 per year.\nSo what are they doing with all the extra savings? \"We initially decided to take all the money we saved by not paying rent and use it to pay off our student loans faster,\" says Dan. \"We both still have about $100,000 in student loans combined.\"\nshow chapters The craziest things Johnny Depp bought with his millions      5:53 PM ET Fri, 29 Sept 2017 | 01:48 Dan owes about $60,000 in undergraduate loans after attending Purdue University, and Tracy has about $40,000 from the University of Wisconsin. After graduating, they refinanced their federal loans to lower their monthly payments.\nToday, though, Dan and Tracy's priorities have shifted away from paying off their debt as fast as possible. While they still make minimum payments, their current focus is investing in their careers.\nBuilding their careers as digital nomads Now that Dan and Tracy aren't tied to one city, they're taking advantage of their new lifestyle and building their dream careers .\n\"After five or six months, we realized that this lifestyle could also allow us to pursue careers that were more fulfilling to us,\" says Dan. \"I ended up leaving my full-time job to focus on building my financial planning practice.\"\nDan founded New Heights Financial Planning, where he works as a financial planner with clients all over the country. He provides virtual consulting on living a location-independent lifestyle.\nHe also founded New Heights Solutions, which mainly provides virtual assistant services to financial planners. Tracy, meanwhile, now works as a \"taskmaster\" with the company, providing online administrative support to its various clients.\nshow chapters A tiny house helped one couple pay off more than $200,000 in debt      10:58 AM ET Wed, 27 Sept 2017 | 01:09 Plus, both Dan and Tracy are building out their blog, crafting guides on housesitting, travel, and adopting a minimalist lifestyle.\nTo grow their various businesses, Dan and Tracy prefer long-term housesitting arrangements over short-term ones. \"People wonder if we are on vacation all the time, but we still work normal work hours,\" says Dan. \"[It] just happens to be from a new city every few months!\"\nBuilding up an emergency fund is key Starting any new business is risky, especially if you're doing it from the road. To protect themselves, Dan and Tracy save money in an emergency fund. \"A solid emergency fund is a must for anyone setting out on a nomadic lifestyle,\" says Dan.\nNot only is an emergency fund essential if you lose your income, but it's useful if a housesitting gig goes south. In Phoenix, for instance, Dan and Tracy found themselves in a prickly situation.\nshow chapters A couple that paid off $52,000 of debt in 18 months shares their saving secrets      12:29 PM ET Mon, 3 April 2017 | 01:30 \"The homeowners moved to a different house in the middle of our three-month sit and we found seven scorpions during our stay in the new house,\" says Dan. Though the couple did fulfill their contract and finish the job, they were comforted knowing they could have quit early thanks to their savings.\nSince a location-independent lifestyle can be unpredictable, preparing for random expenses is key. Build a three- to six-month emergency fund to help you be ready for whatever comes your way.\nDo your research before you hit the road Apart from their scorpion encounter, Dan and Tracy have had mostly positive experiences as housesitters. Their favorite stay was at a ranch in Durango, Colorado, where they watched 13 barn cats and spent the winter skiing.\nTo ensure a safe and comfortable experience, the couple recommends drawing up a contract with the homeowner. Make sure you outline the terms of the agreement, including the address and dates of your stay, along with who is responsible for paying for utilities.\n\"Most pets and people are great, but you do have to do more due diligence so you don't get into a negative situation,\" says Dan. While Dan and Tracy accept long-term assignments, they also recommend housesitting for shorter trips.\n\"Housesitting can be a great way to vacation, even if you aren't looking to do it full time,\" says Dan. \"If you want to spend the holidays somewhere new, you might look for a housesitting gig for a week or two.\"\nWhatever your goals, you can find ways to cut back costs and save money. \"There are so many different ways to live a nomadic lifestyle , and each one has its quirks,\" says Dan. \"Do your research and connect with other people living the lifestyle before you set out on your own journey.\"\nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: 5 companies that will help you pay off your student debt \nThis article originally appeared on Student Loan Hero. \nVideo by Andrea Kramar \nshow chapters 30-year-old millionaire got out of debt with this simple banking trick      12:08 PM ET Tue, 7 March 2017 | 00:51", "external_links": ["https://studentloanhero.com/featured/digital-nomad-travel-globe/", "https://www.housesittersamerica.com/", "https://studentloanhero.com/featured/how-to-save-money-everyday-tips/", "https://studentloanhero.com/featured/millennials-last-generation-crippling-student-loan-debt/", "https://sittersontour.com/", "https://studentloanhero.com/featured/get-paid-to-travel-jobs/", "https://studentloanhero.com/featured/how-to-build-an-emergency-fund-creative/", "https://www.facebook.com/CNBCMakeIt/", "https://studentloanhero.com/featured/what-job-is-right-for-me/", "https://studentloanhero.com/featured/should-i-refinance-my-student-loans/", "https://studentloanhero.com/featured/couple-how-stop-paying-rent-saves-month/", "https://studentloanhero.com/calculators/student-loan-payment-calculator/", "https://www.trustedhousesitters.com/us/", "https://studentloanhero.com/marketplace/private-student-loans/"], "published": "2018-01-08T20:39:00.000+02:00", "crawled": "2018-01-08T20:05:11.008+02:00", "highlightTitle": ""}