{"organizations": [], "uuid": "7ed3a936041aa7667f778b376c8c4ff4dc820543", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/italy-factors-jan-25/italy-factors-to-watch-on-jan-25-idUSL8N1PA3QZ", "country": "US", "domain_rank": 408, "title": "Italy - Factors to watch on Jan. 25", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T07:00:00.000+02:00", "replies_count": 0, "uuid": "7ed3a936041aa7667f778b376c8c4ff4dc820543"}, "author": "", "url": "https://www.reuters.com/article/italy-factors-jan-25/italy-factors-to-watch-on-jan-25-idUSL8N1PA3QZ", "ord_in_thread": 0, "title": "Italy - Factors to watch on Jan. 25", "locations": [], "entities": {"persons": [{"name": "letizia moratti", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "marie-anne barbat-layani", "sentiment": "none"}, {"name": "victor massiah", "sentiment": "none"}, {"name": "paolo gentiloni", "sentiment": "none"}, {"name": "giovanni sabatini", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}, {"name": "milan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "bank", "sentiment": "none"}, {"name": "ubi banca management board", "sentiment": "none"}, {"name": "istat", "sentiment": "none"}, {"name": "abi", "sentiment": "none"}, {"name": "ebf", "sentiment": "none"}, {"name": "ebf) executive committee", "sentiment": "none"}, {"name": "european banking federation", "sentiment": "none"}, {"name": "green finance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The following factors could affect Italian markets on Thursday.\nReuters has not verified the newspaper reports, and cannot vouch for their accuracy. New items are marked with (*).\nFor a complete list of diary events in Italy please click on .\nPOLITICS Italian Prime Minister Paolo Gentiloni sent a message to U.S. President Donald Trump on Wednesday that leaders can defend their countries’ interests but must respect existing international agreements.\nECONOMY ISTAT releases November orders and sales data (0900 GMT); December non-EU foreign trade (1000 GMT).\nItalian banking association ABI holds news conference on “Bank’s Role to Support Sustainable Growth and Green Finance” with ABI Director General and European Banking Federation (EBF) Executive Committee President Giovanni Sabatini, EBF Director General Marie-Anne Barbat-Layani in Rome (1300 GMT).\nPresentation of a report on global economy and Italy with UBI Banca Management Board President Letizia Moratti and CEO Victor Massiah in Milan (1630 GMT).\nDEBT Treasury announces sale of BTP and CCTeu bonds, with relative amounts to be auctioned on Jan. 30.\nCOMPANIES (*) BANCO BPM The lender is weighing the possibility to increase the amount of soured loans to be sold this year to 5 billion euros from 3 billion euros, MF reported adding Mediobanca, Banca Akros and Prelios could advise the bank on the plan.\nENI Italian oil and gas group Eni said on Wednesday afternoon that it was carrying out exploratory drilling in the Black Sea in a Rosneft-led ROSN.MM offshore project - while ensuring its activities comply with U.S. sanctions on Russia.\nFIAT CHRYSLER Board meeting on Q4 and FY results, followed by conference call (1300 GMT).\n(*) STMICROELECTRONICS STMicroelectronics capped its best year since 2010 with strong, broad-based revenue growth and rising margins during 2017, and the chipmaker expected solid auto and industrial demand to offset a seasonal smartphone dip in the first quarter.\nA conference call will follow at 0830 GMT.\nSTMicroelectronics said CEO Carlo Bozotti will step down after 2018 shareholder general meeting, adding deputy Ceo Jean-Marc Chery has been proposed as sole member of the managing board. Chery will become president and CEO, while CFO Carlo Ferro will step down.\nTOD‘S\nItalian luxury group Tod’s said on Wednesday results from the company’s new management team would be visible starting from the second part of the year, though admitting 2018 will be a “year of transition.”\nIPO, ITALO Kepler Cheuvreux sees the enterprise value of IPO candidate Italo at around 2.15 billion euros ($2.7 billion), a copy of a presentation to investors showed.\nVITTORIA ASSICURAZIONI The insurance said on Wednesday it expected a 3.3 percent increase in non-life premiums this year.\nCTI BIOPHARMA The group said its shareholders on Wednesday approved a merger with CTI Biopharma Corp.. As a consequence, shares in the group will be delisted from the Milan bourse.\nDE LONGHI Board meeting on FY preliminary results; followed by conference call.\nINDUSTRIA E INNOVAZIONE Capital increase ends (started on Dec. 29, 2017).\nMEDIOBANCA A special purpose acquisition company (SPAC) promoted by Italian merchant bank Mediobanca and other investors will be listed on the Milan bourse in early February, two market sources said on Wednesday.\nFor Italian market data and news, click on codes in brackets:\n20 biggest gainers (in percentage)\n20 biggest losers (in percentage)\nFTSE IT allshare index\nFTSE Mib index\nFTSE Allstars index...\nFTSE Mid Cap index....\nBlock trades\nStories on Italy IT-LEN\nFor pan-European market data and news, click on codes in brackets: European Equities speed guide FTSEurofirst 300 index DJ STOXX index Top 10 STOXX sectors Top 10 EUROSTOXX sectors Top 10 Eurofirst 300 sectors Top 25 European pct gainers Top 25 European pct losers Main stock markets: Dow Jones Wall Street report Nikkei 225 Tokyo report FTSE 100 London report Xetra DAX Frankfurt market stories CAC-40 Paris market stories... World Indices Reuters survey of world bourse outlook Western European IPO diary European Asset Allocation Reuters News at a Glance: Equities Main currency report:\n ", "external_links": [], "published": "2018-01-25T07:00:00.000+02:00", "crawled": "2018-01-25T07:21:49.000+02:00", "highlightTitle": ""}