{"organizations": [], "uuid": "4992a69399db4629fce1519bd8eb1780ad5074c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226765653&w=1200&r=LYNXMPEE0U01K", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-japan-economy-output/japan-factory-output-rises-points-to-solid-fourth-quarter-gdp-growth-idUSKBN1FK04A", "country": "US", "domain_rank": 408, "title": "Japan factory output rises, points to solid fourth-quarter GDP growth", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T08:45:00.000+02:00", "replies_count": 0, "uuid": "4992a69399db4629fce1519bd8eb1780ad5074c3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-japan-economy-output/japan-factory-output-rises-points-to-solid-fourth-quarter-gdp-growth-idUSKBN1FK04A", "ord_in_thread": 0, "title": "Japan factory output rises, points to solid fourth-quarter GDP growth", "locations": [], "entities": {"persons": [{"name": "takeshi mina", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ministry of economy, trade and industry", "sentiment": "none"}, {"name": "meti", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO (Reuters) - Japan’s industrial output grew in December at the fastest pace in eight months, and up for a third straight month, in a sign that its humming factories have likely driven economic expansion for an eighth consecutive quarter.\nTrade ministry data out on Wednesday showed factory output grew 2.7 percent in December from the previous month, handily beating economists’ median estimate of a 1.6 percent increase, following a 0.5 percent gain in November.\nThe gain was led by transport equipment, and general-purpose, production and business-oriented machinery.\nManufacturers surveyed by the Ministry of Economy, Trade and Industry (METI) expect output to fall 4.3 percent in January and increase 5.7 percent in February.\nEconomists expect factory output to remain in a recovery trend in line with the robust global economy and a pickup in domestic demand, with the jobs market being the tightest in decades, barring risks from global politics and U.S. protectionism.\n“As the global economy is gathering momentum, exports are rising, helping output stay in an uptrend,” said Takeshi Minami, chief economist at Norinchukin Research Institute.\n“A gradual pickup in private consumption and solid capital spending should also support factory activity although it may slow temporarily in the export-slowing month of January.”\nFor October-December, factory output grew 1.8 percent from the previous three months, up for a seventh straight quarter, pointing to a solid growth in gross domestic product in the same quarter.\nJapan’s economy has been in its best shape in years over the past year, with gross domestic product expanding for the seventh straight quarter through last September.\nThe output gap - one of several factors the government watches in determining whether the economy is sustainably out of deflation - shows demand exceeds supply by the most in more than nine years, according to central bank data.\nThe Bank of Japan data out this month put the output gap - calculated by subtracting the economy’s potential supply from actual demand - at plus 1.35 percent in the three months to September, the highest reading since the first quarter of 2008.\nA positive output gap generally helps boost prices and should encourage Bank of Japan policymakers struggling to accelerate inflation to its 2 percent target.\nInflation, however, has lagging a robust economic revival despite recent improvements in wages and consumer spending, leaving the central bank in a bind on when and how it should exit crisis-mode monetary stimulus.\nThe trade ministry on Wednesday stuck to its assessment of factory output, which it described as “picking up”.\nReporting by Tetsushi Kajimoto; Editing by Eric Meijer\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T08:45:00.000+02:00", "crawled": "2018-01-31T16:32:32.007+02:00", "highlightTitle": ""}