{"organizations": [], "uuid": "7c2975b58b4084b6df3d8fedbb73f4404ba655a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218908791&w=1200&r=LYNXMPEE010ZZ", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/aviation-safety-trump/trump-draws-rebukes-after-touting-aviation-safety-record-idINKBN1ER1VR", "country": "US", "domain_rank": 408, "title": "Trump draws rebukes after touting aviation safety record", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T00:59:00.000+02:00", "replies_count": 0, "uuid": "7c2975b58b4084b6df3d8fedbb73f4404ba655a2"}, "author": "", "url": "https://in.reuters.com/article/aviation-safety-trump/trump-draws-rebukes-after-touting-aviation-safety-record-idINKBN1ER1VR", "ord_in_thread": 0, "title": "Trump draws rebukes after touting aviation safety record", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "reuters/carlos barria", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "david shepardson", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "west palm beach international airport", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - U.S. President Donald Trump took credit on Tuesday for a record year of safety for commercial aviation in 2017, swiftly drawing criticism and derision from commentators who said the achievement reflected trends predating his administration.\nPresident Donald Trump reacts as he arrives at West Palm Beach international airport, December 22, 2017. REUTERS/Carlos Barria “Since taking office I have been very strict on Commercial Aviation. Good news - it was just reported that there were Zero deaths in 2017, the best and safest year on record!” Trump tweeted on Tuesday.\nTwo safety groups reported on Monday that worldwide there were no fatal passenger jet crashes in 2017, the safest year on record.\nCurrent and former aviation safety officials said Trump was not responsible for last year’s unblemished commercial passenger jet safety record, citing years-long improvements in safety and the fact that no U.S. passenger airliner has had a fatal crash since 2009.\nAviation Safety Network President Harro Ranter, whose group tracks aviation incidents, said in an email: ”It’s impossible to link the worldwide level of safety directly to recent U.S. policy changes.\n“U.S. efforts have been instrumental to get to where we are today, but it takes years for policy changes to reach effect, and only in conjunction with other efforts by the aviation industry,” Ranter said.\nTrump has been frequently criticized for taking credit for developments that could not be directly attributed to his administration.\nWhite House spokeswoman Sarah Sanders did not answer directly when asked at a briefing if Trump’s White House predecessor, Barack Obama, also deserved credit for the long stretch without a U.S. commercial passenger jet crash.\nTrump, who took office in January 2017, discussed aviation on only a couple of occasions last year. In remarks to airline executives in February, he did not raise safety but criticized the “regulatory morass” affecting the industry.\nSanders said Trump “has raised the bar for our nation’s aviation safety and security,” citing his proposal to privatise air traffic control, which has not been approved, and the Homeland Security Department’s enhanced security measures.\nIn March, the United States imposed restrictions on passengers carrying laptops in cabins on nine primarily Middle Eastern airlines to address the potential threat of hidden explosives. It lifted the restrictions in July after announcing new security requirements.\nIn a tongue-in-cheek thank you to Trump, actor Bryan Cranston, who starred in TV’s ”Breaking Bad,’ tweeted: “Your active participation monitoring the flight patterns and safety regulations was greatly appreciated. In 2018 could you please turn your efforts toward preventing wildfires and hurricanes?”\nReporting by David Shepardson; Editing by Chris Sanders and Peter Cooney\n ", "external_links": [], "published": "2018-01-03T00:59:00.000+02:00", "crawled": "2018-01-03T01:34:52.008+02:00", "highlightTitle": ""}