{"organizations": [], "uuid": "01fb0c4ab29534cfaf238757f70d89cd0a1c5eba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/09/the-associated-press-spacex-says-rocket-performance-ok-in-secret-satellite-launch.html", "country": "US", "domain_rank": 767, "title": "SpaceX says rocket performance OK in secret satellite launch", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T19:12:00.000+02:00", "replies_count": 0, "uuid": "01fb0c4ab29534cfaf238757f70d89cd0a1c5eba"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/09/the-associated-press-spacex-says-rocket-performance-ok-in-secret-satellite-launch.html", "ord_in_thread": 0, "title": "SpaceX says rocket performance OK in secret satellite launch", "locations": [], "entities": {"persons": [{"name": "zuma", "sentiment": "none"}, {"name": "gwynne shotwell", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "cape canaveral", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "cape canaveral", "sentiment": "none"}], "organizations": [{"name": "spacex", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "northrop grumman", "sentiment": "none"}, {"name": "falcon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAPE CANAVERAL, Fla. (AP) — SpaceX defended its rocket performance during the weekend launch of a secret U.S. satellite, responding Tuesday to media reports that the satellite codenamed Zuma was lost.\nCompany President Gwynne Shotwell said the Falcon 9 rocket \"did everything correctly\" Sunday night and suggestions otherwise are \"categorically false.\"\nNorthrop Grumman — which provided the satellite for an undisclosed U.S. government entity — said it cannot comment on classified missions. The company chose SpaceX as the launch provider, noting late last year that it took \"great care to ensure the most affordable and lowest risk scenario for Zuma.\"\nThis was SpaceX' s third classified mission for the U.S. government, a lucrative customer. It was so shrouded in secrecy that the sponsoring government agency was not even identified, as is usually the case.\nThe Falcon's first stage completed its job, lifting the rocket off the pad and toward space, then separated and landed back at Cape Canaveral. But second-stage information was kept to a minimum because of all the secrecy surrounding the flight. The rocket's second stage propels the satellite into orbit.\nThe Wall Street Journal quotes unidentified congressional officials who were briefed on the mission as saying the satellite apparently did not separate from the rocket's second stage, and plunged through the atmosphere and burned up.\nOriginally scheduled for a November launch, Zuma was delayed by potential concern about another mission's payload fairing, the shell on top that protects a satellite during launch. The company later said it had cleared the issue.\nShotwell said in a statement that since no rocket changes are warranted for upcoming flights, the company's launch schedule remains on track. If additional reviews uncover any problems, she said, \"we will report it immediately.\"\nLast year was a banner year for the private space company with 18 launches. It's shooting for even more flights in 2018.\nSpaceX's new, powerful rocket, the Falcon Heavy, was at its launch pad at NASA's Kennedy Space Center on Tuesday, awaiting an engine test-firing sometime this week. The California-based company aims to launch the Heavy by month's end, making its debut with chief executive Elon Musk's own personal Tesla Roadster on board. Another Falcon 9, meanwhile, is scheduled to fly in three weeks with a communication satellite for Luxembourg.", "external_links": [], "published": "2018-01-09T19:12:00.000+02:00", "crawled": "2018-01-09T20:42:46.011+02:00", "highlightTitle": ""}