{"organizations": [], "uuid": "fa39404a2682faecae48d618c67eae7a3ee50e71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-equities-climb-amid-shutdown-threat-treasury-yields-hit-3-year-high-idUSL8N1PE47V", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Equities climb amid shutdown threat, Treasury yields hit 3-year high", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-20T00:30:00.000+02:00", "replies_count": 0, "uuid": "fa39404a2682faecae48d618c67eae7a3ee50e71"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-equities-climb-amid-shutdown-threat-treasury-yields-hit-3-year-high-idUSL8N1PE47V", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Equities climb amid shutdown threat, Treasury yields hit 3-year high", "locations": [], "entities": {"persons": [{"name": "chuck mikolajczak", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "treasury", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Worries over possible U.S. government shutdown weigh on dollar\n* US lawmakers try to cobble together deal to avert shutdown\n* 10-year Treasury yields highest since Sep 2014 (Updates with U.S. market open, changes byline, dateline; previous LONDON)\nBy Chuck Mikolajczak\nNEW YORK, Jan 19 (Reuters) - World equity markets climbed to a record on Friday as the U.S. dollar languished near three-year lows and a U.S. government shutdown loomed, while U.S. Treasury yields continued their steady rise to hit their highest levels since September 2014.\nPresident Donald Trump postponed plans to leave Washington while the U.S. Congress faced a midnight deadline to come up with funding legislation to avoid the shutdown.\nLegislation to stave off an imminent federal government shutdown encountered obstacles in the Senate on Thursday night, despite the passage of a month-long funding bill by the House of Representatives hours earlier.\nWithout an infusion of new money, no matter how temporary, hundreds of thousands of “non-essential” federal workers may be put on furlough, while “essential” employees, dealing with public safety and national security, would continue working.\n“The expectation is they will do something to keep the government open even for a short time but even if they don’t, life goes on,” said David Joy, chief market strategist at Ameriprise Financial in Boston.\nShares of Wall Street were slightly higher, with each of the major Wall Street indexes on track for their third straight weekly gain.\nThe Dow Jones Industrial Average fell 45.49 points, or 0.17 percent, to 25,972.32, the S&P 500 gained 2.8 points, or 0.10 percent, to 2,800.83 and the Nasdaq Composite added 14.06 points, or 0.19 percent, to 7,310.11.\nThe trade-weighted dollar index was last up 0.08 percent, on pace for its fifth straight weekly drop, and is down nearly 2 percent so far in 2018. The euro down 0.08 percent to $1.2227.\nEuropean shares were higher, helped by gains in mining shares.\nThe pan-European FTSEurofirst 300 index rose 0.35 percent and MSCI’s gauge of stocks across the globe gained 0.26 percent. MSCI’s index was poised for its ninth straight week of gains.\nYields on the 10-year U.S. government bond hit their highest level in three years on Friday as weakness in overnight trading pushed the debt through key technical support levels, which resulted in further selling.\nThe benchmark 10-year yield hit its highest level since September 2014 at 2.646 percent, breaking the 2017 high of 2.64 percent which the market had been flirting with all week.\n“That is still a manageable level for equities, so this move doesn’t necessarily surprise us. Markets will begin to take increasing notice the higher it gets, if it continues to inch higher,” said Joy.\nBenchmark 10-year notes last fell 9/32 in price to yield 2.6444 percent, from 2.611 percent late on Thursday.\nOil prices retreated and were on course to snap a four-week winning streak, as a bounce-back in U.S. production outweighed ongoing declines in crude inventories.\nU.S. crude fell 1.11 percent to $63.24 per barrel and Brent was last at $68.56, down 1.08 percent on the day.\nReporting by Chuck Mikolajczak; Editing by Nick Zieminski\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-20T00:30:00.000+02:00", "crawled": "2018-01-20T03:01:58.000+02:00", "highlightTitle": ""}