{"organizations": [], "uuid": "0ba9f5767292ffa840f133ba9cd5ba25da4a5c7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224043988&w=1200&r=LYNXMPEE0L098", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-walmart-m-a/wal-mart-shops-brazil-unit-stake-to-advent-other-funds-sources-idUKKBN1FB0DT", "country": "US", "domain_rank": 408, "title": "Wal-Mart shops Brazil unit stake to Advent, other funds - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T06:36:00.000+02:00", "replies_count": 0, "uuid": "0ba9f5767292ffa840f133ba9cd5ba25da4a5c7e"}, "author": "", "url": "https://uk.reuters.com/article/uk-walmart-m-a/wal-mart-shops-brazil-unit-stake-to-advent-other-funds-sources-idUKKBN1FB0DT", "ord_in_thread": 0, "title": "Wal-Mart shops Brazil unit stake to Advent, other funds - sources", "locations": [], "entities": {"persons": [{"name": "doug mcmillon", "sentiment": "none"}, {"name": "tatiana bautzer", "sentiment": "none"}, {"name": "acon", "sentiment": "none"}], "locations": [{"name": "brazil", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "wal-mart", "sentiment": "negative"}, {"name": "gp investments ltd", "sentiment": "none"}, {"name": "wal-mart stores inc", "sentiment": "none"}, {"name": "advent international corp", "sentiment": "none"}, {"name": "min read  sao paulo", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "goldman sachs & co", "sentiment": "none"}, {"name": "acon investments llc", "sentiment": "none"}, {"name": "goldman", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 4:36 AM / Updated 22 minutes ago Wal-Mart shops Brazil unit stake to Advent, other funds - sources Tatiana Bautzer , carolina mandl 4 Min Read \nSAO PAULO (Reuters) - Wal-Mart Stores Inc ( WMT.N ) is in talks with buyout firm Advent International Corp and other funds to sell a major stake in its Brazilian operations, two people with direct knowledge of the matter said on Sunday. \nWal-Mart is being advised by Goldman Sachs & Co, according to one of the sources who spoke on condition of anonymity. Other private equity firms that are looking into the investment in the Brazilian unit are GP Investments Ltd GPIV11.LU and Acon Investments LLC, the source added. \nWal-Mart officials in Brazil declined to comment. Advent and GP declined to comment. Goldman and Acon did not immediately reply to requests for comment. \nWal-Mart’s overseas business is not the growth driver it once was as it has continued to grapple with an economic slowdown in Brazil and competition from discount retailers in the UK. \nIn 2016, Wal-Mart Chief Executive Officer Doug McMillon flagged to investors that he was planning to review its global operations. His comments had sparked speculation that Wal-Mart would look to restructure or even pull out of markets where it has struggled. Brazil was among the countries most often cited by analysts as a potential target. \nDuring the same year, Wal-Mart shuttered at least 10 percent of its stores in Brazil and shed non-core businesses across Latin America. It also sold its e-commerce business in China to Chinese e-commerce company JD.com ( JD.O ) and picked up a stake in JD.com instead of trying to crack the market on its own. \nA partial exit by Wal-Mart from Brazil comes as Chief Operating Officer Judith McKenna takes over the international unit of the world’s biggest retailer. The move would give a new partner the chance to turn around a sprawling operation that has struggled to turn a profit. \nWal-Mart entered Brazil in 1995 and had grown into the country’s third-largest retailer following two major acquisitions in 2004 and 2005 and a period of rapid store expansion that came to a halt in 2013. \nIt currently operates 471 stores in Brazil, according to the company’s local website. The retailer’s Brazilian unit reported revenues of almost 30 billion reais (6.78 billion pounds) in 2016. \nWal-Mart has posted operating losses in Brazil for seven years in a row after an aggressive, decade-long expansion left it with poor locations, inefficient operations, labour troubles and uncompetitive prices, Reuters reported early in 2016.( reut.rs/2DWNOtp ) \nOne of the people with knowledge of the deal said Wal-Mart’s operations in Brazil had not improved over the last two years, which coincided with the country’s harshest recession in decades. \nWal-Mart began sounding out possible investors in the unit several months ago but got no interest from rival retailers, which led the company to seek out buyout firms, the source said. \nThe retailer intends to keep a stake in the Brazilian unit to be able to recoup part of its losses in the country later if an economic recovery and restructured operations boost results, according to the source. \nRetail sales in Brazil are starting to recover from the recession. Christmas sales were 5.6 percent higher than a year ago, according to credit data supplier Serasa Experian. \nEarlier on Sunday, newspaper O Globo said private equity Advent was in talks to acquire 50 percent of the Wal-Mart unit. The paper did not say how it got the information or any details on the state of the talks. Additional reporting by Marcelo Teixeira and Nandita Bose in New York; Editing by Brad Haynes, Paul Simao and Himani Sarkar", "external_links": [], "published": "2018-01-22T06:36:00.000+02:00", "crawled": "2018-01-22T07:04:46.000+02:00", "highlightTitle": ""}