{"organizations": [], "uuid": "5154119ed82f80957587ff4da713502b5c0c7d06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222730241&w=1200&r=LYNXMPEE0G0WQ", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/india-economy-borrowings/government-cuts-extra-borrowing-but-markets-still-nervous-idINKBN1F61MB", "country": "US", "domain_rank": 408, "title": "Government cuts extra borrowing but markets still nervous", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T09:53:00.000+02:00", "replies_count": 0, "uuid": "5154119ed82f80957587ff4da713502b5c0c7d06"}, "author": "", "url": "https://in.reuters.com/article/india-economy-borrowings/government-cuts-extra-borrowing-but-markets-still-nervous-idINKBN1F61MB", "ord_in_thread": 0, "title": "Government cuts extra borrowing but markets still nervous", "locations": [], "entities": {"persons": [{"name": "swati bhat", "sentiment": "none"}, {"name": "manoj kumar", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 1:20 PM / Updated an hour ago Government cuts extra borrowing but markets still nervous Swati Bhat , Manoj Kumar 3 Min Read \nMUMBAI/NEW DELHI (Reuters) - India has cut its additional market borrowing requirement for the current fiscal year by 60 percent after reviewing trends in revenue receipts and expenditure patterns, the finance ministry said on Wednesday, sending bond yields sharply lower. \nThe government would only borrow an additional 200 billion rupees ($3.13 billion) versus an initial plan of 500 billion rupees for the fiscal year ending in March, the ministry said in a statement. \nIt was not immediately clear whether the revision was due to spending cuts, or if the government would tap the short-term T-bill market to raise the remainder and may roll it over into long-term borrowings in the next fiscal year. \nAsia’s third-largest economy faces the risk of missing its fiscal deficit target in the current fiscal year as lower revenue collection from slowing economic growth and teething troubles with value-added tax launched in July hit the economy. \nThe benchmark 10-year bond yield fell sharply by as much as 20 basis points immediately after the announcement to 7.35 percent. At 0600 GMT, the bond yield was down 10 basis point at 7.45 percent. \nThe government’s announcement for extra funds in late December exceeded market expectations by far, prompting traders and analysts to expect the fiscal deficit for the current year to reach 3.5 percent of gross domestic product versus the government’s target of 3.2 percent. \nTax collection plunged after a Goods and Services Tax (GST) was implemented in July, which hit the economy and complicated tax filings for business, one of the key reasons for an increase in borrowing levels. \nBond yields slumped to an 18-month low in late December after the additional borrowing announcement. \n“The market is still nervous ahead of the budget and the upcoming RBI policy next month,” said Harish Agarwal, a fixed income trader with First Rand Bank in Mumbai. \nThe Reserve Bank of India had taken advantage of a period of extraordinary low inflation to cut rates by 200 basis points between January 2015 and August 2017. \nHowever, rising food prices pushed India’s retail inflation to a 17-month high in December, breaching the central bank’s medium-term target for the second straight month which could intensify pressure for it to raise policy rates in the next few months. \nMuch of what happens next will hinge on how the government manages its fiscal deficit, with a key test looming as it prepares to unveil the annual budget for next year on Feb. 1. The RBI will hold its next monetary policy meeting on Feb. 7. \n“The market believes next year’s fiscal deficit target will be around 3 percent and RBI will refrain from hiking rates due to fiscal consolidation,” a senior trader at a private bank said. \n“The new 10-year bond yield will thus remain in a range of 7.20 to 7.40 percent in the near term,” he added. \n($1 = 63.9975 Indian rupees)", "external_links": [], "published": "2018-01-17T09:53:00.000+02:00", "crawled": "2018-01-17T17:03:51.006+02:00", "highlightTitle": ""}