{"organizations": [], "uuid": "c8fbae4fd732fe0272c3e54146e145a600ea1b08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/india", "section_title": "India", "url": "https://www.reuters.com/article/us-india-banks-badloans-exclusive/exclusive-indias-mountain-of-soured-bank-loans-shrinks-from-record-peak-idUSKBN1FE1V9", "country": "US", "domain_rank": 408, "title": "Exclusive: India's mountain of soured bank loans shrinks from record peak", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.311, "site_type": "news", "published": "2018-01-25T21:26:00.000+02:00", "replies_count": 0, "uuid": "c8fbae4fd732fe0272c3e54146e145a600ea1b08"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-india-banks-badloans-exclusive/exclusive-indias-mountain-of-soured-bank-loans-shrinks-from-record-peak-idUSKBN1FE1V9", "ord_in_thread": 0, "title": "Exclusive: India's mountain of soured bank loans shrinks from record peak", "locations": [], "entities": {"persons": [], "locations": [{"name": "mumbai", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI (Reuters) - India’s stock of soured bank loans shrank slightly in the quarter to September last year, the first pullback since a drive to clean up record levels of bad debt began in 2015 and signaling that tighter rules and a new bankruptcy code may be starting to show results.\nStressed loans - which include non-performing as well as restructured or rolled-over loans - eased 0.4 percent from three months earlier to 9.46 trillion rupees ($148.3 billion) at the end of September, according to unpublished central bank data reviewed by Reuters.\nThe last data seen by Reuters showed soured loans hit a record 9.5 trillion rupees as of end-June last year, accounting for 12.6 percent of total loans. The new data shows that the ratio declined to 12.2 percent in the period to end-September.\nThat would be the first decline in soured assets since at least 2015, according to quarterly data collected by Reuters. On an annual basis, stressed assets have risen steadily since the year to March 2006.\nBanks have seen their soured loans nearly double in the past four years as a prolonged economic slowdown took its toll on the ability of companies to repay debt. Profligate lending and poor due diligence have also been blamed for the surge.\nIn late 2015, the Reserve Bank of India (RBI) began a major asset quality review amid allegations that banks were hiding the extent of the bad debts on their books.\nThe central bank last year ordered banks to push some 40 of the country’s biggest corporate defaulters into bankruptcy proceedings through greater powers given to it as part of the government’s banking sector reforms program. The government has also announced a $33 billion recapitalization of the state-run banks that account for the bulk for the soured loans.\n“The view is that the stressed assets ratio will not go up sharply from current levels. We expect asset-quality parameters to stabilize in due course before moving lower,” said Jobin Jacob, an associate director at Fitch Ratings.\n“The capital that has come in is a big positive and will bolster state banks’ ability to absorb losses that are likely to ensue from non-performing loan resolution”, Jacob said, adding the rating agency would be watching the asset quality closely.\nThe government on Wednesday announced the first tranche of the capital injection program, pledging to inject nearly $14 billion into 20 state banks by March. [nL4N1PJ3UJ]\nStressed loans at the country’s 21 state-run banks were 8.25 trillion rupees at end-September, or 16.2 percent of their total loans, according to the data received through a right-to-information request.\nPrivate sector banks had 4.65 percent of their total loans classified as stressed amounting to 1.06 trillion rupees as of Sept. 30. Bad loans at foreign banks’ Indian operations amounted to 148.52 billion rupees, or 4.2 percent of their total loans.\nLoans that had been overdue for between 60 days and 90 days, and are at the highest risk of default, also eased to 1.53 trillion rupees as of end-September, from 1.63 trillion rupees at end-June, the data showed.\n($1 = 63.8050 Indian rupees)\nReporting by Devidutta Tripathy; Editing by Euan Rocha and Alex Richardson\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T21:26:00.000+02:00", "crawled": "2018-01-25T23:08:37.018+02:00", "highlightTitle": ""}