{"organizations": [], "uuid": "41da07bcdb0ba064530f5c5476805d2363dad938", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKTennisNews/", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/tennis-ausopen-zverev/tennis-my-brother-still-makes-fun-of-me-says-zverev-idUKL3N1PB2V6", "country": "US", "domain_rank": 408, "title": "Tennis-My brother still makes fun of me, says Zverev", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T10:36:00.000+02:00", "replies_count": 0, "uuid": "41da07bcdb0ba064530f5c5476805d2363dad938"}, "author": "", "url": "https://uk.reuters.com/article/tennis-ausopen-zverev/tennis-my-brother-still-makes-fun-of-me-says-zverev-idUKL3N1PB2V6", "ord_in_thread": 0, "title": "Tennis-My brother still makes fun of me, says Zverev", "locations": [], "entities": {"persons": [{"name": "zverev", "sentiment": "positive"}, {"name": "zv", "sentiment": "positive"}, {"name": "mischa", "sentiment": "none"}, {"name": "sascha", "sentiment": "none"}, {"name": "ian ransom", "sentiment": "none"}, {"name": "alexander zverev", "sentiment": "none"}, {"name": "thomas fabbiano", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "monaco", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 8:36 AM / Updated 11 minutes ago Tennis-My brother still makes fun of me, says Zverev Ian Ransom 4 Min Read \nMELBOURNE, Jan 16 (Reuters) - Alexander Zverev can no longer hope to fly under the grand slam radar following a brilliant 2017 season but the hype has done little to change things on the home front, the 20-year-old wunderkind insists. \nHis 30-year-old brother Mischa’s recent marriage has meant different living arrangements in Monaco but that has done little to loosen the bonds of one of the world’s tightest-knit tennis families. \nWorld number 35 Mischa still finds time to tease ‘Sascha’, despite his little brother’s rapid ascent up the rankings. \n“We obviously have separate apartments. He has a wife now, and, you know, I‘m a little bit by my own,” fourth seed Zverev told reporters after reaching the Australian Open second round on Tuesday with a 6-1 7-6(5) 7-5 win over Thomas Fabbiano. \n”But, you know, still we travel a lot as a family, because my dad is obviously my coach still. My mom travels with him,“ he added. ”(On court) they asked me what changed for you since you’re 20, number four in the world. \n“At home, nothing changed. My brother still makes fun of me. My mom is still there. Dad is still there. My dog doesn’t even realise who I am, so, you know, nothing changes at home.” \nHis dog, a toy poodle, may be oblivious to his owner’s renown but few at Melbourne Park remain ignorant of the 6ft-6in tyro, who has been touted one of the young players most likely to upset the old cartel of Roger Federer and Rafa Nadal. \nZverev announced himself with a third round appearance at the tournament last year, giving Spanish great Nadal a huge five-set scare before bowing out with general acclaim. \nDespite racking up six titles and becoming the youngest player to win a Masters 1000 trophy since Novak Djokovic, Zverev is yet to break through to the quarter-finals of a grand slam, a hole on his tennis CV he is desperate to fill. FAST START \nHe has an impressive support team to help him achieve that, with former world number one Juan Carlos Ferrero coaching along with his father, who played Davis Cup for Russia. \nSince a maiden appearance at the season-ending ATP Tour Finals in November, Zverev’s preparations for Melbourne Park have been scratchy, with losses to David Goffin and Thanasi Kokkinakis at the Hopman Cup in the lead-up. \nBut that was quickly forgotten on a sunbathed Rod Laver Arena on Tuesday as he roared through the first set in 24 minutes against 73rd-ranked Italian Fabbiano, looking every inch the young man in a hurry. \nFrom there it all became a bit “sloppy”, he said, as his 28-year-old opponent began hammering away like a grand slam heavyweight rather than a man with no titles or wins against top-10 opponents. \nFabbiano served for each of the second and third sets but Zverev rallied and closed out the match with a barrage of clean hitting, setting up a second round clash against fellow German Peter Gojowczyk. \nHe will carry his family’s hopes alone now, with brother Mischa out of the tournament after retiring hurt against Chung Hyeon. \nHe joked that his mother still woke him up every morning but added seriously that he was becoming “more consistent with age”, a concerning development for other players in his draw. \n“I think that’s also something that is a factor of maturity,” he said. \n“I‘m just trying to get better every single day.” (Editing by John O‘Brien)", "external_links": [], "published": "2018-01-16T10:36:00.000+02:00", "crawled": "2018-01-16T10:53:34.000+02:00", "highlightTitle": ""}