{"organizations": [], "uuid": "358f0f23428f30c39978b2ca23d75b01f0ff5505", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-quinbrook-acquires-223-mw-wind-power-portfolio.html", "country": "US", "domain_rank": 767, "title": "Quinbrook Acquires 223 MW Wind Power Portfolio", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.497, "site_type": "news", "published": "2018-01-18T17:53:00.000+02:00", "replies_count": 0, "uuid": "358f0f23428f30c39978b2ca23d75b01f0ff5505"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-quinbrook-acquires-223-mw-wind-power-portfolio.html", "ord_in_thread": 0, "title": "Quinbrook Acquires 223 MW Wind Power Portfolio", "locations": [], "entities": {"persons": [{"name": "quinbrook", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "quinbrook", "sentiment": "none"}], "organizations": [{"name": "quinbrook infrastructure partners", "sentiment": "negative"}, {"name": "llc", "sentiment": "none"}, {"name": "quinbrook low carbon power fund", "sentiment": "none"}, {"name": "nextera energy resources", "sentiment": "none"}, {"name": "glidepath power solutions llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 18, 2018 /PRNewswire/ -- Quinbrook Infrastructure Partners (\"Quinbrook\"), a global investment manager specializing in lower carbon and renewable energy infrastructure, announced today that it has acquired a 223 Megawatt (MW) operational wind power portfolio from subsidiaries of NextEra Energy Resources, LLC. The well-diversified wind portfolio has more than 10 years of operating history and contracted power sales to multiple investment-grade utilities. Financial terms were not disclosed.\nThe acquisition was made by GlidePath Power Solutions LLC (\"GlidePath\"), a Quinbrook portfolio company acquired by the Quinbrook Low Carbon Power Fund in 2017. GlidePath is a developer of distributed power solutions across the U.S. spanning wind, solar, distributed gas and battery storage. Quinbrook's latest wind acquisition adds contracted, cash-yielding assets to GlidePath's existing project development pipeline, which exceeds 600 MW of planned distributed power and battery storage projects in the U.S.\nThe acquired portfolio consists of six operating wind farms, varying in size from 9 to 66 MW. The projects are located in Pennsylvania, West Virginia and California, and are focused in markets which have only modest volumes of installed wind capacity. Each asset has been owned and operated by subsidiaries of NextEra Energy Resources for well over 10 years, and has an established operating history. A NextEra affiliate will continue to operate the facilities after closing.\n\"This latest acquisition lays the foundation for our US distributed power platform to be spearheaded by the GlidePath team,\" said David Scaysbrook, Managing Partner of Quinbrook. \"The wind assets in the NextEra portfolio are distributed scale and offer, not only immediate cash returns, but the potential for future upside benefits from repowering existing wind sites with the latest wind turbine technology and extending their operating lives for another 25 years or more.\"\n\"We are excited to be acquiring a set of high quality, operational wind assets in attractive power markets across the United States,\" said Jeff Hunter, Senior Managing Director of Quinbrook. \"GlidePath is an ideal home for these assets, given the Quinbrook and GlidePath teams' combined experience in distributed scale power solutions and development of battery storage infrastructure. Importantly, this portfolio is unencumbered in all key respects and has no current debt, no tax equity liabilities and offers the potential for material value upside from smart retooling.\"\nThe acquisitions expand Quinbrook's ability to meet growing renewable energy demand in strategic energy markets. State policies in the California, Mid-Atlantic and Northeast markets are expected to drive demand for more than 30 GW of new renewable energy capacity between now and 2030.\nThe acquisition follows Quinbrook's recent investment in an 84 MW distributed gas-fired power portfolio in the United Kingdom located across four sites in England and Wales, as well as its investment earlier this year in the Scout Clean Energy utility scale wind power platform. Each of Quinbrook's recent investments are designed to capitalize on the growing demand for new lower carbon and renewable power capacity in key markets around the world.\nAbout GlidePath\nGlidePath Power Solutions ( www.glidepath.net ) is a leading developer of distributed power solutions spanning multiple technologies and US power markets based in Chicago, Illinois. Led by a team of power industry veterans, GlidePath has successfully developed multiple battery storage projects in the US and is actively progressing a project development portfolio exceeding 600 MW of distributed power capacity featuring various low-carbon power technologies.\nAbout Quinbrook\nQuinbrook Infrastructure Partners ( www.quinbrook.com ) is a specialist investment manager focused exclusively on lower carbon and renewable energy infrastructure investment and operational asset management in the US, UK and Australia. Quinbrook is led and managed by a senior team of power industry professionals who have collectively invested over $17 billion in energy infrastructure assets since the early 1990's, representing over 36 GW of supply capacity. Quinbrook's investment and asset management team has offices in Houston, London, Jersey, and the Gold Coast of Australia. Quinbrook currently manages Cape Byron Power ( www.capebyronpower.com ), one of Australia's largest base-load 100% renewable power generators.\nView original content: http://www.prnewswire.com/news-releases/quinbrook-acquires-223-mw-wind-power-portfolio-300584615.html\nSOURCE Quinbrook Infrastructure Partners", "external_links": ["http://www.glidepath.net/", "http://www.capebyronpower.com/", "http://www.quinbrook.com/", "http://www.prnewswire.com/news-releases/quinbrook-acquires-223-mw-wind-power-portfolio-300584615.html", "https://www.quinbrook.com/"], "published": "2018-01-18T17:53:00.000+02:00", "crawled": "2018-01-18T20:08:04.034+02:00", "highlightTitle": ""}