{"organizations": [], "uuid": "4f0243056f78116e9722c242a8aca8a8e56e8693", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-caesars-entertainment-receives-early-termination-of-hart-scott-rodino-waiting-period-for-acquisition-of-centaur-holdings-llc.html", "country": "US", "domain_rank": 767, "title": "Caesars Entertainment Receives Early Termination of Hart-Scott-Rodino Waiting Period for Acquisition of Centaur Holdings, LLC", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:30:00.000+02:00", "replies_count": 0, "uuid": "4f0243056f78116e9722c242a8aca8a8e56e8693"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-caesars-entertainment-receives-early-termination-of-hart-scott-rodino-waiting-period-for-acquisition-of-centaur-holdings-llc.html", "ord_in_thread": 0, "title": "Caesars Entertainment Receives Early Termination of Hart-Scott-Rodino Waiting Period for Acquisition of Centaur Holdings, LLC", "locations": [], "entities": {"persons": [{"name": "mark frissora", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "caesars entertainment corporation", "sentiment": "negative"}, {"name": "centaur holdings", "sentiment": "negative"}, {"name": "caesars entertainment", "sentiment": "negative"}, {"name": "llc", "sentiment": "none"}, {"name": "ftc", "sentiment": "none"}, {"name": "u.s. federal trade commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS, Jan. 8, 2018 /PRNewswire/ -- Caesars Entertainment Corporation (NASDAQ: CZR) (\"Caesars Entertainment\") today announced that the U.S. Federal Trade Commission (FTC) has granted early termination of the waiting period under the Hart-Scott-Rodino Antitrust Improvements Act of 1976 (HSR Act) with respect to the previously announced acquisition of Centaur Holdings, LLC. The proposed acquisition was announced on November 16, 2017.\n\"This important milestone brings us one step closer to completing this acquisition, which is part of our post-emergence, inorganic growth strategy,\" said Mark Frissora, President and Chief Executive Officer of Caesars Entertainment. \"In addition to expanding our gaming footprint, Caesars Entertainment has a strong track record of operating gaming facilities with horse tracks as successful integrated operations, which benefit horsemen, local communities and the state at large. We are especially impressed by the racing operations at the Centaur properties and intend to import best practices from these properties to other Caesars Entertainment properties with racing operations.\"\nUnder the terms of the proposed transaction, Caesars Entertainment will acquire Hoosier Park Racing & Casino (\"Hoosier Park\") in Anderson, Indiana and Indiana Grand Racing and Casino (\"Indiana Grand\") in Shelbyville, Indiana, in addition to three off-track betting facilities in Indiana. Both Hoosier Park and Indiana Grand offer gaming, racing, dining, and entertainment, and feature about 2,000 of the latest slots and electronic table games, multiple dining outlets, and both live and simulcast horse racing.\nThe acquisition of Centaur remains subject to Indiana gaming and horse racing commission approvals and satisfaction of customary closing conditions.\nAbout Caesars Entertainment Corporation\nCaesars Entertainment is the world's most diversified casino-entertainment provider and the most geographically diverse U.S. casino-entertainment company. Since its beginning in Reno, Nevada, in 1937, Caesars Entertainment has grown through development of new resorts, expansions and acquisitions and its portfolio of subsidiaries now operate 47 casinos in 13 U.S. states and five countries. Caesars Entertainment's resorts operate primarily under the Caesars®, Harrah's® and Horseshoe® brand names. Caesars Entertainment's portfolio also includes the Caesars Entertainment UK family of casinos. Caesars Entertainment is focused on building loyalty and value with its guests through a unique combination of great service, excellent products, unsurpassed distribution, operational excellence and technology leadership. Caesars Entertainment is committed to environmental sustainability and energy conservation and recognizes the importance of being a responsible steward of the environment. For more information, please visit www.caesars.com .\nForward-Looking Statements\nThis release includes \"forward-looking statements\" intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. In particular, they include statements relating to, among other things, Caesars Entertainment's plans, strategies, and opportunities for growth. You can identify these statements by the fact that they do not relate strictly to historical or current facts. Further, these statements contain words such as \"exploring\", \"strategy\", \"will\", and \"expected\", \" or the negative or other variations thereof or comparable terminology. These forward-looking statements are based on current expectations and projections about future events.\nInvestors are cautioned that forward-looking statements are not guarantees of future performance or results and involve risks and uncertainties that cannot be predicted or quantified, and, consequently, the actual performance of Caesars Entertainment may differ materially from those expressed or implied by such forward-looking statements. Such risks and uncertainties include, but are not limited to, the following factors, and other factors described from time to time in Caesars Entertainment's reports filed with the Securities and Exchange Commission (including the sections entitled \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" contained therein):\nCompletion of the transaction described herein is subject to receipt of gaming and racing commission approvals and other closing conditions, which may not be satisfied; the impact of our new operating structure post-emergence; the effects of local and national economic, credit, and capital market conditions on the economy, in general, and on the gaming industry, in particular; the ability to realize improvements in our business and results of operations through our property renovation investments, technology deployments, business process improvement initiatives and other continuous improvement initiatives; the ability to take advantage of opportunities to grow our revenue; the financial results of our consolidated businesses; the impact of our substantial indebtedness and lease obligations and the restrictions in our debt and lease agreements; access to available and reasonable financing on a timely basis, including the ability of Caesars Entertainment to refinance its indebtedness on acceptable terms; the ability of our customer tracking, customer loyalty, and yield management programs to continue to increase customer loyalty and same-store or hotel sales; changes in the extensive governmental regulations to which we are subject, and changes in laws, including increased tax rates, smoking bans, regulations or accounting standards, third-party relations and approvals, and decisions, disciplines and fines of courts, regulators and governmental bodies; our ability to recoup costs of capital investments through higher revenues; abnormal gaming holds (\"gaming hold\" is the amount of money that is retained by the casino from wagers by customers); the effects of competition, including locations of competitors, growth of online gaming, competition for new licenses, and operating and market competition; the ability to timely and cost-effectively integrate companies that we acquire into our operations; the potential difficulties in employee retention and recruitment; construction factors, including delays, increased costs of labor and materials, availability of labor and materials, zoning issues, environmental restrictions, soil and water conditions, weather and other hazards, site access matters, and building permit issues; litigation outcomes and judicial and governmental body actions, including gaming legislative action, referenda, regulatory disciplinary actions, and fines and taxation; acts of war or terrorist incidents, (including the impact of the recent mass shooting in Las Vegas on tourism), severe weather conditions, uprisings or natural disasters, including losses therefrom, losses in revenues and damage to property, and the impact of severe weather conditions on our ability to attract customers to certain of our facilities; the effects of environmental and structural building conditions relating to our properties; a disruption, failure or breach of our network, information systems or othe", "external_links": ["http://www.caesars.com/", "http://www.prnewswire.com/news-releases/caesars-entertainment-receives-early-termination-of-hart-scott-rodino-waiting-period-for-acquisition-of-centaur-holdings-llc-300578921.html"], "published": "2018-01-08T15:30:00.000+02:00", "crawled": "2018-01-08T19:19:45.047+02:00", "highlightTitle": ""}