{"organizations": [], "uuid": "a41a7b74ab8f76705311f3f24600ef9617529c29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180116.html", "section_title": "Archive News &amp; Video for Tuesday, 16 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/asia-bonds-flows/graphic-flows-into-asian-bonds-unlikely-to-be-as-buoyant-as-in-2017-idUSL4N1OE3KZ", "country": "US", "domain_rank": 408, "title": "GRAPHIC-Flows into Asian bonds unlikely to be as buoyant as in 2017", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T17:35:00.000+02:00", "replies_count": 0, "uuid": "a41a7b74ab8f76705311f3f24600ef9617529c29"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/asia-bonds-flows/graphic-flows-into-asian-bonds-unlikely-to-be-as-buoyant-as-in-2017-idUSL4N1OE3KZ", "ord_in_thread": 0, "title": "GRAPHIC-Flows into Asian bonds unlikely to be as buoyant as in 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "organizations": [{"name": "federal reserve", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 16 - There’s unlikely to a repeat this year of the surge of foreign flows into Asian bonds that 2017 brought, analysts say, as major central banks are set to pare their monetary stimulus, which could squeeze global liquidity.\nData from central banks and bond market associations in India, Indonesia, Thailand, Malaysia and South Korea showed foreigners bought about $46 billion of Asia government and corporate bonds in 2017, the most in at least five years.\nA synchronized pick-up in growth across the region and liquidity supply from major central banks boosted the demand for bonds last year.\nTogether, Indian and Indonesian bonds attracted more than half of the region’s inflows, helped by accommodative monetary policies by their central banks during the year.\nIndonesia cut its benchmark interest rate twice and India cut it once in 2017, boosting the prices of their bonds.\nIn 2017, Malaysia was the only Asian country that had net outflows. Foreigners sold about $1.8 billion of its government bonds.\nDespite three interest rate hikes by the Federal Reserve, the 10-year U.S. Treasury yield slipped 2 basis points in 2017, which helped regional bonds to maintain their premium over U.S. ones.\nThough analysts are generally optimistic about the region’s economic growth outlook this year, they expect major central banks’ more aggressive policy steps to affect foreign flows.\nOn Monday, European Central Bank rate-setter Ardo Hansson said the ECB could end its bond purchase scheme in one go after September if the economy and inflation develop as expected.\nIn a report on Monday, ANZ said ”A stronger growth environment should bode well for continued inflows in 2018 into the region. “But as global liquidity eases due to a decline in major central bank balance sheets, the flows will likely moderate from 2017 levels.”\nAnother factor for 2018 is that inflation levels in the region are slowly creeping up, affecting the real yield returns of Asian bonds. Real yield is calculated by deducting the inflation rate from the bond yield.\nMalaysian and Taiwan bonds offer the lowest real yield returns in Asia.\nAnalysts say real yields are likely to decline more this year, which would make the valuations of regional bonds less attractive.\nSolid inflows in 2017 bolstered Asian currencies’ performance against the dollar. The South Korean won had the biggest gain, of over 12 percent, followed by the Malaysian ringgit, Thai baht and Taiwan dollar.\nReporting by Patturaja Murugaboopathy and Gaurav Dogra in Bengaluru; Editing by Richard Borsuk\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T17:35:00.000+02:00", "crawled": "2018-01-17T19:55:17.013+02:00", "highlightTitle": ""}