{"organizations": [], "uuid": "a210282949acb933647cf0eec4485ce87db93ef4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104933657-8F1FF55C-BD97-4D05-822D-2D64AC8A4D5B.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/hm-slammed-for-racist-monkey-in-the-jungle-hoodie.html", "country": "US", "domain_rank": 767, "title": "H&M slammed for racist 'monkey in the jungle' hoodie", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.267, "site_type": "news", "published": "2018-01-08T17:20:00.000+02:00", "replies_count": 0, "uuid": "a210282949acb933647cf0eec4485ce87db93ef4"}, "author": "Lauren Thomas", "url": "https://www.cnbc.com/2018/01/08/hm-slammed-for-racist-monkey-in-the-jungle-hoodie.html", "ord_in_thread": 0, "title": "H&M slammed for racist 'monkey in the jungle' hoodie", "locations": [], "entities": {"persons": [{"name": "questlove", "sentiment": "none"}], "locations": [], "organizations": [{"name": "h&m", "sentiment": "negative"}, {"name": "hennes & mauritz", "sentiment": "none"}, {"name": "h&m h&m", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "H&M ( Hennes & Mauritz ) is under fire for using a black child to model a sweatshirt sporting the phrase \"coolest monkey in the jungle.\"\nThe image first appeared over the weekend on the British version of the Swedish-based retailer's website.\nUpon noticing an advertisement with the photo, social media users erupted in outrage at H&M for what they deemed to be a racist and inconsiderate move.\nAmerican percussionist Questlove was among those to object, writing on Instagram (where he has over 1 million followers):\nI’m sure the apologies are a coming. And the ads will be pulled. I’m certain there will Be media fixers and whatnot and maybe a grand gesture like a donation to some charity (donations under these circumstances are the corporate version #SomeOfMyBestFriendsAre move if there ever was one) all this tells me about @HM is that the seats in the boardroom lack something...wanna take a guess?\nA post shared by Questlove Gomez (@questlove) on Jan 8, 2018 at 5:42am PST\nAs of Monday morning, H&M had removed the ad from its website, a spokesperson told CNBC, but it continued to sell the hooded top online, although not in the U.S.\n\"We sincerely apologize for offending people with this image of a printed hooded top,\" the spokesperson said. \"We believe in diversity and inclusion in all that we do and will be reviewing all our internal policies accordingly to avoid any future issues.\"\nLater in the day, Canadian singer The Weeknd, who has collaborated with H&M on collections in the past, wrote on Twitter to say he would no longer work with the company and was \"deeply offended.\"\nThis incident adds to a growing list of retailers going too far with a slogan or imagery. Abercrombie & Fitch , for example, was criticized for selling a shirt depicting the Wong Brothers' laundry service, where \"two Wongs can make it white,\" and \"Get Your Buddha on the Floor.\"\nUrban Outfitters once sold a red sweatshirt bearing the Kent State name and what appeared to be a blood splatter. And Zara, owned by Inditex, stirred up controversy when it released a striped blue-and-white children's pajama top with a yellow star over the left chest, resembling uniforms worn by concentration camp inmates during the Holocaust.\nThe blunder for H&M comes right after the retailer in December reported its biggest drop in quarterly sales in at least a decade. In turn, H&M has trimmed its expansion plans and is even considering closing some locations.", "external_links": [], "published": "2018-01-08T17:20:00.000+02:00", "crawled": "2018-01-08T17:20:36.006+02:00", "highlightTitle": ""}