{"organizations": [], "uuid": "f0265c575148e352afc2221bb640672632044853", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 82, "shares": 82, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223523924&w=1200&r=LYNXMPEE0J03D", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-olympics-2018-northkorea/canceled-north-korean-visit-to-prep-for-olympics-not-permanent-south-korea-ministry-idUSKBN1F904Y", "country": "US", "domain_rank": 408, "title": "Canceled North Korean visit to prep for Olympics 'not permanent': South Korea ministry", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T06:09:00.000+02:00", "replies_count": 0, "uuid": "f0265c575148e352afc2221bb640672632044853"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-northkorea/canceled-north-korean-visit-to-prep-for-olympics-not-permanent-south-korea-ministry-idUSKBN1F904Y", "ord_in_thread": 0, "title": "Canceled North Korean visit to prep for Olympics 'not permanent': South Korea ministry", "locations": [], "entities": {"persons": [], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "unification ministry", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 20, 2018 / 4:09 AM / in 7 hours Canceled North Korean visit to prep for Olympics 'not permanent': South Korea ministry Reuters Staff 2 Min Read \nSEOUL (Reuters) - South Korea’s Unification Ministry said on Saturday that the sudden cancellation of a North Korean delegation’s planned visit to the South to prepare for the North’s art troupe during the Winter Olympics was “not a permanent cancellation”. \n“It’s not a permanent cancellation on sending its advance team for performance, it is a tentative cancel,” a ministry official said. \nA seven-member North Korean team had been scheduled to visit on Saturday to check venues for the performances, the Unification Ministry previously said. \nIt was unclear whether the cancellation cast any doubt over the preparations for the North’s participation in next months Winter Olympics in South Korea’s Pyeongchang, an apparent diplomatic breakthrough after months of high tension over the North’s nuclear and missile program. \nNorth Korea has still not disclosed the reason as to why it is not sending the advance team, the official said on Saturday. \nHowever, North Korea and South Korea will still discuss matters concerning next month’s Pyeongchang Winter Olympics via the hotline between the two Koreas throughout the weekend, and the issue of the delegation’s sudden change in schedule could be discussed, the official added. \nMeanwhile, North Korea called the United Nations’ (UN) Secretary General’s remarks this week on its nuclear tests and ballistic missile launches “biased” for not taking the United States to task on its own nuclear program, and attacked the United States and other nations for calling North Korea’s nuclear program “violations of resolutions”. \nNorth Korea said the remarks it took issue with were in the vein of “the U.S. desperately trying to reverse the trend of detente and improvement of inter-Korean relations, which is hardly achieved now”, seemingly referring to the apparent diplomatic breakthrough surrounding the Winter Olympics, according to a statement from the Permanent Mission of the DPRK to the United Nations. Reporting by Haejin Choi; Writing by Joyce Lee; Editing by Michael Perry", "external_links": [], "published": "2018-01-20T06:09:00.000+02:00", "crawled": "2018-01-20T06:25:45.034+02:00", "highlightTitle": ""}