{"organizations": [], "uuid": "d6ffb1a1f087188e5d23841785fc23affc13413c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226738777&w=1200&r=LYNXMPEE0T1KR", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-gymnastics-usa-nassar-comaneci/gymnastics-great-comaneci-calls-for-changes-at-usa-gymnastics-idUKKBN1FJ321", "country": "US", "domain_rank": 408, "title": "Gymnastics great Comaneci calls for changes at USA Gymnastics", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T00:39:00.000+02:00", "replies_count": 0, "uuid": "d6ffb1a1f087188e5d23841785fc23affc13413c"}, "author": "", "url": "https://uk.reuters.com/article/uk-gymnastics-usa-nassar-comaneci/gymnastics-great-comaneci-calls-for-changes-at-usa-gymnastics-idUKKBN1FJ321", "ord_in_thread": 0, "title": "Gymnastics great Comaneci calls for changes at USA Gymnastics", "locations": [], "entities": {"persons": [{"name": "comaneci", "sentiment": "negative"}, {"name": "aly raisman", "sentiment": "none"}, {"name": "nadia comaneci", "sentiment": "none"}, {"name": "simone biles", "sentiment": "none"}], "locations": [{"name": "usa", "sentiment": "none"}, {"name": "usa gymnastics", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "usa gymnastics", "sentiment": "none"}, {"name": "usoc", "sentiment": "none"}, {"name": "usa gymnastics pritha sarkar", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 10:40 PM / Updated 6 hours ago Gymnastics great Comaneci calls for changes at USA Gymnastics Pritha Sarkar 3 Min Read \nLONDON (Reuters) - Gymnastics superstar Nadia Comaneci called for “drastic changes” at USA Gymnastics, which has been rocked by a scandal involving its longtime doctor who has been convicted of sexually abusing young athletes. \nOlympic champions like Simone Biles and Aly Raisman have accused the gymnastics federation and the U.S. Olympic Committee of failing for years to act on complaints and protect athletes. USA Gymnastics’ board resigned last week under pressure from the USOC, and investigations are under way into both organizations. \n”Drastic changes are needed at the USA Gymnastics and rules need to be implemented for the safety of all athletes,” Comaneci, 56, told Reuters in a series of texts on Monday and Tuesday. She did not spell out what kind of changes she thought should be made. \nComaneci said she was speaking as an outsider who cares about the safety of children. \n“I can only say that definitely a change is needed, a change that prioritises first the kids’ safety,” said the nine-time Olympic medallist. \nDr. Larry Nassar, 54, was sentenced last week in a Michigan courtroom to up to 175 years in prison for sexually abusing female gymnasts under the guise of medical treatment. He is scheduled to be sentenced on similar charges in a different Michigan courtroom later this week. \n“I am so sorry for the young ladies that have been abused and I admire their courage to speak out,” said Comaneci, who made history when she became the first gymnast to score a perfect 10 at the Olympics for her native Romania at the 1976 Montreal Games. \nComaneci, who defected to the United States in 1989 just before the Romanian revolution overthrew dictator Nicolae Ceaucescu, now runs a gymnastics academy in Oklahoma with her husband, Bart Conner, a U.S. gold medal-winning gymnast. \nIn 1990, Comaneci told reporters the Romanian man who helped her defect held her captive for three months and stole money from her. She declined to discuss her personal history of abuse with Reuters. \nComaneci, who was 14 years old when she won three gold medals in 1976 and went on to earn two more golds in Moscow four years later, said she believes the focus should be on Nassar’s victims. \n“It is important that they get justice and all the support they need,” she said. “Parents should know that at all time their kids are safe in any sports environment.” Reporting by Pritha Sarkar, Writing by Ben Klayman; Editing by Cynthia Osterman", "external_links": [], "published": "2018-01-31T00:39:00.000+02:00", "crawled": "2018-01-31T01:00:12.022+02:00", "highlightTitle": ""}