{"organizations": [], "uuid": "1e94cfcc5e4d00cf92b77b16f592bd65c2433940", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/emerging-markets/emerging-markets-emerging-stocks-fx-jittery-on-dollar-russia-reports-eyed-idUSL8N1PO242", "country": "US", "domain_rank": 408, "title": "EMERGING MARKETS-Emerging stocks, FX jittery on dollar; Russia reports eyed", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T12:33:00.000+02:00", "replies_count": 0, "uuid": "1e94cfcc5e4d00cf92b77b16f592bd65c2433940"}, "author": "", "url": "https://www.reuters.com/article/emerging-markets/emerging-markets-emerging-stocks-fx-jittery-on-dollar-russia-reports-eyed-idUSL8N1PO242", "ord_in_thread": 0, "title": "EMERGING MARKETS-Emerging stocks, FX jittery on dollar; Russia reports eyed", "locations": [], "entities": {"persons": [], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "gulf", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Jan 29 (Reuters) - Emerging stocks snapped an 11-day winning streak on Monday and currencies felt the pain of the dollar regaining its footing as markets eyed reports due from Washington that could ring in a fresh set of sanctions against Russia.\nMSCI’s emerging markets benchmark had climbed to a new decade high in early Asian trading, but withdrew to trade 0.2 percent weaker while bourses around the globe painted a mixed picture.\nStocks in South Korea, Taiwan and parts of the Gulf chalked up solid gains. Yet equities in Russia , South Africa and Turkey were suffering.\nChina’s blue-chips booked their worst day in more than two months, led by a slump in consumer and healthcare stocks as investors decided to take profits. Chinese stocks have enjoyed a hefty rally, with mainland indexes still up some 8 percent since the start of the year.\n“Weekly inflows into emerging market equity funds were at a record high of $7.9 billion in the past week, underpinned by large inflows into China H-shares as global investors express increasing optimism towards China’s economic prospects,” Morgan Stanley strategist Hans Redeker wrote in a note to clients.\nThe world’s number two economy was still leading emerging markets risk sentiment, he added, pointing to a senior official at Beijing’s top economic planner forecasting China’s expansion would come in above consensus at 6.5-6.8 percent in 2018.\nCurrencies painted an equally mixed picture. Many had enjoyed a solid rally in the past days, sailing higher as the dollar suffered its worst weekly fall in more than half a year following conflicting signals from top U.S. officials.\nBut with the greenback finding its footing again, South Africa’s rand and Turkey’s lira weakened 0.7 percent.\nTurkish stocks and local government bonds came under pressure after a pledge by President Tayyip Erdogan on Sunday that the country will “clean” its entire border with Syria.\nThe comment was seen as a sign that Ankara could extend its 10-day old offensive on the Syrian Kurdish YPG group in Syria’s northern Afrin region, potentially ramping up tensions between Turkey and the United States, which has supported the YPG in other parts of Syria against Islamic State.\nBut commodities broadly clinging to their gains did provide a cushion. Russia’s rouble was treading water thanks to Brent crude futures holding above $70 per barrel.\nMeanwhile markets were awaiting two reports from Washington which could detail the possibilities for expanding sanctions against Moscow, including a list of prominent oligarchs and potential restrictions on the holding of Russian government debt. On Friday, Washington already added Russian officials and energy firms to a sanctions blacklist.\nSeparately, Russian opposition leader Alexei Navalny was detained during a nationwide day of protests in the run up to the election on March 18, though numbers seemed lower than in previous protests.\nFor GRAPHIC on emerging market FX performance 2017, see tmsnrt.rs/2e7eoml For GRAPHIC on MSCI emerging index performance 2017, see tmsnrt.rs/2dZbdP5\nFor TOP NEWS across emerging markets\nFor CENTRAL EUROPE market report, see\nFor TURKISH market report, see\nFor RUSSIAN market report, see)\nReporting by Karin Strohecker, Editing by William Maclean\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-29T12:33:00.000+02:00", "crawled": "2018-01-29T12:55:47.000+02:00", "highlightTitle": ""}