{"organizations": [], "uuid": "bb53b6a01fe2a9449dd1b09e85a0189b1abee595", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-fski-kim/olympics-fathers-sacrifice-helps-kim-become-snowboard-star-idUKKBN1EZ1L1", "country": "US", "domain_rank": 408, "title": "Olympics - Father’s sacrifice helps Kim become snowboard star", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T15:32:00.000+02:00", "replies_count": 0, "uuid": "bb53b6a01fe2a9449dd1b09e85a0189b1abee595"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-fski-kim/olympics-fathers-sacrifice-helps-kim-become-snowboard-star-idUKKBN1EZ1L1", "ord_in_thread": 0, "title": "Olympics - Father’s sacrifice helps Kim become snowboard star", "locations": [], "entities": {"persons": [{"name": "kim", "sentiment": "neutral"}, {"name": "chloe kim", "sentiment": "none"}, {"name": "jack tarrant", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "lillehammer", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}, {"name": "team usa", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 32 PM / Updated 14 minutes ago Olympics - Father’s sacrifice helps Kim become snowboard star   Chloe Kim has the chance to become the youngest female snowboarder to win Olympic gold when the 2018 Pyeongchang Games kick off in South Korea next month and the American teen says she owes much of her success to her dedicated dad. \nKim met the qualifying standards for Sochi four years ago but was deemed too young to compete. She shrugged off that disappointment to claim her first X Games silver medal the same year aged 13. \nKim went on to become the first athlete to win three X Games gold medals under the age of 16 and won two golds at the 2016 Winter Youth Olympics in Lillehammer, where she was also her nation’s flag bearer at the opening ceremony. \nKim is also the first female athlete to land back-to-back 1080s and score a perfect 100, according to U.S. Ski and Snowboard. \nKim, who will not turn 18 until two months after February’s Games, qualified for Team USA with a podium finish at the Olympic qualifier in Colorado on Dec. 15. \nIf being an Olympic favourite was not enough pressure for a 17-year-old to handle, Kim’s Korean heritage means there will be two nations counting on her to win gold in Pyeongchang. \nWith family still living in South Korea, Kim knows she can expect plenty of attention from the host nation at the Feb. 9-25 Games. Born in California, she says she identifies more with American culture but is proud of her Korean heritage and tries to visit her family once a year. \n”My grandmother lives in Korea and I love her. She is the cutest little old lady I have ever seen in my life,” she said at the Team USA Media Summit in September. OLYMPIC FEVER \nAs Olympic fever takes hold in South Korea, Kim says she has been overwhelmed by the support she received on previous visits to the country. \n“It was really crazy, I had a real paparazzi moment there. It was kind of cool, I felt like Kim Kardashian,” said Kim. \n“I was doing something where I got to ride with young Korean riders and it kind of freaked me out. I have never had that many cameras around me before. I look up and there’s like 25 cameras around me and I straight up ran away I was so scared.” \nKim says she is “obsessed” with snowboarding and credits her father’s determination with getting her to the Olympics. \nHer father, Kim Jong-jin, first encouraged her to get on a snowboard aged four and later gave up his job to focus on his daughter’s budding snowboarding career. \n“Obviously when I was eight I didn’t know what they were doing. I was like, why is dad home more?” she said. \n“Now that I think about it, I think it was a really bold move and I can’t believe my mum was okay with it. I think that’s so cool. My dad is a very dedicated, determined person; once he sees something he wants he has to get it. \n”I‘m not saying he forced me to snowboard, I genuinely love snowboarding so it was nice he was that determined to bring me to the Olympics.” Additional reporting by Steve Keating;  ", "external_links": [], "published": "2018-01-10T15:32:00.000+02:00", "crawled": "2018-01-10T15:52:29.000+02:00", "highlightTitle": ""}