{"organizations": [], "uuid": "6e024d6b702b0e0d79b8c310cbc9f0c861c8d3c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-iovance-biotherapeutics-inc-announces-closing-of-172-point-5-million-common-stock-public-offering.html", "country": "US", "domain_rank": 767, "title": "Iovance Biotherapeutics, Inc. Announces Closing of $172.5 Million Common Stock Public Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-30T00:01:00.000+02:00", "replies_count": 0, "uuid": "6e024d6b702b0e0d79b8c310cbc9f0c861c8d3c2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-iovance-biotherapeutics-inc-announces-closing-of-172-point-5-million-common-stock-public-offering.html", "ord_in_thread": 0, "title": "Iovance Biotherapeutics, Inc. Announces Closing of $172.5 Million Common Stock Public Offering", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN CARLOS, Calif., Jan. 29, 2018 (GLOBE NEWSWIRE) -- Iovance Biotherapeutics, Inc. (Nasdaq:IOVA), a biotechnology company developing novel cancer immunotherapies based on tumor-infiltrating lymphocyte (TIL) technology, today announced the closing of an underwritten public offering of 15,000,000 shares of its common stock at a public offering price of $11.50 per share. The gross proceeds from the offering, before deducting the underwriting discounts and commissions and other estimated offering expenses payable by Iovance, are approximately $172.5 million. The shares of common stock issued and sold in the offering include 1,956,521 shares issued upon the exercise in full by the underwriter of their option to purchase additional shares at the public offering price, less the underwriting discount.\nIovance intends to use the proceeds from this offering to fund its ongoing clinical trials for its current product candidates, including its ongoing Phase 2 clinical trials of LN-144, TIL for treatment of metastatic melanoma, and LN-145, TIL for the treatment of cervical and head and neck cancers, to fund its planned clinical trials for its current product candidates, including a planned Phase 2 clinical trial of LN-145 for the treatment of non-small cell lung cancer (NSCLC), in collaboration with MedImmune, as well as the NSCLC study in collaboration with the H. Lee Moffitt Cancer Center and Research Institute, to fund its planned clinical trials in multiple solid tumor cancers with The University of Texas M.D. Anderson Cancer Center, to fund additional clinical trials to move TIL therapy to an earlier line of treatment, to fund activities related to commercial scale-up of Iovance’s third party manufacturing operations and for working capital and other general corporate purposes.\nJefferies LLC acted as sole book-running manager for the offering.\nThe shares of common stock described above were offered by Iovance pursuant to its shelf registration statement on Form S-3 previously filed and declared effective by the Securities and Exchange Commission (the SEC). A preliminary prospectus supplement relating to this offering was filed with the SEC on January 24, 2018. A final prospectus supplement relating to the offering was filed with the SEC on January 25, 2018. Copies of the final prospectus supplement and the accompanying prospectus may be obtained by contacting Jefferies LLC, Attention: Equity Syndicate Prospectus Department, 520 Madison Avenue, 2nd Floor New York, New York, 10022, by telephone at (877) 821-7388, or by email at Prospectus_Department@Jefferies.com .\nThis press release shall not constitute an offer to sell or a solicitation of an offer to buy these securities, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Iovance Biotherapeutics, Inc.\nIovance Biotherapeutics, Inc. (the Company) is a clinical-stage biotechnology company focused on the development of cancer immunotherapy products for the treatment of various cancers. The Company's lead product candidate is an adoptive cell therapy using TIL technology being investigated for the treatment of patients with metastatic melanoma, recurrent and/or metastatic squamous cell carcinoma of the head and neck and recurrent and metastatic or persistent cervical cancer.\nForward Looking Statements\nCertain matters discussed in this press release are \"forward-looking statements\". We may, in some cases, use terms such as \"predicts,\" \"believes,\" \"potential,\" \"continue,\" \"estimates,\" \"anticipates,\" \"expects,\" \"plans,\" \"intends,\" \"may,\" \"could,\" \"might,\" \"will,\" \"should\" or other words that convey uncertainty of future events or outcomes to identify these forward-looking statements. In particular, the Company's statements regarding its expectations with respect to its public offering are examples of such forward-looking statements. The forward-looking statements include risks and uncertainties, including, but not limited to, the uncertainties related to market conditions; the success, timing and cost of our ongoing clinical trials and anticipated clinical trials for our current product candidates, including statements regarding the timing of initiation and completion of the trials; the timing of and our ability to obtain and maintain U.S. Food and Drug Administration or other regulatory authority approval of, or other action with respect to, our product candidates; the strength of the Company's product pipeline; the successful implementation of the Company's research and development programs and collaborations; the success of the Company's license or development agreements; the acceptance by the market of the Company's product candidates, if approved; and other factors, including general economic conditions and regulatory developments, not within the Company's control. The factors discussed herein could cause actual results and developments to be materially different from those expressed in or implied by such statements. A further list and description of the Company's risks, uncertainties and other factors can be found in the Company's most recent Annual Report on Form 10-K and the Company's subsequent filings with the Securities and Exchange Commission. Copies of these filings are available online at www.sec.gov or www.iovance.com . The forward-looking statements are made only as of the date of this press release and the Company undertakes no obligation to publicly update such forward-looking statements to reflect subsequent events or circumstance.\nInvestor Relations Contact:\nSarah McCabe\nStern Investor Relations, Inc.\n212-362-1200\nsarah@sternir.com\nMedia Relations Contact:\nEvan Smith\nFTI Consulting\n212-850-5622\nevan.smith@fticonsulting.com\nSource:Iovance Biotherapeutics, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/d0986bd6-4603-4e31-8ed1-f23b3e123605", "http://www.sec.gov/", "http://www.iovance.com/"], "published": "2018-01-30T00:01:00.000+02:00", "crawled": "2018-01-30T04:44:29.002+02:00", "highlightTitle": ""}