{"organizations": [], "uuid": "e4128a51ddecc38fcdbd0bcf72a6797b629b5f85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-ocular-therapeutixa-announces-kevin-hanley-as-senior-vice-president-technical-operations-and-naymisha-patel-as-vice.html", "country": "US", "domain_rank": 767, "title": "Ocular Therapeutix™ Announces Kevin Hanley as Senior Vice President, Technical Operations and Naymisha Patel as Vice President of Quality", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "e4128a51ddecc38fcdbd0bcf72a6797b629b5f85"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-ocular-therapeutixa-announces-kevin-hanley-as-senior-vice-president-technical-operations-and-naymisha-patel-as-vice.html", "ord_in_thread": 0, "title": "Ocular Therapeutix™ Announces Kevin Hanley as Senior Vice President, Technical Operations and Naymisha Patel as Vice President of Quality", "locations": [], "entities": {"persons": [{"name": "naymisha patel", "sentiment": "negative"}, {"name": "kevin hanley", "sentiment": "negative"}, {"name": "kevin", "sentiment": "none"}, {"name": "antony mattessich", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}], "organizations": [{"name": "fda", "sentiment": "none"}, {"name": "bedford", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Experienced additions complete the recent transformation of the management team\nAttention turns to seeking approval of DEXTENZA™ and building a leading development-focused biopharmaceutical company\nBEDFORD, Mass.--(BUSINESS WIRE)-- Ocular Therapeutix™, Inc. (NASDAQ: OCUL), a biopharmaceutical company focused on the development, manufacturing and commercialization of innovative therapies for diseases and conditions of the eye, today announced the appointment of Kevin Hanley as Senior Vice President, Technical Operations and Naymisha Patel as Vice President of Quality.\n“We are thrilled to welcome both Kevin and Naymisha to Ocular Therapeutix,” said Antony Mattessich, President and Chief Executive Officer. “Since receiving the Complete Response Letter from FDA for DEXTENZA™ last July, we have significantly transitioned our senior management team, bringing in over 100 years of combined pharmaceutical and biologic leadership experience to maximize the opportunity around our technology platform. Kevin’s appointment completes the senior management transition and is key to our focus on ensuring that our core DEXTENZA™ manufacturing capabilities meet cGMP standards and can supply anticipated commercial needs.”\nKevin Hanley brings over 30 years of experience managing biotechnology and pharmaceutical operations with demonstrated success in technology transfer and process scale-up for the manufacturing of proteins from development through commercialization. In addition, Hanley has authored and reviewed numerous CMC manufacturing sections for regulatory submissions. He is associated with the development and clinical progression of an extensive number of novel clinical proteins and the successful commercialization of seven protein biopharmaceuticals. Prior to joining Ocular Therapeutix, Hanley served in leadership roles with Pfizer and Wyeth BioPharma as Senior Director, Network Process Technology Innovation and Senior Director, Manufacturing. His work included a focus on increasing operational effectiveness in manufacturing quality and cGMP standards through the implementation of six sigma methodologies and on contributing to Pfizer’s biotechnology emerging market manufacturing strategy. Hanley holds a B.S. in Biology from Framingham State College and M.S. in Chemical Engineering from Tufts University.\nIn addition, Ocular Therapeutix announced the appointment of Naymisha Patel as Vice President of Quality. “Naymisha’s experience leading teams as well as building quality systems and overseeing regulatory compliance will be extremely valuable as we prepare for the resubmission of the DEXTENZA™ NDA,” said Daniel Bollag, Ph.D., Senior Vice President, Regulatory Affairs & Quality. Patel brings over 20 years of experience with a proven track record in quality management, process improvement, regulatory submissions and regulatory compliance. Most recently, Patel served as the Head of Global Quality at Prothena Corporation plc, before which she served as Vice President, Regulatory and Quality of StemCells, Inc. She also held roles in Quality at Geron Corporation and Nektar Therapeutics. Patel holds a B.A. in Chemistry from California State University, B.S. in Chemistry from the Maharaja Sayajirao University, and M.B.A. from Northcentral University in Scottsdale, Arizona.\nAbout Ocular Therapeutix, Inc.\nOcular Therapeutix, Inc. is a biopharmaceutical company focused on the development, manufacturing and commercialization of innovative therapies for diseases and conditions of the eye using its proprietary hydrogel-based formulation technology. Ocular Therapeutix’s lead product candidate, DEXTENZA™ (dexamethasone insert) 0.4 mg for intracanalicular use, has completed Phase 3 clinical development for the treatment of ocular pain and inflammation following ophthalmic surgery. OTX-TP (travoprost insert) is in Phase 3 clinical development for the reduction of intraocular pressure in patients with glaucoma and ocular hypertension. The Company’s earlier stage assets include OTX-TIC, a sustained release travoprost intracameral injection for the reduction in intraocular pressure in patients with glaucoma and ocular hypertension, as well as sustained release intravitreal injections for the treatment of retinal diseases. These injections include the development of OTX-TKI, a tyrosine kinase inhibitor (TKI), and, in collaboration with Regeneron, an extended release protein-based anti-vascular endothelial growth factor (VEGF) trap. Ocular Therapeutix's first product, ReSure® Sealant, is FDA-approved to seal corneal incisions following cataract surgery.\nForward Looking Statements\nAny statements in this press release about future expectations, plans and prospects for the Company including the development and regulatory status of the Company’s product candidates, such as the Company’s expectations and plans regarding product development efforts and regulatory submissions for and the timing and conduct of clinical trials of DEXTENZA™ for the treatment of post-surgical ocular inflammation and pain, including with respect to the manufacturing deficiencies identified by the FDA and the prospects for approvability of DEXTENZA™ for these indications, DEXTENZA™ for the treatment of allergic conjunctivitis, DEXTENZA™ for the treatment of dry eye disease and OTX-TP for the treatment of glaucoma and ocular hypertension, the ongoing development of the Company’s sustained release intravitreal depot, the potential utility of any of the Company’s product candidates, potential commercialization of the Company’s product candidates, the sufficiency of the Company’s cash resources, and other statements containing the words \"anticipate,\" \"believe,\" \"estimate,\" \"expect,\" \"intend\", \"goal,\" \"may\", \"might,\" \"plan,\" \"predict,\" \"project,\" \"target,\" \"potential,\" \"will,\" \"would,\" \"could,\" \"should,\" \"continue,\" and similar expressions, constitute forward-looking statements within the meaning of The Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by such forward-looking statements as a result of various important factors. Such forward-looking statements involve substantial risks and uncertainties that could cause the Company’s clinical development programs, future results, performance or achievements to differ significantly from those expressed or implied by the forward-looking statements. Such risks and uncertainties include, among others, the timing and costs involved in commercializing ReSure® Sealant or any product candidate that receives regulatory approval, the initiation and conduct of clinical trials, availability of data from clinical trials and expectations for regulatory submissions and approvals, the Company’s manufacturing operations, the Company’s scientific approach and general development progress, the availability or commercial potential of the Company’s product candidates, the availability of cash resources and need for additional financing or other actions and other factors discussed in the “Risk Factors” section contained in the Company’s quarterly and annual reports on file with the Secur", "external_links": ["http://www.businesswire.com/news/home/20180108005641/en/"], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:10:36.011+02:00", "highlightTitle": ""}