{"organizations": [], "uuid": "28bb5699cada28da1bec3722462652fc86ea9d33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-essence-ventures-announces-acquisition-of-essence-communications-from-time-inc.html", "country": "US", "domain_rank": 767, "title": "Essence Ventures Announces Acquisition of Essence Communications from Time Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-03T21:53:00.000+02:00", "replies_count": 0, "uuid": "28bb5699cada28da1bec3722462652fc86ea9d33"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-essence-ventures-announces-acquisition-of-essence-communications-from-time-inc.html", "ord_in_thread": 0, "title": "Essence Ventures Announces Acquisition of Essence Communications from Time Inc.", "locations": [], "entities": {"persons": [{"name": "michelle ebanks", "sentiment": "none"}, {"name": "ebanks", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "time inc.", "sentiment": "negative"}, {"name": "essence ventures announces acquisition of essence communications", "sentiment": "negative"}, {"name": "essence ventures llc", "sentiment": "none"}, {"name": "essence communications inc.", "sentiment": "none"}, {"name": "time inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "- Deal reestablishes ESSENCE as a 100% Black-owned independent company -\n- Black female-led ESSENCE executive team to have ownership stake in the brand -\nNEW YORK--(BUSINESS WIRE)-- Essence Ventures LLC, an independent African-American owned company focused on merging content, community and commerce, today announced its acquisition of multi-platform media company Essence Communications Inc. from Time Inc. ESSENCE President Michelle Ebanks will continue at the helm of the company and will also join its board of directors. In addition, the all Black female executive team of ESSENCE, including Ebanks, will have an equity stake in the business.\n“This acquisition of ESSENCE represents the beginning of an exciting transformation of our iconic brand as it evolves to serve the needs and interests of multigenerational Black women around the world in an even more elevated and comprehensive way across print, digital, e-commerce and experiential platforms,” said Ebanks. “In addition, it represents a critical recognition, centering and elevation of the Black women running the business from solely a leadership position to a co-ownership position.”\nThrough the Essence Ventures’ investment and resulting incremental growth opportunities, ESSENCE will focus on expanding its digital businesses via distribution partnerships, compelling original content and targeted client-first strategies. In addition, the brand will expand its international growth by planting its rich content ecosystem, including the flagship magazine, digital properties and successful live event franchises, in more global markets with women who have shared interests and aspirations.\n“The strategic vision and leadership that Michelle has provided to ESSENCE over the years have been exemplary, and we are thrilled to work with her and her talented team to provide the necessary resources and support to continue to grow the engagement and influence of the ESSENCE brand and transform this business,” said Richelieu Dennis, founder and chairperson of Essence Ventures. “As importantly, we are excited to be able to return this culturally relevant and historically significant platform to ownership by the people and the consumers whom it serves and offer new opportunities for the women leading the business to also be partners in the business.”\nDennis continued, “We remain committed to leveraging our resources to provide opportunities for other culturally-rooted entrepreneurs and businesses that further our culture and create economic opportunities for our communities. Our focus here will be on ensuring that Essence reaches its full potential via heightened capabilities, technology, products and touch points that super-serve the interests of Black women locally and globally. We look forward to helping generate new opportunities that create more value across the ESSENCE portfolio with unmatched content, commerce and international access for the millions of women it serves, as well as exceptional value for our advertising partners and content creators.”\nSince its founding in 1970, ESSENCE has been a hallmark for women’s empowerment and a cultural beacon of pride and celebration of the diverse images and lifestyles of Black women. Today, ESSENCE is an international, omni-channel destination for diverse storytelling and original content comprising beauty, fashion, lifestyle, entertainment and culture.\n“ESSENCE has always embodied and evangelized what the world now sees – the sheer beauty, power and magic of Black women,” said Ebanks. “From her influence in politics and at the polls, mandate for social justice, and demand for economic inclusion to her impact on beauty culture, leadership in equal rights efforts, and catalyzation of community empowerment, she is at the forefront – driving the cultural phenomena that are positively changing the world. ESSENCE will continue to lead that charge with, for and beside her as the unparalleled platform for her voice.”\nESSENCE currently reaches a global audience of more than 16 million across its various platforms encompassing its signature print magazine; digital, video and social platforms; television specials, including the Black Women in Hollywood Awards on OWN: The Oprah Winfrey Network; books; and live events, including the Street Style Block Party during New York Fashion Week and the annual ESSENCE Festival, a cultural celebration that debuted in 1995 and is now one of the country’s largest annual events, attracting more than 450,000 attendees.\nTerms of the transaction were not disclosed.\nAbout Essence Ventures\nEssence Ventures is an independent African-American owned company focused on merging content, community and commerce to meet the evolving cultural and lifestyle needs of women of color. The company began in 2017 and is chaired by its founder – entrepreneur, investor and philanthropist Richelieu Dennis.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180103006044/en/\nEssence Ventures\nLatraviette Smith-Wilson\nlatraviette@ngmventures.com\nor\nJanice McCafferty PR\njanice@janicemccaffertypr.com\njessica@janicemccaffertypr.com\n773-736-9034\nSource: Essence Ventures", "external_links": ["http://www.businesswire.com/news/home/20180103006044/en/"], "published": "2018-01-03T21:53:00.000+02:00", "crawled": "2018-01-03T22:46:01.012+02:00", "highlightTitle": ""}