{"organizations": [], "uuid": "623f238bd9aee5139081e68be51cc681fe3d6fe1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-malaysia-cybercrime/personal-details-of-over-200000-malaysian-organ-donors-leaked-online-report-idUSKBN1FD07B", "country": "US", "domain_rank": 408, "title": "Personal details of over 200,000 Malaysian organ donors leaked online: report", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T04:23:00.000+02:00", "replies_count": 0, "uuid": "623f238bd9aee5139081e68be51cc681fe3d6fe1"}, "author": "", "url": "https://www.reuters.com/article/us-malaysia-cybercrime/personal-details-of-over-200000-malaysian-organ-donors-leaked-online-report-idUSKBN1FD07B", "ord_in_thread": 0, "title": "Personal details of over 200,000 Malaysian organ donors leaked online: report", "locations": [], "entities": {"persons": [], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 2:24 AM / in 14 hours Personal details of over 200,000 Malaysian organ donors leaked online: report Reuters Staff 2 Min Read \nKUALA LUMPUR (Reuters) - Personal details of over 200,000 Malaysian organ donors and their next of kin have been leaked, with the data available online for over a year, a local tech portal reported on Tuesday. \nThis is the second big data leak reported in Malaysia in three months. In November, Malaysia said it was investigating an alleged attempt to sell personal data of more than 46 million mobile phone subscribers online, in what could be one of the largest leaks of customer data in Asia. \nFiles containing details of 220,000 pledged organ donors were leaked online as early as September 2016, Lowyat.net reported on Tuesday. The source was not identified. \nLeaked data includes the donor’s name, identification card number, race, nationality, address and phone numbers, it said. The data also contains details of each organ donor’s one nominated next of kin, taking the total number of data leak victims to 440,000. \nBased on the details and the scale of the data, it was likely leaked from a central database, the report said. \nThe country’s internet regulator, the Malaysian Communications and Multimedia Commission (MCMC), said it was assisting the police in their investigations into the reported leak. The police did not have an immediate comment. \nVijandren Ramadass, the founder of Lowyat.net, told Reuters that the portal discovered the leak being shared on a popular file sharing site for free. \n“The files are still online now. We did submit a direct request to the host on Sunday to remove the files but we didn’t get any response,” he said. \nLowyat.net also uncovered the data leak of mobile phone users last year. \nThat data of 46.2 million customers was extensive enough to allow criminals to create fraudulent identities to make online purchases, cybersecurity experts have said. It also contained personal data from some medical associations and a jobs portal. Reporting by A. Ananthalakshmi; Editing by Michael Perry", "external_links": [], "published": "2018-01-24T04:23:00.000+02:00", "crawled": "2018-01-24T04:29:26.000+02:00", "highlightTitle": ""}