{"organizations": [], "uuid": "3a6662be50051f96a3d82c0f8bfd1c037f48c08e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 29}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/gettyimages-891494080.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/19/sec-cryptocurrency-etfs-bitcoin/", "country": "US", "domain_rank": 1196, "title": "SEC: Cryptocurrency ETFs Are Off the Table For Now | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.888, "site_type": "news", "published": "2018-01-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "3a6662be50051f96a3d82c0f8bfd1c037f48c08e"}, "author": "David Meyer", "url": "http://fortune.com/2018/01/19/sec-cryptocurrency-etfs-bitcoin/", "ord_in_thread": 0, "title": "SEC: Cryptocurrency ETFs Are Off the Table For Now | Fortune", "locations": [], "entities": {"persons": [{"name": "david meyer", "sentiment": "negative"}, {"name": "dalia blass", "sentiment": "none"}, {"name": "tyler", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}], "locations": [], "organizations": [{"name": "sec", "sentiment": "negative"}, {"name": "securities and exchange commission", "sentiment": "negative"}, {"name": "etf", "sentiment": "none"}, {"name": "investment company institute and securities industry and financial markets association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By David Meyer January 19, 2018 \nThe Securities and Exchange Commission (SEC) has turned down plans by members of two Wall Street trade groups to set up exchange-traded funds (ETFs) for bitcoin and other cryptocurrencies, essentially killing off the idea for now. \nThe move was laid out in a letter sent by Dalia Blass, director of the SEC’s investment management division, to the Investment Company Institute and Securities Industry and Financial Markets Association. The SEC essentially said there were too many unanswered questions to allow for cryptocurrency ETFs without creating excessive risks for investors. \nThe SEC already blocked the creation of a bitcoin ETF by the Winklevoss twins, Tyler and Cameron, last year. \nA cryptocurrency ETF would allow people to invest in virtual coins without owning them directly—instead, they would own shares in the ETF, which owns the coins, and could therefore see their investment grow if the value of the cryptocurrencies held appreciates. \nWealthy investors already can buy and sell cryptocurrencies directly, but ETFs, which have become more popular in recent years due to their low management fees and the fact they they (unlike mutual funds) can be bought and sold during the trading day, would open the same possibility to more people with brokerage accounts. \n“Recently, the growth in cryptocurrencies and cryptocurrency-related products has attracted significant attention, and we have seen interest among sponsors in offering registered funds that would hold these new digital products,” the SEC wrote. “[We stand] ready to engage in dialogue with sponsors regarding the potential development of these funds. We believe, however, that there are a number of significant investor protection issues that need to be examined before sponsors begin offering these funds to retail investors.” \nThe first tranche of unanswered questions related to the valuation of the funds. What happens if the cryptocurrency “forks” into two branches? If the newly-created fork automatically gives people “coins” equivalent to their holdings in the original cryptocurrency—as happened with the creation of Bitcoin Cash and Bitcoin Gold —how would the fund account for those new holdings? \nAnd if there’s potential market manipulation going on , how might that have an impact on the settlement price of cryptocurrency futures? \nLiquidity is also an issue, given the notorious volatility of cryptocurrency markets. For example, if the market is plummeting and investors want to pull out, would the funds have enough cash on hand to allow them all to do so? \nThe SEC also has big questions about how fund assets would be protected in the case of a big digital wallet hack—a depressingly regular occurrence . \n“Until the questions identified above can be addressed satisfactorily, we do not believe that it is appropriate for fund sponsors to initiate registration of funds that intend to invest substantially in cryptocurrency and related products, and we have asked sponsors that have registration statements filed for such products to withdraw them,” the SEC said. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-19T02:00:00.000+02:00", "crawled": "2018-01-20T13:42:10.016+02:00", "highlightTitle": ""}