{"organizations": [], "uuid": "99d10a41fc998946f7bd304def7bbe10493b8abb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-control4-acquires-ihiji-to-deliver-industryas-most-robust-management-service-platform-for-the-connected-home.html", "country": "US", "domain_rank": 767, "title": "Control4 Acquires Ihiji to Deliver Industry’s Most Robust Management Service Platform for the Connected Home", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.199, "site_type": "news", "published": "2018-01-03T17:00:00.000+02:00", "replies_count": 0, "uuid": "99d10a41fc998946f7bd304def7bbe10493b8abb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-control4-acquires-ihiji-to-deliver-industryas-most-robust-management-service-platform-for-the-connected-home.html", "ord_in_thread": 0, "title": "Control4 Acquires Ihiji to Deliver Industry’s Most Robust Management Service Platform for the Connected Home", "locations": [], "entities": {"persons": [], "locations": [{"name": "austin", "sentiment": "none"}, {"name": "ihiji", "sentiment": "none"}], "organizations": [{"name": "invision", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Combined team to empower professional integrators with a broad set of monitoring and management tools and services to proactively support connected home customers\nSALT LAKE CITY--(BUSINESS WIRE)-- Control4 Corporation (NASDAQ: CTRL), a leading global provider of smart home solutions, today announced the acquisition of the intellectual property and key operating assets of Austin, Texas-based Ihiji, a leading provider of remote management services for technical integrators servicing connected home customers.\nBy combining two industry-leading network and device management solutions -- BakPak from Control4 and Invision from Ihiji -- into one unified service platform, Control4 will provide thousands of professional integrators with powerful device monitoring and management capability to efficiently and proactively support their connected-home customers.\n“Connected home opportunities are emerging globally, and their individual performance, reliability, and resilience are foundational to all successful installations. By combining Control4’s BakPak, with its strong network management capabilities, and Ihiji’s Invision, with its industry-leading device monitoring and management capabilities, Control4 can provide a set of unified cloud-based services to our dealers to securely and efficiently monitor end-customer systems. Dealers will receive alerts when performance concerns are detected; they can then remotely identify the root cause and initiate resolution actions, all without being on-premise. This will improve homeowner satisfaction through prompt and preemptive service, in a time-saving and cost-effective manner,” said Martin Plaehn.\nThe joint team is already developing the unified cloud-based service platform which will be made available in phases to all Control4 and Ihiji dealers and their end-customers later in the year. The shared goal is to operate a single integrated monitoring and services experience that provides all dealers with complete visibility and control at the network level, which would include over 2,000 third-party products, as well as all Control4 and Pakedge smart home equipment. Today, Ihiji works with the industry’s leading manufacturers including: Araknis, Belkin, Brocade, Cisco, Crestron, Dell, Denon, D-Link, Integra, Luxul, Marantz, Netgear, Onkyo, Pakedge, Panamax, Russound, Savant, Sky, Sony, SurgeX, Synaccess, Yamaha, and others, and those integrations will continue to be central to the new unified management platform. The new solution will also deliver a comprehensive view of every home and customer to enable dealers to monitor, assess, remediate, and track performance concerns associated with their customers’ homes.\nToday, Control4 will begin selling the previously named Ihiji APP-750 network appliance under its new moniker, the Pakedge NX-1, priced at US $650 MSRP. Control4 also announces the elimination of all subscription fees associated with the Ihiji Invision management service, making it easier and more financially efficient for dealers to provide remote management services to their end-customers.\n“Ihiji and Control4 share the conviction that network and device management capabilities are pivotal to every professional integrator in order to best serve their connected home customers,” said Stuart Rench, CEO, Ihiji. “By providing all dealers with the ability to monitor and manage thousands of devices, we are enabling them to detect and remediate issues remotely – often before a customer is aware there is even a problem. By combining with Control4, we can accelerate our plans to deliver more robust capabilities to further drive dealers’ success and end-customer satisfaction.”\nThe Ihiji product development and support teams are now part of Control4 and are working within the Company’s networking group to continue supporting existing Ihiji dealers, and to deliver the new unified management platform later this year. All Ihiji dealers using Invision will continue to be supported and are encouraged to continue utilizing and installing Invision in new installations. Later this year, progress releases towards the new unified and integrated service platform will be made available to all Ihiji, Control4, and Pakedge dealers and their installed customers through a software update process for supported service appliance devices: APP-750, NX-1, NK-1, RK-1 and WR-1.\nControl4 acquired certain intellectual property, development and support teams, and inventory of Ihiji on December 22, 2017. The acquisition enhances the network and device management platform of Control4, but is not expected to contribute material direct revenue in 2018. In addition, the Company anticipates that the direct operating costs associated with the Ihiji acquisition, (consisting primarily of personnel related expenses for development and support employees), will not be incremental to its forecasted 2018 financial plan. The financial impact of the acquisition was included within the Company’s prior public financial guidance.\nFor more information on Control4 visit www.control4.com . For more information on Ihiji visit www.ihiji.com .\nAbout Control4\nControl4 [NASDAQ: CTRL] is a leading global provider of automation and networking systems for homes and businesses, offering personalized control of lighting, music, video, comfort, security, communications, and more into a unified smart home system that enhances the daily lives of its consumers. Control4 unlocks the potential of connected devices, making networks more robust, entertainment systems easier to use, homes more comfortable and energy efficient, and provides families more peace of mind. Today, every home and business needs automation horsepower and a high-performance network to manage the increasing number of connected devices. The Control4 platform interoperates with nearly 11,000 third-party consumer electronics products, ensuring an ever-expanding ecosystem of devices will work together. Control4 is now available in 100 countries. Leveraging a professional distribution channel that includes over 5,500 custom integrators, retailers, and distributors authorized to sell the full-line of Control4 products, Pakedge branded networking solutions and Triad Speakers, Control4 is delivering intelligent solutions for consumers, major consumer electronics companies, hotels, and businesses around the world.\nForward Looking Statements\nThis press release contains “forward-looking statements” within the meaning of the “safe harbor” provisions of the Private Securities Litigation Reform Act of 1995, including but not limited to, statements regarding Control4’s possible future products and financial outlook. All statements other than statements of historical fact contained in this press release are forward-looking statements. These forward-looking statements are made as of the date they were first issued, and were based on the then-current expectations, estimates, forecasts, and projections, as well as the beliefs and assumptions of management. Forward-looking statements are subject to a number of risks and uncertainties, many of which involve factors or circumstances that are beyond Control4’s control. Control4’s actual results could differ materially from those stated or implied in forward-l", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.control4.com%2F&esheet=51736952&newsitemid=20180103005264&lan=en-US&anchor=Control4&index=1&md5=182b34207dc1d7898aef0f2db79ee02c", "http://www.businesswire.com/news/home/20180103005264/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ihiji.com&esheet=51736952&newsitemid=20180103005264&lan=en-US&anchor=www.ihiji.com&index=3&md5=df58e643b6db2bd4bd42d17410c73a94", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.control4.com%2F&esheet=51736952&newsitemid=20180103005264&lan=en-US&anchor=Control4&index=4&md5=720608bf7915604f34fa46981c454741", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.control4.com%2F&esheet=51736952&newsitemid=20180103005264&lan=en-US&anchor=www.control4.com&index=2&md5=7faf0658370e550fe3122f425ad1665c"], "published": "2018-01-03T17:00:00.000+02:00", "crawled": "2018-01-03T16:30:16.002+02:00", "highlightTitle": ""}