{"organizations": [], "uuid": "8d983f7032ffbe6d36284d31d6c43d66ecd837d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224441282&w=1200&r=LYNXMPEE0M0OX", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-italo-ipo/ex-ferrari-boss-takes-high-speed-rail-firm-down-ipo-route-idUSKBN1FC1A3", "country": "US", "domain_rank": 408, "title": "Ex-Ferrari boss takes high-speed rail firm down IPO route", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T19:11:00.000+02:00", "replies_count": 0, "uuid": "8d983f7032ffbe6d36284d31d6c43d66ecd837d0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-italo-ipo/ex-ferrari-boss-takes-high-speed-rail-firm-down-ipo-route-idUSKBN1FC1A3", "ord_in_thread": 0, "title": "Ex-Ferrari boss takes high-speed rail firm down IPO route", "locations": [], "entities": {"persons": [{"name": "luca cordero di montezemolo", "sentiment": "negative"}, {"name": "italo", "sentiment": "none"}, {"name": "montezemolo", "sentiment": "none"}, {"name": "stato", "sentiment": "none"}], "locations": [{"name": "rome", "sentiment": "none"}, {"name": "valle", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ipo", "sentiment": "negative"}, {"name": "milan stock exchange", "sentiment": "none"}, {"name": "ferrovie", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROME (Reuters) - When former Ferrari boss Luca Cordero di Montezemolo called up fellow businessman Diego della Valle in 2006 and suggested they create a company to run high-speed trains, his friend asked him what he had been drinking the night before.\nTwelve years on, the two Italian entrepreneurs and their co-investors, who put 1 billion euros ($1.2 billion) of their own money into a risky start-up, are preparing to pocket some gains in an IPO of the company, Italo, on the Milan stock exchange.\n“We are selling 40 percent to recover part of a huge investment, but we remain with 60 percent to have a strong presence in the future,” Montezemolo, Italo chairman, told Reuters in an interview at the company’s headquarters in Rome.\nIt took Italo six years to put its first train on the tracks and the company had to overcome a tangle of regulatory hurdles, not least fierce opposition from state-owned rail giant Ferrovie dello Stato, with some of their battles ending up in court.\nThe company risked going bust and had to launch a capital increase to stay afloat before breaking even in 2016.\nBut all that seems forgotten now: nearly 13 million passengers traveled on Italo’s sleek red trains in 2017, while revenue rose by a quarter and core earnings jumped 64 percent last year.\n“We had to put money on the table to buy trains, hire people, spend on training way before selling our first ticket ... looking back, we made a miracle,” said Montezemolo.\nItalo expects to complete the share offering by February, subject to market conditions and regulatory approval.\nPotential volatility around a national election in Italy on March 4 could delay the flotation by a few weeks or months, but will not derail the IPO plans, said Montezemolo.\nNo new shares will be offered in the IPO. Both Montezemolo and Chief Executive Flavio Cattaneo, who plans to keep his own 5 percent stake in the company, believe Italo generates enough free cash flow to fund growth plans.\nMontezemolo told Reuters Italo wanted to be ready for further expansion at home, and also to export its business model abroad once new EU rules come into force meant to open up passenger rail networks to competition and create a single market from 2020.\nItalo recently ordered 17 new EVO trains from French engineering group Alstom ( ALSO.PA ) without issuing any new debt, raising its fleet to 42 and preparing for new routes, like the popular Turin-Venice connection that will be launched in May.\nCattaneo said Italo, a business with a core profit margin of around 35 percent, should be seen as an infrastructure firm with a predictable cost base.\nNeither executive would comment on a possible valuation for the company. But a share buy-back mandate approved last week implied a valuation of around 2 billion euros.\nA 500 million-euro bond issue last year attracted demand four times its size. Italo pledges to pay out between 50 and 70 percent of net profits as dividends over the next three years.\n“The market will decide the price. If we like it, we will list, if not, there is no obligation,” Cattaneo said.\nAdditional reporting by Mark Bendeich; Editing by Pravin Char\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T19:11:00.000+02:00", "crawled": "2018-01-23T17:43:33.000+02:00", "highlightTitle": ""}