{"organizations": [], "uuid": "b740261014cba85f5f48c518c5bbd9f820c57066", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-hsh-nordbank-privatisation/hsh-nordbank-suitors-j-c-flowers-and-cerberus-to-begin-exclusive-talks-idUKKBN1F42JY", "country": "US", "domain_rank": 408, "title": "HSH Nordbank suitors J.C. Flowers and Cerberus to begin exclusive talks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T22:09:00.000+02:00", "replies_count": 0, "uuid": "b740261014cba85f5f48c518c5bbd9f820c57066"}, "author": "", "url": "https://uk.reuters.com/article/uk-hsh-nordbank-privatisation/hsh-nordbank-suitors-j-c-flowers-and-cerberus-to-begin-exclusive-talks-idUKKBN1F42JY", "ord_in_thread": 0, "title": "HSH Nordbank suitors J.C. Flowers and Cerberus to begin exclusive talks", "locations": [], "entities": {"persons": [{"name": "klaus lauer", "sentiment": "none"}, {"name": "arno schuetze", "sentiment": "none"}], "locations": [{"name": "hamburg", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "schleswig-holstein", "sentiment": "none"}], "organizations": [{"name": "hsh nordbank", "sentiment": "negative"}, {"name": "cerberus", "sentiment": "negative"}, {"name": "j.c. flowers", "sentiment": "negative"}, {"name": "bawag", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "hsh", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 8:09 PM / Updated an hour ago HSH Nordbank suitors J.C. Flowers and Cerberus to begin exclusive talks Klaus Lauer , Arno Schuetze 3 Min Read \nBERLIN/FRANKFURT (Reuters) - The state owners of Germany’s HSH Nordbank on Monday agreed to exclusive talks with potential buyers J.C. Flowers and Cerberus as long-running attempts to privatise the ailing bank near conclusion, three people close to the matter said. \nThe buyout groups were given roughly two weeks to negotiate a deal with the German regional states of Schleswig-Holstein and Hamburg, which hold 89 percent of the bank, one of the sources said on Monday. \nJ.C. Flowers, which owns 5 percent of HSH, and Cerberus submitted a joint bid with a headline price of more than 700 million euros (622.21 million pounds) , a person familiar with the matter had said last week. \nIt remained unclear what conditions were attached to the offer, including how a state guarantee against future HSH losses will be treated, the sources said. \nBawag ( BAWG.VI ), still 35-percent-owned by Cerberus after the Austrian lender’s 2017 IPO, is also part of the consortium, with a stake of around 2.5 pct, another source familiar with the matter said. \n“The case for buying German banks is that they have an return on equity of 4 to 5 percent in a negative rate environment,” the source said, adding that by slashing complexity and costs, it was possible to get them to double digit returns. \nThe person, pointing to Bawag’s experience in Austria, said: “It’s just that it takes a lot of work.” \nRival suitor Apollo ( APO.N ) has been told to wait in the wings in case the final talks with J.C. Flowers and Cerberus fall apart, the sources said. \nSocrates Capital, however, is out of the running, they said, adding that its offer was the highest but was deemed by HSH’s owners as less attractive in terms of transaction security. \nHSH, its owners and the bidders declined to comment or were not immediately available for comment. \nHSH became the world’s largest lender to the shipping industry in the 2000s but required a state rescue after a sector slump. \nUnder European Union state-aid rules, the privatisation needs to be finalised by the end of February and HSH’s owners have not asked to extend that deadline. \nWhile a sale of only parts of HSH is an option, its state owners are not allowed to absorb any losses if they wind down assets on their own. \nLike its peers, HSH has benefited from the first signs of recovery in the shipping market in recent months.   Michael Shields; Editing by Douglas Busvine, David Goodman and Jane Merriman", "external_links": [], "published": "2018-01-15T22:09:00.000+02:00", "crawled": "2018-01-15T22:33:27.004+02:00", "highlightTitle": ""}