{"organizations": [], "uuid": "28e7e318c24e187985f408f5a082e27eb749ce77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-mi9-retail-acquires-justenough-software.html", "country": "US", "domain_rank": 767, "title": "Mi9 Retail Acquires JustEnough Software", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.992, "site_type": "news", "published": "2018-01-15T15:30:00.000+02:00", "replies_count": 0, "uuid": "28e7e318c24e187985f408f5a082e27eb749ce77"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-mi9-retail-acquires-justenough-software.html", "ord_in_thread": 0, "title": "Mi9 Retail Acquires JustEnough Software", "locations": [], "entities": {"persons": [{"name": "justenough", "sentiment": "none"}, {"name": "neil moses", "sentiment": "none"}], "locations": [{"name": "miami", "sentiment": "none"}], "organizations": [{"name": "justenough software", "sentiment": "none"}, {"name": "gartner", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MIAMI, Jan. 15, 2018 /PRNewswire/ -- Mi9 Retail, a leading provider of omni-channel retail software, announced today that it has acquired JustEnough Software, a leader in demand management solutions for retail, wholesale and direct-to-consumer businesses worldwide. The acquisition of JustEnough adds best-of-breed planning, allocations, and replenishment solutions to the Mi9 Retail platform of integrated, analytics-driven merchandising, store, and digital commerce solutions.\nAccording to Gartner, 70% of Tier 1 multichannel retailers will have implemented advanced retail assortment management applications by 2021. Customer-centric demand planning and management is replacing the traditional product-centric approach as retailers strive to create great experiences for their customers across channels. Advanced analytics help retailers provide store-specific assortments that reflect specific customer behavior segments.\n\"We did an extensive evaluation of the market for demand management solutions and JustEnough stood out as a clear winner,\" said Neil Moses, CEO of Mi9 Retail. \"We believe that JustEnough solutions provide a substantial ROI that will further our goal of providing Mi9 Retail customers with a significant competitive advantage.\"\nThe JustEnough Demand Management solutions are an ideal fit with the Mi9 suite, and will provide current customers and future prospects of both companies with enterprise merchandising and planning that scales to the needs of Tier 1 and 2 retailers. Going forward, JustEnough solutions will continue to be sold both as standalone or as integrated functionality in the Mi9 Unified Retail Suite.\n\"Today is an exciting day for JustEnough\", said Malcolm Buxton, President and CEO of JustEnough. \"The power of the Mi9 solutions combined with JustEnough's enterprise retail planning and demand management will give retailers the ability to optimize their entire supply chain planning process with a single solution vendor.\"\n\"We are executing a strategy of carefully selecting and integrating analytics-driven enterprise retail technology that will advance the industry,\" added Moses. \"Mi9 Merchant customers have consistently selected that platform for its core merchandising and business intelligence functionality. JustEnough adds a perfect complement of solutions that significantly increase our value proposition to the market.\"\n\"As the retail environment continues to shift, retailers are continually looking for optimal ways to engage with customers and suppliers,\" said Preston McKenzie, Special Advisor at General Atlantic and Executive Chairman of Mi9 Retail. \"Mi9 Retail acquiring JustEnough will further enable the company to execute on its strategy of building an end-to-end suite of products and solutions that helps retailers to comprehensively manage their operations. We remain thrilled about our partnership and look forward to continuing to support Mi9 Retail strategic business initiatives and growth.\"\nAbout Mi9 Retail\nMi9 Retail is passionate about helping retailers create great experiences for their customers – online, in-store, and on any device. We know that great retail experiences happen when optimized inventory management intersects perfectly with well-executed customer engagement strategies to deliver higher customer loyalty, better margins, and a more engaged workforce. Our solutions for merchandise management, digital commerce, and store operations are used by leading retailers across the globe. The company is headquartered in Miami, FL, with operations in North America, Europe, and Asia. Visit www.mi9retail.com to learn more.\nAbout JustEnough\nJustEnough is a leading provider of omni-channel Demand Management solutions for retail, wholesale and direct-to-consumer businesses and is serving the planning needs of many of the world's leading brands. Available OnSite and OnCloud, JustEnough's innovative solutions help companies to forecast customer demand; plan assortments, allocations and inventory; shape demand with markdowns and promotions and then execute on those plans. To learn more about JustEnough, visit www.justenough.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/mi9-retail-acquires-justenough-software-300582383.html\nSOURCE Mi9 Retail", "external_links": ["http://www.prnewswire.com/news-releases/mi9-retail-acquires-justenough-software-300582383.html"], "published": "2018-01-15T15:30:00.000+02:00", "crawled": "2018-01-15T16:28:33.003+02:00", "highlightTitle": ""}