{"organizations": [], "uuid": "f0c2630c87e06e550b88f54eedc27803f43ac54a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219455298&w=1200&r=LYNXMPEE0400B", "site_section": "http://feeds.reuters.com/Reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-colorado-shooter/accused-colorado-abortion-clinic-gunman-can-be-forcibly-medicated-idUSKBN1EU00X", "country": "US", "domain_rank": 408, "title": "Accused Colorado abortion clinic gunman can be forcibly medicated", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T02:13:00.000+02:00", "replies_count": 0, "uuid": "f0c2630c87e06e550b88f54eedc27803f43ac54a"}, "author": "", "url": "https://www.reuters.com/article/us-colorado-shooter/accused-colorado-abortion-clinic-gunman-can-be-forcibly-medicated-idUSKBN1EU00X", "ord_in_thread": 0, "title": "Accused Colorado abortion clinic gunman can be forcibly medicated", "locations": [], "entities": {"persons": [{"name": "robert lewis dear", "sentiment": "none"}, {"name": "keith coffman", "sentiment": "none"}, {"name": "sandra maler", "sentiment": "none"}], "locations": [{"name": "colorado", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "colorado court of appeals", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "colorado planned parenthood", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 12:13 AM / Updated 16 hours ago Accused Colorado abortion clinic gunman can be forcibly medicated Keith Coffman 3 Min Read \nDENVER (Reuters) - A man accused of fatally shooting three people at a Colorado Planned Parenthood clinic in 2015, who was deemed mentally unfit to stand trial, can be forcibly medicated in an effort to restore him to competency, an appeals court ruled on Thursday. \nThe Colorado Court of Appeals upheld a lower court’s ruling that the state can administer anti-psychotic drugs to Robert Lewis Dear, 59, over his lawyer’s objections. \nDear’s attorneys could not be reached for comment on whether they will appeal to the state supreme court. They previously have declined to make any statements about the case outside of court. \nDear was charged with multiple counts of murder and dozens of additional crimes stemming from the rampage at a Planned Parenthood clinic in Colorado Springs in November 2015. \nThe shooting left three dead, including a police officer from a nearby college who responded to the scene. Dear surrendered after a three-hour standoff with police. \nIn earlier courtroom outbursts, Dear said he was guilty and proclaimed himself “a warrior for the babies,” prompting Judge Gilbert Martinez, of Colorado’s El Paso County Court, to order a mental evaluation. \nTwo state-appointed psychologists testified that Dear, a South Carolina native, suffers from a psychotic delusional disorder. \nMartinez deemed Dear incompetent to stand trial. He has been held at the state mental hospital in Pueblo, where he has refused medications, court documents showed. \nProsecutors sought court permission to forcibly medicate Dear with Zyprexa, Abilify, Haldol and Cogentin, according to court papers. \nDefense lawyers argued that the state failed to meet the legal requirements needed to involuntarily medicate Dear. \nAfter a closed hearing, Judge Jill Mattoon, of Pueblo District Court, ruled that the state had the right to forcibly medicate Dear in an attempt to bring him to trial. \nDear’s lawyers appealed her ruling, setting the stage for Thursday’s opinion by a three-judge appellate panel. \nThe appeals court in its ruling noted that a U.S. Supreme Court decision allows the state “to render a criminal defendant competent to stand trial” if certain criteria are met. \n“Because the (Supreme Court) test was met, we further conclude that the forced administration of antipsychotic medications to Dear is not an unconstitutional deprivation of his liberty,” the judges ruled in their unanimous decision. \nUnder Colorado’s criminal insanity statute, a defendant found unfit to stand trial must have the competency determination reviewed every 90 days. Reporting by Keith Coffman; Editing by Sandra Maler and Leslie Adler", "external_links": [], "published": "2018-01-05T02:13:00.000+02:00", "crawled": "2018-01-05T02:30:30.014+02:00", "highlightTitle": ""}