{"organizations": [], "uuid": "865f6346c723db4a11c0de829f29af650bd4b01a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1227055725&w=1200&r=LYNXMPEE0U1KZ", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-illinois-governor/illinois-governor-pitches-bipartisanship-to-aid-state-finances-idUSKBN1FK2YZ", "country": "US", "domain_rank": 408, "title": "Illinois governor pitches bipartisanship to aid state finances", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T22:06:00.000+02:00", "replies_count": 0, "uuid": "865f6346c723db4a11c0de829f29af650bd4b01a"}, "author": "", "url": "https://www.reuters.com/article/us-illinois-governor/illinois-governor-pitches-bipartisanship-to-aid-state-finances-idUSKBN1FK2YZ", "ord_in_thread": 0, "title": "Illinois governor pitches bipartisanship to aid state finances", "locations": [], "entities": {"persons": [{"name": "karen pierog", "sentiment": "none"}, {"name": "bruce rauner", "sentiment": "none"}, {"name": "rauner", "sentiment": "none"}], "locations": [{"name": "illinois", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "springfield", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "capitol", "sentiment": "none"}], "organizations": [{"name": "amazon.com inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 8:20 PM / Updated an hour ago Illinois governor pitches bipartisanship to aid state finances Karen Pierog 3 Min Read \nCHICAGO (Reuters) - Illinois’ Republican Governor Bruce Rauner on Wednesday called for a collaborative effort with Democrats to tackle rising pension costs and restore the state’s “financial integrity.” \nHe also pledged to introduce a balanced fiscal 2019 budget next month, something that Democratic legislative leaders said he has failed to do since taking office in 2015. \nIn his state of the state address in the Capitol in Springfield, Rauner said a bipartisan approach is needed for Illinois to win economic prizes like a $5 billion second headquarters project for Amazon.com Inc, which earlier this month named Chicago as one of 20 finalists. \n“United, we can create thousands and thousands of jobs, attract billions of dollars in investment and set millions of Illinoisians free to make more, buy more, build more,” Rauner said. \nAn impasse between Rauner and Democrats who control the legislature left Illinois without complete budgets for an unprecedented two straight fiscal years. The enactment of a fiscal 2018 budget and income tax rate hike by lawmakers in July over Rauner’s vetoes saved the state’s credit ratings from sinking into junk status. \nThere was little sign that Democrats were willing to work with Rauner, who is seeking re-election in November, on a budget or other issues. \nDemocratic House Speaker Michael Madigan, who is a frequent target of attacks by Rauner, suggested the governor should remain on the sidelines this session. \n“That way, serious leaders can continue working to move our state forward, while the governor can continue to ignore his utterly dismal record without accomplishments, and avoid the real discussion about the damage he has inflicted on our state,” Madigan said in a statement. \nDemocratic Senate President John Cullerton, who appeared on public television following the speech, said Rauner’s promise of a balanced spending plan for the fiscal year that begins July 1 was met with laughter. \n“The reason why people couldn’t keep a straight face when he said he was going to introduce a balanced budget is because (Rauner) has never been even close to a balanced budget,” Cullerton said. \nRauner has said he wants to roll back the $5 billion income tax hike even as the state’s payment to its five pension systems is projected to grow to $8.5 billion in fiscal 2019 from $7.94 billion this year. Illinois also has a lingering $8.5 billion unpaid bill backlog that had ballooned to more than $16 billion during the impasse. Reporting by Karen Pierog; Editing by Matthew Lewis", "external_links": [], "published": "2018-01-31T22:06:00.000+02:00", "crawled": "2018-01-31T22:26:46.029+02:00", "highlightTitle": ""}