{"organizations": [], "uuid": "d8e97983add1c3e873e77487ecbcafbcaaa3fd73", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-cb4-analytics-highs-announce-partnership-to-increase-same-store-growth.html", "country": "US", "domain_rank": 767, "title": "CB4 Analytics & High's Announce Partnership to Increase Same-Store Growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.057, "site_type": "news", "published": "2018-01-11T23:10:00.000+02:00", "replies_count": 0, "uuid": "d8e97983add1c3e873e77487ecbcafbcaaa3fd73"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-cb4-analytics-highs-announce-partnership-to-increase-same-store-growth.html", "ord_in_thread": 0, "title": "CB4 Analytics & High's Announce Partnership to Increase Same-Store Growth", "locations": [], "entities": {"persons": [{"name": "high", "sentiment": "none"}, {"name": "katharine castro", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "baltimore", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}], "organizations": [{"name": "cb4 analytics & high", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 11, 2018 /PRNewswire/ -- Today High's, a Maryland-based c-store chain, and CB4 announced their new partnership to increase same-store growth. High's will run CB4's advanced machine learning software to discover and correct in-store operational inefficiencies and uncover merchandising opportunities across all of their High's locations.\nCB4's patented machine-learning solution detects unmet demand opportunities in stores. These opportunities are translated into actionable recommendations that are sent to the relevant operations or merchandising team with guidance on how to capture the lost sales opportunity and improve the in-store customer experience.\nThe High's brand originated in Baltimore over 86 years ago as a chain of ice cream stores. Over the years, High's transformed itself into a chain of 46 modern, full service convenience stores across Maryland. While maintaining their heritage tie to ice cream, High's has built a strong reputation for friendly service and an inviting atmosphere.\n\"High's is extremely excited to partner with CB4,\" said Katharine Castro, Chief Strategy Officer of High's. \"We are looking forward to leveraging CB4's proprietary platform to drive same-store sales growth with minimal effort from our associates. We were drawn to CB4's ability to harness big data and distill it down into simple actionable items that can generate meaningful results for our chain. Time is of the essence in the daily operation of a c-store and so the ability to roll out a program that requires only 10-15 minutes of the manager's time per week, while potentially generating in excess of 1% same-store sales growth is a relative no-brainer.\"\n\"I'm delighted to partner with High's because of their long history of providing top-quality service to their customers,\" said Yoni Benshaul, CEO of CB4. \"We could feel the excitement during the onboarding process—the team was receptive and enthusiastic about putting the product into action. There's a reason they've been in business for so many years, and part of that is their flexibility, open-mindedness, and eagerness to try new technologies and keep innovating year after year.\"\nAbout CB4 Analytics\nCB4 Analytics provides a patented software solution for brick and mortar retailers that increases same-store growth by up to 3% using simple sales data. The software requires no hardware installation and most customers are up and running in a single day. With offices in New York and Tel Aviv, CB4 is a proud partner of Sequoia Capital. For additional information, visit www.c-b4.com . Follow us on Twitter at @CB4_Analytics and connect with us on LinkedIn.\nContact\nMatthew McAlister, 347.819.1900\nmatthewm@c-b4.com\nView original content: http://www.prnewswire.com/news-releases/cb4-analytics--highs-announce-partnership-to-increase-same-store-growth-300581665.html\nSOURCE CB4 Analytics", "external_links": ["http://www.prnewswire.com/news-releases/cb4-analytics--highs-announce-partnership-to-increase-same-store-growth-300581665.html", "http://www.c-b4.com/"], "published": "2018-01-11T23:10:00.000+02:00", "crawled": "2018-01-11T23:33:23.000+02:00", "highlightTitle": ""}