{"organizations": [], "uuid": "8ed26298ec49220c72b7100aebe2d88eff1b9a2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-abbvie-reports-full-year-and-fourth-quarter-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "AbbVie Reports Full-Year and Fourth-Quarter 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T15:51:00.000+02:00", "replies_count": 0, "uuid": "8ed26298ec49220c72b7100aebe2d88eff1b9a2e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-abbvie-reports-full-year-and-fourth-quarter-2017-financial-results.html", "ord_in_thread": 0, "title": "AbbVie Reports Full-Year and Fourth-Quarter 2017 Financial Results", "locations": [], "entities": {"persons": [{"name": "richard a. gonzalez", "sentiment": "none"}], "locations": [{"name": "ill.", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "global humira", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NORTH CHICAGO, Ill., Jan. 26, 2018 /PRNewswire/ -- AbbVie (NYSE:ABBV) announced financial results for the fourth quarter ended December 31, 2017.\n\"2017 reflects another year of top-tier performance, demonstrating the strong momentum in our business,\" said Richard A. Gonzalez, chairman and chief executive officer, AbbVie. \"Our guidance for 2018 underscores our confidence in our ability to continue to deliver industry-leading performance. This is an exciting time for AbbVie -- we are poised to launch a number of differentiated products over the next 12 to 18 months that will fuel significant growth in the coming years. We remain committed to delivering on our long-term strategic vision for AbbVie.\"\nFourth-Quarter Results\nWorldwide net revenues were $7.739 billion in the fourth quarter, up 13.9 percent year-over-year on a GAAP basis. On an operational basis, adjusted net revenues increased 12.6 percent, excluding a 1.5 percent favorable impact from foreign exchange. Global HUMIRA sales increased 14.0 percent on a reported basis, or 12.3 percent operationally, excluding a 1.7 percent favorable impact from foreign exchange. In the U.S., HUMIRA sales grew 15.1 percent in the quarter. Internationally, HUMIRA sales grew 6.5 percent, excluding a 5.2 percent favorable impact from foreign exchange. Fourth-quarter global IMBRUVICA net revenues were $708 million, with U.S. sales of $585 million and international profit sharing of $123 million for the quarter, reflecting growth of 38.7 percent. On a GAAP basis, the gross margin ratio in the fourth quarter was 70.5 percent. The adjusted gross margin ratio was 79.0 percent. On a GAAP basis, selling, general and administrative expense was 25.2 percent of net revenues. The adjusted SG&A expense was 21.2 percent of net revenues. On a GAAP basis, research and development expense was 18.1 percent of net revenues. The adjusted R&D expense was 17.1 percent, reflecting funding actions supporting all stages of our pipeline. On a GAAP basis, the operating margin in the fourth quarter was 23.2 percent. The adjusted operating margin was 40.7 percent. On a GAAP basis, net interest expense was $252 million. Financial results for 2017 reflected a net charge of $0.77 per diluted share related to the December 2017 enactment of the Tax Cuts and Jobs Act. The net charge included the one-time impact of approximately $4.5 billion for mandatory taxation on previously unrepatriated earnings, partially offset by the revaluation of tax-related balance sheet items. These amounts have been treated as specified and excluded from adjusted diluted EPS. On a GAAP basis, the tax rate in the quarter was 95.6 percent. The adjusted tax rate was 18.9 percent. Diluted EPS in the fourth quarter was $0.03 on a GAAP basis. Adjusted diluted EPS, excluding specified items, was $1.48, up 23.3 percent.\nKey Events from the Fourth Quarter\nAbbVie announced positive top-line results from the Phase 3 SELECT-MONOTHERAPY clinical trial evaluating upadacitinib (ABT-494) as a monotherapy treatment in patients with moderate to severe rheumatoid arthritis who did not adequately respond to treatment with methotrexate. Results showed that after 14 weeks of treatment, both once-daily doses of upadacitinib (15 mg and 30 mg) met the study's primary endpoints of ACR20 and low disease activity versus continuing prior stable methotrexate therapy. Both doses also achieved all ranked and all key secondary endpoints. The safety profile of upadacitinib was consistent with previously reported Phase 3 SELECT clinical trials and Phase 2 studies, and no new safety signals were detected. AbbVie expects data from two additional registrational studies in the first half of 2018, supporting regulatory submissions in the second half of 2018. AbbVie announced the U.S. Food and Drug Administration (FDA) granted Breakthrough Therapy Designation for upadacitinib in adult patients with moderate to severe atopic dermatitis who are candidates for systemic therapy, supported by positive Phase 2b results. The Phase 3 clinical program for upadacitinib in atopic dermatitis is expected to begin in the first half of 2018. AbbVie announced top-line results from the IMMhance study, the fourth pivotal clinical trial evaluating risankizumab, an investigational interleukin-23 (IL-23) inhibitor, for the treatment of patients with moderate to severe plaque psoriasis. Results showed that risankizumab met all co-primary and ranked secondary endpoints in the study. At week 16, nearly half (47 percent) of patients receiving risankizumab achieved complete skin clearance (PASI 100) versus placebo (1 percent), and static Physician Global Assessment (sPGA) score of clear or almost clear skin was achieved by 84 percent of risankizumab patients compared to 7 percent of placebo patients. Among patients who achieved clear or almost clear skin at week 28, 87 percent of patients maintained this response at one year, compared to 61 percent who were switched to placebo at week 28. Risankizumab's safety profile in IMMhance was consistent with previously reported Phase 3 clinical trials, with no new safety signals detected across the Phase 3 program. The company plans to submit its applications for regulatory approval in the first half of 2018. Risankizumab is being developed in collaboration with Boehringer Ingelheim. AbbVie presented results from the Phase 3 MURANO study of VENCLEXTA/VENCLYXTO (venetoclax) in combination with Rituxan at the American Society of Hematology (ASH) Annual Meeting. Results show that patients with relapsed or refractory (R/R) chronic lymphocytic leukemia (CLL) achieved significantly prolonged median progression-free survival (PFS) with VENCLEXTA in combination with Rituxan compared with bendamustine in combination with Rituxan. Investigator-assessed twenty-four month PFS estimates were 84.9 percent and 36.3 percent, respectively, with independent review committee (IRC)-assessed PFS showing similar results. Also in the trial, 83.5 percent of patients achieved peripheral blood minimal residual disease (MRD)-negativity with VENCLEXTA in combination with Rituxan, compared to 23.1 percent with bendamustine in combination with Rituxan. At the time of the analysis, safety data were consistent with the known safety profiles of the medicines. Regulatory applications were recently submitted for VENCLEXTA in combination with Rituxan for treatment of patients with R/R CLL. VENCLEXTA is being developed by AbbVie and Genentech, a member of the Roche Group. AbbVie presented new and updated IMBRUVICA (ibrutinib) data at the ASH meeting, including pooled analysis results of the longest follow-up data to-date in Bruton's tyrosine kinase (BTK) inhibition for R/R mantle cell lymphoma (MCL) patients treated with IMBRUVICA, demonstrating that, at three years, 45 percent of patients were able to achieve overall survival (OS) and 26 percent had PFS. AbbVie also presented new three-year follow-up data from the RESONATE-2 study (PCYC-1115/1116), which found that previously-untreated CLL/SLL patients reported sustained improvements in measures of well-being with IMBRUVICA versus chemotherapy with chlorambucil. At 30 months, IMBRUVICA was also associated with a greater PFS rate of 85 percent versus chlorambucil, which had a PFS rate of 28 percent. IMBRUVICA is jointly developed and commercialized with Janssen Biotech, Inc. AbbVie announced the Phase 3 iNNOVATE trial evaluating IMBRUVICA in combination with Rituxan in patients with treatment-naïve and previously-treated Waldenström's macroglobulinemia successfully met its primary endpoint and demonstrated improvement of PFS compared to Rituxan alone. The Independent Data Monitoring Committee recommended that the study be unblinded based on the positive outcome from the pre-specified interim analysis data. The company expects to submit these data for label augmentation in 2018. At the American Society for Reproductive Medicine Scientific Congress & Expo (ASRM), AbbVie, in cooperation with Neurocrine Biosciences, presented detailed results from two replicate Phase 3 extension studies evaluating the long-term efficacy and safety of elagolix, an investigational, orally administered gonadotropin-releasing hormone (GnRH) antagonist, being evaluated for the management of endometriosis with associated pain. In the extension studies, elagolix demonstrated sustained reduction in average monthly menstrual pelvic pain and non-menstrual pelvic pain in women through the 12-month treatment period. The safety and tolerability of elagolix was consistent with the anticipated effects of reduced estradiol levels and no new safety concerns were identified with elagolix use for the 12-month treatment period. Elagolix is currently under priority regulatory review for the management of endometriosis with associated pain.\nFull-Year 2018 Outlook, Including Impact of U.S. Tax Reform\nGAAP diluted EPS for the full-year 2018 is expected to be between $6.45 and $6.55.\nAbbVie is raising its previously announced adjusted EPS guidance range for the full-year 2018 from $6.37 to $6.57 to $7.33 to $7.43 to reflect the impact of U.S. tax reform and stronger operating performance. The midpoint of this guidance reflects year-over-year growth of 32 percent, more than half of which is driven by growth in the underlying business. Relative to the previously issued 2018 guidance provided in October 2017, this guidance includes an increase of $0.08 as a result of stronger operating dynamics.\nAbbVie's adjusted EPS guidance range reflects an effective tax rate of approximately 9 percent in 2018. In 2018, AbbVie will experience a one-time net tax benefit related to the timing of the phase in of provisions of the new legislation on certain subsidiaries. This benefit has been excluded from the adjusted EPS guidance, and included in the GAAP guidance range.\nAbbVie anticipates the company's adjusted effective tax rate to increase to 13 percent over the next five years as a result of increased domestic income and investment.\nIncreased U.S. Investments\nOver the next five years, AbbVie plans to invest approximately $2.5 billion in capital projects in the U.S. and the company is currently evaluating additional expansion of its U.S. facilities. Also, in 2018, the company plans to make a one-time charitable contribution of approximately $350 million to select not-for-profit organizations based in the United States. The company also plans to accelerate pension funding by $750 million, as well as enhance non-executive employee compensation.\nProvisional Estimates of the Impact of U.S. Tax Reform\nFinancial results for 2017 reflect provisional amounts related to the December 2017 enactment of the Tax Cuts and Jobs Act. These provisional estimates are based on AbbVie's initial analysis and current interpretation of the legislation. Given the complexity of the legislation, anticipated guidance from the U.S. Treasury, and the potential for additional guidance from the Securities and Exchange Commission (SEC) or the Financial Accounting Standards Board, these estimates may be adjusted during 2018.\nAbout AbbVie\nAbbVie is a global, research-driven biopharmaceutical company committed to developing innovative advanced therapies for some of the world's most complex and critical conditions. The company's mission is to use its expertise, dedicated people and unique approach to innovation to markedly improve treatments across four primary therapeutic areas: immunology, oncology, virology and neuroscience. In more than 75 countries, AbbVie employees are working every day to advance health solutions for people around the world. For more information about AbbVie, please visit us at www.abbvie.com . Follow @abbvie on Twitter, Facebook or LinkedIn .\nConference Call\nAbbVie will host an investor conference call today at 8:00 a.m. Central time to discuss our fourth-quarter performance. The call will be webcast through AbbVie's Investor Relations website at investors.abbvie.com . An archived edition of the call will be available after 11:00 a.m. Central time.\nNon-GAAP Financial Results\nFinancial results for 2017 and 2016 are presented on both a reported and a non-GAAP basis. Reported results were prepared in accordance with GAAP and include all revenue and expenses recognized during the period. Non-GAAP results adjust for certain non-cash items and for factors that are unusual or unpredictable, and exclude those costs, expenses, and other specified items presented in the reconciliation tables later in this release. AbbVie's management believes non-GAAP financial measures provide useful information to investors regarding AbbVie's results of operations and assist management, analysts, and investors in evaluating the performance of the business. Non-GAAP financial measures should be considered in addition to, and not as a substitute for, measures of financial performance prepared in accordance with GAAP. The company's 2018 financial guidance is also being provided on both a reported and a non-GAAP basis.\nForward-Looking Statements\nSome statements in this news release are, or may be considered, forward-looking statements for purposes of the Private Securities Litigation Reform Act of 1995. The words \"believe,\" \"expect,\" \"anticipate,\" \"project\" and similar expressions, among others, generally identify forward-looking statements. AbbVie cautions that these forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from those indicated in the forward-looking statements. Such risks and uncertainties include, but are not limited to, challenges to intellectual property, competition from other products, difficulties inherent in the research and development process, adverse litigation or government action, and changes to laws and regulations applicable to our industry. Additional information about the economic, competitive, governmental, technological and other factors that may affect AbbVie's operations is set forth in Item 1A, \"Risk Factors,\" of AbbVie's 2016 Annual Report on Form 10-K, which has been filed with the SEC. AbbVie undertakes no obligation to release publicly any revisions to forward-looking statements as a result of subsequent events or developments, except as required by law.\nAbbVie Inc.\nKey Product Revenues\nQuarter Ended December 31, 2017\n(Unaudited)\n% Change vs. 4Q16\nNet Revenues (in millions)\nInternational\nTotal\nU.S.\nInt'l.\nTotal\nU.S.\nOperational\nReported\nOperational\nReported\nADJUSTED NET REVENUES a\n$4,967\n$2,772\n$7,739\n15.9%\n7.0%\n11.0%\n12.6%\n14.1%\nHumira\n3,313\n1,579\n4,892\n15.1\n6.5\n11.7\n12.3\n14.0\nImbruvica b\n585\n123\n708\n35.3\n57.8\n57.8\n38.7\n38.7\nHCV\n214\n296\n510\n>100.0\n14.5\n15.4\n62.7\n63.4\nLupron\n181\n43\n224\n1.5\n3.3\n5.6\n1.8\n2.2\nCreon\n235\n—\n235\n10.6\nn/a\nn/a\n10.6\n10.6\nSynagis\n—\n282\n282\nn/a\n4.3\n4.4\n4.3\n4.4\nSynthroid\n205\n—\n205\n—\nn/a\nn/a\n—\n—\nAndroGel\n140\n—\n140\n(19.6)\nn/a\nn/a\n(19.6)\n(19.6)\nKaletra\n17\n96\n113\n(33.7)\n(11.3)\n(9.7)\n(15.6)\n(14.3)\nSevoflurane\n22\n77\n99\n(1.3)\n(3.4)\n(1.6)\n(2.9)\n(1.5)\nDuodopa\n17\n83\n100\n55.2\n15.7\n23.0\n21.3\n27.6\nNote: \"Operational\" growth reflects the percentage change over the prior year excluding the impact of exchange rate fluctuations.\nn/a = not applicable\na\nAdjusted net revenues exclude specified items. Refer to the Reconciliation of GAAP Reported to Non-GAAP Adjusted Information for further details. Percentage change is calculated using adjusted net revenues.\nb\nReflects profit sharing for Imbruvica international revenues.\nAbbVie Inc.\nKey Product Revenues\nTwelve Months Ended December 31, 2017\n(Unaudited)\n% Change vs. 12M16\nNet Revenues (in millions)\nInternational\nTotal\nU.S.\nInt'l.\nTotal\nU.S.\nOperational\nReported\nOperational\nReported\nADJUSTED NET REVENUES a\n$18,251\n$9,965\n$28,216\n14.6%\n2.7%\n3.4%\n10.1%\n10.4%\nHumira\n12,361\n6,066\n18,427\n18.5\n6.7\n7.4\n14.4\n14.6\nImbruvica b\n2,144\n429\n2,573\n35.8\n70.0\n70.0\n40.5\n40.5\nHCV\n338\n936\n1,274\n(1.4)\n(20.5)\n(20.6)\n(16.2)\n(16.3)\nLupron\n669\n160\n829\n0.8\n0.5\n1.4\n0.7\n0.9\nCreon\n831\n—\n831\n13.9\nn/a\nn/a\n13.9\n13.9\nSynagis\n—\n738\n738\nn/a\n0.6\n1.2\n0.6\n1.2\nSynthroid\n781\n—\n781\n2.3\nn/a\nn/a\n2.3\n2.3\nAndroGel\n577\n—\n577\n(14.5)\nn/a\nn/a\n(14.5)\n(14.5)\nKaletra\n71\n352\n423\n(38.6)\n(21.1)\n(18.8)\n(24.7)\n(22.9)\nSevoflurane\n78\n332\n410\n(2.1)\n(3.7)\n(4.6)\n(3.4)\n(4.1)\nDuodopa\n61\n294\n355\n66.1\n13.1\n14.6\n19.8\n21.1\nNote: \"Operational\" growth reflects the percentage change over the prior year excluding the impact of exchange rate fluctuations.\nn/a = not applicable\na\nAdjusted net revenues exclude specified items. Refer to the Reconciliation of GAAP Reported to Non-GAAP Adjusted Information for further details. Percentage change is calculated using adjusted net revenues.\nb\nReflects profit sharing for Imbruvica international revenues.\nAbbVie Inc.\nConsolidated Statements of Earnings\nQuarter and Twelve Months Ended December 31, 2017 and 2016\n(Unaudited) (In millions, except per share data)\nFourth Quarter\nEnded December 31\nTwelve Months\nEnded December 31\n2017\n2016\n2017\n2016\nNet revenues\n$\n7,739\n$\n6,796\n$\n28,216\n$\n25,638\nCost of products sold\n2,280\n1,555\n7,040\n5,833\nSelling, general and administrative\n1,951\n1,653\n6,275\n5,855\nResearch and development\n1,402\n1,190\n4,982\n4,366\nAcquired in-process research and development\n312\n40\n327\n200\nTotal operating cost and expenses\n5,945\n4,438\n18,624\n16,254\nOperating earnings\n1,794\n2,358\n9,592\n9,384\nInterest expense, net\n252\n290\n1,004\n965\nNet foreign exchange loss (gain)\n320\n(10)\n348\n303\nOther expense, net\n29\n80\n513\n232\nEarnings before income tax expense\n1,193\n1,998\n7,727\n7,884\nIncome tax expense\n1,141\n607\n2,418\n1,931\nNet earnings\n$\n52\n$\n1,391\n$\n5,309\n$\n5,953\nDiluted earnings per share\n$\n0.03\n$\n0.85\n$\n3.30\n$\n3.63\nAdjusted diluted earnings per share a\n$\n1.48\n$\n1.20\n$\n5.60\n$\n4.82\nWeighted-average diluted shares outstanding\n1,602\n1,623\n1,603\n1,631\na\nRefer to the Reconciliation of GAAP Reported to Non-GAAP Adjusted Information for further details.\nAbbVie Inc.\nReconciliation of GAAP Reported to Non-GAAP Adjusted Information\nQuarter Ended December 31, 2017\n(Unaudited) (In millions, except per share data)\n1. Specified items impacted results as follows:\n4Q17\nEarnings\nDiluted\nPre-tax\nAfter-tax\nEPS\nAs reported (GAAP)\n$\n1,193\n$\n52\n$\n0.03\nAdjusted for specified items:\nIntangible asset amortization\n268\n203\n0.13\nMilestones and other R&D expenses\n75\n75\n0.05\nAcquired IPR&D\n312\n312\n0.19\nChange in fair value of contingent consideration\n79\n79\n0.05\nLitigation reserves\n273\n221\n0.14\nIntangible asset impairment\n354\n244\n0.15\nU.S. tax reform repatriation tax\n—\n4,509\n2.81\nOther impacts related to tax law change\n316\n(3,267)\n(2.04)\nTax audit settlement\n—\n(91)\n(0.06)\nOther\n75\n52\n0.03\nAs adjusted (non-GAAP)\n$\n2,945\n$\n2,389\n$\n1.48\nMilestones and other R&D expenses are associated with milestone payments for previously announced collaborations. Acquired IPR&D primarily reflects upfront payments related to R&D collaborations and licensing arrangements with third parties. Other primarily includes restructuring charges associated with streamlining global operations.\n2. The impact of the specified items by line item was as follows:\n4Q17\nCost of\nproducts\nsold\nSG&A\nR&D\nAcquired\nIPR&D\nNet\nforeign\nexchange\nloss\nOther\nexpense,\nnet\nAs reported (GAAP)\n$\n2,280\n$\n1,951\n$\n1,402\n$\n312\n$\n320\n$\n29\nAdjusted for specified items:\nIntangible asset amortization\n(268)\n—\n—\n—\n—\n—\nMilestones and other R&D expenses\n—\n—\n(75)\n—\n—\n—\nAcquired IPR&D\n—\n—\n—\n(312)\n—\n—\nChange in fair value of contingent consideration\n—\n—\n—\n—\n—\n(79)\nLitigation reserves\n—\n(273)\n—\n—\n—\n—\nIntangible asset impairment\n(354)\n—\n—\n—\n—\n—\nOther impacts related to tax law change\n—\n—\n—\n—\n(316)\n—\nOther\n(33)\n(37)\n(5)\n—\n—\n—\nAs adjusted (non-GAAP)\n$\n1,625\n$\n1,641\n$\n1,322\n$\n—\n$\n4\n$\n(50)\n3. The adjusted tax rate for the fourth quarter of 2017 was 18.9 percent, as detailed below:\n4Q17\nPre-tax\nincome\nIncome\ntaxes\nTax rate\nAs reported (GAAP)\n$\n1,193\n$\n1,141\n95.6\n%\nSpecified items\n1,752\n(585)\n(33.4)\n%\nAs adjusted (non-GAAP)\n$\n2,945\n$\n556\n18.9\n%\nAbbVie Inc.\nReconciliation of GAAP Reported to Non-GAAP Adjusted Information\nQuarter Ended December 31, 2016\n(Unaudited) (In millions, except per share data)\n1. Specified items impacted results as follows:\n4Q16\nEarnings\nDiluted\nPre-tax\nAfter-tax\nEPS\nAs reported (GAAP)\n$\n1,998\n$\n1,391\n$\n0.85\nAdjusted for specified items:\nIntangible asset amortization\n210\n170\n0.10\nMilestones and other R&D expenses\n10\n10\n0.01\nAcquired IPR&D\n40\n40\n0.02\nAcquisition related costs\n63\n42\n0.02\nChange in fair value of contingent consideration\n85\n85\n0.05\nRevaluation due to Section 987 tax law change\n—\n187\n0.12\nOther\n55\n39\n0.03\nAs adjusted (non-GAAP)\n$\n2,461\n$\n1,964\n$\n1.20\nMilestones and other R&D expenses are associated with milestone payments for previously announced collaborations. Acquired IPR&D primarily reflects an R&D collaboration. Acquisition related costs primarily include the amortization of the acquisition date fair value step-up for inventory related to the acquisition of Pharmacyclics. Other primarily includes a debt extinguishment charge as a result of the redemption of the company's 1.75% senior notes, milestone revenue under a previously announced collaboration and restructuring charges associated with streamlining global operations.\n2. The impact of the specified items by line item was as follows:\n4Q16\nNet\nrevenues\nCost of\nproducts\nsold\nSG&A\nR&D\nAcquired\nIPR&D\nInterest\nexpense,\nnet\nOther\nexpense,\nnet\nAs reported (GAAP)\n$\n6,796\n$\n1,555\n$\n1,653\n$\n1,190\n$\n40\n$\n290\n$\n80\nAdjusted for specified items:\nIntangible asset amortization\n—\n(210)\n—\n—\n—\n—\n—\nMilestones and other R&D expenses\n—\n—\n—\n(10)\n—\n—\n—\nAcquired IPR&D\n—\n—\n—\n—\n(40)\n—\n—\nAcquisition related costs\n—\n(53)\n(5)\n(5)\n—\n—\n—\nChange in fair value of contingent consideration\n—\n—\n—\n—\n—\n—\n(85)\nOther\n(12)\n(5)\n(23)\n—\n—\n(39)\n—\nAs adjusted (non-GAAP)\n$\n6,784\n$\n1,287\n$\n1,625\n$\n1,175\n$\n—\n$\n251\n$\n(5)\n3. The adjusted tax rate for the fourth quarter of 2016 was 20.2 percent, as detailed below:\n4Q16\nPre-tax\nincome\nIncome\ntaxes\nTax rate\nAs reported (GAAP)\n$\n1,998\n$\n607\n30.4\n%\nSpecified items\n463\n(110)\n(24.0)\n%\nAs adjusted (non-GAAP)\n$\n2,461\n$\n497\n20.2\n%\nAbbVie Inc.\nReconciliation of GAAP Reported to Non-GAAP Adjusted Information\nTwelve Months Ended December 31, 2017\n(Unaudited) (In millions, except per share data)\n1. Specified items impacted results as follows:\n12M17\nEarnings\nDiluted\nPre-tax\nAfter-tax\nEPS\nAs reported (GAAP)\n$\n7,727\n$\n5,309\n$\n3.30\nAdjusted for specified items:\nIntangible asset amortization\n1,076\n809\n0.51\nMilestones and other R&D expenses\n143\n143\n0.09\nAcquired IPR&D\n327\n327\n0.20\nAcquisition related costs\n73\n49\n0.03\nChange in fair value of contingent consideration\n626\n625\n0.39\nLitigation reserves\n370\n286\n0.18\nIntangible asset impairment\n354\n244\n0.15\nU.S. tax reform repatriation tax\n—\n4,509\n2.81\nOther impacts related to tax law change\n316\n(3,267)\n(2.04)\nTax audit settlement\n—\n(91)\n(0.06)\nOther\n94\n68\n0.04\nAs adjusted (non-GAAP)\n$\n11,106\n$\n9,011\n$\n5.60\nMilestones and other R&D expenses are associated with milestone payments for previously announced collaborations. Acquired IPR&D primarily reflects upfront payments related to R&D collaborations and licensing arrangements with third parties. Acquisition related costs primarily includes the amortization of the acquisition date fair value step-up for inventory related to the acquisition of Pharmacyclics. Other primarily includes restructuring charges associated with streamlining global operations.\n2. The impact of the specified items by line item was as follows:\n12M17\nCost of\nproducts\nsold\nSG&A\nR&D\nAcquired\nIPR&D\nNet\nforeign\nexchange\nloss\nOther\nexpense,\nnet\nAs reported (GAAP)\n$\n7,040\n$\n6,275\n$\n4,982\n$\n327\n$\n348\n$\n513\nAdjusted for specified items:\nIntangible asset amortization\n(1,076)\n—\n—\n—\n—\n—\nMilestones and other R&D expenses\n—\n—\n(143)\n—\n—\n—\nAcquired IPR&D\n—\n—\n—\n(327)\n—\n—\nAcquisition related costs\n(52)\n(14)\n(5)\n—\n—\n(2)\nChange in fair value of contingent consideration\n—\n—\n—\n—\n—\n(626)\nLitigation reserves\n—\n(370)\n—\n—\n—\n—\nIntangible asset impairment\n(354)\n—\n—\n—\n—\n—\nOther impacts related to tax law change\n—\n—\n—\n—\n(316)\n—\nOther\n(47)\n(42)\n(5)\n—\n—\n—\nAs adjusted (non-GAAP)\n$\n5,511\n$\n5,849\n$\n4,829\n$\n—\n$\n32\n$\n(115)\n3. The adjusted tax rate for the full-year 2017 was 18.9 percent, as detailed below:\n12M17\nPre-tax\nincome\nIncome\ntaxes\nTax rate\nAs reported (GAAP)\n$\n7,727\n$\n2,418\n31.3\n%\nSpecified items\n3,379\n(323)\n(9.6)\n%\nAs adjusted (non-GAAP)\n$\n11,106\n$\n2,095\n18.9\n%\nAbbVie Inc.\nReconciliation of GAAP Reported to Non-GAAP Adjusted Information\nTwelve Months Ended December 31, 2016\n(Unaudited) (In millions, except per share data)\n1. Specified items impacted results as follows:\n12M16\nEarnings\nDiluted\nPre-tax\nAfter-tax\nEPS\nAs reported (GAAP)\n$\n7,884\n$\n5,953\n$\n3.63\nAdjusted for specified items:\nIntangible asset amortization\n764\n615\n0.38\nMilestones and other R&D expenses\n80\n80\n0.05\nAcquired IPR&D\n200\n200\n0.12\nAcquisition related costs\n392\n273\n0.16\nChange in fair value of contingent consideration\n228\n228\n0.14\nVenezuela devaluation loss\n298\n298\n0.18\nRevaluation due to Section 987 tax law change\n—\n187\n0.12\nOther\n59\n70\n0.04\nAs adjusted (non-GAAP)\n$\n9,905\n$\n7,904\n$\n4.82\nMilestones and other R&D expenses are associated with milestone payments for previously announced collaborations. Acquired IPR&D primarily reflects R&D collaborations as well as upfront payments related to licensing arrangements with third parties. Acquisition related costs primarily includes compensation expense, financing and other costs associated with the acquisitions of Stemcentrx and Boehringer Ingelheim compounds, as well as the amortization of the acquisition date fair value step-up for inventory related to the acquisition of Pharmacyclics. Other includes a debt extinguishment charge as a result of the redemption of the company's 1.75% senior notes, a charge for the impairment of an intangible asset, restructuring charges associated with streamlining global operations, a charge to increase tax reserves, milestone revenue under previously announced collaborations and prior period royalty revenue related to a patent lawsuit settlement.\n2. The impact of the specified items by line item was as follows:\n12M16\nNet\nrevenues\nCost of\nproducts\nsold\nSG&A\nR&D\nAcquired\nIPR&D\nInterest\nexpense,\nnet\nNet\nforeign\nexchange\nloss\nOther\nexpense,\nnet\nAs reported (GAAP)\n$\n25,638\n$\n5,833\n$\n5,855\n$\n4,366\n$\n200\n$\n965\n$\n303\n$\n232\nAdjusted for specified items:\nIntangible asset amortization\n—\n(764)\n—\n—\n—\n—\n—\n—\nMilestones and other R&D expenses\n—\n—\n—\n(80)\n—\n—\n—\n—\nAcquired IPR&D\n—\n—\n—\n—\n(200)\n—\n—\n—\nAcquisition related costs\n—\n(197)\n(41)\n(140)\n—\n—\n—\n(14)\nChange in fair value of contingent consideration\n—\n—\n—\n—\n—\n—\n—\n(228)\nVenezuela devaluation loss\n—\n—\n—\n—\n—\n—\n(298)\n—\nOther\n(78)\n(66)\n(38)\n6\n—\n(39)\n—\n—\nAs adjusted (non-GAAP)\n$\n25,560\n$\n4,806\n$\n5,776\n$\n4,152\n$\n—\n$\n926\n$\n5\n$\n(10)\n3. The adjusted tax rate for the full-year 2016 was 20.2 percent, as detailed below:\n12M16\nPre-tax\nincome\nIncome\ntaxes\nTax rate\nAs reported (GAAP)\n$\n7,884\n$\n1,931\n24.5\n%\nSpecified items\n2,021\n70\n3.4\n%\nAs adjusted (non-GAAP)\n$\n9,905\n$\n2,001\n20.2\n%\nView original content with multimedia: http://www.prnewswire.com/news-releases/abbvie-reports-full-year-and-fourth-quarter-2017-financial-results-300588761.html\nSOURCE AbbVie", "external_links": ["http://www.abbvie.com/", "http://twitter.com/abbvie", "http://www.linkedin.com/company/abbvie", "http://investors.abbvie.com/", "http://www.facebook.com/abbviecareers", "http://www.prnewswire.com/news-releases/abbvie-reports-full-year-and-fourth-quarter-2017-financial-results-300588761.html"], "published": "2018-01-26T15:51:00.000+02:00", "crawled": "2018-01-26T17:58:42.007+02:00", "highlightTitle": ""}