{"organizations": [], "uuid": "61dc0d618e8848ecca6e69500ac8c3cbb02e07c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221262890&w=1200&r=LYNXMPEE0A1X7", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-cyber/russians-may-be-planning-hack-to-cast-shadow-on-olympics-researchers-idUKKBN1F031W", "country": "US", "domain_rank": 408, "title": "Russians may be planning hack to cast shadow on Olympics - researchers", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T00:30:00.000+02:00", "replies_count": 0, "uuid": "61dc0d618e8848ecca6e69500ac8c3cbb02e07c6"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-cyber/russians-may-be-planning-hack-to-cast-shadow-on-olympics-researchers-idUKKBN1F031W", "ord_in_thread": 0, "title": "Russians may be planning hack to cast shadow on Olympics - researchers", "locations": [], "entities": {"persons": [{"name": "david ingram", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "threatconnect inc", "sentiment": "none"}, {"name": "world anti-doping agency", "sentiment": "none"}, {"name": "u.s. anti-doping agency", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 10:34 PM / Updated 7 hours ago Russians may be planning hack to cast shadow on Olympics - researchers David Ingram 3 Min Read \nSAN FRANCISCO (Reuters) - A Virginia-based cybersecurity firm said on Thursday it had found early indications that Russia-based hackers may be planning attacks against anti-doping agencies in retaliation for Russia’s exclusion from next month’s Winter Olympic Games. FILE PHOTO - A man smokes near Olympic rings placed in the courtyard of the Russian Olympic Committee headquarters in Moscow, Russia December 12, 2017. REUTERS/Maxim Shemetov \nResearchers from ThreatConnect Inc said that within the past month unknown people had registered three web domains that mimic those of the World Anti-Doping Agency, the U.S. Anti-Doping Agency and the Olympic Council of Asia. \nThe moves bore similarities to the methods that a Russian hacking group known as Fancy Bear used in the past, the cybersecurity firm said in a report. \nFancy Bear was blamed for an Olympics-related hack in 2016, when the World Anti-Doping Agency said the group was responsible for stealing and publishing confidential medical information about U.S. Olympic athletes. \nThe International Olympic Committee (IOC) and the Russian embassy in Washington did not immediately respond to requests for comment. \nThreatConnect said there was no evidence that hackers had used the web domains maliciously, but that the domains could provide the building blocks for future attacks. \nDomains that imitate, or “spoof,” legitimate websites are a common tactic employed by hackers for various types of attacks, such as gaining access to email accounts. \nThe imitation domains “raise the question of a broader campaign against the upcoming 2018 Winter Games,” ThreatConnect said. \nNext month’s Games in Pyeongchang, South Korea, are expected to draw worldwide attention, making the event a potentially valuable target for hackers amid a politically charged atmosphere. \nThe IOC last month banned the Russian national team from the Winter Games for what it called “unprecedented systematic manipulation” of the anti-doping system, although it allowed Russian athletes with a clean history of non-doping to compete under a neutral flag. \nWestern governments and security experts have linked the hacking group known as Fancy Bear or APT28 to a Russian spy agency, and have blamed it for operations including an attack on the Democratic National Committee ahead of the 2016 U.S. elections. \nFurther raising expectations of an Olympics-related attack, a Twitter account that ThreatConnect said was most likely tied to Fancy Bear said on Wednesday it had obtained correspondence belonging to IOC officials. \nA second U.S.-based security firm, McAfee, said on Monday that its security researchers had obtained a malicious email targeting organizations involved with the Pyeongchang Games. \nMcAfee did not cite a potential source for the email, but added: “With the upcoming Olympics, we expect to see an increase in cyberattacks using Olympics-related themes.” Reporting by David Ingram; Additional reporting by Suzanne Barlyn in New York; Editing by Daniel Wallis", "external_links": [], "published": "2018-01-12T00:30:00.000+02:00", "crawled": "2018-01-12T00:51:42.000+02:00", "highlightTitle": ""}