{"organizations": [], "uuid": "0bb6611f82143c835258b246c39048eddeda5a77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224216865&w=1200&r=LYNXMPEE0L1Q8", "site_section": "http://feeds.feedburner.com/Reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-usa-israel-palestinians/u-s-eu-discordant-notes-on-jerusalem-underline-mideast-policy-rift-idUKKBN1FB2EE", "country": "US", "domain_rank": 408, "title": "U.S., EU discordant notes on Jerusalem underline Mideast policy rift", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T19:25:00.000+02:00", "replies_count": 0, "uuid": "0bb6611f82143c835258b246c39048eddeda5a77"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-israel-palestinians/u-s-eu-discordant-notes-on-jerusalem-underline-mideast-policy-rift-idUKKBN1FB2EE", "ord_in_thread": 0, "title": "U.S., EU discordant notes on Jerusalem underline Mideast policy rift", "locations": [], "entities": {"persons": [{"name": "mahmoud abbas", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "robin emmott", "sentiment": "none"}, {"name": "jeff mason", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "federica mogherini", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "mideast", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "east jerusalem", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 5:26 PM / Updated 4 hours ago U.S., EU discordant notes on Jerusalem underline Mideast policy rift Jeff Mason , Robin Emmott 6 Min Read \nJERUSALEM/BRUSSELS (Reuters) - In a fresh display of Western discord over Middle East peace efforts, the United States said on Monday its Israel embassy would move to Jerusalem by the end of 2019, while its European Union allies voiced support for East Jerusalem as capital of a Palestinian state. \nVice-President Mike Pence, visiting Jerusalem, announced the timing of the move in a speech to Israel’s parliament, earning applause from Israeli legislators but also stirring a brief protest by Israeli Arab lawmakers, who held signs reading “Jerusalem is the capital of Palestine”. \nIn Brussels, the EU’s foreign policy chief Federica Mogherini assured Palestinian President Mahmoud Abbas at a meeting that the EU supported his ambition to have East Jerusalem as capital of a Palestinian state. \nU.S. President Donald Trump suddenly reversed decades of U.S. policy in December when he recognised Jerusalem as Israel’s capital, generating fury from Palestinians and the Arab world and concern among Washington’s western allies. \nTrump’s move delighted Israel, Washington’s closest Middle East ally, but stirred disquiet from world powers including Russia and China who worry it would stoke regional tensions and further drive a wedge between Israel and the Palestinians. \nMany countries believe Jerusalem should ultimately be shared between Israel and a future Palestinian state and so are unwilling to make decisions about recognition of its status before a comprehensive peace settlement is agreed. \n“In the weeks ahead, our administration will advance its plan to open the United States Embassy in Jerusalem – and that United States Embassy will open before the end of next year,” Pence, part-way through a Middle East tour, said. FAULTLINES \n“Jerusalem is Israel’s capital – and, as such, President Trump has directed the State Department to immediately begin preparations to move the United States Embassy from Tel Aviv to Jerusalem.” \nReaction to Pence locally split along Israeli-Palestinian faultlines. \nPalestinian chief negotiator Saeb Erekat said on Twitter that Pence’s speech showed the U.S. administration was part of the problem rather than the solution. \n“The messianic discourse of Pence is a gift to extremists”, he wrote. “His message to the rest of the world is clear: violate international law and resolutions and the U.S. will reward you.” \nIsraeli analyst Amotz Asa-El told Reuters that Pence’s speech was important in a practical sense because it set a deadline for the move. U.S. Vice President Mike Pence addresses the Knesset, Israeli Parliament, in Jerusalem January 22, 2018. REUTERS/Ariel Schalit/Pool \nHe added: “I think that he (Trump) is making it plain to the Palestinians that their policy of protestation - which was visible in the plenum with the Arab lawmakers, but even more importantly in Abbas’s absence and his journey to Brussels - that none of this is going to make America budge.” \nIn Gaza, Essam Abu Ibrahim, 28, a store owner, said: “It will not change the fact that Jerusalem is an occupied city and it will continue to be an occupied city after this decision.” \nIn Brussels, Abbas repeated his call for East Jerusalem as capital as he urged the EU member nations to recognise a state of Palestine immediately, arguing that this would not disrupt negotiations with Israel on a peace settlement for the region. \nWhile Abbas made no reference to Trump’s move on Jerusalem or Pence’s visit to the city, his presence at the EU headquarters in Brussels was seized on by European officials as a chance to restate opposition to Trump’s Dec. 6 decision to move the U.S. Embassy to Jerusalem. SHARED CAPITAL Slideshow (3 Images) \nPalestinians seek East Jerusalem, including the walled Old City with its holy sites, as the capital of their own future state. Israel, which annexed East Jerusalem after capturing it in 1967 in a move not internationally recognised, regards all of the city as its “eternal and indivisible capital”. \nMogherini, in what appeared to be a veiled reference to Trump’s recognition of Jerusalem as capital of Israel, called on those involved in the process to speak and act “wisely”, with a sense of responsibility. \n“I want to reassure President Abbas of the firm commitment of the European Union to the two-state solution with Jerusalem as the shared capital of the two states,” Mogherini said. \nBefore Abbas’ arrival, she was more outspoken, saying: “Clearly there is a problem with Jerusalem. That is a very diplomatic euphemism,” in reference to Trump’s position. \nBut Mogherini said she still wanted to work with the United States on Middle East peace talks and had discussed ways to restart them late last year with Pence and U.S. Secretary of State Rex Tillerson. \nPence, who visited Egypt and Jordan before travelling to Israel, said that with its policy shift on Jerusalem, “the United States has chosen fact over fiction - and fact is the only true foundation for a just and lasting peace”. \nPence, an evangelical Christian, drew parallels between Jewish history dating back to biblical times and the European pilgrims who founded the United States. \nWelcoming Pence to the parliament, Netanyahu said he was the first U.S. vice president to have been accorded the honour. \nIsrael and the United States “are striving together to achieve a true peace, lasting peace, peace with all our neighbours, including the Palestinians,” Netanyahu said. Additional reporting by Jeffrey Heller, Dan Williams and Ali Sawafta; Editing by William Maclean", "external_links": [], "published": "2018-01-22T19:25:00.000+02:00", "crawled": "2018-01-22T19:48:43.067+02:00", "highlightTitle": ""}