{"organizations": [], "uuid": "62c33c0213099d097c4a27cf3e5d7f7c60238677", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-sigma-designs-inc-announces-plan-to-sell-its-z-wave-business-for-240-million.html", "country": "US", "domain_rank": 767, "title": "Sigma Designs, Inc. Announces Plan to Sell its Z-Wave Business for $240 Million", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.345, "site_type": "news", "published": "2018-01-24T00:15:00.000+02:00", "replies_count": 0, "uuid": "62c33c0213099d097c4a27cf3e5d7f7c60238677"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-sigma-designs-inc-announces-plan-to-sell-its-z-wave-business-for-240-million.html", "ord_in_thread": 0, "title": "Sigma Designs, Inc. Announces Plan to Sell its Z-Wave Business for $240 Million", "locations": [], "entities": {"persons": [{"name": "sig", "sentiment": "none"}], "locations": [{"name": "fremont", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "silicon labs", "sentiment": "negative"}, {"name": "sigma designs, inc", "sentiment": "neutral"}, {"name": "sigma designs", "sentiment": "none"}, {"name": "sigma", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sale to Silicon Labs to be structured as an asset transaction per the terms of the December 7, 2017 definitive agreement Sale of Z-Wave business for gross proceeds of $240 million in cash Sigma Designs intends to initiate a plan of liquidation following the closing of the asset transaction, which plan is anticipated to include a substantial initial cash distribution to shareholders\nFREMONT, Calif., Jan. 23, 2018 (GLOBE NEWSWIRE) -- Sigma Designs, Inc. ® (NASDAQ:SIGM) today announced that due to the initial closing conditions in the previously announced definitive agreement with Silicon Labs (NASDAQ:SLAB) for the acquisition of the entirety of Sigma Designs not being satisfied, the parties will move forward with the sale of Sigma’s Z-Wave business to Silicon Labs for $240 million in an asset transaction, pursuant to the terms of the definitive agreement and contingent upon approval by Sigma Designs’ shareholders.\nContingent upon such shareholder approval, Sigma Designs expects that the asset transaction would close in either the late first or early second calendar quarter of 2018. Sigma Designs has material U.S. and international tax attributes that it believes would significantly reduce the taxes otherwise payable with respect to the asset transaction.\nSigma Designs intends to initiate a plan of liquidation following the closing of the asset transaction, which plan is currently anticipated to include a substantial initial cash distribution to shareholders. Sigma Designs intends to work with its advisors to confirm its plan of liquidation and will provide additional information to shareholders as it becomes available. The board of directors expects, subject to uncertainties inherent in the winding up of its business, to make an initial distribution following the Z-Wave asset sale and initiation of the plan of liquidation and a final liquidating distribution as promptly as practicable after payment of, or provision for, outstanding claims. No assurances can be made as to the ultimate amounts to be distributed or the timing of any distributions.\n“We conducted an extensive and thorough review process over several months, and are pleased to have achieved what we believe is a positive outcome for our shareholders,” said Thinh Tran, Chief Executive Officer of Sigma Designs, Inc. “While Sigma Designs has built a strong Z-Wave business and established itself as a leader in the home automation market, it became increasingly apparent that the significant investment needed to maintain our strong position would have been challenging against much larger competitors in a consolidating semiconductor industry.\n“With the initial closing conditions for the sale of the entire company not met, our definitive agreement with Silicon Labs reverts to the asset sale of the Z-Wave business, which not only enables us to capture the value of the Z-Wave business, it also provides our shareholders certainty of value,” said Mr. Tran.\nSigma Designs is exploring alternatives to increase the available cash for distribution to shareholders through divestment of additional businesses, including its Home Connectivity business, its Mobile IoT business, remaining assets of its Smart TV and Set-top Box businesses and other assets. Sigma is currently in active conversations regarding the divestment of additional businesses and assets.\nSigma already has initiated certain actions to preserve the amount of cash available to shareholders, including a wind-down process for its Smart TV and Set-top Box business to reduce such business’ workforce from 416 to 120 employees. Sigma Designs intends to wind down or divest its remaining businesses over the next 12 months, but exact timing will depend on a variety of factors.\nDeutsche Bank is serving as financial advisor to Sigma Designs.\nSigma Designs\nSigma Designs, Inc. ® (NASDAQ:SIGM) is a world leader in enabling smart home convergence. The company designs and builds semiconductor technologies for Internet of Things (IoT) smart home devices. For more information about Sigma Designs, please visit: www.sigmadesigns.com .\nZ-Wave ® is a registered trademark of Sigma Designs (NASDAQ:SIGM) and its subsidiaries in the United States and other countries. z-wave.sigmadesigns.com .\nForward-Looking Statements\nThis announcement contains forward-looking statements (including within the meaning of Section 21E of the United States Securities Exchange Act of 1934, as amended, and Section 27A of the United States Securities Act of 1933, as amended) concerning Sigma Designs, Silicon Labs (“Silicon Labs”), the proposed acquisition (the “Acquisition”) by Silicon Labs of the Z-Wave business of Sigma Designs (“Sigma Designs”) and related matters. These statements include, but are not limited to, statements that address Sigma Designs’ expected future business and financial performance and statements about (i) the timing, completion and expected benefits of the Acquisition, (ii) plans, objectives and intentions with respect to future operations, including the potential implementation of a plan of liquidation and the anticipated time period in which Sigma Designs intends to wind down or divest its remaining businesses, (iii) the impact of the Acquisition on Sigma Designs’ business, (iv) the timing, potential amount and payment of cash distributions to Sigma Designs’ shareholders, (v) other information relating to the Acquisition and (vi) other statements identified by words such as “will”, “expect”, “intends”, “believe”, “anticipate”, “estimate”, “should”, “intend”, “plan”, “potential”, “predict” “project”, “aim”, and similar words, phrases or expressions. These forward-looking statements are based on current expectations and beliefs of the management of Sigma Designs, as well as assumptions made by, and information currently available to, such management, current market trends and market conditions and involve risks and uncertainties, many of which are outside the companies’ and management’s control, and which may cause actual results to differ materially from those contained in forward-looking statements. Accordingly, you should not place undue reliance on such statements.\nParticular uncertainties that could materially affect future results include any risks associated with the Acquisition such as: (1) the risk that the conditions to the closing of the Acquisition are not satisfied, including the risk that required approvals from the shareholders of Sigma Designs for the Acquisition or any applicable regulatory approvals are not obtained; (2) litigation relating to the transaction and the potential liquidation plans; (3) uncertainties as to the timing of the consummation of the Acquisition and the ability of each party to consummate the Acquisition; (4) risks that the proposed Acquisition and its announcement to initiate a liquidation plan disrupt the current plans and operations of Sigma Designs; (5) the ability of Sigma Designs to retain and hire key personnel; (6) competitive responses to the proposed transaction; (7) unexpected costs, charges, liabilities or expenses resulting from the Acquisition and Sigma Designs’ plans to wind down or divest its remaining businesses; (8) potential adverse reactions or changes to business relationships resulting from the announcement, the potential liquidation plan or completion of the Acquisition; (9) risks related to the ongoing operations of Sigma Designs’ business, which may negatively impact Sigma Designs’ performance in the fourth quarter of fiscal 2018 and in future periods as well as Sigma Designs’ ability to liquidate, wind down or divest its remaining businesses, including the impact to Sigma Designs’ business due to a decrease in demand for the end products which incorporate its chipsets; an overall decrease in demand for its chipsets resulting from this announcement, the effect that product introductions and transitions, changes in product pricing or mix, and/or increases in component costs could have on Sigma Designs’ gross margins; the inventory risk associated with Sigma Designs’ need to order components in advance of customer orders; the continued availability of certain components and services essential to Sigma Designs’ business, and (10) legislative, regulatory and economic developments.\nThe foregoing review of important factors that could cause actual events to differ from expectations should not be construed as exhaustive and should be read in conjunction with Sigma Designs’ filings with the Securities and Exchange Commission (“SEC”), which you may obtain for free at the SEC’s website at http://www.sec.gov , and which discuss additional important risk factors that may affect their respective businesses, results of operations and financial conditions. Sigma Designs undertakes no intent or obligation to publicly update or revise any of these forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\nSigma Designs’ board of directors will determine, in its sole discretion and in accordance with applicable law, the timing of, the amount of, and the record dates for all distributions to be made to shareholders. The board of directors is evaluating all alternatives, but currently intends to implement a liquidation plan under which Sigma Designs would cease conducting normal business operations, except as may be required to wind up its business affairs.\nSigma Designs’ board of directors may declare one or more additional cash distributions to its shareholders. However, the board of directors has not established a firm timetable for distributions to shareholders or for the amount of any distributions. No assurances can be made as to the ultimate amounts to be distributed or the timing of any distributions. The board of directors expects, subject to uncertainties inherent in the winding up of its business, to make an initial distribution following the initiation of a liquidation plan and a final liquidating distribution as promptly as practicable after payment of, or provision for, outstanding claims. Liquidating distributions also could be delayed if the board of directors determines that it is in Sigma Designs’ best interests and the best interests of its shareholders to effectuate the liquidation plan in an alternative manner.\nAdditional Information and Where to Find It\nSigma Designs intends to file a proxy statement in connection with the Acquisition. Investors and security holders of Sigma Designs are urged to read such proxy statement(s) (including any amendments or supplements thereto) and any other relevant documents in connection with the Acquisition that Sigma Designs will file with the SEC upon such documents becoming available because they will contain important information about Sigma Designs and the Acquisition. Such materials filed by Sigma Designs with the SEC may be obtained free of charge at the SEC’s website ( http://www.sec.gov ) or at the Investor Relations page on Sigma Designs’ website at www.sigmadesigns.com or by writing to Sigma Designs’ Secretary at 47467 Fremont Blvd. Fremont, CA 94538 USA.\nSigma Designs and its directors and executive officers may be deemed to be participants in the solicitation of proxies from Sigma Designs’ stockholders with respect to the Acquisition. Additional information about Sigma Designs’ directors and executive officers is set forth in Sigma Designs’ proxy statement on Schedule 14A filed with the SEC on July 17, 2017 and Annual Report on Forms 10-K and 10-K/A for the fiscal year ended January 28, 2017. Information regarding their direct or indirect interests in the Acquisition will be set forth in the proxy statement and other materials to be filed with SEC.\nNote to editors: Sigma Designs and Z-Wave are trademarks of Sigma Designs, Inc. All other product names noted herein may be trademarks of their respective holders.\nConnect with Sigma Designs\nSigma Designs CFO, SVP and Corporate Secretary: Elias Nader, +1-510-897-0077, IR@sigmadesigns.com\nSigma Designs Investor Relations: Jim Fanucchi, Darrow Associates, Inc., +1-408-404-5400, IR@sigmadesigns.com\nSource:Sigma Designs, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=MYyQ5NfKIJfM39eHE_a2qC8-zx9CAjg6WzHMuic3fgHV7dBJo668XeIEWAlY9K-tOqLL9ehWV6n3HqQHJStILSt4lmAi6hg93KGMKj_sRVw=", "https://www.globenewswire.com/Tracker?data=XYvp1pDJhSIUvVnZvXDNJXC47k6TubYzTdq_U0-6nnGOdaqU5kDc2kitCw76iRMhgngupc4UUuWB7BFCbV5MW4g9EuTWgoUm_FqJkaOzZH4=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/e7868b07-f1a4-454b-a195-9bbb8b160a38", "https://www.globenewswire.com/Tracker?data=v3NN1hZ_2H8uubKZm1sSAKHPnLacaR1zdP0rFCwC9u0jcJbobT1igqzz8m-rU9ItOu_u2u07t3BY5A1waY-UbA==", "https://www.globenewswire.com/Tracker?data=MYyQ5NfKIJfM39eHE_a2qIdpyCP6Jcz9GSleaiSLFqpRvQdOmHlG0rO70UZW5sL2_gkDQKYIfjq3j-CrUffedqGJ150ViMipeL4WABrouOQ=", "https://www.globenewswire.com/Tracker?data=IZZuDsRhetYVdKQ3iRn_Eg2ZbPWkAodGOckVD1in8Zcs_2aGX2Pu6DmFhvCO921qUjVu_j_5qlYxJ0tguIgbSnTHeCSg5dJAeywKromuyAo=", "https://www.globenewswire.com/Tracker?data=XYvp1pDJhSIUvVnZvXDNJQre6TGAWM3hLnOnZOUOMsG9tcJ4Fvcx-gdqZNGhOw4aqFhZCdUak9fenil-HMAtfeKaJ-zQIi_8i0BwcoqpDWw=", "https://www.globenewswire.com/Tracker?data=v3NN1hZ_2H8uubKZm1sSAIT1hu3AowkM5VqkVApAy_-XKvqDF7rAsoCllA-VZLOzAbJ4LryX8cZiRGMFbyvV6Q=="], "published": "2018-01-24T00:15:00.000+02:00", "crawled": "2018-01-24T01:21:51.024+02:00", "highlightTitle": ""}