{"organizations": [], "uuid": "8dcac7f45ea384729d2e4f0ca9a1115e039c1c7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180128.html", "section_title": "Archive News &amp; Video for Sunday, 28 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-mired-near-3-yr-low-on-us-policy-doubts-receding-yield-advantage-idUSL4N1PO059", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar mired near 3-yr low on US policy doubts, receding yield advantage", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.02, "site_type": "news", "published": "2018-01-29T09:07:00.000+02:00", "replies_count": 0, "uuid": "8dcac7f45ea384729d2e4f0ca9a1115e039c1c7e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-mired-near-3-yr-low-on-us-policy-doubts-receding-yield-advantage-idUSL4N1PO059", "ord_in_thread": 0, "title": "FOREX-Dollar mired near 3-yr low on US policy doubts, receding yield advantage", "locations": [], "entities": {"persons": [{"name": "mnuchin", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}, {"name": "ideyuki sano", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar index near 3-year low as Mnuchin comments vibrate\n* Dollar also losing investment edge\nBy Hideyuki Sano\nTOKYO, Jan 29 (Reuters) - The dollar wobbled near three-year lows against a basket of major currencies on Monday, struggling to pull ahead from six straight weeks of losses amid its evaporating yield advantage and doubts about Washington’s commitment to a strong currency.\nThe dollar’s index against a basket of six major currencies stood at 89.059, having fallen to as low as 88.429, a three-year nadir on Thursday.\nU.S. Treasury Secretary Steven Mnuchin gave U.S. currency bears a major boost last week with a tacit endorsement of a weak dollar. While President Donald Trump tried to row back from those comments, the damage had already been done and the dollar’s downturn since November showed little sign of abating.\nThe greenback is also losing its relative yield attraction for investors. Short-term interest rates are expected to rise in other countries as the European Central Bank and many others start to scale back their easy monetary policy.\nU.S. equities have one of the most expensive valuation in the world, prompting investors to look for better bargains elsewhere.\nAgainst the yen, the dollar fetched 108.72 yen, its lowest levels since mid-September, extending its fall so far this month to over three percent.\nComments from Bank of Japan Governor Haruhiko Kuroda in Davos that the central bank is finally close to the inflation target sparked expectation of an exit from its massive stimulus.\nThe yen pared back some of its gain after a BOJ spokesman said Kuroda was merely repeating the central bank’s official view.\nYet, it showed how sensitive the market is to any slightest hint that the BOJ is on the cusp of unwinding its stimulus.\n“Many foreign players are now betting on a BOJ policy change. The dollar/yen has no major support if it falls below its September low of 107.32. A break of that level probably means a shift to new trading range,” said Yukio Ishizuki, senior strategist at Daiwa Securities.\nThe euro traded at $1.2428, not far from its three- year peak of $1.2538 touched on Thursday, and maintaining its upward momentum after last week’s gain of 1.7 percent, its sixth consecutive week of rise.\nStill, its failure over the past couple of days to stay above $1.25 is seen by some traders as a sign of fatigue.\nData from U.S. financial watchdog Commodity Futures Trading Commission showed speculators’ net long position in the euro/dollar futures traded in Chicago rose to a record high, suggesting that profit-taking could be on the cards.\nThe Australian dollar held firm at $0.8109 after hitting a 20-month peak of $0.8136 on Friday.\nThe Chinese yuan gained 0.2 percent early on Monday in offshore trade to 6.3157 yuan per dollar, near Thursday’s 6.2968, which was its strongest since August 2015, when Beijing effectively devalued the yuan suddenly. (Editing by Shri Navaratnam)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-29T09:07:00.000+02:00", "crawled": "2018-01-29T21:57:27.000+02:00", "highlightTitle": ""}