{"organizations": [], "uuid": "89b3e49c0527c12e3a38112d3cfd6bc28400e3f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets/us", "section_title": "US Stock Market News - Dow Jones, Nasdaq, S&amp;P 500 | Reuters.com", "url": "https://www.reuters.com/article/fiat-chrysler-corruption-labor/update-1-uaw-leader-says-payments-to-union-official-did-not-affect-talks-idUSL2N1PL1UP", "country": "US", "domain_rank": 408, "title": "UPDATE 1-UAW leader says payments to union official did not affect talks", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T06:07:00.000+02:00", "replies_count": 0, "uuid": "89b3e49c0527c12e3a38112d3cfd6bc28400e3f3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/fiat-chrysler-corruption-labor/update-1-uaw-leader-says-payments-to-union-official-did-not-affect-talks-idUSL2N1PL1UP", "ord_in_thread": 0, "title": "UPDATE 1-UAW leader says payments to union official did not affect talks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds background on case, UAW president comments)\nBy Nick Carey\nDETROIT, Jan 26 (Reuters) - United Auto Workers President Dennis Williams on Friday denied a claim that payments by a Fiat Chrysler Automobiles NV (FCA) executive to a union official had compromised contract talks or impacted union funds.\nIn a letter to members seen by Reuters, Williams said “there is simply no truth to the claim that this misconduct compromised the negotiation of our collective bargaining agreement or had any impact on union funds.”\nEarlier this week, former FCA executive Alphons Iacobelli pleaded guilty to federal charges that he made at least $1.5 million in improper payments to United Auto Workers union officials.\nAccording to a plea agreement made public late on Monday, Iacobelli, 58, agreed to cooperate in the ongoing investigation by the Justice Department into alleged misspending at UAW union training centers funded by U.S. automakers.\nMonica Morgan, wife of former UAW vice president General Holiefield who died in March 2015, is also expected to plead guilty, Reuters reported last week, citing a person briefed on the matter. She faces a plea hearing on Feb. 6.\nAccording to the plea agreement, Iacobelli admitted to transferring hundreds of thousands of dollars in prohibited payments to charities controlled by UAW officials. The agreement said he authorized paying off Morgan and Holiefield’s $262,000 mortgage.\nThe agreement states that Iacobelli used FCA funds to pay out more than $1.5 million in cash and items of value to UAW officials and employees to obtain concessions for FCA in negotiating and implementing collective bargaining agreements between the automaker and the union, and to influence union decisions on pension funds.\nThe plea deal also states that he authorized secret payments of $50,000 each to select UAW officials. “While Mr. Iacobelli will have to answer for his criminal conduct, it appears that in an attempt to get lenient treatment from the government he is now falsely spinning his crimes as an effort to corrupt the collective bargaining process between the UAW and Fiat Chrysler,” Williams said in his letter.\nAn attorney for Iacobelli and the U.S. attorney’s office in Detroit did not immediately respond to a request for comment on Friday.\nFiat Chrysler Chief Executive Sergio Marchionne has said the “deplorable” conduct did not impact collective bargaining talks and the “egregious acts were neither known to nor sanctioned by (Fiat Chrysler).” (Reporting By Nick Carey; Editing by Chris Reese and Bill Rigby)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-27T06:07:00.000+02:00", "crawled": "2018-01-27T00:13:33.008+02:00", "highlightTitle": ""}