{"organizations": [], "uuid": "2e0d103cf457737340db916f8f6151f758304459", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/OG-BC482_GOLDRU_SOC_20180127144835.png", "site_section": "https://www.wsj.com/europe", "section_title": "The Wall Street Journal &amp; Breaking News, Business, Financial and Economic News, World News and Video", "url": "https://www.wsj.com/articles/gold-rally-picks-up-steam-as-dollar-falters-1517054401", "country": "US", "domain_rank": 387, "title": "Gold Rally Picks Up Steam as Dollar Falters", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T15:00:00.000+02:00", "replies_count": 0, "uuid": "2e0d103cf457737340db916f8f6151f758304459"}, "author": "Amrith Ramkumar", "url": "https://www.wsj.com/articles/gold-rally-picks-up-steam-as-dollar-falters-1517054401", "ord_in_thread": 0, "title": "Gold Rally Picks Up Steam as Dollar Falters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "4 COMMENTS The dollar’s slide is pushing investors back into gold, sending prices of the precious metal to their highest level since August 2016 in the past week.\nFront-month gold has risen 9.1% from its December lows to $1,351.60 a troy ounce, with investors betting that the dollar will fall as global growth picks up and major central banks around the world shift away from their ultra-easy monetary policies. A weaker dollar makes gold and other dollar-denominated commodities cheaper for overseas buyers.\nThe precious metal got a lift after the dollar fell sharply Wednesday on U.S. Treasury Secretary Steven Mnuchin’s comments at the World Economic Forum in Davos, Switzerland, saying that a weaker dollar is good for trade . The WSJ Dollar Index, which tracks the U.S. currency against a basket of 16 others, fell to its lowest level in roughly three years.\nGold prices fell slightly off their 17-month highs later in the week after President Donald Trump appeared to contradict the Treasury Secretary, saying the U.S. currency would get “stronger.”\nStill, concerns about friction resulting from the Trump administration’s “America First” trade policy have weighed on the dollar and supported gold, an asset that some investors favor when they think markets might turn rocky. Earlier this week, the U.S. slapped steep tariffs on washing machines and solar panels, aimed largely at Chinese and other Asian manufacturers.\n“The focus right now is on the weaker dollar story, and the fear is there will be a bad [North American Free Trade Agreement] story or a bad trade story in general,” said John Velis, vice president of global macro strategy at State Street Global Markets. If there is retaliation from China or a breakdown in Nafta negotiations, “at some point equities are going to look at this fundamentally and say this is not good,” he added.\nMr. Velis said his firm doesn’t have a formal view on gold but said the dollar’s weakness means gold is looking better.\nOther possible geopolitical tensions helped drive gold last year to its best year since 2010, including the heightened rhetoric between the U.S. and North Korea and protests in Iran.\nMore than $8 billion flowed into gold-backed exchange-traded funds in 2017, according to data compiled by the World Gold Council. When coupled with the 14% rise in gold prices, that influx brought the total assets managed by those ETFs to their highest level since September 2016.\nMeantime, hedge funds and other speculative investors increased net bets on higher gold prices in five straight weeks through the week ended Jan. 16, according to the Commodity Futures Trading Commission. Net bullish bets are near their 2017 highs from September.\nInvestors seeking protection against an unexpected pickup in consumer prices have also recently favored gold, which is commonly used as an inflation hedge.\nA measure of the bond market’s expectation for inflation has climbed. The 10-year inflation break-even rate, which reflects the yield premium on the benchmark 10-year U.S. Treasury note over the comparable Treasury inflation-protected security, recently hit its highest level in more than three years, according to Thomson Reuters data.\nHowever, a pickup in inflation could actually threaten the recent gold rally, depending on how it affects central-bank policy and the dollar.\nGold typically struggles to compete with yield-bearing assets like Treasurys as borrowing costs rise, so some analysts question whether the precious metal could hang on to its gains if the Federal Reserve raises interest rates more than investors currently anticipate. The central bank is currently projecting three increases this year, but roughly 40% of traders tracked by CME Group expect fewer than that in 2018, meaning a more aggressive Fed could surprise some money managers.\n“We think gold will increasingly run into headwinds from higher rates,” said James Steel, chief precious metals analyst at HSBC, noting that the precious metal has tended to decline ahead of anticipated interest-rate increases.\nA rebound in the dollar or a bearish signal from central banks could end the rally early for gold bugs. For now, however, some are eyeing a $1,400 gold price—a level not seen since 2013.\n“It’s all systems go,” said Ira Epstein, a strategist at Linn & Associates, who recently recommended to clients buying gold and taking short positions in the dollar. He said he recommended closing out those short dollar positions Wednesday ahead of the European Central Bank’s policy statement Thursday and a speech from Mr. Trump in Davos on Friday.\nWrite to Amrith Ramkumar at amrith.ramkumar@wsj.com", "external_links": [], "published": "2018-01-27T15:00:00.000+02:00", "crawled": "2018-01-28T01:15:34.016+02:00", "highlightTitle": ""}