{"organizations": [], "uuid": "a6e612a89d034329d3ce6ad5e8ca1ccb43cae1ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221283023&w=1200&r=LYNXMPEE0B00C", "site_section": "http://feeds.reuters.com/reuters/UKdomesticNews", "section_title": "Reuters: UK", "url": "https://uk.reuters.com/article/us-britain-royals-queen/horrible-carriage-unwieldy-crowns-queen-elizabeths-candid-views-of-coronation-and-royal-jewels-idUKKBN1F1005", "country": "US", "domain_rank": 408, "title": "Horrible carriage, unwieldy crowns: Queen Elizabeth's candid views of coronation and royal jewels", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T02:13:00.000+02:00", "replies_count": 0, "uuid": "a6e612a89d034329d3ce6ad5e8ca1ccb43cae1ba"}, "author": "", "url": "https://uk.reuters.com/article/us-britain-royals-queen/horrible-carriage-unwieldy-crowns-queen-elizabeths-candid-views-of-coronation-and-royal-jewels-idUKKBN1F1005", "ord_in_thread": 0, "title": "Horrible carriage, unwieldy crowns: Queen Elizabeth's candid views of coronation and royal jewels", "locations": [], "entities": {"persons": [{"name": "elizabeth", "sentiment": "negative"}, {"name": "eliza", "sentiment": "negative"}, {"name": "michael holden", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "buckingham palace", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "royal gallery", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "westminster abbey", "sentiment": "none"}, {"name": "state opening of parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 12:08 AM / Updated 16 hours ago Horrible carriage, unwieldy crowns: Queen Elizabeth's candid views of coronation and royal jewels Michael Holden 4   Speaking for the first time about her coronation 65 years ago, Britain’s Queen Elizabeth has revealed how uncomfortable riding in her golden carriage to the ceremony was and how wearing the Imperial State Crown risked “breaking your neck”. FILE PHOTO: Britain's Queen Elizabeth walks through the Royal Gallery in the Palace of Westminster during the State Opening of Parliament in London, Britain, May 25, 2010. REUTERS/Luke MacGregor/File Photo \nElizabeth, Britain’s longest-reigning monarch, was crowned queen on June 2, 1953 at London’s Westminster Abbey, in a ancient, grand service whose origins date back 1,000 years. \nIn a very rare, personal account for a BBC documentary to be aired on Sunday, she speaks candidly about the occasion and some of the Crown Jewels which play a symbolic role in the ceremony. \n“Horrible,” she said of the ride in the four-tonne carriage from Buckingham Palace to the abbey where English monarchs have been crowned since 1066. “It’s only sprung on leather, not very comfortable.” \nElizabeth, now 91, was just 25 when she became queen on the death of her father George VI in 1952, with the coronation taking place the following year. \n“It’s the sort of I suppose the beginning of one’s life really as a sovereign,” she said. “It is sort of a pageant of chivalry and old-fashioned way of doing things really. I’ve seen one coronation (her father’s in 1937) and been the recipient in the other, which is pretty remarkable.” \nGiving her personal recollection, the queen also reveals how she had struggled with her coronation dress, which was embroidered in silk with pearls, and gold and silver thread. \n“I remember one moment when I was going against the pile of the carpet and I couldn’t move at all,” she said. \nThe documentary also features informal footage taken behind the scenes, including images of son and heir Prince Charles, then aged four, and his younger sister Anne playing underneath the queen’s long robe. \n“Not what they’re meant to do,” the queen quips. \n“DISADVANTAGES TO CROWNS” Britain's Queen Elizabeth waits before delivering her speech in the House of Lords, during the State Opening of Parliament at the Palace of Westminster in London May 8, 2013. REUTERS/Toby Melville \nCharles has previously revealed how his mother had practiced wearing the 2.2 kg (4.9 lb) St Edward’s Crown while he was being bathed. \nElizabeth wore two crowns for the occasion: the St Edward’s Crown, which she has never worn since, and the diamond-encrusted Imperial State Crown which she wears at formal occasions such as the opening of parliament when she delivers a speech outlining the government’s legislative plans. \n“You can’t look down to read the speech, you have to take the speech up. Because if you did, your neck would break and it (the crown) would fall off,” she said smiling. “So there are some disadvantages to crowns but otherwise they’re quite important things.” FILE PHOTO: Britain's Queen Elizabeth before the State Opening of Parliament in the House of Lords in London, Britain, May 27, 2015. REUTERS/Suzanne Plunkett/File Photo \nThe documentary shows her peering inquisitively and then grinning as she taps at pearls hanging on the 1 kg (2.3 lb) crown, two of which are said to have been bought by her Tudor namesake Queen Elizabeth I. \n“They were meant to be Queen Elizabeth’s earrings,” she said. “They don’t look very happy now. Most pearls like to be living creatures so they’ve just been hanging out here for years which is rather sad.” \nElizabeth has never given a formal interview during her long reign and Coronation expert Alastair Bruce, whom the queen spoke to for the program, said their 1-1/2-hour interaction had been a “conversation”. \n“You don’t ask the queen a direct question, so you pose a comment that the queen then responds to,” he told reporters. \nHe said he had the impression the queen was probably not fond of the heavy crown and was “very practical” in her treatment of the crown jewels. \nHe cited how during their conversation the crown had been slightly out of the queen’s reach so he asked the crown jeweler to help move the table it was on a bit closer. \nInstead, the queen herself pulls the table towards her. \nBruce said: “If you look very closely, the table suddenly just goes ‘woomf’ and the crown ‘woomf’ and the crown jeweler is left there with nothing and she says ‘well you know, it’s my crown.'” Editing by Stephen Addison", "external_links": [], "published": "2018-01-12T02:13:00.000+02:00", "crawled": "2018-01-12T02:45:55.037+02:00", "highlightTitle": ""}