{"organizations": [], "uuid": "652a72304c0493f1a8d2b3343943bb757239f637", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 15, "shares": 15, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-mexico-corruption-exclusive/exclusive-mexicos-attorney-general-vows-to-crack-down-on-money-laundering-idUSKBN1EU06Y", "country": "US", "domain_rank": 408, "title": "Exclusive: Mexico's attorney general vows to crack down on money laundering", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T04:06:00.000+02:00", "replies_count": 0, "uuid": "652a72304c0493f1a8d2b3343943bb757239f637"}, "author": "", "url": "https://www.reuters.com/article/us-mexico-corruption-exclusive/exclusive-mexicos-attorney-general-vows-to-crack-down-on-money-laundering-idUSKBN1EU06Y", "ord_in_thread": 0, "title": "Exclusive: Mexico's attorney general vows to crack down on money laundering", "locations": [], "entities": {"persons": [{"name": "alberto elias beltran", "sentiment": "none"}, {"name": "michael o'boyle", "sentiment": "none"}, {"name": "elias", "sentiment": "none"}], "locations": [{"name": "mexico", "sentiment": "none"}, {"name": "colombia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "financial action task force", "sentiment": "none"}, {"name": "min read  mexico city", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "fatf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 2:07 AM / Updated 3 hours ago Exclusive: Mexico's attorney general vows to crack down on money laundering Michael O'Boyle 4 Min Read \nMEXICO CITY (Reuters) - Mexico’s acting attorney general said on Thursday prosecutors were already working to improve investigations and cooperation with other countries following an international report that blasted the country for failing to punish money launderers. \nAlberto Elias Beltran, Mexico’s acting attorney general, told Reuters in an interview that the country was seeking to work better with the United States and Colombia to target financial networks of multinational drug gangs. \nEarlier this week, the Financial Action Task Force (FATF), an international organization based in Paris that sets global standards for fighting illicit finance, criticized Mexico for not systematically prosecuting money launderers. \n“There are important findings of opportunities for improvement at the attorney general’s office,” Elias said, noting in particular the room to improve the quality of money laundering investigations and the seizure of assets. \nThe FATF report highlighted that Mexico has been slipping in successful convictions. The country already lagged regional peers such as Colombia and Brazil, both of which have made strides in setting up independent prosecutors. \nThe report also noted the “low level of effectiveness” in prosecutions and seizures and an “extremely low level of effectiveness” in punishing corruption. \n“We are working with the specialized offices (that target money laundering) where we are strengthening protocols,” Elias said, adding that government agencies were also working to implement so-called parallel investigations. \nThe FATF report underscored that Mexico was largely failing to carry out parallel money laundering investigations to match probes of organized crime, drug trafficking and corruption. \nThe FATF recommends such parallel investigations, and its report on Mexico underscored haphazard, uneven results of current investigations, noting low conviction rates and tiny seizures of assets compared with the amount of illicit proceeds that are generated in Mexico. \nElias noted that the FATF report recognized Mexico had improved its legal framework to tackle laundering and credited the country for the recent the emphasis on improving investigations. \nElias pointed to last year’s extradition of Joaquin “El Chapo” Guzman, Mexico’s most notorious kingpin, to the United States as a success. He said Mexico was continuing to work with the United States in order to identify Guzman’s assets north and south of the border. \nHe also noted that during the last two months Mexico, Colombia and the United States have been working on developing a new computerized method to share information. \n“This will allow us to be much more efficient in investigations and also in the detection of assets, which for us is fundamental to fight the financial structures of all criminal organizations,” Elias said. \nMexico and the United States have been quietly increasing cooperation to fight heroin trafficking since last year. High-level U.S. state department officials have told Reuters that the United States has offered to help fund Mexico’s efforts to eradicate opium poppies. \nHowever, Elias said U.S. aid to Mexico to fight drug trafficking and improve its legal system was small compared with the spending by Mexico. \n“Mexico has indicated that it has sufficient resources to be able to combat these criminal phenomena in a frontal manner,” he said. Editing by Lisa Shumaker", "external_links": [], "published": "2018-01-05T04:06:00.000+02:00", "crawled": "2018-01-05T04:16:59.007+02:00", "highlightTitle": ""}