{"organizations": [], "uuid": "3637dfdc3dccfb1687ab3dc7b1b43b5682b8e012", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220311920&w=1200&r=LYNXMPEE0714M", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-china-france/no-quick-deal-seen-between-airbus-and-china-on-a380-idUSKBN1EX1U0", "country": "US", "domain_rank": 408, "title": "No quick deal seen between Airbus and China on A380", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T18:49:00.000+02:00", "replies_count": 0, "uuid": "3637dfdc3dccfb1687ab3dc7b1b43b5682b8e012"}, "author": "", "url": "https://www.reuters.com/article/us-china-france/no-quick-deal-seen-between-airbus-and-china-on-a380-idUSKBN1EX1U0", "ord_in_thread": 0, "title": "No quick deal seen between Airbus and China on A380", "locations": [], "entities": {"persons": [{"name": "emmanuel macron", "sentiment": "none"}, {"name": "fabrice bregier", "sentiment": "none"}, {"name": "emira", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "toulouse", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}], "organizations": [{"name": "airbus", "sentiment": "negative"}, {"name": "financial times", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bombardier", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 4:50 PM / Updated 21 minutes ago Airbus to boost China output as nears jet deal during Macron trip Tim Hepher 4 Min Read \nPARIS (Reuters) - Airbus ( AIR.PA ) is set to boost production of narrowbody jets in China as it nears a new multi-billion-dollar deal to supply the world’s fastest-growing aviation market during a visit by French President Emmanuel Macron, industry sources said. \nThe deal is expected to be unveiled together with a package of agreements coinciding with the French leader’s visit, and could include orders for around 100 jetliners, they added. \nThe final number of jets to be sold has not been determined. China is also said to be shopping for larger jets like the A330. \nAirbus declined comment on Monday. \nAirbus and its U.S. rival Boeing ( BA.N ) compete for large-scale orders in China and such package deals are typically rolled out during major diplomatic events, but not without last-minute negotiations on the quantity and price of jets. \nBoeing announced a deal for 300 aircraft during a visit to China by President Donald Trump in November. \nAbout one in every four planes that Airbus produces is delivered to China, but fewer than 8 percent are assembled at its Tianjin facility outside Beijing - one of four A320 assembly plants including two in Europe and one in the United States. \nAirbus is likely as part of any new airplane order to agree to lift the number of aircraft assembled in Tianjin from the current level of around 50 a year, the sources said. NO A380 DEAL \nThe European planemaker is not, however, expected to announce a breakthrough in Chinese support for the 544-seat A380 superjumbo, whose future is threatened by poor sales. \nThe Financial Times reported earlier that Airbus was offering an industrial partnership on the world’s largest airliner as part of Macron’s visit to China. \nMacron is accompanied by industry leaders, including Airbus planemaking president Fabrice Bregier, on his visit. \nIndustry sources said that Airbus has studied the possibility of selling China a stake in the A380 superjumbo program, but no immediate deal is on the table. \nThe idea, which has been on the back-burner in Toulouse for some time, would resemble Airbus’s decision to take a stake in the Bombardier ( BBDb.TO ) CSeries, but so far there has been little traction and no deal is imminent, one source said. \n“It’s not tomorrow,” another source added, while others stress the A380’s fate hinges instead on ongoing talks to sell 36 of the jets to Dubai’s Emirates. \nAn Airbus spokesman said, “We don’t comment on speculation”. \nAirbus believes that if the A380’s future can be secured into the next decade, then China is likely to come into the picture because of its frenetic demand growth. \nAirbus sees untapped demand for 100 Airbus A380s in China, while Boeing argues that traffic is better served by smaller jets. \nThe U.S. firm is meanwhile expected to confirm its position as the world’s largest planemaker when it announces 2017 deliveries on Tuesday. It has targeted 760-765 deliveries. \nDespite a record December that saw Airbus hand over more than 700 jets for the first time last year, the first delivery of its newest model - the A350-1000 - slipped into 2018 and should happen “early this year,” a spokeswoman said. Reporting by Tim Hepher; Editing by Mathieu Rosemain and Alexander Smith", "external_links": [], "published": "2018-01-08T18:49:00.000+02:00", "crawled": "2018-01-08T19:01:50.032+02:00", "highlightTitle": ""}