{"organizations": [], "uuid": "b9513c4353da0876ae9e8ffadbfb0081e60dfd8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-bancfirst-corporation-reports-fourth-quarter-earnings.html", "country": "US", "domain_rank": 767, "title": "BancFirst Corporation Reports Fourth Quarter Earnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-19T00:20:00.000+02:00", "replies_count": 0, "uuid": "b9513c4353da0876ae9e8ffadbfb0081e60dfd8a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-bancfirst-corporation-reports-fourth-quarter-earnings.html", "ord_in_thread": 0, "title": "BancFirst Corporation Reports Fourth Quarter Earnings", "locations": [], "entities": {"persons": [], "locations": [{"name": "oklahoma city", "sentiment": "none"}], "organizations": [{"name": "bancfirst corporation reports fourth quarter earnings", "sentiment": "negative"}, {"name": "bancfirst corporation", "sentiment": "negative"}, {"name": "bancfirst", "sentiment": "none"}, {"name": "council oak investment corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OKLAHOMA CITY, BancFirst Corporation (NASDAQ GS:BANF) reported net income of $19.5 million, or $0.59 diluted earnings per share, for the fourth quarter of 2017 compared to net income of $18.6 million, or $0.58 diluted earnings per share, for the fourth quarter of 2016. Due to the signing of the Tax Cuts and Jobs Act, a write down on deferred tax assets of $4.3 million decreased earnings per share by approximately 14 cents. Net income for the fourth quarter also included a gain of $2.3 million, net of income tax and fees, from the sale of an investment by Council Oak Investment Corporation, a wholly-owned subsidiary of BancFirst, which added approximately 7 cents per share. Net income for the year ended December 31, 2017 was $86.4 million, or $2.65 per share, compared to $70.7 million, or $2.22 per share, for 2016. Net income for the year ended December 31, 2017 also included the effects of favorable resolutions of three problem loans which resulted in principal recovery of $894,000 and unaccrued interest income of $2.7 million. Net income for the year ended December 31, 2016 included a gain on the sale of other real estate owned totaling $1.2 million.\nThe Company's net interest income for the fourth quarter of 2017 increased to $58.7 million compared to $51.6 million for the fourth quarter of 2016. The net interest margin for the quarter was 3.48% compared to 3.19% a year ago. Internal loan growth and the increase in the Fed Fund rate of 75 basis points during 2017 contributed to the higher net interest income and margin in 2017. The provision for loan losses for the fourth quarter of 2017 increased to $3.3 million compared to $1.7 million a year ago. The provision for loan losses for the fourth quarter of 2017 was primarily driven by downgrades of commercial loans, which resulted in approximately $2.8 million in provision, and by loan growth, which resulted in approximately $550,000 in provision. Net charge-offs increased slightly to 0.06% of average loans for the fourth quarter of 2017 compared to 0.02% for the fourth quarter of 2016, primarily due to one commercial loan. Noninterest income for the quarter totaled $32.8 million, compared to $27.4 million last year. The increase in noninterest income was primarily due to the investment gain described above. Noninterest expense for the quarter totaled $51.3 million compared to $48.2 million last year. The increase in noninterest expense was primarily due to salary increases in 2017 and compensation expense related to the sale of the Council Oak investment. The Company's effective tax rate was 47.2% compared to 36.1% for the fourth quarter of 2016. The increase in 2017 was due to the write down on deferred tax assets due to the signing of the Tax Cuts and Jobs Act.\nFor the year ended 2017, the Company's net interest income was $227.1 million compared to $203.8 million for 2016. The net interest margin for the year increased to 3.44% compared to 3.25% for the previous year. Internal loan growth and the increase in the Fed Fund rate of 75 basis points during 2017 contributed to the higher net interest income and margin in 2017. The provision for loan losses for 2017 was $8.5 million compared to $11.5 million a year ago. The Company reported slightly higher net charge-offs to average loans of 0.12% for 2017 compared to 0.10% for 2016. Noninterest income for 2017 totaled $118.1 million compared to $107.0 million for 2016. Noninterest expense was $200.4 million compared to $191.4 million for 2016. The Company's effective tax rate was 36.6% compared to 34.5% for 2016.\nAt December 31, 2017, the Company's total assets were $7.3 billion, $234.2 million above the December 31, 2016 total. Loans totaled $4.7 billion, an increase of $69.6 million over September 30, 2017, and an increase of $318.6 million over December 31, 2016. Deposits were $6.4 billion at December 31, 2017, up $113.0 million from last quarter, and $167.0 million above the December 31, 2016 total. The Company's total stockholders' equity was $775.6 million, an increase of $64.5 million over December 31, 2016.\nAsset quality remained strong during the fourth quarter of 2017. Nonperforming and restructured assets were 0.61% of total assets at December 31, 2017 compared to 0.53% at September 30, 2017, and 0.56% at December 31, 2016. The allowance for loan losses to total loans was 1.09% at December 31, 2017, 1.10% at September 30, 2017, and 1.10% at December 31, 2016. The allowance to nonperforming and restructured loans was 130.6% compared to 153.5% at September 30, 2017, and 137.3% at year-end 2016.\nExecutive Chairman David Rainbolt commented, \"Based on our 2017 earnings, the reduction in the federal tax rate to 21% would have added approximately $14 million to net income. Going forward, we will be raising our minimum wage and increasing the budgeted contribution to our Employee Stock Ownership Plan.\"\nOn January 11, 2018, the Company completed the previously announced acquisitions of two Oklahoma banking corporations. First Wagoner Corporation and its subsidiary bank, First Bank & Trust Company and First Chandler Corp. and its subsidiary bank, First Bank of Chandler had combined total assets of approximately $373 million. The Company exchanged a combination of cash and stock for these transactions.\nBancFirst Corporation is an Oklahoma based financial services holding company. The Company's principal subsidiary bank, BancFirst, is Oklahoma's largest state-chartered bank with 109 banking locations serving 59 communities across Oklahoma. More information can be found at www.bancfirst.bank .\nThe Company may make forward-looking statements within the meaning of Section 27A of the securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934 with respect to earnings, credit quality, corporate objectives, interest rates and other financial and business matters. Forward-looking statements include estimates and give management's current expectations or forecasts of future events. The Company cautions readers that these forward-looking statements are subject to numerous assumptions, risks and uncertainties, including economic conditions, the performance of financial markets and interest rates; legislative and regulatory actions and reforms; competition; as well as other factors, all of which change over time. Actual results may differ materially from forward-looking statements.\nBancFirst Corporation\nSummary Financial Information\n(Dollars in thousands, except per share and share data - Unaudited)\n2017\n2017\n2017\n2017\n2016\n4th Qtr\n3rd Qtr\n2nd Qtr\n1st Qtr\n4th Qtr\nCondensed Income Statements:\nNet interest income\n$ 58,699\n$ 57,233\n$ 56,439\n$ 54,768\n$ 51,553\nProvision for loan losses\n3,323\n3,276\n1,841\n72\n1,672\nNon-interest income:\nTrust revenue\n3,073\n3,083\n2,894\n2,952\n2,878\nService charges on deposits\n16,693\n16,633\n16,448\n15,778\n16,005\nSecurities transactions\n4,412\n(22)\n(330)\n---\n52\nIncome from sales of loans\n741\n732\n816\n632\n705\nInsurance commissions\n3,917\n4,603\n3,728\n4,563\n3,797\nCash management\n2,798\n2,804\n2,799\n2,754\n2,713\nOther\n1,199\n1,336\n1,628\n1,406\n1,281\nTotal noninterest income\n32,833\n29,169\n27,983\n28,085\n27,431\nNon-interest expense:\nSalaries and employee benefits\n31,477\n31,471\n31,547\n30,654\n29,706\nOccupancy expense, net\n3,327\n3,298\n2,992\n2,974\n3,198\nDepreci", "external_links": ["http://www.prnewswire.com/news-releases/bancfirst-corporation-reports-fourth-quarter-earnings-300584806.html", "http://www.bancfirst.bank/"], "published": "2018-01-19T00:20:00.000+02:00", "crawled": "2018-01-19T00:34:27.012+02:00", "highlightTitle": ""}