{"organizations": [], "uuid": "a84fd21cf474f101390c97c4ddd2222075cab365", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-cathay-general-bancorp-announces-fourth-quarter-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "Cathay General Bancorp Announces Fourth Quarter and Full Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T00:30:00.000+02:00", "replies_count": 0, "uuid": "a84fd21cf474f101390c97c4ddd2222075cab365"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-cathay-general-bancorp-announces-fourth-quarter-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "Cathay General Bancorp Announces Fourth Quarter and Full Year 2017 Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 30, 2018 /PRNewswire/ -- Cathay General Bancorp (the \"Company\", \"we\", \"us\", or \"our\" NASDAQ: CATY), the holding company for Cathay Bank, today announced net income of $25.9 million, or $0.32 per share, for the fourth quarter of 2017, and net income of $176.0 million, or $2.17 per share, for the year ended December 31, 2017. Fourth quarter and full-year 2017 results included $22.3 million of additional tax expense related to the revaluation of the Company's deferred tax assets and a $2.6 million pretax write-down of low income housing tax credit investments, both as a result of the enactment of the Tax Cuts and Jobs Act. These two items had the effect of reducing diluted EPS by $.29 per diluted share for the quarter and for the year.\nFINANCIAL PERFORMANCE\nThree months ended\nYear ended December 31,\nDecember 31, 2017\nSeptember 30, 2017\nDecember 31, 2016\n2017\n2016\nNet income\n$25.9 million\n$49.7 million\n$48.0 million\n$176.0 million\n$175.1 million\nBasic earnings per common share\n$0.32\n$0.62\n$0.61\n$2.19\n$2.21\nDiluted earnings per common share\n$0.32\n$0.61\n$0.60\n$2.17\n$2.19\nReturn on average assets\n0.66%\n1.29%\n1.37%\n1.19%\n1.31%\nReturn on average total stockholders' equity\n5.18%\n9.77%\n10.52%\n9.10%\n9.88%\nEfficiency ratio\n46.27%\n41.91%\n45.39%\n44.40%\n49.79%\nFULL YEAR HIGHLIGHTS\nIncluding the acquisition of Far East National Bank, (FENB) total loans and deposits increased for the year by $1.7 billion to $12.9 billion and $1.0 billion to $12.7 billion, respectively. Net interest margin for 2017 increased to 3.63% compared to 3.38% in 2016.\n\"Cathay made significant progress in 2017, both from organic growth and from the acquisition of Far East National Bank. Including the acquisition, we grew our loans by $1.7 billion, or 14.9%, for the year and by $275 million or 8.7% annualized for the fourth quarter and our total deposits by $1.0 billion, or 8.7%, for the year ended 2017. Also, in November 2017, we increased our dividend by 14% to $.24 per share from the $.21 per share paid previously,\" commented Pin Tai, Chief Executive Officer and President of the Company.\nFurther, he added \"The systems conversion for Far East National Bank onto Cathay's systems is scheduled for April 2018, which will permit completion of the integration of our operations.\"\nFOURTH QUARTER INCOME STATEMENT REVIEW\nNet income for the quarter ended December 31, 2017, was $25.9 million, a decrease of $22.1 million, or 46.0%, compared to net income of $48.0 million for the same quarter a year ago. Fourth quarter results included $22.3 million of additional tax expense related to the revaluation of the Company's deferred tax assets and a $2.6 million pretax write-down of low income housing investments, both, as a result of the enactment of the Tax Cuts and Jobs Act. These two items had the effect of reducing diluted EPS by $.29 per diluted share for the quarter and for the year. Diluted earnings per share for the quarter ended December 31, 2017, was $0.32 compared to $0.60 for the same quarter a year ago.\nReturn on average stockholders' equity was 5.18% and return on average assets was 0.66% for the quarter ended December 31, 2017, compared to a return on average stockholders' equity of 10.52% and a return on average assets of 1.37% for the same quarter a year ago.\nNet interest income before provision for credit losses\nNet interest income before provision for credit losses increased $23.4 million, or 21.3%, to $133.3 million during the fourth quarter of 2017 compared to $109.9 million during the same quarter a year ago. The increase was due primarily to an increase in interest income from organic loan growth and loans from the acquisition of FENB and a decrease in interest expense from securities sold under agreements to repurchase.\nThe net interest margin was 3.65% for the fourth quarter of 2017 compared to 3.36% for the fourth quarter of 2016 and 3.75% for the third quarter of 2017. The decrease from the third quarter of 2017 was primarily the result of interest recoveries and prepayment penalties of $2.5 million recorded in the fourth quarter of 2017 compared to $5.6 million in the third quarter.\nFor the fourth quarter of 2017, the yield on average interest-earning assets was 4.27%, the cost of funds on average interest-bearing liabilities was 0.84%, and the cost of interest-bearing deposits was 0.73%. In comparison, for the fourth quarter of 2016, the yield on average interest-earning assets was 4.00%, the cost of funds on average interest-bearing liabilities was 0.86%, and the cost of average interest-bearing deposits was 0.69%. The increase in the yield on average interest earning assets was a result of higher interest rates. The net interest spread, defined as the difference between the yield on average interest-earning assets and the cost of funds on average interest-bearing liabilities, was 3.43% for the quarter ended December 31, 2017, compared to 3.14% for the same quarter a year ago.\nProvision/(reversal) for credit losses\nThere was no provision for credit losses recorded for the fourth quarter of 2017 or 2016. The provision/(reversal) for credit losses was based on a review of the appropriateness of the allowance for loan losses at December 31, 2017. The following table summarizes the charge-offs and recoveries for the periods indicated:\nThree months ended\nYear ended December 31,\nDecember 31, 2017\nSeptember 30, 2017\nDecember 31, 2016\n2017\n2016\n(In thousands)\nCharge-offs:\nCommercial loans\n$ 1,503\n$ 80\n$ 920\n$ 3,313\n$ 12,955\nReal estate loans (1)\n-\n305\n118\n860\n5,948\nTotal charge-offs\n1,503\n385\n1,038\n4,173\n18,903\nRecoveries:\nCommercial loans\n2,001\n575\n424\n3,402\n4,144\nConstruction loans\n86\n47\n46\n229\n7,917\nReal estate loans (1)\n1,160\n5,489\n1,592\n7,355\n2,495\nTotal recoveries\n3,247\n6,111\n2,062\n10,986\n14,556\nNet (recoveries)/charge-offs\n$ (1,744)\n$ (5,726)\n$ (1,024)\n$ (6,813)\n$ 4,347\n(1) Real estate loans include commercial mortgage loans, residential mortgage loans, and equity lines.\nNon-interest income\nNon-interest income, which includes revenues from depository service fees, letters of credit commissions, securities gains (losses), wire transfer fees, and other sources of fee income, was $10.2 million for the fourth quarter of 2017, an increase of $2.2 million, or 28.3%, compared to $8.0 million for the fourth quarter of 2016, primarily due to increases of $2.3 million in other operating income relating to venture capital investments, wealth management commissions and other fees.\nNon-interest expense\nNon-interest expense increased $12.9 million, or 24.1%, to $66.4 million in the fourth quarter of 2017 compared to $53.5 million in the same quarter a year ago. The increase in non-interest expense in the fourth quarter of 2017 was primarily due to a $5.8 million increase in amortization of investments in low income housing and alternative energy partnerships expenses, a $3.5 million increase in salaries and employee benefits expense, a $1.2 million increase in professional services expense, and offset by a $2.6 million decrease in other real estate owned expense when compared to the same quarter a year ago. The efficiency ratio was 46.3% in the fourth quarter of 2017 compared to 45.4% for the same quarter a year ago.\nIncome taxes\nThe effective tax rate for the fourth quarter of 2017 was 66.4% compared to 25.4% for the fourth quarter of 2016. On December 22, 2017, the Tax Cuts and Jobs Act, was enacted into law and as a result, during the fourth quarter of 2017, the Company recorded $22.3 million of additional income tax expense related to the revaluation of the Company's deferred tax assets. These adjustments are management's best estimate based on the information available as of this earnings release and are subject to change as final tax calculations are completed in conjunction with the filing of the Form 10-K.\nACQUISITION OF SINOPAC BANCORP\nUnder the terms of the Stock Purchase Agreement with Bank SinoPac Co. Ltd, the Company purchased all of the issued and outstanding share capital of SinoPac Bancorp for an aggregate purchase price of $351.6 million plus additional post closing payments based on the realization of certain assets of FENB. The Company issued 926,192 shares of common stock as consideration and the remainder of the consideration is payable in cash. SinoPac Bancorp was merged into Cathay General Bancorp on July 17, 2017 and subsequently, on October 27, 2017, FENB was merged into Cathay Bank. At the date of acquisition, the total value of assets purchased was $1.2 billion including total gross loans of $703.8 million, investments of $114.3 million, and core deposit intangibles of $6.1 million. The total value of deposits purchased was $813.9 million. The acquisition resulted in a gain of $5.6 million. The purchase accounting adjustments are preliminary and subject to finalization during the one-year measurement period from the date of the acquisition.\nBALANCE SHEET REVIEW\nGross loans, excluding loans held for sale, were $12.9 billion at December 31, 2017, an increase of $1.7 billion, or 14.9%, from $11.2 billion at December 31, 2016. The increase was primarily due to increases of $699.5 million, or 12.1%, in commercial mortgage loans, $618.0 million, or 25.3%, in residential mortgage loans, $213.1 million, or 9.5%, in commercial loans, and $130.7 million, or 23.8%, in real estate construction loans. The loan balances and composition at December 31, 2017, compared to September 30, 2017, and to December 31, 2016, are presented below:\nDecember 31, 2017\nSeptember 30, 2017\nDecember 31, 2016\n(In thousands)\nCommercial loans\n$ 2,461,266\n$ 2,419,891\n$ 2,248,187\nResidential mortgage loans\n3,062,050\n2,922,537\n2,444,048\nCommercial mortgage loans\n6,484,700\n6,377,047\n5,785,248\nEquity lines\n180,304\n181,751\n171,711\nReal estate construction loans\n678,805\n691,486\n548,088\nInstallment & other loans\n5,170\n4,722\n3,993\nGross loans\n$ 12,872,295\n$ 12,597,434\n$ 11,201,275\nAllowance for loan losses\n(123,279)\n(121,535)\n(118,966)\nUnamortized deferred loan fees\n(3,245)\n(3,424)\n(4,994)\nTotal loans, net\n$ 12,745,771\n$ 12,472,475\n$ 11,077,315\nLoans held for sale\n$ 8,000\n$ -\n$ 7,500\nTotal deposits were $12.7 billion at December 31, 2017, an increase of $1.0 billion, or 8.7%, from $11.7 billion at December 31, 2016. The deposit balances and composition at December 31, 2017, compared to September 30, 2017, and to December 31, 2016, are presented below:\nDecember 31, 2017\nSeptember 30, 2017\nDecember 31, 2016\n(In thousands)\nNon-interest-bearing demand deposits\n$ 2,783,127\n$ 2,730,006\n$ 2,478,107\nNOW deposits\n1,410,519\n1,379,100\n1,230,445\nMoney market deposits\n2,248,271\n2,370,724\n2,198,938\nSavings deposits\n857,199\n925,312\n719,949\nTime deposits\n5,390,777\n5,156,553\n5,047,287\nTotal deposits\n$ 12,689,893\n$ 12,561,695\n$ 11,674,726\nASSET QUALITY REVIEW\nAt December 31, 2017, total non-accrual loans were $48.8 million, a decrease of $16.6 million, or 25.3%, from $65.4 million at September 30, 2017, and a decrease of $895,000, or 1.8%, from $49.7 million at December 31, 2016.\nThe allowance for loan losses was $123.3 million and the allowance for off-balance sheet unfunded credit commitments was $4.6 million at December 31, 2017, which represented the amount believed by management to be appropriate to absorb credit losses inherent in the loan portfolio, including unfunded commitments. The $123.3 million allowance for loan losses at December 31, 2017, increased $4.3 million, or 3.6%, from $119.0 million at December 31, 2016. The allowance for loan losses represented 0.96% of period-end gross loans, excluding loans held for sale, and 252.7% of non-performing loans at December 31, 2017. The comparable ratios were 1.06% of period-end gross loans, excluding loans held for sale, and 239.5% of non-performing loans at December 31, 2016. The changes in non-performing assets and troubled debt restructurings at December 31, 2017, compared to December 31, 2016, and to September 30, 2017, are presented below:\n(Dollars in thousands)\nDecember 31, 2017\nDecember 31, 2016\n% Change\nSeptember 30, 2017\n% Change\nNon-performing assets\nAccruing loans past due 90 days or more\n$ -\n$ -\n-\n$ 3,900\n(100)\nNon-accrual loans:\nConstruction loans\n8,185\n5,458\n50\n14,267\n(43)\nCommercial mortgage loans\n19,820\n20,078\n(1)\n28,379\n(30)\nCommercial loans\n14,296\n15,710\n(9)\n15,942\n(10)\nResidential mortgage loans\n6,486\n8,436\n(23)\n6,763\n(4)\nTotal non-accrual loans:\n$ 48,787\n$ 49,682\n(2)\n$ 65,351\n(25)\nTotal non-performing loans\n48,787\n49,682\n(2)\n69,251\n(30)\nOther real estate owned\n9,442\n20,070\n(53)\n18,115\n(48)\nTotal non-performing assets\n$ 58,229\n$ 69,752\n(17)\n$ 87,366\n(33)\nAccruing troubled debt restructurings (TDRs)\n$ 68,565\n$ 65,393\n5\n$ 62,358\n10\nNon-accrual loans held for sale\n$ 8,000\n$ 7,500\n7\n$ -\n100\nAllowance for loan losses\n$ 123,279\n$ 118,966\n4\n$ 121,535\n1\nTotal gross loans outstanding, at period-end (1)\n$ 12,872,295\n$ 11,201,275\n15\n$ 12,597,434\n2\nAllowance for loan losses to non-performing loans, at period-end (2)\n252.69%\n239.45%\n175.50%\nAllowance for loan losses to gross loans, at period-end (1)\n0.96%\n1.06%\n0.96%\n(1) Excludes loans held for sale at period-end.\n(2) Excludes non-accrual loans held for sale at period-end.\nThe ratio of non-performing assets, excluding non-accrual loans held for sale, to total assets was 0.4% at December 31, 2017, compared to 0.5% at December 31, 2016. Total non-performing assets decreased $11.6 million, or 16.6%, to $58.2 million at December 31, 2017, compared to $69.8 million at December 31, 2016, primarily due to a decrease of $10.6 million, or 53.0%, in other real estate owned and a decrease of $895,000, or 1.8%, in non-accrual loans.\nCAPITAL ADEQUACY REVIEW\nAt December 31, 2017, the Company's common equity Tier 1 capital ratio of 12.14%, Tier 1 risk-based capital ratio of 12.14%, total risk-based capital ratio of 14.07%, and Tier 1 leverage capital ratio of 10.31%, calculated under the Basel III capital rules, continue to place the Company in the \"well capitalized\" category for regulatory purposes, which is defined as institutions with a common equity tier 1 capital ratio equal to or greater than 6.5%, a Tier 1 risk-based capital ratio equal to or greater than 8%, a total risk-based capital ratio equal to or greater than 10%, and a Tier 1 leverage capital ratio equal to or greater than 5%. At December 31, 2016, the Company's common equity Tier 1 capital ratio was 12.84%, Tier 1 risk-based capital ratio was 13.85%, total risk-based capital ratio was 14.97%, and Tier 1 leverage capital ratio was 11.57%.\nFULL YEAR REVIEW\nNet income for the year ended December 31, 2017, was $176.0 million, an increase of $943,000, or 0.5%, compared to net income of $175.1 million for the year ended December 31, 2016. 2017 results were impacted by a $22.3 million of additional income tax expense related to the revaluation of the Company's deferred tax assets and a $2.6 million pretax write-down of low income housing investments, both, as a result of the enactment of the Tax Cuts and Jobs Act. These two items had the effect of reducing diluted EPS by $.29 per diluted share for the fourth quarter and for the year. Diluted earnings per share for the year ended December 31, 2017 was $2.17 compared to $2.19 per share for year ended December 31, 2016. The net interest margin for the year ended December 31, 2017, was 3.63% compared to 3.38% for the year ended December 31, 2016.\nReturn on average stockholders' equity was 9.10% and return on average assets was 1.19% for the year ended December 31, 2017, compared to a return on average stockholders' equity of 9.88% and a return on average assets of 1.31% for the year ended December 31, 2016. The efficiency ratio for the year ended December 31, 2017, was 44.40% compared to 49.79% for the year ended December 31, 2016.\nCONFERENCE CALL\nCathay General Bancorp will host a conference call this afternoon to discuss its fourth quarter and year end 2017 financial results. The call will begin at 3:00 p.m., Pacific Time. Analysts and investors may dial in and participate in the question-and-answer session. To access the call, please dial 1-855-761-3186 and enter Conference ID 2079959. A listen-only live Webcast of the call will be available at www.cathaygeneralbancorp.com and a recorded version is scheduled to be available for replay for 12 months after the call.\nABOUT CATHAY GENERAL BANCORP\nCathay General Bancorp is the holding company for Cathay Bank, a California state-chartered bank. Founded in 1962, Cathay Bank offers a wide range of financial services. Cathay Bank currently operates 42 branches in California, 12 branches in New York State, three in the Chicago, Illinois area, three in Washington State, two in Texas, one in Maryland, one in Massachusetts, one in Nevada, one in New Jersey, one in Hong Kong, and a representative office in Taipei and in Shanghai. Cathay Bank's website is found at www.cathaybank.com .\nFORWARD-LOOKING STATEMENTS\nStatements made in this press release, other than statements of historical fact, are within the meaning of the applicable provisions of the Private Securities Litigation Reform Act of 1995 regarding management's beliefs, projections, and assumptions concerning future results and events. These may to, such words as \"aims,\" \"anticipates,\" \"believes,\" \"can,\" \"continue,\" \"could,\" \"estimates,\" \"expects,\" \"hopes,\" \"intends,\" \"may,\" \"plans,\" \"projects,\" \"predicts,\" \"potential,\" \"possible,\" \"optimistic,\" \"seeks,\" \"shall,\" \"should,\" \"will,\" and variations of these words and similar expressions. Forward-looking statements are based on estimates, beliefs, projections, and assumptions of management and are not guarantees of future performance. These are subject to certain risks and uncertainties that could cause actual results to differ materially from our historical experience and our present expectations or projections. Such risks and uncertainties and other factors to, adverse developments or conditions related to or arising from U.S. and international business and economic conditions; possible additional provisions for loan losses and charge-offs; credit risks of lending activities and deterioration in asset or credit quality; extensive laws and regulations and supervision that we are subject to including potential future supervisory action by bank supervisory authorities; increased costs of compliance and other risks associated with changes in regulation including the implementation of the Dodd-Frank Wall Street Reform and Consumer Protection Act; higher capital requirements from the implementation of the Basel III capital standards; compliance with the Bank Secrecy Act and other money laundering statutes and regulations; potential goodwill impairment; liquidity risk; fluctuations in interest rates; risks associated with acquisitions and the expansion of our business into new markets; inflation and deflation; real estate market conditions and the value of real estate collateral; environmental liabilities; our ability to compete with larger competitors; our ability to retain key personnel; successful management of reputational risk; natural disasters and geopolitical events; general economic or business conditions in Asia, and other regions where Cathay Bank has operations; failures, interruptions, or security breaches of our information systems; our ability to adapt our systems to technological changes; risk management processes and strategies; adverse results in legal proceedings; certain provisions in our charter and bylaws that may affect acquisition of the Company; changes in accounting standards or tax laws and regulations; market disruption and volatility; restrictions on dividends and other distributions by laws and regulations and by our regulators and our capital structure; issuance of preferred stock; successfully raising additional capital, if needed, and the resulting dilution of interests of holders of our common stock; the soundness of other financial institutions; our ability to consummate and realize the anticipated benefits of our acquisitions, including the recent acquisition of SinoPac Bancorp and Far East National Bank; the risk that integration of business operations following any acquisitions, including the recent acquisition of SinoPac Bancorp and Far East National Bank, will be materially delayed or will be more costly or difficult than expected; the diversion of management's attention from ongoing business operations and opportunities; the challenges of integrating and retaining key employees; and general competitive, economic political, and market conditions and fluctuations.\nThese and other factors are further described in Cathay General Bancorp's Annual Report on Form 10-K for the year ended December 31, 2016 (Item 1A in particular), other reports filed with the Securities and Exchange Commission (\"SEC\"), and other filings Cathay General Bancorp makes with the SEC from time to time. Actual results in any future period may also vary from the past results discussed in this press release. Given these risks and uncertainties, readers are cautioned not to place undue reliance on any , which speak to the date of this press release. Cathay General Bancorp has no intention and undertakes no obligation to update any forward-looking statement or to publicly announce any revision of any forward-looking statement to reflect future developments or events, except as required by law.\nCATHAY GENERAL BANCORP\nCONSOLIDATED FINANCIAL HIGHLIGHTS\n(Unaudited)\nThree months ended\nYear ended December 31,\n(Dollars in thousands, except per share data)\nDecember 31, 2017\nSeptember 30, 2017\nDecember 31, 2016\n2017\n2016\nFINANCIAL PERFORMANCE\nNet interest income before provision for credit losses\n$ 133,298\n$ 133,196\n$ 109,902\n$ 495,709\n$ 417,870\nReversal for credit losses\n-\n-\n-\n(2,500)\n(15,650)\nNet interest income after reversal for credit losses\n133,298\n133,196\n109,902\n498,209\n433,520\nNon-interest income\n10,215\n12,961\n7,961\n36,297\n33,370\nNon-interest expense\n66,407\n61,248\n53,503\n236,199\n224,690\nIncome before income tax expense\n77,106\n84,909\n64,360\n298,307\n242,200\nIncome tax expense\n51,166\n35,163\n16,345\n122,265\n67,101\nNet income\n$ 25,940\n$ 49,746\n$ 48,015\n176,042\n175,099\nNet income per common share\nBasic\n$ 0.32\n$ 0.62\n$ 0.60\n$ 2.19\n$ 2.21\nDiluted\n$ 0.32\n$ 0.61\n$ 0.60\n$ 2.17\n$ 2.19\nCash dividends paid per common share\n$ 0.24\n$ 0.21\n$ 0.21\n$ 0.87\n$ 0.75\nSELECTED RATIOS\nReturn on average assets\n0.66%\n1.29%\n1.37%\n1.19%\n1.31%\nReturn on average total stockholders' equity\n5.18%\n9.77%\n10.52%\n9.10%\n9.88%\nEfficiency ratio\n46.27%\n41.91%\n45.39%\n44.40%\n49.79%\nDividend payout ratio\n74.78%\n34.11%\n34.79%\n39.70%\n33.85%\nYIELD ANALYSIS (Fully taxable equivalent)\nTotal interest-earning assets\n4.27%\n4.34%\n4.00%\n4.22%\n4.04%\nTotal interest-bearing liabilities\n0.84%\n0.81%\n0.86%\n0.81%\n0.88%\nNet interest spread\n3.43%\n3.53%\n3.14%\n3.41%\n3.16%\nNet interest margin\n3.65%\n3.75%\n3.36%\n3.63%\n3.38%\nCAPITAL RATIOS\nDecember 31, 2017\nSeptember 30, 2017\nDecember 31, 2016\nCommon Equity Tier 1 capital ratio\n12.14%\n12.22%\n12.84%\nTier 1 risk-based capital ratio\n12.14%\n12.22%\n13.85%\nTotal risk-based capital ratio\n14.07%\n14.15%\n14.97%\nTier 1 leverage capital ratio\n10.31%\n10.41%\n11.57%\n.\nCATHAY GENERAL BANCORP\nCONDENSED CONSOLIDATED BALANCE SHEETS\n(Unaudited)\n(In thousands, except share and per share data)\nDecember 31, 2017\nSeptember 30, 2017\nDecember 31, 2016\nAssets\nCash and due from banks\n$ 247,056\n$ 167,886\n$ 218,017\nFederal funds sold\n-\n7,000\n-\nCash and cash equivalents\n247,056\n174,886\n218,017\nShort-term investments and interest bearing deposits\n292,745\n566,059\n967,067\nSecurities available-for-sale (amortized cost of $1,336,345 at December 31, 2017, $1,364,955 at September 30, 2017, and $1,317,012 at December 31, 2016)\n1,333,626\n1,368,487\n1,314,345\nLoans held for sale\n8,000\n-\n7,500\nLoans\n12,872,295\n12,597,434\n11,201,275\nLess: Allowance for loan losses\n(123,279)\n(121,535)\n(118,966)\nUnamortized deferred loan fees, net\n(3,245)\n(3,424)\n(4,994)\nLoans, net\n12,745,771\n12,472,475\n11,077,315\nFederal Home Loan Bank and Federal Reserve Bank stock\n23,085\n30,681\n17,250\nOther real estate owned, net\n9,442\n18,115\n20,070\nAffordable housing investments and alternative energy partnerships, net\n272,871\n298,426\n251,077\nPremises and equipment, net\n103,064\n107,954\n105,607\nCustomers' liability on acceptances\n13,482\n12,009\n12,182\nAccrued interest receivable\n45,307\n42,190\n37,299\nGoodwill\n372,189\n372,189\n372,189\nOther intangible assets, net\n8,062\n9,408\n2,949\nOther assets\n164,162\n255,538\n117,902\nTotal assets\n$ 15,638,862\n$ 15,728,417\n$ 14,520,769\nLiabilities and Stockholders' Equity\nDeposits\nNon-interest-bearing demand deposits\n$ 2,783,127\n$ 2,730,006\n$ 2,478,107\nInterest-bearing deposits:\nNOW deposits\n1,410,519\n1,379,100\n1,230,445\nMoney market deposits\n2,248,271\n2,370,724\n2,198,938\nSavings deposits\n857,199\n925,312\n719,949\nTime deposits\n5,390,777\n5,156,553\n5,047,287\nTotal deposits\n12,689,893\n12,561,695\n11,674,726\nSecurities sold under agreements to repurchase\n100,000\n100,000\n350,000\nAdvances from the Federal Home Loan Bank\n430,000\n595,000\n350,000\nOther borrowings for affordable housing investments\n17,481\n17,518\n17,662\nLong-term debt\n194,136\n119,136\n119,136\nAcceptances outstanding\n13,482\n12,009\n12,182\nDeferred payments from acquisition\n36,696\n136,056\n-\nOther liabilities\n189,823\n218,304\n168,524\nTotal liabilities\n13,671,511\n13,759,718\n12,692,230\nCommitments and contingencies\n-\n-\n-\nStockholders' Equity\nCommon stock, $0.01 par value, 100,000,000 shares authorized, 89,104,022 issued and 80,893,379 outstanding at December 31, 2017, 89,027,259 issued and 80,816,616 outstanding at September 30, 2017, and 87,820,920 issued and 79,610,277 outstanding at December 31, 2016\n891\n890\n878\nAdditional paid-in-capital\n926,923\n932,521\n895,480\nAccumulated other comprehensive income/(loss), net\n(2,511)\n(217)\n(3,715)\nRetained earnings\n1,281,637\n1,275,094\n1,175,485\nTreasury stock, at cost (8,210,643 shares at December 31, 2017, at September 30, 2017, and at December 31, 2016)\n(239,589)\n(239,589)\n(239,589)\nTotal equity\n1,967,351\n1,968,699\n1,828,539\nTotal liabilities and equity\n$ 15,638,862\n$ 15,728,417\n$ 14,520,769\nBook value per common share\n$ 24.18\n$ 24.24\n$ 22.80\nNumber of common shares outstanding\n80,893,379\n80,816,616\n79,610,277\nCATHAY GENERAL BANCORP\nCONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS\n(Unaudited )\nThree months ended\nYear ended December 31,\nDecember 31, 2017\nSeptember 30, 2017\nDecember 31, 2016\n2017\n2016\n(In thousands, except share and per share data)\nINTEREST AND DIVIDEND INCOME\nLoan receivable, including loan fees\n$ 148,162\n$ 146,383\n$ 124,570\n$ 549,291\n$ 473,782\nInvestment securities\n5,965\n5,692\n4,452\n20,531\n21,426\nFederal Home Loan Bank and Federal Reserve Bank stock\n481\n607\n977\n1,798\n2,099\nFederal funds sold and securities purchased under agreements to resell\n2\n108\n-\n110\n-\nDeposits with banks\n1,281\n1,288\n669\n4,421\n1,763\nTotal interest and dividend income\n155,891\n154,078\n130,668\n576,151\n499,070\nINTEREST EXPENSE\nTime deposits\n13,339\n11,678\n11,150\n46,768\n43,327\nOther deposits\n4,831\n5,101\n4,311\n19,076\n16,094\nSecurities sold under agreements to repurchase\n761\n874\n3,633\n4,250\n15,329\nAdvances from Federal Home Loan Bank\n1,246\n872\n217\n2,711\n659\nLong-term debt\n1,455\n1,456\n1,455\n5,775\n5,791\nDeferred payments from acquisition\n960\n901\n-\n1,861\n-\nShort-term borrowings\n1\n-\n-\n1\n-\nTotal interest expense\n22,593\n20,882\n20,766\n80,442\n81,200\nNet interest income before reversal for credit losses\n133,298\n133,196\n109,902\n495,709\n417,870\nReversal for credit losses\n-\n-\n-\n(2,500)\n(15,650)\nNet interest income after reversal for credit losses\n133,298\n133,196\n109,902\n498,209\n433,520\nNON-INTEREST INCOME\nSecurities (losses)/gains, net\n1,445\n24\n1,757\n1,006\n4,898\nLetters of credit commissions\n1,242\n1,302\n1,241\n4,860\n4,939\nDepository service fees\n1,405\n1,407\n1,369\n5,664\n5,478\nGain from acquisition\n188\n5,440\n-\n5,628\n-\nOther operating income\n5,935\n4,788\n3,594\n19,139\n18,055\nTotal non-interest income\n10,215\n12,961\n7,961\n36,297\n33,370\nNON-INTEREST EXPENSE\nSalaries and employee benefits\n29,529\n27,913\n26,035\n109,458\n97,348\nOccupancy expense\n5,696\n5,312\n4,728\n20,429\n18,315\nComputer and equipment expense\n2,951\n2,643\n2,417\n10,846\n9,777\nProfessional services expense\n5,898\n4,942\n4,705\n20,439\n18,686\nData processing service expense\n3,344\n2,918\n2,401\n11,190\n8,957\nFDIC and State assessments\n3,372\n2,552\n2,072\n10,633\n9,712\nMarketing expense\n1,367\n2,103\n1,778\n6,200\n5,092\nOther real estate owned expense\n(2,396)\n369\n244\n(1,649)\n856\nAmortization of investments in low income housing and alternative energy partnerships\n10,415\n5,723\n4,638\n27,212\n40,264\nAmortization of core deposit intangibles\n304\n281\n172\n930\n689\nAcquisition and integration costs\n844\n3,277\n-\n4,121\n-\nOther operating expense\n5,083\n3,215\n4,313\n16,390\n14,994\nTotal non-interest expense\n66,407\n61,248\n53,503\n236,199\n224,690\nIncome before income tax expense\n77,106\n84,909\n64,360\n298,307\n242,200\nIncome tax expense\n51,166\n35,163\n16,345\n122,265\n67,101\nNet income\n$ 25,940\n$ 49,746\n$ 48,015\n176,042\n175,099\nNet income per common share:\nBasic\n$ 0.32\n$ 0.62\n$ 0.61\n$ 2.19\n$ 2.21\nDiluted\n$ 0.32\n$ 0.61\n$ 0.60\n$ 2.17\n$ 2.19\nCash dividends paid per common share\n$ 0.24\n$ 0.21\n$ 0.21\n$ 0.87\n$ 0.75\nBasic average common shares outstanding\n80,825,201\n80,665,398\n79,171,401\n80,262,782\n79,153,762\nDiluted average common shares outstanding\n81,619,905\n81,404,854\n80,007,934\n81,004,550\n79,929,262\nCATHAY GENERAL BANCORP\nAVERAGE BALANCES – SELECTED CONSOLIDATED FINANCIAL INFORMATION\n(Unaudited)\nThree months ended\n(In thousands)\nDecember 31, 2017\nSeptember 30, 2017\nDecember 31, 2016\nInterest-earning assets\nAverage Balance\nAverage\nYield/Rate\n(1)\nAverage Balance\nAverage\nYield/Rate\n(1)\nAverage Balance\nAverage\nYield/Rate\n(1)\nLoans (1)\n$ 12,735,456\n4.62%\n$ 12,317,720\n4.71%\n$ 11,080,313\n4.47%\nInvestment securities\n1,338,653\n1.77%\n1,396,859\n1.61%\n1,339,848\n1.32%\nFHLB and FRB stock\n25,770\n7.40%\n32,369\n7.44%\n18,290\n21.25%\nFederal funds sold and securities purchased under agreements to resell\n1,978\n0.54%\n35,707\n1.20%\n-\n-\nDeposits with banks\n387,725\n1.31%\n292,595\n1.75%\n560,896\n0.47%\nTotal interest-earning assets\n$ 14,489,582\n4.27%\n$ 14,075,250\n4.34%\n$ 12,999,347\n4.00%\nInterest-bearing liabilities\nInterest-bearing demand deposits\n$ 1,366,808\n0.18%\n$ 1,349,508\n0.17%\n$ 1,144,082\n0.17%\nMoney market deposits\n2,361,128\n0.62%\n2,496,548\n0.63%\n2,176,268\n0.65%\nSavings deposits\n886,706\n0.24%\n942,452\n0.24%\n666,867\n0.17%\nTime deposits\n5,263,846\n1.01%\n4,939,189\n0.94%\n4,982,911\n0.89%\nTotal interest-bearing deposits\n$ 9,878,488\n0.73%\n$ 9,727,697\n0.68%\n$ 8,970,128\n0.69%\nSecurities sold under agreements to repurchase\n100,000\n3.02%\n109,239\n3.17%\n350,000\n4.13%\nOther borrowed funds\n491,000\n1.52%\n324,581\n2.17%\n148,675\n0.58%\nLong-term debt\n158,266\n4.45%\n119,136\n4.85%\n119,136\n4.86%\nTotal interest-bearing liabilities\n10,627,754\n0.84%\n10,280,653\n0.81%\n9,587,939\n0.86%\nNon-interest-bearing demand deposits\n2,766,338\n2,714,244\n2,400,404\nTotal deposits and other borrowed funds\n$ 13,394,092\n$ 12,994,897\n$ 11,988,343\nTotal average assets\n$ 15,591,373\n$ 15,354,123\n$ 13,992,093\nTotal average equity\n$ 1,984,890\n$ 2,020,224\n$ 1,814,981\nYear ended,\n(In thousands)\nDecember 31, 2017\nDecember 31, 2016\nInterest-earning assets\nAverage Balance\nAverage\nYield/Rate\n(1)\nAverage Balance\nAverage\nYield/Rate (1)\nLoans (1)\n$ 11,937,666\n4.60%\n$ 10,622,160\n4.46%\nInvestment securities\n1,308,089\n1.57%\n1,372,916\n1.56%\nFHLB and FRB stock\n23,208\n7.75%\n17,516\n11.98%\nFederal funds sold and securities purchased under agreements to resell\n9,499\n1.16%\n-\n-\nDeposits with banks\n366,674\n1.21%\n345,136\n0.51%\nTotal interest-earning assets\n$ 13,645,136\n4.22%\n$ 12,357,728\n4.04%\nInterest-bearing liabilities\nInterest-bearing demand deposits\n$ 1,304,053\n0.17%\n$ 1,046,046\n0.17%\nMoney market deposits\n2,360,188\n0.64%\n2,059,823\n0.65%\nSavings deposits\n834,973\n0.21%\n636,422\n0.16%\nTime deposits\n4,947,051\n0.95%\n4,810,746\n0.90%\nTotal interest-bearing deposits\n$ 9,446,265\n0.70%\n$ 8,553,037\n0.69%\nSecurities sold under agreements to repurchase\n136,849\n3.11%\n381,967\n4.01%\nOther borrowed funds\n256,423\n1.66%\n126,720\n0.52%\nLong-term debt\n128,999\n4.73%\n119,136\n4.86%\nTotal interest-bearing liabilities\n9,968,536\n0.81%\n9,180,860\n0.88%\nNon-interest-bearing demand deposits\n2,599,109\n2,199,274\nTotal deposits and other borrowed funds\n$ 12,567,645\n$ 11,380,134\nTotal average assets\n$ 14,733,002\n$ 13,331,148\nTotal average equity\n$ 1,935,059\n$ 1,772,017\n(1) Yields and interest earned include net loan fees. Non-accrual loans are included in the average balance.\nView original content with multimedia: http://www.prnewswire.com/news-releases/cathay-general-bancorp-announces-fourth-quarter-and-full-year-2017-results-300590620.html\nSOURCE Cathay General Bancorp", "external_links": ["http://www.cathaybank.com/", "http://www.prnewswire.com/news-releases/cathay-general-bancorp-announces-fourth-quarter-and-full-year-2017-results-300590620.html"], "published": "2018-01-31T00:30:00.000+02:00", "crawled": "2018-01-31T02:05:30.013+02:00", "highlightTitle": ""}