{"organizations": [], "uuid": "20c6b305b557226476d94dc864ec0cc72f25214d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-national-bank-holdings-corporation-announces-completion-of-peoples-inc-acquisition.html", "country": "US", "domain_rank": 767, "title": "National Bank Holdings Corporation Announces Completion of Peoples, Inc. Acquisition", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.024, "site_type": "news", "published": "2018-01-03T00:31:00.000+02:00", "replies_count": 0, "uuid": "20c6b305b557226476d94dc864ec0cc72f25214d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-national-bank-holdings-corporation-announces-completion-of-peoples-inc-acquisition.html", "ord_in_thread": 0, "title": "National Bank Holdings Corporation Announces Completion of Peoples, Inc. Acquisition", "locations": [], "entities": {"persons": [{"name": "greenwood", "sentiment": "negative"}, {"name": "zahl", "sentiment": "none"}, {"name": "lawrence", "sentiment": "none"}, {"name": "brendan zahl", "sentiment": "none"}], "locations": [{"name": "colo.", "sentiment": "none"}, {"name": "overland park", "sentiment": "none"}, {"name": "new mexico", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "taos", "sentiment": "none"}, {"name": "albuquerque", "sentiment": "none"}, {"name": "kansas", "sentiment": "none"}, {"name": "colorado springs", "sentiment": "none"}], "organizations": [{"name": "national bank holdings corporation", "sentiment": "negative"}, {"name": "nbh", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "national bank holdings corporation announces completion of peoples, inc", "sentiment": "neutral"}, {"name": "kansas-based peoples bank", "sentiment": "none"}, {"name": "peoples national bank", "sentiment": "none"}, {"name": "peoples, inc.", "sentiment": "none"}, {"name": "nbh bank board", "sentiment": "none"}, {"name": "colorado-based peoples national bank", "sentiment": "none"}, {"name": "nbh bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GREENWOOD VILLAGE, Colo., Jan. 2, 2018 /PRNewswire/ -- National Bank Holdings Corporation (NYSE: NBHC, \"NBH\" or the \"Company\") announced today the closing of its acquisition of Peoples, Inc. (\"Peoples\"), the bank holding company of Colorado-based Peoples National Bank and Kansas-based Peoples Bank, effective January 1, 2018. As of September 30, 2017, Peoples had assets of $905.4 million, loans held for investment of $543.2 million and deposits of $732.9 million.\nThe acquisition expands the footprint for the Company's community bank franchise in highly-attractive and geographically-relevant markets, such as Colorado Springs in Colorado, Overland Park and Lawrence in Kansas, and Taos and Albuquerque in New Mexico. The acquisition also adds a best-in-class, complementary franchise-centric residential mortgage platform, which will be led by Brendan Zahl, the former President and CEO of Peoples National Bank. Zahl has also been appointed to the NBH Bank Board of Directors and joins NBH Bank as Executive Vice President, Residential Banking and Market President for the Colorado Springs area. Another key leader joining NBH from Kansas-based Peoples Bank is Ruth Stevenson, former President and Chief Operating Officer for Peoples Bank. Stevenson will serve as an Executive Vice President, leading a key client experience initiative for NBH and overseeing the Company's deposit operations. Stevenson will also serve as Market President for the Company's newly-acquired Kansas locations.\nThe Company's Chairman, President and CEO, Tim Laney said, \"I'm extremely proud of my NBH teammates, including our new teammates from Peoples, for their outstanding teamwork and diligence in bringing this merger across the finish line. The addition of top banking talent we are gaining, paired with the opportunity to expand our presence in new and attractive markets has positioned us very well for strong and continued growth in 2018 and beyond. I especially look forward to welcoming our new Peoples clients and continuing to earn their business through our Common Sense approach to banking.\"\nAt the closing, Peoples' shareholders received approximately $36.2 million of cash consideration, $10.0 million of which was placed into escrow, and 3,398,477 shares of NBH common stock, implying a transaction value of approximately $146.3 million, based upon NBH's average closing stock price of $32.39, as calculated pursuant to the merger agreement.\nKeefe, Bruyette & Woods, a Stifel Company, served as financial advisor to NBH in connection with this transaction and Wachtell, Lipton, Rosen & Katz served as NBH's legal counsel. The Capital Corporation served as financial advisor to Peoples in connection with this transaction and Lathrop Gage LLP served as Peoples' legal counsel.\nAbout National Bank Holdings Corporation\nNational Bank Holdings Corporation is a bank holding company created to build a leading community bank franchise delivering high quality customer service and committed to shareholder results. National Bank Holdings Corporation operates a network of 105 banking centers located in Colorado, the greater Kansas City region, Texas and New Mexico. Through the Company's subsidiary, NBH Bank, it operates under the following brand names: Bank Midwest in Kansas and Missouri, Community Banks of Colorado in Colorado and Hillcrest Bank in Texas and New Mexico. Additional information about National Bank Holdings Corporation can be found at www.nationalbankholdings.com .\nForward-Looking Statements\nThis press release contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements contain words such as \"anticipate,\" \"believe,\" \"can,\" \"would,\" \"should,\" \"could,\" \"may,\" \"predict,\" \"seek,\" \"potential,\" \"will,\" \"estimate,\" \"target,\" \"plan,\" \"project,\" \"continuing,\" \"ongoing,\" \"expect,\" \"intend\" or similar expressions that relate to the Company's strategy, plans or intentions. Forward-looking statements involve certain important risks, uncertainties and other factors, any of which could cause actual results to differ materially from those in such statements. Such factors include, without limitation, the \"Risk Factors\" referenced in the Company's most recent Form 10-K filed with the Securities and Exchange Commission (SEC), other risks and uncertainties listed from time to time in our reports and documents filed with the SEC, and the following factors: difficulties and delays in integrating the NBH and Peoples businesses or fully realizing cost savings and other benefits; business disruption following the closing; and success at managing the risks involved in the foregoing items. The Company can give no assurance that any goal or plan or expectation set forth in forward-looking statements can be achieved and readers are cautioned not to place undue reliance on such statements. The forward-looking statements are made as of the date of this press release, and the Company does not intend, and assumes no obligation, to update any forward-looking statement to reflect events or circumstances after the date on which the statement is made or to reflect the occurrence of unanticipated events or circumstances, except as required by applicable law.\nFor more information visit: bankmw.com , cobnks.com , hillcrestbank.com or nbhbank.com . Or, follow us on any of our social media sites:\nBank Midwest: facebook.com/bankmw , twitter.com/bank_mw , instagram.com/bankmw ;\nCommunity Banks of Colorado: facebook.com/cobnks , twitter.com/cobnks , instagram.com/cobnks ;\nHillcrest Bank: facebook.com/hillcrestbank , twitter.com/hillcrest_bank ;\nNBH Bank: twitter.com/nbhbank ;\nor connect with any of our brands on LinkedIn.\nView original content with multimedia: http://www.prnewswire.com/news-releases/national-bank-holdings-corporation-announces-completion-of-peoples-inc-acquisition-300576645.html\nSOURCE National Bank Holdings Corporation", "external_links": ["http://twitter.com/hillcrest_bank", "http://twitter.com/cobnks", "http://www.prnewswire.com/news-releases/national-bank-holdings-corporation-announces-completion-of-peoples-inc-acquisition-300576645.html", "http://facebook.com/cobnks", "http://facebook.com/bankmw", "http://twitter.com/bank_mw", "http://instagram.com/cobnks", "http://instagram.com/bankmw", "http://facebook.com/hillcrestbank", "http://twitter.com/nbhbank"], "published": "2018-01-03T00:31:00.000+02:00", "crawled": "2018-01-03T02:10:30.015+02:00", "highlightTitle": ""}