{"organizations": [], "uuid": "d52a2a46e1206d48d4b6d3d48b7b9b451e77aeca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-ti-reports-4q17-and-2017-financial-results-and-shareholder-returns.html", "country": "US", "domain_rank": 767, "title": "TI reports 4Q17 and 2017 financial results and shareholder returns", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T00:01:00.000+02:00", "replies_count": 0, "uuid": "d52a2a46e1206d48d4b6d3d48b7b9b451e77aeca"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-ti-reports-4q17-and-2017-financial-results-and-shareholder-returns.html", "ord_in_thread": 0, "title": "TI reports 4Q17 and 2017 financial results and shareholder returns", "locations": [], "entities": {"persons": [{"name": "ti", "sentiment": "none"}, {"name": "rich templeton", "sentiment": "none"}], "locations": [{"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "texas instruments incorporated", "sentiment": "negative"}, {"name": "embedded processing", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 23, 2018 /PRNewswire/ -- Texas Instruments Incorporated (TI) (NASDAQ: TXN) today reported fourth-quarter revenue of $3.75 billion, net income of $344 million and earnings per share of 34 cents. Earnings per share include 75 cents in tax-related expenses not in the company's original guidance primarily due to the recently passed tax reform act.\nRegarding the company's performance and returns to shareholders, Rich Templeton, TI's chairman, president and CEO, made the following comments:\n\"Revenue increased 10 percent from the same quarter a year ago. Demand for our products continued to be strong in the industrial and automotive markets. \"In our core businesses, Analog revenue grew 11 percent and Embedded Processing grew 20 percent from the same quarter a year ago. Operating margin increased in both businesses. \"Gross margin of 65.1 percent for the quarter reflected the quality of our product portfolio, as well as the efficiency of our manufacturing strategy, including the benefit of 300-millimeter Analog production. \"Our cash flow from operations of $5.36 billion for the year again underscored the strength of our business model. Free cash flow for the year was up 14 percent from a year ago to $4.67 billion and represents 31.2 percent of revenue, up from 30.5 percent a year ago. \"We have returned $4.66 billion to owners in 2017 through stock repurchases and dividends, consistent with our strategy to return to owners all of our free cash flow. Over the last 12 months, our dividends represented 45 percent of free cash flow, underscoring their sustainability. \"TI's first-quarter outlook is for revenue in the range of $3.49 billion to $3.79 billion, and earnings per share between $1.01 and $1.17, which includes an estimated $30 million discrete tax benefit. \"Notably, the recently passed tax reform act will reduce our annual operating tax rate from 31 percent in 2017 to an ongoing rate of 18 percent starting in 2019, comprehending the benefit of exports and having manufacturing, R&D and intellectual property in the United States. In 2018, our annual operating tax rate will be 23 percent, 5 percentage points higher, due to transitional expense associated with the reduced U.S. tax rate in 2018.\"\nFree cash flow is a non-GAAP financial measure. Free cash flow is cash flow from operations less capital expenditures.\nCertain amounts in the prior periods have been recast to conform to the current presentation.\nEarnings summary\nAmounts are in millions of dollars, except per-share amounts.\n4Q17\n4Q16\nChange\nRevenue\n$\n3,750\n$\n3,414\n10%\nOperating profit\n$\n1,563\n$\n1,332\n17%\nNet income\n$\n344\n$\n1,047\n-67%\nEarnings per share\n$\n0.34\n$\n1.02\n-67%\nCash generation\nAmounts are in millions of dollars.\nTrailing 12 Months\n4Q17\n4Q17\n4Q16\nChange\nCash flow from operations\n$\n1,929\n$\n5,363\n$\n4,614\n16%\nCapital expenditures\n$\n231\n$\n695\n$\n531\n31%\nFree cash flow\n$\n1,698\n$\n4,668\n$\n4,083\n14%\nFree cash flow % of revenue\n31.2%\n30.5%\nCash return\nAmounts are in millions of dollars.\nTrailing 12 Months\n4Q17\n4Q17\n4Q16\nChange\nDividends paid\n$\n611\n$\n2,104\n$\n1,646\n28%\nStock repurchases\n$\n706\n$\n2,556\n$\n2,132\n20%\nTotal cash returned\n$\n1,317\n$\n4,660\n$\n3,778\n23%\nTEXAS INSTRUMENTS INCORPORATED AND SUBSIDIARIES\nConsolidated Statements of Income\n(Millions of dollars, except share and per-share amounts)\nFor Three Months Ended\nFor Years Ended\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nRevenue\n$\n3,750\n$\n3,414\n$\n14,961\n$\n13,370\nCost of revenue (COR)\n1,310\n1,277\n5,347\n5,113\nGross profit\n2,440\n2,137\n9,614\n8,257\nResearch and development (R&D)\n386\n340\n1,508\n1,356\nSelling, general and administrative (SG&A)\n409\n405\n1,694\n1,742\nAcquisition charges\n79\n80\n318\n319\nRestructuring charges/other\n3\n(20)\n11\n(15)\nOperating profit\n1,563\n1,332\n6,083\n4,855\nOther income (expense), net (OI&E)\n8\n184\n75\n155\nInterest and debt expense\n21\n19\n78\n80\nIncome before income taxes\n1,550\n1,497\n6,080\n4,930\nProvision for income taxes\n1,206\n450\n2,398\n1,335\nNet income\n$\n344\n$\n1,047\n$\n3,682\n$\n3,595\nDiluted earnings per common share\n$\n.34\n$\n1.02\n$\n3.61\n$\n3.48\nAverage shares outstanding (millions):\nBasic\n985\n998\n991\n1,003\nDiluted\n1,007\n1,018\n1,012\n1,021\nCash dividends declared per common share\n$\n.62\n$\n.50\n$\n2.12\n$\n1.64\nCertain amounts in the prior periods have been adjusted to reflect the first-quarter 2017 early adoption of ASU 2017-07 related to the reclassification of certain pension and other retiree benefit costs to OI&E.\nSupplemental Information\nProvision for income taxes is based on the following:\nOperating taxes (calculated using the estimated annual effective tax rate)\n$\n476\n$\n465\n$\n1,858\n$\n1,489\nDiscrete tax items\n730\n(15)\n540\n(154)\nProvision for income taxes (effective taxes)\n$\n1,206\n$\n450\n$\n2,398\n$\n1,335\nAnnual operating tax rate\n31%\n31%\n31%\n30%\nEffective tax rate\n78%\n30%\n39%\n27%\nAs a result of accounting rule ASC 260, which requires a portion of Net income to be allocated to unvested restricted stock units (RSUs) on which we pay dividend equivalents, diluted EPS is calculated using the following:\nNet income\n$\n344\n$\n1,047\n$\n3,682\n$\n3,595\nIncome allocated to RSUs\n(3)\n(13)\n(33)\n(44)\nIncome allocated to common stock for diluted EPS\n$\n341\n$\n1,034\n$\n3,649\n$\n3,551\nTEXAS INSTRUMENTS INCORPORATED AND SUBSIDIARIES\nConsolidated Balance Sheets\n(Millions of dollars, except share amounts)\nDecember 31,\n2017\n2016\nAssets\nCurrent assets:\nCash and cash equivalents\n$\n1,656\n$\n1,154\nShort-term investments\n2,813\n2,336\nAccounts receivable, net of allowances of ($8) and ($17)\n1,278\n1,267\nRaw materials\n126\n102\nWork in process\n1,089\n954\nFinished goods\n742\n734\nInventories\n1,957\n1,790\nPrepaid expenses and other current assets\n1,030\n910\nTotal current assets\n8,734\n7,457\nProperty, plant and equipment at cost\n4,789\n4,923\nAccumulated depreciation\n(2,125)\n(2,411)\nProperty, plant and equipment, net\n2,664\n2,512\nLong-term investments\n268\n235\nGoodwill\n4,362\n4,362\nAcquisition-related intangibles\n946\n1,264\nDeferred tax assets\n264\n374\nCapitalized software licenses\n110\n52\nOverfunded retirement plans\n208\n96\nOther assets\n86\n79\nTotal assets\n$\n17,642\n$\n16,431\nLiabilities and stockholders' equity\nCurrent liabilities:\nCurrent portion of long-term debt\n$\n500\n$\n631\nAccounts payable\n466\n396\nAccrued compensation\n722\n710\nIncome taxes payable\n128\n83\nAccrued expenses and other liabilities\n442\n444\nTotal current liabilities\n2,258\n2,264\nLong-term debt\n3,577\n2,978\nUnderfunded retirement plans\n89\n129\nDeferred tax liabilities\n78\n33\nDeferred credits and other liabilities\n1,303\n554\nTotal liabilities\n7,305\n5,958\nStockholders' equity:\nPreferred stock, $25 par value. Authorized – 10,000,000 shares\nParticipating cumulative preferred – None issued\n—\n—\nCommon stock, $1 par value. Authorized – 2,400,000,000 shares\nShares issued – 1,740,815,939\n1,741\n1,741\nPaid-in capital\n1,776\n1,674\nRetained earnings\n34,662\n33,107\nTreasury common stock at cost\nShares: 2017 – 757,657,217; 2016 – 744,831,978\n(27,458)\n(25,523)\nAccumulated other comprehensive income (loss), net of taxes (AOCI)\n(384)\n(526)\nTotal stockholders' equity\n10,337\n10,473\nTotal liabilities and stockholders' equity\n$\n17,642\n$\n16,431\nTEXAS INSTRUMENTS INCORPORATED AND SUBSIDIARIES\nConsolidated Statements of Cash Flows\n(Millions of dollars)\nFor Three Months Ended\nFor Years Ended\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nCash flows from operating activities\nNet income\n$\n344\n$\n1,047\n$\n3,682\n$\n3,595\nAdjustments to Net income:\nDepreciation\n133\n139\n539\n605\nAmortization of acquisition-related intangibles\n79\n80\n318\n319\nAmortization of capitalized software\n12\n8\n47\n31\nStock-based compensation\n45\n48\n242\n252\nGains on sales of assets\n—\n(40)\n—\n(40)\nDeferred taxes\n159\n(42)\n112\n(202)\nIncrease (decrease) from changes in:\nAccounts receivable\n299\n166\n(7)\n(108)\nInventories\n(49)\n18\n(167)\n(99)\nPrepaid expenses and other current assets\n33\n(211)\n76\n(81)\nAccounts payable and accrued expenses\n70\n59\n51\n72\nAccrued compensation\n82\n62\n(3)\n36\nIncome taxes payable\n694\n180\n468\n333\nChanges in funded status of retirement plans\n(15)\n(129)\n21\n(73)\nOther\n43\n2\n(16)\n(26)\nCash flows from operating activities\n1,929\n1,387\n5,363\n4,614\nCash flows from investing activities\nCapital expenditures\n(231)\n(110)\n(695)\n(531)\nProceeds from asset sales\n—\n—\n40\n—\nPurchases of short-term investments\n(1,450)\n(1,332)\n(4,555)\n(3,503)\nProceeds from short-term investments\n790\n765\n4,095\n3,390\nOther\n(7)\n(8)\n(12)\n(6)\nCash flows from investing activities\n(898)\n(685)\n(1,127)\n(650)\nCash flows from financing activities\nProceeds from issuance of debt\n494\n—\n1,099\n499\nRepayment of debt\n—\n—\n(625)\n(1,000)\nDividends paid\n(611)\n(499)\n(2,104)\n(1,646)\nStock repurchases\n(706)\n(475)\n(2,556)\n(2,132)\nProceeds from common stock transactions\n162\n57\n483\n472\nOther\n(10)\n—\n(31)\n(3)\nCash flows from financing activities\n(671)\n(917)\n(3,734)\n(3,810)\nNet change in Cash and cash equivalents\n360\n(215)\n502\n154\nCash and cash equivalents at beginning of period\n1,296\n1,369\n1,154\n1,000\nCash and cash equivalents at end of period\n$\n1,656\n$\n1,154\n$\n1,656\n$\n1,154\nQuarterly segment results\nAmounts are in millions of dollars.\n4Q17\n4Q16\nChange\nAnalog:\nRevenue\n$\n2,535\n$\n2,290\n11%\nOperating profit\n$\n1,188\n$\n990\n20%\nEmbedded Processing:\nRevenue\n$\n896\n$\n744\n20%\nOperating profit\n$\n307\n$\n214\n43%\nOther:\nRevenue\n$\n319\n$\n380\n-16%\nOperating profit*\n$\n68\n$\n128\n-47%\n* Includes Acquisition charges and Restructuring charges/other.\nCompared with the year-ago quarter:\nAnalog: (includes Power, Signal Chain and High Volume)\nRevenue increased due to Power and Signal Chain. High Volume declined. Operating profit increased primarily due to higher revenue and associated gross profit.\nEmbedded Processing: (includes Connected Microcontrollers and Processors)\nRevenue increased in both product lines. Operating profit increased due to higher revenue and associated gross profit.\nOther: (includes DLP ® products, calculators and custom ASIC products)\nRevenue decreased $61 million, and operating profit declined $60 million.\nAnnual segment results\nAmounts are in millions of dollars.\n2017\n2016\nChange\nAnalog:\nRevenue\n$\n9,900\n$\n8,536\n16%\nOperating profit\n$\n4,468\n$\n3,416\n31%\nEmbedded Processing:\nRevenue\n$\n3,498\n$\n3,023\n16%\nOperating profit\n$\n1,143\n$\n817\n40%\nOther:\nRevenue\n$\n1,563\n$\n1,811\n-14%\nOperating profit*\n$\n472\n$\n622\n-24%\n* Includes Acquisition charges and Restructuring charges/other.\nCompared with the prior year:\nAnalog:\nRevenue increased due to Power and Signal Chain. High Volume also grew. Operating profit increased primarily due to higher revenue and associated gross profit.\nEmbedded Processing:\nRevenue increased due to growth in both product lines – Processors and Connected Microcontrollers. Operating profit increased primarily due to higher revenue and associated gross profit.\nOther:\nRevenue declined $248 million primarily due to custom ASIC products and the move of royalties from revenue to OI&E, which began in the first quarter of 2017. Operating profit decreased $150 million.\nNon-GAAP financial information\nThis release includes references to free cash flow and ratios based on that measure. These are financial measures that were not prepared in accordance with GAAP. Free cash flow was calculated by subtracting Capital expenditures from the most directly comparable GAAP measure, Cash flows from operating activities (also referred to as cash flow from operations).\nThe company believes that free cash flow and the associated ratios provide insight into its liquidity, its cash-generating capability and the amount of cash potentially available to return to shareholders, as well as insight into its financial performance. These non-GAAP measures are supplemental to the comparable GAAP measures.\nReconciliation to the most directly comparable GAAP measures is provided in the table below.\nAmounts are in millions of dollars.\nFor Years Ended\nDecember 31,\n2017\n2016\nChange\nCash flow from operations (GAAP)\n$\n5,363\n$\n4,614\n16%\nCapital expenditures\n(695)\n(531)\nFree cash flow (non-GAAP)\n$\n4,668\n$\n4,083\n14%\nRevenue\n$\n14,961\n$\n13,370\nCash flow from operations as a percent of revenue (GAAP)\n35.8%\n34.5%\nFree cash flow as a percent of revenue (non-GAAP)\n31.2%\n30.5%\nThis release also includes references to an annual operating tax rate, a non-GAAP term the company uses to describe the estimated annual effective tax rate, a GAAP measure that by definition does not include discrete tax items. The company believes the term annual operating tax rate more clearly communicates that discrete tax items are excluded from such rate. The term also helps differentiate from the effective tax rate, which includes discrete tax items. No adjustments are made to the estimated annual effective tax rate when using the term annual operating tax rate.\nNotice regarding\nThis release includes intended to qualify for the safe harbor from liability established by the Private 1995. These generally can be identified by phrases such as TI or its management \"believes,\" \"expects,\" \"anticipates,\" \"foresees,\" \"forecasts,\" \"estimates\" or other words or phrases of similar import. Similarly, statements herein that describe TI's business strategy, outlook, objectives, plans, intentions or goals also are . All such are subject to certain risks and uncertainties that could cause actual results to differ materially from those in .\nWe urge you to carefully consider the following important factors that could cause actual results to differ materially from the expectations of TI or our management:\nMarket demand for semiconductors, particularly in TI's end markets; TI's ability to compete in products and prices in an intensely competitive industry; Customer demand that differs from forecasts and the financial impact of inadequate or excess TI inventory that results from demand that differs from projections; TI's ability to develop, manufacture and market innovative products in a rapidly changing technological environment; Economic, social and political conditions in the countries in which TI, our customers or our suppliers operate, including security risks; global trade policies; political and social instability; health conditions; possible disruptions in transportation, communications and information technology networks; and fluctuations in foreign currency exchange rates; Natural events such as severe weather, geological events or health epidemics in the locations in which TI, our customers or our suppliers operate; Breaches or disruptions of TI's information technology systems or those of our customers or suppliers; Timely implementation of new manufacturing technologies and installation of manufacturing equipment, or the ability to obtain needed third-party foundry and assembly/test subcontract services; Availability and cost of raw materials, utilities, manufacturing equipment, third-party manufacturing services and manufacturing technology; Compliance with or changes in the complex laws, rules and regulations to which TI is or may become subject, or actions of enforcement authorities, that restrict TI's ability to manufacture or ship our products or operate our business, or subject TI to fines, penalties, or other legal liability; Product liability or warranty claims, claims based on epidemic or delivery failure, or other claims relating to TI products, manufacturing, services, design or communications, or recalls by TI customers for a product containing a TI part; Changes in the tax rate applicable to TI as the result of changes in tax law, the jurisdictions in which profits are determined to be earned and taxed, adverse resolution of tax audits, increases in tariff rates, and the ability to realize deferred tax assets; A loss suffered by a customer or distributor of TI with respect to TI-consigned inventory; Financial difficulties of distributors or their promotion of competing product lines to TI's detriment, or the loss of a significant number of distributors; Losses or curtailments of purchases from key customers or the timing and amount of distributor and other customer inventory adjustments; TI's ability to maintain or improve profit margins, including our ability to utilize our manufacturing facilities at sufficient levels to cover our fixed operating costs, in an intensely competitive and cyclical industry; TI's ability to maintain and enforce a strong intellectual property portfolio and maintain freedom of operation; or TI's exposure to infringement claims; Instability in the global credit and financial markets that affects TI's ability to fund our daily operations, invest in the business, make strategic acquisitions, or make principal and interest payments on our debt; Increases in health care and pension benefit costs; TI's ability to recruit and retain skilled engineering, management and technical personnel; TI's ability to successfully integrate and realize opportunities for growth from acquisitions, or our ability to realize our expectations regarding the amount and timing of restructuring charges and associated cost savings; and Impairments of TI's non-financial assets.\nFor a more detailed discussion of these factors, see the Risk Factors discussion in Item 1A of TI's most recent Form 10-K. The included in this release are made only as of the date of this release, and we undertake no the to reflect subsequent events or circumstances.\nAbout Texas Instruments\nTexas Instruments Incorporated (TI) is a global semiconductor design and manufacturing company that develops analog ICs and embedded processors. By employing the world's brightest minds, TI creates innovations that shape the future of technology. TI is helping approximately 100,000 customers transform the future, today. Learn more at www.ti.com .\nTI trademarks:\nDLP\nOther trademarks are the property of their respective owners.\nTXN-G\nView original content: http://www.prnewswire.com/news-releases/ti-reports-4q17-and-2017-financial-results-and-shareholder-returns-300586981.html\nSOURCE Texas Instruments Incorporated", "external_links": ["http://www.prnewswire.com/news-releases/ti-reports-4q17-and-2017-financial-results-and-shareholder-returns-300586981.html", "http://www.ti.com/"], "published": "2018-01-24T00:01:00.000+02:00", "crawled": "2018-01-24T00:54:56.000+02:00", "highlightTitle": ""}