{"organizations": [], "uuid": "c93029cff36049c7f50cfd2f32418ed9cd32dd43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219122216&w=1200&r=LYNXMPEE0215I", "site_section": "http://feeds.reuters.com/reuters/technologyNews/", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-alphabet-zagat/alphabets-google-explores-sale-of-restaurant-reviewer-zagat-sources-idUSKBN1ES1RZ", "country": "US", "domain_rank": 408, "title": "Alphabet's Google explores sale of restaurant reviewer Zagat: sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T21:16:00.000+02:00", "replies_count": 0, "uuid": "c93029cff36049c7f50cfd2f32418ed9cd32dd43"}, "author": "", "url": "https://www.reuters.com/article/us-alphabet-zagat/alphabets-google-explores-sale-of-restaurant-reviewer-zagat-sources-idUSKBN1ES1RZ", "ord_in_thread": 0, "title": "Alphabet's Google explores sale of restaurant reviewer Zagat: sources", "locations": [], "entities": {"persons": [{"name": "zagat", "sentiment": "negative"}, {"name": "paresh dave", "sentiment": "none"}, {"name": "liana b. baker", "sentiment": "none"}, {"name": "marissa mayer", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "negative"}, {"name": "google maps incorp", "sentiment": "none"}, {"name": "zagat", "sentiment": "none"}, {"name": "alphabet inc", "sentiment": "none"}, {"name": "yahoo inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 7:18 PM / Updated 16 hours ago Alphabet's Google explores sale of restaurant reviewer Zagat: sources Liana B. Baker , Paresh Dave 3 Min Read \n(Reuters) - Alphabet Inc’s Google is exploring a potential sale of Zagat, the U.S. restaurant review guide which the search giant bought for $151 million in 2011, people familiar with the matter said. \nA sale of Zagat would mark a course reversal for Alphabet’s once ambitious plans for the brand, spearheaded by former Google executive Marissa Mayer, who went on to become Yahoo Inc’s chief executive. Zagat gradually became less of a priority as Google focused on drawing traffic to its Google+ social network. \nGoogle has held informal talks in recent months with multiple companies about offloading Zagat, the sources said, asking not to be named because the matter is private. Any deal would likely involve the Zagat brand name and website, the sources added. \nGoogle’s asking price is not known, and there is no certainty it will agree to sell Zagat, the sources said. \nA spokeswoman for Google declined to comment. \nGoogle Maps incorporates Zagat reviews into its restaurant listings, and a small team at the company maintains Zagat.com, which features articles about restaurants in major cities. \nThe unit makes up just a fraction of Alphabet, a sprawling holding company whose units include Google and an array of unrelated pursuits in areas such as healthcare, self-driving cars and urban planning. \nFounded in 1979 by Tim and Nina Zagat, the eponymous service became known for its familiar burgundy pocket-sized guides to restaurants in cities around the world. Many establishments feature Zagat stickers on their doors and windows. \nOver the past year, Alphabet has been pruning its portfolio and shedding smaller non-core assets. \nLast June, Alphabet agreed to sell two robotics firms, Boston Dynamics and Tokyo-based Schaft to SoftBank Group Corp. Last February, it announced it would sell the satellite imaging business it acquired in 2014 for $500 million called Terra Bella, to Planet Labs, a San Francisco-based private satellite operator. \nAlphabet also explored selling Nest, a maker of Wi-Fi enabled thermostats, in 2016, Reuters reported. Reporting by Liana B. Baker and Paresh Dave in San Francisco; Additional reporting by Jessica Toonkel in New York and Julia Love in Mexico City; Editing by Susan Thomas", "external_links": [], "published": "2018-01-03T21:16:00.000+02:00", "crawled": "2018-01-04T00:16:21.047+02:00", "highlightTitle": ""}