{"organizations": [], "uuid": "2a8fcb77bfaf3cebf24097c75bcc22c44c63c386", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222063658&w=1200&r=LYNXMPEE0E08L", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/china-shipping-accident/black-smoke-billows-from-tanker-sinking-site-as-worry-grows-over-sea-damage-idINKBN1F40H1", "country": "US", "domain_rank": 408, "title": "Black smoke billows from tanker sinking site as worry grows over sea damage", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T07:57:00.000+02:00", "replies_count": 0, "uuid": "2a8fcb77bfaf3cebf24097c75bcc22c44c63c386"}, "author": "", "url": "https://in.reuters.com/article/china-shipping-accident/black-smoke-billows-from-tanker-sinking-site-as-worry-grows-over-sea-damage-idINKBN1F40H1", "ord_in_thread": 0, "title": "Black smoke billows from tanker sinking site as worry grows over sea damage", "locations": [], "entities": {"persons": [{"name": "josephine mason", "sentiment": "none"}, {"name": "yuka obayashi", "sentiment": "none"}], "locations": [{"name": "east china sea", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "sanchi", "sentiment": "none"}], "organizations": [{"name": "10th regional coast guard", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO/BEIJING (Reuters) - A stricken Iranian tanker that sank in the East China Sea on Sunday in the worst oil ship disaster in decades has produced a large oil slick, Chinese media and Japanese authorities said on Monday, as worries grew over damage to the marine ecosystem.\nThe tanker Sanchi (IMO:9356608) had been adrift and ablaze after crashing into the freighter CF Crystal (IMO:9497050) on Jan. 6. Strong winds had pushed it away from the Chinese coast, where the incident happened, and into Japan’s exclusive economic zone (EEZ).\nThe Japan Coast Guard said oil had spread over an area 13 km (8.1 miles) long and 11 km (6.8 miles) wide, although it said the slick was shrinking as patrol boats battled to contain it.\nThe Coast Guard said the fire on the sea surface was put out at around 0200 GMT on Monday, although according to other authorities and Chinese state TV CCTV black smoke continued to billow from the site of the sinking for several more hours.\nA clean-up effort has begun and rescue teams have called a halt to the large-scale search for survivors, reducing it to “normal” operations, CCTV said.\nThe Sanchi’s crew of 30 Iranians and two Bangladeshis are all believed to have perished in the incident, which marks the biggest tanker spill since 1991, when 260,000 tonnes of oil leaked off the Angolan coast.\nThe East China Sea is known for its rich, although already polluted, marine ecosystem that includes whales, porpoises and seabirds, said Rick Steiner, a U.S. marine scientist with experience of oil spills.\nGreenpeace said in a statement the explosion and sinking had occurred in “an important (fish) spawning ground”.\n“At this time of year the area is used as wintering ground by common edible species such as hairtail, yellow croaker, chub mackerel and blue crab. The area is also on the migratory pathway of many marine mammals, such as humpback whale, right whale and gray whale,” Greenpeace said.\nHIGHLY FLAMMABLE OIL The blazing vessel, which had been carrying 136,000 tonnes - almost one million barrels - of condensate, an ultra-light, highly flammable crude oil, sank on Sunday after several explosions weakened the hull.\nThe Shanghai Maritime Bureau, under China’s Ministry of Transport, said shortly before 0800 GMT on Monday there was no more heavy smoke at the scene.\nJapanese authorities lost track of the tanker as of 0840 GMT on Sunday, a spokesman for Japan’s Coast Guard said. The ship’s last confirmed location was about 315 km (195 miles) west of Sokkozaki on the island of Amami Oshima, one of the northern islands in the Ryukyu island chain that includes Okinawa.\nFlames and smoke from the Iranian oil tanker Sanchi is seen in the East China Sea, on January 15, 2018 in this photo provided by Japan's 10th Regional Coast Guard. 10th Regional Coast Guard Headquarters/Handout via REUTERS Japan sent two patrol boats and an airplane to the area to search for missing crew members and assess the latest situation, the Coast Guard spokesman said.\nThe Shanghai Maritime Bureau said these, along with a South Korean patrol boat, were among the vessels carrying out emergency response work on Monday.\nA Chinese salvage team on Saturday recovered two bodies from the tanker, China’s state news agency Xinhua reported. Another body, presumed to be one of the Sanchi’s sailors, was found on Jan. 8 and taken to Shanghai for identification.\nIranian officials said on Sunday the remaining 29 crew members and passengers of the tanker were presumed dead.\nThe salvage team recovered the Sanchi’s voyage data recorder, or “black box” from the bridge of the tanker, Xinhua said on Saturday. But the team was forced to leave the ship after just half an hour because the wind shifted and “thick toxic smoke” had complicated the operation.\nSlideshow (2 Images) “Finding the black box will be helpful for all parties in correctly determining the reasons for the accident,” Chinese foreign ministry spokesman Lu Kang said on Monday.\nLu said rescue and clean-up efforts had been a focus for China from the beginning, but that Beijing welcomed “other relevant parties” to participate in both the search and rescue and treatment work.\n“TIME IS OF THE ESSENCE”\nExperts worry the ship’s sinking is potentially more damaging to the marine ecosystem than letting the condensate oil burn off. The sinking will likely expel the remaining condensate and the tanker’s bunker fuel, or the heavy fuel oil that powers a ship’s engines, contaminating the surrounding waters.\nBunker fuel is the dirtiest kind of oil, extremely toxic when spilled, though less explosive. Condensate is poisonous to marine organisms.\n“As with all major oil spills, time is of the essence. This is particularly so with condensate spills, as the substance is so toxic and volatile,” said Steiner, the U.S. marine scientist.\nFuel oil is relatively easy to contain because volumes are lower and its viscosity means it is easier to extract from water, but even small volumes can harm marine life.\nA Suezmax tanker can hold a maximum of 5,000 tonnes of bunker fuel. The Sanchi may have been carrying about 1,000 tonnes by the time it hit the grain freighter CF Crystal, according to bunker fuel traders’ estimates.\n“As the fuel oil cools, it will become more viscous which will help to slow or even prevent leaks,” Greenpeace said. “In this scenario, it is possible that we will see chronic low volume leakage over a period of time at the seabed. Impact would remain relatively local.”\nReporting by Yuka Obayashi in TOKYO and Josephine Mason in BEIJING; Editing by Tom Hogue and Gareth Jones\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-15T07:57:00.000+02:00", "crawled": "2018-01-15T08:21:40.000+02:00", "highlightTitle": ""}