{"organizations": [], "uuid": "af7b180ac81ce82244aa5ad78d00bf1c9a5e3eee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 71, "shares": 71, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/08/19/103880864-GettyImages-587770230.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/trump-infrastructure-plan-here-is-a-preview.html", "country": "US", "domain_rank": 767, "title": "Trump infrastructure plan: Here is a preview", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-31T02:11:00.000+02:00", "replies_count": 0, "uuid": "af7b180ac81ce82244aa5ad78d00bf1c9a5e3eee"}, "author": "Kayla Tausche", "url": "https://www.cnbc.com/2018/01/30/trump-infrastructure-plan-here-is-a-preview.html", "ord_in_thread": 0, "title": "Trump infrastructure plan: Here is a preview", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "helen h. richardson", "sentiment": "none"}, {"name": "sergio hernandez", "sentiment": "none"}, {"name": "elon musk", "sentiment": "none"}], "locations": [{"name": "castle rock", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "denver post", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "During his maiden State of the Union speech, President Donald Trump is expected to made broad references to rebuilding America's infrastructure. The White House's aim is to pull back the curtain on its plan to address that agenda in mid-February, according to four White House officials, who discussed the draft proposal on the condition of anonymity.\nThe plan divides resources among six, broad principles:\nIncentives for cities and states to create dedicated revenue streams for their own projects Block grants for rural states, a portion of which officials say will be targeted toward broadband access Expansion of existing federal loan programs, namely through the Transportation Infrastructure Finance and Innovation Act (TIFIA) and the Railroad Rehabilitation & Improvement Financing (RRIF) program Transformative projects, like Elon Musk's Hyperloop, which officials say would require private financing Workforce development, programs that procure and retrain employees Permiting reform that shortens government approval for projects \"I am asking both parties to come together to give us the safe, fast, reliable, and modern infrastructure our economy needs and our people deserve,\" Trump will say in his State of the Union address, according to excerpts released hours before the speech.\nThe length of the plan to be released is still under consideration, with one estimate that it will run 10 to 15 pages. The White House wants to show its work for the last year, while avoiding the criticism it received upon the one-page, double-spaced release of its tax plan in April 2017. On the other hand, officials worry that providing too much detail would cause conversations to devolve into unproductive nitpicking.\nCongress will be tasked with channeling the White House principles and members' demands – without earmarks – into fully baked legislative text, all before the midterm election season dries up the legislative appetite.\nThe upfront price tag for the package continues to be $200 billion, paid for by siphoning funds from other federal agencies. One White House official suggested that figure would need to increase in order to secure support from Democrats, who have proposed a $1 trillion program paid for entirely by federal outlays.\nThe size of the total package is unclear, as it depends entirely on the ability of the federal government to leverage its own funding to extract investment from states, cities and the private sector.\nWhite House officials reference Los Angeles' \" Measure M \" as an example of the actions they want municipalities to take. Los Angeles voters in 2016 overwhelmingly backed a half-cent sales tax hike, expected to raise $120 billion over 40 years, to fund the expansion of the city's Metro system. Once a revenue stream is established, these officials say, the federal government would add an incentive on top.\n\"When it comes to the financing of projects, we want to ensure that the state and local governments which build, maintain, and own the bulk of infrastructure are better able to serve their communities through sustainably financed projects,\" said Lindsay Walters, White House deputy press secretary.\nPrivate sector involvement could be trickier, not least of which because the president's support of so-called public-private partnerships, or \"P-3s,\" has been middling. In several meetings with lawmakers and White House staff throughout the fall, Trump complained that public-private partnerships were ineffective. His complaint, based on prior experience as a developer: \"All you do is end up in court,\" according to multiple officials who have heard Trump express this view.\n\"Nothing [from the White House] will mandate public-private partnerships,\" one senior administration official said, though noting such transformative projects like the Hyperloop, were it pursued, would require such funding.\nDespite the president's waffling views on P3s, his optimism in the ability of the federal government to wrest investment from other sources was apparent when he unilaterally increased the total package size to $1.7 trillion, up from $1 trillion. Now other principals, such as Gary Cohn , are following suit, and saying that even more private money could be accessed if permitting becomes easier.\n\"He's going to talk about a trillion and a half dollars of investment, but more importantly, he's going to talk about streamlining the approval process on infrastructure,\" Cohn said on CNBC of the president's State of the Union address. \"There is plenty of money in the system, in the private sector, in different bonds that we left in the tax code to finance infrastructure to be built, the problem today is really the approval processes.\"\nCohn is one of four principals leading the effort, along with DJ Gribbin of the National Economic Council, Transportation Secretary Elaine Chao and presidential advisor Reed Cordish. Cohn and Chao have begun holding bipartisan meetings on Capitol Hill, where the legislative battle is expected to be fought uphill, unlike tax reform. Nine congressional committees and seven Cabinet agencies will be involved in crafting the bill, compared with two committees and one agency for tax reform.\nAnd the bill must to be bipartisan in nature, with 60 votes required in the Senate. Sen. John Barrasso, R-Wyo., told CNBC the initial discussions on the Environment and Public Works Committee have been positive.\n\"The reason I'm optimistic is, as chairman of this committee, I went and met with all the Republicans and Democrats,\" Barrasso said on CNBC's \" Squawk Box .\" \"We all know there are critical needs around the country for our infra to be competitive globally.\"", "external_links": [], "published": "2018-01-31T02:11:00.000+02:00", "crawled": "2018-01-31T02:11:10.005+02:00", "highlightTitle": ""}