{"organizations": [], "uuid": "cedaf25a3bbd5a50e9db572d9248c83dcfcdc9cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-regains-some-poise-after-china-dismisses-u-s-bonds-report-idUSL8N1P611S", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar regains some poise after China dismisses U.S. bonds report", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T17:17:00.000+02:00", "replies_count": 0, "uuid": "cedaf25a3bbd5a50e9db572d9248c83dcfcdc9cd"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-regains-some-poise-after-china-dismisses-u-s-bonds-report-idUSL8N1P611S", "ord_in_thread": 0, "title": "FOREX-Dollar regains some poise after China dismisses U.S. bonds report", "locations": [], "entities": {"persons": [{"name": "tommy wilkes", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "u.s. federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bloomberg news", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Concerns China could be slowing its U.S. debt buying ease\n* Dollar up 0.4 pct against yen after hitting 6-week low\n* Traders still see dollar weakness\n* Graphic: World FX rates in 2017 tmsnrt.rs/2egbfVh\nBy Tommy Wilkes\nLONDON, Jan 11 (Reuters) - The dollar recouped some of its recent losses on Thursday after China’s regulator dismissed a report that the country could halt its buying of U.S. treasuries, boosting the greenback following its biggest one-day fall in a month.\nThe dollar has been struggling to gain traction in the opening days of 2018 after losing around 10 percent against a basket of currencies last year as economic growth elsewhere, notably Europe, overtook the U.S.\nAnd while the U.S. Federal Reserve has been slowly tightening policy over the last two years, traders have been repricing market expectations of when Europe and Japan will follow suit.\nBloomberg News had reported on Wednesday that Chinese officials reviewing the country’s foreign exchange holdings had recommended slowing or halting purchases of U.S. Treasury bonds, pushing 10-year yields higher and the dollar lower.\nChina’s foreign exchange regulator said the report could be based on erroneous information, adding that the country was diversifying its forex to safeguard their value.\nThe dollar then rallied and was up 0.4 percent against the yen, although the U.S. currency is still down more than 1 percent against the yen this week after markets bet the Bank of Japan (BoJ) could start to tighten monetary policy faster than expected.\nAgainst a basket of currencies the dollar was up 0.2 percent on Thursday, off the previous day’s near three-month lows.\nMany analysts remain bearish.\n“We go into the year on the proviso that the while the dollar may have become a little oversold and due a moderate correction, we favour the dollar structural depreciation to extend,” Jeremy Stretch, currency strategist at London-based CIBC Capital Markets, told the Reuters Global Markets Forum.\n“While we favour another year of euro gains these will be less pronounced than in 2017. We do however favour yen outperformance as assume that investors have become overly complacent as regards BoJ policy.”\nThe dollar was flat against the euro, holding below the key level of $1.20 before the publication of the minutes of the last European Central Bank meeting in December, when policymakers held monetary policy unchanged.\nMarket sentiment seems tilted toward the dollar’s downside, said Masashi Murata, currency strategist for Brown Brothers Harriman in Tokyo.\n“Market reaction to dollar-buying factors has been subdued, while market reactions to dollar-selling, and yen-buying factors, have been more vivid,” Murata said.\nThe Canadian dollar weakened to its lowest level this year, before recovering, as worries of a U.S. withdrawal from the North American Free Trade Agreement moderated bets that the Bank of Canada will raise interest rates next week.\nThe Australian dollar touched its highest levels in nearly three months at $0.7887 after data showed that Australian retail sales recorded the biggest monthly rise in four years in November.\nBitcoin tumbled another 10 percent after South Korea said it would move to ban cryptocurrency trading. (Additional reporting by Masayuki Kitano in SINGAPORE and Kirsten Donovan in LONDON; Editing by Saikat Chatterjee and John Stonestreet)\n ", "external_links": ["http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T17:17:00.000+02:00", "crawled": "2018-01-11T17:06:22.014+02:00", "highlightTitle": ""}