{"organizations": [], "uuid": "53759c715694956da87c3ff3341138ac9bf08472", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180111.html", "section_title": "Archive News &amp; Video for Thursday, 11 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/india-oil-demand/update-1-indias-2017-oil-demand-growth-posts-lowest-gain-since-2013-idUSL4N1P63C8", "country": "US", "domain_rank": 408, "title": "UPDATE 1-India's 2017 oil demand growth posts lowest gain since 2013", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.29, "site_type": "news", "published": "2018-01-11T18:20:00.000+02:00", "replies_count": 0, "uuid": "53759c715694956da87c3ff3341138ac9bf08472"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/india-oil-demand/update-1-indias-2017-oil-demand-growth-posts-lowest-gain-since-2013-idUSL4N1P63C8", "ord_in_thread": 0, "title": "UPDATE 1-India's 2017 oil demand growth posts lowest gain since 2013", "locations": [], "entities": {"persons": [{"name": "nidhi verma singapore/new delhi", "sentiment": "none"}, {"name": "henning gloystein", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "morgan stanley", "sentiment": "negative"}, {"name": "thomson reuters eikon", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Demonetisation, tax increase hit consumption -Morgan Stanley\n* 2018 fuel demand outlook to improve - analysts\n* Indian car sales broke through 3 million for 1st time in 2017\n* But Indian car sales remain far below China’s (Adds 2017 car sales, 2018 outlook comment)\nBy Henning Gloystein and Nidhi Verma\nSINGAPORE/NEW DELHI, Jan 11 (Reuters) - Indian oil consumption in 2017 grew at its slowest in four years, according to government statistics, hit by the government’s demonetisation move and a tax increase that knocked the gain in fuel use back to a modest 2.3 percent.\nThe low growth also coincided with another year of weak, albeit improving, new vehicle sales.\nLast year’s oil demand was held back “by headwinds from demonetisation and a new goods and services tax,” U.S. bank Morgan Stanley said in a note to clients.\nIndia imports almost all of its oil, shipping in around 4.2 million barrels per day (bpd) of crude in 2017, according to trade flow data in Thomson Reuters Eikon.\n“Gasoline demand rose 7.4 percent, or 41,000 barrels per day, down from 12 percent growth in 2016 as demand was affected by demonetisation at the start of the year,” the bank said.\nIndia in late 2016 pulled all 500- and 1,000-rupee notes out of circulation, crimping retail and wholesale markets.\n“The demonetization exercise hit consumption, particularly in the first half of 2017. We are likely to see better growth this year,” said Sukrit Vijayakar, director at Indian energy consultancy Trifecta.\nIndia also saw some structural demand changes that affected the use of refined oil products.\nA government push for household to use more liquefied petroleum gas (LPG) has India challenging China as the world’s top LPG importer.\nThis has come at the cost of a straight 15-month decline in jet fuel and kerosene demand in India, Morgan Stanley said.\nAlso, “naphtha demand ... was down 8 percent for 2017 as a whole, possibly driven by more LPG use in petrochemicals,” it said.\nFor 2018, energy consultancy FGE expects India’s oil demand growth to improve to 4.3 percent.\n“India’s fuel demand will rebound in 2018 because of policy initiatives by the government and the country’s economic expansion,” said Senthil Kumaran, senior oil analyst at FGE.\n“Higher purchasing power of consumers along with rapid growth in rural infrastructure will drive two-wheeler and passenger car sales,” he said.\nSLOW BUT IMPROVING CAR SALES India’s slow oil demand growth has surprised many, given the country has often been touted as the next China in terms of rising oil consumption.\nYet the oil demand figures correlate with slow, albeit improving, growth in a related field: car sales.\nIndia’s new passenger car sales in 2017 broke through 3 million for the first time, reaching 3.23 million cars, according to the Society for Indian Automobile Manufacturers said on Thursday.\nThat means India broke a previous record of 2.8 million in annual new sales from 2012.\nThe figure, though, remains far below China’s new car sales of almost 3 million a month.\nThe low auto sales are partly explained by India’s annual per capita gross domestic product (GDP) being merely a fifth of China‘s. Fuels at Indian petrol stations are also much more expensive.\nIf an Indian citizen with an average salary buys 10 gallons of gasoline per month, that would represent nearly 30 percent of the person’s income, while the average Chinese would fork out just 5 percent, data from statistics company Numbeo showed.\nHowever, India’s lacklustre auto sales may pick-up as its economy continues to grow strongly, at over 6 percent per year .\nTrifecta’s Vijayakar said car and motorbike sales in India “have shown good growth in the last few months ... (and) should be better this year.”\nReporting by Henning Gloystein; Editing by Tom Hogue\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T18:20:00.000+02:00", "crawled": "2018-01-12T18:35:18.005+02:00", "highlightTitle": ""}