{"organizations": [], "uuid": "822c1babc4c606c58fc2ce0f789ef59309c08cbd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225136139&w=1200&r=LYNXMPEE0O0W2", "site_section": "http://feeds.reuters.com/reuters/UKInternetNews/", "section_title": "Reuters: Internet News", "url": "https://www.reuters.com/article/us-asos-outlook/asos-hits-fashion-sweet-spot-of-rising-online-demand-idUSKBN1FE1NB", "country": "US", "domain_rank": 408, "title": "ASOS hits fashion sweet spot of rising online demand", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T14:25:00.000+02:00", "replies_count": 0, "uuid": "822c1babc4c606c58fc2ce0f789ef59309c08cbd"}, "author": "", "url": "https://www.reuters.com/article/us-asos-outlook/asos-hits-fashion-sweet-spot-of-rising-online-demand-idUSKBN1FE1NB", "ord_in_thread": 0, "title": "ASOS hits fashion sweet spot of rising online demand", "locations": [], "entities": {"persons": [{"name": "jam", "sentiment": "positive"}, {"name": "davey", "sentiment": "none"}, {"name": "nick beighton", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "asos", "sentiment": "positive"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 12:26 PM / Updated 8 hours ago ASOS hits fashion sweet spot of rising online demand James Davey 4 Min Read \nLONDON (Reuters) - British online fashion retailer ASOS beat expectations for sales growth over Christmas and said it sees potential for e-commerce to expand to as much as 40 percent of all clothing sales in developed markets. \nAfter ASOS posted a 30 percent rise in retail sales for the last four months of 2017, Chief Executive Nick Beighton told reporters the retailer was ideally placed to tap in to a generation of consumers who increasingly shop on mobile phones and communicate via social media. \n“The highest penetrated market for fashion on e-commerce is South Korea at over 35 percent, the UK is around 25 percent and the United States is 24 percent,” he said. \n“I‘m expecting e-commerce penetration to at least get to around 40 percent in the major developed markets for fashion.” \nThe performance of ASOS and online peer Boohoo shows how the internet is reshaping the British retail landscape and the clothing sector in particular. \nThe pure internet players are outflanking and taking market share from traditional rivals burdened with big store estates. \nIn contrast to their stellar numbers, Marks & Spencer, Britain’s biggest clothing retailer by sales value, this month reported another fall in underlying revenue for the Christmas quarter, while rival Next managed only a small rise. RAPID EXPANSION \nEstablished in 2000 for fashion-conscious twenty-somethings, ASOS is Britain’s biggest e-commerce success story. \nIts retail sales were 790.4 million pounds ($1.13 billion) in the four months to Dec. 31 - ahead of analysts’ average forecast of growth of 27.4 percent. Retail gross margin was up 80 basis points year-on-year, despite a backdrop of heavy discounting across the wider market. \nASOS shares, which listed at 20 pence in 2001, have increased by a third over the last year, making it one of the most expensive stocks in the sector with a price/earnings (PE) ratio of 90. \nIt has a market capitalization of 5.76 billion pounds, some 860 million pounds more than the 134-year old Marks & Spencer. \nThe stock was up 2.4 percent at 7,036 pence at 1215 GMT, with enthusiasm tempered only by the fact it did not combine the sales beat with an upgrade to full 2017-18 year guidance. SPEED OF CHANGE \nASOS maintained guidance for total sales growth of 25-30 percent, with UK growth of around 16 percent. \n“Top-line outperformance looks likely, not just for (2017-18) but on a two-three year view, given the pace of innovation and continual improvements to the customer experience,” said analysts at Peel Hunt, who have a “buy” rating on the stock. \nASOS said UK sales increased 23 percent to 300.9 million pounds “in a challenging market”, while international sales were up 35 percent to 489.5 million pounds. \n“The velocity of change throughout our business is now breathtaking, particularly within technology,” said Beighton, noting that 80 percent of ASOS’s UK traffic over the four month period was through a mobile device. \nCompany trading updates, surveys and data this month have shown Britons are under pressure from slow wage growth and higher inflation. \nBeighton said it was inevitable UK sales growth would slow. “You can’t continue to have growth of 23 percent ad infinitum, the maths just don’t work,” he said. \n($1 = 0.7013 pounds)", "external_links": [], "published": "2018-01-25T14:25:00.000+02:00", "crawled": "2018-01-25T14:53:58.005+02:00", "highlightTitle": ""}