{"organizations": [], "uuid": "1eb6ed4f59a2186b71161aeac5cff11dd1460aaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224818237&w=1200&r=LYNXMPEE0N18T", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-iceh-murray/a-canadian-hockey-brat-drives-the-womens-game-in-korea-idUSKBN1FD1RT", "country": "US", "domain_rank": 408, "title": "A Canadian hockey brat drives the women's game in Korea", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T15:40:00.000+02:00", "replies_count": 0, "uuid": "1eb6ed4f59a2186b71161aeac5cff11dd1460aaa"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-iceh-murray/a-canadian-hockey-brat-drives-the-womens-game-in-korea-idUSKBN1FD1RT", "ord_in_thread": 0, "title": "A Canadian hockey brat drives the women's game in Korea", "locations": [], "entities": {"persons": [{"name": "jim paek", "sentiment": "none"}, {"name": "sarah murray", "sentiment": "none"}, {"name": "murray", "sentiment": "none"}], "locations": [{"name": "korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "connecticut", "sentiment": "none"}], "organizations": [{"name": "nhl", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 1:43 PM / in 8 hours A Canadian hockey brat drives the women's game in Korea Dan Burns 5 Min Read \nNORTH HAVEN, Connecticut (Reuters) - As the daughter of a former NHL coach and a two-time U.S. collegiate champion in her own right, Sarah Murray knows a thing or two about ice hockey and its culture. \nShe knows you “pinch” the boards with your body to keep a puck in the offensive zone. You jump over the boards for a fast line change. \nAnd you hang on to your stick and helmet during the national anthem. \nWhat is second nature to a Canadian like her, though, has sometimes been a foreign concept to the players she now coaches on the South Korean women’s hockey team. \nMurray, hired in 2014 by Stanley Cup winner Jim Paek, now the head of South Korean hockey, recalls her first world championship tournament behind the bench when her players dropped their sticks, helmets, even gloves to the ice as the national anthem started - a major taboo in the hockey world. \n“No one had taught them to do it differently. There’s a lot of pieces of hockey culture that they weren’t taught,” Murray said during a recent pre-Olympic U.S. tour. \n“The first year was a lot of learning as we go,” Murray said. “Now it’s a lot better. The team is very professional.” ON THE UP \nThe team is also a lot better at hockey. \nUnder Murray, South Korea has surged six spots to No. 22 in the world rankings. Last year, they won their division’s world title and earned a promotion. \nWhen she took over, her main goal was growing the sport in a country that has not taken much to ice hockey, especially not by women and girls. \nThe International Ice Hockey Federation counts just 319 female players in Korea, out of a total fewer than 3000. \n”It’s really difficult, the system in Korea,“ Murray said. ”Girls can play youth hockey, but there are no teams once they become teenagers. \n”They can practice with the boys teams, but they don’t get to play any games. So that’s not any fun. So then they quit. \n“Unless they make our team.” \nThe result is a squad with the oldest player, at 30, being roughly twice the age of her youngest teammates, who are 16. \n“They started with our team when they were 13 because they didn’t have anywhere else to go,” Murray said. \n”They were skilled enough that we knew that they had potential. So then we have 13-year-olds and 30-year-olds practicing on the same team. Sarah Murray, head coach of the South Korean women's ice hockey team, leads practice in Hamden, Connecticut, U.S., December 27, 2017. Picture taken December 27, 2017. REUTERS/Brian Snyder \n“It’s really ... interesting.” FROM HOGWARTS TO SEOUL \nMurray grew up in an ice hockey household. \nHer father Andy Murray is an IIHF Hall of Famer who coached the NHL’s Los Angeles Kings and St. Louis Blues and has had stints behind the bench with Canada, \nShe played at Shattuck-St. Mary‘s, a Minnesota prep school broadcaster ESPN once called the “Hogwarts of hockey.” Then she played defense on two national champion teams at the University of Minnesota Duluth. \nAfter college she played professionally in Switzerland before deciding to do something with her teaching degree and heading to a school in China. Slideshow (8 Images) \nEven there, hockey was never far away, and she was soon playing in a men’s “beer league” in Beijing. \n“I realized I had that fire still,” she said. \nShe headed to her father’s in Michigan, training to return to the Swiss pro ranks. \nWhile she was there, her father bumped into Paek at a wedding. He had just been named head of South Korean hockey and needed a women’s team coach. \nIn no time she found herself in an interview at the kitchen table. \nShe did not hear from Paek before returning to Switzerland for the start of her season, so thought she had missed the job before an email appeared. \n“It was my contract.” \nThe 29-year-old Murray is by far the youngest of the eight head coaches prepping their teams for the Olympics, but her final preparations have been thrown with the International Olympic Committee announcing a unified women’s team with the North would be formed. \nMurray told Reuters this week that the team had been placed in a “tough situation”, but she would just adapt. \nThe decision came after the team had reset their Olympic goals. Their previous aim was to emerge knowing they had done their utmost and with no regrets. \nBut after some battling performances on a recent U.S. tour, when they won one of their six games, now they have higher ambitions. \n”We didn’t talk about who we were going to beat or how many games we’re going to win,“ Murray said. ”We just wanted to advance. \n“That’s our goal now. So something challenging, that scares us.” Editing by Greg Stutchbury", "external_links": [], "published": "2018-01-24T15:40:00.000+02:00", "crawled": "2018-01-24T16:22:37.006+02:00", "highlightTitle": ""}