{"organizations": [], "uuid": "e4646ada57810a655b1cf196b0a87f63a94c3e3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/lecom-stocks/update-1-shares-of-chinas-leshi-plunge-10-pct-as-trading-resumes-idUSL4N1PJ1BH", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Shares of China's Leshi plunge 10 pct as trading resumes", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T04:02:00.000+02:00", "replies_count": 0, "uuid": "e4646ada57810a655b1cf196b0a87f63a94c3e3d"}, "author": "", "url": "https://www.reuters.com/article/lecom-stocks/update-1-shares-of-chinas-leshi-plunge-10-pct-as-trading-resumes-idUSL4N1PJ1BH", "ord_in_thread": 0, "title": "UPDATE 1-Shares of China's Leshi plunge 10 pct as trading resumes", "locations": [], "entities": {"persons": [{"name": "leshi", "sentiment": "none"}, {"name": "jia yueting", "sentiment": "none"}], "locations": [{"name": "leshi", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "shenzhen", "sentiment": "none"}], "organizations": [{"name": "leshi", "sentiment": "negative"}, {"name": "leshi internet information and technology", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "leeco", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "china post fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 2:02 AM / in 23 minutes UPDATE 2-Shares in China's Leshi plunge amid deepening woes at LeEco conglomerate Reuters Staff \n* Leshi shares drop daily limit of 10 pct after 9-mth suspension \n* Sunac hints it won’t pour more money into Leshi \n* Leshi seeking to recover debt from LeEco founder Jia (Recasts and adds Sunac comments) \nBy Sijia Jiang \nHONG KONG, Jan 24 (Reuters) - Shares in Leshi Internet Information and Technology plunged by their daily limit on Wednesday, the first of many expected declines as investors factor in a deepening crisis at the LeEco conglomerate it belongs to. \nThe resumption of trade after a nine-month suspension comes on the heels of news that the video streaming provider was seeking to recover debt from LeEco founder Jia Yueting by taking equity in his car businesses. \nIt also follows comment from property developer Sunac China , its second-biggest and controlling shareholder, that suggests Sunac is reluctant to pour further money into Leshi, the main listed vehicle for LeEco. \n“I will try my best and hope to leave no regret. But if it still can’t be helped, then so be it. Life is full of regrets,” Sunac Chairman Sun Hongbin told a Leshi investor briefing on Tuesday. \nSun, described as LeEco’s white knight when he announced a 15-billion yuan investment in the embattled group a year ago, added he was aware of the large amount of related transactions within LeEco before he decided to invest, but had wrongly assumed that account receivables would be paid. \nLeEco, a sprawling group with businesses ranging from online video to electric vehicles production, suffered a cash crunch from late 2016 after it expanded too fast. \nLeshi shares sank 10 percent immediately when they resumed trading in Shenzhen, dropping to 13.8 yuan, giving it a market value of 61.16 billion yuan ($9.6 billion). \nSeveral funds holding its shares, including China Post Fund, E Fund and Harvest Fund, have slashed their valuation of the stock to less than 4 yuan per share. That’s more than a 70 percent discount from the share’s closing price on April 14, 2017, the last trading session before the suspension. \nLeEco is burdened with loans and financial liabilities of around $1.5 billion. \nJia, who resigned as chairman in July and now lives in the United States, and various LeEco units owe Leshi 7.5 billion yuan, according to the Shenzhen-listed firm. He remains the largest shareholder in Leshi with a 25.67 percent stake, almost all of which has been pledged to financial institutions. \nLeEco did not respond to requests for comment. \nLeshi had asked in April for trading to be suspended pending an acquisition of LeEco’s film unit for 9.8 billion yuan ($1.53 billion), a plan it scrapped last week. \nDuring the trading halt, Leshi had been removed from several key indexes, including the blue-chip CSI300 Index and the start-up board index ChiNextp. Reporting by Donny Kwok and Sijia Jiang in Hong Kong and Luoyan Liu in Shanghai; Editing by Malcolm Foster", "external_links": [], "published": "2018-01-24T04:02:00.000+02:00", "crawled": "2018-01-24T08:13:29.000+02:00", "highlightTitle": ""}