{"organizations": [], "uuid": "ebf3dc31d3ba9ee3f09b47b4a009c3fd830f6b40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/01/fortune-logo.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/30/brainstorm-health-daily-01-30-18/", "country": "US", "domain_rank": 1196, "title": "Brainstorm Health: Amazon's Health Care Announcement, Pfizer Tax Gain, Telehealth and Medicare | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.032, "site_type": "news", "published": "2018-01-31T13:50:00.000+02:00", "replies_count": 0, "uuid": "ebf3dc31d3ba9ee3f09b47b4a009c3fd830f6b40"}, "author": "Sy Mukherjee", "url": "http://fortune.com/2018/01/30/brainstorm-health-daily-01-30-18/", "ord_in_thread": 0, "title": "Brainstorm Health: Amazon's Health Care Announcement, Pfizer Tax Gain, Telehealth and Medicare | Fortune", "locations": [], "entities": {"persons": [{"name": "sy", "sentiment": "neutral"}, {"name": "sy mukherjee", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "pfizer", "sentiment": "negative"}, {"name": "medicare", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "j.p. morgan chase", "sentiment": "none"}, {"name": "berkshire hathaway", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "11:50 AM EST \nGood morning, readers! This is Sy. \nThe big health care news of the day is that Amazon , the ubiquitous tech giant, is teaming up with J.P. Morgan Chase and Berkshire Hathaway to create a new nonprofit health care outfit to lower costs for their U.S. employees. While the details are relatively sparse right now, the independent company’s aim is to be “free from profit-making incentives and constraints” within health care, the three firms announced in a press release. \nCliff will share his thoughts on the announcement tomorrow. In the meantime, read on for the rest of the day’s news. Sy Mukherjee @the_sy_guy DIGITAL HEALTH \nWill this be the year telehealth finally opens the Medicare floodgates? A number of regulatory road bumps has prevented Medicare, the gigantic federal health program for elder Americans, from reimbursing for virtual doctor visits. But the industry is optimistic that this could be the year those bumps are flattened as a flurry of telemedicine-related bills are debated in Congress, including provisions that would allow for interstate charging and creating parity between physical doctor consultations and digital ones. ( Reuters ) INDICATIONS \nPfizer gains $11 billion from Trump tax cuts. Pfizer blew away analyst expectations in its fourth quarter 2017 earnings report. One massive factor in the upbeat numbers? The new tax law, which gave the Viagra maker an $11 billion-plus gain. Pfizer also announced that it would be repatriating billions in foreign cash and investing about $5 billion on U.S. operations, including manufacturing; CEO Ian Read has been a longtime proponent of tax reform. ( Fortune ) THE BIG PICTURE \nHealth system mergers hit a record high in 2017. A new report from consulting firm Kaufman Hall finds that there were 115 hospital deals last year, making 2017 an all-time high water mark for health system consolidation. Many of the deals were large in scope, underscoring the reality that hospitals have found it necessary to scale up in order to remain competitive. But one critical question is: Will such consolidation actually boost patient outcomes? ( Star Tribune ) REQUIRED READING ", "external_links": [], "published": "2018-01-31T13:50:00.000+02:00", "crawled": "2018-01-31T00:45:20.030+02:00", "highlightTitle": ""}