{"organizations": [], "uuid": "eab4bf783a8c94cacf51a51db0a4c300404477bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-marlin-equity-partners-acquires-majority-stake-in-talkwalker-to-drive-global-growth.html", "country": "US", "domain_rank": 767, "title": "Marlin Equity Partners Acquires Majority Stake in Talkwalker to Drive Global Growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-11T16:00:00.000+02:00", "replies_count": 0, "uuid": "eab4bf783a8c94cacf51a51db0a4c300404477bc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-marlin-equity-partners-acquires-majority-stake-in-talkwalker-to-drive-global-growth.html", "ord_in_thread": 0, "title": "Marlin Equity Partners Acquires Majority Stake in Talkwalker to Drive Global Growth", "locations": [], "entities": {"persons": [{"name": "talkwalker", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "talkwalker", "sentiment": "none"}, {"name": "luxembourg", "sentiment": "none"}], "organizations": [{"name": "marlin equity partners acquires majority stake", "sentiment": "negative"}, {"name": "marlin equity partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LUXEMBOURG and NEW YORK, Jan. 11, 2018 /PRNewswire/ -- Talkwalker , a leading global listening and analytics company, is pleased to announce that a majority stake in the company has been acquired by Marlin Equity Partners (\"Marlin\"), a global private equity firm with over $6.7 billion of capital under management. The acquisition allows the software company to leverage Marlin's operational resources and expertise in growing technology businesses. Talkwalker's founders and management team will continue to lead the company during this exciting new stage of growth, with a focus on accelerating product innovation and international expansion.\nUtilized by over 1,000 clients, Talkwalker's state-of-the-art multi-tenant cloud platform uses AI-powered technology to analyze images and text in 187 languages across social, online and traditional media. The company's social listening and analytics software allows brands and agencies to prove the impact of their communication efforts through real-time analytics across all channels, putting customers in full control of performance measurement, brand reputation and promotion.\n\"We are excited to partner with Marlin as we enter a new phase of development as the leading provider of listening and analytics to the PR and marketing industry,\" said Robert Glaesener, CEO of Talkwalker. \"Our focus on AI-powered features, global expansion and strategic acquisitions should provide our clients with a major competitive edge and ensures that they have access to the best technology on the market to protect, measure and promote their brands worldwide.\"\nTalkwalker anticipates growing its international footprint beyond its four existing offices in Luxembourg, New York, San Francisco and Frankfurt, with plans to add 100 new employees during this expansion process. Accelerating the development of the company's AI and machine learning capabilities also remains a priority. With further enhancements to recent innovations such as image recognition and advanced sentiment analysis already in the pipeline, Talkwalker is set to revolutionize the communication industry's ability to monitor brand reputation and measure performance.\n\"The social media analytics market is continuing to experience significant tailwinds as a rising number of users adopt social media and an increased share of advertising spend shifts towards social media platforms,\" said Shawn McMorran, a partner at Marlin. \"Talkwalker's solutions are at the forefront of connecting customers' social initiatives with real-time business insights and we look forward to helping the company accelerate its growth by pursuing both organic and inorganic expansion opportunities, while continuing to deliver exceptional service and value to existing customers and partners.\"\nEY, Tenzing Partners and Arendt & Medernach provided support to Talkwalker during the acquisition process.\nAbout Talkwalker\nTalkwalker is a listening and analytics company that empowers over 1,000 brands and agencies to optimize the impact of their communication efforts. The company provides businesses with an easy-to-use platform to protect, measure and promote their brands worldwide, across all communication channels. Talkwalker's state-of-the-art social media analytics platform monitors and analyzes online conversations on social networks, news websites, blogs and forums in 187 languages. The company is headquartered in Luxembourg and has offices in New York City, San Francisco, and Frankfurt. For more information, please visit www.talkwalker.com . Talkwalker is also the home of Talkwalker Alerts and", "external_links": ["http://www.talkwalker.com/", "https://www.talkwalker.com/", "https://www.talkwalker.com/alerts"], "published": "2018-01-11T16:00:00.000+02:00", "crawled": "2018-01-11T19:55:01.000+02:00", "highlightTitle": ""}