{"organizations": [], "uuid": "845dcb6d97ae4fef754fe7123c2ab1d2de168771", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222669330&w=1200&r=LYNXMPEE0G0G9", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-eurozone-germany-institutes/economists-call-for-overhaul-of-euro-zone-creation-of-joint-safe-assets-idUSKBN1F60UR", "country": "US", "domain_rank": 408, "title": "Economists call for overhaul of euro zone, creation of joint safe assets", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.163, "site_type": "news", "published": "2018-01-17T16:42:00.000+02:00", "replies_count": 0, "uuid": "845dcb6d97ae4fef754fe7123c2ab1d2de168771"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-eurozone-germany-institutes/economists-call-for-overhaul-of-euro-zone-creation-of-joint-safe-assets-idUSKBN1F60UR", "ord_in_thread": 0, "title": "Economists call for overhaul of euro zone, creation of joint safe assets", "locations": [], "entities": {"persons": [{"name": "angela merkel", "sentiment": "none"}, {"name": "mario centeno", "sentiment": "none"}, {"name": "peter altmaier", "sentiment": "none"}, {"name": "bruno le maire", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "berlin", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 8:42 AM / Updated 4 minutes ago Economists call for overhaul of euro zone, creation of joint 'safe assets' Michael Nienaber 4 Min Read \nBERLIN (Reuters) - Leading economists from France and Germany on Wednesday weighed in on the politically heated debate about making the euro zone more resilient during any future crises by calling for new fiscal rules and the creation of a virtual euro-area “safe asset”. \nThe proposals are meant to bridge German demands for more fiscal discipline and France’s insistence on more risk-sharing as the euro zone’s two largest economies try to inject new momentum into their stalled efforts to reform the bloc. \n“These reform efforts can only succeed if Germany and France pull together,” said Marcel Fratzscher from the DIW economic institute, one of the authors of the 33-page policy paper. “2018 is the year in which these reforms must be tackled.” \nThe question of how to improve governance of the 19-member single currency bloc will also be discussed when Germany’s acting finance minister, Peter Altmaier, welcomes the new Eurogroup president, Mario Centeno, for talks in Berlin on Wednesday. \nAltmaier, one of Chancellor Angela Merkel’s closest allies, will then travel to Paris for talks with his French counterpart, Bruno Le Maire on Thursday. \nThe 14 economists from France and Germany call for an overhaul of euro area fiscal rules, the creation of an independent fiscal watchdog, a joint euro zone fund and a new, synthetic “safe asset” that offers investors an alternative to sovereign bonds. \nIt would effectively be a derivative of weighted sovereigns. \n“Implementing these reforms would be a game-changer for the euro zone, significantly improving its financial stability, political cohesion and potential for delivering prosperity to its citizens, all while addressing the priorities and concerns of the participating countries,” the economists said. \n“Our leaders should not settle for less,” said the experts, who include Ifo institute president Clemens Fuest and Jean Pisani-Ferry, a former adviser to French President Emmanuel Macron. \nThe economists want to replace current fiscal rules, which focuses on the structural deficit, by an expenditure rule and a long-term debt-reduction target. \n“A rule of this type is both less error-prone than the present rules and more effective in stabilizing economic cycles, since cyclical changes in revenue do not need to be offset by changes in expenditure,” the group said. \nThey recommended that compliance with the new fiscal rules should be monitored by national watchdogs that would be supervised by an independent euro zone institution. CHALLENGE FOR GERMANY \nThe idea of a synthetic euro zone bond is likely to draw a rebuff from Chancellor Angela Merkel’s conservatives, who are skeptical about creating new tools for more risk-sharing. \nBut the economists insisted that introducing such assets in parallel with a regulation on limiting sovereign concentration risk would help “smooth the transition away from excessive concentration on home-country government bonds”. \n“It will be a challenge for the German government to reach a point where one is ready to implement the full concept and not only some elements that alone would not work,” Fuest said. \nMerkel’s conservatives and the center-left Social Democrats last week agreed on the blueprint for a governing coalition. The draft raises the prospect of an “investment budget” for the single currency bloc, a nod to Macron’s call for a budget to help the euro zone cope with external economic shocks. \nIt also calls for the ESM bailout mechanism to be turned into a full-blown European Monetary Fund under parliamentary control and anchored in EU law. \nCenteno called the euro zone reform proposals agreed by Germany’s two biggest parties “very encouraging” and urged Merkel’s conservatives and the SPD to quickly agree on a full-scale coalition deal. \n“Europe needs the government as soon as possible,” Centeno told the business newspaper Handelsblatt in an interview published before his meeting with Altmaier. Reporting by Michael Nienaber; Editing by Jeremy Gaunt, Larry King", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T16:42:00.000+02:00", "crawled": "2018-01-17T10:48:34.009+02:00", "highlightTitle": ""}