{"organizations": [], "uuid": "0070c121689a08d5ad33891f135b0699bb700d19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/03/104818958-RTS1IAL2.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2017/12/31/tech-trends-for-2018-from-helpful-robots-to-voice-controlled-tvs.html", "country": "US", "domain_rank": 767, "title": "Tech trends for 2018: From helpful robots to voice-controlled TVs", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.022, "site_type": "news", "published": "2018-01-01T22:00:00.000+02:00", "replies_count": 0, "uuid": "0070c121689a08d5ad33891f135b0699bb700d19"}, "author": "Erin Barry", "url": "https://www.cnbc.com/2017/12/31/tech-trends-for-2018-from-helpful-robots-to-voice-controlled-tvs.html", "ord_in_thread": 0, "title": "Tech trends for 2018: From helpful robots to voice-controlled TVs", "locations": [], "entities": {"persons": [{"name": "alexa", "sentiment": "negative"}, {"name": "anthony ha of techcrunch", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "amazon echo", "sentiment": "positive"}, {"name": "google", "sentiment": "positive"}, {"name": "amazon echos", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "mayfield robotics", "sentiment": "none"}, {"name": "forrester research", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\"Alexa, I'm home!\"\nSmart speakers like Amazon Echo and Google Home exploded in popularity in 2017, and we can expect households to continue getting \"smarter\" in 2018.\nEleven million Amazon Echos were sold in 2016, and that number is expected to double when the final numbers come in for 2017, according to Forrester Research . The firm also predicts that by 2022, more than 66 million households in the U.S., that's 50 percent of households, will have a smart speaker. \nHome Robots As people become more and more accustomed to talking to a smart speaker device, experts say we can expect to see companies experiment with robots that blur the line between a fun toy and a helpful hand around the house.\n\"They can look up pieces of information like your smart speaker, they can take photographs, and I think maybe you're going to start to see them edge into security, but I think that's a very much an open question,\" Anthony Ha of TechCrunch told CNBC's On the Money.\nOne company that's working on a home robot is Mayfield Robotics. The company plans to roll out a Kuri next spring for $899.\n\"The Kuri robot, they're doing kinds of computer vision. So they can tell not just who you are, but when this is a fun family activity and 'Let's snap a photo of this because you are probably going to want to capture this,\" said Ha.\nEssentially, this means everyone can be in the picture in the moment and not have to worry someone stepping out to capture it.\nWireless Charging 2.0 We all know that dreaded anxious feeling when your smartphone battery turns red.\nFor one thing, you have to find an available charger, and once you do that, the phone is now stuck in one spot while it gets a boost of power.\nBut that might be starting to change.\nJust last month the FCC approved technology from two companies, Energous and PowerCast , to wirelessly power devices over the airwaves. \n\"If you're sitting within a certain range of a transmitter, you can be doing whatever on your phone and it's pulling power over the air from this transmitter,\" Chris Velazco of Engadget told CNBC.\nThe companies are expected to showcase their technology at the Consumer Electronics show in January . \nLong-Lasting Laptops This year, major manufacturers including Asus, HP, and Lenovo are about to roll out \"Always-Connected PCs\" that promise to deliver 20 hours of battery life. The laptops will use a Qualcomm Snapdragon processor, similar to the kind used in Android smartphones.\nSo why would someone want this instead of iPad?\n\"It really boils down to two things, familiarity and compatibility,\" explained Velazco.\nFor someone who is used to Windows, this \"gives you the flexibility to use the platform you've always been using.\"\nIn addition, Velazco said, \"For someone like me, I travel with a lot of USB dongles and SD cards and I can't get that into my iPad - but I can plug it into one of these [laptops] just fine.\"\nSmarter TVs As technology keeps forging forward, smart TVs are only going to get smarter.\n\"I think one of the big themes this year will be the integration with Google Assistant and Amazon Alexa – and TVs are going to be one place you'll see that happen,\" said TechCrunch's Ha.\nFor example, the Sony Bravia will allow you to have hands-free control using either an Amazon Alexa enabled device or Google Home. \nAnd Samsung is getting into the fold as well. The company will be adding its smart voice assistant Bixby to its TVs. \nOn the Money airs on CNBC Saturdays at 5:30 am ET, or check listings for air times in local markets.", "external_links": [], "published": "2018-01-01T22:00:00.000+02:00", "crawled": "2018-01-01T22:01:43.002+02:00", "highlightTitle": ""}