{"organizations": [], "uuid": "80254dfc2a0bef276262393d8a76c32fad7b281b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-china-new-borun-announces-receipt-of-preliminary-non-binding-going-private-proposal.html", "country": "US", "domain_rank": 767, "title": "China New Borun Announces Receipt of Preliminary Non-binding Going Private Proposal", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T15:10:00.000+02:00", "replies_count": 0, "uuid": "80254dfc2a0bef276262393d8a76c32fad7b281b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-china-new-borun-announces-receipt-of-preliminary-non-binding-going-private-proposal.html", "ord_in_thread": 0, "title": "China New Borun Announces Receipt of Preliminary Non-binding Going Private Proposal", "locations": [], "entities": {"persons": [{"name": "wang", "sentiment": "none"}, {"name": "jinmiao wang", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "king river", "sentiment": "none"}, {"name": "british virgin island", "sentiment": "none"}], "organizations": [{"name": "china new borun corporation", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "king river holding limited", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING, Jan. 10, 2018 /PRNewswire/ -- China New Borun Corporation (NYSE: BORN) (the \"Company\"), a leading producer and distributor of corn-based edible alcohol in China, today announced that its Board of Directors (the \"Board\") has received a non-binding proposal letter, dated January 10, 2018, from Mr. Jinmiao Wang (\"Mr. Wang\"), Chief Executive Officer and Chairman of the Board, and King River Holding Limited (\"King River\"), a British Virgin Island company and a majority shareholder of the Company, proposing a \"going-private\" transaction to acquire all of the outstanding ordinary shares of the Company not already owned by Mr. Wang or King River for US$1.67 in cash per American depositary share (\"ADS\"), or US$1.67 per ordinary share, which represents approximately 32.6% above the average closing price of the Company's ADSs over the last 30 trading days up to and including January 9, 2018. A copy of the proposal letter is attached as Annex A to this press release.\nThe Board intends to form a special committee consisting of independent directors to consider this proposal. The Company cautions its shareholders and others considering trading in its securities that the Board only recently received the non-binding proposal letter and no decisions have been made with respect to the Company's response to the proposal. There can be no assurance that any definitive offer will be made, that any agreement will be executed or that this or any other transaction will be approved or consummated. The Company does not undertake any obligation to provide any updates with respect to this or any other transaction, except as required under applicable law.\nAbout China New Borun Corporation\nThe Company is a leading producer and distributor of corn-based edible alcohol sold as an ingredient to producers of baijiu, a popular grain-based alcoholic beverage in China. The Company also produces DDGS Feed, liquid carbon dioxide and crude corn oil as by-products of edible alcohol production, and CPE that is widely used in chemical industries. China New Borun is based in Shouguang, Shandong Province. Additional information about the company can be found at http://www.chinanewborun.com and in documents filed with the U.S. Securities and Exchange Commission, which are available on the SEC's website at http://www.sec.gov .\nForward-looking Statements\nAll statements included in this press release, other than statements or characterizations of historical fact, are forward-looking statements. These forward-looking statements are based on our current expectations, estimates and projections about our industry, management's beliefs, and certain assumptions made by us, all of which are subject to change. Forward-looking statements can often be identified by words such as \"anticipates,\" \"expects,\" \"intends,\" \"plans,\" \"predicts,\" \"believes,\" \"seeks,\" \"estimates,\" \"may,\" \"will,\" \"should,\" \"would,\" \"could,\" \"potential,\" \"continue,\" \"ongoing,\" similar expressions, and variations or negatives of these words. These forward-looking statements are not guarantees of future results and are subject to risks, uncertainties and assumptions that could cause our actual results to differ materially and adversely from those expressed in any forward-looking statement.\nContact Information\nAsia Bridge Capital Limited\nMichael Tieu\nPhone: +86-10-8556-9033 (China)\n+1-888-870-0798 (U.S.)\nEmail: Michael.tieu@asiabridgegroup.com\nANNEX A\nJanuary 10, 2018\nThe Board of Directors\nChina New Borun Corporation\nBohai Industrial Park, Yangkou Town, Shouguang, Shandong 267215\nThe People's Republic of China\nDear Sirs:\nWe, Jinmiao Wang (\" Mr. Wang \"), Chief Executive Officer and Chairman of the Board of Directors of China New Borun Corporation (the \" Company \") and King River Holding Limited, a British Virgin Island company (\" King River \", together with Mr. Wang, collectively, the \" Consortium Members \", and the consortium so formed, the \" Consortium \"), are pleased to submit this preliminary non-binding proposal to acquire all outstanding ordinary shares of the Company (\" Shares \") not already owned by the Consortium Members in a going private transaction (the \" Transaction \"), as described below.\nWe believe that our proposal provides a very attractive opportunity to the Company's shareholders. Our proposal represents a 21.0% premium to the closing price on the last trading day prior to the date of this proposal and a premium of 32.6% to the average closing price during the last 30 trading days.\n1. Consortium. The Consortium Members will form an acquisition company for the purpose of implementing the Transaction, and have agreed to work with each other exclusively in pursuing the Transaction.\n2. Purchase Price. Our proposed consideration payable for the Shares acquired in the Transaction will be US$1.67 per Share, or US$1.67 per American Depositary Share of the Company (\" ADS \", each representing one Share), in cash (in each case other than those ADSs or Shares held by the Consortium Members that may be rolled over in connection with the Transaction).\n3. Funding. We intend to finance the Transaction with a combination of debt and equity capital. Equity financing is expected to be provided in the form of rollover equity in the Company from the Consortium Members and cash contributions from the Consortium Members and, potentially, third party sponsors. Debt financing is expected to be provided by loans from financial institutions or third party sponsors. We are confident that we can timely secure adequate financing to consummate the Transaction.\n4. Due Diligence. Given the role of Mr. Wang with the Company and existing ownership interest of the Consortium Members, we expect the diligence needs will be quite limited. We expect that our financing sources will require a timely opportunity to conduct customary due diligence on the Company. We would like to ask the Board of Directors of the Company (the \" Board \") to accommodate such due diligence request and approve the provision of confidential information relating to the Company and its business to possible sources of equity and debt financing subject to confidentiality agreements with customary terms. We believe that we will be in a position to complete customary legal, financial and accounting due diligence for the Transaction in a timely manner and in parallel with discussions on the Definitive Agreements (as defined below).\n5. Definitive Agreements. We are prepared to promptly negotiate and finalize definitive agreements (the \" Definitive Agreements \") providing for the Transaction and related transactions. These documents will provide for representations, warranties, covenants and conditions which are typical, customary and appropriate for transactions of this type.\n6. Process. We believe that the Transaction will provide superior value to the Company's shareholders. We recognize that the Board will evaluate the Transaction independently before it can make its determination to endorse it. Given the involvement of Mr. Wang, the Chief Executive Officer of the Company, and King River, a major shareholder of the Company, in the Transaction, we expect that that the Board will appoint a special committee of independent directors to consider this proposal and make a recommendation to the Board based on its independent evaluation of the proposal.\nIn considering our offer, you should be aware that the Consortium Members are interested", "external_links": ["http://www.chinanewborun.com/", "http://www.sec.gov/", "http://www.prnewswire.com/news-releases/china-new-borun-announces-receipt-of-preliminary-non-binding-going-private-proposal-300580652.html"], "published": "2018-01-10T15:10:00.000+02:00", "crawled": "2018-01-10T16:17:56.000+02:00", "highlightTitle": ""}