{"organizations": [], "uuid": "9c99b80ab141039e81baf4e960898cd4907f5bb3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-breakthrough-start-up-attune-medical-receives-510k-clearance-from-fda-new-device-for-feeding-and-medication-administration.html", "country": "US", "domain_rank": 767, "title": "Breakthrough Start-up Attune Medical Receives 510(k) Clearance from FDA: New Device for Feeding and Medication Administration Using Standardized Connector and EnsoETM", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.634, "site_type": "news", "published": "2018-01-08T18:30:00.000+02:00", "replies_count": 0, "uuid": "9c99b80ab141039e81baf4e960898cd4907f5bb3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-breakthrough-start-up-attune-medical-receives-510k-clearance-from-fda-new-device-for-feeding-and-medication-administration.html", "ord_in_thread": 0, "title": "Breakthrough Start-up Attune Medical Receives 510(k) Clearance from FDA: New Device for Feeding and Medication Administration Using Standardized Connector and EnsoETM", "locations": [], "entities": {"persons": [], "locations": [{"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "fda", "sentiment": "neutral"}, {"name": "new device for feeding and medication administration", "sentiment": "neutral"}, {"name": "attune medical", "sentiment": "neutral"}, {"name": "us food and drug administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO--(BUSINESS WIRE)-- Medical device firm Attune Medical has received 510(k) clearance from the US Food and Drug Administration (FDA) for a new EnsoETM TM model capable of administering tube feeds and/or medication while simultaneously cooling or warming patients using the esophageal space.\nThe newly-cleared model of EnsoETM, which manages patient temperature through the esophagus, allows for enteral fluid administration with the ENFit ® connector while managing the important task of temperature management through the patient’s core. With this new extension of the EnsoETM product line, the need for a separate feeding tube is eliminated, and clinicians can leverage the EnsoETM for comprehensive temperature management as well as gain compliance with an increasingly accepted standard of care using the ENFit connector.\n“Attune Medical is focused on developing innovative targeted temperature management products with increasingly useful clinical features such as this new capability to administer tube feeds and medication through our device, all while delivering a safe, cost-effective and now more comprehensive alternative to other targeted temperature management options,” commented Attune Medical’s Chief Executive Officer Keith Warner.\nMaria Gray, VP of Clinical Services, noted, “The new EnsoETM with EnFit connection will offer customers a seamless way to adhere to increasing worldwide standardization toward a fail-safe approach to interfacing patients with feeding and medicinal support designed to prevent tubal misconnection.”\nFormerly known as Advanced Cooling Therapy, Attune Medical has developed proprietary medical device technology that simplifies access to the patient’s core to efficiently control core temperature. Whether warming or cooling, the company’s technology platform optimizes, or “tunes,” patient temperature safely and effectively. Attune’s initial product, the EnsoETM (formerly Esophageal Cooling Device or ECD), is designed to modulate and control patient temperature through a single-use, fully-enclosed system that is inserted into the esophagus. Two lumens attach to an external heat exchange unit while a third, independent, lumen simultaneously allows gastric decompression, drainage, or the administration of enteral fluids such as tube feeds and medications. The EnsoETM can be rapidly placed by most trained healthcare professionals, in similar fashion to a standard gastric tube, and can be used to control patient temperature in the operating room, recovery room, emergency room, and/or intensive care unit. No other products on the market are cleared for use in the esophageal environment for whole-body temperature modulation.\nAttune Medical (as Advanced Cooling Therapy) received US FDA de novo clearance for the EnsoETM (Esophageal Cooling Device or ECD) in 2015 for use with the Medi-Therm III by Stryker ® . The company received FDA 510(k) clearance in 2016 for use with the Blanketrol ® II and III Hyper-Hypothermia systems made by Cincinnati Sub-Zero, a Gentherm Company, and FDA 510(k) clearance for use with the Altrix System by Stryker ® in 2017. It received its CE Mark in Europe in 2014, with an expanded indication for use up to 120 hours in 2016 and a CE Mark for use with the Altrix System by Stryker ® in 2017. It is also licensed for sale in Canada and Australia.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108006151/en/\nfor Attune Medical\nLisa Owens, 210-601-6647\nlisammowens@gmail.com\nSource: Attune Medical", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.attune-medical.com&esheet=51739552&newsitemid=20180108006151&lan=en-US&anchor=Attune+Medical&index=1&md5=a4c72dce040cf081b4003a3e4de55b71", "http://www.businesswire.com/news/home/20180108006151/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fbit.ly%2F2F5zKhD&esheet=51739552&newsitemid=20180108006151&lan=en-US&anchor=ENFit%C2%AE+connector&index=2&md5=861ad8cbafb39bfc3a2110dabba16445"], "published": "2018-01-08T18:30:00.000+02:00", "crawled": "2018-01-08T21:15:26.012+02:00", "highlightTitle": ""}