{"organizations": [], "uuid": "b02ccf56f7defa08a463a67818e835e6e9b72652", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225481868&w=1200&r=LYNXMPEE0P0SD", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/colgate-results/colgate-palmolive-quarterly-sales-miss-estimates-idINKBN1FF1LQ", "country": "US", "domain_rank": 408, "title": "Colgate-Palmolive quarterly sales miss estimates", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T14:55:00.000+02:00", "replies_count": 0, "uuid": "b02ccf56f7defa08a463a67818e835e6e9b72652"}, "author": "", "url": "https://in.reuters.com/article/colgate-results/colgate-palmolive-quarterly-sales-miss-estimates-idINKBN1FF1LQ", "ord_in_thread": 0, "title": "Colgate-Palmolive quarterly sales miss estimates", "locations": [], "entities": {"persons": [{"name": "sangameswaran", "sentiment": "none"}, {"name": "maju samuel", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "colgate-palmolive", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "colgate-palmolive co", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Colgate-Palmolive Co’s ( CL.N ) shares sank on Friday after the company reported lower-than-expected quarterly sales despite spending more on advertising and cutting prices to spur enough demand.\nThe world’s largest toothpaste maker said gross margins fell to 59.8 percent in the fourth quarter from 60.4 percent a year earlier, hit by higher costs for raw materials and packaging.\nColgate said it expects sales growth in 2018 but the forecast did nothing to shake the impression of stagnation that has dogged Colgate and other consumer goods producers in the past year.\nIts shares slumped 6 percent to $72.82, setting them up for their worst day in more than seven years.\nWhile the S&P 500 has risen more than 50 percent in the past year, Colgate shares are up less than 15 percent and the company has missed sales estimates in five of the past six quarters.\nOrganic sales improved sequentially, but the rate of improvement was less than expected, the company said in a post-earnings conference call.\n“Today’s results once again show that Colgate remains vulnerable to macro uncertainty and operational challenges,” Wells Fargo analyst Bonnie Herzog wrote in a note.\nOrganic sales growth of above 2 percent was below our consensus of 3 percent to 3.4 percent, Bonnie Herzog added.\n“Overall we view Colgate’s results as disappointing with the company missing on organic growth for the fifth quarter in a row,” Deutsche Bank markets Research analyst Steve Powers said.\nFor 2018, Colgate forecast mid-single digit percentage net sales growth and low- to mid-single-digit organic sales growth, and double-digit earnings per share growth.\nIn most markets, Colgate lowered prices as much as 2 percent to drive sales and volume.\nIts worldwide advertising spending rose 24 percent to $369 million in the fourth quarter, the company said, adding that it planned to boost ad spending further in 2018.\nThose increased outlays have taken a toll on operating profit, which was down nearly 3 percent overall and in all of the company’s global geographical segments with the exception of Europe.\nChief Executive Ian Cook said the global market in the company’s core dental-care business remained “challenging”.\nSales rose 4.5 percent to $3.9 billion in the fourth quarter ended Dec. 31, compared with the average analyst estimate of $3.92 billion.\nNet income nearly halved to $323 million, or 37 cents per share, largely due to a $275 million charge from changes to the U.S. tax code.\nProfit, excluding charges, was 75 cents per share, in line with analysts’ estimates.\nReporting by Sangameswaran S in Bengaluru; Editing by Maju Samuel and Saumyadeb Chakrabarty\nOur ", "external_links": [], "published": "2018-01-26T14:55:00.000+02:00", "crawled": "2018-01-26T15:19:38.018+02:00", "highlightTitle": ""}