{"organizations": [], "uuid": "24e11e9b6d7f1a005261772acbc4f8a3e3b42715", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/20/104231180-FB_log_inr.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/17/facebook-and-fake-news-controversy-in-philippines-around-rappler.html", "country": "US", "domain_rank": 767, "title": "Facebook and 'fake news': Controversy in Philippines around Rappler", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-18T06:30:00.000+02:00", "replies_count": 0, "uuid": "24e11e9b6d7f1a005261772acbc4f8a3e3b42715"}, "author": "Nyshka Chandran", "url": "https://www.cnbc.com/2018/01/17/facebook-and-fake-news-controversy-in-philippines-around-rappler.html", "ord_in_thread": 0, "title": "Facebook and 'fake news': Controversy in Philippines around Rappler", "locations": [], "entities": {"persons": [{"name": "duterte", "sentiment": "none"}, {"name": "jason alden", "sentiment": "none"}, {"name": "carly nyst", "sentiment": "none"}, {"name": "rodrigo duterte", "sentiment": "none"}], "locations": [{"name": "philippines", "sentiment": "none"}, {"name": "manila", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Rights and democracy advocates are calling attention to Facebook's role in spreading misinformation again — this time in the Philippines.\nThe social media giant's hosting of inaccurate stories that support strongman President Rodrigo Duterte's administration has been newly spotlighted after Manila moved to shut down a local news site that had been the victim of a misinformation campaign.\nJason Alden | Bloomberg via Getty Images The future of Rappler , a former media partner of Facebook, is in question after a local regulator revoked its operating license on Monday.\n\"The shuttering of Rappler — an organization whose credibility was undermined as a result of fake news and trolling circulating on Facebook — is a tragic reminder to Facebook of the central role it plays in shaping political discourse,\" said Carly Nyst, a human rights lawyer and independent consultant to non-governmental organizations, think tanks, and the private sector.\n\"It is increasingly untenable for Facebook to deny its role in facilitating the Duterte regime's clampdown on critical voices,\" she added.\nFacebook: We have protections in place In response to such complaints, Facebook told CNBC it has taken steps to ensure the network is a safe space for people to express themselves politically. Those include new tools and technologies to prevent fake accounts, false stories, clickbait, harassment and hate speech.\n\"We recognize that the same tools that give people more voice can sometimes be abused, by anyone, to spread hoaxes and misinformation,\" a company representative said. \"We prohibit people from setting up fake accounts and have developed improved automated systems — using machine learning and artificial intelligence — to better identify and remove them quickly.\"\nThe Philippines boasts one of the world's most active social media populations and is a crucial market for Facebook, which has an office in Manila and recently partnered with Duterte's administration on a high-speed Internet infrastructure project.\n\"While Facebook has expressed interest to have partnerships with (academia) and the media to better maximize the platform, it has not lent its voice in denouncing various forms of media harassment and intimidation, or even the prevailing culture of impunity,\" said Danilo Arao, associate professor at the University of the Philippines.\nArao said the company, already under fire for its role in propagating inaccurate articles during the 2016 U.S. presidential election , should use its power and influence to take a stand. But he said he doubts that will happen: \"It is still a business, and it does not make good business sense to antagonize governments, no matter how repressive they may be, as in the case of the Philippines.\"\nStill, Nyst argued that the social media platform \"needs to wake up to the fact that it can no longer claim neutrality and immunity from responsibility, but rather needs to adhere to journalistic ethics befitting of the world's largest publisher.\"\nThe shutdown The Philippine Securities and Exchange Commission revoked the outlet's operating license on Monday. The regulator claimed the publication's acceptance of $1 million in funding from a U.S. fund broke a law that bans foreign ownership in media institutions. In response, Rappler has stated that it is owned by Filipinos, and noted that the very same regulator had accepted documentation of the investment in 2015.\nLean Daval Jr. | Reuters Philippine President Rodrigo Duterte Rappler's criticism of the country's president is widely believed to have influenced the regulator's decision. The outlet reported that the government was paying for trolls and bots to spread propaganda — a story that was deemed \"fake\" by government-aligned accounts on social media.\nDuterte this week denied any role in the incident but slammed Rappler content for being \"pregnant with falsity.\"\nMisinformation is a major political issue that has complicated public discourse around Manila's ongoing drug war.\nIn fact, many have deemed Monday's SEC decision as part of Manila's broader campaign to silence detractors . Phelim Kine, deputy director at Human Rights Watch's Asia division, called the move \"a sinister use of state regulatory processes to stifle critical media voices.\"\nRappler was launched as a Facebook page in 2012 and enjoyed triple-digit growth in its formative years.\nIn 2015, the news outlet partnered with the social network on a project aimed at loading news articles faster on Facebook's mobile app but pulled out the following year amid concerns that the algorithm was spreading false information .\nRappler founder Maria Ressa has long urged CEO Mark Zuckerberg to crack down on the spread of intentionally inaccurate reports , which she has said is hurting democracy around the world.", "external_links": ["https://www.rappler.com/"], "published": "2018-01-18T06:30:00.000+02:00", "crawled": "2018-01-18T05:41:40.005+02:00", "highlightTitle": ""}