{"organizations": [], "uuid": "5c1f343e4c3d4f97b0110714567fb012855d87c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/07/05/103766028-GettyImages-94818113.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/17/mortgage-applications-rise-4-point-1-percent.html", "country": "US", "domain_rank": 767, "title": "Mortgage applications rise 4.1%,", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.103, "site_type": "news", "published": "2018-01-17T14:00:00.000+02:00", "replies_count": 0, "uuid": "5c1f343e4c3d4f97b0110714567fb012855d87c5"}, "author": "Diana Olick", "url": "https://www.cnbc.com/2018/01/17/mortgage-applications-rise-4-point-1-percent.html", "ord_in_thread": 0, "title": "Mortgage applications rise 4.1%,", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "jb reed | bloomberg", "sentiment": "negative"}, {"name": "mortgage bankers association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The rise in mortgage applications last week doesn't make sense — unless you factor in fear.\nInterest rates rose, but borrowers may have jumped in, especially to refinance their current loans, worried that the long run of record low rates is over.\nTotal mortgage application volume for the week rose 4.1 percent, seasonally adjusted, according to the Mortgage Bankers Association. Volume rose 5.6 percent from a year ago.\nApplications to refinance a home loan led the charge, rising 4 percent for the week. Refinances are usually highly sensitive to even small moves in interest rates, which is why the gains aren't following normal patterns. Interest rates rose to their highest level since March.\nThe average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances ($453,100 or less) increased to 4.33 percent, from 4.23 percent, with points increasing to 0.54 from 0.35 (including the origination fee) for 80 percent loan-to-value ratio loans.\n\"Treasury yields moved higher on average last week, based on news that both Japanese and European economic growth is strengthening, along with concern that China may reduce U.S. Treasury holdings in the near future,\" said Joel Kan, an MBA economist. \"Despite the increase in rates, applications increased both for purchase and refinance. These increases were partly due to an upswing following the holiday season lull and potentially more borrowers trying to refinance before mortgage rates increase further.\"\nInterest rates increased across all products in the survey, and, perhaps most notably, the 5/1 ARM rate increased to its highest level since April 2011, potentially another sign that the yield curve continues to flatten, according to Kan.\nMortgage applications to purchase a home, which are less rate-sensitive week to week, rose 3 percent last week and were 7 percent higher than the same week one year ago. Homebuyers may be trying to get a jump on the spring market, given how competitive the market has been.\nLow supply of homes for sale continues to push prices higher, but there are traditionally fewer buyers out in January, so those who do brave the elements to shop for a home may be at an advantage.\nMortgage rates didn't move much to start the week, but they are now testing new highs. The possibility of a government shutdown could reverse the recent gains, but for now at least, the trend appears to be higher.", "external_links": [], "published": "2018-01-17T14:00:00.000+02:00", "crawled": "2018-01-17T14:01:57.027+02:00", "highlightTitle": ""}