{"organizations": [], "uuid": "fdd5e976f8ad88f9c85ac749c50f7285cd1ada36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/11", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-anthem-reports-fourth-quarter-and-full-year-2017-results-reflecting-balanced-performance-across-its-business-units.html", "country": "US", "domain_rank": 767, "title": "Anthem Reports Fourth Quarter and Full Year 2017 Results Reflecting Balanced Performance across Its Business Units", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:00:00.000+02:00", "replies_count": 0, "uuid": "fdd5e976f8ad88f9c85ac749c50f7285cd1ada36"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-anthem-reports-fourth-quarter-and-full-year-2017-results-reflecting-balanced-performance-across-its-business-units.html", "ord_in_thread": 0, "title": "Anthem Reports Fourth Quarter and Full Year 2017 Results Reflecting Balanced Performance across Its Business Units", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Operating revenues grew 5.8% year-over-year to $89.1 billion. Medical enrollment increased by 325 thousand members in 2017 to 40.2 million members. Fourth quarter net income was $4.67 per share, including net positive adjustment items of $3.38 per share of which $4.21 relates to a one-time, non-cash deferred tax benefit from tax reform. Adjusted net income was $1.29 per share (refer to the GAAP reconciliation table). Full year net income was $14.35 per share, including net positive adjustment items of $2.31 per share. Adjusted net income was $12.04 per share (refer to the GAAP reconciliation table). Operating cash flows grew by 28.0% year-over-year to $4.2 billion in 2017. Board of Directors increases the quarterly dividend by 7.1% to $0.75 per share.\nINDIANAPOLIS--(BUSINESS WIRE)-- Anthem, Inc. (NYSE: ANTM) today reported solid fourth quarter and full year 2017 financial results that reflected a continued focus on improving execution while also funding investments to advance its strategic priorities for sustained long-term growth.\n“We are pleased with our 2017 performance, which is the result of improved execution in all areas of our business and an increased focus on aligning strategic investments and capabilities to more effectively meet the changing needs of the more than forty million consumers we are privileged to serve,” said Gail K. Boudreaux, President and CEO, Anthem. “Moving forward, we will continue to leverage our broad business portfolio and extensive care provider, consumer and analytics capabilities to deliver high quality healthcare solutions as we work to create a healthcare system that is more affordable and simpler to navigate for all Americans.”\nThe company expects its full year 2018 net income to be greater than $14.28 per share, including approximately $0.72 per share of net negative adjustment items. Full year adjusted net income is expected to be greater than $15.00 per share, representing growth of greater than 24% versus 2017 adjusted net income per share (refer to the GAAP reconciliation table). Anthem's 2018 financial outlook includes a net benefit from corporate tax reform of approximately $2.00 per share after adjusting for expected premium reductions and funding incremental investments in technology modernization efforts, consumer-facing digital technologies, and product development capabilities.\nCONSOLIDATED HIGHLIGHTS\nMembership: Medical enrollment totaled approximately 40.2 million members at December 31, 2017, an increase of 325 thousand members, or 0.8% percent, from 39.9 million at December 31, 2016. Commercial & Specialty Business enrollment increased by 278 thousand medical members as the Company experienced growth in both self-funded and fully-insured Local Group businesses, partially offset by a decline in membership in the National and Individual businesses. Enrollment also grew by 47 thousand in the Government business as growth in Medicare was partially offset by a decline in Medicaid enrollment.\nMedical enrollment declined by 13 thousand lives sequentially during the fourth quarter of 2017. The decrease reflected enrollment declines in the Individual business, partially offset by growth in the Medicare, Medicaid, and Local Group self-funded businesses.\nOperating Revenue: Operating revenue was $22.4 billion in the fourth quarter of 2017, an increase of $1.0 billion, or 4.5 percent, versus the $21.5 billion in the prior year quarter. The growth in revenue reflected premium rate increases to cover overall cost trends across our business. Additionally, the increase was driven by higher enrollment in Medicare and both Local Group insured and self-funded businesses. These increases were partially offset by the impact of the one year waiver of the health insurance tax in 2017.\nBenefit Expense Ratio: The benefit expense ratio was 88.6 percent in the fourth quarter of 2017, an increase of 140 basis points from 87.2 percent in the prior year quarter. The increase, as expected, was largely driven by the impact of the one year waiver of the health insurance tax in 2017. The increase was partially offset by improved medical cost performance in the Individual and Local Group businesses.\nMedical claims reserves established at December 31, 2016 developed better than the Company’s expectation during 2017.\nMedical Cost Trend: For the full year 2017, underlying Local Group medical cost trend was approximately 6.5%. The Company is updating the reporting of its underlying Local Group medical cost trend in 2018 to reflect the \"allowed amount\", or contractual rate, paid to care providers. The previous methodology was based on the \"paid amount\", which is the \"allowed amount\" less copays and deductibles. As a result, the company anticipates Local Group medical cost trend will be in the range of 6.0% +/- 50 basis points in 2018. If 2017 was calculated on a consistent basis with the updated methodology in 2018, Local Group medical cost trends would have been approximately 5.5%.\nDays in Claims Payable: Days in Claims Payable (“DCP”) was 39.4 days as of December 31, 2017, a decrease of 1.1 days from 40.5 days as of September 30, 2017.\nSG&A Expense Ratio: The SG&A expense ratio was 15.1 percent in the fourth quarter of 2017, a decrease of 10 basis points from 15.2 percent in the fourth quarter of 2016. The decrease, as expected, was primarily driven by the impact of the one year waiver of the health insurance tax in 2017 and the impact of fixed cost leverage on operating revenue growth. These items were partially offset by the impact of increased investment spend to support growth initiatives and an increase in incentive compensation expense.\nOperating Cash Flow: Operating cash outflow was $1.3 billion in the fourth quarter of 2017, bringing full year 2017 operating cash flow to $4.2 billion, or 1.1 times net income.\nShare Repurchase Program : During the fourth quarter of 2017, the Company repurchased 1.8 million shares of its common stock for $362 million, or a weighted-average price of $205.41. During the full year 2017, the Company repurchased 10.5 million shares of its common stock for $2.0 billion, or a weighted average price of $189.93. As of December 31, 2017, the Company had approximately $7.2 billion of Board-approved share repurchase authorization remaining.\nCash Dividend: During the fourth quarter of 2017, the Company paid a quarterly dividend of $0.70 per share, representing a distribution of cash totaling $179.5 million.\nOn January 30, 2018, the Board of Directors declared a first quarter 2018 dividend to shareholders of $0.75 per share. On an annualized basis, this equates to a dividend of $3.00 per share. The first quarter dividend is payable on March 23, 2018 to shareholders of record at the close of business on March 9, 2018.\nInvestment Portfolio & Capital Position: During the fourth quarter of 2017, the Company recorded net realized gains on financial instruments totaling $6.6 million and other-than-temporary impairment losses totaling $12.2 million. During the fourth quarter of 2016, the Company recorded net realized gains of $28.7 million and other-than-temporary impairment losses totaling $11.8 million.\nAs of December 31, 2017, the Company’s net unrealized gain position in the investment portfolio was $834.8 million, consisting of net unrealized gains on equity and fixed maturity securities totaling $507.2 and $327.6 million, respectively. As of December 31, 2017 cash and investments at the parent company totaled approximately $2.8 billion, including the timing impact of inter-company funding arrangements in the quarter. Adjusted for the timing impact of these arrangements, which was resolved in early 2018, cash and investments at the parent company would have totaled approximately $3.7 billion as of December 31, 2017.\nIncome Tax Expense: During the fourth quarter, the Company recorded a one-time, non-cash deferred tax benefit from corporate tax reform of $1.1 billion, reducing the total income tax expense in 2017 to $121 million, an effective tax rate of 3.1%.\nREPORTABLE SEGMENTS\nAnthem, Inc. has three reportable segments: Commercial & Specialty Business (comprised of the Local Group, National Accounts, Individual and Specialty businesses); Government Business (comprised of the Medicaid and Medicare businesses, National Government Services, and the Federal Employee Program); and Other (comprised of unallocated corporate expenses and certain other businesses that do not meet the quantitative thresholds for separate reportable segment disclosure).\nAnthem, Inc. Reportable Segment Highlights (Unaudited) (In millions) Three Months Ended December 31 Twelve Months Ended December 31 2017 2016 Change 2017 2016 Change Operating Revenue Commercial & Specialty Business $10,103.6 $9,627.2 4.9 % $40,754.1 $38,692.1 5.3 % Government Business 12,329.8 11,850.3 4.0 % 48,276.2 45,477.7 6.2 % Other 13.6 7.4 83.8 % 30.9 24.2 27.7 % Total Operating Revenue 1 $22,447.0 $21,484.9 4.5 % $89,061.2 $84,194.0 5.8 % Operating Gain / (Loss) Commercial & Specialty Business $71.2 $189.2 (62.4 )% $2,876.1 $3,195.2 (10.0 )% Government Business 360.8 529.9 (31.9 )% 1,430.2 1,784.3 (19.8 )% Other (51.0 ) (66.1 ) NM 2 (130.9 ) (177.8 ) NM 2 Total Operating Gain 1 $381.0 $653.0 (41.7 )% $4,175.4 $4,801.7 (13.0 )% Operating Margin Commercial & Specialty Business 0.7 % 2.0 % (130) bp 7.1 % 8.3 % (120) bp Government Business 2.9 % 4.5 % (160) bp 3.0 % 3.9 % (90) bp Total Operating Margin 1 1.7 % 3.0 % (130) bp 4.7 % 5.7 % (100) bp (1) See “Basis of Presentation.” (2) \"NM\" = calculation not meaningful. Commercial & Specialty Business: Operating gain in the Commercial & Specialty Business segment totaled $71.2 million in the fourth quarter of 2017, a decrease of $118.0 million, or 62.4 percent, from $189.2 million in the fourth quarter of 2016. The decrease was driven by increased investment spend to support growth initiatives and the impact of the one year waiver of the health insurance tax in 2017. The decrease was partially offset by improved medical cost performance in the Individual and Local Group businesses.\nGovernment Business: Operating gain in the Government Business segment was $360.8 million in the fourth quarter of 2017, a decrease of $169.1 million, or 31.9 percent, from $529.9 million in the fourth quarter of 2016. The decrease reflects increased investment spend to support growth initiatives and the impact of the one year waiver of the health insurance tax in 2017. These decreases were partially offset by improved medical cost performance in the Medicaid business.\nOther: The Company reported an operating loss of $51.0 million in the Other segment for the fourth quarter of 2017, compared with an operating loss of $66.1 million in the prior year quarter. The decrease was primarily driven by lower terminated Cigna acquisition related expenses.\nOUTLOOK\nFull Year 2018*:\nNet income is expected to be greater than $14.28 per share, including approximately $0.72 per share of net unfavorable items. Excluding these items, adjusted net income is expected to be greater than $15.00 per share (refer to the GAAP reconciliation table). Medical membership is expected to be in the range of 40,000,000 - 40,200,000. Fully insured membership is expected to be in the range of 14,800,000 - 14,900,000 and self-funded membership is expected to be in the range of 25,200,000 - 25,300,000. Operating revenue is expected to be in the range of $90.5 - $91.5 billion. Benefit expense ratio is expected to be in the range of 84.5% plus or minus 30 basis points. SG&A ratio is expected to be in the range of 15.5% plus or minus 30 basis points. Operating cash flow is expected to be greater than $4.0 billion.\n* This outlook includes a net benefit from corporate tax reform of approximately $2.00 per share.\nBasis of Presentation\nOperating revenue and operating gain are the key measures used by management to evaluate performance in each of its reporting segments, allocate resources, set incentive compensation targets and to forecast future operating performance. Operating gain is calculated as total operating revenue less benefit expense and selling, general and administrative expense. It does not include net investment income, net realized gains/losses on financial instruments, other-than-temporary impairment losses recognized in income, interest expense, amortization of other intangible assets, gains/losses on extinguishment of debt or income taxes, as these items are managed in a corporate shared service environment and are not the responsibility of operating segment management (refer to the GAAP reconciliation tables). Operating margin is defined as operating gain divided by operating revenue.\nConference Call and Webcast\nManagement will host a conference call and webcast today at 8:30 a.m. Eastern Standard Time (“EST”) to discuss the company’s fourth quarter results and outlook. The conference call should be accessed at least 15 minutes prior to the start of the call with the following numbers:\n800-230-1085 (Domestic) 800-475-6701 (Domestic Replay) 612-234-9960 (International) 320-365-3844 (International Replay) An access code is not required for today’s conference call. The access code for the replay is 432031. The replay will be available from 11:00 a.m. EST today, until the end of the day on February 14, 2018. The call will also be available through a live webcast at www.antheminc.com under the “Investors” link. A webcast replay will be available following the call.\nAbout Anthem, Inc.\nAnthem is working to transform health care with trusted and caring solutions. Our health plan companies deliver quality products and services that give their members access to the care they need. With over 73 million people served by its affiliated companies, including more than 40 million within its family of health plans, Anthem is one of the nation’s leading health benefits companies. For more information about Anthem’s family of companies, please visit www.antheminc.com/companies .\nAnthem, Inc. Membership Summary (Unaudited and in Thousands) Change from December 31, December 31, September 30, December 31, September 30, Medical Membership\n2017 2016 2017 2016 2017 Customer Type Local Group 15,870 15,429 15,857 2.9 % 0.1 % Individual 1,588 1,664 1,696 (4.6 )% (6.4 )% National: National Accounts 7,683 7,741 7,718 (0.7 )% (0.5 )% BlueCard ® 5,521 5,550 5,491 (0.5 )% 0.5 % Total National 13,204 13,291 13,209 (0.7 )% — % Medicare 1,545 1,438 1,498 7.4 % 3.1 % Medicaid 6,475 6,527 6,433 (0.8 )% 0.7 % FEP ® 1,562 1,570 1,564 (0.5 )% (0.1 )% Total Medical Membership 40,244 39,919 40,257 0.8 % — % Funding Arrangement Self-Funded 24,966 24,688 24,945 1.1 % 0.1 % Fully-Insured 15,278 15,231 15,312 0.3 % (0.2 )% Total Medical Membership 40,244 39,919 40,257 0.8 % — % Reportable Segment Commercial & Specialty Business 30,662 30,384 30,762 0.9 % (0.3 )% Government Business 9,582 9,535 9,495 0.5 % 0.9 % Total Medical Membership 40,244 39,919 40,257 0.8 % — % Other Membership\nLife and Disability Members 4,700 4,732 4,717 (0.7 )% (0.4 )% Dental Members 5,864 5,486 5,803 6.9 % 1.1 % Dental Administration Members 5,342 5,294 5,351 0.9 % (0.2 )% Vision Members 6,867 6,388 6,905 7.5 % (0.6 )% Medicare Advantage Part D Members 702 629 693 11.6 % 1.3 % Medicare Part D Standalone Members 318 350 320 (9.1 )% (0.6 )% Anthem, Inc. Consolidated Statements of Income (Unaudited) (In millions, except per share data) Three Months Ended\nDecember 31 2017 2016 Change Revenues Premiums $ 21,086.3 $ 20,137.1 4.7 % Administrative fees 1,349.1 1,342.0 0.5 % Other revenue 11.6 5.8 100.0 % Total operating revenue 22,447.0 21,484.9 4.5 % Net investment income 238.9 212.6 12.4 % Net realized gains on financial instruments 6.6 28.7 (77.0 )% Other-than-temporary impairment losses on investments: Total other-than-temporary impairment losses on investments (12.2 ) (13.0 ) (6.2 )% Portion of other-than-temporary impairment losses recognized in other comprehensive income — 1.2 (100.0 )% Other-than-temporary impairment losses recognized in income (12.2 ) (11.8 ) 3.4 % Total revenues 22,680.3 21,714.4 4.4 % Expenses Benefit expense 18,672.6 17,567.9 6.3 % Selling, general and administrative expense: Selling expense 353.5 351.6 0.5 % General and administrative expense 3,039.9 2,912.4 4.4 % Total selling, general and administrative expense 3,393.4 3,264.0 4.0 % Interest expense 163.6 177.3 (7.7 )% Amortization of other intangible assets 44.1 46.6 (5.4 )% Loss on extinguishment of debt 282.4 — N/M Total expenses 22,556.1 21,055.8 7.1 % Income before income tax (benefit) expense 124.2 658.6 (81.1 )% Income tax (benefit) expense (1,106.5 ) 290.2 (481.3 )% Net income $ 1,230.7 $ 368.4 234.1 % Net income per diluted share $ 4.67 $ 1.37 240.9 % Diluted shares 263.3 268.7 (2.0 )% Benefit expense as a percentage of premiums 88.6 % 87.2 % 140 bp Selling, general and administrative expense as a percentage of total operating revenue 15.1 % 15.2 % (10 )bp Income before income taxes as a percentage of total revenue 0.5 % 3.0 % (250 )bp (1) \"NM\" = calculation not meaningful\nAnthem, Inc. Consolidated Statements of Income (Unaudited) (In millions, except per share data) Twelve Months Ended\nDecember 31 2017 2016 Change Revenues Premiums $ 83,647.7 $ 78,860.1 6.1 % Administrative fees 5,380.4 5,298.8 1.5 % Other revenue 33.1 35.1 (5.7 )% Total operating revenue 89,061.2 84,194.0 5.8 % Net investment income 866.5 779.5 11.2 % Net realized gains on financial instruments 144.8 4.9 NM Other-than-temporary impairment losses on investments: Total other-than-temporary impairment losses on investments (34.7 ) (147.1 ) (76.4 )% Portion of other-than-temporary impairment losses recognized in other comprehensive income 1.6 31.7 (95.0 )% Other-than-temporary impairment losses recognized in income (33.1 ) (115.4 ) (71.3 )% Total revenues 90,039.4 84,863.0 6.1 % Expenses Benefit expense 72,236.2 66,834.4 8.1 % Selling, general and administrative expense: Selling expense 1,395.5 1,391.5 0.3 % General and administrative expense 11,254.1 11,166.4 0.8 % Total selling, general and administrative expense 12,649.6 12,557.9 0.7 % Interest expense 739.0 723.0 2.2 % Amortization of other intangible assets 168.4 192.3 (12.4 )% Los on extinguishment of debt 282.4 — N/M Total expenses 86,075.6 80,307.6 7.2 % Income before income tax expense 3,963.8 4,555.4 (13.0 )% Income tax expense 121.0 2,085.6 (94.2 )% Net income $ 3,842.8 $ 2,469.8 55.6 % Net income per diluted share $ 14.35 $ 9.21 55.8 % Diluted shares 267.8 268.1 (0.1 )% Benefit expense as a percentage of premiums 86.4 % 84.8 % 160 bp Selling, general and administrative expense as a percentage of total operating revenue 14.2 % 14.9 % (70 )bp Income before income taxes as a percentage of total revenue 4.4 % 5.4 % (100 )bp (1) \"NM\" = calculation not meaningful\nAnthem, Inc. Consolidated Balance Sheets (In millions) December 31,\n2017 December 31,\n2016 Assets (Unaudited) Current assets: Cash and cash equivalents $ 3,608.9 $ 4,075.3 Investments available-for-sale, at fair value: Fixed maturity securities 17,377.3 17,163.1 Equity securities 3,599.2 1,468.5 Other invested assets, current 17.2 15.8 Accrued investment income 162.5 164.5 Premium and self-funded receivables 6,184.9 5,860.8 Other receivables 2,266.5 2,536.6 Income taxes receivable 341.9 168.7 Securities lending collateral 455.1 1,079.8 Other current assets 2,249.3 1,781.8 Total current assets 36,262.8 34,314.9 Long-term investments available-for-sale, at fair value: Fixed maturity securities 560.8 524.4 Equity securities 32.8 31.4 Other invested assets, long-term 3,343.8 2,240.5 Property and equipment, net 2,174.9 1,977.9 Goodwill 19,231.2 17,561.2 Other intangible assets 8,368.4 7,964.9 Other noncurrent assets 565.3 467.9 Total assets $ 70,540.0 $ 65,083.1 Liabilities and shareholders’ equity Liabilities Current liabilities: Policy liabilities: Medical claims payable $ 7,991.5 $ 7,892.6 Reserves for future policy benefits 69.9 71.8 Other policyholder liabilities 2,950.3 2,221.1 Total policy liabilities 11,011.7 10,185.5 Unearned income 860.3 971.9 Accounts payable and accrued expenses 5,024.4 4,014.9 Security trades pending payable 112.6 93.5 Securities lending payable 454.4 1,078.9 Short-term borrowings 1,275.0 440.0 Current portion of long-term debt 1,274.6 928.4 Other current liabilities 3,343.0 3,581.3 Total current liabilities 23,356.0 21,294.4 Long-term debt, less current portion 17,382.2 14,358.5 Reserves for future policy benefits, noncurrent 647.3 666.1 Deferred tax liabilities, net 1,726.5 2,779.9 Other noncurrent liabilities 925.1 883.8 Total liabilities 44,037.1 39,982.7 Shareholders’ equity Common stock 2.6 2.6 Additional paid-in capital 8,547.4 8,805.1 Retained earnings 18,054.4 16,560.6 Accumulated other comprehensive loss (101.5 ) (267.9 ) Total shareholders’ equity 26,502.9 25,100.4 Total liabilities and shareholders’ equity $ 70,540.0 $ 65,083.1 Anthem, Inc. Consolidated Statements of Cash Flows (Unaudited) (In millions) Twelve Months Ended December 31 2017 2016 Operating activities Net income $3,842.8 $2,469.8 Adjustments to reconcile net income to net cash provided by operating activities: Net realized gains on financial instruments (144.8 ) (4.9 ) Other-than-temporary impairment losses recognized in income 33.1 115.4 Loss on extinguishment of debt 282.4 — Loss on disposal of assets 13.0 4.5 Deferred income taxes (1,272.1 ) 126.9 Amortization, net of accretion 779.7 807.8 Depreciation expense 110.7 104.0 Impairment of property and equipment 2.5 44.8 Share-based compensation 169.6 164.6 Excess tax benefits from share-based compensation — (53.5 ) Changes in operating assets and liabilities: Receivables, net (22.2 ) (1,380.5 ) Other invested assets (35.5 ) (19.4 ) Other assets (629.0 ) (127.7 ) Policy liabilities 731.6 321.7 Unearned income (120.1 ) (173.6 ) Accounts payable and accrued expenses 921.8 182.3 Other liabilities (120.2 ) 605.7 Income taxes (193.9 ) 178.8 Other, net (164.6 ) (96.5 ) Net cash provided by operating activities 4,184.8 3,270.2 Investing activities Purchases of fixed maturity securities (9,794.6 ) (10,157.7 ) Proceeds from sales and maturities of fixed maturity securities 9,779.3 10,054.6 Purchases of equity securities (5,416.3 ) (1,476.3 ) Proceeds from sales of equity securities 3,462.5 1,592.8 Purchases of other invested assets (1,163.8 ) (433.1 ) Proceeds from sales of other invested assets 219.0 304.9 Change in collateral and settlements of non-hedging derivatives 64.9 (34.5 ) Changes in securities lending collateral 624.5 222.0 Purchases of subsidiaries, net of cash acquired (2,079.6 ) — Net purchases of property and equipment (790.2 ) (583.6 ) Other, net 11.9 (3.0 ) Net cash used in investing activities (5,082.4 ) (513.9 ) Financing activities Net proceeds from/(repayments of) commercial paper borrowings 174.6 (53.2 ) Net proceeds from/(repayments of) short-term borrowings 835.0 (100.0 ) Net proceeds from of long-term borrowings 2,642.7 — Changes in securities lending payable (624.5 ) (222.0 ) Changes in bank overdrafts 71.0 513.8 Proceeds from sale of put options — — Repurchase and retirement of common stock (1,997.7 ) — Change in collateral and settlements of debt-related derivatives (149.0 ) (360.4 ) Cash dividends (704.9 ) (684.0 ) Proceeds from issuance of common stock under employee stock plans 225.3 119.4 Taxes paid through withholding of common stock under employee stock plans (46.5 ) (65.7 ) Excess tax benefits from share-based compensation — 53.5 Net cash provided by (used in) financing activities 426.9 (798.6 ) Effect of foreign exchange rates on cash and cash equivalents 4.3 4.1 Change in cash and cash equivalents (466.4 ) 1,961.8 Cash and cash equivalents at beginning of year 4,075.3 2,113.5 Cash and cash equivalents at end of period $3,608.9 $4,075.3 Anthem, Inc. Reconciliation of Medical Claims Payable Years Ended December 31 2017 2016 2015 (In millions) (Unaudited) Gross medical claims payable, beginning of year $ 7,892.6 $ 7,569.8 $ 6,861.2 Ceded medical claims payable, beginning of year (539.1 ) (645.6 ) (767.4 ) Net medical claims payable, beginning of year 7,353.5 6,924.2 6,093.8 Business combinations and purchase adjustments 75.8 — 121.8 Net incurred medical claims: Current year 71,872.3 66,371.4 60,708.4 Prior years redundancies (1) (1,164.6 ) (850.4 ) (800.2 ) Total net incurred medical claims 70,707.7 65,521.0 59,908.2 Net payments attributable to: Current year medical claims 64,249.7 59,156.6 54,067.7 Prior years medical claims 6,000.7 5,935.1 5,131.9 Total net payments 70,250.4 65,091.7 59,199.6 Net medical claims payable, end of year 7,886.6 7,353.5 6,924.2 Ceded medical claims payable, end of year 104.9 539.1 645.6 Gross medical claims payable, end of year $ 7,991.5 $ 7,892.6 $ 7,569.8 Current year medical claims paid as a percentage of current year net incurred medical claims 89.4 % 89.1 % 89.1 % Prior year redundancies in the current year as a percentage of prior year net medical claims payable less prior year redundancies in the current year 18.8 % 14.0 % 15.1 % Prior year redundancies in the current year as a percentage of prior year net incurred medical claims 1.8 % 1.4 % 1.4 % (1) Negative amounts reported for net incurred medical claims related to prior years result from claims being settled for amounts less than originally estimated.\nAnthem, Inc.\nGAAP Reconciliation\n(Unaudited)\nAnthem, Inc. has referenced “Adjusted Net Income” and “Adjusted Net Income Per Share,” which are non-GAAP measures, in this document. These non-GAAP measures are not intended to be alternatives to any measure calculated in accordance with GAAP. In addition to these non-GAAP measures, references are made to the measures “Operating Revenue” and “Operating Gain.” Each of these measures is provided to further aid investors in understanding and analyzing the company’s core operating results and comparing Anthem, Inc.’s financial results. A reconciliation of Operating Revenue to Total Revenue is set forth in the Consolidated Statements of Income herein. A reconciliation of the non-GAAP measures to the most directly comparable measures calculated in accordance with GAAP, together with a reconciliation of reportable segments operating gain to income before income tax expense, is reported below.\nThree Months Ended\nDecember 31 Twelve Months Ended\nDecember 31 (In millions, except per share data) 2017 2016 Change 2017 2016 Change Net income $ 1,230.7 $ 368.4 234.1 % $ 3,842.8 $ 2,469.8 55.6 % Add / (Subtract): Net realized gains on financial instruments (6.6 ) (28.7 ) (144.8 ) (4.9 ) Other-than-temporary impairment losses recognized in income 12.2 11.8 33.1 115.4 Amortization of other intangible assets 44.1 46.6 168.4 192.3 Cigna transaction costs 8.7 74.9 165.9 321.1 Loss on extinguishment of debt 282.4 — 282.4 — Deferred tax benefit from Tax Reform (1,108.3 ) — (1,108.3 ) — Penn Treaty assessment costs — — 253.8 — 2015 cyber attack litigation settlement — — 115.0 — Income tax true-up of prior transaction costs — — (69.3 ) — Tricare bid conclusion costs — 37.4 — 37.4 Deferred tax asset write-off from California tax legislation — — — 20.7 Tax impact of non-GAAP adjustments (124.4 ) (37.2 ) (314.8 ) (203.3 ) Net adjustment items (891.9 ) 104.8 (618.6 ) 478.7 Adjusted net income $ 338.8 $ 473.2 (28.4 )% $ 3,224.2 $ 2,948.5 9.4 % Net income per diluted share $ 4.67 $ 1.37 240.9 % $ 14.35 $ 9.21 55.8 % Add / (Subtract): Net realized gains on financial instruments (0.03 ) (0.11 ) (0.54 ) (0.02 ) Other-than-temporary impairment losses recognized in income 0.05 0.04 0.12 0.43 Amortization of other intangible assets 0.17 0.17 0.63 0.72 Cigna transaction costs 0.03 0.28 0.62 1.20 Loss on extinguishment of debt 1.07 — 1.05 — Deferred tax benefit from Tax Reform (4.21 ) — (4.14 ) — Penn Treaty assessment costs — — 0.95 — 2015 cyber attack litigation settlement — — 0.43 — Income tax true-up of prior transaction costs — — (0.26 ) — Tricare bid conclusion costs — 0.14 — 0.14 Deferred tax asset write-off from California tax legislation — — — 0.08 Tax impact of non-GAAP adjustments (0.47 ) (0.14 ) (1.18 ) (0.76 ) Rounding Impact 0.01 0.01 0.01 — Net adjustment items (3.38 ) 0.39 (2.31 ) 1.79 Adjusted net income per diluted share $ 1.29 $ 1.76 (26.7 )% $ 12.04 $ 11.00 9.5 % Full Year 2018 Outlook Net income per diluted share Greater than $14.28 Add / (Subtract): Amortization of other intangible assets Approximately $0.90 Tax impact of non-GAAP adjustments Approximately ($0.18) Net adjustment items Approximately $0.72 Adjusted net income per diluted share Greater than $15.00 Three Months Ended\nDecember 31 Twelve Months Ended\nDecember 31 (In millions) 2017 2016 Change 2017 2016 Change Reportable segments operating gain $ 381.0 $ 653.0 (41.7 )% $ 4,175.4 $ 4,801.7 (13.0 )% Net investment income 238.9 212.6 866.5 779.5 Net realized gains on financial instruments 6.6 28.7 144.8 4.9 Other-than-temporary impairment losses recognized in income (12.2 ) (11.8 ) (33.1 ) (115.4 ) Interest expense (163.6 ) (177.3 ) (739.0 ) (723.0 ) Amortization of other intangible assets (44.1 ) (46.6 ) (168.4 ) (192.3 ) Loss on extinguishment of debt (282.4 ) — (282.4 ) — Income before income tax expense $ 124.2 $ 658.6 (81.1 )% $ 3,963.8 $ 4,555.4 (13.0 )% Anthem, Inc. Financial Guidance Summary (Unaudited) Full Year 2017 Actual Full Year 2018 Outlook 1 Approximate Change Year-End Medical Enrollment Self-funded 24,966 25,200 - 25,300 234k - 334k Fully-Insured 15,278 14,800 - 14,900 (478k) - (378k) Total 40,244 40,000 - 40,200 (244k) - (44k) Operating Revenue $89.1 billion $90.5 - $91.5 billion $1.4 - $2.4 billion or 1.6% - 2.7%\nBenefit Expense Ratio 86.4% 84.5% +/- 30 basis points 190 bps +/- 30 bps SG&A Expense Ratio 14.2% 15.5% +/- 30 basis points (130 bps) +/- 30 bps Operating Gain $4.2 billion Greater than $5.25 billion Greater than $1.05 billion or 25.0% Other Pre-Tax Items: Net Investment income $867 million $825 million ($42) million Interest Expense ($739) million ($775 million) ($36) million Amortization of Intangible Assets ($168) million ($240 million) ($72) million Net Pre-Tax Expense ($40) million ($190 million) ($150) million Effective Tax Rate 3.1% 25.5% - 27.5% (22.4%) - (24.4%) GAAP EPS 1 $14.35 Greater than $14.28 (0.5%) or better Adjusted EPS 1 $12.04 Greater than $15.00 24.6% or better Diluted Shares 267.8 million 260 - 264 million 1.4% - 2.9% Operating Cash Flow $4.2 billion Greater than $4.0 billion Greater than ($200) million (1) This outlook includes a net benefit from corporate tax reform of approximately $2.00 per share.\nForward-Looking Statements\nThis document contains certain forward-looking information about us that is intended to be covered by the safe harbor for “forward-looking statements” provided by the Private Securities Litigation Reform Act of 1995. Forward-looking statements are generally not historical facts. Words such as “expect,” “feel,” “believe,” “will,” “may,” “should,” “anticipate,” “intend,” “estimate,” “project,” “forecast,” “plan” and similar expressions are intended to identify forward-looking statements. These statements include, but are not limited to: financial projections and estimates and their underlying assumptions; statements regarding plans, objectives and expectations with respect to future operations, products and services; and statements regarding future performance. Such statements are subject to certain risks and uncertainties, many of which are difficult to predict and generally beyond our control, that could cause actual results to differ materially from those expressed in, or implied or projected by, the forward-looking statements. These risks and uncertainties include, but are not limited to: the impact of federal and state regulation, including ongoing changes in the Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010, as amended, or collectively, the ACA; trends in health care costs and utilization rates; our ability to contract with care providers on cost-effective and competitive terms; our ability to secure sufficient premium rates including regulatory approval for and implementation of such rates; reduced enrollment; risks and uncertainties regarding Medicare and Medicaid programs, including those related to non-compliance with the complex regulations imposed thereon, our ability to maintain and achieve improvement in Centers for Medicare and Medicaid Services, or CMS, Star ratings and other quality scores and funding risks with respect to revenue received from participation therein; competitive pressures, including competitor pricing, which could affect our ability to maintain or increase our market share; a negative change in our health care product mix; our ability to adapt to changes in the industry and develop and implement strategic growth opportunities; costs and other liabilities associated with litigation, government investigations, audits or reviews; the ultimate outcome of litigation between Cigna Corporation, or Cigna, and us related to the merger agreement between the parties, including our claim for damages against Cigna, Cigna’s claim for payment of a termination fee and other damages against us, and the potential for such litigation to cause us to incur substantial costs, materially distract management and negatively impact our reputation and financial positions; medical malpractice or professional liability claims or other risks related to health care services provided by our subsidiaries; possible restrictions in the payment of dividends by our subsidiaries and increases in required minimum levels of capital; the potential negative effect from our substantial amount of outstanding indebtedness; a downgrade in our financial strength ratings; the effects of any negative publicity related to the health benefits industry in general or us in particular; unauthorized disclosure of member or employee sensitive or confidential information, including the impact and outcome of any investigations, inquiries, claims and litigation related thereto; failure to effectively maintain and modernize our information systems; non-compliance by any party with the Express Scripts, Inc. pharmacy benefit management services agreement, which could result in financial penalties, our inability to meet customer demands, and sanctions imposed by governmental entities, including CMS; state guaranty fund assessments for insolvent insurers; events that may negatively affect our licenses with the Blue Cross and Blue Shield Association; regional concentrations of our business and future public health epidemics and catastrophes; general risks associated with mergers, acquisitions and strategic alliances; our ability to repurchase shares of our common stock and pay dividends on our common stock due to the adequacy of our cash flow and earnings and other considerations; possible impairment of the value of our intangible assets if future results do not adequately support goodwill and other intangible assets; changes in economic and market conditions, as well as regulations that may negatively affect our liquidity and investment portfolios; changes in U.S. tax laws; intense competition to attract and retain employees; various laws and provisions in our governing documents that may prevent or discourage takeovers and business combinations; and general economic downturns. Readers are cautioned not to place undue reliance on these forward-looking statements that speak only as of the date hereof. We do not undertake to update or revise any forward-looking statements, except as required by applicable securities laws. Investors are also advised to carefully review and consider the various risks and other disclosures discussed in our SEC reports.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005367/en/\nAnthem Contacts:\nInvestor Relations\nWill Feest, 317-488-6057\nWilliam.feest@anthem.com\nor\nMedia\nJill Becher, 414-234-1573\nJill.becher@anthem.com\nSource: Anthem, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.antheminc.com%2Fcompanies&esheet=51751211&newsitemid=20180131005367&lan=en-US&anchor=www.antheminc.com%2Fcompanies&index=2&md5=d04052155b1e9a52b86c395863b37647", "http://www.businesswire.com/news/home/20180131005367/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.antheminc.com&esheet=51751211&newsitemid=20180131005367&lan=en-US&anchor=www.antheminc.com&index=1&md5=61783f68dc40a7b410c9ed59e551cda1"], "published": "2018-01-31T14:00:00.000+02:00", "crawled": "2018-01-31T19:00:47.003+02:00", "highlightTitle": ""}