{"organizations": [], "uuid": "169162442856460e7cb0f973da89b41beaceaa35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223285820&w=1200&r=LYNXMPEE0I0FM", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-softbank-ipo-telecoms/softbank-telecoms-ipo-faces-headwinds-from-govt-backed-upstarts-idUSKBN1F80SL", "country": "US", "domain_rank": 408, "title": "SoftBank telecoms IPO faces headwinds from govt.-backed upstarts", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T16:33:00.000+02:00", "replies_count": 0, "uuid": "169162442856460e7cb0f973da89b41beaceaa35"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-softbank-ipo-telecoms/softbank-telecoms-ipo-faces-headwinds-from-govt-backed-upstarts-idUSKBN1F80SL", "ord_in_thread": 0, "title": "SoftBank telecoms IPO faces headwinds from govt.-backed upstarts", "locations": [], "entities": {"persons": [{"name": "masayoshi son", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "softbank group corp", "sentiment": "negative"}, {"name": "softbank", "sentiment": "negative"}, {"name": "softbank corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO (Reuters) - SoftBank Group Corp’s ( 9984.T ) expected spin-off of its Japanese telecoms business will lure investors seeking exposure to a solid tech name, but the prospect of tougher competition in a mature industry may turn off those chasing higher returns.\nSoftBank shares have risen about 3 percent this week since it said it was considering what would be the largest IPO by a Japanese company in nearly two decades, a deal that would accelerate the group’s transformation into one of the world’s biggest tech investors.\nThe company aims to sell about 30 percent of SoftBank Corp, Japan’s No. 3 wireless carrier, for about 2 trillion yen ($18 billion), the Nikkei newspaper reported. The proceeds would be invested in growth assets such as foreign information technology companies.\nWhile it could provide founder Masayoshi Son’s global investment juggernaut with a cash boost, the domestic phone business is facing a concerted attempt by regulators to drive down telco fees and promote new entrants, threatening to crimp profits.\nFROM UPSTART TO INCUMBENT SoftBank no longer attracts the sympathy of regulators as the young upstart that broke up the telecoms duopoly of NTT DoCoMo Inc ( 9437.T ) and KDDI Corp 4433.T with lower prices and an initial, exclusive deal to carry Apple Inc’s ( AAPL.O ) iPhone.\n“The big three wireless firms are earning too much. We want to create a fourth pole,” a senior Japanese telecommunications ministry official said on condition of anonymity last month.\nJapanese regulators are backing new telecoms entrants such as Rakuten Inc ( 4755.T ), an e-commerce, streaming and fintech firm that now aims to become the country’s fourth major wireless carrier.\nOther government measures to promote competition include the removal of the sim lock from handsets, forcing carriers to alert users when contracts are up for renegotiation, and cracking down on cut-price handset deals that smaller players cannot compete with.\n“We want to create an environment (for Rakuten) that is as good as or better than in eMobile’s time,” the official said, a reference to a successful 2007 attempt by upstart eMobile to enter the wireless market offering “pocket wifi” devices. eMobile gained four million subscribers before SoftBank bought it in 2013.\nSoftBank could be “hedging the risk of more competition” by considering an initial public offering, CLSA analyst Oliver Matthew said in note to clients.\nMany analysts have questioned Rakuten’s proposals.\nJefferies analyst Atul Goyal said the online retailer’s current spending plans did not appear to pose an immediate threat to incumbents, and noted the high costs of building new telecoms networks.\nThe entry of an aggressive new player could even tip the whole Japanese telecoms market away from growth, Sanford C. Bernstein analyst Chris Lane said in a note to clients.\nHUNT FOR CASH SoftBank has long relied on its domestic telecoms business, which makes up a third of overall sales but two-thirds of profits, as a stable source of cash that can be diverted to its growing number of investments around the world.\nA listing would mean a significant cash injection for group CEO Masayoshi Son’s vision of a future driven by artificial intelligence, robotics and interconnected devices.\nIt would also ease the group’s financial burden following its investments in tech firms such as Uber and the collapse of talks to merge U.S. wireless unit Sprint Corp ( S.N ) with T-Mobile US Inc ( TMUS.O ).\nSoftBank’s domestic investment needs also are mounting as it looks to the start of 5G services in the mature Japanese market, a senior SoftBank executive said last May.\n“There are concerns over whether we will be able to continue to invest as we have up until now,” the executive said at the time.\nSoftBank previously raised funds through the reluctant sale of part of its stake in Alibaba Group Holding Ltd ( BABA.N ), and by bringing in outside investors such as Saudi Arabia to set up the $93 billion Vision Fund, the world’s largest private equity fund.\nRegardless of SoftBank’s motives, an IPO would create a clear division for investors between steady returns from the telecoms business and Masayoshi Son’s more risky tech ventures, a person with direct knowledge of the matter said.\nReporting by Sam Nussey and Yoshiyasu Shida; Editing by Stephen Coates\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T16:33:00.000+02:00", "crawled": "2018-01-19T12:06:38.019+02:00", "highlightTitle": ""}