{"organizations": [], "uuid": "32640d094256f7e58d77091cdc2d9d6446c31cbe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/02/104815014-Starbucks_Holiday_Cup_2017_1_1.1910x1000.JPG", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/starbucks-plan-to-win-back-customers-after-whiffing-on-holiday-sales.html", "country": "US", "domain_rank": 767, "title": "Starbucks' plan to win back customers after whiffing on holiday sales", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.02, "site_type": "news", "published": "2018-01-26T19:00:00.000+02:00", "replies_count": 0, "uuid": "32640d094256f7e58d77091cdc2d9d6446c31cbe"}, "author": "Sarah Whitten", "url": "https://www.cnbc.com/2018/01/26/starbucks-plan-to-win-back-customers-after-whiffing-on-holiday-sales.html", "ord_in_thread": 0, "title": "Starbucks' plan to win back customers after whiffing on holiday sales", "locations": [], "entities": {"persons": [{"name": "joshua trujillo", "sentiment": "negative"}, {"name": "kevin johnson", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "starbucks", "sentiment": "negative"}, {"name": "starbucks starbucks", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Starbucks ' stock continued to slump Friday after the coffee chain posted another quarter of disappointing sales growth on Thursday and blamed holiday offerings for failing to draw in customers.\nShares of the coffee giant were down nearly 5 percent in midday trading as investors question if the company can revitalize sales in the U.S.\nAlthough same-store sales came up short in all of Starbucks' regions, save for strong growth in China, investors have been focused on weak U.S. results. U.S. same-store sales grew 2 percent in the quarter, with the poor sales of holiday beverages, merchandise and gift cards a big factor.\n\"Our holiday merchandise that we had did not perform up to our expectations,\" CEO Kevin Johnson said on CNBC's \"Squawk on the Street\" Friday. \"That's not anything to do with the core execution of the company.\"\nSame-store sales in the U.S. could have been more than a percentage point higher if not for this weakness, he said.\nJoshua Trujillo | Starbucks Starbucks 2017 holiday cup design Starbucks hopes to bolster sales in the U.S. by luring in customers in the afternoon with discounts and promotions. It also plans on continuing to leverage mobile ordering and digital marketing to increase the number of times consumers visit the coffee shop.\nStarbucks said it added 1.4 million Starbucks Rewards members in the U.S. in the last quarter, raising its total number of members to 14.2 million.\nAs more and more Starbucks customers pay for their coffees with their phones, the company has begun testing a cashless store in Seattle to gain more insight into customers' digital behavior. \nIn addition, Starbucks stands to gain more revenue in the U.S. once it opens its Roastery location in New York City in 2018. The company said Thursday that in the first eight weeks of opening its Shanghai Roastery, the megastore rakes in more than $64,000 per day, double what U.S. stores make in one week.\nOn its first day of operation, the Shanghai Roastery saw an average check of $29 and the location continues to draw customers, who often wait for hours to get in the door.\nA Roastery will also be opening in Chicago in 2019.\nWATCH: Starbucks CEO Kevin Johnson talks earnings and future of the brand show chapters Starbucks CEO Kevin Johnson talks earnings and future of the brand      15 Mins Ago | 11:12", "external_links": [], "published": "2018-01-26T19:00:00.000+02:00", "crawled": "2018-01-26T19:01:55.014+02:00", "highlightTitle": ""}