{"organizations": [], "uuid": "5b86e9da7aed9155ce62a295ddaa0a032c5b57ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-chicken-soup-for-the-soul-entertainmentas-recently-acquired-screen-media-assets-appraised-at-over-31-million.html", "country": "US", "domain_rank": 767, "title": "Chicken Soup for the Soul Entertainment’s Recently Acquired Screen Media Assets Appraised at Over $31 Million", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T17:04:00.000+02:00", "replies_count": 0, "uuid": "5b86e9da7aed9155ce62a295ddaa0a032c5b57ef"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-chicken-soup-for-the-soul-entertainmentas-recently-acquired-screen-media-assets-appraised-at-over-31-million.html", "ord_in_thread": 0, "title": "Chicken Soup for the Soul Entertainment’s Recently Acquired Screen Media Assets Appraised at Over $31 Million", "locations": [], "entities": {"persons": [], "locations": [{"name": "conn.", "sentiment": "none"}], "organizations": [{"name": "securities and exchange commission", "sentiment": "none"}, {"name": "css entertainment", "sentiment": "none"}, {"name": "valuation opinion", "sentiment": "none"}, {"name": "screen media tv", "sentiment": "none"}, {"name": "soul entertainment, inc.", "sentiment": "none"}, {"name": "screen media ventures", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Popcornflix ® Direct-to-Consumer Online Video Service Comprised of Five Networks with Over 15 Million Active Users\nScreen Media TV and Film Library Represents One of the World’s Largest Independent Filmed-Entertainment Libraries\nCOS COB, Conn., Jan. 17, 2018 (GLOBE NEWSWIRE) -- Chicken Soup for the Soul Entertainment, Inc. (“CSS Entertainment”) (Nasdaq:CSSE), a fast-growing provider of positive and entertaining video content, has filed with the Securities and Exchange Commission a Form 8-K/A, as required, updating the Form 8-K filed on November 6, 2017 and providing audited and additional financial information relating to CSS Entertainment’s acquisition of Screen Media Ventures, LLC (“Screen Media”).\nThe value of all the recently acquired assets, as set forth in an independent, third-party valuation opinion dated January 11, 2018 (the “Valuation Opinion”), is approximately $31.4 million. The Valuation Opinion places a value on the Popcornflix direct-to-consumer online video service and associated content rights and the Screen Media TV and film library assets of approximately $27.9 million.\n“Screen Media is comprised of an extraordinary collection of assets,” said William J. Rouhana, Jr., chairman and chief executive officer. “We are extremely fortunate to have had the opportunity to acquire these assets at such a substantial discount not only to their appraised value, but also to their intrinsic value and replacement cost.”\nReflecting the excess of the net appraised value of the assets over their purchase price as set forth in the Valuation Opinion, CSS Entertainment will recognize a non-cash gain in its Statement of Operations for the year ended December 31, 2017 of approximately $22.2 million.\n“The appraised value of the Screen Media assets substantially exceeds our initial estimates,” stated Scott W. Seaton, vice chairman and chief strategy officer. “Consistent with our prior expectations, Screen Media generated more than $12 million in net revenue and $5 million in Adjusted EBITDA in 2017. We anticipate Screen Media’s 2018 net revenue and Adjusted EBITDA to substantially exceed its 2017 results.”\nMr. Rouhana added, “We continue to pursue additional transformative opportunities that would complement our growing portfolio of assets and further drive growth in revenues, profits and shareholder value.”\nThe Popcornflix direct-to-consumer online video service is comprised of five ad-supported networks with rights to over 3,000 films and approximately 60 television series (representing approximately 1,500 episodes) and is available in 56 countries. The Popcornflix app has been downloaded approximately 25 million times and has approximately 15 million active users.\nThe Screen Media content library is comprised of over 1,200 television series and feature films and is one of the largest, independently-owned libraries of filmed entertainment in the world. Through direct worldwide relationships, this content is distributed across all media, including theatrical, home video, pay-per-view, free cable and paid television, video-on-demand and existing and emerging video platforms.\nABOUT CHICKEN SOUP FOR THE SOUL ENTERTAINMENT\nChicken Soup for the Soul Entertainment, Inc. is a fast-growing provider of positive and entertaining video content that brings out the best of the human spirit. The company is aggressively growing its business through a combination of organic growth, licensing and distribution arrangements, acquisitions, and strategic relationships. The company owns Screen Media Ventures, LLC, a leading global independent television and film distribution company with one of the largest independently owned television and film libraries. The company also owns Popcornflix ® , an ad-based direct-to-consumer online video service with five networks and thousands of television episodes and movies. Chicken Soup for the Soul Entertainment makes its video content available to consumers globally through television and online networks, including its online affiliate APlus.com . The company is also expanding its partnerships with sponsors, television networks and independent producers. Chicken Soup for the Soul Entertainment is a subsidiary of Chicken Soup for the Soul, LLC.\nUSE OF NON-GAAP FINANCIAL MEASURES\nThis press release contains a non-GAAP financial measure (EBITDA), which is not recognized under GAAP, as a supplemental indicator of our operating performance. This non-GAAP financial measure is provided to enhance the readers understanding of our historical and current financial performance. EBITDA means earnings before interest, taxes, depreciation and amortization. Management believes EBITDA to be a meaningful indicator of our performance that provides useful information to investors regarding our financial condition and results of operations. The most comparable GAAP measure is operating income.\nFORWARD LOOKING STATEMENTS\nThis press release includes forward-looking statements that involve risks and uncertainties. Forward looking statements are statements that are not historical facts. Such forward-looking statements are subject to risks (including those set forth in the offering circular) and uncertainties which could cause actual results to differ from the forward looking statements. The company expressly disclaims any obligations or undertaking to release publicly any updates or revisions to any forward-looking statements contained herein to reflect any change in the company’s expectations with respect thereto or any change in events, conditions or circumstances on which any statement is based. Investors should realize that if our underlying assumptions for the projections contained herein prove inaccurate or that known or unknown risks or uncertainties materialize, actual results could vary materially from our expectations and projections.\nMEDIA CONTACT\nJeanene Timberlake\nRooneyPartners LLC\njtimberlake@rooneyco.com\n(646) 770-8858\nINVESTOR RELATIONS\nSanjay M. Hurry/Jody Burfening\nLHA Investor Relations\nCSSEnt@lhai.com\n(212) 838-3777\nSource: Chicken Soup for theSoul Entertainment, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/b4d83e79-4ecc-4dea-b668-2e6adf0b16b8", "https://www.globenewswire.com/Tracker?data=F0aMExPuTYQwPtHyjbci9-vN7QynK10SOkNV1VnX4vGHDXxM3y5mZttYOL482C22i02mO879EWQt9nIxOxv1VAxVe3_PYBeoOvZS8qa_mGM=", "https://www.globenewswire.com/Tracker?data=qyScVbT5P8XDwXjllb2VmseFc7uX-XJXlKJITRSZ3HSEuPfqN5hwsL4QU85TxB1GVot81UjWeQvXms9-drvzKw=="], "published": "2018-01-17T17:04:00.000+02:00", "crawled": "2018-01-17T19:20:30.000+02:00", "highlightTitle": ""}