{"organizations": [], "uuid": "6f7123b6489da89f66e94f39c612e5eb3baf3133", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/07/104886134-GettyImages-887877046.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/trumps-weak-poll-numbers-dont-tell-real-story-commentary.html", "country": "US", "domain_rank": 767, "title": "Trump's weak poll numbers don't tell real story-commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-22T19:39:00.000+02:00", "replies_count": 0, "uuid": "6f7123b6489da89f66e94f39c612e5eb3baf3133"}, "author": "Jake Novak", "url": "https://www.cnbc.com/2018/01/22/trumps-weak-poll-numbers-dont-tell-real-story-commentary.html", "ord_in_thread": 0, "title": "Trump's weak poll numbers don't tell real story-commentary", "locations": [], "entities": {"persons": [{"name": "saul loeb", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "mike pence", "sentiment": "negative"}, {"name": "chuck schumer", "sentiment": "none"}, {"name": "nancy pelosi", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}, {"name": "paul ryan", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "kentucky", "sentiment": "none"}, {"name": "oval office", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "congressional", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Saul Loeb | AFP | Getty Images President Donald Trump, alongside Vice President Mike Pence (3rd L), meets with Congressional leadership including Senate Majority Leader Mitch McConnell (2nd R), Republican of Kentucky, Senate Minority Leader Chuck Schumer (R), Democrat of New York, Speaker of the House Paul Ryan (2nd L), Republican of Wisconsin, and House Democratic Leader Nancy Pelosi (L), Democrat of California, in the Oval Office at the White House in Washington, DC, December 7, 2017. \nAs we begin President Donald Trump 's second year in office, the president's approval ratings are at the lowest level for any modern president at this point in his first term at just 39 percent. \nBut that's only half the story. \nThat's because it's never enough to look only at a president's or any politician's approval ratings and overall poll numbers. You never know the full story until you see the numbers for his or her chief opponents. \nAs House Speaker Paul Ryan tried to remind us during the 2016 election and again during the Obamacare repeal , American politics is a \"binary choice.\" That was exceedingly clear when historically unpopular candidate Donald Trump reaped the rewards of running against an even more unpopular candidate Hillary Clinton in the presidential election. \nOf course, this is not an election year and the Democrats don't even have a clear frontrunner for their 2020 nomination. But thanks to the just ended shutdown battle, House Minority Leader Nancy Pelosi and Senate Minority Leader Chuck Schumer have emerged more than ever as the two most noticeable Trump opponents. show chapters 2 Hours Ago | 01:09 \nIt is Schumer and Pelosi who have led the most visual and verbal counterattack against the White House during this shutdown drama. Just to put the binary choice into 2018 terms, the shutdown had two basic rallying cries on the social media battleground. Democrat supporters and anti-Trumpers tagged their posts with the #TrumpShutdown hashtag, while Republicans and pro-Trumpers countered with #SchumerShutdown. Both of those hashtags were among the top trending topics on Twitter over the weekend. \nThat's when the news gets better for the president, a lot better. The latest poll of polls by the Huffington Post has Schumer's approval rating at a measly 26 percent , 13 points lower than President Trump. The same poll of polls has Pelosi's approval rating just a hair better at just under 29 percent. Perhaps the only other Democrat who came close to holding the floor on the shutdown as often as Schumer and Pelosi did was Illinois Sen. Dick Durbin, who holds an anemic 37 percent approval rating of his own. \nWith enemies like these, who needs friends? \nOn the Republican side, Senate Majority Leader Mitch McConnell also pales in comparison to Trump with a 21 percent approval rating, below Schumer and Pelosi. Paul Ryan is at 29.9 percent, just a hair above Pelosi. This too puts the president's supposedly disastrous polls into a more comprehensive light. \nBut the shutdown was just one example of how things aren't as bad for Trump as his weak approval numbers would have you believe. The entire landscape of American politics shifted even before he became president. Social media and the politically charged TV news channels have erased much of the traditional \"honeymoon period\" for new presidents. Even Barack Obama's presidential approval rating suffered a rare and steep decline of 18 percentage points from his inauguration to the one-year mark of his first term, from 67 percent to 49 percent. \nThe second factor just coming to the surface is the better-than-expected early positive effect from the tax reform law. The congressional Republicans are already starting to poll better on the shoulders of all the news of bonuses, raises and increased corporate investments in America. This is all happening before the lower tax withholding rates take effect in February and millions of Americans will potentially see a noticeable increase in their paychecks. \nThis doesn't mean Trump has slammed the Democrats into submission. His unpopularity is real and remains an inviting reason for dozens of potentially more popular opponents to enter the fray against him. But for now, Trump is lucky enough that his key opponents are named Pelosi and Schumer. \nTo put it in Mark Twain's terms, news of Donald Trump's political demise has been greatly exaggerated … again. But exaggerated takes on the president's poll numbers are the result of an incomplete look at the available data. Until more of the pundits take a more educated look at the full story, Trump will continue to surprise the \"experts.\" \nCommentary by Jake Novak, CNBC.com senior columnist. Follow him on Twitter @jakejakeny . \nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter. WATCH: Trump's doctor says he aced his mental fitness test. Here's how hard it really was. show chapters", "external_links": [], "published": "2018-01-22T19:39:00.000+02:00", "crawled": "2018-01-22T19:42:07.000+02:00", "highlightTitle": ""}