{"organizations": [], "uuid": "8cd4e6c104d71843938eec84a48036fc609b389f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/10/the-associated-press-dems-say-trump-action-on-florida-drilling-guided-by-politics.html", "country": "US", "domain_rank": 767, "title": "Dems say Trump action on Florida drilling guided by politics", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T20:13:00.000+02:00", "replies_count": 0, "uuid": "8cd4e6c104d71843938eec84a48036fc609b389f"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/10/the-associated-press-dems-say-trump-action-on-florida-drilling-guided-by-politics.html", "ord_in_thread": 0, "title": "Dems say Trump action on Florida drilling guided by politics", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "tim kaine", "sentiment": "none"}, {"name": "ryan zinke", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "adam schiff", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "interior", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — Opposition to the Trump administration's plan to expand offshore drilling mounted Wednesday as Democrats from coastal states accused President Donald Trump of punishing states with Democratic leaders and a second Republican governor asked to withdraw his state from the plan.\nDemocrats said Trump and Interior Secretary Ryan Zinke were being hypocritical by agreeing to a request by Florida's Republican governor to withdraw from the drilling plan, but not making the same accommodation to states with Democratic governors.\nDemocratic Rep. Adam Schiff of California said on Twitter that his state, \"like Florida, has hundreds of miles of beautiful coastline and a governor who wants to keep it that way. Or is that not enough for blue states?\"\n\"If local voices matter why haven't they excluded Virginia?\" asked Sen. Tim Kaine, D-Va. \"Is it because the governor of Florida is a Republican and the Virginia governor is a Democrat?\"\nThe complaints came as South Carolina's Republican governor said Wednesday he is seeking an exemption from the proposed drilling expansion, a move that will test the relationship between Trump and one of his earliest supporters.\nGov. Henry McMaster told reporters that risks associated with drilling pose a serious threat to South Carolina's lush coastline and $20 billion tourism industry.\n\"We cannot afford to take a chance with the beauty, the majesty and the economic value and vitality of our wonderful coastline in South Carolina,\" McMaster said.\nOpposition to drilling is bipartisan within South Carolina's congressional delegation: All three House members who represent the state's 190 miles of coastline told The Associated Press they are against the expansion plan. Two of the three are Republicans, including Rep. Mark Sanford, a former governor who said Zinke had set a precedent by honoring Florida's request for an exemption.\n\"What's good for the goose is good for the gander,\" Sanford said, adding that Republicans should respect local wishes.\nIn Virginia, GOP Rep. Scott Taylor joined Kaine and Gov.-elect Ralph Northam in opposing the drilling plan. Sen. Mark Warner, D-Va., called Trump's plan \"a complete non-starter.\"\nSen. Jeff Merkley, D-Ore., said on Twitter that \"the only science @SecretaryZinke follows is political science. He'll reverse course to protect fellow Republicans in Florida, but not to protect coastlines and jobs across the rest of the country? Totally unacceptable.\"\nHeather Swift, a spokeswoman for Zinke, accused Kaine and other Democrats of taking cheap shots at her boss.\n\"The secretary has said since day one that he is interested in the local voice. If those governors would like to request meetings with the secretary, they are absolutely welcome to do so,\" she said. \"Their criticism is empty pandering.\"\nAs of Wednesday, only McMaster and Democratic Gov. Roy Cooper of North Carolina had requested a meeting with Zinke on offshore drilling, Swift said.\nIn Oregon, Democratic Gov. Kate Brown took to Twitter to ask Zinke for relief. Linking to Zinke tweet about Florida, Brown wrote: \"Hey @secretaryzinke, how about doing the same for #Oregon?\"\nZinke said after a brief meeting with Scott at the Tallahassee airport Tuesday that drilling in Florida waters would be \"off the table,\" despite a plan that proposed drilling in the Eastern Gulf of Mexico and the Atlantic Ocean off Florida.\nThe change of course — just five days after Zinke announced the offshore drilling plan — highlights the political importance of Florida, where Trump narrowly won the state's 29 electoral votes in the 2016 election and has encouraged Scott to run for Senate.\nThe state is also important economically, with a multibillion-dollar tourism business built on sunshine and miles of white sandy beaches.\nAnd Florida is where Trump has a winter home in Palm Beach. Trump spent his Christmas and New Year's break at his Mar-a-Lago resort.\nFormer White House ethics chief Walter Shaub said Zinke's decision to exempt Florida from the drilling plan appears to be a conflict of interest for Trump.\nTrump is \"exempting the state that is home to the festering cankerous conflict of interest that the administration likes to call the 'Winter White House' and none of the other affected states,\" Shaub tweeted.\nZinke said Tuesday that \"Florida is obviously unique\" and that the decision to remove the state came after meetings and discussion with Scott, a Trump ally and a likely candidate for the Senate seat now held by Democrat Bill Nelson.\nNelson called Scott's meeting with Zinke \"a political stunt\" and said Scott has long wanted to drill off Florida's coast, despite his recent opposition.\nScott's office said he repeatedly voiced his opposition to drilling to Zinke, including at an October meeting in Washington.\n\"Senator Nelson and anyone else who opposes oil drilling off Florida's coast should be happy the governor was able to secure this commitment. This isn't about politics. This is good policy for Florida,\" said John Tupps, a Scott spokesman.\nZinke announced plans last week to greatly expand offshore oil drilling from the Atlantic to the Arctic and Pacific oceans, including multiple areas where drilling is now blocked. The plan was immediately met with bipartisan opposition on both the Atlantic and Pacific coasts.\nDemocratic governors along both coasts unanimously oppose drilling, as do a number of Republican governors, including McMaster, Maryland Gov. Larry Hogan and Massachusetts Gov. Charles Baker.\nThe five-year plan announced by Zinke would open 90 percent of the nation's offshore reserves to development by private companies.\nIndustry groups praised the announcement, while environmental groups denounced the plan, saying it would impose \"severe and unacceptable harm\" to America's oceans, coastal economies, public health and marine life.\nAssociated Press writers Meg Kinnard in Columbia, S.C., Ben Finley in Norfolk, Va., and Gary Fineout in Tallahassee, Fla., contributed to this report.", "external_links": [], "published": "2018-01-10T20:13:00.000+02:00", "crawled": "2018-01-11T03:57:04.010+02:00", "highlightTitle": ""}