{"organizations": [], "uuid": "1fd6ec338220af07385c6fc4bac8057f6d074cb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/06/08/103700255-RTR4PJ5W.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/12/tide-pod-challenge-teens-are-putting-detergent-pods-in-their-mouth-and-posting-videos-online.html", "country": "US", "domain_rank": 767, "title": "Tide Pod Challenge: Teens are putting detergent pods in their mouth and posting videos online", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T20:55:00.000+02:00", "replies_count": 0, "uuid": "1fd6ec338220af07385c6fc4bac8057f6d074cb1"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/12/tide-pod-challenge-teens-are-putting-detergent-pods-in-their-mouth-and-posting-videos-online.html", "ord_in_thread": 0, "title": "Tide Pod Challenge: Teens are putting detergent pods in their mouth and posting videos online", "locations": [], "entities": {"persons": [{"name": "sam", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [], "organizations": [{"name": "american association of poison control centers", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As part of a dangerous new online challenge, teens are putting laundry pods in their mouth.\nIt all started as jokes. The lure of Tide Pods, which look almost like candy, broke into satirical conversations as early as 2015 when The Onion published a column from the perspective of a child who wanted to eat a blue and red detergent pod . This followed numerous reports pods were getting into the hands of curious toddlers, which can cause serious harm .\nIn 2017, poison control centers received reports of more than 10,500 exposures to highly concentrated packs of laundry detergent by children 5 and younger, according to the American Association of Poison Control Centers .\nRead more: \nU.N., African countries blast Trump's 'racist' words in angry global backlash \nSee if your Sam's Club is closing. Here's the list \nHow we covered the real assassination of Gianni Versace \nA March 2017 video likely generated the biggest conversation about students eating pods. In College Humor's Don't Eat The Laundry Pods video, viewers see a college student tempted to eat Tide Pods. After researching how toxic the pods are, he still ends up gorging on a bowl full of pods. The video ends with the student saying he doesn't regret it on an emergency backboard. Ideas, and even dares about eating the pods followed on Reddit and Twitter.\nNow, videos of teens putting Tide Pods in their mouth and even cooking with them are making the rounds online as part of the \"Tide Pod Challenge.\"\nIt's alarming.\nMany know the pods pose serious health risk for children and nonprofit Consumer Reports has also pointed out lethal risks for adults with dementia . Healthy teens or adults who eat or even bite into the pods could also experience symptoms.\nDr. Alfred Aleguas Jr., managing director of the Florida Poison Information Center in Tampa, said if someone mimicked the College Humor video, they could find themselves in a \"life-threatening\" situation. Swallowing even a small amount of the highly-concentrated detergent found in pods (which can happen if people bite it and spit contents out), can cause diarrhea and vomiting. In some cases, some of the detergent could even find its way into the lungs and cause breathing difficulties.\nWhile some teens might not have extreme symptoms, the health risk won't be apparent until it happens. Aleguas said he's seen situations where people who don't know they have underlying medical conditions try a stunt like this and must be rushed to a hospital.\n\"Ending up in the emergency room is no joke,\" he said.\nTide has a page on its website dedicated to safe handling of its products , advising consumers to drink a glass of water or milk if a product is swallowed and call for help. If you or someone you know has eaten a laundry detergent pod, call the national poison help hotline at 1-800-222-1222 or text POISON to 797979 to save the number in your phone.\n\"Our laundry pacs are a highly concentrated detergent meant to clean clothes … They should not be played with, whatever the circumstance is, even if meant as a joke,\" Tide said in a statement.", "external_links": [], "published": "2018-01-12T20:55:00.000+02:00", "crawled": "2018-01-12T21:29:50.011+02:00", "highlightTitle": ""}