{"organizations": [], "uuid": "af6f05c5fa187197e2bcf9b19d91484128713988", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-sai-global-expands-executive-leadership-team-to-accelerate-growth-and-innovation.html", "country": "US", "domain_rank": 767, "title": "SAI Global expands executive leadership team to accelerate growth and innovation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:59:00.000+02:00", "replies_count": 0, "uuid": "af6f05c5fa187197e2bcf9b19d91484128713988"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-sai-global-expands-executive-leadership-team-to-accelerate-growth-and-innovation.html", "ord_in_thread": 0, "title": "SAI Global expands executive leadership team to accelerate growth and innovation", "locations": [], "entities": {"persons": [{"name": "peter granat", "sentiment": "none"}, {"name": "paul j", "sentiment": "none"}, {"name": "sharon sritong", "sentiment": "none"}, {"name": "sharon", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "sai global", "sentiment": "negative"}, {"name": "computershare", "sentiment": "none"}, {"name": "livingston international", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New hires round out c-suite to support operations, product innovation and commercial strategy\nSYDNEY and CHICAGO, Jan. 24, 2018 /PRNewswire/ -- SAI Global, a leading provider of integrated risk management solutions, assurance and property services, today announced the addition of five strategic hires to the executive leadership team to support an aggressive growth and innovation strategy and focus in 2018.\nUnder the direction of Peter Granat, appointed Global Chief Executive Officer (CEO) in July 2017, the SAI Global executive team is expanding to deliver value for customers across the business portfolios:\nWith more than 25 years' experience across government, public and private equity owned businesses, Sharon Sritong has been appointed Chief Financial Officer. Sharon was CFO at Livingston International and was U.S. CFO for Computershare, playing an instrumental role in driving that company's growth and expansion throughout North America. Sritong will be based in Chicago, IL and her role is critical to improving operating effectiveness and efficiencies across the organization. Paul Johns has been appointed Chief Marketing Officer, bringing a wealth of experience that will help drive the company's global commercial strategy. An established governance, risk and compliance thought-leader, Johns formerly led global marketing communications for Thomson Reuters' $6.1bn Financial and Risk division where he moved the business from a perceived point provider to an enterprise platform company. Johns will be based in Waltham, MA. Prior to joining SAI Global, Michael Wons served as the first State-wide Chief Technology Officer (CTO) for the State of Illinois where he established the Illinois \"FIRST\" strategy for innovation. Wons has been appointed Chief Technology and Product Officer, a role in which he will lead the strategic technological execution and software development pivotal to the company's innovation agenda. Wons will be based in Chicago, IL. John Rowley has been appointed CEO of SAI Global's Assurance business and will lead the growth and expansion strategy. Rowley brings strong experience in the industry from his position as Global Managing Director of the Lloyds Register Quality Assurance (LRQA) & Inspection Services businesses, during which time he transformed the performance of the LRQA business. Previously John held various business leadership roles in the Asia Pacific region with the St. Paul, MN based Ecolab Inc. delivering results, business transformation and growth. Rowley will be based on Sydney, A.U. Darshini Brown has been appointed Chief Human Resources Officer and brings more than twenty years of diverse human resources experience leading both private and public companies through transformations. Most recently, Brown held the position of SVP, Human Resources at Trustwave, a global cybersecurity & managed security services firm, also headquartered in Chicago.\n\"Adding these talented individuals to our team, we round out a strong leadership bench that, working together, will accelerate our growth and deliver value to our customers,\" said Peter Granat, SAI Global CEO. \"We are investing heavily in our operating model, product innovation and how we go to market, strengthening our mission to help companies take an integrated approach to managing risk and delivering business confidence.\"\nAbout SAI Global\nSAI Global, a provider of integrated risk management solutions, assurance and property services, helps organizations proactively manage risk to create trust and achieve business confidence, growth, and sustainability.\nOur integrated risk management solutions are a combination of leading capabilities, services and advisory offerings that operate across the entire risk lifecycle allowing businesses to focus else ware.\nWe are a trusted provider of standards, technical information and regulatory content to organizations globally. Our accredited audit and certification services, based on third-party endorsed management systems and world-class training, help organizations gain efficiencies, improve performance and ensure compliance. In Australia, we are largest provider of property information and settlement services and support confident decision making across all stages of the property lifecycle.\nUnderpinning all SAI Global's solutions are proven and trusted business methodologies, powered by local expertise and know how. The company has global reach with locations across Europe, the Middle East, Africa, the Americas, Asia and the Pacific. For more visit www.saiglobal.com .\nMedia enquiries:\nJacqueline Fleming\nGlobal Head of Corporate Communications and Public Relations\nSAI Global\nE: Jacqueline.Fleming@saiglobal.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/sai-global-expands-executive-leadership-team-to-accelerate-growth-and-innovation-300587459.html\nSOURCE SAI Global", "external_links": ["http://www.saiglobal.com/", "http://www.prnewswire.com/news-releases/sai-global-expands-executive-leadership-team-to-accelerate-growth-and-innovation-300587459.html"], "published": "2018-01-24T16:59:00.000+02:00", "crawled": "2018-01-24T16:56:48.008+02:00", "highlightTitle": ""}