{"organizations": [], "uuid": "09434cb05399472f57ee5ed69fc04ff9613725a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/ethereum-price-2018-bitcoin-ripple.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/17/bitcoin-cryptocurrency-crash-winners/", "country": "US", "domain_rank": 1196, "title": "Cryptocurrency: 6 of the Top 10 Show Gains in the Past Month | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.611, "site_type": "news", "published": "2018-01-17T12:18:00.000+02:00", "replies_count": 0, "uuid": "09434cb05399472f57ee5ed69fc04ff9613725a2"}, "author": "Chris Morris", "url": "http://fortune.com/2018/01/17/bitcoin-cryptocurrency-crash-winners/", "ord_in_thread": 0, "title": "Cryptocurrency: 6 of the Top 10 Show Gains in the Past Month | Fortune", "locations": [], "entities": {"persons": [{"name": "chris morris", "sentiment": "negative"}], "locations": [{"name": "bitcoin", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Chris Morris 10:18 AM EST \nThe ongoing plunge in digital currencies like Bitcoin, Ethereum, and Ripple has resulted in massive losses for many investors. Yesterday alone, the collective losses of the top 10 cryptocurrencies topped $100 billion . \nBitcoin is leading the dive, down nearly 50% off of its highs. And given its prominence, it’s getting the most media attention. But a look at the performance of the top 10 cryptocurrencies shows that six are actually still higher than they were one month ago. \nTo be clear, all major cryptocurrencies are well off their highs. And even the six winners are trending downward at an alarming rate. But as of 9 a.m. ET Wednesday, here are the coins that are worth more than they were at the start of Dec. 17. \nEthereum —The second-largest cryptocurrency is still boasting a 22% jump in the past month, despite a very rocky few days, when the value has dropped more than $400 per coin. \nRipple —Once the high-flyer in the sector , Ripple has had its wings clipped of late, but it’s still showing a 38% improvement over where it stood a month ago. (That doesn’t overshadow yesterday’s loss of $19.1 billion, though.) \nCardano —The fifth-largest cryptocurrency is staying in positive territory by a fairly narrow margin. It’s up 23%, which sounds impressive until you look at actual trading prices and realize that’s about 9 cents per coin. \nNEO —The clear winner among cryptocurrency stocks, NEO is still up 122% compared to a month ago. It’s well off its high of $191 per coin (and was down another 34% in early trading Wednesday), but has held onto gains more than any other major digital currency. \nNEM —NEM is the most precarious of the cryptocurrencies that are still showing one-month gains. It’s up 17% as of Wednesday morning, but the trends aren’t looking good (with a 36% drop in early trading). \nStellar —While it’s more than 60% off of its highs, Stellar is still doing pretty…well, stellar. It has gained 56% in value over the past month, though the falls of the past two days have been especially steep. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-17T12:18:00.000+02:00", "crawled": "2018-01-17T19:12:46.000+02:00", "highlightTitle": ""}