{"organizations": [], "uuid": "cfb6baa984b7b496f92e93e71caa6b9d9ed411c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222415074&w=1200&r=LYNXMPEE0F0TE", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-russia-election-pollster/russian-pollster-pulls-pre-election-research-over-closure-fears-idUSKBN1F51GA", "country": "US", "domain_rank": 408, "title": "Russian pollster pulls pre-election research over closure fears", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:40:00.000+02:00", "replies_count": 0, "uuid": "cfb6baa984b7b496f92e93e71caa6b9d9ed411c5"}, "author": "", "url": "https://www.reuters.com/article/us-russia-election-pollster/russian-pollster-pulls-pre-election-research-over-closure-fears-idUSKBN1F51GA", "ord_in_thread": 0, "title": "Russian pollster pulls pre-election research over closure fears", "locations": [], "entities": {"persons": [{"name": "vladimir putin", "sentiment": "none"}, {"name": "levada", "sentiment": "none"}, {"name": "andrew osborn", "sentiment": "none"}], "locations": [{"name": "kremlin", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "min read  moscow", "sentiment": "none"}, {"name": "levada center", "sentiment": "none"}, {"name": "vtsiom", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOSCOW (Reuters) - Russia’s only major independent pollster, the Levada Center, said on Tuesday it had stopped publishing polls about the forthcoming presidential election because it feared the authorities might shut it down for perceived meddling.\nThe move, which the Kremlin later endorsed as a necessary step to comply with the law, will reduce open source information about public sentiment ahead of the March 18 election which polls suggest incumbent Vladimir Putin, who is backed by state TV and the ruling party, will comfortably win.\nLevada is regarded as one of Russia’s three main pollsters and the only one not to be close to the authorities. But it was officially designated ‘a foreign agent’ in 2016 because of its funding, a move it and others said was designed to hobble it.\nOut of the other pollsters, VTsIOM is state-owned, while FOM, which broke away from VTsIOM in the 1990s, provides a lot of research for the Russian presidential administration.\nStepan Goncharov, a sociologist at Levada, told Reuters his organization had decided to suspend publishing pre-election polls because of its designation as “a foreign agent.”\nLev Gudkov, director of Levada, was cited by the daily Vedomosti newspaper as saying it faced fines or even closure if accused of breaking the foreign agent law and engaging in politics.\n“We are trying to understand our situation,” said Goncharov, who said Levada would continue to conduct pre-election research, but not publish it “for now” pending consultations with lawyers.\nResearch might be published after the election, he said.\nTURNOUT IN FOCUS Whilst there is little suspense about the outcome of the March election, which Putin is seen as steamrolling, there is keen interest in voter turnout as media reports say the Kremlin wants to ensure Putin is re-elected on a turnout of around 70 percent as it sees high turnout as lending him greater legitimacy.\nThe question has become politicized because opposition leader Alexei Navalny, who has been barred from running against Putin on what he says is a trumped up conviction, has launched a spoiler campaign aimed at lowering turnout.\nLevada, citing its own research, has previously said that as few as one third of Russians have said they will definitely vote, while state-owned VTsIOM has reported that 70 percent of Russians are certain to vote.\nWhen asked about Levada’s decision to stop publishing pre-election polls, Kremlin spokesman Dmitry Peskov told reporters that Levada had been left with little choice.\n“Levada is a big organization that has authority, but unfortunately, based on the law, it is a (foreign) agent ...(and) will not be able to do this line of work,” said Peskov.\nThe foreign agent law is designed to stop other countries interfering in Russian politics, something Putin has said foreign intelligence services are attempting.\nEditing by Richard Balmforth\n ", "external_links": [], "published": "2018-01-16T14:40:00.000+02:00", "crawled": "2018-01-16T14:51:59.091+02:00", "highlightTitle": ""}