{"organizations": [], "uuid": "e07d9c044c90c42df024f21315ad4cf3f2468e11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-italy-election-scenarios/new-rules-make-italys-coming-election-unknown-territory-idUSKBN1FC29S", "country": "US", "domain_rank": 408, "title": "New rules make Italy's coming election unknown territory", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T00:33:00.000+02:00", "replies_count": 0, "uuid": "e07d9c044c90c42df024f21315ad4cf3f2468e11"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-italy-election-scenarios/new-rules-make-italys-coming-election-unknown-territory-idUSKBN1FC29S", "ord_in_thread": 0, "title": "New rules make Italy's coming election unknown territory", "locations": [], "entities": {"persons": [{"name": "silvio berlusconi", "sentiment": "none"}, {"name": "sergio mattarella", "sentiment": "none"}], "locations": [{"name": "rome", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "positive"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROME (Reuters) - Italy holds national elections on March 4 under a new, complicated electoral system that mixes proportional representation with first-past-the-post balloting.\nUnlike the previous electoral system, the new law does not provide any bonus to the first-placed party or coalition. Pollsters estimate that the winner this time around will need at least 40 percent of the vote, and probably more, to govern.\nNo party or coalition has taken 40 percent of the vote in an opinion poll for months. Here are some of the more likely scenarios following the vote:\nTHE PRESIDENT‘S GOVERNMENT\nPresident Sergio Mattarella is the supreme arbiter of Italian politics and will play a central role if, as polls suggest, the ballot box delivers deadlock. One scenario would see him try to engineer a cross-party deal to create a government with a clearly defined policy program. Such an administration could be led by a technocrat.\nTHE GRAND COALITION A variation of that scenario would see the mainstream center-right and center-left parties, led respectively by former prime ministers Silvio Berlusconi and Matteo Renzi, agree to forge the sort of “Grosse Koalition” that is taking shape in Germany. This would have a more ambitious remit than the so-called “president’s government”. Both parties currently rule out such an alliance, but they managed to work together, briefly, after inconclusive 2013 national elections. However, recent polls suggest they will not have enough seats to govern, meaning they would have to try to get other groups onboard, complicating any coalition negotiations.\nCENTER-RIGHT VICTORIOUS Berlusconi’s center-right bloc has been inching up in the polls and currently stands at around 37 percent. Berlusconi says he is aiming to win 45 percent, which would enable the alliance to govern alone. His Forza Italia (Go Italy!) and Matteo Salvini’s anti-immigrant League are the two main parties in the alliance. They have agreed that whoever gets more votes will name the prime minister. Forza Italia has a five-point lead against the League at present and Berlusconi, who is barred from holding public office because of a tax fraud conviction, has yet to say who he would nominate to head the coalition government.\nSWIFT NEW ELECTIONS If no workable government can be created after March 4, some politicians have suggested Prime Minister Paolo Gentiloni’s center-left government should stay in office until new elections are held, as happened in Spain, which went to the polls twice within six months between 2015 and 2016. Some analysts have suggested that parties might give Gentiloni a limited mandate to re-write the electoral laws again, but it is hard to see consensus forming on this issue any time soon.\n5-STAR TO THE FORE The anti-establishment 5-Star Movement has backed away from its long-standing refusal to form alliances with other parties and is likely to emerge as Italy’s largest single party, with polls putting it on around 27 percent. It says this means it should get the first nod to try to form an administration and has suggested it would seek a deal based on line-by-line policy items to be carried out, rather than a formal coalition. The 5-Star is a bitter enemy of both Berlusconi and Renzi, but some analysts have speculated it could forge a coalition with either Salvini’s rightist League, or the leftist Free and Equal group. It is unclear whether either party would have enough seats to make this a feasible option. A three-way tie-up would never happen.\nReporting by Crispian Balmer, editing by Larry King\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T00:33:00.000+02:00", "crawled": "2018-01-24T15:46:35.004+02:00", "highlightTitle": ""}