{"organizations": [], "uuid": "a94d6f91a8934fcdfa006b2a7f1dc6b7a49d443b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-usa-mexico-fuel-analysis/rail-gains-steam-in-race-to-supply-mexico-with-u-s-fuel-idUSKBN1EX0WT", "country": "US", "domain_rank": 408, "title": "Rail gains steam in race to supply Mexico with U.S. fuel", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T19:08:00.000+02:00", "replies_count": 0, "uuid": "a94d6f91a8934fcdfa006b2a7f1dc6b7a49d443b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-mexico-fuel-analysis/rail-gains-steam-in-race-to-supply-mexico-with-u-s-fuel-idUSKBN1EX0WT", "ord_in_thread": 0, "title": "Rail gains steam in race to supply Mexico with U.S. fuel", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "kansas city southern", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "positive"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - A big winner from surging imports of energy products into Mexico from the United States is the rail industry, benefiting from weak pipeline systems beset by a lack of connectivity, limited capacity and rampant theft.\nFuel exports from the United States to Mexico have shot up by about 40 percent over the last two years. Today, Mexico stands as the top U.S. export market - absorbing about 1 million barrels a day, worth roughly $20 billion annually in trade. And no slowdown is on the horizon.\nFor one thing, experts say, Mexico faces supply constraints due to the poor condition of many of its refineries; for another, the country keeps adding cars, to its roads.\nOil companies have taken note, and are turning to rail shipments to move oil products across the U.S.-Mexico border. Leasing rates for some tank cars have doubled, while a clutch of new projects are underway to expand the rail infrastructure.\nPerhaps most telling: Kansas City Southern, the fourth-largest U.S. railroad, saw fuel shipments to Mexico jump over 200 percent in 2017.\n“There is a tremendous opportunity to move product into Mexico effectively by rail,” said Daniel Gordon, executive vice president of business development and strategy at refining company Delek U.S. Holdings Inc..\nTraditionally, companies moved fuel into Mexico by cargo ship, loaded it on trucks or pipelines and transported it to the country’s interior. But Mexico only has two major ports that handle half of all its fuel shipments. Moreover, poor road conditions and volume constraints make trucking expensive and slow, and its pipelines suffer from underinvestment, according to industry executives.\nDelek’s fuel shipments to Mexico by rail surged to 120,000 barrels in September, about six times what they were at the start of the year. Another company, 4J Energy of Houston, started railing diesel into Mexico in September and is a partner with one of the companies building a terminal in central Mexico.\nExxon Mobil imported its first large U.S. fuel cargo by rail in December. “It is an efficient way, a safe way,” said Martin Proske, Mexico Fuels director for Exxon Mobil.\nSECURITY AND COSTS Cross border rail trade is dominated by Kansas City Southern, whose tracks reach the densely-populated interior of the country, including Mexico City.\nIts rail lines can move fuel to centers of demand without the use of trucks, or pipelines owned by Mexico’s Pemex that cannot guarantee safe delivery. Shippers are on the hook for the majority of losses incurred on pipelines.\nWhile several pipeline projects are proceeding, rail holds the advantage, said Patrick Ottensmeyer, Kansas City Southern’s chief executive.\n“The railroad is already built. Building terminals, buying equipment, all of that is easy compared to building a 1,000-to-1,500-mile pipeline,” he said in an interview. “We have at least a three-to-five-year head start on pipelines.”\nThe company is investing in terminals capable of handling high volume shipments of fuel - up to 60,000 barrels in a single trip. In 2017, it announced partnerships with Watco Companies, WTC Industrial and Bulkmatic worth nearly $50 million to build storage terminals in Mexico.\nAlthough Kansas City Southern has long moved a variety of goods to Mexico by rail - including grains and autos - fuel has only recently emerged as a growing business.\nIt shipped about 6,350 carloads of fuel across the border in the third quarter excluding the impact from hurricanes, up from 1,675 in the first quarter, while revenue during the timeframe quadrupled to $16 million.\nHauling fuel by rail is generally more expensive than pipelines. The cost to ship 1,000 tons of fuel is $6 per kilometer for pipelines versus $37 for rail and $83 for trucks, said Eugenio Lohr, principal at The Boston Consulting Group in Mexico City.\nBut that equation is changing in Mexico because of theft by gangs siphoning fuel from pipelines. During 2016, Pemex identified 6,873 illegal taps, up more than 30 percent from 2015. In all, thieves stole more than $1 billion worth of gasoline and diesel, according to Pemex.\nMeanwhile, rail investment is spreading. Among those building terminals is Rangeland Energy, which is constructing a new terminal hub in Corpus Christi, Texas, to transport fuel primarily by rail to terminals in Mexico.\nIn Mexico, USD Group, a Houston-based company, is building a petroleum products terminal about 150 miles northwest of Mexico City. A rail loading terminal is already online in Beaumont, Texas, owned by midstream energy firm Jefferson Energy Companies, to export refined products to Mexico.\nThe Mexican market has also become a boon for tank car leasing companies. Lease rates for older tank cars being phased out in the United States that can still be used in Mexico have jumped to roughly $500 a month, up from $200 six months ago, according to Tom Williamson, owner of Transportation Consultants.\n4J Energy, which currently ships 80 railcars per month of diesel, expects to begin gasoline shipments by January and overall volumes to reach more than 100 railcars a month by February.\n“We foresee fantastic growth in this segment of the business,” said Jay Harbison, the company’s president.\nFor a graphic on fuel for Mexico from the U.S. click - reut.rs/2D6P3Gg\nAdditional reporting by Eric M. Johnson in Seattle, Jarrett Renshaw in New York and David Alire Garcia in Mexico City; editing by David Gaffen and Paul Thomasch\n ", "external_links": ["http://reut.rs/2D6P3Gg", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T19:08:00.000+02:00", "crawled": "2018-01-08T13:59:23.024+02:00", "highlightTitle": ""}