{"organizations": [], "uuid": "d1572faf6dab80c6f524046b0edb96bd910fe322", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-tenneco-provides-revenue-growth-outlook.html", "country": "US", "domain_rank": 767, "title": "Tenneco Provides Revenue Growth Outlook", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-17T15:00:00.000+02:00", "replies_count": 0, "uuid": "d1572faf6dab80c6f524046b0edb96bd910fe322"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-tenneco-provides-revenue-growth-outlook.html", "ord_in_thread": 0, "title": "Tenneco Provides Revenue Growth Outlook", "locations": [], "entities": {"persons": [], "locations": [{"name": "detroit", "sentiment": "none"}], "organizations": [{"name": "tenneco", "sentiment": "negative"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Expects Continued Revenue Growth Outpacing Industry Production\nDETROIT--(BUSINESS WIRE)-- Tenneco Inc. (NYSE: TEN) announced today that in 2018 the company expects to outpace light vehicle industry production* by 3 percentage points, in line with last year’s estimate for 2018 revenue growth. In total, the company expects 2018 revenue growth of 5 percent, driven by increases in both the Ride Performance and Clean Air product lines. This growth assumes current industry production forecasts and is at 2017 constant currency.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180117005292/en/\nTenneco 2018 Revenue Outlook (in 2017 constant currency) (Graphic: Business Wire)\nIn 2018, the company expects 5% organic growth driven by:\nContent growth on light and commercial vehicle platforms; The continued industry recovery in regulated off-highway regions.\nAssumptions for the 2018 revenue outlook include:\nGlobal industry light vehicle production +2%* Global commercial truck production about flat** Off-highway engine production in regulated regions up by low double-digits*** Organic growth is net of OE price downs Substrates estimated at 24% - 25% of total revenue\nTenneco also announced its revenue guidance for 2019 and 2020. In those years, the company expects to outperform industry production by:\n4% to 6% in 2019 3% to 5% in 2020\nTenneco will report its fourth quarter and full-year 2017 financial results on February 9, 2018.\n*IHS Automotive December 2017 global light vehicle production and Tenneco estimates.\n**Power Systems Research (PSR) January 2018 global commercial truck and bus production and Tenneco estimates.\n***Customer schedules and Tenneco estimates for off-highway engine production in North America and Europe.\nTenneco is an $8.6 billion global manufacturing company with headquarters in Lake Forest, Illinois and approximately 31,000 employees worldwide. Tenneco is one of the world’s largest designers, manufacturers and marketers of clean air and ride performance products and systems for automotive and commercial vehicle original equipment markets and the aftermarket. Tenneco’s principal brand names are Monroe®, Walker®, XNOx™ and Clevite®Elastomers.\nRevenue estimates in this release are based on OE manufacturers' programs that have been formally awarded to the company; programs where Tenneco is highly confident that it will be awarded business based on informal customer indications consistent with past practices; and Tenneco's status as supplier for the existing program and its relationship with the customer. These revenue estimates are also based on anticipated vehicle production levels and pricing, including precious metals pricing and the impact of material cost changes. Unless otherwise indicated, our revenue estimate methodology does not attempt to forecast currency fluctuations, and accordingly, reflects constant currency. For certain additional assumptions upon which these estimates are based, see the slides accompanying the January 17, 2018 webcast, which will be available on the financial section of the Tenneco website at www.tenneco.com .\nThis press release contains forward-looking statements. Words such as \"may,\" \"expects,\" \"anticipate,\" \"projects,\" \"will,\" \"outlook\" and similar expressions identify forward-looking statements. These forward-looking statements are based on the current expectations of the company (including its subsidiaries). Because these forward-looking statements involve risks and uncertainties, the company's plans, actions and actual results could differ materially. Among the factors that could cause these plans, actions and results to differ materially from current expectations are:(i) general economic, business and market conditions; (ii) changes in consumer demand, prices and the company's ability to have our products included on top selling vehicles, including any shifts in consumer preferences to lower margin vehicles, for which we may or may not have supply arrangements; (iii) changes in automotive and commercial vehicle manufacturers' production rates and their actual and forecasted requirements for the company's products such as significant production cuts that automotive manufacturers may take in response to difficult economic conditions; (iv) the overall highly competitive nature of the automobile and commercial vehicle parts industries, and any resultant inability to realize the sales represented by the company's awarded book of business which is based on anticipated pricing and volumes over the life of the applicable program; and (v) the loss of any of our large original equipment manufacturer (\"OEM\") customers (on whom we depend for a substantial portion of our revenues), or the loss of market shares by these customers if we are unable to achieve increased sales to other OEMs or any change in customer demand due to delays in the adoption or enforcement of worldwide emissions regulations. The company undertakes no obligation to update any forward-looking statement to reflect events or circumstances after the date of this press release. Additional information regarding these and other risk factors and uncertainties is detailed from time to time in the company's SEC filings, including but not limited to its annual report on Form 10-K/A for the year ended December 31, 2016.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180117005292/en/\nTenneco Inc.\nBill Dawson\nMedia inquiries\n847 482-5807\nbdawson@tenneco.com\nor\nLinae Golla\nInvestor inquires\n847 482-5162\nlgolla@tenneco.com\nSource: Tenneco Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.tenneco.com%2F&esheet=51744305&newsitemid=20180117005292&lan=en-US&anchor=www.tenneco.com&index=1&md5=8e8232f0bcfadcfa4dd989cf677404bb", "http://www.businesswire.com/news/home/20180117005292/en/"], "published": "2018-01-17T15:00:00.000+02:00", "crawled": "2018-01-17T15:50:29.000+02:00", "highlightTitle": ""}