{"organizations": [], "uuid": "ba8fe4ea8ed68cc81006b2046c5b1d25e074d164", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/27/104864105-GettyImages-522598320-southwest-baggage.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/southwest-airlines-sues-startup-that-monitored-airfare-changes.html", "country": "US", "domain_rank": 767, "title": "Southwest Airlines sues startup that monitored airfare changes", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-16T19:48:00.000+02:00", "replies_count": 0, "uuid": "ba8fe4ea8ed68cc81006b2046c5b1d25e074d164"}, "author": "Leslie Josephs", "url": "https://www.cnbc.com/2018/01/16/southwest-airlines-sues-startup-that-monitored-airfare-changes.html", "ord_in_thread": 0, "title": "Southwest Airlines sues startup that monitored airfare changes", "locations": [], "entities": {"persons": [{"name": "patrick t. fallon", "sentiment": "negative"}, {"name": "pavel yurevich", "sentiment": "none"}, {"name": "chase roberts", "sentiment": "none"}, {"name": "yurevich", "sentiment": "none"}, {"name": "roberts", "sentiment": "none"}], "locations": [{"name": "john wayne airport", "sentiment": "none"}, {"name": "santa ana", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "southwest airlines", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "negative"}, {"name": "southwest", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "monitor southwest airlines", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Patrick T. Fallon | Bloomberg | Getty Images A ground operations employee loads baggage onto a Southwest Airlines plane at John Wayne Airport in Santa Ana, California. \nThis fall, two friends had an idea: Monitor Southwest Airlines ' fares and alert travelers when prices fell. Southwest sued them. \nPavel Yurevich, an engineer, and his friend Chase Roberts, a coder, launched SWMonkey.com in November. For a $3 fee, they sent travelers an email when fares or mileage requirements dropped on Southwest's website, so they could rebook at the lower fare. Southwest allows travelers to rebook at a lower price, and then holds the difference for future travel. \n\"I thought other people would benefit from the service,\" Yurevich told CNBC, adding that he was surprised by the lawsuit because of Southwest's \"Transfarency\" advertising slogan and general consumer-friendly image. The start-up monitored the fares manually at first but then set up an algorithm to track the price changes, Yurevich said. \nFollowing cease-and-desist letters from the airline, Yurevich and Roberts ended their service in late November. They said they made $45 before they shut it down, but they have kept the website online, including details on how the service worked and two blog posts about the dispute. \nSouthwest in early January sued the startup and its founders in U.S. District Court in Dallas. In the six-count suit the airline alleges the pair broke Southwest website's terms and conditions by taking fare data off the site, broke trademark laws, and violated the Computer Fraud and Abuse Act by accessing Southwest's \"computers without authorization or in excess of authorized access.\" Fare data \nThe suit raises the question of whether airlines' fares are public information. While airfares are easily obtained, prices for certain schedules and city pairs aren't generally published. \nSouthwest, as any frequent flier on the airline knows, sells its tickets on its own website — you won't find the fares on a Priceline 's Kayak.com or Expedia — keeping a tight control on its fare information. It's not unheard of, either. For example, JetBlue recently pulled its fares off of several online travel websites . Airlines often pay a distribution fee and commissions for fares that are listed on websites other than their own. \nAirfare trackers such as Hopper.com don't have access to prices from all airlines. Hopper, for example, doesn't include Delta or Southwest fares. \n\"The smooth and secure operation of Southwest.com is a key part of our customer service experience so we restrict the use of automated scraping tools on Southwest as do other major airlines and technology companies,\" Southwest spokeswoman Lisa Tiller said in a statement. \"After repeated attempts to resolve issues with the Southwest Monkey website, Southwest is now pursuing claims associated with violations of our website terms and the unauthorized use of our trademarks.\" \nThe lawsuit \"creates an interesting question\" about fare data, said Gary Leff, who writes the View from the Wing blog. \"I think they have probably a good legal case, because the laws are fairly protective about companies and access to their computer networks.\" \nLeff added, however, that \"something that helps consumers save money isn't malicious or bad.\" \nSouthwest said in the suit it has lost at least $5,000 and will seek damages, including those to cover its legal fees. Leslie Josephs Airline Reporter for CNBC.com Related Securities", "external_links": [], "published": "2018-01-16T19:48:00.000+02:00", "crawled": "2018-01-16T20:10:22.039+02:00", "highlightTitle": ""}