{"organizations": [], "uuid": "ae9fd0694474157633d731826c8b22d93683218f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224329133&w=1200&r=LYNXMPEE0M02J", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/us-global-oil/oil-rises-on-economic-growth-opec-russian-supply-curbs-idINKBN1FC060", "country": "US", "domain_rank": 408, "title": "Oil rises on IMF economic growth outlook, OPEC-Russian supply curbs", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T06:15:00.000+02:00", "replies_count": 0, "uuid": "ae9fd0694474157633d731826c8b22d93683218f"}, "author": "", "url": "https://in.reuters.com/article/us-global-oil/oil-rises-on-economic-growth-opec-russian-supply-curbs-idINKBN1FC060", "ord_in_thread": 0, "title": "Oil rises on IMF economic growth outlook, OPEC-Russian supply curbs", "locations": [], "entities": {"persons": [{"name": "henning gloystein", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "imf", "sentiment": "negative"}, {"name": "min read  singapore", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "international monetary fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Oil prices rose on Tuesday, lifted by healthy world economic growth prospects and production curbs by OPEC, Russia and their allies.\nBrent crude futures LCOc1 were up 67 cents at $69.70 a barrel at 1401 GMT, not far off the three-year high of $70.37 reached on Jan. 15.\nU.S. West Texas Intermediate (WTI) crude futures CLc1 rose 60 cents to $64.17 a barrel. WTI reached its highest since December 2014 on Jan. 16 at $64.89.\nThe International Monetary Fund on Monday revised upward its forecast for world economic growth to 3.9 percent for 2018 and 2019, a 0.2 percentage point increase from its last update in October.\n“The IMF’s upward revision of its growth forecast is generating tailwind,” Commerzbank analysts wrote. “This further improves the already fairly rosy demand prospects on the oil market.”\nThe demand growth comes at a time of supply curbs by the Organization of the Petroleum Exporting Countries, Russia and other producers, which began in January 2017 and are due to run until the end of 2018.\nSaudi Energy Minister Khalid al-Falih told CNBC on Tuesday that while he is “still anxious” about the fragility of the oil market, “we think we’re on our way”.\nOPEC’s main objective for the cuts is to eliminate a global surplus in oil stocks and rebalance the market.\n“The outlook for 2018 is roughly balanced for most of the year, but inventories are set to rise in Q4 2018,” French bank BNP Paribas said.\nThe bank said it had raised its 2018 oil price forecasts by $10 a barrel, expecting WTI to average $60 and Brent $65.\nBut there have been signs of a possible price correction.\nCrumbling refinery profits as a result of rising feedstock prices and plentiful fuel products point to lower crude orders going forward.\nBarclays said it expected Brent to average $60 this year, $5 above its previous forecast, due to strong demand growth and falling output from OPEC member Venezuela.\nBut the British bank said it had “a bearish view on oil prices for the quarters ahead”.\nIn the long term, investors are preparing for a fall in oil demand due to the rise of electric vehicles. Bank of America Merrill Lynch said it saw “peak oil demand” by 2030, with electric vehicles replacing conventional ones by 2050.\nThe bank said that when gasoline demand peaked by 2025 and oil demand overall peaked by 2030, “refinery utilization rates may decline permanently and refining margins suffer heavily”.\nAdditional reporting by Henning Gloystein in Singapore; Editing by Dale Hudson and Edmund Blair\n ", "external_links": [], "published": "2018-01-23T06:15:00.000+02:00", "crawled": "2018-01-23T06:33:56.013+02:00", "highlightTitle": ""}