{"organizations": [], "uuid": "fc81b207360bc0c23ca4bb80735e93c6710780c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-ppg-reports-fourth-quarter-and-full-year-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "PPG Reports Fourth Quarter and Full-Year 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T14:51:00.000+02:00", "replies_count": 0, "uuid": "fc81b207360bc0c23ca4bb80735e93c6710780c5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-ppg-reports-fourth-quarter-and-full-year-2017-financial-results.html", "ord_in_thread": 0, "title": "PPG Reports Fourth Quarter and Full-Year 2017 Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "pittsburgh", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fourth quarter net sales of approximately $3.7 billion, up about 8 percent versus prior year Fourth quarter reported earnings per diluted share from continuing operations of $0.72 and adjusted earnings per diluted share from continuing operations of $1.19 Sales volume growth of 3 percent in the fourth quarter versus prior year Share repurchases of $400 million in the fourth quarter and slightly more than $800 million for the year Strong financial flexibility with approximately $1.5 billion of cash and short-term investments at year-end Commitment to deploy at least $2.4 billion on acquisitions and share repurchases in 2018\nPITTSBURGH--(BUSINESS WIRE)-- PPG (NYSE:PPG) today reported fourth quarter 2017 net sales of approximately $3.7 billion, up nearly 8 percent versus the prior year. Sales volumes increased by 3 percent year-over-year and selling prices improved sequentially for the third consecutive quarter, adding less than 1 percent to sales growth. Favorable foreign currency translation improved net sales by more than 3 percent, or about $115 million, and acquisitions-related sales, net of divestitures, added less than 1 percent to sales growth.\nFourth quarter 2017 reported net income from continuing operations was $184 million, or 72 cents per diluted share, including an unfavorable impact of 5 cents per diluted share stemming from the natural disasters that occurred in the third quarter. Adjusted net income from continuing operations was $304 million, or $1.19 per diluted share. Adjusted net income excludes net after-tax charges totaling $120 million, or 47 cents per diluted share. These net after-tax charges include: $97 million net charge related to the new U.S. Tax Cuts and Jobs Act legislation; $24 million for pension settlement charges; and $7 million for asset write-downs, partially offset by an $8 million gain from the sale of a non-operating asset. The net tax charge reflects the company’s current best estimate of the new legislation’s impact. As new information becomes available, including issuance of interpretations by regulatory bodies, the company may update this estimate. For the fourth quarter 2017, the effective tax rate was 49.7 percent and the adjusted effective tax rate was 24.3 percent. For the full year, the adjusted effective tax rate was 24.4 percent. With the enactment of the U.S. Tax Cuts and Jobs Act legislation, the company’s global effective tax rate is expected to be in the range of 23-to-24 percent for the year 2018.\nFourth quarter 2016 reported net income from continuing operations was $91 million, or 34 cents per diluted share. Adjusted net income from continuing operations was $306 million, or $1.16 per diluted share. Adjusted net income excludes net after-tax charges totaling $215 million, or 82 cents per diluted share. These net after-tax charges include: $144 million for business restructuring; $51 million for increases to legacy environmental reserves; $23 million for higher tax expense related to asbestos settlement funding; and $5 million for a premium on the early retirement of debt, partially offset by an $8 million net gain on the disposals of ownership interests in business affiliates. For the fourth quarter 2016, the effective tax rate was 31.2 percent and the adjusted effective tax rate was 24.4 percent.\n“In the fourth quarter, we delivered solid and balanced sales growth in each major region, and both reporting segments achieved at least 2 percent sales volume growth,” said Michael H. McGarry, PPG chairman and chief executive officer. “Additionally, our aggregate selling prices improved for the third consecutive quarter as we made continued progress on our margin recovery efforts, despite higher than anticipated raw material inflation in the quarter driven by ongoing supply-related issues, including production curtailments from additional environmental enforcement in China.\n“Our Performance Coatings segment delivered its highest sales volume growth of the year, growing more than 2 percent aided by continued above-market performance in automotive refinish coatings, strengthening aerospace growth and solid mid-single-digit percentage volume growth in our U.S. company-owned architectural coatings stores. Industrial Coatings maintained a mid-single-digit percentage sales volume growth rate, once again well outpacing global industrial production, led by our general industrial and packaging coatings businesses,” McGarry said.\n“For the full year, we delivered adjusted earnings per diluted share growth despite repeated disruptions to the coatings industry supply chain that resulted in significant coatings raw material inflation. We continued our legacy of aggressively managing our cost structure and delivered $50 million of full year cost savings from our 2016 restructuring program, achieving the top-end of our target. Strategically, during 2017 we completed our multi-year portfolio transformation with the sale of the U.S. fiber glass business, our last remaining non-core business, and continued our earnings-accretive focused cash deployment.\n“Our cash flow from operations was excellent, totaling over $1.5 billion for the year, including the benefit from improved operating working capital ratios. We also continued our heritage of returning cash to shareholders, with more than $1.2 billion returned in 2017 via share repurchases and dividends. We remain proud that PPG has paid annual dividends for 118 consecutive years, and increased per-share payouts for 46 consecutive years, including a 13% per-share increase in July.” McGarry continued.\n“Looking ahead, we are well positioned to benefit from broadening and more synchronized global economic growth due to our geographic reach, excellent product portfolio, and advanced customer technologies, McGarry said. We expect minimal abatement in the first half of the year to the high level of raw material inflation that the coatings industry is experiencing. We will continue to work with our customers to address the inflationary environment and expect to realize additional selling price increases in 2018. Finally, we continue to have strong financial flexibility and are committed to deploy a minimum of $2.4 billion of cash in 2018 on acquisitions and share repurchases as part of our previously communicated target to deploy $3.5 billion in 2017 and 2018 combined,” McGarry concluded.\nThe company reported year-end 2017 cash and short-term investments of approximately $1.5 billion. Also, PPG had $3.6 billion remaining on its current share repurchase authorizations at year-end 2017, including a $2.5 billion authorization approved by PPG’s Board of Directors in December.\nFourth Quarter 2017 Reportable Segment Financial Results\nPerformance Coatings segment fourth quarter net sales were $2.1 billion, up $144 million, or more than 7 percent, versus the prior year. Net sales benefited from higher selling prices across most businesses and regions, and segment sales volume growth of more than 2 percent. Favorable foreign currency translation increased net sales by about $67 mil", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestor.ppg.com%2F&esheet=51744919&newsitemid=20180118005368&lan=en-US&anchor=PPG+Investor+Center+at+www.ppg.com&index=2&md5=d740dc23cc65af3b64b8a4a2260dffac", "http://dpregister.com/10115355", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ppg.com%2F&esheet=51744919&newsitemid=20180118005368&lan=en-US&anchor=www.ppg.com&index=1&md5=a3aa83f43e7f6fc0d7ec7aae8ba44304", "http://www.businesswire.com/news/home/20180118005368/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fdpregister.com%2F10115355&esheet=51744919&newsitemid=20180118005368&lan=en-US&anchor=http%3A%2F%2Fdpregister.com%2F10115355&index=3&md5=fb674bf67297bb6aafb2df1e90396aeb", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestor.ppg.com%2F&esheet=51744919&newsitemid=20180118005368&lan=en-US&anchor=PPG+Investor+Center+at+www.ppg.com&index=4&md5=3bd3c32464c323a860f4522c394f4f65", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestor.ppg.com%2F&esheet=51744919&newsitemid=20180118005368&lan=en-US&anchor=PPG+Investor+Center+at+www.ppg.com&index=5&md5=16d954f04a909e2625895997335364dd", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestor.ppg.com&esheet=51744919&lan=en-US&anchor=investor.ppg.com&index=6&md5=54b70ad12d5b1fd61cb00b48bb4b37db"], "published": "2018-01-18T14:51:00.000+02:00", "crawled": "2018-01-18T17:09:14.000+02:00", "highlightTitle": ""}