{"organizations": [], "uuid": "b54c8a1523f853e6ca5c76a54594f4cab22b125a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-southsudan-unrest/u-s-britain-warn-south-sudan-parties-over-ceasefire-violations-idUSKBN1ER0LM", "country": "US", "domain_rank": 408, "title": "U.S, Britain warn South Sudan parties over ceasefire violations", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T11:46:00.000+02:00", "replies_count": 0, "uuid": "b54c8a1523f853e6ca5c76a54594f4cab22b125a"}, "author": "", "url": "https://www.reuters.com/article/us-southsudan-unrest/u-s-britain-warn-south-sudan-parties-over-ceasefire-violations-idUSKBN1ER0LM", "ord_in_thread": 0, "title": "U.S, Britain warn South Sudan parties over ceasefire violations", "locations": [], "entities": {"persons": [{"name": "salva kiir", "sentiment": "none"}], "locations": [{"name": "south sudan", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "sudan", "sentiment": "none"}, {"name": "addis ababa", "sentiment": "none"}, {"name": "juba", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JUBA (Reuters) - The United States, Britain and Norway have called on parties in South Sudan’s conflict to stop violating a ceasefire signed last month, their heads of mission in Juba said on Tuesday.\nThe deal aimed to end a four-year war between the government of President Salva Kiir and rebels in which tens of thousands of people have been killed. But since the signing in the Ethiopian capital there have been five reported violations for which both sides have been blamed.\nThe United States, Britain and Norway form a group that supported the 2005 accord leading to the independence of South Sudan from Sudan. They have threatened to impose individual or group sanctions for those violating the ceasefire.\nThe ceasefire is also designed to allow humanitarian groups access to civilians caught in the fighting and revive a 2015 peace deal that collapsed in 2016 after heavy fighting erupted in the capital Juba.\nOn Monday, the U.N. refugee agency (UNHCR) said it was investigating an allegation by one of the rebel groups that Kenyan security forces unlawfully deported one of their senior members from Kakuma refugee camp over the weekend.\nRebel spokesman Lam Paul Gabriel said the deportation from Kenya was a violation of the ceasefire.\n“This is a very serious matter and UNHCR has approached the Kenyan authorities to obtain further information regarding the circumstances and procedures followed for this alleged return,” a UNHCR spokeswoman in Nairobi said.\nSpokesmen for the Kenya police and the foreign affairs ministry told Reuters on Tuesday they were not aware of the incident.\nRights groups say Kenya has in recent years unlawfully deported prominent opposition members from neighboring countries to their countries of origin despite being recognized as refugees under Kenyan law.\nSouth Sudan’s presidential spokesman Ateny Wek Ateny told Reuters that the Juba government had no link to any missing citizens in Kenya.\nKiir’s decision to sack his deputy, Riek Machar, in 2013 triggered the war in the world’s youngest country. It has been fought largely along ethnic lines between forces loyal to Kiir, who is Dinka, and Machar, who is Nuer.\nThe war has forced a third of the 12 million-strong population to flee their homes.\n“We call on all signatories, and the field commanders who answer to them, to immediately end all military operations,” the three Western countries said in a statement.\nThey added that field commanders and their political bosses would be held accountable for violating the ceasefire and impeding humanitarian assistance.\nThere was no immediate comment from the army or the rebels.\nThe ceasefire was to be followed by further talks focusing on a revised power-sharing arrangement leading up to a new date for polls.\nReporting by Denis Dumo; Additional reporting by Maggie Fick in Nairobi; Writing by Duncan Miriri; Editing by Matthew Mpoke Bigg\n ", "external_links": [], "published": "2018-01-02T11:46:00.000+02:00", "crawled": "2018-01-02T12:02:27.007+02:00", "highlightTitle": ""}