{"organizations": [], "uuid": "b45cf747df0655b1f5a3f8e054078f4116a823ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/olympics-2018-iceh-veterans/olympics-canadian-veterans-return-to-korea-for-wartime-ice-hockey-memorial-idUSL3N1NE3Q9", "country": "US", "domain_rank": 408, "title": "Olympics-Canadian veterans return to Korea for wartime ice hockey memorial", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.983, "site_type": "news", "published": "2018-01-19T18:53:00.000+02:00", "replies_count": 0, "uuid": "b45cf747df0655b1f5a3f8e054078f4116a823ff"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/olympics-2018-iceh-veterans/olympics-canadian-veterans-return-to-korea-for-wartime-ice-hockey-memorial-idUSL3N1NE3Q9", "ord_in_thread": 0, "title": "Olympics-Canadian veterans return to Korea for wartime ice hockey memorial", "locations": [], "entities": {"persons": [{"name": "dennis moore", "sentiment": "negative"}, {"name": "moore", "sentiment": "none"}, {"name": "claude charland", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "korea", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "paju", "sentiment": "none"}, {"name": "imjin river", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "paju", "sentiment": "negative"}, {"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PAJU, South Korea Jan 19 (Reuters) - Canadian veteran Dennis Moore can hardly keep himself from smiling as he recounts the day he was plucked from the front lines of the Korean War to play ice hockey 66 years ago.\nLike fellow veteran Claude Charland sitting beside him, Moore carries deep scars and vivid memories from the 1950-53 conflict that saw more than 26,000 Canadian troops dispatched to fight under U.N. forces led by the United States.\nWhile the morale-boosting games on the frozen waters of the Imjin River brought only temporary respite from the fighting, for a few hours at least the troops were able to block out the noise of the nearby artillery and lose themselves in their national sport.\n“It was hard to comprehend when we were first notified that we were going to have this game of hockey,” Moore told reporters in Paju, just south of the heavily fortified border with North Korea, on Friday.\nIt only became real when his acting company commander ordered him to come down from his position on the front and swap his rifle for an ice hockey stick.\n”He drove the jeep to the rink and it only took us about five minutes to get there,“ the 87-year-old said. ”So what I‘m saying is, we weren’t too far away from the bad guys.\n”We got dressed in tents like we have here. And that brought back good memories when I walked into that dressing tent. I just felt like I was walking back into the tent in 1952.\n“And then when we got dressed and went out onto the ice, I was overwhelmed with pride.”\nInvited to South Korea to take part in an event organised by the Canadian Embassy and the city of Paju to commemorate the Imjin River games, Moore said: “In 1952, never in my wildest dreams did I think I’d be right here right now.”\n“THIS GREAT GAME”\nMoore was chosen to play for the Princess Patricia’s Canadian Light Infantry regiment, while Charland played for the Royal 22e Regiment, known as the Van Doos.\nFor Charland, the memories of the games will never fade.\n“Ever since that time it has been with us, and we’ve lived with this souvenir ... all our lives as soldiers, as retired soldiers, and as veterans of the Korean War,” he said.\nThe 88-year-old, who carried the Olympic torch on Friday as part of its route to February’s Winter Games in Pyeongchang, added: “The big lesson from this is that friendship through sport is a great asset.”\nYet the games could have become a forgotten piece of Canada’s wartime history had it not been for an old black and white photograph of the Imjin River rink hanging on the wall of a bar in Seoul.\nOwned by a Canadian, the bar also sponsored an expats’ ice hockey team called the ‘Gecko’s Glaciers’.\nAfter learning of the history behind the photograph from a visiting Korean War veteran, the Glaciers decided to establish a tournament in honour of the troops and the ‘Imjin River Memorial Cup’ was born.\nFor years the tournament was played in rinks across Seoul before news of it reached the ears of Canadian Senator Yonah Martin.\nThe first Canadian of Korean descent to serve in the senate, Martin pushed for a similar memorial game to be held in Ottawa and the inaugural “Imjin Classic” was played outdoors on the city’s Rideau Canal in 2013.\nIt has since become an annual event, featuring members of the same Canadian regiments that played against each other during the war.\nWhile the two Koreas remain divided, both Moore and Charland said they hoped to see the day when the country is reunited.\n“My only wish is that I’ll be on this side of the grass when it happens,” said Moore. “Or maybe I should say, this side of the snow.” (Editing by Toby Davis)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T18:53:00.000+02:00", "crawled": "2018-01-20T17:33:53.004+02:00", "highlightTitle": ""}