{"organizations": [], "uuid": "15e827176bce1f352dc23864f1d058961f233e2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221501733&w=1200&r=LYNXMPEE0B13D", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/uk-france-babymilk-recall/lactalis-to-widen-baby-milk-recall-to-all-products-from-plant-minister-idUKKBN1F11TA", "country": "US", "domain_rank": 408, "title": "France's Lactalis forced into new recall in baby milk scare", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T19:06:00.000+02:00", "replies_count": 0, "uuid": "15e827176bce1f352dc23864f1d058961f233e2d"}, "author": "", "url": "https://uk.reuters.com/article/uk-france-babymilk-recall/lactalis-to-widen-baby-milk-recall-to-all-products-from-plant-minister-idUKKBN1F11TA", "ord_in_thread": 0, "title": "France's Lactalis forced into new recall in baby milk scare", "locations": [], "entities": {"persons": [{"name": "le maire", "sentiment": "none"}, {"name": "richard lough", "sentiment": "none"}, {"name": "bruno le maire", "sentiment": "none"}, {"name": "gus trompiz", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "laval", "sentiment": "none"}, {"name": "craon", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "le maire", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 2:59 PM / Updated 35 minutes ago France's Lactalis forced into new recall in baby milk scare Richard Lough , Gus Trompiz 3 Min Read \nPARIS (Reuters) - French dairy group Lactalis is widening a product recall to cover all baby milk manufactured by a factory at the centre of a salmonella contamination, Finance minister Bruno Le Maire said on Friday. Employees walk in front of the entrance of the French dairy group Lactalis headquarters in Laval, western France, January 12, 2018. REUTERS/Stephane Mahe \nThe move comes as the government seeks to contain reputational damage to France’s strategic agri-business industry in overseas markets. Three dozen children have fallen ill in France and at least one other in Spain. \nAfter talks with Lactalis management Le Maire said the company would recall all infant formula milk products made at its Craon factory that were still in warehouses and on store shelves, regardless of the date of manufacture. \n“The aim of this radical step is simple: to avoid delays, problems in sorting batches and the risk of human error,” Le Maire told a news conference on Friday. \nIn a later statement Lactalis confirmed the extended recall and pledged to find and eradicate the causes of the salmonella contamination. \nImplementing the recall will be challenging. Privately owned Lactalis exports its products to dozens of countries across Europe, Africa and Asia. \nThe tough measure reflects high-level frustration at the botched handling of the crisis after France’s biggest supermarkets -- including Carrefour ( CARR.PA ), Auchan and Leclerc -- this week said that some Lactalis products subject to recalls in December still found their way onto their shelves. \nIt has been particularly embarrassing for the government after President Emmanuel Macron pushed food exports during a state visit to China this week. \nSalmonella infections can be life-threatening, particularly for young children, and the recall risks damaging Lactalis in China. Consumers in China, a fast-growing market for baby food and dairy products, are particularly sensitive to such scares after melamine-tainted baby milk led to the deaths of six children in 2008. \nThat scandal caused distrust in locally produced infant formula and benefited foreign suppliers such as Nestle ( NESN.S ), Danone ( DANO.PA ) and Lactalis. \n“I cannot guarantee that right now there isn’t a single tin of baby milk left on a shelf in a giant warehouse or in a pharmacy,” Le Maire said. “I think this (further recall) is the strongest guarantee we can give.” \nLe Maire did not say what volume of baby milk could be involved beyond the more than 12 million items already recalled last month. \nThe European Centre for Disease Prevention and Control said on Jan. 5 that one infant in Spain had fallen ill with a salmonella infection linked to contaminated Lactalis baby milk and another case in Greece was thought to be related. \nA judicial investigation is taking place in France over the contamination and a group of French parents of affected infants said on Friday that they were considering a joint lawsuit. Reporting by Gus Trompiz and Richard Lough; Editing by David Goodman", "external_links": [], "published": "2018-01-12T19:06:00.000+02:00", "crawled": "2018-01-12T19:37:57.008+02:00", "highlightTitle": ""}