{"organizations": [], "uuid": "991b16d722bbaf4280c5fd2882a9598e2d80ab0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222380363&w=1200&r=LYNXMPEE0F0KS", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-kosovo-serbs-shooting/kosovo-serb-leader-shot-dead-in-northern-town-idUSKBN1F50ZO", "country": "US", "domain_rank": 408, "title": "Kosovo Serb leader shot dead in northern town", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T11:59:00.000+02:00", "replies_count": 0, "uuid": "991b16d722bbaf4280c5fd2882a9598e2d80ab0c"}, "author": "", "url": "https://www.reuters.com/article/us-kosovo-serbs-shooting/kosovo-serb-leader-shot-dead-in-northern-town-idUSKBN1F50ZO", "ord_in_thread": 0, "title": "Kosovo Serb leader shot dead in northern town", "locations": [], "entities": {"persons": [{"name": "shyqyri syla", "sentiment": "none"}, {"name": "oliver ivanovic", "sentiment": "none"}], "locations": [{"name": "kosovo", "sentiment": "none"}, {"name": "belgrade", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "pristina", "sentiment": "none"}, {"name": "pristina", "sentiment": "none"}, {"name": "mitrovica", "sentiment": "none"}, {"name": "serbia", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PRISTINA/BELGRADE (Reuters) - Kosovo Serb leader Oliver Ivanovic, who was standing trial over the killings of ethnic Albanians during the 1998-99 war, was shot dead on Tuesday in what Serbia called an act of terrorism.\nThe killing increased tension between Kosovo and Serbia, and a round of European Union-sponsored dialogue on normalizing relations that was due to take place in Brussels was suspended at Belgrade’s request.\nThe European Union, NATO and the United States urged both sides to remain calm, and Kosovo’s authorities to bring the killers to justice. They also urged Serbia and its former province, which won independence a decade ago, to recommit to establishing normal relations.\nAfter an emergency session of Serbia’s National Security Council, President Aleksandar Vucic called the killing “an act of terrorism” and said Belgrade must be included in the investigation. He declined to say whether he believed the killing was ethnically motivated.\nIvanovic, 64, was gunned down in front of his party office in Mitrovica, a town bitterly divided between ethnic Serbs and Albanians, shortly after 8 a.m. (0700 GMT). Doctors in hospital failed to revive him.\nThere were no witnesses and no shots were heard, suggesting the weapon had been fitted with a silencer, Serbian media reported. Tanjug news agency Quote: d his lawyer as saying Ivanovic had been shot at least five times.\nPolice found a burnt-out Opel car in the town after the shooting and suspected it was linked to the attack. They offered 10,000 euros ($12,200) for significant information, and provided a secure phone line.\nThe Kosovo government, which includes former commanders of ethnic Albanian guerrillas who rose up against Belgrade’s repressive rule in the late 1990s, also condemned the attack.\n“The killing of Oliver Ivanovic challenges the law and any attempt to establish law and order throughout the entire territory of Kosovo,” it said in a statement.\nPrime Minister Ramush Haradinaj warned that the killing could be “misused” for political ends.\nKosovo’s National Security Council also met, and said authorities might seek help from the U.S. Federal Bureau of Investigation (FBI).\nPeople light candles during a gathering to commemorate Kosovo Serb leader Oliver Ivanovic, in Saint Sava church in Belgrade, Serbia, January 16, 2018. REUTERS/Igor Pavicevic “BRIDGE-WATCHERS”\nKnown as a relative moderate among mainly ultra-nationalist Kosovo Serb politicians, Ivanovic became one of the chief interlocutors for NATO, U.N. and EU officials based in Kosovo to help steer it towards stable democracy and rule of law.\nIn 2016, he was convicted of war crimes linked to the killings of four ethnic Albanians during the 1998-99 war and jailed for nine years. But after a retrial was ordered last year, he was released.\nSerbian officials dismissed the accusations against Ivanovic and said the process against him was staged.\nSlideshow (5 Images) Ivanovic came to prominence shortly after the war as one of the Mitrovica “bridge-watchers”, Serbs who sought to prevent “infiltration” by Albanians over the Ibar River bridge into the northern half of the town.\nThe bridge-watchers were often involved in ethnic violence in the early post-war period, after NATO air strikes drove out Serbian forces accused of killing and expelling Kosovo Albanian civilians in a counter-insurgency campaign.\nThe group later disbanded but many members moved into organized crime. Ivanovic entered politics and became known for advocating dialogue and compromise with Kosovo Albanians, while still rejecting Kosovo’s sovereignty.\nSome 40,000-50,000 ethnic Serbs live in northern Kosovo, resisting integration with the rest of the mainly ethnic Albanian country.\nRelations between Serbia and Kosovo have been tense since 2008, but in 2013 both parties agreed to participate in EU-sponsored reconciliation talks, a condition for both to progress towards membership of the bloc.\nHundreds gathered in front of Belgrade’s biggest church to light candles to Ivanovic.\n“Ivanovic was an honest politician, which is a rare quality, and a great Serb. He was one the few who could bring Serbs and Albanians together,” said 28-year-old carpenter Aleksandar Petrovic.\n($1 = 0.8179 euros)\nAdditional reporting by Aleksandar Vasovic in Belgrade and Gabriela Baczynska and Robin Emmot in Brussels; writing by Ivana Sekularac; editing by Mark Heinrich\n ", "external_links": [], "published": "2018-01-16T11:59:00.000+02:00", "crawled": "2018-01-16T12:15:42.005+02:00", "highlightTitle": ""}