{"organizations": [], "uuid": "67628284dfbdfbd4144aadf4919bd1a83f16bbcf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-five-prime-announces-proposed-public-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "Five Prime Announces Proposed Public Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-24T00:01:00.000+02:00", "replies_count": 0, "uuid": "67628284dfbdfbd4144aadf4919bd1a83f16bbcf"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-five-prime-announces-proposed-public-offering-of-common-stock.html", "ord_in_thread": 0, "title": "Five Prime Announces Proposed Public Offering of Common Stock", "locations": [], "entities": {"persons": [], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "nasdaq", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SOUTH SAN FRANCISCO, Calif., Jan. 23, 2018 (GLOBE NEWSWIRE) -- Five Prime Therapeutics, Inc. (Nasdaq:FPRX), a clinical-stage biotechnology company focused on discovering and developing innovative immuno-oncology protein therapeutics, announced today that it plans to offer and sell, subject to market and other conditions, $75,000,000 of shares of its common stock in an underwritten public offering. In connection with the offering, Five Prime intends to grant the underwriters in the offering a 30-day option to purchase up to an additional 15% of these shares of common stock offered in the public offering.\nFive Prime plans to use the net proceeds of the offering, together with other available funds, (i) to advance and expand the clinical development of Five Prime’s bemarituzumab (FPA144) program, including to fund Five Prime’s portion of the Phase 1/3 FIGHT trial outside of greater China, (ii) to advance clinical development of Five Prime’s cabiralizumab (FPA008) program in PVNS, (iii) to fund additional research and pre-clinical development of cabiralizumab in immuno-oncology outside of pancreatic cancer and in combination with other candidates in Five Prime’s research and development pipeline, (iv) to advance Five Prime’s FPA150 and FPT155 programs into clinical development, (v) to fund additional research and pre-clinical development activities for Five Prime’s other immuno-oncology programs and (vi) for working capital and general corporate purposes.\nGoldman Sachs & Co. LLC, J.P. Morgan Securities LLC and Leerink Partners LLC are acting as book-running managers for the offering. Wells Fargo Securities, LLC is also acting as a book-running manager for the offering.\nFive Prime filed a shelf registration statement relating to the offering with the Securities and Exchange Commission (SEC), which was effective upon filing on November 3, 2016. Five Prime will file a preliminary prospectus supplement related to the offering with the SEC, which will be available on the SEC’s website, located at www.sec.gov . Copies of the preliminary prospectus supplement and the accompanying prospectus relating to this offering, when available, may be obtained from, Goldman Sachs & Co. LLC, Attention: Prospectus Department, 200 West Street, New York, NY 10282, telephone: 1-866-471-2526, fax: 212-902-9316, email: prospectus-ny@ny.email.gs.com ; J.P. Morgan Securities LLC, Attention: Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717, or by phone at 1-866-803-9204, or by email at prospectus-eq_fi@jpmchase.com ; or Leerink Partners LLC, Attention: Syndicate Department, One Federal Street, 37th Floor, Boston, MA 02110, or by phone at 1-800-808-7525 ext. 6132, or by email at syndicate@leerink.com .\nThis press release shall not constitute an offer to sell or a solicitation of an offer to buy these securities nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nForward-Looking Statement\nThis press release contains within the meaning of the Private 1995. Words such as \"may,\" \"will,\" \"expect,\" \"plan,\" \"anticipate,\" \"estimate,\" \"intend\" and similar expressions (as well as other words or expressions referencing future events, conditions or circumstances) are intended to identify . These are based on Five Prime's expectations and assumptions as of the date of this press release. Each of these involves risks and uncertainties. Actual results may differ materially from these . Forward-looking statements contained in this press release include statements relating to Five Prime’s expectations regarding the completion, timing and size of the proposed offering, and its planned use of the net proceeds from the offering. There can be no assurance that Five Prime will be able to complete the offering on the anticipated terms, or at all. Factors that may cause actual results to differ from those expressed or implied in the in this press release are discussed in Five Prime’s filings with the U.S. Securities and Exchange Commission, including under the heading “Risk Factors” contained therein, as well as the risks identified in the registration statement and the preliminary prospectus supplement relating to the offering, including under the heading “Risk Factors” contained therein. Except as required by law, Five Prime assumes no any contained herein to reflect any change in expectations, even as new information becomes available.\nCONTACT:\nHeather Rowe\nSenior Director, Investor Relations and Corporate Communications\n415-365-5737\nheather.rowe@fiveprime.com\nSource:Five Prime Therapeutics, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/77af9429-792d-4c96-86ca-85db464cfa14", "https://www.globenewswire.com/Tracker?data=dI8KaLFTz9q1UBHS0i4De6L8bPfCgyPTUtSfixKonmcMzI-ulyil_dotBVsyebW19Sp5USh8y5wE3_AT-KgMLDFkEsnh36fDYsguZlEhcbkZJPtxc9nlsanMEwYoWB2T", "https://www.globenewswire.com/Tracker?data=YJzMy5fmV8uEF9AHPw4ctdm7pKo4Y5VD628Wp0AwPbmleN7PZi2VG47416hhcMaQS_7CmFSvcXoqxKAG1rMpCZ8iQS9mQgDCWB5s3fdVs6b2fEpJYaSGjZ_CSqzcYn4w", "https://www.globenewswire.com/Tracker?data=AmjDkhiyw1uf0hPz1ooOmEREQ10HR1OA-pk_vFJ_YQK9vY8IltI91--zOxmUk7jbDeZAkXx2z4qdIGuPGlVbStEfyf29r3ZAnoz0iiYYLOo=", "https://www.globenewswire.com/Tracker?data=YJzMy5fmV8uEF9AHPw4ctbQgqfYZXjgWnD-3komFcWrLbKbP7jGoFpYzjUHci491vBSuW7-sZRYIZCaA5xVBagEKKsCfD4sdntYoU8q8efolmfrWXvL_l4aB3kZihN0f"], "published": "2018-01-24T00:01:00.000+02:00", "crawled": "2018-01-24T00:52:28.008+02:00", "highlightTitle": ""}