{"organizations": [], "uuid": "c6c927b39074ee813e3963edd9e6fc68f5fe5ac2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/04/13/103545362-Media_West_Broadway2.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/25/google-microsoft-ford-partner-with-innovative-start-ups.html", "country": "US", "domain_rank": 767, "title": "Google, Microsoft, Ford partner with innovative start-ups", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T16:21:00.000+02:00", "replies_count": 0, "uuid": "c6c927b39074ee813e3963edd9e6fc68f5fe5ac2"}, "author": "Julia Boorstin", "url": "https://www.cnbc.com/2018/01/25/google-microsoft-ford-partner-with-innovative-start-ups.html", "ord_in_thread": 0, "title": "Google, Microsoft, Ford partner with innovative start-ups", "locations": [], "entities": {"persons": [{"name": "wework", "sentiment": "none"}, {"name": "coursera", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "portland", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}, {"name": "coursera", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "google", "sentiment": "negative"}, {"name": "ford", "sentiment": "negative"}, {"name": "microsoft", "sentiment": "negative"}, {"name": "wework", "sentiment": "none"}, {"name": "ibm", "sentiment": "none"}, {"name": "cnbc disruptors", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}, {"name": "coursera", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The companies featured on CNBC's annual Disruptor 50 list often threaten the establishment and are on their way to becoming the next generation of giants. But increasingly, the largest public companies are partnering with CNBC Disruptors to speed up their own pace of innovation.\nJust last week education technology company Coursera announced a new partnership with Alphabet 's Google to train IT professionals. Google is granting 10,000 scholarships to Coursera's online program to help meet the growing demand for tech support specialists. And Google is just the latest company to turn to Coursera to help educate their workforce. More than 500 businesses, including IBM and Intel , have partnered with Coursera to put their content on the platform and to help train their own employees.\nMicrosoft is expanding its relationship with WeWork as it looks to give employees options about where they work. In 2016, Microsoft moved 300 of its New York City employees — along with other members of its sales team — to WeWork offices in Atlanta, Portland and Philadelphia.\nSource: WeWork The lounge inside WeWork West Broadway, in New York City In New York, Microsoft employees have access to 30 different buildings throughout the city and can book space for work or private conference rooms for meetings. Microsoft says after finding 92 percent employee satisfaction, they're extending the partnership with WeWork internationally, with agreements in London and cities in Australia, Israel, India and South Korea. Microsoft says the partnership now includes engineering employees as well as those on the sales team, with more than 1,000 memberships to WeWork.\nIn the auto space, Ford is betting on Lyft . In September, Ford announced it is teaming up with Lyft on self-driving cars, working to launch Ford autonomous vehicles in Lyft's network by 2021. GM already had invested $500 million in Lyft in 2016.\nMeet the 2017 CNBC Disruptor 50 companies For pharmaceutical companies, disruptors can accelerate the pace of drug development. Moderna Therapeutics has two big pharmaceutical partnerships to bring its products to market. It's working with Merck to develop RNA-based vaccines and immunity therapies and with AstraZeneca on a range of therapeutic treatments for a number of cancers. The idea is to leverage both Moderna and its partners' areas of expertise: Moderna leads the preclinical development, AstraZeneca then takes over early clinical development, and the two companies share the profits of product sales.\nFinally, there's Quid , which was a newcomer on the 2017 Disruptor 50 list. Asset manager Salient Partners uses Quid's A.I. platform to drive the decision-making of its traders. Quid specializes in text-based data analysis, analyzing millions of documents, such as Amazon product reviews or news headlines. Salient uses Quid to understand how much the markets will be rattled by, say, the vote for Brexit.\nWhich start-ups will create the next wave of innovations that attract the attention of the public market's prominent players? The call for nominations for CNBC's 2018 Disruptor 50 list is under way: Find details and the nomination form at Disruptor50.cnbc.com .", "external_links": [], "published": "2018-01-25T16:21:00.000+02:00", "crawled": "2018-01-25T16:50:31.008+02:00", "highlightTitle": ""}