{"organizations": [], "uuid": "de97d68c3b1a84e877500505b35573a6c16123bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/25/104239737-RTSXB3Y.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/dow-25k-us-stocks-jobs-data-adp-economy.html", "country": "US", "domain_rank": 767, "title": "Dow closes in on 25,000 after strong jobs data", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.016, "site_type": "news", "published": "2018-01-04T16:32:00.000+02:00", "replies_count": 0, "uuid": "de97d68c3b1a84e877500505b35573a6c16123bc"}, "author": "Fred Imbert", "url": "https://www.cnbc.com/2018/01/04/dow-25k-us-stocks-jobs-data-adp-economy.html", "ord_in_thread": 0, "title": "Dow closes in on 25,000 after strong jobs data", "locations": [], "entities": {"persons": [{"name": "brendan mcdermid", "sentiment": "none"}, {"name": "peter boockvar", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "new york stock exchange", "sentiment": "none"}, {"name": "bleakley financial group", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "moody's analytics", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "adp", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Dow Jones industrial average broke above 25,000 for the first time on Thursday, tying the fastest 1,000-point move in its history, following the release of stronger-than-expected jobs data.\nThe 30-stock index climbed 152 points, with General Electric, DowDuPont, Merck and IBM rising about 2 percent.\n\"The Dow hitting 25,000 was a pretty wild idea even a year ago. And while its symbolically important, the real story is never just a number. It's the underlying strength that is pushing markets this high,\" said Steve Claussen, vice president of trader strategy at E-Trade.\nThe Dow broke above 24,000 for the first time on Nov. 30, or 35 calendar days prior to hitting 25,000. It also took the Dow just 35 days to rise from 20,000 to 21,000 last year.\nThe S&P 500 gained 0.5 percent, with financials rising 1.2 percent. The Nasdaq composite advanced 0.2 percent. Both indexes also hit all-time highs.\n\"Right now, we're in this Goldilocks scenario,\" said Tim Courtney, chief investment officer at Exencial Wealth Advisors. \"The news has been good. Confidence is up. Everything is lining up just right.\"\nThe U.S. private sector added 250,000 jobs in December, ADP and Moody's Analytics reported before the opening bell. Economists polled by Reuters expected a gain of 190,000.\nU.S. Treasury yields moved higher after the report was released. The 10-year yield traded at 2.46 percent, while the two-year yield rose to 1.96 percent.\n\"This was a solid number and with a near record amount of job openings, maybe more people are coming off the sidelines, enticed by higher wages which are coming,\" said Peter Boockvar, chief investment officer at Bleakley Financial Group.\nBrendan McDermid | Reuters Traders celebrate on the main trading floor of the New York Stock Exchange (NYSE) as the Dow Jones Industrial Average passes the 20,000 mark shortly after the opening of the trading session in New York, U.S., January 25, 2017. Other economic data released Thursday include the IHS Markik services PMI, which hit a seven-month low . These reports will be followed by the Labor Department's monthly jobs report, which is set for release on Friday.\nEquities are off to a strong start in 2018. On Wednesday, the Nasdaq completed its best two-day start to a year since 2006.\nThe major indexes have also notched record highs to kick off 2018. Stocks also had a strong year in 2017, with the Dow, S&P 500 and Nasdaq rising at least 19.4 percent.\n\"The naysayers missed out on a lot last year,\" said Marc Chaikin, CEO of Chaikin Analytics. \"I think this is going to be another good year for stocks.\"\nIn corporate news, Tesla , released fourth-quarter auto delivery numbers that fell short of many Wall Street estimates. The stock traded 1.1 percent lower.\nshow chapters Wharton School's Jeremy Siegel: Here are the challenges that lie ahead for the market 3 Hours Ago | 02:51", "external_links": [], "published": "2018-01-04T16:32:00.000+02:00", "crawled": "2018-01-04T16:35:35.032+02:00", "highlightTitle": ""}