{"organizations": [], "uuid": "91973883684dbb57e215ca15ac577432934a5c17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 2}, "linkedin": {"shares": 1096}, "facebook": {"likes": 8689, "shares": 8689, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/11/104891171-RTX3NZAH.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/10/south-korea-official-reportedly-readying-bill-to-ban-all-cryptocurrency-trading.html", "country": "US", "domain_rank": 767, "title": "South Korea official reportedly readying bill to ban all cryptocurrency trading", "performance_score": 10, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T05:14:00.000+02:00", "replies_count": 0, "uuid": "91973883684dbb57e215ca15ac577432934a5c17"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/10/south-korea-official-reportedly-readying-bill-to-ban-all-cryptocurrency-trading.html", "ord_in_thread": 0, "title": "South Korea official reportedly readying bill to ban all cryptocurrency trading", "locations": [], "entities": {"persons": [{"name": "reut", "sentiment": "negative"}, {"name": "coinone", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "coinone", "sentiment": "none"}, {"name": "bithumb", "sentiment": "none"}], "organizations": [{"name": "yonhap", "sentiment": "none"}, {"name": "national tax service", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bitcoin tumbled more than 12 percent following Park's remarks, before recovering. It was down 0.7 percent on the Coinbase exchange. \nEthereum tanked on the news and remained 7.6 percent lower on Coinbase. \nPark added that he couldn't disclose more specific details about a proposed shutdown of cryptocurrency trading exchanges in the country, adding that various government agencies would work together to implement several measures. \nLater in the day, South Korea's presidential office said that any potential bill \"is not a measure that has been finalized,\" according to News1, a South Korean news site. show chapters 3:48 PM ET Thu, 7 Dec 2017 | 02:00 \nReuters further reported that a press official said the proposed ban on cryptocurrency trading was announced after \"enough discussion\" with other government agencies including the nation's finance ministry and financial regulators. \nThe newswire later added that once a bill is drafted, legislation for an outright ban of virtual coin trading will require a majority vote of the total 297 members of the National Assembly, a process that could take months — or even years. \nCryptocurrency trading in South Korea is very speculative and similar to gambling. Major cryptocurrencies like bitcoin and ethereum are priced significantly higher in the country's exchanges than elsewhere in the world. For example, bitcoin traded at $17,169.65 per token at local exchange Bithumb , which was a 31 percent premium to the CoinDesk average price. show chapters 6:30 PM ET Fri, 27 Oct 2017 | 06:23 \nThat difference in price is called a \"kimchi premium\" by many traders. \nIn fact, earlier this week, industry data provider CoinMarketCap tweeted that it would exclude some South Korean exchanges in price calculations due to the \"extreme divergence in prices from the rest of the world\" and for \"limited arbitrage opportunity.\" The exchanges that were removed from the price calculation included Bithumb, Korbit and Coinone. CoinMarketCap Tweet: This morning we excluded some Korean exchanges in price calculations due to the extreme divergence in prices from the rest of the world and limited arbitrage opportunity. We are working on better tools to provide users with the averages that are most relevant to them. \nLast month, the South Korean Financial Services Commission said it was prohibiting cryptocurrency exchanges from issuing new trading accounts. If an exchange does allow new accounts, the government has the ability to take action to either stop trading or shut the exchange down, the commission said in a statement. \nThe commission added that, since much of the cryptocurrency trading was being done anonymously, users must use their real names. \nThe government also indicated it would closely monitor banks and would \"swiftly\" step in to limit fund flows into cryptocurrencies if necessary. \nBitcoin exposed stocks in South Korea took a major hit after the announcement. Shares of Omnitel, which has a bitcoin remittance business , crashed 30 percent, Vidente shares tumbled 29.96 percent, Digital Optics fell 13.7 percent and KPM Tech was down 5.48 percent. \nThat news from the justice minister comes after the country's largest cryptocurrency exchanges were raided by police and tax agencies this week for alleged tax evasion, people familiar with the investigation told Reuters. \n—CNBC's Chery Kang, Evelyn Cheng and Reuters contributed to this report. WATCH: Warren Buffett says cryptocurrency will come to a bad ending show chapters", "external_links": [], "published": "2018-01-11T05:14:00.000+02:00", "crawled": "2018-01-11T05:20:32.033+02:00", "highlightTitle": ""}