{"organizations": [], "uuid": "6670fa51fd6bc1c8f88996b32c0626745ec4d3ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221429232&w=1200&r=LYNXMPEE0B0PS", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-china-apple-data/some-chinese-apple-users-warned-by-firm-on-dodging-new-data-law-idUKKBN1F119J", "country": "US", "domain_rank": 408, "title": "Some Chinese Apple users warned by firm on dodging new data law", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T13:59:00.000+02:00", "replies_count": 0, "uuid": "6670fa51fd6bc1c8f88996b32c0626745ec4d3ce"}, "author": "", "url": "https://uk.reuters.com/article/uk-china-apple-data/some-chinese-apple-users-warned-by-firm-on-dodging-new-data-law-idUKKBN1F119J", "ord_in_thread": 0, "title": "Some Chinese Apple users warned by firm on dodging new data law", "locations": [], "entities": {"persons": [], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "apple inc", "sentiment": "none"}, {"name": "guizhou-cloud big data industry co ltd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "communist party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 11:59 AM / Updated an hour ago Some Chinese Apple users warned by firm on dodging new data law Reuters Staff 4 Min Read \nBEIJING (Reuters) - Some Chinese users of Apple Inc’s products who have created Apple IDs overseas to circumvent a new law that requires their personal data to be stored within China say they have been warned by the tech giant that they risk losing the data. A woman looks at the screen of her mobile phone in front of an Apple logo outside its store in Shanghai, China July 30, 2017. REUTERS/Aly Song \nChina introduced a new cyber security law on June 1 that imposes tougher controls over data than in Europe and the United States, including mandating that companies store all data within China and pass security reviews. \nApple announced last year that it will migrate all user data from Chinese iCloud accounts to local servers run by Guizhou-Cloud Big Data Industry Co Ltd (GCBD), which is part of a state-backed infrastructure project overseen by local Communist Party officials. \nThe move is scheduled to happen on Feb. 28, and Apple this week notified users of the shift via emails linked to Chinese iCloud accounts. \nHowever, despite earlier assurances by Apple that only local accounts will be affected, five Chinese users who had set up Apple iCloud accounts using U.S. emails, payment methods and addresses said they had received notices that they needed to opt into the transfer or risk losing their data. Their U.S. accounts did not contain any of their Chinese information, they said. \n“As far as they [Apple] know I‘m a U.S. resident with a U.S. address, phone, email and payment details,” one user in Beijing surnamed Liu, 26, told Reuters. He declined to share his full name in case his secondary account is identified and closed. \n“How could they possibly judge that I‘m a Chinese citizen?” \nIt was not immediately clear how many users in all received these warnings from Apple or how the company identified the users to send the notices. \nBut thousands of users have taken to social media to criticise the firm and crowd source workaround solutions to the new rules, which don’t give users an opt-out option that would allow them to keep their data. \nApple declined to comment on why users with U.S. Apple IDs received the notices. \nOpening foreign Apple ID accounts is one way that Chinese users are able to evade strict censorship controls by accessing overseas App Stores which host virtual private network (VPN) apps and other features. \nApple last year removed dozens of local and foreign VPN apps from its Chinese app store, as well as popular media apps and communication tools including Microsoft Corp’s Skype, cutting off a major resource for Chinese users looking to access uncensored content. \nChinese authorities maintain that the bans on foreign content - which include popular U.S. services by Facebook Inc, Alphabet Inc and Twitter Inc - are designed to maintain social stability and eliminate threats to China’s sovereignty. \nApple said last year that it has strong data privacy protections in place for its Chinese data operations, and that no backdoors will be created in any of its systems. \nHowever, some users say they are unconvinced and will disable their accounts. Other Apple loyalists told Reuters that they feared that refusing the new data terms or attempting risky solutions could mean losing their accounts or data. \n“I‘m pretty sure the is a technical issue, [but] even if you choose a different region now, you will still be unclear where your data will go after the handover,” said one user surnamed Wang, who told Reuters he has been using U.S. Apple IDs since before iPhones were available in China. \n“My iCloud service is paid in U.S. dollars and the billing address is in Portland, how can this data be in a Chinese server?” Reporting by Cate Cadell; Editing by Brenda Goh and Muralikumar Anantharaman", "external_links": [], "published": "2018-01-12T13:59:00.000+02:00", "crawled": "2018-01-12T14:36:40.007+02:00", "highlightTitle": ""}