{"organizations": [], "uuid": "93dd33bc29c9d2d1cef7a88af86c72e538e15a05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000336/device/rss", "section_title": "Janet Yellen", "url": "https://www.cnbc.com/2018/01/23/the-associated-press-senate-approves-powell-to-follow-yellen-as-fed-chair-in-feb.html", "country": "US", "domain_rank": 767, "title": "Senate approves Powell to follow Yellen as Fed chair in Feb.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T00:42:00.000+02:00", "replies_count": 0, "uuid": "93dd33bc29c9d2d1cef7a88af86c72e538e15a05"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/23/the-associated-press-senate-approves-powell-to-follow-yellen-as-fed-chair-in-feb.html", "ord_in_thread": 0, "title": "Senate approves Powell to follow Yellen as Fed chair in Feb.", "locations": [], "entities": {"persons": [{"name": "yellen", "sentiment": "negative"}, {"name": "powell", "sentiment": "negative"}, {"name": "jerome powell", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "bernie sanders", "sentiment": "none"}, {"name": "ben bernanke", "sentiment": "none"}, {"name": "janet yellen", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "senate", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "federal reserve", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — The Senate on Tuesday approved President Donald Trump's selection of Jerome Powell to be the next chairman of the Federal Reserve beginning next month.\nSenators voted 84-13 to confirm Powell to lead the nation's central bank, a post that is considered the most powerful economic position in government.\nPowell will succeed Janet Yellen, the first woman to lead the Fed, when her term ends Feb. 3. Trump decided against offering Yellen a second four-year term as chair despite widespread praise for her performance since succeeding Ben Bernanke.\nPowell, 64, has served for 5½ years on the Fed's board. A lawyer and investment manager by training, he will be the first Fed leader in 40 years without an advanced degree in economics. Many expect him to follow Yellen's cautious approach to interest rates.\nPowell, viewed as a centrist, enjoyed support from Republicans and Democrats.\nThe 13 senators who voted against Powell's nomination included four Republicans, eight Democrats and Sen. Bernie Sanders, an independent who votes with the Democrats. The vote total was initially announced as 85-12. But Sen. Dianne Feinstein, D-California, received permission to change her vote to no after the initial count had been announced.\nOne of the dissenters, Sen. Elizabeth Warren, D-Mass., said she was concerned that Powell \"will roll back critical rules that help guard against another financial crisis.\"\nBut Sen. Sherrod Brown, the top Democrat on the Senate Banking Committee, praised Powell's tenure on the Fed board.\n\"His track record over the past six years shows he is a thoughtful policymaker,\" Brown said.\nDuring the presidential race, Trump was critical of the role the Fed played in implementing the Dodd-Frank Act, the 2010 law that tightened banking regulations after the 2008 financial crisis. Trump and many Republicans in Congress contended that the stricter regulations were too burdensome for financial institutions and were a key reason why economic growth since the Great Recession ended in 2009 had been lackluster.\nPowell has signaled that he favors ways to make bank regulations less onerous, especially for smaller community banks.\nTrump will be able to essentially remake the Fed's board during his first two years in office. He has already filled the key post of vice chairman for regulation with Randal Quarles. The president has also nominated Marvin Goodfriend, a conservative economist, for another vacancy on the board.\nIn addition, he can fill three more vacancies on the seven-member board, including the key spot of Fed vice chairman, which has been vacant since Stanley Fischer left in October.\nAll told, the vacancies will have given Trump the ability to fill six of the seven board positions with his own choices. Lael Brainard will remain the lone board member not to have been chosen by Trump.\nPowell, known as a collegial consensus-builder, could help serve as a steadying force for the U.S. economy as well as a unifying figure among the central bank's policymakers. As a Fed governor, Powell has never dissented from a central bank decision.\nEducated at Princeton University with a law degree from Georgetown, Powell, known as Jay, spent many years in investment management — at Dillon Read and then at the Carlyle Group. His work there made him one of the wealthiest figures to serve on the Fed board: His most recent financial disclosure form places his wealth at between $19.7 million and $55 million. And based on how government disclosures are drafted, his wealth may actually be closer to $100 million.", "external_links": [], "published": "2018-01-24T00:42:00.000+02:00", "crawled": "2018-01-25T10:55:03.008+02:00", "highlightTitle": ""}