{"organizations": [], "uuid": "ca3d473e99f36616cdceb74e83d3422d9b3f1ed2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/politicsNews/", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-people-turner/ex-cia-director-stansfield-turner-dead-at-94-served-under-carter-idUSKBN1F806Z", "country": "US", "domain_rank": 408, "title": "Ex-CIA Director Stansfield Turner dead at 94; served under Carter", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T04:10:00.000+02:00", "replies_count": 0, "uuid": "ca3d473e99f36616cdceb74e83d3422d9b3f1ed2"}, "author": "", "url": "https://www.reuters.com/article/us-people-turner/ex-cia-director-stansfield-turner-dead-at-94-served-under-carter-idUSKBN1F806Z", "ord_in_thread": 0, "title": "Ex-CIA Director Stansfield Turner dead at 94; served under Carter", "locations": [], "entities": {"persons": [{"name": "stansfield turner", "sentiment": "negative"}, {"name": "rhodes", "sentiment": "none"}, {"name": "jimmy carter", "sentiment": "none"}, {"name": "turner", "sentiment": "none"}, {"name": "pat moynihan", "sentiment": "none"}, {"name": "carter", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "old executive office building", "sentiment": "none"}, {"name": "seattle", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "navy", "sentiment": "none"}, {"name": "carter reuters", "sentiment": "none"}, {"name": "directorate of operations", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "cia", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "central intelligence", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - Stansfield Turner, a Navy admiral and Rhodes Scholar who was Director of Central Intelligence under President Jimmy Carter, died on Jan. 18 at home in Seattle, Washington. He was 94.\nHis death was confirmed by his secretary, Pat Moynihan, who did not report the cause.\nCarter signed an executive order in 1978 giving Turner authority over all U.S. intelligence agencies. He had an office in the Old Executive Office Building adjacent to the White House and personally briefed the president frequently.\nTurner did not hesitate to use the power Carter had given him, stressing the importance of employing new satellite and other technology in collecting intelligence, rather than the riskier business of recruiting human sources.\nHis October 1977 reorganization and downsizing of the CIA’s Directorate of Operations, which oversaw the collection of human intelligence and ran covert operations, was dubbed the “Halloween Massacre”.\nWhile members of the CIA’s clandestine service considered him an outsider, he took office on the heels of congressional investigations of CIA misdeeds and the end of the Vietnam War.\nAlso not forgotten or forgiven was an investigation one of his aides launched into the lunch-time drinking habits of CIA officers.\nTurner also took Panamanian General Manuel Noriega off his $100,000-retainer on the CIA payroll, although other forces in the Carter administration sought to protect him.\nTurner was CIA director during the 1979-1980 Iran hostage crisis and gave an insider’s view of Carter’s handling of the 444-day confrontation in his book “Terrorism and Democracy.”\nHe generated some controversy when he admitted publicly in the late 1970s to having used a psychic to try to locate an aircraft that had crashed in Zaire and could not be found by spy satellites.\nIn 1980, he wrote in a memo to the incoming Republicans that the CIA could not “withstand another scandal.” When it was returned to him he found a member of President Ronald Reagan’s team had written in the margin: “Too liberal, afraid of political controversy.”\nLater, Turner was a critic of the George W. Bush administration’s overhaul of U.S. intelligence agencies, which included the creation of a new post, director of national intelligence, to oversee all 15 agencies.\nHe also criticized the Bush administration’s reliance on faulty or distorted intelligence on Iraq’s weapons of mass destruction, which later proved to be non-existent, to justify the U.S. invasion of the country in March 2003.\nAn adviser to Democratic Sen. John Kerry when he ran against Bush in the 2004 presidential election, Turner was not shy about saying there had been “an intelligence failure” on Iraq.\nFILE PHOTO - Former CIA Director Stansfield Turner testifies before the U.S. Senate Committee on Government Affairs on Capitol Hill, August 16, 2004. REUTERS/Larry Downing/File Photo He signed a statement issued in June 2004 by 27 retired diplomats, military and other government officials that said Bush led the United States into an ill-planned Iraq war that weakened U.S. security.\n“Thirty years ago, we reacted in exactly the opposite direction, establishing congressional and executive controls to rein in powerful DCIs (directors of central intelligence) and prevent them from overstepping legal and ethical bounds, as they were accused of doing in the 1950s and 1960s,” he wrote.\nWhen later that month Bush nominated Porter Goss, a Florida congressman, to replace George Tenet as CIA director, Turner said: “This is the worst nomination in the history of the job.”\nARMS CONTROL ADVOCATE The retired admiral became a strong advocate for nuclear arms control after his tenure at the CIA, arguing that the United States and Russia had more atomic warheads than they could possibly use and warning that arms control was in trouble.\nTurner, who taught at the University of Maryland after leaving the CIA, published several books, including “Caging the Nuclear Genie: An American Challenge for Global Security,” where he first proposed his idea of “strategic escrow.”\nThe seeds of his hostility toward nuclear weapons were sown in 1970 when he commanded a U.S. carrier group in the eastern Mediterranean. He wanted to know the specific targets of his pilots in the event of war with the Soviet Union.\nOne young pilot told him that his target for nuclear attack was a rail bridge in Bulgaria. The bridge was so small it did not show up on photographs of targets taken by sophisticated air reconnaissance.\nTurner was astonished.\n“Nothing in Bulgaria was worth a nuclear weapon,” he told reporters in the 1990s.\nIn a statement, current CIA Director Mike Pompeo, said: “Admiral Turner was a devoted patriot and public servant who led our Agency through a turbulent period of history, including both the Soviet invasion of Afghanistan and the Iranian revolution. An analyst at heart, Admiral Turner championed analytic innovation and applied his extensive military knowledge and insight to the challenges of the day, even taking a direct role in preparing the annual estimates on Soviet offensive strategic nuclear forces.”\nBorn in Chicago on Dec. 1, 1923, Turner attended Amherst College, earned a Bachelor of Science degree in electrical engineering at the U.S. Naval Academy, and entered Oxford University as a Rhodes Scholar in 1950. He studied at Exeter College and earned a Master’s degree in Philosophy, Politics and Economics.\nBefore the CIA, Turner was the commander of the United States Second Fleet in the Atlantic. In 1975, he was promoted to the rank of admiral, and became commander-in-chief of NATO’s Southern Flank, with headquarters in Naples, Italy.\nHis first marriage, to Patricia Busby Whitney, ended in divorce. In January 2000, Turner was on a twin-engine plane that crashed in Costa Rica, and his second wife, Eli Karin Gilbert, was killed instantly.\nTwo years later, he married Marion Levitt Weiss of Seattle. Survivors include two adopted stepchildren from his first marriage; four more stepchildren; 12 grandchildren; and four great-grandchildren.\nReporting and writing by Reuters reporters; editing by John Walcott and Grant McCool\n ", "external_links": [], "published": "2018-01-19T04:10:00.000+02:00", "crawled": "2018-01-19T04:20:16.004+02:00", "highlightTitle": ""}