{"organizations": [], "uuid": "2567799aeb3e74a1f59ef4b56d91a5cdf505a13c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/taiwan-economy-orders/rpt-update-1-taiwan-with-strong-dec-won-record-export-orders-in-2017-idUSL4N1PH3ES", "country": "US", "domain_rank": 408, "title": "RPT-UPDATE 1-Taiwan, with strong Dec, won record export orders in 2017", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T11:28:00.000+02:00", "replies_count": 0, "uuid": "2567799aeb3e74a1f59ef4b56d91a5cdf505a13c"}, "author": "", "url": "https://www.reuters.com/article/taiwan-economy-orders/rpt-update-1-taiwan-with-strong-dec-won-record-export-orders-in-2017-idUSL4N1PH3ES", "ord_in_thread": 0, "title": "RPT-UPDATE 1-Taiwan, with strong Dec, won record export orders in 2017", "locations": [], "entities": {"persons": [{"name": "lin lee-jen", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "taipei", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats for technical reasons)\n* Dec export orders +17.5 pct y/y, vs Nov’s +11.6 pct\n* China Dec orders +7.9 pct y/y, U.S. +10.2 pct\n* Orders from Europe +39.3 pct y/y; from Japan +19.9 pct\n* Official: Jan orders to drop m/m, but up more than 25.1 pct y/y\nTAIPEI, Jan 22 (Reuters) - Taiwan’s export orders in December rose faster than expected, creating a record year and sending a positive signal for the island’s technology manufacturers and its 2018 economic prospects.\nDecember was the 17th straight month in which export orders increased from a year earlier. Orders surged at the fastest rate since February.\nThe economics ministry said on Monday that 2017 export orders by value reached a record $492.81 billion, 10.9 percent more than the 2016 total.\nLin Lee-jen, a ministry official, told reporters the January export orders volume is forecast to decrease 5.1 – 7.2 pct compared with December, but the total should be 25.1-27.9 percent more than a year earlier.\nTraditionally, the fourth quarter is Taiwan’s strongest for exports, and the first is the weakest.\nTaiwan’s orders are a leading indicator of demand for Asia’s exports and for hi-tech gadgets, and typically lead actual exports by two to three months.\nStrong global demand for tech gadgets has raised confidence Taiwan can meet its upwardly revised 2017 economic forecast of 2.58 percent. The government’s preliminary forecast for the fourth quarter will be announced on Jan. 31.\nDecember export orders rose 17.5 percent from a year earlier, the Ministry of Economic Affairs said, compared with 13.0 percent forecast in a Reuters poll. Orders rose 11.6 percent annually in November.\nSOME COOLING OFF Boosting December performance was double-digit growth of key goods, including information communication products, which reached a record high for the month of $15.9 billion.\nFor international mobile devices sales, December export orders saw a large increase, and was also aided by strong demand for computer servers. However, notebook computer assembly and installation related products entered a slow season early, the ministry added.\nKevin Wang, an analyst at Taishin investment advisory company, agrees orders will cool in January, after data indicated strong export orders in December for the iPhone of Apple Inc.\n“We estimate January export orders will turn weak, but first quarter can maintain single-digit growth,” he said.\nTaiwan’s solid order growth indicates continuing strength for Asian exporters who have benefited from global demand for new smartphone models and memory chips.\nExport orders from China rose 7.9 percent from a year earlier and they were up 10.2 percent from the United States. Orders rose 39.3 percent from the European Union and 19.9 percent from Japan.\nLast week, tech giant Taiwan Semiconductor Manufacturing Co posted better than expected fourth quarter results, expecting revenue to grow between 10-15 percent this year, versus 3.1 percent in 2017. (Reporting by Jeanny Kao and Jess Macy Yu; Additional reporting by Emily Chan; Editing by Richard Borsuk)\n ", "external_links": [], "published": "2018-01-22T11:28:00.000+02:00", "crawled": "2018-01-22T11:52:01.010+02:00", "highlightTitle": ""}