{"organizations": [], "uuid": "6c62d8f224419fba4e2a1db75a8ce25dca864ad1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/saudi-rights/saudi-arabia-sentences-human-rights-activists-to-prison-amnesty-idINKBN1FF1JX", "country": "US", "domain_rank": 408, "title": "Saudi Arabia sentences human rights activists to prison - Amnesty", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T14:38:00.000+02:00", "replies_count": 0, "uuid": "6c62d8f224419fba4e2a1db75a8ce25dca864ad1"}, "author": "", "url": "https://in.reuters.com/article/saudi-rights/saudi-arabia-sentences-human-rights-activists-to-prison-amnesty-idINKBN1FF1JX", "ord_in_thread": 0, "title": "Saudi Arabia sentences human rights activists to prison - Amnesty", "locations": [], "entities": {"persons": [{"name": "attawi", "sentiment": "none"}, {"name": "abdullah al-attawi", "sentiment": "none"}, {"name": "mohammad al-otaibi", "sentiment": "none"}, {"name": "otaibi", "sentiment": "none"}, {"name": "mohammad bin salman", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "doha", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "qatar", "sentiment": "none"}], "organizations": [{"name": "amnesty reuters staff", "sentiment": "none"}, {"name": "amnesty", "sentiment": "none"}, {"name": "amnesty international", "sentiment": "none"}, {"name": "min read  dubai", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DUBAI (Reuters) - A Saudi court has sentenced human rights activists Mohammad al-Otaibi and Abdullah al-Attawi to 14 and seven years in prison respectively, rights group Amnesty International reported on Thursday.\nThe Saudi activists had faced charges including setting up an independent organisation and making statements harmful to the kingdom.\nAmnesty said Otaibi and Attawi were the first human rights defenders sentenced under the leadership of Crown Prince Mohammad Bin Salman.\nOtaibi was arrested at Doha airport and deported from Qatar to Saudi Arabia in May after he tried to fly with his wife to Norway where he had been granted political asylum.\nThe Saudi government’s communications office could not be reached for comment.\nAmnesty said the list of charges against them included setting up an organization before receiving authorization, spreading chaos, inciting public opinion and publishing statements harmful to the kingdom and its institutions.\nIt did not say how they pleaded. The sentences were handed down by a court in the capital Riyadh on Thursday.\n“The harsh sentencing of Mohammad al-Otaibi and Abdullah al-Attawi, who should never have been prosecuted in the first place, confirms our fears that the new leadership of Mohamed Bin Salman is determined to silence civil society and human rights defenders in the Kingdom,” Amnesty’s Middle East director Samah Hadid said in a statement.\nCrown Prince Mohammed has taken power in Western-allied Saudi Arabia, pushing a reform agenda aimed at weaning the country off oil wealth and introducing social changes.\nHowever, New York-based Human Rights Watch said last week that more than a dozen prominent political activists convicted on “vague charges arising from their peaceful activities” were serving lengthy prison sentences.\nSince the 2011 Arab Spring, Saudi authorities have stepped up efforts to curb dissent with tough new cybercrime laws, sentencing offenders to prison terms for online posts deemed insulting to the kingdom or threatening to public order.\nAn absolute monarchy, Saudi Arabia bans political parties and public forms of protest and has sentenced members of a civil rights organization who campaigned for a constitutional monarchy to decades in prison.\nReporting by Dubai Newsroom; Editing by Angus MacSwan\n ", "external_links": [], "published": "2018-01-26T14:38:00.000+02:00", "crawled": "2018-01-26T15:03:18.014+02:00", "highlightTitle": ""}