{"organizations": [], "uuid": "9e066719343277aa8c68dcf4c68e81a01b03550e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-first-busey-announces-2017-fourth-quarter-earnings.html", "country": "US", "domain_rank": 767, "title": "First Busey Announces 2017 Fourth Quarter Earnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T01:00:00.000+02:00", "replies_count": 0, "uuid": "9e066719343277aa8c68dcf4c68e81a01b03550e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-first-busey-announces-2017-fourth-quarter-earnings.html", "ord_in_thread": 0, "title": "First Busey Announces 2017 Fourth Quarter Earnings", "locations": [], "entities": {"persons": [{"name": "busey", "sentiment": "negative"}], "locations": [{"name": "champaign", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}], "organizations": [{"name": "first busey corporation", "sentiment": "none"}, {"name": "mid illinois bancorp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHAMPAIGN, Ill., Jan. 30, 2018 (GLOBE NEWSWIRE) -- (Nasdaq:BUSE)\nMessage from our President & CEO\nPositive advances in the fourth quarter of 2017 from the comparable quarter of the prior year:\nEnd of year total assets of $7.9 billion Net income of $12.3 million ($0.25 per diluted common share) Adjusted net income 1 of $22.5 million ($0.46 per diluted common share) Net interest income of $63.0 million, an increase of 41.3% End of period portfolio loans at $5.520 billion, an increase of 42.3% End of period non-interest bearing deposits at $1.597 billion, an increase of 40.8%\nOther significant highlights:\nCompleted acquisition of Mid Illinois Bancorp on October 1, 2017 Declared January 2018 dividend of $0.20, an increase of 11.1% from prior quarter\nFirst Busey Corporation (the “Company”) today reported fourth quarter 2017 net income of $12.3 million, or $0.25 per diluted common share compared to net income of $11.5 million, or $0.30 per diluted common share for the fourth quarter of 2016. Adjusted net income 1 for the fourth quarter of 2017 was $22.5 million, or $0.46 per diluted common share. Return on average assets based on adjusted net income 1 was 1.17% and return on adjusted average tangible common equity based on adjusted net income 1 was 14.35% for the fourth quarter of 2017. Net income was impacted primarily by a one-time, non-cash charge of $8.1 million in the fourth quarter of 2017, or $0.16 per diluted common share for the quarter, due to the revaluation of the Company’s net deferred tax position following the enactment of the Tax Cuts and Jobs Act (the “TCJA”).\nFor the full year, the Company reported net income of $62.7 million, or $1.45 per diluted common share compared to net income of $49.7 million, or $1.40 per diluted common share for the year ended December 31, 2016. Adjusted net income 1 for 2017 was $75.7 million, or $1.75 per diluted common share. Return on average assets based on adjusted net income 1 was 1.20% for the year 2017. In addition to the Company’s organic growth, the 2017 results benefitted from the acquisition of First Community Financial Partners, Inc. (“First Community”), since the closing of the transaction on July 2, 2017 and Mid Illinois Bancorp, Inc. (“Mid Illinois”) since the closing of the transaction on October 1, 2017.\nThe Company views certain non-operating items including, but not limited to, acquisition and restructuring charges as well as the tax adjustment related to the TCJA, as adjustments to net income. Non-operating adjustments for the fourth quarter of 2017 include $3.0 million of pre-tax acquisition costs related to First Community and Mid Illinois; $0.5 million in pre-tax other restructuring costs, and $8.1 million related to the revaluation of the Company’s net deferred tax position as a result of TCJA. The reconciliation of non-GAAP measures (including adjusted net income, adjusted efficiency ratio, adjusted return on assets (“ROA”), tangible book value and tangible book value per share), which the Company believes facilitates the assessment of its banking operations and peer comparability, is included in tabular form at the end of this release.\nOn October 1, 2017, the Company completed its acquisition of Mid Illinois headquartered in Peoria, Illinois. Upon acquisition, the Company paid $40.5 million and issued 3,115,503 shares to Mid Illinois stockholders. At the date of the acquisition, Mid Illinois’ total assets were $657.5 million, including loans of $370.0 million and total deposits of $505.6 million. It is anticipated that South Side Trust & Savings Bank of Peoria (“South Side”), a wholly-owned bank subsidiary of Mid Illinois prior to the acquisition, will be merged with and into Busey Bank in the first quarter of 2018.\n1 Adjusted net income, a non-GAAP financial measure, see non-GAAP financial Information below for reconciliation\nOverview and Strategy:\nBusey takes pride in the unique culture we are building and is honored to be recognized for several awards during 2017:\nBest Places to Work in Illinois and Best Companies to Work For in Florida for 2017 by Best Companies Group and other partners Best Banks to Work For by American Banker magazine Association for Talent Development with the 2017 BEST Award 2017 Healthiest Employers Finalist in greater St. Louis, Missouri by the St. Louis Business Journal\nPositive momentum from new partnerships with talented bankers in St. Louis, Peoria and the Chicagoland area bring an expanding pool of business opportunities to generate value and diversity across new markets. Our priorities continue to focus around balance sheet strength, profitability and growth, in that order. Commercial loans remain a driver of balance sheet growth, while credit costs remain low. Favorable mix changes continue to occur across our deposit base as our relationship model builds ongoing efficiency into funding sources. Net income in the banking, remittance processing and wealth management segments expanded on a comparative basis to prior year. With our strong capital position, an attractive core funding base, a sound credit foundation, and an active growth plan, we are poised for growth in 2018 and beyond.\nAs we reflect back on Busey's humble beginnings from January 13, 1868, we are honored to celebrate 150 years of trusted relationships across Illinois, Indiana, Missouri, Florida and beyond. As we commemorate our storied history, acknowledge our accomplishments and continue our promise of fulfilling dreams, we thank you for allowing us the opportunity to serve you, your family and our community for generations.\n/s/ Van A. Dukeman\nPresident & Chief Executive Officer\nFirst Busey Corporation\nSELECTED FINANCIAL HIGHLIGHTS 1 ( dollars in thousands, except per share data ) As of and for the As of and for the Three Months Ended Year Ended December 31 , September 30, June 30, December 31, December 31, December 31, 2017 2017 2017 2016 2017 2016 EARNINGS & PER SHARE DATA Net income $ 12,293 $ 18,784 $ 16,479 $ 11,455 $ 62,726 $ 49,694 Revenue 2 86,607 76,488 62,432 63,634 286,697 228,597 Diluted earnings per share 0.25 0.41 0.43 0.30 1.45 1.40 Cash dividends paid per share 0.18 0.18 0.18 0.17 0.72 0.68 Net income by operating segment Banking $ 16,158 $ 18,942 $ 15,855 $ 10,974 $ 65,704 $ 48,690 Remittance Processing 440 505 508 364 2,007 1,758 Wealth Management 1,469 1,237 1,675 1,486 6,229 4,388 AVERAGE BALANCES Cash and cash equivalents $ 256,626 $ 210,980 $ 258,521 $ 245,993 $ 224,648 $ 304,589 Investment securities 1,223,103 1,009,355 811,264 807,219 964,749 837,884 Loans held for sale 109,336 127,369 104,420 258,576 119,936 164,728 Portfolio loans 5,457,077 5,035,025 3,892,327 3,810,283 4,567,259 3,394,352 Interest-earning assets 6,932,750 6,282,725 4,990,573 5,046,765 5,784,408 4,630,768 Total assets 7,632,019 6,861,377 5,361,074 5,455,512 6,294,105 4,973,913 Non-interest bearing deposits 1,516,233 1,328,770 1,091,696 1,060,258 1,252,363 949,271 Interest-bearing deposits 4,434,492 4,081,753 3,258,334 3,290,710 3,760,473 3,037,537 Total deposits 5,950,725 5,410,523 4,350,030 4,350,968 5,012,836 3,986,808 Securities sold under agreements to repurchase 294,389 215,776 176,721 194,960 213,527 181,474 Interest-bearing liabilities 5,126,815 4,665,939 3,628,312 3,752,570 4,257,544 3,464,015 Total liabilities 6,699,840 6,039,162 4,756,186 4,862,532 5,554,280 4,455,661 Stockholders' common equity 932,179 822,215 604,888 592,980 739,825 518,252 Tangible stockholders' common equity 3 622,952 576,844 485,244 471,188 540,406 425,560 PERFORMANCE RATIOS Return on average assets 4 0.64 % 1.09 % 1.23 % 0.84 % 1.00 % 1.00 % Return on average common equity 4 5.23 % 9.06 % 10.93 % 7.69 % 8.48 % 9.59 % Return on average tangible common equity 3,4 7.83 % 12.92 % 13.62 % 9.67 % 11.61 % 11.68 % Net interest margin 4,5 3.68 % 3.60 % 3.47 % 3.63 % 3.58 % 3.42 % Efficiency ratio 6 58.69 % 58.92 % 56.31 % 66.32 % 58.27 % 61.80 % Non-interest revenue as a % of total revenues 2 27.20 % 26.86 % 32.14 % 29.86 % 29.07 % 32.34 % 1 Results are unaudited 2 Revenues consist of net interest income plus non-interest income, net of security gains and losses 3 Average tangible stockholders’ common equity, a non-GAAP financial measure, is defined as average common equity less average goodwill and intangibles 4 Annualized, see non-GAAP financial information below for reconciliation 5 On a tax-equivalent basis, assuming a federal income tax rate of 35% 6 Net of security gains and losses and intangible charges, see non-GAAP financial information below for reconciliation Condensed Consolidated Balance Sheets 1 As of (dollars in thousands, except per share data ) December 31, September 30, June 30, December 31, 2017 2017 2017 2016 Assets Cash and cash equivalents $ 353,272 $ 214,381 $ 249,100 $ 166,706 Investment securities 1,321,610 990,222 854,983 807,631 Loans held for sale 94,848 139,696 168,415 256,319 Commercial loans 4,030,821 3,782,463 2,828,261 2,796,130 Retail real estate and retail other loans 1,488,679 1,303,401 1,092,203 1,082,770 Portfolio loans 5,519,500 5,085,864 3,920,464 3,878,900 Allowance for loan losses (53,582 ) (51,035 ) (49,201 ) (47,795 ) Premises and equipment 116,913 100,642 79,498 77,861 Goodwill and other intangibles 308,073 247,562 118,887 121,276 Other assets 200,006 186,457 144,221 164,272 Total assets $ 7,860,640 $ 6,913,789 $ 5,531,367 $ 5,425,170 Liabilities & Stockholders' Equity Non-interest bearing deposits $ 1,597,421 $ 1,321,439 $ 1,105,041 $ 1,134,133 Interest-bearing checking, savings, and money market deposits 3,192,382 3,049,651 2,567,525 2,453,965 Time deposits 1,336,162 1,002,193 721,646 786,200 Total deposits $ 6,125,965 $ 5,373,283 $ 4,394,212 $ 4,374,298 Securities sold under agreements to repurchase 304,566 219,071 178,597 189,157 Short-term borrowings 220,000 212,850 50,000 75,000 Long-term debt 154,119 154,115 178,373 80,000 Junior subordinated debt owed to unconsolidated trusts 71,008 70,973 70,938 70,868 Other liabilities 49,979 47,429 46,132 41,533 Total liabilities $ 6,925,637 $ 6,077,721 $ 4,918,252 $ 4,830,856 Total stockholders' equity $ 935,003 $ 836,068 $ 613,115 $ 594,314 Total liabilities & stockholders' equity $ 7,860,640 $ 6,913,789 $ 5,531,367 $ 5,425,170 Share Data Book value per common share $ 19.21 $ 18.37 $ 16.03 $ 15.54 Tangible book value per common share 2 $ 12.88 $ 12.93 $ 12.92 $ 12.37 Ending number of common shares outstanding 48,685 45,519 38,248 38,236 1 Results are unaudited except for amounts reported as of December 31, 2016 2 Total common equity less goodwill and intangibles divided by shares outstanding as of period end, see non-GAAP financial information below for reconciliation\nCondensed Consolidated Statements of Operations 1 (dollars in thousands, except per share data) For the For the Three Months Ended December 31, Year Ended December 31, 2017 2016 2017 2016 Interest and fees on loans held for sale and portfolio loans $ 64,048 $ 43,483 $ 202,643 $ 147,816 Interest on investment securities 6,799 4,156 21,659 17,073 Total interest income $ 70,847 $ 47,639 $ 224,302 $ 164,889 Interest on deposits 4,874 2,067 12,932 7,065 Interest on short-term borrowings 935 299 2,074 1,034 Interest on long-term debt 1,323 65 3,404 220 Interest on junior subordinated debt owed to unconsolidated trusts 669 573 2,526 1,910 Total interest expense $ 7,801 $ 3,004 $ 20,936 $ 10,229 Net interest income $ 63,046 $ 44,635 $ 203,366 $ 154,660 Provision for loan losses 2,809 1,500 5,303 5,550 Net interest income after provision for loan losses $ 60,237 $ 43,135 $ 198,063 $ 149,110 Trust fees 6,577 5,190 23,665 20,302 Commissions and brokers' fees, net 1,133 744 3,372 2,839 Fees for customer services 7,183 6,179 25,841 23,253 Remittance processing 2,846 2,697 11,427 11,255 Mortgage revenue 2,710 2,861 11,140 11,952 Net security gains, net - 2 1,143 1,232 Other 3,112 1,328 7,886 4,336 Total non-interest income $ 23,561 $ 19,001 $ 84,474 $ 75,169 Salaries, wages and employee benefits 28,185 22,822 95,633 78,397 Net occupancy expense of premises 3,805 3,333 13,830 11,633 Furniture and equipment expense 1,966 2,027 7,089 6,591 Data processing 6,005 7,968 19,295 20,645 Amortization of intangible assets 1,570 1,281 5,245 4,438 Regulatory expense 732 585 2,535 2,859 Other 10,837 6,395 30,799 23,299 Total non-interest expense $ 53,100 $ 44,411 $ 174,426 $ 147,862 Income before income taxes $ 30,698 $ 17,725 $ 108,111 $ 76,417 Income taxes 18,405 6,270 45,385 26,723 Net income $ 12,293 $ 11,455 $ 62,726 $ 49,694 Per Share Data Basic earnings per common share $ 0.25 $ 0.30 $ 1.47 $ 1.42 Diluted earnings per common share $ 0.25 $ 0.30 $ 1.45 $ 1.40 Diluted average common shares outstanding 49,086 38,743 43,126 35,413 1 Results are unaudited except for amounts reported for the year ended December 31, 2016\nBalance Sheet Growth: During the fourth quarter of 2017, portfolio loans grew by $433.6 million to $5.520 billion, an increase of 8.5% from $5.086 billion as of September 30, 2017 and 42.3% from $3.879 billion as of December 31, 2016. Average portfolio loans increased to $4.567 billion for the year 2017 compared to $3.394 billion for the year 2016.\nThe balance of loans held for sale decreased to $94.8 million on December 31, 2017, compared to $139.7 million on September 30, 2017 and $256.3 million on December 31, 2016, due to lower mortgage volumes and increased delivery efficiency. During the fourth quarter of 2017, the Company closed on an agreement with MB Financial Bank to transfer approximately 165 residential mortgage lenders and their associated loan portfolios located in Kansas, Missouri, Nebraska, Iowa and Colorado, which the Company acquired in the Pulaski Financial Corp. acquisition. The sale resulted in a net gain of $0.9 million, partially mitigating the lower mortgage volumes experienced during the transition. Mortgage lending continues to remain an important part of the Company’s business. This transaction aligned the Company’s mortgage origination resources to its current market footprint.\nAverage interest-earning assets for the three months ended December 31, 2017 increased to $6.933 billion, an increase of 10.4% as compared to $6.283 billion for the three months ended September 30, 2017 and an increase of 37.4% as compared to $5.047 billion for the three months ended December 31, 2016. Average interest-earning assets for the year ended December 31, 2017 increased to $5.784 billion, compared to $4.631 billion in the same period of 2016, an increase of 24.9%.\nTotal deposits were $6.126 billion at December 31, 2017 an increase of 14.0% from $5.373 billion at September 30, 2017 and 40.0% from $4.374 billion at December 31, 2016. The Company remains funded primarily through core deposits with solid liquidity and significant market share in core Illinois markets.\nNet Interest Margin and Net Interest Income: Net interest income of $63.0 million in the fourth quarter of 2017 increased by 12.7% from $55.9 million in the third quarter of 2017 and increased by 41.2% from $44.6 million in the fourth quarter of 2016. Net interest income for the year 2017 was $203.4 million, an increase of 31.5% as compared to $154.7 million for the year 2016. Net purchase accounting accretion and amortization included in interest income and interest expense was $5.8 million for the fourth quarter of 2017, an increase from $3.1 million for the third quarter of 2017 and $3.3 million for the fourth quarter of 2016.\nThe net interest margin increased to 3.68% for the fourth quarter of 2017, compared to 3.60% for the third quarter of 2017 and 3.63% for the fourth quarter of 2016. Net of purchase accounting accretion and amortization, the net interest margin for the fourth quarter of 2017 was 3.34%, a decrease from 3.40% for the third quarter of 2017 and 3.37% for the fourth quarter of 2016. The net interest margin for the year 2017 increased to 3.58%, as compared to 3.42% for 2016. Net of purchase accounting accretion and amortization, the net interest margin for the year 2017 was 3.36%, an increase from 3.24% for the year 2016.\nAsset Quality: While much internal focus has been directed toward growth and managing the integration of recent acquisitions, the Company remains committed to credit quality. As of December 31, 2017, non-performing loans decreased to $27.4 million, compared to $27.9 million as of September 30, 2017, and increased from $21.6 million as of December 31, 2016. Non-performing loans were 0.50% of total portfolio loans as of December 31, 2017, compared to 0.55% as of September 30, 2017 and 0.56% as of December 31, 2016.\nThe Company recorded net charge-offs of $0.3 million for the fourth quarter of 2017, an increase compared to net recoveries of $0.3 million for the third quarter of 2017, and a decrease from net charge-offs of $1.6 million for the fourth quarter of 2016. The Company recorded net recoveries of $0.5 million for the year ended December 31, 2017, a favorable decrease from net charge-offs of $5.2 million for the year ended December 31, 2016. Allowance for loan losses as a percentage of portfolio loans was 0.97% at December 31, 2017, a decrease from 1.00% at September 30, 2017 and 1.23% at December 31, 2016. As a result of acquisitions, the Company is holding acquired loans that are carried net of a fair value adjustment for credit and interest rate marks and are only included in the allowance calculation to the extent that the reserve requirement exceeds the fair value adjustment. The Company recorded provision for loan losses of $2.8 million in the fourth quarter of 2017, an increase from $1.5 million in the third quarter of 2017 and fourth quarter of 2016. The Company recorded provision for loan losses of $5.3 million for 2017 and $5.6 million for 2016.\nWith a continued commitment to asset quality and the strength of our balance sheet, near-term loan losses are expected to remain generally low. While these results are encouraging, asset quality metrics can be generally influenced by market specific economic conditions and specific measures may fluctuate from period to period.\nAsset Quality 1 As of and for the Three Months Ended (dollars in thousands) December 31, September 30, June 30, December 31, 2017 2017 2017 2016 Portfolio loans $ 5,519,500 $ 5,085,864 $ 3,920,464 $ 3,878,900 Non-performing loans Non-accrual loans 24,624 27,430 18,935 21,423 Loans 90+ days past due 2,741 439 1,123 131 Non-performing loans, segregated by geography Illinois/ Indiana 23,093 23,680 16,655 18,104 Missouri 2,964 2,682 2,614 2,730 Florida 1,308 1,507 789 720 Loans 30-89 days past due 12,897 11,556 6,953 4,090 Other non-performing assets 1,283 1,172 480 2,518 Non-performing assets to portfolio loans and non-performing assets 0.52 % 0.57 % 0.52 % 0.62 % Allowance as a percentage of non-performing loans 195.80 % 183.13 % 245.29 % 221.75 % Allowance for loan losses to portfolio loans 0.97 % 1.00 % 1.25 % 1.23 % Net charge-offs (recoveries) $ 262 $ (340 ) $ (259 ) $ 1,552 Provision for loan losses 2,809 1,494 500 1,500 1 Results are unaudited except for amounts reported as of December 31, 2016 Fee-based Businesses: Revenues from trust fees, commissions and brokers’ fees, and remittance processing activities represented 44.8% of the Company’s non-interest income for the quarter ended December 31, 2017, providing a balance to revenue from traditional banking activities. Two of the Company’s acquisitions, Pulaski Financial Corp. and First Community had no legacy fee income in these businesses; therefore, the addition of these fee-based service offerings in these acquired bank markets is expected to provide attractive growth opportunities in future periods.\nTrust fees and commissions and brokers’ fees of $7.7 million for the fourth quarter of 2017 increased from $5.8 million for the third quarter of 2017 and $5.9 million for the fourth quarter of 2016. Trust fees and commissions and brokers’ fees grew to $27.0 million for the year ended December 31, 2017, compared to $23.1 million for the same period of 2016. Net income from the wealth management segment increased to $1.5 million for the fourth quarter of 2017, compared to $1.2 million for the third quarter of 2017 and was in line with the fourth quarter of 2016. Net income from the wealth management segment was $6.2 million for the year ended December 31, 2017, a 42.0% increase as compared to $4.4 million for the same period of 2016.\nRemittance processing revenue of $2.8 million for the fourth quarter of 2017 decreased slightly from $2.9 million for the third quarter of 2017 and increased slightly from $2.7 million in the fourth quarter of 2016. For the year ended December 31, 2017, remittance processing revenue increased to $11.4 million, compared to $11.3 million for the same period of 2016. Net income from the remittance processing segment was $0.4 million for the fourth quarter of 2017, a decrease from $0.5 million for the third quarter of 2017, but comparable to the fourth quarter of 2016. Net income from the remittance processing segment grew to $2.0 million for the year ended December 31, 2017, compared to $1.8 million for the year ended December 31, 2016.\nMortgage revenue decreased to $2.7 million in the fourth quarter of 2017 from $3.5 million in the third quarter of 2017 and $2.9 million for the fourth quarter of 2016, due to lower mortgage volumes. Mortgage revenue of $11.1 million decreased for the year ended December 31, 2017, compared to $12.0 million for the year ended December 31, 2016.\nOperating Efficiency: An active business outreach across the Company’s footprint continues to support ongoing business expansion and effectively underlies the combination of the operations acquired from recent acquisitions with that of the Company. The efficiency ratio, inclusive of acquisition and restructuring costs, of 58.3% for the year ended December 31, 2017 improved from 61.8% for the same period of 2016. Operating costs have been influenced from prior year due to the Pulaski Financial Corp. acquisition in the second quarter of 2016, the First Community acquisition in the third quarter of 2017, and the Mid Illinois acquisition in the fourth quarter of 2017; however, operational efficiency has improved. The adjusted efficiency ratio 2 was 54.7% for the quarter ended December 31, 2017, 55.0% for the quarter ended September 30, 2017 and 55.6% for the year ended December 31, 2017. The Company remains consistently focused on expense discipline.\nSpecific areas of operating performance are detailed as follows:\nSalaries, wages and employee benefits increased to $28.2 million in the fourth quarter of 2017, compared to $25.5 million in the third quarter of 2017 and $22.8 million in the fourth quarter of 2016. Salaries, wages and employee benefits increased to $95.6 million for the year ended December 31, 2017, compared to $78.4 million for the same period 2016. The recent acquisitions added to the Company’s headcount and the Company recorded total restructuring costs of $1.6 million in 2017.\nData processing expense in the fourth quarter of 2017 increased to $6.0 million, compared to $5.8 million in the third quarter of 2017, but decreased as compared to $8.0 million in the fourth quarter of 2016. For the year ended December 31, 2017, data processing expense decreased to $19.3 million compared to $20.6 million for the same period of 2016. Variances are largely related to payment of deconversion expenses related to acquisitions.\nOther operating expenses increased to $10.8 million in the fourth quarter of 2017, compared to $8.1 million in the third quarter of 2017 and $6.4 million in the fourth quarter of 2016 across multiple categories. Other operating expenses increased to $30.8 million for the year ended December 31, 2017 and $23.3 million of the same period of 2016.\n2 Adjusted efficiency ratio, a non-GAAP financial measure, see non-GAAP financial Information below for reconciliation\nCapital Strength: The Company's strong capital levels, coupled with its earnings, have allowed it to provide a steady return to its stockholders through dividends. The Company will pay a cash dividend on February 2, 2018 of $0.20 per common share to stockholders of record as of January 26, 2018. The Company has consistently paid dividends to its common stockholders since the bank holding company was organized in 1980.\nAs of December 31, 2017, First Busey continued to exceed the capital adequacy requirements necessary to be considered “well-capitalized” under applicable regulatory guidelines. The Company’s tangible stockholders’ common equity 3 (“TCE”) increased to $638.0 million at December 31, 2017, compared to $600.4 million at September 30, 2017 and $480.4 million at December 31, 2016. TCE represented 8.43% of tangible assets at December 31, 2017, compared to 8.99% at September 30, 2017 and 9.05% at December 31, 2016. 4\n3 Tangible stockholders’ common equity, see non-GAAP financial Information below for reconciliation\n4 Tangible assets, see non-GAAP financial Information below for reconciliation\nCorporate Profile\nAs of December 31, 2017, First Busey Corporation (Nasdaq:BUSE) was a $7.9 billion financial holding company headquartered in Champaign, Illinois. Busey Bank, a wholly-owned bank subsidiary, is headquartered in Champaign, Illinois and has thirty-seven banking centers serving Illinois, thirteen banking centers in the St. Louis, Missouri metropolitan area, five banking centers serving southwest Florida and a banking center in Indianapolis, Indiana. Trevett Capital Partners, a wealth management division of Busey Bank, provides asset management, investment and fiduciary services to high net worth clients in southwest Florida. The wealth management professionals of Trevett Capital Partners can be reached through trevettcapitalpartners.com . Busey Bank had total assets of $7.1 billion as of December 31, 2017.\nSouth Side Trust & Savings Bank of Peoria, First Busey Corporation’s wholly-owned bank subsidiary, is headquartered in Peoria, Illinois and has thirteen additional locations in the greater Peoria area and had total assets of $712.3 million as of December 31, 2017.\nIn addition, Busey Bank owns a retail payment processing subsidiary, FirsTech, Inc., which processes approximately 28 million transactions per year using online bill payment, lockbox processing and walk-in payments at its 4,000 agent locations in 43 states. More information about FirsTech, Inc. can be found at firstechpayments.com .\nBusey Wealth Management is a wholly-owned subsidiary of First Busey Corporation. Through Busey Trust Company, Busey Wealth Management provides asset management, investment and fiduciary services to individuals, businesses and foundations. As of December 31, 2017, Busey Wealth Management’s assets under care were approximately $6.0 billion.\nFor more information about us, visit www.busey.com .\nContacts:\nRobin N. Elliott, Chief Operating Officer & Chief Financial Officer, 217-365-4120\nJennifer L. Simons, Chief Accounting Officer, 217-365-4309\nNon-GAAP Financial Information\nThis press release contains certain financial information determined by methods other than in accordance with accounting principles generally accepted in the United States of America (“GAAP”). These measures include adjusted net income, ROA, adjusted net interest margin, adjusted efficiency ratio, tangible common equity, and tangible common equity to tangible assets. Management uses these non-GAAP measures, together with the related GAAP measures, in analysis of the Company’s performance and in making business decisions. Management also uses these measures for peer comparisons.\nA reconciliation to what management believes to be the most direct compared GAAP financial measures – net income in the case of adjusted net income and adjusted ROA, total net interest income, total non-interest income and total non-interest expense in the case of adjusted efficiency ratio, total stockholders’ equity in the case of the tangible book value per share – appears below. The Company believes each of the adjusted measures are useful for investors and management to understand the effects of certain non-interest items and provides additional perspective on the Company’s performance over time as well as comparison to the Company’s peers.\nThese non-GAAP disclosures have inherent limitations and are not audited. They should not be considered in isolation or as a substitute for the results reported in accordance with GAAP, nor are they necessarily comparable to non-GAAP performance measures that may be presented by other companies.\nReconciliation of Non-GAAP Financial Measures – Adjusted Net Income and ROA (dollars in thousands) Three Months Ended Three Months Ended Year Ended December 31, 2017 September 30, 2017 December 31, 2017 Net income $ 12,293 $ 18,784 $ 62,726 Acquisition expenses Salaries, wages, and employee benefits 120 720 840 Data processing 1,268 1,262 2,616 Other (includes professional and legal) 1,569 1,031 3,617 Other restructuring costs Salaries, wages, and employee benefits 496 - 711 Other 20 46 66 Related tax benefit (1,330 ) (1,195 ) (3,012 ) TJCA related adjustment 8,098 - 8,098 Adjusted net income $ 22,534 $ 20,648 $ 75,662 Average assets $ 7,632,019 $ 6,861,377 $ 6,294,105 Reported : ROA 1 0.64 % 1.09 % 1.00 % Adjusted : ROA 1 1.17 % 1.19 % 1.20 % 1 Annualized measure\nReconciliation of Non-GAAP Financial Measures – Adjusted Net Interest Margin (dollars in thousands) Three Months Ended Year Ended December 31,\n2017 September 30,\n2017 December 31,\n2016 December 31,\n2017 December 31,\n2016 Reported : Net interest income $ 63,046 $ 55,941 $ 44,635 $ 203,366 $ 154,660 Tax-equivalency adjustment 1,192 989 1,396 3,656 3,493 Less: Purchase accounting amortization 5,848 3,124 3,248 12,458 8,123 Adjusted : Net interest income $ 58,390 $ 53,806 $ 42,783 $ 194,564 $ 150,030 Average earning assets $ 6,932,750 $ 6,282,725 $ 5,046,765 $ 5,784,408 $ 4,630,768 Reported : Net interest margin 1 3.68 % 3.60 % 3.63 % 3.58 % 3.42 % Adjusted : Net Interest margin 1 3.34 % 3.40 % 3.37 % 3.36 % 3.24 % 1 Annualized measure\nReconciliation of Non-GAAP Financial Measures – Adjusted Efficiency Ratio (dollars in thousands) Three Months Ended Three Months Ended Year Ended December 31, 2017 September 30, 2017 December 31, 2017 Reported : Net Interest income $ 63,046 $ 55,941 $ 203,366 Tax-equivalency adjustment 1,192 989 3,656 Tax equivalent interest income $ 64,238 $ 56,930 $ 207,022 Reported : Noninterest income 23,561 20,837 84,474 Less: Security gains/losses - 290 1,143 Adjusted: Noninterest income $ 23,561 $ 20,547 $ 83,331 Reported : Noninterest expense 53,100 46,939 174,426 Less: Amortization 1,570 1,286 5,245 Non-operating adjustments: Salaries, wages, and employee benefits 616 720 1,551 Data processing 1,268 1,262 2,616 Other 1,589 1,077 3,683 Adjusted: Noninterest expense $ 48,057 $ 42,594 $ 161,331 Reported: Efficiency ratio 58.69 % 58.92 % 58.27 % Adjusted : Efficiency ratio 54.74 % 54.98 % 55.56 %\nReconciliation of Non-GAAP Financial Measures – Tangible common equity to tangible assets, Tangible book value per share, Return on average tangible common equity (dollars in thousands, except per share data) Three Months Ended December 31,\n2017 September 30,\n2017 December 31,\n2016 Total Assets $ 7,860,640 $ 6,913,789 $ 5,425,170 Less: Goodwill and other intangible assets 308,073 247,562 121,276 Tax effect of goodwill and other intangible assets (11,039 ) (11,846 ) (7,392 ) Tangible assets $ 7,563,606 $ 6,678,073 $ 5,311,286 Total stockholders’ equity 935,003 836,068 594,314 Less: Goodwill and other intangible assets 308,073 247,562 121,276 Tax effect of goodwill and other intangible assets (11,039 ) (11,846 ) (7,392 ) Tangible stockholders’ equity $ 637,969 $ 600,352 $ 480,430 Tangible common equity to tangible assets 1 8.43 % 8.99 % 9.05 % Tangible book value per share $ 12.88 $ 12.93 $ 12.37 Average stockholders' common equity $ 932,179 $ 822,215 $ 592,980 Less: Average goodwill and intangibles 309,227 245,371 121,792 Average tangible stockholders' common equity $ 622,952 $ 576,844 $ 471,188 Reported: Return on average tangible common equity 2 7.83 % 12.92 % 9.67 % Adjusted: Return on average tangible common equity 2,3 14.35 % 14.20 % NR 4 Return on average common equity 2 5.23 % 9.06 % 7.69 % 1 Tax-effected measure 2 Annualized measure 3 Calculated using adjusted net income 4 Not reported Special Note Concerning Forward-Looking Statements\nStatements made in this report, other than those concerning historical financial information, may be considered within the meaning of the Private Securities Litigation Reform Act of 1995 with respect to the financial condition, results of operations, plans, objectives, future performance and business of First Busey. Forward-looking statements, which may be based upon beliefs, expectations and assumptions of First Busey’s management and on information currently available to management, are generally identifiable by the use of words such as “believe,” “expect,” “anticipate,” “plan,” “intend,” “estimate,” “may,” “will,” “would,” “could,” “should” or other similar expressions. Additionally, all statements in this document, including , speak only as of the date they are made, and we undertake no obligation to update any statement in light of new information or future events. A number of factors, many of which are beyond our ability to control or predict, could cause actual results to differ materially from those in our . These factors include, among others, the following: (i) the strength of the local, national and international economy; (ii) the economic impact of any future terrorist threats or attacks; (iii) changes in state and federal laws, regulations and governmental policies concerning First Busey’s general business; (iv) changes in interest rates and prepayment rates of First Busey’s assets; (v) increased competition in the financial services sector and the inability to attract new customers; (vi) changes in technology and the ability to develop and maintain secure and reliable electronic systems; (vii) the loss of key executives or employees; (viii) changes in consumer spending; (ix) unexpected results of current and/or future acquisitions, which may include, failure to realize the anticipated benefits of the acquisition and the possibility that the transaction costs may be greater than anticipated; (x) unexpected outcomes of existing or new litigation involving First Busey; (xi) changes in accounting policies and practices; and (xii) the economic impact of exceptional weather occurrences such as tornadoes, hurricanes, floods, and blizzards. These risks and uncertainties should be considered in evaluating and undue reliance should not be placed on such statements. Additional information concerning First Busey and its business, including additional factors that could materially affect its financial results, is included in First Busey’s filings with the Securities and Exchange Commission.\nSource:First Busey Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/14869c88-3fec-4fe1-bdcd-b61affbbe4dc", "https://www.globenewswire.com/Tracker?data=t8kx7FIC0PpARN366TfUGhRNhVUWtHbN6uOAJgc44FF5FtDOAVsyNcZvhuxL33qGpV7S7LsiUCLirQn_cHxZBy-_hO7R_tfqpCLpqmfujzE="], "published": "2018-01-31T01:00:00.000+02:00", "crawled": "2018-01-31T02:15:26.019+02:00", "highlightTitle": ""}