{"organizations": [], "uuid": "e6bfab8676332fe45b44eab2db7ef7ab5d6f437e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/lecom-assetswap/update-1-chinas-leshi-seeks-stake-in-jia-yuetings-car-businesses-for-debt-owed-idUSL4N1PI2AI", "country": "US", "domain_rank": 408, "title": "UPDATE 1-China's Leshi seeks stake in Jia Yueting's car businesses for debt owed", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T07:57:00.000+02:00", "replies_count": 0, "uuid": "e6bfab8676332fe45b44eab2db7ef7ab5d6f437e"}, "author": "", "url": "https://www.reuters.com/article/lecom-assetswap/update-1-chinas-leshi-seeks-stake-in-jia-yuetings-car-businesses-for-debt-owed-idUSL4N1PI2AI", "ord_in_thread": 0, "title": "UPDATE 1-China's Leshi seeks stake in Jia Yueting's car businesses for debt owed", "locations": [], "entities": {"persons": [{"name": "jia yuetin", "sentiment": "negative"}, {"name": "leshi", "sentiment": "negative"}, {"name": "lucid", "sentiment": "none"}, {"name": "jia", "sentiment": "none"}, {"name": "sijia jiang", "sentiment": "none"}, {"name": "jia yueting", "sentiment": "none"}], "locations": [{"name": "leshi", "sentiment": "none"}, {"name": "jia yueting", "sentiment": "none"}, {"name": "jia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "leshi internet information and technology", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "leeco", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "faraday future", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 5:57 AM / in 22 minutes UPDATE 2-China's Leshi seeks stake in Jia Yueting's car businesses for debt owed Reuters Staff \n* Electric vehicle maker Faraday Future among Jia’s businesses \n* Leshi says owed 7.5 billion yuan by Jia’s LeEco \n* Says has financial liability totaling 9.29 billion yuan \n* Share trade to resume Jan 24 after nine-month suspension (Adds company shares to resume trading in fifth paragraph) \nBy Sijia Jiang \nHONG KONG, Jan 23 (Reuters) - China’s Leshi Internet Information and Technology is seeking equity stakes in the car businesses of its largest shareholder, Jia Yueting, for debt owed by him and his companies amounting to as much as 7.5 billion yuan ($1.17 billion). \nLeshi told an investor briefing on Tuesday it was seeking equity stakes in Jia’s car businesses, including electric vehicle companies Faraday Future, Lucid and LeSEE. \nJia, who founded the LeEco conglomerate that is now struggling to repay its debts, no longer holds any position in Shenzhen-listed Leshi but remains its largest shareholder with a 25.67 percent stake. \nLeEco did not immediately respond to emailed requests for comment. Telephone calls to its spokesman remained unanswered. \nLeshi shares will resume trading on Wednesday after a nine-month suspension, it said in a filing to the Shenzhen stock exchange on Tuesday. \nThe company asked in April for trading to be suspended pending an acquisition of LeEco’s film unit for 9.8 billion yuan ($1.53 billion), a plan it eventually scrapped last week. \nLeshi, which makes internet-connected TVs and produces video entertainment, said Jia and various non-listed units of LeEco owed it 7.5 billion yuan at the end of November. \nLeEco on Monday disputed the debt amount, saying it only owed Leshi 6 billion yuan, half of which it has arranged to repay soon. \nLeshi, which said on Tuesday that China’s TV market is estimated to have declined by 5-10 percent in 2017, has loans and liabilities totalling 9.29 billion yuan ($1.45 billion). Part of that will be due in 2018, it said last week. \nLeshi said it expects to report a loss for 2017 and warned that it would run into “operational difficulty” if it does not receive new funds to repay its own debt. \nIt also scrapped a plan to inject LeEco’s film unit into the listed company, a transaction pending which Leshi’s stock had been suspended from trading since April. \nLeshi, once the main listed vehicle of LeEco, is now controlled by property developer Sunac China, its second-largest shareholder with an 8.56 percent stake. ($1 = 6.3982 Chinese yuan) (Reporting by Sijia Jiang and Meg Shen; Editing by Muralikumar Anantharaman, Biju Dwarakanath and David Goodman)", "external_links": [], "published": "2018-01-23T07:57:00.000+02:00", "crawled": "2018-01-23T08:44:20.002+02:00", "highlightTitle": ""}