{"organizations": [], "uuid": "fb7c8f3c015b690dca81367b9270d8cbfdd211bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222014037&w=1200&r=LYNXMPEE0E01L", "site_section": "http://www.topix.com/rss/wire/business/financial-services", "section_title": "", "url": "https://www.reuters.com/article/us-global-forex/dollar-index-wallows-at-three-year-lows-euro-buoyed-by-ecb-taper-hopes-idUSKBN1F403E", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar index wallows at 3-year lows, euro buoyed by ECB taper hopes", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T08:24:00.000+02:00", "replies_count": 0, "uuid": "fb7c8f3c015b690dca81367b9270d8cbfdd211bf"}, "author": "", "url": "https://www.reuters.com/article/us-global-forex/dollar-index-wallows-at-three-year-lows-euro-buoyed-by-ecb-taper-hopes-idUSKBN1F403E", "ord_in_thread": 0, "title": "FOREX-Dollar index wallows at 3-year lows, euro buoyed by ECB taper hopes", "locations": [], "entities": {"persons": [{"name": "masafumi yamamoto", "sentiment": "none"}, {"name": "lisa twaronite", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "mizuho securities", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - The euro climbed to a three-year high to the dollar on Monday, nearing the $1.23 line as investors ramped up bets in the backdrop of growing economic optimism in the euro zone and expectations the central bank may tighten policy soon.\nEuro bulls received a shot in the arm on Monday after data showed the trade surplus in the 19-country euro area rose to its highest level in eight months, indicating a stronger euro wasn’t proving to be a headwind for companies just yet.\nThe currency’s rise also coincided with a fresh leg down on the dollar, with the euro zone’s improving economic outlook spurring more investors to rebalance their portfolios towards the region.\nSpeculators boosted net long positions in the euro to a record high in the week to Jan. 12, according to the latest futures data. Against a basket of currencies, the euro is at its highest since late 2014.\nThe dollar has weakened as markets grow increasingly confident that a global recovery would outpace U.S. growth and prompt other major central banks led by the ECB to unwind its easy policy quicker than market expectations.\nJP Morgan strategists, for one, expect eurozone’s economy to outpace that of the U.S. in 2018.\nMeasured against a basket of currencies, the dollar was down 0.5 percent on Monday .DXY, its lowest since early 2015.\n“There will be a correction [for the euro] at some point,” said Kit Juckes, London-based global strategist at Societe Generale. “But as long as the [economic] data remains strong, the market is going to believe in the idea that there is more coming. That tapering is going to be brought forward.”\nAn employee holds 2 cent euro coins at the \"Monnaie de Paris\", national mint factory in Pessac, France, November 29, 2017. REUTERS/Regis Duvignau Juckes said that the market was repricing the euro to account for the perceived change in the ECB’s monetary stance and, with fair value of the euro estimated at between $1.25 and $1.30, the single currency had further room to rise.\nThe euro EUR= was up 0.7 percent at $1.2284 after hitting a high of almost $1.23, adding to gains made last week after the ECB said it could revisit its communication stance in early 2018. That heightened expectations policymakers were preparing to reduce the stimulus program.\nHopes that a pro-European governing coalition is set to form in Germany have also boosted confidence in the continent.\n“We remain bullish on the euro in coming months because we expect that the political risks in the euro zone will finally start abating on a more sustained basis after the March election in Italy,” Credit Agricole said.\n“In addition, we expect the ECB to continue to taper its asset purchases and, ultimately, stop expanding its balance sheet.”\nStill, with the euro at three-year highs, some analysts said that its strength would soon worry the ECB, encouraging it to talk down the currency.\nThe British pound continued to rack up highs not seen since the June 2016 vote to leave the European Union. The pound added to Friday’s surge - triggered by a report that two EU member states wanted Britain to remain as close as possible to the EU after its exit - and traded as high as $1.3819.\nAgainst the yen, the dollar slipped to its lowest since mid-September as comments from the head of the Bank of Japan highlighted Japan’s economic recovery.\nThe dollar was down 0.4 percent at 110.585 yen JPY= .\nEditing by Saikat Chatterjee and David Goodman\n ", "external_links": [], "published": "2018-01-15T08:24:00.000+02:00", "crawled": "2018-01-15T08:36:55.009+02:00", "highlightTitle": ""}