{"organizations": [], "uuid": "02631df52d000f4acc6449a1ed3a20b5a04f3e17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-banco-santander-maxico-as-successor-of-grupo-financiero-santander-maxico-announces-exchange-of-shares-initial-listing-and.html", "country": "US", "domain_rank": 767, "title": "Banco Santander México As Successor Of Grupo Financiero Santander México Announces Exchange Of Shares, Initial Listing And Symbol Change To \"BSMX\" On The BMV", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-19T02:52:00.000+02:00", "replies_count": 0, "uuid": "02631df52d000f4acc6449a1ed3a20b5a04f3e17"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-banco-santander-maxico-as-successor-of-grupo-financiero-santander-maxico-announces-exchange-of-shares-initial-listing-and.html", "ord_in_thread": 0, "title": "Banco Santander México As Successor Of Grupo Financiero Santander México Announces Exchange Of Shares, Initial Listing And Symbol Change To \"BSMX\" On The BMV", "locations": [], "entities": {"persons": [{"name": "banca múlti", "sentiment": "neutral"}, {"name": "grupo financiero santander méxico", "sentiment": "none"}], "locations": [{"name": "mexico city", "sentiment": "none"}, {"name": "grupo financiero santander mexico", "sentiment": "none"}], "organizations": [{"name": "banco santander", "sentiment": "neutral"}, {"name": "public registry of commerce", "sentiment": "none"}, {"name": "banco santander méxico", "sentiment": "none"}, {"name": "grupo financiero santander méxico", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MEXICO CITY, Jan. 18, 2018 /PRNewswire/ -- Banco Santander (México), S.A. Institución de Banca Múltiple, Grupo Financiero Santander México (BMV: SANMEX; NYSE: BSMX ) (\"Banco Santander México\" or the \"Bank\") as successor of Grupo Financiero Santander México, S.A.B. de C.V. (\"Grupo Financiero Santander Mexico\"), pursuant to the press release published on December 8, 2017, hereby informs Shareholders that:\nRecitals\nBoth entities agreed to merge in accordance with the resolutions agreed to at their respective Ordinary and Extraordinary Shareholders Meetings held on December 8, 2017.\nAt such Meetings, it was agreed that the above mentioned merger would become effective between the parties at the close of December 31, 2017, while the merger would become effective before third parties with retroactive effect as of that same date once the public instruments in which the resolutions of the shareholders' meetings were recorded were registered before the Public Registry of Commerce in Mexico.As of the date hereof, such registration process is not yet finalized.\nOn January 29, 2018, prior to the opening for operations of the Mexican Stock Exchange (Bolsa Mexicana de Valores, S.A.B. de C.V., or \"BMV\"), all of the share certificates representing the common stock of Grupo Financiero Santander Mexico, the merged entity, will be exchanged for share certificates representing the common stock of Banco Santander Mexico, which is currently the successor of all of Grupo Financiero Santander Mexico's obligations as the merging entity, through S.D. Indeval Institución para el Depósito de Valores, S.A. de C.V., with effect as of such date.\nMaterial Fact Announcement\nPursuant to the terms of the exchange notice published on the date hereof, the shareholders of Grupo Financiero Santader Mexico, the merged entity, will receive 1 (one) share of Banco Santander Mexico, the merging entity and successor of Grupo Financiero Santander Mexico, for each share they hold of Grupo Financiero Santander Mexico and will become shareholders of Banco Santander Mexico.\nAs a result of the above, and pursuant to the terms of the merger approved at their respective shareholders meetings, on January 29, 2018, the share certificates representing the common stock of Grupo Financiero Santander Mexico, the merged entity, will no longer be listed on the BMV and the shares of Banco Santander Mexico will be listed on the BMV under the ticker symbol \"BSMX\", thereby consummating the merger in question.\nAdditionally, the initial trading price of Banco Santander Mexico shares on their first day of trading on the BMV will be the same as the price of Grupo Financiero Santander Mexico shares at the close of business on the immediately preceding business day. Furthermore, all transactions carried out with shares of Grupo Financiero Santander during the 25 th and 26 th of January 2018, will be settled within 24 hours and on the same day, respectively.\nAs of January 29, 2018, Banco Santander Mexico will replace Grupo Financiero Santander Mexico in all of the BMV indexes of which Grupo Financiero Santander Mexico is a member as of such date.\nThis material fact announcement does not constitute an offer to sell or a solicitation of an offer to buy any securities, nor will there be any offer, solicitation or sale of securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of such state or jurisdiction.\nAbout Grupo Financiero Santander México, S.A.B. de C.V. (NYSE: BSMX BMV: SANMEX)\nGrupo Financiero Santander México, S.A.B. de C.V. (Santander México), one of Mexico's leading financial services holding companies, provides a wide range of financial and related services, including retail and commercial banking, securities brokerage, financial advisory and other related investment activities. Santander México offers a multichannel financial services platform focused on mid- to high-income individuals and small- to medium-sized enterprises, while also providing integrated financial services to larger multinational companies in Mexico. As of September 30, 2017, Santander México had total assets of Ps.1,236 billion and more than 15 million customers. Headquartered in Mexico City, the Company operates 1,076 branches and 325 offices nationwide and has a total of 17,528 employees.\nView original content: http://www.prnewswire.com/news-releases/banco-santander-mexico-as-successor-of-grupo-financiero-santander-mexico-announces-exchange-of-shares-initial-listing-and-symbol-change-to-bsmx-on-the-bmv-300585052.html\nSOURCE Grupo Financiero Santander Mexico, S.A.B. de C.V.", "external_links": ["http://www.prnewswire.com/news-releases/banco-santander-mexico-as-successor-of-grupo-financiero-santander-mexico-announces-exchange-of-shares-initial-listing-and-symbol-change-to-bsmx-on-the-bmv-300585052.html"], "published": "2018-01-19T02:52:00.000+02:00", "crawled": "2018-01-19T05:17:24.011+02:00", "highlightTitle": ""}