{"organizations": [], "uuid": "23be47daa6fcb0702dbc2e78c18aa5f96284fc44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/walmart-rakuten/walmart-to-launch-online-grocery-delivery-in-japan-in-deal-with-rakuten-idUSL4N1PK5U2", "country": "US", "domain_rank": 408, "title": "Walmart to launch online grocery delivery in Japan in deal with Rakuten", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.694, "site_type": "news", "published": "2018-01-26T09:21:00.000+02:00", "replies_count": 0, "uuid": "23be47daa6fcb0702dbc2e78c18aa5f96284fc44"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/walmart-rakuten/walmart-to-launch-online-grocery-delivery-in-japan-in-deal-with-rakuten-idUSL4N1PK5U2", "ord_in_thread": 0, "title": "Walmart to launch online grocery delivery in Japan in deal with Rakuten", "locations": [], "entities": {"persons": [{"name": "seiyu gk", "sentiment": "none"}, {"name": "walmart-rakuten", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "walmart-rakuten", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "walmart", "sentiment": "negative"}, {"name": "rakuten inc", "sentiment": "negative"}, {"name": "rakuten new york", "sentiment": "negative"}, {"name": "seiyu", "sentiment": "none"}, {"name": "wal-mart stores inc", "sentiment": "none"}, {"name": "rakuten", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan 25 (Reuters) - Walmart has struck a partnership with e-commerce firm Rakuten Inc to launch an online grocery delivery service in Japan, its latest effort to forge an alliance with a popular homegrown chain to crack a competitive international market.\nThe world’s largest retailer, officially known as Wal-Mart Stores Inc, said on Thursday the service will launch in the latter half of 2018.\nWalmart’s leadership is looking for new ways to grow its international business, which is no longer the growth engine it once was, as it has grappled with economic woes in Brazil and competition from discount retailers in Britain.\nIn Japan, the new service will replace Walmart’s existing online grocery delivery offering and will be called “Rakuten Seiyu Netsuper.” Seiyu GK is the name of Walmart’s wholly-owned Japanese unit.\nIt will allow customers to place an order on Rakuten’s online marketplace platform, which will then be fulfilled by the Walmart-Rakuten joint venture. Walmart-Rakuten will open a warehouse to service these orders in addition to using Seiyu stores, the companies said.\nIn 2016, Walmart applied a similar strategy in China after struggling to grow its e-commerce business by itself. Walmart sold its own website to JD.com, the second largest Chinese e-commerce company, and picked up a 5 percent stake in JD.com instead.\nThe U.S. retailer is trying to shake up its international business. It recently appointed a top executive to lead its overseas unit and is in talks to sell a stake in its Brazilian operations.\nThe Japanese deal builds on Walmart’s online grocery delivery efforts in the United States. The retailer is testing grocery home delivery with companies like Uber, Lyft and Deliv and offers online grocery pickup at more than 1,100 stores.\nThe partnership will allow Walmart to sell 6 million e-books and audiobooks offered by Rakuten’s Kobo brand in the United States, giving the retailer a foothold into what has traditionally been a market dominated by Amazon.com Inc .\n“We are adding an entirely new category to our U.S. assortment,” Scott Hilton, Walmart’s chief revenue officer for the U.S. e-commerce business, said in a blog post.\nThe titles will include everything from New York Times best-sellers to children’s books and will be offered through a new Walmart-Kobo app, Michael Tamblyn, Rakuten Kobo Chief Executive Officer, told Reuters in an interview. (Reporting by Nandita Bose, Editing by Rosalba O‘Brien)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-26T09:21:00.000+02:00", "crawled": "2018-01-26T21:40:12.014+02:00", "highlightTitle": ""}