{"organizations": [], "uuid": "28800aa3051c8dba9d84b80609cc80932cb8e7f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/ruby-kitkats.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/18/nestle-debut-natural-ruby-chocolate-kitkats/", "country": "US", "domain_rank": 1196, "title": "Nestle Is Launching Natural Ruby Chocolate KitKats | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.756, "site_type": "news", "published": "2018-01-18T02:00:00.000+02:00", "replies_count": 0, "uuid": "28800aa3051c8dba9d84b80609cc80932cb8e7f3"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/18/nestle-debut-natural-ruby-chocolate-kitkats/", "ord_in_thread": 0, "title": "Nestle Is Launching Natural Ruby Chocolate KitKats | Fortune", "locations": [], "entities": {"persons": [{"name": "sandra marti", "sentiment": "none"}, {"name": "barry callebaut", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "nestle", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg January 18, 2018 \nNestle will sweeten Japan’s Valentine’s Day with ruby-chocolate KitKats , choosing one of the world’s most candy-obsessed markets for the debut of the first new type of natural chocolate in more than 80 years. \nNestle (nsrgy) struck a deal with Zurich-based Barry Callebaut (bycbf) , the developer of ruby chocolate, giving it exclusive rights for six months to the breakthrough product with a pinkish hue and a natural berry flavor that’s sour yet sweet. The ruby chocolates go on sale at KitKat boutiques in Japan and South Korea as well as online beginning Thursday, ensuring chocolate lovers will have access to the treat before the Feb. 14 holiday. \nWhile Japan has seen many colors and flavors for KitKats before — its penchant for eccentric flavors such as wasabi or Hokkaido melon has attracted both locals and tourists — this is the first time ruby chocolate is going on sale since Barry Callebaut announced the innovation in September. \n“Japan is the market that has made KitKat so iconic in terms of all the different flavors they’ve developed,” Sandra Martinez, Nestle’s global head of confectionery, said in an interview. “This makes Japan the ideal market to go with this news, and KitKat is a brand that’s modern and connects well with millennials, so it’s the right brand to put the first ruby chocolate in the world.” \nThe move also underscores Nestle’s commitment to the KitKat brand, even after taking a major step away from chocolate this week by selling its U.S. confectionery unit to Italian Nutella maker Ferrero . The $2.8 billion sale of the business, which includes Butterfinger and Baby Ruth candy bars, comes as Nestle plans to focus on healthier and faster-growing categories like coffee, pet food and water. \n“Buzz around the ruby-chocolate products should boost demand for its entire range of KitKats,” said Thomas Jastrzab, a Hong Kong-based analyst at Bloomberg Intelligence. “The unique flavor gives it a differentiated product to support its premiumization push.” \nRuby chocolate, which is based on a special type of cocoa bean found in Ivory Coast, Ecuador and Brazil, is naturally pink from the powder extracted during processing. Standard chocolate KitKats are made from a blend of cocoa liquor, milk and cocoa butter, and the colored varieties are produced using natural food dyes. \nThe innovation comes after about a decade of development. Barry Callebaut, which works behind the scenes to produce chocolate sold by all the major producers including Hershey (hsy) and Cadbury, chose to introduce the product through Nestle, which invented white chocolate more than 80 years ago. Vevey, Switzerland-based Nestle will introduce the bars in Australia by the second quarter, and is eyeing Latin America by the end of the year. \nJapan’s $5 billion chocolate confectionery market is Asia’s largest, according to Euromonitor International. It’s also one of KitKat’s biggest markets, creating enough demand that Nestle last summer built its first KitKat factory in 26 years. Meiji Holdings Co., a Japanese chocolate maker, is investing some 27 billion yen ($240 million) into extending two domestic factories amid growing chocolate consumption in the country. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-18T02:00:00.000+02:00", "crawled": "2018-01-19T13:53:49.021+02:00", "highlightTitle": ""}