{"organizations": [], "uuid": "c90b09c5e5089d957cf8634673043c020e5769c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-h-i-g-capital-acquires-majority-stake-in-beinbauer-group.html", "country": "US", "domain_rank": 767, "title": "H.I.G. Capital Acquires Majority Stake in Beinbauer Group", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.684, "site_type": "news", "published": "2018-01-16T15:35:00.000+02:00", "replies_count": 0, "uuid": "c90b09c5e5089d957cf8634673043c020e5769c4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-h-i-g-capital-acquires-majority-stake-in-beinbauer-group.html", "ord_in_thread": 0, "title": "H.I.G. Capital Acquires Majority Stake in Beinbauer Group", "locations": [], "entities": {"persons": [{"name": "patric meeth", "sentiment": "none"}, {"name": "wolfgang biedermann", "sentiment": "none"}, {"name": "tobias lührig", "sentiment": "none"}, {"name": "beinbauer", "sentiment": "none"}], "locations": [{"name": "beinbauer group hamburg", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "passau", "sentiment": "none"}, {"name": "büchlberg", "sentiment": "none"}], "organizations": [{"name": "h.i.g. capital acquires majority stake", "sentiment": "negative"}, {"name": "beinbauer group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HAMBURG, Germany--(BUSINESS WIRE)-- H.I.G. Capital (“H.I.G.”), a leading global private equity investment firm with more than €20 billion of equity capital under management, announced that one of its affiliates has acquired a majority interest in Beinbauer Group (“Beinbauer”).\nBeinbauer, headquartered in Büchlberg near Passau, Germany, is a leading provider of complex machined metal parts (iron, steel, aluminium) for the European on- and off-highway commercial vehicle industry (OEMs and other tier-1 suppliers). Beinbauer’s core competencies are the machining of components and assemblies in state-of-the-art production processes as well as building and managing complex supplier networks, offering its customers all-in-one solutions for axle, frame, chassis and engine parts from a single source. Beinbauer operates four production sites in Germany and has approximately 700 employees. In 2017, Beinbauer generated revenues of more than €200 million. The Beinbauer management team, headed by Tobias Lührig and Patric Meeth, will continue to lead the Group.\nWolfgang Biedermann, Managing Director at H.I.G. Europe commented on the transaction: “Led by a dedicated and highly experienced management team, Beinbauer has shown a strong development in recent years and demonstrated that it plays an important role as a reliable supplier to the European heavy vehicles industry. With its clear focus on offering its customers a highly flexible “one-stop-shop” solution, Beinbauer can further strengthen and expand its position in an attractive market segment of the European automotive industry. H.I.G. will support Beinbauer in increasing its market position in the solidly growing commercial vehicle market, both by organic growth and via strategic acquisitions. H.I.G. is looking forward to the partnership with Mr. Lührig and Mr. Meeth as well as the entire Beinbauer team.”\nTobias Lührig, Managing Director of the Beinbauer Group said: \"With H.I.G., we have exactly the right partner on board that can ideally support the Group in implementing its planned expansion course over the next years. We look very much forward to working with H.I.G.\"\nPatric Meeth, also a Managing Director of the Beinbauer Group , adds: “Through this partnership, Beinbauer will benefit not only from H.I.G.'s financial resources, but also from its substantial experience in the development of new markets and, most importantly, in identifying attractive acquisitions.”\nAbout Beinbauer Group\nFor more than 40 years, Beinbauer has been a reliable partner for leading OEMs of the commercial vehicle, agricultural, construction machinery, rolling stock and car industries. The Beinbauer Group was established in 2013 by the merger of Beinbauer Automotive GmbH & Co. KG and Wagner Automotive GmbH. The core competencies of both companies include the machining of components and assemblies in state-of-the-art production processes as well as building and managing complex supplier networks. Beinbauer Group offers its customers all-in-one solutions for axle, frame, chassis and engine parts from a single source. For more information, please refer to the Beinbauer Group website at www.beinbauer-group.de .\nAbout H.I.G. Capital\nH.I.G. is a leading global private equity and alternative assets investment firm with over €20 billion of equity capital under management.* Based in Miami, and with offices in New York, Boston, Chicago, Dallas, Los Angeles, San Francisco, and Atlanta in the U.S., as well as international affiliate offices in London, Hamburg, Madrid, Milan, Paris, Bogotá, Mexico City and Rio de Janeiro, H.I.G. specializes in providing both debt and equity capital to small and mid-sized companies, utilizing a flexible and operationally focused/ value-added approach:\nH.I.G.’s equity funds invest in management buyouts, recapitalizations and corporate carve-outs of both profitable as well as underperforming manufacturing and service businesses. H.I.G.’s debt funds invest in senior, unitranche and junior debt financing to companies across the size spectrum, both on a primary (direct origination) basis, as well as in the secondary markets. H.I.G. is also a leading CLO manager, through its WhiteHorse family of vehicles, and manages a publicly traded BDC, WhiteHorse Finance. H.I.G.’s real estate funds invest in value-added properties, which can benefit from improved asset management practices.\nSince its founding in 1993, H.I.G. has invested in and managed more than 300 companies worldwide. The firm's current portfolio includes more than 100 companies with combined sales in excess of €28 billion. For more information, please refer to the H.I.G. website at www.higcapital.com .\nH.I.G. European Capital Partners GmbH is a legally independent advisor to H.I.G. Capital LLC, H.I.G. Europe Capital Partners, L.P. and H.I.G. Europe Capital Partners II, L.P.\n* Based on total capital commitments managed by H.I.G. Capital and affiliates.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116005993/en/\nH.I.G. Capital\nWolfgang Biedermann\nManaging Director\nwbiedermann@higcapital.com\nSource: H.I.G. Capital", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.beinbauer-group.de&esheet=51742935&newsitemid=20180116005993&lan=en-US&anchor=www.beinbauer-group.de&index=1&md5=51613a4d5fc31718bc1dfae14993007b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.higcapital.com%2F&esheet=51742935&newsitemid=20180116005993&lan=en-US&anchor=www.higcapital.com&index=2&md5=d5d78df2682b3d6b089aeab665a9e978", "http://www.businesswire.com/news/home/20180116005993/en/"], "published": "2018-01-16T15:35:00.000+02:00", "crawled": "2018-01-16T16:15:37.002+02:00", "highlightTitle": ""}