{"organizations": [], "uuid": "0da29a2e5742942115a4798c818ab356042ab5cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225549447&w=1200&r=LYNXMPEE0P12G", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-cardiff/how-to-train-for-man-city-cardiff-go-chasing-shadows-idUKKBN1FF2AI", "country": "US", "domain_rank": 408, "title": "How to train for Man City? Cardiff go chasing shadows", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T19:12:00.000+02:00", "replies_count": 0, "uuid": "0da29a2e5742942115a4798c818ab356042ab5cd"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-cardiff/how-to-train-for-man-city-cardiff-go-chasing-shadows-idUKKBN1FF2AI", "ord_in_thread": 0, "title": "How to train for Man City? Cardiff go chasing shadows", "locations": [], "entities": {"persons": [{"name": "neil warnock", "sentiment": "none"}, {"name": "warnock", "sentiment": "none"}], "locations": [{"name": "man city", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "cardiff city", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 5:39 PM / Updated 2 hours ago How to train for Man City? Cardiff go chasing shadows Reuters Staff 3 Min Read \nLONDON (Reuters) - Cardiff City boss Neil Warnock, one of the great managerial characters of British soccer, wonders if he has found the ideal way of preparing to cause an FA Cup sensation against Manchester City -- forget the ball in training and just chase shadows. \nWarnock, the colourful 69-year-old who has had 15 separate spells managing league clubs over three decades, offered a typically nice line in black humour on Friday as he relayed how his Championship side had plotted to beat “Europe’s best team.” \nThe Cardiff boss reckoned his side, currently third as they push for promotion to the Premier League, saw this fourth round tie on Sunday as their “Cup final” in front of a 33,000 sell-out crowd in the Welsh capital. \nYet he could not resist chuckling to reporters: ”We’ll have a go but it’s been the easiest week of training. We haven’t had a ball out at all. It’s been great. We’ve just been chasing shadows to get used to it. \n“We’ve been throwing up a few pieces of paper in the wind for the players to chase.” \nPep Guardiola, who is overseeing a scintillating campaign at City who lead the Premier League by 12 points, will not be fooled, having heard plenty about how Warnock, who can be as combustible as he is comical, might galvanise his team. \nIndeed, the Spaniard could see for himself when, failing to watch incognito from the stands beneath a striking flat cap, he saw Cardiff dispatch Mansfield Town in a replay in the previous round. Soccer Football - Championship - Sheffield Wednesday vs Cardiff City - Hillsborough, Sheffield, Britain - January 20, 2018 Cardiff City manager Neil Warnock applauds after the game Action Images/Ed Sykes \nIt proved to Warnock that Europe’s most lauded manager was taking his side seriously. \n“That is a bit of class, that,” said Warnock. “He’s got hundreds of staff and yet he came to watch. I thought, well done to him. It means he cares; you’ve got to take your hat off to that.” \nNothing, it seems, can rouse Warnock like the chance to pit himself at this stage of his career against a manager who has fashioned a side that has been beaten just once all season in domestic fare. \nThe Yorkshireman was happy to recall how it was in the FA Cup 27 years ago, in the fifth round, that he engineered a major shock against a top-flight Manchester City side when he was in charge of another second-tier team, Notts County. \n“The snow was six foot high at the time and the fans were clearing it off our pitch,” he said, explaining how Man City had wanted to have the game called off because of the conditions. \nHaving persuaded the match officials the game should go ahead, Warnock’s men went on to record a 1-0 win. \nAnd how had Warnock’s side prepared for that match? “We didn’t go training in the week,” he said. “We went sledging in the park.” \nPerhaps there’s method in Warnock’s shadow-chasing after all... Reporting by Ian Chadband; Editing by Christian Radnedge", "external_links": [], "published": "2018-01-26T19:12:00.000+02:00", "crawled": "2018-01-26T21:15:43.000+02:00", "highlightTitle": ""}