{"organizations": [], "uuid": "21a40b1c35def33d330cc04cb60f38bbcadb0561", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223734390&w=1200&r=LYNXMPEE0J0VM", "site_section": "http://feeds.reuters.com/Reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-congress-shutdown-immigration/new-trump-campaign-ad-on-murder-raises-heat-in-shutdown-fight-idUSKBN1F914U", "country": "US", "domain_rank": 408, "title": "Trump campaign ad on murder raises heat in shutdown fight", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-21T07:33:00.000+02:00", "replies_count": 0, "uuid": "21a40b1c35def33d330cc04cb60f38bbcadb0561"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-congress-shutdown-immigration/new-trump-campaign-ad-on-murder-raises-heat-in-shutdown-fight-idUSKBN1F914U", "ord_in_thread": 0, "title": "Trump campaign ad on murder raises heat in shutdown fight", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "luis bracamontes", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "sacramento", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "sacramento bee", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 20, 2018 / 11:33 PM / in 18 hours Trump campaign ad on murder raises heat in shutdown fight Reuters Staff 3 Min Read \nWASHINGTON (Reuters) - U.S. President Donald Trump’s presidential campaign on Saturday issued a new video ad calling Democrats “complicit” in murders committed by illegal immigrants, during a government shutdown partly triggered by an impasse over immigration. \nThe Trump campaign released the ad, titled “Complicit,” on the anniversary of the Republican president’s inauguration. \nIt focuses on an undocumented immigrant, Luis Bracamontes, charged in the 2014 killings of two police officers in Sacramento, California. The man’s lawyers had questioned his sanity but a judge found him mentally competent to stand trial, according to a report last week in the Sacramento Bee. \n“Democrats who stand in our way will be complicit in every murder committed by illegal immigrants,” the ad says. \nThe new ad is likely to anger Democrats and immigration advocates and could inflame tensions over the issue on Capitol Hill, where Democrats and Republicans were working through the weekend to reach an agreement that would reopen the government. \nA news release announcing the ad blamed Senate Democratic Leader Chuck Schumer for the shutdown, accusing him and Democrats of “holding lawful citizens hostage over their demands for amnesty for illegal immigrants.” \nSchumer’s spokesman said in an email, “This is a shameless attempt by the president to distract from the Trump shutdown. Rather than campaigning, he should do his job and negotiate a deal to open the government address the needs of the American people.” \n“It’s a campaign ad, which tend to be extreme, but this is completely divorced from reality and full of fear and hate,” said Melanie Nezer, vice president of the refugee agency HIAS. \nTrump filed for re-election the day he took office, an unusual move that has allowed him to begin campaigning long before the November 2020 election. Historically, incumbent presidents have waited two years, until after the midterm elections, to file formally. \nOn Friday, most Senate Democrats opposed a bill that would have avoided the shutdown, because their efforts to include protections for hundreds of thousands of mostly young immigrants, known as Dreamers, were rejected by Trump and Republican leaders. \nThe Dreamers were brought illegally into the United States as children, and given temporary legal status under a program started by former President Barack Obama. Reporting by Ginger Gibson and Doina Chiacu; Editing by Alistair Bell", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-21T07:33:00.000+02:00", "crawled": "2018-01-21T02:29:43.026+02:00", "highlightTitle": ""}