{"organizations": [], "uuid": "b348e21ce9d5f5c996cd090dc3f41651f4ecb79d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-veracyte-announces-publication-of-results-from-patient-survey-quantifying-the-challenges-in-diagnosing-interstitial-lung.html", "country": "US", "domain_rank": 767, "title": "Veracyte Announces Publication of Results from Patient Survey Quantifying the Challenges in Diagnosing Interstitial Lung Disease", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-18T16:00:00.000+02:00", "replies_count": 0, "uuid": "b348e21ce9d5f5c996cd090dc3f41651f4ecb79d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-veracyte-announces-publication-of-results-from-patient-survey-quantifying-the-challenges-in-diagnosing-interstitial-lung.html", "ord_in_thread": 0, "title": "Veracyte Announces Publication of Results from Patient Survey Quantifying the Challenges in Diagnosing Interstitial Lung Disease", "locations": [], "entities": {"persons": [], "locations": [{"name": "bmc pulmonary medicine", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "south san francisco", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "veracyte", "sentiment": "none"}], "organizations": [{"name": "pulmonary fibrosis foundation", "sentiment": "negative"}, {"name": "ild", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "55% of participants in national Pulmonary Fibrosis Foundation survey reported at least one misdiagnosis;\n61% endured an invasive procedure for diagnosis\nAuthors call for improved physician education, practical clinical guidelines and better diagnostic tools\nSOUTH SAN FRANCISCO, Calif.--(BUSINESS WIRE)-- Veracyte, Inc. (NASDAQ: VCYT) announced that results of a national patient survey quantifying the significant challenges of diagnosing interstitial lung diseases (ILD) have been published for the first time. The Interstitial Lung Disease Patient Diagnostic Journey (INTENSITY) survey was conducted by the Pulmonary Fibrosis Foundation with support from Veracyte and appears online in BMC Pulmonary Medicine .\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180118005528/en/\nUp to 200,000 patients in the United States and major European countries present with suspected ILD each year. Idiopathic pulmonary fibrosis (IPF) is among the most common and most deadly of these progressive, lung-scarring diseases. The INTENSITY survey assessed the steps and time required for adults with ILD, including IPF, to receive an accurate diagnosis, specific obstacles hindering timely diagnosis, and the physical and emotional impacts of patients’ diagnostic journeys. Key findings include:\nForty-three percent of survey respondents endured a year or more between the time they first experienced symptoms (most commonly shortness of breath and cough) and the time they received a diagnosis; nearly one in five (19 percent) endured three or more years. Fifty-five percent reported at least one misdiagnosis prior to receiving an accurate diagnosis; more than a third (38 percent) reported at least two misdiagnoses. Among those with IPF, more than one in five (21 percent) reported treatment during the diagnostic process with systemic corticosteroids, a potentially harmful therapy for IPF patients.\n“Our results show that the typical diagnostic experience for patients with ILD, including IPF, is characterized by considerable delays, frequent misdiagnosis, exposure to costly and invasive diagnostic procedures and substantial use of healthcare resources,” said lead author Gregory P. Cosgrove, M.D., associate professor of medicine at National Jewish Health and chief medical officer for the Pulmonary Fibrosis Foundation. “These findings point to the need for physician education, development of clinical practice recommendations and better diagnostic tools to help patients with suspected ILD.”\nAmong survey participants, 47 percent of whom reported having IPF, an accurate diagnosis typically involved a substantial use of healthcare resources:\nMost ILD diagnoses (88 percent) were made by a pulmonologist, however multiple primary care physician (PCP) visits were the norm, with 30 percent of patients seeing a PCP four or more times before being referred to a specialist. On average, respondents endured six pulmonary lung function tests, five chest X-rays and two bronchoscopies before receiving a diagnosis. Sixty-one percent of patients endured invasive diagnostic procedures, including surgical lung biopsy.\nThe survey also revealed the significant emotional and financial toll of the diagnostic journey for patients with ILD:\nMore than 80 percent of respondents reported emotional stress due to the ongoing uncertainty regarding their diagnosis. Nearly one third (28 percent) reported that time spent attending medical appointments and undergoing diagnostic procedures contributed to their decision to apply for disability benefits or retire.\n“The publication of these findings underscores the tremendous need for patients with suspected IPF to get clearer answers faster so that they can receive the treatment they need and avoid potentially harmful diagnostic procedures and treatment,” said Bonnie Anderson, Veracyte’s chairman and chief executive officer. “It also reinforces our commitment to using cutting-edge, machine learning-based genomic technology to answer challenging diagnostic questions and improve patient care. We believe that our Envisia Genomic Classifier will help to significantly improve IPF diagnosis, reducing the need for diagnostic surgeries, speeding the time to diagnosis and reducing healthcare costs.”\nAbout the INTENSITY Survey\nIndependent healthcare-research organization Outcomes Insights conducted the INTENSITY survey from August 14-26, 2015, using a quantitative online questionnaire. The survey involved 600 ILD patients (300 men/300 women), including 279 (47 percent) with IPF. The survey was recruited without gender quotas and the even distribution of men and women was coincidental. The median participant age was 63 years for women and 69 years for men and most participants had been diagnosed within the past two to five years. Respondents were screened to ensure they were United States residents and had been diagnosed by a physician with an interstitial lung disease (ILD). Results were initially reported at the 2015 PFF Summit in Washington, DC.\nAbout Interstitial Lung Disease and Idiopathic Pulmonary Fibrosis\nEach year in the United States and Europe, up to 200,000 patients are evaluated for suspected ILD, including IPF, which is among the most common, deadly and difficult to diagnose of these progressive lung-scarring diseases. Physicians routinely use high-resolution computed tomography (HRCT) to help identify IPF, but this approach frequently provides inconclusive results, leading many patients to undergo invasive and potentially risky surgery for a more definitive diagnosis. Other patients are too frail to undergo surgery and may never receive an accurate diagnosis, which can result in suboptimal - and potentially harmful - treatment. There is no cure for IPF. Presently, there are two treatments approved by the Food and Drug Administration to help stop the progression of IPF.\nAbout the Envisia Genomic Classifier\nThe Envisia Genomic Classifier provides answers that improve physicians' ability to differentiate idiopathic pulmonary fibrosis (IPF) from other interstitial lung diseases (ILDs) without the need for invasive, risky and costly surgery. The 190-gene classifier was commercially introduced in October 2016 and employs RNA sequencing to provide the core information needed by physicians to make an ILD diagnosis, using samples obtained through less-invasive bronchoscopy. The test is designed to provide information that was previously only available through surgical lung biopsy and by expert pathology review.\nAbout Veracyte\nVeracyte (NASDAQ: VCYT) is a leading genomic diagnostics company that is providing trustworthy and actionable answers that fundamentally improve patient care when current diagnostic tests are uncertain. The company's products uniquely combine genomic technology, clinical science and machine learning to provide answers that give physicians and patients a clear path forward without risky, costly surgery that is often unnecessary. Since its founding in 2008, Veracyte has commercialized three genomic tests, which are transforming the diagnosis of thyroid cancer, lung cancer and idiop", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.veracyte.com%2F&esheet=51745226&newsitemid=20180118005528&lan=en-US&anchor=Veracyte%2C+Inc.&index=1&md5=386e67d2cc116ba4b2ee362af185e1f3", "http://www.businesswire.com/news/home/20180118005528/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fbmcpulmmed.biomedcentral.com%2Ftrack%2Fpdf%2F10.1186%2Fs12890-017-0560-x%3Fsite%3Dbmcpulmmed.biomedcentral.com&esheet=51745226&newsitemid=20180118005528&lan=en-US&anchor=BMC+Pulmonary+Medicine&index=2&md5=0a588b702bb8895b2bd35f917646c99c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.veracyte.com&esheet=51745226&newsitemid=20180118005528&lan=en-US&anchor=www.veracyte.com&index=3&md5=8a60bc160cc057508a5cd3008e4e2f71"], "published": "2018-01-18T16:00:00.000+02:00", "crawled": "2018-01-18T16:28:58.007+02:00", "highlightTitle": ""}