{"organizations": [], "uuid": "f2cd451ccaffda34e6838319db4f6da737910db4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-lynk-adds-global-head-of-enterprise-solutions-and-linkedin-exec-as-advisor.html", "country": "US", "domain_rank": 767, "title": "Lynk Adds Global Head of Enterprise Solutions and LinkedIn Exec as Advisor", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.976, "site_type": "news", "published": "2018-01-18T18:00:00.000+02:00", "replies_count": 0, "uuid": "f2cd451ccaffda34e6838319db4f6da737910db4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-lynk-adds-global-head-of-enterprise-solutions-and-linkedin-exec-as-advisor.html", "ord_in_thread": 0, "title": "Lynk Adds Global Head of Enterprise Solutions and LinkedIn Exec as Advisor", "locations": [], "entities": {"persons": [{"name": "lynk", "sentiment": "negative"}, {"name": "john", "sentiment": "negative"}, {"name": "fitzgerald", "sentiment": "none"}, {"name": "scott roberts", "sentiment": "none"}, {"name": "john fitzgerald", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "mumbai", "sentiment": "none"}], "organizations": [{"name": "linkedin", "sentiment": "none"}, {"name": "global head of enterprise solutions", "sentiment": "none"}, {"name": "cfra research", "sentiment": "none"}, {"name": "advisory panel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG--(BUSINESS WIRE)-- Lynk, the global knowledge sharing platform, today announced that John Fitzgerald has joined as Global Head of Enterprise Solutions. With nearly 30 years’ sales and management experience in financial services, Fitzgerald will supplement Lynk’s senior management team during a period of rapid expansion. Additionally, Lynk has bolstered it’s Advisory Panel with the appointment of LinkedIn’s Scott Roberts as Advisor.\nJohn Fitzgerald will lead the company’s expanding business development initiatives and help to launch Lynk’s New York office with a new team in January 2018. The Hong Kong-headquartered company, which also serves its global client base from offices in Hong Kong, Mumbai, and Singapore, is scaling all of its locations to meet growing demand and will introduce a number of new initiatives in 2018.\nFitzgerald joins Lynk from CFRA Research in New York where he spent more than three years as Global Head of Sales, directing all sales and account management staff to create a high performing team, generating consistent revenue growth. Prior to CFRA, he was Global Head of Sales and Marketing at Coleman Research, where he led and developed the company’s client-facing organization.\nCurrently Vice President of Business Development at LinkedIn, Scott Roberts brings decades of experience both as an investor and advisor to several successful, high-growth ventures. He will provide Lynk with ongoing strategic and business development advice to accelerate its growth globally.\nPeggy Choi, Lynk’s Founder and CEO, said: “John brings an energizing entrepreneurial spirit and a brilliant track record of growing businesses quickly and sustainably. His appointment will help us to build on the fantastic momentum we’ve generated since our Series A last year. We’re all excited to have John on board to help propel Lynk’s Enterprise Solutions business to the next level.”\nJohn Fitzgerald added: “Over the course of my career I’m proud to have built and managed a number of high-performance teams and I can already see enormous potential here at Lynk. We want to offer our clients, staff, and the Experts we work with, the best and most enriching experience possible. I’m excited to get started and do everything I can to help this unique company grow and prosper.”\nFitzgerald, who holds an MBA from Fordham, began his career with management positions at financial institutions including Merrill Lynch and Bankers Trust before joining Katalyst Venture Capital as President. He then founded Primary Insight, a wholly owned subsidiary of Bear Stearns, which was acquired by JP Morgan in 2008.\nHis appointment follows several recent key hires at Lynk, including senior new joiners in the Client Solutions, Technology, and Operations Teams.\nAbout Lynk\nLynk is a knowledge sharing platform that connects the world’s greatest minds. We help people with time-sensitive and business-critical questions to benefit from the experience of a community of 50,000+ curated Experts.\nLynk’s Experts span more than 80 countries and include seasoned C-level executives, scientists and engineers, independent consultants, and specialist advisors. Lynk’s clients include the world’s leading investment houses, top-tier consultancies, corporates, and startups.\nFor more information please visit www.lynk.global\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180118005568/en/\nLynk\nJack Holden\njack@lynkpeople.com\nor\nLiz Shi (Chinese enquiries)\nliz@lynkpeople.com\nSource: Lynk", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.lynk.global&esheet=51745237&newsitemid=20180118005568&lan=en-US&anchor=www.lynk.global&index=1&md5=3ac638a02a1b447ed4b9a97a51159c3b", "http://www.businesswire.com/news/home/20180118005568/en/"], "published": "2018-01-18T18:00:00.000+02:00", "crawled": "2018-01-18T20:10:58.027+02:00", "highlightTitle": ""}