{"organizations": [], "uuid": "a9c876f90f52c4ae575403d70bcb672d062fe2f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XC508_3n9dB_TOP_20180122093642.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7014.xml", "section_title": "WSJ.com: US Business", "url": "https://www.wsj.com/articles/cartier-owner-richemont-bets-big-on-online-bling-1516632420", "country": "US", "domain_rank": 387, "title": "Cartier-Owner Richemont Bets Big on Online Bling", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T16:51:00.000+02:00", "replies_count": 0, "uuid": "a9c876f90f52c4ae575403d70bcb672d062fe2f6"}, "author": "Stephen Wilmot", "url": "https://www.wsj.com/articles/cartier-owner-richemont-bets-big-on-online-bling-1516632420", "ord_in_thread": 0, "title": "Cartier-Owner Richemont Bets Big on Online Bling", "locations": [], "entities": {"persons": [{"name": "johann rupert", "sentiment": "none"}], "locations": [{"name": "geneva", "sentiment": "none"}], "organizations": [{"name": "compagnie financière richemont", "sentiment": "neutral"}, {"name": "cartier", "sentiment": "none"}, {"name": "richemont", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Would you buy a $100,000 watch online? Cartier-owner Compagnie Financière Richemont wants to buy out its fellow shareholders in e-commerce specialist Yoox -Net a-Porter SA, because for more and more people, the answer is yes.\nRichemont, a Swiss holding company for luxury brands including Cartier and Jaeger-LeCoultre, owns roughly half the shares in Yoox. This is as a result of the listed Italian company’s controversial 2015 merger with its competitor Net-a-Porter, which was owned by Richemont. Now, Richemont wants to spend $3.3 billion on the other half.\nThe Cartier stand at the International Fine Watchmaking Exhibition in Geneva on Thursday. Photo: fabrice coffrini/Agence France-Presse/Getty Images The Swiss group had about $5.5 billion (net of debt) on its books at the end of September, so the deal should boost profits: Few investments offer less than cash in a Swiss bank account.\nUpping exposure to online luxury also fits with Richemont’s recent strategic drift. Controlling shareholder and chairman, Johann Rupert, appointed a number of tech executives to the board in 2017 and the company’s first chief technology officer joined the management team in January. By taking Yoox private, Mr. Rupert is, for the first time, putting a substantial sum of money where his mouth has been for the past year.\nHowever, there is a more subtle reason for the offer, too: Yoox has been a problematic investment since the merger. Even as luxury sales have boomed, and online in particular, Yoox shares have seesawed. There have been teething issues with a new software platform, while competition from new players and business models has mounted.\nA capital-light rival called Farfetch last February hired the founder of Net-a-Porter , who parted ways with Richemont acrimoniously; then the company got a roughly $400 million cash injection from Chinese e-commerce player JD.com in July.\nAnother rival, Matchesfashion.com, was acquired by private-equity firm Apax Partners in September. One potential rival that hasn’t taken share in luxury is online behemoth Amazon.\nYoox needs firepower to respond. Mr. Rupert and Yoox founder and Chief Executive Federico Marchetti, who has agreed to sell his 3.9% stake, seem to think this is best done without the lukewarm support of other shareholders.\nCorrections & Amplifications\nFederico Marchetti owns a 3.9% stake in Yoox Net à Porter. A previous version said he had a 5.7% stake.\nWrite to Stephen Wilmot at stephen.wilmot@wsj.com", "external_links": [], "published": "2018-01-22T16:51:00.000+02:00", "crawled": "2018-01-22T16:53:33.043+02:00", "highlightTitle": ""}