{"organizations": [], "uuid": "5af715cb73a7cb3f5994112c537de9008d4d16df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-ati-announces-fourth-quarter-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "ATI Announces Fourth Quarter and Full Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T15:30:00.000+02:00", "replies_count": 0, "uuid": "5af715cb73a7cb3f5994112c537de9008d4d16df"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-ati-announces-fourth-quarter-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "ATI Announces Fourth Quarter and Full Year 2017 Results", "locations": [], "entities": {"persons": [{"name": "materi", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "ati", "sentiment": "negative"}, {"name": "frp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fourth Quarter 2017 Results\nSales were $910 million, 14% higher than Q4 2016 High Performance Materials & Components sales of $518 million, increased 9% versus prior year Flat Rolled Products sales of $392 million, up 23% versus prior year Business segment operating profit was $88.2 million, or 10% of sales HPMC segment operating profit was $65.8 million, or 12.7% of sales FRP segment operating profit was $22.4 million, or 5.7% of sales Net income attributable to ATI was $1.7 million, or $0.01 per share Adjusted net income attributable to ATI of $34.6 million, or $0.27 per share, excluding debt extinguishment charge and tax legislation benefits\nFull Year 2017 Results\nSales were $3.5 billion, up 13% versus prior year 49% of ATI sales to the aerospace and defense markets Segment operating profit was $283.4 million, or 8% of sales HPMC segment operating profit was $246.4 million, or 12% of sales FRP segment operating profit was $37.0 million, or 3% of sales Net loss attributable to ATI was $91.9 million, or $(0.83) per share Adjusted net income attributable to ATI of $54.6 million, or $0.48 per share, excluding goodwill impairment, debt extinguishment charges, and tax legislation benefits HPMC sales and profit growth driven by continued aerospace market ramp FRP segment returned to profitability, driven by product mix and business improvements\nPITTSBURGH--(BUSINESS WIRE)-- Allegheny Technologies Incorporated (NYSE: ATI) reported fourth quarter 2017 results, with sales of $910 million and net income attributable to ATI of $1.7 million, or $0.01 per share. Adjusted fourth quarter 2017 net income attributable to ATI was $34.6 million, or $0.27 per share, excluding a debt extinguishment charge of $37.0 million, net of tax, or $(0.29) per share, for the full redemption of the $350 million, 9.375% Senior Notes due 2019, and $4.1 million of tax benefits from the 2017 Tax Cuts and Jobs Act legislation.\nFor full year 2017, sales increased 13%, to $3.5 billion, and segment operating profit was $283.4 million, or 8.0% of sales. For the full year 2017 the company reported a net loss attributable to ATI of $91.9 million, or $(0.83) per share. Adjusted net income attributable to ATI was $54.6 million, or $0.48 per share, excluding goodwill impairment and debt extinguishment charges, and tax legislation benefits.\n“Fourth quarter results represented a solid finish to a year of strategic accomplishments for ATI,” said Rich Harshman, Chairman, President and Chief Executive Officer. “We achieved fourth quarter profitability despite a $37 million debt extinguishment charge. Adjusted fourth quarter results were $0.27 per share, with improved year over year performance in both business segments. Continued strong sales of next-generation jet engine products, which were up 26% versus the prior year quarter, drove fourth quarter High Performance Materials & Components (HPMC) segment operating profit margins to 12.7% of sales. HPMC segment sales of our specialty materials, including powders, continued to meet our growth expectations. Our titanium castings business continues to improve and we are working diligently to meet elevated customer demand levels. We expect the titanium castings business to be near break-even for 2018, and return to profitability in 2019.\n“Our Flat Rolled Products (FRP) segment performed solidly in the fourth quarter, generating over $22 million of segment operating profit, or nearly 6% of sales. This was our best quarter in the FRP segment in the last five years. As expected, the third quarter’s significantly negative out-of-phase raw material surcharge condition proved to be temporary. Fourth quarter FRP results benefitted from a stronger mix of high-value products, including higher project-related demand, improved raw material surcharges, and positive impacts from cost reductions.\n“2017 was a year of important milestones in our ongoing journey to deliver sustainable long-term profitable growth. In the HPMC segment, our next-generation, differentiated jet engine product mix continued to improve, with sales of these products up 35% compared to 2016, and our airframe titanium product shipments remained strong. We signed strategic long-term agreements that are expected to drive HPMC’s growth trajectory for the next several years, including a long-term agreement with Pratt & Whitney to supply isothermal forgings and powder alloys for next-generation jet engines. In addition, we formed Next Gen Alloys, a joint venture with GE Aviation to develop a new meltless titanium alloy powder manufacturing technology. Finally, we continued to develop our advanced powder production capabilities. Our nickel-based powder alloy expansion in North Carolina was completed and is expected to be commercially qualified in early 2018, and we recently announced plans for a titanium powder expansion to be located on the same site.\n“In 2017, our FRP segment made significant progress in achieving sustainable profitability. We took important steps toward improving the capacity utilization of our Hot-Rolling and Processing Facility, most notably with the announced Allegheny & Tsingshan Stainless joint venture to manufacture 60” wide stainless sheet, which is expected to be formed in early 2018.”\nATI’s sales to the key global markets of aerospace and defense, oil & gas, automotive, medical and electrical energy represented 79% of ATI sales for 2017: Sales to the aerospace and defense markets were $1.7 billion and represented 49% of ATI sales: 27% commercial jet engine, 14% commercial airframe, 8% government aero/defense. Sales to the oil & gas market were $418 million and represented 12% of ATI sales. Sales to the automotive market were $274 million and represented 8% of ATI sales. Sales to the electrical energy market were $192 million and represented 5% of ATI sales. Sales to the medical market were $183 million and represented 5% of ATI sales. Direct international sales represented 41% of ATI’s 2017 sales.\n“As of December 31, 2017, cash on hand was $142 million and available additional liquidity under our asset-based lending (ABL) credit facility was approximately $305 million, with no borrowings under the revolving credit portion. We generated $76 million of cash flow from operations in the fourth quarter, including a $30 million investment in managed working capital, primarily attributable to large pipeline project orders, which will be delivered to our customers in early 2018, along with initial materials received to support the proposed Allegheny & Tsingshan Stainless joint venture. Capital expenditures for 2017 were $123 million, including $37 million in the fourth quarter.”\nStrategy and Outlook\n“Looking ahead to 2018, we expect continued revenue growth and operating margin improvement in our HPMC segment resulting from ongoing aerospace market demand growth and improved asset utilization,” Harshman said. “We remain confident in the continuation of our customers’ elevated order patterns stemming from increasing jet engine build rates over the next several years. Our focus continues to be on operational execution, continuous improvement initiatives, and on meeting the aerospace production ramp requirements. In addition, we anticipate that the 2017 financial challenges experienced in our castings business and expenses associated with the start-up and qualification of our new nickel alloys powder facility will provide meaningful profit improvement opportunities in 2018.\n“In 2018, we expect the FRP segment to build on the operational improvements and product mix benefits achieved in 2017, and to improve operating margins year over year. However, first quarter results are expected to be negatively impacted by approximately $10 million, compared to fourth quarter 2017, due to required accounting changes on retirement benefit cost capitalization in inventory, as well as lower ferrochrome surcharges. We expect the production ramp-up of the planned Allegheny & Tsingshan Stainless joint venture to meaningfully benefit second half 2018 FRP results.\n“Looking forward, we will be relentless in our drive to enhance ATI’s technology leadership in differentiated specialty materials and components, generate healthy cash flow from operations, improve our competitive cost position, and strengthen our balance sheet,” concluded Harshman.\nThe company expects 2018 consolidated capital expenditures to range between $100 million to $125 million, reflecting continued strategic investments in capacity to support business growth requirements. This consolidated capital expenditure range includes Next Gen Alloys, with approximately half of the total expected $25 million capital expenditure in 2018 funded by GE. Projected capital expenditures for 2018 also include $22 million related to the completion of the 60%-owned STAL joint venture expansion project in China, which is funded entirely through joint venture cash and operations. Following the common stock offering and redemption of our 2019 Senior Notes, we expect 2018 interest expense to be lower by approximately $32 million versus 2017. Defined benefit pension and postretirement benefit plan expenses for 2018 are expected to be lower by approximately $19 million compared to 2017.\nFourth Quarter and Full Year 2017 Financial Results\nSales for the fourth quarter 2017 were $909.9 million, a 5% increase compared to the third quarter 2017 and a 14% increase compared to the fourth quarter 2016. Sales for the full year 2017 increased 13% to $3.53 billion, compared to $3.13 billion for 2016. Compared to the full year 2016, sales increased 7% in the HPMC segment and 21% in the FRP segment. HPMC sales in 2017 reflect stronger demand for nickel-based and specialty alloy products and components. FRP sales in 2017 include a stronger mix of high-value products, particularly nickel-based alloys. Net income attributable to ATI for the fourth quarter 2017 was $1.7 million, or $0.01 per share, and adjusted net income of $34.6 million, or $0.27 per share, excluding the debt extinguishment charge and tax legislation benefits. This compares to the third quarter 2017 net loss attributable to ATI of $121.2 million, or $(1.12) per share, and an adjusted loss of $7.6 million, or $(0.07) per share, excluding a $113.6 million goodwill impairment charge, net of tax, and fourth quarter 2016 net income attributable to ATI of $9.9 million, or $0.09 per share, and an adjusted net loss attributable to ATI of $3.9 million, or $(0.04) per share. For the full year 2017, the net loss attributable to ATI was $91.9 million, or $(0.83) per share, and on an adjusted basis was net income attributable to ATI of $54.6 million, or $0.48 per share, excluding the above-mentioned goodwill impairment and debt extinguishment charges, and tax legislation benefits. Results include impacts from income taxes which differ from a standard tax rate, primarily related to impacts of income tax valuation allowances, as well as non-deductible goodwill for the third quarter 2017.\nQuarterly Results\nThree Months Ended Dec. 31, Sept. 30, Dec 31, 2017 2017 2016 In Millions Sales $ 909.9 $ 869.1 $ 796.1 Income (loss) attributable to ATI $ 1.7 $ (121.2 ) $ 9.9 Adjusted for special items: Debt extinguishment charge, net of tax 37.0 – – Goodwill impairment, net of tax – 113.6 – Restructuring and other charges, net of tax – – 18.6 Income tax items including valuation allowances (4.1 ) – (32.4 ) Income (loss) attributable to ATI before special items $ 34.6 $ (7.6 ) $ (3.9 ) Per Diluted Share Income (loss) attributable to ATI $ 0.01 $ (1.12 ) $ 0.09 Adjusted for special items: Debt extinguishment charge, net of tax 0.29 – – Goodwill impairment, net of tax – 1.05 – Restructuring and other charges, net of tax – – 0.17 Income tax items including valuation allowances (0.03 ) – (0.30 ) Income (loss) attributable to ATI before special items $ 0.27 $ (0.07 ) $ (0.04 ) Cash on hand at December 31, 2017 was $141.6 million, with $76.2 million provided by operations in the fourth quarter 2017. For the full year 2017, cash provided by operations was $22.4 million, including a $135.0 million contribution to the ATI Pension Plan, or $157.4 million excluding the pension contribution. Cash used in investing activities was $119.6 million, with $122.7 million for capital expenditures slightly offset by cash proceeds from sales of miscellaneous assets. We de-levered the balance sheet in the fourth quarter 2017 through a common stock offering. In November 2017, we issued 17 million shares of common stock at $24.00 per share before expenses, and received $397.8 million, net of transaction costs. Proceeds from the stock offering were used to redeem all $350 million aggregate principal amount of our 9.375% Senior Notes due 2019, resulting in a $37.0 million debt extinguishment charge, which included a $35.8 million cash payment as a make-whole provision on the early extinguishment of debt, and a $1.2 million charge for previously-unrecognized debt issue costs. For the full year 2017, cash provided by financing activities including these actions was $9.2 million.\nHigh Performance Materials & Components Segment\nMarket Conditions\nAerospace and defense sales in the fourth quarter 2017 were $399.0 million, 2% higher than the third quarter 2017, and represented 77% of total segment sales. Compared to the third quarter, commercial aerospace sales were flat and government aero/defense sales were 17% higher. Sales to other key end markets were comparable to the third quarter, as total HPMC fourth quarter sales increased 1% over the third quarter 2017. Sales of our nickel-based and specialty alloys were 12% higher, while sales of other products were lower, compared to the third quarter 2017. Direct international sales represented 47% of total segment sales for the fourth quarter 2017.\nFourth quarter 2017 compared to fourth quarter 2016\nSales were $517.7 million, a 9% increase compared to the fourth quarter 2016, primarily due to higher sales of nickel-based and specialty alloys and forged and cast components. Sales to the commercial aerospace market, which represented 63% of fourth quarter 2017 sales, were 8% higher than the fourth quarter 2016, including a 10% increase in sales to the commercial jet engine market. Construction and mining market sales were 65% higher, and sales to the oil & gas market improved 37% in the fourth quarter 2017, both from low prior year demand levels. Sales to the medical market were 16% lower primarily due to increased competition in MRI end uses. Segment operating profit improved to $65.8 million, or 12.7% of sales, compared to $53.8 million, or 11.3% of sales for the fourth quarter 2016. This operating profit improvement reflects higher productivity from increasing aerospace and defense sales, an improved product mix of next-generation nickel alloys and forgings for the aero engine market, and the benefits from the 2016 titanium operations restructuring activities, including idling the Rowley, UT titanium sponge operations.\nFlat Rolled Products Segment\nMarket Conditions\nIn the fourth quarter 2017, market conditions improved significantly in the oil & gas market, including project-based demand for chemical and hydrocarbon processing applications. Sales to the oil & gas market were $114.3 million, a 36% increase compared to the third quarter 2017. Sales were higher to the automotive and consumer durables markets, and were stable in aerospace and defense and construction and mining markets. Sales increased 18% for high-value products compared to the third quarter 2017. Sales of standard grade stainless sheet and plate products decreased 5% on lower shipment volumes, as customers managed year-end inventory levels. Direct international sales increased to 39% of total fourth quarter 2017 segment sales, largely due to international oil & gas projects.\nFourth quarter 2017 compared to fourth quarter 2016\nSales were $392.2 million, a $73.3 million, or 23%, increase compared to the prior year period, due to higher shipment volume for high-value products, and slightly higher selling prices for both high-value and standard stainless products. Sales to the oil & gas market were $44.3 million higher, representing 60% of the total sales increase. Segment operating profit was $22.4 million, or 5.7% of sales, compared to a fourth quarter 2016 segment operating loss of $0.8 million, or (0.3%) of sales. 2017 results were favorably impacted by an improved product mix, particularly for nickel-alloy and titanium products, and more stable raw material prices. 2017 results also reflect the benefits of cost reductions and significant restructuring actions implemented over the last few years.\nCorporate Expenses\nCorporate expenses decreased $1.2 million compared to the third quarter 2017, due primarily to lower incentive compensation costs. For the full year 2017, corporate expenses were $7.1 million higher than 2016, primarily due to higher incentive compensation costs as well as start-up and research and development costs for Next Gen Alloys.\nClosed Operations and Other Expenses\nClosed operations and other expenses in the fourth quarter 2017 were $5.6 million, which was $6.6 million lower than the third quarter 2017, and included a $3.7 million benefit for reductions in liabilities for legacy employee benefit programs, and lower costs of closed facilities. For the full year 2017, closed operations and other expenses were comparable to the prior year, as lower closed facility costs, benefit program changes, and higher royalty income were offset by increased foreign currency exchange losses and other legacy costs of closed operations, compared to prior year amounts.\nIncome Taxes\nATI continues to maintain income tax valuation allowances on its U.S. federal and state deferred tax assets. As a result, the remeasurement of our deferred tax assets and liabilities due to lower enacted tax rates in the Tax Cuts and Jobs Act did not have a significant impact on fourth quarter results. A $4.1 million tax benefit was recognized on the remeasurement of certain tax attributes, mainly indefinite-lived deferred tax liabilities. ATI does not expect to pay any significant U.S. federal or state income taxes for the next few years due to net operating loss carryforwards. Tax law changes in the Tax Cuts and Jobs Act related to a liability for foreign earnings are expected to be offset with these net operating loss carryforwards or other tax attributes.\nAllegheny Technologies will conduct a conference call with investors and analysts on Tuesday, January 23, 2018, at 8:30 a.m. ET to discuss the financial results. The conference call will be broadcast, and accompanying presentation slides will be available, at ATImetals.com . To access the broadcast, click on “Conference Call”. Replay of the conference call will be available on the Allegheny Technologies website.\nThis news release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Certain statements in this news release relate to future events and expectations and, as such, constitute forward-looking statements. Forward-looking statements, which may contain such words as “anticipates,” “believes,” “estimates,” “expects,” “would,” “should,” “will,” “will likely result,” “forecast,” “outlook,” “projects,” and similar expressions, are based on management’s current expectations and include known and unknown risks, uncertainties and other factors, many of which we are unable to predict or control. Our performance or achievements may differ materially from those expressed or implied in any forward-looking statements due to the following factors, among others: (a) material adverse changes in economic or industry conditions generally, including global supply and demand conditions and prices for our specialty metals; (b) material adverse changes in the markets we serve; (c) our inability to achieve the level of cost savings, productivity improvements, synergies, growth or other benefits anticipated by management from strategic investments and the integration of acquired businesses; (d) volatility in the price and availability of the raw materials that are critical to the manufacture of our products; (e) declines in the value of our defined benefit pension plan assets or unfavorable changes in laws or regulations that govern pension plan funding; (f) labor disputes or work stoppages; (g) equipment outages and (h) other risk factors summarized in our Annual Report on Form 10-K for the year ended December 31, 2016, and in other reports filed with the Securities and Exchange Commission. We assume no duty to update our forward-looking statements.\nCreating Value Thru Relentless Innovation™\nATI is a global manufacturer of technically advanced specialty materials and complex components. With revenue of $3.5 billion for the twelve month period ended December 31, 2017, our largest market is aerospace & defense, particularly jet engines. We also have a strong presence in the oil & gas, electrical energy, medical, automotive, and other industrial markets. ATI is a market leader in manufacturing differentiated specialty alloys and forgings that require our unique manufacturing and precision machining capabilities and our innovative new product development competence. We are a leader in producing powders for use in next-generation jet engine forgings and 3D-printed aerospace products. ATIMetals.com\nAllegheny Technologies Incorporated and Subsidiaries Consolidated Statements of Operations (Unaudited, dollars in millions, except per share amounts) Three Months Ended Fiscal Year Ended December 31 September 30 December 31 December 31 December 31 2017 2017 2016 2017 2016 Sales $ 909.9 $ 869.1 $ 796.1 $ 3,525.1 $ 3,134.6 Cost of sales 779.3 775.8 698.8 3,076.1 2,972.1 Gross profit 130.6 93.3 97.3 449.0 162.5 Selling and administrative expenses 61.9 66.2 65.3 254.3 247.7 Impairment of goodwill - 114.4 - 114.4 - Restructuring charges - - 28.6 - 527.2 Operating income (loss) 68.7 (87.3 ) 3.4 80.3 (612.4 ) Interest expense, net (31.6 ) (34.2 ) (32.8 ) (133.8 ) (124.0 ) Debt extinguishment charge (37.0 ) - - (37.0 ) - Other income, net 0.3 0.2 0.6 4.0 2.4 Income (loss) before income taxes 0.4 (121.3 ) (28.8 ) (86.5 ) (734.0 ) Income tax benefit (4.8 ) (1.9 ) (42.5 ) (6.8 ) (106.9 ) Net income (loss) $ 5.2 $ (119.4 ) $ 13.7 $ (79.7 ) $ (627.1 ) Less: Net income attributable to noncontrolling interests 3.5 1.8 3.8 12.2 13.8 Net income (loss) attributable to ATI $ 1.7 $ (121.2 ) $ 9.9 $ (91.9 ) $ (640.9 ) Basic net income (loss) attributable to ATI per common share $ 0.01 $ (1.12 ) $ 0.09 $ (0.83 ) $ (5.97 ) Diluted net income (loss) attributable to ATI per common share $ 0.01 $ (1.12 ) $ 0.09 $ (0.83 ) $ (5.97 ) Weighted average common shares outstanding -- basic (millions) 117.5 107.7 107.3 110.1 107.3 Weighted average common shares outstanding -- diluted (millions) 118.6 107.7 108.7 110.1 107.3 Actual common shares outstanding-- end of period (millions) 125.9 108.9 108.9 125.9 108.9\nAllegheny Technologies Incorporated and Subsidiaries Sales and Operating Profit by Business Segment (Unaudited, dollars in millions) Three Months Ended Fiscal Year Ended December 31 September 30 December 31 December 31 December 31 2017 2017 2016 2017 2016 Sales: High Performance Materials & Components $ 517.7 $ 512.9 $ 477.2 $ 2,067.4 $ 1,930.4 Flat Rolled Products 392.2 356.2 318.9 1,457.7 1,204.2 Total External Sales $ 909.9 $ 869.1 $ 796.1 $ 3,525.1 $ 3,134.6 Operating Profit (Loss): High Performance Materials & Components $ 65.8 $ 61.7 $ 53.8 $ 246.4 $ 168.7 % of Sales 12.7 % 12.0 % 11.3 % 11.9 % 8.7 % Flat Rolled Products 22.4 (7.3 ) (0.8 ) 37.0 (163.0 ) % of Sales 5.7 % -2.0 % -0.3 % 2.5 % -13.5 % Operating Profit 88.2 54.4 53.0 283.4 5.7 % of Sales 9.7 % 6.3 % 6.7 % 8.0 % 0.2 % LIFO and net realizable value reserves - (0.1 ) 0.4 (0.2 ) 0.8 Corporate expenses (13.6 ) (14.8 ) (10.8 ) (50.5 ) (43.4 ) Closed operations and other expenses (5.6 ) (12.2 ) (10.0 ) (34.0 ) (34.6 ) Impairment of goodwill - (114.4 ) - (114.4 ) - Restructuring and other charges - - (28.6 ) - (538.5 ) Debt extinguishment charge (37.0 ) - - (37.0 ) - Interest expense, net (31.6 ) (34.2 ) (32.8 ) (133.8 ) (124.0 ) Income (loss) before income taxes $ 0.4 $ (121.3 ) $ (28.8 ) $ (86.5 ) $ (734.0 )\nAllegheny Technologies Incorporated and Subsidiaries Condensed Consolidated Balance Sheets (Unaudited, dollars in millions) December 31, December 31, 2017 2016 ASSETS Current Assets: Cash and cash equivalents $ 141.6 $ 229.6 Accounts receivable, net of allowances for doubtful accounts 545.3 452.1 Inventories, net 1,176.1 1,037.0 Prepaid expenses and other current assets 52.7 47.8 Total Current Assets 1,915.7 1,766.5 Property, plant and equipment, net 2,495.7 2,498.9 Goodwill 531.4 641.9 Other assets 242.6 262.7 Total Assets $ 5,185.4 $ 5,170.0 LIABILITIES AND EQUITY Current Liabilities: Accounts payable $ 420.1 $ 294.3 Accrued liabilities 282.4 309.3 Short term debt and current portion of long-term debt 10.1 105.1 Total Current Liabilities 712.6 708.7 Long-term debt 1,530.6 1,771.9 Accrued postretirement benefits 317.8 317.7 Pension liabilities 697.0 827.9 Deferred income taxes 9.7 15.6 Other long-term liabilities 73.2 83.4 Total Liabilities 3,340.9 3,725.2 Total ATI stockholders' equity 1,739.4 1,355.2 Noncontrolling interests 105.1 89.6 Total Equity 1,844.5 1,444.8 Total Liabilities and Equity $ 5,185.4 $ 5,170.0\nAllegheny Technologies Incorporated and Subsidiaries Condensed Consolidated Statements of Cash Flows (Unaudited, dollars in millions) Fiscal Year Ended December 31 2017 2016 Operating Activities: Net loss $ (79.7 ) $ (627.1 ) Depreciation and amortization 160.8 170.3 Impairment of goodwill 114.4 - Non-cash restructuring and other charges - 471.3 Debt extinguishment charge 37.0 - Deferred taxes (1.4 ) (119.8 ) Change in managed working capital (111.8 ) 91.7 Change in retirement benefits (a) (110.3 ) (80.0 ) Accrued liabilities and other 13.4 49.9 Cash provided by (used in) operating activities 22.4 (43.7 ) Investing Activities: Purchases of property, plant and equipment (122.7 ) (202.2 ) Asset disposals and other 3.1 2.2 Cash used in investing activities (119.6 ) (200.0 ) Financing Activities: Borrowings on long-term debt 8.5 387.5 Payments on long-term debt and capital leases (353.0 ) (2.7 ) Net borrowings under credit facilities 1.6 3.1 Debt issuance costs (0.8 ) (10.4 ) Debt extinguishment charge (35.8 ) - Issuance of common stock 397.8 - Dividends paid to shareholders - (25.8 ) Dividends paid to noncontrolling interests (8.0 ) (16.0 ) Sale (purchase) of noncontrolling interests 3.7 (12.2 ) Taxes on share-based compensation and other (4.8 ) - Cash provided by financing activities 9.2 323.5 Increase (decrease) in cash and cash equivalents (88.0 ) 79.8 Cash and cash equivalents at beginning of period 229.6 149.8 Cash and cash equivalents at end of period $ 141.6 $ 229.6 (a) Includes $(135) million contribution to the U.S. defined benefit pension plan in 2017 and $(115) million contribution to the U.S. defined benefit pension plan in 2016.\nAllegheny Technologies Incorporated and Subsidiaries Selected Financial Data (Unaudited) Three Months Ended Fiscal Year Ended December 31 September 30 December 31 December 31 December 31 2017 2017 2016 2017 2016 Percentage of Total ATI Sales High-Value Products Nickel-based alloys and specialty alloys 31 % 28 % 26 % 28 % 27 % Precision forgings, castings and components 18 % 19 % 18 % 18 % 18 % Titanium and titanium-based alloys 16 % 17 % 18 % 17 % 19 % Precision and engineered strip 14 % 14 % 14 % 14 % 13 % Zirconium and related alloys 5 % 6 % 8 % 6 % 8 % Total High-Value Products, excluding GOES 84 % 84 % 84 % 83 % 85 % Grain-oriented electrical steel (GOES) 0 % 0 % 0 % 0 % 1 % Total High-Value Products, including GOES 84 % 84 % 84 % 83 % 86 % Standard Products Stainless steel sheet 8 % 9 % 10 % 9 % 7 % Specialty stainless sheet 4 % 4 % 4 % 4 % 4 % Stainless steel plate and other 4 % 3 % 2 % 4 % 3 % Total Standard Products 16 % 16 % 16 % 17 % 14 % Grand Total 100 % 100 % 100 % 100 % 100 % Three Months Ended Fiscal Year Ended December 31 September 30 December 31 December 31 December 31 Shipment Volume: 2017 2017 2016 2017 2016 Flat Rolled Products (000's lbs.) High value* 90,332 83,637 75,708 323,391 293,589 Standard 100,973 115,907 112,164 446,542 385,010 Flat Rolled Products total 191,305 199,544 187,872 769,933 678,599 Average Selling Prices: Flat Rolled Products (per lb.) High value* $ 2.94 $ 2.69 $ 2.54 $ 2.81 $ 2.59 Standard $ 1.23 $ 1.13 $ 1.11 $ 1.21 $ 1.06 Flat Rolled Products combined average $ 2.04 $ 1.78 $ 1.68 $ 1.88 $ 1.72 * High value products exclude GOES for the quarter and twelve months ended December 31, 2016.\nAllegheny Technologies Incorporated and Subsidiaries Computation of Basic and Diluted Earnings Per Share Attributable to ATI (Unaudited, in millions, except per share amounts) Three Months Ended Fiscal Year Ended December 31 September 30 December 31 December 31 December 31 2017 2017 2016 2017 2016 Numerator for Basic net income (loss) per common share - Net income (loss) attributable to ATI $ 1.7 $ (121.2 ) $ 9.9 $ (91.9 ) $ (640.9 ) Effect of dilutive securities: 4.75% Convertible Senior Notes due 2022 - - - - - Numerator for Diluted net income (loss) per common share - Net income (loss) attributable to ATI after assumed conversions $ 1.7 $ (121.2 ) $ 9.9 $ (91.9 ) $ (640.9 ) Denominator for Basic net income (loss) per common share - Weighted average shares outstanding 117.5 107.7 107.3 110.1 107.3 Effect of dilutive securities: Share-based compensation 1.1 - 1.4 - - 4.75% Convertible Senior Notes due 2022 - - - - - Denominator for Diluted net income (loss) per common share - Adjusted weighted average shares assuming conversions 118.6 107.7 108.7 110.1 107.3 Basic net income (loss) attributable to ATI per common share $ 0.01 $ (1.12 ) $ 0.09 $ (0.83 ) $ (5.97 ) Diluted net income (loss) attributable to ATI per common share $ 0.01 $ (1.12 ) $ 0.09 $ (0.83 ) $ (5.97 )\nAllegheny Technologies Incorporated and Subsidiaries Other Financial Information Managed Working Capital (Unaudited, dollars in millions) December 31 December 31 2017 2016 Accounts receivable $ 545.3 $ 452.1 Inventory 1,176.1 1,037.0 Accounts payable (420.1 ) (294.3 ) Subtotal 1,301.3 1,194.8 Allowance for doubtful accounts 5.9 7.3 LIFO reserve (43.1 ) (97.3 ) Inventory reserves 121.5 169.0 Managed working capital $ 1,385.6 $ 1,273.8 Annualized prior 3 months sales $ 3,639.5 $ 3,184.2 Managed working capital as a % of annualized sales 38.1 % 40.0 % December 31, 2017 change in managed working capital $ 111.8 As part of managing the liquidity in our business, we focus on controlling managed working capital, which is defined as gross accounts receivable and gross inventories, less accounts payable. In measuring performance in controlling this managed working capital, we exclude the effects of LIFO and other inventory valuation reserves and reserves for uncollectible accounts receivable which, due to their nature, are managed separately.\nAllegheny Technologies Incorporated and Subsidiaries Other Financial Information Debt to Capital (Unaudited, dollars in millions) December 31 December 31 2017 2016 Total debt (a) $ 1,553.8 $ 1,894.1 Less: Cash (141.6 ) (229.6 ) Net debt $ 1,412.2 $ 1,664.5 Net debt $ 1,412.2 $ 1,664.5 Total ATI stockholders' equity 1,739.4 1,355.2 Net ATI capital $ 3,151.6 $ 3,019.7 Net debt to ATI capital 44.8 % 55.1 % Total debt (a) $ 1,553.8 $ 1,894.1 Total ATI stockholders' equity 1,739.4 1,355.2 Total ATI capital $ 3,293.2 $ 3,249.3 Total debt to total ATI capital 47.2 % 58.3 % (a) Excludes debt issuance costs.\nIn managing the overall capital structure of the Company, some of the measures that we focus on are net debt to net capitalization, which is the percentage of debt, net of cash that may be available to reduce borrowings, to the total invested and borrowed capital of ATI (excluding noncontrolling interest), and total debt to total ATI capitalization, which excludes cash balances.\nAllegheny Technologies Incorporated and Subsidiaries\nNon-GAAP Financial Measures\n(Unaudited, dollars in millions, except per share amounts)\nThe Company reports its financial results in accordance with accounting principles generally accepted in the United States of America (\"GAAP\"). However, management believes that certain non-GAAP financial measures, used in managing the business, may provide users of this financial information with additional meaningful comparisons between current results and results in prior periods. Non-GAAP financial measures should be viewed in addition to, and not as an alternative for, the Company's reported results prepared in accordance with GAAP. The following table provides the calculation of the non-GAAP financial measures discussed in the Company's press release dated January 23, 2018:\nThree Months Ended Fiscal Year Ended December 31 September 30 December 31 December 31 2017 2017 2016 2017 2016 Income (loss) attributable to ATI $ 1.7 $ (121.2 ) $ 9.9 $ (91.9 ) $ (640.9 ) Adjust for special items: Debt extinguishment charge, net of tax (a) $ 37.0 $ - $ - 37.0 - Impairment of goodwill, net of tax (b) - 113.6 - 113.6 - Restructuring and other charges, net of tax (c) - - 18.6 - 354.8 Rowley excess operating costs, net of tax (d) - - - - 19.3 Work stoppage and return-to-work costs (e) - - - - 28.1 Income tax items including valuation allowances (f) (4.1 ) - (32.4 ) (4.1 ) 141.3 Income (loss) attributable to ATI excluding special items $ 34.6 $ (7.6 ) $ (3.9 ) $ 54.6 $ (97.4 ) Per Diluted Share * Per Diluted Share * Income (loss) attributable to ATI $ 0.01 $ (1.12 ) $ 0.09 $ (0.83 ) $ (5.97 ) Adjust for special items: Debt extinguishment charge, net of tax (a) $ 0.29 $ - $ - 0.29 - Impairment of goodwill, net of tax (b) - 1.05 - 1.05 - Restructuring and other charges, net of tax (c) - - 0.17 - 3.30 Rowley excess operating costs, net of tax (d) - - - - 0.18 Work stoppage and return-to-work costs (e) - - - - 0.27 Income tax items including valuation allowances (f) (0.03 ) - (0.30 ) (0.03 ) 1.31 Income (loss) attributable to ATI excluding special items $ 0.27 $ (0.07 ) $ (0.04 ) $ 0.48 $ (0.91 ) * Presentation of adjusted results per diluted share includes the effects of convertible debt, if dilutive.\n(a) Fourth quarter and fiscal year ended December 31, 2017 results include a debt extinguishment charge of $37.0 after-tax, or $(0.29) per share, for the full redemption of the $350, 9.375% Senior Notes due 2019.\n(b) During the third quarter of 2017, the Company performed an interim goodwill impairment analysis, as required by accounting standards, for our Cast Products business and determined that all goodwill assigned to this business unit was impaired. As a result, the Company recorded a $114.4 pre-tax non-cash goodwill impairment charge ($113.6 after-tax), or $(1.05) per share.\n(c) For the three months ended December 31, 2016, $28.6 of pre-tax restructuring charges ($18.6 after-tax at a standard 35% tax rate), or $(0.17) per share, including $13.0 for additional HPMC segment titanium operations closure-related actions at the Rowley, UT, Frackville, PA and Albany, OR titanium operations, and $15.6 for FRP closure-related costs at the Midland and Bagdad, PA facilities and for additional FRP severance charges for salaried workforce reductions. These restructuring charges, which are excluded from business segment results, include contractual obligations, closure costs, severance and supplemental unemployment benefits. FRP restructuring costs also include $3.4 of special termination benefits for pension and other postretirement benefit plans.\nIn addition to the amounts for the three months ended December 31, 2016 above, the twelve months ended December 31, 2016 includes $471.3 of pre-tax asset impairment charges ($310.3 after-tax), or $(2.89) per share, and $28.6 of pre-tax shutdown, idling and employee benefit costs ($18.8 after-tax), or $(0.18) per share for the Rowley, UT facility, which are excluded from HPMC segment results. The remaining $7.1 after-tax, or $(0.06) per share, includes additional charges for severance actions.\n(d) During the third quarter of 2016, the Company indefinitely idled its titanium sponge production facility in Rowley, UT. These amounts represent the above-market production costs and other operating expenses for this facility for the period indicated, net of expected ongoing carrying costs, and have been adjusted out of the Company's GAAP amounts to provide Company results that are more representative of the future, which exclude these costs.\n(e) For the first six months of fiscal year 2016, the Company incurred costs associated with the work stoppage and return-to-work of USW-represented employees including reduced operating efficiencies, out-of-phase raw material costs, and provisions of the new labor agreements.\n(f) Amounts for the three months and fiscal year ended December 31, 2017 include $4.1 of tax benefits, or $0.03 per share, from the 2017 Tax Cuts and Jobs Act legislation. Amounts for the three months ended December 31, 2016 include $32.4, or $0.30 per share, of above-normal income tax benefits compared to those that would apply at a standard 35% tax rate, primarily related to income tax valuation allowance changes. Amounts for the fiscal year ended December 31, 2016 include $141.3 or $(1.31) per share, of below-normal income tax benefits on the $734.0 pretax loss due primarily to valuation allowances recorded on U.S. federal deferred tax assets.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123005778/en/\nAllegheny Technologies Incorporated\nScott Minder, 412-395-2720\nwww.ATImetals.com\nSource: Allegheny Technologies Incorporated", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ATImetals.com&esheet=51746719&lan=en-US&anchor=www.ATImetals.com&index=2&md5=58f8a6e92e8fe51814ef28b1e5468f5c", "http://www.businesswire.com/news/home/20180123005778/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ATImetals.com&esheet=51746719&newsitemid=20180123005778&lan=en-US&anchor=ATImetals.com&index=1&md5=c2051028353b55c59292a91554af9c71"], "published": "2018-01-23T15:30:00.000+02:00", "crawled": "2018-01-23T18:41:07.015+02:00", "highlightTitle": ""}