{"organizations": [], "uuid": "89219fee2fd408d85e6ac9b54d15ac6ab3cf2cd0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-voxx-international-corporation-reports-its-fiscal-2018-third-quarter-financial-results.html", "country": "US", "domain_rank": 767, "title": "VOXX International Corporation Reports Its Fiscal 2018 Third Quarter Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-10T00:15:00.000+02:00", "replies_count": 0, "uuid": "89219fee2fd408d85e6ac9b54d15ac6ab3cf2cd0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-voxx-international-corporation-reports-its-fiscal-2018-third-quarter-financial-results.html", "ord_in_thread": 0, "title": "VOXX International Corporation Reports Its Fiscal 2018 Third Quarter Financial Results", "locations": [], "entities": {"persons": [{"name": "hirschmann", "sentiment": "none"}, {"name": "pat lavelle", "sentiment": "none"}, {"name": "lavelle", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "orlando", "sentiment": "none"}], "organizations": [{"name": "voxx international corporation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ORLANDO, Fla., Jan. 9, 2018 /PRNewswire/ -- VOXX International Corporation (NASDAQ: VOXX), a leading manufacturer and distributor of automotive and consumer technologies for global markets, announced its financial results for the Fiscal 2018 third quarter ended November 30, 2017.\nPat Lavelle, President and CEO of VOXX International Corporation stated, \"Our sale of Hirschmann in August 2017 enabled us to pay down virtually all of our debt, except mortgages, and we now have a healthy cash position and access to capital through our banking facilities to execute our strategy and unlock shareholder value. Over the coming year, we intend to look for accretive acquisitions and potentially monetize some of our assets, while realigning some of our operations to lower expenses and enhance the bottom-line. Further, we remain focused on generating growth, through both product innovation and by developing new partnerships that leverage our distribution and reach.\"\nLavelle continued, \"During the fiscal 2018 third quarter, we posted growth in our Premium Audio and Consumer Accessories segments and we have several new product introductions on the horizon across all of our business segments that should contribute to top-line growth in the coming years. While Automotive segment revenue came in lower than the prior year, it was due primarily to timing as new OEM programs for our EVO rear seat infotainment solutions started later than anticipated. Further, during the quarter, we took steps to lower our overhead, as expenses came in 6.6% lower than the prior year and we generated year-over-year improvements in operating income and net income. Our Board and management team continue to evaluate all options that will improve our market position, product offering and valuation.\"\nOn August 31, 2017, the Company completed its sale of Hirschmann Car Communication GmbH and its subsidiaries (collectively, \"Hirschmann\") to a subsidiary of TE Connectivity Ltd. The consideration received by the Company was €148,500. The purchase price, at the exchange rate as of the close of business on the Closing Date approximated $177.0 million, and is subject to adjustment based upon the final working capital. The Hirschmann subsidiary group, which was previously included within the Automotive segment, qualified to be presented as a discontinued operation in accordance with ASC 205-20 beginning in the Company's second quarter ended August 31, 2017 and is reflected in the Company's third quarter net income results for the comparable periods ended November 30, 2017 and November 30, 2016.\nThird Quarter Performance Review\nNet sales for the Fiscal 2018 third quarter were $156.6 million as compared to net sales of $157.4 million in the comparable year-ago period, a decline of $0.8 million or 0.5%.\nAutomotive segment sales were $40.6 million as compared to $48.8 million, a decline of $8.2 million or 16.8%. This was principally due to lower aftermarket sales of satellite radio products, offset by higher sales of aftermarket overhead and headrest product sales. Additionally, the Company experienced lower domestic OEM sales due to timing, as headrest programs with two OEM customers were winding down in anticipation of new programs for the Company's next-generation EVO infotainment systems, which are now shipping. Premium Audio segment sales were $57.4 million as compared to $56.8 million, an increase of $0.6 million or 1.1%. Driving the year-over-year increase were higher European sales, higher sales of select home entertainment speaker lines, including various lines of HD wireless speakers, wireless sound bars, Klipsch Heritage products and wireless and multi-room streaming audio systems. This increase was partially offset by lower sales of wireless headphones and portable Bluetooth speakers, given the prior year's success, as well as lower sales of commercial speakers, primarily in the cinema speaker category. Consumer Accessories segment sales were $58.5 million as compared to $51.4 million, an increase of $7.0 million or 13.7%. The segment experienced higher sales of Project Nursery products, Striiv activity tracking bands, wireless speakers, and reception products, as well as an increase in international sales. Offsetting these increases were lower sales of other consumer accessory product lines.\nThe gross margin for the Fiscal 2018 third quarter came in at 26.5% as compared to 27.7% for the same period last year. The decline in gross margin was mostly as expected given the shift in product mix within the Company's business segments and product lines.\nAutomotive segment gross margins of 23.5% declined by 210 basis points, primarily as a result of lower OEM manufacturing sales, from which the Company generally earns higher margins, offset by an increase in sales of certain higher margin products such as aftermarket overhead and headrest systems, and lower satellite radio fulfillment sales. Premium Audio segment margins of 33.4% increased by 60 basis points due to higher sales of home entertainment speakers and systems, offset by lower sales of commercial speakers and certain close-out promotions to make way for newer product introductions. Consumer Accessories segment margins of 21.7% declined by 190 basis points, but gross profit dollars increased due to higher sales volumes. The year-over-year decline was primarily due to lower hookup product sales which typically carry higher gross margins, higher sales of the Striiv activity band, which carries lower gross margins, and promotions offered on certain products within the Project Nursery line. The Company also incurred higher freight charges due to increased demand for certain remote products in both the Fiscal 2018 and Fiscal 2017 third quarter periods, which adversely impacted gross margins.\nOperating expenses for the Fiscal 2018 third quarter were $35.9 million as compared to $38.4 million in the Fiscal 2017 third quarter, an improvement of $2.5 million or 6.6%. The year-over-year improvement was primarily related to a $1.8 million decline in general and administrative expenses as a result of headcount reductions in select groups and lower professional services and occupancy expenses, and a $1.0 million decline in engineering and technical support expenses. These improvements were partially offset by a $0.3 million increase in selling expenses due primarily to higher advertising and marketing related expenses.\nTotal other income for the three months ended November 30, 2017 was $1.3 million as compared to $0.2 million in total other income in the comparable year-ago period. Interest and bank charges declined by approximately $0.7 million due to a lower average outstanding balance on the Company's Credit Facility compared to the prior year period due to the use of proceeds from the Hirschmann sale on August 31, 2017. Equity in income of equity investees of $2.0 million increased by approximately $0.1 million due to higher sales and a special project performed for one of the Company's customers during the Fiscal 2018 third quarter. Other, net increased by approximately $0.4 million due to changes in net foreign currency losses, among other factors.\nThe Company reported operating income of $5.6 million as compared to operating income of $5.2 million for the comparable Fiscal 2017 period", "external_links": ["http://www.prnewswire.com/news-releases/voxx-international-corporation-reports-its-fiscal-2018-third-quarter-financial-results-300580296.html", "http://www.voxxintl.com/"], "published": "2018-01-10T00:15:00.000+02:00", "crawled": "2018-01-10T02:22:00.007+02:00", "highlightTitle": ""}