{"organizations": [], "uuid": "f5570202606fd52d3852564bf9d78f21358a3885", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/09/07/103922578-RTX2OJCC.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/24/apple-coo-williams-says-new-health-record-beta-is-right-thing-to-do.html", "country": "US", "domain_rank": 767, "title": "Apple COO Williams says new health record beta is 'right thing to do'", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:30:00.000+02:00", "replies_count": 0, "uuid": "f5570202606fd52d3852564bf9d78f21358a3885"}, "author": "Christina Farr", "url": "https://www.cnbc.com/2018/01/24/apple-coo-williams-says-new-health-record-beta-is-right-thing-to-do.html", "ord_in_thread": 0, "title": "Apple COO Williams says new health record beta is 'right thing to do'", "locations": [], "entities": {"persons": [{"name": "williams", "sentiment": "negative"}, {"name": "jeff williams", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "penn medicine", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "cedars-sinai", "sentiment": "none"}, {"name": "johns hopkins medicine", "sentiment": "none"}, {"name": "university of california", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "If you've ever struggled to access your medical information, like a lab test or immunization, Apple is trying to make your life easier.\nOn Wednesday, the company is releasing the test version of a new product that lets users download their health records, store them safely and show them to a doctor, caregiver or friend.\n\"We view the future as consumers owning their own health data,\" Apple Chief Operating Officer Jeff Williams said in an interview with CNBC. \nIt all works when a user opens the iPhone's health app, navigates to the health record section, and, on the new tool, adds a health provider. From there, the user taps to connect to Apple's software system and data start streaming into the service. Patients will get notified via an alert if new information becomes available. \nIn June, CNBC first reporte d on Apple's plans, including early discussions with top U.S. hospitals. The company confirmed that it has contracts with about a dozen hospitals across the country, including Cedars-Sinai, Johns Hopkins Medicine, Penn Medicine and the University of California, San Diego. \nThe medical information available will include allergies, conditions, immunizations, lab results, medications, procedures and vitals. The information is encrypted and protected through a user's iPhone passcode.\n\"Apple doesn't see the data unless the consumer chooses to share it,\" Williams said.\nRegulators and patient advocates have for years pushed for data-sharing standards within the medical sector to make it easier for records to flow between hospitals and doctors' offices. The lack of interoperability has made it a challenge for consumers to access high-quality care and has led to unnecessary medical errors. \nImproving the experience Apple is working with electronic medical record companies, notably Epic Systems, Cerner and AthenaHealth , to make it easier for people to view that information on the iPhone. That way, they can simply pull it up and suggest their doctor take a look. \nMedical record vendors \"have been an enabling, and not a blocking factor, and we appreciate that,\" Kevin Lynch, Apple's vice president of technology, told CNBC. Apple is working alongside these companies to take advantage of a protocol for exchanging electronic health records, known as FHIR. \nIn the future, hospitals and clinics will be able to register themselves for the service without going through an Apple representative.\nApple has stressed that its primary goal is to give users a better experience and not to sell more iOS devices. Still, the Apple Watch is increasingly positioning itself as a health and fitness device, which also has the potential to save lives by tracking the user's heart health . \nAnd the new service, which is part of the iOS 11.3 beta, could be a draw to iPhones, particularly for users with multiple chronic conditions who will benefit most from access to their medical records. \nUltimately, \"we're hoping to enable richer conversations between doctor and patient,\" said Sumbul Desai, Apple's digital health lead who's also a physician and medical researcher and formerly worked at Stanford.\nOther technology companies have attempted to solve this problem through their own web-based tools but have failed. Google shut down Google Health in 2011 due to a lack of traction among consumers. \nApple is taking a different approach by ensuring that consumers can get their data in a matter of minutes. \n\"It's difficult to think about something more significant than health records,\" said Williams. \"With your banking records, you can see every transaction and dollars spent, and yet my health is way more significant and I couldn't put my finger on any of my lab information.\"\nWATCH: Will Apple replace your family doctor? show chapters Will Apple replace your family doctor?      8:01 PM ET Fri, 20 Oct 2017 | 01:39", "external_links": [], "published": "2018-01-24T16:30:00.000+02:00", "crawled": "2018-01-24T15:56:24.001+02:00", "highlightTitle": ""}