{"organizations": [], "uuid": "3e256de21a20f4fe85e622f998303cf1a5247ffa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/business-wire-alicorp-to-explore-a-potential-ma-transaction-in-bolivia.html", "country": "US", "domain_rank": 767, "title": "Alicorp to Explore a Potential M&A Transaction in Bolivia", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.073, "site_type": "news", "published": "2018-01-16T00:00:00.000+02:00", "replies_count": 0, "uuid": "3e256de21a20f4fe85e622f998303cf1a5247ffa"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/business-wire-alicorp-to-explore-a-potential-ma-transaction-in-bolivia.html", "ord_in_thread": 0, "title": "Alicorp to Explore a Potential M&A Transaction in Bolivia", "locations": [], "entities": {"persons": [{"name": "alic", "sentiment": "negative"}, {"name": "fino", "sentiment": "none"}, {"name": "agre", "sentiment": "none"}], "locations": [{"name": "bolivia lima", "sentiment": "none"}, {"name": "peru", "sentiment": "none"}, {"name": "bolivia", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}], "organizations": [{"name": "alicorp s.a.a.", "sentiment": "negative"}, {"name": "lima stock exchange", "sentiment": "negative"}, {"name": "alicorp", "sentiment": "negative"}, {"name": "romero group", "sentiment": "none"}, {"name": "adm bolivia", "sentiment": "none"}, {"name": "adm", "sentiment": "none"}, {"name": "industrias del aceite s.a.", "sentiment": "none"}, {"name": "adm-sao s.a.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LIMA, Peru--(BUSINESS WIRE)-- Alicorp S.A.A. (the “Company” or “Alicorp”) (Lima Stock Exchange: ALICORC1 and ALICORI1) a leading Peruvian CPG and B2B company, announced that it is currently assessing the potential acquisition of the leading integrated CPG platform in Bolivia . Discussions are still preliminary and subject to further due diligence and negotiation of final transaction terms and agreements.\nPotential Transaction Overview :\nAligned with Alicorp’s strategy to grow its core business in Latin America, the Company is currently assessing the potential acquisition of the leading integrated consumer goods platform in Bolivia.\nThe potential transaction would consider the acquisition of: 100% of the businesses comprising Industrias del Aceite S.A. (“Fino”), a leading integrated CPG and B2B company 100% of the businesses comprising ADM-SAO S.A. (“ADM Bolivia”), a leading oilseeds crusher and CPG company The Romero Group owns 100% of the share capital of Fino, while in the case of ADM Bolivia, the Romero Group has agreed with ADM to acquire ADM Bolivia through a Stock Purchase Agreement which is subject to the completion of certain precedent conditions The preliminary understanding considers a combined Enterprise Value of US$390mm - $420mm, subject to satisfactory completion of due diligence and negotiation of purchase agreement terms During 2017, Fino and ADM Bolivia generated close to US$500mm in sales\nTransaction Review and Approval Process :\nFor the evaluation of the acquisition of Fino and ADM-Bolivia, Alicorp’s management has hired first class financial and legal advisors and has requested approval from the Board of Directors to further analyze the merits and terms of the transaction.\nBeing a related party transaction, Alicorp’s Board of Directors has constituted an ad-hoc Committee composed of independent directors (the “Independent Committee”) The Independent Committee has also hired first class financial and legal advisors to support their review of the opportunity Upon completion of the negotiation of the transaction terms, the financial advisors retained by the Company and the Independent Committee are expected to deliver fairness opinions Upon advancing further in the due diligence and negotiation process, Alicorp´s management intends to call, through the Board of Directors, an Extraordinary Shareholders Meeting to present the proposed transaction to shareholders and request powers and decision´s delegation to the Board of Directors (represented by the Independent Committee) to finalize the evaluation of the potential transaction and approve the proposed negotiation terms and agreements\n***\nSpecial Event – Conference Call\nManagement will host a conference call for investors and analysts to discuss further details on this Potential M&A Transaction.\nDate: Tuesday, January 16, 2018\nTime: 3:00 p.m. Eastern Time, 3:00 p.m. Lima Time\nDetails for the Conference Call will be shared in a subsequent communication.\nWebcast presentation will be available at https://www.webcaster4.com/Webcast/Page/412/24196\n***\nAbout Alicorp\nAlicorp is a leading CPG and B2B company headquartered in Peru, with operations in other Latin American countries, such as Argentina, Brazil, Chile, Ecuador, and exports to 23 other countries. The Company focuses on three core businesses: (1) Consumer Products (food, personal and home care products) in Peru, Brazil, Argentina, Ecuador, Colombia and other countries, (2) Industrial Food Products (industrial flour, industrial lard, pre-mix and food service products), and (3) Aquaculture (fish and shrimp balanced feed).\nForward-Looking Statements\nCertain statements contained in this news release constitute \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements represent Alicorp's expectations or beliefs concerning future events, and it is possible that the results described in this press release will not be achieved. These forward-looking statements are subject to risks, uncertainties and other factors, many of which are outside of Alicorp's control that could cause actual results to differ materially from the results discussed in the forward-looking statements.\nAny forward-looking statement speaks only as of the date on which such statement is made, and, except as required by law, Alicorp does not undertake any obligation to update or revise any forward-looking statement, whether as a result of new information, future events or otherwise. New factors emerge from time to time and it is not possible for management to predict all such factors.\n***\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180115005639/en/\nAlicorp S.A.A.\nInvestor Relations\nAlexander Pendavis Heksner\nCorporate Finance Director & IRO\nT: 511-315-0800 Ext: 444410\nF: 511-315-0867\napendavish@alicorp.com.pe\ninvestorrelations@alicorp.com.pe\nSource: Alicorp S.A.A.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.webcaster4.com%2FWebcast%2FPage%2F412%2F24196&esheet=51743360&newsitemid=20180115005639&lan=en-US&anchor=https%3A%2F%2Fwww.webcaster4.com%2FWebcast%2FPage%2F412%2F24196&index=1&md5=2280299166d808341505d89299d843b9", "http://www.businesswire.com/news/home/20180115005639/en/", "https://www.webcaster4.com/Webcast/Page/412/24196"], "published": "2018-01-16T00:00:00.000+02:00", "crawled": "2018-01-16T00:28:58.013+02:00", "highlightTitle": ""}