{"organizations": [], "uuid": "81ce065b1f69408b72b952248ac3c61ef955e13f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-atlantic-power-corporation-announces-cdn70-million-offering-of-convertible-unsecured-subordinated-debentures.html", "country": "US", "domain_rank": 767, "title": "Atlantic Power Corporation Announces Cdn$70 Million Offering of Convertible Unsecured Subordinated Debentures", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.02, "site_type": "news", "published": "2018-01-23T00:14:00.000+02:00", "replies_count": 0, "uuid": "81ce065b1f69408b72b952248ac3c61ef955e13f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-atlantic-power-corporation-announces-cdn70-million-offering-of-convertible-unsecured-subordinated-debentures.html", "ord_in_thread": 0, "title": "Atlantic Power Corporation Announces Cdn$70 Million Offering of Convertible Unsecured Subordinated Debentures", "locations": [], "entities": {"persons": [], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "dedham", "sentiment": "none"}], "organizations": [{"name": "atlantic power corporation announces cdn", "sentiment": "neutral"}, {"name": "atlantic power corporation", "sentiment": "neutral"}, {"name": "atlantic power", "sentiment": "none"}, {"name": "rbc capital markets", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DEDHAM, Mass., Jan. 22, 2018 (GLOBE NEWSWIRE) -- Atlantic Power Corporation (NYSE:AT) (TSX:ATP) (“Atlantic Power” or the “Company”) announced today that it has entered into an agreement with a syndicate of underwriters, led by RBC Capital Markets, for the purchase by the underwriters of Cdn$70 million aggregate principal amount of 6.00% convertible unsecured subordinated debentures due January 31, 2025 (the “Debentures”). The Debentures will be convertible, at the option of the holder, into common shares of Atlantic Power at a conversion price of Cdn$4.20 per common share, being a ratio of approximately 238.0952 common shares per Cdn$1,000 principal amount of Debentures, subject to customary adjustments. Atlantic Power has granted an over-allotment option to the underwriters, exercisable at any time up to 30 days after completion of the initial offering, to acquire up to Cdn$10.5 million aggregate principal amount of additional Debentures to cover the underwriters’ over-allotment position as of the closing date, if any.\nAtlantic Power intends to file a prospectus supplement to its short form base shelf prospectus dated December 19, 2017 with the securities commissions and other similar regulatory authorities in each of the provinces and territories of Canada and to its base prospectus dated December 19, 2017 with the U.S. Securities and Exchange Commission (the “SEC”), containing details relating to the issuance of the Debentures. The offering is expected to close on or about January 29, 2018, subject to customary closing conditions, including stock exchange approvals.\nAtlantic Power intends to use the net proceeds from the offering of the Debentures to fund the redemption of all of the Company’s 5.75% Series C convertible unsecured subordinated debentures (current outstanding balance of US$42.5 million) that mature on June 30, 2019 and have a par call date of June 30, 2017. The Company intends to use the remainder of the net proceeds, if any, to fund the partial redemption of the Company’s 6.00% Series D extendible convertible unsecured subordinated debentures (current outstanding balance of Cdn$81.0 million) that mature on December 31, 2019 and have a par call date of December 31, 2017. The foregoing does not constitute a notice of redemption or an obligation to issue a notice of redemption for either the Series C or Series D debentures.\nThe Company has filed a registration statement (including a prospectus) with the SEC for the offering to which this communication relates. Before you invest, you should read the prospectus in that registration statement and other documents the Company has filed with the SEC, including the related prospectus supplement, for more complete information about the Company and this offering. You may get these documents for free by visiting EDGAR on the SEC website at www.sec.gov . In Canada, the Company has filed a short form base shelf prospectus for the offering to which this communication relates, and Canadian investors should read that prospectus and other documents the Company has filed with Canadian securities regulatory authorities, including the related prospectus supplement, for more complete information about the Company and this offering. You may get these documents for free under the Company’s profile on SEDAR at www.sedar.com . Alternatively, you can request that the applicable preliminary prospectus supplement (and when available the applicable final prospectus supplement) relating to this offering of Debentures be sent to you (free of charge) by contacting, in Canada, RBC Capital Markets at RBC Wellington Square, 8th Floor, 180 Wellington St. W., Toronto, Ontario, M5J 0C2; Attn: Distribution Centre (Phone: 416-842-5349; E-mail: Distribution.RBCDS@rbccm.com ) or, in the United States, RBC Capital Markets at 3 World Financial Center, 200 Vesey Street, 8th Floor, New York, New York, 10281; Attention: Equity Syndicate (Phone: 877-822-4089, Email: equityprospectus@rbccm.com ).\nAbout Atlantic Power\nAtlantic Power owns and operates a diverse fleet of power generation assets across nine states in the United States and two provinces in Canada. The Company’s power generation projects sell electricity to utilities and other large commercial customers largely under long-term power purchase agreements (“PPAs”), which seek to minimize exposure to changes in commodity prices. The aggregate electric generating capacity of this portfolio on a gross ownership basis is approximately 1,793 megawatts (“MW”), and on a net ownership basis is approximately 1,440 MW. Eighteen of the projects are currently operational, totaling 1,633 MW on a gross ownership basis and 1,280 MW on a net ownership basis. Four projects, all in Ontario, are not operational, three due to revised contractual arrangements with the offtaker and another, Tunis, has a forward-starting 15-year PPA that will commence with the commercial operation of the plant before June 2019. Eighteen of the power generation projects are majority-owned and directly operated and maintained by the Company.\nAtlantic Power's common shares trade on the New York Stock Exchange under the symbol AT and on the Toronto Stock Exchange under the symbol ATP. For more information, please contact:\nAtlantic Power Corporation\nInvestor Relations\n(617) 977-2700\ninfo@atlanticpower.com\nCautionary Note Regarding Forward-Looking Statements\nThis news release may include forward-looking statements within the meaning of the U.S. federal securities laws and forward-looking information under Canadian securities laws (referred to as \"forward-looking statements\"). These statements can generally be identified by the use of the words “outlook,” “objective,” “may,” “will,” “expect,” “intend,” “estimate,” “anticipate,” “believe,” “should,” “plans,” “continue” or similar expressions suggesting future outcomes or events. In particular, statements regarding Atlantic Power's intention to complete the offering and to use the proceeds as described above, as well as the timing for the commencement of the Tunis contract, constitute forward-looking statements. Forward-looking statements reflect Atlantic Power's current expectations regarding future events and speak only as of the date of this news release. These forward-looking statements are based on a number of assumptions which may prove to be incorrect. Forward-looking statements involve significant risks and uncertainties, should not be read as guarantees of future performance or results, and will not necessarily be accurate indications of whether or not or the times at or by which such performance or results will be achieved. A number of factors could cause actual results to differ materially from the results discussed in the forward-looking statements, including, but not limited to, the factors discussed under “Cautionary Statement Regarding Forward-Looking Statements” and ”Risk Factors” in the filings Atlantic Power makes from time to time with the SEC and Canadian securities regulators. Atlantic Power's business is both competitive and subject to various risks. Although the forward-looking statements contained in this news release are based upon what Atlantic Power believes to be reasonable assumptions, investors cannot be assured that actual results will be consistent with these forward-looking statements, and the differences may be material. Therefore, investors are urged not to place undue reliance on Atlantic Power's forward-looking statements. These forward-looking statements are made as of the date of this news release and, except as expressly required by applicable law, Atlantic Power assumes no obligation to update or revise them to reflect new information, future events or otherwise.\nSource:Atlantic Power Corporation", "external_links": ["https://www.globenewswire.com/Tracker?data=l_Zdgi_CjcnHayOctpYJTyzG2JTotaTtV_HRY9dnlKm0SsVzL0nZ9tR8XnnbMve4-MqT8lqQI16gTeRpgWmJkM9FOUp5C3lHWgQ_WUeaurVLr-tyvgp5I98lxjqP3PPl", "https://www.globenewswire.com/NewsRoom/AttachmentNg/d78f2233-f7be-4ab8-becd-bcbf3c80903c", "https://www.globenewswire.com/Tracker?data=8MruVBB7w3i9_pQ7yISpLukL-eO018qeNl2RntK8n2YSQT1e83Nt_-pwEgySqnZZq-K2wPKwTJEnHr5BTJNldQ==", "https://www.globenewswire.com/Tracker?data=N06DLA9vjO-ogExYeKvKtk-RhKeFNDngF4caabwnHE1gHnz6oGTsPSIk1J0p11BFK58Hg3EehBOCNQNiYTUp--fqdpPkDsrYSkQcKgfBsR4=", "https://www.globenewswire.com/Tracker?data=BIwoGR1mEIHwss5o9oTbGEoANG-vbTJPOAOB5Py37gHa1k8SGr6Uwl0cZ-_av95SFCBI7VW2MfQI1ZZ7dNEe2ZoxRyijxcuvtRcqpxk068LMA5gRHuPaSa6lYXcKWEY6", "https://www.globenewswire.com/Tracker?data=8MruVBB7w3i9_pQ7yISpLsKESZ6XP0TCCj23NIo6EEDMmunjXU25EH2ViDooQ-lqBiHlTrqJkGpTiWWmAc7yGA=="], "published": "2018-01-23T00:14:00.000+02:00", "crawled": "2018-01-23T02:16:19.010+02:00", "highlightTitle": ""}