{"organizations": [], "uuid": "c3dc0b020df26d096e1686694ce99fb78dff0fa7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222975840&w=1200&r=LYNXMPEE0H0N2", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-hongkong-court-riot/hong-kong-pro-independence-protest-leader-appears-in-court-for-rioting-idUKKBN1F70ZH", "country": "US", "domain_rank": 408, "title": "Hong Kong pro-independence protest leader appears in court for \"rioting\"", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T11:08:00.000+02:00", "replies_count": 0, "uuid": "c3dc0b020df26d096e1686694ce99fb78dff0fa7"}, "author": "", "url": "https://uk.reuters.com/article/uk-hongkong-court-riot/hong-kong-pro-independence-protest-leader-appears-in-court-for-rioting-idUKKBN1F70ZH", "ord_in_thread": 0, "title": "Hong Kong pro-independence protest leader appears in court for \"rioting\"", "locations": [], "entities": {"persons": [{"name": "venus wu", "sentiment": "none"}, {"name": "ray wong", "sentiment": "none"}, {"name": "edward leung", "sentiment": "none"}, {"name": "wong", "sentiment": "none"}, {"name": "anthea pang", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "hong kong indigenous", "sentiment": "none"}, {"name": "high court", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 9:09 AM / Updated 21 minutes ago Hong Kong pro-independence protest leader appears in court for \"rioting\" Venus Wu 3 Min Read \nHONG KONG (Reuters) - A young protest leader calling for Hong Kong’s independence from China appeared in court on the rare charge of rioting on Thursday as two co-defendants failed to show up, the latest case highlighting a new generation of opposition to Chinese rule. \nThe former head of radical group Hong Kong Indigenous, Edward Leung, 26, faces four charges, including rioting and incitement to riot, for his role in a 2016 Lunar New Year protest that turned violent when masked activists tossed bricks at police and burned trash cans. \nFive other protesters also appeared in court on rioting and other charges. \nRioting carries a maximum jail term of 10 years. The High Court had issued arrest warrants for two other activists, including protest leader Ray Wong, who failed to appear in court. \nActivist circles say Wong has left Hong Kong while a teenage female protester is in Taiwan. \nHigh Court Judge Anthea Pang issued an order that prohibits the reporting of details of the case before a jury is chosen. \nAbout 130 people were wounded in the clashes that were labelled a riot by then Chief Executive Leung Chun-ying. Policemen deliver evidence relating to rioting charges to the High Court in Hong Kong, China, January 18, 2018. REUTERS/Bobby Yip \nThe overnight demonstration began as a rally to support street hawkers but erupted into anger towards what protesters perceive as mainland China’s encroachment into the city’s autonomy and culture. \nWhen a months-long “Occupy” street occupation failed to wrestle more democratic rights from Beijing’s Communist Party rulers in 2014, a generation of young activists began pushing for outright independence, a red line for China. \nDozens of young protesters have been jailed for “unlawful assembly” and other charges. Joshua Wong, 21, the public face of Hong Kong’s democratic movement, was jailed for three months on Wednesday for refusing to leave a 2014 protest site. \nLast year, three protesters including a University of Hong Kong student were jailed for three years for rioting, the first convictions on this charge since hundreds broke into a fight at a drug addiction treatment centre in 2000. \nThe financial hub was promised a high degree of autonomy when Britain handed its colony back to Chinese rule in 1997 under a “one country, two systems” formula, but activists see evidence of growing interference by Beijing. \nHong Kong and Chinese authorities have repeatedly condemned calls for independence, citing the city’s mini-constitution, the “Basic Law”, which stipulates that the city is “an inalienable part” of China. \nThe hearing continues on Monday. Reporting by Venus Wu; Editing by Nick Macfie", "external_links": [], "published": "2018-01-18T11:08:00.000+02:00", "crawled": "2018-01-18T11:21:03.017+02:00", "highlightTitle": ""}