{"organizations": [], "uuid": "e4e7730fb5cf365bdacd5048ad7e55fa42671564", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180120.html", "section_title": "Archive News &amp; Video for Saturday, 20 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/afghanistan-attacks/update-1-gunmen-attack-kabuls-intercontinental-hotel-idUSL4N1PF00T", "country": "US", "domain_rank": 408, "title": "UPDATE 6-Several dead as gunmen attack top Kabul hotel", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.173, "site_type": "news", "published": "2018-01-21T01:53:00.000+02:00", "replies_count": 0, "uuid": "e4e7730fb5cf365bdacd5048ad7e55fa42671564"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/afghanistan-attacks/update-1-gunmen-attack-kabuls-intercontinental-hotel-idUSL4N1PF00T", "ord_in_thread": 0, "title": "UPDATE 6-Several dead as gunmen attack top Kabul hotel", "locations": [], "entities": {"persons": [{"name": "akram walizada", "sentiment": "negative"}, {"name": "hamid shalizi", "sentiment": "negative"}, {"name": "nasrat rahimi", "sentiment": "none"}, {"name": "ahmad haris nayab", "sentiment": "none"}], "locations": [{"name": "kabul", "sentiment": "none"}, {"name": "kabul", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reute", "sentiment": "negative"}, {"name": "intercontinental hotel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds detail on overnight lull in fighting)\nBy Hamid Shalizi and Akram Walizada\nKABUL, Jan 20 (Reuters) - Gunmen attacked Kabul’s Intercontinental Hotel on Saturday, seizing hostages and exchanging gunfire with security forces as the building in the Afghan capital caught fire and residents and staff fled.\nHotel manager Ahmad Haris Nayab, who escaped unhurt, said the attackers had got into the main part of the hotel through a kitchen and people tried to get out amid bursts of gunfire.\nSeveral people had been killed and at least six wounded in the raid, which came days after a U.S. embassy warning of possible attacks on hotels in Kabul, Nasrat Rahimi, an interior ministry spokesman, said. However, officials gave no other details on casualty numbers.\nThere was no immediate claim of responsibility for the latest in a long series of attacks which underlined the city’s precarious situation and the ability of militants to strike blows aimed at undermining confidence in the Western-backed government.\nOfficials said there were as many as four attackers and at least two of them had been killed as Afghan Special Forces cleared the first floor and moved up the building, battling the raiders, who appeared to have a large supply of hand grenades.\nHours after the attack began, firing appeared to ease as security forces settled in, waiting for dawn.\nAccording to one witness, who did not want to be named, the attackers took some hotel staff and guests hostage. He said some foreigners were among the hotel guests but it was not clear what their nationality was.\nThe Intercontinental Hotel, located on a hilltop and heavily protected like most public buildings in Kabul, was previously attacked by Taliban fighters in 2011.\nIt is one of two main luxury hotels in the city and had been due to host an information technology conference on Sunday. More than 100 IT managers and engineers were on site when the attack took place, Ahmad Waheed, an official at the telecommunications ministry, said.\nU.S. WARNING The attack came days after a United Nations Security Council visit to Kabul to allow senior representatives of member states to assess the situation in Afghanistan.\nMany details of the incident were still unclear, but Interior ministry spokesman Najib Danish said a private company had taken over security about three weeks ago.\nThe U.S. embassy in Kabul had issued a warning to U.S. citizens on Thursday, saying, “We are aware of reports that extremist groups may be planning an attack against hotels in Kabul.”\nThe State Department said it was monitoring the situation and was in contact with Afghan authorities to determine whether any U.S. citizens had been affected.\nCaptain Tom Gresback, spokesman for the NATO-led Resolute Support mission in Afghanistan, said they were also watching closely but it was not clear whether international forces took part in suppressing the attack.\n“Afghan National Defense and Security Forces are leading the response efforts. According to initial reports, no Resolute Support or (U.S. forces) members were injured in this incident,” he said in an emailed statement.\nAlthough the NATO-led Resolute Support mission says the Taliban has come under pressure after the United States increased assistance to Afghan security forces and stepped up air strikes against insurgents, security remains precarious.\nAs pressure on the battlefield has increased, security officials have warned that the danger of attacks on high-profile targets in Kabul and other cities would increase.\nAfter repeated attacks in Kabul, notably an incident last May in which a truck bomber killed at least 150 people outside the German embassy, security has been further tightened.\nWhile it shares the same name, the hotel in Kabul is not part of InterContinental Hotels Group (IHG), which issued a statement in 2011 saying that “the hotel Inter-continental in Kabul is not part of IHG and has not been since 1980”.\nAdditional reporting by Mirwais Harooni and David Brunnstrom in WASHINGTON; writing by James Mackenzie; editing by Alexander Smith\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-21T01:53:00.000+02:00", "crawled": "2018-01-21T13:22:41.000+02:00", "highlightTitle": ""}