{"organizations": [], "uuid": "d52d5e745c2ea7394af8ff523a6a77bafbf03051", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104956248-GettyImages-906260388.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/government-shutdown-news-senators-reach-deal-to-end-shutdown.html", "country": "US", "domain_rank": 767, "title": "Government shutdown news: Senators reach deal to end shutdown", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.487, "site_type": "news", "published": "2018-01-22T18:58:00.000+02:00", "replies_count": 0, "uuid": "d52d5e745c2ea7394af8ff523a6a77bafbf03051"}, "author": "Christina Wilkie", "url": "https://www.cnbc.com/2018/01/22/government-shutdown-news-senators-reach-deal-to-end-shutdown.html", "ord_in_thread": 0, "title": "Government shutdown news: Senators reach deal to end shutdown", "locations": [], "entities": {"persons": [{"name": "mitch mcconnell", "sentiment": "negative"}, {"name": "chuck schumer", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mcconnell", "sentiment": "none"}], "locations": [{"name": "ky.", "sentiment": "none"}, {"name": "n.y.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "al drago | getty images senate", "sentiment": "negative"}, {"name": "senate", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Senators were optimistic they had the votes to end the government shutdown Monday after leaving meetings more confident about a compromise deal to allow Congress to pass a short-term funding bill.\nThe chamber advanced a stopgap bill on Monday afternoon to keep the government open through Feb. 8 by a comfortable 81-18 margin. Final passage was pending.\n\"We will vote today to reopen the government,\" said Senate Minority Leader Chuck Schumer , D-N.Y.\nOnce the measure clears the Senate, it would move to the House, where if it gets approved it would go to President Donald Trump 's desk. The bill also reauthorizes the popular Children's Health Insurance program for six years and delays some Affordable Care Act taxes.\nSchumer said Democrats have received assurances that the Senate will take on immigration issues, such as the Deferred Action for Childhood Arrivals program. Earlier Monday, Senate Majority Leader Mitch McConnell , R-Ky., said he intends to allow debate on immigration before Feb. 8.\nSchumer said he was \"confident\" a bipartisan bill to protect hundreds of thousands of immigrants brought to the U.S. illegally as children could win 60 votes. Protections under DACA end on March 5, the date Trump gave Congress to fix the program when he announced he was ending it.\nWhether McConnell holds to his assurance and whether the Senate can pass an immigration bill remain to be seen. Democrats were holding out to get to vote on shielding those immigrants as part of a spending bill, but appeared not to have that demand met.\nHowever, Schumer said he trusted McConnell's pledge.\n\"I expect the majority leader to fulfill his agreement to the Senate,\" the New York Democrat said, adding that if he does not, he will have \"breached the trust\" of bipartisan senators who worked the chamber out of an impasse.\nImmediately after Schumer spoke, McConnell again cast the shutdown as a Democrat-driven decision over \"illegal immigration.\"\nAl Drago | Getty Images Senate Majority Leader Mitch McConnell (R-KY) (L) and Senate Minority Leader Chuck Schumer (D-NY). \"I think if we've learned anything during this process it's that a strategy to shut down the government over the issue of illegal immigration is something that the American people didn't understand,\" the senator said.\nNumerous Democrats who opposed a funding bill on Friday night voted to advance the legislation on Monday. Those who voted against reopening the government were largely from solidly blue states or are rumored to have 2020 presidential ambitions.\nIf the measure gets passed by Congress and signed, the funding legislation means that federal agencies will no longer be forced to shut their doors and to furlough nonessential workers. U.S. government funding lapsed at the end of Friday.\nSince Friday, some Democrats, including Schumer and Rep. Luis Gutierrez, D-Ill., have expressed a willingness to compromise on Trump's proposed border wall in order to secure protections for the young undocumented immigrants.\nAfter the House passed a temporary funding bill on Thursday night, the Senate failed to approve it by the midnight Saturday deadline.\nTrump had initially planned to celebrate the one-year anniversary of his inauguration by hosting a glitzy campaign fundraiser last weekend at Mar-a-Lago, his private club in Palm Beach, Florida. But the White House announced that the president would remain in Washington until a deal was reached.\nWATCH: Schumer says deal reached to end shutdown show chapters Sen Schumer: Deal reached to end shutdown 3 Hours Ago | 01:47", "external_links": [], "published": "2018-01-22T18:58:00.000+02:00", "crawled": "2018-01-22T18:59:16.024+02:00", "highlightTitle": ""}