{"organizations": [], "uuid": "cd957a5f9757a43ed6f9b3786f5d9a90fd1f258b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220293665&w=1200&r=LYNXMPEE070ZQ", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-asia-women-tech/rural-women-in-india-elderly-in-japan-open-their-homes-to-airbnb-guests-idUSKBN1EX1LB", "country": "US", "domain_rank": 408, "title": "Rural women in India, elderly in Japan open their homes to Airbnb guests", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T23:19:00.000+02:00", "replies_count": 0, "uuid": "cd957a5f9757a43ed6f9b3786f5d9a90fd1f258b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-asia-women-tech/rural-women-in-india-elderly-in-japan-open-their-homes-to-airbnb-guests-idUSKBN1EX1LB", "ord_in_thread": 0, "title": "Rural women in India, elderly in Japan open their homes to Airbnb guests", "locations": [], "entities": {"persons": [{"name": "reema nanavaty", "sentiment": "none"}], "locations": [{"name": "mumbai", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "gujarat", "sentiment": "none"}, {"name": "airbnb", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "google", "sentiment": "none"}, {"name": "self employed women’s association", "sentiment": "none"}, {"name": "sewa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI (Thomson Reuters Foundation) - Mobile apps that help women in the Indian countryside and tiny villages in Japan to open their homes to visitors from across the world are generating incomes, revitalizing remote communities and helping to curb migration to cities.\nA women’s organization in the western Indian state of Gujarat has tied up with Airbnb, the short-term home rental service, to train rural women to be hosts and list their homes on its site.\nA year in, the number of women earning from home sharing has doubled, according to the Self Employed Women’s Association (SEWA), which has about 2 million members, mostly in villages.\n“At first, we weren’t sure how the women would fare and if people would respond to homestays in these areas,” said Reema Nanavaty, a director at SEWA.\n“But once they began getting guests, the women invested in upgrading their homes and started using Google Translate to communicate with guests. It has become a significant source of income for them,” she told the Thomson Reuters Foundation.\nGuests to the colorful homes are treated to homecooked Gujarati food, and can participate in kite flying and garba dancing with sticks in traditional costume, she said.\nThe partnership will extend to 14 more states, aiming to boost incomes of women in rural areas and help boost tourism in otherwise neglected areas, she said.\nCheap smartphones are also aiding those looking for work, with job matching sites helping even illiterate job seekers from rural Cambodia to India find employers without middlemen who may dupe them.\nYoshino Cedar House, a collaboration between Airbnb, a Tokyo-based architect and the community, is helping revitalise the rural community in the rapidly ageing country by opening up a home hosted by locals. Handout pic courtesy of Airbnb Airbnb also has partnerships in South Korea, Japan and Taiwan for rural tourism.\nIn Japan, the Yoshino Cedar House, a collaboration with Tokyo-based architect Go Hasegawa and the local community, came about as a response to shrinking rural populations in the rapidly ageing country.\nIt was inspired by a host whose listing helped rejuvenate her village, said Airbnb co-founder Joe Gebbia.\nSlideshow (3 Images) Hundreds of villages and towns “will disappear in the next decade if we do not find ways to create regenerative and adaptive systems”, he said via e-mail.\nThe Cedar House is run by a cooperative of about two dozen community members who take turns at being the host.\nMost of the proceeds remain in the community, with a percentage of profits reinvested in local projects, Gebbia said.\n“If we can get community-driven empowerment right in Japan, we can find ways of adapting this to other countries,” he said.\nIn India, the 50 rural homes listed on Airbnb are drawing guests from the United States and Europe, Nanavaty said.\n“Some of the villages were not even on Google Maps. For the women, it is a new way to make money, be independent,” she said.\nReporting by Rina Chandran @rinachandran. Editing by Ros Russell. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org to see more stories.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T23:19:00.000+02:00", "crawled": "2018-01-09T17:02:35.000+02:00", "highlightTitle": ""}