{"organizations": [], "uuid": "d3764b0482bd2118d382afc0481ef6ac9572bba0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/tim-cook-apple-companies-tax-loss.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/31/apple-iphone-stock-earnings/", "country": "US", "domain_rank": 1196, "title": "Apple Earnings Could Disappoint Wall Street on iPhones Sales | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.97, "site_type": "news", "published": "2018-01-31T12:40:00.000+02:00", "replies_count": 0, "uuid": "d3764b0482bd2118d382afc0481ef6ac9572bba0"}, "author": "Aaron Pressman", "url": "http://fortune.com/2018/01/31/apple-iphone-stock-earnings/", "ord_in_thread": 0, "title": "Apple Earnings Could Disappoint Wall Street on iPhones Sales | Fortune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Aaron Pressman 10:40 AM EST \nLast year, Apple CEO Tim Cook gambled that customers were ready to pay more for their iPhones. Instead of just replacing 2016’s two iPhone models with newer devices at the same price, as Apple had done for years, Cook introduced replacements with higher prices and debuted an all-new third model, the iPhone X, starting at almost $1,000. \nOn Thursday, the world will find out how well Cook’s bet turned out. The results could either fuel Apple’s stock market value past $1 trillion or push the price down further from a 7% tumble in recent weeks. At Tuesday’s close, Google’s parent Alphabet (googl) had a market value of $814 billion, only $35 billion behind the iPhone maker, which currently holds the title of most valuable public company. \nApple reports results for the fourth quarter (its fiscal first quarter of 2018) on Thursday afternoon, with Wall Street analysts expecting that sales of 80 million iPhones helped generate revenue of $87 billion and net income per share of $3.83. That would represent a modest 2% increase in the number of phones sold from the same period last year but an 11% jump in overall revenue, as the higher prices offset the slowing growth of the smartphone market (also aided by booming sales of media, apps and services). \nGet Data Sheet , Fortune’s technology newsletter. \nBut many analysts have been warning lately that Apple might not reach those levels for the fourth quarter, or the expectations for what the company discloses on Thursday in its forecast for sales in the first quarter of 2018 (its second fiscal quarter). They fear that the iPhone 8 and iPhone X didn’t set off the wave of buying that had been expected last year. \n”Investors are increasingly aware that this iPhone cycle will very likely be disappointing relative to initial expectations,” Bernstein Research Toni Sacconaghi wrote earlier this week, helping fuel the sell-off. \n“There has been much in the press about order cuts for iPhone X, and we believe a weaker mix in Q1 will push estimates lower for March and beyond,” BMO Capital Markets analyst Tim Long wrote on Wednesday. “We expect a meaningful guide lower when the company reports on Thursday night, on the order of $5-6 billion compared to consensus revenue estimates.” \nEarlier last year, investors were excited by the prospect of Apple’s three model attack, with many analysts predicting a “super cycle” of upgrading buyers who had held off purchasing a new iPhone for the past few years. Apple’s stock price shot up 16% from the end of September through mid-January to a closing high of $179.26, an all-time record (Earlier that day, the stock also hits its all-time intraday record of $180.10). \nBut in recent weeks, reports out of Apple’s Asian suppliers seemed to be flashing a warning sign that iPhone sales were not meeting the high expectations. Continuing bad press around the revelation that Apple (aapl) purposely slowed the performance of older iPhones due to aging batteries didn’t help and this week came news the company was being investigated for possibly misleading investors on thew matter. \nBy Tuesday’s close, the stock had sunk to $166.97, a 7% drop from the high. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-31T12:40:00.000+02:00", "crawled": "2018-01-31T19:20:25.003+02:00", "highlightTitle": ""}