{"organizations": [], "uuid": "c4bb6684c20e9a30af3bb562958e1bb0684c46d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224304691&w=1200&r=LYNXMPEE0L28Y", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-cricket-england-stokes/englands-stokes-to-delay-new-zealand-arrival-to-attend-court-hearing-idUKKBN1FB37B", "country": "US", "domain_rank": 408, "title": "England's Stokes to delay New Zealand arrival to attend court hearing", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T02:00:00.000+02:00", "replies_count": 0, "uuid": "c4bb6684c20e9a30af3bb562958e1bb0684c46d9"}, "author": "", "url": "https://uk.reuters.com/article/uk-cricket-england-stokes/englands-stokes-to-delay-new-zealand-arrival-to-attend-court-hearing-idUKKBN1FB37B", "ord_in_thread": 0, "title": "England's Stokes to delay New Zealand arrival to attend court hearing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 12:03 AM / Updated 7 hours ago England's Stokes to delay New Zealand arrival to attend court hearing Reuters Staff 2 Min Read \nWELLINGTON (Reuters) - Suspended England all-rounder Ben Stokes is to delay his arrival for the country’s tour of New Zealand in order to attend his first court hearing into a charge of affray. \nThe 26-year-old Stokes was charged last week after a lengthy investigation into an incident outside a Bristol nightclub last September. \nWhile he was included in England’s squad for the Ashes tour of Australia and subsequent visit to New Zealand starting next month, he has not been available for selection due to the legal process. \nAn initial hearing was set for Feb. 13 at Bristol Magistrate’s Court, six days after England would have started a triangular Twenty20 series with Australia and New Zealand and the same day they are scheduled to play a match in Wellington. FILE PHOTO - Cricket - England Nets - Emirates Old Trafford, Manchester, Britain - September 18, 2017 England's Ben Stokes during nets Action Images via Reuters/Jason Cairnduff \n“As has been confirmed in the media a first hearing date at court has been set for 13th February,” Stokes said on his Twitter page on Monday. \n“In the circumstances, I have decided that it would not be right to join my teammates until after attending court on the 13th.” \nThe 26-year-old Stokes, who was born in New Zealand, has not featured for England since the incident but played six matches on a short-term contract with New Zealand side Canterbury last month before returning to England. \nEngland also play five one-day internationals and two tests on their tour of New Zealand. Reporting by Greg Stutchbury; Editing by Ken Ferris", "external_links": [], "published": "2018-01-23T02:00:00.000+02:00", "crawled": "2018-01-23T02:20:15.000+02:00", "highlightTitle": ""}