{"organizations": [], "uuid": "2d38c34af6e4055d6476c7925df91231585c2d82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-opengate-capital-completes-acquisition-of-mersive-technologies-inc.html", "country": "US", "domain_rank": 767, "title": "OpenGate Capital Completes Acquisition of Mersive Technologies Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-16T16:00:00.000+02:00", "replies_count": 0, "uuid": "2d38c34af6e4055d6476c7925df91231585c2d82"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-opengate-capital-completes-acquisition-of-mersive-technologies-inc.html", "ord_in_thread": 0, "title": "OpenGate Capital Completes Acquisition of Mersive Technologies Inc.", "locations": [], "entities": {"persons": [{"name": "damovo", "sentiment": "none"}, {"name": "andrew nikou", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "denver", "sentiment": "none"}], "organizations": [{"name": "opengate capital completes acquisition of mersive technologies inc", "sentiment": "negative"}, {"name": "mersive solstice", "sentiment": "none"}, {"name": "getronics", "sentiment": "none"}, {"name": "philips", "sentiment": "none"}, {"name": "opengate capital", "sentiment": "none"}, {"name": "kpn", "sentiment": "none"}, {"name": "mersive", "sentiment": "none"}, {"name": "mersive technologies inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Wireless Content Streaming Software Business Addresses Growing Demand in Enterprise Collaboration Market\nLOS ANGELES--(BUSINESS WIRE)-- OpenGate Capital , a global private equity firm, announced today that it has acquired Mersive Technologies Inc. (“Mersive”), a leading provider of wireless collaboration software, from shareholders of the business. Terms of the transaction were not disclosed.\nHeadquartered in Denver, Colorado, Mersive launched its suite of wireless collaboration solutions in 2013, transforming ordinary meeting and learning spaces by enabling multiple users to share content collaboratively from laptops and mobile devices to in-room displays – securely and with the best-in-class user interface. Mersive Solstice improves collaboration and productivity by putting content at the center of the meeting experience.\nAndrew Nikou, founder and CEO of OpenGate Capital, stated, “OpenGate Capital has successfully invested in technology businesses acquired from KPN, Philips and Damovo going back to 2006. Since realizing our last technology investment in Getronics in late 2016, we have made specific investments in our business development team and sourcing processes to find another tech-related opportunity. Mersive is an exciting investment considering the global and transformative nature of its software solutions in an otherwise hardware-dominated market and its continued triple-digit, year-over-year growth rate with new and existing customers.”\nCommenting on the acquisition, Rob Balgley, CEO of Mersive, stated, “Mersive is a driving force in changing the way industry leading organizations work and learn. The acquisition of Mersive by OpenGate Capital will provide access to the growth capital and operational expertise we need to scale the company and achieve its full potential.”\nThe acquisition follows four years of exponential growth for Mersive driven by customer demand for software-based solutions that are easy to deploy and affordable for both traditional meeting rooms and huddle spaces. Mersive represents the seventh acquisition through OpenGate Capital’s first institutional fund following the firm’s previous acquisitions of Power Partners, Energi Fenestration Solutions, Bois & Matériaux, Alfatherm, EverZinc and Hufcor.\nAbout OpenGate Capital\nOpenGate Capital is a global private equity firm specializing in the acquisition and operation of businesses to create new value through operational improvements, innovation and growth. Established in 2005, OpenGate Capital is headquartered in Los Angeles, California with a European office in Paris, France. OpenGate’s professionals possess the critical skills needed to acquire, transition, operate, build and scale successful businesses. To date, OpenGate Capital, through its legacy and fund investments, has executed more than 30 acquisitions including corporate carve-outs, management buy-outs, special situations and transactions with private sellers across North America and Europe. To learn more about OpenGate, please visit www.opengatecapital.com .\nAbout Mersive\nMersive delivers innovative software-based products that leverage commodity hardware and existing enterprise network infrastructure. With approximately 4000 corporate and higher education customers and 30 of the Fortune 100 companies, Mersive is changing how industry leaders worldwide work and learn. Mersive is the outgrowth of academic research conducted by Mersive CTO and Founder Christopher Jaynes, PhD with funding sources that include U.S. intelligence agencies and the national security community. Mersive is led by Rob Balgley, former CEO of Jabber , who joined Mersive in 2010. The company is based in Denver, Colorado. please visit https://www2.mersive.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116005141/en/\nOpenGate Media Contacts\nAlanna Chaffin\n+1 (310) 432-7000\nachaffin@opengatecapital.com\nor\nSitrick & Company\nMike Sitrick\n(310) 788-2850\nMike_Sitrick@sitrick.com\nor\nOpenGate Business Development Contact\nJoshua Adams\n+1 (310) 432-7000\njadams@opengatecapital.com\nor\nMersive Media Contact\nTroy Suttle\n720-709-7692\ntsuttle@mersive.com\nSource: OpenGate Capital", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.opengatecapital.com&esheet=51742245&newsitemid=20180116005141&lan=en-US&anchor=OpenGate+Capital&index=1&md5=9b589819e6558941fc986ada4e8dda8d", "http://www.businesswire.com/news/home/20180116005141/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cisco.com%2Fc%2Fen%2Fus%2Fproducts%2Funified-communications%2Fjabber%2Findex.html&esheet=51742245&newsitemid=20180116005141&lan=en-US&anchor=Jabber&index=3&md5=a271ecafc9c415b3c86fda2ae8caa720", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.opengatecapital.com&esheet=51742245&newsitemid=20180116005141&lan=en-US&anchor=www.opengatecapital.com&index=2&md5=a7bc3075f0ff4b8f5f15779b2127fd0a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww2.mersive.com&esheet=51742245&newsitemid=20180116005141&lan=en-US&anchor=https%3A%2F%2Fwww2.mersive.com&index=4&md5=bf392501764c7ed98cd0981333858586"], "published": "2018-01-16T16:00:00.000+02:00", "crawled": "2018-01-16T16:27:23.029+02:00", "highlightTitle": ""}