{"organizations": [], "uuid": "b17fb441f693df942a967e9ad62d7732452a3bba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/02/gopro-karma-drone-back-on-the-market.jpg", "site_section": "http://bizdailies.com/News/Rss", "section_title": "Biz Dailies: Business and Financial News Feed", "url": "http://fortune.com/2018/01/05/gopro-layoff-karma-drone/", "country": "US", "domain_rank": 1196, "title": "GoPro Lays off Hundreds of Workers In Its Karma Drone Unit - Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T03:10:00.000+02:00", "replies_count": 0, "uuid": "b17fb441f693df942a967e9ad62d7732452a3bba"}, "author": "", "url": "http://fortune.com/2018/01/05/gopro-layoff-karma-drone/", "ord_in_thread": 0, "title": "GoPro Lays off Hundreds of Workers In Its Karma Drone Unit - Fortune", "locations": [], "entities": {"persons": [{"name": "jonathan vanian", "sentiment": "negative"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Jonathan Vanian 8:10 PM EST \nGoPro’s new year has begun with a round of layoffs, primarily affecting the company’s Karma drone business unit. \nAround 200 to 300 workers were laid off this week, according to a report Thursday by tech news site TechCrunch that cites unnamed sources. The report highlights an internal letter to laid off workers that said the cuts were intended to “to better align our resources with business requirements.” \nThe layoffs highlight GoPro’s ongoing struggle to turn itself around after a turbulent past few years in which its stock has plummeted 91% from a high of $93.70 in Aug 2014 to $7.52 on Friday. \nThe company has attempted to expand beyond its core video camera business by creating a media and entertainment unit and making drones. But those efforts have failed to catch on , and the company has implemented multiple rounds of layoffs and shuttered its media business. \nInvestors were particularly hopeful that GoPro’s Karma drone would help lift sales, but the push encountered trouble from the get-go. Shortly after debuting the drone in the fall of 2016, it recalled thousands of them because of a glitch that caused them to abruptly turn off and fall from the sky. \nGet Data Sheet , Fortune’s technology newsletter. \nEven after fixing the technical error, GoPro’s (gpro) drone never appeared to be a big seller. Although CEO Nick Woodman would say he was optimistic about the drone business, he avoided saying when he thought drone sales would eventually lift the company’s overall sales. \nGoPro never released sales numbers for its drone, but the numbers are likely to be small compared to Chinese rival DJI, which analysts currently say dominates the drone market. \nFortune contacted GoPro for more information and will update this story if it responds. SPONSORED FINANCIAL CONTENT", "external_links": [], "published": "2018-01-06T03:10:00.000+02:00", "crawled": "2018-01-06T04:55:02.019+02:00", "highlightTitle": ""}