{"organizations": [], "uuid": "c39d3b4a577baf47048f9d8bd04d918206c7e32d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104959446-FordGT.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/the-10-most-expensive-cars-that-just-sold-at-auction.html", "country": "US", "domain_rank": 767, "title": "The 10 most expensive cars that just sold at auction", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.183, "site_type": "news", "published": "2018-01-22T20:37:00.000+02:00", "replies_count": 0, "uuid": "c39d3b4a577baf47048f9d8bd04d918206c7e32d"}, "author": "Robert Frank", "url": "https://www.cnbc.com/2018/01/22/the-10-most-expensive-cars-that-just-sold-at-auction.html", "ord_in_thread": 0, "title": "The 10 most expensive cars that just sold at auction", "locations": [], "entities": {"persons": [{"name": "hagerty", "sentiment": "none"}], "locations": [{"name": "scottsda", "sentiment": "none"}, {"name": "scottsdale", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}], "organizations": [{"name": "arizona collector car auctions", "sentiment": "none"}, {"name": "jaguars", "sentiment": "none"}, {"name": "jaguar", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The 10 most expensive cars that just sold at auction More than 2,600 cars were auctioned in Scottsdale, Arizona, for a combined $248 million. Eighty-four percent of the cars put up for auction were sold, about even with last year's rate. The sales total fell 5 percent from 2017. Source: Barrett-Jackson A 2017 Ford GT Coupe sold for $2.5 million for charity. \nThe largest classic car auction of the year just wrapped up in Scottsdale, Arizona, with more than 2,600 cars selling for a combined $248 million. \nWhile there was strong bidding for muscle cars and vintage trucks, bids for the top-priced Jaguars and Ferraris were more subdued. Of the 3,176 classic cars offered up for sale by the various auction companies at the 2018 Arizona Collector Car Auctions, 2,668 sold, for a sales rate of 84 percent — about even with last year. But the sales total of $247.8 million was down 5 percent from 2017, according to Hagerty, the classic car insurance and research company. Yet almost all of the weakness was at the very top of the market. Two Jaguar D-Types that were the most expensive cars offered for sale at Scottsdale failed to sell at auction, missing their minimum bids. The 1954 Jaguar D-Type offered by RM Sotheby's, which had been raced by famed racing driver Stirling Moss, topped out at a top bid of $9.8 million, well below the estimate of $12 million to $15 million. A 1956 D-Type being sold by Gooding & Co., which was once owned by the manager of Led Zeppelin, reached a high bid of $8.85 million, just below its estimate of $10 million to $12 million. \nAnalysts say that while the surging stock market and tax cuts are helping the wealthy and boosting their spending confidence, prices for the top cars were so high in 2014 and 2015 that they were bound to return to earth. Source: Gooding & Co. A 1965 Ferrari 275 GTB Speciale Coupe, auctioned by Gooding & Company, sold for more than $8 million. \nWhat's more, a provision in the new tax law that prevents \"value-in-kind exchanges\" for cars has crimped sales at the top. Previously, collectors were allowed to sell one car and buy another of equal or greater value without paying a capital gains tax. Half as many cars sold for $3 million or more this year compared with last year, according to Hagerty. \"At the higher rungs on the pricing ladder, results weren't as strong,\" Hagerty said. \"Further struggles were specifically seen in the $2 million to $5 million range, all of which could indicate a softening in the market.\" \nYet while the buyers of $15 million Jaguars and $20 million Ferraris have pulled back, the market for old trucks, muscle cars and American classics remains strong. Demand for classic Corvettes, Mustangs and Camaros was strong. Hagerty said 1968-1982 C3 Chevrolet Corvettes, the first generation 1967-69 Chevrolet Camaros and Fox-body 1979-1993 Mustangs were among the best performers. Vintage trucks and SUVs are also doing surprisingly well. Auctioneer Barrett-Jackson sold a 1948 Dodge Power Wagon for $74,800, while early Ford Broncos are selling for $50,000. \nCars that were sold for charity also fared well. Former President George W. Bush, Jay Leno and Chad McQueen (son of Steve McQueen) helped auction off a 2017 Ford GT for $2.55 million, a 2018 Corvette Carbon Fiber 65 Edition for $1.4 million and the first production 2019 Corvette ZR1 for $925,000. The proceeds from the sales went to various charities. \nHere are the top 10 most expensive cars sold in Arizona, along with the auction companies. 1965 Ferrari 275 GTB Speciale Coupe sold for $8,085,000 (Gooding & Co.) 1958 Porsche 550A Spyder sold for $5,170,000 (Bonhams) 1954 Ferrari 500 Mondial Spider sold for $4,455,000 (Gooding & Co.) 1931 Bugatti Type 55 Roadster sold for $4,070,000 (Gooding & Co.) 1966 Shelby Cobra 427 S/C Roadster sold for $2,947,500 (RM Sotheby's) 1972 Ferrari 365 GTS/4 Daytona Spider sold for $2,640,000 (Bonhams) 1967 Ferrari 330 GTS Spider sold for $2,530,000 (Gooding & Co.) 2017 Ford GT Coupe sold for $2,500,000 (Barrett-Jackson for charity) 2014 Pagani Huayra Coupe sold for $2,090,000 (Gooding & Co.) 1948 Tucker 48 Sedan sold for $1,792,500 (RM Sotheby's) Watch: Lamborghini Performante nabs top honors as Robb Report's Car of the Year Robert Frank CNBC Reporter and Editor CNBC NEWSLETTERS \nGet the best of CNBC in your inbox Please choose a subscription A daily email for dreamers, seekers and game changers. Breaking News", "external_links": [], "published": "2018-01-22T20:37:00.000+02:00", "crawled": "2018-01-22T20:43:11.018+02:00", "highlightTitle": ""}