{"organizations": [], "uuid": "87ea05f6530bbe465819883d18ed6acb077c9fc2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104965082-AP_18023807252025.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/19836768/device/rss/rss.html", "section_title": "Energy", "url": "https://www.cnbc.com/2018/01/24/puerto-ricans-face-foreclosure-wave-as-moratoriums-expire.html", "country": "US", "domain_rank": 767, "title": "Puerto Ricans face foreclosure wave as moratoriums expire", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-24T21:33:00.000+02:00", "replies_count": 0, "uuid": "87ea05f6530bbe465819883d18ed6acb077c9fc2"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/24/puerto-ricans-face-foreclosure-wave-as-moratoriums-expire.html", "ord_in_thread": 0, "title": "Puerto Ricans face foreclosure wave as moratoriums expire", "locations": [], "entities": {"persons": [{"name": "aylsa torres", "sentiment": "negative"}, {"name": "torres", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Aylsa Torres sighed in relief when she received a letter from her bank two weeks after Hurricane Maria hit. She was among the hundreds of thousands of Puerto Ricans awarded a three-month moratorium on their mortgage payments as the U.S. territory reeled from the storm's destruction.\nBelieving she was temporarily freed from those financial obligations, the 46-year-old government worker drained her savings to pay for a $750 generator and $786 worth of repairs for storm damage. But when Torres visited her bank in December, she says, she was shocked to hear that she was behind on payments and that officials threatened to foreclose on her apartment and ruin her credit rating.\nConfusion and panic is spreading across this U.S. territory as the majority of moratorium agreements expire this month, with many people discovering they never qualified for the moratorium in the first place or struggling to obtain extensions because they cannot pay what is owed to the banks.\n\"It's incredibly frustrating,\" Torres said. \"You feel like everyone is closing a door in your face. No one has a genuine interest in helping you.\"\nLegal experts say it is a scene that will repeat itself in the coming weeks and months on an island that already was seeing a sharp rise in foreclosures before the hurricane as a result of an 11-year-old recession that has forced government austerity measures.\nEven worse, experts say, many Puerto Ricans stopped making payments on their mortgages after the Sept. 20 storm because they thought the moratorium was automatic, when it was not. The storm knocked out power across the island, the largest blackout in U.S. history, preventing many from learning that they had to contact their bank to request a moratorium, said Ariadna Godreau, a professor and human rights lawyer.\n\"The big concern now is that mortgage foreclosures are going to spike,\" she said. \"We're going to see more homeless people, more homes foreclosed.\"\nOver almost a decade, the number of repossessed homes in Puerto Rico grew from more than 2,300 in 2008 to above 5,400 in 2016 and an estimated 6,200 or more last year.\nAfter the storm, foreclosures were temporarily suspended, and banks in the U.S. territory offered a moratorium on mortgages for those who qualified, as did the federal government. Moratoriums offered by the U.S. government have been extended to March, but banks have ended theirs.\nBanco Popular , which is Puerto Rico's largest bank, said more than 20,500 clients received moratoriums that expired in December and January. Bank executives say they are working with their clients, but stress that they still need to collect what is owed.\n\"Those clients that truly are not responding to the bank's letters are those who really will be at risk of facing a foreclosure,\" said Jose Teruel, first vice president of the consumer credit services division at Banco Popular.\nOther large Puerto Rico banks declined to provide specific numbers. Oriental said only that 69 percent of its home loans were under moratorium by the end of November, while First Bank said about half of its clients were given moratoriums. Santander said 123,000 of its accounts, including both mortgages and personal and commercial loans, received moratoriums expiring in December and January.\n\"The three-month moratorium might have seemed generous at first, but in reality, it's not,\" said Maria Jimenez, director of the legal services clinic at the University of Puerto Rico. \"There are still people without power, so the ability to generate revenue is not there.\"\nMore than 30,000 jobs were lost after Hurricane Maria, and some 30 percent of small and medium-size businesses remain closed more than four months after the storm, according to the island's Treasury Department. Meanwhile, more than 30 percent of power customers remain in the dark and many struggle to pay rising utility bills.\nJimenez especially worries about people who cannot afford an attorney but make enough money to be disqualified from free legal services.\n\"A lot of times these people just freeze,\" she said. \"There are many who don't even open the (bank) letters because they have no way to solve the situation.\"\nTorres has hired a lawyer to handle her case, not an easy decision since most of her salary goes toward costly medication to treat her multiple sclerosis. She owes the bank more than $1,500 and is at a loss over how to pay.\nPuerto Rico's Office of the Commissioner of Financial Institutions said it is collecting more information to better understand the situation. It recently extended a deadline for all banks on the island to submit data, including exactly how many moratoriums were awarded.\nIt is unclear how banks will handle the mortgages, said Rafael Rodriguez, who oversees a legal aid project involving foreclosures for the nonprofit Legal Services of Puerto Rico. \"The expectation we have is that once the moratoriums expire, the massive wave of foreclosures on the island will continue,\" he said.\nAnother woman caught in the mortgage crunch said she doesn't have the money to make all three payments she owes her bank this month. The woman, who asked to be identified only by her first name, Lillian, because she is embarrassed by her situation, said she used all her savings after the hurricane to get up to date on her mortgage payments so she could qualify for the moratorium. But those payments have left her dependent entirely on her parents for now.\nShe fears she will have to give up her apartment. \"I am incredibly worried,\" she said.", "external_links": [], "published": "2018-01-24T21:33:00.000+02:00", "crawled": "2018-01-24T23:50:37.018+02:00", "highlightTitle": ""}