{"organizations": [], "uuid": "aa395731085eab08201a7bbb92919f239825769a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/indonesia-freeport-talks/update-1-indonesia-hopes-to-finalise-freeport-contract-talks-by-june-idUSL4N1P62LR", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Indonesia hopes to finalise Freeport contract talks by June", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T10:37:00.000+02:00", "replies_count": 0, "uuid": "aa395731085eab08201a7bbb92919f239825769a"}, "author": "", "url": "https://www.reuters.com/article/indonesia-freeport-talks/update-1-indonesia-hopes-to-finalise-freeport-contract-talks-by-june-idUSL4N1P62LR", "ord_in_thread": 0, "title": "UPDATE 1-Indonesia hopes to finalise Freeport contract talks by June", "locations": [], "entities": {"persons": [{"name": "bambang gatot", "sentiment": "none"}, {"name": "gatot", "sentiment": "none"}, {"name": "wilda asmarini", "sentiment": "none"}], "locations": [{"name": "jakarta", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "organizations": [{"name": "freeport", "sentiment": "negative"}, {"name": "energy and mineral resources ministry", "sentiment": "none"}, {"name": "state owned enterprises ministry", "sentiment": "none"}, {"name": "finance ministry", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "freeport mcmoran inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 8:40 AM / in 5 minutes UPDATE 3-Indonesia hopes to finalise Freeport contract talks by June Reuters Staff \n(Adds no comment from Freeport) \nBy Wilda Asmarini \nJAKARTA, Jan 11 (Reuters) - Indonesia hopes to finalise contract talks with Freeport McMoRan Inc over the Grasberg copper mine by June, although divestment issues are still unresolved, a mining ministry official said on Thursday. \nIndonesia and Freeport formed a framework agreement in August to transfer the company’s rights to Grasberg to a new mine license system from an existing contract of work. Under the change, Freeport promised to divest 51 percent of its Indonesian unit to the government. \nHowever, details of the divestment still need to be ironed out by Freeport, the State Owned Enterprises Ministry and the Finance Ministry, Bambang Gatot, the Coal and Minerals Director General at the Energy and Mineral Resources Ministry, told reporters at a briefing. \n“The main issue that hasn’t been resolved yet is divestment,” Gatot said. \nOther issues under consideration include the development of another domestic copper smelter, an investment stability agreement and the extension of Freeport’s operations up to 2041, he said. \nState-owned mining holding company PT Inalum has been appointed by the government to acquire the Freeport stake. \nA Jakarta-based spokesman for Freeport declined to comment. \nGrasberg is the world’s second-biggest copper mine and is located in the eastern Indonesian province of Papua. \nThe divestment may involve liquidation of a joint venture that Freeport Indonesia (PT-FI), operator of Grasberg, formed with Rio Tinto in 1996. \nUnder that venture, Rio has a 40 percent interest in PT-FI’s Grasberg contract, which entitles them to a 40 percent share of all production after 2022. Rio has held talks with Indonesia about a possible exit to the venture. \nGatot also mentioned that Freeport exported 921,000 tonnes of copper concentrate in 2017, and has a quota to ship up to 1.1 million tonnes through to Feb. 16, noting that the company has not applied for any new quota yet. \n“They haven’t applied for a recommendation (for an extension of exports) yet,” Gatot said, referring to Freeport and fellow copper miner Amman Mineral Nusa Tenggara, a unit of Medco Energi Internasional. \nAmman shipped 560,000 tonnes of copper concentrate in 2017, Gatot said. Reporting by Wilda Asmarini; Writing by Fergus Jensen; Editing by Christian Schmollinger", "external_links": [], "published": "2018-01-11T10:37:00.000+02:00", "crawled": "2018-01-11T10:50:48.006+02:00", "highlightTitle": ""}