{"organizations": [], "uuid": "b2ad38b566f0f33e54fa036f48e857e6978c51f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-alterra-power-corp-announces-election-deadline-for-innergex-arrangement.html", "country": "US", "domain_rank": 767, "title": "Alterra Power Corp. Announces Election Deadline for Innergex Arrangement", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T17:00:00.000+02:00", "replies_count": 0, "uuid": "b2ad38b566f0f33e54fa036f48e857e6978c51f8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-alterra-power-corp-announces-election-deadline-for-innergex-arrangement.html", "ord_in_thread": 0, "title": "Alterra Power Corp. Announces Election Deadline for Innergex Arrangement", "locations": [], "entities": {"persons": [], "locations": [{"name": "vancouver", "sentiment": "none"}], "organizations": [{"name": "alterra power corp", "sentiment": "negative"}, {"name": "alterra power corp.", "sentiment": "negative"}, {"name": "innergex renewable energy inc.", "sentiment": "none"}, {"name": "alterra", "sentiment": "none"}, {"name": "computershare trust company of canada", "sentiment": "none"}, {"name": "innergex", "sentiment": "none"}, {"name": "alterra share", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TSX: AXY\nVANCOUVER, Jan. 17, 2018 /PRNewswire/ - Alterra Power Corp. (\"Alterra\") announces that registered holders of Alterra common shares (\"Alterra Shares\") must indicate their election no later than 2:00 p.m. (Vancouver time) on January 25, 2018 to receive either:\n(i)\n$8.25 in cash for each Alterra Share held by such registered holder (the \"Cash Alternative\"); or\n(ii)\n0.5563 common shares of Innergex Renewable Energy Inc. (\"Innergex\") for each Alterra Share held by such registered holder (the \"Share Alternative\"),\nin connection with the previously announced plan of arrangement whereby Innergex will acquire all of the issued and outstanding Alterra Shares (the \"Arrangement\").\nElection Deadline\nRegistered holders of Alterra Shares may make an effective election by depositing with Computershare Trust Company of Canada, before 2:00 p.m. (Vancouver time) on January 25, 2018 (the \"Election Deadline\"), a properly completed and duly executed letter of transmittal and election form (the \"Letter of Transmittal and Election Form\") indicating their election to receive the Cash Alternative or the Share Alternative, together with the certificates (if applicable) representing their Alterra Shares and all other documentation required by Computershare Trust Company of Canada. The Letter of Transmittal and Election Form is available on Alterra's website at www.alterrapower.ca and on SEDAR at www.sedar.com or by contacting Computershare Trust Company of Canada. Any questions regarding the election of the Cash Alternative or the Share Alternative, including any request for another copy of the Letter of Transmittal and Election Form, should be directed to Computershare Trust Company of Canada at 1-800-564-6253 toll free in North America or by email at corporateactions@computershare.com .\nNon-registered holders of Alterra Shares that hold their Alterra Shares through a broker, investment dealer or other intermediary should carefully follow the instructions and deadlines from the intermediary that holds such Alterra Shares on their behalf and should contact such intermediary for instructions and assistance in making an election or with any questions about their election. Non-registered holders of Alterra Shares who may have made an election through an intermediary prior to the date of this news release may wish to contact their intermediary prior to the Election Deadline to verify that their election has been made properly.\nAny holder of Alterra Shares who fails to properly make an election prior to the Election Deadline (or any extension thereof), or for whom Computershare Trust Company of Canada determines that their election was not properly made with respect to any Alterra Shares, will be deemed to have elected to receive, for each Alterra Share held by such person, the Cash Alternative, subject to proration and rounding. The Cash Alternative and the Share Alternative are each subject to proration provisions, such that the aggregate consideration paid to all Alterra shareholders will consist of approximately 25% in cash and 75% in Innergex common shares. Accordingly, an Alterra shareholder may receive both cash and Innergex common shares in exchange for Alterra Shares regardless of the Alterra shareholder's election to receive the Cash Alternative or Share Alternative. All elections and deposits made under the Letter of Transmittal and Election Form are irrevocable.\nThe election available in respect of the Cash Alternative or the Share Alternative is an investment decision which carries tax consequences. Moreover, Innergex has agreed to make joint elections with eligible Alterra shareholders in respect of the disposition of their Alterra Shares pursuant to Section 85 of the Income Tax Act (Canada) (and any similar provision of any applicable provincial tax legislation) in accordance with the procedures and within the time limits set out in the Arrangement. Holders of Alterra Shares should consult their investment and tax advisors prior to making their election.\nFurther information regarding the Arrangement is contained in Alterra's management information circular dated November 14, 2017 (the \"Circular\"). For further information with respect to the election described above, see the following sections of the Circular: \"Arrangement Mechanics - Letters of Transmittal and Election Form\" and \"Arrangement Mechanics - Procedure for Exchange of Alterra Shares\".\nClosing of Arrangement\nSubject to all closing conditions with respect to the Arrangement being satisfied or waived, it is expected that the Arrangement will be completed in the first quarter of 2018.\nAbout Alterra Power Corp.\nAlterra Power Corp. is a global renewable energy company that manages operations of nine power plants totalling 836 MW of hydro, wind, geothermal and solar generation capacity in Canada, the USA and Iceland. Alterra owns a 375 MW share of this capacity, generating over 1,500 GWh of clean power annually.\nAlterra is also constructing the 200 MW Flat Top wind project in central Texas, which is expected to be in operation in the first half of 2018 (51% owned by Alterra). Upon the completion of Flat Top, Alterra will operate ten power plants totalling 1,036 MW of capacity and will own a 476 MW share of this capacity, generating almost 2,000 GWh of clean power annually. Alterra also has an extensive portfolio of development projects and a skilled team of developers, builders and operators to support its growth plans.\nAlterra trades on the Toronto Stock Exchange under the symbol AXY .\nABOUT INNERGEX RENEWABLE ENERGY INC.\nInnergex develops, owns and operates run-of-river hydroelectric facilities, wind farms and solar photovoltaic farms and carries out its operations in Quebec, Ontario and British Columbia, Canada, France and Idaho, U.S. Its portfolio of assets currently consists of interests in 54 operating facilities with an aggregate net installed capacity of 1,124 MW (gross 1,845 MW), including 31 hydroelectric facilities, 22 wind farms and one solar farm and prospective projects with an aggregate net capacity totalling 3,560 MW (gross 3,940 MW). Innergex is rated BBB- by S&P.\nInnergex's strategy for building shareholder value is to develop or acquire high-quality facilities that generate sustainable cash flows and provide an attractive risk-adjusted return on invested capital and to distribute a stable dividend.\nInnergex trades on the Toronto Stock Exchange under the symbol INE .\nCautionary Note regarding Forward-Looking Statements and Information\nThis press release contains statements that are \"forward-looking information\" within the meaning of Canadian securities legislation including, but not limited to, expected timing for completion of the Arrangement; expected timing for completion of Flat Top; and estimates of annual generation.\nForward-looking statements are based on certain key expectations and assumptions made by Alterra, including expectations and assumptions concerning: economic and financial conditions; project performance; the timing of receipt of the requisite regulatory and other third-party approvals for the Arrangement; and success and timely completion of construction efforts at the Flat Top project. Although Alterra believes that the expectations and assumptions o", "external_links": ["http://www.alterrapower.ca/", "http://www.sedar.com/"], "published": "2018-01-17T17:00:00.000+02:00", "crawled": "2018-01-17T19:16:29.009+02:00", "highlightTitle": ""}