{"organizations": [], "uuid": "cb30681b7d45933be70d376cea5caa66f3ad8d71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/business-wire-rti-surgical-outlines-2018-guidance-and-long-term-goals.html", "country": "US", "domain_rank": 767, "title": "RTI Surgical Outlines 2018 Guidance and Long-Term Goals", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-05T15:00:00.000+02:00", "replies_count": 0, "uuid": "cb30681b7d45933be70d376cea5caa66f3ad8d71"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/business-wire-rti-surgical-outlines-2018-guidance-and-long-term-goals.html", "ord_in_thread": 0, "title": "RTI Surgical Outlines 2018 Guidance and Long-Term Goals", "locations": [], "entities": {"persons": [], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "alachua", "sentiment": "none"}], "organizations": [{"name": "rti", "sentiment": "negative"}, {"name": "rti surgical, inc.", "sentiment": "none"}, {"name": "fda", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}, {"name": "the company", "sentiment": "none"}, {"name": "zyga technology", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Strategic Transformation Accelerating to Produce Long-Term Growth, Significant Margin Expansion, and Consistent Cash Flow\nALACHUA, Fla.--(BUSINESS WIRE)-- RTI Surgical, Inc. (Nasdaq:RTIX), a global surgical implant company, today outlined its 2018 guidance and long-term financial goals.\nBased on its recent financial results and current business outlook, RTI has developed the following financial guidance for 2018:\nThe Company expects full year revenues in the range of $280 million and $290 million. RTI expects full year EBITDA to be in the range of $32 million to $38 million.\nThe Company noted the following assumptions are included in its guidance:\nRelatively stable market conditions and regulatory environment; Positive revenue contribution from the acquisition of Zyga Technology – announced January 4 th , 2018; Ongoing positive impact of efforts to reduce complexity and implement operational excellence; and Continued marketing of map3® cellular allogeneic bone graft and minimal negative revenue impact related to recent FDA warning letter.\n“We expect 2018 will be a year of continued progress with the accelerating implementation of our strategic transformation plans,” said Camille Farhat, President and CEO. “Our guidance reflects the early results of our initiatives and the ongoing investments necessary to produce sustainable profitable growth and improved cash flow.”\nThe Company also outlined long-term financial goals that are expected to be achieved within five years:\nExpand revenue to more than $500 million Double EBITDA margin to more than 20%\nFarhat explained, “We expect the initiatives we began to reduce complexity and drive operational excellence in 2017 to produce improving margins and cash flow in our tissue focused operations in the coming years. This expected improvement in financial performance will allow us to fund organic and acquisitive growth in our spine focused operations. We are committed to driving significant financial improvements and increasing long-term shareholder value.”\nAbout RTI Surgical, Inc.\nRTI Surgical is a leading global surgical implant company providing surgeons with safe biologic, metal and synthetic implants. Committed to delivering a higher standard, RTI’s implants are used in sports medicine, general surgery, spine, orthopedic, trauma and cardiothoracic procedures and are distributed in nearly 50 countries. RTI has four manufacturing facilities throughout the U.S. and Europe. RTI is accredited in the U.S. by the American Association of Tissue Banks and is a member of AdvaMed. For more information, please visit www.rtix.com .\nForward-Looking Statements\nThis communication contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on management’s current expectations, estimates and projections about our industry, our management's beliefs and certain assumptions made by our management. Words such as \"anticipates,\" \"expects,\" \"intends,\" \"plans,\" \"believes,\" \"seeks,\" \"estimates,\" variations of such words and similar expressions are intended to identify such forward-looking statements. In addition, except for historical information, any statements made in this communication about anticipated financial results, growth rates, new product introductions, future operational improvements and results or regulatory actions or approvals or changes to agreements with distributors also are forward-looking statements. These statements are not guarantees of future performance and are subject to risks and uncertainties, including the risks described in public filings with the U.S. Securities and Exchange Commission (SEC). Our actual results may differ materially from the anticipated results reflected in these forward-looking statements. Copies of the company's SEC filings may be obtained by contacting the company or the SEC or by visiting RTI's website at www.rtix.com or the SEC's website at www.sec.gov .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180105005149/en/\nRTI Surgical, Inc.\nMedia Contact:\nMolly Poarch, +1 224-287-2661\nmpoarch@rtix.com\nor\nInvestor Contact:\nNathan Elwell, +1 847-530-0249\nnelwell@lincolnchurchilladvisors.com\nSource: RTI Surgical, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov%2F&esheet=51738356&newsitemid=20180105005149&lan=en-US&anchor=www.sec.gov&index=3&md5=d1bcd0a1e4060ee5b7f2d830cf1da76f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rtix.com%2F&esheet=51738356&newsitemid=20180105005149&lan=en-US&anchor=www.rtix.com&index=2&md5=0c1def892460c3685900f5f6ad03aa42", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rtix.com%2F&esheet=51738356&newsitemid=20180105005149&lan=en-US&anchor=www.rtix.com&index=1&md5=36d2d0db2c30fff2b76aa07b99ad9a26", "http://www.businesswire.com/news/home/20180105005149/en/"], "published": "2018-01-05T15:00:00.000+02:00", "crawled": "2018-01-05T17:50:31.007+02:00", "highlightTitle": ""}