{"organizations": [], "uuid": "de9b92d7493c0bbbc23710622063926b3e3fd13d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/china-offshore-yuan/hong-kongs-dec-yuan-deposits-at-559-1-bln-yuan-virtually-unchanged-from-nov-idUSL4N1PP1N3", "country": "US", "domain_rank": 408, "title": "Hong Kong's Dec yuan deposits at 559.1 bln yuan, virtually unchanged from Nov", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T11:31:00.000+02:00", "replies_count": 0, "uuid": "de9b92d7493c0bbbc23710622063926b3e3fd13d"}, "author": "", "url": "https://www.reuters.com/article/china-offshore-yuan/hong-kongs-dec-yuan-deposits-at-559-1-bln-yuan-virtually-unchanged-from-nov-idUSL4N1PP1N3", "ord_in_thread": 0, "title": "Hong Kong's Dec yuan deposits at 559.1 bln yuan, virtually unchanged from Nov", "locations": [], "entities": {"persons": [], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "hong kong-dollar", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "reuters) - yuan", "sentiment": "none"}, {"name": "nov reuters staff", "sentiment": "none"}, {"name": "hong kong monetary authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 9:31 AM / Updated 40 minutes ago Hong Kong's Dec yuan deposits at 559.1 bln yuan, virtually unchanged from Nov Reuters Staff 3 Min Read \nHONG KONG, Jan 31 (Reuters) - Yuan deposits in Hong Kong, the biggest offshore yuan center, stayed virtually unchanged at 559.1 billion yuan ($88.93 billion) in December, the Hong Kong Monetary Authority said on Wednesday. \nThe deposits rose to 559.2 billion yuan in November, its highest level in a year. \nCross-border trade settlement amounted to 428.7 billion yuan in December, compared with 440.5 billion a month earlier. \nHong Kong-dollar deposits also hardly budged during the month, while overall foreign-currency deposits expanded by 1.1 percent. \nChina’s stalled yuan internationalisation drive has recently got some tailwind due to a robust yuan performance last year and fresh policies that aim to expand the redback’s global use. \nYuan deposits in major offshore yuan hubs, such as Hong Kong and Taiwan, have been increasing in the past few months, which bodes well for the offshore yuan market and dim sum bond issuance this year. \nTaiwan’s yuan deposits rose to 322.3 billion yuan in December, its highest level since September 2015. \nA survey conducted by Standard Chartered in December among 150 treasuries and senior treasury/finance executives showed that offshore yuan activities likely bottomed out in mid-2017 and interest in yuan products were increasing. \nAccording to the survey, 30 percent of these companies expected cross-border yuan trade settlement to increase, compared to 24 percent at the beginning of last year. Only 1 percent expected it to decrease, compared to 9 percent earlier. \n“Also encouraging was the finding that among those expecting increased trade settlement, around two-thirds acknowledged a positive change in their attitude due to recent regulatory relaxations and strengthening of the Renminbi,” the bank said in a report. \nThe recent rally in the yuan has pushed its year-to-date gain against the dollar to 3.4 percent, adding to its jump of around 6.8 percent in 2017 on the back of solid economic growth. \nThe Chinese currency ended the domestic session at a nearly 2-1/2-year high against the dollar on Wednesday, and is poised for the biggest monthly gain in nearly a quarter of a century. ($1 = 6.2872 Chinese yuan renminbi) (Reporting by Michelle Chen; Editing by Shri Navaratnam)", "external_links": [], "published": "2018-01-31T11:31:00.000+02:00", "crawled": "2018-01-31T12:03:38.010+02:00", "highlightTitle": ""}