{"organizations": [], "uuid": "5509d03d9926abf3a9fb002fc4be1b59bbef5725", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-amicas-petrarca-elected-hldi-chairman.html", "country": "US", "domain_rank": 767, "title": "Amica's Petrarca elected HLDI chairman", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T18:00:00.000+02:00", "replies_count": 0, "uuid": "5509d03d9926abf3a9fb002fc4be1b59bbef5725"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-amicas-petrarca-elected-hldi-chairman.html", "ord_in_thread": 0, "title": "Amica's Petrarca elected HLDI chairman", "locations": [], "entities": {"persons": [{"name": "petrarca", "sentiment": "negative"}, {"name": "michael petrarca", "sentiment": "none"}, {"name": "mike", "sentiment": "none"}, {"name": "anthony e. ptasznik", "sentiment": "none"}, {"name": "david harkey", "sentiment": "none"}, {"name": "h. todd pearce", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "arlington", "sentiment": "none"}], "organizations": [{"name": "amica", "sentiment": "negative"}, {"name": "hldi", "sentiment": "negative"}, {"name": "highway loss data institute", "sentiment": "negative"}, {"name": "board", "sentiment": "none"}, {"name": "acia", "sentiment": "none"}, {"name": "geico corporation", "sentiment": "none"}, {"name": "amica mutual insurance", "sentiment": "none"}, {"name": "geico", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ARLINGTON, Va., Jan. 24, 2018 /PRNewswire-USNewswire/ -- The Highway Loss Data Institute is pleased to announce the election of Michael Petrarca as chairman of its Board of Directors. Petrarca is senior assistant vice president, Amica Mutual Insurance. He succeeds H. Todd Pearce, director and assistant actuary, GEICO pricing, product, and reserving department, GEICO Corporation, who served as HLDI chairman during 2017 and will remain as a Board member.\n\"HLDI's comprehensive analysis of claims data helps insurers understand how trends in the vehicle fleet and changes in state laws affect insurance losses and highway safety,\" Petrarca says. \"I look forward to working with my Board colleagues this year to support HLDI's important work.\"\n\"We are delighted to welcome Mike as our new chairman,\" says David Harkey, who assumed the role of HLDI president in January. \"We will lean on Mike's expertise and leadership in 2018 as we broaden our analyses of motor vehicle loss information.\"\nThe new Board vice chairman is Anthony E. Ptasznik, who is vice president and ACIA chief actuarial officer of Auto Club Group.\nOther HLDI Board members are:\nJustin B. Cruz, vice president, strategic data and analytics, American Family Mutual Insurance Company\nDavid Cummings, senior vice president, chief P&C actuary and head of analytics, USAA\nMichael D. Doerfler, product development manager, Progressive Insurance\nJosh Grunin, assistant vice president data science, The Hartford\nJohn Hardiman, director of public affairs, New Jersey Manufacturers Insurance Group\nDavid Harkey, president, Highway Loss Data Institute and Insurance Institute for Highway Safety\nRobert Harrington, vice president – data, Erie Insurance Group\nCraig Kehrberg, senior auto product manager, PEMCO Insurance\nAndy Lau, senior vice president and chief data and analytics officer, Kemper Corporation\nRichard Lonardo, vice president, MetLife Auto & Home\nJustin Milam, vice president, personal lines actuarial research, American National\nHamid Mirza, executive vice president and chief product officer, global consumer markets, Liberty Mutual Insurance Company\nThomas G. Myers, enterprise chief actuary, Plymouth Rock Assurance\nJames L. Nutting, senior vice president and chief actuary, Farmers Insurance Group\nKathleen Ores Walsh, director, national product management, COUNTRY Financial\nRobert C. Passmore, assistant vice president, personal lines policy, Property Casualty Insurers Association of America\nThomas Rau, director, property casualty actuarial research analytics, Nationwide Insurance\nBill Reddington, director, actuarial services, Kentucky Farm Bureau Mutual Insurance Companies\nMichael Stienstra, vice president-actuarial, Chubb personal risk services, CHUBB\nLaurette Stiles, vice president, strategic resources, State Farm Insurance Companies\nJames Whittle, associate general counsel and chief claims counsel, American Insurance Association\nGeoff Williams, vice president, auto product management, Allstate Insurance Group\nAndrew Woods, vice president, research and development, personal insurance, The Travelers Companies\nJohn Xu, vice president, actuarial, CSAA Insurance Group\nFor more information, go to iihs.org\nThe Highway Loss Data Institute (HLDI), an affiliate of the Insurance Institute for Highway Safety (IIHS), is a nonprofit research organization that publishes insurance loss statistics on most car, SUV, pickup truck and motorcycle models on U.S. and Canadian roads. HLDI is wholly supported by auto insurers.\nView original content: http://www.prnewswire.com/news-releases/amicas-petrarca-elected-hldi-chairman-300587062.html\nSOURCE Highway Loss Data Institute", "external_links": ["http://www.prnewswire.com/news-releases/amicas-petrarca-elected-hldi-chairman-300587062.html"], "published": "2018-01-24T18:00:00.000+02:00", "crawled": "2018-01-24T19:27:41.016+02:00", "highlightTitle": ""}