{"organizations": [], "uuid": "4beb11e186573843ab832512514beaad3cd91275", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/goldman-sachs-earnings-stock-price-falls.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/17/goldman-sachs-bank-stock-earnings/", "country": "US", "domain_rank": 1196, "title": "Goldman Sachs Stock Falls After Earnings Show First Loss Since 2011 | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.319, "site_type": "news", "published": "2018-01-17T02:00:00.000+02:00", "replies_count": 0, "uuid": "4beb11e186573843ab832512514beaad3cd91275"}, "author": "Lucinda Shen", "url": "http://fortune.com/2018/01/17/goldman-sachs-bank-stock-earnings/", "ord_in_thread": 0, "title": "Goldman Sachs Stock Falls After Earnings Show First Loss Since 2011 | Fortune", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}], "locations": [], "organizations": [{"name": "goldman sachs", "sentiment": "negative"}, {"name": "goldman sachs stock falls", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nEarly on in Donald Trump’s presidency, investors deemed Goldman Sachs to be among the biggest winners . \nBut those gains aren’t coming painlessly. On Wednesday, banking giant Goldman Sachs (gs) posted its fourth quarter earnings, revealing its first quarterly loss since 2011. That came in part due to a one-time $4.4 billion charge stemming from the tax bill passed by the current administration last month. The bank previously warned of the cut , saying the tax overhaul required further payments on earnings held abroad and writedowns related to deferred taxes. \nShares of the banking heavyweight fell roughly 2% in trading Wednesday for a stock price of $253 after Goldman Sachs reported losses of $1.93 billion on revenues of $7.83 billion. On a per share basis, the loss was $5.51. \nAccording to the bank, its effective tax rate shot up to 61.5% as a result of the tax legislation in 2017. In absence of the change, the effective rate would have been 22%. \nStill, the stock remains 34% higher than before Trump’s election, with investors anticipating greater future benefits to come from lower corporate tax rates. \nLonger-term worries about Goldman Sachs’ trading business, particularly in bonds and commodities, is likely what led to the stock price’s decline today. \n“The trading miss will weigh on shares today as [Goldman’s fixed income, currencies, and commodities] results have been the worst among Universal Banks year-over-year thus far and speaks to market share loss in a core business,” Keefe Bruyette and Woods analysts wrote in a Wednesday note. \nGoldman posted a 50% decline in revenue from fixed income, currencies, and commodities trading for a total of $1 billion in the quarter, with lower market volatility leading to less demand. It was the trading business’ worst quarter since 2008. \nThe bank has also struggled with low-rated corporate debt, as well as losing oil and gas trades that accounted for some of the declines in its fixed income, currencies, and commodities segment. \nGoldman isn’t alone in its tax overhaul losses. On Tuesday, Citigroup also posted its earnings, revealing an $18 billion quarterly loss largely thanks to the tax overhaul. Like Goldman, Citigroup also expects to see longer-term benefits, with 2018’s effective tax rate at an anticipated 25% against the 30% in 2017. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-17T02:00:00.000+02:00", "crawled": "2018-01-18T06:53:28.037+02:00", "highlightTitle": ""}