{"organizations": [], "uuid": "433807e201792207e80c481a0b7e5a85458e4a5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180116.html", "section_title": "Archive News &amp; Video for Tuesday, 16 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/china-shipping-accident/japan-sees-little-chance-of-oil-slick-from-sunk-tanker-reaching-its-coast-idUSL3N1PB2C6", "country": "US", "domain_rank": 408, "title": "Japan sees little chance of oil slick from sunk tanker reaching its coast", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T15:50:00.000+02:00", "replies_count": 0, "uuid": "433807e201792207e80c481a0b7e5a85458e4a5b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/china-shipping-accident/japan-sees-little-chance-of-oil-slick-from-sunk-tanker-reaching-its-coast-idUSL3N1PB2C6", "ord_in_thread": 0, "title": "Japan sees little chance of oil slick from sunk tanker reaching its coast", "locations": [], "entities": {"persons": [], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "east china sea", "sentiment": "none"}, {"name": "sanchi", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Japan official says oil spill unlikely to reach its shores\n* Tanker sank in worst oil ship disaster in decades\n* Vessel’s crew of 32 all believed to have perished in incident\nTOKYO, Jan 16 (Reuters) - Japan sees little chance of the oil spill from a stricken Iranian tanker that sank on Sunday in the East China Sea reaching its shores, an official at the nation’s environment ministry said on Tuesday.\nThe large tanker Sanchi (IMO:9356608) sank in the worst oil ship disaster in decades and produced a large oil slick, Chinese media and Japanese authorities said on Monday, as worries grew over damage to the marine ecosystem.\nThe vessel’s crew of 30 Iranians and two Bangladeshis are all believed to have perished in the incident.\n“Oil spills in general can have a big environmental impact if they reach the coast, but we think that there is little chance of that happening on Japanese seashores for now,” the official who helps oversee the marine environment for the ministry told Reuters by telephone. He declined to be named as he was not authorised to speak to media.\nThe tanker had been adrift and ablaze after crashing into the freighter CF Crystal (IMO:9497050) on Jan. 6. Strong winds pushed it away from the Chinese coast, where the incident happened, and into Japan’s exclusive economic zone (EEZ).\nThe ship, which had been carrying 136,000 tonnes - almost 1 million barrels - of condensate, an ultra-light, highly flammable crude oil, sank after several explosions weakened the hull.\n“From the area where the tanker sank, a sea current is heading to the north, limiting the chances of the oil slick reaching Japanese coasts,” the official at the environment ministry said.\nThe Japan Coast Guard said on Monday that oil had spread over an area 13 km (8.1 miles) long and 11 km (6.8 miles) wide, although it said the slick was shrinking as patrol boats battled to contain it.\nA spokesman at the Japan Coast Guard added on Tuesday that it was carefully monitoring the oil slick in case weather conditions changed the spill’s direction.\nExperts worry the sinking of the Sanchi will likely expel the remaining condensate and the tanker’s bunker fuel, or the heavy fuel oil that powers a ship’s engines, contaminating the surrounding waters.\nBunker fuel is the dirtiest kind of oil, extremely toxic when spilled, though less explosive than condensate.\nThe Coast Guard spokesman said it had not identified what kind of oil was contained in the slick.\nReporting by Yuka Obayashi; Editing by Joseph Radford\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T15:50:00.000+02:00", "crawled": "2018-01-17T20:18:49.007+02:00", "highlightTitle": ""}