{"organizations": [], "uuid": "7f66a9c03aff149b75ed866aaa4817528e99e8f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000336/device/rss", "section_title": "Janet Yellen", "url": "https://www.cnbc.com/2018/01/31/reuters-america-emerging-markets-emerging-stocks-enjoy-best-january-in-six-years.html", "country": "US", "domain_rank": 767, "title": "EMERGING MARKETS-Emerging stocks enjoy best January in six years", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T12:26:00.000+02:00", "replies_count": 0, "uuid": "7f66a9c03aff149b75ed866aaa4817528e99e8f7"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/31/reuters-america-emerging-markets-emerging-stocks-enjoy-best-january-in-six-years.html", "ord_in_thread": 0, "title": "EMERGING MARKETS-Emerging stocks enjoy best January in six years", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Jan 31 (Reuters) - Emerging markets confirmed their strong start to the year with stocks racking up their best January in six years and currencies chalking up solid gains as markets await more signals on monetary policy from the U.S. Fed later on Wednesday.\nGains in heavyweight bourses Hong Kong and Taiwan lifted MSCI's emerging markets equity benchmark 0.4 percent higher on the day. The index has soared 8 percent since the start of the year the best monthly rise since March 2016 and its best January since 2012.\nEquities around the globe had a strong start to the year with Wall Street hitting a succession of record peaks, though a rise in global bond yields sent jitters through some markets.\nWhile a normalization of monetary policy in the U.S. and higher U.S. yields would raise the pressure, but the overall positive picture for emerging markets remained intact, said NN Investment Partners.\n\"Prospects for global economic growth are robust with the synchronized upturn in both developed and emerging markets set to continue, which will fuel global trade growth,\" NN IP analysts wrote in a note to clients.\nThe Federal Reserve will conclude its first 2018 meeting and the last under outgoing chair Janet Yellen later in the day. Policy makers are expected to leave interest rates unchanged while signaling a gradual tightening later in the year as the world's top economy continues to expand and job gains remain solid.\nBut much focus was also on China, where data showed that manufacturing growth in the world's second largest economy slowed more-than-expected to an 8-month low due to a cooling property market and tighter pollution rules.\n\"The breakdown shows a broad softening in demand the indices for output, new orders and imports all declined,\" Capital Economics' Julian Evans-Pritchard wrote in a note.\n\"The new export orders index looks particularly weak...raising questions about the strength of foreign demand.\"\nWith the dollar still frail, currencies strengthened on the day and were on track for monthly gains across the board.\nMexico's peso put on one of the best monthly performances. The peso looked on track to strengthen 5 percent in January with investors looking more optimistically at the outcome of NAFTA trade talks after the U.S. trade chief pledged to seek \"breakthroughs\" by late February, easing concerns that Washington would soon withdraw from the trilateral pact.\nSouth Africa's rand enjoyed a third straight month of gains, looking to add nearly 4 percent while China's yuan and Russia's rouble are not far behind.\nTurkey's lira eyed a 0.5 percent monthly gain despite January being marred by the latest tensions with Washington following Ankara's engagement in Syria's Afrin region.\nLatest Turkey December data showed the country's trade deficit had widened again. However, tourism revenue numbers - one of Turkey's major sources of financing for its current account deficit - showed a 18.9 percent jump in 2017 helped by a five-fold surge in the number of Russians visiting the country.\nFor GRAPHIC on emerging market FX performance 2017, see http://tmsnrt.rs/2e7eoml For GRAPHIC on MSCI emerging index performance 2017, see http://tmsnrt.rs/2dZbdP5\nFor TOP NEWS across emerging markets\nFor CENTRAL EUROPE market report, see\nFor TURKISH market report, see\nFor RUSSIAN market report, see\n(Reporting by Karin Strohecker; Editing by Raissa Kasolowsky)", "external_links": [], "published": "2018-01-31T12:26:00.000+02:00", "crawled": "2018-01-31T21:05:23.012+02:00", "highlightTitle": ""}