{"organizations": [], "uuid": "0e79c235fbc925430686679b031d3d0fbdd29a14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104964015-GettyImages-688928156.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19794221/device/rss", "section_title": "Europe News", "url": "https://www.cnbc.com/2018/01/24/italys-pm-on-trump-we-get-america-first-policy-but-dont-expect-us-to-agree.html", "country": "US", "domain_rank": 767, "title": "Italy's PM on Trump: We get 'America First' policy but don't expect us to agree", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T11:26:00.000+02:00", "replies_count": 0, "uuid": "0e79c235fbc925430686679b031d3d0fbdd29a14"}, "author": "Holly Ellyatt", "url": "https://www.cnbc.com/2018/01/24/italys-pm-on-trump-we-get-america-first-policy-but-dont-expect-us-to-agree.html", "ord_in_thread": 0, "title": "Italy's PM on Trump: We get 'America First' policy but don't expect us to agree", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donal", "sentiment": "negative"}, {"name": "paolo gentiloni", "sentiment": "negative"}, {"name": "narendra modi", "sentiment": "none"}, {"name": "gentiloni", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "the u.s.", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "'america first", "sentiment": "neutral"}, {"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Italian Prime Minister Paolo Gentiloni told CNBC on Wednesday that he respected U.S. President Donald Trump, but didn't agree with his ideas on migration and climate change nor his protectionist stance on trade.\nSpeaking at the World Economic Forum (WEF) in Davos, Switzerland, Gentiloni discussed Trump's much-criticized \"America First\" rhetoric.\n\"I totally respect the fact that he was elected with the idea of putting America first, and he is trying to deliver in this direction,\" Gentiloni said.\n\"But, we the Europeans, we the Italians, have to stress the fact that respecting and protecting the interest of the U.S. citizens, which is correct, cannot mean that we discuss the framework of the international trade relations, for example, that have been demonstrated to be so useful for growth.\"\nGentiloni's comments come after it was announced Monday that Trump approved tariffs on imported solar cells and certain washing machines, to the consternation of China and other global leaders such as Indian Prime Minister Narendra Modi , who warned the U.S. of its increasingly isolationist and protectionist stance over trade.\nshow chapters Italian Prime Minister Gentiloni: 2018 could be the year of the EU's relaunch 11 Hours Ago | 04:04 Gentiloni said Italy was ready and willing to cooperate with Trump, but to weaken trade relations would be a mistake.\n\"We have to mix free trade and fair trade, as the definition goes, and we have to discuss of dumping policies from this country, or another country,\" he said. \"This is all an open discussion. But the framework of this discussion should remain the support for openness, for free trade, for agreements, and not protectionism.\"\nGentiloni said that although Italy had long cooperated with the U.S., he didn't share Trump's controversial views on migration and climate change , and Europe had to focus on its own region.\n\"We always have to remember that we, the Italians, have always cooperated with the U.S., and with Reagan and Carter and Nixon and Clinton, Bush and Obama. And Trump, Trump is the American-elected president. So, cooperation is there,\" he said.\nSean Gallup/Getty Images U.S. President Donald Trump (L) and Italian Prime Minister Paolo Gentiloni chat during the group photo for the G7 Outreach Program \"(But) we need multilateral and transatlantic cooperation, because it worked, and to weaken this cooperation would be a mistake.\"\nEurope focuses too much on what the U.S. administration \"believes or thinks\" and acts like an \"economic giant and a political dwarf\" rather than concentrating on its own affairs, Gentiloni said. The continent should use 2018 \"to relaunch our role\" in the world, he added.", "external_links": [], "published": "2018-01-24T11:26:00.000+02:00", "crawled": "2018-01-24T13:28:03.008+02:00", "highlightTitle": ""}