{"organizations": [], "uuid": "0bb1d48b5daff7db7dd02bfef5d1dd19261d5fc2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225459619&w=1200&r=LYNXMPEE0P0N2", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-kering-stellamccartney/frances-kering-in-talks-on-split-with-stella-mccartney-report-idUKKBN1FF1CL", "country": "US", "domain_rank": 408, "title": "France's Kering in talks on split with Stella McCartney - report", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T13:27:00.000+02:00", "replies_count": 0, "uuid": "0bb1d48b5daff7db7dd02bfef5d1dd19261d5fc2"}, "author": "", "url": "https://uk.reuters.com/article/uk-kering-stellamccartney/frances-kering-in-talks-on-split-with-stella-mccartney-report-idUKKBN1FF1CL", "ord_in_thread": 0, "title": "France's Kering in talks on split with Stella McCartney - report", "locations": [], "entities": {"persons": [{"name": "stella mccartney", "sentiment": "negative"}, {"name": "stella mc", "sentiment": "negative"}, {"name": "kering", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "business of fashion", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 28 AM / Updated 7 minutes ago France's Kering in talks on split with Stella McCartney - report Reuters Staff 3 Min Read \nPARIS (Reuters) - Kering ( PRTP.PA ) said on Friday it had held talks over its stake in fashion label Stella McCartney, after a report that the French luxury goods firm was discussing selling its 50 percent holding back to the British designer. \nKering, which has had the joint venture since 2001, said it often held discussions with Stella McCartney who is known for her sleek designs and commitment not to use fur or leather. It did not confirm any plans for an imminent split, however. \n“There are regular discussions about the future of the partnership. Any significant change to the current relationship would naturally be made public at the appropriate time,” Kering said in an emailed statement. \nStella McCartney could not immediately be reached for comment on the report by Business of Fashion, which said a split had been considered before, but talks were now more serious. \nLondon-born Stella McCartney, who first made her mark at Richemont-owned ( CFR.S ) fashion label Chloe, launched her eponymous label in partnership with the Gucci Group, formerly a division of what is now Kering. \nKering does not break out earnings for the brand, but it is a much smaller contributor to sales than labels like Gucci - its biggest earnings driver - or Saint Laurent and Bottega Veneta. \nA potential disposal would come as Kering prepares to spin-off German sportswear label Puma ( PUMG.DE ) to its own shareholders, a move welcomed by analysts as it focuses more squarely on its high-margin luxury brands. \nSome said a shift away from Stella McCartney might also be positive, as Kering zones in on labels with the highest growth potential. Kering is due to report 2017 results on Feb. 13. \n“The Stella McCartney brand is one of Kering’s smaller luxury brands within the ‘other luxury’ division and as such is most likely somewhat dilutive to profitability,” analysts at Berenberg said in a note. \nKering shares were up 3.2 percent at 0952 GMT, echoing a rally in LVMH ( LVMH.PA ) shares, up 4.8 percent after the owner of Louis Vuitton posted record revenues and profits for 2017 late on Thursday and said 2018 had started well. Reporting by Sarah White; editing by Alexander Smith", "external_links": [], "published": "2018-01-26T13:27:00.000+02:00", "crawled": "2018-01-26T13:35:40.008+02:00", "highlightTitle": ""}