{"organizations": [], "uuid": "88b84f2cd38f37ba18d7dea932440bf7697f161f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/26/reuters-america-update-3-wynn-resorts-ceo-calls-sexual-misconduct-accusations-preposterous-stock-falls.html", "country": "US", "domain_rank": 767, "title": "UPDATE 3-Wynn Resorts CEO calls sexual misconduct accusations 'preposterous'; stock falls", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T02:46:00.000+02:00", "replies_count": 0, "uuid": "88b84f2cd38f37ba18d7dea932440bf7697f161f"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/26/reuters-america-update-3-wynn-resorts-ceo-calls-sexual-misconduct-accusations-preposterous-stock-falls.html", "ord_in_thread": 0, "title": "UPDATE 3-Wynn Resorts CEO calls sexual misconduct accusations 'preposterous'; stock falls", "locations": [], "entities": {"persons": [{"name": "wynn", "sentiment": "negative"}, {"name": "steve wynn", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "journal", "sentiment": "negative"}, {"name": "nasdaq", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "wynn resorts ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "stock falls@ (Adds details from Journal report; further comment from Wynn; comment from lawyer for Wynn's ex-wife; stock closing price)\nJan 26 (Reuters) - Dozens of past and present employees of Las Vegas casino mogul Steve Wynn have recounted a decades-long pattern of sexual misconduct by the billionaire who immediately denied the accusations as \"preposterous\", the Wall Street Journal reported on Friday.\nWynn is the founder, chairman and CEO of Wynn Resorts Ltd and the company's stock fell more than 10.1 percent in heavy trading to close at $180.29 on the Nasdaq exchange on Friday after the report.\nFormer and current company staff members were interviewed by the Wall Street Journal and claimed Wynn routinely pressured employees to perform sex acts.\nThe report was the latest in a wave of sexual abuse and harassment allegations leveled against powerful men during the past year, especially in the media and entertainment industries and politics.\nWynn has straddled both those worlds, as a prominent figure in the casino resort business who was named finance chairman of the U.S. Republican National Committee last year.\nFormer workers, the Journal said, told of employees going to such lengths as making phony entries in appointment books to help other female employees avoid a request for services in Wynn's office, or arranged for others to pose as assistants so they would not be alone with him.\nOthers, the newspaper said, recalled female employees hiding in the lavatory or backrooms when they learned he was on his way to a hotel salon.\n\"Everybody was petrified,\" former salon artistic director Jorgen Nielsen was quoted as telling the Journal.\nAccording to Nielsen, he and others repeatedly told high-level company executives about Wynn's unwanted sexual advances, but \"nobody was there to help us.\"\nThe article said Wynn paid a $7.5 million settlement to a former manicurist at his flagship Wynn Las Vegas resort who had accused Wynn of forcing her to have sex in his office in 2005.\nThe Journal said the alleged incident and settlement were mentioned obliquely in court documents filed in a lawsuit brought by the casino owner's former wife, Elaine Wynn, over control of her stock in the company.\nSteve Wynn, 75, denied the allegations in a statement emailed to Reuters.\n\"The idea that I ever assaulted any woman is preposterous,\" he said. He added, \"The instigation of these accusations is the continued work of my ex-wife, Elaine Wynn, with whom I am involved in a terrible and nasty lawsuit in which she is seeking a revised divorce settlement.\"\nA spokeswoman for Elaine Wynn declined comment, but her Washington-based attorney, James Cole, told Reuters the notion that his client fomented the allegations in the Journal article \"is just not true.\"\nThe Journal said none of the 150 people contacted for the story had reached out to the newspaper, and that most of those interviewed expressed fear that Wynn's influence in the casino industry could hurt their ability to find work elsewhere.\nIn an escalating battle that followed their bitter second divorce in 2010, Elaine Wynn sued her former spouse in 2016 seeking to gain control over her 9.4 percent stock in Wynn Resorts.\nThe lawsuit accused her ex-husband of breaching a 2010 stockholder agreement by engineering her ouster from the company's board the previous April.\n(Reporting and writing by Steve Gorman in Los Angeles; Additional reporting by Caroline Valetkevitch in New York and Pranav Kran in Bengaluru; editing by Clive McKeef)", "external_links": [], "published": "2018-01-27T02:46:00.000+02:00", "crawled": "2018-01-27T07:45:52.005+02:00", "highlightTitle": ""}