{"organizations": [], "uuid": "d9619bc25d78ca63b33e97ce9bec843e9bc70260", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180106&t=2&i=1219842799&w=1200&r=LYNXMPEE050A8", "site_section": "http://feeds.feedburner.com/Reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-usa-trump-book/trump-rejects-accusations-in-critical-book-describes-self-as-stable-genius-idUKKBN1EV0DU", "country": "US", "domain_rank": 408, "title": "Trump rejects author's accusations, calls self 'stable genius'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T17:22:00.000+02:00", "replies_count": 0, "uuid": "d9619bc25d78ca63b33e97ce9bec843e9bc70260"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-trump-book/trump-rejects-accusations-in-critical-book-describes-self-as-stable-genius-idUKKBN1EV0DU", "ord_in_thread": 0, "title": "Trump rejects author's accusations, calls self 'stable genius'", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "steve holland", "sentiment": "none"}, {"name": "michael wolff", "sentiment": "none"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "reagan", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "trump white house", "sentiment": "none"}, {"name": "democratic", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 6, 2018 / 12:56 PM / Updated 2 hours ago Trump rejects author's accusations, calls self 'stable genius' Steve Holland 5 Min Read \nWASHINGTON (Reuters) - U.S. President Donald Trump on Saturday rejected an author’s accusations that he is mentally unfit for office and said his business career and election victory showed he is “a very stable genius.” \nMichael Wolff, who was granted unusually wide access to the White House during much of Trump’s first year, has said in promoting his book that Trump is unfit for the presidency. He told BBC Radio in an interview broadcast on Saturday that his book is creating “the perception and the understanding that will finally end ... this presidency.” \nTrump battled back in a series of extraordinary morning posts on Twitter, which appeared to catch some in his inner circle off guard. \nTrump said Democratic critics and the U.S. news media were bringing up the “old Ronald Reagan playbook and screaming mental stability and intelligence” since they have not been able to bring him down in other ways. \nReagan, a Republican who was the U.S. president from 1981-1989, was diagnosed with Alzheimer’s disease in 1994 and died in 2004. \n“Actually, throughout my life, my two greatest assets have been mental stability and being, like, really smart,” said Trump, a former reality TV star and developer. \n“I went from VERY successful businessman, to top T.V. Star ... to President of the United States (on my first try). I think that would qualify as not smart, but genius ... and a very stable genius at that!” \nTrump, 71, sent the tweets from the presidential retreat at Camp David, Maryland, where he discussed a legislative agenda for the year with Republican congressional leaders and many Cabinet secretaries. \nWolff’s book, “Fire and Fury - Inside the Trump White House,” portrays Trump as unfocused, unprepared and petty while presiding over a chaotic White House. \nTrump, answering questions from reporters at Camp David after the meeting, called Wolff a “fraud” and said the book is “a complete work of fiction.” \n“I think it’s a disgrace,” he said. FILE PHOTO: U.S. President Donald Trump speaks in the Roosevelt Room of the White House in Washington, U.S., August 2, 2017. REUTERS/Carlos Barria/File Photo ACCESS QUESTION \nTrump said he never granted Wolff an interview for the book and blamed former adviser Steve Bannon, who he called “Sloppy Steve,” for granting Wolff access at the White House. Wolff has said he spoke to Trump but that the president may not have known he was being interviewed. \nThe tweets were another sign of Trump’s frustration at what he views as unfair treatment by the news media of his presidency amid a federal investigation into whether he or his campaign aides colluded with Russia during the 2016 presidential campaign, in which he defeated Democrat Hillary Clinton. \nWhite House Chief of Staff John Kelly told reporters at Camp David that he had not been aware of Trump’s morning tweets. Kelly said Trump did not seem angry and on Friday night had watched a new movie, “The Greatest Showman” about legendary circus promoter P.T. Barnum, with the lawmakers. Slideshow (2 Images) \nTrump, asked about a New York Times report that his aides had pressured Attorney General Jeff Sessions not to recuse himself from the Russia investigation, said: “Everything I’ve done has been 100 percent proper.” \nTrump, who has often criticized Sessions of his performance as attorney general, said he nonetheless supports him. Sessions had not been invited to the weekend retreat. \nWolff’s book has proved to be another shock to the system for Trump and his top aides, coming just as he starts his second year in office. \nWolff told NBC News on Friday that White House staff treated Trump like a child. \n“The one description that everyone gave, everyone has in common — they all say he is like a child,“ Wolff said. ”And what they mean by that, he has a need for immediate gratification. It’s all about him. \n“This man does not read, does not listen. He’s like a pinball, just shooting off the sides.” \nTrump is to undergo the first physical examination of his presidency on Jan. 12. The exam was announced on Dec. 7 after questions arose about Trump’s health when he slurred part of a speech announcing that the United States recognised Jerusalem as the capital of Israel. \nWhite House officials and Trump’s high-profile supporters have launched an effort to raise doubts about Wolff’s credibility. White House spokesman Sarah Sanders said earlier in the week that the book includes “mistake after mistake after mistake.” Additional reporting by James Oliphant in Camp David, Maryland; Editing by Lisa Von Ahn and Bill Trott", "external_links": [], "published": "2018-01-06T17:22:00.000+02:00", "crawled": "2018-01-06T17:41:03.014+02:00", "highlightTitle": ""}