{"organizations": [], "uuid": "361835fbc5a775a49cb209360f05a9d114e2e513", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/20/104909144-RTX3VOJ6.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/heres-why-democrats-face-a-tough-senate-campaign-this-year.html", "country": "US", "domain_rank": 767, "title": "Here's why Democrats face a tough Senate campaign this year", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-29T21:55:00.000+02:00", "replies_count": 0, "uuid": "361835fbc5a775a49cb209360f05a9d114e2e513"}, "author": "John W. Schoen", "url": "https://www.cnbc.com/2018/01/29/heres-why-democrats-face-a-tough-senate-campaign-this-year.html", "ord_in_thread": 0, "title": "Here's why Democrats face a tough Senate campaign this year", "locations": [], "entities": {"persons": [{"name": "aaron p. bernstein", "sentiment": "negative"}, {"name": "mitch mcconnell", "sentiment": "negative"}, {"name": "steven law", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "u.s. capitol", "sentiment": "none"}, {"name": "r-ky.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "negative"}, {"name": "reuters senate", "sentiment": "negative"}, {"name": "american crossroads", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "senate leadership fund", "sentiment": "none"}, {"name": "usa today", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com Aaron P. Bernstein | Reuters Senate Majority Leader Mitch McConnell, accompanied by members of the Republican Conference, speaks at a news conference about the passage of the Tax Cuts and Jobs Acts at the U.S. Capitol in Washington, U.S., December 20, 2017. \nRepublicans are wasting no time getting ready for the 2018 Senate campaign, as several outside GOP groups have raised a record amount of money for the upcoming midterm elections. \nCampaign finance groups allied with Sen. Majority Leader Mitch McConnell , R-Ky., have assembled a $31.6 million war chest as of the start of this year, according to USA Today, a record for an off-cycle year. Those groups include the Senate Leadership Fund, One Nation, Crossroads GPS and American Crossroads. \n\"We start this cycle better prepared than we ever have been,\" Steven Law, the CEO of American Crossroads, told the newspaper. \nThe money will go toward defending eight Senate seats held by Republicans that are up for re-election this fall. While the president's party typically loses seats in midterms, Democrats face a number of strong challenges of their own, based on a CNBC analysis of past voting patterns. \nRepublicans will be defending just 8 of the 34 seats that are up for re-election in November, most of which are in solidly red states. Democrats, on the other hand, are defending seats in states that have a pattern of voting Republican for both Senate and presidential candidates. \nIn North Dakota, for example, Democratic Sen. Heidi Heitkamp will be defending a seat she won in the 2012 election cycle by roughly 1 percent of the vote. North Dakota has heavily favored Republicans in both the 2010 and 2016 Senate cycles and in the 2012 and 2016 presidential races. \nDemocrats are also defending seats in Florida, Ohio, Pennsylvania and Wisconsin, where Republicans won their Senate races in both 2010 and 2016. And in West Virginia, Montana, Indiana and Missouri, Democrats are defending Senate seats in states that voted for Republican presidential candidates in 2012 and 2016. \nBased on past voting patterns, Sen. Dean Heller of Nevada is the Republican facing the closest race, having won his seat in 2012 by just 1 percent of the vote. WATCH: Democrats were feeling the heat on shutdown: Expert show chapters", "external_links": [], "published": "2018-01-29T21:55:00.000+02:00", "crawled": "2018-01-29T21:55:32.005+02:00", "highlightTitle": ""}