{"organizations": [], "uuid": "7772a515122fb3c6f82c2d4bb36eb9428c707752", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XE450_CMOHor_SOC_20180125180944.jpg", "site_section": "http://online.wsj.com/xml/rss/3_7014.xml", "section_title": "WSJ.com: US Business", "url": "https://www.wsj.com/articles/budweiser-benches-famous-clydesdales-for-super-bowl-lii-1516975201", "country": "US", "domain_rank": 387, "title": "Budweiser Benches Famous Clydesdales for Super Bowl LII", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T16:00:00.000+02:00", "replies_count": 0, "uuid": "7772a515122fb3c6f82c2d4bb36eb9428c707752"}, "author": "Suzanne Vranica", "url": "https://www.wsj.com/articles/budweiser-benches-famous-clydesdales-for-super-bowl-lii-1516975201", "ord_in_thread": 0, "title": "Budweiser Benches Famous Clydesdales for Super Bowl LII", "locations": [], "entities": {"persons": [{"name": "adolphus busch", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "cartersville", "sentiment": "none"}, {"name": "st. louis", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "anheuser-busch", "sentiment": "negative"}, {"name": "budweiser", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "82 COMMENTS Anheuser-Busch InBev BUD 1.00% NV is sidelining its lovable Clydesdale horses for Super Bowl LII and will instead highlight its philanthropic efforts, as the beer company tries to resuscitate the Budweiser brand after a decadeslong slump.\nA perennial fan favorite on Super Bowl Sunday, the horses made their big game debut in 1975 and have appeared in more than 40 Super Bowl commercials over the years. One popular spot that aired in 1996 showed the horses playing a game of football.\nBudweiser’s 1996 Super Bowl Clydesdale ad Still, the creatures have seen their role during the football championship diminish. Last year, they made a cameo appearance in “Born the Hard Way,” a 60-second spot about the company’s co-founder, Adolphus Busch, and his journey from Germany to St. Louis in 1857. \nFor this year’s national TV broadcast, Budweiser is running a commercial that shows employees halting production of Budweiser at its Cartersville, Ga.-based brewery last year. Employees are then shown producing cans of emergency drinking water for victims of natural disasters in Texas, Florida, Puerto Rico and California, as a rendition of “Stand By Me” plays in the background.\nBudweiser’s TV ad for the Super Bowl in 2018 The Clydesdales will instead be part of the company’s online strategy for the big game, and a new 60-second online video ad will be released next week. Last year, the brewer encouraged fans via Twitter to check out a live feed on its horses, who watched the Super Bowl from St. Louis.\nUsing the familiar ad icons as a carrot in the public-relations games around the Super Bowl is familiar territory for AB InBev. In 2010, the company said the Clydesdales wouldn’t be appearing during the NFL championship but eventually it reversed its decision after asking fans to vote on the matter.\nThe world’s largest brewer said its shift in strategy is due to the growing importance of social media and how social media is driving much of the conversations that consumers have nowadays.\nThe company said it changed its creative strategy for Budweiser, which has experienced sales decline for nearly two decades, to focus more on the telling the stories about its company and its employees because that is what consumers are looking for.\n“We lost a little bit of that human connection to the brand,” said Ricardo Marques, vice president of Budweiser marketing.\nCMO Today Newsletter Get your daily dose of media and advertising news with WSJ’s CMO Today newsletter. Sign up here .\nThe company can use all the attention it can get. \nMiller Lite has supplanted Budweiser as the No. 3 best-selling beer in the U.S., behind Bud Light and Coors Light, according to trade publication Beer Marketer’s Insights. AB InBev’s sales in the U.S. have fallen as Americans shift away from domestic lager toward craft beers, Mexican imports, wines and spirits. \n“The U.S. is one of the most exciting and challenging beer markets in the world,” said Mr. Marques. He added that the company has seen some positive momentum in consumers’ perception of the Budweiser brand. \nOther AB InBev brands expected to air commercials during the big game include Bud Light, Michelob Ultra and Stella Artois.\nNBC, which will broadcast the Super Bowl on Feb. 4, said 30-second commercial spots are selling for more than $5 million.", "external_links": [], "published": "2018-01-26T16:00:00.000+02:00", "crawled": "2018-01-26T17:33:44.006+02:00", "highlightTitle": ""}