{"organizations": [], "uuid": "18bca044ef865a8a7154b17523ef77c100091edd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-michael-carroll-joins-k2-intelligence-investigations-and-disputes-practice.html", "country": "US", "domain_rank": 767, "title": "Michael Carroll Joins K2 Intelligence Investigations and Disputes Practice", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T17:30:00.000+02:00", "replies_count": 0, "uuid": "18bca044ef865a8a7154b17523ef77c100091edd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-michael-carroll-joins-k2-intelligence-investigations-and-disputes-practice.html", "ord_in_thread": 0, "title": "Michael Carroll Joins K2 Intelligence Investigations and Disputes Practice", "locations": [], "entities": {"persons": [{"name": "michael carroll", "sentiment": "negative"}, {"name": "charles linehan", "sentiment": "none"}, {"name": "carroll", "sentiment": "none"}, {"name": "snežana gebauer", "sentiment": "none"}, {"name": "jeremy m. kroll", "sentiment": "none"}, {"name": "jules b. kroll", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "u.s. investigations and disputes", "sentiment": "none"}, {"name": "department of investigation", "sentiment": "none"}, {"name": "construction and real estate services", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 9, 2018 /PRNewswire/ -- K2 Intelligence, an industry-leading investigative, compliance, and cyber defense services firm founded by Jules B. Kroll and Jeremy M. Kroll, announced today that Michael Carroll has joined the firm as managing director based in New York. Mr. Carroll will play a leading role in the Construction and Real Estate practice, and will report to Snežana Gebauer, executive managing director and head of the firm's U.S. Investigations and Disputes practice, and Charles Linehan, managing director and leader of the firm's Construction and Real Estate Services team.\nMr. Carroll joins K2 Intelligence from the New York City Department of Investigation (DOI), the agency charged with oversight of more than 300,000 employees and contractors seeking to engage in or currently engaging in business with the City. As Deputy Commissioner of the Investigations Division, he oversaw all aspects of criminal investigations into corrupt, illegal, or unethical conduct, including those focused on financial fraud, theft, organized crime, bribery, narcotics, and political corruption. He provided executive oversight for the agency's 11 Investigative Squads and its Digital Forensics Unit, Special Operations Unit, and Vendor Integrity Unit; managed staff that conducted background investigations on contractors and subcontractors seeking to do business with the City; oversaw internal DOI investigations involving allegations of criminality and/or misconduct; and directed outside investigative consultants providing integrity monitoring services for the DOI on large-scale construction projects. He also served as Commanding Officer of the DOI's Training Academy.\n\"Michael brings substantial experience in public-sector investigations, including monitorships connected to environmental, health, housing, and large-scale construction projects. I'm confident that he will be a strong contributor to our Investigations and Disputes practice,\" said Robert Brenner, chief operating officer for K2 Intelligence.\n\"Michael's expertise in criminal investigations into corrupt, illegal, or unethical conduct as well as his in-depth knowledge of eradicating fraud in public infrastructure will be an important addition to our team as we are continuing to expand our construction and real estate service offering,\" said Snežana Gebauer, executive managing director and head of K2 Intelligence's U.S. Investigations and Disputes practice.\nMr. Carroll joined the DOI in 2004 and over the last 13 years has served as Chief Investigator, Deputy Inspector General, Inspector General, Assistant Commissioner, and Associate Commissioner. He assumed his current role at the DOI in 2015. Before joining the DOI, he served as manager of investigations/corporate security for JetBlue Airways, where he managed all investigations in the United States (including investigations into theft, embezzlement, narcotics trafficking, money laundering, security breaches, and employee misconduct), frequently liaising with local, state, and federal law enforcement and regulatory agencies. Mr. Carroll began his career in the New York City Police Department, where he was a Detective Investigator.\nHe is a frequent speaker to U.S. law enforcement agencies, as well as to the law enforcement agencies of foreign governments. He also served as an adjunct professor of criminal justice at St. Thomas Aquinas College.\nMr. Carroll received his M.A. in criminal justice from the John Jay College of Criminal Justice and his B.A. in psychology from the College of Mount Saint Vincent. He is a Certified Fraud Examiner (CFE).\nK2 Intelligence helps companies identify risks relating to bribery, fraud, and corruption throughout their business and provides investigative resources for efficient and quick response when incidents or allegations of bribery and corruption are identified or occur. Our multidisciplinary teams of experts are uniquely qualified to investigate instances of corruption globally in a wide spectrum of industries and include corporate investigators, former members of law enforcement and intelligence agencies, forensic accountants, forensic auditors, certified public accountants, certified fraud examiners, forensic engineers, research analysts, loss prevention specialists, and attorneys experienced in corruption issues around the world.\nK2 Intelligence also leverages the experience and expertise of members of its Construction and Real Estate practice, formerly Thacher Associates, which was acquired in 2012. K2 Intelligence builds on Thacher's more than 30 years of public- and private-sector experience and the strategies developed to prevent, detect, and remediate construction fraud and corruption. These techniques have been adapted to the management of other industry risks, including waste, mismanagement, and regulatory requirements.\nAbout K2 Intelligence\nK2 Intelligence is an industry-leading investigative, compliance, and cyber defense services firm founded in 2009 by Jeremy M. Kroll and Jules B. Kroll, who is credited with originating the modern corporate investigations industry. Redefining 21st-century corporate intelligence, the firm combines subject-matter expertise with cutting-edge technology, bringing to bear the industry's best multidisciplinary teams to solve our clients' most difficult problems.\nWith offices in New York, London, Madrid, Geneva and Los Angeles, K2 Intelligence advises governments, companies, boards and individuals in business areas, including Investigations and Disputes, Regulatory Compliance, Cyber Defense, Construction and Real Estate, Strategic Risk and Security, and Private Client Services.\nFor more information, visit www.k2intelligence.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/michael-carroll-joins-k2-intelligence-investigations-and-disputes-practice-300579851.html\nSOURCE K2 Intelligence", "external_links": ["http://www.prnewswire.com/news-releases/michael-carroll-joins-k2-intelligence-investigations-and-disputes-practice-300579851.html", "http://www.k2intelligence.com/"], "published": "2018-01-09T17:30:00.000+02:00", "crawled": "2018-01-09T18:52:15.017+02:00", "highlightTitle": ""}