{"organizations": [], "uuid": "922c778488bee9f360b0e3d42b70f77f60d89012", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/17/the-associated-press-very-strong-democratic-sentiment-to-oppose-gop-budget-bill.html", "country": "US", "domain_rank": 767, "title": "'Very strong' Democratic sentiment to oppose GOP budget bill", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T08:12:00.000+02:00", "replies_count": 0, "uuid": "922c778488bee9f360b0e3d42b70f77f60d89012"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/17/the-associated-press-very-strong-democratic-sentiment-to-oppose-gop-budget-bill.html", "ord_in_thread": 0, "title": "'Very strong' Democratic sentiment to oppose GOP budget bill", "locations": [], "entities": {"persons": [{"name": "chuck schumer", "sentiment": "negative"}, {"name": "dick durbin", "sentiment": "none"}, {"name": "schumer", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "d-ill.", "sentiment": "none"}], "organizations": [{"name": "gop", "sentiment": "negative"}, {"name": "top senate", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "gop-drafted", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — Top Senate Democrat Chuck Schumer said Wednesday there's \"very, very strong\" sentiment among Democrats in the chamber to oppose GOP-drafted legislation to keep the government's doors open, comments that could indicate the chances are increasing that the government could shut down at midnight Friday night.\nDemocrats' votes are needed to advance the stopgap measure through the Senate, but they have been rebuffed in their demands to add protections against deportation for younger immigrants who were brought to the country illegally as children.\n\"The overwhelming number in our caucus have said they don't like this deal and they believe if we kick the can down the road this time we'll be back where we started from next time,\" Schumer said. \"So there's very, very strong support not to go along with their deal.\"\nTalks among a bipartisan group of leaders of both the House and Senate convened Wednesday, but participants reported little progress.\n\"Good will but no progress,\" said Sen. Dick Durbin, D-Ill., a negotiator but one whose loyalties lie chiefly with separate compromise legislation on the so-called \"Dreamer\" immigrants that he's co-authored with Lindsey Graham, R-S.C., Jeff Flake, R-Ariz., and Cory Gardner, R-Colo., some of the Senate's most dovish Republicans on immigration.\nHouse GOP leaders unveiled the spending bill Tuesday night, sweetening it with a six-year renewal of the popular Children's Health Insurance Program and with provisions to temporarily suspend three \"Obamacare\" taxes, including a tax on generous \"Cadillac\" health plans.\nSome conservatives oppose the short-term spending bill and said GOP leaders lacked the votes to pass it. House Speaker Paul Ryan, R-Wis., declined to say if he had enough Republican support to push it through the House this week. Vote counters gauged GOP support Wednesday in advance of a vote planned for Thursday.\nRyan said it was \"baffling\" why Democrats would oppose the spending measure, noting it contains money for the military and the widely supported children's health insurance program. Republicans are hoping the money for children will pressure some Democrats to back the overall bill.\n\"I think cool heads hopefully will prevail,\" Ryan told reporters. Congress must approve the measure, called a continuing resolution, or CR, by Friday night to prevent a shutdown.\nRyan also said he wants to reach a compromise on immigration but won't bring such a measure to the House floor unless President Donald Trump supports it. He said Trump is being \"completely rational\" in demanding that the bill have stronger border security provisions than a bipartisan immigration proposal from six senators that he rejected last week.\nSeparately, members of the Congressional Hispanic Caucus and other Democrats met privately in the Capitol with White House chief of staff John Kelly, and some emerged citing little progress. The talks were on legislation aimed at shielding the hundreds of thousands of young immigrants from deportation.\n\"They have a disproportionate focus on the border more than anything else,\" Sen. Robert Menendez, D-N.J., one of the six senators who crafted the bipartisan proposal, said after the meeting. He added that in return for protecting the young immigrants, \"what they want in return is continuously a moving target and it continuously expands.\"\nIt seems certain that no immigration accord will be reached this week, in time to affect the outcome on the vote on the separate bill preventing a federal shutdown. If Congress can't temporarily finance the government by Friday, a shutdown would begin the next day, an election-year debacle that GOP leaders and many Democrats are eager to avoid for fear of alienating voters.\nHouse Republican leaders tried to win over wary conservatives for the spending bill by sweetening it. They added a two-year delay on implementation of unpopular taxes on medical devices and generous employer-subsidized health care plans. The taxes, also unpopular with many Democrats, are part of former President Barack Obama's marquee health law.\nIn a bid to pressure Democrats, GOP leaders also included a long-delayed, six-year renewal of the health insurance program for children of low-income families. The overall measure would fund the government through Feb. 16 and was well received by most GOP lawmakers when Ryan proposed it Tuesday.\nBut some conservatives have yet to be won over.\n\"At what point do you quit kicking the can down the road and passing just another CR in hopes that things get better in a few weeks,\" said Rep. Mark Meadows, R-N.C., a leader of the chamber's most conservative faction.\nEven if the spending measure succeeds in the House, Republicans would still need at least nine Democratic votes to push it through the Senate, which the GOP controls 51-49. Democrats seeking leverage are forcing that bill to require 60 votes for passage.\nWhen the Senate approved a similar short-term spending bill in December, 17 Democrats plus Maine independent Angus King voted to keep the government open. Seven of those Democrats face re-election in November in states Trump won — including West Virginia, North Dakota and Montana, which have small numbers of minority voters.\nDemocrats voting against that December bill included some senators — including Cory Booker of New Jersey and Kamala Harris of California — who might seek the presidency in 2020 and would love support from their party's liberal voters.\nTrump ended the Deferred Action for Childhood Arrivals, or DACA, late last year but gave Congress until March 5 to pass legislation extending the initiative created by Obama. It has protected around 800,000 young immigrants from deportation.\nAssociated Press writers Kevin Freking, Marcy Gordon and Steve Peoples contributed to this report.", "external_links": [], "published": "2018-01-17T08:12:00.000+02:00", "crawled": "2018-01-18T02:02:44.012+02:00", "highlightTitle": ""}