{"organizations": [], "uuid": "f38e4ae3528d966fa751814ac4f8181614e263fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/12/104467391-RTS1518O.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/us-stocks-government-shutdown.html", "country": "US", "domain_rank": 767, "title": "Stocks open slightly lower on government shutdown", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.129, "site_type": "news", "published": "2018-01-22T16:30:00.000+02:00", "replies_count": 0, "uuid": "f38e4ae3528d966fa751814ac4f8181614e263fe"}, "author": "Fred Imbert", "url": "https://www.cnbc.com/2018/01/22/us-stocks-government-shutdown.html", "ord_in_thread": 0, "title": "Stocks open slightly lower on government shutdown", "locations": [], "entities": {"persons": [{"name": "historica", "sentiment": "none"}, {"name": "sarah sanders", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "--- \nStocks kicked off the session trading lower, but quickly erased those losses. \n\"The market has been through this enough times and understands Republicans and Democrats will come to an agreement,\" said Mark Heppenstall, CIO at Penn Mutual Asset Management. \nMembers of the senate reached a short-term compromise to keep the government open through Feb. 8. Democratic Sen. Mark Warner said the party has the assurance it needs on the budget and immigration issues . \nOn Saturday, the U.S. government shut down after a bill that would have kept government funded through mid-February was voted against in the Senate. The shutdown continued for a third day on Monday after the Senate on Sunday failed to reach an agreement to break an impasse before the work week began in Washington. \nHistorically, a brief bout of volatility has hit the market following a government shutdown. The Cboe Volatility Index, also known as the VIX and considered the best gauge of fear in the market trades positive 75 percent of the time one week after a shutdown and averaged a return of 9.7 percent, according to CNBC analysis using Kensho. The S&P 500 averages a return of negative 0.3 percent. Brendan McDermid | Reuters A trader works on the floor of the New York Stock Exchange (NYSE) in New York. \nBut these moves are often short-lived. The S&P 500 averaged a return of 2.1 percent a month after a shutdown and trades positive 80 percent of the time. \n\"Anyone with capital markets experience knows that US government shutdowns are largely meaningless in the context of financial asset values,\" said Nicholas Colas, co-founder of DataTrek Research, in a note. \"Getting sucked into a series of seemingly ominous headlines that smarter players already understand is a typical rookie trading mistake.\" \nInvestors also paid attention to the corporate earnings season. On Monday, Halliburton reported better-than-expected earnings, sending the company's shares up 3.7 percent. \nThe calendar fourth-quarter earnings season is off to a good start. As of Friday, 68 percent of the S&P 500 companies that had reported surpassed earnings expectations, while 85 percent of those companies had beaten sales estimates, according to FactSet. \nWhat's more, \"last week, 27 companies in the S&P 500 reported 4Q 2017 results, not one of those companies had its next quarter (i.e. 1Q 2018) EPS estimates lowered after releasing results,\" said Nick Raich, CEO of The Earnings Scout, in a note. \n\"This is an amazing stat because in EVERY earnings season over the last seven years, a majority of S&P 500 companies have had their next quarter estimates lowered after reporting. So, the fact not one of the companies reporting last week had EPS estimates lowered is remarkable,\" Raich said. \nNetflix and TD Ameritrade are scheduled to report quarterly earnings after the bell Monday. \nElsewhere in corporate news, Twitter shares fell 1.4 percent after CNBC reported that executive Anthony Noto has been offered the CEO job at Social Finance. \n—CNBC's Christina Wilkie contributed to this report.", "external_links": [], "published": "2018-01-22T16:30:00.000+02:00", "crawled": "2018-01-22T16:50:13.021+02:00", "highlightTitle": ""}