{"organizations": [], "uuid": "cd083260893ea5c182e2f57ac7773860fa5386b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 63, "shares": 63, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-flu-heart-attack/flu-increases-the-risk-of-heart-attack-idUSKBN1FD34O", "country": "US", "domain_rank": 408, "title": "Flu increases the risk of heart attack", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:08:00.000+02:00", "replies_count": 0, "uuid": "cd083260893ea5c182e2f57ac7773860fa5386b7"}, "author": "", "url": "https://www.reuters.com/article/us-health-flu-heart-attack/flu-increases-the-risk-of-heart-attack-idUSKBN1FD34O", "ord_in_thread": 0, "title": "Flu increases the risk of heart attack", "locations": [], "entities": {"persons": [{"name": "kwong", "sentiment": "none"}, {"name": "jeffrey kwong", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters health", "sentiment": "negative"}, {"name": "institute for cl", "sentiment": "none"}, {"name": "new england journal of medicine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters Health) - Influenza is already known to be deadly, but a new study suggests that the risk of heart attack is six times greater than normal while people are ill with the flu.\n“I was a little bit surprised by the strength of the association. It’s not every day you see a six-fold increase in the risk during the first seven days of lab-confirmed influenza,” chief author Dr. Jeffrey Kwong told Reuters Health in a telephone interview. “We were also surprised the risk dropped off to nothing by day 8 and beyond.”\nHe and his Canadian team also found that other respiratory diseases can also increase the chance of a heart attack, but not as nearly as dramatically.\nThe group, reporting in The New England Journal of Medicine, did not examine whether flu-associated heart attacks are deadlier.\nThe new study reinforces the importance of the flu vaccine and protective measures such as regular hand washing to guard against influenza and other infections, said Dr. Kwong, a scientist at the Institute for Clinical Evaluative Sciences in Toronto.\nDoctors have suspected a link between flu and heart attacks since the 1930s, but in that era it was hard to know if the influenza virus or a flu-like illness had made a patient sick prior to the heart attack.\nKwong and his colleagues used confirmed cases of flu, analyzing 364 heart attacks from mid-2008 through mid-2015 among Ontario residents age 35 or older who were registered with the province’s publicly funded health insurance program.\nThe heart attack rate was 20.0 admissions per week during the seven days after diagnosis of the flu, versus 3.3 per week during the 52 weeks before and 51 weeks after that seven-day window.\nThe risk dropped off dramatically by the eighth day after diagnosis.\nDr. Erica Jones, director of the HeartHealth Program at Weill Cornell Medicine and New York-Presbyterian Hospital, who was not connected with the study, said the results aren’t surprising based on her experience with hospitalized heart attack patients.\n“This time of year we frequently had people on the floor after the flu,” she told Reuters Health by phone. “It was often associated with pneumonia.”\nThe flu “is a stressor to the system. It can increase inflammation. When you get an infection your heart is beating faster. It can activate platelets, increasing the chance that blood clots will form in the arteries that serve the heart. All of these can increase the chance of having a heart attack,” Dr. Kwong said.\nAmong the 332 people in the study who developed at least one heart attack while recovering from the flu, 69 percent had not received a flu shot. For 76 percent, it was their first heart attack, technically known as an acute myocardial infarction.\nThe heart attack risk increased slightly for adults over 65 and for people infected with influenza type B. But those increases were not statistically significant. The risk was 10 times higher with influenza B, five times higher with influenza A (the most common type during that period), 3.5 times greater for respiratory syncytial virus and nearly three times higher for other viruses.\nThe study “should not be interpreted as evidence of a lack of vaccine effectiveness, because this study was not designed to evaluate the effectiveness of influenza vaccines,” the researchers said. “Rather, since vaccination of adults is only approximately 40% to 60% effective in preventing laboratory-confirmed influenza infection, this study shows that if vaccinated patients have influenza of sufficient severity to warrant testing, their risk of acute myocardial infarction is increased to a level that is similar to that among unvaccinated patients.”\n“We can’t say it enough - get a flu shot,” said Dr. Jones. “Even if the flu shot isn’t perfect, it may protect at least somewhat and the flu could be less severe, although this study didn’t address that. Also, wash your hands all the time and stay away from people who you know are sick.”\nAnd if you get the flu, “don’t ignore symptoms” that might suggest a heart attack, she said. “Chest pains, shortness of breath might be more than you think.”\nThe time it takes for the flu to produce symptoms is about 1.4 days after infection with influenza A and 0.6 days with influenza B. Once symptoms begin, it only takes a day or two for them to peak.\nThe researchers cautioned that the people in their study were not suffering from mild flu symptoms.\n“These are people who are sick enough to see a doctor and the doctor was worried enough to actually swab the patient” to test for the virus, said Dr. Kwong. “We don’t know if these results apply to people who have milder infections.”\nSOURCE: bit.ly/2FU4ylA The New England Journal of Medicine, online January 24, 2018.\n ", "external_links": [], "published": "2018-01-25T00:08:00.000+02:00", "crawled": "2018-01-25T00:32:43.005+02:00", "highlightTitle": ""}