{"organizations": [], "uuid": "8236f1ecf05092f0bdf1e03a3035e32f3af687fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225221141&w=1200&r=LYNXMPEE0O1EA", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-brazil-politics-analysis/brazils-left-sticks-by-wounded-lula-no-plan-b-idUSKBN1FE2LD", "country": "US", "domain_rank": 408, "title": "Brazil's left sticks by wounded Lula; 'no Plan B'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T19:40:00.000+02:00", "replies_count": 0, "uuid": "8236f1ecf05092f0bdf1e03a3035e32f3af687fd"}, "author": "", "url": "https://www.reuters.com/article/us-brazil-politics-analysis/brazils-left-sticks-by-wounded-lula-no-plan-b-idUSKBN1FE2LD", "ord_in_thread": 0, "title": "Brazil's left sticks by wounded Lula; 'no Plan B'", "locations": [], "entities": {"persons": [{"name": "anthony", "sentiment": "negative"}, {"name": "lula", "sentiment": "negative"}, {"name": "luiz inacio lula da silva", "sentiment": "none"}, {"name": "gleisi hoffmann", "sentiment": "none"}, {"name": "eduardo simões", "sentiment": "none"}], "locations": [{"name": "brazil", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "workers party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRASILIA/SAO PAULO (Reuters) - Brazil’s Workers Party and labor leaders insisted on Thursday that left-wing hero Luiz Inacio Lula da Silva would be their candidate in this year’s presidential race, despite his failure to overturn a corruption conviction that will likely bar him.\nPolitical observers expect the Workers Party to back his candidacy for as long as it possibly can, as without the charismatic Lula on the campaign trail Brazil’s second largest party in Congress faces oblivion.\n“We are here to reaffirm Lula’s candidacy for president of Brazil. We have no Plan B. He will be our candidate,” party leader Senator Gleisi Hoffmann said at the country’s largest labor union headquarters.\nThe two-term former president, while popular, has slim chances of undoing Wednesday’s ruling by an appellate court. His exclusion raises the prospect of a right-leaning reformer winning the Oct. 7 election and sticking to Brazil’s austerity program.\nInvestors are betting it is game over for Brazil’s most influential politician and early front-runner. Sao Paulo’s stock market hit a new high after the decision and the currency strengthened from 3.20 to 3.14 reais to the dollar.\nBut Lula accepted the Workers Party nomination, which has to be formalized at a party convention, and told a rally in Sao Paulo that he would “fight to the end” to appeal against his conviction.\n“I want to be candidate to win the elections and govern this country,” he said to a crowd that chanted “Lula for president.”\nWorkers Party leaders called for a civil disobedience campaign to oppose his exclusion from the elections and said they would resist any move to arrest Lula, whose prison sentence was increased by the appeals court from nine to 12 years.\n“We need social confrontation to stop this coup. There has to be a rebellion by citizens,” said firebrand Workers Party Senator Lindbergh Farias.\nWith doubts about his ability to run, other parties will be reluctant to ally themselves with the PT, which could eventually be forced to back another candidate.\n“The 3-0 vote to condemn him and the increase in his sentence was a definitive shock to Lula’s political life. It ends it,” said Sergio Praça, a political scientist at FGV think tank in Sao Paulo.\nNOBODY LEFT ON THE LEFT The exclusion of Lula from the 2018 election would not only leave the Workers Party orphaned but also the Brazilian left.\n“There is nobody else on the left with a real chance for victory, and certainly nobody from the Workers Party,” Praça said. “There is nobody left on the left.”\nStill, some analysts said Lula, while down after the court verdict, was not entirely out, with consultancy Eurasia saying he has a roughly one-third chance of being able to run.\nIf Lula is ruled out, his party could ally itself with the center-left Democratic Labor Party (PDT), which stands to gain leftist backers for its candidate Ciro Gomes, a former governor of Ceará state.\nAnother left-of-center option is environmentalist Marina Silva, who has won more than 20 percent of the votes in the last two presidential elections on an anti-corruption platform.\nBut she publicly supported the conviction of Lula for taking a bribe and his party is unlikely to join forces with her.\nThe absence of Lula on the campaign trail is not expected to benefit far-right candidate Jair Bolsonaro, running second in polling and whose support is in part based on a fear of a Workers Party return to power.\nInstead it may open the field for more right of center candidates with clear market-friendly stances.\nThe strongest contender at this point is Sao Paulo governor Geraldo Alckmin, president of the Brazilian Social Democratic Party (PSDB), the country’s third largest party which privatized state companies in the 1990s and would continue that policy.\nOther potential candidates jockeying for position before the race kicks off are lower house Speaker Rodrigo Maia and Finance Minister Henrique Meirelles, a former banking executive and architect of Brazil’s economic recovery plan.\nMaia is a staunch backer of Meirelles’ efforts to overhaul Brazil’s costly social security system, the main cause of Brazil’s budget deficit, and both would ensure pension reform was completed if elected.\nAdditional reporting by Brad Brooks in São Paulo; Editing by Christian Plumb and Andrew Hay\n ", "external_links": [], "published": "2018-01-25T19:40:00.000+02:00", "crawled": "2018-01-25T19:52:17.000+02:00", "highlightTitle": ""}