{"organizations": [], "uuid": "b51991a9f12f5518b5eb4abba9fdacc19ca95cfd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/05/12/101662653-182561864.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/airbnbn-pushing-up-new-york-rent-study-claims.html", "country": "US", "domain_rank": 767, "title": "Airbnbn pushing up New York rent study claims", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-31T16:09:00.000+02:00", "replies_count": 0, "uuid": "b51991a9f12f5518b5eb4abba9fdacc19ca95cfd"}, "author": "David Reid", "url": "https://www.cnbc.com/2018/01/31/airbnbn-pushing-up-new-york-rent-study-claims.html", "ord_in_thread": 0, "title": "Airbnbn pushing up New York rent study claims", "locations": [], "entities": {"persons": [{"name": "airbnbn", "sentiment": "negative"}, {"name": "alexander spatari", "sentiment": "none"}, {"name": "airbnb", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "airbnb", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "hotel trades council", "sentiment": "none"}, {"name": "mcgill university", "sentiment": "none"}, {"name": "airbnb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Skyrocketing New York rents are down to the rise of the home-sharing service Airbnb, a new study has claimed.\nThe report, released Tuesday, analyzed Airbnb activity between September 2014 and August of 2017 and was published by McGill University, but commissioned by the Hotel Trades Council.\nThe study found Airbnb had removed between 7,000 and 13,500 units of housing stock from New York City's long-term rental market.\nIt calculated that by reducing supply, Airbnb activity had in fact increased median long-term rent in the city by 1.4 percent over three years \"resulting in a $380 rent increase for the median New York tenant looking for an apartment this year.\"\nThe study further claimed that in Manhattan the increase is more than $700.\nAirbnb has questioned the methodology, noting that the report uses \"available for rent\" instead of actual booked nights in determining that listings have been removed from the long-term market. Airbnb has argued that many people don't update their listing availability.\nUnder New York State's Multiple Dwelling Law, short-term rentals of fewer than 30 days are illegal in buildings with three or more units, unless the owner is present. Private room rentals would also be unlawful if the owner wasn't there.\nThe report estimated that given those laws, at least two-thirds of Airbnb revenue in New York is likely generated from illegal listings.\nIn response to that charge, Josh Meltzer, head of northeast policy at Airbnb said in a statement Tuesday that the home-sharing service actually supports a change in the law.\n\"Although inconvenient for this author's anti-home sharing bias, Airbnb supports legislation that would restrict home sharing to one single home,\" he said.\n\"This would finally allow enforcement to focus on illegal hotel operators while protecting regular New Yorkers who are trying to make some extra money to live in a city that gets more expensive by the year,\" he added.\nThe study also refreshed an earlier study which looked at listings in 72 predominately black neighborhoods across New York and found that three-quarters of the Airbnb hosts in those areas were white.\nThe latest study suggested that Airbnb \"continues to have a strongly racialized impact\" as the loss of housing, which it blamed on the company, was six times more likely to affect black New Yorkers.", "external_links": [], "published": "2018-01-31T16:09:00.000+02:00", "crawled": "2018-01-31T16:09:39.034+02:00", "highlightTitle": ""}