{"organizations": [], "uuid": "e25402df30b2b3a1ec35935475ac0b542f8ecace", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.goldreview.com/?feed=linkfeed", "section_title": "Gold Review » Gold Review", "url": "https://www.reuters.com/article/global-precious/precious-gold-picks-up-after-hitting-1-week-low-but-downside-risks-persist-idUSL8N1PP3OE", "country": "US", "domain_rank": 408, "title": "Gold picks up after hitting 1-week low but downside risks persist", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T16:05:00.000+02:00", "replies_count": 0, "uuid": "e25402df30b2b3a1ec35935475ac0b542f8ecace"}, "author": "cmullen", "url": "https://www.reuters.com/article/global-precious/precious-gold-picks-up-after-hitting-1-week-low-but-downside-risks-persist-idUSL8N1PP3OE", "ord_in_thread": 0, "title": "Gold picks up after hitting 1-week low but downside risks persist", "locations": [], "entities": {"persons": [{"name": "maytaal angel", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "fed", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 11:48 AM / in an hour PRECIOUS-Gold off highs as market braces for Trump speech, Fed meeting Reuters Staff 3 Min Read * Investors await Fed meeting for interest rate cues * Platinum's lengthy bear run shows signs of turning (Recasts throughout; updates prices, adds comment, NEW YORK to dateline) By Renita D. Young and Maytaal Angel NEW YORK/LONDON, Jan 30 (Reuters) - Gold slipped back to a one-week low on Tuesday as markets braced for U.S. President Donald Trump's annual State of the Union address and news on U.S. monetary policy. The speech and policy news will come amid positive consumer data and continuing fallout from a Republican memo alleging anti-Trump bias. \"A lot of this is repositioning for the State of the Union coming on tonight,\" said Josh Graves, senior commodities strategist at RJO Futures. \"And the talk of this memo that has damaging information in it has the market a little spooked.\" Spot gold was down 0.22 percent at $1,336.99 an ounce by 1:49 p.m. EST (1849 GMT), earlier touching a one-week low of $1,334.10. U.S. gold futures for February delivery settled down $4.90, or 0.4 percent, at $1,335.40 per ounce. Markets are also bracing for potentially hawkish language from the U.S. Federal Reserve, which ends its two-day policy meeting on Wednesday amid signs that U.S. economic growth is picking up steam. \"On Friday U.S. jobs data should confirm the strong picture for the U.S. economy, which speaks in favor of rate rises and a strong dollar, so in the short term gold is under pressure,\" said Mitsubishi analyst Jonathan Butler. He added, however, that the dollar is still \"very much in a long-term downtrend.\" Investors will be closely watching Trump's annual State of the Union speech for comments on the dollar. U.S. Treasury Secretary Steven Mnuchin gave dollar bears a boost last week with a tacit endorsement of a weak U.S. currency, though Trump later tried to row back from those comments. Gold hovered near its one-week low despite world equity markets taking their biggest two-day dive in six months, while the dollar index slipped back after climbing overnight. Rising bond yields and a sell-off in healthcare shares sent the U.S. stock market sliding, with the Dow Jones Industrial Average's 352-point tumble its steepest in eight months. Higher bond yields make gold a less attractive investment because it pays no interest. In other precious metals, silver dropped 0.3 percent at $17.11 an ounce after touching a six-day low. Palladium was down 3.1 percent at $1,052.20 an ounce after hitting a five-week low at $1,047.00. Platinum was down 0.9 percent at $995 an ounce after touching $987.49, a one-week low. A surge in platinum prices this month has helped the metal used in autocatalysts to break above a downward trendline in place since early 2013. (Additional reporting by Nallur Sethuraman; Editing by Susan Fenton and David Goodman)", "external_links": [], "published": "2018-01-30T16:05:00.000+02:00", "crawled": "2018-01-30T16:24:42.010+02:00", "highlightTitle": ""}