{"organizations": [], "uuid": "4bfba2f810b1c295f47a9e7138d18d15094c0d23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-bio-techne-acquires-atlanta-biologicals-inc.html", "country": "US", "domain_rank": 767, "title": "Bio-Techne Acquires Atlanta Biologicals Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-03T01:01:00.000+02:00", "replies_count": 0, "uuid": "4bfba2f810b1c295f47a9e7138d18d15094c0d23"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-bio-techne-acquires-atlanta-biologicals-inc.html", "ord_in_thread": 0, "title": "Bio-Techne Acquires Atlanta Biologicals Inc.", "locations": [], "entities": {"persons": [{"name": "charles r. kummeth", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "bio-techne corporation", "sentiment": "negative"}, {"name": "bio-techne acquires atlanta biologicals inc", "sentiment": "neutral"}, {"name": "atlanta biologicals, inc.", "sentiment": "none"}, {"name": "scientific ventures, inc.", "sentiment": "none"}, {"name": "atlanta biologicals", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS, Jan. 2, 2018 /PRNewswire/ -- Bio-Techne Corporation (NASDAQ: TECH) announced today that it has acquired all of the stock of Atlanta Biologicals, Inc. and its affiliated company, Scientific Ventures, Inc.. The transaction is financed through available cash on hand.\nCharles R. Kummeth, President and Chief Executive Officer of Bio-Techne, commented, \"Atlanta Biologicals is a great fit with the Bio-Techne product portfolio as we continue to expand our cell culture and tissue regeneration capabilities. Many of our products are used in tissue culture applications and the Atlanta Biologicals fetal bovine serum (FBS) product line strengthens and complements our current tissue culture reagents offering and furthers our efforts to provide more complete solutions to our research customers. With the increasing interest in 3D cell cultures and other cell based clinical applications, we believe there is value in providing customers alternative and reliable sources of high quality FBS and other tissue culture reagents. Having better tools to study cell behavior in physiologically relevant environments and high quality reagents increases researchers' confidence in the experimental findings.\"\nAtlanta Biologicals President, Renate Gerle, added, \"We are confident with the strategic fit between the two companies given our shared commitment to providing quality products and excellent customer service. Atlanta Biologicals is pleased to have Bio-Techne as a partner, enabling us to expand and enhance our products offering. Bio-Techne's resources and additional market channels will have a positive impact on our business and allow us to serve our customers more efficiently both in the North America and globally.\"\nAtlanta Biologicals was founded in 1992 and has focused on supplying cell culture sera, media and reagents for the life science research market. It is located in Flowery Branch, Georgia and has approximately 25 employees. The acquisition is expected to be slightly accretive to Bio-Techne's adjusted earnings per share for its fiscal year 2018.\nFredrikson & Byron, P.A. is serving as Bio-Techne's legal counsel. Benchmark International acted as financial advisor to Atlanta Biologicals. Morris, Manning & Martin LLP served as legal counsel to Atlanta Biologicals.\nForward-Looking Statements\nOur press releases may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act. Such statements involve risks and uncertainties that may affect the actual results of operations. Forward-looking statements in this press release include statements regarding our belief about the market applications and impact of our acquisition of Atlanta Biologicals and our ability to derive advantages from this acquisition as we integrate it into our business. The following important factors, among others, have affected and, in the future could affect, our actual results: the effect of new branding and marketing initiatives, the integration of new leadership, the introduction and acceptance of new products, the levels and particular directions of research and product development by our customers, the impact of the growing number of producers of biotechnology research and diagnostics products and related price competition, general economic conditions, the impact of currency exchange rate fluctuations, and the costs and results of our research and product development efforts and those of companies in which we have invested or with which we have formed strategic relationships.\nFor additional information concerning such factors, see the section titled \"Risk Factors\" in the Company's annual report on Form 10-K and quarterly reports on Form 10-Q as filed with the Securities and Exchange Commission. We undertake no obligation to update or revise any forward-looking statements we make in our press releases due to new information or future events. Investors are cautioned not to place undue emphasis on these statements.\nBio-Techne Corporation (NASDAQ: TECH) is a leading developer and manufacturer of high quality purified proteins––notably cytokines and growth factors, antibodies, immunoassays, as well as biologically active small molecule compounds --- which are sold to biomedical researchers and clinical research laboratories; these operations constitute the core Biotechnology Division, headquartered in Minneapolis, Minnesota. The Protein Platform Division manufactures innovative protein analysis tools under the ProteinSimple brand name that greatly automate western blotting and immunoassay practices. The Diagnostic Division manufactures FDA-regulated controls, calibrators, blood gas and clinical chemistry controls for OEM and clinical customers. Bio-Techne products assist scientific investigations into biological processes and the nature and progress of specific diseases. They aid in drug discovery efforts and provide the means for accurate clinical tests and diagnoses. With thousands of products in its portfolio, Bio-Techne generated approximately $563 million in net sales in fiscal 2017 and has approximately 1,800 employees worldwide. For more information on Bio-Techne and its brands, please visit www.bio-techne.com .\nContact:\nDavid Clair, Investor Relations\n(646) 277-1266\nView original content with multimedia: http://www.prnewswire.com/news-releases/bio-techne-acquires-atlanta-biologicals-inc-300576664.html\nSOURCE Bio-Techne Corporation", "external_links": ["http://www.prnewswire.com/news-releases/bio-techne-acquires-atlanta-biologicals-inc-300576664.html", "http://www.bio-techne.com/"], "published": "2018-01-03T01:01:00.000+02:00", "crawled": "2018-01-03T02:10:20.001+02:00", "highlightTitle": ""}