{"organizations": [], "uuid": "925dc609689fe114f1fe8f6179d0a0e66896286a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/deals-day/deals-of-the-day-mergers-and-acquisitions-idUSL4N1P43LC", "country": "US", "domain_rank": 408, "title": "Deals of the day-Mergers and acquisitions", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T13:01:00.000+02:00", "replies_count": 0, "uuid": "925dc609689fe114f1fe8f6179d0a0e66896286a"}, "author": "", "url": "https://www.reuters.com/article/deals-day/deals-of-the-day-mergers-and-acquisitions-idUSL4N1P43LC", "ord_in_thread": 0, "title": "Deals of the day-Mergers and acquisitions", "locations": [], "entities": {"persons": [{"name": "abertis", "sentiment": "none"}, {"name": "fosun", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "travelfactory", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "baoneng", "sentiment": "none"}, {"name": "compagnie des alpes", "sentiment": "none"}, {"name": "altice nv", "sentiment": "none"}, {"name": "gopro inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "kenon holdings ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 11:01 AM / in 10 minutes Deals of the day-Mergers and acquisitions Reuters Staff 4 Min Read \n(Adds Spartoo, Union Properties, Oetinger Aluminium, Blackstone, Toronto-Dominion Bank, Sodexo, Julius Baer, Mongolian Copper) \nJan 9 (Reuters) - The following bids, mergers, acquisitions and disposals were reported by 2100 GMT on Tuesday: \n** Continental AG is still looking at its corporate structure as part of a review launched more than a year ago, a source close to the matter said after a media report on a possible breakup of the car parts maker pushed its shares to a record high. \n** GoPro Inc would be willing to partner with a larger sector player but is not actively engaged in a sale, the action camera-maker said. \n** French online shoe and fashion retailer Spartoo has entered exclusive negotiations to buy rival shoe brand Andre from debt-laden clothing retailer Vivarte, the company said. \n** Dubai real estate developer Union Properties is in the final stage of selling its entire stake in Emicool, a district cooling service provider, the company said. \n** German aluminium producer Oetinger Aluminium has been sold to the Czech Republic-based Metal Trade Comax Group for an undisclosed sum, Oetinger said. \n** A Blackstone Group affiliate is to buy Pure Industrial Real Estate Trust in an all-cash deal valued at about C$2.48 billion ($2 billion), the Canadian REIT said. \n** Toronto-Dominion Bank, Canada’s No. 2 bank, said it bought Layer 6 Inc, an artificial intelligence (AI) company for an undisclosed sum. \n** French services and catering group Sodexo has signed a global partnership deal with Huawei, in the latest major Chinese contract for a French blue-chip company struck during President Emmanuel Macron’s trip to China. \n** Telecoms and cable group Altice NV, is separating its U.S. and European operations to try to reassure investors alarmed by its high debt and low revenue generation, especially in its core French telecoms business. \n** Swiss private bank Julius Baer said it bought the 20 percent in Italian wealth management firm Kairos Investment Management SpA it did not already own for 96 million euros ($114 million). \n** Spain’s market regulator stood by its 2017 authorisation of a 15.6 billion euro ($18.7 billion) bid by Italy’s Atlantia for Spanish rival Abertis, quashing a Spanish government request to revoke the approval. \n** French ski resort operator Compagnie des Alpes, which is hoping to sell a stake to Chinese conglomerate Fosun and other potential investors, announced purchase of a majority stake in Travelfactory. \n** Israel’s Kenon Holdings Ltd, said a China-based investor related to the Baoneng group has acquired 51 percent of its Qoros Automobile joint venture after the deal obtained approval from China’s Ministry of Commerce. \n** Moldovan businessman Anatolie Stati will ask bailiffs to sell a $5.2 billion stake in the Kashagan oil field owned by a Kazakh sovereign wealth fund if Astana refuses to pay a $500 million arbitration award, Stati’s spokeswoman said. \n** The administrator of Niki said he would press ahead with an agreed sale of the insolvent Austrian airline to British Airways owner IAG after a German court ruling fanned concern that the deal could unravel. \n** Mongolian Copper Corporation (MCC) said it will fight a decision by the Mongolian government to repurchase its stake in one of Asia’s biggest copper mines for about $400 million after a failed attempt to nationalise it. (Compiled by Ahmed Farhatha and Uday Sampath in Bengaluru)", "external_links": [], "published": "2018-01-09T13:01:00.000+02:00", "crawled": "2018-01-09T13:18:45.019+02:00", "highlightTitle": ""}