{"organizations": [], "uuid": "66f6ec80030faacc58fef1f84f7517a408bf4ec8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/adobe-best-workplaces-tech-2018.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/18/ces-2018-tech-artificial-intelligence/", "country": "US", "domain_rank": 1196, "title": "Artificial Intelligence, Self-Driving Cars: Big Lessons at CES | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.981, "site_type": "news", "published": "2018-01-18T02:00:00.000+02:00", "replies_count": 0, "uuid": "66f6ec80030faacc58fef1f84f7517a408bf4ec8"}, "author": "Jay Samit", "url": "http://fortune.com/2018/01/18/ces-2018-tech-artificial-intelligence/", "ord_in_thread": 0, "title": "Artificial Intelligence, Self-Driving Cars: Big Lessons at CES | Fortune", "locations": [], "entities": {"persons": [{"name": "jay samit", "sentiment": "negative"}], "locations": [{"name": "las vegas", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Jay Samit January 18, 2018 \nEach January when nearly two hundred thousand attendees descend upon Las Vegas for CES , the world’s largest tech pilgrimage can overwhelm the senses with a myriad of sights and sounds emanating from 2.6 million square feet of new gadgets designed to delight savvy consumers. One can count on televisions to be bigger and thinner, appliances to be smarter, and personal computers to be faster. \nIn all these categories, the 2018 Consumer Electronics Show’s four thousand exhibitors did not disappoint. \nWith 70- and 80- inch HDTVs so 2017, the largest screen display was a new modular 146” video wall that is perfect for any home with a blank nine-foot wide wall. Don’t have a lot of space? No problem, another concept on display was a 65-inch OLED television that rolls up like a newspaper. (Remember those?) Still cramped for space? More than a dozen vendors showcased virtual reality headsets that can transform any room into a multi-sensory, immersive theater-like experience. \nNot to be outdone by the living room’s televisions, standard home appliances such as refrigerators, washing machines, and wall ovens got together and starting talking to each other. Smart homes, powered by an ever-growing assortment of the Internet of things (IoT) consumer devices, can now be controlled by voice commands. New products enable your mixer to tell you when you’ve put the right amount of flour into the bowl and let your oven know when to start preheating for your soon-to-be- ready cake batter. No time for a cake? Just let your oven scan the barcode on your frozen pizza’s box, and it will take care of the rest (while letting the refrigerator know to order another one). \nYou’ll never feel alone at home again, as voice interactive virtual assistant bots debuted at CES on dishwashers, alarm clocks, bathroom mirrors, security cameras and even augmented reality smart glasses to which you can talk. \nThis year, the biggest trend in consumer electronics that you couldn’t see walking the convention center floor is voice. Just a mere seven years after the implementation of voice on smart phones launched, the world of consumer electronics is abuzz with voice command products for every room of the house. Voice recognition is the most intuitive of machine-human interfaces and one of the most reliable. Recent studies show that artificial intelligence voice recognition systems now exceed humans in accuracy for transcription. \nAutonomous and semi-autonomous vehicles from many of the world’s biggest automakers were on display in Vegas as well as a self-driving taxi van service. As with the consumer electronics companies, auto manufacturers are embedding voice commands into their new models in anticipation of fully autonomous vehicles controlled by their owner’s voice. And of course, your new car will be able to communicate with the wall oven to make sure that your pizza is piping hot the moment you walk in the door at the end of a long day at the office talking to your smartphone, tablet, and PC. Based on the products unveiled at CES 2018, in the near future voice will be how we interact with our new autonomous cars and smart homes. Now, if only I could get my kids to listen too. \nJay Samit is independent vice chairman of Deloitte’s Digital Reality practice and author of the bestselling book Disrupt You! SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-18T02:00:00.000+02:00", "crawled": "2018-01-19T16:13:10.015+02:00", "highlightTitle": ""}