{"organizations": [], "uuid": "26d4e76ac42aecaed82693288f3a9d08ad16cac9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219016567&w=1200&r=LYNXMPEE020D6", "site_section": "https://www.reuters.com/finance/currencies", "section_title": "Currency Converter, Currencies News | Reuters.com", "url": "https://www.reuters.com/article/uk-britain-sterling-open/sterling-holds-near-three-month-highs-ahead-of-construction-pmi-idUSKBN1ES0JE", "country": "US", "domain_rank": 408, "title": "Sterling slips from three-month high on lack of new catalysts", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T17:20:00.000+02:00", "replies_count": 0, "uuid": "26d4e76ac42aecaed82693288f3a9d08ad16cac9"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-britain-sterling-open/sterling-holds-near-three-month-highs-ahead-of-construction-pmi-idUSKBN1ES0JE", "ord_in_thread": 0, "title": "Sterling slips from three-month high on lack of new catalysts", "locations": [], "entities": {"persons": [], "locations": [{"name": "london", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Sterling slipped from a three-month high above $1.36 on Wednesday, with currency traders cautious about pushing the pound too far without any new catalysts.\nThe pound had earlier reached as high as $1.3614, its strongest since Sept. 20 and less than half a cent away from the September peak of $1.3659, its strongest since the referendum on European Union membership in June 2016.\nBut having appeared unruffled by a survey showing growth in Britain’s construction sector slowed last month, sterling weakened during the day as the dollar climbed broadly, at once point dipping below $1.35, down 0.7 percent on the day.\nThe pound last year recorded its best annual performance against the dollar since 2009, with an almost 10 percent rise amid broad dollar weakness. But it is still around 10 percent down against the dollar since the vote for Brexit.\nInvestors say that despite some progress in Brexit talks towards the end of last year, sterling needs stronger signs that Britain will get a transition deal and a favourable trade deal with the EU before it can climb further.\n“Sterling is lacking any major catalyst in any direction,” said ING currency strategist Viraj Patel.\n“When you’re gravitating close to that high around $1.36, you need a meaningful sterling catalyst to break that. We do see that happening over the next few months, but not necessarily any time soon,” he added.\nAgainst the euro, sterling was 0.2 percent down at 88.92 pence.\nEarlier, the IHS Markit/CIPS UK Construction PMI slipped to 52.2 after hitting a five-month high of 53.1 in November, the first slowdown in growth since September.\nThe PMI came in just below a median forecast of 52.5 in a Reuters poll of economists.\nLee Hardman, a London-based currency analyst at MUFG, said the PMI data had little impact on the bigger picture of the economic growth outlook for the UK.\n“We are focusing on Brexit negotiations. We will be looking for signs of progress,” Hardman said.\n“We think there is a lot of pessimism priced into the pound,” he said, predicting a move higher to $1.40 this year.\nThe PMI for Britain’s dominant services sector is due to be released on Thursday.\nFor a graphic on sterling and gilt yields, click - bit.ly/2dgAXn1\nFor a graphic on world FX rates in 2017, click - tmsnrt.rs/2egbfVh\nFor a graphic on trade-weighted sterling since Brexit vote, click - tmsnrt.rs/2hwV9Hv\nReporting by Tommy Wilkes and Jemima Kelly; Editing by Jeremy Gaunt and Keith Weir\n ", "external_links": ["http://bit.ly/2dgAXn1", "http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html", "http://tmsnrt.rs/2hwV9Hv"], "published": "2018-01-03T17:20:00.000+02:00", "crawled": "2018-01-03T19:39:51.014+02:00", "highlightTitle": ""}