{"organizations": [], "uuid": "d3cc711fe56bf9d149fd3a090095d008db44a716", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-908545334.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/23/2018-academy-award-nominations-studios-fox/", "country": "US", "domain_rank": 1196, "title": "Oscar Nominations 2018: Fox Leads With 'The Shape of Water' | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.457, "site_type": "news", "published": "2018-01-23T02:00:00.000+02:00", "replies_count": 0, "uuid": "d3cc711fe56bf9d149fd3a090095d008db44a716"}, "author": "Tom Huddleston Jr.", "url": "http://fortune.com/2018/01/23/2018-academy-award-nominations-studios-fox/", "ord_in_thread": 0, "title": "Oscar Nominations 2018: Fox Leads With 'The Shape of Water' | Fortune", "locations": [], "entities": {"persons": [{"name": "guillermo del toro", "sentiment": "negative"}, {"name": "tom huddleston jr", "sentiment": "neutral"}, {"name": "fox searchlight", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}], "locations": [{"name": "logan", "sentiment": "none"}, {"name": "missouri", "sentiment": "none"}], "organizations": [{"name": "21st century fox", "sentiment": "none"}, {"name": "academy of motion picture arts and science", "sentiment": "none"}, {"name": "post", "sentiment": "none"}, {"name": "fox searchlight pictures", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Tom Huddleston Jr. January 23, 2018 \nDirector Guillermo Del Toro’s The Shape of Water landed a whopping 13 Oscar nominations on Tuesday morning. The sci-fi love story about an aquatic creature and a mute janitor easily leads a pack of 2018 Academy Award nominees that also includes films like Three Billboards Outside Ebbing, Missouri and The Post . \nWhat do each of those three films have in common? They’re all affiliated with a subsidiary of 21st Century Fox, which tallied a total of 27 nods when the Academy of Motion Picture Arts and Science announced the latest Oscar nominations on Tuesday morning. The Shape of Water and Three Billboards Outside Ebbing, Missouri were both distributed by Fox Searchlight Pictures, the indie film arm of 21st Century Fox. (Fox Searchlight scored 20 Oscar nominations in total between those two films, with drama-comedy Three Billboards receiving seven nods.) \nAnd, 20th Century Fox studios was among the producers and distributors of the historical drama The Post (nominated twice), as well as fellow nominees like the superhero drama Logan and the animated features Ferdinand and The Boss Baby . \nFox and its subsidiaries easily dominated the Oscars race this year, topping rival companies like Comcast , which can claim 18 total Academy Award nominations between its Focus Features ( Darkest Hour ) and Universal Pictures ( Get Out ) subsidiaries. Time Warner’s Warner Bros. landed 14 Oscar nominations on Tuesday, while Walt Disney received 10 nods. \nGet Data Sheet , Fortune’s technology newsletter. \nOf course, Oscar wins don’t always correlate with box office success , and that’s evident again this year, as Fox finished 2017 fourth out of the above-mentioned companies in terms of total domestic box office gross, with $1.3 billion, according to Box Office Mojo. Despite all of their Oscar nominations, Fox Searchlight’s The Shape of Water and Three Billboards Outside Ebbing, Missouri have so far pulled in just under $93 million at the global box office between them. \nMeanwhile, Disney easily topped all other studios at the 2017 box office, with more than $2.4 billion grossed domestically, thanks to blockbusters like Star Wars: The Last Jedi and Beauty and the Beast (both of which received a handful of Oscar nominations). And, lest we forget, Disney could end up the proud owner of all of Fox’s critically-acclaimed movie studios if the company’s planned $52 billion acquisition of the majority of 21st Century Fox’s assets can obtain the necessary regulatory approvals . Who says money can’t buy respect? SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-23T02:00:00.000+02:00", "crawled": "2018-01-24T06:07:30.014+02:00", "highlightTitle": ""}