{"organizations": [], "uuid": "259362b8912994f8fd94c32215ea91a087cc828c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-regency-centers-updates-2017-and-introduces-2018-earnings-guidance.html", "country": "US", "domain_rank": 767, "title": "Regency Centers Updates 2017 and Introduces 2018 Earnings Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.82, "site_type": "news", "published": "2018-01-11T16:00:00.000+02:00", "replies_count": 0, "uuid": "259362b8912994f8fd94c32215ea91a087cc828c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-regency-centers-updates-2017-and-introduces-2018-earnings-guidance.html", "ord_in_thread": 0, "title": "Regency Centers Updates 2017 and Introduces 2018 Earnings Guidance", "locations": [], "entities": {"persons": [], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "jacksonville", "sentiment": "none"}], "organizations": [{"name": "regency centers corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JACKSONVILLE, Fla.--(BUSINESS WIRE)-- Regency Centers Corporation (“Regency” or the “Company”) (NYSE: REG) today announced updated 2017 and initial full-year 2018 earnings guidance (“Guidance”). Selected items are listed herein and a complete listing of guidance components is available on the Company’s website at investors.regencycenters.com .\nUpdated Full-Year 2017 Guidance Previous\nGuidance\nUpdated Guidance Net Income Attributable to Common Stockholders (“Net Income”) $0.76 – $0.81 $1.00 – $1.02 NAREIT Funds From Operations (“NAREIT FFO”) per diluted share $3.00 – $3.05 $3.09 – $3.11 Core Funds From Operations (“Core FFO”) per diluted share $3.66 – $3.70 $3.68 – $3.70 Same Property Net Operating Income (“SPNOI”) Growth excluding termination fees (pro-rata) 3.2% – 4.0% +/- 3.6% Initial Full-Year 2018 Guidance\nNet Income Attributable to Common Stockholders (“Net Income”) $1.47 – $1.56 NAREIT Funds From Operations (“NAREIT FFO”) per diluted share $3.73 – $3.82 Core Funds From Operations (“Core FFO”) per diluted share $3.76 – $3.83 Operating Funds From Operations (“Operating FFO”) per diluted share $3.48 – $3.54 Same Property Net Operating Income (“SPNOI”) Growth excluding termination fees (pro-rata) 2.25% – 3.25% Updated 2017 and Initial 2018 Guidance\nNet Income\nThe Company’s updated 2017 Net Income guidance includes incurred costs of approximately $0.51 per diluted share associated with the merger of Regency and Equity One, Inc. No additional costs are anticipated in 2018. 2018 Net Income is expected to be $1.47 to $1.56 per diluted share.\nNAREIT FFO\nThe Company’s updated 2017 NAREIT FFO guidance includes incurred costs of approximately $0.51 per diluted share associated with the merger of Regency and Equity One, Inc. No additional transaction costs are anticipated in 2018. The increase in 2017 NAREIT FFO compared to previous guidance is primarily attributed to recognizing the tax benefit from adjustment to the deferred tax liability balances in the Company’s taxable REIT subsidiaries as a result of the recent tax law changes. 2018 NAREIT FFO is expected to be $3.73 to $3.82 per diluted share.\nCore FFO and Introduction of Operating FFO\n2017 Core FFO is now expected to be in the range of $3.68 to $3.70 per diluted share. The Company expects 2018 Core FFO to be $3.76 to $3.83 per diluted share.\nIn 2017, Regency completed its merger with Equity One. Due to purchase accounting adjustments required with the merger under Accounting Standards Codification 805, specifically related to the requirement to mark-to-market all Equity One leases or approximately 35% of Regency’s total rent, non-cash accounting adjustments will have a disproportionate impact on earnings. Regency management operates its business and makes financial decisions based upon earnings before the impact of these non-cash accounting adjustments. Therefore, Regency is introducing Operating Funds From Operations (“Operating FFO”), an earnings metric used by the Company to measure earnings growth.\nOperating FFO will continue to exclude certain non-comparable items that affect the Company’s period-over-period performance consistent with the existing definition of Core FFO. The non-cash items that will be excluded from NAREIT FFO in the determination of Operating FFO are amortization of above and below market rent, straight-line rent and amortization of mark-to-market debt adjustments. The Company will provide guidance on Operating FFO on a go-forward basis. 2018 Operating FFO is expected to be $3.48 to $3.54 per diluted share.\nAdditional detail including a 2018 roll forward of Core FFO, a reconciliation of Operating FFO, and an Operating FFO historical lookback is provided in the guidance supplemental package on the Company’s website.\nUpdate on Investment Activity\nUpdate on 2017 Investment Activity\nDuring fourth quarter 2017, the Company closed on approximately $150 million of acquisitions.\nScripps Ranch Marketplace (San Diego, CA) - In December, Regency acquired Scripps Ranch Marketplace, a 132,000 square foot neighborhood shopping center anchored by Vons for $81.6 million. Roosevelt Square (Seattle, WA) – In December, the Company closed on Roosevelt Square, a 150,000 square foot infill retail center anchored by Whole Foods Market for $68.3 million.\nDuring the fourth quarter of 2017, Regency sold five shopping centers, generating approximately $103 million of gross proceeds. Dispositions included in previously released 2017 disposition guidance that did not close as of year-end are included in 2018 disposition guidance and are now expected to close in early 2018.\nDuring the fourth quarter of 2017, Regency started the development of two projects, with the Company’s share of net estimated development costs totaling $39 million. The first project, Midtown East, is a 174,000 square foot, Wegmans anchored shopping center located in Raleigh, NC. The second development, Indigo Square, is a 51,000 square foot Publix Greenwise anchored shopping center located in Charleston, SC.\nInvestment Activity Subsequent to Year-end\nIn 2018, Regency has closed on approximately $34 million of acquisitions to date and started $31 million of developments.\nBallard Blocks I & II (Seattle, WA) - In January 2018, the Company acquired a 50% equity interest in Ballard Blocks I, an operating 132,000 square foot shopping center, anchored by Trader Joe’s, for $27.3 million. Regency also acquired a 50% interest in adjacent land, and concurrently announced the start of Ballard Blocks II, an 114,000 square foot joint venture development anchored by PCC Community Markets. Regency’s pro-rata share of estimated development costs in Ballard II is $31.1 million. The District at Metuchen (Metuchen, NJ) – In January 2018, Regency and a co-investment partner acquired District at Metuchen, a 67,000 square foot Whole Foods anchored shopping center located in the New York metro area for a gross purchase price of $33.8 million. The Company’s share of the purchase price was $6.8 million.\nCapital Markets\nEquity Offerings\nAs previously disclosed, on December 14, 2017 the final settlement of the Company’s forward sale agreement occurred. Regency received approximately $89.1 million of net proceeds after adjustments for interest, dividends and the underwriters’ discount but before deducting offering expenses, by delivering 1,250,000 shares of the Company’s common stock.\n2018 Investor Day\nThe Company will host its 2018 Investor Day on Thursday, January 11, 2018 at 12:30 p.m. ET. Webcast information is available on the Company’s website at investors.regencycenters.com .\nReconciliation of Net Income Attributable to Common Stockholders to NAREIT FFO, Core FFO and Operating FFO\nFull Year Full Year Reconciliation of Net Income to Operating FFO\n2017 2018 Net income attributable to common stockholders $ 1.00 1.02 $ 1.47 1.56 Adjustments to reconcile net income to NAREIT FFO: Depreciation and amortization 2.28 2.28 2.26 2.26 Gain on sale of operating properties (0.19 ) (0.19 ) 0.00 0.00 NAREIT Funds From Operations $ 3.09 3.11 $ 3.73 3.82 Adjustments to reconcile NAREIT FFO to Core FFO: Development pursuit costs 0.00 0.00 0.01 0.01 Gain on sale of land (0.03 ) (0.03 ) 0.00 0.00 Provision for income taxes (0.06 ) (0.06 ) 0.00 0.00 Early extinguishment of debt 0.08 0.08 0.00 0.00 Merger related costs 0.51 0.51 0.00 0.00 Preferred redemption costs 0.08 0.08 0.00 0.00 Hurricane los", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestors.regencycenters.com%2Fevents-and-presentations%2Fevents&esheet=51741388&newsitemid=20180111005113&lan=en-US&anchor=investors.regencycenters.com&index=2&md5=99c331c040dd2954d0bdb8297eb060b3", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestors.regencycenters.com%2F&esheet=51741388&newsitemid=20180111005113&lan=en-US&anchor=investors.regencycenters.com&index=1&md5=7b32cf3e5ff02230a9663550769f2891", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.regencycenters.com%2F&esheet=51741388&newsitemid=20180111005113&lan=en-US&anchor=regencycenters.com&index=3&md5=0e2005878cad09d40236d780fe305720", "http://www.businesswire.com/news/home/20180111005113/en/"], "published": "2018-01-11T16:00:00.000+02:00", "crawled": "2018-01-11T19:55:11.007+02:00", "highlightTitle": ""}