{"organizations": [], "uuid": "d3b205d98b4323f7d4132244081be82d0fd3862b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-southkorea-usa-fta/south-korea-sees-speedy-trade-talks-with-u-s-but-uphill-battle-ahead-idUSKBN1EX0M2", "country": "US", "domain_rank": 408, "title": "South Korea sees speedy trade talks with U.S., but 'uphill battle' ahead", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:22:00.000+02:00", "replies_count": 0, "uuid": "d3b205d98b4323f7d4132244081be82d0fd3862b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-southkorea-usa-fta/south-korea-sees-speedy-trade-talks-with-u-s-but-uphill-battle-ahead-idUSKBN1EX0M2", "ord_in_thread": 0, "title": "South Korea sees speedy trade talks with U.S., but 'uphill battle' ahead", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "kim hyun-chong", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OSONG, South Korea (Reuters) - South Korea’s trade ministry said on Monday it anticipates an “uphill battle” to revise its bilateral trade deal with the United States, but it expects Washington to proceed with the talks in a speedy manner.\nTrade Minister Kim Hyun-chong said that in the first round of talks in Washington on Friday, the U.S. focused on eliminating non-tariff barriers in the auto sector.\nDisagreements over the trade pact that became effective in 2012 risk distancing Seoul and Washington at a time when North Korea is seen trying to create a fissure in the alliance.\nThe talks stem from President Donald Trump’s unhappiness with the existing pact. In April, Trump told Reuters he would either renegotiate or terminate what he called a “horrible” trade deal that has doubled the U.S. goods trade deficit with South Korea since 2012.\nOn Monday, Kim told reporters that he expects “an uphill battle for the talks. There is lots of work to do during a short period of time.”\nHe said he expected Trump’s administration to step up protectionism moves to rally domestic support this year.\nBut South Korea’s trade ministry said that while Washington seeks to significantly change the North American Free Trade Agreement with Mexico and Canada, the U.S. wants a “partial revision” of its deal with Seoul, which will speed up the talks.\n“They are trying to take a different approach on KORUS FTA from that on the NAFTA,” Yoo Myung-hee, a director general, told reporters.\nYoo, who led the latest trade talks with the United States, also said “all types of auto issues were raised” in Washington, without giving details.\nA top priority for the Americans is maintaining a tariff of 25 percent on imports of Korean pickup trucks, which the existing deal envisaged being phased out from 2019, sources have said.\nSouth Korea’s vehicle safety and emissions rules, as well as U.S. content requirements for South Korean autos were also expected to up for negotiation.\nDuring the first round of talks, South Korea raised issues regarding ”surging U.S. import restrictions” such as safeguard measures or antidumping duties against South Korean goods including washing machines, steel products and solar panels, Kim said.\n“The talks are progressing in the right direction. But it is difficult to predict how the negotiations will unfold,” he said.\nReporting by Hyunjoo Jin; Editing by Richard Borsuk & Simon Cameron-Moore\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T16:22:00.000+02:00", "crawled": "2018-01-09T17:08:03.013+02:00", "highlightTitle": ""}