{"organizations": [], "uuid": "be4450a20f30fca4602dea35bd3ffd124d00c6e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219504334&w=1200&r=LYNXMPEE04088", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/forex-poll-asia/asia-currencies-to-pare-2017-gains-but-growth-to-cushion-them-reuters-poll-idINKBN1EU0D9", "country": "US", "domain_rank": 408, "title": "Asia currencies to pare 2017 gains but growth to cushion them: Reuters poll", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T06:44:00.000+02:00", "replies_count": 0, "uuid": "be4450a20f30fca4602dea35bd3ffd124d00c6e0"}, "author": "", "url": "https://in.reuters.com/article/forex-poll-asia/asia-currencies-to-pare-2017-gains-but-growth-to-cushion-them-reuters-poll-idINKBN1EU0D9", "ord_in_thread": 0, "title": "Asia currencies to pare 2017 gains but growth to cushion them: Reuters poll", "locations": [], "entities": {"persons": [{"name": "vivek mishra", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "federal reserve", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BENGALURU (Reuters) - Asian currencies are set to pare gains this year that they made in 2017 as the Federal Reserve raises interest rates further and Asian central banks proceed cautiously, cushioned by solid growth expectations, a Reuters poll showed.\nA man counts his currency after buying food from a street side restaurant in New Delhi, India, February 29, 2016. REUTERS/Adnan Abidi/Files After four years of depreciation, Asia FX bounced back in 2017 owing in part to a rebound in exports, a synchronised global recovery, and investors reaching again for more risk.\nThe South Korean won - among the best performers in Asia last year - rose over 11 percent against the dollar, while others have all appreciated more than 6 percent.\nBut according to over 60 foreign exchange strategists polled this week, most major Asian currencies will slip back a few percentage points by the end of this year. Only some are expected to make modest gains.\n“How Asian currencies fare in 2018 depends on the effects of policy normalisation in the major advanced economies on global liquidity and ultimately on portfolio flows to Asia; and a strengthening and broadening in Asian economic growth with export recovery spilling over into domestic demand,” wrote strategists at ANZ in their 2018 FX outlook note.\n“We see growth winning out in the end, though the currency moves in the region will be more diffused with growth-sensitive currencies outperforming, while high yielding currencies and those with external deficits underperforming.”\nThe dollar index, which measures the greenback against a basket of six currencies, lost about 10 percent in 2017 owing to uncertainty over whether President Donald Trump’s administration would be able to pass sweeping tax cuts.\nDespite that success just before the end of 2017, traders remain unsure about the economic impact of those cuts, which will cost over 1 trillion in additional borrowing over a decade.\nThe greenback’s ability to recover losses made in 2017 in the current year depends on the Fed’s interest rate pathway.\nDespite the Fed hiking rates three times last year, the benchmark 10-year Treasury yield failed to rise, ending 2017 at 2.41 percent, a tad lower than 2016’s close of 2.43 percent.\nChinese 100 yuan banknotes are seen on a counter of a branch of a commercial bank in Beijing, China, March 30, 2016. REUTERS/Kim Kyung-Hoon/Files But if yields go up in 2018 on the back of expected further policy tightening by the Fed, Asian currencies could start to lag as investors rebalance their portfolios.\nAfter gaining over 6 percent last year, China’s yuan is forecast to depreciate slightly to 6.60 per dollar in six months and to 6.60 by end-2018, from Thursday’s close of 6.49, the poll showed.\nThe yuan rose to its firmest against the U.S. dollar in nearly four months on Tuesday, breaching a key threshold, supported by a stronger fixing and broad dollar weakness.\n“During the recent phase of U.S. dollar weakness, the government has allowed a strong appreciation against the dollar, while the CNY has moved more or less sideways against the currency basket since April,” said Ulrich Leuchtmann, research head at Commerzbank in a note to clients.\nA South Korea won note is seen in this illustration photo May 31, 2017. REUTERS/Thomas White/Illustration/Files On Wednesday, the People’s Bank of China allowed the yuan mid-point reference rate to appreciate to its highest since May 2016 of 6.49 per dollar, which is 6 percent more than its closing value that year.\n“The volatility in USD/CNY is ... likely to remain higher in the future. The government is likely to react more sensitively to a CNY devaluation than to an appreciation, in order to prevent a capital flight from flaring up again after it was only stopped by extensive controls on capital movements in 2015 and 2016,” Leuchtmann said.\nIndia’s rupee is also forecast to depreciate marginally against the dollar, to 64.50 per dollar in six months and 65.00 in a year, compared with Thursday’s close of 63.39.\n“If current account deficits were to get too large, India could be vulnerable to sudden episodes of panic by foreign investors that could lead to sharp declines in the value of the Indian rupee,” said Wells Fargo strategist Erik Nelson.\n“However, we think for the medium to long-term the outlook is pretty constructive,” said Nelson, who is optimistic that India’s economy will perform better after a slowdown last year.\nThat was induced in part by a shock removal of most of India’s currency in circulation announced in late 2016, as well as the implementation of a new national Goods and Services Tax.\n“We did have some disruptions initially, but now I think we are probably going to start to reap the rewards, or benefits of those reforms, particularly the GST tax,” Nelson added.\nPolling by Shaloo Shrivastava and Khushboo Mittal; Editing by Robin Pomeroy\n ", "external_links": [], "published": "2018-01-05T06:44:00.000+02:00", "crawled": "2018-01-05T07:06:07.008+02:00", "highlightTitle": ""}