{"organizations": [], "uuid": "9eb1597b6198278ad52e71964fe4b582dc34b922", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 97, "shares": 97, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221132744&w=1200&r=LYNXMPEE0A0YF", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-walmart-wages/walmart-raises-minimum-wage-to-11-an-hour-in-wake-of-u-s-tax-law-idUSKBN1F01N8", "country": "US", "domain_rank": 408, "title": "Walmart raises minimum wage to $11/ hour in wake of U.S.tax law", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T15:06:00.000+02:00", "replies_count": 0, "uuid": "9eb1597b6198278ad52e71964fe4b582dc34b922"}, "author": "", "url": "https://www.reuters.com/article/us-walmart-wages/walmart-raises-minimum-wage-to-11-an-hour-in-wake-of-u-s-tax-law-idUSKBN1F01N8", "ord_in_thread": 0, "title": "Walmart raises minimum wage to $11/ hour in wake of U.S.tax law", "locations": [], "entities": {"persons": [{"name": "nandita bos", "sentiment": "negative"}, {"name": "nandita bose", "sentiment": "none"}, {"name": "lisa von ahn", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "u.s.tax", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "walmart", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "walmart stores inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Walmart will raise entry-level wages for U.S. hourly employees to $11 an hour in February as it benefits from last month’s major overhaul of the U.S. tax code and competes for low wage workers in a tight labor market. \nBut on the same day, the world’s largest retailer and private employer, officially called Wal-Mart Stores Inc, announced layoffs as it shuttered many of its Sam’s Club discount warehouse stores. \nA senior company official who declined to be named said about 62 stores would be affected, about one tenth of the chain overall. \nAbout 50 stores will be shut permanently after a review of store profitability and up to 12 more stores will be shut and reopened as e-commerce warehouses, the person said. \nEvery Sam’s Club store employs about 150 workers, bringing the total number of affected jobs to about 7,500, the person said. Many of them will be accommodated in new jobs at the newly opened warehouses and other stores, the official said. \nEarlier on Thursday, Walmart announced the wage hike saying it would also offer a one-time cash bonus, based on length of service, of up to $1,000, and expand maternity and parental leave benefits. \nThe layoffs went unaddressed but the wage increase attracted praise from the White House. \n“Walmart is the largest employer in the country and to see them make that kind of effort to over a million workers is a big deal... and I think further evidence that the tax reform and tax cut package are having the impact that we had hoped,” White House press secretary Sarah Sanders told reporters on Thursday. \nU.S. Treasury secretary Steven Mnuchin also praised Walmart’s decision to raise wages. \nA worker prepares the frozen food section at a newly built Walmart Super Center prior to its opening in Compton, California, U.S., January 10, 2017. REUTERS/Mike Blake The timing of the store closure announcement hours after the wage hike drew some criticism. \n“While pay raises are usually a good thing, this is nothing but another public relations stunt from Walmart to distract from the reality that they are laying off thousands of workers and the ones who remain will continue to receive low wages,” said activist Randy Parraz, director of Making Change at Walmart, a United Food and Commercial Workers Union (UFCW) affiliate. \nThe pay increase, Walmart’s third minimum wage increase since 2015, and bonus will benefit more than 1 million U.S. hourly workers, the company said. \n\nSlideshow (3 Images) The Walmart wage hike, taking minimum pay up from the current $10 an hour after in-house training, is aimed at helping the company attract workers at a time when the U.S. unemployment rate is at 4.1 percent, a 17-year low, making it harder to attract and retain minimum wage employees. \nWalmart is likely to save billions of dollars from the new tax law, which slashed the corporate tax rate to 21 percent from 35 percent, and the wage hikes will cost the retailer only a fraction of those gains, analysts said. \n“Given how low unemployment is, they would have had to hike wages anyway, the tax bill just made that move easier,” said Edward Jones analyst Brian Yarborough. \nRival retailer Target Corp raised its minimum wage to $11 in September, and said it would raise its minimum wage to $15 by 2020. \nWalmart and Target’s new minimum wage levels exceed the state minimum wage, in all but three states, according to a research note from financial services firm BTIG. Eighteen U.S. states increased their minimum wage on Jan.1 but the federal minimum wage has been $7.25 since 2009. \nWalmart’s announcement follows companies like AT&T Inc, Wells Fargo & Co and Boeing Co, which have all promised more pay for workers since the Republican-controlled U.S. Congress passed the biggest overhaul to the U.S. tax code in 30 years. \nShares of Walmart closed up 0.3 percent at $100.02. \nReporting by Nandita Bose in New York, Additional reporting by Roberta Rampton in Washington D.C.; Editing by Frances Kerry\n ", "external_links": [], "published": "2018-01-11T15:06:00.000+02:00", "crawled": "2018-01-11T15:25:17.047+02:00", "highlightTitle": ""}