{"organizations": [], "uuid": "a9743d03f85b8da9131ec979b947288b27e285d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/cnbc-exclusive-cnbc-transcript-johnson-johnson-ceo-alex-gorsky-speaks-with-cnbcs-meg-tirrell-today.html", "country": "US", "domain_rank": 767, "title": "CNBC EXCLUSIVE: CNBC TRANSCRIPT: JOHNSON & JOHNSON CEO ALEX GORSKY SPEAKS WITH CNBC’S MEG TIRRELL TODAY", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T19:35:00.000+02:00", "replies_count": 0, "uuid": "a9743d03f85b8da9131ec979b947288b27e285d3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/cnbc-exclusive-cnbc-transcript-johnson-johnson-ceo-alex-gorsky-speaks-with-cnbcs-meg-tirrell-today.html", "ord_in_thread": 0, "title": "CNBC EXCLUSIVE: CNBC TRANSCRIPT: JOHNSON & JOHNSON CEO ALEX GORSKY SPEAKS WITH CNBC’S MEG TIRRELL TODAY", "locations": [], "entities": {"persons": [{"name": "alex gorsky", "sentiment": "negative"}, {"name": "j.p. morg", "sentiment": "negative"}, {"name": "johnson", "sentiment": "none"}, {"name": "meg tirrell", "sentiment": "none"}, {"name": "tirrell", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "meg tirrell", "sentiment": "none"}, {"name": "david faber", "sentiment": "none"}, {"name": "meg", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "johnson & johnson", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}, {"name": "j.p. morgan healthcare conference", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WHEN: Today, Tuesday, January 9, 2018\nWHERE: CNBC's \"Squawk on the Street\" – Live from the J.P. Morgan Healthcare Conference\nFollowing is the unofficial transcript of a CNBC EXCLUSIVE interview with Johnson & Johnson CEO Alex Gorsky and CNBC's Meg Tirrell today, Tuesday, January 9th on CNBC's \"Squawk on the Street\" (M-F 9AM-11AM) live from the annual J.P. Morgan Healthcare Conference. Following is a link to video from the interview on CNBC.com: https://www.cnbc.com/video/2018/01/09/johnson-johnson-ceo-we-should-all-be-acting-like-amazons-getting-into-our-business.html?play=1 .\nAll references must be sourced to CNBC.\nDAVID FABER: ALL RIGHT, LET'S GET OVER TO HEALTH CARE NOW. DAY TWO OF THE ANNUAL J.P. MORGAN HEALTHCARE CONFERENCE IN SAN FRANCISCO. OUR OWN MEG TIRRELL IS THERE, AND SHE HAS A VERY – I'M GOING TO SAY VERY SPECIAL GUEST, MEG. TAKE IT AWAY.\nMEG TIRRELL: HE IS VERY SPECIAL, DAVID, THANKS SO MUCH. JOINING US IS ALEX GORSKY, THE CEO AND CHAIRMAN OF JOHNSON & JOHNSON. THANK FOR BEING HERE ALEX.\nALEX GORSKY: HEY, GOOD MORNING MEG. IT'S GREAT TO BE HERE WITH YOU.\nTIRRELL: ONE OF THE BIG THEMES OF THE CONFERENCE ALWAYS IS M & A, IS DEALS, AND OF COURSE, WITH THE TAX OVERHAUL JUST PASSED, YOU GUYS HAVE $16 BILLION IN OVERSEAS CASH, WHAT DO YOU PLAN TO DO WITH THAT? ANALYSTS ARE INDICATING MAYBE PAY DOWN DEBT IS JOB NUMBER ONE, BUT ARE YOU GOING TO BE RE-INVESTING THAT, ARE YOU GOING TO BE HIRING, ARE YOU GOING TO INVESTING IN RESEARCH?\nGORSKY: WELL, MEG, FIRST OF ALL, IT'S GREAT TO BE AT THIS CONFERENCE. I MEAN THIS IS ABOUT TEN YEARS IN A ROW I HAVE BEEN OUT HERE. AND WHAT A WAY TO START THE YEAR, BECAUSE YOU COME OUT HERE AND YOU HEAR, IT'S REALLY ALL – NOT NECESSARILY ALL ABOUT DEALS BUT IT'S ABOUT INNOVATION, IT'S ABOUT NEW TECHNOLOGY, AND ALL THE REPORTING OUT OF THE PREVIOUS INTERVIEWS YOU HAVE DONE, YOU HAVE HEARD ABOUT THINGS LIKE IMMUNO ONCOLOGY, BREAKTHROUGHS, CURES WE COULDN'T HAVE EVEN IMAGINED, YOU KNOW, 10, 20 YEARS AGO. THESE THINGS ARE ACTUALLY HAPPENING IN OUR INDUSTRY SO IT'S A GREAT TIME TO BE HERE. LOOK, AT JOHNSON & JOHNSON, WE'RE ALWAYS LOOKING FOR GREAT NEW THERAPIES. WE TRY TO BE AGNOSTIC ABOUT WHETHER WE SOURCE IT INTERNALLY OR EXTERNALLY. AND I MUST ADMIT OVER THE PAST SEVERAL YEARS RIGHT HERE AT THIS CONFERENCE, WE'VE BEEN ABLE TO MEET NEW PARTNERS, SEE NEW TECHNOLOGIES AND SEE NEW EARLY SCIENCE THAT WE'VE ULTIMATELY BEEN ABLE TO BRING TO THE MARKET AND MAKE A BIG DIFFERENCE FOR PATIENTS. AS IT RELATES TO THE TAX, WE'RE VERY PLEASED TO SEE THE TAX REFORM WENT THROUGH. I THINK THE FACT WE NOW HAVE A COMPETITIVE TAX RATE, THAT WE HAVE A CONSTRUCT IN PLACE TO REPATRIATE EARNINGS AND CASH FROM OVERSEAS IS GOING TO GIVE US MUCH MORE FLEXIBILITY, MAKE US MUCH MORE COMPETITIVE. IN TERMS OF HOW WILL IT FUNDAMENTALLY AFFECT OUR OVERALL M & A STRATEGY, I DON'T THINK IT REALLY WILL. BECAUSE REALLY THAT STARTS WITH SCIENCE, THE RIGHT DEAL, THE RIGHT COMPANY, THE RIGHT CULTURE BEING ABLE TO INTEGRATE IT IN, BUT IT CERTAINLY GIVES US MORE FLEXIBILITY AND IS GOING TO MAKE US MORE COMPETITIVE IN THE LONG RUN.\nTIRRELL: WELL, YOUR PHARMA BUSINESS OF COURSE IS YOUR LARGEST UNIT. YOU ALSO HAVE A WELL KNOWN CONSUMER SET OF BRANDS, BUT THAT ONE OPERATIONALLY NOT DOING AS WELL. DOWN ABOUT 15% I BELIEVE IN THE THIRD QUARTER. ARE YOU THINKING ABOUT BOLSTERING THAT THROUGH M & AT ALL? PFIZER IS TALKING ABOUT OPTIONS FOR ITS CONSUMER BUSINESS.\nGORSKY: LOOK WE'RE EXCITED ABOUT ALL OF OUR SEGMENTS. AND YOU KNOW, OUR CONSUMER SEGMENT, THAT'S REALLY BEEN A CORE, ICONIC BRAND FOR JOHNSON & JOHNSON, WHETHER IT'S BABY, WHETHER IT'S NEUTROGENA, AVEENO, TYLENOL, WE'VE GOT SOME GREAT FRANCHISES. AND WHILE THEY DID PERFORM DOWN SLIGHTLY, THEY WERE ACTUALLY ABOUT FLAT IN THE THIRD QUARTER AND THROUGH THE EARLY PART OF THE YEAR. WHAT WE'VE SEEN IS REALLY A SECULAR SHIFT THROUGHOUT THE LARGE CONSUMER BRANDS OVERALL. NOW, WE REMAIN VERY CONFIDENT IN THAT FRANCHISE. IF YOU LOOK AT THE UNDERLYING GROWTH IN AREAS LIKE BEAUTY, LIKE OTC, IT STILL REMAINS STRONG. WE CERTAINLY HAVE GOT TO DO THINGS ABOUT MODERNIZING SOME OF OUR BRANDS AROUND BABY, MOVING EVEN FASTER TO THE E-CHANNEL, BUT OVERALL WE'RE VERY CONFIDENT. AND AGAIN, HERE, TOO, WE DID AN ACQUISITION JUST A COUPLE YEARS AGO, VOGUE, A REALLY GOOD INNOVATIVE HAIR CARE COMPANY, AND WHAT WE'RE DOING NOW IS WE'RE ACTUALLY TAKING THE WAY THEY INNOVATE IN A FAST WAY, WHERE THEY'RE COLLECTING ONLINE IMMEDIATELY WITH CONSUMERS AND WE'RE BUILDING THAT INTO SOME OF OUR OTHER BRANDS IN THE CONSUMER AREA. SO YOU KNOW, M & A IT'S ALWAYS GOING TO BE AN IMPORTANT PART OF OUR STRATEGY.\nTIRRELL: WELL, THINKING ABOUT E-COMMERCE, A BIG QUESTION IN 2017 IN HEALTH CARE WAS THE PRESENCE OF AMAZON. AND OF COURSE, YOU MAY HAVE PARTNERSHIPS AND EXISTING RELATIONSHIPS WITH THEM IN YOUR CONSUMER BUSINESS. WHAT'S YOUR EXPECTATION FOR THEIR POTENTIAL MOVE INTO THE PHARMACY SUPPLY CHAIN?\nGORSKY: WHAT I WOULD SAY ABOUT AMAZON IS WE HAVE A VERY GOOD PARTNERSHIP WITH THEM ON THE CONSUMER SIDE. AND WE'RE TALKING TO THEM, WE SELL THROUGH MANY OF THE BIG CHAINS WE WORK WITH. WE ALSO SELL DIRECTLY. BUT WHAT I WOULD ENCOURAGE ALMOST ANYBODY, WHETHER IT BE IN PHARMA, MED DEVICE, OTC, WE SHOULD ALL BE ACTING LIKE AMAZON'S GETTING INTO OUR BUSINESS. BECAUSE FRANKLY, WE HAVE TO CREATE A CRISIS. WE HAVE TO MAKE SURE WE'RE ALWAYS COMPETITIVE, WE'RE ALWAYS THINKING ABOUT HOW CAN WE BE MORE EFFECTIVE, HOW CAN WE BE MORE EFFICIENT. AND SO WE'RE THINKING THAT WAY ACROSS ALL OF OUR DIFFERENT BUSINESSES.\nTIRRELL: WOULD YOU WELCOME AMAZON IN ARE YOU TALKING WITH THEM ABOUT THEIR ROLE?\nGORSKY: WELL, IF IT LEADS TO BETTER CUSTOMER SATISFACTION, IF IT LEADS TO GREATER TRANSPARENCY, FOR EXAMPLE, AROUND PRICING, IF IT LEADS TO ULTIMATELY BETTER OUTCOMES FOR PATIENTS, OF COURSE, WE WELCOME THEM IN.\nTIRRELL: ANY CONVERSATIONS HAPPENING?\nGORSKY: WELL I WON'T GO DOWN THAT ROAD RIGHT NOW, BUT LOOK, I THINK HAVING HEALTHY COMPETITION CAN BE A POSITIVE THING. BUT YOU KNOW, WE'VE ALWAYS HAVE TO KEEP THE PATIENT, THE CONSUMER IN MIND.\nTIRRELL: WELL I WANT TO ASK YOU MORE BROADLY ABOUT THE POLITICAL ENVIRONMENT RIGHT NOW. AND A BIG DEBATE GOING ON OUTSIDE THIS CONFERENCE IS THE IMMIGRATION DEBATE AND WHAT'S GOING ON WITH DACA AND D.R.E.A.M.ers. SOME OF MY COLLEAGUES THIS MORNING INTERVIEWED A J & J EMPLOYEE WHO IS A D.R.E.A.M.er AND SHE'S WORRIED ABOUT BEING EXPELLED FROM THE COUNTRY. SHE SAYS SHE'S TALKED WITH YOU ABOUT JOHNSON & JOHNSON'S POSITION ON DACA. HOW IMPORTANT IS THAT FOR JOHNSON & JOHNSON?\nGORSKY: WELL LOOK, IT'S VERY IMPORTANT. AND IT'S IMPORTANT AT A PERSONAL LEVEL. AS THE GRANDSON OF IMMIGRANTS MYSELF, IT'S SOMETHING THAT HAS BEEN A VERY IMPORTANT PART OF OUR COUNTRY. AND MAKING SURE THAT WE'VE GOT COMPREHENSIVE IMMIGRATION REFORM THAT TAKES INTO CONSIDERATION, YOU KNOW, HOW CAN WE HELP THESE PEOPLE YOU KNOW, GAIN THE RIGHT – THEIR APPROPRIATE RIGHTS IN THE UNITED STATES? HOW CAN WE MAKE SURE THEY CAN BE DRIVERS OF THE ECONOMY? THAT'S WHAT THIS IS ALL ABOUT. SO IT'S CERTAINLY OUR HOPE. WE'VE MADE A STAND ON DACA. IT'S OUR HOPE WE CAN, AGAIN, GET MORE COMPREHENSIVE REFORM THROUGH. AND WE WANTED TO HELP OUR EMPLOYEES, LIKE THE ONE YOU TALKED TO THIS MORNING. IN FACT, WE THINK IT'S GOOD FOR ALL OF INDUSTRY WHEN THAT GETS DONE.\nTIRRELL: DAVID, YOU HAVE A QUESTION?\nFABER: YEAH, THANK YOU, MEG. A", "external_links": ["https://wpyadmin.ne.cision.com/l/ufrofjfz/www.cnbc.com/squawk-on-the-street", "http://www.nbcumv.com/programming/cnbc"], "published": "2018-01-09T19:35:00.000+02:00", "crawled": "2018-01-09T21:15:56.006+02:00", "highlightTitle": ""}