{"organizations": [], "uuid": "4628cc63fac0a328eb15d982f7bb340ced405208", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219489876&w=1200&r=LYNXMPEE0401N", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-global-markets/asian-shares-approach-2007-peak-dollar-weak-on-soft-inflation-prospects-idUKKBN1EU049", "country": "US", "domain_rank": 408, "title": "Asian shares near record high, dollar weak ahead of job, wage data", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T08:57:00.000+02:00", "replies_count": 0, "uuid": "4628cc63fac0a328eb15d982f7bb340ced405208"}, "author": "", "url": "https://uk.reuters.com/article/us-global-markets/asian-shares-approach-2007-peak-dollar-weak-on-soft-inflation-prospects-idUKKBN1EU049", "ord_in_thread": 0, "title": "Asian shares near record high, dollar weak ahead of job, wage data", "locations": [], "entities": {"persons": [{"name": "reuters/kim kyung-hoon", "sentiment": "none"}, {"name": "hideyuki sano", "sentiment": "none"}], "locations": [{"name": "asia-pacific", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 1:13 AM / Updated 35 minutes ago Asian shares near record high, dollar weak ahead of job, wage data Hideyuki Sano 6 Min Read \nTOKYO (Reuters) - Asian shares inched closer to a record high on Friday as U.S. jobs data pointed to firm economic growth although the greenback was soft as the specter of benign inflation capped domestic bond yields. Men exchange greetings in front of an electronic board displaying the Nikkei average outside a brokerage in Tokyo, Japan January 4, 2018. REUTERS/Kim Kyung-Hoon \nMSCI's broadest index of Asia-Pacific shares outside Japan .MIAPJ0000PUS rose nearly 0.4 percent to 585.0, about one percent shy of its all-time peak of 591.5 hit in November 2007, led by gains in Australia and South Korea .KS11 . \nJapan's Nikkei .N225 rose 0.9 percent to a 26-year high. \nSpread-betters see mixed opening in Europe, with Britain's FTSE .FTSE seen falling 0.1 percent and German's DAX .GDAXI edging up 0.1 percent. \nMSCI’s gauge of stocks across the globe .MIWD PUS has risen 2.11 percent so far this week, putting it on course to log its best weekly performance since a 2.12 percent gain in mid-July. \nThe U.S. ADP National Employment Report on Thursday showed U.S. private employers added 250,000 jobs USADP=ECI in December, the biggest monthly increase since March and well above economists’ expectations of a rise of 190,000. \nThat helped the Dow Jones Industrial Average .DJI sail past the 25,000-mark for the first time. S&P 500 .SPX gained 0.40 percent while the Nasdaq Composite .IXIC added 0.18 percent, both notching record closing highs.[.N] \nThe data also boosted expectations on Friday’s payroll data USNFAR=ECI by the U.S. Labor Department, where economists have forecast nonfarm job growth of 190,000 in December. \nDespite signs of a strong U.S. labor market, the dollar was soft, hovering just above its three-month low against a basket of major currencies. \nThe dollar index .DXY stood at 91.877, near Tuesday’s three-month low of 91.751. \n“The dollar looks very weak at the moment. And I think the reason comes down to the fact that U.S. long-term bond yields are very low despite the Fed’s rate hikes,” said Masashi Murata, senior currency strategist at Brown Brothers Harriman. \nThe 10-year U.S. Treasuries yield stood at 2.460 percent US10YT=RR, below its seven-month peak of 2.504 percent touched on Dec. 21. Those levels are little different from about a year ago, even after the Fed hiked interest rates three times last year and market expectations for another three hikes in 2018. \nCapping U.S. long-term bond yields were expectations that inflation will remain tame as wage growth has been slower than before the 2007-2008 financial crisis. \nIn that regard, average hourly earnings data due at 1330 GMT, along with payroll figures, could attract more attention, given wage growth is a key factor behind inflation trends. \nEconomists expect U.S. wages to have risen 2.5 percent from a year earlier in December, the same as in November. \nThe euro held firm at $1.2070 EUR= , holding its gains so far this week of 0.6 percent and coming within sight of its 2-1/2-year peak of $1.2092 set in early September. \nThe euro zone’s consumer inflation data, due at 1000 GMT, is expected to show an easing to 1.4 percent in December from 1.5 percent in November. \nBut stronger-than-expected German inflation data published late last year is fueling speculation of a higher reading, which in turn could encourage expectations the European Central Bank may move faster to wind up its stimulus. \nMany emerging economy currencies have gained even more against the dollar this week as investors look for higher yields. \nSince the start of 2018, the Brazilian real BRL= gained 2.4 percent, the Mexican peso MXN= 1.8 percent, the Indonesian rupiah IDR= 1.1 percent and the Indian rupee INR= 0.7 percent. \nOn the other hand, the yen, which also tends to be used as a funding currency for investment in higher-yielding assets, has lost 0.3 percent against the dollar this week to 113.02 yen JPY= . \nBut some market players also said market moves so far this year have been mostly driven by short-term speculators and many long-term investors were on the sidelines, hampered not least by high valuations of stocks in the U.S. and some other countries. \n“As far as I can see, real money investors have been cautious. So I would advise not to read too much into the new year market moves,” said Kazushige Kaida, head of foreign exchange at State Street Bank in Tokyo. \nIn commodities markets, oil prices softened marginally but held near their highest levels since May 2015 on concerns about supply risks due to unrest in Iran and another decline in U.S. inventories as refining activity hit a 12-year high. \nU.S. crude CLc1 eased to $61.97 a barrel after having risen to as high as $62.21 the previous session. International benchmark Brent futures LCOc1 fetched $68.02. Editing by Kim Coghill and Jacqueline Wong", "external_links": [], "published": "2018-01-05T08:57:00.000+02:00", "crawled": "2018-01-05T09:19:34.011+02:00", "highlightTitle": ""}