{"organizations": [], "uuid": "0983aae81c8e4c469b3c34d02a066c8c0b71a2d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-congress-shutdown/first-day-of-u-s-government-shutdown-ends-in-standoff-idUKKBN1F90M3", "country": "US", "domain_rank": 408, "title": "First day of U.S. government shutdown ends in standoff", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T15:51:00.000+02:00", "replies_count": 0, "uuid": "0983aae81c8e4c469b3c34d02a066c8c0b71a2d0"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-congress-shutdown/first-day-of-u-s-government-shutdown-ends-in-standoff-idUKKBN1F90M3", "ord_in_thread": 0, "title": "First day of U.S. government shutdown ends in standoff", "locations": [], "entities": {"persons": [{"name": "richard cowan", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "gibson", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 20, 2018 / 1:52 PM / Updated 16 hours ago First day of U.S. government shutdown ends in standoff Richard Cowan , Ginger Gibson 7 Min Read \nWASHINGTON (Reuters) - President Donald Trump and Republican lawmakers were locked in a standoff with Democrats on Saturday over the U.S. government shutdown, with Republicans saying they would not negotiate on immigration until the government is reopened. \nFunding for federal agencies ran out at midnight with no agreement in Congress, meaning the second year of Trump’s presidency began without a fully functioning government. \nDemocrats stuck to demands that any short-term spending legislation must include protections for young undocumented immigrants known as “Dreamers.” Republicans in turn said they would not negotiate on immigration until Democrats gave them the votes needed to reopen the government. \nU.S. government workers were told to stay home or, in some cases, work without pay until new funding is approved in the first federal government shutdown since a 16-day funding lapse in October 2013. \nThe Republican-controlled Senate and House of Representatives held rare weekend sessions on Saturday, facing a political crisis that could affect November congressional elections. By about 7 p.m. both chambers resigned themselves to failure and agreed to resume work on Sunday. \nBoth Republicans and Democrats had dug in during the day, each side blaming the other. \nSenate Majority Leader Mitch McConnell said the Senate would vote at 0100 EST (0600 GMT) Monday on a bill to fund the government through Feb. 8, unless Democrats agree to hold it sooner. \n“We’ll be right back at this tomorrow and for as long as it takes” for Democrats to vote for legislation that would reopen the government, McConnell said. \nOutside the U.S. Capitol, parks, open-air monuments and Smithsonian museums were open as a second annual women’s rights march took place on the National Mall. But visitors were turned away from the Liberty Bell in Philadelphia and the Statue of Liberty and Ellis Island in New York Harbor. \nA scheduled trip by Trump and some Cabinet members to the World Economic Forum in Davos, Switzerland, was being assessed on a day-to-day basis, White House budget director Mick Mulvaney said. \nRepublicans said they would refuse to negotiate on immigration until Democrats provide the votes to re-open the government. Democrats insisted they have been willing to compromise but Republicans backed out of deals. \n“The president will not negotiate on immigration reform until Democrats stop playing games and reopen the government,” said White House spokeswoman Sarah Sanders. \nMarc Short, the White House’s legislative affairs director, said Trump had been in contact with Republican leaders in Congress during the day, but had not reached out to Democrats. \nShort said the president likely would be most effective making the case for ending the shutdown directly to the American people, and he did not rule out Trump addressing the nation in the coming days. \nThe tough message from the White House and Republicans in Congress led to speculation that Washington could be in for a prolonged political battle. \nAt the U.S. Capitol, Senate Democratic Leader Chuck Schumer delivered a stinging portrayal of Trump as an unreliable negotiating partner, saying the two sides came close to an agreement several times only to have Trump back out at the urging of anti-immigration conservatives. \n“Negotiating with President Trump is like negotiating with Jell-O,” said Schumer, who met Trump at the White House on Friday for a 90-minute meeting that had briefly raised hopes. “It’s impossible to negotiate with a constantly moving target.” \n‘INCHES AWAY’ \nThe federal government had been running on three consecutive temporary funding bills since the new fiscal year began in October. \nDemocrats had sought to secure permanent legal protections for 700,000 young undocumented immigrants as a condition for new government funding after their attempts to push through the protections in stand-alone bills were rebuffed. Trump ordered the Deferred Action for Childhood Arrival program to expire in March, requiring Congress to act. \nEarlier, McConnell said a solution to the crisis was “just inches away” but he blamed Democrats for blocking legislation to pass the fourth stopgap funding measure. \nOne idea floated by Republicans was to renew government funding through Feb. 8 to end the shutdown, while working to resolve other issues, including immigration, military and non-military spending, disaster relief and some healthcare matters. \nU.S. Representative Gerry Connolly, a Democrat whose northern Virginia district has one of the highest concentrations of federal government employees, said there was no sign that serious bipartisan negotiations were taking place and he would be surprised if Congress reached a resolution before Monday. \n“You can hear the crickets chirping in the hallway,” Connolly said on Saturday evening. He said if there were negotiations, “it would have to be really deep back channels.” \nHe attributed the lack of talks to “raw feelings” and that Trump had walked away on Friday from a deal on immigration. \nA video ad released on Saturday by Trump’s presidential campaign that says Democrats will be “complicit” in murders by illegal immigrants could inflame tensions. \nTrump had portrayed himself as the ultimate dealmaker, but his inability to cut a deal despite having a Republican majority in both houses of Congress marked arguably the most debilitating setback for his administration. \n“This is the One Year Anniversary of my Presidency and the Democrats wanted to give me a nice present,” he said on Twitter. \nThe immediate impact of the government shutdown was eased somewhat by it beginning on a weekend. \nThe Defense Department said combat operations in Afghanistan and other military activities would continue, while federal law enforcement officers also would remain on duty. \nTalks on the North American Free Trade Agreement will continue, as will major cybersecurity functions, and most of the Environmental Protection Agency will remain open, budget director Mulvaney said. \nBut without a quick deal, hundreds of thousands of government employees will be put on temporary unpaid leave. \n“It’s ironic that they get paid - meaning Congress - and the rest of the government doesn‘t,” said Dawn Gaither, 57, a Washington teacher. “That’s what we need to do, kick these guys in the tail and get them to work.” Reporting by Richard Cowan, Ginger Gibson, James Oliphant, Ian Simpson, and David Brunnstrom in Washington; Writing by Richard Cowan and Doina Chiacu; Editing by Bill Trott and Daniel Wallis", "external_links": [], "published": "2018-01-20T15:51:00.000+02:00", "crawled": "2018-01-21T08:11:17.006+02:00", "highlightTitle": ""}