{"organizations": [], "uuid": "6bacbe3fe34af04d8c7f22411e3e764613419f3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-tanzania-schoolgirls-arrests/tanzania-slammed-for-misguided-arrest-of-pregnant-schoolgirls-idUSKBN1EZ2C2", "country": "US", "domain_rank": 408, "title": "Tanzania slammed for 'misguided' arrest of pregnant schoolgirls", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.925, "site_type": "news", "published": "2018-01-11T01:52:00.000+02:00", "replies_count": 0, "uuid": "6bacbe3fe34af04d8c7f22411e3e764613419f3a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-tanzania-schoolgirls-arrests/tanzania-slammed-for-misguided-arrest-of-pregnant-schoolgirls-idUSKBN1EZ2C2", "ord_in_thread": 0, "title": "Tanzania slammed for 'misguided' arrest of pregnant schoolgirls", "locations": [], "entities": {"persons": [{"name": "christa stewart", "sentiment": "none"}, {"name": "john magufuli", "sentiment": "none"}], "locations": [{"name": "tanzania", "sentiment": "none"}, {"name": "tandahimba", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DAR ES SALAAM/NAIROBI (Thomson Reuters Foundation) - Campaigners on Wednesday condemned authorities in Tanzania for arresting five schoolgirls for being pregnant, saying they should have arrested the men who impregnated them instead.\nThe girls - aged between 16 and 19 - were arrested by police in the southeastern town of Tandahimba over the weekend. They have been released on bail and are currently with their parents.\n“Prosecuting girls who are victims of sexual exploitation and violence, whilst allowing adult perpetrators to go free, sends out the wrong message,” said Christa Stewart, a lawyer with the charity Equality Now.\n“In a misguided attempt to prove that they take sexual violence seriously, the Tanzanian government is infringing on the human rights of adolescent girls and this is unacceptable. Arresting victims is never the solution.”\nPresident John Magufuli caused an outcry among campaigners in June when he voiced support for a ban on pregnant girls and teenage mothers in state schools, which dates back to 1961, describing their behavior as “immoral”.\nThe New York-based Center for Reproductive Rights said the arrests were “unacceptable” and called for the men to be arrested, while Sabrina Mahtani of the rights group Amnesty International said the arrests were illegal.\nTanzania has one of the highest adolescent pregnancy rates in the world, with widespread sexual violence and many girls exchanging sex for school fees, food and shelter, says the United Nations.\nTandahimba’s district commissioner Sebastian Waryuba last month ordered the arrests of 55 other girls who gave birth over the past two years and their parents.\nHe said the arrests would deter other students from getting pregnant, and will also serve as a lesson to parents to stop their children engaging in “reckless” sexual relationships.\nA district education official said that police were also looking for the men who impregnated the students, and that they would be charged with rape as the most of the girls were minors.\n“They will be charged for rape because our law is very clear that sex with someone below the age of 18 is rape,” said Sosthenes Luhende, an education officer in Tandahimba.\nIn December, Magufuli pardoned two convicted child rapists for raping 10 primary school girls after serving 13 years of their life sentences.\nReporting by Kizito Makoye in Dar es Salaam and Nita Bhalla @nitabhalla in Nairobi, Writing by Nita Bhalla, Editing by Katy Migiro. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T01:52:00.000+02:00", "crawled": "2018-01-11T03:49:16.009+02:00", "highlightTitle": ""}