{"organizations": [], "uuid": "9129131f06ccc1d94b218008341bb4213745ff74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-cameroon-separatists-nigeria/at-least-15000-cameroonian-refugees-flee-to-nigeria-amid-crackdown-idUSKBN1F01Q6", "country": "US", "domain_rank": 408, "title": "At least 15,000 Cameroonian refugees flee to Nigeria amid crackdown", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T15:37:00.000+02:00", "replies_count": 0, "uuid": "9129131f06ccc1d94b218008341bb4213745ff74"}, "author": "", "url": "https://www.reuters.com/article/us-cameroon-separatists-nigeria/at-least-15000-cameroonian-refugees-flee-to-nigeria-amid-crackdown-idUSKBN1F01Q6", "ord_in_thread": 0, "title": "At least 15,000 Cameroonian refugees flee to Nigeria amid crackdown", "locations": [], "entities": {"persons": [{"name": "nige", "sentiment": "negative"}, {"name": "paul carsten", "sentiment": "none"}, {"name": "antonio jose canhandula", "sentiment": "none"}, {"name": "paul biya", "sentiment": "none"}], "locations": [{"name": "nigeria", "sentiment": "none"}, {"name": "cameroon", "sentiment": "none"}, {"name": "cross river", "sentiment": "none"}, {"name": "abuja", "sentiment": "none"}], "organizations": [{"name": "united nations", "sentiment": "none"}, {"name": "un", "sentiment": "none"}, {"name": "min read  abuja", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "unhcr", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ABUJA (Reuters) - More than 15,000 Cameroonian refugees have fled to Nigeria amid a crackdown on Anglophone separatists, the United Nations (UN) refugee agency and Nigerian government officials said on Thursday.\nThe once-fringe English-speaking movement in majority French-speaking Cameroon has gathered pace in the last few months after a military crackdown on protests, leading it to declare independence in October for a breakaway “Ambazonia” state it wants to create.\nThe move poses the biggest challenge yet to the 35-year rule of President Paul Biya, who will seek re-election this year, and the violent repression he has unleashed has driven thousands of people from English-speaking regions across the border into Nigeria.\nMore than 8,000 refugees have been registered in the southeastern state of Cross River alone, said Antonio Jose Canhandula, the UN High Commissioner for Refugees’ (UNHCR) representative in Nigeria, at a briefing in Abuja.\nA further 6,700 or so Cameroonian refugees have crossed into neighboring Benue state, said Sadiya Umar Farouq, the head of Nigeria’s National Commission for Refugees, Migrants and Internally Displaced Persons, citing Benue officials.\nThere are also at least 350 refugees in the states of Taraba and Akwa Ibom, said Tamuno Dienye Jaja, deputy comptroller general of the Nigeria Immigration Service.\nThe refugees are mostly children, women and the elderly, with very few young men, the officials said.\n“Certainly there are more, how many more we are not able to state,” said the UNHCR’s Canhandula.\n“They are still coming, and they are coming daily,” he said. “It is a crisis.”\nMore food assistance, education and social services are needed, particularly as a number of the women are pregnant at a young age, were are all issues, Canhandula said.\nNigeria’s Farouq pledged the government’s support.\n“We are going to do all that we can to bring some kind of relief,” she said.\nNigerian and Cameroonian officials have met to discuss the refugees and those talks are ongoing, she said, although she declined to give details.\nThe separatist movement, including armed radical elements, has strained bilateral relations between the two countries.\nLast week, Nigerian authorities took 12 leaders of the separatists, including the chairman of the self-declared Governing Council of Ambazonia, into custody after they gathered for a meeting in a hotel in the Nigerian capital Abuja, people familiar with the matter said.\nCameroonian troops last month crossed into Nigeria in pursuit of rebels without seeking Nigerian authorization, leading to diplomatic wrangling behind the scenes.\nThe unrest in Cameroon began in November, when English-speaking teachers and lawyers in the Northwest and Southwest regions of Cameroon that neighbor Nigeria, frustrated with having to work in French, took to the streets calling for reforms and greater autonomy. French is the official language for most of Cameroon, but English is spoken in the two regions.\nReporting by Paul Carsten; Editing by Hugh Lawson\n ", "external_links": [], "published": "2018-01-11T15:37:00.000+02:00", "crawled": "2018-01-11T15:44:48.010+02:00", "highlightTitle": ""}