{"organizations": [], "uuid": "dd9620c97eba6154f7f06254e547ae268e442711", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-establishment-labs-appoints-dennis-condon-to-the-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Establishment Labs Appoints Dennis Condon to the Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-08T20:22:00.000+02:00", "replies_count": 0, "uuid": "dd9620c97eba6154f7f06254e547ae268e442711"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-establishment-labs-appoints-dennis-condon-to-the-board-of-directors.html", "ord_in_thread": 0, "title": "Establishment Labs Appoints Dennis Condon to the Board of Directors", "locations": [], "entities": {"persons": [{"name": "dennis condon", "sentiment": "negative"}, {"name": "condon", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "establishment labs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 08, 2018 (GLOBE NEWSWIRE) -- Establishment Labs, a global medical device company focused on breast aesthetics and reconstruction technologies with a strong emphasis on product development and innovation, announced today that Dennis Condon has been appointed to the Board of Directors.\nMr. Condon brings years of experience in the breast implant market from his role as President of Mentor Aesthetics from 1990 to 1998.\nOn his appointment, Mr. Condon commented, “It is very exciting to see the extraordinary progress that Establishment Labs has brought to the field of breast aesthetics and the much needed innovation they have successfully developed and commercialized. The vastly improved patient outcomes is the first true differentiator in the market in decades, and I am very much looking forward to helping the company scale their business and help patients and plastic surgeons alike.”\nMr. Condon continued, “Establishment Labs has taken up the mantle of being the leader and innovator in this industry, and they are accomplishing much of what the industry should have been thinking about to improve safety and patient satisfaction. With this foundation, I think we can build the franchise and the products that can change and grow the industry in a way that has never been possible to date.”\nMost recently, Condon was the CEO and President of Nuvesse Skin Therapies, a venture-backed cosmeceutical skincare company serving the U.S. medical device and retail skin care markets, until its sale to a Korean pharmaceuticals company in 2016. Previous to Nuvesse, he was CEO and President of Merz Aesthetics, Inc. and President and Chief Business Officer of BioForm Medical. BioForm was acquired by Merz Pharma in January 2010. Dennis has also lead other aesthetic companies, acting as CEO of a cosmetic laser company and CEO of a national chain of cosmetic surgery centers.\nDennis currently serves on the boards of two other companies in the aesthetic medical field: AirXpanders Inc., a unique breast reconstruction device, and Suneva Medical Inc., which commercializes the longest lasting dermal filler for facial fine lines and wrinkles. Mr. Condon has a BS in Biological Sciences from the University of California, Davis.\nJuan Jose Chacon Quiros, CEO and Founder of Establishment Labs, commented, “We welcome Dennis to our Board. He brings 35 years of experience in key executive roles in the plastic surgery market, and his knowledge, insight, and executive leadership experience are a great fit with our team. I look forward to his help in building a new standard for Breast Aesthetics and Reconstruction.”\nAbout Establishment Labs\nEstablishment Labs is a global, privately held, medical technology company with a strong emphasis on innovation that designs, develops, manufactures and markets an innovative product portfolio. Its CE-marked Motiva Implants® line of silicone breast implants ( http://www.motivaimplants.com ) utilizes ultra-high purity medical-grade silicone and is subject to the strictest quality assurance testing throughout the manufacturing process. Motiva Implants are sold in more than 60 countries worldwide. Puregraft®'s FDA cleared and CE-Marked technology provides plastic surgeons with purified fat for reinjection on the sterile field and is used in hospitals and clinics around the world. Divina® is a proprietary 3D imaging technology for full integration in consultation and surgical planning of unique solutions for breast aesthetics and reconstruction. All manufacturing facilities are fully compliant with both FDA and ISO applicable standards.\nInvestor Relations Contact\nLynn Pieper Lewis or Leigh Salvo\nGilmartin Group\n(415) 937-5404\nleigh@gilmartinir.com\nSource:Establishment Labs", "external_links": ["https://www.globenewswire.com/Tracker?data=QA48NRiFXXn1u15sSoOa9f-yN3tDQ3MnP_m_Xs1KrCbnml3QzUJu7rQWveravavqOnR2Fc8IdNmAGsL6VyqgAZ1LQ80HZWcK12bTPdbO0i0=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/905b91aa-2cf9-4389-85ac-af7670c8bef8", "https://www.globenewswire.com/Tracker?data=9Ye4EIkAXUNPHrIsl3dM-LNtDwmt8neUTq8vNYNMXOWoMWehsSLKq8BtTFd6Q_SfM5Ng-jEy4XkI_TM-bjSIayUI7i2ZvOAtAAt1fh6RjRs="], "published": "2018-01-08T20:22:00.000+02:00", "crawled": "2018-01-08T21:05:52.012+02:00", "highlightTitle": ""}