{"organizations": [], "uuid": "f2236267440ce07950a86a4eecf8f762efa7ac98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-territorial-bancorp-inc-announces-2017-results.html", "country": "US", "domain_rank": 767, "title": "Territorial Bancorp Inc. Announces 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:30:00.000+02:00", "replies_count": 0, "uuid": "f2236267440ce07950a86a4eecf8f762efa7ac98"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-territorial-bancorp-inc-announces-2017-results.html", "ord_in_thread": 0, "title": "Territorial Bancorp Inc. Announces 2017 Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "territorial bancorp inc", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Net income for the three months ended December 31, 2017 was $2.17 million compared to $4.36 million for the three months ended December 31, 2016. Net income for the three months ended December 31, 2017 reflected a $2.05 million increase in income tax expense that occurred because of a write-down of deferred income tax assets that resulted when the federal corporate tax rate was lowered from 35% to 21% in December due to the Tax Cuts and Jobs Act of 2017. Excluding the write-down of the deferred income tax assets, net income would have been $4.22 million. Total assets grew by 6.72% in 2017 and exceeded $2.0 billion at December 31, 2017. Loans receivable grew by 11.45% in 2017 to $1.489 billion at December 31, 2017. This was the sixth consecutive year of double digit loan growth. Deposits rose by 6.97% in 2017 to $1.597 billion at December 31, 2017. A $1,000 year-end bonus was paid to most non-management employees at the end of 2017. Total dividends paid per share of common stock grew by 30.43% in 2017 to $1.20 per share. Board of Directors approved a quarterly cash dividend of $0.20 per share, representing Territorial Bancorp Inc.’s 33rd consecutive quarterly dividend.\nHONOLULU, Jan. 25, 2018 (GLOBE NEWSWIRE) -- Territorial Bancorp Inc. (NASDAQ:TBNK) (the “Company”), headquartered in Honolulu, Hawaii, the holding company parent of Territorial Savings Bank, announced net income of $2.17 million or $0.23 per diluted share for the three months ended December 31, 2017, compared to $4.36 million or $0.46 per diluted share for the three months ended December 31, 2016. Net income for the three months ended December 31, 2017 included a $2.05 million ($0.21 per share) increase in income tax expense that occurred because of a decrease in the Company’s deferred income tax assets that resulted when the federal corporate tax rate was lowered from 35% to 21% in December. Excluding the write-down of the deferred income tax assets, net income would have been $4.22 million or $0.44 per diluted share. Although the reduction in the federal corporate tax rate resulted in the write-down of a portion of the Company’s deferred income tax assets, the lower tax rate will reduce the effective tax rate in the future.\nThe Company also announced that its Board of Directors approved a quarterly cash dividend of $0.20 per share. The dividend is expected to be paid on February 22, 2018 to stockholders of record as of February 8, 2018.\nAllan Kitagawa, Chairman and Chief Executive Officer, said, “The Company continues to perform well despite the increase in income tax expense that occurred in the fourth quarter due to changes in federal tax law. Hawaii’s economy, especially the visitor industry, continues to improve. The growth in Hawaii’s economy has allowed us to increase the size of our loan portfolio and total deposits, which in turn, has increased our net interest income. Along with this growth, the Company’s strong performance has resulted in our total assets exceeding $2 billion.”\nInterest Income\nNet interest income after provision for loan losses increased to $14.85 million for the three months ended December 31, 2017 from $14.34 million for the three months ended December 31, 2016. Total interest income was $17.60 million for the three months ended December 31, 2017 compared to $16.48 million for the three months ended December 31, 2016. The $1.12 million growth in interest income was due to a $1.16 million increase in interest earned on loans which resulted primarily from the $152.98 million increase in loans receivable.\nInterest Expense and Provision for Loan Losses\nTotal interest expense increased to $2.70 million for the three months ended December 31, 2017 from $2.05 million for the three months ended December 31, 2016. Total interest expense on deposits increased to $2.21 million for the three months ended December 31, 2017 from $1.57 million for the three months ended December 31, 2016. The increase in interest expense on deposits occurred primarily because of a $104.10 million increase in total deposits. During the quarter ended December 31, 2017, the provision for loan losses was $50,000 compared to $91,000 for the quarter ended December 31, 2016.\nNoninterest Income\nNoninterest income was $856,000 for the three months ended December 31, 2017 compared to $1.07 million for the three months ended December 31, 2016. The decrease in noninterest income was primarily due to a $120,000 decrease in the gain on sale of investment securities, a $57,000 decline in gains on the sale of loans and a $66,000 decrease in service fees on loans and deposit accounts.\nNoninterest Expense\nNoninterest expense was $10.25 million for the three months ended December 31, 2017 compared to $8.19 million for the three months ended December 31, 2016. The increase in noninterest expense was primarily due to a $1.72 million increase in salaries and employee benefits, which resulted from a $1,000 year-end bonus paid to most non-management employees to share the benefits which the Company will receive from the reduction in the federal corporate tax rate from 35% to 21% and a change in the methodology for the distribution of dividends to participants in the ESOP plan. The increase in dividends paid raised the total distribution to ESOP plan participants, and the change in methodology for the distribution of dividends resulted in additional expense of $395,000 related to 2017 and $266,000 related to prior periods. Changes in dividend levels affect the related ESOP expense. In 2017, the total dividends paid by the Company rose to $1.20 per share of common stock from $0.92 per share of dividends paid in 2016.\nIncome Taxes\nIncome tax expense for the three months ended December 31, 2017 was $3.29 million compared to $2.86 million for the three months ended December 31, 2016. Income tax expense for the three months ended December 31, 2017 includes a $2.05 million write-down of the Company’s deferred income tax assets which resulted when the federal corporate tax rate was lowered from 35% to 21% in December. Although the reduction in the corporate tax rate resulted in the write-down of the Company’s deferred income tax assets, the lower tax rate will reduce the effective tax rate in the future. Income tax expense for the three months ended December 31, 2017 also included a $505,000 tax benefit related to the exercise of stock options. Starting in 2017, a new accounting standard requires that any excess tax benefits resulting from the exercise of stock options be recognized in income tax expense. Prior to the adoption of the new standard, the excess tax benefits were recorded as additional paid-in capital. The amount of tax benefits or deficiencies recognized in income tax expense depends on the number of options exercised, the exercise price and the stock price at the time the options are exercised.\nThe efficiency ratio for the three months ended December 31, 2017 was 65.06% compared to 52.82% for the three months ended December 31, 2016. The increase in the efficiency ratio reflects the Company paying a $1,000 year-end bonus to most non-management employees in three months ended December 31, 2017 and the increase in the ESOP expense discussed above.\nYear Ended December 31, 2017 Results\nNet income for 2017 was $14.96 million compared to $16.35 million for 2016, a decrease of 8.47%. The decrease in earnings is primarily due to a $2.05 million increase in income tax expense which occurred because of a decrease in the Company’s deferred income tax assets that resulted when the federal corporate tax rate was lowered from 35% to 21% in December. Excluding the write-down of the deferred income tax assets, net income would have been $17.01 million for the year ended December 31, 2017.\nFor the year ended December 31, 2017, net interest income was $58.74 million compared to $58.23 million for the year ended December 31, 2016. Total interest income increased to $68.33 million for the year ended December 31, 2017 from $66.07 million for the year ended December 31, 2016. Interest income on loans grew by $3.98 million, or 7.77%, to $55.14 million for the year ended December 31, 2017, primarily because of a $152.98 million increase in the loan portfolio. This increase was offset by a reduction of $1.84 million in interest earned on investment securities, which occurred due to a reduction in investment securities. Total interest expense increased to $9.59 million for the year ended December 31, 2017 from $7.84 million for the year ended December 31, 2016, primarily due to the $1.73 million increase in interest expense on deposits. The $1.73 million increase in interest expense on deposits occurred primarily because of a $104.10 million increase in total deposits. Provision for loan losses decreased to $52,000 for the year ended December 31, 2017 compared to $310,000 for the year ended December 31, 2016 primarily because of a decrease in the amount of non-performing assets and relatively low levels of loan losses.\nNoninterest income was $3.85 million for the year ended December 31, 2017 compared to $4.09 million for the year ended December 31, 2016. This decrease in noninterest income was primarily due to a $207,000 reduction in the gain on sale of loans.\nNoninterest expense was $36.47 million for the year ended December 31, 2017 compared to $34.88 million for the year ended December 31, 2016. The increase in noninterest expense was primarily due to a $1.02 million increase in salaries and employee benefits, which resulted from a $1,000 year-end bonus paid to most non-management employees to share the benefits which the Company will receive from the reduction in the corporate tax rate from 35% to 21% and the increase in ESOP expense discussed above.\nIncome tax expense rose by $315,000 to $11.10 million for the year ended December 31, 2017 compared to $10.79 million for the year ended December 31, 2016. Income tax expense in 2017 includes a $2.05 million charge for the decrease in the Company’s tax deferred income tax assets that resulted when the federal corporate tax rate was lowered from 35% to 21% in December. Income tax expense also included a $1.05 million tax benefit related to the exercise of stock options described above.\nAssets and Equity\nTotal assets increased to $2.004 billion at December 31, 2017 from $1.878 billion at December 31, 2016. Loans receivable grew by $153.0 million or 11.45% to $1.489 billion at December 31, 2017 from $1.336 billion at December 31, 2016 as residential mortgage loan originations exceeded loan repayments and sales. Securities sold under agreements to repurchase declined to $30.00 million at December 31, 2017 from $55.00 million at December 31, 2016 as the Company paid off maturing borrowings. The growth in loans receivable and the decrease in securities sold under agreements to repurchase was funded primarily by a $104.10 million increase in deposits, $38.20 million received from Federal Home Loan Bank advances and a $29.18 million decrease in cash and cash equivalents. Deposits increased by 6.97% to $1.597 billion at December 31, 2017 from $1.493 billion at December 31, 2016. Total stockholders’ equity increased to $234.85 million at December 31, 2017 from $229.79 million at December 31, 2016. The increase in stockholders’ equity occurred as the Company’s net income for the year exceeded dividends paid to shareholders.\nCapital Management\nFor the quarter ended December 31, 2017, the Company did not repurchase any shares under its previously announced seventh repurchase program, which permits the repurchase of up to 275,000 shares or approximately 3% of the current outstanding shares. The Company uses share repurchases as part of its overall program to enhance shareholder value. In evaluating the share repurchase programs, the Company considers the effect of repurchases on its tangible book value per share. At the Company’s current share price level, the amount of dilution to tangible book value may continue to limit the Company’s share repurchases. The Company will continue to closely monitor this issue and, depending on market and other conditions, will conduct repurchases when it makes financial sense.\nAs of December 31, 2017, the Company has 410,343 outstanding, exercisable stock options. The exercise of options would increase the number of shares outstanding, which among other things, would reduce earnings per share.\nAsset Quality\nTotal delinquent loans 90 days or more past due and not accruing totaled $1.67 million (5 loans) at December 31, 2017, compared to $1.40 million (7 loans) at December 31, 2016. Non-performing assets totaled $4.23 million at December 31, 2017 compared to $4.56 million at December 31, 2016. The ratio of non-performing assets to total assets decreased to 0.21% at December 31, 2017 from 0.24% at December 31, 2016. The allowance for loan losses at December 31, 2017 was $2.55 million and represented 0.17% of total loans compared to $2.45 million and 0.18% of total loans as of December 31, 2016.\nAbout Us\nTerritorial Bancorp Inc., headquartered in Honolulu, Hawaii, is the stock holding company for Territorial Savings Bank. Territorial Savings Bank is a state chartered savings bank which was originally chartered in 1921 by the Territory of Hawaii. Territorial Savings Bank conducts business from its headquarters in Honolulu, Hawaii and has 29 branch offices in the state of Hawaii. For additional information, please visit the Company’s website at: https://www.territorialsavings.net .\nForward-looking statements - this earnings release contains forward-looking statements, which can be identified by the use of words such as “estimate,” “project,” “believe,” “intend,” “anticipate,” “plan,” “seek,” “expect,” “will,” “may” and words of similar meaning. These forward-looking statements include, but are not limited to:\nstatements of our goals, intentions and expectations; statements regarding our business plans, prospects, growth and operating strategies; statements regarding the asset quality of our loan and investment portfolios; and estimates of our risks and future costs and benefits.\nThese forward-looking statements are based on our current beliefs and expectations and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are beyond our control. In addition, these forward-looking statements are subject to assumptions with respect to future business strategies and decisions that are subject to change. We are under no duty to and do not take any obligation to update any forward-looking statements after the date of this earnings release.\nThe following factors, among others, including those set forth in the Company’s filings with the Securities and Exchange Commission, could cause actual results to differ materially from the anticipated results or other expectations expressed in the forward-looking statements:\ngeneral economic conditions, either nationally, internationally or in our market areas, that are worse than expected; competition among depository and other financial institutions; inflation and changes in the interest rate environment that reduce our margins or reduce the fair value of financial instruments; adverse changes in the securities markets; changes in laws or government regulations or policies affecting financial institutions, including changes in regulatory fees and capital requirements; our ability to enter new markets successfully and capitalize on growth opportunities; our ability to successfully integrate acquired entities, if any; changes in consumer spending, borrowing and savings habits; changes in market and other conditions that would affect our ability to repurchase our shares of common stock; changes in accounting policies and practices, as may be adopted by the bank regulatory agencies, the Financial Accounting Standards Board, the Securities and Exchange Commission and the Public Company Accounting Oversight Board; changes in our organization, compensation and benefit plans; changes in our financial condition or results of operations that reduce capital available to pay dividends; and changes in the financial condition or future prospects of issuers of securities that we own.\nBecause of these and a wide variety of other uncertainties, our actual future results may be materially different from the results indicated by these forward-looking statements.\nTerritorial Bancorp Inc. and Subsidiaries Consolidated Statements of Income (Unaudited) (Dollars in thousands, except per share data) Three Months Ended Year Ended December 31 December 31 2017 2016 2017 2016 Interest income: Loans $ 14,267 $ 13,108 $ 55,144 $ 51,168 Investment securities 3,198 3,244 12,526 14,365 Other investments 133 129 663 540 Total interest income 17,598 16,481 68,333 66,073 Interest expense: Deposits 2,207 1,570 7,666 5,933 Advances from the Federal Home Loan Bank 326 263 1,105 1,035 Securities sold under agreements to repurchase 164 220 818 876 Total interest expense 2,697 2,053 9,589 7,844 Net interest income 14,901 14,428 58,744 58,229 Provision for loan losses 50 91 52 310 Net interest income after provision for loan losses 14,851 14,337 58,692 57,919 Noninterest income: Service fees on loan and deposit accounts 472 538 1,962 1,960 Income on bank-owned life insurance 226 239 907 966 Gain on sale of investment securities — 120 431 370 Gain on sale of loans 45 102 199 406 Other 113 72 347 392 Total noninterest income 856 1,071 3,846 4,094 Noninterest expense: Salaries and employee benefits 6,360 4,644 21,614 20,591 Occupancy 1,498 1,464 5,937 5,749 Equipment 984 883 3,614 3,566 Federal deposit insurance premiums 157 147 605 743 Other general and administrative expenses 1,253 1,049 4,704 4,230 Total noninterest expense 10,252 8,187 36,474 34,879 Income before income taxes 5,455 7,221 26,064 27,134 Income taxes 3,288 2,859 11,102 10,787 Net income $ 2,167 $ 4,362 $ 14,962 $ 16,347 Basic earnings per share $ 0.23 $ 0.48 $ 1.61 $ 1.78 Diluted earnings per share $ 0.23 $ 0.46 $ 1.57 $ 1.74 Cash dividends paid per common share $ 0.50 $ 0.38 $ 1.20 $ 0.92 Basic weighted-average shares outstanding 9,342,744 9,175,267 9,273,783 9,093,385 Diluted weighted-average shares outstanding 9,559,630 9,409,934 9,532,724 9,311,975\nTerritorial Bancorp Inc. Non-GAAP Information Net income and fully-diluted earnings per share, excluding the impact of the Tax Cut and Jobs Act, are non-GAAP measures. The following table reconciles the measures on a GAAP basis to the non-GAAP results. Management believes that these are useful financial measures as they enable investors and others to better assess the Company's operating performance, as the effects of the Tax Cut and Jobs Act will differ among companies. Net Fully-diluted Income Earnings (in millions) Per Share As reported $ 2,167 $ 0.23 Impact of changes in corporate tax rate under the Tax Cut and Jobs Act $ 2,054 $ 0.21 Results Excluding Impact of the Tax Cut and Jobs Act $ 4,221 $ 0.44 The impact of the Tax Cut and Jobs Act is related to the write-down of deferred income tax assets that resulted when the corporate tax rate was lowered from 35% to 21%.\nTerritorial Bancorp Inc. and Subsidiaries Consolidated Balance Sheets (Unaudited) (Dollars in thousands, except per share data) December 31, December 31, 2017\n2016 ASSETS Cash and cash equivalents $ 32,089 $ 61,273 Investment securities available for sale 2,851 — Investment securities held to maturity, at amortized cost (fair value of $406,663 and $407,992 at December 31, 2017 and December 31, 2016, respectively). 404,792 407,656 Loans held for sale 403 1,601 Loans receivable, net 1,488,971 1,335,987 Federal Home Loan Bank stock, at cost 6,541 4,945 Federal Reserve Bank stock, at cost 3,103 3,095 Accrued interest receivable 5,142 4,732 Premises and equipment, net 5,721 4,327 Bank-owned life insurance 44,201 43,294 Income taxes receivable 1,571 122 Deferred income tax assets, net 4,609 7,905 Prepaid expenses and other assets 3,852 2,625 Total assets $ 2,003,846 $ 1,877,562 LIABILITIES AND STOCKHOLDERS’ EQUITY Liabilities: Deposits $ 1,597,295 $ 1,493,200 Advances from the Federal Home Loan Bank 107,200 69,000 Securities sold under agreements to repurchase 30,000 55,000 Accounts payable and accrued expenses 26,390 23,258 Income taxes payable 1,483 1,616 Advance payments by borrowers for taxes and insurance 6,624 5,702 Total liabilities 1,768,992 1,647,776 Stockholders’ Equity: Preferred stock, $.01 par value; authorized 50,000,000 shares, no shares issued or outstanding — — Common stock, $.01 par value; authorized 100,000,000 shares; issued and outstanding 9,915,058 and 9,778,974 shares at December 31, 2017 and December 31, 2016, respectively. 99 98 Additional paid-in capital 73,050 71,914 Unearned ESOP shares (5,383 ) (5,872 ) Retained earnings 172,782 168,962 Accumulated other comprehensive loss (5,694 ) (5,316 ) Total stockholders’ equity 234,854 229,786 Total liabilities and stockholders’ equity $ 2,003,846 $ 1,877,562\nTerritorial Bancorp Inc. and Subsidiaries Selected Financial Data (Unaudited) Three Months Ended December 31, 2017 2016 Performance Ratios (annualized): Return on average assets 0.43% 0.93% Return on average equity 3.61% 7.52% Net interest margin on average interest earning assets 3.11% 3.20% Efficiency Ratio 65.06% 52.82% At December At December 31, 2017 31, 2016 Selected Balance Sheet Data: Book value per share (1) $23.69 $23.50 Stockholders' equity to total assets 11.72% 12.24% Asset Quality (Dollars in thousands): Delinquent loans 90 days past due and not accruing $1,670 $1,401 Non-performing assets (2) $4,227 $4,559 Allowance for loan losses $2,548 $2,452 Non-performing assets to total assets 0.21% 0.24% Allowance for loan losses to total loans 0.17% 0.18% Allowance for loan losses to non-performing assets 60.28% 53.78% Note: (1) Book value per share is equal to stockholders' equity divided by number of shares issued and outstanding (2) Non-performing assets consist of non-accrual loans and real estate owned. Amounts are net of charge-offs Contact:\nWalter Ida\n(808) 946-1400\nSource:Territorial Bancorp Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/13018f33-52c3-4b8b-8246-83085977ce98"], "published": "2018-01-26T00:30:00.000+02:00", "crawled": "2018-01-26T01:40:14.000+02:00", "highlightTitle": ""}