{"organizations": [], "uuid": "75c4c097d877734a8e14b4fa14c4834f75f703ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/18/104661288-GettyImages-634604260.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/07/steve-bannon-apologizes-for-anti-trump-comments-in-fire-and-fury.html", "country": "US", "domain_rank": 767, "title": "Steve Bannon apologizes for anti-Trump comments in 'Fire and Fury'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.946, "site_type": "news", "published": "2018-01-07T18:44:00.000+02:00", "replies_count": 0, "uuid": "75c4c097d877734a8e14b4fa14c4834f75f703ce"}, "author": "Marty Steinberg", "url": "https://www.cnbc.com/2018/01/07/steve-bannon-apologizes-for-anti-trump-comments-in-fire-and-fury.html", "ord_in_thread": 0, "title": "Steve Bannon apologizes for anti-Trump comments in 'Fire and Fury'", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "steve bannon", "sentiment": "negative"}, {"name": "axio", "sentiment": "neutral"}, {"name": "michael wolff", "sentiment": "none"}, {"name": "donald jr", "sentiment": "none"}, {"name": "bannon", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "trump white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Steve Bannon said Sunday he \"regrets\" his comments made to author Michael Wolff in his explosive book \"Fire and Fury\" that has shaken the Trump White House.\n\"My support is also unwavering for the president and his agenda,\" Bannon said in a statement, first reported by Axios , the political news website. NBC News later confirmed the statement.\nAxios tweet 1\nBannon said he also regrets not speaking out sooner about\n\"inaccurate reporting\" about President Donald Trump's son Donald Jr.\nAxios tweet 2\nIn Wolff's book, which went on sale Friday, Bannon said the June 2016 meeting at Trump Tower between the president's eldest son and a Russian lawyer was \"treasonous\" and \"unpatriotic.\"\nWolff also Quote: d Bannon as saying: \"They're going to crack Don Junior like an egg on national TV.'\"\nIn his statement, Bannon said: \"Donald Trump, Jr. is both a patriot and a good man. He has been relentless in his advocacy for his father and the agenda that has helped turn our country around.\"\nHe said his comments were not aimed at Trump Jr.\n\"My comments were aimed at Paul Manafort , a seasoned campaign professional with experience and knowledge of how the Russians operate,\" Bannon said. \"He should have known they are duplicitous, cunning and not our friends.\"\nManafort, Trump's campaign manager from June to August 2016, was indicted in October in special counsel Robert Mueller 's investigation of Russian collusion with the president's campaign in the 2016 presidential election.\nBannon's comments to Wolff, which were first reported Wednesday by The Guardian, provoked Trump to say that Bannon had \"lost his mind.\"\nBannon, who headed the Trump presidential campaign, left his job as White House political advisor in August by mutual consent with the administration.\n\"When he was fired, he not only lost his job, he lost his mind, \" Trump said Wednesday in a statement.\nThe Guardian obtained a copy of the book nearly a week before it had been scheduled to go on sale. The publisher, Henry Holt & Co., moved up the sale date to Friday after attorneys for Trump threatened to seek a cease and desist order to stop the sales .\nWolff's book describes Trump's behavior as childlike, and it questions his mental fitness. That apparently prompted an extraordinary statement on Saturday by Trump defending his own mental health.\n\"Actually, throughout my life, my two greatest assets have been mental stability and being, like, really smart,\" Trump tweeted.\n\"I went from VERY successful businessman, to top T.V. Star ... to President of the United States (on my first try). I think that would qualify as not smart, but genius....and a very stable genius at that!\"\nTrump tweet\nIn lambasting the book a day earlier, Trump derided Bannon as \"Sloppy Steve.\"\n\"Michael Wolff is a total loser who made up stories in order to sell this really boring and untruthful book,\" Trump said. \"He used Sloppy Steve Bannon, who cried when he got fired and begged for his job. Now Sloppy Steve has been dumped like a dog by almost everyone. Too bad!\"\nTrump tweet Sloppy Steve\nRead Axios' full story here.", "external_links": [], "published": "2018-01-07T18:44:00.000+02:00", "crawled": "2018-01-07T18:44:53.032+02:00", "highlightTitle": ""}