{"organizations": [], "uuid": "4eda4c5671757be52857e5d5cf5f1f333855c975", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226932712&w=1200&r=LYNXMPEE0U0SY", "site_section": "http://feeds.reuters.com/reuters/environment\r", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-hongkong-ivory/hong-kong-lawmakers-following-china-vote-to-ban-ivory-sales-idUSKBN1FK1NA", "country": "US", "domain_rank": 408, "title": "Hong Kong lawmakers, following China, vote to ban ivory sales", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:15:00.000+02:00", "replies_count": 0, "uuid": "4eda4c5671757be52857e5d5cf5f1f333855c975"}, "author": "", "url": "https://www.reuters.com/article/us-hongkong-ivory/hong-kong-lawmakers-following-china-vote-to-ban-ivory-sales-idUSKBN1FK1NA", "ord_in_thread": 0, "title": "Hong Kong lawmakers, following China, vote to ban ivory sales", "locations": [], "entities": {"persons": [{"name": "flora", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "convention on international trade in endangered species of wild fauna", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 12:19 PM / in 8 hours Hong Kong lawmakers, following China, vote to ban ivory sales Reuters Staff 3 Min Read \nHONG KONG (Reuters) - Lawmakers in Chinese-ruled Hong Kong voted on Wednesday to ban ivory sales in the world’s largest ivory retail market, a move wildlife activists hailed as vital towards halting the slaughter of elephants. \nThe vote in the former British colony, where ivory has traded for more than 150 years, came a month after China, the world’s largest importer and end user of elephant tusks, banned their sale. More than 90 percent of people buying ivory in Hong Kong are from mainland China. \nHong Kong adheres to the Convention on International Trade in Endangered Species of Wild Fauna and Flora (CITES), which began to regulate the international ivory trade in the 1970s and has banned such trade since 1990. \nOnly ivory hunted before 1990 is allowed to be traded when it is accompanied by a pre-convention certificate, but trade in “pre-convention” ivory has been thriving in China and Hong Kong since 1975. \nEnvironmental activists have long asserted that Hong Kong’s legal ivory market has enabled traders to launder illegal products. \nAfter the Hong Kong bill is enacted in coming months, pre-convention ivory imports and re-exports into and out of Hong Kong will be prohibited. Trade will be phased out over the next three and a half years as ivory possession licences expire. Supporters of an ivory ban protest outside the Legislative Council in Hong Kong, China January 31, 2018. REUTERS/Bobby Yip \nWildAid, a wildlife non-government organization, estimates up to 30,000 elephants are killed illegally every year. \nHong Kong lawmaker Elizabeth Quat said the vote marked a great day for elephants but cautioned that action was needed. Supporters of an ivory ban protest outside the Legislative Council in Hong Kong, China January 31, 2018. REUTERS/Bobby Yip \n“It’s now up to our law enforcement agencies to ensure the ban is properly implemented,” she said. \nThe bill will also increase penalties for wildlife crimes. Activists say Hong Kong’s leniency has made it attractive to mainland China for illegal products such as ivory, rhino horns and pangolin scales. \nA Hong Kong government-led operation in last year found two ivory traders had sold chopsticks made from ivory obtained after the 1990 ban. \nOne of the traders, who was fined HK$8,000 ($1,000) in January, had sat on a government panel giving advice on protecting endangered species. Reporting by Chermaine Lee, writing by Farah Master; Editing by Nick Macfie", "external_links": [], "published": "2018-01-31T14:15:00.000+02:00", "crawled": "2018-01-31T14:36:29.003+02:00", "highlightTitle": ""}