{"organizations": [], "uuid": "c03f442a1b44813a6d33b2fcc3fd67b8214647ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221450476&w=1200&r=LYNXMPEE0B0XG", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-olympics-2018-figs-scoring/despite-reforms-figure-skating-battles-scoring-flaws-idUSKBN1F11L2", "country": "US", "domain_rank": 408, "title": "Despite reforms, figure skating battles scoring flaws", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T21:26:00.000+02:00", "replies_count": 0, "uuid": "c03f442a1b44813a6d33b2fcc3fd67b8214647ba"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-olympics-2018-figs-scoring/despite-reforms-figure-skating-battles-scoring-flaws-idUSKBN1F11L2", "ord_in_thread": 0, "title": "Despite reforms, figure skating battles scoring flaws", "locations": [], "entities": {"persons": [{"name": "david pelletier", "sentiment": "none"}, {"name": "brian boitano", "sentiment": "none"}, {"name": "pelletier", "sentiment": "none"}, {"name": "jamie sale", "sentiment": "none"}], "locations": [{"name": "salt lake city", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOSCOW (Reuters) - At the 2002 Salt Lake City Olympics, one of the biggest judging scandals in figure skating history deprived Canadian pair Jamie Sale and David Pelletier of their moment of glory.\nThe Canadians finished second behind a Russian pair in an alleged vote-trading scheme. When the scandal was exposed, Sale and Pelletier were awarded golds to share with the Russians, a rare case of a ranking being revised during an Olympics.\nThe scandal ushered in sweeping reforms in the scoring system, mostly for the better, but the current system still has its drawbacks.\n“The biggest problem... is people can’t understand it,” former skater and 1988 Olympic champion Brian Boitano told reporters on a conference call last month.\n“It’s difficult for the audience. And this is a sport that needs the audience to get behind it.”\nThe old system, in which judges ranked skaters using a 6.0 scale for technical merit and artistic performance, was replaced by a more complex points system meant to better calibrate performances.\nNow, every program element has its own numerical base value and skaters are rewarded for executing difficult moves. Skaters are given a technical and a presentation score. Their cumulative tally can reach more than 200 points.\n“What I like about the system is that as an athlete, when you are working so hard to win, the difficulty that goes into your elements is actually quantified,” Sale told Reuters. “You’re rewarded for it.”\nBut Sale said the emphasis on accumulating points has seen the sport lose “a little bit of its artistry, a little bit of freeness to tell stories and be more creative.”\nPelletier said the revised scoring system had challenged skaters to expand the sport’s technical boundaries.\n“It pushes skaters to execute technical elements that are more complicated than those we were doing,” said Pelletier, who retired from competition after the Salt Lake City Games.\n“Of course, the drama of a perfect mark has been taken away, but things had to evolve. People watch figure skating for the athleticism and emotion that it can bring more than for the marks the athletes can receive.”\nFor American skater Jason Brown, the current scoring system makes skaters devise their programs with points in mind.\n“I think it’s definitely that mix of strategy, science and mathematics to maximize your points and utilize every asset that you bring to the ice,” Brown told reporters last month.\nSkaters, he said, could play to their strengths and “really build their program and arsenal around maximizing those points”.\nANONYMOUS NO MORE The scoring continued to evolve after more recent scandals.\nWhen Adelina Sotnikova upset reigning Olympic champion Kim Yuna to win gold on home ice at the 2014 Sochi Games, several commentators thought the South Korean had out-skated the Russian.\nThe situation prompted online petitions asking the International Skating Union (ISU) to determine whether the judging had been skewed in favor of the crowd favorite.\nTwo years later, the ISU abolished judges’ anonymity, which had been introduced in the aftermath of the Salt Lake City scandal.\nThe news came as a relief to skaters who viewed it as a way to bring more accountability and transparency to the sport.\n“I don’t think the scores should be (anonymous),” American figure skater Adam Rippon, who finished fifth at the Grand Prix Final in Japan in December, told Reuters.\n“I think a judge should be able to explain their marks, if only for the fact that it helps improve the skater.”\nAdditional reporting by Elaine Lies in Nagoya and Polina Devitt in Moscow; Editing by John O'Brien\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T21:26:00.000+02:00", "crawled": "2018-01-13T14:51:49.009+02:00", "highlightTitle": ""}