{"organizations": [], "uuid": "0d0fe06853696ee63cafd099f439c66279ecfbec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 19, "shares": 19, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218896400&w=1200&r=LYNXMPEE010XV", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-iran-rallies-leadership-analysis/iran-protests-could-hurt-clerics-but-rouhani-has-most-to-lose-say-insiders-idUKKBN1ER1RZ", "country": "US", "domain_rank": 408, "title": "Iran protests could hurt clerics but Rouhani has most to lose, say insiders", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T23:47:00.000+02:00", "replies_count": 0, "uuid": "0d0fe06853696ee63cafd099f439c66279ecfbec"}, "author": "", "url": "https://uk.reuters.com/article/uk-iran-rallies-leadership-analysis/iran-protests-could-hurt-clerics-but-rouhani-has-most-to-lose-say-insiders-idUKKBN1ER1RZ", "ord_in_thread": 0, "title": "Iran protests could hurt clerics but Rouhani has most to lose, say insiders", "locations": [], "entities": {"persons": [{"name": "rouhani", "sentiment": "negative"}, {"name": "reuters/tony gentile", "sentiment": "none"}, {"name": "hassan rouhani", "sentiment": "none"}, {"name": "ayatollah ali khamenei", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 9:50 PM / Updated 7 hours ago Iran protests could hurt clerics but Rouhani has most to lose, say insiders Reuters Staff 6 Min Read \nDUBAI (Reuters) - Iranian authorities are concerned that nationwide unrest will undermine the clerical establishment and want to stamp out the protests quickly, senior government officials say. But the person with the most to lose is President Hassan Rouhani. Opponents of Iranian President Hassan Rouhani hold a protest outside the Iranian embassy in Rome, Italy, January 2, 2018. REUTERS/Tony Gentile. \nWhile several senior officials said there was concern that prolonged unrest would damage the legitimacy and influence of the country’s religious leaders, few insiders see the unrest as an existential threat to that leadership, which has ruled since the 1979 revolution and is now controlled by Supreme Leader Ayatollah Ali Khamenei, the ultimate authority in Iran’s system of dual clerical and republican rule. \nThe biggest loser, they say, is likely to be Rouhani, who is much more closely tied to the country’s economic policies. \n“Of course Rouhani and his government will have less power afterwards, especially because his economic policy was criticized during the unrest,” said political analyst Hamid Farahvashian. \n“He will be a lame-duck president and Khamenei will have more power.” \nMuch of the protesters’ anger has focused on what Rouhani and his government have failed to deliver: an economic boom promised as the payoff for the 2015 deal that curbed Iran’s disputed nuclear programme in return for world powers lifting sanctions. \nProtesters are angry that Iran’s youth unemployment rate is edging towards 30 percent, want higher wages and an end to alleged graft. They have chanted slogans against all of Iran’s leaders, including the clerical elite, and attacked police vehicles, banks and mosques as the unrest widened. \n“The continuation of the protests will lead to a legitimacy crisis,” said one senior official close to Rouhani, asking not to be named due to the sensitivity of the issue. \n“People have economic demands ... of course these demands should be taken seriously ... of course the establishment should listen to the people, but all these can be discussed in a calm atmosphere,” the official said. \nSome conservatives have pushed for a hardline approach, even though bloodshed could fuel more protests in the largest wave of demonstrations since nationwide unrest in 2009. \n“So far, security forces have not tried to prevent the demonstrations .... but this will change if (Khamenei) calls for an end to the street protests and demonstrators defy his call,” said one former Iranian official from the reformist camp. \nEven if the unrest is quelled, the demands of tens of thousands of restless working class youths who have taken to the streets are unlikely to dissipate. \nKhamenei spoke publicly for the first time about the crisis on Tuesday, accusing Iran’s enemies of stirring unrest but saying no more. A statement on his website said he would address the nation about the events “when the time is right”. \nTHE LIMITS OF ROUHANI‘S POWER \nThe protesters have little chance of toppling the clerical leaders, who appear to be retaining control of the military, police, and security forces and have no compunction about using them, according to one U.S. official following the developments. \nRouhani, who was elected in 2013, is more exposed. He is seen as a pragmatist at odds with Iran’s hardliners and has said in response to the protests that Iranians have a right to criticise the authorities. \nBut he has a fight on his hands because of growing resentment over high prices and allegations of corruption. \n“His power is limited in Iran’s ruling system. Public discontent is increasing ... people are losing their faith in the establishment system,” a third Iranian official said. “The leaders are well aware of this fact and its dangerous consequences.” \nU.S. officials fear the likeliest outcome of the protests is discrediting what one called Rouhani’s “moderate brand of moderation” and a harsher crackdown by the clerical authorities. \n“It’s an open question whether Rouhani ever intended to keep any of his promises, but he hasn’t delivered, especially on the economic front, and that means he has no popular support and is expendable to Khamenei,” said a second U.S. official, who spoke on condition of anonymity to discuss intelligence matters. \n“He’s likely to be one of the casualties, though maybe not immediately.” \nRouhani has blamed his predecessor and the United States, Iran’s long-time adversary, for the economy’s shortcomings. \nBut his government has also backtracked on planned fuel price rises and promised more jobs. \nRouhani may need to spend more money to create more employment if he is to ease discontent, and could risk antagonising powerful interests if he tries to address allegations of corruption. \nHis vulnerability and the deep divisions in Iran’s hierarchy have fuelled suspicions among some of his sympathizers that conservative rivals may have played a hand in the crisis. \n“It was a coup against Rouhani and his achievements ... The aim was to harm Rouhani,” said Saeed Leylaz, a political analyst close to the pro-reform movement. \nBut a fourth official in Tehran said the nationwide protests had united Iran’s leadership. \n“At this point it is not important whether a political faction initiated the unrest to harm the rival group,” the official said. \n“The unrest was hijacked by our enemies ... that is why all factions have united to protect the Islamic Republic.” Additional reporting by John Walcott in Washington and Andrew Torchia in Dubai; Writing by Michael Georgy; Editing by Nick Tattersall", "external_links": [], "published": "2018-01-02T23:47:00.000+02:00", "crawled": "2018-01-03T00:11:46.005+02:00", "highlightTitle": ""}