{"organizations": [], "uuid": "5a9e7b4d63ec037d95eed101ed42f1be36fc136d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-columbia-bank-promotes-lisa-dow-to-executive-vice-president-chief-risk-officer.html", "country": "US", "domain_rank": 767, "title": "Columbia Bank Promotes Lisa Dow to Executive Vice President, Chief Risk Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.124, "site_type": "news", "published": "2018-01-18T20:11:00.000+02:00", "replies_count": 0, "uuid": "5a9e7b4d63ec037d95eed101ed42f1be36fc136d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-columbia-bank-promotes-lisa-dow-to-executive-vice-president-chief-risk-officer.html", "ord_in_thread": 0, "title": "Columbia Bank Promotes Lisa Dow to Executive Vice President, Chief Risk Officer", "locations": [], "entities": {"persons": [{"name": "lisa dow", "sentiment": "negative"}, {"name": "dow", "sentiment": "none"}, {"name": "hadley robbins", "sentiment": "none"}, {"name": "lisa", "sentiment": "none"}], "locations": [{"name": "tacoma", "sentiment": "none"}, {"name": "wash.", "sentiment": "none"}, {"name": "columbia", "sentiment": "none"}, {"name": "columbia ba", "sentiment": "none"}], "organizations": [{"name": "columbia bank", "sentiment": "negative"}, {"name": "columbia bank promotes lisa dow", "sentiment": "negative"}, {"name": "columbia", "sentiment": "none"}, {"name": "west coast bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TACOMA, Wash., Jan. 18, 2018 /PRNewswire/ -- Columbia Bank today announced that Lisa Dow has been appointed to the newly created position of Executive Vice President, Chief Risk Officer of Columbia Bank. Ms. Dow has 35 years of banking experience and previously served as Senior Vice President, Senior Credit Administrator of Columbia Bank.\nHadley Robbins, President and Chief Executive Officer of Columbia, said, \"The Chief Risk Officer will play an instrumental role in building a comprehensive risk management process that positions Columbia for future growth. Since joining Columbia in 2013 through our acquisition of West Coast Bank, Lisa has demonstrated excellent leadership skills and the ability to effectively work with all areas of our organization. Her strategic thinking, communication skills and decades of banking experience make her well suited to build, lead and manage an Enterprise Risk Management program for Columbia. On behalf of the executive team and Board, we congratulate her on her well-deserved promotion.\"\nMs. Dow served as SVP, Senior Credit Administrator of Columbia Bank since 2013. In this role, Ms. Dow was responsible for credit approval for a $2 billion portfolio of commercial and agricultural loans, while also serving on a number of management committees. Prior to joining Columbia Bank, Ms. Dow served as Senior Vice President, Regional Credit Administrator & Credit Services Manager for West Coast Bank for 14 years, where she managed a number of credit-related teams and projects including Special Assets, OREO, Real Estate Services, Loan Policy, and Concentration Reporting. Earlier in her career, Ms. Dow held lending and relationship management positions with Bank of Vancouver and Bank of America.\nMs. Dow holds an MBA, Finance from the University of California at Berkeley and a BA, Economics & International Business from the University of Puget Sound.\nAbout Columbia\nHeadquartered in Tacoma, Washington, Columbia Banking System, Inc. (NASDAQ: COLB) is the holding company of Columbia Bank, a Washington state-chartered full-service commercial bank with locations throughout Washington, Oregon and Idaho. For the eleventh consecutive year, the bank was named in 2017 as one of Puget Sound Business Journal's \"Washington's Best Workplaces.\" Columbia ranked 11 th on the 2018 Forbes list of best banks. More information about Columbia can be found on its website at www.columbiabank.com .\nNote Regarding Forward-Looking Statements\nThis news release includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements include, but are not limited to, descriptions of Columbia's management's expectations regarding future events and developments such as future operating results, growth in loans and deposits, continued success of Columbia's style of banking and the strength of the local economy. The words \"will,\" \"believe,\" \"expect,\" \"intend,\" \"should,\" and \"anticipate\" or the negative of these words or words of similar construction are intended in part to help identify forward looking statements. Future events are difficult to predict, and the expectations described above are necessarily subject to risks and uncertainties, many of which are outside our control, that may cause actual results to differ materially and adversely. In addition to discussions about risks and uncertainties set forth from time to time in Columbia's filings with the Securities and Exchange Commission, available at the SEC's website at www.sec.gov and the Company's website at www.columbiabank.com , including the \"Risk Factors,\" \"Business\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" sections of our annual reports on Form 10-K and quarterly reports on Form 10-Q, (as applicable), factors that may cause actual results to differ materially from those contemplated by such forward-looking statements include, among others, the following: (1) local, national and international economic conditions may be less favorable than expected or have a more direct and pronounced effect on Columbia than expected and adversely affect Columbia's ability to continue its internal growth at historical rates and maintain the quality of its earning assets; (2) changes in interest rates may reduce interest margins more than expected and negatively affect funding sources; (3) projected business increases following strategic expansion or opening or acquiring new branches may be lower than expected; (4) costs or difficulties related to the integration of acquisitions may be greater than expected; (5) competitive pressure among financial institutions may increase significantly; and (6) legislation or regulatory requirements or changes may adversely affect the businesses in which Columbia is engaged. We believe the expectations reflected in our forward-looking statements are reasonable, based on information available to us on the date hereof. However, given the described uncertainties and risks, we cannot guarantee our future performance or results of operations and you should not place undue reliance on these forward-looking statements which speak only as of the date hereof. We undertake no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by the federal securities laws. The factors noted above and the risks and uncertainties described in our SEC filings should be considered when reading any forward-looking statements in this release.\nColumbia Banking System Contacts:\nHadley S. Robbins, President and Chief Executive Officer\nClint E. Stein, Executive Vice President and Chief Operating Officer\nInvestor Relations Contact:\nInvestorRelations@columbiabank.com\n(253) 305-1921\nMedia Contact:\nMoira Conlon\nFinancial Profiles, Inc.\n(310) 622- 8220\nView original content with multimedia: http://www.prnewswire.com/news-releases/columbia-bank-promotes-lisa-dow-to-executive-vice-president-chief-risk-officer-300584730.html\nSOURCE Columbia Banking System, Inc.", "external_links": ["http://www.columbiabank.com/", "http://www.sec.gov/", "http://www.prnewswire.com/news-releases/columbia-bank-promotes-lisa-dow-to-executive-vice-president-chief-risk-officer-300584730.html"], "published": "2018-01-18T20:11:00.000+02:00", "crawled": "2018-01-18T22:04:00.014+02:00", "highlightTitle": ""}