{"organizations": [], "uuid": "6287b118d2d53631b1e6b79fed2997c7a819ca01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/07/104152609-AP_16286553629960.1910x1000.jpg", "site_section": "http://www.whatreallyhappened.com/rss.xml", "section_title": "WHAT REALLY HAPPENED", "url": "https://www.cnbc.com/2016/12/13/americas-dirty-little-secret-42-million-are-suffering-from-hunger.html", "country": "US", "domain_rank": 767, "title": "America's dirty little secret: 42 million people are suffering from hunger", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T01:46:00.000+02:00", "replies_count": 0, "uuid": "6287b118d2d53631b1e6b79fed2997c7a819ca01"}, "author": "malterwitty", "url": "https://www.cnbc.com/2016/12/13/americas-dirty-little-secret-42-million-are-suffering-from-hunger.html", "ord_in_thread": 0, "title": "America's dirty little secret: 42 million people are suffering from hunger", "locations": [], "entities": {"persons": [], "locations": [{"name": "america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "u.s. department of agriculture", "sentiment": "none"}, {"name": "feeding america", "sentiment": "none"}, {"name": "usda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "10:57 AM ET Tue, 13 Dec 2016 | 01:45 \nWhile families across the country gather around the dinner table during this holiday season, there is a different, far less cheery scenario playing out for millions of other Americans. They're the ones who go hungry, and for whom food — and enough of it — is a daily struggle. According to Feeding America, more than 42 million people now suffer from hunger throughout the nation. \nIn the midst of a recovering economy, low unemployment and nearly nonexistent inflation, the fact remains that nearly 1 in 7 Americans still goes to bed hungry each night. According to recent statistics released by the U.S. Department of Agriculture, 15.8 million U.S. households — that's 12.7 percent of the total — didn't have enough food to eat at some point last year, the latest period for which numbers are available. \nThat's a tick down from the 14 percent of households that didn't have adequate food (or what the USDA defines as \"food insecure\") in 2014, but the numbers are still higher than where they were just a decade ago. Adding to the crisis is the fact that by the end of this year, up to 1 million Americans will have lost food-stamp benefits because of changes in the law that affect eligibility. \nStatistics tell the story. Last year the government doled out $74 billion in food-assistance benefits — about double the level of 2008. According to experts, hunger remains a persistent problem because millions of Americans are struggling financially as the result of the crash, and many remain unemployed. A whopping 95 million Americans are now not in the workforce, according to the November jobs report. While many are retirees, a skills gap and other factors are exacerbating the trend. \nAs a result, food banks, soup kitchens, churches and other emergency food providers across the country say they're seeing greater demand than ever. Perhaps more disturbing: An increasing number of working-poor families and the elderly are using these emergency services. \n\"There's still this idea that food banks and soup kitchens are only for the homeless, and that simply is not the case,\" said Margarette Purvis, president and CEO of the Food Bank for New York City, one of the largest and most active food banks in the country. \"In fact, many people are pretty much relying on these resources so that they don't wind up homeless.\" \nAmong the most vulnerable in this climate are children. According to the Center on Budget and Policy Priorities, a nonpartisan research group that focuses on reducing poverty, 20 million children in the United States (nearly 1 in 4) will have received Supplemental Nutrition Assistance Program (SNAP) benefits — better known as food stamps — in 2016. With access to the food these benefits provide, experts say these children are more likely to do better in school, have better health and do better economically as adults than children that live in chronically food-insecure households. Getty Images Low-income residents select free bread and produce at the Community Food Bank of New Jersey on August 28, 2015 in Egg Harbor, New Jersey. \nIf the economic recovery has proved anything, it's that not everyone healed in quite the same way and, in fact, millions of Americans are still struggling financially. That disparity is among the top reasons why hunger remains such an intractable problem. Ross Fraser, a spokesman for Feeding America , the national food bank network that provides food assistance to about 46 million people each year, says this uneven recovery hits the poorest Americans especially hard. \"When the economy gets into trouble, you see people at the low end of the earnings spectrum be the first to suffer,\" he said, \"and they're the last ones for whom life gets better once the economy improves.\" \nEvidence of that scenario is nationwide. What Fraser hears over and over again from Feeding America's food banks is that while more people are working again, \"those numbers disguise the fact that so many of these jobs are paying minimum wage or slightly above,\" he said. \"Without a good income it's a real struggle to feed a family.\" \nIndeed, a recent report by the Economic Policy Institute found that between 2000 and 2015, wages for the bottom 60 percent of male workers were flat or declined and that most of the wage gains have occurred among the highest earners. David Lee, executive director of Feeding Wisconsin, part of the Feeding America network, puts it another way: \"A good-paying job is the best antidote to hunger.\" show chapters 10:01 AM ET Tue, 13 Dec 2016 | 01:37 \nYolanda Vega, 48, knows that all too well. The single mom lives in the East Harlem section of New York City with her 21-year-old son and 17-year-old daughter. She lost her job as a home health aide in October and is now receiving SNAP benefits. \"I don't know what I would do if I didn't have food stamps,\" she said. \"At least with this, I have money to buy food for my kids.\" \nShe gets a little more than $500 a month and manages to make it last by buying just what the family needs. Occasionally, she's able to buy fresh vegetables and fruit at a local farmer's market, where through her SNAP benefits, she gets an extra $2 for every $5 she spends. \"I want to work again, but right now without these food stamps, I would not survive,\" she stressed. \"A good-paying job is the best antidote to hunger.\" -David Lee, Feeding Wisconsin executive director \nAdding to the hunger crisis are changes taking place at the federal and state levels. Eligibility for benefits from SNAP are tightening for some groups or being slashed completely for others. Most unemployed, able-bodied adults without dependents — often referred to as ABAWDs — are limited to three months of benefits every three years, unless they are working 20 hours per week or participating in a job-training program. During the recession, when unemployment was high and job-training programs were scarce, states were able to request waivers for these work requirements, and many governors did just that. \nNow, however, the USDA — the government agency that oversees food stamps programs — reports that more than 40 states will implement the time limits in at least some areas of the state, meaning that millions of people who had been eligible for food stamps no longer are. In fact, the Center on Budget and Policy Priorities estimates that at least 500,000 to 1 million Americans will have lost food-stamp benefits by the end of this year as the time limits go back into place. \nWisconsin is among the states already operating without a waiver. Lee of Feeding Wisconsin says that his state took a release from the time-limit waiver in 2014 and, as a result, 120,000 ABAWDs lost their food stamp eligibility. The official stance of the state for this move, said Lee, was that \"this was the kick in the butt these people needed to get back to work.\" \nThe problem with that argument, he says, is that ABAWDs are often the most marginally employable people to begin with. \"Some have physical or mental dis", "external_links": [], "published": "2018-01-06T01:46:00.000+02:00", "crawled": "2018-01-06T02:30:59.000+02:00", "highlightTitle": ""}