{"organizations": [], "uuid": "854a698414ea399b07cc59fed8c2e60378f0f311", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-3d-systems-and-stryker-team-up-to-advance-personalized-surgery.html", "country": "US", "domain_rank": 767, "title": "3D Systems and Stryker Team Up to Advance Personalized Surgery", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-17T17:00:00.000+02:00", "replies_count": 0, "uuid": "854a698414ea399b07cc59fed8c2e60378f0f311"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-3d-systems-and-stryker-team-up-to-advance-personalized-surgery.html", "ord_in_thread": 0, "title": "3D Systems and Stryker Team Up to Advance Personalized Surgery", "locations": [], "entities": {"persons": [{"name": "stryker team", "sentiment": "negative"}, {"name": "stryker", "sentiment": "negative"}, {"name": "ke", "sentiment": "none"}], "locations": [{"name": "s.c.", "sentiment": "none"}], "organizations": [{"name": "fda", "sentiment": "none"}, {"name": "3d systems", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROCK HILL, S.C., Jan. 17, 2018 /PRNewswire/ -- Today, 3D Systems (NYSE: DDD) and Stryker announced an exclusive distribution partnership for VSP ® (Virtual Surgical Planning) and anatomical models for the craniomaxillofacial specialty. This partnership will drive the availability of personalized surgical planning and techniques to healthcare professionals – saving both surgeons and patients hours in the operating room. 1\nEstablished by 3D Systems, VSP technology received FDA market clearance as a service-based approach to personalized surgery, combining expertise in medical imaging, surgical simulation and 3D printing. The surgeon initiates the process, bringing their clinical knowledge and desired surgical plan to an online web meeting with a 3D Systems biomedical engineer to simulate and plan the surgical procedure. The outcome is a digital plan that is transferred to the operating room via accurate 3D printed patient-specific models, guides and templates.\n\"Collaborating with surgeons to deliver the best possible patient outcomes is of the utmost importance to our company,\" said Kevin McAlea, executive vice president, general manager, metals and healthcare, 3D Systems. \"With the advancement of 3D printing, combined with the surgeon's ability to use our Virtual Surgical Planning and anatomical modeling technologies, a patient's life can be forever changed. It provides surgeons with the ability to have a clear 3D visualization of a patient's anatomy and to develop a customized surgical plan prior to even entering the operating room.\"\nAs a pioneer in the personalized medicine space, 3D Systems has provided VSP or anatomical services in more than 100,000 cases. Stryker's Craniomaxillofacial business specializes in providing patient-specific options and innovative solutions that help drive efficiencies in surgical suites. The combination of Stryker's specialized sales force with 3D Systems' cutting-edge 3D printing and patient-specific solutions positions both companies to provide a superior level of service to healthcare professionals who use these revolutionary products.\n\"This partnership allows us to better support the rapidly evolving needs of our customers and accelerate innovation in the area of personalized medicine,\" stated David Mercado, vice president and general manager, Stryker. \"We are very pleased that 3D Systems chose us as their long-term collaborator in this space.\"\n\"We have a history of achieving positive patient outcomes working with Stryker,\" said Katie Weimer, vice president, medical devices, 3D Systems. \"I am so proud to partner with a world leader in medical technologies to deliver our innovative solutions – helping surgeons change the lives of their patients.\"\nThe agreement between 3D Systems and Stryker is specific to the United States, Canada, Europe and Australia. For more information on these services, please visit the 3D Systems or Stryker websites.\n1 Sink J, Hamlar D, Kademani D, Khariwala SS: Computer-aided stereolithography for presurgical planning in fibula free tissue reconstruction of the mandible. J Reconstr Microsurg 28:395-404, 2012.\nForward-Looking Statements\nCertain statements made in this release that are not statements of historical or current facts are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause the actual results, performance or achievements of the company to be materially different from historical results or from any future results or projections expressed or implied by such forward-looking statements. In many cases, forward looking statements can be identified by terms such as \"believes,\" \"belief,\" \"expects,\" \"may,\" \"will,\" \"estimates,\" \"intends,\" \"anticipates\" or \"plans\" or the negative of these terms or other comparable terminology. Forward-looking statements are based upon management's beliefs, assumptions and current expectations and may include comments as to the company's beliefs and expectations as to future events and trends affecting its business and are necessarily subject to uncertainties, many of which are outside the control of the company. The factors described under the headings \"Forward-Looking Statements\" and \"Risk Factors\" in the company's periodic filings with the Securities and Exchange Commission, as well as other factors, could cause actual results to differ materially from those reflected or predicted in forward-looking statements. Although management believes that the expectations reflected in the forward-looking statements are reasonable, forward-looking statements are not, and should not be relied upon as a guarantee of future performance or results, nor will they necessarily prove to be accurate indications of the times at which such performance or results will be achieved. The forward-looking statements included are made only as the date of the statement. 3D Systems undertakes no obligation to update or review any forward-looking statements made by management or on its behalf, whether as a result of future developments, subsequent events or circumstances or otherwise.\nAbout Stryker\nStryker is one of the world's leading medical technology companies and, together with its customers, is driven to make healthcare better. The company offers innovative products and services in Orthopaedics, Medical and Surgical, and Neurotechnology and Spine that help improve patient and hospital outcomes. More information is available at www.stryker.com .\nAbout 3D Systems\n3D Systems provides comprehensive 3D products and services, including 3D printers, print materials, on demand manufacturing services and digital design tools. Its ecosystem supports advanced applications from the product design shop to the factory floor to the operating room. 3D Systems' precision healthcare capabilities include simulation, Virtual Surgical Planning, and printing of medical and dental devices as well as patient-specific surgical instruments. As the originator of 3D printing and a shaper of future 3D solutions, 3D Systems has spent its 30-year history enabling professionals and companies to optimize their designs, transform their workflows, bring innovative products to market and drive new business models. More information on the company is available at www.3dsystems.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/3d-systems-and-stryker-team-up-to-advance-personalized-surgery-300583861.html\nSOURCE 3D Systems", "external_links": ["http://www.3dsystems.com/vsp", "http://www.prnewswire.com/news-releases/3d-systems-and-stryker-team-up-to-advance-personalized-surgery-300583861.html", "https://cmf.stryker.com/", "http://www.stryker.com/", "http://www.3dsystems.com/"], "published": "2018-01-17T17:00:00.000+02:00", "crawled": "2018-01-17T19:14:31.009+02:00", "highlightTitle": ""}