{"organizations": [], "uuid": "5840135f93a3711768b85d6497429d2f4e26ac12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/business-wire-rent-a-center-announces-ceo-transition.html", "country": "US", "domain_rank": 767, "title": "Rent-A-Center Announces CEO Transition", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T16:00:00.000+02:00", "replies_count": 0, "uuid": "5840135f93a3711768b85d6497429d2f4e26ac12"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/business-wire-rent-a-center-announces-ceo-transition.html", "ord_in_thread": 0, "title": "Rent-A-Center Announces CEO Transition", "locations": [], "entities": {"persons": [{"name": "mitch fadel", "sentiment": "negative"}, {"name": "mitchell e. fadel", "sentiment": "none"}, {"name": "j.v. lentell", "sentiment": "none"}, {"name": "mark e. speese", "sentiment": "none"}, {"name": "fadel", "sentiment": "none"}, {"name": "mark", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "plano", "sentiment": "none"}], "organizations": [{"name": "rent-a-center", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "rent-a-center board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mitch Fadel Appointed CEO Succeeding Mark Speese\nStrategic Alternatives Review Process Ongoing;\nCompany Remains Focused on Plan to Restore Growth and Improve Profitability\nPLANO, Texas--(BUSINESS WIRE)-- Rent-A-Center, Inc. (NASDAQ/NGS:RCII) (“Rent-A-Center” or the “Company”), a leader in the rent-to-own industry, today announced that Mitchell E. Fadel, the Company’s former President and Chief Operating Officer and a current member of its Board of Directors, has been appointed as Chief Executive Officer, effective immediately. Mr. Fadel’s appointment follows Mark E. Speese’s decision to resign as CEO. Mr. Fadel will continue his role as a member of the Board. The Company also reiterated its commitment to its previously announced strategic review process.\n“On behalf of the entire Board, I want to thank Mark for his decades of dedication and service to Rent-A-Center,” said J.V. Lentell, Chairman of the Rent-A-Center Board of Directors. “Mark is a true pioneer in the rent-to-own business, having founded this company and leading Rent-A-Center to its position as industry leader. On behalf of the entire Board of Directors, management team and co-workers throughout the Company, we thank Mark for his countless contributions to Rent-A-Center and wish him all the best in the future.”\n“It has been a privilege to help lead Rent-A-Center over so many years, and I am proud to have helped build such a talented and hard-working team,” said Mr. Speese. “With the Company having entered its current transitional phase, and the improvements in the Company’s portfolio as reported over the past several months, I believe now is an appropriate time for me to move on from the Company.”\nMr. Lentell continued, “As we continue the strategic review process and move with urgency to improve performance, we are fortunate to have a leader of Mitch’s caliber assume the role of CEO. He has previously spent more than 30 years in various positions at Rent-A-Center, most recently as President and COO, and we are grateful for his willingness to take on this important new role.”\n“I am honored to have the opportunity to rejoin the talented Rent-A-Center leadership team and excited about the significant opportunity ahead for the Company,” said Mr. Fadel. “I look forward to working closely with the Board and management at Rent-A-Center on their continuing efforts to deliver improved financial performance and enhancing stockholder value.”\nAs previously announced on October 30, 2017, the Rent-A-Center Board of Directors has initiated a process to explore strategic and financial alternatives and, with its independent financial and legal advisors, is carefully considering a full range of options focused on maximizing stockholder value.\nAbout Mitchell E. Fadel\nMitchell E. Fadel most recently served as President – U.S. Pawn for EZCORP, Inc., a leading provider of pawn loans in the United States and Mexico, from September 2015 to December 2016. Prior to that, Mr. Fadel served as President of Rent-A-Center (beginning in July 2000) and Chief Operating Officer (beginning in December 2002) each until August 2015, and also as a director from December 2000 to November 2013. From 1992 until 2000, Mr. Fadel served as President and Chief Executive Officer of Rent-A-Center’s subsidiary Rent-A-Center Franchising International, Inc. f/k/a ColorTyme, Inc. Mr. Fadel’s professional experience with Rent-A-Center also includes previously serving as a Regional Director and a District Manager.\nAbout Rent-A-Center, Inc.\nA rent-to-own industry leader, Plano, Texas-based, Rent-A-Center, Inc., is focused on improving the quality of life for its customers by providing them the opportunity to obtain ownership of high-quality, durable products such as consumer electronics, appliances, computers, furniture and accessories, under flexible rental purchase agreements with no long-term obligation. The Company owns and operates stores in the United States, Mexico, Canada and Puerto Rico, and Acceptance NOW kiosk locations in the United States and Puerto Rico. Rent-A-Center Franchising International, Inc., a wholly owned subsidiary of the Company, is a national franchiser of rent-to-own stores operating under the trade names of “Rent-A-Center,” “ColorTyme,” and “RimTyme.” For additional information about the Company, please visit our website at www.rentacenter.com .\nForward-Looking Statements\nThis press release and the guidance above contain forward-looking statements that involve risks and uncertainties. Such forward-looking statements generally can be identified by the use of forward-looking terminology such as \"may,\" \"will,\" \"expect,\" \"intend,\" \"could,\" \"estimate,\" \"should,\" \"anticipate,\" \"believe,\" or “confident,” or the negative thereof or variations thereon or similar terminology. The Company believes that the expectations reflected in such forward-looking statements are accurate. However, there can be no assurance that such expectations will occur. The Company's actual future performance could differ materially from such statements. Factors that could cause or contribute to such differences include, but are not limited to: the general strength of the economy and other economic conditions affecting consumer preferences and spending; factors affecting the disposable income available to the Company's current and potential customers; changes in the unemployment rate; uncertainties concerning the outcome, impact, effects and results of the Company’s exploration of its strategic and financial alternatives; difficulties encountered in improving the financial and operational performance of the Company's business segments; the Company's chief executive officer and chief financial officer transitions, including the Company's ability to effectively operate and execute its strategies during the interim period and difficulties or delays in identifying and/or attracting a permanent chief financial officer with the required level of experience and expertise; failure to manage the Company's store labor and other store expenses; the Company’s ability to develop and successfully execute strategic initiatives; disruptions caused by the operation of the Company's store information management system, and its transition to more-readily scalable, “cloud-based” solutions; the Company's ability to develop and successfully implement digital or E-commerce capabilities, including mobile applications; disruptions in the Company's supply chain; limitations of, or disruptions in, the Company's distribution network; rapid inflation or deflation in the prices of the Company's products; the Company's ability to execute and the effectiveness of a store consolidation, including the Company's ability to retain the revenue from customer accounts merged into another store location as a result of a store consolidation; the Company's available cash flow; the Company's ability to identify and successfully market products and services that appeal to its customer demographic; consumer preferences and perceptions of the Company's brand; uncertainties regarding the ability to open new locations; the Company's", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rentacenter.com&esheet=51736288&newsitemid=20180102005324&lan=en-US&anchor=www.rentacenter.com&index=1&md5=c6d5eb73a131061d9c5c38829a5f8c5c", "http://www.businesswire.com/news/home/20180102005324/en/"], "published": "2018-01-02T16:00:00.000+02:00", "crawled": "2018-01-02T16:31:43.005+02:00", "highlightTitle": ""}