{"organizations": [], "uuid": "dcd5f34eefc3b83ab0d09a8ea704d97303428117", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225129667&w=1200&r=LYNXMPEE0O0TQ", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-thailand-prison/thai-womens-prison-highlights-need-for-reform-drug-policy-rethink-idUKKBN1FE1FD", "country": "US", "domain_rank": 408, "title": "Thai women's prison highlights need for reform, drug policy rethink", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T14:03:00.000+02:00", "replies_count": 0, "uuid": "dcd5f34eefc3b83ab0d09a8ea704d97303428117"}, "author": "", "url": "https://uk.reuters.com/article/uk-thailand-prison/thai-womens-prison-highlights-need-for-reform-drug-policy-rethink-idUKKBN1FE1FD", "ord_in_thread": 0, "title": "Thai women's prison highlights need for reform, drug policy rethink", "locations": [], "entities": {"persons": [{"name": "bajrakitiyabha mahidol", "sentiment": "none"}, {"name": "chiang mai", "sentiment": "none"}, {"name": "amy sawitta lefevre", "sentiment": "none"}], "locations": [{"name": "southeast asia", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}], "organizations": [{"name": "min read  chiang mai", "sentiment": "none"}, {"name": "unodc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "united nations office on drugs", "sentiment": "none"}, {"name": "women’s correctional institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 12:07 PM / Updated 33 minutes ago Thai women's prison highlights need for reform, drug policy rethink Amy Sawitta Lefevre 3 Min Read \nCHIANG MAI, Thailand (Reuters) - A visit by a Thai princess to a women’s prison on Thursday spotlighted the need for reform in a country that houses some of the world’s most crowded jails, partly because of its battle against the scourge of illicit drugs. \nSeveral Southeast Asian governments, led by the Philippines, have adopted hardline policies on drug-related crimes, putting a heavy burden on their jails, the United Nations Office on Drugs and Crime (UNODC) says. \nThailand has about a tenth of Southeast Asia’s population, but about 40 per cent of its prisoners, most convicted of drug offences. \n“We have to ensure fair and equitable justice, understand the reasons people are ending up in prison, and we also have to address the specific needs of women,” Thailand’s Princess Bajrakitiyabha Mahidol said. \nThe remarks came as she led diplomats on a visit to the Women’s Correctional Institute in the northern Thai city of Chiang Mai, to show how it had applied rules embodying a more gender-sensitive approach. \nThe prison is one of ten in Thailand piloting the “Bangkok Rules”, or guidelines for the treatment of female prisoners adopted by the United Nations’ General Assembly in 2010. \n“Women have very different needs,” Jeremy Douglas, UNODC Regional Representative for Southeast Asia and the Pacific, told Reuters. “They have health needs, they have children. So if they follow a male prison model it doesn’t work.” Women prisoners are seen at the Chiang Mai Women's Correctional Institute, in Chiang Mai, Thailand, January 24, 2018. Picture taken January 24, 2018. REUTERS/Athit Perawongmetha \nThailand has the fourth highest number of women prisoners in the world, after the United States, China, and Russia, says a French non-government body, the International Federation for Human Rights. \nSome of the prison’s 1,982 women inmates, 80 percent of whom have drug convictions, said they had experienced a difference since it adopted the U.N. Rules for the Treatment of Women Prisoners, as they are formally known. \n“When I first came here it had been a male prison. It was very dirty. It’s cleaner now,” a 43-year-old who is serving a life sentence for trafficking methamphetamine pills, told Reuters during a visit to the prison. Slideshow (5 Images) \nIn the prison’s nursery, mothers were being encouraged to breastfeed their babies and elsewhere, other inmates received training in silk weaving and traditional massage. \nYet much remains to be done. \nWomen’s prisons in Thailand are ready to adopt the Bangkok Rules, said Bussaba Sakrangkul, director of the Chiang Mai prison, but some facilities needed to be upgraded and some design changes made. \nOvercrowding also remains an issue, with up to 50 inmates sleeping in a single room. \n“What we’ve been looking out for is how to reduce prison overcrowding, not only in Thailand but across the region,” Douglas said, adding that such steps called for changes to drug policy, shorter jail terms and treatment programmes. Editing by Clarence Fernandez", "external_links": [], "published": "2018-01-25T14:03:00.000+02:00", "crawled": "2018-01-25T14:12:15.007+02:00", "highlightTitle": ""}