{"organizations": [], "uuid": "eb1a682e017b75154c6a8eefc5a3cf3f477ce4dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/cnbc-exclusive-cnbcs-scott-wapner-appaloosas-david-tepper-exclusive-comments-on-the-market.html", "country": "US", "domain_rank": 767, "title": "CNBC EXCLUSIVE: CNBC’S SCOTT WAPNER: APPALOOSA'S DAVID TEPPER EXCLUSIVE COMMENTS ON THE MARKET", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T20:47:00.000+02:00", "replies_count": 0, "uuid": "eb1a682e017b75154c6a8eefc5a3cf3f477ce4dd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/cnbc-exclusive-cnbcs-scott-wapner-appaloosas-david-tepper-exclusive-comments-on-the-market.html", "ord_in_thread": 0, "title": "CNBC EXCLUSIVE: CNBC’S SCOTT WAPNER: APPALOOSA'S DAVID TEPPER EXCLUSIVE COMMENTS ON THE MARKET", "locations": [], "entities": {"persons": [{"name": "scott wapner", "sentiment": "negative"}, {"name": "appaloosa", "sentiment": "negative"}, {"name": "david tepper", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "appaloosa management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WHEN: Thursday, January 4, 2018\nWHERE: CNBC's \" Fast Money Halftime Report \"\nFollowing is the transcript of CNBC exclusive comments from Appaloosa Management's David Tepper to CNBC's Scott Wapner which aired on CNBC's \"Fast Money Halftime Report\" today, Thursday, January 4, 2018. The full article is available on CNBC.com: https://www.cnbc.com/2018/01/04/david-tepper-says-market-is-as-cheap-as-a-year-ago.html .\nAll references must be sourced to CNBC.\nSCOTT WAPNER: Let's begin with the markets today. As we said, the Dow crossing 25,000 for the first time ever, an incredible run that some see continuing for a while. New at noon, I spoke exclusively to Appaloosa's David Tepper today who told me the following when I asked him what he thought about stocks right now – it was clear he was very positive telling me – Quote: - \"Explain to me where this market is rich? It's not rich with the tax thing that just changed earnings projections. With earnings forecasts going up and interest rates where they are, how is this market expensive?\" He said \"I don't see the overvaluation. World growth is higher. There's no inflation. The market coming into this year doesn't look rich, in fact, it looks almost as cheap as coming into last year.\" He said, \"The market can't go down until the bond market gets hit. It's amazing where interest rates are.\"\nFor more information contact:\nJennifer Dauble\nCNBC\nt: 201.735.4721\nm: 201.615.2787\ne: jennifer.dauble@nbcuni.com\nEmma Martin\nCNBC\nt: 201.735.4713\ne: emma.martin@nbcuni.com\nAbout CNBC:\nWith CNBC in the U.S., CNBC in Asia Pacific, CNBC in Europe, Middle East and Africa, and CNBC World, CNBC is the recognized world leader in business news and provides real-time financial market coverage and business information to more than 409 million homes worldwide, including more than 91 million households in the United States and Canada. CNBC also provides daily business updates to 400 million households across China. The network's 15 live hours a day of business programming in North America (weekdays from 4:00 a.m. - 7:00 p.m. ET) is produced at CNBC's global headquarters in Englewood Cliffs, N.J., and includes reports from CNBC News bureaus worldwide. CNBC at night features a mix of new reality programming, CNBC's highly successful series produced exclusively for CNBC and a number of distinctive in-house documentaries.\nCNBC also has a vast portfolio of digital products which deliver real-time financial market news and information across a variety of platforms including: CNBC.com; CNBC PRO, the premium, integrated desktop/mobile service that provides live access to CNBC programming, exclusive video content and global market data and analysis; a suite of CNBC mobile products including the CNBC Apps for iOS, Android and Windows devices; and additional products such as the CNBC App for the Apple Watch and Apple TV.\nMembers of the media can receive more information about CNBC and its programming on the NBCUniversal Media Village Web site at http://www.nbcumv.com/programming/cnbc .\nFor more information about NBCUniversal, please visit http://www.NBCUniversal.com .", "external_links": ["https://wpyadmin.ne.cision.com/l/cnrvqfdz/www.cnbc.com/halftime", "http://www.nbcumv.com/programming/cnbc"], "published": "2018-01-04T20:47:00.000+02:00", "crawled": "2018-01-04T23:04:25.009+02:00", "highlightTitle": ""}