{"organizations": [], "uuid": "d59893d8e6a48997cc4899198fcb4f33f633b65d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 10}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WV662_2nzQV_TOP_20180104060837.jpg", "site_section": "https://www.wsj.com/europe", "section_title": "The Wall Street Journal &amp; Breaking News, Business, Financial and Economic News, World News and Video", "url": "https://www.wsj.com/articles/geopolitical-tensions-drive-oil-to-3-year-high-1515064424", "country": "US", "domain_rank": 387, "title": "Oil Reaches Three-Year Highs as Stockpiles Drop", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T23:22:00.000+02:00", "replies_count": 0, "uuid": "d59893d8e6a48997cc4899198fcb4f33f633b65d"}, "author": "Stephanie Yang", "url": "https://www.wsj.com/articles/geopolitical-tensions-drive-oil-to-3-year-high-1515064424", "ord_in_thread": 0, "title": "Oil Reaches Three-Year Highs as Stockpiles Drop", "locations": [], "entities": {"persons": [{"name": "bob yawger", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "new york mercantile exchange", "sentiment": "none"}, {"name": "mizuho securities usa inc.", "sentiment": "none"}, {"name": "u.s. energy information administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Oil prices closed at a fresh three-year high on Thursday, as U.S. crude stockpiles dropped by more than expected last week and geopolitical tensions kept traders on edge.\nLight, sweet crude for February delivery rose 38 cents, or 0.6%, to $62.01 a barrel on the New York Mercantile Exchange, closing at the highest level since December 2014. Brent, the global benchmark, advanced 23 cents, or 0.3%, to $68.07 a barrel.\nThe U.S. Energy Information Administration reported that crude inventories fell by 7.4 million barrels in the week ended Dec. 29, exceeding analyst expectations on average for a drop of 4.7 million barrels.\n“People are taking crude oil out of storage,” said Bob Yawger, director of the futures division at Mizuho Securities USA Inc. “It was a gigantic number.”\nMeanwhile, stockpiles of oil products rose by more than analysts were anticipating. Gasoline inventories increased by 4.8 million barrels and distillate inventories rose by 8.9 million barrels, as refineries increased utilization rates.\nHowever, some analysts said the extreme cold spreading across the East Coast could interrupt refinery operations and lead to a surge in demand for heating fuel.\nAs the amount of crude in storage has declined, geopolitical risks around the world raised concerns about disruptions to supply from major oil exporters. Prices have risen 11 out of the past 14 sessions.\n“Firming fundamentals have placed the market on the firmest footing seen in several years,” said Michael Tran, director of energy strategy at RBC Capital Markets, in a Thursday note. “Recent production hiccups in the North Sea and Libya are examples of how outages will be magnified as the global storage surplus continues to taper.”\nMost recently, antigovernment protests in Iran have helped support oil prices over the past week , partly driven by economic grievances after the lifting of international sanctions two-years ago didn’t generate an expected windfall.\nSome foreign leaders, including U.S. President Donald Trump, have been critical of how Iran has used money on foreign conflicts, another focal point of protester anger.\n“The market has taken a strong cue from the increased level of back-and-forth between Iran and the U.S. in response to widespread pro-reform protests in the third-biggest OPEC crude producer over the last week,” said consultancy JBC Energy in a note.\n“The potential reinstatement of U.S. sanctions targeting the Iranian oil industry remains an issue.”\nThe U.S. is due to review temporary waivers on sanctions against Iran later this month.\nFor now, Iran’s oil exports haven't been disrupted.\nIranian daily crude oil loadings have remained consistent, in line with the volumes exported since mid-December, according to Kpler, a tanker tracking firm.\nA petrochemical complex in the South Pars gas field in Asalouyeh, Iran, on the northern coast of Persian Gulf. Photo: Ebrahim Noroozi/Associated Press Analysts also pointed to deteriorating economic outlooks creating uncertainty in other large producers including Venezuela .\n“The number one issue is the geopolitical situation…not only Iran, because we also have an escalating situation in Venezuela where they haven’t been able to pay their debt recently,” said Torbjorn Kjus, oil analyst at Norway-based DNB Bank.\nMr. Kjus said there was a risk that Venezuela could “collapse” in 2018, which could entail several different scenarios, from a coup to a general strike, or a slow choking of the economy. Venezuelan production is falling by around 50,000 barrels a month, he added.\nGasoline futures rose 0.5% to $1.8067 a gallon and diesel futures fell 0.5% to $2.0770 a gallon.\nWrite to Stephanie Yang at stephanie.yang@wsj.com and Sarah McFarlane at sarah.mcfarlane@wsj.com", "external_links": [], "published": "2018-01-04T23:22:00.000+02:00", "crawled": "2018-01-05T04:57:51.001+02:00", "highlightTitle": ""}