{"organizations": [], "uuid": "24cce216cbb4e0ec97cf093afcda91323ad9211e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/ripple-coinmarketcap-korea-delisting-drop.png", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/08/coinmarketcap-removes-korean-exchange-prices/", "country": "US", "domain_rank": 1196, "title": "Major Cryptocurrency Index Excludes Korean Prices Without Warning | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.406, "site_type": "news", "published": "2018-01-08T16:57:00.000+02:00", "replies_count": 0, "uuid": "24cce216cbb4e0ec97cf093afcda91323ad9211e"}, "author": "David Z. Morris", "url": "http://fortune.com/2018/01/08/coinmarketcap-removes-korean-exchange-prices/", "ord_in_thread": 0, "title": "Major Cryptocurrency Index Excludes Korean Prices Without Warning | Fortune", "locations": [], "entities": {"persons": [{"name": "david z. morris", "sentiment": "negative"}, {"name": "coinmarketcap", "sentiment": "none"}, {"name": "— coinmarketcap", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By David Z. Morris 2:57 PM EST \nCoinMarketCap, arguably the most prominent global index of cryptocurrency prices, triggered a wave of anxiety and anger this morning when it removed a group of Korean cryptocurency exchanges from its price calculations. \nThough the change was apparently made at midnight Sunday U.S. EST, CoinMarketCap did not publicize it until midday on Monday, saying that the Korean exchanges showed “extreme divergence in prices from the rest of the world and limited arbitrage opportunity.” This morning we excluded some Korean exchanges in price calculations due to the extreme divergence in prices from the rest of the world and limited arbitrage opportunity. We are working on better tools to provide users with the averages that are most relevant to them. \n— CoinMarketCap (@CoinMarketCap) January 8, 2018 \nThe move resulted in a sharp drop in CoinMarketCap’s measurement of nearly all cryptocurrencies. That gave the impression that a broad market decline , already in progress, had become even more dramatic overnight. As news of the cause for the sharp drop spread Monday, most cryptocurrency prices began recovering losses. \nGet Data Sheet , Fortune’s technology newsletter. \nThe delisting itself seems to have been relatively uncontroversial—as CoinDesk points out , local exchanges can sometimes show sharp divergence from global prices, masking broad trends. According to CoinDesk, the Korean exchanges Bithumb, Coinone and Korbit, which consistently had prices well above the global market, were removed from CoinMarketCap’s calculations. \nRipple’s David Schwartz acknowledged that the new price is “more accurate and meaningful.” They are outliers due to a shortage of cryptos in Korea and difficulty getting KRW out. The new price is more accurate and meaningful, IMO. \n— David Schwartz (@JoelKatz) January 8, 2018 \nBut cryptocurrency watchers on Twitter responded with understandable anger to the lateness of CoinMarketCap’s announcement, calling it “unprofessional” and saying it may have triggered panic selling. Do a better job of communicating this type of thing BEFORE you do it! \n— Steven Blanton (@steveruno) January 8, 2018 Well why didn't you let the community know instead surprised many people and the newbies likely sold (luckily us more seasoned investors held and looked for facts of why the dip before making a rash decision) your actions without notice likely caused a loss of money for many! \n— Chris B. (@BaradaranChris) January 8, 2018 \nSome went further, accusing CoinMarketCap of market manipulation. That echoes recent suspicion of insider trading by employees of the Coinbase cryptocurrency exchange. This was one of the most unprofessional deliberate price manipulation I’ve ever seen smh still Hodl though \n— Mr. Sanchez (@faly_sanchez) January 8, 2018 Cannot find the right words for this really…Either extreme incompetence or pure evil manipulation.Both deserve severe consequences! \n— Pierre Dekkers (@pierre_dekkers) January 8, 2018 \nIf there’s one clear takeaway from the incident, it’s that the infrastructure of cryptocurrency markets, much like cryptocurrencies themselves, is still evolving, unstable, and subject to shocks based on nothing more than avoidable missteps. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-08T16:57:00.000+02:00", "crawled": "2018-01-08T22:43:29.014+02:00", "highlightTitle": ""}