{"organizations": [], "uuid": "1d39f4fd0ccaa1c3b179787d01d290ccdf550e0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://goldreview.com/?feed=linkfeed&category=category-slug", "section_title": "Gold Review » Gold Review", "url": "https://www.reuters.com/article/global-precious/precious-gold-climbs-back-towards-17-month-peak-as-dollar-slips-idUSL8N1PL47N", "country": "US", "domain_rank": 408, "title": "Gold inches back toward 17-month peak as dollar moves lower", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T22:38:00.000+02:00", "replies_count": 0, "uuid": "1d39f4fd0ccaa1c3b179787d01d290ccdf550e0e"}, "author": "cmullen", "url": "https://www.reuters.com/article/global-precious/precious-gold-climbs-back-towards-17-month-peak-as-dollar-slips-idUSL8N1PL47N", "ord_in_thread": 0, "title": "Gold inches back toward 17-month peak as dollar moves lower", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}, {"name": "renita d. young", "sentiment": "none"}, {"name": "jan harvey new york/london", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 3:27 PM / in 2 hours PRECIOUS-Gold inches back toward 17-month peak as dollar moves lower Reuters Staff 3 Min Read * Spot gold set for sixth weekly gain in seven weeks * Dollar resumes decline after late Thursday bounce * GRAPHIC-2018 asset returns: tmsnrt.rs/2jvdmXl (New throughout, updates prices, market activity and comments; adds second byline and NEW YORK dateline) By Renita D. Young and Jan Harvey NEW YORK/LONDON, Jan 26 (Reuters) - Gold rose on Friday, climbing back toward the previous day's 17-month peak as a report of slow economic growth pushed the U.S. dollar lower, days after the greenback was hammered by a senior U.S. official backing a weaker currency. The dollar was on track for its biggest weekly decline since May. President Donald Trump's comments on Thursday that he wanted a \"strong dollar\" failed to lend much support, a day after Treasury Secretary Steven Mnuchin said a weaker greenback would help short-term U.S. trade balances. Spot gold was up 0.3 percent at $1,351.86 by 1:37 p.m. EST (1837 GMT), up 1.5 percent this week. On Thursday, bullion hit $1,366.07, its highest since August 2016. U.S. gold futures for February delivery settled down $10.80, or 0.78 percent, at $1,352.10 per ounce. \"The dollar is weak, driving gold higher. Gold is still in an uptrend,\" said Michael Matousek, head trader at U.S. Global Investors in San Antonio. Dollar weakness makes assets priced in the U.S. unit less expensive for holders of other currencies. The U.S. economy grew 2.6 percent in the final quarter of 2017, slower than the 3 percent forecast by economists polled by Reuters. \"GDP is light so there’s a question as to whether the Fed will do so many rate hikes throughout the year and that tends to drive gold higher,\" Matousek added. Higher yields on bonds make gold investment less attractive because gold pays no interest. World stocks were set for their 10th straight week of gains. Gold could benefit if that scorching run cools, Thomson Reuters GFMS analysts said, predicting volatility in equities and concerns over global politics could lead gold prices up past $1,500 an ounce this year. Among other precious metals, silver was up 0.7 percent at $17.42 an ounce. On Thursday, silver touched $17.69, its highest in more than four months. It was strongest weekly rise among precious metals, up 2.4 percent from last Friday's close. \"The U.S. dollar remains in the driving seat of the metal markets, causing a lot of volatility for silver,\" Julius Baer said in a note. \"We remain neutral but lift our 12-month price target to $17.50 per ounce due to signs of improving industrial demand.\" Platinum was up 0.4 percent at $1,014.40 an ounce, flat from last week. Palladium was down 0.7 percent at $1,088.47 an ounce. After recently hitting record highs, palladium was on track for its second weekly loss. It hit a two-week low of $1,080 per ounce. (Additional reporting by Nallur Sethuraman in Bengaluru; Editing by David Gregorio)", "external_links": [], "published": "2018-01-26T22:38:00.000+02:00", "crawled": "2018-01-26T23:07:42.003+02:00", "highlightTitle": ""}