{"organizations": [], "uuid": "982706b663a1cfce27f0722e71286d01001f945d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-vantiv-and-worldpay-complete-combination-to-form-worldpay-inc.html", "country": "US", "domain_rank": 767, "title": "Vantiv and Worldpay Complete Combination to Form Worldpay, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:06:00.000+02:00", "replies_count": 0, "uuid": "982706b663a1cfce27f0722e71286d01001f945d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-vantiv-and-worldpay-complete-combination-to-form-worldpay-inc.html", "ord_in_thread": 0, "title": "Vantiv and Worldpay Complete Combination to Form Worldpay, Inc.", "locations": [], "entities": {"persons": [{"name": "vantiv", "sentiment": "negative"}], "locations": [{"name": "cincinnati", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "worldpay complete combination to form worldpay, inc", "sentiment": "neutral"}, {"name": "vantiv, inc.", "sentiment": "neutral"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "global merchant acquirer", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "worldpay, inc.", "sentiment": "none"}, {"name": "worldpay group plc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CINCINNATI and LONDON, Jan. 16, 2018 /PRNewswire/ -- Vantiv, Inc., a leading provider of payment processing services and related technology solutions for merchants and financial institutions in the U.S., announced today that it has completed its acquisition of Worldpay Group plc, a leader in technology-led payment solutions. The combined company, named Worldpay, Inc. (NYSE: WP; LSE: WPY) , creates a leading payments provider uniquely equipped to power global integrated omni-commerce, processing more than 40 billion transactions annually through more than 300 payment types across 146 countries and 126 currencies. The proposed combination of the two companies was announced on August 9, 2017.\nWorldpay, Inc.'s class A common stock will begin trading today on the New York Stock Exchange under the symbol \"WP\" and on the London Stock Exchange via a secondary standard listing under the symbol \"WPY.\"\nExecutives of the new Worldpay - which today becomes the #1 Global Merchant Acquirer 1 able to accept payments from geographies covering 99 percent of global GDP - will ring the Closing Bell of the New York Stock Exchange to celebrate the first day of trading as the newly combined company.\n\"Our combination is transformative for our colleagues, customers and the worldwide payments industry,\" said Charles Drucker, executive chairman and co-CEO of Worldpay, Inc. \"We would not be here without the enthusiasm, dedication and hard work of all our people, who will continue to forge the future of payments. By combining the expertise of our teams, we will provide further value to our customers, helping them prosper in the fast-changing and complex digital economy.\"\nPhilip Jansen, co-CEO of Worldpay, Inc., said, \"The new senior leadership team is in place and has already begun to implement our plan to integrate the two businesses, delivering new value for customers, realizing cost synergies and capturing revenue opportunities that will benefit our shareholders. This will be evidenced as Worldpay creates customer-centric innovation at scale, leveraging our combined operations, technology infrastructure and data and analytics capabilities. Charles and I look forward to delivering this value to our customers across the world.\"\nThis new global payments leader will have a pro forma enterprise value of $31 billion (£23 billion), processing over US$1.5 trillion (£1.1 trillion) in payment volume.\nCONTACTS\nMedia\nAndrew Ciafardini\nCorporate Communications\n513.900.5308\nAndrew.Ciafardini@vantiv.com\nAdam Kiefaber\nCorporate Communications\n513.900.5097\nAdam.Kiefaber@vantiv.com\nInvestors\nNathan Rozof\nInvestor Relations\n866.254.4811 or 513.900.4811\nIR@vantiv.com\nABOUT WORLDPAY, INC.\nWorldpay, Inc. (NYSE: WP; LSE: WPY) is a leading payments provider with unique capability to power global integrated omni-commerce, any payment, anywhere. With industry-leading scale and an unmatched integrated technology platform, Worldpay offers clients a comprehensive suite of products and services globally, delivered through a single provider.\nAnnually, Worldpay processes over 40 billion transactions through more than 300 payment types across 146 countries and 126 currencies. The company's growth strategy includes expanding into high-growth markets, verticals and customer segments, including global eCommerce, Integrated Payments and B2B.\nWorldpay, Inc. was formed in 2018 through the combination of the No. 1 merchant acquirers in the U.S. and the U.K., Vantiv, Inc. and Worldpay Group plc. Worldpay, Inc. trades on the NYSE as \"WP\" and the London Stock Exchange as \"WPY.\"\nVisit us at www.worldpay.com .\n1 Based on number of transactions; analysis of data published in The Nilson Report, issues 1095 (September 2016), 1105 (March 2017) and 1110 (May 2017)\n© 2018 Worldpay, Inc. All Rights Reserved. All trademarks, service marks and trade names referenced herein are the property of their respective owners. Worldpay and other Worldpay and Vantiv products and services mentioned herein as well as their respective logos are registered trademarks or trademarks of Worldpay, Inc. and Vantiv, LLC in the U.S. and other countries.\nView original content with multimedia: http://www.prnewswire.com/news-releases/vantiv-and-worldpay-complete-combination-to-form-worldpay-inc-300583008.html\nSOURCE Worldpay, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/vantiv-and-worldpay-complete-combination-to-form-worldpay-inc-300583008.html"], "published": "2018-01-16T14:06:00.000+02:00", "crawled": "2018-01-16T17:05:56.000+02:00", "highlightTitle": ""}