{"organizations": [], "uuid": "3bd2ec8c5b948b0ddf18fea408e6d2e4f9cab723", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-national-american-university-holdings-inc-reports-fiscal-2018-second-quarter-and-six-months-results.html", "country": "US", "domain_rank": 767, "title": "National American University Holdings, Inc. Reports Fiscal 2018 Second Quarter and Six Months Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T00:05:00.000+02:00", "replies_count": 0, "uuid": "3bd2ec8c5b948b0ddf18fea408e6d2e4f9cab723"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-national-american-university-holdings-inc-reports-fiscal-2018-second-quarter-and-six-months-results.html", "ord_in_thread": 0, "title": "National American University Holdings, Inc. Reports Fiscal 2018 Second Quarter and Six Months Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "national american university holdings, inc", "sentiment": "neutral"}, {"name": "nau", "sentiment": "none"}, {"name": "zenith education group", "sentiment": "none"}, {"name": "u.s. department of education", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Financial and Operational Highlights\nCombined enrollment in graduate and doctoral programs increased 11.7% to 524 students during the FY 2018 second quarter (fall 2017 term) from the prior-year quarter.\nPrimary focus remains on stabilizing and increasing enrollment; credit hours enrolled for the fall 2017 term came in above previously provided expectations due to switch to monthly starts and improved marketing efforts.\nStudents enrolled in 59,081 credit hours in the FY 2018 second quarter, a 3.9% decrease from 61,451 credit hours during the prior fall term. Enrollment by total headcount decreased 13.8% from the prior-year period, to 6,241 students as of November 30, 2017, as a result of a decrease in continuing education and undergraduate & diploma students.\nThe Company filed its FY 2017 annual Title IV Compliance Report with the U.S. Department of Education during the FY 2018 second quarter and is pleased to report that its independent auditors identified no findings of noncompliance.\nNAU signed a transfer agreement with Zenith Education Group to provide degree completion opportunities for approximately 800 students.\nThe Company expects to close the Henley-Putnam University asset purchase transaction in early 2018.\nFY 2018 second quarter total revenue was $20.0 million, compared to $22.0 million in the prior-year period. The Company’s total academic segment revenue was $19.4 million in the FY 2018 second quarter, compared to $21.7 million in the prior-year period.\nFY 2018 second quarter net loss attributable to the Company was $(3.8) million, compared to $(0.8) million in the prior-year period, primarily as a result of decreased revenue on lower enrollment, investments in strategic growth initiatives, and $1.0 million in asset impairment charges primarily related to leasehold improvements at certain locations, as well as increased operating expenses related to condominium sales.\nBalance sheet at November 30, 2017, included cash and cash equivalents and investments of $8.7 million, taxes receivable of $2.3 million, working capital of $4.4 million; no outstanding lending debt; and stockholders’ equity of $21.4 million.\nRAPID CITY, S.D., Jan. 03, 2018 (GLOBE NEWSWIRE) -- National American University Holdings, Inc. (the “Company”) (NASDAQ:NAUH), which through its wholly owned subsidiary operates National American University (“ NAU ” or the “University” ), a regionally accredited, proprietary, multi-campus institution of higher learning, today reported unaudited financial results for its fiscal 2018 second quarter and six months ended November 30, 2017.\nManagement Commentary\nEnrollment\nRonald L. Shape, Ed.D., President and Chief Executive Officer of the Company, stated, “In the fall 2017 term, we began accepting students on a monthly basis, versus our previous practice of quarterly starts. The monthly starts had a positive impact on enrollment during the period, and we were pleased to see the year-over-year growth in our graduate and doctoral enrollments. We welcomed a new cohort of doctoral candidates in Texas during the fall term and are looking to launch an additional cohort in Ohio in the spring 2018 term. As a result of the monthly starts and students continuing to take advantage of the NAU Tuition Advantage plan, credit hours enrolled during the fall term came out to over 59,000, exceeding our previously provided projections. These factors had a positive impact on our top line, which helped to offset the effect of lower overall enrollment headcount.”\nOpportunities with Other Institutions\nDr. Shape continued, “We are in active discussions with institutions that are looking to transfer or teach out students that could provide us with opportunities to leverage our existing infrastructure and brand recognition to assist students in their educational goals. In this regard, we recently signed a transfer agreement with Zenith Education Group whereby NAU is working to provide approximately 800 students with degree completion opportunities. We believe this will have a positive impact on our enrollments in the current winter term.\n“Following a successful visit from the Higher Learning Commission (‘HLC’) in early November with regards to our planned acquisition of the assets of Henley-Putnam University, we maintain our expectation to close the transaction in early 2018, pending final approval from the HLC and other regulatory and accrediting bodies.”\nRecent Operating Initiatives Expected to Generate $1.5 Million in Savings\nDr. Shape concluded, “As we mentioned in our last earnings report, we have observed that our working adult student population has increasingly shown a propensity for NAU’s online course delivery format. Given this trend, we are identifying ways in which we can build up and better support our students through our Distance Learning division. To support this effort, we have fully launched a second online enrollment center in Kansas City, Missouri, to expand upon our existing online operations in Rapid City, South Dakota. At the same time, we continue to look to optimize our ground operations. We have made efforts to cut costs over the past several quarters to bring our expenses in line with our revenues and current enrollment levels. In December, we made leadership and oversight consolidations that will result in approximately $1.5 million in savings. Taken all together, we expect the decisions made over the past few months to help the Company move toward generating positive cash flow while positioning NAU for long-term growth in a rapidly changing educational environment. Throughout this process, we remain committed to our students and their needs, making sure our academic programs and support systems adhere to the quality standard they have come to expect from NAU.”\nOperating Review\nEnrollme nt Update\nTotal NAU student enrollment for the fall 2017 term was 6,241 students, compared to 7,240 during the prior fall term. Students enrolled in 59,081 credit hours, compared to 61,451 credit hours during the prior fall term. The current average age of NAU’s students continues to be in the mid-30s, with those seeking undergraduate degrees remaining the highest portion of NAU’s student population.\nThe following is a summary of student enrollment at November 30, 2017, and November 30, 2016, by degree level and by instructional delivery method:\nNovember 30, 2017\n(Fall ’17 Term) November 30, 2016\n(Fall ’16 Term) No. of\nStudents % of\nTotal No. of\nStudents % of\nTotal Continuing Ed 15 0.2 % 300 4.1 % Doctoral 101 1.6 % 110 1.5 % Graduate 423 6.8 % 359 5.0 % Undergraduate & Diploma 5,702 91.4 % 6,471 89.4 % Total 6,241 100.0 % 7,240 100.0 % No. of\nCredits % of\nTotal No. of\nCredits % of\nTotal On-Campus 8,180 13.8 % 8,254 13.4 % Online 45,124 76.4 % 48,478 78.9 % Hybrid 5,777 9.8 % 4,719 7.7 % Total 59,081 100.0 % 61,451 100.0 % Financial Review\nThe Company, through its wholly owned subsidiary, operates in two business segments: academics, which consists of NAU’s undergraduate, graduate, and doctoral education programs and contributes the primary portion of the Company’s revenue; and ownership in and development of multiple apartments and condominium complexes from which it derives sales and rental income. The real estate operations generated approximately 3.0% of the Company’s revenue for the quarter ended November 30, 2017.\nFiscal 2018 Second Quarter Financial ", "external_links": ["https://www.globenewswire.com/Tracker?data=nZx08-blTfnRG2ix20jyzGwgYmQ1frZzCPJnrJSmm6uzl7XyL2ge_U_LD3puwzvTBRPgcOgcqNYZ50hWKe4YPTu82MXkmn1NdZQgVuqrwgr0ywaNNPOHju7CSXRYdMOx6k7k9uErplmB2EzFyAQ4AA==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/9fee7869-fdda-4924-9e3c-15bfab92cb0c", "https://www.globenewswire.com/Tracker?data=dr13s-tGuKU7eZkK_wrSKtImH6cRV2jvDZ_V74QprM7T3bdz7PP1V1qCbhTI0fslqWv6a382p6EOLoU9qiFuf9azl__X4XKKseVrSN1ju7w=", "https://www.globenewswire.com/Tracker?data=nZx08-blTfnRG2ix20jyzMWWBd9mt-tP6Le-FH5CNZ3WH3Za8O28EEYg7-Q8EwQtW7V7U7Cuy6jwwUx8dj6tcGExqSrfElROui-juYMBYzpjkLPg_MgBY-eCz6G1CBqE", "https://www.globenewswire.com/Tracker?data=j8CQ61VATg3WqLVWUTtD0kJdg-JJVVr_CJXt7HufQpnMlIWberdPVEr_mNhGXIPb2RJ1Hn63x8s-y5IMUkYEemoFs1V2hcqEIOWFQbqlaXo=", "https://www.globenewswire.com/Tracker?data=-VGnHzMriWfAlkrwKizt_0s6pmE8XzeXVhgdqt522RBQ5sYMGagH9DofcaMJSleQNAhrgKFQOygRG_v09yKhUyZ7ce_i8jnsmuweGK21TvE=", "http://national.equisolvewebcast.com/q2-2018"], "published": "2018-01-04T00:05:00.000+02:00", "crawled": "2018-01-04T00:36:17.017+02:00", "highlightTitle": ""}