{"organizations": [], "uuid": "23d956d786b6fab35ae17406991ecb673d6b3a29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223597002&w=1200&r=LYNXMPEE0J0CO", "site_section": "http://feeds.reuters.com/reuters/UKdomesticNews", "section_title": "Reuters: UK", "url": "https://uk.reuters.com/article/uk-ireland-politics-sinnfein/mcdonald-to-succeed-adams-as-sinn-fein-leader-idUKKBN1F90G8", "country": "US", "domain_rank": 408, "title": "McDonald to succeed Adams as Sinn Fein leader", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T13:27:00.000+02:00", "replies_count": 0, "uuid": "23d956d786b6fab35ae17406991ecb673d6b3a29"}, "author": "", "url": "https://uk.reuters.com/article/uk-ireland-politics-sinnfein/mcdonald-to-succeed-adams-as-sinn-fein-leader-idUKKBN1F90G8", "ord_in_thread": 0, "title": "McDonald to succeed Adams as Sinn Fein leader", "locations": [], "entities": {"persons": [{"name": "adams", "sentiment": "negative"}, {"name": "amanda ferguson", "sentiment": "none"}, {"name": "mary lou mcdonald", "sentiment": "none"}, {"name": "gerry adams", "sentiment": "none"}, {"name": "padraic halpin", "sentiment": "none"}, {"name": "john stonestreet", "sentiment": "none"}], "locations": [{"name": "ireland", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "belfast", "sentiment": "none"}], "organizations": [{"name": "sinn fein", "sentiment": "negative"}, {"name": "mcdonald", "sentiment": "negative"}, {"name": "trinity college", "sentiment": "none"}, {"name": "ira", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "irish republican army", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 20, 2018 / 11:27 AM / Updated 34 minutes ago McDonald to succeed Adams as Sinn Fein leader in striking shift Amanda Ferguson 3 Min Read \nBELFAST (Reuters) - Mary Lou McDonald will succeed Gerry Adams as Sinn Fein leader, the party said on Saturday, completing a generational shift for the Irish nationalist party as it bids to enter government on both sides of the Irish border. \nAdams, a pivotal figure in the political life of Ireland for almost 50 years, announced he would step down as leader of the former political wing of the Irish Republican Army (IRA) last November after more than three decades in charge. \nMcDonald, an English literature graduate from Trinity College Dublin who has been at the forefront of a new breed of Sinn Fein politicians softening the party’s image, was the only Sinn Fein lawmaker to put her name forward for the leadership ahead of a special convention on Feb. 10. \n“For us in Sinn Fein in the time ahead, we have to grow our party, not just our mandate but also our capacities. We have to modernise, we have to be fit for purpose, fit for our task,” McDonald said in a speech to party members in Belfast. \n“As we enter a new era, we look ahead with confidence as a party that is about being in government here in the north, in government in the south also, working forward all the time for the realisation of our ultimate goal of Irish unity.” Sinn Fein President Gerry Adams delivers a speech at his party's annual conference in Dublin, Ireland November 18, 2017. Picture taken November 18, 2017. REUTERS/Clodagh Kilcoyne \nAdams, still reviled by some sceptical voters as the face of the IRA during its campaign against British rule in Northern Ireland, hands over to a successor with no direct involvement in the three decades of conflict that came to an end in 1998. \nIt also means the left-wing party will be led on both sides of the border by women in their 40s after Michelle O‘Neill succeeded Martin McGuinness as leader in Northern Ireland shortly before the former IRA commander’s death in March. Slideshow (2 Images) \nSinn Fein has shared power in Northern Ireland since 2007 and is in negotiations to try to restore the devolved executive there but it has never governed in the south where it has grown to establish itself as the third largest party. \nWhile it trails the centre-right Fine Gael and Fianna Fail parties by some distance in opinion polls, recent surveys suggest some voters would be more willing to vote for a party led by McDonald than Adams. \nWith the big two parties likely to be able to form another minority government at best at elections that could come as soon as this year, McDonald’s leadership could also make Sinn Fein a more palatable coalition partner. Reporting by Amanda Ferguson, writing by Padraic Halpin; Editing by Janet Lawrence", "external_links": [], "published": "2018-01-20T13:27:00.000+02:00", "crawled": "2018-01-20T14:01:30.006+02:00", "highlightTitle": ""}