{"organizations": [], "uuid": "2a5fbb6778c03dba918983f92aa2d92b863114ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928397-GettyImages-901213626.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/06/winters-chill-can-take-a-big-bite-out-of-businesses-and-heres-how-they-cope.html", "country": "US", "domain_rank": 767, "title": "Winter's chill can take a big bite out of businesses, and here's how they cope", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-06T16:05:00.000+02:00", "replies_count": 0, "uuid": "2a5fbb6778c03dba918983f92aa2d92b863114ec"}, "author": "Trent Gillies", "url": "https://www.cnbc.com/2018/01/06/winters-chill-can-take-a-big-bite-out-of-businesses-and-heres-how-they-cope.html", "ord_in_thread": 0, "title": "Winter's chill can take a big bite out of businesses, and here's how they cope", "locations": [], "entities": {"persons": [{"name": "walsh", "sentiment": "none"}, {"name": "paul walsh", "sentiment": "none"}], "locations": [{"name": "u.s. east coast", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "ibm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As the U.S. East Coast recovers from a weather system that dumped several inches of snow across the region earlier this week, bone-chilling temperatures are expected to drive the mercury to record lows this weekend.\nMeanwhile, the big freeze that's gripped much of the country is having another chilling effect—one that costs money.\n\"The entire Eastern half of the country is frozen right now, and with that the economy sort of slows down ,\" Paul Walsh, a business weather analyst and meteorologist told CNBC's \"On the Money\" in an interview.\n\"It doesn't grind to a complete halt, but you can imagine that people are not out,\" Walsh explained. \"They're not doing, or spending the same kind of money on the same kinds of things.\" That aspect is important, given that businesses normally see brisk traffic immediately following the holiday season.\n\"People are basically hunkered down in their homes and not 'out and about,\" Walsh added. \"If it happens for an extended period of time, it can have a direct impact on the ebb and flow of economic activity. It impacts the entire economy.\"\nThe unusually cold weather has even impacted the normally balmy South. This week, it was so cold in Orlando, Florida that water theme parks—including Disney's Typhoon Lagoon and Sea World's Aquatica— closed amid temperatures hitting the 40's.\n\"They're going to be losing a lot of revenue in the times they're shut down,\" Walsh told CNBC, meaning that spending at places \"like restaurants and travel, a lot of those are lost forever.\"\nWalsh, who is director of weather strategy at IBM Global Business Services, describes his niche as the \"intersection of weather and consumer behavior.\" IBM sells weather data directly to business clients, including major airlines and retailers.\n\"We now have the capability to not only predict the weather, but also to be able to sense how it's going to impact consumers,\" he said.\nAnd weather means big money, particularly in the wake of a brutal hurricane season that saw catastrophic storms batter Texas, Florida and the Caribbean. The unpredictable nature of storm season means businesses have to find ways to calculate the associated risks.\n\"The interesting thing that's happening now is that more and more companies are able to take the weather data, and use analytics and even actually use artificial intelligence and sort of define from that data how the weather is likely going to be impacting what you and I are going to be needing,\" Walsh said.\nThe next step is that data is being \"pulled into retailers' replenishment and forecasting systems,\" he added. That information is then used to help select inventory, by estimating and anticipating future consumer buying demand.\n\"Retailers have been using weather data forever, but they've not really been doing it in a way that's integrated and built into systems,\" Walsh said. \"That's changing now in a really, really big way.\"\nOn the Money airs on CNBC Saturdays at 5:30 am ET, or check listings for air times in local markets.", "external_links": [], "published": "2018-01-06T16:05:00.000+02:00", "crawled": "2018-01-06T16:07:29.001+02:00", "highlightTitle": ""}