{"organizations": [], "uuid": "f37d04ffa7e7a1df665488bd64a9fea7a0055c88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-starboard-to-nominate-slate-of-nine-highly-qualified-director-candidates-for-election-at-mellanoxs-2018-annual-meeting.html", "country": "US", "domain_rank": 767, "title": "Starboard to Nominate Slate of Nine Highly Qualified Director Candidates for Election at Mellanox's 2018 Annual Meeting", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T00:59:00.000+02:00", "replies_count": 0, "uuid": "f37d04ffa7e7a1df665488bd64a9fea7a0055c88"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-starboard-to-nominate-slate-of-nine-highly-qualified-director-candidates-for-election-at-mellanoxs-2018-annual-meeting.html", "ord_in_thread": 0, "title": "Starboard to Nominate Slate of Nine Highly Qualified Director Candidates for Election at Mellanox's 2018 Annual Meeting", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "starboard value lp", "sentiment": "negative"}, {"name": "mellanox", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "mellanox technologies, ltd.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 17, 2018 /PRNewswire/ -- Starboard Value LP (together with its affiliates, \"Starboard\"), the largest shareholder of Mellanox Technologies, Ltd. (\"Mellanox\" or the \"Company\")(NASDAQ: MLNX), with an ownership interest of approximately 10.7% of the Company's outstanding shares, today announced that it will be nominating a slate of nine highly qualified candidates for election to the Board of Directors at the Company's 2018 Annual Meeting of Shareholders.\nStarboard also announced today that it has issued the following open letter to Mellanox shareholders, which can also be viewed at the following link:\nhttp://www.starboardvalue.com/wp-content/uploads/Starboard_Value_LP_Letter_to_Shareholders_01.17.2018.pdf\nA LETTER TO THE SHAREHOLDERS OF MELLANOX TECHNOLOGIES, LTD.\nJanuary 17, 2018\nDear Fellow Shareholders,\nStarboard Value LP (together with its affiliates, \"Starboard\") currently has a beneficial ownership interest of approximately 10.7% of the outstanding shares of Mellanox Technologies, Ltd. (\"Mellanox\" or the \"Company\"), making us the Company's largest shareholder. Our interests are directly aligned with yours, and after years of substantial underperformance, our goal is to help drive significant value creation for the benefit of all shareholders.\nStarboard has a long and successful history of investing in underperforming companies in the semiconductor industry and helping these companies to drive significant operational, financial, and strategic improvements.\nAs we have communicated previously, we believe Mellanox is a great company with a market leading technology portfolio and product set. We believe that Mellanox is deeply undervalued and opportunities exist within the control of management and the Board of Directors (the \"Board\") to unlock significant value for the benefit of all shareholders. We are appreciative of the constructive dialogue we have had with various members of management and the Board over the last few months and hope to continue those discussions. However, we do believe substantial change is needed after years of poor performance. Therefore, in light of the upcoming deadline for shareholder nominations, as set by the Company, and in order to preserve our rights as shareholders, we will be delivering to Mellanox a formal notice nominating nine highly qualified director candidates for election at the 2018 Annual General Meeting of Shareholders (the \"2018 Annual Meeting\").\nThe Board's primary responsibility to shareholders is to set the Company's strategy, to select a management team, to oversee management in operating the company's business, and, in particular, to hold management accountable for any failures in executing on that strategy or achieving appropriate levels of performance. Unfortunately, as we have outlined in our previous letters and presentations to management and the Board, Mellanox has been plagued by years of dismal stock price and operating performance, poor execution, excessive stock-based compensation, and a perceived inability to hold management accountable for its failure to deliver results. Mellanox's targets for operating performance have been set far below acceptable expectations, and the Company has not shown any ability to meet even its own underwhelming targets. The Company's substantial underperformance has persisted over an extended period of time, during which the Board has not taken sufficient steps to hold management accountable or to create value for shareholders. It is only recently, following the public disclosure of our involvement, that the Company has been making commitments to improve profitability and execution, and even then, as we highlighted in our letter dated January 8, 2017, those targets are woefully inadequate and still appear highly dependent on seeing a sudden inflection point in revenue growth.\nAs such, we believe that substantial change is required and warranted on the Board in order to provide a new plan for the future, a fresh perspective, renewed accountability to shareholders, and importantly, the objectivity and perspective to make difficult decisions without the burden of attachment to past practices. Only with these changes do we believe Mellanox can get back on track and become a leader in the industry across technology innovation, operating performance, and financial performance. This will be crucial to driving long-term shareholder value.\nOur selection of these nine carefully vetted nominees is the culmination of an intensive process that included the retention of an executive search firm and the evaluation of more than 100 qualified potential candidates. When evaluating potential director candidates, we looked to craft a slate of directors who have a diverse set of skills and backgrounds that, in aggregate, provide the expertise needed at Mellanox. As you can see from the detailed biographies, included below, this group of extremely impressive director candidates have backgrounds spanning operations, finance, engineering, marketing, mergers and acquisitions, restructuring, strategic transformation, and public company governance. They have substantial and highly successful experience in the semiconductor, technology, networking, and high-performance computing industries. Collectively, they have decades of experience as CEOs, CFOs, COOs, senior executives, and directors of well-performing technology companies in the United States, Israel, and around the world.\nWe believe that this level of experience is necessary and crucial for restoring credibility and accountability at Mellanox, while helping to develop a strong strategic plan aimed at unlocking the full potential of the Company's enviable technology leadership position and delivering substantial shareholder value. Importantly, this group of nominees, if elected, is prepared to serve the shareholders of Mellanox and ensure that the interests of all shareholders are of paramount importance.\nWhile we are still in the process of evaluating the degree of change that we believe is necessary on the Board, to the extent that we seek the election of all nine new directors, our present intention would be to expand the size of the Board and add back up to two incumbent directors, should they be willing to serve, in order to ensure a degree of continuity, as well as to provide additional local market presence and expertise.\nWe look forward to the Company's conference call tomorrow announcing fourth quarter 2017 results and first quarter 2018 guidance. We hope that these results will show an increased level of focus and execution, but it is important to keep in mind that one or two quarters of improvement, especially when under immense external pressure, does not make up for years of missed expectations. Our hope is that we can work with the Company to find the right long-term solution for Mellanox, rather than simply a boost in short-term performance.\nOur goal is to create value for the benefit of all shareholders. We believe that Mellanox has the potential to become a best-in-class company. However, despite years of underperformance, Mellanox is now asking shareholders to trust that the Company will execute on its plan to achieve its targets for 2018 – targets that, even if achieved, would still position Mellanox at the bottom of the peer group in terms of profitability. We believe our continued involvement is critical ", "external_links": ["http://www.starboardvalue.com/", "http://www.prnewswire.com/news-releases/starboard-to-nominate-slate-of-nine-highly-qualified-director-candidates-for-election-at-mellanoxs-2018-annual-meeting-300584245.html", "https://gesweb.prnewswire.com//USES/WebForms/TemporaryFolder/EnquiryEmail(ID-1560cbdca618).eml!x-usc:http://www.sec.gov/", "http://www.starboardvalue.com/wp-content/uploads/Starboard_Value_LP_Letter_to_Shareholders_01.17.2018.pdf"], "published": "2018-01-18T00:59:00.000+02:00", "crawled": "2018-01-18T03:35:34.017+02:00", "highlightTitle": ""}