{"organizations": [], "uuid": "79c4e05fd05e914b39032c5d042431d6ab4d0c3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224550543&w=1200&r=LYNXMPEE0M1KB", "site_section": "http://feeds.reuters.com/reuters/INentertainmentNews\r", "section_title": "Reuters: Entertainment News", "url": "https://in.reuters.com/article/us-awards-oscars-nominations-women/feeling-the-oscar-love-womens-stories-grab-attention-in-2018-nominations-idINKBN1FC2EA", "country": "US", "domain_rank": 408, "title": "Feeling the Oscar love: Women's stories grab attention in 2018 nominations", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T20:09:00.000+02:00", "replies_count": 0, "uuid": "79c4e05fd05e914b39032c5d042431d6ab4d0c3c"}, "author": "", "url": "https://in.reuters.com/article/us-awards-oscars-nominations-women/feeling-the-oscar-love-womens-stories-grab-attention-in-2018-nominations-idINKBN1FC2EA", "ord_in_thread": 0, "title": "Feeling the Oscar love: Women's stories grab attention in 2018 nominations", "locations": [], "entities": {"persons": [{"name": "lady bird", "sentiment": "none"}, {"name": "tonya harding", "sentiment": "none"}, {"name": "hawkins", "sentiment": "none"}, {"name": "greta gerwig", "sentiment": "none"}, {"name": "tonya", "sentiment": "none"}, {"name": "sally hawkins", "sentiment": "none"}, {"name": "jill serjeant", "sentiment": "none"}, {"name": "frances mcdormand", "sentiment": "none"}, {"name": "robbie", "sentiment": "none"}, {"name": "mcdormand", "sentiment": "none"}, {"name": "saiorse ronan", "sentiment": "none"}, {"name": "laurie metcalf", "sentiment": "none"}, {"name": "margot robbie", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "missouri", "sentiment": "none"}], "organizations": [{"name": "min read  los angeles", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 6:16 PM / a minute ago Feeling the Oscar love: Women's stories grab attention in 2018 nominations Jill Serjeant 4 Min Read \nLOS ANGELES (Reuters) - Sally Hawkins plays a mute cleaner with a passionate love life; Frances McDormand is a grieving woman in a fury about the shortcomings of the men around her; and Margot Robbie turns the tale of disgraced 1990s ice skater Tonya Harding on its head. \nWomen in Hollywood felt some long overdue love on Tuesday when Oscar nominations rained in for movies about their stories and for the actresses and directors who bring them to life. \nIn the best actress category, Hawkins was nominated for “The Shape of Water,” McDormand for “Three Billboards Outside Ebbing, Missouri” and Robbie for “I, Tonya.” \nGreta Gerwig, who wrote and directed best picture nominee “Lady Bird,” a story about a teenage girl brimming with self assurance, got rare female directing and screenplay Oscar nominations. Actresses Saiorse Ronan and Laurie Metcalf were also recognized for “Lady Bird.” \n“It’s fantastic for women and given the year that we’ve had, I think those nominations are popping out even stronger. They’re more apparent because of the year we’ve been through,” Metcalf told Reuters. \nThe nominations from the Academy of Motion Picture Arts and Sciences followed years of campaigning for equal pay and better opportunities behind the camera, a movement that has been boosted by women breaking their silence in recent months over sexual abuse and harassment in the entertainment industry. \n“The one clear trend in this award season is the empowerment of women,” said Tom O‘Neil, founder of awards website GoldDerby.com. FILE PHOTO: Nominees for the 90th Oscars, Best Supporting Actress Awards (L-R) Lesley Manville, Octavia Spencer, Laurie Metcalf, Mary J. Blige and Allison Janney. REUTERS/Staff/File Photos \n“It is rare that films with a female point of view do well in the best picture race, but this year we have four movies that are front-runners - ‘Lady Bird’, ‘Three Billboards,’‘The Shape of Water’ and ‘The Post’,” he said. \nOnly one woman - Kathryn Bigelow for “The Hurt Locker” in 2010 - has ever won a best director Oscar. On Tuesday Gerwig brought the number of women nominated in that category to five. \nHowever, the superhero film “Wonder Woman,” a box office hit, and its director Patty Jenkins were snubbed. That was in keeping with a tradition of generally cool treatment of action and sci-fi movies at the Academy Awards. Katja Benrath the director of the film \"Watu Wote: All of us\" the German and Kenyan joint production, reacts after hearing that her film received an Oscar nomination for the best Live Action Short Film category in Nairobi, Kenya January 23, 2018. REUTERS/Baz Ratner \nAward shows in the run-up to this year’s Oscars have been dominated by women’s issues. \nActresses turned out dressed in black en masse for the Golden Globes this month to signal support for victims of sexual misconduct in the entertainment industry and beyond. At the Screen Actors Guild awards on Sunday, all the presenters were women. \nTo be sure, the movies now vying for the most prestigious honors in the film industry were filmed before multiple allegations of impropriety against producer Harvey Weinstein triggered the #MeToo social movement and led to the downfall of dozens of powerful men in U.S. entertainment, business and politics. Weinstein has denied having non-consensual sex with anyone. \nBut the movement created an environment where attention was ready to focus on movies about women of all varieties. \nIn the past, “the stories that we have seen in general have been the stories of white men, and we are tired and done with it,” said Melissa Silverstein, founder of the Women and Hollywood blog. Additional reporting by Piya Sinha-Roy; Editing by Frances Kerry", "external_links": [], "published": "2018-01-23T20:09:00.000+02:00", "crawled": "2018-01-23T20:23:11.000+02:00", "highlightTitle": ""}