{"organizations": [], "uuid": "397eba1ca56a2e6c8327ee368e6c31f20770582c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-global-climatechange-freshwater/freshwater-under-stress-as-acidity-rises-scientists-say-idUSKBN1F1276", "country": "US", "domain_rank": 408, "title": "Freshwater under stress as acidity rises, scientists say", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T01:24:00.000+02:00", "replies_count": 0, "uuid": "397eba1ca56a2e6c8327ee368e6c31f20770582c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-global-climatechange-freshwater/freshwater-under-stress-as-acidity-rises-scientists-say-idUSKBN1F1276", "ord_in_thread": 0, "title": "Freshwater under stress as acidity rises, scientists say", "locations": [], "entities": {"persons": [{"name": "linda weiss", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}], "organizations": [{"name": "rome", "sentiment": "negative"}, {"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "current biology", "sentiment": "none"}, {"name": "fao", "sentiment": "none"}, {"name": "united nations food and agriculture organization", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROME (Thomson Reuters Foundation) - Some freshwater ecosystems are acidifying rapidly as carbon dioxide emissions rise, according to research by German scientists, raising fears over fish stocks and water quality.\nOnly 1 percent of the world’s water is freshwater, but 40 percent of all fish are found there.\nGlobally, 70 percent of freshwater is used for agriculture, including irrigation, livestock and aquaculture, according to the United Nations Food and Agriculture Organization (FAO).\nNumerous studies have warned oceans risk losing biodiversity, overall productivity and marine life due to acidification as the burning of fossil fuels raises carbon dioxide levels..\nResearch on freshwater ecosystems is rarer, but a study published Thursday in the journal Current Biology shows that they are also acidifying.\nScientists analyzed data from 1981 to 2015 in four large reservoirs in Germany.\nThey found a continuous increase of CO2 in the water and a 0.3 rise in pH, a measure of how acidic or alkaline water is, said Linda Weiss, the study’s lead author.\n“This is actually faster than the oceans because the oceans aren’t projected to acidify by 0.3 until 2100,” she told the Thomson Reuters Foundation by phone.\nRising CO2 levels also affect water flea, an important food source for fish, by making them less able to sense predators and defend themselves, the researchers found.\nThis means more of them could be eaten in the short-term, reducing the amount of food for fish, although it is too soon for detailed conclusions to be made, Weiss said.\nThe first manifestation of freshwater acidification could be poor water quality because a bacteria known for producing toxins seems to thrive in high CO2 freshwater, said Caleb Hasler, assistant professor at the University of Winnipeg, who studies aquatic conservation.\nFurther studies are urgently needed to evaluate the potential ecological and economic fallout from acidification in inland rivers, lakes and streams, scientists said.\nA 2015 study on the Laurentian Great Lakes in North America, the largest freshwater system on Earth, found they were acidifying at the same rate as oceans.\nWeiss said this difference in findings may be due to the size of the water body or geology.\n“We’d like to have more data from around the world so we can identify whether this is a global phenomenon or whether there are geographical differences,” she said.\nReporting By Thin Lei Win, Editing by Jared Ferrie and Ros Russell; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, corruption and climate change. Visit www.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-13T01:24:00.000+02:00", "crawled": "2018-01-13T14:41:39.001+02:00", "highlightTitle": ""}