{"organizations": [], "uuid": "198fe08a56c6f54f75a4e2d63362e16de5cb72e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1220019081&w=1200&r=LYNXMPEE060D2", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-idlib/syrian-army-presses-offensive-in-last-rebel-stronghold-of-idlib-idUKKBN1EW0FB", "country": "US", "domain_rank": 408, "title": "Syrian army presses offensive in last rebel stronghold of Idlib", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T14:06:00.000+02:00", "replies_count": 0, "uuid": "198fe08a56c6f54f75a4e2d63362e16de5cb72e3"}, "author": "", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-idlib/syrian-army-presses-offensive-in-last-rebel-stronghold-of-idlib-idUKKBN1EW0FB", "ord_in_thread": 0, "title": "Syrian army presses offensive in last rebel stronghold of Idlib", "locations": [], "entities": {"persons": [{"name": "abu al-duhur", "sentiment": "none"}, {"name": "assad", "sentiment": "none"}, {"name": "bashar al-assad", "sentiment": "none"}], "locations": [{"name": "beirut", "sentiment": "none"}, {"name": "idlib", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "sinjar", "sentiment": "none"}, {"name": "abu al-duhur airport", "sentiment": "none"}], "organizations": [{"name": "reuters/ammar abdullah  forces", "sentiment": "none"}, {"name": "hezbollah", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 12:06 PM / Updated 2 hours ago Syrian army presses offensive in last rebel stronghold of Idlib Reuters Staff 3 Min Read \nBEIRUT (Reuters) - Syria’s army and its allies pressed further into the country’s largest remaining rebel stronghold on Sunday, capturing a town and several villages as they approached a military airport, a pro-Damascus media unit and a war monitor reported. FILE PHOTO: Civil Defence members and civilians remove rubble in a damaged site after an airstrike on Idlib city, Syria March 15, 2017. REUTERS/Ammar Abdullah \nForces loyal to Bashar al-Assad have stepped up the offensive in the southern province of Idlib in recent days, advancing towards the Abu al-Duhur airport, which rebels captured from the president’s troops in September 2015. \nThe Syrian army and its allies “have gained control over the town of Sinjar,” 14 kms (nine miles) from Abu al-Duhur, and three villages to the west, the media unit run by Assad ally Hezbollah reported. \nSupported by Iran-backed militias and Russian air power, Assad’s forces have since late October taken back rebel-held territory in Idlib and the northeastern province of Hama. \nThe Syrian Observatory for Human Rights said on Sunday the army had taken more than 95 villages in Hama and Idlib since Oct. 22, including around 60 in Idlib alone during the past 14 days. \n“Battles have shifted now to the northwest of Sinjar after the Syrian army and its allies have controlled the town,” the Britain-based monitor reported. \nThe main rebel force in Idlib is Tahrir al-Sham, spearheaded by the former al-Qaeda’s affiliate in Syria previously called Nusra Front. \nThe Syrian army lost Idlib, which borders Turkey, to insurgents when the provincial capital fell in 2015. It became the only province fully under opposition control. \nThe largest population gathering is in Eastern Idlib, the monitor said, expressing fears from further intensive civilian displacement in the coming few days due to the ongoing fighting. \nTens of thousands of rebels and civilians took refuge in Idlib after abandoning their homes in other parts of western Syria that the government and its foreign allies have retaken. \nThe fighting and air strikes have forced more than 60,000 people to leave their homes since Nov. 1, according to the U.N. Office for the Coordination of Humanitarian Affairs (OCHA). \nThe United Nations said the civilians newly displaced by the fighting in Idlib were in a “dire” situation. Reporting by Dahlia Nehme; editing by John Stonestreet", "external_links": [], "published": "2018-01-07T14:06:00.000+02:00", "crawled": "2018-01-07T14:39:38.010+02:00", "highlightTitle": ""}