{"organizations": [], "uuid": "40b362f6825aafe8ece0f7a75ca27c478708fa55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/business-wire-tommaso-chiabra-like-bill-gates-and-leonardo-dicaprio-joins-the-beyond-meat-family-the-californian-company-that-creates-meat.html", "country": "US", "domain_rank": 767, "title": "Tommaso Chiabra, Like Bill Gates and Leonardo Dicaprio, Joins the Beyond Meat Family, the Californian Company That Creates Meat from Plants", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.991, "site_type": "news", "published": "2018-01-15T19:06:00.000+02:00", "replies_count": 0, "uuid": "40b362f6825aafe8ece0f7a75ca27c478708fa55"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/business-wire-tommaso-chiabra-like-bill-gates-and-leonardo-dicaprio-joins-the-beyond-meat-family-the-californian-company-that-creates-meat.html", "ord_in_thread": 0, "title": "Tommaso Chiabra, Like Bill Gates and Leonardo Dicaprio, Joins the Beyond Meat Family, the Californian Company That Creates Meat from Plants", "locations": [], "entities": {"persons": [{"name": "leonardo dicaprio", "sentiment": "neutral"}, {"name": "tommaso chiabra", "sentiment": "neutral"}, {"name": "bill gates", "sentiment": "neutral"}, {"name": "ethan brown", "sentiment": "none"}], "locations": [{"name": "plants monaco", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MONACO--(BUSINESS WIRE)--\nItalian entrepreneur Tommaso Chiabra is also investing in Beyond Meat, the company founded in 2009 by Ethan Brown, committed to producing meat with vegetable proteins that perfectly replace animals ones.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180115005436/en/\nTommaso Chiabra (Photo: Business Wire)\nNot only. In addition to having the same amount of protein, Beyond Meat burgers look, smell, taste and have a texture similar to those of a normal hamburger without involving any animal produce.\n\"Replacing animal proteins with plant protein sources is a revolution that will work wonders for human health, for the environment, for the conservation of natural resources and for the animals,\" says Tommaso Chiabra. \"The meat industry has a strong environmental impact. Investing in ethical and environmental causes is one of my commitments as a businessman who looks to the future as an activist. For me not only the business, but also making more changes in the world is important\".\nThe excitement of this challenging mission is also confirmed by the fundraising round that just ended, being promoted by Don Thompson, former CEO MacDonald Corporation: $ 55 million to finance the research and development of Beyond Meat. The list of investors includes Chiabra, Bill Gates, Biz Stone, and Evan Williams, co-founders of Twitter, and Tyson Foods, the largest meat producer in the US.\nSatisfying the palate through plants can be the right way to save the Earth. In fact, 18% (FAO data) of the global greenhouse gas emissions are caused by livestock breeding and 1/3 of the Earth’s soil (excluding glaciers) is now used for grazing animals and for producing crops destined to feed them. To save the Planet we also need a sustainable and healthy lifestyle; a more vegetarian diet or one poor in meat (especially red), thus additionally lowering the carcinogenic and heart risks, for example.\n\"The first time I tasted a Beyond Burger, I did not realize it was not meat,\" says Chiabra. \"Forget everything you know about vegetarian burgers ...\", reads The Ophra Magazine. Featured in the menu of over 4,000 restaurants in the United States, and sold in grocery stores next to products of animal origin, Beyond Burger is made of simple and fresh ingredients: peas that provide proteins, traces of beetroot that give the intense red color, coconut oil and potato starch that ensure softness and flavor. The result is a burger that sizzles on the grill next to strips of chicken and spicy-minced meat made directly from the plants and ready to stuff tacos and nachos.\nTommaso Chiabra will meet Seth Goldman, executive president of Beyond Meat, on the occasion of his participation at Seeds & Chips in Milan (7-10 May 2018), to make a point together on the development of the Californian company in Europe.\nAbout Tommaso Chiabra\nBorn in Genoa, Tommaso Chiabra (1986) is an entrepreneur with an international professional backgroung. In 2011 he created Royal Yacht Brokers, a leading luxury brokerage company based in Monaco, and is a partner/investor of Billionaire Mansion Dubai with Flavio Briatore. He also has holdings in Berenford, IAM Drinks, Beyond Meat, and is an investor and member of the Board of Directors of Menè Inc., a company with IPO (Initial Public Offering) in February 2018. Since 2016, he has also been a consultant for Unicef Italia.\nAbout Beyond Meat\nWith headquarters in El Segundo (Los Angeles), Beyond Meat is committed to the development of plant-based food products since 2009 and its meat is now sold in over 19,000 US stores. For more information, visit www.beyondmeat.com and follow #BeyondBurger and #FutureOfProtein on Facebook, Instagram, Twitter.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180115005436/en/\nFor contacts and interviews:\nTommaso Chiabra Holding\nAndra Coman, phone no. +33607930115\nmail: info@tommasochiabraholding.com\nSource: Beyond Meat", "external_links": ["http://www.businesswire.com/news/home/20180115005436/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.beyondmeat.com&esheet=51743127&newsitemid=20180115005436&lan=en-US&anchor=www.beyondmeat.com&index=1&md5=c414e4ea4e83e1d5b827ef162ad2f56c"], "published": "2018-01-15T19:06:00.000+02:00", "crawled": "2018-01-15T23:10:12.002+02:00", "highlightTitle": ""}