{"organizations": [], "uuid": "4e3dbe3ce59c66e61275831678c1c47e7dca2447", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/legal", "section_title": "Legal News | Reuters", "url": "https://www.reuters.com/article/legal-us-otc-volkswagen/vw-class-counsel-nationwide-deal-wont-be-undone-by-9th-circuits-hyundai-ruling-idUSKBN1FE2WI", "country": "US", "domain_rank": 408, "title": "VW class counsel: Nationwide deal won’t be undone by 9th Circuit’s Hyundai ruling", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T04:06:00.000+02:00", "replies_count": 0, "uuid": "4e3dbe3ce59c66e61275831678c1c47e7dca2447"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/legal-us-otc-volkswagen/vw-class-counsel-nationwide-deal-wont-be-undone-by-9th-circuits-hyundai-ruling-idUSKBN1FE2WI", "ord_in_thread": 0, "title": "VW class counsel: Nationwide deal won’t be undone by 9th Circuit’s Hyundai ruling", "locations": [], "entities": {"persons": [{"name": "ted frank", "sentiment": "none"}, {"name": "robert carey", "sentiment": "none"}, {"name": "jacqueline nguyen", "sentiment": "none"}, {"name": "hagens berman sobol shapiro", "sentiment": "none"}], "locations": [{"name": "hyund", "sentiment": "none"}], "organizations": [{"name": "vw", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "9th u.s. circuit court of appeals", "sentiment": "negative"}, {"name": "9th circuit’s hyundai", "sentiment": "neutral"}, {"name": "kia fuel economy litigation", "sentiment": "none"}, {"name": "competitive enterprise institute", "sentiment": "none"}, {"name": "hyundai", "sentiment": "none"}, {"name": "9th circuit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - The 9th U.S. Circuit Court of Appeals’ missile strike of a ruling Tuesday in In re Hyundai and Kia Fuel Economy Litigation undoing a $200 million nationwide class action settlement because the trial judge failed to analyze consumer laws in all 50 states – had class action lawyers on all sides scurrying Wednesday to survey the impact of a ruling that, in the words of dissenting judge Jacqueline Nguyen , delivered a “major blow” to nationwide class action settlements.\nOne of the plaintiffs’ lawyers in the Hyundai class action, Robert Carey of Hagens Berman Sobol Shapiro , said proponents of the settlement intend to ask the full 9th Circuit to rehear the case, but he also acknowledged that, in the meantime, the decision “will certainly change the framework for presenting (nationwide) deals (because) it seems to require trial courts to shadowbox against hypothetical issues that could arise in multiple states, which is not an obligation that was imposed in the past.”\nTed Frank of the Competitive Enterprise Institute, who represents class action objectors, said the Hyundai ruling will boost his 9th Circuit appeal in an antitrust class action by lithium battery purchasers .\nAt a minimum, wrote Andrew Trask of McGuireWoods at his Class Action Countermeasures blog, the Hyundai decision has given new vigor to defense arguments against certification of nationwide classes in the 9th Circuit, but has added uncertainty and expense for defendants who want to settle.\nThe most prominent potential target of the 9th Circuit’s Hyundai decision might seem to be Volkswagen’s $15 billion nationwide settlement with owners and lessees of cars rigged to cheat emissions tests. The final approval of that settlement, by U.S. District Judge Charles Breyer of San Francisco, is before the 9th Circuit right now, via some of the same lawyers who raised objections in the Hyundai case. In December, a three-judge 9th Circuit panel heard arguments in one set of VW objectors’ appeals, with two additional sets yet to be argued.\nLike U.S. District Judge George Wu of Los Angeles, who took the 9th Circuit’s heat in the Hyundai ruling, Judge Breyer did not engage in state-by-state analysis of consumer protection laws when he determined , as required under Rule 23 of the Federal Rules of Civil Procedure, that common issues across the nationwide class predominate over individual issues.\nJudge Breyer said simply that if he were to find that VW “has indeed engaged in a deceptive and fraudulent scheme, such a finding would apply to all of the class members’ claims,” the judge wrote. “Plaintiffs also allege a common and unifying injury, as their and other class members’ injuries arise solely from Volkswagen’s use of the defeat device. As such, the court finds predominance is met.”\nSo far, none of the objectors challenging the merits of the VW settlement – as distinguished from those challenging fee awards in the class action – has filed a post-argument notice to the 9th Circuit of the supplemental authority of the Hyundai ruling. James Feinman , who argued and won for objectors in the Hyundai appeal and has challenged the VW settlement under the Clean Air Act, declined to comment. Two other objectors’ lawyers from the VW case, Steve Miller and Bryan Brody, did not return my calls.\nBut according to class counsel Elizabeth Cabraser of Lieff Cabraser Heimann & Bernstein , objectors won’t get any traction from the Hyundai decision anyway. The key reason, she said in an email statement, is that the VW case addressed the carmaker’s alleged violation of federal environment regulations – not just the state consumer laws at issue in the Hyundai case. Moreover, Cabraser said, the private class action was part of a set of agreements VW reached with car owners and state and federal regulations. “All worked together to enforce the environmental controls of an integrated national environmental protection system and to fashion consumer remedies - including buybacks, repairs and restitution - that would be uniformly enforced by the federal court, and that would incentivize consumers across the country to … accomplish the common goal of preserving national emissions standards and protecting our shared environment,” Cabraser said in her email.\nPlaintiffs’ lawyers in the VW case also built an acknowledgment of variety in state consumer laws into their consolidated complaint, which asserts allegations under the consumer protection statutes of each state. So even though Judge Breyer did not discuss each state’s laws in his predominance analysis, he was at least arguably informed, via the consolidated complaint, of how VW’s conduct played across state lines.\nAnd finally, it’s pretty much impossible to imagine the 9th Circuit overturning a settlement in which more than 400,000 car owners and lessees have already made claims for more than $7 billion, removing or repairing hundreds of thousands of polluting cars.\nEven after the 9th Circuit’s Hyundai decision, some nationwide class actions may be too big to fail.\nThe views expressed in this article are not those of Reuters News.\n ", "external_links": ["https://cei.org/sites/default/files/Lithium.1902.Bednarz%20objection.pdf", "http://thomsonreuters.com/en/about-us/trust-principles.html", "https://www.classactioncountermeasures.com/", "http://www.youtube.com/watch?v=9PWQTSONgjY"], "published": "2018-01-26T04:06:00.000+02:00", "crawled": "2018-01-25T23:22:43.002+02:00", "highlightTitle": ""}