{"organizations": [], "uuid": "e53f40c9c92581f0cd0a66139be77162c22b4dd2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221065346&w=1200&r=LYNXMPEE0A0FT", "site_section": "http://feeds.reuters.com/reuters/INtopNews\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/asia-forex-emerging/most-emerging-asian-currencies-get-bullish-lift-chinas-yuan-indian-rupee-solid-reuters-poll-idINKBN1F00OV", "country": "US", "domain_rank": 408, "title": "Most emerging Asian currencies get bullish lift; China's yuan, Indian rupee solid: Reuters poll", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T10:03:00.000+02:00", "replies_count": 0, "uuid": "e53f40c9c92581f0cd0a66139be77162c22b4dd2"}, "author": "", "url": "https://in.reuters.com/article/asia-forex-emerging/most-emerging-asian-currencies-get-bullish-lift-chinas-yuan-indian-rupee-solid-reuters-poll-idINKBN1F00OV", "ord_in_thread": 0, "title": "Most emerging Asian currencies get bullish lift; China's yuan, Indian rupee solid: Reuters poll", "locations": [], "entities": {"persons": [{"name": "narendra modi", "sentiment": "none"}, {"name": "susan mathew", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "bharatiya janata party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 8:05 AM / Updated 9 hours ago Most emerging Asian currencies get bullish lift; China's yuan, Indian rupee solid: Reuters poll Susan Mathew 5 Min Read \n(Reuters) - Investors raised their long positions on most Asian currencies over the last three weeks, with the Indian rupee enjoying the biggest boost, as the dollar was hit by uncertainty over the pace of U.S. rate increases, the euro rally and possible tapering of Japanese stimulus. An employee counts Indian rupee currency notes inside a private money exchange office in New Delhi July 5, 2013. REUTERS/Adnan Abidi/Files \nThe dollar ended 2017 lower, with the index measuring the greenback against a basket of six major currencies down close to 10 percent on the year. \nAmong regional currencies, bullish bets on the Indian rupee reached its highest since August 2017, according to the poll of 11 analysts, traders and fund managers. \nIn December, the rupee got a boost when the ruling Bharatiya Janata Party won state elections in Prime Minister Narendra Modi’s state. \nPossible economic benefits, including from the post-demonetization phase and implementation of the goods and service tax, may have boosted sentiment for the rupee in the near term, another Reuters poll showed. \nThe Chinese yuan saw bullish positions being raised to their highest since September 9. \nChina’s central bank on Tuesday said it would loosen control on the yuan exchange rate by reducing the “counter-cyclical factor” in determining the yuan mid point, giving markets more leeway in the fix. \nThe People’s Bank of China (PBOC) introduced the factor in May last year to the formula it uses to determine the mid-point reference rate for the yuan’s exchange rate against the U.S. dollar each day. That factor was designed to lessen the impact of market forces on the yuan’s reference point when the Chinese currency wobbled briefly at the start of 2017. \nAn adviser to the central bank, Sheng Songcheng said over the weekend that the yuan will likely stabilize to around 6.6 against the greenback in the longer-term. \nLong position were the strongest for the South Korean won, which saw investors raise their bullish bets to the highest since November end. \nThe won rallied to a three-year intraday high earlier this week. The nation’s current account has been in surplus for 69 straight months through November last year. A man displays new 2000 Indian rupee banknotes after withdrawing them from a State Bank of India (SBI) branch in Kolkata, November 10, 2016. REUTERS/Rupak De Chowdhuri/Files \nThe largely positive bets on Asian currencies were supported by uncertainty over the pace of the Federal Reserve’s rate increases this year. \nThe dollar has also been undermined by a rally in the euro as the common currency got a boost from expectations the European Central Bank will begin to taper its stimulus soon. In Tokyo, speculation is rife that the Bank of Japan may start to slow its money spigot later this year, keeping the yen solidly bid. \nLong positions on the Malaysian ringgit remained strong, though slightly lagged those from three weeks ago. \nLast week, the ringgit strengthened to its highest level since August 2016 against the dollar, boosted by higher oil prices. Slideshow (4 Images) \nInvestors trimmed their bullish bets on the Philippine peso to the lowest since May 2017 by assuming a neutral stance. Investors in the peso appear to have looked passed a ratings upgrade by Fitch, strong third-quarter economic growth and passage of a much awaited tax reform bill. \nConcerns about the balance of payments position may have been behind the lukewarm reaction. On Wednesday, the Philippines posted its biggest trade deficit in November, as imports surged and underscored worries that a current account deficit would weaken the peso. \nThe government has set a record 3.8 trillion pesos ($75.50 billion) budget for this year, as it aims to build more ports, airports and railways to attract investments and boost economic growth. \nThat suggests sustained import demand and puts the nation on track for its first annual current account deficit in 15 years, keeping peso bulls in check as traders worry how the gap would be funded if foreign investment doesn’t keep pace. \nThe poll was conducted between Tuesday and Wednesday with the bulk of the responses coming in by Wednesday. \nThe Asian currency positioning poll is focused on what analysts and fund managers believe are the current market positions in nine Asian emerging market currencies: the Chinese yuan, South Korean won, Singapore dollar, Indonesian rupiah, Taiwan dollar, Indian rupee, Philippine peso, Malaysian ringgit and the Thai baht. \nThe poll uses estimates of net long or short positions on a scale of minus 3 to plus 3. A score of plus 3 indicates the market is significantly long U.S. dollars. \nThe figures include positions held through non-deliverable forwards (NDFs). Reporting by Susan Mathew; additional reporting by Aditya Soni and Ambar Warrick in Bengaluru; Editing by Shri Navaratnam", "external_links": [], "published": "2018-01-11T10:03:00.000+02:00", "crawled": "2018-01-11T10:19:22.008+02:00", "highlightTitle": ""}