{"organizations": [], "uuid": "87a1c6ffa134b78dc006daeafa02d99dcdadbc08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/20/reuters-america-update-16-u-s-government-shutdown-begins-as-spending-bill-fails-in-senate.html", "country": "US", "domain_rank": 767, "title": "UPDATE 16-U.S. government shutdown begins as spending bill fails in Senate", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T08:30:00.000+02:00", "replies_count": 0, "uuid": "87a1c6ffa134b78dc006daeafa02d99dcdadbc08"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/20/reuters-america-update-16-u-s-government-shutdown-begins-as-spending-bill-fails-in-senate.html", "ord_in_thread": 0, "title": "UPDATE 16-U.S. government shutdown begins as spending bill fails in Senate", "locations": [], "entities": {"persons": [{"name": "schumer", "sentiment": "negative"}, {"name": "mcconnell", "sentiment": "negative"}, {"name": "chuck schumer", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "senate", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds reaction from Schumer and McConnell, details)\nWASHINGTON, Jan 19 (Reuters) - The U.S. government shut down at midnight on Friday after Democrats and Republicans failed to reach a last-minute deal to fund its operations, divided in a bitter dispute over immigration and border security.\nIn a dramatic late-night session, senators blocked a bill to extend government funding through Feb. 16. The bill needed 60 votes in the 100-member Senate but fell short, with only 50 supporting it.\nMost Democrats opposed the bill because their efforts to include protections for hundreds of thousands of mostly young immigrants known as Dreamers failed.\nHuddled negotiations by Senate Majority Leader Mitch McConnell and Senate Democratic leader Chuck Schumer in the last minutes before midnight were unsuccessful, and the U.S. government technically ran out of money at midnight.\nThe shutdown formally began on Saturday, the first anniversary of President Donald Trump's inauguration.\nTrump immediately sought to blame Democrats.\n\"Tonight, they put politics above our national security, military families, vulnerable children, and our countrys ability to serve all Americans,\" the White House said in a statement.\nIt also said it would not discuss immigration until the government is up and running again.\n\"We will not negotiate the status of unlawful immigrants while Democrats hold our lawful citizens hostage over their reckless demands. This is the behavior of obstructionist losers, not legislators.\"\nIn return, Schumer pointed the finger directly at Trump.\n\"It's almost as if you were rooting for a shutdown and now we'll have one and the blame should crash entirely on President Trump's shoulders,\" he said.\nUntil a funding deal is worked out, scores of federal agencies across the country will be unable to operate, and hundreds of thousands of \"non-essential\" federal workers will be put on temporary unpaid leave.\nThe Republican-controlled House of Representatives passed a stopgap funding measure on Thursday. But Republicans then needed the support of at least 10 Democrats to pass the bill in the Senate. While five Democrats ended up voting for the measure, five Republicans voted against it.\nDemocratic leaders demanded that the measure include protections from deportation for about 700,000 undocumented immigrants known as Dreamers who arrived in the United States as children.\nDespite bipartisan negotiations, Republican leaders refused to include those protections, and neither side was willing to back down. McConnell and Schumer insisted they were still committed to finding an agreement that restores government funding as soon as possible.\nTrump, who had made strict measures on immigration a cornerstone of his presidential campaign, last week rejected a bipartisan proposal, saying he wanted to include any deal for Dreamers in a bigger legislative package that also boosts funding for a border wall and tighter security at the U.S. border with Mexico.\nSchumer met with Trump on Friday afternoon and later said he had reluctantly agreed to include the border wall in the negotiations but that it still was not enough to persuade Trump to find a compromise.\nSchumer also called on Trump and leaders of both parties to resume negotiations on Saturday.\nMcConnell said he would seek a new funding bill through to Feb. 8 but a Senate Democratic source said that was too far out. Democrats had argued for an extension of four or five days to force both sides into serious negotiations on the immigration issue.\nIn a shutdown, \"essential\" employees who deal with public safety and national security would keep working. That includes more than 1.3 million people on active duty in the military who would be required to work but would not be paid until funding is renewed or handled with separate legislation.\nAlthough past government shutdowns have done little lasting damage to the U.S. economy, they can rattle financial markets.\nThis impasse follows a months-long struggle in Congress to agree on government funding levels and protections for Dreamers, most of whom are originally from Mexico and Central America.\nThey were given temporary legal status under the Deferred Action for Childhood Arrivals program started by former President Barack Obama.\nIn September, Trump announced he was ending the program and gave Congress until March 5 to come up with new legislation. (Additional reporting by Roberta Rampton and Jim Oliphant; Editing by Kieran Murray, Leslie Adler and Michael Perry)", "external_links": [], "published": "2018-01-20T08:30:00.000+02:00", "crawled": "2018-01-20T08:41:55.005+02:00", "highlightTitle": ""}