{"organizations": [], "uuid": "f03bfd7583776e58204e07018256196fa2e044b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/20/104599572-GettyImages-484161839.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/18/tax-mistakes-everyone-makes-and-how-to-avoid-them.html", "country": "US", "domain_rank": 767, "title": "Tax mistakes everyone makes and how to avoid them", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T16:19:00.000+02:00", "replies_count": 0, "uuid": "f03bfd7583776e58204e07018256196fa2e044b8"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/18/tax-mistakes-everyone-makes-and-how-to-avoid-them.html", "ord_in_thread": 0, "title": "Tax mistakes everyone makes and how to avoid them", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "irs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tax season is upon us and with it comes the joy of a tax refund, if you're lucky. If you're less fortunate, you might find yourself facing a high tax bill — or worse, a tax audit. When you file your taxes, there are a few easy-to-make mistakes you'll need to dodge. Failing to do so could put your finances in jeopardy for the rest of the year.\nClick through to learn how you might be committing tax fraud without even knowing it , and let financial experts teach you how to avoid filing mistakes.\nForgetting to review payroll withholding deductions Getting a tax refund feels good. But if you are a salaried employee or hourly wage earner, it pays to understand why that money is coming back to you.\nOver the course of the year, your employer deducts taxes from each of your paychecks and sends that money to the IRS on your behalf. If you get a refund, it means you overpaid. In other words, your estimation of how much you owed was too high.\nMore from GOBankingRates:\nTax strategies the rich don't want you to know\n30 ways to prevent a tax audit\n12 secret moves to double your 401(k)\nEmployers base payroll deductions on the information you provide when you complete your W-4 form, which lists your dependents and other tax-related information. Trish Maselli, founder and CEO of Clear Cut Accounting Services in Ivoryton, Conn., said employees who don't fill out their W-4 forms correctly might end up overpaying on federal and state taxes throughout the year.\nInstead, learn how to fill out a W-4 correctly .\nshow chapters The most common negotiating mistake that workers make 1:55 PM ET Thu, 13 July 2017 | 01:07 If you overestimate, you'll get a refund. But this means you have effectively used the IRS as a zero-interest savings account for the past 12 months. \"My rule of thumb is to have at least 10 percent of your income taken out of your income,\" said Maselli.\nOn the other hand, fail to have enough withheld and you'll have to come up with cash at tax time to cover any shortage. You also might owe penalties in some cases. Your withholding should be enough to cover the tax bill at the end of the year.\nHow to correct the problem Review your W-4s regularly. Life changes can occur over the course of the year, and you can adjust your W-4 information at any time.\n\"Most individuals fail to review this form yearly and really should review it halfway through the year to adjust their withholding deductions, so they can adjust their federal and state tax withdrawals,\" Maselli said.\nMaking errors that can happen to anyone Some mistakes cost taxpayers money, but others cost time and create unnecessary stress and headaches. John Adams, a certified public accountant and partner at Cook Martin Poulson in Salt Lake City, listed the following mistakes that can cause the IRS to look twice at your return:\n- Transposing digits in your", "external_links": [], "published": "2018-01-18T16:19:00.000+02:00", "crawled": "2018-01-18T18:47:50.009+02:00", "highlightTitle": ""}