{"organizations": [], "uuid": "739497e5fe5244ef3e25a0b68d1362f901bf67fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-german-yields-near-highs-as-coalition-talks-add-to-ecb-jitters-idUSL8N1P723E", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Euro zone bond yields fall as ECB's Weidmann knocks rate-hike talk", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-12T19:56:00.000+02:00", "replies_count": 0, "uuid": "739497e5fe5244ef3e25a0b68d1362f901bf67fb"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-german-yields-near-highs-as-coalition-talks-add-to-ecb-jitters-idUSL8N1P723E", "ord_in_thread": 0, "title": "UPDATE 2-Euro zone bond yields fall as ECB's Weidmann knocks rate-hike talk", "locations": [], "entities": {"persons": [{"name": "weidmann", "sentiment": "negative"}, {"name": "fanny potkin", "sentiment": "none"}, {"name": "dhara ranasinghe", "sentiment": "none"}, {"name": "jens weidmann", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "bundesbank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "central bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* German Bund yields hits 0.54 pct\n* German coalition agreement boosts sentiment\n* Italian 10-year yields down 6 bps\n* Other euro zone yields flat to 1-2 bps lower (Updates prices, adds US data)\nBy Dhara Ranasinghe and Fanny Potkin\nLONDON, Jan 12 (Reuters) - Euro zone bond yields fell on Friday, with German yields pulling back from five-month peaks after a top European Central Bank official played down the risk of an imminent rate hike.\nBond yields rose sharply on Thursday after the accounts of the latest ECB meeting showed policymakers were preparing for a change in their message to reflect an improved economic outlook for the euro zone.\nBut Bundesbank President Jens Weidmann, normally one of the staunchest critics of the ECB’s ultra-easy policy, said late on Friday the risk of an imminent hike in the ECB’s interest rates was low.\nGermany’s benchmark 10-year Bund yield, which had hit a five-month high at 0.54 percent earlier in the day, was last down 2 basis points at around 0.51 percent.\nBorrowing costs in southern Europe, outperforming after news of an outline deal in Germany between Chancellor Angela Merkel and Social Democrat (SPD) that could pave the way for a coalition government, fell further.\nThe news of progress towards a German coalition pushed the euro to a three-year high.\nThe SPD are considered heavily pro-Europe, with leader Martin Schulz last year arguing for closer ties and calling for a “United States of Europe”.\nItaly’s 10-year government bond yield was down 8 basis points at 1.98 percent and the spread over the German equivalent was at its tightest since mid-December at 146 basis points at one stage.\nItalian bond yields were set for their biggest one-day fall since early November.\nSpanish 10-year yields were down 4 bps on the day at 1.51 percent.\n“There’s been an out-performance today by the two ... which coincides with the news coming out of Germany,” said ABN AMRO senior fixed income strategist Kim Liu.\nRobust U.S. inflation data had put some upward pressure on euro zone bond yields, but that proved fleeting in the wake of Weidmann’s remarks.\nUnderlying U.S. consumer prices posted their biggest gain in 11 months in December, bolstering expectations about a pickup in domestic inflation and about Federal Reserve interest rate hikes this year.\nTwo-year U.S. Treasury yields jumped to over 2 percent to their highest since September 2008.\nBond markets globally have been rattled this week by signs that major central banks could step back extraordinary monetary stimulus sooner rather than later.\nMoney markets now price in a 70 percent chance of a 10 basis point hike from the European Central Bank by year-end.\n“Markets will stay nervous until (ECB president) Draghi provides his views on the aggressive repricing and euro appreciation two weeks from now,” said Commerzbank strategist Michael Leister.\nReporting by Abhinav Ramnarayan Saikat Chatterjee; Editing by Jon Boyle\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T19:56:00.000+02:00", "crawled": "2018-01-13T14:47:44.011+02:00", "highlightTitle": ""}