{"organizations": [], "uuid": "902310fdfc5508e9bc4dac99d069c32c1f62d1d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225124930&w=1200&r=LYNXMPEE0O0QY", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-cilic/cilic-tames-edmund-to-reach-first-australian-open-final-idUKKBN1FE1H2", "country": "US", "domain_rank": 408, "title": "Cilic tames Edmund to reach first Australian Open final", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T13:45:00.000+02:00", "replies_count": 0, "uuid": "902310fdfc5508e9bc4dac99d069c32c1f62d1d2"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-cilic/cilic-tames-edmund-to-reach-first-australian-open-final-idUKKBN1FE1H2", "ord_in_thread": 0, "title": "Cilic tames Edmund to reach first Australian Open final", "locations": [], "entities": {"persons": [{"name": "edmund", "sentiment": "negative"}, {"name": "kyle edmund", "sentiment": "none"}, {"name": "cilic", "sentiment": "none"}, {"name": "toby davis", "sentiment": "none"}, {"name": "chung hyeon", "sentiment": "none"}, {"name": "marin cilic", "sentiment": "none"}, {"name": "roger federer", "sentiment": "none"}], "locations": [{"name": "rod laver arena", "sentiment": "none"}], "organizations": [{"name": "cilic", "sentiment": "negative"}, {"name": "min read  melbourne", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ian ransom", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 11:47 AM / Updated 6 hours ago Ruthless Cilic routs ailing Edmund to reach final Ian Ransom 4 Min Read \nMELBOURNE (Reuters) - A business-like Marin Cilic doused the fire of Kyle Edmund before crushing the ailing Briton 6-2 7-6(4) 6-2 to become Croatia’s first Australian Open finalist on Thursday. \nSixth seed Cilic, who won his quarter-final when Rafa Nadal retired hurt in the fifth set, was again ruthless against a reduced opponent, ending 49th-ranked Edmund’s dream run after just two hours and 18 minutes at a floodlit Rod Laver Arena. \nSealing the match with a thumping serve, the 2014 U.S. Open champion will bid for his second grand slam title against Friday’s winner of Roger Federer and South Korea’s rising star Chung Hyeon. \nHe will also enjoy two full days off after his centre court cakewalk which left the largely pro-Edmund crowd cold on a hazy, moist evening. \nEverything is in a “good, solid spot”, said the confident Croatian, who will contest his third grand slam final after being thrashed by Federer at Wimbledon. \n“I‘m playing much, much more aggressive,” the 29-year-old told reporters. \n“I‘m feeling that I am, for most of the shots, hitting them really, really good ... Feeling really excited about the final, too.” \nIt was hard to disagree with the 6-ft 6-in (1.98m) Cilic, who put on a masterclass of clean hitting and was virtually unplayable on his first serve. \nAn agitated Edmund, however, needed a medical time-out after the first set and slowed appreciably in the third. \nIt was a deflating end to a match that had showed promise when the 23-year-old Yorkshireman came out in a blaze of shot-making to grab early break points. \nCilic served away the danger and studiously avoided Edmund’s bazooka forehand. \nGiven little latitude on his favoured side, a frustrated Edmund was broken in the sixth game when he slapped a backhand into the net tape and the rebound went wide. \nCilic calmly broke him again, wrapping up the set with a searing forehand to the corner. MEDICAL TIME-OUT Tennis - Australian Open - Semifinals - Rod Laver Arena, Melbourne, Australia, January 25, 2018. Marin Cilic of Croatia serves against Kyle Edmund of Britain. REUTERS/Toru Hanai \nWith only a single forehand winner to his name, Edmund exited the court for a medical time-out but returned still troubled of mind. \nHe lost his temper at 2-2, arguing with the umpire heatedly after Cilic was awarded a point on a challenge. \n“Get the referee, I‘m not having it,” he snapped before being flat-batted by the second match official. \nThe blow-up seemed to help as he served out to love and kept snapping at Cilic’s heels all the way to a tiebreak. Slideshow (5 Images) \nBut from there the big Croatian played with sublime control, landing a pinpoint serve to claim three set points. \nEdmund saved one but Cilic was soon roaring in celebration, a backhand winner down the line closing it out. \nIt looked bad for the Briton, who began hobbling when in pursuit of Cilic’s raids on his backhand. \nTossed around like a rag doll across the court, Edmund was broken at 1-1 when he netted a weak retrieve. \nIt prompted only a quiet fist pump from Cilic, who knuckled down to break him again at 4-2. Related Coverage Edmund baffled by media spotlight after Melbourne exploits \nAn 11th ace and a volley put him a point from the finish before he wound up his serve one last time to end Edmund’s misery. \nIt looked like a groin injury that did for the Briton, but he refused to play the sympathy card. \n“Yeah, there’s something, but whatever,” said the man who upset third seed Grigor Dimitrov in the quarter-finals. \n”I‘m definitely disappointed about it, but it’s one of those things where I have to look at the whole week. \n“It’s been so good ... One of the biggest tournaments of the world, and making a good run and beating top players.” Editing by Toby Davis and Alison Williams", "external_links": [], "published": "2018-01-25T13:45:00.000+02:00", "crawled": "2018-01-25T14:11:12.007+02:00", "highlightTitle": ""}