{"organizations": [], "uuid": "8540fa51a3dd6a6256ec9d72a9a5225cbad05e2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/18/the-associated-press-developer-proceeding-with-long-delayed-keystone-xl-pipeline.html", "country": "US", "domain_rank": 767, "title": "Developer proceeding with long-delayed Keystone XL pipeline", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T17:04:00.000+02:00", "replies_count": 0, "uuid": "8540fa51a3dd6a6256ec9d72a9a5225cbad05e2a"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/18/the-associated-press-developer-proceeding-with-long-delayed-keystone-xl-pipeline.html", "ord_in_thread": 0, "title": "Developer proceeding with long-delayed Keystone XL pipeline", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LINCOLN, Neb. (AP) — The developer of the Keystone XL pipeline announced Thursday that it hopes to begin construction next year on an alternative route approved by Nebraska authorities, despite a lawsuit challenging the project.\nTransCanada Corp. said in a news release that it plans to move ahead after securing enough 20-year commitments from oil companies to ship approximately 500,000 barrels per day through the pipeline. Opponents note that the commitments are well below the pipeline's 830,000-barrel capacity.\nThe company previously said it needed time to evaluate the commission's decision and line up potential customers.\n\"Over the past 12 months, the Keystone XL project has achieved several milestones that move us significantly closer to constructing this critical energy infrastructure for North America,\" Russ Girling, TransCanada's president and chief executive officer, said in a statement.\nTransCanada spokeswoman Robynn Tysver said the company hasn't yet made a final investment decision on the project, but has secured enough long-term commitments to make it feasible. Tysver said the interest from shippers demonstrates the project is needed.\n\"This is a big benchmark day for this project,\" she said.\nThe Nebraska Public Service Commission in November approved a route that would extend the pipeline by 5 miles (8 kilometers) more than TransCanada had initially proposed, and requires the company to build an extra pumping station in the state. The company, based in Calgary, Canada, said Thursday that it would accede to the commission's demands in order to move the project along.\nThe project has faced intense opposition from environmental groups, property owners along the route and Native American tribes, who consider it a threat to their groundwater and property rights.\nCommissioners who voted for it said the alternative route would affect less rangeland and endangered species. The commission was not allowed to take into account the recent leak of the existing Keystone pipeline in South Dakota because pipeline safety is a federal responsibility.\nOpponents have filed a lawsuit challenging the commission's decision, and the Nebraska Supreme Court is expected to hear oral arguments later this year.\nIf opponents succeed, TransCanada would have to file for a new permit with the Nebraska Public Service Commission, triggering another review that could take up to a year.\n\"Nebraska courts — not TransCanada — will decide when, if ever, this pipeline will cut through our state,\" said Brian Jorde, an attorney for affected landowners who oppose the pipeline.\nJorde said the company's announcement \"changes nothing, from our perspective.\"\nPipeline foes said the company's commercial support of 500,000 barrels per day from shippers was \"shockingly weak\" given that the pipeline has the capacity for 830,000 barrels per day. They noted that 50,000 of those barrels per day will come from the Alberta Petroleum Marketing Commission, which is owned by the Alberta government.\n\"The Keystone XL pipeline will never be built,\" said Jane Kleeb, founder of the anti-pipeline group Bold Nebraska.\nThe Nebraska commission's vote to approve a route through the state removed one of the last regulatory obstacles for the project. TransCanada has said it still needs to gets permits to cross land held by the U.S. Bureau of Land Management in Montana, although that likely won't be as large a hurdle as what the company faced in Nebraska.\nIf completed, the pipeline would carry oil from Canada through Montana, South Dakota and Nebraska, where it would connect to an existing pump station in Steele City, Nebraska. From there it would continue through Kansas, Oklahoma and Texas until it reaches Gulf Coast refineries. Business groups and some unions support the project as a way to create jobs and reduce the risk of shipping oil by trains that can derail.\nPresident Barack Obama's administration studied the project for years before finally rejecting it in 2015 because of concerns about carbon pollution. President Donald Trump reversed that decision in March. Federal approval was required because the route crosses an international border.\nFollow Grant Schulte on Twitter at https://twitter.com/GrantSchulte", "external_links": [], "published": "2018-01-18T17:04:00.000+02:00", "crawled": "2018-01-19T03:20:03.065+02:00", "highlightTitle": ""}