{"organizations": [], "uuid": "984b1dc76350f8e6a04848e926c7436e195abd92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-inland-real-estate-acquisitions-llc-closes-the-purchase-of-a-townhome-style-multifamily-property-in-connecticut.html", "country": "US", "domain_rank": 767, "title": "Inland Real Estate Acquisitions, LLC Closes the Purchase of a Townhome-Style Multifamily Property in Connecticut", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.962, "site_type": "news", "published": "2018-01-08T23:15:00.000+02:00", "replies_count": 0, "uuid": "984b1dc76350f8e6a04848e926c7436e195abd92"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-inland-real-estate-acquisitions-llc-closes-the-purchase-of-a-townhome-style-multifamily-property-in-connecticut.html", "ord_in_thread": 0, "title": "Inland Real Estate Acquisitions, LLC Closes the Purchase of a Townhome-Style Multifamily Property in Connecticut", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OAK BROOK, Ill.--(BUSINESS WIRE)-- Inland Real Estate Acquisitions, LLC announced today that it negotiated and closed the purchase of Avalon Huntington, a 99-unit townhome-style multifamily property located in Shelton, Connecticut, a suburb approximately 12 miles west of New Haven. Joe Cosenza, vice chairman of The Inland Real Estate Group, LLC and president of Inland Real Estate Acquisitions, LLC, completed the deal, with assistance from Gina LaMantia, managing counsel for Charles J. Benvenuto, P.C., on behalf of an Inland affiliate.\nConstructed in 2008, the property is ideally located at 100 Avalon Drive near Route 8 and offers convenient access to Huntington Road and I-95. The property, which will be renamed Huntington Townhomes, consists of seven three- and four-story buildings with 99 total units, featuring 86 townhome-style homes and 13 garden apartments, with 194 total parking spaces. There are nine three-bedroom and four two-bedroom garden apartments, 64 two-bedroom townhomes and 22 three-bedroom townhomes.\nEach unit includes gourmet kitchens, walk-in closets, energy-efficient windows, individual alarm systems with monitoring available and full size washers and dryers, while select units feature vaulted ceilings, a patio or balcony, gas fireplaces and separate dining rooms. Huntington Townhomes also features a variety of community amenities including a heated outdoor pool, a picnic area, a clubhouse, a state-of-the-art fitness center and is a dog friendly community.\nAdditionally, Huntington Townhomes is located adjacent to a park with a walking path and provides residents nearby access to the Housatonic River and local beaches. The property is also positioned near a major retail area that includes a Stop ‘n Shop, a ShopRite and Wal-Mart, and is a 15-minute drive to Westfield Trumbull Mall and 20 minutes to Post Mall.\n“Ranked as the most successful city in Connecticut, Shelton serves as a residential community for many employees of nearby Sikorsky Aircraft Corporation, Yale University, Sheaffer Pen Corporation and Pitney Bowes,” said Cosenza. “Huntington Townhomes provides the more than 168,000 residents within a five-mile radius with access to top-rated schools and public transportation that offers an easy commute to nearby Stamford and Norwalk. Due to its premier location at the epicenter of major employers, its townhome-style units, direct access garages and high quality community amenities, this property is an excellent example of the types of multifamily acquisitions we continue to seek out.”\nAs of December 14, 2017, the property was 96 percent occupied.\nTo date, Inland Real Estate Acquisitions, LLC has facilitated more than $45 billion of purchases including single-tenant properties, medical office buildings, retail properties and a total of more than $5 billion in apartments.\nAbout Inland Real Estate Acquisitions, LLC\nInland Real Estate Acquisitions, LLC assists in identifying potential acquisition opportunities, negotiates acquisition-related contracts and acquires real estate assets for the various entities that are a part of The Inland Real Estate Group of Companies, Inc., a group of independent legal entities, some of which may be affiliates, share some common ownership or have been sponsored or managed by Inland Real Estate Investment Corporation or its subsidiaries (collectively, “Inland”). For additional information, please refer to Inland’s website at www.inlandgroup.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108006751/en/\nAlyssa Campbell, Inland Marketing & Communications, Inc.\n(630) 218-2887\nalyssa.campbell@inlandgroup.com\nSource: Inland Real Estate Acquisitions, LLC", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.inlandgroup.com&esheet=51739866&newsitemid=20180108006751&lan=en-US&anchor=www.inlandgroup.com&index=1&md5=8892f21fe77660deac9d8ced5408a027", "http://www.businesswire.com/news/home/20180108006751/en/"], "published": "2018-01-08T23:15:00.000+02:00", "crawled": "2018-01-09T09:40:05.550+02:00", "highlightTitle": ""}