{"organizations": [], "uuid": "33dbf39a6a2e09e34ca5a47dd5145a54198eb466", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-hirtle-callaghan-appoints-jim-morris-as-senior-client-engagement-director.html", "country": "US", "domain_rank": 767, "title": "Hirtle Callaghan Appoints Jim Morris as Senior Client Engagement Director", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T18:05:00.000+02:00", "replies_count": 0, "uuid": "33dbf39a6a2e09e34ca5a47dd5145a54198eb466"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-hirtle-callaghan-appoints-jim-morris-as-senior-client-engagement-director.html", "ord_in_thread": 0, "title": "Hirtle Callaghan Appoints Jim Morris as Senior Client Engagement Director", "locations": [], "entities": {"persons": [{"name": "hirtle callaghan", "sentiment": "negative"}, {"name": "hirtle callaghan appoints jim morris", "sentiment": "negative"}, {"name": "ranji nagaswami", "sentiment": "none"}, {"name": "jim morris", "sentiment": "none"}, {"name": "erica evans", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}, {"name": "jim", "sentiment": "none"}], "locations": [{"name": "conshohocken", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}], "organizations": [{"name": "ocio", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WEST CONSHOHOCKEN, Pa., Jan. 2, 2018 /PRNewswire/ -- Hirtle Callaghan, pioneers of the Outsourced Chief Investment Officer (OCIO) model, announced today the addition of Jim Morris, an accomplished institutional asset management and financial services industry executive, as Senior Client Engagement Director. In this role, Mr. Morris will work closely with the Head of Client Engagement, Erica Evans, and the firm's leadership to implement Hirtle Callaghan's Western Region strategy, ensuring best-in-class service for clients while developing strong, new relationships.\n\"Jim is a wonderful addition to our growing client engagement team, and we are confident that he will make significant and immediate contributions to our clients in the western region,\" said Ranji Nagaswami, Chief Executive Officer at Hirtle Callaghan. \"He has been a leader in the institutional asset management space for more than three decades, and we are excited that he has joined our team, partnering with us to ensure that our clients continue receiving the highest quality service.\"\nPrior to joining Hirtle Callaghan, Mr. Morris spent over thirty years at SEI Investments, serving as Senior Vice President in both the SEI Institutional Asset Management Group and SEI Private Bank Unit. In the Institutional Asset Management Group, he led the development and marketing of the firm's advice-based fiduciary management solution for endowments, foundations, health-care investment pools, and pension funds. He was one of the principal architects of SEI's manager-of-manager program and managed the Sales team, the Relationship Management team, and the Global Solutions team. In the Private Bank Unit, Mr. Morris led the firm's Canada Advisor Unit, and he later headed the development of Strategic Partners for the firm's Global Wealth Platform.\n\"After many years in the asset management and financial services industry, I'm thrilled to be joining a firm that is truly conflict-free and puts its client's needs above all else,\" said Mr. Morris. \"I look forward to working closely with the team to deliver on the firm's client-centric model and help enhance outcomes for each and every investor with whom we work.\"\nMr. Morris began his career at Arthur Andersen & Co., where he earned his CPA designation. He is an active member of the Board of Trustees of LaSalle University, where he chairs the Strategic Planning and Assessment Committee, and previously led the Finance Committee. He is also the Board Chair at Our Lady of Mercy Regional Catholic School and a member of the Investment Committee for Lower Gwynedd Township in Pennsylvania.\nMr. Morris's hiring follows the appointment of Erica Evans as Head of Client Engagement in July 2017.\nAbout Hirtle Callaghan\nHirtle Callaghan is a 21st century investment institution known for its professional, client-centric, performance-driven culture and its conflict-free business model. As an organization of Chief Investment Officers, Hirtle Callaghan sells no products. Rather, the firm uses collective purchasing power and aggregate expertise to design and manage complete, custom-designed investment programs for family and institutional investors. These programs are executed through best-in-class independent money managers and specialized index funds. Multi-manager hedge fund, private equity and special opportunity pools are included, when appropriate, but without a fund-of-funds fee.\nNow in its 30th year, Hirtle Callaghan, America's First Outsourced Chief Investment Officer®, supervises over $20 billion of family, endowment, foundation, healthcare, and pension assets in 46 states.\n please visit www.hirtlecallaghan.com .\nProspective clients are invited to contact Erica Evans at eevans@hirtlecallaghan.com .\nMedia contact:\nDukas Linden Public Relations\nShree Dhond\n646-722-6531\nshree@dlpr.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/hirtle-callaghan-appoints-jim-morris-as-senior-client-engagement-director-300576139.html\nSOURCE Hirtle Callaghan", "external_links": ["http://www.prnewswire.com/news-releases/hirtle-callaghan-appoints-jim-morris-as-senior-client-engagement-director-300576139.html", "http://www.hirtlecallaghan.com/"], "published": "2018-01-02T18:05:00.000+02:00", "crawled": "2018-01-02T19:20:48.027+02:00", "highlightTitle": ""}