{"organizations": [], "uuid": "fa42620bb2d25a68a175264a03b92f9f4c9b58c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-genesys-selects-dr-peter-graf-as-new-chief-product-officer.html", "country": "US", "domain_rank": 767, "title": "Genesys Selects Dr. Peter Graf as New Chief Product Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-11T15:00:00.000+02:00", "replies_count": 0, "uuid": "fa42620bb2d25a68a175264a03b92f9f4c9b58c0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-genesys-selects-dr-peter-graf-as-new-chief-product-officer.html", "ord_in_thread": 0, "title": "Genesys Selects Dr. Peter Graf as New Chief Product Officer", "locations": [], "entities": {"persons": [{"name": "peter graf", "sentiment": "negative"}, {"name": "graf", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO, Jan. 11, 2018 /PRNewswire/ -- Genesys® ( www.genesys.com ) today announced the appointment of Dr. Peter Graf as chief product officer (CPO), a new position for the company. As CPO, Graf will drive the global product vision and innovation strategy for Genesys, a global leader in omnichannel customer experience and contact center solutions . He will oversee product management, engineering and product delivery across the company's industry-leading customer experience platform including Genesys PureCloud®, PureConnect ™ and PureEngage™.\nGraf brings more than 25 years of global enterprise software experience to Genesys, with a wide variety of executive leadership positions in operations, development, sales, marketing and services. His extensive background includes launching new businesses as well as transforming and scaling large, well-established global enterprises. Graf also offers deep expertise on emerging technologies such as artificial intelligence . He is adept at anticipating industry shifts and responding with innovative product offerings to proactively address customer pain points.\n\"We are excited to have Peter join our team. His proven record of effectively scaling technology companies makes him the ideal product leader as Genesys embarks on our next phase of growth,\" said Paul Segre, chief executive officer, Genesys. \"Peter is a seasoned executive with a passion for setting and articulating a compelling vision; driving product innovation and inspiring teams.\"\nGraf will be a member of the Genesys executive leadership team , based in the San Francisco Bay area, reporting directly to Segre.\n\"The customer experience and contact center industries are in the midst of dynamic transformation, and I am thrilled to join Genesys to help the company and its customers,\" said Graf. \"This is an industry-leading organization, uniquely positioned to deliver the right mix of tools, applications and processes to enable brands to connect every moment of the customer journey .\"\nGraf joins Genesys from Sungevity, a market-leading solar electricity company. As CPO, Graf spearheaded Sungevity's transition from a solutions company to a global platform provider for the solar industry. Prior to his tenure there, Graf held multiple roles with multinational software corporation SAP, most recently serving as the executive vice president and general manager of Sustainability Software. During his tenure, he successfully built the sustainability vision of the company and drove its execution across SAP's worldwide organization.\nGraf received a doctorate in computer science from Universität des Saarlandes and a master's degree in computer science and economics from Technische Universität Kaiserslautern in Germany.\nAbout Genesys\nGenesys® powers more than 25 billion of the world's best customer experiences each year. Our success comes from connecting employee and customer conversations on any channel, every day. Over 10,000 companies in more than 100 countries trust our #1 customer experience platform to drive great business outcomes and create lasting relationships. Combining the best of technology and human ingenuity, we build solutions that mirror natural communication and work the way you think. Our industry-leading solutions foster true omnichannel engagement because they perform equally well across channels, on-premises and in the cloud. Experience communication as it should be: fluid, instinctive and profoundly empowering. Visit genesys.com on Twitter , Facebook , YouTube , LinkedIn and the Genesys blog .\n©2018 Genesys Telecommunications Laboratories, Inc. All rights reserved. Genesys is a registered trademark of Genesys. The Genesys logo, Genesys PureCloud, PureConnect, and PureEngage are trademarks of Genesys. All other company names and logos may be registered trademarks or trademarks of their respective companies.\nContacts:\nShaunna Morgan\nGenesys\nshaunna.morgan@genesys.com\n+1 317-493-4241\nLisa Hawes\nSterling Communications\ngenesys@sterlingpr.com\n+1 408-395-5500\nView original content with multimedia: http://www.prnewswire.com/news-releases/genesys-selects-dr-peter-graf-as-new-chief-product-officer-300581179.html\nSOURCE Genesys", "external_links": ["https://twitter.com/Genesys", "http://blog.genesys.com/", "https://www.genesys.com/purecloud", "https://www.linkedin.com/company/genesys", "https://www.youtube.com/Genesys", "http://www.genesys.com/solutions/customer-engagement", "https://www.facebook.com/Genesys/", "http://www.genesys.com/solutions/contact-center-modernization", "http://www.genesys.com/", "http://www.prnewswire.com/news-releases/genesys-selects-dr-peter-graf-as-new-chief-product-officer-300581179.html", "http://www.genesys.com/platform/cloud/pureengage", "http://www.genesys.com/about/leadership", "http://www.genesys.com/platform/cloud/pureconnect", "http://www.genesys.com/omnichannel/meet-kate"], "published": "2018-01-11T15:00:00.000+02:00", "crawled": "2018-01-11T15:00:11.053+02:00", "highlightTitle": ""}