{"organizations": [], "uuid": "4ee54abb3fc53a4994a7b4ab208ce6c2f75c2d04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/03/reuters-america-update-6-oil-at-highest-in-2-12-years-on-iran-tensions-strong-demand.html", "country": "US", "domain_rank": 767, "title": "UPDATE 6-Oil at highest in 2-1/2 years on Iran tensions, strong demand", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T00:10:00.000+02:00", "replies_count": 0, "uuid": "4ee54abb3fc53a4994a7b4ab208ce6c2f75c2d04"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/03/reuters-america-update-6-oil-at-highest-in-2-12-years-on-iran-tensions-strong-demand.html", "ord_in_thread": 0, "title": "UPDATE 6-Oil at highest in 2-1/2 years on Iran tensions, strong demand", "locations": [], "entities": {"persons": [], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "none"}, {"name": "api", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "american petroleum institute", "sentiment": "none"}, {"name": "u.s. energy department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Iran unrest expected to keep prices firm\n* API: crude stocks down 5 mln bbls; distillates up 4.3 mln bbls\n* U.S. expected to see its output pass 10 mln bpd (New throughout, updates prices and market activity to settlement, adds details of heating oil prices, API data)\nLONDON/NEW YORK, Jan 3 (Reuters) - Oil prices rose about 2 percent on Wednesday to the highest in 2-1/2 years, with buying spurred by a sixth day of unrest in OPEC member Iran and strong economic data from the United States and Germany.\nU.S. West Texas Intermediate (WTI) crude futures settled at $61.63 a barrel, up $1.26, or 2.1 percent.\nInternational benchmark Brent crude futures settled up $1.27 a barrel, or 1.9 percent, to $67.84 a barrel.\nDuring the session, WTI hit the highest since June 2015 while Brent touched its peak since May 2015.\nAfter settlement, energy industry group the American Petroleum Institute said U.S. oil inventories fell by 5 million barrels in the week to Dec. 29. The U.S. Energy Department was scheduled to report official figures on oil inventories on Thursday.\nThe API said distillate stocks rose by 4.3 million barrels, more than expected. After the data, U.S. heating oil futures pared gains sharply. Heating oil had settled higher on the back of the cold weather hitting a large swathe of the United States.\nHeating oil futures settled at $2.0880 a gallon, up 1.4 percent. Cold weather on the East Coast has drawn a number of tankers carrying diesel and heating oil from Europe, reversing a traditional trade route.\nIran's elite Revolutionary Guards have deployed forces to three provinces to put down anti-government unrest, their commander said on Wednesday. Six days of protests have left 21 people dead.\n\"While the Iran tensions are certainly a factor, the slew of remarkably strong economic data today is also forcing the rally,\" said John Kilduff, partner at Again Capital LLC in New York.\nGermany's unemployment rate hit a record low in December, underpinning a broad-based economic upswing. U.S. factory activity increased more than expected in December, a further sign of strong economic momentum.\nManufacturing and construction reports also fuelled expectations for a robust U.S. economy in 2018.\nOle Hansen, head of commodity strategy at Denmark's Saxo Bank, warned that \"multiple but temporary supply disruptions\" like the North Sea Forties and Libyan pipeline outages (and) protests across Iran ... helped create a record speculative long bet.\"\nWith pipeline outages resolved and protests in Iran showing no signs of affecting its oil production yet, Hansen said prices could fall in early 2018, especially with rising U.S. output.\n\"It is only a matter of time before the 10 million barrel per day (bpd) (U.S.) production target will be reached,\" Hansen said.\nSupplies were healthy. U.S. oil production <C-OUT-T-EIA> has risen by almost 16 percent since the middle of 2016, hitting 9.75 million bpd at the end of last year.\n(Additional reporting by Henning Gloystein and Oleg Vukmanovic; Editing by David Gregorio and Lisa Shumaker)", "external_links": [], "published": "2018-01-04T00:10:00.000+02:00", "crawled": "2018-01-04T01:37:12.003+02:00", "highlightTitle": ""}