{"organizations": [], "uuid": "b8a8b7043e8f6d63e48785b49dbd3a0620eeae00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/03/104925624-GettyImages-519455988.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/10000113/device/rss/rss.html", "section_title": "Politics", "url": "https://www.cnbc.com/2018/01/07/michael-wolffs-fire-and-fury-some-of-the-facts-just-dont-stack-up.html", "country": "US", "domain_rank": 767, "title": "Michael Wolff's 'Fire and Fury': Some of the facts just don't stack up", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.013, "site_type": "news", "published": "2018-01-08T00:19:00.000+02:00", "replies_count": 0, "uuid": "b8a8b7043e8f6d63e48785b49dbd3a0620eeae00"}, "author": "Marty Steinberg", "url": "https://www.cnbc.com/2018/01/07/michael-wolffs-fire-and-fury-some-of-the-facts-just-dont-stack-up.html", "ord_in_thread": 0, "title": "Michael Wolff's 'Fire and Fury': Some of the facts just don't stack up", "locations": [], "entities": {"persons": [{"name": "michael wolff", "sentiment": "negative"}, {"name": "christopher steele", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "haberman", "sentiment": "none"}, {"name": "murdoch", "sentiment": "none"}, {"name": "wolff", "sentiment": "none"}, {"name": "maggie haberman", "sentiment": "none"}, {"name": "rupert murdoch", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "white house", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "cnn", "sentiment": "none"}, {"name": "new york times white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Retail Report Michael Wolff's 'Fire and Fury': Some of the facts just don't stack up President Donald Trump isn't the only one who thinks Michael Wolff doesn't get all the facts right in his bombshell book \"Fire and Fury.\" New York Times White House correspondent Maggie Haberman, and a few others, also point out some discrepancies in the book. Wolff defends the book's accuracy, telling NBC: \"I am certainly and absolutely in every way comfortable with everything I've reported in this book.\" Kena Betancur | AFP | Getty Images President Donald Trump. \n\"Michael Wolff is a total loser who made up stories in order to sell this really boring and untruthful book,\" President Donald Trump says about the author of \"Fire and Fury.\" \nHe's not the only one to challenge assertions in the tell-all book, which has shaken the White House with accounts and quotes from current and former Trump administration officials. \nNew York Times White House correspondent Maggie Haberman, and several other journalists and Washington insiders, do as well. \n\"I believe parts of it, and then there are other parts that are factually wrong,\" Haberman said Friday on CNN. \"He believes in larger truths and narratives. So he creates a narrative that is notionally true, that's conceptually true. The details are often wrong .\" \nIn one example, she pointed out that the book says Rupert Murdoch called Trump \"a f g idiot,\" but in a column, Wolff quoted Murdoch as saying Trump was \"a f g moron.\" \nShe also noted that Wolff said CNN had published an unsubstantiated dossier compiled by former British spy Christopher Steele about Trump's alleged dealings with Russians. The dossier, however, was actually published by Buzzfeed.com. \n\"That's ... one fact check away from getting it right,\" she said. \nOn Twitter, Trump claimed he \"authorized Zero access to White House\" for Wolff and \"never spoke to him for book.\" I authorized Zero access to White House (actually turned him down many times) for author of phony book! I never spoke to him for book. Full of lies, misrepresentations and sources that don't exist. Look at this guy's past and watch what happens to him and Sloppy Steve! \nIn an interview on NBC's \"TODAY\" on Friday, Wolff insisted that he had spoken with Trump for the book. \n\"Whether he realized it was an interview or not, I don't know, but it certainly was not off the record,\" he said. \"My window into Donald Trump is pretty significant.\" \nWolff also defended the book's accuracy. Courtenay Brown | CNBC Michael Wolff \n\"I work like every journalist works so I have recordings, I have notes,\" he told the \"TODAY\" show. \"I am certainly and absolutely in every way comfortable with everything I've reported in this book.\" \nOthers, including CNN's Brian Stelter, noted a string of flattering stories Wolff had written in The Hollywood Reporter about Trump in June 2016, five months before the election; and about top aides Steve Bannon two weeks after the election and Kellyanne Conway just after the inauguration. \n\"Wolff seems to have been warming up his sources for the book,\" Stelter said on CNN's \"Reliable Sources.\" Stelter tweet \nWolff conceded as much in the \"TODAY\" show interview. \n\"I certainly said what was ever necessary to get the story,\" he replied when asked if he had flattered his way into the White House. \nBut he also fired back at Trump. \n\"My credibility is being questioned by a man who has less credibility than perhaps anyone who has ever walked on Earth at this point,\" Wolff said. \nThe book set off a journalistic feeding frenzy when word of its contents surfaced Wednesday in The Guardian. \nThe book quotes aides by name describing Trump's behavior as childlike and unbalanced. In one example, Bannon said the June 2016 meeting at Trump Tower between the president's eldest son and a Russian lawyer was \"treasonous\" and \"unpatriotic.\" \nTrump then lashed out at his former top aide, saying Bannon had \"lost his mind.\" \nBannon apologized on Sunday , saying Donald Jr. \"is both a patriot and a good man.\" \nWolff, 64, who has a reputation for arrogance, is a columnist for The Hollywood Reporter and has written for numerous publications. \"Fire and Fury: Inside the Trump White House\" is his seventh book. \nIn reviewing Wolff's 2008 book \"The Man Who Owns the News: Inside the Secret World of Rupert Murdoch,\" the late New York Times media columnist David Carr wrote: \n\"Historically, one of the problems with Wolff's omniscience is that while he may know all, he gets some of it wrong.\" ", "external_links": ["http://www.cnn.com/TRANSCRIPTS/1801/05/nday.02.html", "http://www.nytimes.com/2008/12/28/books/review/Carr-t.html", "https://www.nbcnews.com/politics/donald-trump/michael-wolff-says-donald-trump-least-credible-person-who-has-n834921", "https://twitter.com/ReliableSources/status/950049683648413696", "https://twitter.com/realDonaldTrump/status/949126530839572481"], "published": "2018-01-08T00:19:00.000+02:00", "crawled": "2018-01-07T23:30:25.015+02:00", "highlightTitle": ""}