{"organizations": [], "uuid": "e3ccc18eeaaf259e77cb78d051b87d1b3f7b4c25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180101&t=2&i=1218492890&w=1200&r=LYNXMPEE000LD", "site_section": "http://feeds.reuters.com/reuters/UKEntertainment", "section_title": "Reuters: Entertainment News", "url": "https://uk.reuters.com/article/uk-usa-boxoffice/box-office-star-wars-the-last-jedi-tops-1-billion-worldwide-idUKKBN1EQ0NH", "country": "US", "domain_rank": 408, "title": "Box office - 'Star Wars: The Last Jedi' tops $1 billion worldwide", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T19:36:00.000+02:00", "replies_count": 0, "uuid": "e3ccc18eeaaf259e77cb78d051b87d1b3f7b4c25"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-boxoffice/box-office-star-wars-the-last-jedi-tops-1-billion-worldwide-idUKKBN1EQ0NH", "ord_in_thread": 0, "title": "Box office - 'Star Wars: The Last Jedi' tops $1 billion worldwide", "locations": [], "entities": {"persons": [{"name": "disney-lucasfilm", "sentiment": "none"}, {"name": "mark hamill", "sentiment": "none"}, {"name": "dave mcnary", "sentiment": "none"}, {"name": "daisy ridley", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "royal albert hall", "sentiment": "none"}, {"name": "variety.com", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "universal-illumination", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 1, 2018 / 12:52 AM / Updated 27 minutes ago U.S. box office - 'Star Wars: The Last Jedi' holds off 'Jumanji' on new year's weekend Brent Lang 6 Min Read \nLOS ANGELES (Variety.com) - In a battle of box office heavyweights, Luke Skywalker just managed to hold off Dwayne “The Rock” Johnson as the world rang in another year. FILE PHOTO: Actors Daisy Ridley and Mark Hamill pose for photographers as they arrive for the European Premiere of 'Star Wars: The Last Jedi', at the Royal Albert Hall in central London, Britain December 12, 2017. REUTERS/Hannah McKay/File Photo \nDisney and LucasFilm’s ”“Star Wars: The Last Jedi” retained first place for the four-day New Year’s holiday weekend despite steep competition from Sony’s “Jumanji: Welcome to the Jungle.”“Last Jedi” picked up an estimated $68.4 million (£50.6 million), bringing its domestic haul to $533.1 million. \nDon’t weep for “Jumanji,” however. The fantasy reboot, which finds Johnson, Jack Black, and Kevin Hart transported into a video game world, has outperformed expectations, picking up a lordly $66.5 million over the holiday weekend. It now has a hefty $185.7 million domestic gross and should continue to draw crowds in 2018. The “Jumanji” sequel has also done well internationally, racking up $350 million worldwide, and has provided a much-needed hit for a studio that has struggled to keep pace with the Disney’s and Warner Bros.’s of the world. Sony claims the film has a $90 million budget. Those alleged production costs have raised eyebrows around town as to their veracity given the film’s Hawaii location and starry cast, but regardless of creative accounting and aggressive spinning, the result is impressive. A sequel seems preordained. \n“Star Wars: The Last Jedi” closed 2017 as the year’s highest-grossing release and the seventh highest-grossing domestic movie of all time with $517.1 million. It will bypass its fellow franchisee “Rogue One” at some point on New Year’s Day to take the seventh spot on the stateside charts and has already blown past the $1 billion mark globally. The film carries a $200 million price tag, and has generated controversy for a series of creative decisions by director and writer Rian Johnson that have, depending on your perspective, either infused new energy into decades-old series or deviated dangerously from the Jedi canon. \nIt’s been a dismal year for the domestic box office, which ends 2017 with $11.12 billion in sales, down 2.3% from last year’s $11.38 billion and off slightly from 2015’s $11.14 billion, according to comScore. After a bruising summer, when revenues plummeted more than 6% in the wake of costly flops such as “The Mummy” and “Transformer: The Last Knight,” the gap did narrow. Fall and winter hits such as “It,”“Thor: Ragnarok,”“Coco,” and “Murder on the Orient Express,” helped make up the difference. The industry was also aided by record ticket prices. Empirically, fewer people made it to the multiplexes. Attendance is expected to hit a 27-year low when official numbers are tallied. \nUniversal’s “Pitch Perfect 3” took third place on the stateside charts, grossing $22.7 million for the four-day period and pushing its domestic total to just under $70 million. The a Cappella comedy carries a $45 million production budget and has been billed as the final instalment in the franchise. \nHugh Jackman’s musical drama “The Greatest Showman” is finishing a close fourth with $20.7 million. The Fox-Chernin Entertainment production chronicles the rise of circus impresario P.T. Barnum. It got a boost from the holidays, and showed the biggest gain in the top 10 movies from the Christmas Eve weekend with an impressive 73% surge. The domestic total should hit $54.3 million through Monday. It’s a pricey movie, though. All that singing and dancing didn’t come cheap and “The Greatest Showman” cost $84 million to make. \nFox’s second weekend of “Ferdinand” rounded out the top five with $14.6 million, giving the animated comedy $56.8 million domestically. \nNot every film was feeling the holiday spirit. Paramount’s “Downsizing” is a costly bomb. The comedy about a man (Matt Damon) who shrinks to the size of thimble in order to live in a materialistic utopia collapsed at the box office, eking out $6.1 million over the long weekend. Its total stands at $18.5 million -- a paltry result given its $65 million budget. It also prolongs a box office losing streak for Damon. The actor also struck out with “Suburbicon” and “The Great Wall,” both of which opened during and flopped in 2017. \nWarner Bros. and Alcon’s comedy “Father Figures” was another casualty of the Christmas crunch. The story of two twin brothers (Ed Helms and Owen Wilson) on a quest to find their biological father netted $5.1 million over the four-day weekend. Its total tops out at $14.1 million, making it unlikely that it will recoup its $25 million production budget as well its marketing costs. \nAnd Sony’s “All the Money in the World” struggled to appeal to older audiences. The drama about the kidnapping of John Paul Getty III attracted lots of attention for the filmmakers’ last minute decision to re-cast a key role played by disgraced actor Kevin Spacey. The breakneck reshoots took place in a matter of weeks, with Christopher Plummer assuming the Spacey part as parsimonious billionaire J. Paul Getty, and added $10 million to the film’s $40 million budget. Alas, audiences failed to show up. The movie grossed $7.5 million over the holiday weekend, bringing its domestic total to $14.7 million. \nForeign audiences picked up the slack as domestic attendance sputtered in 2017. The global box office is projected to hit $40 billion for the first time in history, propelled by the return of China. Total ticket sales in the Middle Kingdom grew by 22.3%, ending the year with $8.6 billion in revenues. That, at least, gives a beleaguered movie business some cause for celebration. The story was refiled to add the dateline", "external_links": [], "published": "2018-01-01T19:36:00.000+02:00", "crawled": "2018-01-01T20:19:53.000+02:00", "highlightTitle": ""}