{"organizations": [], "uuid": "fc00fcd6d8406fd75613c37073617d914f80fac4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKhealth/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-medicare-nursing-homes/medicare-advantage-can-disadvantage-seniors-needing-skilled-nursing-idUKKBN1FF2N3", "country": "US", "domain_rank": 408, "title": "Medicare Advantage can disadvantage seniors needing skilled nursing", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T21:50:00.000+02:00", "replies_count": 0, "uuid": "fc00fcd6d8406fd75613c37073617d914f80fac4"}, "author": "", "url": "https://uk.reuters.com/article/us-health-medicare-nursing-homes/medicare-advantage-can-disadvantage-seniors-needing-skilled-nursing-idUKKBN1FF2N3", "ord_in_thread": 0, "title": "Medicare Advantage can disadvantage seniors needing skilled nursing", "locations": [], "entities": {"persons": [{"name": "ronnie cohen", "sentiment": "none"}, {"name": "david j. meyers", "sentiment": "none"}], "locations": [{"name": "rhode island", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "providence", "sentiment": "none"}], "organizations": [{"name": "medicare advantage", "sentiment": "negative"}, {"name": "reuters health", "sentiment": "none"}, {"name": "brown university", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "medicare", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 7:53 PM / Updated an hour ago Medicare Advantage can disadvantage seniors needing skilled nursing Ronnie Cohen 5 Min Read \n(Reuters Health) - Medicare Advantage plans might prove to be a disadvantage for U.S. enrollees in need of skilled nursing care, a new study suggests. \nTraditional Medicare enrollees were more likely to enter higher-quality skilled nursing facilities than Medicare Advantage enrollees, the study found. The differences were small but significant and persisted even after researchers adjusted for distance and other factors. \n“If you enroll in Medicare Advantage, then you might not have as good an option in a nursing home,” said lead author David J. Meyers, a doctoral student in health services research at Brown University in Providence, Rhode Island. \n“If it’s important to have access to the best nursing homes, fee-for-service Medicare might be the option for you,” he said in a phone interview. \nAmericans age 65 or older choose between traditional fee-for-service Medicare, a public health insurance program, and Medicare Advantage programs – commercial insurance plans touted as offering comprehensive disease management and care coordination to help seniors manage health conditions. \nDuring the past decade, enrollment in Medicare Advantage has steadily increased to 31 percent in 2016, the authors write in Health Affairs. \nMeyers and his team analyzed all Medicare enrollees age 65 or older who were admitted to a skilled nursing home between 2012 and 2014 and had not been in one the previous year. \nAcross most ZIP codes, they found that traditional Medicare beneficiaries tended to go to facilities deemed higher quality in a five-star government rating system. The star ratings are based upon safety inspections, patient surveys and patient outcomes, such as whether they returned to the hospital, Meyers said. \n(Medicare nursing home ratings are available online at bit.ly/2GhedTA. ) \nThe findings were to be expected, said Yue Li, a health policy professor at the University of Rochester Medical Center in New York. But Li, who was not involved with the study, categorized the differences as “very tiny.” \nAlmost 55 percent of traditional Medicare patients went to skilled nursing facilities that the federal Centers for Medicare and Medicaid Services ranked four or five stars, compared to 50 percent of lower-quality Medicare Advantage enrollees and 52 percent of higher-quality Medicare Advantage enrollees, researchers found. \n“One might assume that if you pay more for a Medicare Advantage plan, you get better care, but that might not be true,” Meyers said. \nMeyers and Li both hypothesized that the study findings could be a result of Medicare Advantage offering fewer choices of skilled nursing facilities than traditional Medicare. \n“It seems like these fewer choices Medicare Advantage plans offer might not be as high quality,” Meyers said. \nMedicare Advantage plans generally tend to cost more, though they also may offer appealing benefits, like gym memberships, he said. Nonetheless, enrollees who need skilled nursing may be surprised to find themselves with limited options. \nThe study was unable to examine copays billed to Medicare Advantage patients who spent time in skilled nursing facilities. \n“Usually, when we decide to enroll in a plan, we consider physicians, hospitals,” Li said. “I wouldn’t expect the quality in skilled nursing facilities would affect the decision-making.” \nOnce Medicare Advantage patients experience health crises requiring expensive care like skilled nursing, Meyers said he suspects they might switch to traditional Medicare. Medicare beneficiaries can change plans annually during open-enrollment periods. \nIn spite of financial incentives for Medicare Advantage plans to prevent unnecessary hospital admissions, previous research shows mixed results when comparing the two programs’ readmission rates. \nA previous recent study found that Medicare Advantage plans appear to disadvantage African-Americans. Blacks covered under private Medicare Advantage plans were 64 percent more likely than whites to be readmitted to hospitals within a month of surgery, the study found. \nSOURCE: bit.ly/2G6hYuT Health Affairs, online January 8, 2018.", "external_links": [], "published": "2018-01-26T21:50:00.000+02:00", "crawled": "2018-01-26T22:21:46.041+02:00", "highlightTitle": ""}