{"organizations": [], "uuid": "4d42d38f60a1f1b24dcea41a620e8e4ee60449ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-stock-review-for-golds-investors--goldcorp-harmony-gold-mining-iamgold-and-kinross-gold.html", "country": "US", "domain_rank": 767, "title": "Stock Review for Gold's Investors -- Goldcorp, Harmony Gold Mining, IAMGOLD, and Kinross Gold", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.385, "site_type": "news", "published": "2018-01-23T14:00:00.000+02:00", "replies_count": 0, "uuid": "4d42d38f60a1f1b24dcea41a620e8e4ee60449ea"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-stock-review-for-golds-investors--goldcorp-harmony-gold-mining-iamgold-and-kinross-gold.html", "ord_in_thread": 0, "title": "Stock Review for Gold's Investors -- Goldcorp, Harmony Gold Mining, IAMGOLD, and Kinross Gold", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "iamgold", "sentiment": "neutral"}, {"name": "goldcorp", "sentiment": "neutral"}, {"name": "kinross gold", "sentiment": "neutral"}, {"name": "world gold council", "sentiment": "none"}, {"name": "wallstequities.com", "sentiment": "none"}, {"name": "kgc", "sentiment": "none"}, {"name": "iamgold corp.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "kinross gold corp.", "sentiment": "none"}, {"name": "goldcorp inc.", "sentiment": "none"}, {"name": "harmony gold mining co. ltd", "sentiment": "none"}, {"name": "iag", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK,\nWallStEquities.com strives to bring the best free research to the investment community. Today we are offering reports on GG, HMY, IAG, and KGC which can be accessed for free by signing up to www.wallstequities.com/registration . Business Day reported that a confluence of four key factors in the global market would underpin Gold price in 2018 after a 13.5% increase in the dollar price of the metal in 2017, the highest jump since 2010, according to the World Gold Council on Tuesday, January 16 th , 2018. These factors include higher global economic growth, interest rate hikes and restructuring of the US balance sheet, overheated equity markets, and increased access to gold through a variety of investment platforms. Pre-market, WallStEquities.com has issued research reports on Goldcorp Inc. (NYSE: GG), Harmony Gold Mining Co. Ltd (NYSE: HMY), IAMGOLD Corp. (NYSE: IAG), and Kinross Gold Corp. (NYSE: KGC). All you have to do is sign up today for this free limited time offer by clicking the link below. www.wallstequities.com/registration\nGoldcorp\nOn Monday, shares in Vancouver, Canada headquartered Goldcorp Inc. recorded a trading volume of 6.93 million shares. The stock ended the day at $14.45, rising slightly by 0.91% from the last trading session. The Company's shares have advanced 17.29% in the past month and 8.97% in the previous three months. The stock is trading above its 50-day and 200-day moving averages by 10.65% and 8.02%, respectively. Furthermore, shares of Goldcorp, which acquires, explores for, develops, and operates precious metal properties in Canada, the US, Mexico, and Central and South America, have a Relative Strength Index (RSI) of 63.52.\nOn January 10 th , 2018, Goldcorp announced that it will release its Q4 2017 and full-year results on February 14 th , 2018 after market close. The Company will host a conference call on February 15 th , 2018 at 10:00 a.m. PT. A live and archived webcast of the call will also be available on the Company's website.\nOn January 16 th , 2018, research firm Credit Suisse upgraded the Company's stock rating from 'Neutral' to 'Outperform'. Get the full research report on GG for free by clicking below at: www.wallstequities.com/registration/?symbol=GG\nHarmony Gold Mining\nRandfontein, South Africa-based Harmony Gold Mining Co. Ltd's stock saw a decline of 1.16%, finishing yesterday's session at $1.71. A total volume of 3.11 million shares was traded, which was above their three months average volume of 2.63 million shares. The Company's shares have gained 1.18% over the previous three months. The stock is trading below its 50-day moving average by 4.75%. Additionally, shares of the Company, which engages in the exploration and mining of gold in South Africa and Papua New Guinea, have an RSI of 41.91. Get access to our top-rated research, including the free report on HMY at: www.wallstequities.com/registration/?symbol=HMY\nIAMGOLD\nShares in Toronto, Canada headquartered IAMGOLD Corp. ended the session 0.16% higher at $6.17. The stock recorded a trading volume of 3.39 million shares. The Company's shares have gained 10.38% in the last month, 6.93% over the previous three months, and 38.65% over the past year. The stock is trading 8.08% above its 50-day moving average and 14.40% above its 200-day moving average. Moreover, shares of IAMGOLD have an RSI of 64.72.\nOn January 15 th , 2018, IAMGOLD announced that it will release its Q4 and full-year 2017 financial results on February 21 st , 2018, after market hours. A conference call will be held on February 22 nd , 2018, at 8:30 a.m. ET for a discussion with management regarding the Company's operating performance and financial results. A webcast of the conference call will be available on the Company's website. Click here to subscribe for a free membership which welcomes you with our report on IAG at: www.wallstequities.com/registration/?symbol=IAG\nKinross Gold\nAt the closing bell on Monday, Toronto, Canada headquartered Kinross Gold Corp.'s stock rose 2.86%, finishing at $4.32. A total volume of 8.21 million shares was traded. The Company's shares have gained 5.11% in the last month, 0.47% over the previous three months, and 20.33% over the past year. The stock is trading 2.60% and 3.93% above its 50-day and 200-day moving averages, respectively. Additionally, shares of Kinross Gold have an RSI of 52.19.\nOn January 10 th , 2018, Kinross Gold announced that it will release its Q4 and 2017 full-year financial statements and operating results on February 14 th , 2018, after market close. The Company will hold a conference call and audio webcast on February 15 th , 2018, at 8:00 a.m. ET to present the results, followed by a question-and-answer session. To get free access to your research report on KGC, sign up at: www.wallstequities.com/registration/?symbol=KGC\nWall St. Equities :\nWall St. Equities (WSE) produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. WSE has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below.\nWSE has not been compensated; directly or indirectly; for producing or publishing this document.\nPRESS RELEASE PROCEDURES :\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third-party research service company (the \"Reviewer\") represented by a credentialed financial analyst [for further information on analyst credentials, please email info@wallstequities.com . Rohit Tuli, a CFA® charterholder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on publicly available information which is believed to be reliable. Content is researched, written and reviewed on a reasonable-effort basis. The Reviewer has not performed any independent investigations or forensic audits to validate the information herein. The Reviewer has only independently reviewed the information provided by the Author according to the procedures outlined by WSE. WSE is not entitled to veto or interfere in the application of such procedures by the third-party research service company to the articles, documents or reports, as the case may be. Unless otherwise noted, any content outside of this document has no association with the Author or the Reviewer in any way.\nNO WARRANTY\nWSE, the Author, and the Reviewer are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted whatsoever for any direct, indirect or consequential loss arising from the use of this document. WSE, the Author, and the Reviewer expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in this document. Additionally, WSE, the Author, and the Reviewer do not (1) guarantee the accuracy, timeliness, completeness or correct sequencing of the information, or (2) warrant any results from use of the information. The included information is subject to change without notice.\nNOT AN OFFERING\nThis document is not intended as an offering, recommendation, or a solicitation of an offer to buy or sell the securities mentioned or discussed, and is to be used for informational purposes only. Please read all associated disclosures and disclaimers in full before investing. Neither WSE nor any party affiliated with us is a registered investment adviser or broker-dealer with any agency or in any jurisdiction whatsoever. To download our report(s), read our disclosures, or for more information, visit https://wallstequities.com/legal-disclaimer/\nCONTACT\nFor any questions, inquiries, or comments reach out to us directly. If you're a company, we are covering and wish to no longer feature on our coverage list contact us via email and/or phone between 09:30 EDT to 16:00 EDT from Monday to Friday at:\nEmail: info@wallstequities.com\nPhone number: +21-32-044-483\nOffice Address: 1 Scotts Road #24-10, Shaw Center Singapore 228\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.\n releases/stock-review-for-golds-investors----goldcorp-harmony-gold-mining-iamgold-and-kinross-gold-300586544.html\nSOURCE Wall St. Equities", "external_links": ["http://www.prnewswire.com/news-releases/stock-review-for-golds-investors----goldcorp-harmony-gold-mining-iamgold-and-kinross-gold-300586544.html", "http://www.wallstequities.com/registration/?symbol=HMY", "http://www.wallstequities.com/registration/?symbol=KGC", "http://www.wallstequities.com/registration/?symbol=GG", "http://www.wallstequities.com/registration/?symbol=IAG", "https://wallstequities.com/legal-disclaimer/", "http://www.wallstequities.com/registration"], "published": "2018-01-23T14:00:00.000+02:00", "crawled": "2018-01-23T14:16:36.012+02:00", "highlightTitle": ""}