{"organizations": [], "uuid": "3c03d58eaab0b1f9c056990cfbdcde216f9b49ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180116.html", "section_title": "Archive News &amp; Video for Tuesday, 16 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-precious/precious-gold-eases-from-4-month-peak-as-dollar-fights-back-idUSL3N1PB34S", "country": "US", "domain_rank": 408, "title": "PRECIOUS-Gold eases from 4-month peak as dollar fights back", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-16T18:47:00.000+02:00", "replies_count": 0, "uuid": "3c03d58eaab0b1f9c056990cfbdcde216f9b49ad"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-precious/precious-gold-eases-from-4-month-peak-as-dollar-fights-back-idUSL3N1PB34S", "ord_in_thread": 0, "title": "PRECIOUS-Gold eases from 4-month peak as dollar fights back", "locations": [], "entities": {"persons": [{"name": "jan harvey", "sentiment": "none"}, {"name": "georgette boele", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "abn amro", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar recovers some poise after hitting 3-mth low * Palladium slips below Monday's record high * GRAPHIC-2018 asset returns: tmsnrt.rs/2jvdmXl (Updates throughout, adds LONDON dateline) By Jan Harvey LONDON, Jan 16 (Reuters) - Gold fell on Tuesday from the previous day's four-month high, reflecting losses across precious metals and commodities more widely, as the dollar clawed back some lost ground after hitting a three-year low against a currency basket. Gold's move lower snapped four straight days of gains in the metal after the retreat of the dollar, in which it is priced, made it cheaper for holders of other currencies. Spot gold was down 0.4 percent at $1,334.55 an ounce at 1030 GMT, while U.S. gold futures for February delivery were 10 cents an ounce lower at $1,334.80. \"Dollar weakness has calmed down, and that is one reason why gold is retracing lower,\" ABN Amro analyst Georgette Boele said. \"It went up quite quickly up at the start of the year, and I think it was a bit overstretched.\" \"In general the precious metals complex and other commodities are facing downwards today. There is a bit of profit-taking, and also a lot of it is linked the dollar weakness, which came to a halt.\" The dollar rose 0.2 percent against the euro, having hit a three-year low against the single currency on Monday. The U.S. currency has weakened as markets have grown increasingly confident that a global recovery would outpace U.S. growth and prompt other major central banks, led by the European Central Bank, to unwind their easy money strategy faster than has been expected. Gold remained relatively firm in the face of three U.S. interest hikes in 2017, but could suffer if these continue, analysts say. It is highly sensitive to rising rates, which increase the opportunity cost of holding non-yielding bullion. \"We see a trading range of $1,225-$1,430 for gold this year, with an average price of $1,290,\" INTL FCStone said in a note. \"Our number suggests we are closer to a top (than) a bottom, a position we are comfortable with as we are not sure gold could withstand the higher yield environment going into next year, especially if the (weaker) dollar eventually reverses course.\" Palladium , which hit a record high of $1,138 an ounce on Monday, was down 1.2 percent at $1,112.47. The metal has seen a sustained rally as high demand in the auto industry fuelled concerns over a persistent supply deficit, sending net long positions in Nymex palladium futures to record highs. Silver was down 1.8 percent to $17.05 an ounce, off the previous day's three-month high of $17.42. Platinum was 1.4 percent lower at $982.24, after touching its strongest since Sept. 11 at $1,001.40 on Monday. (Additional reporting by Nallur Sethuraman in Bengaluru; Editing by Gareth Jones)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://tmsnrt.rs/2jvdmXl"], "published": "2018-01-16T18:47:00.000+02:00", "crawled": "2018-01-17T19:49:35.012+02:00", "highlightTitle": ""}