{"organizations": [], "uuid": "fa0902563f9a004cffbc2b02d4e3fac12031521c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/reuters/UKTennisNews", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/tennis-sydney/tennis-muguruza-battles-past-bertens-to-reach-sydney-last-eight-idUKL4N1P52HJ", "country": "US", "domain_rank": 408, "title": "Tennis-Muguruza battles past Bertens To reach Sydney last eight", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T09:48:00.000+02:00", "replies_count": 0, "uuid": "fa0902563f9a004cffbc2b02d4e3fac12031521c"}, "author": "", "url": "https://uk.reuters.com/article/tennis-sydney/tennis-muguruza-battles-past-bertens-to-reach-sydney-last-eight-idUKL4N1P52HJ", "ord_in_thread": 0, "title": "Tennis-Muguruza battles past Bertens To reach Sydney last eight", "locations": [], "entities": {"persons": [{"name": "tennis-muguruza", "sentiment": "negative"}, {"name": "sy", "sentiment": "negative"}, {"name": "garbine muguruza", "sentiment": "none"}, {"name": "kiki bertens", "sentiment": "none"}, {"name": "bertens", "sentiment": "none"}, {"name": "muguruza", "sentiment": "none"}], "locations": [{"name": "tennis-muguruza", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "ken rosewall arena", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "brisbane international", "sentiment": "none"}], "organizations": [{"name": "bertens to", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 7:52 AM / Updated 32 minutes ago Tennis-Muguruza battles past Bertens To reach Sydney last eight Reuters Staff 3 Min Read \nSYDNEY, Jan 10 (Reuters) - Top seed Garbine Muguruza overcame an injury scare to battle past Kiki Bertens 6-3 7-6(6) and advance to the Sydney International quarter-finals on Wednesday. \nThe Wimbledon champion accepted a wildcard into the tournament after retiring with leg cramps during her opening match at the Brisbane International last week and called for a medical time-out after the third game against Bertens. \nThe Spanish world number three, however, returned to the Ken Rosewall Arena in full flow, breaking her Dutch opponent twice to surge 5-1 clear, while allaying fears of another injury setback ahead of next week’s Australian Open. \nBertens, who had won all three previous meetings against Muguruza in straight sets, recovered one of the breaks to halt her opponent’s march but the two-time grand slam winner regrouped to close out the opening set. \nMuguruza broke at the start of the second set against the 26-year-old world number 32 but struggled to impose herself during the key moments, only converting three of 13 break-point opportunities and dropping her serve in the eighth game. \nThe Spaniard, however, sealed victory on her fourth match point in the tiebreak when Mertens hit a return long and will next meet the winner of the all-Australian second-round clash between Daria Gavrilova and Samantha Stosur in the last eight. \n“I struggled a little bit today and I had to adapt my game a bit because of my condition,” Muguruza said in a court-side interview after registering her first win of the season. \n“I managed to win and that’s the important thing I guess. Melbourne is next week and I‘m still here. There’s a lot of top-10 players here and it’s going to be a battle.” \nAgnieszka Radwanska, the 2013 champion and last year’s finalist in Sydney, kept her preparations for the year’s first grand slam on course with a 7-6(4) 6-0 win over teenage American qualifier CiCi Bellis. \nThe Polish 28-year-old will meet two-time Wimbledon champion Petra Kvitova or Italian qualifier Camila Giorgi for a place in the last four. \n“For sure in that match the first set was the key, key point in that match,” Radwanska said. “It was really tight, and a lot of good tennis in that first set. I think she was a little bit upset about losing that first set.” \nIn the men’s draw, Italian veteran Paolo Lorenzi ousted top seed Albert Ramos-Vinolas of Spain in straight sets in the second round. \nRamos-Vinolas needed treatment for a leg problem early in the second set and fell 6-3 7-5 to the 36-year-old Lorenzi, who is ranked 45 in the world. (Reporting by Sudipto Ganguly; Editing by John O‘Brien)", "external_links": [], "published": "2018-01-10T09:48:00.000+02:00", "crawled": "2018-01-10T10:37:18.000+02:00", "highlightTitle": ""}