{"organizations": [], "uuid": "b78ef1b98d4c23e6e1362b0664caea43f33027d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224327494&w=1200&r=LYNXMPEE0M02B", "site_section": "http://feeds.reuters.com/reuters/politicsNews", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-shutdown-democrats/in-shutdown-fight-democrats-schumer-keeps-eye-on-november-idUSKBN1FC05E", "country": "US", "domain_rank": 408, "title": "In shutdown fight, Democrats' Schumer keeps eye on November", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T03:57:00.000+02:00", "replies_count": 0, "uuid": "b78ef1b98d4c23e6e1362b0664caea43f33027d2"}, "author": "", "url": "https://www.reuters.com/article/us-usa-shutdown-democrats/in-shutdown-fight-democrats-schumer-keeps-eye-on-november-idUSKBN1FC05E", "ord_in_thread": 0, "title": "In shutdown fight, Democrats' Schumer keeps eye on November", "locations": [], "entities": {"persons": [{"name": "schumer", "sentiment": "negative"}, {"name": "richard cowan", "sentiment": "none"}, {"name": "chuck schumer", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "james oliphant", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "reuters/ipsos", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " In agreeing on Monday to end a three-day U.S. government shutdown, Senate Democratic leader Chuck Schumer had to make a tough decision to bridge a divide within his own party over immigration, an issue on which Americans are deeply conflicted, according to new Reuters/Ipsos polling data.\nDemocratic leftists wanted Schumer to drive a harder bargain on helping the “Dreamers,” young people brought to the United States illegally as children who face the threat of deportation under an order issued last year by Republican President Donald Trump.\nBut moderate Senate Democrats facing re-election challenges this year feared that prolonging the shutdown over the immigration issue would hurt them in November’s congressional elections. In the end, Schumer sided with them.\nBy opting to placate senators crucial to his drive to seize control of the Senate from Republicans, Schumer angered the party’s left, potentially complicating already difficult efforts to craft legislation to help the Dreamers.\nHis predicament underscored deep ambivalence among Americans, both Democrats and Republicans, on immigration.\nFifty-five percent of Americans in a Reuters/Ipsos poll released on Monday said the government should not shut down, even if that means letting the Dreamers get deported.\nAt the same time, 87 percent of Democrats and 60 percent of Republicans said they supported the Obama-era Deferred Action for Childhood Arrivals, or DACA, program that protects the Dreamers from deportation. Trump announced in September that DACA would end in March.\nSome 53 percent of those polled said they opposed Trump’s central demand in the immigration battle, funding for a wall he wants to build along the U.S.-Mexico border.\nIn an example of hard-line views among many Republicans on immigration, Republican Senator Ted Cruz warned after the Senate vote on Monday to end the shutdown that it would be a “serious mistake” to provide “amnesty and a path to citizenship for millions of people here illegally.”\nMOST BLAME REPUBLICANS FOR SHUTDOWN Republican attacks on Schumer’s decision to couple a stopgap spending bill with immigration were “no doubt causing heartburn with some Democrats,” said Jim Manley, once a top aide to former Democratic Senate Majority Leader Harry Reid.\nStill, Manley said, the Democratic stand on Dreamers had been effective and would play out in the party’s favor by energizing the party’s base, something crucial in a year when voter turnout is lower than in presidential elections.\nWhile it was Democrats who temporarily stopped government funding by demanding a Dreamer bill, the Reuters/Ipsos poll, conducted Saturday to Monday, found 55 percent blamed Trump or Republicans in Congress for the shutdown. Only 33 percent said congressional Democrats were at fault.\nSeveral Democratic senators up for re-election in states won by Trump in 2016 labored over the weekend to achieve the sort of balancing act that Schumer must get the party to perform.\nJoe Donnelly of Indiana, Heidi Heitkamp of North Dakota and Joe Manchin of West Virginia all had voted in favor of keeping the government open last Friday. Their relief was evident on Monday once a deal had been reached to reopen the government.\nHeitkamp cited ”the level of concern, the level of commitment, to the American people in moving this process forward.”\nDonnelly, referring to what is widely considered a horribly fractured Congress, said: “There’s such trust among the members here, that we have each other’s backs, that we don’t worry about Republican or Democrat.”\nSuch reviews were not coming out of the left wing of the Democratic Party.\nThe Progressive Change Campaign Committee labeled the deal to reopen the government “madness” and said it was a “cave” that was “led by weak-kneed, right-of-center Democrats.”\nDemocratic Representative Luis Gutierrez of Chicago, a leading voice in Congress’ immigration battles, said Monday’s pact provided no assurances that Dreamers would be protected from deportation.\n“When it comes to immigrants, Latinos and their families, Democrats are still not willing to go to the mat to allow people in my community to live in our country legally,” Gutierrez said.\nAdditional reporting by Chris Kahn in New York; Editing by Kevin Drawbaugh and Peter Cooney\n ", "external_links": [], "published": "2018-01-23T03:57:00.000+02:00", "crawled": "2018-01-23T04:18:44.011+02:00", "highlightTitle": ""}