{"organizations": [], "uuid": "a1931a939277fdab08150a5d09bce0da4c94cc1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/07/05/103765424-GettyImages-482395456.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/10-us-states-most-in-need-of-trumps-1-point-5-trillion-infrastructure-plan.html", "country": "US", "domain_rank": 767, "title": "10 US states most in need of Trump's $1.5 trillion infrastructure plan", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.029, "site_type": "news", "published": "2018-01-31T17:55:00.000+02:00", "replies_count": 0, "uuid": "a1931a939277fdab08150a5d09bce0da4c94cc1b"}, "author": "Scott Cohn", "url": "https://www.cnbc.com/2018/01/31/10-us-states-most-in-need-of-trumps-1-point-5-trillion-infrastructure-plan.html", "ord_in_thread": 0, "title": "10 US states most in need of Trump's $1.5 trillion infrastructure plan", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "scott cohn", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "top states", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "10 US states most in need of Trump's $1.5 trillion infrastructure plan Getty Images Scott Cohn | @ScottCohnTV 36 Mins Ago \nIf there is one thing Americans can agree on these days, it is that our infrastructure is a mess. In his first State of the Union address on Tuesday, President Donald Trump focused on the issue. He called for a $1.5 trillion infrastructure bill to help rebuild our nation's crumbling infrastructure. To fund the plan, Trump said all federal appropriations should be \"leveraged by partnering with state and local governments and, where appropriate, tapping into private-sector investment.\" \nNoting America \"is a nation of builders,\" he stressed the importance of revamping roads, highways, bridges, airports and the like. But so far, the administration has sketched only a broad outline. Congress is waiting for a formal written proposal. \nMeanwhile, the states are hanging on every development, and our annual America's Top States for Business study finds some need more help than others. Our Infrastructure category, worth 400 of our 2,500 total points, uses government data to grade the roads, bridges, ports, airports, rail systems and utilities in all 50 states. These are the states that we find need the most work. 10. (tie) Massachusetts \nSpend a morning trying to get to work in Boston and you will know exactly what we are talking about. Commuting times in the Bay State are among the longest in the country. All that traffic is taking a toll not just on drivers' nerves but also on Massachusetts' aging bridges, with 483 deemed \"structurally deficient.\" Also aging: the state's water utilities. The price tag to fix them is not getting any smaller. Voters will decide this year on a constitutional amendment that would impose a 4 percent \"millionaire's tax,\" with part of the proceeds going toward infrastructure. But opponents say the tax would make the state less competitive, returning it to its \"Tax-achusetts\" past. \n2017 Infrastructure score : 150 out of 400 points Roads in mediocre or poor condition : 42 percent Deficient bridges : 9.3 percent Average commute to work : 28.7 minutes 20-year water system needs : $7.7 billion Jim Davis | The Boston Globe | Getty Images 10. (tie) Mississippi \nAmong those hanging the most hope on the Trump administration's stalled infrastructure proposal is Mississippi Gov. Phil Bryant, who has submitted $7 billion worth of projects to be considered if the plan gets off the ground. They include improvements in and around the Port of Gulfport. It is already the third busiest container port on the Gulf of Mexico, but officials see even greater potential for the facility as a hub not only for shipments of goods, like liquefied natural gas, but also military troops and equipment from bases in the region. But beyond the port, the state will likely have to kick in a sizable chunk of its own money to address a growing list of needs. Roads and bridges are deteriorating, and airline service is limited. \n2017 Infrastructure score : 150 out of 400 points Roads in mediocre or poor condition : 51 percent Deficient bridges : 12.3 percent Average commute to work : 24.1 minutes 20-year water system needs : $3.7 billion Getty Images 8. Maryland \nLiving in and around Baltimore means having to put up with almost daily disruptions, like a steam pipe explosion last June that injured five people and snarled downtown traffic for days. Incidents like that and the sorry state of Maryland 's roads help explain why the state ties with New York for America's longest commutes. The Port of Baltimore is in the midst of a boom, and the state has purchased additional land to expand it. But the state still finishes in the bottom half for the value of goods it ships. \n2017 Infrastructure score : 145 out of 400 points Roads in mediocre or poor condition : 55 percent Deficient bridges : 5.8 percent Average commute to work : 32.3 20-year water system needs : $6.9 billion Kenneth K. Lam | The Baltimore Sun | AP 7. West Virginia \nAmong the casualties of the Mountain State's bruising budget battle last summer was Gov. Jim Justice's plan to fund major infrastructure projects through increases in gasoline taxes and license fees. The legislature did approve some infrastructure funding, but nothing close to the governor's proposal, in an austerity budget aimed at solving the state's fiscal crisis. Whether or not it works, the bills to fix the crumbling state will continue to pile up. West Virginia has some of America's worst roads and bridges. And with the painful decline of the coal industry, the volume of goods shipped from the state has fallen sharply. \n2017 Infrastructure score : 144 out of 200 points Roads in mediocre or poor condition : 47 percent Deficient bridges : 17.3 percent Average commute to work : 25.6 minutes 20-year water system needs : $1.2 billion Getty Images 6. New York \nThere is bipartisan agreement on this: New York's LaGuardia Airport is like something out of a third-world country — words used by both President Trump and former Vice President Joe Biden to cast the facility as a symbol of the nation's infrastructure crisis. These days, LaGuardia is more like something out of 1990s post-unification Berlin. It is a giant construction zone in the midst of a $4 billion redevelopment. It is one of several major infrastructure projects under way in New York State , touted by Gov. Andrew Cuomo as tickets to revitalization. But big projects like these take time — LaGuardia's renovation won't be complete until 2020, for example. In the meantime, the Empire State remains plagued by crumbling roads and bridges, numbingly long commutes, water utilities in crisis and, yes, third-world airports. \n2017 Infrastructure score : 140 out of 400 points Roads in mediocre or poor condition : 60 percent Deficient bridges : 11 percent Average commute to work : 32.3 minutes 20-year water system needs : $22 billion Robert Cicchetti | Getty Images 5. New Jersey \nNew Yorkers can at least take solace in the fact that things are slightly worse in New Jersey. But the Garden State is also taking steps to address its infrastructure problems. Former Gov. Chris Christie pushed through a gas tax increase last year to fund an additional $400 million a year in road repairs. It can't come a moment too soon, as the state deals with the consequences of previous underinvestment in infrastructure. \n2017 Infrastructure score : 139 out of 400 points Roads in mediocre or poor condition : 66 percent Deficient bridges : 9 percent Average commute to work : 31 minutes 20-year water system needs : $7.9 billion Getty Images 4. Connecticut \nAnd it's a clean sweep for the tri-state area. All three states in the New York City metropolitan area rank among the bottom for infrastructure, and Connecticut is worst of all. The Constitution State ties with Illinois for the worst roads in the nation. And unlike Connecticut's northeast neighbors, it does not have a viable plan to fix them. The legislature has funded only the first few years of \"Let's GO CT!,\" a 30-year, $100 billion highway plan introduced by Gov. Dannel Malloy in 2015. And the prospects for lawmakers coming up with additional money don't look good, as the state deals with an onslaught of budget demands, including growing pension obligations. \n2017 Infrastructure score : 132 out of 400 points Roads in mediocre or poor condition : 73 percent Deficient bridges : 8 percent Average commute to work : 25.4 minutes 20-year water system needs : $3.6 billion Arnold Gold | New Haven Register | AP 3. Maine \nThe state is finally replacing the Sarah Mildred Long Bridge, which carries Interstate 95 between Kittery, Maine; and Portsmouth, New Hampshire, but not before the 77-year-old lift bridge became stuck several times — in the up position, the down position and various positions in between. The bridge is just one of many infrastructure issues plaguing Maine , the Pine Tree State. Roads and bridges by and large are in poor condition; the availability of air travel is limited; there is little rail service to speak of. If a Mainer tells you, \"You can't get there from here,\" he may really mean it. \n2017 Infrastructure score : 108 out of 400 points Roads in mediocre or poor condition : 53 percent Deficient bridges : 14.4 percent Average commute to work : 23.6 minutes 20-year water system needs : $1.2 billion Gregory Rec | Portland Press Herald | Getty Images 2. New Hampshire \nInterstate 93, which connects Manchester to the northern suburbs of Boston, is a constant headache, plagued by bottlenecks. The idea of widening it dates back to the 1980s, when Gov. Chris Sununu's father John was in office. Back then, estimates put the project at around $200 million. Now that it is finally getting done, it is costing at least four times that amount. The highway is just one example of the massive cost to the Granite State of waiting to deal with its infrastructure. Gov. Sununu and the legislature have agreed to use part of New Hampshire 's budget surplus to begin dealing with the roads, and to tap into a state reserve fund to begin fixing the water infrastructure. The state has a lot of catching up to do. \n2017 Infrastructure score : 105 out of 400 points Roads in mediocre or poor condition: 54 percent Deficient bridges: 12.2 percent Average commute to work: 26.9 minutes 20-year water system needs: $835 million Jim Cole | AP 1. Rhode Island \nThe Ocean State has made considerable strides in many facets of competitiveness, but reversing decades of neglect of America's worst infrastructure doesn't happen overnight. To begin tackling the state's decrepit bridges and roads, Gov. Gina Raimondo pushed through RhodeWorks , a repair program funded by charging large commercial trucks a toll fee. Work is already under way on several projects. But Rhode Island is facing other infrastructure needs, including airports and rail, while contending with an unexpected budget shortfall. \n2017 Infrastructure score : 95 out of 400 points Roads in mediocre or poor condition: 70 percent Deficient bridges: 24.9 percent Average commute to work: 24.2 minutes 20-year water system needs: $148.2 million Matt O'Brien | AP", "external_links": [], "published": "2018-01-31T17:55:00.000+02:00", "crawled": "2018-01-31T17:54:56.004+02:00", "highlightTitle": ""}