{"organizations": [], "uuid": "40c66e4eff0b0ae5ed32fdfc508093e0c4258569", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-suareznavarro/tennis-suarez-navarro-hits-back-to-reach-quarter-finals-idUSKBN1FA01N", "country": "US", "domain_rank": 408, "title": "Tennis: Suarez Navarro hits back to reach quarter-finals", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T11:03:00.000+02:00", "replies_count": 0, "uuid": "40c66e4eff0b0ae5ed32fdfc508093e0c4258569"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-tennis-ausopen-suareznavarro/tennis-suarez-navarro-hits-back-to-reach-quarter-finals-idUSKBN1FA01N", "ord_in_thread": 0, "title": "Tennis: Suarez Navarro hits back to reach quarter-finals", "locations": [], "entities": {"persons": [{"name": "carla suarez navarro", "sentiment": "negative"}, {"name": "suarez navarro", "sentiment": "negative"}, {"name": "anett kontaveit", "sentiment": "none"}, {"name": "kontaveit", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "yarra", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 3:03 AM / in 8 minutes Tennis: Free and single-handed, Suarez Navarro makes last eight Martyn Herman 3 Min Read \nMELBOURNE (Reuters) - Carla Suarez Navarro struck a blow for one of the endangered shots of women’s tennis as she used her single-handed backhand to great effect to beat Estonian Anett Kontaveit and reach the Australian Open quarter-finals on Sunday. \nThe diminutive Spaniard dug herself out of a deep hole, hitting back from a set and two breaks of serve down to win 4-6 6-4 8-6 on a muggy Rod Laver Arena and secure a clash with second seed Caroline Wozniacki. \nSuarez Navarro is the only single-hander to reach the last 16 here this year and is the only member of the world’s top 40 not to strike a double-fisted backhand. \nNot since Francesca Schiavone won the 2010 French Open with her single-handed backhand has the stroke brought grand slam success for a woman, although before that Justine Henin used it to devastating effect to win four French Opens in five years between 2003 and 2007. \nAmelie Mauresmo was the last woman to win the Australian Open with a one-handed backhand, in 2006 when it also fired her to glory on the Wimbledon grasscourts. \nRoger Federer’s 19 grand slam titles are living proof that single-handed backhands can still reign in the men’s side with his fellow Swiss Stan Wawrinka winning three slams with his. \nMen’s third seed Grigor Dimitrov and number five Dominic Thiem also own stylish single-handers. \nSo the odds are stacked against Suarez Navarro although the purists may hope she can stick around a little longer as the way she executes her topspin stroke is a thing of beauty. \nSuarez Navarro hit only two clean winners with it on Sunday but it was the foundation on which she built victory. \n“Maybe we can open a little bit more the court with the angle. Maybe we slice a little bit better,” the 29-year-old, who was inspired by Henin’s backhand, told reporters. \n”But tennis is going to more power, faster, and when you hit the ball with one hand, is not the same as if you hit with two. \n“I think it’s because of this. Years ago all the players play with one-handed. Now we are losing this backhand.” \nKontaveit was bidding to reach the last eight of a grand slam for the first time and the 22-year-old had victory in her grasp when she took the first set and led 4-1. \nUnseeded Suarez Navarro was given heart when Kontaveit double-faulted to hand one break of serve back and the Spaniard stormed back, winning six games in a row. \nThe deciding set was a real battle and Kontaveit again looked like closing it out when she broke at 4-4 but she faltered and was broken as she served for the match. \nSuarez Navarro enjoyed an outrageous slice of luck when Kontaveit served to stay in the match at 6-7, striking a forehand that hit the net tape twice before wobbling over to give her a second match point. \nShe missed that one but on her third opportunity Kontaveit smacked a forehand long to send Suarez Navarro into the quarter-finals at Melbourne Park for the third time. Editing by Greg Stutchbury", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-21T11:03:00.000+02:00", "crawled": "2018-01-21T06:07:06.000+02:00", "highlightTitle": ""}