{"organizations": [], "uuid": "ee5d70b33838c0304a4c628a46b177c69aae7235", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-usei-declares-warrant-dividend-on-its-common-stock-as-part-of-its-cannabis-operations-and-future.html", "country": "US", "domain_rank": 767, "title": "USEI Declares Warrant Dividend on Its Common Stock as Part of Its Cannabis Operations and Future", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T16:30:00.000+02:00", "replies_count": 0, "uuid": "ee5d70b33838c0304a4c628a46b177c69aae7235"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-usei-declares-warrant-dividend-on-its-common-stock-as-part-of-its-cannabis-operations-and-future.html", "ord_in_thread": 0, "title": "USEI Declares Warrant Dividend on Its Common Stock as Part of Its Cannabis Operations and Future", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "usei", "sentiment": "negative"}, {"name": "usei cannabis initiatives corp", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SANTA CLARITA, CA, Jan. 02, 2018 (GLOBE NEWSWIRE) -- USEI CANNABIS INITIATIVES CORP, a wholly owned subsidiary of U.S. ENERGY INITIATIVES CORPORATION, INC. (OTC PINK: USEI) a California based company, poised to capitalize on California’s legal cannabis industry focusing on the manufacturing and extraction of oil from cannabis is pleased to announce today that its Board of Directors has declared two (2) dividends in the form of warrants to purchase shares of the Company's common stock; a 1 for 10 or a 10% warrant to shareholders of record on the record date.\nThe warrants will be issued on pay-date of February 26, 2018 to shareholders of record as of February 16, 2018. Each shareholder of the Company's common stock will receive one warrant for every ten shares owned (10% of their holdings) as of the record date (with the number of warrants rounded up to the nearest whole number). The first warrant will entitle the holder to purchase 10% of their holdings of the Company's common stock equal to the exercise price per share price on March 30, 2018. The second warrant will entitle the holder to purchase 10% of their holdings of the Company's common stock at an exercise price share price on March 30, 2018 plus a 50% premium to that same price (For example .010 +.005 =.015). Combined these warrants represent a 20% warrant to the shareholder. (For example, if a shareholder has 1 million shares these warrants allow the shareholder of record to acquire an additional 200,000 shares at these prices). These warrants will be for a 3-year term from the date of issue, non-transferable, with the restricted shares being issued upon exercise. Funds raised because of this warrant will fund the company's likelihood of becoming a reporting issuer with the Securities and Exchange Commission, or SEC and future growth of the company’s business model. Further details of this warrant will be disclosed in a future press release.\nAccording to Anthony Miller, CEO, “ This is the 3rd dividend that the company has issued to its shareholders in recent years… and this event has been planned for a few months. It is management’s opinion that the issuance in this case is a beneficial activity for this firm, as it is transitioning to a more profitable business model. This month we begin to actively manufacture oil extractions from cannabis utilizing the MRX extraction technology that we purchased last month. This device is the first in a series of purchases that the company will make to keep pace in the growing demand for cannabis products now that California has become the largest legal marketplace in the world.\n“Our goal is to produce a wide range of extracted products; and we plan to actively expand our operation aggressively. We start production on the first day of delivery and these devices will all be operating on a 24/7/365 basis. Revenue produced will allow us to become profitable on the first day of operation; and we believe that there is capital to fund growth. However, it is management’s opinion that the warrant announced today will fuel our expansion so that we can continue to grow our opportunity. Management further believes that any additional capital raising should come from those folks who are and have been participating in the growth of this company thus far. Creating toxic dilution of the company’s stock to the detriment of those who have been holding strong with us for some time is not acceptable.\n“Management, further intends to file with the SEC to finally become a reporting issuer so that the company will have greater transparency and become financially responsible. The cannabis industry requires true and an accurate representation of every dime made, and it is our goal to become fully transparent to the public market in the same manner. In the coming weeks, management will continue to disclose our progress including video of our delivery and extraction operations and post our progress on twitter, Facebook and on the company’s websites. Our future is awesome, and it was encouraging to see other companies, in the state of Oregon, that started just like us, with just one device and now up to 7 additional devices in less than three year (3) making millions of dollars annually, and their market is only 1/5 of the California market.\n“Finally, management believes that this 20% dividend could represent a significant opportunity to the shareholders of record because of two reasons 1) management believes that if management executes its business model the share value should become commensurate with revenues produced by our activities and 2) capital provided because these dividends will fuel growth, and both factors could be beneficial to the company.” commented Miller\nAbout U.S. Energy Initiatives: U.S. Energy Initiatives Corporation (OTC PINK: USEI) is a diverse energy firm. USEI, and its wholly owned subsidiary, USEI Cannabis, business' centers on everything cannabis related and developing products and services for the marketplace. Our Ultimate Cure & Real McCoy Genuine Products : we market vapor pens and accessories, topical ointments, cannabis oils and tinctures all under these same names. Our goal here is to become an environmentally responsible firm, marketing our products to our audience to produce significant revenue and add value for our shareholders. We have very ambitious goals and objectives for USEI Cannabis and we believe that we will have a very long presence in Washington, Oregon, California and wherever cannabis is legal. Our objective is to create a foundation that will be instrumental in our continued efforts to capture our market-share and create viable products that meet our goals and objectives for these markets. For more information regarding our strategies it can be found on the company's website @ www.useicannabis.com/web/ .\nDISCLOSURES: \"Safe Harbor\" This press release contains forward-looking statements including statements regarding the timing of the revenue from the partnership and the partnership's success. The words \"believe,\" \"may,\" \"estimate,\" \"continue,\" \"anticipate,\" \"intend,\" \"should,\" \"plan,\" \"could,\" \"target,\" \"potential,\" \"is likely,\" \"will,\" \"expect\" and similar expressions, as they relate to us, are intended to identify forward-looking statements. We have based these forward-looking statements largely on our current expectations and projections about future events and financial trends that we believe may affect our financial condition, results of operations, business strategy and financial needs. Important factors that could cause actual results to differ from those in the forward-looking statements include consumer reaction to our Cannabis products and new regulations which affect the distribution of these products. Further information on our risk factors is contained in our filings with the OTC Markets. Any forward-looking statement made by us herein speaks only as of the date on which it is made. Factors or events that could cause our actual results to differ may emerge from time to time, and it is not possible for us to predict al", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/f2a6192f-37fe-4ea7-9f49-2def8b5d7fbb", "https://www.globenewswire.com/Tracker?data=zwCDMxmSqe3POGu_A_tNCN7V28TmPaWkYEc_OAWS28Av4Dg8rodtqxz4Rejj08JXc1PbtC6g_LMaVw3TXCOUVgVPS8hgkhlNxQtxteeLapSRzazqDwXXIFK1r7glhfxpl_zJPHK6CaKQ-twtys3CGdzmUJ-_jcEXVygoKmuVzcPPGMQk-5t4oCCk3aZQypUH_HkAIDS576beb40R85126hQ1eCOYbkXjkXbfi23wjtxx2yAyMLexy17bZpqet9Mee1pYEZHuhWmsVQEvMe-sOw=="], "published": "2018-01-02T16:30:00.000+02:00", "crawled": "2018-01-02T16:33:27.036+02:00", "highlightTitle": ""}