{"organizations": [], "uuid": "9a49b9ec3c3a6672e26bbe3d0cd632c7ed11c257", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-intersect-ent-reports-preliminary-q4-and-year-2017-revenue.html", "country": "US", "domain_rank": 767, "title": "Intersect ENT Reports Preliminary Q4 and Year 2017 Revenue", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "9a49b9ec3c3a6672e26bbe3d0cd632c7ed11c257"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-intersect-ent-reports-preliminary-q4-and-year-2017-revenue.html", "ord_in_thread": 0, "title": "Intersect ENT Reports Preliminary Q4 and Year 2017 Revenue", "locations": [], "entities": {"persons": [], "locations": [{"name": "menlo park", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "intersect ent", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Full Year Revenue Grew Approximately 22% Year Over Year\nMENLO PARK, Calif.--(BUSINESS WIRE)-- Intersect ENT, Inc. (NASDAQ: XENT), a company dedicated to improving the quality of life for patients with ear, nose and throat conditions, today reported preliminary unaudited revenue for the fourth quarter and year ended December 31, 2017.\nFourth Quarter and Full Year 2017 Preliminary Revenue\nPreliminary unaudited revenue for the full year 2017 is expected to be in the range of $96.1 to $96.3 million, an increase of 22% compared to $78.7 million for 2016. Preliminary unaudited revenue for the fourth quarter of 2017 is expected to be in the range of $29.3 to $29.5 million, an increase of 21-22% compared to $24.2 million for the fourth quarter of 2016.\nThe fourth quarter and full year 2017 revenue included in this release are preliminary and prior to the completion of review and audit procedures by Intersect ENT's external auditors and are therefore subject to adjustment. Intersect ENT expects to provide fourth quarter and full year 2017 financial results and further 2018 guidance during its fourth quarter 2017 earnings call near the end of February 2018.\nENCORE Study Patient Enrollment Completed\nThe company also announced the completion of enrollment of the ENCORE study which commenced in November 2017. ENCORE is a 50-patient prospective, multicenter, open-label study focused on evaluation of the safety of repeat placement of the SINUVA™ Sinus Implant in chronic sinusitis patients with nasal polyps. This study is additive to the over 400 patients studied to date with SINUVA.\n2018 Revenue Outlook\nThe company forecasts full year 2018 revenue in the range of $111 to $116 million, which would represent an increase of 15-20% over 2017 and which includes an estimated 8% contribution from SINUVA product sales. The outlook for first quarter 2018 revenue is in the range of $23.2 to $23.7 million, and the company continues to expect to launch SINUVA commercially in the second quarter of 2018.\nAbout Intersect ENT ®\nIntersect ENT is dedicated to transforming ear, nose and throat care by providing innovative, clinically meaningful therapies to physicians and patients. The company’s steroid releasing implants are designed to provide mechanical spacing and deliver targeted therapy to the site of disease. In addition, Intersect ENT is continuing to expand its portfolio of products based on the company’s unique localized steroid releasing technology and is committed to broadening patient access to less invasive and more cost-effective care.\nFor additional information on the company or the products including risks and benefits, please visit www.IntersectENT.com . For more information about SINUVA, please visit www.SINUVA.com .\nIntersect ENT ® and PROPEL ® are registered trademarks and SINUVA™ is a trademark of Intersect ENT, Inc.\nForward-Looking Statements\nThe preliminary unaudited results contained in this press release and the forecasts regarding Intersect ENT's future performance are \"forward-looking\" statements. These forward-looking statements are based on Intersect ENT's current expectations and inherently involve significant risks and uncertainties and are subject to quarter-end closing adjustments. These statements and risks include Intersect ENT’s view of preliminary 2017 revenue and projections of 2018 revenue. Actual results could differ materially from those anticipated in such forward-looking statements as a result of these risks and uncertainties which are described in the company's filings on Form 10-K, Form 10-Q and the company's other filings with the Securities and Exchange Commission (SEC) available at the SEC's Internet site ( www.sec.gov ). Intersect ENT does not undertake any obligation to update forward-looking statements and expressly disclaims any obligation or undertaking to release publicly any updates or revisions to any forward-looking statements contained herein.\nXENT-F\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108005500/en/\nIntersect ENT, Inc.\nJeri Hilleman, 650-641-2105\nir@intersectENT.com\nSource: Intersect ENT, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51739082&newsitemid=20180108005500&lan=en-US&anchor=www.sec.gov&index=3&md5=5e5ff32f7933a960e4f18f5f829c54ab", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.SINUVA.com&esheet=51739082&newsitemid=20180108005500&lan=en-US&anchor=www.SINUVA.com&index=2&md5=67f59a45203da659adba5718bf269f00", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.IntersectENT.com&esheet=51739082&newsitemid=20180108005500&lan=en-US&anchor=www.IntersectENT.com&index=1&md5=a8074a80c45d70f91f9227441288f24e", "http://www.businesswire.com/news/home/20180108005500/en/"], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:10:15.047+02:00", "highlightTitle": ""}