{"organizations": [], "uuid": "2922d2dfc8db01981a1e658748a11ae47491e585", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/entertainment", "section_title": "Reuters: Entertainment News", "url": "https://www.reuters.com/article/us-amc-networks-darabont-thewalkingdead/darabont-files-new-lawsuit-against-amc-networks-over-the-walking-dead-idUSKBN1F738B", "country": "US", "domain_rank": 408, "title": "Darabont files new lawsuit against AMC Networks over 'The Walking Dead'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T00:32:00.000+02:00", "replies_count": 0, "uuid": "2922d2dfc8db01981a1e658748a11ae47491e585"}, "author": "", "url": "https://www.reuters.com/article/us-amc-networks-darabont-thewalkingdead/darabont-files-new-lawsuit-against-amc-networks-over-the-walking-dead-idUSKBN1F738B", "ord_in_thread": 0, "title": "Darabont files new lawsuit against AMC Networks over 'The Walking Dead'", "locations": [], "entities": {"persons": [{"name": "darabont", "sentiment": "negative"}, {"name": "frank darabont", "sentiment": "none"}, {"name": "orin snyder", "sentiment": "none"}, {"name": "jonathan stempel", "sentiment": "none"}, {"name": "snyder", "sentiment": "none"}], "locations": [], "organizations": [{"name": "amc networks", "sentiment": "negative"}, {"name": "min read  new york", "sentiment": "none"}, {"name": "caa", "sentiment": "none"}, {"name": "amc networks inc", "sentiment": "none"}, {"name": "creative artists agency", "sentiment": "none"}, {"name": "amc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 10:34 PM / Updated 16 hours ago Darabont files new lawsuit against AMC Networks over 'The Walking Dead' Jonathan Stempel 3 Min Read \nNEW YORK (Reuters) - Frank Darabont, a key creator behind “The Walking Dead,” on Thursday filed a second lawsuit against AMC Networks Inc, claiming to have been deprived of tens of millions of dollars of additional profit from the hit cable TV series. \nThe complaint by Darabont and Creative Artists Agency, which represents him, deepens a legal battle that began with a December 2013 lawsuit, in which they now claim to have been deprived of more than $280 million of profit over the show’s first seven seasons. \nAMC’s lawyer Orin Snyder in a statement accused the plaintiffs of seeking an “unjustified windfall,” and said his Manhattan-based client is confident it will prevail in court. \n“At the heart of this lawsuit - and all the litigation related to ‘The Walking Dead’ - is the greed of CAA,” Snyder said. “AMC has been an honest steward of the series and has paid all of its creative partners handsomely and appropriately.” \nDarabont also directed movies including “The Shawshank Redemption” and “The Green Mile.” He had helped develop “The Walking Dead,” a show about a zombie apocalypse, but was fired after the first season, which began in 2011. \nIn Thursday’s complaint, which seeks at least $10 million, Darabont and CAA accused AMC of engaging in “shady accounting practices” they discovered after a recent audit of the first three years of “The Walking Dead.” \nThey said the audit revealed alleged problems such as AMC having reported just 20 percent of revenue it received from Apple Inc for iTunes sales of “The Walking Dead,” and overcharged for distribution agreements in international and home video markets. \nDarabont and CAA also said AMC withheld “key terms” about a more generous fee agreement it had given Robert Kirkman, who created the comic book that “The Walking Dead” was adapted from. \nThe lawsuit was filed with the New York State Supreme Court in Manhattan, where the parties are awaiting a decision from State Supreme Court Justice Eileen Bransten on the merits of the 2013 lawsuit. \nThe cases are Darabont et al v AMC Network Entertainment LLC et al, New York State Supreme Court, New York County, Nos. 650251/2018 and 654328/2013. Reporting by Jonathan Stempel in New York; Editing by Susan Thomas", "external_links": [], "published": "2018-01-19T00:32:00.000+02:00", "crawled": "2018-01-19T00:42:45.001+02:00", "highlightTitle": ""}