{"organizations": [], "uuid": "f5cc198786184f2cfaaecf6a6debaad3f2cb83b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/01/104923139-GettyImages-522772336.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/leeco-founder-jia-yueting-fails-to-comply-with-order-to-return-to-china.html", "country": "US", "domain_rank": 767, "title": "LeEco founder Jia Yueting fails to comply with order to return to China", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-02T07:59:00.000+02:00", "replies_count": 0, "uuid": "f5cc198786184f2cfaaecf6a6debaad3f2cb83b5"}, "author": "Cheang Ming", "url": "https://www.cnbc.com/2018/01/02/leeco-founder-jia-yueting-fails-to-comply-with-order-to-return-to-china.html", "ord_in_thread": 0, "title": "LeEco founder Jia Yueting fails to comply with order to return to China", "locations": [], "entities": {"persons": [{"name": "jia yueting", "sentiment": "negative"}, {"name": "jia", "sentiment": "none"}], "locations": [{"name": "china tech guide china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "leeco", "sentiment": "negative"}, {"name": "getty images leeco", "sentiment": "none"}, {"name": "leshi internet information & technology jia", "sentiment": "none"}, {"name": "china securities regulatory commission", "sentiment": "none"}, {"name": "leshi internet information & technology", "sentiment": "none"}, {"name": "vcg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES show chapters 3 Hours Ago | 00:51 \nThe founder of embattled Chinese technology start-up LeEco has failed to observe an order from local regulators to return to the mainland to tackle financial problems at the company's Shenzhen-listed unit. \nThe order , issued by the China Securities Regulatory Commission last Monday, had instructed LeEco founder Jia Yueting to return to China before Dec. 31 to deal with arrears owed by Leshi Internet Information & Technology and its related companies. \nOn Jan. 1, after the deadline passed, Jia's whereabouts remained unknown, according to the South China Morning Post , citing local media reports. Jia has not appeared publicly on the mainland since March, online new site Quartz reported . \nRepresentatives at LeEco and Faraday Future did not immediately respond to an emailed request for comment. But Jia posted on his official WeChat account that he had asked his brother Jia Yuemin, to meet regulators last Friday. \n\"I am deeply sorry and blame myself for the negative impact of LeEco's debt crisis,\" he said, according to a translation by Reuters. \n\"The fundraising for Faraday Future in the United States is making significant progress and there are many tasks I need to push forward in order to ensure the production and timely delivery of the FF91,\" he said. \nThe FF91 is a luxury electric car being developed by LeEco and Faraday Future. \nThe CSRC has requested Jia return to the mainland since September, but had not seen any related action taken by Jia to comply, local news agency Xinhua said. \nJia had been added to a nationwide blacklist of debt defaulters maintained by the Supreme People's Court in December. Information on the publicly-available list showed that Jia had failed to adhere to a court order to pay Ping An Securities Group around 477 million yuan ($72 million). \nLast year had proven to be a tumultuous year for LeEco, which had shifted from originally being a video streaming platform to a multifaceted conglomerate. Before succumbing to a pile-up of debt , the company boasted aims to take on Silicon Valley giants such as Apple and Netflix. \nAfter making a major push stateside in 2016, LeEco was forced to slash its workforce last May due to reasons related to restructuring. Jia later stepped down from his role as chairman of Leshi Internet in July, having previously quit as the Shenzhen-listed unit's chief executive. \nEven though Jia's whereabouts remain unknown, his wife Gan Wei seemingly arrived in China on New Year's Day. \n\"On the last day of 2017, back to accomplish a mission. At the beginning of the new year, tasks on the road ahead will be heavy...\" Gan wrote in a Chinese-language Weibo post on Jan. 1, geotagged from Beijing Capital International Airport. \nShe also responded to a comment from another Weibo user who urged for problems at Leshi Internet to be taken care of so that its investors wouldn't be abandoned. \n\"Will do so,\" Gan said.", "external_links": [], "published": "2018-01-02T07:59:00.000+02:00", "crawled": "2018-01-02T07:59:12.000+02:00", "highlightTitle": ""}