{"organizations": [], "uuid": "4728a87406a8680c5be0210557385edc8e32c54f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104958678-GettyImages-905768968_1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/france-would-have-voted-to-leave-eu-too-if-in-uk-situation-french-leader-macron-says.html", "country": "US", "domain_rank": 767, "title": "France would've voted to leave EU too if in UK's situation, French leader Macron says", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.059, "site_type": "news", "published": "2018-01-22T13:58:00.000+02:00", "replies_count": 0, "uuid": "4728a87406a8680c5be0210557385edc8e32c54f"}, "author": "Silvia Amaro", "url": "https://www.cnbc.com/2018/01/22/france-would-have-voted-to-leave-eu-too-if-in-uk-situation-french-leader-macron-says.html", "ord_in_thread": 0, "title": "France would've voted to leave EU too if in UK's situation, French leader Macron says", "locations": [], "entities": {"persons": [{"name": "macron", "sentiment": "negative"}, {"name": "sylvain lefevre", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "calais", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union france", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sylvain Lefevre | Getty Images French President Emmanuel Macron on January 16, 2018 in Calais, France. \nFrance would likely have followed the U.K. and also voted to leave the European Union if the opportunity had presented itself, French President Emmanuel Macron said in an interview Sunday. \nMacron said that, if the French people had been put in a similar situation and were asked to vote \"yes or no\" on EU membership, then they would probably have chosen to leave the bloc. \n\"Middle classes and working classes and especially the oldest in your country decided that the recent decades were not in their favor and that the adjustments made by both the EU and globalization… wasn't in their favor,\" Macron told the BBC about the Brexit vote. \nWhen asked if France could take the same decision as the British people, Macron said: \"Yeah, probably. Probably in a similar context, but our context was very different.\" \nHe said that the U.K. government had made a mistake in asking the British electorate \"yes or no on a very complicated subject.\" Dan Kitwood-Pool | Getty Images \nFrance, one of the founding members of the European Union, plays a crucial role in European policymaking. In some of its regions, however, there is clear discontent regarding the direction of EU policy, mainly when it comes to immigration and the refugee crisis. \nMacron fought the last round of 2017's French presidential election against the National Front — a far-right party that campaigned to restrict the benefits of immigrants in France and to quit the EU. It managed to make it through to the last round for only the second time in its history. Macron won with 66 percent of the vote, a clear majority against the National Front's 34 percent. \nThe French leader said that he hopes the ongoing Brexit negotiations will deliver a deep and special relationship with the U.K., but that any deal with the EU \"will be by definition less deep than today.\" \n\"The deepest possible relation is being a member of the European Union,\" Macron said, adding that the U.K. will have its own working relationship with the bloc, possibly different from the agreements that countries such as Norway or Canada have. \n\"For sure, you will have your own solution,\" Macron said. \"I take these two references (Norway and Canada) because this special way should be consistent with the preservation of the single market and our collective interests and you should understand you cannot, by definition, have the full access to the single market if you don't tick the box. To get full access the single market, you need contribution to the (EU) budget, you have to accept the freedoms, the four pillars and the jurisdiction.\" \nCanada has a free trade agreement with the European Union. Norway is not a member of the EU but contributes to the European budget in order to have access to the single market, a free-tariff trade area; it also accepts that within this region, people, goods, capital and services move freely. \nThe U.K. government has said it doesn't want Britain be part of the single market and will seek a trade agreement with the EU.", "external_links": [], "published": "2018-01-22T13:58:00.000+02:00", "crawled": "2018-01-22T14:03:06.000+02:00", "highlightTitle": ""}