{"organizations": [], "uuid": "1b9e686cb5e9a79883b8c644b56fa0e4af1e1549", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-astellas-completes-acquisition-of-mitobridge-inc.html", "country": "US", "domain_rank": 767, "title": "Astellas Completes Acquisition of Mitobridge, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-24T05:00:00.000+02:00", "replies_count": 0, "uuid": "1b9e686cb5e9a79883b8c644b56fa0e4af1e1549"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-astellas-completes-acquisition-of-mitobridge-inc.html", "ord_in_thread": 0, "title": "Astellas Completes Acquisition of Mitobridge, Inc.", "locations": [], "entities": {"persons": [{"name": "yoshihiko h", "sentiment": "negative"}, {"name": "astellas", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "ma", "sentiment": "none"}, {"name": "mitobridge", "sentiment": "none"}, {"name": "astellas", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}], "organizations": [{"name": "astellas pharma inc.", "sentiment": "negative"}, {"name": "astellas completes acquisition of mitobridge, inc", "sentiment": "neutral"}, {"name": "mitobridge", "sentiment": "none"}, {"name": "mitobridge, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO, Jan. 23, 2018 /PRNewswire/ -- Astellas Pharma Inc. (TSE: 4503, President and CEO: Yoshihiko Hatanaka, \"Astellas\" ) today announced that it has completed the acquisition of Mitobridge, Inc. (\"Mitobridge\"), and Mitobridge has become a wholly owned subsidiary of Astellas as of January 23, 2018 (U.S. Eastern Time).\nBy exercising the option right to acquire Mitobridge, Astellas paid $225 million 1 to acquire 100% of the equity in Mitobridge. In addition, Mitobridge shareholders will be eligible for additional payments from Astellas that total up to $225 million 2 depending on the progress of various programs in clinical development.\nThe transaction accelerates Astellas' research and development in diseases associated with mitochondrial dysfunctions and will enable the delivery of innovative new treatment options to patients. At this point, Astellas will maintain the organization in Cambridge, MA, and retain the Mitobridge name as a division of Astellas.\nAstellas is still reviewing the impact of the completion of the acquisition on its financial results for the fiscal year ending March 31, 2018.\n(1)\nAs Astellas is a shareholder in Mitobridge, the actual payment by Astellas to Mitobridge shareholders after adjustment based on the estimate of cash and cash equivalents etc. held by Mitobridge is $161.7 million. The amount is subject to further true-up based on actual numbers as of the closing date.\n(2)\nAs Astellas is a shareholder in Mitobridge, the actual payment by Astellas to Mitobridge shareholders will be $165.5 million.\nAbout Astellas\nAstellas Pharma Inc., based in Tokyo, Japan, is a company dedicated to improving the health of people around the world through the provision of innovative and reliable pharmaceutical products. We focus on Urology, Oncology, Immunology, Nephrology and Neuroscience as prioritized therapeutic areas while advancing new therapeutic areas and discovery research leveraging new technologies/modalities. We are also creating new value by combining internal capabilities and external expertise in the medical/healthcare business. Astellas is on the forefront of healthcare change to turn innovative science into value for patients. For more information, please visit our website at https://www.astellas.com/en .\nCautionary Notes\nIn this press release, statements made with respect to current plans, estimates, strategies and beliefs and other statements that are not historical facts are forward-looking statements about the future performance of Astellas. These statements are based on management's current assumptions and beliefs in light of the information currently available to it and involve known and unknown risks and uncertainties. A number of factors could cause actual results to differ materially from those discussed in the forward-looking statements. Such factors include, but are not limited to: (i) changes in general economic conditions and in laws and regulations, relating to pharmaceutical markets, (ii) currency exchange rate fluctuations, (iii) delays in new product launches, (iv) the inability of Astellas to market existing and new products effectively, (v) the inability of Astellas to continue to effectively research and develop products accepted by customers in highly competitive markets, and (vi) infringements of Astellas' intellectual property rights by third parties.\nInformation about pharmaceutical products (including products currently in development) which is included in this press release is not intended to constitute an advertisement or medical advice.\nView original content with multimedia: http://www.prnewswire.com/news-releases/astellas-completes-acquisition-of-mitobridge-inc-300586893.html\nSOURCE Astellas Pharma Inc.", "external_links": ["http://www.prnewswire.com/news-releases/astellas-completes-acquisition-of-mitobridge-inc-300586893.html", "https://www.astellas.com/en"], "published": "2018-01-24T05:00:00.000+02:00", "crawled": "2018-01-24T06:03:57.000+02:00", "highlightTitle": ""}