{"organizations": [], "uuid": "75d9b02101dd1b9501cfb3c2cea57040df1cf04a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-meredith-corporation-announces-pricing-of-senior-notes-and-allocation-of-senior-credit-facilities.html", "country": "US", "domain_rank": 767, "title": "Meredith Corporation Announces Pricing Of Senior Notes And Allocation Of Senior Credit Facilities", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T00:15:00.000+02:00", "replies_count": 0, "uuid": "75d9b02101dd1b9501cfb3c2cea57040df1cf04a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-meredith-corporation-announces-pricing-of-senior-notes-and-allocation-of-senior-credit-facilities.html", "ord_in_thread": 0, "title": "Meredith Corporation Announces Pricing Of Senior Notes And Allocation Of Senior Credit Facilities", "locations": [], "entities": {"persons": [{"name": "meredith", "sentiment": "none"}], "locations": [{"name": "iowa", "sentiment": "none"}, {"name": "des moines", "sentiment": "none"}], "organizations": [{"name": "mdp", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "meredith corporation", "sentiment": "negative"}, {"name": "meredith", "sentiment": "none"}, {"name": "time inc.", "sentiment": "none"}, {"name": "time inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DES MOINES, Iowa, Jan. 19, 2018 /PRNewswire/ -- Meredith Corporation (NYSE: MDP; www.meredith.com ) announced today that it has priced at 6.875% its offering of $1.4 billion senior unsecured notes due 2026 (the \"Notes\"). Meredith also announced that it has allocated $2.15 billion of secured credit facilities, which are expected to be comprised of a 7-year $1.8 billion term loan at an interest rate of LIBOR + 3.00% and a $350 million 5-year revolving credit facility at an initial interest rate of LIBOR + 3.00%.\nMeredith expects the Notes offering and the senior credit facilities to close on or about January 31, 2018, subject to customary closing conditions that include, among other things, the consummation of Meredith's proposed acquisition of Time Inc.\nMeredith intends to use the net proceeds of the Notes offering and the senior credit facilities to fund a portion of its proposed acquisition of Time Inc.; to repay existing Meredith and Time Inc. indebtedness and credit facilities; and to pay other fees and expenses related to Meredith's acquisition of Time Inc. and the related refinancing of Meredith's and Time Inc.'s existing debt.\nThe Notes will be offered in the United States to qualified institutional buyers that are qualified purchasers pursuant to Rule 144A under the Securities Act of 1933, as amended (the \"Securities Act\"), and outside the United States to non-U.S. persons pursuant to Regulation S under the Securities Act. The Notes will not be registered under the Securities Act or any state securities laws and, unless so registered, may not be offered or sold in the United States except pursuant to an applicable exemption from the registration requirements of the Securities Act and applicable state securities laws. This press release does not constitute an offer to sell any security and shall not constitute an offer, solicitation or sale in any jurisdiction in which such offer or sale would be unlawful.\nAdditional Information and Where to Find It\nThis press release is for informational purposes only, and it does not constitute an offer to purchase or a solicitation of an offer to sell any securities. The offer to purchase shares of Time Inc.'s common stock is being made pursuant to a Tender Offer Statement on Schedule TO, as amended, originally filed by Meredith Corporation with the SEC on December 12, 2017. Time Inc. filed a Solicitation/Recommendation Statement on Schedule 14D-9 with the SEC with respect to the tender offer on December 12, 2017. INVESTORS AND SECURITY HOLDERS ARE URGED TO READ THE TENDER OFFER MATERIALS, INCLUDING THE TENDER OFFER STATEMENT AND THE SOLICITATION/RECOMMENDATION STATEMENT REGARDING THE OFFER, AS THEY MAY BE AMENDED OR SUPPLEMENTED FROM TIME TO TIME, BECAUSE THEY CONTAIN IMPORTANT INFORMATION THAT HOLDERS OF SHARES OF TIME INC. COMMON STOCK SHOULD CONSIDER BEFORE MAKING ANY DECISION REGARDING TENDERING THEIR SHARES. Investors and security holders may obtain a free copy of these statements and other documents filed with the SEC at the website maintained by the SEC at www.sec.gov or by directing such requests to the Information Agent for the offer, which is named in the tender offer statement.\nForward-Looking Statements\nThis press release contains forward-looking statements. You can generally identify forward-looking statements by the use of forward-looking terminology such as \"anticipate,\" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"explore,\" \"evaluate,\" \"intend,\" \"may,\" \"might,\" \"plan,\" \"potential,\" \"predict,\" \"project,\" \"seek,\" \"should,\" or \"will,\" or the negative thereof or other variations thereon or comparable terminology. These forward-looking statements are only predictions and involve known and unknown risks and uncertainties, many of which are beyond Meredith's and Time Inc.'s control.\nStatements in this document regarding Meredith and Time Inc. that are forward-looking, including, without limitation, statements related to Meredith's proposed Notes offering and senior credit facilities such as anticipated closing date and anticipated use of proceeds, are based on information available to management as of the date of this release, assumptions and projections, and are subject to significant uncertainties and other factors, many of which are beyond the control of Meredith and Time Inc. Important risk factors could cause actual future results and other future events to differ materially from those currently estimated by management, including, but not limited to: the timing to consummate the proposed merger, Notes offering and senior credit facilities and the risk that the transactions may not close.\nFor more discussion of important risk factors that may materially affect Meredith and Time Inc., please see the risk factors contained in Meredith's Quarterly Report on Form 10-Q for the quarter ended September 30, 2017, and Time Inc.'s Quarterly Report on Form 10-Q for the quarter ended September 30, 2017, both of which are on file with the SEC. Except as specifically noted, information on, or accessible from, any website to which this website contains a hyperlink is not incorporated by reference into this website and does not constitute a part of this website.\nNo assurances can be given that any of the events anticipated by the forward-looking statements will transpire or occur, or if any of them do occur, what impact they will have on the results of operations, financial condition or cash flows of Meredith, purchaser or Time Inc. Neither Meredith nor Time Inc. assumes any duty to update or revise forward-looking statements, whether as a result of new information, future events or otherwise, as of any future date.\nAbout Meredith Corporation\nMeredith Corporation (NYSE: MDP; www.meredith.com ) has been committed to service journalism for 115 years. Today, Meredith uses multiple distribution platforms - including broadcast television, print, digital, mobile and video - to provide consumers with content they desire and to deliver the messages of its advertising and marketing partners.\nMeredith's Local Media Group includes 17 television stations reaching more than 11 percent of U.S. households. Meredith's portfolio is concentrated in large, fast-growing markets, with seven stations in the nation's Top 25 - including Atlanta, Phoenix, St. Louis and Portland - and 13 in Top 50 markets. Meredith's stations produce 700 hours of local news and entertainment content each week, and operate leading local digital destinations.\nMeredith's National Media Group reaches 110 million unduplicated women every month, including more than 70 percent of U.S. Millennial women. Meredith is the leader in creating and distributing content across platforms in key consumer interest areas such as food, home, parenting and lifestyle through well-known brands such as Better Homes & Gardens, Allrecipes, Parents and Shape. Meredith also features robust brand licensing activities, including more than 3,000 SKUs of branded products at 5,000 Walmart stores across the U.S. and at walmart.com . Meredith Xcelerated Marketing is an award-winning, strategic and creative agency that provides fully integrated marketing solutions for many of the world's top brands.\nMeredith's balanced portfolio consistently generates substantial free cash flow, and the Company is committed to growi", "external_links": ["http://www.prnewswire.com/news-releases/meredith-corporation-announces-pricing-of-senior-notes-and-allocation-of-senior-credit-facilities-300585435.html", "http://www.meredith.com/"], "published": "2018-01-20T00:15:00.000+02:00", "crawled": "2018-01-20T00:43:46.003+02:00", "highlightTitle": ""}