{"organizations": [], "uuid": "eb95230a16e996ac09a4b7d2e2dcdfe17eb97ca9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219452371&w=1200&r=LYNXMPEE031H6", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-costa-rica-crash/costa-rica-plane-crash-probe-could-take-months-aviation-chief-idUKKBN1ET2KU", "country": "US", "domain_rank": 408, "title": "Costa Rica plane crash probe could take months - aviation chief", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T01:56:00.000+02:00", "replies_count": 0, "uuid": "eb95230a16e996ac09a4b7d2e2dcdfe17eb97ca9"}, "author": "", "url": "https://uk.reuters.com/article/uk-costa-rica-crash/costa-rica-plane-crash-probe-could-take-months-aviation-chief-idUKKBN1ET2KU", "ord_in_thread": 0, "title": "Costa Rica plane crash probe could take months - aviation chief", "locations": [], "entities": {"persons": [{"name": "enio cubillo", "sentiment": "none"}, {"name": "enrique andres pretel", "sentiment": "none"}, {"name": "reuters/juan carlos ulate  enio cubillo", "sentiment": "none"}], "locations": [{"name": "costa rica", "sentiment": "none"}, {"name": "san jose", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "san jose", "sentiment": "none"}], "organizations": [{"name": "u.s. national transportation safety board", "sentiment": "none"}, {"name": "federal aviation administration", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "cessna", "sentiment": "none"}, {"name": "civil aviation authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 11:58 PM / Updated 5 minutes ago Costa Rica plane crash probe could take months - aviation chief Enrique Andres Pretel 3 Min Read \nSAN JOSE (Reuters) - It could take months to determine the cause of a plane crash in Costa Rica that killed 12 people because the aircraft was badly burned and lacked a flight data recorder, the director of the country’s civil aviation agency told Reuters on Thursday. Enio Cubillo, Director of the Civil Aviation Authority, speaks during an interview with Reuters about the details of the investigation into the crash that killed two pilots and 10 U.S. tourists last week, in San Jose, Costa Rica January 4, 2018. REUTERS/Juan Carlos Ulate \nEnio Cubillo also said that experts from the U.S. National Transportation Safety Board came to Costa Rica on Thursday to assist the investigation, along with staff from the Federal Aviation Administration and Cessna, which made the plane. \nHe added that experts are analysing weather conditions at the time of the crash last Sunday as well as possible mechanical failures and human error. \n“It doesn’t necessarily have to be a single cause,” he said. “This could take several months.” \nThe accident took place near the Punta Islita beach town, about 230 km (140 miles) west of the capital of San Jose. \nBecause Punta Islita’s small airfield lacks a control tower, the plane’s status at the time of the crash was unknown, Cubillo said. It was not required to carry a black box flight data recorder because it had fewer than 19 passengers. \nTen U.S. citizens and two Costa Rican pilots, both of whom were experienced fliers, died in the incident, Cubillo said. Enio Cubillo, Director of the Civil Aviation Authority, speaks during an interview with Reuters about the details of the investigation into the crash that killed two pilots and 10 U.S. tourists last week, in San Jose, Costa Rica January 4, 2018. REUTERS/Juan Carlos Ulate \nThe U.S. victims included a family of five from New York. \nCosta Rica’s accident investigation team has begun examining the remains of the Cessna 208B Grand Caravan, which crashed and ignited in a woodland roughly 1,310 feet (400 meters) from its departure point. \nRemains of the plane’s turbine will be sent to producer Pratt & Whitney in Canada for mechanical evaluations. \nA video obtained from the civil aviation agency showed twisted and charred chunks of metal that are being examined by investigators, including pieces of the turbine, tail rudder and wings. \nThe plane had passed a safety inspection about a month ago and was authorized to fly, Cubillo has previously said. Although strong winds in the morning had forced the pilots to alter their itinerary, they had flown safely to Punta Islita to pick up passengers headed to San Jose. \nCubillo added on Thursday that strong winds at the time of the crash should not have impacted the flight. \n“There were winds of some 20, 25 knots ... a speed that isn’t ideal, but that should be perfectly withstood by an aircraft of this wingspan,” he said. Writing by Daina Beth Solomon; Editing by Lisa Shumaker", "external_links": [], "published": "2018-01-05T01:56:00.000+02:00", "crawled": "2018-01-05T02:09:27.020+02:00", "highlightTitle": ""}