{"organizations": [], "uuid": "06ceae9597f40a7cd82b67dc51d64702bbfca1e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKTennisNews/", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-penpix-men/penpix-of-top-mens-contenders-at-the-australian-open-idUKKBN1F11F0", "country": "US", "domain_rank": 408, "title": "Tennis-Penpix of top men's contenders at the Australian Open", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T13:55:00.000+02:00", "replies_count": 0, "uuid": "06ceae9597f40a7cd82b67dc51d64702bbfca1e7"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-penpix-men/penpix-of-top-mens-contenders-at-the-australian-open-idUKKBN1F11F0", "ord_in_thread": 0, "title": "Tennis-Penpix of top men's contenders at the Australian Open", "locations": [], "entities": {"persons": [{"name": "tennis-penpix", "sentiment": "negative"}, {"name": "federer", "sentiment": "none"}, {"name": "andy murray", "sentiment": "none"}, {"name": "belinda bencic", "sentiment": "none"}, {"name": "rafa nadal", "sentiment": "none"}, {"name": "kei nishikori", "sentiment": "none"}, {"name": "stan wawrinka", "sentiment": "none"}, {"name": "roger federer", "sentiment": "none"}], "locations": [{"name": "melbourne park", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "open reuters", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 12:20 PM / Updated 6 hours ago Penpix of top men's contenders at the Australian Open Reuters Staff 5 Min Read \n(Reuters) - Penpix of top men’s contenders at the 2018 Australian Open, which begins at Melbourne Park on Monday. \nRoger Federer (Switzerland) \nBorn: Aug. 8, 1981 (Age 36) \nHeight: 1.85 metres \nPlays: Right-handed \nGrand slam titles: 19 (Australian Open 2004, 2006, 2007, 2010, 2017, French Open 2009, Wimbledon 2003, 2004, 2005, 2006, 2007, 2009, 2012, 2017 U.S. Open 2004, 2005, 2006, 2007, 2008) \nFederer will start as the favourite to retain his Australian Open title and is coming off an extraordinary 2017 season, which also saw him lift a record eighth title at Wimbledon. \nThe 36-year-old has made an impressive start to the campaign, winning all his four singles matches at the Hopman Cup and combining with Belinda Bencic to win Switzerland their first title since 2001. \nHis bid for a 20th career grand slam title will be aided by the absences of Andy Murray and Kei Nishikori, as well as lingering injuries to other top players in the field such as Rafa Nadal, Stan Wawrinka and Novak Djokovic. \nRafa Nadal (Spain) \nBorn: June 3, 1986 (Age 31) \nHeight: 1.85 metres \nPlays: Left-handed \nGrand slam titles: 16 (Australian Open 2009, French Open 2005, 2006, 2007, 2008, 2010, 2011, 2012, 2013, 2014, 2017, Wimbledon 2008, 2010, U.S. Open 2010, 2013, 2017) \nThe Spaniard enjoyed a stellar 2017, winning grand slams at Roland Garros and Flushing Meadows and reclaiming the world number one ranking. \nHe returns to Melbourne, where he lost a thrilling five-set final to Roger Federer last year, hoping to continue the progress he made in 2017 under coach Carlos Moya, after his uncle and lifelong mentor Toni Nadal decided to step down at the end of last season. \nNadal’s preparations for the first grand slam of the year have been far from ideal, having not featured in a competitive match since he withdrew from the World Tour Finals in November with a knee injury. \nNovak Djokovic (Serbia) \nBorn: May 22, 1987 (Age 30) \nHeight: 1.88 metres \nPlays: Right-handed \nGrand slam titles: 12 (Australian Open 2008, 2011, 2012, 2013, 2015, 2016, French Open 2016, Wimbledon 2011, 2014, 2015, U.S. Open 2011, 2015) \nAfter an extended spell on the sidelines with an elbow injury, Djokovic returned with a convincing victory over Dominic Thiem at the Kooyong Classic exhibition event earlier this week. \nThe 12-times grand slam winner is hoping to get back to his best after a forgettable 2017, which included an early exit at the Australian Open and a quarter-final demise at Roland Garros before his season ended in the last eight at Wimbledon in July due to an injury. \nDjokovic, who is currently tied with Roy Emerson as the most successful men’s singles champions at Melbourne, will launch his bid for an outright record seventh title against American Donald Young in the first round. \nStan Wawrinka (Switzerland) \nBorn: March 28, 1985 (Age 32) \nHeight: 1.83 metres \nPlays: Right-handed \nGrand slam titles: 3 (Australian Open 2014, French Open 2015, U.S. Open 2016) \nThe 2014 Australian Open champion is coming off knee surgery and was forced to withdraw from the Tiebreak Tens exhibition event earlier this week with a shoulder injury. \nWawrinka, a three-times grand slam winner, made the final four in Melbourne last year before losing to eventual champion Roger Federer in a five-set showdown. \nHe became the oldest man to reach the Roland Garros final last year at the age of 32 on the back of a few sublime displays of attacking tennis but lost the final to Rafa Nadal in straight sets. \nGrigor Dimitrov (Bulgaria) \nBorn: May 16, 1991 (Age 26) \nHeight: 1.91 metres \nPlays: Right-handed \nGrand slam titles: 0 \nThe Bulgarian returns to Melbourne as one of the in-form players on tour, having enjoyed a pivotal moment in his career when he lifted the ATP Finals trophy at the end of last season. \nThe world number three started the new year with a semi-final appearance in Brisbane where he was beaten by eventual champion Nick Kyrgios. \nIt remains to be seen if Dimitrov can improve on his run to the semi-finals in Melbourne last year as he continues to chase his maiden grand slam title. \nAlexander Zverev (Germany) \nBorn: April 20, 1997 (age 20) \nHeight: 1.98 metres \nPlays: Right-handed \nGrand slam titles: 0 \nZverev is just 20 but with victories over the “Big Four” and five titles on tour last season, a grand slam win seems a possible next step for the German wonderkid. \nHis top-10 breakthrough came in Rome, where he defeated Novak Djokovic in the final to become the youngest Masters 1000 winner since Djokovic himself won in Miami when 19. \nHe also became the youngest qualifier at the season-ending ATP Finals since the former U.S. Open winner Juan Martin del Potro in 2008. \nZverev’s all-round game makes him a threat at Melbourne next week but he will be tested in the latter stages of the tournament due to his relative inexperience in best-of-five set tennis. Compiled by Hardik Vyas in Bengaluru; Editing by Toby Davis", "external_links": [], "published": "2018-01-12T13:55:00.000+02:00", "crawled": "2018-01-12T14:28:56.013+02:00", "highlightTitle": ""}