{"organizations": [], "uuid": "81477661e65f6cc287611a3bfd8c006a736c78da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/03/104445897-RTS150B4.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/10/bond-guru-bill-gross-signals-end-of-bull-era-for-treasury-markets.html", "country": "US", "domain_rank": 767, "title": "Bond guru Bill Gross signals end of bull era for Treasury markets", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T11:11:00.000+02:00", "replies_count": 0, "uuid": "81477661e65f6cc287611a3bfd8c006a736c78da"}, "author": "Natasha Turak", "url": "https://www.cnbc.com/2018/01/10/bond-guru-bill-gross-signals-end-of-bull-era-for-treasury-markets.html", "ord_in_thread": 0, "title": "Bond guru Bill Gross signals end of bull era for Treasury markets", "locations": [], "entities": {"persons": [{"name": "bill gross", "sentiment": "positive"}], "locations": [], "organizations": [{"name": "treasury", "sentiment": "positive"}, {"name": "janus henderson group", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The bond bear market is finally upon us after more than 25 years, bond guru Bill Gross said Tuesday.\nThought to be triggered by the Bank of Japan's tapering of bond purchases, his claim is making waves in the investment community and coincides with central banks increasingly moving away from global bond markets.\nThe call was released in a tweet from the account of Janus Henderson Group, Gross's investment firm, saying: \"Bond bear market confirmed today. 25 year long-term trendlines broken in 5 (year) and 10 (year) maturity Treasuries.\"\nTweet1 \nThe benchmark 10-year U.S. Treasury yield rose to its highest level since March Tuesday, surpassing 2.55 percent as an incipient bond sell-off gathers pace. It was trading close to 2.5788 percent on Wednesday afternoon.\nGross's sentiment is not universally shared, however, with many investors warning it's too early to call an end to the near three-decade bull run for bonds. Others still suggest that climbing yields might actually help stocks.\nDouble Line Capital CEO Jeffrey Gundlach didn't join Gross's claim on the timing of the bear market, but signaled it's on the horizon, predicting on Twitter that a rise above 3.22 percent on the 30-year Treasury yield \"would end the bond bull market for good.\"\nThe 30-year Treasury yield hovered around 2.9225 Wednesday afternoon, representing a steady upward climb from its historic low of 2.11 percent in July 2016, according to Trading Economics. Bond yields move inversely to prices. \nThe billionaire bond investor also said it would be a \"big deal\" if 10-year yields rise above 2.63 percent. Gundlach said the Federal Reserve's tightening would leave the S&P 500 in negative territory for 2018.\nBond yields have been falling for decades. To give you an idea, the average yield on a 10-year Treasury bond in 1981 was higher than 15%. The downward trend had continued reliably since then, which explains why many investors are alarmed at the prospect of a change in course.\nNow, as bond supply rises across all major markets and the main buyers of bonds — central banks — pull back from quantitative easing and set in on rate hikes, investors like Gross and Gundlach are confidently calling an end to the bull run.\nStill, others in the bond world don't see cause for concern. Legendary bond investor Bill Miller told   rising yields will give a further boost to stocks, which have been hitting record highs for the past year.\n\"Those 10-year yields go through 2.6 percent and head towards 3 percent, I think we could have the kind of melt-up we had in 2013, where we had the market go up 30 percent,\" Miller told CNBC's \" Closing Bell \". \"If we can get the 10-year towards that 3 percent level, you'll see the same thing.\"", "external_links": [], "published": "2018-01-10T11:11:00.000+02:00", "crawled": "2018-01-10T12:56:59.034+02:00", "highlightTitle": ""}