{"organizations": [], "uuid": "eb58c7ead5214c1bec55c4c7688b97678947b72b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 12}, "facebook": {"likes": 26, "shares": 26, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180117.html", "section_title": "Archive News &amp; Video for Wednesday, 17 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-nepal-climatechange-agriculture/award-winning-nepalese-farmers-grow-bananas-to-avert-floods-idUSKBN1F60LD", "country": "US", "domain_rank": 408, "title": "Award-winning Nepalese farmers grow bananas to avert floods", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-17T14:42:00.000+02:00", "replies_count": 0, "uuid": "eb58c7ead5214c1bec55c4c7688b97678947b72b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-nepal-climatechange-agriculture/award-winning-nepalese-farmers-grow-bananas-to-avert-floods-idUSKBN1F60LD", "ord_in_thread": 0, "title": "Award-winning Nepalese farmers grow bananas to avert floods", "locations": [], "entities": {"persons": [{"name": "bhoj raj paudel", "sentiment": "negative"}, {"name": "simpalpani", "sentiment": "none"}], "locations": [{"name": "kathmandu", "sentiment": "none"}, {"name": "simalpani", "sentiment": "none"}, {"name": "himalayas", "sentiment": "none"}, {"name": "kathmandu", "sentiment": "none"}, {"name": "nepal", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KATHMANDU (Thomson Reuters Foundation) - Nepali farmer Bhoj Raj Paudel had just left home to visit his parents when a hill above it collapsed, destroying his ranch and a paddy field and flooding a swathe of land downstream.\nThe landslide was 19 years ago, but he remembers it vividly.\n“I am happy my family survived but whatever I owned was gone forever,” the 53-year-old father of three told the Thomson Reuters Foundation from Simalpani, a small town on the foothills of the Himalayas some 200 km (130 miles) west of Kathmandu.\nSimpalpani and neighboring villages - which sit on a geological faultline - have been struck by 16 massive landslides over the last 50 years, aid workers said.\nRising global temperatures have shrunk Nepal’s glaciers, with meltwater forming lakes that flood regularly, causing widespread destruction.\nBut farmers clearing forests for agriculture are also to blame, experts say. About 80 percent of Nepal’s 28 million people rely on agriculture for their living, many using destructive traditional slash and burn techniques.\nFor decades, villagers walked into the forests and indiscriminately cut trees for cooking, heating and fodder.\n“An intervention was urgently needed to stop this and save resources vital to the livelihood of the people,” said Dhruba Gautam, executive director of the National Disaster Risk Reduction Centre Nepal.\nSince 2010, the charity has been teaching 14,000 families in 28 villages in the Banganga basin, a river of religious significance for Hindus in Nepal and home to an important wetland, to change their farming habits.\nFarmers have persuaded each other to adopt practices that protect forests, soil, rivers and wetlands, as well as earning a better living.\nMapping data shows that slash and burn farming in the area has fallen by 80 percent since the project began, Gautam said.\nIt won the Solution Search award for innovative conservation in November, and $30,000 to scale up the project, which Brett Jenks, president of Rare, the U.S.-based charity behind the prize, said could be “accessible for other communities”.\nEARNING MORE Women are on the frontline of the campaign to persuade farmers to adopt soil-friendly crops like legumes, bananas and pineapples, whose roots help control erosion on slopes.\nSita Khanal, a housewife in Thada village, 10 km west of Simalpani, heads a team of a dozen villagers tasked with persuading their neighbors to abandon their destructive practices and use forest products without depleting them.\nOnly unwanted, fallen or overgrown trees are cleared.\n“The villagers were initially hesitant to abandon old approaches but they embraced the changes,” she said, adding that they earn more from the new crops.\nLocals have also been trained to monitor rainfall and temperatures, with villagers upstream warning those downstream of impending floods by text message.\n“We have seen how disasters have gone down since we changed old farming practices that caused them,” said Jum Bahadur Magar, 40, a farmer in Thada.\nAid agencies and the government have provided fuel-efficient cooking stoves, biogas plants and solar panels to reduce the felling of trees.\n“It was very difficult,” said Indrakala Gharti, a 42-year-old farmer in Thada.\n“But now we are happy. We have enough to feed the family, and can sell the excess to help with our kids’ schooling.”\nAdditional reporting By Bishal Pokhrel in Jagadishpur, Editing by Katy Migiro and Thin Lei Win. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, corruption and climate change. Visit www.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T14:42:00.000+02:00", "crawled": "2018-01-18T15:58:35.015+02:00", "highlightTitle": ""}