{"organizations": [], "uuid": "66dcf5a242b98605e194236add7d081d9068a3ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224554307&w=1200&r=LYNXMPEE0M1M7", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-awards-oscars-nominations-snubs/wonder-woman-stumbles-get-out-surprises-at-oscar-nominations-idUSKBN1FC2M0", "country": "US", "domain_rank": 408, "title": "'Wonder Woman' stumbles, 'Get Out' surprises at Oscar nominations", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T20:25:00.000+02:00", "replies_count": 0, "uuid": "66dcf5a242b98605e194236add7d081d9068a3ff"}, "author": "", "url": "https://www.reuters.com/article/us-awards-oscars-nominations-snubs/wonder-woman-stumbles-get-out-surprises-at-oscar-nominations-idUSKBN1FC2M0", "ord_in_thread": 0, "title": "'Wonder Woman' stumbles, 'Get Out' surprises at Oscar nominations", "locations": [], "entities": {"persons": [{"name": "piya sin", "sentiment": "negative"}, {"name": "patty jenkins", "sentiment": "none"}, {"name": "jenkins", "sentiment": "none"}, {"name": "jill serjeant", "sentiment": "none"}, {"name": "gal gadot", "sentiment": "none"}, {"name": "guillermo del toro", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}], "organizations": [{"name": "hollywood", "sentiment": "none"}, {"name": "min read  los angeles", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "warner bros.", "sentiment": "none"}, {"name": "academy of motion picture arts and sciences", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 6:31 PM / in a few seconds 'Wonder Woman' stumbles, 'Get Out' surprises at Oscar nominations Piya Sinha-Roy , Jill Serjeant 6 Min Read \nLOS ANGELES (Reuters) - “Wonder Woman” failed to conquer Oscar voters on Tuesday despite riding to one of the biggest box office hits of 2017 on a wave of female empowerment, making it one of the biggest snubs for Hollywood’s highest honors. \nThe Warner Bros. movie, featuring Gal Gadot as the sword-wielding Wonder Woman, was the first stand-alone female superhero film since 2005 and earned some $825 million globally, making its filmmaker Patty Jenkins, 46, the highest-grossing female director in Hollywood. \nBut at Tuesday’s Oscar nominations, Jenkins was left off the director’s race and the film was snubbed in the best picture category, despite nods for other movies about women and made by women. \nInstead, it was Guillermo del Toro’s surreal fantasy romance “The Shape of Water” that led the Oscar nominations with 13 nods. \nSpeaking to Reuters, del Toro said that despite the omission of “Wonder Woman” at the Oscars, the impact of the film was “undeniable.” \n“Not only did (‘Wonder Woman’) break this archaic notion that this grand superhero-sized myth was done for ‘the boys,’ but it delivered it at a level of excellency that is a high watermark,” the filmmaker said. \nThe Academy of Motion Picture Arts and Sciences has traditionally disdained big action and superhero movies in favor of smaller art-house fare, like last year’s Oscar champion “Moonlight” and this year’s dark comedy “Three Billboards Outside Ebbing, Missouri,” which landed seven nods. \nSince 1990, only the 2003 fantasy epic “Lord of the Rings; The Return of the King” snapped that trend to win the top Oscar honor. Sci-fi movie “Avatar,” still the biggest box office movie of all time, received a best picture nomination in 2010 but lost out to “The Hurt Locker.” \nSUCCESS FOR ‘GET OUT’ \nThis year’s surprises include four nominations - including best picture, and best actor for Daniel Kaluuya - for Jordan Peele’s “Get Out,” in which an African-American man finds himself trapped at his white girlfriend’s house with her strange family. 23rd Critics’ Choice Awards – Show – Santa Monica, California, U.S., 11/01/2018 – Director Jordan Peele accepts the award for Best Sci-Fi Film for \"Get Out.\" REUTERS/Mario Anzuoni \nThe $5 million horror movie from Universal Pictures became a box office success with more than $250 million globally and became a talking point around modern day race relations in America. See interactive graphic tmsnrt.rs/2E1pwi3 \n“I think that there’s a piece of the black experience that is communicated in the film and through Daniel’s performance that people of color recognize and haven’t seen and that people not of color needed to see as well,” Peele told Reuters. \nVeteran actor Christopher Plummer, 88, was also a surprise contender in the supporting actor race for Sony Pictures’ Getty kidnapping film “All the Money in the World.” Plummer boarded the movie a month before its release, replacing actor Kevin Spacey because of sexual misconduct allegations. \nPlummer stepped in after Spacey was accused of sexual misconduct by multiple men. Spacey issued an apology for the first reported incident, involving actor Anthony Rapp. \n“Everything has happened so quickly of late that I am still a trifled stunned but excited by it all,” Plummer said in a written statement of his nomination. \nJames Franco was excluded from the best actor race for “The Disaster Artist” after facing accusations of sexual misconduct earlier this month following his Golden Globe win. \nFranco said the accusations were “not accurate.” He lost out on Sunday at the Screen Actors Guild awards to Gary Oldman for “Darkest Hour.” \nOther snubs included Steven Spielberg in the directing race for press freedom movie “The Post,” and its star Tom Hanks. “Mudbound” was left out of best picture and its filmmaker, Dee Rees, was also excluded from the directing race, but she landed a nod for adapted screenplay. \nGerman film “In The Fade,” which won the Golden Globe for best foreign language film and received praise for its lead star Diane Kruger, was left out of the Oscar foreign language race. \nGRAPHIC-Best box office performance interactive {\"messageType\":\"graphics:graphic:1\",\"title\":\"Best box office performance interactive\",\"contentType\":\"text/html\",\"shortUrl\":\"http://tmsnrt.rs/2E1pwi3\",\"url\":\"//fingfx.thomsonreuters.com/gfx/rngs/AWARDS-OSCARS-NOMINATIONS/010060M212M/index.html\",\"rsf\":\"<assert qcode=\\\"GXID:010060M212M\\\"><copyrightHolder literal=\\\"Thomson Reuters\\\"/><copyrightNotice xml:lang=\\\"en\\\">(c) Copyright Thomson Reuters 2018. Click For Restrictions - here </copyrightNotice></rightsInfo><itemClass qcode=\\\"ninat:graphic\\\" />Best box office performance interactive</headline><description role=\\\"descRole:caption\\\">2018 Oscar nominees for best picture box office performance</description><infoSource literal=\\\"Reuters\\\" role=\\\"cRole:source\\\"/><creator literal=\\\"Reuters\\\"/>Christine Chan</by>Reuters</creditline><altId type=\\\"idType:GXID\\\" rtr:isOriginal=\\\"1\\\">010060M212M</altId><remoteContent id=\\\"gfx010060M212M1\\\" contenttype=\\\"text/html\\\" format=\\\"fmt:HTML5\\\" rendition=\\\"rend:baseImage\\\" hascontent=\\\"false\\\" href=\\\"//fingfx.thomsonreuters.com/gfx/rngs/AWARDS-OSCARS-NOMINATIONS/010060M212M/index.html\\\"><altLoc type=\\\"locType:http\\\" role=\\\"locRole:shortUrl\\\"> tmsnrt.rs/2E1pwi3 </altLoc><remoteContentExtProperty rel=\\\"extCptRel:hasUrlScope\\\" qcode=\\\"urlScope:public\\\"/><remoteContentExtProperty rel=\\\"extCptRel:isHostedOn\\\" qcode=\\\"sys:CDN\\\"/></remoteContent></contentSet></assert>\",\"qcode\":\"GXID:010060M212M\"} Reporting by Jill Serjeant; Editing by Andrew Hay and Frances Kerry", "external_links": [], "published": "2018-01-23T20:25:00.000+02:00", "crawled": "2018-01-23T20:43:35.006+02:00", "highlightTitle": ""}