{"organizations": [], "uuid": "ec39514b737ccca0fbf87de1dda1b816e1e6c1fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 3}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 940, "shares": 940, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/05/104930304-RTX4567Q.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/09/i-am-confident-in-everything-that-is-in-this-book-says-fire-and-fury-author-michael-wolff.html", "country": "US", "domain_rank": 767, "title": "I am confident in everything that is in this book, says 'Fire and Fury' author Michael Wolff", "performance_score": 9, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T15:09:00.000+02:00", "replies_count": 0, "uuid": "ec39514b737ccca0fbf87de1dda1b816e1e6c1fb"}, "author": "Jacob Pramuk", "url": "https://www.cnbc.com/2018/01/09/i-am-confident-in-everything-that-is-in-this-book-says-fire-and-fury-author-michael-wolff.html", "ord_in_thread": 0, "title": "I am confident in everything that is in this book, says 'Fire and Fury' author Michael Wolff", "locations": [], "entities": {"persons": [{"name": "michael wolff", "sentiment": "positive"}, {"name": "donald trump", "sentiment": "positive"}, {"name": "trump", "sentiment": "none"}], "locations": [], "organizations": [{"name": "white house", "sentiment": "positive"}, {"name": "trump white house", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "People around President Donald Trump think that if the Russia investigation touches the president's finances, it could take him down, the author of an explosive tell-all book told CNBC on Tuesday.\nMichael Wolff, author of \"Fire and Fury: Inside the Trump White House,\" said administration officials and Trump confidantes he spoke to do not think the president colluded with Moscow to win the 2016 election. However, they think if special counsel Robert Mueller looks into Trump's finances, it could be perilous for the president, Wolff claimed.\n\"People don't think in the White House — don't think that he colluded with Russia. … They do think that if the investigation goes near his finances, he's sunk. Everybody, again, to a man,\" Wolff said in a \"Squawk Box\" interview.\nThe president has repeatedly denied any cooperation with Moscow as an investigation into Russian efforts to influence the 2016 election continues. Last year, Trump told The New York Times that a Mueller probe of his finances as part of the investigation would cross a red line.\nshow chapters 'Fire and Fury' author Michael Wolff: I don't know if Trump colluded with Russia 1 Hour Ago | 02:19 Trump's legal team and a White House spokeswoman did not immediately respond to requests to comment.\nWolff's book, released on Friday, sent shockwaves through the Trump administration with fiery Quote: s about the Trump family and numerous claims about the president's intelligence and competence . Trump has called the book \"untruthful\" and Wolff a \"total loser,\" while some reporters have called out apparent factual inaccuracies .\nTrump tweet\nWolff defended against criticism of its content on Tuesday, calling the project \"really solid.\"\n\"I am confident in everything that is in this book,\" he said.\nWolff said he has recordings to back up Quote: s in the book, including some that were disputed. He added that, \"people who are denying they spoke to me, I do have them on tape, but I made a deal with them there.\"\nWATCH: 'Fire and Fury' author Michael Wolff vehemently defends controversial Trump book show chapters 'Fire and Fury' author Michael Wolff vehemently defends controversial Trump book 7 Hours Ago | 23:00", "external_links": [], "published": "2018-01-09T15:09:00.000+02:00", "crawled": "2018-01-09T15:20:43.034+02:00", "highlightTitle": ""}