{"organizations": [], "uuid": "a56d2d2f17cce9215387c90dd5d28155bbcafb5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219394652&w=1200&r=LYNXMPEE031AV", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-climatechange-corals/corals-at-risk-as-underwater-heat-waves-strike-more-often-idUSKBN1ET27K", "country": "US", "domain_rank": 408, "title": "Corals at risk as underwater heat waves strike more often", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.06, "site_type": "news", "published": "2018-01-05T03:02:00.000+02:00", "replies_count": 0, "uuid": "a56d2d2f17cce9215387c90dd5d28155bbcafb5f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-climatechange-corals/corals-at-risk-as-underwater-heat-waves-strike-more-often-idUSKBN1ET27K", "ord_in_thread": 0, "title": "Corals at risk as underwater heat waves strike more often", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "oslo", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OSLO (Reuters) - High ocean temperatures are harming tropical corals almost five times more often than in the 1980s, undermining reefs’ ability to survive marine heat waves caused by man-made climate change, scientists said on Thursday.\nThe average time between severe “bleachings”, when heat makes the stony-bodied creatures that make up coral reefs expel colorful algae, shortened to six years in 2016 from 25-30 years in the early 1980s, the Australian-led team wrote.\nCorals die if bleachings are long-lasting, wrecking reefs that are nurseries for fish, a source of food to millions of people and a destination for scuba-diving tourists.\n“Tropical reef systems are transitioning to a new era in which the interval between recurrent bouts of coral bleaching is too short for a full recovery” of mature corals that can require 10-15 years, the researchers wrote in the journal Science.\nClimate change will “inevitably” make underwater heat waves and bleachings more frequent, they wrote.\nThe worst bleaching was in 2015-16, when record ocean temperatures affected 75 percent of 100 reefs studied from Australia’s Great Barrier Reef to the Caribbean.\nLead author Professor Terry Hughes, director of the ARC Centre of Excellence for Coral Reef Studies in Australia, urged more action to limit greenhouse gas emissions under the global 2015 Paris climate agreement.\nFILE PHOTO: Peter Gash, owner and manager of the Lady Elliot Island Eco Resort, snorkels during an inspection of the reef's condition in an area called the 'Coral Gardens' located at Lady Elliot Island and north-east from the town of Bundaberg in Queensland, Australia, June 11, 2015. REUTERS/David Gray/File Photo The main problem for protecting reefs was “weak commitments for reductions in emissions from individual countries like Australia and the U.S.,” he told Reuters in an e-mail.\nU.S. President Donald Trump, who doubts climate change is man-made, plans to pull out of the Paris accord and instead promote U.S. fossil fuels. Australia’s goals under the Paris accord are less ambitious than those of some other rich nations.\nThe Paris pact seeks to limit a rise in average global surface temperatures to “well below” two degrees Celsius (3.6 Fahrenheit) above pre-industrial times, ideally 1.5C (2.7F) by shifting from fossil fuels.\nFILE PHOTO: Tourists snorkel in an area called the 'Coral Gardens' at Lady Elliot Island, located north-east from the town of Bundaberg in Queensland, Australia, June 11, 2015. REUTERS/David Gray/File Photo Corals are already under threat with warming of 1C (1.8F) so far, a U.N. panel of climate scientists says.\nIn the 1980s, bleachings happened during local heat waves, and then started to occur in the 1980s and 1990s during natural El Nino weather events that release heat from the Pacific Ocean.\n“Now we’re seeing the emergence of bleaching in every hot summer,” said Mark Eakin, an author of the study at the U.S. National Oceanic & Atmospheric Administration, said in a statement.\nHughes said there was evidence that some corals could adapt to rising temperatures. The Great Barrier Reef, the world’s biggest, was not doomed if governments stepped up action.\n“If the ... Paris Agreement is successful we will still have a Great Barrier Reef. It will have a different mix of coral species, but it will still function and look like a reef,” he said.\nStudy available at: here ; Reporting By Alister Doyle, Editing by William Maclean\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://science.sciencemag.org/content/359/6371/80"], "published": "2018-01-05T03:02:00.000+02:00", "crawled": "2018-01-04T21:11:56.004+02:00", "highlightTitle": ""}