{"organizations": [], "uuid": "542c52351649e11faaa7a581ff30c8c61b1aaaad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221501596&w=1200&r=LYNXMPEE0B1BH", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-pickens-fund-closing/legendary-investor-boone-pickens-closes-energy-hedge-fund-amid-setbacks-idUSKBN1F125L", "country": "US", "domain_rank": 408, "title": "Legendary investor Boone Pickens closes energy hedge fund amid setbacks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T19:09:00.000+02:00", "replies_count": 0, "uuid": "542c52351649e11faaa7a581ff30c8c61b1aaaad"}, "author": "", "url": "https://www.reuters.com/article/us-pickens-fund-closing/legendary-investor-boone-pickens-closes-energy-hedge-fund-amid-setbacks-idUSKBN1F125L", "ord_in_thread": 0, "title": "Legendary investor Boone Pickens closes energy hedge fund amid setbacks", "locations": [], "entities": {"persons": [{"name": "boone pickens", "sentiment": "negative"}, {"name": "pickens", "sentiment": "none"}, {"name": "t. boone pickens", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "phillips petroleum co", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "unocal corp", "sentiment": "none"}, {"name": "gulf oil corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 5:11 PM / Updated an hour ago Legendary U.S. investor Boone Pickens closes energy hedge fund after setbacks Jessica Resnick-Ault , Gary McWilliams 4 Min Read \nHOUSTON (Reuters) - Legendary investor T. Boone Pickens said on Friday he had closed his Dallas-based energy hedge fund after health and financial upsets, the latest oil-focused fund to report setbacks. \nPickens, 89, said in a letter posted online that he planned to focus on his health and entrepreneurship, philanthropic and political activities. He is still recovering from a serious fall last summer and suffered a series of strokes in late 2016. \n“Trading oil is not as intriguing to me as it once was,” he wrote. “It’s no secret the past year has not been good to me, from a health perspective or a financial one.” \nPickens’ fund, which he formed in 1996, struggled with its oil bets and assets fell well below a peak of $2 billion in 2007, said Jay Rosser, vice president at BP Capital. The fund, which lost money in two of the last three years, had about 125 investors prior to its closing, he added. \nSeveral major commodities funds also lost money on oil wagers or shut in recent years. Last year, funds that bet on an oil-price recovery were hit as crude in June fell to $42.05, the low for the year. \nOil trader Andy Hall last year closed his main Astenbeck Capital Management fund after betting oil would more quickly pull out of a rout that started in late 2014. Pierre Andurand’s Andurand Commodities Fund lost 4.47 percent in 2017, according to data from HSBC, while Merchant Commodity Fund fell 11.6 percent last year and is down 0.4 percent so far in 2018. \nIn 1956, Pickens founded an oil production company that became Mesa Petroleum and ran it for nearly 40 years. \nPickens gained notoriety and celebrity in the 1980s as a dealmaker who launched leveraged buyouts of oil companies including Phillips Petroleum Co, Gulf Oil Corp and Unocal Corp. Even though many did not succeed, he and his investors made substantial money from the sale of stock of his targets. \nThat willingness to sell his shares back to the company at a premium, a practice known as “greenmail,” led to accusations he was not interested in improving or running the companies he challenged. Pickens always denied that. \nA decade ago, he unveiled his “Pickens Plan,” a lobbying effort to wean the United States from the Organization of the Petroleum Exporting Countries (OPEC) by championing the use of alternative energy and natural gas. He spent in excess of $100 million to promote the effort, a spokesman said. \nBrian Bradshaw and David Meaney, executives of the shuttered Pickens hedge fund, BP Capital, have started their own hedge fund, Assert Capital Management LP. \nTheir energy commodities fund will start operations next week with about $25 million, mostly from past BP Capital investors. It plans to raise another $200 million this summer, Meaney said in an interview on Friday. \nPickens remains involved in his charitable foundation and on the board of Clean Energy Fuels Corp ( CLNE.O ), which operates natural gas refueling stations. \nTwo of Pickens’ investment vehicles, private equity funds BP Energy Partners and mutual funds manager BP Capital Fund Advisors, remain in operation. Reporting by Jessica Resnick-Ault and Gary McWilliams; Editing by Richard Chang", "external_links": [], "published": "2018-01-12T19:09:00.000+02:00", "crawled": "2018-01-12T19:27:33.005+02:00", "highlightTitle": ""}