{"organizations": [], "uuid": "0e7337c6e5e332dd6e464fd6d2b173d14be21004", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226382320&w=1200&r=LYNXMPEE0S1GI", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-italy-election/italian-federation-fails-to-elect-a-new-president-idUKKBN1FI2GC", "country": "US", "domain_rank": 408, "title": "Italian federation fails to elect a new president", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T21:13:00.000+02:00", "replies_count": 0, "uuid": "0e7337c6e5e332dd6e464fd6d2b173d14be21004"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-italy-election/italian-federation-fails-to-elect-a-new-president-idUKKBN1FI2GC", "ord_in_thread": 0, "title": "Italian federation fails to elect a new president", "locations": [], "entities": {"persons": [{"name": "carlo tavecchio", "sentiment": "none"}, {"name": "lega pro", "sentiment": "none"}, {"name": "gabriele gravina", "sentiment": "none"}, {"name": "damiano tommasi", "sentiment": "none"}, {"name": "cosimo sibilia", "sentiment": "none"}], "locations": [{"name": "rome", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "figc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 7:14 PM / Updated 12 minutes ago Italian federation fails to elect a new president Reuters Staff 3 Min Read \nROME (Reuters) - The Italian football federation (FIGC) failed to elect a new president on Monday to replace Carlo Tavecchio, who resigned in November following the national side’s failure to qualify for this year’s World Cup. \nAfter four rounds of voting and an assembly which lasted seven hours, none of the three candidates were able to muster the 50 percent plus one votes necessary to win. \n“Nobody elected,” the FIGC said on Twitter. \nItalian media said the next step would be for the Italian Olympic Committee to appoint a commissioner. \nIt was another embarrassment for Italian football which, in addition to World Cup qualifying failure, has seen Serie A become a poor relation to the booming English and Spanish leagues over the last few years. \nThe three candidates were Damiano Tommasi, head of the Italian players’ association, Gabriele Gravina, head of the third tier Lega Pro, and Cosimo Sibilia, head of the amateur leagues (LND). \nThe candidates needed three quarters of the vote to be elected in the first round, two thirds in the second round or over half from the third round onwards. \nVoting rights are split between delegates representing Serie A, Serie B, Lega Pro, LND, the players’ association, the coaches’ association and the referees. \nHowever, under the complex electoral system, each group has a different number of delegates with 90 representing the LND and only 20 for the elite Serie A. Former Italian Football Federation President (FIGC) Carlo Tavecchio arrives at an election for the Italian Football Federation(FIGC) presidency in Rome Italy, January 29, 2018. REUTERS/Alessandro Bianchi NO AGREEMENT \nSibilia edged Gravina in the first three rounds of voting while Tommasi was eliminated after finishing last three times. \nHowever, it became clear that neither Sibilia nor Gravina would win after the players said they would spoil their ballot papers in the fourth round. Slideshow (3 Images) \nSibilia then tried to reach an agreement with Gravina ahead of the fourth round before also telling his supporters to spoil their papers. \n“We don’t have the right conditions to carry on, so I ask the representatives of the amateur leagues to leave their voting papers blank,” he said. \n“We made every attempt to reach an agreement which would have been with Gravina as president.” \nGravina said it was not his fault there was no agreement. “First and foremost, we need to apologise to all Italians,” he added. \nNapoli president Aurelio De Laurentiis said it was a predictable outcome. \n“It was a waste of time, as I predicted,” he said. “I knew it would finish like this.” Reporting by Brian Homewood; Editing by Ken Ferris", "external_links": [], "published": "2018-01-29T21:13:00.000+02:00", "crawled": "2018-01-29T21:32:55.000+02:00", "highlightTitle": ""}