{"organizations": [], "uuid": "3c0c662d61adb58f7535551ea8364dfeb99ba065", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-skat-canada/canada-set-for-multi-pronged-assault-in-pyeongchang-idUKKBN1F41MU", "country": "US", "domain_rank": 408, "title": "Canada set for multi-pronged assault in Pyeongchang", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T15:04:00.000+02:00", "replies_count": 0, "uuid": "3c0c662d61adb58f7535551ea8364dfeb99ba065"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-skat-canada/canada-set-for-multi-pronged-assault-in-pyeongchang-idUKKBN1F41MU", "ord_in_thread": 0, "title": "Canada set for multi-pronged assault in Pyeongchang", "locations": [], "entities": {"persons": [{"name": "denny morrison", "sentiment": "none"}, {"name": "bart schouten", "sentiment": "none"}, {"name": "schouten", "sentiment": "none"}, {"name": "ang simon jennings", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "pyeongch", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "calgary", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 1:05 PM / Updated 12 minutes ago Canada set for multi-pronged assault in Pyeongchang Simon Jennings 3 Min Read \nLONDON (Reuters) - Canada’s speed skating team for the Winter Olympics in South Korea is much stronger than four years ago and will offer medal threats in multiple distances, according to the country’s Dutch coach Bart Schouten. \nCanada won only two medals at the Sochi Games in 2014, with Denny Morrison taking silver in the men’s 1,000 metres and bronze in the 1,500, but the intervening years have seen the team step up a level in terms of performance. \n”We have multiple medal threats in multiple distances and that is one of the goals we had as Canada,“ Schouten told Reuters from his training base in Calgary. ”We just didn’t want to be dependent on, like in Sochi, one skater doing well. \n”We really had to go as a team to try to increase our level in all the distances and to have multiple people be in a position to win a medal at the Games. \n“I think we’ve really succeeded at that.” \nCanada is the only country that could potentially deny the Dutch men a gold medal in the longer distances they have traditionally dominated. \nTed-Jan Bloemen, the current world record holder in the men’s 10,000 and 5,000, is Canada’s strongest medal prospect and Dutchman Sven Kramer’s closest rival for gold at the Games. \nBloeman, who has dual Canadian-Dutch citizenship, was raised in the Netherlands but after failing to nail down a regular place in a commercial team in that country, opted to race for Canada in 2014. \n”He gave me a call and asked if he could skate for Canada,“ Schouten said. ”We felt it was a great opportunity for us to see if we could strengthen our long distance programme. \n”He was welcomed by all the other skaters on the team. They could have seen him as a competitor, but they really felt he could make everybody stronger, which he did. \n”Since then he’s steadily progressed in a stable situation where he felt at home and welcomed. \n“I think he improved technically and tactically, got stronger physically, and as a result his performances have been getting better and better.” DEEP TALENT POOL \nThe popularity of ice hockey in Canada and a network of speed skating clubs means the country has a healthy pool of skaters to chose from. \nMorrison and Bloemen are the senior members of the team at 32 and 31 respectively, while Vincent De Haitre is one of the youngest members in the squad at 23. \n“Vincent de Haitre is a possible medallist in the 1,000 and the 1,500,” Schouten said. \n“And I think we have a good chance in the 500 with two skaters that won gold medals in the World Cups this year, Alex Boisvert-Lacroix and Laurent Dubreuil.” \nIvanie Blondin will challenge for medals in the mass start and the women’s 5,000 and 3,000, and Canada will also send strong teams for both the men and women’s team pursuit. \n“Canada is a really strong team where people are working together well and I think we’ve stepped up a level of performance over the last couple of years,” Schouten said. \n“We’re really looking forward to bringing our best performances in Korea.” Editing by Greg Stutchbury", "external_links": [], "published": "2018-01-15T15:04:00.000+02:00", "crawled": "2018-01-15T15:21:56.016+02:00", "highlightTitle": ""}