{"organizations": [], "uuid": "b1fc654314ee6275d45af98583d13b9ba203abb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-vedanta-limited-consolidated-results-for-the-third-quarter-ended-31-december-2017.html", "country": "US", "domain_rank": 767, "title": "Vedanta Limited: Consolidated Results for the Third Quarter Ended 31 December, 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-31T14:55:00.000+02:00", "replies_count": 0, "uuid": "b1fc654314ee6275d45af98583d13b9ba203abb9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-vedanta-limited-consolidated-results-for-the-third-quarter-ended-31-december-2017.html", "ord_in_thread": 0, "title": "Vedanta Limited: Consolidated Results for the Third Quarter Ended 31 December, 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "mumbai", "sentiment": "none"}, {"name": "vedanta", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "skorpion", "sentiment": "none"}], "organizations": [{"name": "vedanta limited", "sentiment": "negative"}, {"name": "ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI, India, Jan. 31, 2018 /PRNewswire/ --\nVedanta Limited today announced its unaudited consolidated results for the Third quarter (\"Q3\") ended 31 December, 2017.\nFinancial Highlights\nContinued strong financial performance\n- Revenues of Rs 24,361 crore, up 19% y-o-y and 13% q-o-q\n- EBITDA of Rs. 6,780 crore, up 13% y-o-y and 17% q-o-q\n- Robust EBITDA margin1 at 35%\n- Attributable PAT at Rs 2,173 crore, up 1% y-o-y and up 7% q-o-q\n- Strong Free Cash Flow of Rs 4,662 crore in 9 months Strong Balance Sheet\n- Gross Debt reduced by Rs. 11,450 crore2 since March 31, 2017\n- Net Debt/EBITDA at 0.7x, among the lowest across Indian and global peers\n- Strong financial position with cash & liquid investments of Rs 38,923 crore\nOperational Highlights\nRobust production, and ramp-up on track\n- Zinc India: Refined zinc-lead metal production at 245kt, up 7% q-o-q\n- Zinc International: Strong production at BMM and Skorpion\n- Aluminium: Continued ramp-up with Q3 production up 40% y-o-y and 11% q-o-q; exit production run-rate of 1.8mtpa\n- TSPL: Record plant availability of 97%\n- Iron Ore: Granted additional mining allocation in Goa; increase in mining cap at Karnataka Progressing on growth projects\n- Zinc International: Gamsberg on track to commence production in mid CY18\n- Oil & Gas: Contracts awarded for growth projects announced in Nov 2017; rigs being mobilised at site\nCopper India: EPC contract awarded for 400kt smelter expansion\n1. Excludes custom smelting at Copper India and Zinc India operations\n2. Excluding repayment of temporary borrowing by Zinc India and preference shares issued pursuant to Cairn merger in April.\nMr. Kuldip Kaura, Chief Executive Officer, Vedanta Ltd, said: \"We delivered a robust quarter with EBITDA significantly higher y-o-y and q-o-q, with our EBITDA margin remaining strong. Our ramp-up plans across our well invested assets are on track, and are delivering industry leading growth. We maintain a strong balance sheet and are committed to our capital allocation framework. We are looking forward to a strong Q4 which will help us finish the year with healthy cash generation. The continued strength in the commodity market augurs well for us and we are positive on Vedanta's commodity mix and exposure to Indian growth to drive superior shareholder returns.\"\nConsolidated Financial Performance\nThe consolidated financial performance of the company during the period is as under:\n(In Rs. crore, except as stated)\nFY 2017\nParticulars\n(In Rs. Crore, except as stated)\nQ3\nQ3\n% Change\nQ2\n% Change\n9M\n9M\nActual\nFY 2018\nFY 2017\nFY 2018\nFY 2018\nFY 2017\n76,171\nNet Sales/Income from operations\n24,361\n20,391\n19%\n21,590\n13%\n65,293\n52,480\n21,437\nEBITDA\n6,780\n5,976\n13%\n5,776\n17%\n17,521\n14,162\n39%\nEBITDA Margin [ 1]\n35%\n39%\n35%\n35%\n37%\n5,855\nFinance cost\n1,306\n1,508\n(13)%\n1,427\n(8)%\n4,359\n4,352\n4,581\nOther Income\n573\n1,014\n(43)%\n919\n(38)%\n2,581\n3,660\n20,058\nProfit before Depreciation and Taxes\n6,030\n5,373\n12%\n5,161\n17%\n15,528\n13,290\n6,292\nDepreciation\n1,549\n1,581\n(2)%\n1,426\n9%\n4,361\n4,688\n13,766\nProfit before Exceptional items\n4,481\n3,792\n18%\n3,735\n20%\n11,167\n8,602\n114\nExceptional Items (Credit)/Expense [ 2]\n158\n-\n(186)\n(28)\n-\n2,103\nTax excluding DDT\n1,402\n537\n873\n61%\n2,956\n1,467\n196\nTax – DDT\n-\n15\n-\n42\n34\nTax - Special Items\n(38)\n-\n62\n24\n-\n11,319\nProfit After Taxes\n2,959\n3,240\n(9)%\n2,986\n(1)%\n8,215\n7,093\n11,467\nProfit After Taxes before Exceptional\n3,079\n3,240\n(5)%\n2,862\n8%\n8,211\n7,093\n11,663\nPAT (before Exceptional & DDT)\n3,079\n3,255\n(5)%\n2,862\n8%\n8,211\n7,135\n4,358\nMinority Interest\n906\n1,105\n(18)%\n895\n1%\n2,546\n2,780\n(3)\nShare of Profit of Associate\n-\n(2)\n-\n(0)\n(2)\n6,958\nAttributable PAT after exceptional item\n2,053\n2,133\n(4)%\n2,091\n(2)%\n5,669\n4,311\n7,127\nAttributable PAT before exceptional item\n2,173\n2,133\n2%\n2,036\n7%\n5,734\n4,311\n7,323\nAttributable (before exceptional & DDT)\n2,173\n2,148\n1%\n2,036\n7%\n5,734\n4,353\n23.47\nBasic Earnings per Share (Rs./sh.)\n5.54\n7.19\n(23)%\n5.64\n(2)%\n15.59\n14.54\n24.04\nBasic EPS before Exceptional (Rs./sh.)\n5.86\n7.19\n(19)%\n5.49\n7%\n15.77\n14.54\n24.70\nBasic EPS (before exceptional & DDT)\n5.86\n7.24\n(19)%\n5.49\n7%\n15.77\n14.68\n67.09\nExchange rate (Rs./$) – Average\n64.74\n67.46\n(4)%\n64.29\n1%\n64.49\n67.12\n64.84\nExchange rate (Rs./$) – Closing\n63.93\n67.95\n(6)%\n65.36\n(2)%\n63.93\n67.95\n1. Excludes custom smelting at Copper India and Zinc India operations\n2. Exceptional Items Gross of Tax\n3. In view of clarification issued by Ind AS Transition Facilitation Group, the Group has revised the accounting for dividend distribution tax (DDT) on profits of subsidiaries. DDT on profits of subsidiaries which is to be utilized against the equity dividend declared by the Company is recognised in statement of changes in equity as against the previous policy of recognizing the same in the statement of profit and loss. The financial results for the previous periods/year have been restated to give effect of the same\n4. Previous period figures have been regrouped or re-arranged wherever necessary to conform to the current period's presentation\nRevenues\nRevenue for Q3 FY2018 was up 19% y-o-y, on account of ramp-up at Aluminium business, higher volumes at Zinc International, record plant availability at TSPL and higher commodity prices, partially offset by currency appreciation and lower sales at Iron Ore and Copper India.\nRevenues were up 13% sequentially, on account of ramp up at Aluminium business, resumption of operations post-monsoon at Iron Ore, record plant availability at TSPL, higher volumes at Zinc India and Zinc International, and higher commodity prices, partially offset by lower sales at Copper India.\nEBITDA and EBITDA Margins\nEBITDA for Q3 at Rs 6,780 crore, was up 13% y-o-y, on account of higher commodity prices, ramp-up at Aluminium business, record plant availability at TSPL and higher volumes at Zinc International. This was partially offset by higher costs due to input commodity inflation, currency appreciation, one-off costs on account of power import and pot outage earlier in the year at Aluminium business, and lower sales at Iron ore and Copper India.\nOn a sequential basis, EBITDA was up 17% on account of higher volumes at Zinc India, Zinc International, ramp up at Aluminium business, resumption of operations post-monsoon at Iron Ore, record plant availability at TSPL, and higher commodity prices, partially offset by higher costs due to input commodity inflation.\nEBITDA margin [1] remained robust at 35% for the quarter.\nDepreciation & Amortization\nDepreciation at Rs. 1,549 crore was lower on a y-o-y basis by Rs. 32 crore, driven by lower depreciation at Oil & Gas business. This was due to the change in method of calculation of Unit of production (UOP) charge to \"Proved and Developed Oil and Gas Reserves\" (1P) in accordance with the Guidance Note on Accounting for Oil and Gas Producing Activities, which was effective April 1, 2017, compared to the earlier approach of \"Proved and Probable Reserves\" (2P). This was partially offset by capitalization of pots at Aluminium business.\nDepreciation was higher by Rs. 123 crore q-o-q due to higher production at Zinc India and Iron Ore, and capitalization of new infill wells at Mangala in the O&G business.\nFinance Cost and Other Income\nFinance cost during the quarter was Rs. 1,306 crore, lower by Rs. 202 crore on a y-o-y basis, on account of de-leveraging during the financial year and lower interest rates, partially offset by dividends on preference shares issued to the shareholders of Cairn India pursuant to the merger with the Company in April, and capitalization of pots at Aluminium business. On a sequential basis, finance cost was lower by Rs. 121 Crore on account of deleveraging in Q2 FY 18.\nOther Income was at Rs. 573 crore, lower on a q-o-q basis by Rs. 346 crore, mainly on account of lower investment corpus at Zinc India and lower return on investments due to sharp rise in G-Sec yields resulting in mark-to-market losses on investments.\nOn a y-o-y basis, Other Income was lower by Rs. 441 crores mainly on account of lower investment corpus due to special dividend pay-out by Zinc India of Rs. 13,985 crores (including DDT) in March-April 2017, deleveraging, and mark-to-market losses on investments due to a sharp rise in G-Sec yields.\nExceptional Items\nExceptional Items comprises a one-time charge of Rs. 158 crore in Q3 FY 2018 relating to arbitration of a historical vendor claim in the aluminium business and acquisition related cost of ASI.\nTaxes\nTax expense (before exceptional items) was at Rs. 1,402 crore during the quarter, resulting in a tax rate of 31%. This was higher q-o-q mainly on account of change in profit mix.\nTax rate during the quarter is higher y-o-y on account of phasing out of investment allowance claims allowed till FY 17 and change in profit mix.\nAttributable Profit After Tax and Earnings Per Share (EPS)\nAttributable Profit After Tax (PAT) before exceptional items for the quarter was Rs. 2,173 crore. Minority interest was at 29%.\nEPS for the quarter before exceptional items was at Rs. 5.86 per share.\nBalance Sheet\nOur financial position remains strong with cash and liquid investments of Rs. 38,923 crore. The Company follows a Board-approved investment policy and invests in high quality debt instruments with mutual funds, bonds and fixed deposits with banks. The portfolio is rated by CRISIL, which has assigned a rating of \"Very Good\" (implying Highest Safety) to our portfolio. Further, the Company has undrawn committed facilities of Rs.3,800 crores as on December 31, 2017.\nGross debt was at Rs. 55,218 crore on December 31, 2017, including Preference shares of Rs 3,010 crore issued pursuant to the Cairn merger and Rs. 946 crore pursuant to acquisition of AvanStrate Inc. During the nine months ended December 31, 2017, gross debt reduced by Rs. 11,450 Crores (excluding repayment of Rs. 7,908 crores temporary borrowing by Zinc India and preference shares issued pursuant to the Cairn merger).\nNet debt was at Rs. 16,295 crore on 31 st December, higher q-o-q on account of acquisition of AvanStrate Inc., partially offset by strong free cash flow generation during the quarter.\nKey Recognitions\nVedanta has been consistently recognized through the receipt of various awards and accolades. During the past quarter, we received the following recognitions:\nHindustan Zinc received The India Risk Management Award 2018 for Best Risk Management Framework & Systems – Sustainability presented by ICICI Lombard and CNBC TV 18 Cairn Oil & Gas was awarded the 'Game Changer – Oil & Gas Company of the year' by Petroleum Federation of India (PetroFed) for continuous outstanding work on Enhanced Oil Recovery project. Cairn Oil & Gas was awarded the 'Golden Peacock Award for Sustainability' 2017 in London. Vedanta Limited, Jharsuguda received the prestigious Confederation of the Indian Industry (CII) National HR Circle Award, 2017 in the Performance Management and Training & Development category. Vedanta Lanjigarh received the prestigious Kalinga Safety Gold Award 2017 under Refinery category for excellence in plant safety practices. BALCO received Gold Rating in CII National 5S Excellence Awards-2017 Sesa Goa Iron Ore wins the 'Most Effective Recruitment, Engagement & Innovative Retention Strategy Award' at the Confederation of the Indian Industry (CII)'s National HR Circle 2017. Sesa Goa Iron Ore –Value Addition Business won the prestigious Gold Certificate of Merit Award under the Metals category at the Frost & Sullivan and FICCI India Manufacturing Excellence Awards 2017 Sterlite Copper was placed first under the category of \"Industrial Water Use Efficiency\" at National Competition for Excellence in Water Management 2017 organized by FICCI India\nResults Conference Call\nPlease note that the results presentation is available in the Investor Relations section of the company website http://www.vedantalimited.com/investor-relations/results-reports.aspx\nFollowing the announcement, there will be a conference call at 6:30 PM (IST) on Wednesday, 31 January 2018, where senior management will discuss the company's results and performance. The dial-in numbers for the call are as below:\nEvent\nTelephone Number\nEarnings conference call on January 31, 2018\nIndia – 6:30 PM (IST)\nMumbai main access\n+91-22-3938-1017\nToll Free number\n1-800-120-1221\n1-800-200-1221\nSingapore – 9:00 PM (Singapore Time)\nToll free number\n800-101-2045\nHong Kong – 9:30 PM (Hong Kong Time)\nToll free number\n800-964 -448\nUK – 1:00 PM (UK Time)\nToll free number\n0-808-101-1573\nUS – 8:00 AM (Eastern Time)\nToll free number\n1-866-746-2133\nFor online registration\nhttp://services.choruscall.in/diamondpass/registration?confirmationNumber=5267915\nReplay of Conference Call\n(January 31, 2018 to February 6, 2018)\nMumbai\n+91-22-3065-2322\nPasscode: 34255#\nAbout Vedanta Limited\nVedanta Limited is a diversified natural resources company, whose business primarily involves producing oil & gas, zinc - lead - silver, aluminium, copper, iron ore and commercial power. The company has a presence across India, South Africa and Namibia. Vedanta Ltd has a portfolio of world-class, low-cost, scalable assets that consistently generate strong profitability and have robust cash flows. The company holds industry-leading market shares across its core divisions.\nVedanta Limited is the Indian subsidiary of Vedanta Resources Plc, a London-listed company. Governance and Sustainable Development are at the core of Vedanta's strategy, with a strong focus on health, safety and environment and on enhancing the lives of local communities. The company is conferred with the Confederation of Indian Industry (CII) 'Sustainable Plus Platinum label', ranking among the top 10 most sustainable companies in India. To access the Vedanta Sustainable Development Report 2017, please visit http://sd.vedantaresources.com/SustainableDevelopment2016-17/\nVedanta Limited is listed on the Bombay Stock Exchange and the National Stock Exchange in India. The company is in the Nifty 50 Index and has ADRs listed on the New York Stock Exchange.\nFor more information please visit http://www.vedantalimited.com\nFor further information, please contact:\nCommunications\nArun Arora\nHead Communications\nTel: +91-1244593000\ngc@vedanta.co.in\nInvestor Relations\nAshwin Bajaj\nDirector – Investor Relations\nTel: +91-22-6646-1531\nvedantaltd.ir@vedanta.co.in\nAarti Raghavan\nVP – Investor Relations\nSneha Tulsyan\nAssociate Manager – Investor Relations\nVedanta Limited\nVedanta, 75, Nehru Road,\nVile Parle (East), Mumbai - 400 099\nhttp://www.vedantalimited.com\nRegistered Office:\nRegd. Office: 1st Floor, 'C' wing, Unit 103,\nCorporate Avenue, Atul Projects,\nChakala, Andheri (East),\nMumbai – 400 093\nCIN: L13209MH1965PLC291394\nDisclaimer\nThis press release contains \"forward-looking statements\" – that is, statements related to future, not past, events. In this context, forward-looking statements often address our expected future business and financial performance, and often contain words such as \"expects,\" \"anticipates,\" \"intends,\" \"plans,\" \"believes,\" \"seeks,\" \"should\" or \"will.\" Forward–looking statements by their nature address matters that are, to different degrees, uncertain. For us, uncertainties arise from the behaviour of financial and metals markets including the London Metal Exchange, fluctuations in interest and or exchange rates and metal prices; from future integration of acquired businesses; and from numerous other matters of national, regional and global scale, including those of a political, economic, business, competitive or regulatory nature. These uncertainties may cause our actual future results to be materially different that those expressed in our forward-looking statements. We do not undertake to update our forward-looking statements.\nView original content: http://www.prnewswire.com/news-releases/vedanta-limited-consolidated-results-for-the-third-quarter-ended-31-december-2017-300591023.html\nSOURCE Vedanta Limited", "external_links": ["http://www.vedantalimited.com/investor-relations/results-reports.aspx", "http://www.vedantalimited.com/", "http://services.choruscall.in/diamondpass/registration?confirmationNumber=5267915", "http://www.prnewswire.com/news-releases/vedanta-limited-consolidated-results-for-the-third-quarter-ended-31-december-2017-300591023.html", "http://sd.vedantaresources.com/SustainableDevelopment2016-17/"], "published": "2018-01-31T14:55:00.000+02:00", "crawled": "2018-01-31T15:48:38.016+02:00", "highlightTitle": ""}