{"organizations": [], "uuid": "e840ad9116bce13d188724ca1b36cad13ba72fd2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-britain-slavery/offer-slavery-victims-a-lifeline-and-livelihood-urges-britains-co-op-supermarket-idUSKBN1F828Y", "country": "US", "domain_rank": 408, "title": "Offer slavery victims a lifeline and livelihood, urges Britain's Co-op supermarket", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.043, "site_type": "news", "published": "2018-01-20T01:56:00.000+02:00", "replies_count": 0, "uuid": "e840ad9116bce13d188724ca1b36cad13ba72fd2"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-britain-slavery/offer-slavery-victims-a-lifeline-and-livelihood-urges-britains-co-op-supermarket-idUSKBN1F828Y", "ord_in_thread": 0, "title": "Offer slavery victims a lifeline and livelihood, urges Britain's Co-op supermarket", "locations": [], "entities": {"persons": [], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "albania", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "city hearts", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Thomson Reuters Foundation) - Britain’s Co-op supermarket has extended a job scheme that recruits victims of modern slavery who have been rescued or have escaped exploitation, and urged other brands to get on board.\nCo-op’s “Bright Future” program was launched in April 2017 with anti-trafficking charity City Hearts, offering trafficking victims a four-week paid placement leading to a potential permanent job at one of its stores or warehouses in Britain.\nIn brothels, cannabis farms, car washes and nail bars, the government estimates there are at least 13,000 victims of forced labor, sexual exploitation and domestic servitude in Britain, most of them from Albania, Nigeria, Poland and Vietnam.\nPolice say the true figure could be in the tens of thousands.\nSo far, Co-op has recruited 15 survivors to full-time jobs in northwest England stacking shelves, on cash registers or sorting goods at its warehouses. A further 19 survivors are at various stages within the scheme, it said.\nNow the supermarket is extending its program to a national matching system that will enable other companies to work with charities to create jobs for victims of modern slavery.\n“They (survivors) have gone through horrendous experiences so their self-confidence has been knocked, but an important way to improve that situation is to get proper, paid employment,” Dave Smith, a Co-op spokesman, told the Thomson Reuters Foundation.\nThe supermarket convened a meeting of businesses - including oil company BP, supermarket chain Tesco and cosmetics firm The Body Shop - at Britain’s parliament to discuss how to extend the program.\nTo throw a lifeline to slavery survivors, companies need to be more flexible in their recruitment - perhaps overlooking missing references or incomplete paperwork, Co-op said.\n“These efforts by the Co-op ... hopefully will quickly become industry policy,” said opposition lawmaker Frank Field, who was at the meeting.\nBritain is viewed as being at the forefront of global efforts to tackle the crime, having passed the Modern Slavery Act in 2015, which introduced life sentences for traffickers, and offered better protection for people at risk.\n“A job represents food on the table, a home and community to be part of,” said Ed Newton, managing director of City Hearts.\nThe charity works with Co-op on the scheme and cares for 500 men, women and children who are slavery survivors through safe houses and outreach programs.\n“I love my life now, I enjoy waking up every morning,” said Peter, who was exploited in a car wash and now works in a Co-op store.\n“This is the ideal working environment for me.”\nReporting by Adela Suliman; editing by Ros Russell. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-20T01:56:00.000+02:00", "crawled": "2018-01-20T17:26:12.003+02:00", "highlightTitle": ""}