{"organizations": [], "uuid": "d53be87b8d9c4bbe092ace3f86db803137db2fe3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180101&t=2&i=1218643252&w=1200&r=LYNXMPEE0010J", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-championship/derby-fail-to-gain-ground-at-top-of-championship-after-draw-idUKKBN1EQ16M", "country": "US", "domain_rank": 408, "title": "Derby fail to gain ground at top of Championship after draw", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T20:25:00.000+02:00", "replies_count": 0, "uuid": "d53be87b8d9c4bbe092ace3f86db803137db2fe3"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-championship/derby-fail-to-gain-ground-at-top-of-championship-after-draw-idUKKBN1EQ16M", "ord_in_thread": 0, "title": "Derby fail to gain ground at top of Championship after draw", "locations": [], "entities": {"persons": [{"name": "mark duffy", "sentiment": "none"}, {"name": "clarke", "sentiment": "none"}, {"name": "johnny russell", "sentiment": "none"}, {"name": "leon clarke", "sentiment": "none"}, {"name": "matej vydra", "sentiment": "none"}], "locations": [{"name": "derby", "sentiment": "none"}, {"name": "sheffield united - pride park", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "pride park", "sentiment": "none"}, {"name": "derby county", "sentiment": "none"}], "organizations": [{"name": "brentford", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "wolverhampton wanderers", "sentiment": "none"}, {"name": "sheffield united", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 1, 2018 / 6:28 PM / Updated 15 minutes ago Derby held by Sheffield United, Villa thrash Bristol City Peter Hall 3 Min Read \nLONDON (Reuters) - Derby County missed the chance to close the gap on Championship leaders Wolverhampton Wanderers to seven points as Leon Clarke earned Sheffield United a 1-1 draw at Pride Park on Monday. Soccer Football - Championship - Derby County vs Sheffield United - Pride Park, Derby, Britain - January 1, 2018 Derby County's Johnny Russell in action with Sheffield United's Mark Duffy Action Images/Peter Cziborra \nIt was one goal each for the top scorers in England’s second tier as Matej Vydra converted a penalty to put the home side in front, before Clarke headed a second-half equaliser to take his tally to 15 for the season, one ahead of Vydra. \nDerby stay second and trail Wolves, who play Brentford on Tuesday, by nine points after extending their unbeaten run to seven league matches. Sheffield United have won once in eight league games and are now outside the playoff places in seventh. \nBristol City’s miserable festive period continued as they were thrashed 5-0 at Aston Villa in Monday’s late kickoff. It was City’s second straight loss to a promotion rival after a 2-1 reverse at home to Wolves on Saturday. Villa are three points behind fourth-placed City thanks to their second win in a row. \nMiddlesbrough climbed within two points of the playoff places as new manager Tony Pulis enjoyed his first win in the job, with his side edging a 3-2 thriller at Preston North End. \nDefender Daniel Ayala gave the visitors the lead before Callum Robinson levelled. After Jordan Hugill and Jonny Howson had traded goals, Ayala won it with a 73rd-minute header. Soccer Football - Championship - Aston Villa vs Bristol City - Villa Park, Birmingham, Britain - January 1, 2018 Aston Villa's Alan Hutton in action with Bristol City's Bobby Reid Action Images/Matthew Childs \nAs a result of Bristol City’s hammering at Villa, Cardiff City climbed to third place on goal difference despite a fourth defeat in a row with a 2-1 reverse at lowly Queens Park Rangers. \nJoe Ralls’ 54th-minute spot-kick handed the visitors the lead but Matt Smith levelled within eight minutes to set the stage for QPR debutant Paul Smyth to win it with 18 minutes left. Slideshow (3 Images) \nIt was also a frustrating afternoon for Leeds United, who were held to a 0-0 draw by managerless Nottingham Forest at Elland Road after Saturday’s defeat at bottom side Birmingham City. \nSheffield Wednesday’s poor run of form continued as they lost for the fifth time in six games at home to struggling Burton Albion. \nBolton Wanderers moved out of the bottom three with a 1-0 win over Hull City thanks to Gary Madine’s first half free kick that made it three wins in four games. \nSunderland’s plight deepened as they slipped back into the relegation zone after a 1-0 home defeat by Barnsley, while James Maddison was Norwich City’s match-winner as they came from behind to see off Millwall 2-1 at Carrow Road. Reporting by Peter Hall; Editing by Christian Radnedge and Ken Ferris", "external_links": [], "published": "2018-01-01T20:25:00.000+02:00", "crawled": "2018-01-01T20:41:03.022+02:00", "highlightTitle": ""}