{"organizations": [], "uuid": "71832478d859576d0bbbd8f6cf3aaa7feabee803", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 10}, "facebook": {"likes": 21, "shares": 21, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226293164&w=1200&r=LYNXMPEE0S0WC", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-dr-pepper-snapp-m-a-keurig/dr-pepper-snapple-and-keurig-green-mountain-to-merge-idUSKBN1FI1II", "country": "US", "domain_rank": 408, "title": "Dr Pepper Snapple and Keurig Green Mountain to merge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T14:41:00.000+02:00", "replies_count": 0, "uuid": "71832478d859576d0bbbd8f6cf3aaa7feabee803"}, "author": "", "url": "https://www.reuters.com/article/us-dr-pepper-snapp-m-a-keurig/dr-pepper-snapple-and-keurig-green-mountain-to-merge-idUSKBN1FI1II", "ord_in_thread": 0, "title": "Dr Pepper Snapple and Keurig Green Mountain to merge", "locations": [], "entities": {"persons": [{"name": "sangameswaran", "sentiment": "none"}, {"name": "savio d'souza", "sentiment": "none"}], "locations": [{"name": "keurig green mountain", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "dr pepper snapple", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "keurig green mountain", "sentiment": "negative"}, {"name": "keurig green mountain inc", "sentiment": "none"}, {"name": "dr pepper snapple group inc", "sentiment": "none"}, {"name": "keurig dr pepper", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 12:46 PM / in 13 minutes Coffee meets 7UP in Keurig, Dr Pepper Snapple deal Martinne Geller , Siddharth Cavale 4 Min Read \n(Reuters) - Keurig Green Mountain has struck a deal worth more than $21 billion to combine with soda maker Dr Pepper Snapple Group Inc ( DPS.N ) to form a North American drinks company with brands like Green Mountain Coffee, 7UP, Snapple and Sunkist. \nThe latest in a five-year string of acquisitions by Keurig’s owner, Luxembourg-based JAB Holding Co, it creates an enlarged group with a wide range of hot and cold beverages, different ways to access customers and a bigger platform for further deals. \n“We have a really wide portfolio of brands, we’re able to address almost every consumer need in every format and ... to reach every point of sale,” Keurig Chief Executive Bob Gamgort told Reuters. \n“If you want to win in the beverage industry you need a portion of your portfolio that gives you significant scale and then you need to be able to layer in higher growth segments,” he said. \nKeurig will pay a special dividend of $103.75 per share to Dr Pepper Snapple shareholders, resulting in a cash payment of $18.7 billion. Those shareholders will also retain a 13 percent stake in the combined company to be called ‘Keurig Dr Pepper’. \nA 13 percent stake in Dr Pepper Snapple was worth more than $2.2 billion before the deal was announced. The company’s shares jumped 25 percent on Monday to $119.70 in New York. \nBernstein analyst Ali Dibadj estimates the deal’s value at $26 billion to $27 billion. \n“From DPS’ perspective at this time it makes a lot of sense,” said Josh Blechman, director of capital markets at Exponential ETFs, which owns shares of Dr Pepper Snapple. “They needed to diversify their business line from sugary drinks, so I think that this is a really good deal.” \nThe companies expect $600 million in cost-savings, and see opportunities to expand the business such as by selling coffee in bottles and in vending machines. Dr Pepper’s direct-to-store delivery model will be complemented by Keurig’s online presence and relationships with major supermarket chains. Slideshow (2 Images) MORE DEALS \nBulking up is a way to boost efficiency in the business at a time when soft drink sales are falling as consumers cut down on sugar. \n“If your truck is becoming less full because volumes are declining, you should have other beverages to fill that spot,” said Bernstein’s Dibadj, who has predicted beer and soft drink tie-ups for the same reason. \n“The likelihood that Coke ( KO.N ) and Pepsi ( PEP.O ) will get bought has just gone up,” Dibadj said. That would mean a mega-deal, given those soft-drink giants have market values of more than $200 billion and $170 billion respectively. \nKeurig Green Mountain is the leading single-serve coffee company in the United States. It was taken over by JAB, the holding company of the German billionaire Reimann family, in 2016 for $13.9 billion. \nJAB has been on an acquisition spree in recent years, with a string of restaurant deals including Au Bon Pain, Krispy Kreme and Panera Bread as well as several coffee businesses from niche brand Intelligentsia to controlling the international coffee operations of Mondelez International ( MDLZ.O ). \nJAB and its partners will make an equity investment of $9 billion in the deal. Mondelez, now a major Keurig shareholder, will own about 13 percent to 14 percent of the combined company. \nJefferies analysts said further deals by Keurig Dr Pepper are very likely, as the company pays down a debt load expected to be about $16.6 billion when the deal closes, scheduled for the second quarter. \nThe company expects to get its leverage to below three times earnings before interest, tax, depreciation and amortization within two to three years, while paying an annual dividend of 60 cents per share. \nGoldman Sachs was the lead financial adviser to Keurig and Credit Suisse advised Dr Pepper Snapple on the deal. Related Coverage", "external_links": [], "published": "2018-01-29T14:41:00.000+02:00", "crawled": "2018-01-29T14:50:00.064+02:00", "highlightTitle": ""}