{"organizations": [], "uuid": "96af37c4fe477b5181f303e8eaa4a76fa457c531", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-fski-unlikelyrivalry/unlikely-rivalry-in-aerials-set-to-continue-at-pyeongchang-idUKKBN1EY1JD", "country": "US", "domain_rank": 408, "title": "Unlikely rivalry in Aerials set to continue at Pyeongchang", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T15:33:00.000+02:00", "replies_count": 0, "uuid": "96af37c4fe477b5181f303e8eaa4a76fa457c531"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-fski-unlikelyrivalry/unlikely-rivalry-in-aerials-set-to-continue-at-pyeongchang-idUKKBN1EY1JD", "ord_in_thread": 0, "title": "Unlikely rivalry in Aerials set to continue at Pyeongchang", "locations": [], "entities": {"persons": [{"name": "jack tarra", "sentiment": "neutral"}, {"name": "anton kushnir", "sentiment": "none"}, {"name": "xiaopeng han", "sentiment": "none"}, {"name": "alexi grishin", "sentiment": "none"}, {"name": "lydia lassila", "sentiment": "none"}, {"name": "dmitri dashinski", "sentiment": "none"}], "locations": [{"name": "pyeongchang", "sentiment": "none"}, {"name": "turin", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "belarus", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": [{"name": "aerials", "sentiment": "neutral"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 1:36 PM / Updated 22 minutes ago Unlikely rivalry in Aerials set to continue at Pyeongchang Jack Tarrant 4 Min Read \nLONDON (Reuters) - Two countries, Belarus and China, have dominated the men’s aerials at the last three Winter Olympics and look set to do the same this time around in Pyeongchang. \nWhile traditions, resources and basic geography often sustain the same rivalries in Olympic events, the long-standing duel in the acrobatic skiing event of aerials pits two countries with very different backgrounds against one another. \nThe unlikely pairing of Belarus and China have won six of the last nine medals in the men’s aerials, including all three golds. \nBelarus, through Anton Kushnir in Sochi and Alexi Grishin at Vancouver, have claimed gold at the past two games, twice relegating the Chinese competitor to third place. \nChina’s Xiaopeng Han was the victor in Turin in 2006, edging out Belarusian Dmitri Dashinski into second. \nThe two nations are also strong in the women’s event, with five medals between them since 2006. However, Australian Lydia Lassila, gold medallist in Vancouver and bronze winner in Sochi, can never be ruled out as she hopes to appear at a record fifth winter games. \nFollowing the latest round of the World Cup in Moscow on Saturday – won by American Kiley McKinnon – Belarus’ Hanna Huskova leads the overall standings, followed by China’s Mengtao Xu, who won the World Cup last year in the women’s aerials. \nIf the women’s competition heading into Pyeongchang is more diverse, the men’s look set to once again come down to Belarus and Russia. \nLast season, every single World Cup men’s aerials event was won by either Belarus’ Kushnir – who went on to claim the title – or one of three Chinese athletes. \nThis year is no different, with China’s Zongyang Jia leading the standings. Kushnir is second, his compatriot Maxim Gustik is third and Guangpu Qi of China is in fourth. \nThe depth of quality among the two teams is staggering, with each possessing four athletes in the top 14 in the World Cup rankings, making it difficult for other nations to even dream about reaching the final in Pyeongchang, let alone claiming a podium place. \nSpeaking to Reuters shortly before the World Cup event in Russia, the head coach of the Belarusian freestyle skiing team, Nikolai Kozeko, said his nation’s aerial prowess stems from the country’s rich traditions in acrobatics and gymnastics. \n“We are not strong in all disciplines of freestyle,” admitted Kozeko. \n“Our strength is aerial skiing. Belarus has strong acrobatics, diving and gymnastics traditions from the Soviet era and that has helped the creation of training centres for aerial skiing. These training centres were founded on the traditions of these sports.” \nChina also has a history of success in gymnastics and Kozeko believes these skills are perfectly suited for assimilation into aerial skiing, where athletes perform similar twists, turns and somersaults to achieve scores. \nMaintaining dominant success is a challenge for any national sports programme, yet China and Belarus seem to have the traditions, talent and structure in place to continue their hotly-contested battle for aerial supremacy into Pyeongchang and beyond. Reporting by Jack Tarrant, additional reporting by Gabrielle Tetrault-Farber; editing by Amlan Chakraborty", "external_links": [], "published": "2018-01-09T15:33:00.000+02:00", "crawled": "2018-01-09T15:45:04.000+02:00", "highlightTitle": ""}