{"organizations": [], "uuid": "68bcf55f46c3be4f7d191d69f74dd4b5f05892e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221447794&w=1200&r=LYNXMPEE0B0WU", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-alps-svindal/resilient-svindal-back-on-form-and-gunning-for-gold-idUKKBN1F11LI", "country": "US", "domain_rank": 408, "title": "Resilient Svindal back on form and gunning for gold", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T15:14:00.000+02:00", "replies_count": 0, "uuid": "68bcf55f46c3be4f7d191d69f74dd4b5f05892e9"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-alps-svindal/resilient-svindal-back-on-form-and-gunning-for-gold-idUKKBN1F11LI", "ord_in_thread": 0, "title": "Resilient Svindal back on form and gunning for gold", "locations": [], "entities": {"persons": [{"name": "svindal", "sentiment": "negative"}, {"name": "aksel lund svindal", "sentiment": "none"}], "locations": [{"name": "wengen", "sentiment": "none"}, {"name": "beaver creek", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "wengen", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " 15 PM / Updated 35 minutes ago Resilient Svindal back on form and gunning for gold Brian Homewood 4 Min Read \nWENGEN, Switzerland (Reuters) - When Aksel Lund Svindal discovered that he would have to undergo knee surgery for the second time in a year, his reaction was simply: “Here we go again”. FILE PHOTO: Aksel Lund Svindal of Norway reacts following the men's Alpine Skiing World Cup downhill race on the Lauberhorn course in Wengen, Switzerland January 16, 2016. REUTERS/Denis Balibouse/File photo \nOne year on, the remarkably resilient Norwegian is not only back skiing but leads the World Cup downhill standings and is hoping to crown his career with an Olympic gold in the blue riband event at the age of 35. \nIt would be a fitting reward for a skier who has savoured the taste of success and endured the pain and frustration of injury in almost equal measure. \nSvindal’s last two seasons ended prematurely in January due to knee injuries, the most recent at Wengen where he will race in the prestigious downhill on Saturday. \nThose came on top of an absence of nearly a year following a crash at Beaver Creek in November, 2007 and another long layoff in 2014 with an Achilles tendon injury he sustained kicking a ball around with his team mates. \nBut each time he has bounced back, making him something of an expert in injury recovery. \nPart of his secret, he told Reuters in an interview, was focusing on the positives rather than negatives. \n“I‘m good at focusing on what’s important,” he said. “When you’re in hospital on crutches, there’s a lot you can’t do so you have to focus on what you can do.” \nHe also looked on it as a challenge. \n“You sense that people think that this is going to be a tough one you hear them say ‘I‘m not sure he’ll make it back this time’,” he said. \n“As well as proving them wrong, it’s also a personal challenge....I want to do this again and see how far I can take it.” FILE PHOTO: Aksel Lund Svindal of Norway skis during the men's Alpine Skiing World Cup downhill race on the Lauberhorn course in Wengen, Switzerland January 16, 2016. REUTERS/Ruben Sprich/File photo SKIING WELL \nSvindal said it was surprising how quickly his goals went from simply being able to ski again to skiing well and then winning. \n“You start wondering if you can win World Cup races and it’s strange how quickly the mindset changes,” he said. \nBut he confessed it has been tough. \n“I‘m really happy I‘m back because, honestly, the last two years were not super easy. A big knee injury is probably the worst injury you can have as a ski racer.” \nAt the moment, it bothers him more in practice than when racing. \n“I can race with it, but I have a hard time in training because then it’s hard to forget about it,” he said. \nDespite all the interruptions to his career, Svindal has won the overall World Cup title twice and is a five-times winner of the Super G category, twice downhill champion, once giant slalom and once combined. \nHe has also won five world championship golds, plus an Olympic gold in the Super G in Vancouver in 2010. The Olympic downhill would fit nicely into his medals cabinet. \n“If I could choose one race to win this year, it would be the Olympic downhill,” he said, adding that he was at a disadvantage from not having raced in Pyeongchang before. \n“The rest of the guys have been racing there and I haven‘t. I was in hospital when they were racing...so I haven’t seen the course. That’s a disadvantage but it’s not a hopeless situation,” he said. \n“I need a good start...if there’s bad weather and the training runs are cancelled, that’s going to be a problem.” Additional reporting by Henrik Stolen in Oslo; Editing by Ed Osmond", "external_links": [], "published": "2018-01-12T15:14:00.000+02:00", "crawled": "2018-01-12T15:38:44.008+02:00", "highlightTitle": ""}