{"organizations": [], "uuid": "727b2162c83a6692594c9aed9cd72c5c92727b3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-worldcup-australia-van-marwijk/oranje-obsession-returns-as-van-marwijk-takes-socceroos-job-idUKKBN1FE0SH", "country": "US", "domain_rank": 408, "title": "Oranje obsession returns as van Marwijk takes Socceroos job", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T10:06:00.000+02:00", "replies_count": 0, "uuid": "727b2162c83a6692594c9aed9cd72c5c92727b3a"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-worldcup-australia-van-marwijk/oranje-obsession-returns-as-van-marwijk-takes-socceroos-job-idUKKBN1FE0SH", "ord_in_thread": 0, "title": "Oranje obsession returns as van Marwijk takes Socceroos job", "locations": [], "entities": {"persons": [{"name": "marwijk", "sentiment": "negative"}, {"name": "mark van bommel", "sentiment": "none"}, {"name": "pim verbeek", "sentiment": "none"}, {"name": "bert van marwijk", "sentiment": "none"}, {"name": "van marwijk", "sentiment": "none"}, {"name": "guus hiddink", "sentiment": "none"}, {"name": "van marwijk", "sentiment": "none"}, {"name": "az alkmaar", "sentiment": "none"}], "locations": [{"name": "netherlands", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "fortuna sittard", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "oranje", "sentiment": "negative"}, {"name": "socceroos", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "michael church", "sentiment": "none"}, {"name": "feyenoord", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 8:07 AM / Updated 21 minutes ago Oranje obsession returns as van Marwijk takes Socceroos job Michael Church 3 Min Read \n(Reuters) - Australia’s Oranje obsession came to the fore once again on Thursday when Bert van Marwijk was unveiled as the man to lead the Socceroos at the World Cup finals in Russia later this year. \nFor the third time in four tournaments, a Dutchman will guide the country’s national team as van Marwijk follows in the footsteps of Guus Hiddink and Pim Verbeek, and the 65-year-old will be expected to match the achievements of his compatriots. \nVan Marwijk brings a robust resume to the role, having most famously led his homeland to the final of the 2010 tournament, when an uncompromising side led by a forceful Mark van Bommel was eventually defeated by Spain in extra-time. \nA midfielder during his playing days with Go Ahead Eagles and AZ Alkmaar, who earned a solitary cap for the Netherlands, van Marwijk’s coaching career began in 1998 at Fortuna Sittard, another of his former clubs. \nFrom there he enjoyed a pair of stints with Feyenoord, winning the UEFA Cup in 2002 in his first spell with the club, either side of a period at Borussia Dortmund in Germany. \nHe was appointed head coach of the Dutch national team after the country’s quarter-final exit at Euro 2008 under Marco van Basten and two years later, led the Netherlands to their first appearance in a World Cup final since 1978. \nThe team’s fortunes, however, suffered a nosedive when three defeats in a row in the group phase of Euro 2012 -- against Portugal, Germany and Denmark -- saw van Marwijk stand down. \nA disappointing spell with Hamburg further hurt his reputation and it was to Saudi Arabia that he turned to rehabilitate his standing. \nHis pragmatic approach added much-needed discipline to the Saudis and, during a two-year stint, van Marwijk qualified the country for their first World Cup since 2006, seeing off Australia in the process. \nAn inability to agree terms on a new contract once qualifying was completed, due in part to the Dutchman’s refusal to spend more time in Saudi Arabia, led to a split but he remains highly regarded in the desert kingdom. \nThat had left van Marwijk a free agent since mid-September and he was linked with a number of vacancies before being handed the Australia job following Ange Postecoglou’s resignation in November. \nPostecoglou, who booked Australia’s ticket for Russia via the playoffs, sought to introduce a more possession-based style of play on his team but van Marwijk is unlikely to continue that approach. \nWith four-and-a-half months to prepare for group matches against France, Denmark and Peru, van Marwijk will need to be at his pragmatic best to make the most of a challenging situation. Writing by Michael Church; Editing by John O'Brien", "external_links": [], "published": "2018-01-25T10:06:00.000+02:00", "crawled": "2018-01-25T10:35:54.030+02:00", "highlightTitle": ""}