{"organizations": [], "uuid": "0ad38c61013bad5770b2be47ba398ecfec2fd4f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-sv-health-investors-announces-promotions-within-financial-team.html", "country": "US", "domain_rank": 767, "title": "SV Health Investors Announces Promotions Within Financial Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-16T19:20:00.000+02:00", "replies_count": 0, "uuid": "0ad38c61013bad5770b2be47ba398ecfec2fd4f4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-sv-health-investors-announces-promotions-within-financial-team.html", "ord_in_thread": 0, "title": "SV Health Investors Announces Promotions Within Financial Team", "locations": [], "entities": {"persons": [{"name": "brent faduski", "sentiment": "none"}, {"name": "denise marks", "sentiment": "none"}, {"name": "marks", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "sv health investors", "sentiment": "negative"}, {"name": "sv health investors announces promotions within financial team", "sentiment": "negative"}, {"name": "cmgi", "sentiment": "none"}, {"name": "pennsylvania state university", "sentiment": "none"}, {"name": "finance and administration", "sentiment": "none"}, {"name": "technology group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON, Jan. 16, 2018 (GLOBE NEWSWIRE) -- SV Health Investors, the venture capital and growth equity firm , has promoted Denise Marks to Chief Administrative Partner from Chief Financial Officer and Brent Faduski to Chief Financial Officer from Controller.\nAs Chief Administrative Partner, Ms. Marks now oversees and leads all aspects of SV’s operating activities, including legal, compliance, human resources, IT, marketing and facilities management. She also works with the firm’s managing partners on firm strategy and structuring, and provides deal support to deal teams and serves as the firm’s Chief Compliance Officer. Ms. Marks previously led the firm’s US finance team and oversaw operations in the US.\nPrior to joining SV in 2003, Ms. Marks was Vice President of Finance and Administration and Managing Director at CMGI @Ventures, where she was responsible for all financial and operational aspects of the firm’s venture arm. Before that she was a manager in the Technology Group at PricewaterhouseCoopers. She holds a BS in Finance and Economics from Pennsylvania State University and a joint MS in Accounting and MBA from Northeastern University.\nAs Chief Financial Officer, Mr. Faduski will oversee all finance and accounting activities for the firm and its seven funds. In his previous role as Controller, he handled fund accounting and reporting, as well as tax compliance. He also provided portfolio support to SV deal teams, fundraising support and analytics for benchmarking, portfolio management, exit modeling and valuations.\nMr. Faduski joined SV in 2008 from CMGI @Ventures, where he was Controller. He was previously a Senior Associate in the Technology Group at PricewaterhouseCoopers, where his clients included early stage venture-backed companies and venture capital funds. He holds a BA in Accounting from the University of Notre Dame.\n“It is with pleasure that we promote the leaders of our financial team. Denise Marks and Brent Faduski are long-tenured SV executives and have been critical to helping guide and manage the accelerated growth of the firm as well as providing invaluable support to our deal teams,” said SV Health Investors Managing Partner and Chief Operating Officer Paul LaViolette .\nSV manages seven funds that aim to support entrepreneurs and companies that create breakthrough treatments and healthcare solutions. The firm has a multi-sector focus. It invests in early-stage opportunities in biotechnology; early-stage and revenue-stage opportunities in medical devices; and growth equity opportunities with healthcare services and digital health companies.\nSV Health Investors’ funds have approximately $2 billion of capital commitments under management. Over the past 20 years, SV has invested in over 175 companies. During 2017, the firm closed on its sixth flagship fund at its target of $400 million.\nContact:\nKatarina Wenk-Bodenmiller\nSommerfield Communications, Inc.\n(212) 255-8386\nKatarina@sommerfield.com\nSource:SV Health Investors", "external_links": ["http://svhealthinvestors.com/team/paul-laviolette/", "https://www.globenewswire.com/NewsRoom/AttachmentNg/9c55282b-8e50-4f80-b4fa-2b7ceb05d5c9", "http://svhealthinvestors.com/", "http://svhealthinvestors.com/team/brent-faduski/", "http://svhealthinvestors.com/team/denise-marks/"], "published": "2018-01-16T19:20:00.000+02:00", "crawled": "2018-01-16T21:13:59.009+02:00", "highlightTitle": ""}