{"organizations": [], "uuid": "27f4ff76482d85b3d0e0c4a472f417c7ac3ba075", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-eleven-biotherapeutics-appoints-richard-fitzgerald-as-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "Eleven Biotherapeutics Appoints Richard Fitzgerald as Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.023, "site_type": "news", "published": "2018-01-24T23:12:00.000+02:00", "replies_count": 0, "uuid": "27f4ff76482d85b3d0e0c4a472f417c7ac3ba075"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-eleven-biotherapeutics-appoints-richard-fitzgerald-as-chief-financial-officer.html", "ord_in_thread": 0, "title": "Eleven Biotherapeutics Appoints Richard Fitzgerald as Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "richard fitzgerald", "sentiment": "negative"}, {"name": "fitzgerald", "sentiment": "none"}, {"name": "richard f. fitzgerald", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}], "organizations": [{"name": "eleven biotherapeutics, inc.", "sentiment": "neutral"}, {"name": "eleven biotherapeutics", "sentiment": "none"}, {"name": "vista", "sentiment": "none"}, {"name": "bla", "sentiment": "none"}, {"name": "biologics license application", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMBRIDGE, Mass.--(BUSINESS WIRE)-- Eleven Biotherapeutics, Inc. (NASDAQ:EBIO), a late-stage clinical oncology company advancing novel product candidates based on its Targeted Protein Therapeutics (TPTs) platform, today announced that Richard F. Fitzgerald has been appointed as full time Chief Financial Officer of the Company. Mr. Fitzgerald had been serving in the role on an interim basis since October 2017.\n“I’m excited by the opportunity to join Eleven as we finalize enrollment in our Phase 3 VISTA trial and are turning our attention towards preparing for a Biologics License Application (BLA) filing and commercial launch,” said Richard Fitzgerald, Chief Financial Officer of Eleven Biotherapeutics. “I look forward to helping drive Vicinium TM forward as a potential first significant new treatment for non-muscle invasive bladder cancer (NMIBC) in approximately 40 years.”\n“2018 is shaping up to be a transformative year for Eleven, and the addition of Richard Fitzgerald, a highly experienced CFO, further solidifies our leadership team and increases the likelihood that our efforts will be successful,” said Gregory Adams, Ph.D., Chief Scientific Officer of Eleven Biotherapeutics. “We are finalizing enrollment in our VISTA trial and expect 3-month data to be released in mid-2018. We are also particularly excited about the ongoing combination study of Vicinium TM and AstraZeneca’s PD-L1 checkpoint inhibitor durvalumab in patients with NMIBC. In addition to showing the safety and efficacy of this combination, the trial will also provide an in-depth assessment of Vicinium’s TM ability to initiate the host anti-tumor immune response that checkpoint inhibitors require to be effective. The biomarker data from this study will help support not only the continued development of Vicinium TM , but also the rest of Eleven’s TPT platform.”\nEleven’s TPT platform is designed specifically to offer patients new therapies that improve upon, and overcome the challenges of, existing therapeutic options. Eleven’s lead TPT, Vicinium TM , is currently in a Phase 3 trial in non-muscle invasive bladder cancer (NMIBC), with topline three-month data expected in mid-2018. In addition to exploring the potential of TPTs as a monotherapy, the Company is committed to building on preclinical evidence that TPTs are capable of promoting a local anti-tumor immune response. Eleven has signed a Cooperative Research and Development Agreement (CRADA) with the National Cancer Institute (NCI) for the evaluation of Eleven's targeted therapeutic, Vicinium TM in combination with AstraZeneca's immune checkpoint inhibitor, Imfinzi TM (durvalumab), for the treatment of NMIBC.\nAbout Eleven Biotherapeutics:\nEleven Biotherapeutics, Inc. is a late-stage, clinical oncology company advancing novel product candidates based upon the Company’s targeted protein therapeutics (TPTs) platform. TPTs incorporate a tumor-targeting antibody fragment and a protein cytotoxic payload into a single protein molecule in order to achieve focused tumor cell killing. Eleven’s lead TPT, Vicinium TM , is currently in a Phase 3 trial in non-muscle invasive bladder cancer, with topline three-month data expected in mid-2018. The Company believes its TPT approach offers significant advantages in treating cancer over existing antibody drug conjugate technologies. The Company believes its TPTs provide effective tumor targeting with broader cancer cell-killing properties than are achievable with small molecule payloads that require tumor cell proliferation and face multi-drug resistant mechanisms. Additionally, the Company believes that its TPT’s cancer cell-killing properties promote an anti-tumor immune response that will potentially combine well with immune oncology drugs such as checkpoint inhibitors. For more information, please refer to the Company’s website at www.elevenbio.com .\nCautionary Note on Forward-Looking Statements:\nAny statements in this press release about future expectations, plans and prospects for the Company, the Company’s strategy, future operations, and other statements containing the words “anticipate,” “believe,” “estimate,” “expect,” “intend,” “may,” “plan,” “predict,” “project,” “target,” “potential,” “will,” “would,” “could,” “should,” “continue,” and similar expressions, constitute forward-looking statements within the meaning of The Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by such forward-looking statements as a result of various important factors, including: the uncertainties inherent in the initiation and conduct of clinical trials, our ability to successfully develop our product candidates and complete our planned clinical programs, our ability to obtain marketing approvals for our product candidates, expectations regarding our ongoing clinical trials, availability and timing of data from clinical trials, whether interim results from a clinical trial will be predictive of the final results of the trial or results of early clinical studies will be indicative of the results of future studies, the adequacy of any clinical models, expectations regarding regulatory approvals, our ability to obtain, maintain and protect our intellectual property for our technology and products, other matters that could affect the availability or commercial potential of the Company’s product candidates and other factors discussed in the “Risk Factors” section of the Company’s Annual Report on Form 10-K, Quarterly Reports on Form 10-Q and other reports filed with the Securities and Exchange Commission. In addition, the forward-looking statements included in this press release represent the Company’s views as of the date hereof. The Company anticipates that subsequent events and developments will cause the Company’s views to change. However, while the Company may elect to update these forward-looking statements at some point in the future, the Company specifically disclaims any obligation to do so. These forward-looking statements should not be relied upon as representing the Company’s views as of any date subsequent to the date hereof.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124006125/en/\nStern Investor Relations, Inc.\nMichael Schaffzin, 212-362-1200\nmichael@sternir.com\nSource: Eleven Biotherapeutics", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.elevenbio.com&esheet=51748512&newsitemid=20180124006125&lan=en-US&anchor=www.elevenbio.com&index=1&md5=eb53352f352732f146408afb7c3a3e0f", "http://www.businesswire.com/news/home/20180124006125/en/"], "published": "2018-01-24T23:12:00.000+02:00", "crawled": "2018-01-25T02:03:55.000+02:00", "highlightTitle": ""}