{"organizations": [], "uuid": "41ea979f3448d9e2f1890bcf250fe1799715272f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/usa-shutdown-workers/anxiety-for-u-s-federal-workers-facing-government-shutdown-furloughs-idUSL2N1PH00Z", "country": "US", "domain_rank": 408, "title": "Anxiety for U.S. federal workers facing government shutdown furloughs", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T07:01:00.000+02:00", "replies_count": 0, "uuid": "41ea979f3448d9e2f1890bcf250fe1799715272f"}, "author": "", "url": "https://www.reuters.com/article/usa-shutdown-workers/anxiety-for-u-s-federal-workers-facing-government-shutdown-furloughs-idUSL2N1PH00Z", "ord_in_thread": 0, "title": "Anxiety for U.S. federal workers facing government shutdown furloughs", "locations": [], "entities": {"persons": [{"name": "chris kenning", "sentiment": "none"}, {"name": "jessica klement", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "none"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "national active and retired federal employees association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 22 (Reuters) - Thousands of federal workers faced anxiety about the status of their jobs and paychecks after U.S. Senate leaders failed to reach agreement to end a federal government shutdown before the work week begins on Monday.\nFunding for federal agencies ran out at midnight on Friday and was not renewed amid a dispute between U.S. President Donald Trump and Democrats over immigration.\nLate on Sunday, the Senate scheduled a vote on a stopgap spending measure for noon on Monday (1700 GMT), ensuring the federal government would stay shut in the morning and leaving workers uncertain how long it would last.\n“This is incredibly stressful,” said Jessica Klement, vice president at the National Active and Retired Federal Employees Association, which represents more than 20,000 workers.\n“Essential employees must report to work without knowing when they’ll be paid next. Non-essential employees will be forced to stay home without pay, not knowing if back pay will be provided,” she said.\nSome employees may not have received notice of their status on Friday, she added, so they could be going into work on Monday morning only to be sent home again.\nDuring shutdowns, non-essential government employees are furloughed, or placed on temporary unpaid leave. Workers deemed essential, including those dealing with public safety and national security, keep working.\nThe last shutdown, in October 2013, lasted more than two weeks and more than 800,000 federal employees were furloughed.\nThere is no official tally of how many would be off work this time. But local economies could be hurt in communities where thousands of non-essential personnel are likely to be off work, from Norfolk, Virginia, and Fayetteville, North Carolina, to Lakewood, Washington, and Oceanside, California.\nThe Centers for Medicare and Medicaid Services will continue to process applications for open enrollment, officials said, and the Medicare program for the elderly and disabled is expected to function largely without disruption.\nPamela Gillis Gilbertz, a health communication worker for the U.S. Centers for Disease Control and Prevention in Atlanta, told Reuters by phone on Sunday night that Congress had always paid workers retroactively - but that it was not guaranteed.\nHer agency is expected to keep providing what it calls “minimal support” during the shutdown, and has said it will keep responding to influenza outbreaks.\nGilbertz, who was planning to log into her office computer system on Monday for further guidance, said shutdowns could disrupt workers’ finances, even if they are eventually repaid.\n“For some people, it definitely will be a hardship, if you live paycheck to paycheck and you have bills that you need to pay,” she said. (Reporting by Chris Kenning in Chicago; Editing by Daniel Wallis and Peter Cooney)\n ", "external_links": [], "published": "2018-01-22T07:01:00.000+02:00", "crawled": "2018-01-22T07:28:05.015+02:00", "highlightTitle": ""}