{"organizations": [], "uuid": "ca92beda12d4edbe87bb9d896ecc809ffcb282c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-bankfinancial-corporation-reports-financial-results-for-2017-and-will-host-conference-call-and-webcast-on-january-30-2018.html", "country": "US", "domain_rank": 767, "title": "BankFinancial Corporation Reports Financial Results for 2017 and Will Host Conference Call and Webcast on January 30, 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T00:35:00.000+02:00", "replies_count": 0, "uuid": "ca92beda12d4edbe87bb9d896ecc809ffcb282c7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-bankfinancial-corporation-reports-financial-results-for-2017-and-will-host-conference-call-and-webcast-on-january-30-2018.html", "ord_in_thread": 0, "title": "BankFinancial Corporation Reports Financial Results for 2017 and Will Host Conference Call and Webcast on January 30, 2018", "locations": [], "entities": {"persons": [], "locations": [{"name": "burr ridge", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}], "organizations": [{"name": "bankfinancial corporation reports financial results", "sentiment": "neutral"}, {"name": "bankfinancial corporation", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BURR RIDGE, Ill., Jan. 29, 2018 (GLOBE NEWSWIRE) -- BankFinancial Corporation (Nasdaq:BFIN) (the “Company”) announced today that the Company recorded net income of $9.0 million for the year ended December 31, 2017, a 20% increase compared to the previous year results. Earnings per share for the year ended December 31, 2017 were $0.49 on a basic and diluted basis.\nFor the fourth quarter of 2017, the Company recorded net income of $991,000 and basic and diluted earnings per share of common stock of $0.06, compared to $2.3 million and $0.12 per share for the fourth quarter of 2016. The Company’s fourth quarter 2017 net income is net of $2.5 million ($0.14 basic and diluted earnings per share) additional income tax expense due to the enactment of the Tax Cuts and Jobs Act of 2017. Total loans declined by $21 million in the fourth quarter of 2017 due to accelerated payments and prepayments of investment-grade leases, and total deposits declined by $31 million during the fourth quarter of 2017 due to a reduction of wholesale deposits. The average yield on the loan portfolio for the quarter ended December 31, 2017 was 4.22%, a 9% increase compared to the fourth quarter of 2016, as a result of changes in the loan portfolio composition and higher market rates during 2017.\nFor the year 2017, commercial & industrial loans increased by $53.5 million (54.0%), multi-family residential real estate loans increased by $45.5 million (8.4%) and middle-market commercial leases increased by $18.1 million (21.4%), offset by declines in the balances of residential mortgage loans, commercial real estate mortgage loans and investment-grade commercial leases due primarily to prepayment activity. Total commercial-related loan balances reached a new record level of $1.22 billion, and now comprise 92.5% of total loans, compared to 89.6% at the end of 2016.\nThe Company’s asset quality remained favorable. The ratio of nonperforming loans to total loans was 0.18% and the ratio of non-performing assets to total assets was 0.29% at December 31, 2017. Non-performing commercial-related loans represented 0.03% of total commercial-related loans.\nTotal retail and commercial deposits were stable in 2017. The Company introduced several new deposit account types to attract new customers and expand relationships with existing customers. The Company’s liquid assets exceeded 13% of total assets at December 31, 2017. The Company intends to continue to develop new products, service delivery channels and marketing capabilities to further position it for future loan growth and the expansion of non-interest income.\nThe Company’s capital position remained strong with a Tier 1 leverage ratio of 11.49%. During 2017, the Company increased its quarterly dividend rate by 33% to $0.08 per share from $0.06 per share and repurchased 719,573 common shares (or 3.7% of the common shares that were outstanding at the beginning of 2017). The Company’s tangible book value per share increased in 2017 by 4% to $10.99.\n“Our 2017 results reflect the successful execution of key business plan objectives, including accelerating our growth in commercial loans, maintaining strong asset quality and improving our overall efficiency. We look forward to further improvements in these positive trends in 2018,” said F. Morgan Gasior, the Chairman and CEO of the Company.\nThe Company’s Quarterly Financial and Statistical Supplement will be available today on BankFinancial's website, www.bankfinancial.com on the “Stockholder Information” page, and through the EDGAR database on the SEC's website, www.sec.gov . The Quarterly Financial and Statistical Supplement includes comparative GAAP and non-GAAP performance data and financial measures for the most recent five quarters.\nBankFinancial's management will review fourth quarter 2017 results in a conference call and webcast for stockholders and analysts on Tuesday, January 30, 2018 at 9:30 a.m. Chicago, Illinois Time. The conference call may be accessed by calling (844) 413-1780 using participant passcode 1498779. The conference call will be simultaneously webcast at www.bankfinancial.com , “Investor Relations” page. For those unable to participate in the conference call, the webcast will be archived through 11:59 p.m. Chicago Time February 27, 2018.\nBankFinancial Corporation is the holding company for BankFinancial, NA, a national bank providing financial services to individuals, families and businesses through 19 full-service banking offices, located in Cook, DuPage, Lake and Will Counties, Illinois and to selected commercial loan and deposit customers on a regional or national basis. BankFinancial Corporation's common stock trades on the Nasdaq Global Select Market under the symbol BFIN. Additional information may be found at the company's website, www.bankfinancial.com .\nThis release includes “forward-looking statements” as defined in the Private Securities Litigation Reform Act of 1995. A variety of factors could cause BankFinancial’s actual results to differ from those expected at the time of this release. For a discussion of some of the factors that may cause actual results to differ from expectations, please refer to BankFinancial’s most recent Annual Report on Form 10-K as filed with the SEC, as supplemented by subsequent filings with the SEC. Investors are urged to review all information contained in these reports, including the risk factors discussed therein. Copies of these filings are available at no cost on the SEC's web site at www.sec.gov or on BankFinancial’s web site at www.bankfinancial.com . Forward looking statements speak only as of the date they are made, and we do not undertake to update them to reflect changes.\nFor Further Information Contact: Shareholder, Analyst and Investor Inquiries: Media Inquiries: Elizabeth A. Doolan\nSenior Vice President – Finance\nBankFinancial Corporation\nTelephone: 630-242-7151 Gregg T. Adams\nPresident – Marketing & Sales\nBankFinancial, NA\nTelephone: 630-242-7234\nSource:BankFinancial Corporation", "external_links": ["https://www.globenewswire.com/Tracker?data=4VuZwr2BUwhYuzezfce67mB19Mqf57NO7xIvAFPipH-kEaLX4IYl0QZVM0e9lfLWcEGo6Xb0xlO7slNa5Lw5j-tsgLCxDtid0-7p9OIKTWA=", "https://www.globenewswire.com/Tracker?data=4VuZwr2BUwhYuzezfce67mB19Mqf57NO7xIvAFPipH9onlWSTx1nfm24Au5ZQv2oCiN9Un-pig0yJKGDGz1o3DeJBu3JcNSOFW_aITHsPQ0=", "https://www.globenewswire.com/Tracker?data=4VuZwr2BUwhYuzezfce67mB19Mqf57NO7xIvAFPipH89Cm8vsk3VJZrcGps1LmbjbbwQZJZ1YgBy-8TEDe2WUInM2jf9Si4Ld08pjdK5wRI=", "https://www.globenewswire.com/Tracker?data=4E4fTabeZtN0-cRniB_iveZzFyN3yM4eycwYrzQHLXagsFBHtotTgOt-i-aYRoYXRUQ-GJw-V2LBs5dMn-vibw=="], "published": "2018-01-30T00:35:00.000+02:00", "crawled": "2018-01-30T03:54:53.012+02:00", "highlightTitle": ""}