{"organizations": [], "uuid": "cc2b7deb1d4906e86846c20fd719182196810816", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-demandbridge-announces-acquisition-of-kramer-smilko-inc-taking-another-step-in-strategic-consolidation-to-become-a-leader-in.html", "country": "US", "domain_rank": 767, "title": "DemandBridge Announces Acquisition of Kramer-Smilko, Inc., Taking Another Step in Strategic Consolidation to Become a Leader in the Marketing Automation Software Industry", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T01:36:00.000+02:00", "replies_count": 0, "uuid": "cc2b7deb1d4906e86846c20fd719182196810816"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-demandbridge-announces-acquisition-of-kramer-smilko-inc-taking-another-step-in-strategic-consolidation-to-become-a-leader-in.html", "ord_in_thread": 0, "title": "DemandBridge Announces Acquisition of Kramer-Smilko, Inc., Taking Another Step in Strategic Consolidation to Become a Leader in the Marketing Automation Software Industry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NORCROSS, Ga., Jan. 30, 2018 /PRNewswire/ -- DemandBridge, an integrated business platform delivering seamless marketing solutions in the cloud, today announced the acquisition of Kramer-Smilko, Inc. The acquisition furthers DemandBridge's commitment to empower Distributors/Agencies with total quality control over their business, and the ability to maximize efficiency utilizing market-leading software and products. It also demonstrates the value of strategic partnerships and the commitment to providing the tools and expertise to enable their customers to grow. The new company will retain the DemandBridge name.\nDemandBridge and Kramer-Smilko, Inc. have been providing premier Distributor Management software for more than 30 years. With the recent union of e-Quantum, Inc., together, the three companies bring more than 90 years of experience and growth within and beyond the Independent Print Services Industry. The Independent Print Services Industry is undergoing a period of intense change that is rejuvenating the competitive landscape in an attempt to embrace and empower technology innovations. The new, independent company will be led by current DemandBridge CEO David Rich, who himself brings more than 35 years of Enterprise IT experience. John Smilko will remain with DemandBridge in his current capacity. DemandBridge will combine the vision, talent, technology prowess and investments of all strategic acquisitions in order to remain vital and competitive in the marketing automation software industry. Together, the new company will evolve and transition its products to leverage DemandBridge's presence on the Microsoft Azure Cloud and to integrate technologies in the pipeline—from Microsoft PowerBI and Cloud Foundry, to other digital marketing technologies planned for 2018 and beyond. The combination and strategic focus will offer the scale, strength and flexibility to help customers and partners succeed with minimal disruption and the same/improved level of customer service.\nABOUT DEMANDBRIDGE\nFor years, the industry has known DemandBridge for its complete set of end-to-end tools—that is, technology that connects a company's accounting, operations and inventory systems, as well as an e-Commerce portal and sourcing tool for on-demand marketing, promotion and print services. That technology is used by some of the industry's largest Distributors/Agencies, over 3,000 loyal brands and 1.2 million registered users. The collective spend under management makes it one of the biggest Marketing Execution Platforms available in the market.\n\"We continue to uncover opportunities to help our clients succeed in new ways,\" said CEO David Rich. \"End user demands are changing, the brands themselves are changing, and the goals of our forward-thinking Distributor/Agency/Corporate customers are evolving accordingly,\" Rich continued. \"Simply put, Marketing Service Providers who want to grow their businesses beyond traditional services (i.e. Print/Promotional goods)...will need more enabling technology than the previous generations. By consolidating the talents of DemandBridge, e-Quantum and Kramer-Smilko...and together with customers who have expressed willingness to co-develop with us...we will take a major step forward to providing the resources and technology platforms this industry needs to confidently approach business in the 2020's.\"\nABOUT KRAMER-SMILKO, INC.\nKramer-Smilko, Inc. has served the print sourcing and distribution market for 38 years. The software platform they have built, sold and supported now processes half a billion dollars in annual sales for its customer base. Kramer-Smilko has a strong presence in health care, banking, finance, and insurance, providing very sophisticated e-Commerce based supply chain management services. In addition to classic print management and distribution, they have integrated office supplies, print on-demand, digital content management, one-to-one marketing, promotional products, 3rd party fulfillment, and MRO inventory capabilities into its offerings.\n\"This combination expands DemandBridge's industry footprint, furthering DemandBridge's growth and technology consolidation strategy,\" said Kramer-Smilko Owner John Smilko. \"In order to leverage our capabilities and do what the industry requires with respect to platform development, we must have the strength of numbers that this partnership brings,\" he continued. \"Together, we will have the broadest, most integrated suite of products and services for Distributors, Agencies, and Corporations and the resources to grow along with our customers. Everybody wins!\"\nCompany locations will remain the same.\nContact Information:\nMarcy Wright & Cori Jackson, DemandBridge + John Smilko, Kramer-Smilko, Inc.\nDemandBridge\nKramer-Smilko, Inc.\n3500 Parkway Lane — Suite 300\n2107 Laurel Bush Road — Suite 101\nNorcross, GA 30092\nBel Air, MD 21015\n770 448 1484\n410 569 5725\nwww.demandbridge.com\nwww.kramer-smilko.com\nDavid Rich, Chairman + CEO\n189584@email4pr.com\n189584@email4pr.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/demandbridge-announces-acquisition-of-kramer-smilko-inc-taking-another-step-in-strategic-consolidation-to-become-a-leader-in-the-marketing-automation-software-industry-300590716.html\nSOURCE DemandBridge LLC", "external_links": ["http://www.kramer-smilko.com/", "http://www.demandbridge.com/", "http://www.prnewswire.com/news-releases/demandbridge-announces-acquisition-of-kramer-smilko-inc-taking-another-step-in-strategic-consolidation-to-become-a-leader-in-the-marketing-automation-software-industry-300590716.html"], "published": "2018-01-31T01:36:00.000+02:00", "crawled": "2018-01-31T02:07:05.000+02:00", "highlightTitle": ""}