{"organizations": [], "uuid": "d62abf61cbaa3a11739d343f6b90a005d3ccd3d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-nine-energy-service-inc-prices-initial-public-offering.html", "country": "US", "domain_rank": 767, "title": "Nine Energy Service, Inc. Prices Initial Public Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T03:16:00.000+02:00", "replies_count": 0, "uuid": "d62abf61cbaa3a11739d343f6b90a005d3ccd3d9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-nine-energy-service-inc-prices-initial-public-offering.html", "ord_in_thread": 0, "title": "Nine Energy Service, Inc. Prices Initial Public Offering", "locations": [], "entities": {"persons": [], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "nine energy service, inc.", "sentiment": "neutral"}, {"name": "nine energy service, inc", "sentiment": "neutral"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "wells fargo securities", "sentiment": "none"}, {"name": "credit suisse", "sentiment": "none"}, {"name": "j.p. morgan", "sentiment": "none"}, {"name": "nine", "sentiment": "none"}, {"name": "goldman sachs & co", "sentiment": "none"}, {"name": "bofa merrill lynch", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 18, 2018 (GLOBE NEWSWIRE) -- Nine Energy Service, Inc. (NYSE:NINE) (“Nine”) announced today the pricing of its initial public offering of 7,000,000 shares of its common stock at $23.00 per share. The shares are expected to begin trading on January 19, 2018 on the New York Stock Exchange under the ticker symbol “NINE.” Nine has granted the underwriters of the offering a 30-day option to purchase up to an additional 1,050,000 shares of Nine’s common stock at the initial public offering price, less underwriting discounts and commissions. The offering is expected to close on January 23, 2018, subject to customary closing conditions.\nJ.P. Morgan, Goldman Sachs & Co. LLC and Wells Fargo Securities are acting as joint book-running managers and as representatives of the underwriters for the offering. BofA Merrill Lynch and Credit Suisse are also acting as joint book-running managers for the offering. The offering of these securities will be made only by means of a prospectus that meets the requirements of Section 10 of the Securities Act of 1933. Copies of the written prospectus for the offering may be obtained, when available, from:\nJ.P. Morgan Securities LLC\nc/o Broadridge Financial Solutions\n1155 Long Island Avenue\nEdgewood, New York 11717\nTelephone: (866) 803-9204\nprospectus-eq_fi@jpmchase.com\nGoldman Sachs & Co. LLC\nAttention: Prospectus Department\n200 West Street\nNew York, New York 10282\nTelephone: (866) 471-2526\nprospectus-ny@ny.email.gs.com\nWells Fargo Securities, LLC\nAttention: Equity Syndicate Department\n375 Park Avenue\nNew York, New York 10152\nTelephone: (800) 326-5897\ncmclientsupport@wellsfargo.com\nAbout Nine Energy Service, Inc.\nNine Energy Service, Inc. is a leading North American onshore completion and production services provider that targets unconventional oil and gas resource development. Nine partners with exploration and production customers across all major onshore basins in both the U.S. and Canada to design and deploy downhole solutions and technology to prepare horizontal, multistage wells for production. Nine is headquartered in Houston, Texas with operating facilities in the Permian, Eagle Ford, MidCon, Barnett, Bakken, Rockies, Marcellus, Utica and throughout Canada.\nImportant Information\nA registration statement relating to these securities has been filed with, and been declared effective by, the Securities and Exchange Commission (the “SEC”). The registration statement may be obtained free of charge at the SEC’s website at www.sec.gov under “Nine Energy Service, Inc.” This press release shall not constitute an offer to sell or the solicitation of an offer to buy nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such state or jurisdiction.\nCautionary Statement Concerning Forward-Looking Statements\nCertain statements contained in this press release constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements, including statements regarding the closing of the initial public offering, represent Nine’s expectations or beliefs concerning future events, and it is possible that the results described in this press release will not be achieved. These forward-looking statements are subject to risks, uncertainties and other factors, many of which are outside of Nine’s control, that could cause actual results to differ materially from the results discussed in the forward-looking statements.\nAny forward-looking statement speaks only as of the date on which it is made, and, except as required by law, Nine does not undertake any obligation to update or revise any forward-looking statement, whether as a result of new information, future events or otherwise. New factors emerge from time to time, and it is not possible for Nine to predict all such factors. When considering these forward-looking statements, you should keep in mind the risk factors and other cautionary statements in the prospectus filed with the SEC in connection with Nine’s initial public offering. The risk factors and other factors noted in Nine’s prospectus could cause its actual results to differ materially from those contained in any forward-looking statement.\nContacts\nNine Energy Service, Inc.\nHeather Schmidt, Director, Investor Relations & Marketing\n(281) 730-5113\ninvestors@nineenergyservice.com\nSource:Nine Energy Service, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=5Z4RJAL1HN3f7HtZCIB0fOPy9JWM_E52aJ2YSl3E5VCWe3UtWKDTdNkjPPokdigFDr2PqR9SbkUqZgyS1lUMUI81Os8ZzUatjRWYOzDLM4KIDA2pGRtT_JC-8dKwClG7", "https://www.globenewswire.com/Tracker?data=LpnMUwEhOQUEivlIzA2oaeYGHjzPENyWo9J5lEfUVGbk_5lMka6IpH3eS-mpavaaGsBPZraqPQRqq5BWJQkZEUhArVBUBwsa4kz6N5ZV9M4uSsJENDItg8ywXPb-J3-6", "https://www.globenewswire.com/NewsRoom/AttachmentNg/d5f4fe96-a5bc-4d95-9b58-47d0a1252a58"], "published": "2018-01-19T03:16:00.000+02:00", "crawled": "2018-01-19T05:18:39.110+02:00", "highlightTitle": ""}