{"organizations": [], "uuid": "012385c87efc8a9ad5faef0096d93ba0f59990bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-589152508.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/30/tax-reform-goldman-sachs/", "country": "US", "domain_rank": 1196, "title": "Taxes: What Tax Reform Means to Goldman Sachs | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.15, "site_type": "news", "published": "2018-01-30T12:14:00.000+02:00", "replies_count": 0, "uuid": "012385c87efc8a9ad5faef0096d93ba0f59990bf"}, "author": "Shawn Tully", "url": "http://fortune.com/2018/01/30/tax-reform-goldman-sachs/", "ord_in_thread": 0, "title": "Taxes: What Tax Reform Means to Goldman Sachs | Fortune", "locations": [], "entities": {"persons": [{"name": "shawn tully", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "goldman sachs", "sentiment": "negative"}, {"name": "citigroup", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "wells fargo", "sentiment": "none"}, {"name": "johnson & johnson", "sentiment": "none"}, {"name": "jpmorgan chase", "sentiment": "none"}, {"name": "comcast", "sentiment": "none"}, {"name": "verizon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Shawn Tully 10:14 AM EST \nConfused about the new tax law? Join the crowd. The tax reforms are having wildly different impacts on different companies–and no company illustrates those discrepancies better than Wall Street titan Goldman Sachs . \nMarquee names from Comcast to Verizon and Wells Fargo announced earnings windfalls from the landmark legislation, while such stalwarts as Johnson & Johnson , Citigroup , and JPMorgan Chase booked hefty charges. Nevertheless, most players that took big hits to fourth quarter earnings were buoyant, lauding the legislation as a giant positive that will substantially lift their profits in the years to come. \nAt the same time, analysts fret that the pride of American business in recent years, tech lions including Apple, may ultimately be worse off under the new regime . The reason: They’ll lose the mother of all tax shelters, the option of lodging big chunks of their foreign earnings overseas, where those profits can reside free of U.S. cash taxes for years. \nSure, the new law should prove a boon for corporate profits in general–the ebullience over equities proves that investors are already making that bet, big time. But the regime’s rationale, essentially instituting far lower rates while eliminating sweeping tax shelters, affects different companies in extremely different ways. To understand why the law benefits certain enterprises far more than others, it’s critical to examine how its “under-the-hood” mechanics actually operate. \nTo grasp how the counter-currents of the new regime actually reshape a company’s finances, Fortune took a deep dive into Goldman Sachs, one of the first companies to issue a big write-down resulting from the new legislation. Two experts on corporate taxation provided invaluable assistance in the analysis that follows: Jeffrey Kadet, who spent his career in the field and serves as an adjunct professor at the University of Washington School of Law; and Albert Meyer, a forensic accountant, and chief of asset management firm Bastiat Funds. \nA close look at Goldman reveals a number of features that affect how much tax it will book against income, and pay in cash, now and in the future. Among them: \n–Goldman holds a giant hoard of earnings situated in foreign subsidiaries, where they’ve been accumulating free of U.S. taxes for many years. Now, Goldman is obligated to technically bring those profits home, and pay “repatriation” levies to the U.S. Treasury. Still, Goldman is getting a big break compared to what it would have cost to repatriate those earnings in the past. \n–Like other U.S. multinationals, Goldman is obliged to book the entire charge to earnings prompted by tax reform right away, in Goldman’s case, in Q4 of 2017. But Goldman and other multinationals aren’t required to pay those charges in cash right away. The new law allows companies to make the cash payments over an extended period, with the bulk of the total back-loaded to the final years. Along with the new, far lower rate on repatriated earnings, that’s a second break. \n–Goldman will lose a source of savings because the new law eliminates the ability to pay no tax on 100% of foreign earnings that are reinvested abroad. The new law also imposes what amounts to a minimum levy for profits generated in low-tax jurisdictions, profits that previously went untaxed, under the acronym GILTI. Still, the benefits that Goldman derived from the foreign earnings exclusions, while big, aren’t nearly as gigantic as the savings harvested by Apple and other tech giants. Hence, the loss of those benefits is easily offset by a modestly lower rate on future earnings, not to mention new “freedom” to move money to the most places offering the highest returns. \nSo let’s examine what Goldman has been booking in annual taxes, what it has been accumulating abroad to somewhat lower that number, and what it will actually “pay,” both in accrued taxes and cash–quite different numbers–to repatriate tens of billions in foreign profits. The Basics: Goldman’s big write-down \nOn Dec. 22, President Trump signed the Tax Cut and Jobs Act of 2017 into law. Six days later, Goldman issued an 8K disclosing that it would take a charge of “approximately $5 billion in the firm’s fourth quarter ending December 31, 2017, approximately two-thirds of which is due to the repatriation tax.” But in its Q4 earnings release, published on January 17, Goldman adjusted the estimate downwards , stating that “the firm recorded $4.4 billion in tax expense related to Tax Legislation.” In that release, Goldman also disclosed in a footnote that repatriation tax portion of the $4.4 billion amounted to $3.32 billion. \nThe Tax Cut and Jobs Act changed U.S. corporate tax law in two especially crucial ways. First, under the previous system, U.S. companies were obligated to book the extremely high, U.S. corporate rate of 35% on all earnings, both domestic and foreign, with one big exception we’ll get to shortly. The U.S. tax rules on foreign earnings allowed multinationals to reduce any future U.S tax imposed upon dividend repatriations with levies paid in the country where the foreign profits were generated. So if an Irish subsidiary paid the maximum rate of 12.5% in Ireland, it would officially owe the balance of 22.5% to the U.S. Treasury. \nThat system is radically different from those of almost all other OECD nations, which have long employed “territorial” regimes mandating that the parent companies pay little or no further tax upon dividend repatriations, so that all the group will ever pay is the foreign tax obligations of the their foreign subs, i.e., only the local levies in the nations where the profits are generated. In other words, most foreign companies would pay the 12.5% in Ireland, with no additional tax due at home. \nNaturally, U.S. multinationals balked at covering an all-in rate of 35%, one of the highest burdens in the industrialized world. But in practice, they didn’t have to, because of that big exception noted above. The guidelines established by the predecessor to the Financial Accounting Standards Board (FASB), the body that establishes America’s corporate accounting rules, provided the following loophole: If the foreign sub “permanently reinvested” its offshore earnings in, say, France or Japan instead of repatriating those profits to the U.S. parent as dividends, the multinational could avoid booking the extra U.S. tax on all those reinvested profits. Indeed, “permanently reinvested foreign profits” have been accumulating free of U.S. taxes, year after year, at Apple, Qualcomm , Goldman and hundreds of other multinationals. The total earnings situated in foreign subs is estimated at some $3 trillion. \nIn an historic shift, the new law moved the U.S. from a “national” regime that taxed all earnings at the U.S. rate (albeit for foreign earnings not until repatriation), to a “territorial” system where, like most countries, tax is due primarily in the nation where the profits are generated. In the process, the law effectively nixed by far the biggest benefit in the corporate tax code: that 100% shield for U.S. taxes that weren’t repatriated. (As we’ll see, U.S. multinationals will not get the full benefit of booking profits in tax shelter nations because of the GILTI, which amounts to a minimum levy, payable in the U.S., on profitable income from low-tax jurisdictions.) \nThe legislation also imposed a “deemed” repatriation of all accumulated earnings lodged abroad, meaning U.S. companies need to immediately accrue U.S. tax on their overseas hordes, and book a one-time charge on those accumulated earnings–falling in the fourth quarter of 2017, when the Tax Cut and Jobs Act was enacted. \nSecond, the Tax Cut and Jobs act radically lowered America’s 35% rate to 21%, bringing our levy far closer to that of rival nations. Once again, the new law coupled that low rate with what resembles a minimum tax on overseas earnings. That levy, enacted under the acronym GILTI (Global Intangible Low Tax Income provision), is complex. But in the most basic terms, it imposes the U.S. rate of 21% on as much as half of high-margin foreign earnings, such as large profits generated from the ownership of patents and other intellectual property. In low-tax jurisdictions such as Ireland, that provision could easily raise the take on profits booked in those nations by several points. \nHence, many multinationals that were paying only the local rate, and leaving profits abroad free of U.S. tax, will now, for the first time, need to pay not just the foreign tax, but an extra tax to the U.S. Treasury under the GILTI. The upside: That extra tax will be a lot lower than the difference between the local levy and 35% upon dividend repatriation required prior to the new law. \nIt’s these two groundbreaking changes that caused most U.S. multinationals, including Goldman, to book big tax charges. To fully dissect the Goldman write-down, it’s critical to study its tax status prior to the new legislation. \nIn 2016, Goldman booked total corporate taxes, comprising U.S. federal, U.S. state and local, and foreign, of $2.96, billion on $10.3 billion in pre-tax income, for an effective rate of 28.2%. \nIt’s interesting that Goldman does not disclose the breakdown between its taxable income generated by U.S. and foreign operations. But in a table on page 185 of the 10K, Goldman discloses the specifics of how it lowered its tax accruals for 2016 from the statutory rate of 35%, to 28.2%. Besides such relatively small factors as tax credits (lowering rates) and state and local taxes (raising rates), the overwhelmingly important item is a line called “non-U.S. operations,” which alone reduces the 35% rate by 6.7 points, or $690 million. Anatomy of the repatriation tax \nThat break arises from America’s biggest, and now bygone, corporate tax benefit: The treatment of “permanently reinvested” foreign earnings. On page 186, Goldman discloses that its accumulated overseas profits rose from $28.55 billion to $31.24 billion, or $2.69 billion, from 2015 to 2016. It booked no U.S. tax on a large portion of those additional overseas profits and indeed, leaving that bounty abroad accounted for most of the 6.7 point reduction in its tax rate. \nAs Goldman revealed on Dec. 28, the shift in status for that longstanding tax-shrinker accounted for the bulk of its big write-down. Let’s go through the math. On page 186, Goldman states, “The firm permanently reinvests eligible earnings of certain foreign subsidiaries and, accordingly, does not accrue any income taxes that would arise if such earnings were repatriated. As of December 31, 2016, this policy resulted in unrecognized deferred tax liability of $6.18 billion attributable to reinvested earnings of $31.24 billion.” \nThe new law mandates that multinationals immediately book U.S. tax on their caches of foreign profits. Once again, Goldman announced in its Q4 earnings release that it accrued a $3.32 billion charge in the quarter due to the repatriation tax. \nSo how did Goldman arrive at that figure? We don’t know exactly, for two reasons. First, Goldman adds substantially to reinvested foreign earnings each year; the number in 2016 was $2.6 billion and in 2015, it reached $3.7 billion. Those newly reinvested profits would increase the $6.2 billion Goldman would have owed. were it to repatriate profits, in 2016 under the old tax regime. But once again, we don’t know the precise size of the increase, since the 2017 10K hasn’t yet been released. \nSecond, Goldman gets a large foreign tax credit, or FTC, for levies already paid to foreign governments on those reinvested profits. We can surmise that these rates climb well into the double-digits, but Goldman doesn’t disclose the exact figures. \nDespite the unknowns, let’s make some estimated to show how the new mechanics for calculating the repatriation tax actually work. The previous rules on foreign profits stated that multinationals must calculate a 35% U.S. rate on pre-tax total foreign earnings, then subtract the amount paid to the foreign fiscs to arrive at what’s owed the U.S. Treasury upon any future repatriation. If an overseas sub of Company A posts pre-tax earnings of $100, and pays $10 in local tax, it’s obligated to pay––were it to repatriate those profits––$35 (35% of $100), less a $10 foreign tax credit (FTC), or a net of $25 in U.S. tax. If it permanently reinvested those profits so that the $25 would never be paid, it was still obligated to disclose in a footnote what would be owed were it to repatriate those accumulated earnings in a footnote. Goldman did this on page 186 of its 10K. \nThe new law establishes two rates on reinvested earnings: 15.5% on such “liquid” holdings as cash and securities, and 8% on difficult-to-sell “hard assets,” a category encompassing everything from office buildings to computers to private jets. A Goldman spokesperson told Fortune that virtually all of the $31.24 billion is in cash and other liquid investments, and hence subject to the higher, 15.5% rate. \nLet’s say that Goldman’s total reinvested income “grosses up” to $42 billion as of the end of 2017, before payments to foreign governments. On that amount, the total total tax due, minus foreign tax credits, would be 35% of $42 billion, or $14.7 billion. Now let’s assume that Goldman paid half of that, or $7.35 billion as taxes to overseas fiscs. So at the old 35% rate, it would owe $7.35 billion ($14.7 minus $7.35 billion) in U.S. taxes, up from $6.2 billion at the end of 2016. \nBut under the new regime, that $42 billion is being taxed not at 35%, but at the new rate of 15.5% on liquid earnings. So instead of total tax due of $14.7 billion, the new total bill would be $6.51 billion (15.5% of $42 billion). What about the FTC? The new law also stipulates that multinationals must reduce the foreign tax credit by the same proportion that their taxes were reduced–in this case, by 56% (going from 35% to 15.5% represents a 56% reduction). \nIn our hypothetical example, Goldman’s FTC would drop by 56%, from $7.35 billion to $3.2 billion. So Goldman’s new tax bill would be $6.51 billion less the FTC of $3.2 billion, or $3.31 billion, almost precisely what it reported. (This example was designed to produced that result.) \nStudying Goldman shows that the repatriation burden is a lot less burdensome than it first appears. Under the new law, Goldman–and fellow multinationals–got a big break, enabling them to book and pay a lot less tax on their “deemed” repatriation than if they’d repatriated the profits under the old system. In effect, Goldman is saving over 50% on repatriating earnings. Instead of owing something like $7.35 billion, it’s booking a charge of $3.3 billion. After subtracting the FTC, its tax rate is less than 10% on accumulated earnings, net of the FTC. Eight years to pay in cash \nAlthough Goldman took a total charge for the repatriation tax of $3.3 billion in Q4, it will benefit from an ultra-long, eight-year grace period to pay those levies in cash. And the biggest installments come at the end of that calendar. The new law allows multinationals to cover just 40% of their liability over the first five years (at 8% per annum), then pay 15% in year 6, 20% in year 7, and 25% in year eight. Hence, for Goldman and all others faced with deemed repatriations, the lengthy payment schedule is a major boon. The freedom to pay one-quarter of the cash owed in 2025, for example, means that the real cost, measured in 2018 dollars, is a lot less than $2.7 billion, because inflation will erode the value of those future payments. Goldman takes a hit in ‘tax assets’ \nCompanies regularly book what are called “deferred tax assets” in one year that lower their cash tax bills in the following year. This is caused by recognizing income for tax purposes prior to its being recognized for financial reporting purposes, or vice versa for expenses. \nThe higher the federal rate, the more those deferred tax assets are worth. For example, a company may have received an advance payment for consulting or advisory services in 2016 that it will actually furnish in 2017. Say that the 2016 cash received must be included in the company’s 2016 tax return. The tax paid will be booked as a deferred tax asset on the 2016 balance sheet. \nBut in 2017, the company will book the income (since that’s the year in which it supplied the work), but pay no further cash tax on that income (since the tax was already been paid in 2016). So in 2017, Goldman or any other company in our example would lower its deferred tax assets on the balance sheet by the amount of the pre-paid tax, and include both the income and the tax in its 2017 income statement, even though the tax was paid in cash during the previous year. \nThe additions to deferred assets and deferred tax liabilities–the latter often reflecting expenses like depreciation that will often be bigger on the tax return in earlier years than they’ll be in the accounting record–account for what’s referred to as “timing differences.” It’s the difference between the year in which the cash is received or paid out, and the year an expense or new revenue is booked on the income statement. Cash advanced in 2016 creates a deferred tax asset, and the non-cash expense to the income statement is taken in 2017. And those timing differences account for the second big charge to Goldman’s earnings. Put simply, if a company pre-pays $35 in cash taxes in year 1 on $100 in earnings at a 35% rate, and the rate drops to 21%, it only gets to deduct $21 from income in year two. Hence, the deferred tax credits on its balance sheet become a lot less valuable. \nMeyer, of Bastiat Capital, calculated the overall impact of those timing differences on Goldman. In 2016, Goldman held $5.22 billion in deferred tax assets, indicating that it had pre-paid taxes of that that amount on pre-tax income, to be booked in the future, of $14.92 billion ($5.22 is 35% of $14.92 billion.) Goldman also had deferred tax liabilities of $1.524 billion, just one-third of its deferred tax assets. \nBut because the tax law lowers the federal rate from 35% to 21%, Goldman’s deferred tax assets are now worth only about 60% of their previous value (the 21% rate is around 60% of the old 35% rate). So by Meyer’s reckoning, Goldman is writing down deferred tax assets by 40%, from $5.22 billion to $3.133 billion, for a charge of $2.089 billion. The value of the deferred tax liability, reflecting taxes to be paid in the future, moves in the opposite direction. It rises by 40% from $925 million to $1.542 billion, for an increase of $617 million. \nAll told, Goldman appears to have taken a net write-down on deferred taxes of $1.472 billion ($2.089 billion less $617 million). \nOnce again, we present those numbers to show how the math works. But as it turns out, Goldman wrote down a lot less than $1.472 billion from revaluing deferred tax assets and liabilities in 2017. The actual figure, as divulged in the Q4 report, was $1.1 billion. The reason: Clearly, the mix of deferred tax assets and liabilities shifted heavily, with the latter declining sharply relative to the former. We don’t know whether assets dropped or liabilities jumped, or whether both happened in tandem. A possible scenario: Goldman may have used up a lot of its valuable deferred tax assets to take advantage of their value at last year’s 35% rate. Only modest gains for Goldman \nOn its most recent conference call, the Goldman brass made an important point about what “repatriation” really means for a financial company. The firm stated that it will leave its foreign cash and investments right where they are now, mainly as bedrock capital needed to support its overseas investment banking and trading operations. Goldman isn’t Apple; this isn’t excess cash collecting interest, it’s funds hard at work supporting a sprawling financial empire. \nIt’s likely that the new regime will modestly raise Goldman’s future earnings, but not hugely. A recent note from Credit Suisse forecast that the Goldman’s tax rate will fall from a past average of 28.5% to 24%, and that its EPS in 2018 and 2019 will run 7.5% and 5% higher, respectively, than previous forecasts, mainly on the strength of the new legislation. \nThat’s good for Goldman, but the Tax Cut act does a lot more for the biggest commercial banks, notably JPMorgan Chase and Bank of America . The reason: Goldman is more international, and therefore benefited more than those rivals by reinvesting profits abroad. Its rate on foreign earnings may rise somewhat from the GILTI minimum tax, but the offset from the 21% rate on its domestic profits will still bring its overall rate down by several points. \nBy contrast, JPMorgan Chase and BofA are getting a gigantic tax cut, mainly because so much of their profits are derived stateside, and have been subject to the 35% (plus state and local) levies. JPMorgan Chase’s forecasts that its effective rate is expected to drop to 19% in future years from 32% in 2017, and BofA predicts a decrease from 29.8% to 20%. “Compared to most other large US banks, Goldman benefited more from the previous regime because more of its business is international,” says David Fanger, a senior vice president at Moody’s Investors Service. “Therefore, it got less of benefit from the big drop in the rate on domestic earnings.” \nDeconstructing Goldman taxes shows how tax reform means extremely different things for different players. Grasping those differences requires not a just a walk through the weeds, but slashing through zebra grass. Thanks for sticking with me. If you’ve read this far, I think you’ll have found that the journey was worth it. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-30T12:14:00.000+02:00", "crawled": "2018-01-30T18:55:13.030+02:00", "highlightTitle": ""}