{"organizations": [], "uuid": "d650d37db1d289d3de7f301ec20e0349f9316226", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-cib-marine-bancshares-inc-announces-2017-results.html", "country": "US", "domain_rank": 767, "title": "CIB Marine Bancshares, Inc. Announces 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T17:00:00.000+02:00", "replies_count": 0, "uuid": "d650d37db1d289d3de7f301ec20e0349f9316226"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-cib-marine-bancshares-inc-announces-2017-results.html", "ord_in_thread": 0, "title": "CIB Marine Bancshares, Inc. Announces 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "wis.", "sentiment": "none"}, {"name": "waukesha", "sentiment": "none"}], "organizations": [{"name": "cib marine bancshares, inc.", "sentiment": "neutral"}, {"name": "cib marine bancshares, inc", "sentiment": "neutral"}, {"name": "cib marine", "sentiment": "none"}, {"name": "cibm bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WAUKESHA, Wis., Jan. 31, 2018 (GLOBE NEWSWIRE) -- CIB Marine Bancshares, Inc. (the “Company” or “CIBM”) (OTCQB:CIBH), the holding company of CIBM Bank, announced its unaudited results of operations and financial condition for the fourth quarter and year-end 2017. During the fourth quarter of 2017, CIB Marine made special tax adjustment entries related to its deferred tax assets, including a partial reversal of its valuation allowance, and, as a result, it reported net income after tax of $23.9 million for the fourth quarter of 2017 and $27.0 million for the year 2017. Pre-tax net income for the fourth quarter of 2017 was $1.2 million or $0.07 basic and $0.03 diluted earnings per share, compared to $1.1 million for the same period of 2016 and $0.06 basic and $0.03 diluted earnings per share. Pre-tax net income for the year ended December 31, 2017, was $4.3 million or $0.24 basic and $0.12 diluted earnings per share, compared to $4.1 million or $0.23 basic and $0.12 diluted per share for the same period of 2016.\nSelect highlights for the quarter and year include:\nAt December 31, 2016, CIB Marine reported a deferred tax asset (“DTA”) of $41.6 million net of liabilities and a full valuation allowance resulting in a net DTA of $0. At December 31, 2017, CIB Marine reports a DTA of $30.3 million net of liabilities and a valuation allowance of $7.7 million for a net DTA of $22.6 million. CIB Marine’s recent earnings history and earnings outlooks, in addition to other facts and circumstances, were supportive of a valuation allowance adjustment at the end of 2017. The $7.7 million valuation allowance at December 31, 2017, represents the estimate at this time of state tax assets that are not anticipated to be utilized prior to their expiration. The $11.3 million reduction in the gross DTA between 2017 and 2016 is primarily due to the change in tax laws, including a federal tax rate decrease from 35% to 21%, and the utilization of tax assets during 2017 to reduce federal and state tax obligations. The federal Tax Cuts and Jobs Act passed in December 2017 resulted in a reduction of federal tax rates and eliminated the 20% alternative minimum tax, which was applicable to CIB Marine after use of tax assets on approximately 10% of its taxable income in 2017 and prior years. The adjustment in the valuation allowance against the DTAs at the end of 2017 resulted in a credit to tax expense of $24.4 million, thereby increasing net income after tax. As a result of the valuation allowance adjustments, CIB Marine will now report full tax expenses at applicable tax rates. However, those tax expenses reduce the carrying value of DTAs and, for the most part, are not remitted as tax payments. At applicable tax rates, a tax expense of $1.7 million was recorded against $4.3 million of pre-tax net income for 2017. Return on average assets was 4.19% for the year 2017, reflecting the tax entries and improved composition of operating income from core operating activities. Pre-tax, the return on average assets was 0.67% for the years 2017 and 2016. Pre-tax net income for subsidiary CIBM Bank was $1.6 million for the fourth quarter of 2017 compared to $1.2 million for the same period of 2016, and $5.2 million for the year 2017 compared to $4.3 million for the same period of 2016. Despite higher provisions for loan losses, CIBM Bank achieved improved revenues and lower expenses than the prior year. After tax, net income was $20.9 million reflecting $5.2 million in pre-tax operating income, $2.0 million in tax expense, and a $17.7 million credit tax provision to adjust the valuation allowance for the DTAs at CIBM Bank. Net interest income increased $1.4 million for the year 2017 compared to 2016. The increase was primarily due to improved rate spreads and higher average earning asset volumes. Non-interest income declined by $0.7 million in 2017 versus 2016. However, after adjusting for a $1.1 million difference in gain on sale of OREO between 2016 and 2017, the results were improved by $0.4 million. Improved core operating activities were primarily reflected in a $1.0 million increase in 2017 in gain on sale of SBA 7(a) loans versus 2016. Net mortgage banking revenues were down $0.6 million due primarily to the increase in interest rates and a corresponding reduction in mortgage refinancing. Provisions for loan losses were $0.2 million in 2017, reflecting an increase of $0.8 million over 2016. Although 2017 was another successful collection year, 2016 results reflected substantially more in recoveries. Non-performing assets to total assets declined to 1.13% at December 31, 2017, versus 1.67% at year-end 2016, reflecting a stronger economy and success in collection activities.\nMr. J. Brian Chaffin, President and CEO of CIB Marine Bancshares, Inc. commented, “Results in 2017 reflected improved core operating activities and successes in key initiatives. Despite rising interest rates and lower refinance volumes, our non-interest income benefited from the growth of our Government Guaranteed Lending Division, with SBA 7(a) sales activities contributing an additional $1 million to revenues in 2017. In addition, our average loan volumes were higher by $20 million and our average deposit volumes were higher by $19 million in 2017.”\nAddressing the special tax adjustment entries, Mr. Chaffin added, “Our recent earnings, financial condition, and continued earnings outlook were important in our analysis and timing for reversing a portion of our DTA valuation allowance. As a reminder, the DTA primarily originated from prior losses which more recently have been reducing our tax expenses and payment obligations. Our $22.6 million net DTAs represents the amount of future tax payments that we will not need to make based on reasonable estimates of our near term and long term taxable income forecasts. The protection of the tax assets should be important to all of our shareholders. A change in share ownership under federal tax laws could trigger a Section 382 limitation that would likely cause a significant increase in our valuation allowance against our tax assets. I would encourage any shareholder who may engage in a transaction that could trigger a Section 382 limitation to review our third quarter shareholder letter from November 2017 for more information.”\nMr. Chaffin concluded, “2017 reflected some of the rewards to our customers, employees and shareholders for the strategic adjustments we have made in the past few years, aided by a stronger economy. We have made significant strides in hiring new lenders within some markets and have improved our small business lending products and delivery.”\nCIB Marine Bancshares, Inc. is the holding company for CIBM Bank, which operates eleven banking offices and four mortgage loan offices in Illinois, Wisconsin and Indiana. More information on the Company is available at www.cibmarine.com , including recent shareholder letters, links to regulatory financial reports, and audited financial statements.\nFORWARD-LOOKING STATEMENTS\nCIB Marine has made statements in this release that may constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. CIB Marine intends these forward-looking statements to be subject to the safe harbor created thereby and is including this statement to avail itself of the safe harbor. Forward-looking statements are identified generally by statements containing words and phrases such as “may,” “project,” “are confident,” “should be,” “intend,” “predict,” “believe,” “plan,” “expect,” “estimate,” “anticipate” and similar expressions. These forward-looking statements reflect CIB Marine’s current views with respect to future events and financial performance that are subject to many uncertainties and factors relating to CIB Marine’s operations and the business environment, which could change at any time.\nThere are inherent difficulties in predicting factors that may affect the accuracy of forward-looking statements.\nStockholders should note that many factors, some of which are discussed elsewhere in this Earnings Release and in the documents that are incorporated by reference, could affect the future financial results of CIB Marine and could cause those results to differ materially from those expressed in forward-looking statements contained or incorporated by reference in this document. These factors, many of which are beyond CIB Marine’s control, include but are not limited to:\noperating, legal, and regulatory risks; economic, political, and competitive forces affecting CIB Marine’s banking business; the impact on net interest income and securities values from changes in monetary policy and general economic and political conditions; and the risk that CIB Marine’s analyses of these risks and forces could be incorrect and/or that the strategies developed to address them could be unsuccessful.\nThese factors should be considered in evaluating the forward-looking statements, and undue reliance should not be placed on such statements. Forward-looking statements speak only as of the date they are made. CIB Marine undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise. Forward-looking statements are subject to significant risks and uncertainties and CIB Marine’s actual results may differ materially from the results discussed in forward-looking statements.\nCIB MARINE BANCSHARES, INC. Selected Unaudited Consolidated Financial Data At or for the Quarters Ended Years Ended December 31, September 30, June 30, March 31, December 31, December 31, December 31, 2017 2017 2017 2017 2016 2017 2016 (Dollars in thousands, except share and per share data) Selected Statement of Operations Data Interest and dividend income $ 6,177 $ 6,056 $ 5,732 $ 5,562 $ 5,273 $ 23,527 $ 20,949 Interest expense 1,121 1,140 973 892 793 4,126 2,997 Net interest income 5,056 4,916 4,759 4,670 4,480 19,401 17,952 Provision for (reversal of) loan losses (218 ) 149 47 228 (796 ) 206 (548 ) Net interest income after provision for (reversal of) loan losses 5,274 4,767 4,712 4,442 5,276 19,195 18,500 Noninterest income (1) 2,015 2,257 2,611 1,847 1,908 8,730 9,400 Noninterest expense (benefit) 6,070 5,865 6,279 5,401 6,127 23,615 23,779 Income before income taxes 1,219 1,159 1,044 888 1,057 4,310 4,121 Income tax expense (benefit) (22,689 ) 25 20 0 (5 ) (22,644 ) 50 Net income $ 23,908 $ 1,134 $ 1,024 $ 888 $ 1,062 $ 26,954 $ 4,071 Common Share Data Basic net income per share $ 1.32 $ 0.06 $ 0.06 $ 0.05 $ 0.06 $ 1.49 $ 0.22 Diluted net income per share 0.65 0.03 0.03 0.02 0.03 0.74 0.11 Dividend 0 0 0 0 0 0 0 Tangible book value per share (2) 2.53 1.23 1.16 1.08 1.01 2.53 1.01 Book value per share (2) 2.04 0.75 0.68 0.60 0.53 2.04 0.53 Weighted average shares outstanding - basic 18,161,989 18,161,989 18,153,029 18,127,892 18,127,892 18,149,660 18,127,892 Weighted average shares outstanding - diluted 36,512,804 36,512,804 36,516,207 36,193,353 36,082,522 36,434,384 35,791,952 Financial Condition Data Total assets $ 662,394 $ 640,340 $ 650,051 $ 631,160 $ 653,559 $ 662,394 $ 653,559 Loans 483,611 490,089 488,289 483,501 483,518 483,611 483,518 Allowance for loan losses (7,701 ) (7,905 ) (7,653 ) (7,567 ) (7,592 ) (7,701 ) (7,592 ) Investment securities 114,801 112,670 111,160 111,745 112,072 114,801 112,072 Deposits 478,633 479,285 493,364 497,144 483,097 478,633 483,097 Borrowings 84,217 84,903 82,025 60,837 96,944 84,217 96,944 Stockholders' equity 97,066 73,556 72,279 70,819 69,523 97,066 69,523 Financial Ratios and Other Data Performance Ratios: Net interest margin (3) 3.25 % 3.07 % 3.09 % 3.02 % 2.84 % 3.11 % 3.01 % Net interest spread (4) 3.05 % 2.88 % 2.92 % 2.87 % 2.70 % 2.93 % 2.86 % Noninterest income to average assets (5) 1.26 % 1.37 % 1.65 % 1.16 % 1.18 % 1.36 % 1.53 % Noninterest expense to average assets 3.79 % 3.55 % 3.96 % 3.40 % 3.79 % 3.67 % 3.88 % Efficiency ratio (6) 85.84 % 81.76 % 85.20 % 82.88 % 95.91 % 83.95 % 86.94 % Earnings on average assets (7) 14.93 % 0.69 % 0.65 % 0.56 % 0.66 % 4.19 % 0.66 % Earnings on average equity (8) 124.19 % 6.11 % 5.71 % 5.10 % 5.93 % 36.85 % 5.88 % Asset Quality Ratios: Nonaccrual loans to loans (9) 0.69 % 0.99 % 0.99 % 1.32 % 1.26 % 0.69 % 1.26 % Nonaccrual loans, restructured loans and loans 90 days or more past due and still accruing to total loans (9) 1.02 % 1.30 % 1.36 % 1.65 % 1.60 % 1.02 % 1.60 % Nonperforming assets, restructured loans and loans 90 days or more past due and still accruing to total assets (9) 1.13 % 1.49 % 1.51 % 1.77 % 1.67 % 1.13 % 1.67 % Allowance for loan losses to total loans 1.59 % 1.61 % 1.57 % 1.57 % 1.57 % 1.59 % 1.57 % Allowance for loan losses to nonaccrual loans, restructured loans and loans 90 days or more past due and still accruing (9) 156.68 % 124.21 % 72.81 % 94.67 % 97.99 % 156.68 % 97.99 % Net charge-offs (recoveries) annualized to average loans -0.01 % -0.08 % -0.03 % 0.21 % 0.14 % 0.02 % -0.02 % Capital Ratios: Total equity to total assets 14.65 % 11.49 % 11.12 % 11.02 % 10.64 % 14.65 % 10.64 % Total risk-based capital ratio 16.62 % 16.05 % 15.93 % 15.90 % 15.40 % 16.62 % 15.40 % Tier 1 risk-based capital ratio 15.36 % 14.80 % 14.68 % 14.65 % 14.15 % 15.36 % 14.15 % Leverage capital ratio 12.39 % 11.41 % 11.56 % 11.21 % 11.14 % 12.39 % 11.14 % Other Data: Number of employees (full-time equivalent) 183 179 181 181 171 183 171 Number of banking facilities 11 11 11 11 11 11 11", "external_links": ["https://www.globenewswire.com/Tracker?data=0-j7eKEoQWzKBfDrmNfmmHP3zMqh9j7ZkYF_tq4Y1AQVrwR9QPU1hKlFS6fIs52mbSy4FoqZOgH_llEMFRaIWg=="], "published": "2018-01-31T17:00:00.000+02:00", "crawled": "2018-01-31T18:36:18.006+02:00", "highlightTitle": ""}