{"organizations": [], "uuid": "d05e049eb01c5862025c0823d817d4f2f67ffd77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-hospitality-properties-trust-prices-400-million-of-4-point-375-percent-unsecured-senior-notes-due-2030.html", "country": "US", "domain_rank": 767, "title": "Hospitality Properties Trust Prices $400 Million of 4.375% Unsecured Senior Notes Due 2030", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T00:55:00.000+02:00", "replies_count": 0, "uuid": "d05e049eb01c5862025c0823d817d4f2f67ffd77"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-hospitality-properties-trust-prices-400-million-of-4-point-375-percent-unsecured-senior-notes-due-2030.html", "ord_in_thread": 0, "title": "Hospitality Properties Trust Prices $400 Million of 4.375% Unsecured Senior Notes Due 2030", "locations": [], "entities": {"persons": [{"name": "pierce", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "newton", "sentiment": "none"}], "organizations": [{"name": "citigroup global markets inc.", "sentiment": "none"}, {"name": "fenner & smith incorporated.", "sentiment": "none"}, {"name": "wells fargo securities", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "bb&t securities", "sentiment": "none"}, {"name": "merrill lynch", "sentiment": "none"}, {"name": "smbc nikko securities america, inc.", "sentiment": "none"}, {"name": "bb&t capital markets", "sentiment": "none"}, {"name": "mizuho securities usa llc", "sentiment": "none"}, {"name": "bmo capital markets corp.", "sentiment": "none"}, {"name": "regions securities llc", "sentiment": "none"}, {"name": "bbva securities inc.", "sentiment": "none"}, {"name": "pnc capital markets llc", "sentiment": "none"}, {"name": "fifth third securities, inc.", "sentiment": "none"}, {"name": "u.s. bancorp investments, inc", "sentiment": "none"}, {"name": "rbc capital markets, llc", "sentiment": "none"}, {"name": "ubs securities llc", "sentiment": "none"}, {"name": "morgan stanley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEWTON, Mass.--(BUSINESS WIRE)-- Hospitality Properties Trust (Nasdaq: HPT) today announced that it has priced an underwritten public offering of $400 million of 4.375% unsecured senior notes due February 15, 2030. The settlement of this offering is expected to occur on February 2, 2018, subject to customary closing conditions.\nHPT expects to use the net proceeds from this offering to repay amounts outstanding under its unsecured revolving credit facility and for general business purposes.\nThe joint book-running managers for this offering were Citigroup Global Markets Inc., Merrill Lynch, Pierce, Fenner & Smith Incorporated., PNC Capital Markets LLC, Regions Securities LLC and U.S. Bancorp Investments, Inc. The joint lead managers for this offering were BBVA Securities Inc., Mizuho Securities USA LLC, Morgan Stanley, RBC Capital Markets, LLC, SMBC Nikko Securities America, Inc., UBS Securities LLC and Wells Fargo Securities, LLC. The co-managers for this offering were BB&T Capital Markets, a division of BB&T Securities, LLC, BMO Capital Markets Corp., Fifth Third Securities, Inc., FTN Financial Securities Corp. and Samuel A. Ramirez & Company, Inc.\nThis press release shall not constitute an offer to sell or a solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which the offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of that state or jurisdiction. Copies of the prospectus supplement relating to this offering and the related prospectus may be obtained by contacting the offices of: Citigroup, c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717 or by calling (800) 831-9146; Merrill Lynch, Pierce, Fenner & Smith Incorporated., NC1-004-03-43, 200 North College Street 3 rd Floor, Charlotte, NC 28255-0001, Attention: Prospectus Department, Email: dg.prospectus_requests@baml.com ; PNC Capital Markets LLC, 300 Fifth Avenue, Three PNC Plaza 10 th Floor, Pittsburgh, PA 15222 or by calling (855) 881-0697; Regions Securities LLC, by calling (404) 279-7400; and U.S. Bancorp, 214 N. Tryon St. 26 th Floor, Charlotte, NC 28202, Attention: Debt Capital Markets or by calling (877) 558-2607.\nHospitality Properties Trust is a real estate investment trust, or REIT, which owns a diverse portfolio of hotels and travel centers located in 45 states, Puerto Rico and Canada. HPT's properties are operated under long term management or lease agreements. HPT is managed by the operating subsidiary of The RMR Group Inc. (Nasdaq: RMR), an alternative asset management company that is headquartered in Newton, Massachusetts.\nWARNING REGARDING FORWARD LOOKING STATEMENTS\nTHIS PRESS RELEASE CONTAINS FORWARD LOOKING STATEMENTS WITHIN THE MEANING OF THE PRIVATE SECURITIES LITIGATION REFORM ACT OF 1995 AND OTHER SECURITIES LAWS. THESE FORWARD LOOKING STATEMENTS ARE BASED UPON HPT'S PRESENT BELIEFS AND EXPECTATIONS, BUT THESE STATEMENTS ARE NOT GUARANTEED AND THE IMPLICATIONS OF THESE STATEMENTS ARE NOT GUARANTEED TO OCCUR AND MAY NOT OCCUR FOR VARIOUS REASONS, SOME OF WHICH ARE BEYOND HPT’S CONTROL. FOR EXAMPLE:\nTHIS PRESS RELEASE STATES THAT THE SETTLEMENT OF THE SALE OF SENIOR NOTES IS EXPECTED TO OCCUR ON FEBRUARY 2, 2018. THE SETTLEMENT OF THIS OFFERING IS SUBJECT TO VARIOUS CONDITIONS AND CONTINGENCIES AS ARE CUSTOMARY IN UNDERWRITING AGREEMENTS IN THE UNITED STATES. IF THESE CONDITIONS ARE NOT SATISFIED OR THE SPECIFIED CONTINGENCIES DO NOT OCCUR, THIS OFFERING MAY NOT CLOSE. HPT'S CURRENT INTENT TO USE THE NET PROCEEDS FROM THIS OFFERING TO REPAY AMOUNTS OUTSTANDING UNDER ITS UNSECURED REVOLVING CREDIT FACILITY AND FOR GENERAL BUSINESS PURPOSES IS DEPENDENT ON THE CLOSING OF THIS OFFERING AND MAY NOT OCCUR.\nFOR THESE REASONS, AMONG OTHERS, INVESTORS ARE CAUTIONED NOT TO PLACE UNDUE RELIANCE UPON FORWARD LOOKING STATEMENTS.\nA Maryland Real Estate Investment Trust with transferable shares of beneficial interest listed on the Nasdaq.\nNo shareholder, Trustee or officer is personally liable for any act or obligation of the Trust.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130006418/en/\nHospitality Properties Trust\nKatie Strohacker, 617-796-8232\nSenior Director, Investor Relations\nSource: Hospitality Properties Trust", "external_links": ["http://www.businesswire.com/news/home/20180130006418/en/"], "published": "2018-01-31T00:55:00.000+02:00", "crawled": "2018-01-31T02:14:15.007+02:00", "highlightTitle": ""}