{"organizations": [], "uuid": "79ebb3a8b844b078a9905eb95f5287b13afc087d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955816-IMG_0080.1910x1000.jpeg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/21/we-tried-to-cheat-at-hq-trivia-and-failed-miserably.html", "country": "US", "domain_rank": 767, "title": "We tried to cheat at HQ Trivia and failed miserably", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.156, "site_type": "news", "published": "2018-01-21T21:11:00.000+02:00", "replies_count": 0, "uuid": "79ebb3a8b844b078a9905eb95f5287b13afc087d"}, "author": "Darren Weaver", "url": "https://www.cnbc.com/2018/01/21/we-tried-to-cheat-at-hq-trivia-and-failed-miserably.html", "ord_in_thread": 0, "title": "We tried to cheat at HQ Trivia and failed miserably", "locations": [], "entities": {"persons": [{"name": "darren weaver", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "google", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "We tried to cheat at HQ Trivia — and failed miserably SHARES Darren Weaver | @dgweav Published 1 Hour Ago If you've never played HQ you're probably asking \"why can't I just cheat the game by looking all the answers up on Google?\" CNBC recently discovered it's not quite that simple, and failed miserably at the task. \nHQ Trivia is a live game show app where people answer multiple choice trivia questions with the hope of winning real money. To win, a user has to make it to the end by correctly answering all 12 multiple choice questions. If you're still standing at the end, you win or split the prize money, which is typically about $2,000 split between a few hundred people. \nIf you've never played HQ you're probably asking yourself \"why can't I just cheat the game by looking all the answers up on Google?\" \nBut it's not quite that simple. Sure, people have been trying to hack the game the system using Google from the start. If you look at Google trends, you can see that searches for terms related to questions spike during the game: \nBut from the time the host starts reading the question, you only have 10 seconds to choose the correct answer. While that might be enough time to search the question, it doesn't quite give you enough time to dissect the search results. \nWe got together a team of nine CNBC reporters and producers, three using of them searching on computers, and the rest answering, on a total of 15 smartphones. The first few questions start off easy, so there wasn't really a need to bring Google into the mix. But as the questions got harder, we found that searching actually distracted us away from the game long enough to miss answering the question. Sure, searching did help us here and there, but most of the answers really came from the players. \nIn the end, all of our phones except one were knocked out on question 10. And on the 11th question, the person searching took too long scrambling to find the answer online and missed the opportunity to answer in time. \nSo in the end, I'd say you should give up your hopes of getting rich by trying to game HQ and just enjoy playing the game.", "external_links": [], "published": "2018-01-21T21:11:00.000+02:00", "crawled": "2018-01-21T21:11:51.028+02:00", "highlightTitle": ""}