{"organizations": [], "uuid": "08085bca44190eb2843b107d2773c335c1a82cc9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 9}, "facebook": {"likes": 239, "shares": 239, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226232799&w=1200&r=LYNXMPEE0S0ID", "site_section": "http://feeds.reuters.com/reuters/technologyNews/", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-nokia-5g/nokia-introduces-high-capacity-5g-chipsets-to-ship-in-volume-in-third-quarter-idUSKBN1FI0PW", "country": "US", "domain_rank": 408, "title": "Nokia introduces high-capacity 5G chipsets, to ship in volume in third quarter", "performance_score": 2, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T10:11:00.000+02:00", "replies_count": 0, "uuid": "08085bca44190eb2843b107d2773c335c1a82cc9"}, "author": "", "url": "https://www.reuters.com/article/us-nokia-5g/nokia-introduces-high-capacity-5g-chipsets-to-ship-in-volume-in-third-quarter-idUSKBN1FI0PW", "ord_in_thread": 0, "title": "Nokia introduces high-capacity 5G chipsets, to ship in volume in third quarter", "locations": [], "entities": {"persons": [], "locations": [{"name": "frankfurt", "sentiment": "none"}], "organizations": [{"name": "nokia", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKFURT (Reuters) - Nokia is introducing new silicon chipsets - the building blocks of its next-generation 5G network gear - that promise big increases in the data-handling capacity for mobile towers in densely trafficked urban areas or high-rise buildings.\nFinland’s Nokia, the world’s No. 2 maker of mobile network gear behind China’s Huawei [HWT.UL] said on Monday the chipsets are set to ship in volume in the third quarter and can be inserted into its existing AirScale family of 4G and 5G-ready network gear.\nDubbed ReefShark, Nokia said the chipsets triple capacity to 84 gigabits per second from 28 gigabits in its existing chip modules. These modules can be stacked up to enable a single cell tower/basestation to handle up to 6 terabits per second.\nThe previous record for data consumption at a single sporting event was set at last year’s Super Bowl football championship game in Houston, when U.S. mobile operators and network equipment operators reported roughly 40 terabits, or trillions of bits, of data were consumed on game day in 2017.\nBuilt into a single cell tower, Nokia chipsets could handle 100 times the combined mobile and wi-fi data consumed by stadium fans at last year’s Super Bowl football championship, Nokia Mobile Networks marketing chief Phil Twist told Reuters.\nBeside tripling data handling capacity, the company also said its new chips can cut in half the size of antennas in cell towers, while cutting their power consumption by two-thirds.\nNokia said it is working with 30 mobile operators to deploy the new products into their wireless towers, meaning that the first networks could be upgraded later this year, with mass-market deployments to follow as 5G-ready devices hit the market.\nThe chipsets run so-called Massive MIMO (Multiple Input Multiple Output) antennas that can send and receive dozens of separate streams of data simultaneously, offering far greater network capacity and coverage from a single cell tower, it said.\nThe chipsets will allow the size of antennas, on average, to be cut in half to as small as 45 centimeters (18 inches) tall from existing antennas that range in size from 1 meter (3.3 ft) to 2.6 meters tall, enabling them to fit in far more locations.\nSouth Korea, Japan and the United States all have several network operators in each market preparing mainstream 5G network launches later in 2018 or in 2019, with China likely to join the early wave rather than lagging behind. Under a 2016 plan, the European Union wants to deploy 5G for all urban areas by 2025.\nU.S. President Donald Trump's national security team is also looking at building a super-fast 5G wireless network among options under consideration to counter the threat of China spying on U.S. phone calls, a senior administration official said on Sunday. ( reut.rs/2nkpn1Y )\nReporting by Eric Auchard; Editing by Maria Sheahan and Susan Fenton\n ", "external_links": [], "published": "2018-01-29T10:11:00.000+02:00", "crawled": "2018-01-29T10:34:22.044+02:00", "highlightTitle": ""}