{"organizations": [], "uuid": "75ff7e4a42b740ecf3399d0d1d8f8f4fca2c688d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/14/104586722-GettyImages-813944950.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/25/us-will-exceed-paris-agreement-commitments-al-gore.html", "country": "US", "domain_rank": 767, "title": "US will exceed Paris Agreement commitments: Al Gore", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T13:57:00.000+02:00", "replies_count": 0, "uuid": "75ff7e4a42b740ecf3399d0d1d8f8f4fca2c688d"}, "author": "Anmar Frangoul", "url": "https://www.cnbc.com/2018/01/25/us-will-exceed-paris-agreement-commitments-al-gore.html", "ord_in_thread": 0, "title": "US will exceed Paris Agreement commitments: Al Gore", "locations": [], "entities": {"persons": [{"name": "al gore", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "gore", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The U.S. is still on schedule to meet its obligations on the Paris Climate Agreement despite its decision to pull out of the accord, according to former Vice President Al Gore.\n\"Several governors of our largest states, hundreds of cities and thousands of U.S. businesses are now ensuring that the U.S. will not only meet but exceed the commitments it made under the Paris Agreement,\" Gore, who was speaking on a panel at the World Economic Forum in Davos, Switzerland, said Thursday.\nUnder the agreement, reached at the end of 2015, world leaders committed to making sure global warming stays \"well below\" two degrees Celsius above pre-industrial levels, and to pursue efforts to limit the temperature rise to 1.5 degrees Celsius.\nLast summer, President Donald Trump announced that the U.S would withdraw from the Paris Agreement and commence negotiations to re-enter or renegotiate a new accord. At the time, Gore described the decision as a \"reckless and indefensible action\" that undermined America's standing in the world.\nOn Thursday, Gore noted that the U.S. could still end up staying in the agreement. \"The U.S., by the way, can't legally leave the Paris Agreement until the day after the next presidential election anyway,\" he said. \"And if there's a new president… a new president could give 30 days' notice and we would be back in the agreement.\"\nRegarding the agreement, Gore hinted that there was still work to be done. \"The Paris Agreement was a fantastic and historic breakthrough — every nation in the world committed to go to net zero global warming pollution by mid-century,\" he said.\n\"It's fantastic. But you add up all the specific commitments of all the nations that agree, it still falls short of what's necessary to stay below two degrees or 1.5 degrees, the aspirational goal.\"\nLooking forward, Gore said that the Paris Agreement required every nation signed up to it to conduct a comprehensive review of their commitments every five years. The process for 2020 would start this year.\n\"We have a lot going for us,\" he said. \"The technologists and the business leaders are finding that there are amazing advances in solar energy and wind energy, batteries, electric vehicles, efficiency, so we can increase the commitments.\"\nWhat was needed, Gore said, was political will to confront \"the naysayers, to confront the foot draggers, the carbon special interests that want to slow the process down.\"\nCommitments needed to be increased, and that had to start this year for 2020, he said. \"It's worth remembering that political will is itself a renewable source.\"", "external_links": [], "published": "2018-01-25T13:57:00.000+02:00", "crawled": "2018-01-25T14:00:03.022+02:00", "highlightTitle": ""}