{"organizations": [], "uuid": "2705cf930c8ff651da6ef742c4a22dd11c521b4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-nitto-avecia-pharma-services-appoints-raymond-kaczmarek-as-president.html", "country": "US", "domain_rank": 767, "title": "Nitto Avecia Pharma Services Appoints Raymond Kaczmarek as President", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.19, "site_type": "news", "published": "2018-01-15T19:00:00.000+02:00", "replies_count": 0, "uuid": "2705cf930c8ff651da6ef742c4a22dd11c521b4b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-nitto-avecia-pharma-services-appoints-raymond-kaczmarek-as-president.html", "ord_in_thread": 0, "title": "Nitto Avecia Pharma Services Appoints Raymond Kaczmarek as President", "locations": [], "entities": {"persons": [{"name": "raymond kaczmarek", "sentiment": "negative"}, {"name": "kaczmarek", "sentiment": "none"}, {"name": "ray", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}, {"name": "san diego", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "avecia pharma", "sentiment": "negative"}, {"name": "nitto avecia pharma services", "sentiment": "negative"}, {"name": "nitto avecia pharma services, inc.", "sentiment": "neutral"}, {"name": "nitto denko avecia, inc.", "sentiment": "none"}, {"name": "cgmp", "sentiment": "none"}, {"name": "pacira pharmaceuticals, inc.", "sentiment": "none"}, {"name": "commercial manufacturing and supply operations", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IRVINE, Calif., Jan. 15, 2018 /PRNewswire/ -- Nitto Avecia Pharma Services, Inc. (Avecia Pharma), a leading CGMP contract development and manufacturing organization (CDMO), announced today that it has appointed Raymond Kaczmarek to the position of President. Mr. Kaczmarek will have full P&L responsibility for the entire organization.\nDetlef Rethage, President of parent company, Nitto Denko Avecia, Inc., stated, \"We are excited to welcome Ray to Avecia Pharma. We are confident that with his proven leadership, knowledge and experience in a broad spectrum of drug development activities, Ray will continue to further strengthen and grow the business and meet the needs of our clients.\"\nMr. Kaczmarek joins the organization with nearly 20 years of extensive experience in operations management within the pharmaceutical and biopharmaceutical industries. He most recently served as Vice President, Commercial Manufacturing and Supply Operations at Pacira Pharmaceuticals, Inc., located in San Diego, California. His proven leadership in strategic manufacturing management, for both clinical and commercial manufacturing, makes him perfectly suited to contribute to the future success of the company. In addition to working for Pacira, Mr. Kaczmarek has held management positions in such companies as Bayer Biologics, Abbott Laboratories, Boehringer-Ingelheim, Covidien, Athersys, and Wyeth Biotech.\nMr. Kaczmarek explained, \"It is truly a privilege to lead this wonderful team at Avecia Pharma as we continue to enhance its capabilities as a full service CDMO. I look forward to our future development of the Irvine campus, strengthening our service capabilities, and above all, providing outstanding outcomes for our clients.\"\nMr. Kaczmarek earned a Bachelor of Science degree in Biology from Virginia Polytechnic Institute and State University (Virginia Tech). He is also a proud veteran who served our country as a combat engineering officer in the US ARMY Corps of Engineers.\nABOUT NITTO AVECIA PHARMA SERVICES INC.\nNitto Avecia Pharma Services is your single solution for premier contract development and manufacturing services. Nitto Avecia Pharma Services supports the pharmaceutical, biopharmaceutical, and medical device industries with a complete package of CGMP services including pre-formulation/formulation, parenteral manufacturing, analytical development, biopharmaceutical development, structural chemistry, analytical chemistry, microbiology, stability storage and drug delivery device testing. With three state-of-the-art facilities located on one campus in Irvine, CA. Learn more at www.aveciapharma.com\nABOUT NITTO DENKO AVECIA INC.\nNitto Denko Avecia Inc. is a recognized leader in manufacturing and development services of oligonucleotide therapeutic with facilities located in Milford, MA.; Marlboro, MA.; and Cincinnati OH offering services for DNA, RNA and other oligonucleotides based therapeutics from milligram scale at pre-clinical stage to 1000kg + post commercial launch. More information: www.Avecia.com . Nitto Denko Avecia is proud member of Nitto Group. More information: www.Nitto.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/nitto-avecia-pharma-services-appoints-raymond-kaczmarek-as-president-300582186.html\nSOURCE Nitto Avecia Pharma Services", "external_links": ["http://www.avecia.com/", "http://www.nitto.com/", "http://www.aveciapharma.com/", "http://www.prnewswire.com/news-releases/nitto-avecia-pharma-services-appoints-raymond-kaczmarek-as-president-300582186.html"], "published": "2018-01-15T19:00:00.000+02:00", "crawled": "2018-01-15T18:51:56.034+02:00", "highlightTitle": ""}