{"organizations": [], "uuid": "3e80fe410838927e8f5be566d8820d3859f1a226", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/india", "section_title": "India", "url": "https://www.reuters.com/article/us-india-landrights-slums/colorful-makeover-puts-mumbai-slum-on-tourist-map-idUSKBN1FI1R5", "country": "US", "domain_rank": 408, "title": "Colorful makeover puts Mumbai slum on tourist map", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.016, "site_type": "news", "published": "2018-01-29T22:13:00.000+02:00", "replies_count": 0, "uuid": "3e80fe410838927e8f5be566d8820d3859f1a226"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-india-landrights-slums/colorful-makeover-puts-mumbai-slum-on-tourist-map-idUSKBN1FI1R5", "ord_in_thread": 0, "title": "Colorful makeover puts Mumbai slum on tourist map", "locations": [], "entities": {"persons": [{"name": "reddy", "sentiment": "none"}, {"name": "dedeepya reddy", "sentiment": "none"}], "locations": [{"name": "mumbai", "sentiment": "none"}, {"name": "mumbai", "sentiment": "none"}, {"name": "amalfi coast", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "harvard university-educated", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI (Thomson Reuters Foundation) - A colorful paint job has transformed one of Mumbai’s drab hilltop slums into a tourist destination, even prompting comparisons with Italy’s picturesque Amalfi Coast.\nDuring a recent journey on a Mumbai metro train, Dedeepya Reddy was struck by the grim appearance of a slum in Asalpha in the city’s eastern suburbs as she stared out from her air-conditioned carriage.\nReddy, a Harvard University-educated co-founder of a creative agency, was keen to brighten the lives of slum residents, while also changing the perception of slums being dirty and dangerous, and decided on a simple makeover.\nArmed with dozens of cans of colorful paint, Reddy and a team of about 700 volunteers painted the walls and alleyways of the hilltop slum over two weekends last month.\nResidents, at first skeptical, also got involved and helped paint quirky murals, the 31-year-old said.\n“When you look at slums, you think they are shabby and dirty, and that also becomes a reflection of the people who live there,” Reddy told the Thomson Reuters Foundation.\n“We used bright colors to change how slums and their residents are viewed. It also gives residents a sense of pride and dignity about their homes.”\nUp to 37 million households, or about a quarter of India’s urban population, live in informal housing including slums because of an acute shortage of affordable housing, according to social consultancy FSG.\nIn space-starved Mumbai, which has some of the priciest real estate in the world, the shortage is even more critical, with hundreds of migrants from rural areas cramming into the city every day to seek better prospects.\nReddy’s Chal Rang De (Let’s Colour It) charity has seven other slums, similarly situated on hillocks, on its wishlist, she said.\nLocals and tourists have thronged Asalpha in recent weeks, posting pictures on Instagram which have drawn comparisons to Italy’s Amalfi Coast.\nTheir interactions with residents are a welcome change, Reddy said.\nFor resident Aparna Chaudhuri, who has lived in Asalpha for about a dozen years, the paint job was welcome.\n“Earlier, our house looked dull. Now it looks good,” said Chaudhuri, who picked pink for her home.\n“Everyone is also keeping the neighborhood clean now.”\nReporting by Rina Chandran @rinachandran. Editing by Emma Batha. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org to see more stories.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-29T22:13:00.000+02:00", "crawled": "2018-01-30T03:17:59.025+02:00", "highlightTitle": ""}