{"organizations": [], "uuid": "7cf685f69b9d78c8ab988dada36a339a1cbba38c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225574100&w=1200&r=LYNXMPEE0P17H", "site_section": "http://feeds.reuters.com/reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-flu/flu-still-widespread-in-u-s-worst-season-since-2014-2015-cdc-idUSKBN1FF2JV", "country": "US", "domain_rank": 408, "title": "Flu still widespread in U.S., worst season since 2014/2015: CDC", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T21:29:00.000+02:00", "replies_count": 0, "uuid": "7cf685f69b9d78c8ab988dada36a339a1cbba38c"}, "author": "", "url": "https://www.reuters.com/article/us-usa-flu/flu-still-widespread-in-u-s-worst-season-since-2014-2015-cdc-idUSKBN1FF2JV", "ord_in_thread": 0, "title": "Flu still widespread in U.S., worst season since 2014/2015: CDC", "locations": [], "entities": {"persons": [{"name": "julie steenh", "sentiment": "negative"}, {"name": "dan jernigan", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "west coast", "sentiment": "none"}], "organizations": [{"name": "cdc", "sentiment": "negative"}, {"name": "centers for disease control and prevention", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO (Reuters) - Flu continues to be widespread across the United States and the season is on track to be one of the most severe since 2014/2015, when 34 million people were sickened by the virus and 710,000 were hospitalized, U.S. health officials said on Friday.\nDuring most flu seasons, older people have been hit the hardest, followed by very young children. But during this flu season, baby boomers, or those aged 50-64, have been the hardest hit after seniors.\n“Baby boomers have higher rates (of hospitalization) than their grandchildren right now,” Dr. Dan Jernigan, director of the influenza division at the Centers for Disease Control and Prevention told reporters on a conference call.\nHe said influenza activity had begun to taper off in some parts of the United States, particularly in California and other states on the West Coast, but the season was far from over.\nFlu activity “remains high for most of the U.S., while some areas are still writhing,” he said.\nIndeed, this season may feel more severe than in prior years.\n“We often see different parts of the country light up at different times,” said Jernigan, “but for the past three weeks, the entire county has been experiencing lots of flu, all at the same time.”\nJoshua Lagade of Vista, California, gets fluids in an IV as he lies on a bed with the flu in the emergency room at Palomar Medical Center in Escondido, California, U.S., January 18, 2018. REUTERS/Mike Blake Another seven children died of the flu in the week ended Jan. 20, bringing total pediatric deaths to 37 for the season.\nThe CDC does not track adult flu deaths directly, but Jernigan said 9.1 percent of death certificates listed flu or pneumonia as the cause of death last week, a figure that has risen steadily for the past three weeks.\nThe number of people visiting doctors’ offices and emergency rooms was rising, with 6.6 percent of such visits related to flu.\nEmergency room nurse Richard Horner wears a mask as he deals with flu patients at Palomar Medical Center in Escondido, California, U.S., January 18, 2018. REUTERS/Mike Blake “This is the highest level of activity recorded since the 2009 pandemic, which peaked at 7.7 percent,” Jernigan said.\nA surge in cases in January may have coincided with children returning to school after their winter break.\nSome states have seen high rates of hospitalization, with California seeing about four times as many as at the same time during the 2014/2015 flu season.\nMinnesota has seen twice the hospitalization rates as it did during the 2014/15 season, and more patients are now being hospitalized in New York as well, he said.\nCalifornia has had higher levels of flu activity for a longer period of time than other parts of the country, which likely explains the higher hospitalization rates, he said.\nReporting by Julie Steenhuysen; Editing by Bernadette Baum\n ", "external_links": [], "published": "2018-01-26T21:29:00.000+02:00", "crawled": "2018-01-26T21:38:00.012+02:00", "highlightTitle": ""}