{"organizations": [], "uuid": "a44699c3eb9a56e684353c086e50647e305b5d72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1225923269&w=1200&r=LYNXMPEE0R023", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/china-japan/china-says-hopes-to-get-japan-ties-back-on-track-idINKBN1FH02Z", "country": "US", "domain_rank": 408, "title": "China says hopes to get Japan ties back on track", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T05:16:00.000+02:00", "replies_count": 0, "uuid": "a44699c3eb9a56e684353c086e50647e305b5d72"}, "author": "", "url": "https://in.reuters.com/article/china-japan/china-says-hopes-to-get-japan-ties-back-on-track-idINKBN1FH02Z", "ord_in_thread": 0, "title": "China says hopes to get Japan ties back on track", "locations": [], "entities": {"persons": [{"name": "chi", "sentiment": "negative"}, {"name": "xi jinping", "sentiment": "none"}, {"name": "shinzo abe", "sentiment": "none"}, {"name": "abe", "sentiment": "none"}, {"name": "taro kono", "sentiment": "none"}, {"name": "kono", "sentiment": "none"}, {"name": "wang", "sentiment": "none"}, {"name": "wang yi", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "east china sea", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - China hopes to work with Japan to establish more cordial relations, Chinese Foreign Minister Wang Yi told his Japanese counterpart on Sunday, aiming to move on from a series of disputes, some dating back to before World War Two.\nChina and Japan have sparred frequently about their painful history, with Beijing often accusing Tokyo of not properly atoning for Japan’s invasion of China before and during the war.\nTies between China and Japan, the world’s second and third-largest economies, have also been plagued by a long-running territorial dispute over a cluster of East China Sea islets and suspicion in China about Japanese Prime Minister Shinzo Abe’s efforts to amend Japan’s pacifist constitution.\nThe two nations have, however, sought to improve ties more recently, with Abe and Chinese President Xi Jinping having met in November on the sidelines of a regional summit in Vietnam.\nWang told Japanese Foreign Minister Taro Kono that his trip to Beijing, coming so early in the year, showed Japan’s strong wish to improve relations and that China approves of this because better ties would be in both nations’ interests.\nThough there has been positive progress, there are also many “disturbances and obstacles”, Wang said, but the minister also pointed to comments from Abe on wanting to improve relations.\nJapanese Foreign Minister Taro Kono, second from left, speaks during a meeting with Chinese Foreign Minister Wang Yi at the Diaoyutai State Guesthouse in Beijing, China Jan. 28, 2018. REUTERS/Andy Wong/Pool “China-Japan ties always sail against the current, either forging ahead or drifting backward,” Wang said in front of reporters at the start of talks with his counterpart.\n“We hope that the Japanese side will neither relax in its efforts nor fall back, and turn the spoken statements into concrete actions.”\nJournalists film Japanese Foreign Minister Taro Kono, top center, meeting with Chinese Foreign Minister Wang Yi at the Diaoyutai State Guesthouse in Beijing, China Jan. 28, 2018. REUTERS/Andy Wong/Pool Kono, who later met Chinese Premier Li Keqiang, said that the two countries shared a major responsibility in safeguarding the stability and prosperity of Asia and the world at large.\n“Not only do we need to manage our bilateral relations, but we also need to work together to deal with issues facing the entire globe, in particular the issue of North Korea,” Kono said. “We desire to extend mutual cooperation between our two countries in working towards resolving this issue.”\nJapan has repeatedly pressed China to do more to help rein in North Korea’s missile and nuclear programmes. China says it is committed to enforcing U.N. sanctions but that all parties need to do more to reduce tensions and restart talks.\nJapanese Foreign Ministry spokesman Norio Maruyama told reporters that China and Japan are aiming to hold several high-level visits this year. These would include Abe visiting China and Xi going to Japan, he said, though no dates have been set.\n“Let’s see. It’s all a question of the schedule,” he said.\nReporting by Ben Blanchard; Editing by Nick Macfie and David Goodman\n ", "external_links": [], "published": "2018-01-28T05:16:00.000+02:00", "crawled": "2018-01-28T05:47:33.001+02:00", "highlightTitle": ""}