{"organizations": [], "uuid": "e38918be8a230d1c8c1ba3eb5e16199d1f810861", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223099057&w=1200&r=LYNXMPEE0H11J", "site_section": "https://www.goldreview.com/?feed=linkfeed", "section_title": "Gold Review » Gold Review", "url": "https://uk.reuters.com/article/us-usa-economy-unemployment/u-s-jobless-claims-fall-to-45-year-low-idUKKBN1F71S2", "country": "US", "domain_rank": 408, "title": "Cold weather chills U.S. homebuilding; jobless claims at 45-year low", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T21:56:00.000+02:00", "replies_count": 0, "uuid": "e38918be8a230d1c8c1ba3eb5e16199d1f810861"}, "author": "cmullen", "url": "https://uk.reuters.com/article/us-usa-economy-unemployment/u-s-jobless-claims-fall-to-45-year-low-idUKKBN1F71S2", "ord_in_thread": 0, "title": "Cold weather chills U.S. homebuilding; jobless claims at 45-year low", "locations": [], "entities": {"persons": [{"name": "chris rupkey", "sentiment": "none"}, {"name": "lucia mutikani", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "commerce department", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "mufg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 1:34 PM / Updated 3 hours ago Cold weather chills U.S. homebuilding; jobless claims at 45-year low Lucia Mutikani 6 Min Read \nWASHINGTON (Reuters) - U.S. homebuilding fell more than expected in December, recording its biggest drop in just over a year, likely as unseasonably cold weather at the end of the month disrupted the construction of single-family housing units. \nThe steep drop in groundbreaking activity probably will be temporary against the backdrop of a tightening labor market. Other data on Thursday showed the number of Americans filing for unemployment benefits dropped to a 45-year low last week. \n“Housing starts were held down by the cold winter weather but should bounce back quickly in coming months as the country warms up from this recent cold spell,” said Chris Rupkey, chief economist at MUFG in New York. \nHousing starts decreased 8.2 percent to a seasonally adjusted annual rate of 1.192 million units last month, the Commerce Department said. November’s sales pace was revised up to 1.299 million units from the previously reported 1.297 million units. \nThe percentage drop for housing starts in December was the largest since November 2016. Economists polled by Reuters had forecast housing starts declining to a pace of 1.275 million units last month. Homebuilding increased 2.4 percent to 1.202 million units in 2017, the highest level since 2007. \nBuilding permits edged down 0.1 percent to a rate of 1.302 million units in December, outpacing starts, which suggests a rebound in groundbreaking in the coming months. Building permits increased 4.7 percent to 1.263 million units in 2017, also the highest level since 2007. \nThe PHLX housing index .HGX was trading higher after the data, outperforming a weaker U.S. stock market. Shares of Lennar Corp ( LEN.N ) rose 0.4 percent and those of PulteGroup ( PHM.N ) gained 1 percent. But shares of D.R. Horton ( DHI.N ), the nation’s largest homebuilder, fell 1.2 percent. \nThe dollar .DXY was little changed against a basket of currencies and prices of U.S. Treasuries were trading lower. \nDespite December’s drop in housing starts, economists continued to believe that investment in homebuilding contributed to gross domestic product growth in the fourth quarter after being a drag for two straight quarters. \nLast month, single-family homebuilding, which accounts for the largest share of the housing market, tumbled 11.8 percent to a rate of 836,000 units as construction fell in the South, the Northeast and Midwest regions. Homebuilding was unchanged in the West. \nSingle-family home permits advanced 1.8 percent in December to their highest level since August 2007, suggesting an acceleration in groundbreaking on that segment of the housing sector was likely. Starts for the volatile multi-family segment rose 1.4 percent to a rate of 356,000 units. \nSingle-family home completions surged 4.3 percent to a five-month high. The number of single-family units under construction was the highest since June 2008, which should help ease an acute shortage of properties on the market that is pushing up prices. \nThere were 794,000 single-family housing units completed in 2017, the most in nine years. \n“The increase in completions signals some relief for the supply shortage,” said Mark Fleming, chief economist at First American in Washington. CLAIMS FALL SHARPLY \nIn a separate report on Thursday, the Labor Department said initial claims for state unemployment benefits dropped 41,000 to a seasonally adjusted 220,000 for the week ended Jan. 13, the lowest level since February 1973. \nEconomists had forecast claims falling to 250,000 in the latest week. Claims had risen over the previous four weeks, with analysts blaming difficulties adjusting the data for seasonal fluctuations around moving holidays and the cold weather. \nThe Labor Department said claims for seven states and one territory were estimated last week. Government offices were closed on Monday for the Martin Luther King holiday. \nLast week marked the 150th straight week that claims remained below the 300,000 threshold, which is associated with a strong labor market. That is the longest such stretch since 1970, when the labor market was much smaller. \nThe labor market is near full employment, with the jobless rate at a 17-year low of 4.1 percent. \nLast week, the four-week moving average of initial claims, considered a better measure of labor market trends as it irons out week-to-week volatility, fell 6,250 to 244,500. The claims data covered the survey week for January’s nonfarm payrolls. \nThe four-week average of claims rose 8,500 between the December and January survey periods, suggesting some moderation in the pace of job growth. Nonfarm payrolls increased by 148,000 in December after surging by 252,000 in November. \nJob growth is slowing as the labor market nears full employment. There has been an increase in companies reporting difficulties finding qualified workers. There are about 5.9 million job openings in the country. \n“Employers are increasingly facing a mismatch between their hiring needs and the availability of qualified candidates to fill those needs,” said Jim Baird, chief investment officer at Plante Moran Financial Advisors in Kalamazoo, Michigan. Reporting by Lucia Mutikani; Editing by Paul Simao", "external_links": [], "published": "2018-01-18T21:56:00.000+02:00", "crawled": "2018-01-18T22:06:54.022+02:00", "highlightTitle": ""}