{"organizations": [], "uuid": "8610422527f98d0bfe524264c5963927889423db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219572394&w=1200&r=LYNXMPEE040KG", "site_section": "http://feeds.reuters.com/reuters/UKCricketNews", "section_title": "Reuters: Cricket News", "url": "https://uk.reuters.com/article/uk-cricket-test-zaf-ind/kumar-has-south-africa-reeling-but-de-villiers-leads-fight-back-idUKKBN1EU0ZB", "country": "US", "domain_rank": 408, "title": "Cricket-Kumar has South Africa reeling but de Villiers leads fight back", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T12:45:00.000+02:00", "replies_count": 0, "uuid": "8610422527f98d0bfe524264c5963927889423db"}, "author": "", "url": "https://uk.reuters.com/article/uk-cricket-test-zaf-ind/kumar-has-south-africa-reeling-but-de-villiers-leads-fight-back-idUKKBN1EU0ZB", "ord_in_thread": 0, "title": "Cricket-Kumar has South Africa reeling but de Villiers leads fight back", "locations": [], "entities": {"persons": [{"name": "de villiers", "sentiment": "negative"}, {"name": "kumar", "sentiment": "negative"}, {"name": "faf du plessis", "sentiment": "none"}, {"name": "hashim amla", "sentiment": "none"}, {"name": "dean elgar", "sentiment": "none"}, {"name": "bhuvneshwar kumar", "sentiment": "none"}, {"name": "aiden markram", "sentiment": "none"}], "locations": [{"name": "south africa", "sentiment": "none"}, {"name": "newlands stadium", "sentiment": "none"}, {"name": "cape town", "sentiment": "none"}, {"name": "newlands", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ab de villiers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 10:59 AM / Updated 21 minutes ago Steyn returns to help South Africa rally against India Reuters Staff 3 Min Read \nCAPE TOWN (Reuters) - South Africa seamer Dale Steyn grabbed his first test wicket after an injury absence of 14 months as the hosts fought back against a fired-up India on an enthralling first day of cut-and-thrust cricket in the opening test at Newlands on Friday. Cricket - India v South Africa - First Test cricket match - Newlands Stadium, Cape Town, South Africa - 05/01/2018. South Africa's Faf du Plessis makes a run. REUTERS/Sumaya Hisham \nSteyn took his career tally to 418 wickets, three behind South African record-holder Shaun Pollock, as India were reduced to 28 for three at the close having bowled out the hosts for 286 on a spicy wicket offering bounce and some sideways movement. \nCheteshwar Pujara (five) and Rohit Sharma (zero) will resume on the second day as the tourists, who trail by 258, seek an answer to the venom in the pitch and the home seam attack. \nSteyn, who had missed the last 15 tests with a career-threatening shoulder injury, caught and bowled dangerous opener Shikhar Dhawan for 16 with a quick delivery that proved he has lost none of his pace. \n“Having him back after such a long time is special to a lot of us. He has been the spearhead of this attack for such a long time,” Steyn’s fellow opening bowler Vernon Philander said. \n“We wanted to get as close to 300 as possible, which I think is a lot of runs on this wicket.” \nIndia also lost Murali Vijay for one, caught by Dean Elgar at gully off Philander, while Morne Morkel claimed the wicket of visiting captain Virat Kohli, who played at a rising delivery outside off-stump and was caught by wicketkeeper Quinton de Kock for five. Cricket - India v South Africa - First Test cricket match - Newlands Stadium, Cape Town, South Africa - 05/01/2018. South Africa's AB de Villiers plays a shot. REUTERS/Sumaya Hisham \nSouth Africa won the toss and elected to bat, but were soon in trouble at 12 for three as India seamer Bhuvneshwar Kumar (4-87) tore through the top order. \nKumar took a wicket in each of his opening three overs as he snagged opener Elgar with the third ball of the day and then had Aiden Markram and Hashim Amla dismissed cheaply. \nThe home side threw a counter punch with half centuries from AB de Villiers (65) and captain Faf du Plessis (62) as they put on 114 for the fourth wicket. Slideshow (8 Images) \nDe Villiers reached his 50 off 55 deliveries before being bowled by test debutant Jasprit Bumrah (1-73) after lunch, while Du Plessis flashed at a wide delivery from all-rounder Hardik Pandya (1-53). \nSouth Africa’s tail wagged to a degree as they put on 144 for the last five wickets, with De Kock (43) particularly fluent until he was Kumar’s fourth victim, caught behind by wicketkeeper Wriddhiman Saha. \n“We started really well but lost our way. We could have bowled better and gave away 25-30 extra runs,” Kumar said. \n“I just wanted to bowl in good areas. We knew the wicket would not be slow and that there would be some lateral movement.” \nSouth Africa host India in three tests this month with the next two to be played in Pretoria and Johannesburg. Reporting by Mark Gleeson and Nick Said; Editing by William Maclean, Ken Ferris and Pritha Sarkar", "external_links": [], "published": "2018-01-05T12:45:00.000+02:00", "crawled": "2018-01-05T13:07:35.006+02:00", "highlightTitle": ""}