{"organizations": [], "uuid": "087fa1a900aefc37caf6a5f7d24c3bfc11423b09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-turkey-koza-altin-britain/turkish-gold-businessman-to-sue-turkeys-savings-deposit-bank-idUKKBN1FF2IZ", "country": "US", "domain_rank": 408, "title": "Turkish gold businessman to sue Turkey's savings deposit bank", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T21:02:00.000+02:00", "replies_count": 0, "uuid": "087fa1a900aefc37caf6a5f7d24c3bfc11423b09"}, "author": "", "url": "https://uk.reuters.com/article/uk-turkey-koza-altin-britain/turkish-gold-businessman-to-sue-turkeys-savings-deposit-bank-idUKKBN1FF2IZ", "ord_in_thread": 0, "title": "Turkish gold businessman to sue Turkey's savings deposit bank", "locations": [], "entities": {"persons": [{"name": "koza altin", "sentiment": "none"}, {"name": "fethullah gulen", "sentiment": "none"}, {"name": "ipek", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "savings deposits insurance fund", "sentiment": "none"}, {"name": "savings deposit insurance fund", "sentiment": "none"}, {"name": "koza ltd", "sentiment": "none"}, {"name": "akin ipek", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 6:59 PM / Updated 6 minutes ago Turkish gold businessman to sue Turkey's savings deposit bank Reuters Staff 3 Min Read \nLONDON (Reuters) - The founder of Turkey’s biggest mining company Akin Ipek has launched legal action against a Turkish state fund in the latest stage of his battle for control of London-based assets, a spokesman for the British subsidiary said. \nTurkish authorities have seized hundreds of companies that are now managed by the Savings Deposits Insurance Fund, including Istanbul-listed gold mining company Koza Altin ( KOZAL.IS ). It was placed in receivership in October 2015 for alleged links to Islamic cleric Fethullah Gulen. \n“We have applied to the High Court to include the Savings Deposit Insurance Fund of Turkey (SDIF) in our claim to prevent further attempts to harm the business of Koza Ltd,” a spokesman for Koza Ltd, the British subsidiary of Koza Altin, told Reuters. \nThe move is the latest in a long running struggle between the parent company and Ipek for control of the British subsidiary that is pursuing mining projects in Scotland and Northern Ireland. \nThe SDIF declined to comment. A spokesman for Koza Altin said he was confident the English courts will find the parent company has the rightful control of Koza Ltd. \nU.S.-based Gulen was once an ally of Turkish President Tayyip Erdogan and the AK Party but relations soured from 2013. Ankara accused Gulen’s followers of orchestrating an attempted coup in July 2016 and branded it a terrorist organisation. \nGulen denies plotting against the state. \nAkin Ipek, once one of Turkey’s richest men with a fortune of billions, moved to Britain in 2015. He had already in March 2014 set up the British subsidiary with capital of 60 million pounds. \nIts parent company is being run by government-appointed trustees. \nThe parent company, which is listed in Istanbul and counts international asset managers among its shareholders, according to Thomson Reuters data, has also been attempting to oust Ipek from the Koza Ltd board, court documents show. \nIn legal action, which previously only included the trustees and the parent company, Koza Altin the British subsidiary and its director Ipek, sought to unlock funds to go to an international tribunal. \nThe High Court refused to grant permission to use the company’s capital to finance such an arbitration after a hearing last year. Reporting by Dasha Afanasieva and Barbara Lewis, additional reporting by Behiye Selin Taner in Istanbul, editing by David Evans", "external_links": [], "published": "2018-01-26T21:02:00.000+02:00", "crawled": "2018-01-26T21:13:54.010+02:00", "highlightTitle": ""}