{"organizations": [], "uuid": "ab8e57940f47fdad3d78ef7403420a67e0a9bccd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-pakistan-drones/u-s-dismisses-pakistani-assertion-that-american-missiles-hit-afghan-refugees-idUKKBN1FE2OG", "country": "US", "domain_rank": 408, "title": "U.S. dismisses Pakistani assertion that American missiles hit Afghan refugees", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T20:08:00.000+02:00", "replies_count": 0, "uuid": "ab8e57940f47fdad3d78ef7403420a67e0a9bccd"}, "author": "", "url": "https://uk.reuters.com/article/uk-pakistan-drones/u-s-dismisses-pakistani-assertion-that-american-missiles-hit-afghan-refugees-idUKKBN1FE2OG", "ord_in_thread": 0, "title": "U.S. dismisses Pakistani assertion that American missiles hit Afghan refugees", "locations": [], "entities": {"persons": [{"name": "haqqani", "sentiment": "none"}, {"name": "asif shahzad", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "kurram", "sentiment": "none"}, {"name": "islamabad", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "taliban", "sentiment": "none"}, {"name": "min read  islamabad", "sentiment": "none"}, {"name": "kurram agency", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ministry of foreign affairs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 6:12 PM / Updated 8 minutes ago U.S. dismisses Pakistani assertion that American missiles hit Afghan refugees Asif Shahzad 3 Min Read \nISLAMABAD (Reuters) - The United States on Thursday dismissed a Pakistani allegation that an American drone had fired missiles at an Afghan refugee camp in Kurram district, in the lawless regions bordering Afghanistan. \nAt the same time, Pakistani security officials who sought anonymity because they were not authorised to disclose the information said the drone strike had killed two members of the militant Haqqani network, which is allied with the Afghan Taliban. \nAlthough allies in the war against Islamist militants, the two countries are currently at loggerheads after Washington suspended nearly $2 billion of aid, accusing Islamabad of supporting Taliban militants wreaking havoc in Afghanistan. \n“The claim in an MFA (Ministry of Foreign Affairs) statement yesterday that U.S. forces struck an Afghan refugee camp in Kurram Agency yesterday is false,” a U.S. embassy spokesman in Islamabad said in a statement. \nIt did not deny that a drone strike had taken place, however, and the comment from security officials suggested that it had hit its intended target. \nPakistan rejects American accusations that it is supporting and sheltering Haqqani militants using bases inside Pakistan to prepare attacks on U.S. and allied NATO forces in Afghanistan. \nPresident Donald Trump has accused Islamabad in a tweet of “lies and deceit”. Pakistan denies the allegations, saying that Washington has been trying to make it a scapegoat for the failures of its war in Afghanistan. \nIn the meantime, to Pakistan’s annoyance, the United States continues its drone campaign against militants in mountainous border regions bordering Afghanistan where government control is limited. \nSince Trump took office a year ago, these drone strikes have increased, though they are a long way off their peak of 2010. \nPakistan’s Foreign Ministry on Thursday reiterated its position that “unilateral actions are detrimental to the spirit of cooperation between the two countries in the fight against terrorism”. \nThe army said the strike had not eliminated any “organised terrorist sanctuary” but “struck individual target who had morphed into Afghan refugees”, without specifying who exactly it believed had been hit. \nThe army said 43 of Pakistan’s 54 Afghan refugee camps were in the northwest, and that it was essential that their inhabitants be repatriated. It said the incident vindicated Pakistan’s stance that the militants could easily blend in with the refugees. \nPakistan is home to nearly 2 million registered Afghan refugees and another 1 million unregistered ones, displaced by decades of war in their country. Reporting by Asif Shahzad; Editing by Kevin Liffey", "external_links": [], "published": "2018-01-25T20:08:00.000+02:00", "crawled": "2018-01-25T20:33:28.011+02:00", "highlightTitle": ""}