{"organizations": [], "uuid": "4e5a56e1f9c23df72d5370028d1810f5e06e9dd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-this-mornings-technical-outlook-on-health-care-plans-stocks--cvs-health-humana-molina-healthcare-and-unitedhealth.html", "country": "US", "domain_rank": 767, "title": "This Morning's Technical Outlook on Health Care Plans Stocks -- CVS Health, Humana, Molina Healthcare, and UnitedHealth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.46, "site_type": "news", "published": "2018-01-25T14:10:00.000+02:00", "replies_count": 0, "uuid": "4e5a56e1f9c23df72d5370028d1810f5e06e9dd1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-this-mornings-technical-outlook-on-health-care-plans-stocks--cvs-health-humana-molina-healthcare-and-unitedhealth.html", "ord_in_thread": 0, "title": "This Morning's Technical Outlook on Health Care Plans Stocks -- CVS Health, Humana, Molina Healthcare, and UnitedHealth", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "rhode island", "sentiment": "none"}], "organizations": [{"name": "cvs health", "sentiment": "neutral"}, {"name": "molina healthcare", "sentiment": "neutral"}, {"name": "unitedhealth", "sentiment": "neutral"}, {"name": "humana", "sentiment": "neutral"}, {"name": "cvs", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "wallstequities.com", "sentiment": "none"}, {"name": "unitedhealth group inc.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "molina healthcare inc.", "sentiment": "none"}, {"name": "humana inc.", "sentiment": "none"}, {"name": "unh", "sentiment": "none"}, {"name": "cvs health corp.", "sentiment": "none"}, {"name": "cvs health woonsocket", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, January 25, 2018 /PRNewswire/ --\nWallStEquities.com strives to bring the best free research to the investment community. Today we are offering reports on CVS, HUM, MOH, and UNH which can be accessed for free by signing up to http://www.wallstequities.com/registration . For today, WallStEquities.com scans CVS Health Corp. (NYSE: CVS), Humana Inc. (NYSE: HUM), Molina Healthcare Inc. (NYSE: MOH), and UnitedHealth Group Inc. (NYSE: UNH). Health Care Plans companies offer health benefit plans to employers and individuals. These include health plans for those who require long-term care or specialty benefits, along with point-of-service plans, traditional indemnity plans, and other hybrid plans. All you have to do is sign up today for this free limited time offer by clicking the link below. http://www.wallstequities.com/registration\nCVS Health\nWoonsocket, Rhode Island headquartered CVS Health Corp.'s shares gained slightly by 0.60%, closing Wednesday's trading session at $80.92. The stock recorded a trading volume of 7.31 million shares. The Company's shares have advanced 8.41% in the last month and 6.60% over the previous three months. The stock is trading 9.57% above its 50-day moving average and 5.10% above its 200-day moving average. Additionally, shares of CVS Health have a Relative Strength Index (RSI) of 69.20.\nOn January 08 th , 2018, research firm Leerink Partners reiterated its 'Outperform' rating on the Company's stock with an increase of the target price from $82 a share to $90 a share.\nOn January 19 th , 2018, CVS Health was recognized by FORTUNE速 magazine as one of the \"World's Most Admired Companies.\" The Company was honored as No. 39 on the corporate rankings, up six spots from the previous year and marking the fourth consecutive year on the Global Top 50 list. Get the full research report on CVS for free by clicking below at: http://www.wallstequities.com/registration/?symbol=CVS\nHumana\nOn Wednesday, shares in Louisville, Kentucky headquartered Humana Inc. recorded a trading volume of 1.11 million shares. The stock climbed 1.22%, ending the day at $286.32. The Company's shares have advanced 17.55% in the past month, 16.33% in the previous three months, and 43.20% over the past year. The stock is trading above its 50-day and 200-day moving averages by 13.21% and 18.25%, respectively. Furthermore, shares of Humana have an RSI of 80.66.\nOn January 12 th , 2018, research firm Jefferies upgraded the Company's stock rating from 'Hold' to 'Buy'.\nOn January 15 th , 2018, Humana announced that it will release its financial results for Q4 2017 on February 07 th , 2018, at 6:30 a.m. ET. The Company will host a conference call at 9:00 a.m. ET that same day to discuss its financial results and earnings guidance for 2018. A webcast of the earnings call may be accessed under the Investor Relations page of the Company's website. HUM's complimentary research coverage is a few simple steps away at: http://www.wallstequities.com/registration/?symbol=HUM\nMolina Healthcare\nLong Beach, California headquartered Molina Healthcare Inc.'s stock finished the day 0.29% lower at $92.00 with a total trading volume of 687,786 shares. The Company's shares have surged 22.21% in the last month, 38.87% in the previous three months, and 62.54% over the past year. The stock is trading above its 50-day and 200-day moving averages by 16.47% and 35.13%, respectively. Additionally, shares of Molina Healthcare have an RSI of 72.67.\nOn January 11 th , 2018, Molina Healthcare (MOH) announced that Terry Bayer, COO, will be retiring in the next several weeks. The corporate COO role will no longer be a part of the Company's organizational structure. This is consistent with MOH's shift to a flatter organizational structure that will enable the chief executive to be more directly involved with business and health plan operations.\nOn January 16 th , 2018, research firm JP Morgan upgraded the Company's stock rating from 'Neutral' to 'Overweight'. Register for your free research report on MOH at: http://www.wallstequities.com/registration/?symbol=MOH\nUnitedHealth Group\nShares in Minnetonka, Minnesota-based UnitedHealth Group Inc. ended yesterday's session 0.15% lower at $244.85. The stock recorded a trading volume of 2.69 million shares. The Company's shares have advanced 10.45% in the last month, 18.28% over the previous three months, and 52.62% over the past year. The stock is trading 10.15% and 24.35% above its 50-day and 200-day moving averages, respectively. Moreover, shares of UnitedHealth, which operates as a diversified health and well-being company in the US, have an RSI of 78.41.\nOn January 17 th , 2018, research firm Citigroup reiterated its 'Buy' rating on the Company's stock with an increase of the target price from $235 a share to $268 a share.\nOn January 19 th , 2018, UnitedHealth Group (UNH) announced that it was the top-ranking company in the Insurance and Managed Care sector for FORTUNE's 2018 \"World's Most Admired Companies\" list, featured in the magazine's February issue. This is the eighth consecutive year that UNH has been honored as No. 1 overall in its sector. UNH's free report is a few simple steps away at: http://www.wallstequities.com/registration/?symbol=UNH\nWall St. Equities :\nWall St. Equities (WSE) produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. WSE has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below.\nWSE has not been compensated; directly or indirectly; for producing or publishing this document.\nPRESS RELEASE PROCEDURES :\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third-party research service company (the \"Reviewer\") represented by a credentialed financial analyst [for further information on analyst credentials, please email info@wallstequities.com . Rohit Tuli, a CFA速 charterholder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on publicly available information which is believed to be reliable. Content is researched, written and reviewed on a reasonable-effort basis. The Reviewer has not performed any independent investigations or forensic audits to validate the information herein. The Reviewer has only independently reviewed the information provided by the Author according to the procedures outlined by WSE. WSE is not entitled to veto or interfere in the application of such procedures by the third-party research service company to the articles, documents or reports, as the case may be. Unless otherwise noted, any content outside of this document has no association with the Author or the Reviewer in any way.\nNO WARRANTY\nWSE, the Author, and the Reviewer are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted whatsoever for any direct, indirect or consequential loss arising from the use of this document. WSE, the Author, and the Reviewer expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in this document. Additionally, WSE, the Author, and the Reviewer do not (1) guarantee the accuracy, timeliness, completeness or correct sequencing of the information, or (2) warrant any results from use of the information. The included information is subject to change without notice.\nNOT AN OFFERING\nThis document is not intended as an offering, recommendation, or a solicitation of an offer to buy or sell the securities mentioned or discussed, and is to be used for informational purposes only. Please read all associated disclosures and disclaimers in full before investing. Neither WSE nor any party affiliated with us is a registered investment adviser or broker-dealer with any agency or in any jurisdiction whatsoever. To download our report(s), read our disclosures, or for more information, visit https://wallstequities.com/legal-disclaimer/\nCONTACT\nFor any questions, inquiries, or comments reach out to us directly. If you ' re a company, we are covering and wish to no longer feature on our coverage list contact us via email and/or phone between 09:30 EDT to 16:00 EDT from Monday to Friday at:\nEmail: info@wallstequities.com\nPhone number: +21-32-044-483\nOffice Address: 1 Scotts Road #24-10, Shaw Center Singapore 228\nCFA速 and Chartered Financial Analyst速 are registered trademarks owned by CFA Institute.\nSOURCE Wall St. Equities", "external_links": ["https://wallstequities.com/legal-disclaimer/", "http://www.wallstequities.com/registration/?symbol=UNH", "http://www.wallstequities.com/registration/?symbol=CVS", "http://www.wallstequities.com/registration/?symbol=MOH", "http://www.wallstequities.com/registration/?symbol=HUM", "http://www.wallstequities.com/registration"], "published": "2018-01-25T14:10:00.000+02:00", "crawled": "2018-01-25T14:16:27.009+02:00", "highlightTitle": ""}