{"organizations": [], "uuid": "cb0409e8a26fc182b67e7879bdcb1ebd4c7f24f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/image1.jpeg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/20/blockchain-identity-civic-silicon-slopes/", "country": "US", "domain_rank": 1196, "title": "Blockchain and Identity: Why They Go Together | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.778, "site_type": "news", "published": "2018-01-20T02:00:00.000+02:00", "replies_count": 0, "uuid": "cb0409e8a26fc182b67e7879bdcb1ebd4c7f24f4"}, "author": "Robert Hackett", "url": "http://fortune.com/2018/01/20/blockchain-identity-civic-silicon-slopes/", "ord_in_thread": 0, "title": "Blockchain and Identity: Why They Go Together | Fortune", "locations": [], "entities": {"persons": [{"name": "robert hackett", "sentiment": "negative"}, {"name": "lingh", "sentiment": "none"}, {"name": "vinny lingham", "sentiment": "none"}], "locations": [{"name": "silicon slopes", "sentiment": "none"}, {"name": "salt lake city", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}, {"name": "equifax", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Robert Hackett January 20, 2018 \nOne area of online life most ripe for disruption is identity: How does anyone really know you are who you say you are? \nNowadays, credit agencies and social networks like Facebook act as the main gatekeepers for identity. But a host of entrepreneurs are designing new solutions to this age-old Internet conundrum by using blockchain technology , the digital ledger system that underlies cryptocurrencies like Bitcoin. \nA few such blockchain boosters participated in a panel discussion about identity at the Silicon Slopes conference in Salt Lake City, Utah on Thursday. There they claimed that these distributed, tamper-resistant databases can counter the monopolizing forces that have come to control people’s identities. \nRead more: “ How Blockchain Could Replace Social Security Numbers “ \nThe most obvious failure of the current state of affairs is Equifax (efx) , said Vinny Lingham, cofounder and CEO of Civic, a startup that offers identity verification via a blockchain. \n“These centralized databases are central points of failure for your identity,” Lingham said, noting that in the case of a hack—as occurred with Equifax —all that information gets compromised. \n“With the current model of identity, you’ve got honeypots,” said Timothy Ruff, cofounder and CEO of Evernym, a startup that has developed its own blockchain, Sovrin, to help people manage their identities. But in the blockchain world, “there is no big pile of data—it doesn’t exist,” he said. \nRather than sitting on a small set of web servers controlled by a single business, blockchain-based data can be dispersed across a sprawling network of machines. Advocates, like the ones on the panel, say this architecture can grant regular users more ownership over their own data. \nMichael Sena, who heads product at uPort, an identity service built on the Ethereum blockchain, said that to be truly in control of one’s own identity—or “self sovereign”—a person must be in control of the cryptographic keys that allow them to interact with an access said blockchains. \n“To be self sovereign, you can’t be dependent on a decentralized network,” Sena said. “There needs to be the ability for users to determine how they handle keys.” \nGet Data Sheet , Fortune’s technology newsletter. \nIn other words, just because a blockchain is involved doesn’t magically mean people have more control over their data. The crypto keys, which function sort of like long, complex passwords for securing information, are, well, key. \n“If you are the self sovereign over something, you are the final authority,” Ruff said. “As morbid or brash as it sounds, you have to be able to fire your identity provider.” \nIf and when blockchain-based identity projects reach critical mass in terms of user adoption, they could help get more decentralized services—like cryptocurrency exchanges, file storage providers, and prediction markets—off the ground. For true believers, solving identity is the first step toward realizing what they deem to be the next wave of the web. \nLingham, despite being bullish on blockchains and their future, expressed skepticism about some of the present mania for cryptocurrencies. “Out of the 3,000-plus tokens out there, most of them are probably going to fail,” Lingham warned. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-20T02:00:00.000+02:00", "crawled": "2018-01-21T11:04:09.008+02:00", "highlightTitle": ""}