{"organizations": [], "uuid": "426b2bf1ea00c28f90b49f7825188688631b0627", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1225915715&w=1200&r=LYNXMPEE0R018", "site_section": "http://feeds.reuters.com/reuters/INtechnologyNews", "section_title": "Reuters: Technology News", "url": "https://in.reuters.com/article/cyber-atms-usa/atm-makers-warn-of-jackpotting-hacks-on-u-s-machines-idINKBN1FH01M", "country": "US", "domain_rank": 408, "title": "ATM makers warn of 'jackpotting' hacks on U.S. machines", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T04:36:00.000+02:00", "replies_count": 0, "uuid": "426b2bf1ea00c28f90b49f7825188688631b0627"}, "author": "", "url": "https://in.reuters.com/article/cyber-atms-usa/atm-makers-warn-of-jackpotting-hacks-on-u-s-machines-idINKBN1FH01M", "ord_in_thread": 0, "title": "ATM makers warn of 'jackpotting' hacks on U.S. machines", "locations": [], "entities": {"persons": [{"name": "jim finkle", "sentiment": "none"}, {"name": "krebs", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "ncr corp", "sentiment": "none"}, {"name": "diebold nixdorf inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ncr", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Diebold Nixdorf Inc and NCR Corp, two of the world’s largest ATM makers, have warned that cyber criminals are targeting U.S. cash machines with tools that force them to spit out cash in hacking schemes known as “jackpotting.”\nThe two ATM makers did not identify any victims or say how much money had been lost. Jackpotting has been rising worldwide in recent years, though it is unclear how much cash has been stolen because victims and police often do not disclose details.\nThe attacks were reported earlier on Saturday by the security news website Krebs on Security, which said they had begun last year in Mexico.\nThe companies confirmed to Reuters on Saturday they had sent out the alerts to clients.\nNCR said in a Friday alert that the cases were the first confirmed “jackpotting” losses in the United States. It said its equipment had not been targeted in the recent attacks, but that it was still a concern for the entire ATM industry.\n“This should be treated by all ATM deployers as a call to action to take appropriate steps to protect their ATMs against these forms of attack,” the alert said.\nDiebold Nixdorf said in a separate Friday alert that U.S. authorities had warned the company that hackers were targeting one of its ATM models, known as Opteva, which went out of production several years ago.\nA confidential U.S. Secret Service alert sent to banks said the hackers targeted stand-alone ATMs typically located in pharmacies, big box retailers and drive-thru ATMs, Krebs on Security reported.\nDiebold Nixdorf’s alert described steps that criminals had used to compromise ATMs. They include gaining physical access, replacing the hard drive and using an industrial endoscope to depress an internal button required to reset the device.\nReuters was unable to obtain a copy of the Secret Service report and an agency representative declined comment. Officials with the Federal Bureau of Investigation could not immediately be reached.\nRussian cyber security firm Group IB has reported that cyber criminals remotely attacked cash machines in more than a dozen countries across Europe in 2016. Similar attacks were also reported that year in Thailand and Taiwan.\nReporting by Jim Finkle in Toronto; Additional reporting by Dustin Volz in Washington; Editing by Susan Thomas\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-28T04:36:00.000+02:00", "crawled": "2018-01-28T04:56:53.008+02:00", "highlightTitle": ""}