{"organizations": [], "uuid": "1f1627fb9277c1216059fd6c5d240c97eaeeefcd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/04/04/103518825-RTSDIUK.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/08/us-stocks-pause-record-rally-best-dow-start-since-2006.html", "country": "US", "domain_rank": 767, "title": "US stocks fall as traders pause after best start to a year for the Dow since 2006", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T17:30:00.000+02:00", "replies_count": 0, "uuid": "1f1627fb9277c1216059fd6c5d240c97eaeeefcd"}, "author": "Fred Imbert", "url": "https://www.cnbc.com/2018/01/08/us-stocks-pause-record-rally-best-dow-start-since-2006.html", "ord_in_thread": 0, "title": "US stocks fall as traders pause after best start to a year for the Dow since 2006", "locations": [], "entities": {"persons": [{"name": "jones", "sentiment": "none"}, {"name": "brendan mcdermid | reuters b. riley", "sentiment": "none"}, {"name": "hogan", "sentiment": "none"}, {"name": "b. riley", "sentiment": "none"}, {"name": "art hogan", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "nasdaq", "sentiment": "none"}, {"name": "wells fargo", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "j.p. morgan chase", "sentiment": "none"}, {"name": "blackrock", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The S&P 500 and Nasdaq composite finished Monday's session at all-time highs as investors remained optimistic on the U.S. economy.\nThe Nasdaq rose 0.3 percent to close at 7,157.39 as shares of Facebook, Amazon, Google-parent Alphabet and Netflix finished higher. The tech-heavy index also hit an intraday record of 7,161.35.\nThe S&P 500 climbed 0.17 percent to 2,747.71, with utilities rising 0.9 percent to lead nine of the 11 sectors higher. It also set an intraday record of 2,748.51.\nThe Dow Jones industrial average , meanwhile, closed 12.87 points lower at 25,283, snapping a four-day winning streak. The 30-stock index, however, reached an intraday record of 25,311.99.\nSymbol Name Price Change %Change DJIA --- S&P 500 --- NASDAQ --- Despite the record highs notched on Monday, the major averages traded in a tight range. The Dow and S&P 500 oscillated in a range of 0.3 percent and 0.4 percent, respectively on Monday. The Nasdaq, meanwhile, traded in a range of 0.5 percent.\n\"When you contemplate a market that comes out of the gate that quickly, you're going to get a pause,\" said Art Hogan, chief market strategist at B. Riley FBR.\nEquities set all-time highs last week, as the Dow and Nasdaq had their best four-day start to a year since 2006. The major indexes also reached key milestones last week. The Dow, S&P 500 and Nasdaq closed above 25,000, 2,700 and 7,000, respectively, for the first time last week.\nWall Street also looked ahead to the start of the calendar fourth-quarter earnings season later this week. J.P. Morgan Chase, BlackRock, and Wells Fargo are among the companies scheduled to report.\nBrendan McDermid | Reuters B. Riley's Hogan said this earnings season will be \"complicated\" as investors search for clues about how the changes to the U.S. tax code will impact each company.\nPresident Donald Trump signed a bill last month that slashed the U.S. corporate tax rate to 21 percent from 35 percent. Stocks pushed higher throughout 2017 as investors bet on a lower tax rate for companies.\n\"Analysts have begun to lift earnings estimates aggressively as a consequence of the rewriting of the tax code,\" said Jeremy Klein, chief market strategist at FBN Securities. \"Expected profits for the S&P 500 for 2018 have grown by nearly 3% since early October with half of these gains coming in the past week.\"\n\"To be sure, stocks are expensive. Nevertheless, those bullish have surmised that shares will get more attractive as bottom line forecasts continue to rise out of deference to the fiscal stimulus,\" Klein said.\nElsewhere in corporate news, Snap shares declined 3 percent after Jefferies downgraded them to hold from buy. Jefferies said that \"fundamental execution needs to be shown before we can be more positive on the name.\"\nMeanwhile, candy giant Hershey submitted a final bid to acquire Nestle's U.S. confectionery business, sources told CNBC . Hershey shares rose 1 percent.", "external_links": [], "published": "2018-01-08T17:30:00.000+02:00", "crawled": "2018-01-08T18:42:08.016+02:00", "highlightTitle": ""}