{"organizations": [], "uuid": "1889c07af8291e3a0fd2ea057ef8d1a362a100c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-exact-sciences-announces-offering-of-500-million-convertible-senior-notes-due-2025.html", "country": "US", "domain_rank": 767, "title": "Exact Sciences Announces Offering of $500 Million Convertible Senior Notes Due 2025", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T00:01:00.000+02:00", "replies_count": 0, "uuid": "1889c07af8291e3a0fd2ea057ef8d1a362a100c5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-exact-sciences-announces-offering-of-500-million-convertible-senior-notes-due-2025.html", "ord_in_thread": 0, "title": "Exact Sciences Announces Offering of $500 Million Convertible Senior Notes Due 2025", "locations": [], "entities": {"persons": [], "locations": [{"name": "madison", "sentiment": "none"}, {"name": "wis.", "sentiment": "none"}, {"name": "exas", "sentiment": "none"}], "organizations": [{"name": "exact sciences corporation", "sentiment": "negative"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "sec", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "bofa merrill lynch", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MADISON, Wis., Exact Sciences Corporation (NASDAQ: EXAS) today announced an underwritten public offering of $500 million aggregate principal amount of convertible senior notes due 2025 (the \"Notes\") pursuant to an effective shelf registration statement filed with the Securities and Exchange Commission (the \"SEC\") on Form S-3. The Company has also granted the underwriter a 30-day option to purchase up to an additional $75 million aggregate principal amount of Notes. The Company intends to use the net proceeds of this offering for general corporate and working capital purposes. The Notes will be convertible into cash, shares of the Company's common stock (plus, if applicable, cash in lieu of any fractional share), or a combination thereof, at the Company's election.\nBofA Merrill Lynch is acting as sole book-running manager for the offering. An automatically effective shelf registration statement relating to these securities was filed with the SEC on June 6, 2017. A copy of the prospectus supplement and prospectus relating to the offering may be obtained free of charge on the SEC's website at http://www.sec.gov or by sending a request to BofA Merrill Lynch, NC1-004-03-43, 200 North College Street, 3rd Floor, Charlotte, NC 28255-0001, Attention: Prospectus Department (or by e-mail at dg.prospectus_requests@baml.com ).\nThis press release shall not constitute an offer to sell or a solicitation of an offer to buy nor shall there be any sale of these securities in any state in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of such state. The offering of these securities will be made only by means of the prospectus and related prospectus supplement.\nAbout Exact Sciences Corp.\nExact Sciences Corp. is a molecular diagnostics company focused on the early detection and prevention of the deadliest forms of cancer. The company has exclusive intellectual property protecting its non-invasive, molecular screening technology for the detection of colorectal cancer.\nCertain statements made in this news release contain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities and Exchange Act of 1934, as amended, that are intended to be covered by the \"safe harbor\" created by those sections. Forward-looking statements, which are based on certain assumptions and describe the Company's future plans, strategies and expectations, can generally be identified by the use of forward-looking terms such as \"believe,\" \"expect,\" \"may,\" \"will,\" \"should,\" \"could,\" \"seek,\" \"intend,\" \"plan,\" \"estimate,\" \"anticipate,\" or other comparable terms. Forward-looking statements in this news release may address the following subjects among others: the terms and size of the offering and the use of proceeds from the offering. Forward-looking statements involve inherent risks and uncertainties that could cause actual results to differ materially from those in the forward-looking statements as a result of various factors including those risks and uncertainties described in the Risk Factors and in Management's Discussion and Analysis of Financial Condition and Results of Operations sections of the Company's most recently filed Annual Report on Form 10-K and the Company's subsequently filed Quarterly Reports on Form 10-Q. The Company urges you to consider those risks and uncertainties in evaluating the Company's forward-looking statements. The Company cautions readers not to place undue reliance upon any such forward-looking statements, which speak only as of the date made. Except as otherwise required by the federal securities laws, the Company disclaims any obligation or undertaking to publicly release any updates or revisions to any forward-looking statement contained herein (or elsewhere) to reflect any change in the Company's expectations with regard thereto or any change in events, conditions or circumstances on which any such statement is based.\nContact:\nMegan Jones\nExact Sciences Corp.\nmeganjones@exactsciences.com\n608-535-8815\nView original content with multimedia: releases/exact-sciences-announces-offering-of-500-million-convertible-senior-notes-due-2025-300581696.html\nSOURCE EXACT SCIENCES CORP", "external_links": ["http://www.prnewswire.com/news-releases/exact-sciences-announces-offering-of-500-million-convertible-senior-notes-due-2025-300581696.html"], "published": "2018-01-12T00:01:00.000+02:00", "crawled": "2018-01-12T02:55:21.012+02:00", "highlightTitle": ""}