{"organizations": [], "uuid": "d85946e0b95a6322030f151cfdc8eeea5f9e2fef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222339863&w=1200&r=LYNXMPEE0F0DH", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-myanmar-rohingya-bangladesh/bangladesh-agrees-with-myanmar-to-complete-rohingya-return-in-two-years-idUSKBN1F50I2", "country": "US", "domain_rank": 408, "title": "Bangladesh agrees with Myanmar to complete Rohingya return in two years", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T08:40:00.000+02:00", "replies_count": 0, "uuid": "d85946e0b95a6322030f151cfdc8eeea5f9e2fef"}, "author": "", "url": "https://www.reuters.com/article/us-myanmar-rohingya-bangladesh/bangladesh-agrees-with-myanmar-to-complete-rohingya-return-in-two-years-idUSKBN1F50I2", "ord_in_thread": 0, "title": "Bangladesh agrees with Myanmar to complete Rohingya return in two years", "locations": [], "entities": {"persons": [{"name": "paritosh bansal", "sentiment": "none"}, {"name": "clarence fernandez", "sentiment": "none"}, {"name": "ruma paul", "sentiment": "none"}], "locations": [{"name": "myanmar", "sentiment": "none"}, {"name": "bangladesh", "sentiment": "none"}], "organizations": [{"name": "min read  dhaka", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DHAKA/YANGON (Reuters) - Bangladesh and Myanmar agreed on Tuesday to complete within two years the return of hundreds of thousands of Rohingya Muslims who fled an army crackdown last year in Myanmar.\nUnited Nations Secretary-General Antonio Guterres and the U.N. Refugee Agency (UNHCR), responding to the plan, said they were concerned about forcibly repatriating over 650,000 Rohingya who fled to neighboring Bangladesh after a conflict erupted in western Rakhine state in August.\nStatements from the Myanmar and Bangladesh foreign ministries said Bangladesh would set up five transit camps on its side of the border. Those camps would send Rohingyas to two reception centers in Myanmar. The repatriation process would start next Tuesday, the statements said.\nMyanmar said it would build a transit camp that can house 30,000 returnees.\nThe Bangladesh statement said “Myanmar has reiterated its commitment to stop (the) outflow of Myanmar residents to Bangladesh”.\nGuterres said the UNHCR had not been involved directly in the agreement and that “it will be very important to have UNHCR fully involved in the operation to guarantee that the operations abide by international standards.”\n“A huge effort of reconciliation is needed to allow it to take place properly,” Guterres told reporters. “The worst would be to move these people from camps in Bangladesh to camps in Myanmar, keeping an artificial situation for a long time and not allowing for them to regain their normal lives.”\nMyanmar stressed the need for both sides to take preventive measures against possible Rohingya attacks and said it gave Dhaka a list with the names of 1,000 alleged militants.\nThe crisis erupted after Rohingya insurgent attacks on security posts on Aug. 25 in Rakhine triggered a fierce military response that the United Nations denounced as ethnic cleansing. Some 650,000 people fled the violence.\nThe military denies ethnic cleansing, saying its security forces mounted legitimate counter-insurgency clearance operations.\nThe Bangladesh statement called for repatriating orphans and “children born out of unwarranted incidence”, a reference to cases of rape resulting in pregnancy, said a Bangladesh foreign ministry official who declined to be identified.\nThe rape of Rohingya women by Myanmar’s security forces was widespread, according to interviews with women conducted at displacement camps by U.N. medics and activists. The military denies it was involved in any sexual assaults.\nVERIFICATION PROCESS A UNHCR spokesman said on Tuesday the Rohingya should return voluntarily only when they feel it is safe to do so.\n“Major challenges have to be overcome,” UNHCR spokesman Andrej Mahecic told a news briefing in Geneva. “These include ensuring they are told about the situation in their areas of origin ... and are consulted on their wishes, that their safety is ensured.”\nA Rohingya refugee girl plays at a tube-well in Palong Khali camp, near Cox's Bazar, Bangladesh January 14, 2018. REUTERS/Tyrone Siu Myanmar government spokesman Zaw Htay told Reuters last week the returnees could apply for citizenship “after they pass the verification process”.\nMyint Kyaing, permanent secretary at Myanmar’s Ministry of Labour, Immigration and Population, told Reuters this month Myanmar would begin processing at least 150 people a day through each of the two camps by Jan. 23.\nThe meeting that concluded on Tuesday in Myanmar’s capital Naypyitaw was the first for a joint working group set up to hammer out the details of a November repatriation agreement.\nLeft out of the talks were the fears and concerns of the refugees themselves, “as if they are an inert mass of people who will go where and when they are told,” Phil Robertson, deputy Asia director at Human Rights Watch, told Reuters in an email.\n“Where are considerations for protection of the Rohingya from Myanmar security forces who months ago were raping and killing them? How come the discussions ignore the deprivation of rights of people held in indefinite detention, which is what these so-called “temporary” accommodations may become?,” Robertson asked.\nRohingya refugees are seen in a refugee camp at no-man's land at the Bangladesh-Myanmar border, in Cox's Bazar, Bangladesh January 12, 2018. REUTERS/Tyrone Siu ‘LIVING LIKE PRISONERS’\nA group of refugees at the Kutupalong Rohingya camp near Cox’s Bazar in Bangladesh expressed doubt about the camps Myanmar has agreed to establish on its side of the border.\nMohammad Farouk, 20, who arrived in Bangladesh following the Aug. 25 attacks, said exchanging one camp for another made little difference - except ”the camps in Myanmar will be far worse, because we will be confined there and there will be a risk to our lives.”\nAnother resident of the Kutupalong camp compared the new transit camps to ones set up near the Rakhine state capital of Sittwe following bouts of violence in previous years ”where people are living like prisoners”.\n“First, ask the military to give those Rohingya their homes and property back, then talk to us about returning,” said the Rohingya refugee who did not want to be identified.\nSome said the kind of violence they witnessed toward their community in Myanmar made it hard for them to trust the military. “Even if I don’t get food or anything else here, at least there is safety. I won’t feel safe if I go back to Myanmar,” said Rashid Ahmed, 33.\nNoor Alam, 37, who came to Kutupalong five months ago, wondered if he could ever get a job in Myanmar. “They don’t even call us Rohingya. Until they consider us citizens we won’t go back.”\nSome young men in the camp worried they might be arrested on accusations of terrorism if they returned to Myanmar.\nCamp conditions in Bangladesh are dire enough, but more than 520,000 Rohingya children are at even greater risk ahead of the cyclone season that generally begins in April, the United Nations Children’s Fund said on Tuesday.\n”Hundreds of thousands of children are already living in horrific conditions, and they will face an even greater risk of disease, flooding, landslides and further displacement,” said Edouard Beigbeder, UNICEF Representative in Bangladesh.\nNearly 1 million Rohingya live in Bangladesh, including those who came after previous displacements dating back to the 1990s.\nReporting by Ruma Paul and Yi-mou Lee; Additional reporting by Zeba Siddiqui in Cox's Bazar, Shoon Naing, and Serajul Quadir in Dhaka, Michelle Nichols at the United Nations; Editing by Bill Tarrant and Frances Kerry\n ", "external_links": [], "published": "2018-01-16T08:40:00.000+02:00", "crawled": "2018-01-16T08:48:48.009+02:00", "highlightTitle": ""}