{"organizations": [], "uuid": "7dae83ad0ec5e6f267add5ae1039b52f6e3af2ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-aeti-announces-impact-of-tax-act-on-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "AETI Announces Impact of Tax Act on 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.119, "site_type": "news", "published": "2018-01-31T23:23:00.000+02:00", "replies_count": 0, "uuid": "7dae83ad0ec5e6f267add5ae1039b52f6e3af2ba"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-aeti-announces-impact-of-tax-act-on-2017-financial-results.html", "ord_in_thread": 0, "title": "AETI Announces Impact of Tax Act on 2017 Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "american electric technologies, inc.", "sentiment": "neutral"}, {"name": "corporation", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 31, 2018 (GLOBE NEWSWIRE) -- American Electric Technologies, Inc. (the \"Company\") (NASDAQ:AETI), a leading supplier of power delivery solutions for the global energy industry, expects the recently passed Tax Cuts and Jobs Act (the \"Tax Act\") will result in the inclusion of a one-time, non-cash increase to the Company’s GAAP net income for the quarter and fiscal year ended December 31, 2017 by approximately $2.8 million or $.29 per diluted share due to re-valuation of deferred tax liabilities, net of the repatriation tax on undistributed earnings, of the Company’s non-US subsidiary and joint venture.\nThe impact of the Tax Act may differ from the estimate above, possibly materially, due to, among other things, changes in interpretations and assumptions the Company has made, guidance that may be issued and actions the Company may take as a result of the Tax Act. The Company will continue to analyze the Tax Act to determine the full effects of the new law, including the new lower corporate tax rate, on the Corporation's financial statements and operations.\nThe Company will announce financial results for the quarter and year ended December 31, 2017 on or before April 2, 2018.\nForward-Looking Statements\nThis press release contains certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These statements include, but are not limited to, statements regarding the Company’s expectations regarding certain effects of the new tax law, including a revaluation of the Company’s deferred tax assets and liabilities. Forward-looking statements can be identified by the use of the words “anticipate,” “believe,” “expect,” “intend,” “could” and “should,” and other words of similar meaning. These forward-looking statements express management’s current expectations or forecasts of future events and, by their nature, are subject to risks and uncertainties and there are a number of factors that could cause actual results to differ materially from those in such statements. Factors that might cause such a difference include, but are not limited to: interpretations and clarifications regarding the new tax law; actual changes in the value of the Company’s deferred tax assets and liabilities during the fourth quarter of 2017; and other factors identified in the Company’s Annual Report on Form 10-K and other periodic filings with the SEC. These forward-looking statements are made only as of the date of this press release, and the Company does not undertake an obligation to release revisions to these forward-looking statements to reflect events or conditions after the date of this document.\nInvestor Contact:\nAmerican Electric Technologies, Inc.\nBill Brod\n713-644-8182\ninvestorrelations@aeti.com\nSource:American Electric Technologies, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=oHXgdBoAjDsoEsFF8wRn7ClhIyi6SoOg3Qap4TAARMc0Xc2hxbBZTFTMPJKK9hKtMXf9tESsVYKRlsSnX2SVoQL0ybVmccdHu6oGZ1A4Fdu1yCdG6mZLe72z53zZBc7J", "https://www.globenewswire.com/NewsRoom/AttachmentNg/f1376ce8-dfe9-4d72-aa7f-40a6ed0b6a94"], "published": "2018-01-31T23:23:00.000+02:00", "crawled": "2018-01-31T23:09:16.012+02:00", "highlightTitle": ""}