{"organizations": [], "uuid": "f00a7e9fa4d94e2b5420a3e13111a50ce8482791", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-american-woodmark-corporation-announces-proposed-private-offering-of-350-million-of-senior-notes-due-2026.html", "country": "US", "domain_rank": 767, "title": "American Woodmark Corporation Announces Proposed Private Offering Of $350 Million Of Senior Notes Due 2026", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.014, "site_type": "news", "published": "2018-01-29T16:35:00.000+02:00", "replies_count": 0, "uuid": "f00a7e9fa4d94e2b5420a3e13111a50ce8482791"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-american-woodmark-corporation-announces-proposed-private-offering-of-350-million-of-senior-notes-due-2026.html", "ord_in_thread": 0, "title": "American Woodmark Corporation Announces Proposed Private Offering Of $350 Million Of Senior Notes Due 2026", "locations": [], "entities": {"persons": [], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "winchester", "sentiment": "none"}], "organizations": [{"name": "american woodmark corporation", "sentiment": "negative"}, {"name": "american woodmark", "sentiment": "none"}, {"name": "rsi home products, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WINCHESTER, Va., Jan. 29, 2018 /PRNewswire/ -- American Woodmark Corporation (NASDAQ: AMWD) (\"American Woodmark\") today announced that it intends to offer $350 million aggregate principal amount of senior unsecured notes due 2026 (the \"Notes\") in a private offering, subject to market and other customary conditions. The Notes will be guaranteed on a senior unsecured basis by certain of American Woodmark's existing domestic subsidiaries. The interest rate, offering price and other terms of the Notes will be determined at the time of pricing of the offering.\nOn January 25, 2018, RSI Home Products, Inc. (\"RSI\"), a wholly owned subsidiary of American Woodmark, gave notice that it has elected to conditionally redeem 20% (the \"Conditional Redemption\"), or $115 million in principal amount, of the $575 million outstanding principal amount of its 6½% senior secured second lien notes due 2023 (the \"RSI Notes\"). American Woodmark intends to use the net proceeds from the sale of the Notes, together with the proceeds from borrowings under its senior secured credit facilities and cash on hand, to pay the redemption price for the Conditional Redemption and to finance the purchase of the RSI Notes not subject to the Conditional Redemption pursuant to a cash tender offer and consent solicitation by RSI announced today (and for the redemption of any RSI Notes not so purchased), along with related fees and expenses.\nThe Notes are being offered solely to qualified institutional buyers pursuant to Rule 144A under the Securities Act of 1933, as amended (the \"Securities Act\"), and to non-U.S. persons in accordance with Regulation S under the Securities Act. The Notes will not be registered under the Securities Act or any state securities law and, unless so registered, may not be offered or sold in the United States except pursuant to an applicable exemption from the registration requirements of the Securities Act and applicable state securities laws. No assurance can be given that the offering of the Notes will be completed, or, if completed, as to the terms on which it is completed.\nThis press release does not constitute an offer to sell or a solicitation of an offer to purchase the Notes or any other securities and shall not constitute an offer, solicitation or sale of any securities in any jurisdiction in which, or to any person to whom, such an offer, solicitation or sale is unlawful. This press release is being issued pursuant to and in accordance with Rule 135c under the Securities Act.\nThe tender offer is made only by, and pursuant to, the terms and conditions of an Offer to Purchase and Consent Solicitation Statement dated January 29, 2018, and a related Letter of Transmittal and Consent.\nIn addition, this press release does not constitute a notice of redemption or an obligation to issue a notice of redemption.\nAbout American Woodmark Corporation:\nAmerican Woodmark Corporation manufactures and distributes bath, kitchen and home organization products for the remodeling and new home construction markets. Its products are sold on a national basis directly to home centers, major builders and through a network of independent distributors. The Company presently operates 18 manufacturing facilities and 7 service centers across the country. For more information, visit www.americanwoodmark.com .\nForward Looking Statements\nThis communication contains certain \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements may be identified by the use of words such as \"anticipate,\" \"estimate,\" \"forecast,\" \"expect,\" \"believe,\" \"intends,\" \"should,\" \"could,\" \"would,\" \"plan,\" \"may,\" \" intend,\" \"prospect,\" \"goal,\" \"will,\" \"predict,\" or \"potential\" or other similar words or variations thereof. These statements are based on the current beliefs and expectations of the management of American Woodmark and are subject to significant risks and uncertainties that could cause actual outcomes and results to differ materially from those expressed herein. These risks and uncertainties include, but are not limited to, those described in American Woodmark's filings with the Securities and Exchange Commission (\"SEC\"), including in its Annual Report on Form 10-K for the year ended April 30, 2017 under the heading \"Risk Factors\" and its most recent Quarterly Report on Form 10-Q for the period ended October 31, 2017 under the heading \"Management's Discussion and Analysis of Financial Condition and Results of Operations - Forward Looking Statements.\" These reports, as well as the other documents filed by American Woodmark with the SEC, are available free of charge at the SEC's website at www.sec.gov . American Woodmark does not undertake to publicly update or revise its forward-looking statements, whether as a result of new information or otherwise.\nView original content: http://www.prnewswire.com/news-releases/american-woodmark-corporation-announces-proposed-private-offering-of-350-million-of-senior-notes-due-2026-300589431.html\nSOURCE American Woodmark Corporation", "external_links": ["http://www.sec.gov/", "http://www.americanwoodmark.com/", "http://www.prnewswire.com/news-releases/american-woodmark-corporation-announces-proposed-private-offering-of-350-million-of-senior-notes-due-2026-300589431.html"], "published": "2018-01-29T16:35:00.000+02:00", "crawled": "2018-01-29T19:26:23.000+02:00", "highlightTitle": ""}