{"organizations": [], "uuid": "af4be86e59707750f8fa8cd0400b7c8c0c6584a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180106&t=2&i=1219862869&w=1200&r=LYNXMPEE050GE", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-serbia-airport-concession/serbia-awards-belgrade-airport-concession-to-frances-vinci-idUKKBN1EV0M2", "country": "US", "domain_rank": 408, "title": "Serbia awards Belgrade airport concession to France's Vinci", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T19:36:00.000+02:00", "replies_count": 0, "uuid": "af4be86e59707750f8fa8cd0400b7c8c0c6584a4"}, "author": "", "url": "https://uk.reuters.com/article/uk-serbia-airport-concession/serbia-awards-belgrade-airport-concession-to-frances-vinci-idUKKBN1EV0M2", "ord_in_thread": 0, "title": "Serbia awards Belgrade airport concession to France's Vinci", "locations": [], "entities": {"persons": [{"name": "aleksandar vucic", "sentiment": "none"}, {"name": "nikola tesla", "sentiment": "none"}, {"name": "vinci ivana sekularac", "sentiment": "none"}, {"name": "vinci", "sentiment": "none"}, {"name": "gus trompiz", "sentiment": "none"}], "locations": [{"name": "belgrade", "sentiment": "none"}, {"name": "serbia", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "vinci airports", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 6, 2018 / 5:36 PM / Updated 25 minutes ago Serbia awards Belgrade airport concession to France's Vinci Ivana Sekularac , Gus Trompiz 3 Min Read \nBELGRADE/PARIS (Reuters) - Serbia has awarded Vinci ( SGEF.PA ) a 25-year concession to run Belgrade’s Nikola Tesla airport AERO.BEL, giving the French infrastructure group a foothold in southeast Europe for its growing airport division. FILE PHOTO: The logo of Vinci is pictured during the company's 2011 annual results presentation in Paris February 8, 2012. REUTERS/Charles Platiau/File Photo \nVinci, Europe’s biggest construction and concessions company, offered to pay 501 million euros (444.47 million pounds) for the concession and pledged to invest another 732 million euros over the 25 years, Serbian President Aleksandar Vucic said on Saturday. \nHe added Vinci had committed to keep all employees currently working at the airport. \nVinci, which did not disclose financial terms, later said its Vinci Airports unit expected to sign the concession contract during the first quarter and take over operations by the end of this year after completing financing for the deal. \n“This success marks a new stage in Vinci Airports’ expansion outside France,” Nicolas Notebaert, chief executive of Vinci Concessions and chairman of Vinci Airports, said in a statement. \n“Belgrade Nikola Tesla Airport will serve as the company’s hub in Southeast Europe, a geographical area in which Vinci Airports has not operated until now.” \nThe Serbian government had last year picked five bidders for the airport concession, with four consortia competing with Vinci. \nDetails of expected revenue from the concession were not given. Airport operators typically generate income from air transport fees charged to airlines or passengers, along with commercial fees linked to services such as shops. \nTraffic at Belgrade airport has increased since 2013 when Abu Dhabi’s Etihad bought a 49 percent stake in indebted flag carrier JAT, rebranding it as Air Serbia and introducing new routes. \nOnce closed to international air traffic during a decade of war and sanctions under late Serbian strongman Slobodan Milosevic, the country’s main airport handled more than five million passengers last year. TRAFFIC BOOST \nVinci aims to boost traffic further by supporting new long-haul routes for Air Serbia and using existing partnerships with over 200 airlines, the French company said. \nBelgrade airport’s CEO told a local news agency in December he expected profit to rise to 29 million euros in 2017 from 26 million euro a year earlier. \nThe government holds a 83.1 percent stake in Belgrade airport and small shareholders own the rest. \nVinci, which manages 35 airports worldwide, said in November it would systematically bid when opportunities arose to expand \nits airport operations. \nThe group has expanded into faster growing and more profitable concessions such as airports, motorways and energy engineering to counter weakness in the French construction sector. Reporting by Ivana Sekularac in Belgrade and Gus Trompiz in Paris; Editing by Mark Potter and Adrian Croft", "external_links": [], "published": "2018-01-06T19:36:00.000+02:00", "crawled": "2018-01-06T20:18:36.014+02:00", "highlightTitle": ""}