{"organizations": [], "uuid": "408231b85dc328faaa48707b16f9b7ca6f91385d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/30/the-associated-press-top-jobs-in-congress-no-longer-the-prize-they-used-to-be.html", "country": "US", "domain_rank": 767, "title": "Top jobs in Congress no longer the prize they used to be", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T07:24:00.000+02:00", "replies_count": 0, "uuid": "408231b85dc328faaa48707b16f9b7ca6f91385d"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/30/the-associated-press-top-jobs-in-congress-no-longer-the-prize-they-used-to-be.html", "ord_in_thread": 0, "title": "Top jobs in Congress no longer the prize they used to be", "locations": [], "entities": {"persons": [{"name": "frelinghuysen", "sentiment": "none"}, {"name": "frank lucas", "sentiment": "none"}, {"name": "rodney frelinghuysen", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "r-okla", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "house", "sentiment": "none"}, {"name": "house appropriations committee", "sentiment": "none"}, {"name": "house agriculture committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — Lawmakers spend their careers eying coveted committee chairmanships, angling for the chance at the perks and power that came with the top spot.\nNew Jersey Republican Rep. Rodney Frelinghuysen is bowing out after one term.\nFrelinghuysen's announcement Monday that he would not seek re-election, giving up the chairmanship of the House Appropriations Committee, punctuated the dwindling prestige and influence of the positions once considered an apex of power on Capitol Hill. Term limits, legislative dysfunction and gridlock-inducing polarization have gradually tarnished the very chairmanships that are so prized.\n\"Before the farm bill and my tenure as chairman, I had neither gray hair nor did I take hypertension medicine. I now have both for the rest of my life,\" said former House Agriculture Committee Chairman Frank Lucas, R-Okla. \"Right now you have to deal with a situation where you have the extreme demands of the left on one side of the room and the extreme demands of the right on the other side.\"\nFrelinghuysen is the eighth House committee chair to head for the exits, and a striking case study for the dynamics at play.\nThe New Jersey Republican became chairman of the Appropriations Committee last year after serving for several years as chairman of its defense subcommittee.\nBut Frelinghuysen's year in charge of the panel has been frustrating. In theory, he manages the process of doling out one-third of the federal budget. But he's had scant success on that front. Although he helped successfully negotiate a catchall spending bill last spring, the appropriations process for the ongoing budget year has been hamstrung by delays in the Senate and faces the very real danger of running aground completely amid an unrelated months-long battle over immigration.\n\"Serving as chairman of the Appropriations Committee is a difficult and sometimes thankless job,\" said Rep. Nita Lowey of New York, the panel's top Democrat.\nThere have been fewer thank-yous since a series of GOP reforms changed the rules. In a push to curb corruption in 2010, Republicans officially banned \"earmarks,\" severally limiting lawmakers' capacity to direct tens or even hundreds of millions to one's district or state for \"earmarked\" pet projects. The earmarks were a prerogative of the chairman, both to bolster his political standing at home and to court votes with fellow lawmakers of either party.\nHouse GOP rules mean chairmen cycle through six-year terms, which also counts time as ranking minority member. Chairmen are selected by a leadership panel that takes factors such as fundraising and conservative litmus tests into consideration.\nOld-timers such as former Rep. Jack Kingston, R-Ga., say the system centralizes legislative authority with party leaders, who are often less versed in the nuts and bolts of legislation and have little appreciation for the committee's bipartisan traditions.\n\"I often would laugh, express frustration together with Rosa DeLauro, who's as liberal as she can be,\" Kingston recalled of one of his Democratic counterparts on Appropriations until he left Congress in 2015. \"We said if leadership of both parties would get the heck out of the way, we could get something done.\"\nOther chairmen, such as Jeb Hensarling, R-Texas, of Financial Services and Bob Goodlatte, R-Va., of Judiciary are leaving after being forced to yield their gavels next year under term limit rules. They were denied signature wins under President Barack Obama — but they have not managed such wins under President Donald Trump, at least so far. They'd rather leave Congress than return to the rank and file.\nA moderate Republican in both his politics and temperament, Frelinghuysen was first elected in the 1994 GOP wave that put Republicans in control of both chambers. He hails from a New Jersey political dynasty that dates to the late 1700s. His father, Peter Frelinghuysen, served in the House for two decades.\nUnlike several other GOP chairmen to announce their retirements after running up against GOP term limit rules for panel heads, Frelinghuysen had years to go as Appropriations chair — assuming Republicans retain control of the House in the 2018 midterm elections. But he angered some conservative lawmakers over votes against the GOP tax overhaul measure last year and his opposition to an initial version of the party's effort to repeal Obama's health care law.\nTrump's sagging popularity is weighing on once-safe Republicans in educated, wealthier suburban districts such as Frelinghuysen's, where some residents could be negatively affected by provisions in the new tax law that went into effect this year.\nStill, Frelinghuysen's vote against the GOP's tax law was highly unusual and was seen as a signal of his political vulnerability. And it was unheard of for such a high-ranking chairman to buck the leadership line on such a major vote.\nAmong the leading Democrats for Frelinghuysen's seat is former federal prosecutor and former Navy helicopter pilot Mikie Sherrill. She raised more than $1.2 million through Dec. 31 and has the backing of local party leaders.\nRepublican insiders say Frelinghuysen's decision wasn't entirely a surprise. They say several potential candidates could build viable campaigns quickly.\nAmong the possible GOP candidates are three state lawmakers: Assemblyman Jay Webber, Assemblyman Anthony M. Bucco and Sen. Joe Pennacchio. Another prominent name mentioned is attorney Rosemary Becchi.\nFrelinghuysen's district had long leaned Republican but was carried only narrowly by Trump in 2016. Nonpartisan analysts say Democrats have a good chance to grab it in this year's midterms.\nFrelinghuysen took the lead in the House in a difficult 2013 effort to provide about $60 billion to help New Jersey and other northeastern states recovery from Superstorm Sandy.\n\"Public service is an incredible way to turn your convictions into something that serves the greater good and to do it alongside people from every walk of life and background,\" Frelinghuysen said.\nAssociated Press writer Bill Barrow in Atlanta contributed to this report.", "external_links": [], "published": "2018-01-30T07:24:00.000+02:00", "crawled": "2018-01-30T18:07:22.003+02:00", "highlightTitle": ""}