{"organizations": [], "uuid": "e334c7ed70e3a05e2054bacb0e7a90f4d14efd46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/carillion-restructuring/suppliers-and-staff-count-the-cost-of-uk-carillions-collapse-idUSL8N1PB2IM", "country": "US", "domain_rank": 408, "title": "Suppliers and staff count the cost of UK Carillion's collapse", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T13:42:00.000+02:00", "replies_count": 0, "uuid": "e334c7ed70e3a05e2054bacb0e7a90f4d14efd46"}, "author": "", "url": "https://www.reuters.com/article/carillion-restructuring/suppliers-and-staff-count-the-cost-of-uk-carillions-collapse-idUSL8N1PB2IM", "ord_in_thread": 0, "title": "Suppliers and staff count the cost of UK Carillion's collapse", "locations": [], "entities": {"persons": [{"name": "paul sandle", "sentiment": "none"}, {"name": "carillion", "sentiment": "none"}, {"name": "elisabeth o‘leary  london/edinburgh", "sentiment": "none"}, {"name": "rudi klein", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "uk carilli", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "carillion", "sentiment": "none"}, {"name": "specialist engineering contractors’ group", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 42 AM / Updated 23 minutes ago Suppliers and staff count the cost of UK Carillion's collapse Reuters Staff \n* Ripples felt after collapse of Carillion \n* Some small companies already laying off staff \n* Questions asked about why UK awarded contracts \nBy Paul Sandle and Elisabeth O‘Leary \nLONDON/EDINBURGH, Jan 16 (Reuters) - The collapse of British services group Carillion started to hurt thousands of small contractors on Tuesday, with some laying off workers after the rapid demise of a company that was winning state contracts as recently as November. \nRudi Klein, head of Britain’s Specialist Engineering Contractors’ Group, estimated that Carillion had left a trail of 1.2 billion pounds ($1.65 billion) in unpaid bills to thousands of small subcontractors. \nThe 200-year-old company, swamped by debt and pension liabilities and losing cash, went into liquidation on Monday, threatening suppliers, merchants and big banks. The government was forced to guarantee the provision of public services from school meals to road projects. \nExamples of private companies that could be hit included a small Northern Irish engineering contractor owed 150,000 pounds and a concrete frame manufacturer in northwest England owed 2 million pounds, Klein said. \nFlora-tec, a corporate horticulture company based in Cambridgeshire, eastern England, said it is owed more than 800,000 pounds for its work on Carillion contracts at local prisons, schools and hospitals. \n“Last month, when we were knee deep in snow, my guys were out at three in the morning putting salt down to make sure (facilities) were safe for people to use,” Managing Director Andy Bradley told BBC radio. \n“We’re not going to get paid for that.” \nBritain began outsourcing public services in the late 1980s under Margaret Thatcher and the model expanded under Labour’s Tony Blair and Gordon Brown. It is now the world’s second-largest outsourcing market behind the United States. Bradley said the government had actively encouraged small businesses to get involved in public sector contracts “to make sure the little guy got a slice of the pie”. HUNDREDS OF PROJECTS \nSpun out of Tarmac nearly 20 years ago and incorporating construction names such as Wimpey and Alfred McAlpine, Carillion operated in Britain and Ireland, Canada, the Middle East and North Africa. \nIt was working on 450 British government projects, including the building and maintenance of hospitals, schools, defence sites and a high-speed rail line. \nThe government said it would pay the salaries of the company’s public-sector workers, but private-sector contracts would only be paid for 48 hours after the collapse. \nBig outsourcers such as Carillion, Serco, Capita and others have won the vast majority of contracts worth billions of pounds. \nThe government has faced questions as to why it continued to award Carillion contracts after it first signalled it was in financial difficulty in July last year. \nJust a week after that first warning, Carillion was named as one of the contractors on Britain’s new High Speed 2 rail line, a flagship project that will better connect London with the north of England. In November, it won a further two contracts with state-owned Network Rail. JOBS AT RISK \nMike Cherry, chairman of the Federation of Small Businesses, said it was vital that Carillion’s small business suppliers were paid, or some of those firms could themselves be put in jeopardy, putting even more jobs at risk. \n“When the dust settles on this sorry saga, there is also a wider lesson to learn about the concentration of public contracts in the hands of a small number of very big businesses,” he said. \n“Public procurement must be much more small-business friendly, in which it is easier for small firms to navigate the system and the Government should prioritise meeting its target of at least one third of taxpayer-funded contracts going to smaller firms.” \nFor others, the concerns are more immediate. \nFlora-tec, for instance, said it had already had to lay off people. \n“I had to make 10 people redundant yesterday, that’s 10 people with mortgages, car loans, all that stuff,” Bradley said. \n“It’s an absolute disgrace.” ($1 = 0.7256 pounds) (Editing by Keith Weir)", "external_links": [], "published": "2018-01-16T13:42:00.000+02:00", "crawled": "2018-01-16T13:53:39.007+02:00", "highlightTitle": ""}