{"organizations": [], "uuid": "7449bd88fa3ec9aecc04cec65318a7c2adb994dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-evolent-health-completes-acquisition-of-assets-from-new-mexico-health-connections.html", "country": "US", "domain_rank": 767, "title": "Evolent Health Completes Acquisition of Assets from New Mexico Health Connections", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T00:15:00.000+02:00", "replies_count": 0, "uuid": "7449bd88fa3ec9aecc04cec65318a7c2adb994dc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-evolent-health-completes-acquisition-of-assets-from-new-mexico-health-connections.html", "ord_in_thread": 0, "title": "Evolent Health Completes Acquisition of Assets from New Mexico Health Connections", "locations": [], "entities": {"persons": [], "locations": [{"name": "new mexico", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "evolent health completes acquisition of assets", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "evolent health, inc.", "sentiment": "neutral"}, {"name": "true health new mexico, inc.", "sentiment": "none"}, {"name": "true health new mexico", "sentiment": "none"}, {"name": "new mexico health connections", "sentiment": "none"}, {"name": "nmhc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan. 2, 2018 /PRNewswire/ -- Evolent Health, Inc. (NYSE: EVH) (\"Evolent\"), a company providing an integrated value-based care platform to the nation's leading health systems and physician organizations, today announced the completion of its acquisition of certain assets from New Mexico Health Connections (NMHC). First announced on September 27, 2017, this strategic acquisition brings together two innovative companies that will operate a new health plan and managed services organization called True Health New Mexico.\nThe transaction closed on the originally announced terms, with Evolent acquiring assets related to the commercial business from New Mexico Health Connections (NMHC) for $10.25 million in cash. The assets include a commercial plan and health plan management services organization with a tenured leadership team and employee base with extensive experience working locally with providers to run NMHC's suite of preventive, disease and care management programs. The assets are being contributed to a new entity, True Health New Mexico, Inc., a wholly-owned subsidiary of Evolent Health. As of December 31, 2017, the membership in the commercial plan was just under 20,000 members.\nThe legacy NMHC entity expects to continue to operate as an independent non-profit health care organization operating throughout the state of New Mexico, offering individual health insurance products. True Health New Mexico expects to enter into a managed services agreement with NMHC to support this ongoing individual business.\n\"As part of Evolent Health, True Health New Mexico is now positioned as a thriving alternative in the New Mexico commercial market. Working with our physician partners, we will continue to deliver differentiated care to our members and see multiple potential opportunities to grow True Health New Mexico,\" said Dr. Martin Hickey, CEO of True Health New Mexico and the former CEO of NMHC.\nTo provide stability to our provider partners that will be serving our commercial members as well as NMHC's individual members, Evolent expects to extend a 15-month capital-only reinsurance arrangement to NMHC, which is currently expected to be approximately $10 million. Evolent's subsidiary, True Health New Mexico, expects to underwrite the contract. The purpose of capital only reinsurance is to provide balance sheet support to NMHC. There is no transfer of underwriting risk to Evolent or True Health New Mexico, and neither Evolent nor True Health New Mexico are at risk for any cash payments on behalf of NMHC.\nAbout Evolent Health\nEvolent Health partners with leading provider organizations to achieve superior clinical and financial results in value-based care. With a provider heritage and over 20 years of health plan administration experience, Evolent operates in more than 30 U.S. health care markets, actively managing care across Medicare, Medicaid, commercial and self-funded adult and pediatric populations. With the experience to drive change, Evolent confidently stands by a commitment to achieve results. For more information, visit evolenthealth.com .\nForward-Looking Statements – Cautionary Language\nCertain statements made in this press release and in other written or oral statements made by us or on our behalf are \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995 (\"PSLRA\"). A forward-looking statement is a statement that is not a historical fact and, without limitation, includes any statement that may predict, forecast, indicate or imply future results, performance or achievements, and may contain words like: \"believe,\" \"anticipate,\" \"expect,\" \"estimate,\" \"aim,\" \"predict,\" \"potential,\" \"continue,\" \"plan,\" \"project,\" \"will,\" \"should,\" \"shall,\" \"may,\" \"might\" and other words or phrases with similar meaning in connection with a discussion of future operating or financial performance. In particular, these include statements relating to future actions, trends in our businesses, prospective services, future performance or financial results and the outcome of contingencies, such as legal proceedings. We claim the protection afforded by the safe harbor for forward-looking statements provided by the PSLRA. These statements are only predictions based on our current expectations and projections about future events. Forward-looking statements involve risks and uncertainties that may cause actual results, level of activity, performance or achievements to differ materially from the results contained in the forward-looking statements. Risks and uncertainties that may cause actual results to vary materially, some of which are described within the forward-looking statements, include, among others, certain risks and uncertainties associated with the establishment of True Health New Mexico, the acquisition of certain assets of NMHC and the entry into a new services agreement with NMHC and new risks relating to the business of NMHC which may divert management resources and result in unanticipated costs, as well as the size, scope and other risks related to any reinsurance arrangement with NMHC.\nThe risks included here are not exhaustive. Although we believe the expectations reflected in the forward-looking statements are reasonable, we cannot guarantee our future results, level of activity, performance or achievements. Our Annual Report on Form 10-K for the fiscal year ended December 31, 2016, Quarterly Report on Form 10-Q for the quarter ended September 30, 2017, Quarterly Report on Form 10-Q for the quarter ended June 30, 2017 and other documents filed with the SEC include factors that could affect our businesses and financial performance. Moreover, we operate in a rapidly changing and competitive environment. New risk factors emerge from time to time, and it is not possible for management to predict all such risk factors. Further, it is not possible to assess the effect of all risk factors on our businesses or the extent to which any factor, or combination of factors, may cause actual results to differ materially from those contained in any forward-looking statements. Given these risks and uncertainties, investors should not place undue reliance on forward-looking statements as a prediction of actual results. In addition, we disclaim any obligation to update any forward-looking statements to reflect events or circumstances that occur after the date of this press release.\nView original content: http://www.prnewswire.com/news-releases/evolent-health-completes-acquisition-of-assets-from-new-mexico-health-connections-300576587.html\nSOURCE Evolent Health, Inc.", "external_links": ["http://www.evolenthealth.com/", "http://www.prnewswire.com/news-releases/evolent-health-completes-acquisition-of-assets-from-new-mexico-health-connections-300576587.html"], "published": "2018-01-03T00:15:00.000+02:00", "crawled": "2018-01-03T02:19:00.003+02:00", "highlightTitle": ""}