{"organizations": [], "uuid": "1b68ca3e0d31a766a7d2dbbf890306af30f6325c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-morgan-stanley-appoints-153-new-managing-directors.html", "country": "US", "domain_rank": 767, "title": "Morgan Stanley Appoints 153 New Managing Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.066, "site_type": "news", "published": "2018-01-22T20:38:00.000+02:00", "replies_count": 0, "uuid": "1b68ca3e0d31a766a7d2dbbf890306af30f6325c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-morgan-stanley-appoints-153-new-managing-directors.html", "ord_in_thread": 0, "title": "Morgan Stanley Appoints 153 New Managing Directors", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "morgan stanley", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Morgan Stanley (NYSE:MS) has announced the appointment of 153 Managing Directors. The new Managing Directors are:\nMitchell Adler James Manson-Bahr Andrea Aguiar Joseph J. Martella Abdulaziz Alajaji Kimihiko Matsuno Robert Avery Christopher May Sharon Bazbaz Mairaed McCarthy Sainath Bharatula Erin McCourt Ira Blumberg Jonathan McEwen Joseph Bonanno William McGeough Venkatadri Boppana Brian McGowan Mark Bortnik James McKenna Charles F. Burke, Jr. Andrew Alexander Medvedev Frank Campbell Joseph Mehlman Richard Caskey Thomas Mendoza Kamal Chebaklo Obaid Mufti Paul Cherian Mary E. Mullin Gary Cheung Yunchi Nam Elaine Close Pat Natale Sybil Collins Timothy Nims Lancelot Comrie Sarah Nolan Glen Cooney Brian Nowak Parker Corbin Roberto Nunez Kurt M. Cross Ryan O'Hagan Conroy Daley Lon A. O'Sullivan Andrew Davies Christopher Owens Andrew Day Rose Palazzo E. Stanhope DeLaney, IV Cheryl Palmerini Dominic Desbiens Thilakshani Dias Passi Don Devendorf Adam Pickard Michael Devine Martin Pitzer Rupa Dharia Jon Ponosuk Kyle Downey Francesco Puletti Stephen Dyer Thomas Rende Mona Eldam Thomas Restout Tserennadmid Erdenebileg Patrick Roman Markus Fimpel Ian R. Rooney Jennie Pries Friend Andrew Ross Keiko Fukuda Julie Rozenblyum Patrick Gallagher Katen Rubeo Shekar Ganesh Vida Rudkin Kerry Gendron Rachel Russell Anna Gitelman Mitsu Saito Amit Goel Srikanth Sankaran Simon Goodwin Till Schneider Anand Govind Alvaro Serrano Saenz de Tejada Eric Govind Melissa Sexton Charlie Gray Anita Shaw Jennifer A. Grego Marina Shchukina Marco Gregotti Bobby Shoraka Mutlu Guner Clifford Shu Yimei Guo Christophe Sloan Nitin Gupta April Tam Smith Brian Han Jiang Don So Kartik Hariharan Andres Sommer Chris Heffernan Elaine Souza Richard Hill S. Anthony Taggart Nathan Hilleary Daisuke Tanaka Haibo Huang Joel Thompson Dominic Hughes Eduardo Timpanaro Dan Hunt Iain Torrance Ankush R. Jain Jonathan Vannelli Erik Jepson Karen Veary Timothy Juba Alice S. Vilma Benjamin J. Juergens Roman Waleczek Beata Juvancz Suzanne Walls Kiran Karkhanis Zhao Wang Swanand Kelkar Nash Waterman David Khayat Henry Webb Gard Krause Wei Wei Jessica L. Krentzman Alexander Weng Wook Lee David Willmor Russ Lindberg Jyri Wilska Patrick Lindemann Niamh Staunton Dan Maccarrone Rachel I. Wilson Dipendra Malhotra Perren Wong Bob Mandel Huan Yu Edward Manheimer Cathy Zhang Rachel Zhang Morgan Stanley (NYSE:MS) is a leading global financial services firm providing investment banking, securities, wealth management and investment management services. With offices in more than 42 countries, the Firm's employees serve clients worldwide including corporations, governments, institutions and individuals. For more information about Morgan Stanley, please visit www.morganstanley.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006326/en/\nMorgan Stanley\nMedia Relations:\nSarah Higgins, 212-296-3648\nSarah.Higgins@morganstanley.com\nSource: Morgan Stanley", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.morganstanley.com&esheet=51746840&newsitemid=20180122006326&lan=en-US&anchor=www.morganstanley.com&index=1&md5=7a258dec63e3ac0a98c85fb574c59ec1", "http://www.businesswire.com/news/home/20180122006326/en/"], "published": "2018-01-22T20:38:00.000+02:00", "crawled": "2018-01-22T23:32:41.000+02:00", "highlightTitle": ""}