{"organizations": [], "uuid": "58614107f89c7b5a8983eb9d79901d0e8e48d7d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 15}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224952868&w=1200&r=LYNXMPEE0N29R", "site_section": "http://feeds.reuters.com/reuters/technologyNews", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-sk-hynix-results/sk-hynix-posts-record-fourth-quarter-profit-as-chip-demand-remains-firm-idUSKBN1FD35H", "country": "US", "domain_rank": 408, "title": "SK Hynix posts record annual profit on solid chip demand", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:50:00.000+02:00", "replies_count": 0, "uuid": "58614107f89c7b5a8983eb9d79901d0e8e48d7d2"}, "author": "", "url": "https://www.reuters.com/article/us-sk-hynix-results/sk-hynix-posts-record-fourth-quarter-profit-as-chip-demand-remains-firm-idUSKBN1FD35H", "ord_in_thread": 0, "title": "SK Hynix posts record annual profit on solid chip demand", "locations": [], "entities": {"persons": [{"name": "joyce lee", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}], "organizations": [{"name": "sk hynix", "sentiment": "negative"}, {"name": "samsung electronics co ltd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "sk hynix inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL (Reuters) - South Korea’s SK Hynix capped a record year in profit with a blockbuster fourth quarter and predicted a further surge in demand for memory chips this year, easing market concerns that the chip boom might be over.\nThe stock rose 5 percent on Thursday’s news after sliding about 20 percent since early November amid falling prices for NAND flash memory chips, used in USB drives and mobile phones, a mainstay for the company.\nSK Hynix said fourth-quarter operating profit nearly tripled to a record 4.5 trillion won ($4.2 billion), higher than the 4.3 trillion forecast by analysts. Revenue jumped 69 percent to 9 trillion won. That lifted annual earnings to an all-time high of 13.7 trillion won.\nDemand for more firepower, especially from servers in data centers, are seen driving 2018 profits for the world’s second-biggest memory chip maker after Samsung Electronics Co Ltd, SK Hynix said in a call with analysts and investors.\nSK Hynix’s rosy outlook boosted investor confidence in the chip sector that had taken a hit after Samsung’s profit guidance earlier this month fell short of analysts’ estimates. This week, Texas Instruments Inc posted its slowest revenue growth in four quarters on softer demand for its chips.\n“There had been various concerns such as the market slowing, NAND price dropping -- but from today’s call, it doesn’t look like a slowdown is happening,” said Lee Seung-woo, an analyst at Eugene Investment & Securities.\n“There were also worries that the Intel bug issue or the sluggish sale of Apple’s iPhones might hurt memory chip demand, but the company dispelled them,” he said.\nSK Hynix said it has not detected any slowdown in memory chip demand due to the Intel security issue, for which patches were released to counteract vulnerabilities that slowed some servers. The problem could even increase server demand as it affects high-traffic work that might have to be supplemented by server expansion, the company said.\nIn answer to a question on China’s smartphone makers resisting higher memory chip prices, SK Hynix said low-end smartphones have little room to handle rising memory prices and the firm will consider such matters in pricing, without elaborating.\nTo meet demand, especially from server clients, SK Hynix said it is considering moving up the construction of a new chip production line from year-end as originally planned. However, the new line wasn’t expected to contribute to chip supply this year because of the time it takes to install and test equipment.\nFor the industry as a whole, SK Hynix predicted NAND chip supply would grow in 2018, gradually easing a shortage. Supply of DRAM chips, used in mobile phones, computers and servers, will remain tight due to limited production capacity.\nThe company said that slower sales of some smartphones would have little impact on overall DRAM demand as other phone and PC makers would snap up the chips.\nTotal memory chip industry revenue in 2017 was a record $132 billion, up from $80 billion in 2016, and is set to rise further to $150 billion in 2018 before falling to about $130 billion in 2019, according to research provider Gartner.\nReporting by Joyce Lee; Editing by Sandra Maler, Rosalba O'Brien and Malcolm Foster\n ", "external_links": [], "published": "2018-01-25T00:50:00.000+02:00", "crawled": "2018-01-25T01:04:49.000+02:00", "highlightTitle": ""}