{"organizations": [], "uuid": "a927bdf3c3cc96474bf93b8f68d438bb69d3a477", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 12}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/28/104864813-RTX3K3IW-construction.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/09/goldman-sachs-says-us-wages-will-really-start-to-rise-this-year.html", "country": "US", "domain_rank": 767, "title": "Goldman Sachs says US wages will really start to rise this year", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T15:32:00.000+02:00", "replies_count": 0, "uuid": "a927bdf3c3cc96474bf93b8f68d438bb69d3a477"}, "author": "Natasha Turak", "url": "https://www.cnbc.com/2018/01/09/goldman-sachs-says-us-wages-will-really-start-to-rise-this-year.html", "ord_in_thread": 0, "title": "Goldman Sachs says US wages will really start to rise this year", "locations": [], "entities": {"persons": [{"name": "jan hatzius", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}], "organizations": [{"name": "goldman sachs", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "bureau of labor statistics", "sentiment": "none"}, {"name": "goldman", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As the U.S. moves beyond full employment, wages could be set to finally increase in 2018, according to Goldman Sachs.\nSpeaking to CNBC at Goldman Sachs' European headquarters in London, Goldman's Chief Economist Jan Hatzius outlined an average hourly earnings growth forecast of 3 percent for 2018, compared to 2.5 percent over 2017.\n\"3 percent (growth) I think is a reasonable expectation over the next 18 months, 3.5 (percent) is probably at the top end of what I think is plausible,\" he said.\nOn Friday, the Bureau of Labor Statistics released its nonfarm payroll numbers, a monthly measure of job and wage growth in the U.S. The figures were generally received as disappointing, with a mere nine cent increase in average hourly earnings to $26.63 in December. The year's increase in average hourly earnings was 65 cents, a relatively low figure considering the strong performance of the country's economy.\n\"We expect the unemployment rate to fall to 3.5 percent by the end of 2018,\" Goldman Sachs said in a research note late last month. \"If so, both wage growth and price inflation are likely to move higher.\" The investment bank said that wage growth disappointed somewhat in the last year, but predicted that 2018 will see a \"renewed acceleration.\"\nFull employment, in economic terms, means that unemployment has reached the lowest possible level that won't trigger inflation — for the U.S., that's around 5 percent.\nshow chapters Goldman Sachs: Four Fed rate hikes likely this year 9 Hours Ago | 04:10 While the U.S. economy is doing well — financial markets are hitting record highs and unemployment is at a 17-year low of 4.1 percent — wage growth has been slow for American workers. This is due to a number of different factors including technological changes like automation, lagging productivity, and retiring baby boomers.\nCrucial to wage growth is productivity growth, Hatzius stressed. \"One of the reasons why wage growth has been clearly weaker post-crisis is that productivity growth is a lot weaker. Then companies can't pay as much, can't raise their pay as quickly.\" Labor productivity is measured by the output of goods and services relative to the hours spent producing that output.\n\"In the pre-crisis period, there were times when we were above 4 percent, and for that we really would need to see stronger productivity growth on a sustained basis,\" he continued. \"But 3 percent I think is a reasonable expectation.\"\nGoldman Sachs also predicts four interest rate hikes from the Federal Reserve in 2018, once per quarter, as spare capacity diminishes in the economy and inflation looks to rise.\n\"If the economy continues to grow above trend, the unemployment rate continues to fall — we think it comes down to the mid-threes by the end of 2018 — and inflation is maybe a little higher, then yes, I do think they can go once a quarter,\" he said. Still, Hatzius predicts a relatively low-inflation environment for the near future.\nThe bank has also been bullish on global growth overall, predicting a lofty 4.1 percent gross domestic product growth for 2018 as the product of a broadly synchronized global upswing.", "external_links": [], "published": "2018-01-09T15:32:00.000+02:00", "crawled": "2018-01-09T15:16:45.011+02:00", "highlightTitle": ""}