{"organizations": [], "uuid": "ec8b2328d7e0617d92b6ae67f72a6af8219a6bc5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/india", "section_title": "India", "url": "https://www.reuters.com/article/us-india-trafficking-rohingya/lured-with-a-happily-ever-after-dream-rohingya-girls-sold-in-india-idUSKBN1FB1LD", "country": "US", "domain_rank": 408, "title": "Lured with a happily-ever-after dream, Rohingya girls sold in India", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-22T20:52:00.000+02:00", "replies_count": 0, "uuid": "ec8b2328d7e0617d92b6ae67f72a6af8219a6bc5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-india-trafficking-rohingya/lured-with-a-happily-ever-after-dream-rohingya-girls-sold-in-india-idUSKBN1FB1LD", "ord_in_thread": 0, "title": "Lured with a happily-ever-after dream, Rohingya girls sold in India", "locations": [], "entities": {"persons": [{"name": "raheema", "sentiment": "negative"}, {"name": "rohingy", "sentiment": "none"}], "locations": [{"name": "myanmar", "sentiment": "none"}, {"name": "rakhine", "sentiment": "none"}, {"name": "india nuh", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "bangladesh", "sentiment": "none"}], "organizations": [{"name": "rohingya", "sentiment": "negative"}, {"name": "thomson reuters foundation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NUH, India (Thomson Reuters Foundation) - At 15, Raheema left her home in Rakhine state in Myanmar, crossed two international borders and was sold to be married to a man in India just a few years younger than her father.\n“He had asked the agent if I was married before. I was single so he bought me for 20,000 Indian rupees (about $300). Married women go for 15,000 rupees,” Raheema, who gave only her first name, told the Thomson Reuters Foundation.\n“He was only slightly younger than my father... He would beat me up with electrical wires and not let me leave, saying he had bought me,” said Raheema, who now lives in a settlement in northern India housing Rohingya Muslims who have fled Myanmar.\nRaheema’s husband let her leave last year after five years of abuse. She was five months pregnant with their second child.\nIn a burgeoning refugee crisis, about 660,000 Rohingyas have fled Myanmar’s western Rakhine state across the border to Bangladesh since late August, when Rohingya militants attacked security posts and the army launched a counter-offensive.\nThey join tens of thousands of Rohingya Muslims already in Bangladesh, while pockets of Rohingya communities are dotted across South Asia, having escaped discrimination and persecution in Buddhist-majority Myanmar.\nThe International Organization for Migration (IOM) has said the new arrivals – the majority of them women and children - are at risk of human trafficking, as officials and aid workers struggle to cope with the influx.\nCases of men and women enslaved in bonded labor or trafficked for marriage have also started to emerge in India after they managed to escape or were rescued and found their way to Rohingya settlements like the one in Nuh.\nRohingya started to migrate to India years ago and there are now close to 40,000 Rohingya Muslims living in the country.\nRaheema left her home in Myanmar, “surrounded by tall blades of grass and paddy fields” to join her father in a refugee camp in Bangladesh in 2012.\n“There was no food at home and my mother thought I would be better off if I joined my father,” said Raheema, now 22. “But my aunt at the camp sold me to the agent who told her he would get me married in India.”\n“I was numb to the idea of marriage. I just followed the agent and reached Kolkata. I didn’t know any Indian language, but I thought I will be safe,” she said in fluent Hindi, from her home in Nuh in the northern Indian state of Haryana.\nSAFETY LESSONS Bangladesh’s chaotic refugee camps are fertile territory for agents like the one who bought and sold Raheema. The promise of marriage is a typical way for traffickers operating in the camps to lure girls.\n“Marriage is big for young girls and parents are agreeing to it because they see better economic stability (for their daughters),” said Iffat Nawaz, spokeswoman for aid and development organization BRAC.\nIn December, BRAC volunteers started visiting young girls at the refugee settlements in Cox’s Bazar to give them information and support on how to stay safe among so many strangers.\n“Many of these girls have never been around so many men. They are meeting a lot of new people,” said Nawaz.\nThe girls are trained over 12 sessions on signs they need to look out for - inappropriate touching, offers of money or food and shelter, and ways to differentiate between genuine humanitarian workers and traffickers.\n“There are enough incidents of girls going missing...They are being trafficked to India and Nepal. We launched this program to reduce that risk,” Nawaz said.\nIDENTITY Across the border in India, cases like Raheema are gradually emerging.\nHasina Kharbhih, founder of anti-trafficking charity Impulse NGO Network that works in India, Bangladesh and Myanmar, said the group was working on reuniting 15 Rohingya girls in India with their families.\n“These girls were trafficked and sold in India for sexual slavery or for marriage six to eight years ago. They are at government-run shelters now,” she told the Thomson Reuters Foundation.\n“We have not succeeded in sending any of them back home as we are unable to trace their families in Myanmar.”\nKharbhih also received five cases in the last six months of families in Bangladeshi refugee camps looking for girls they say were trafficked to India.\nCampaigners say there are more cases of girls sold in India, but there are challenges in identifying them.\n“(It‘s) because of the language issue - it is difficult to identify them as Rohingya or Bangladeshi as the language is very similar,” said Adrian Phillips of Justice and Care, an anti-human trafficking NGO.\nAbout 17,000 Rohingya refugees and asylum seekers are registered with U.N. refugee agency UNHCR in India and many, like Raheema, use the UNHCR’s letter acknowledging their application for a refugee card as proof of identity.\nOfficials at UNHCR, however, said neither they nor their partner organizations had recorded cases similar to Raheema‘s.\n“Based on information available with UNHCR, there is no record of a pattern of trafficking for marriages in the Rohingya refugee community in India,” said UNHCR’s Ipshita Sengupta by email.\nRaheema now lives with her two children in a slum in Nuh, in a hut made of tin and cardboard with plastic sheeting for a roof. She shows the small space she has created for a clay stove to cook food.\nShe is in touch with her mother, who is still in Myanmar.\n“I work as a maid servant here and earn 1,200 rupees,” she said. “But who will feed me if I go back to my mother?”\nReporting by Roli Srivastava @Rolionaroll; Editing by Ros Russell. Please credit Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women’s rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T20:52:00.000+02:00", "crawled": "2018-01-22T19:16:36.004+02:00", "highlightTitle": ""}