{"organizations": [], "uuid": "5eb08531387e93f614b4ab2ac670a01bfe166851", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/08/reuters-america-update-3-ex-google-engineer-fired-over-gender-memo-sues-for-discrimination.html", "country": "US", "domain_rank": 767, "title": "UPDATE 3-Ex-Google engineer fired over gender memo sues for discrimination", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T01:16:00.000+02:00", "replies_count": 0, "uuid": "5eb08531387e93f614b4ab2ac670a01bfe166851"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/08/reuters-america-update-3-ex-google-engineer-fired-over-gender-memo-sues-for-discrimination.html", "ord_in_thread": 0, "title": "UPDATE 3-Ex-Google engineer fired over gender memo sues for discrimination", "locations": [], "entities": {"persons": [{"name": "damore", "sentiment": "none"}, {"name": "david gudeman", "sentiment": "none"}, {"name": "james damore", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "mountain view", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "google", "sentiment": "negative"}, {"name": "alphabet inc", "sentiment": "none"}, {"name": "santa clara county superior court", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds comment from Google)\nSAN FRANCISCO, Jan 8 (Reuters) - A former Google engineer fired after he asserted in a memo that biological causes were behind tech industry gender inequality sued his former employer on Monday, saying he was discriminated against as a white man with conservative political views.\nJames Damore last year caused an uproar in Silicon Valley and beyond when he wrote the internal memo, which later became public. Google said he had perpetuated gender stereotypes and fired him in August.\nIn the months since, his firing has become a popular cause among right-leaning U.S. bloggers, and Damore hired a Republican Party official as his attorney.\nDamore and another white male former Google engineer, David Gudeman, filed the lawsuit as a proposed class action in Santa Clara County Superior Court in California. The lawsuit alleges workplace discrimination and retaliation.\nGoogle, a unit of Alphabet Inc based in Mountain View, California, said in a statement: \"We look forward to defending against Mr. Damore's lawsuit in court.\"\nAccording to the lawsuit, the company has failed to protect employees, especially white men, from workplace harassment related to their support of U.S. President Donald Trump or conservative political views.\n\"Damore, Gudeman, and other class members were ostracized, belittled, and punished for their heterodox political views, and for the added sin of their birth circumstances of being Caucasians and/or males,\" the lawsuit said.\nThe lawsuit also accused Google of maintaining a secret blacklist of conservative media personalities who are not allowed inside the company's offices.\nThe lawsuit requested an injunction barring Google from discriminating against individuals with conservative political views, as well as for unspecified compensation.\nGoogle Chief Executive Officer Sundar Pichai said when Damore was fired that portions of his memo \"violate our Code of Conduct and cross the line by advancing harmful gender stereotypes in our workplace.\"\nGudeman was fired in December 2016 after a confrontation with a Muslim coworker on an internal Google forum, according to the lawsuit.\nThe coworker said on the forum that the Federal Bureau of Investigation had targeted him for being a Muslim, and he expressed worry about his personal safety, the lawsuit said. Gudeman responded with skepticism, saying the coworker had provided \"zero evidence\" for the claim and suggesting the FBI may have had justification.\nA human resources employee later told Gudeman he had accused his coworker of terrorism based on religion, and that he was being fired as a result, the lawsuit said. (Reporting by David Ingram; editing by Jonathan Oatis and Tom Brown)", "external_links": [], "published": "2018-01-09T01:16:00.000+02:00", "crawled": "2018-01-09T20:43:29.037+02:00", "highlightTitle": ""}