{"organizations": [], "uuid": "4640bd0cd056a2cf4ad72d724e08ee874f055cab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220827512&w=1200&r=LYNXMPEE090SF", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-fski-martinod/martinod-looks-to-crown-unconventional-career-with-gold-idUSKBN1EZ1J0", "country": "US", "domain_rank": 408, "title": "Martinod looks to crown unconventional career with gold", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T15:16:00.000+02:00", "replies_count": 0, "uuid": "4640bd0cd056a2cf4ad72d724e08ee874f055cab"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-fski-martinod/martinod-looks-to-crown-unconventional-career-with-gold-idUSKBN1EZ1J0", "ord_in_thread": 0, "title": "Martinod looks to crown unconventional career with gold", "locations": [], "entities": {"persons": [{"name": "martinod", "sentiment": "negative"}, {"name": "marie marti", "sentiment": "negative"}], "locations": [{"name": "la plagne", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Marie Martinod ended her prolific freestyle skiing career 11 years ago to start a family at the age of 22, before the Frenchwoman was lured back after a five year hiatus when the event was included in the Olympics for the first time in 2014.\nMartinod picked up where she left off and stunned the world by claiming a halfpipe silver medal in Sochi and has since re-established herself as one of the best freestyle skiers on the circuit.\nAt 33, Martinod is one of the oldest women in the field but knows that a gold medal will complete a special comeback after her brave and unusual decision to walk away from the sport at an age when most of her rivals are reaching their peak.\nAs Martinod herself writes on her website, she quit skiing at 22 to “learn more about real life”. In her time away, she gave birth to a baby daughter and worked as a nightclub owner in the French ski resort of La Plagne.\nDespite enjoying motherhood, Martinod admitted the thrill of competitive skiing remained a magnet and, with a bit of help from Swiss skier and best friend Virginie Faivre, she rejoined the professional circuit.\nThe chance to compete at an Olympic Games had proved too enticing to miss out on and Martinod set her sights on Sochi.\nFILE PHOTO: France's Marie Martinod competes during the women's freestyle skiing halfpipe qualification round at the 2014 Sochi Winter Olympic Games in Rosa Khutor February 20, 2014. REUTERS/Mike Blake/File Photo After a bronze medal at the 2014 X Games put her back on the map, Martinod achieved her life-long dream of winning an Olympic medal with silver in the halfpipe at the age of 29.\nSince then, Martinod has gone from strength to strength and goes into the Pyeongchang Olympics as the favorite to claim gold.\nAs well as winning the 2016-17 World Cup, edging great rival Ayana Onozuka of Japan into second, Martinod also clinched her first X Games gold medal in the superpipe last January.\nThe only minor blemish on an otherwise stellar 2017 campaign saw her lose out to Onozuka at the Freestyle World Ski Championships in Sierra Nevada.\nVictory at the U.S. Grand Prix at Copper Mountain in early December sees Martinod placed second in the overall halfpipe rankings behind China’s Kexin Zhang.\nIn a sport increasingly dominated by athletes in their teens or early twenties, thirtysomething mother Martinod is bucking that trend and her story is sure to draw her plenty of support when she takes to the slopes in Pyeongchang.\nReporting by Jack Tarrant; Editing by John O'Brien\n ", "external_links": [], "published": "2018-01-10T15:16:00.000+02:00", "crawled": "2018-01-10T15:33:13.031+02:00", "highlightTitle": ""}