{"organizations": [], "uuid": "d75f742439a59870b7719e875ec2a139595fa340", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-acorn-international-announces-appointment-of-new-director.html", "country": "US", "domain_rank": 767, "title": "Acorn International Announces Appointment of New Director", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:30:00.000+02:00", "replies_count": 0, "uuid": "d75f742439a59870b7719e875ec2a139595fa340"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-acorn-international-announces-appointment-of-new-director.html", "ord_in_thread": 0, "title": "Acorn International Announces Appointment of New Director", "locations": [], "entities": {"persons": [{"name": "urs p. zimmerman", "sentiment": "none"}, {"name": "zimmerman", "sentiment": "none"}, {"name": "zimmermann", "sentiment": "none"}], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}, {"name": "asia-pacific region", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "acorn international", "sentiment": "negative"}, {"name": "acorn international, inc.", "sentiment": "neutral"}, {"name": "company's articles of association", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "acorn", "sentiment": "none"}, {"name": "ingeniocorp co. ltd.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHANGHAI, China, Jan. 24, 2018 /PRNewswire/ -- Acorn International, Inc. (NYSE: ATV) (\"Acorn\" or the \"Company\") today announced that its board of directors has appointed Mr. Urs P. Zimmerman as a director of the Company, effective January 15, 2018. In accordance with the Company's Articles of Association, Mr. Zimmerman will hold office until the Company's next annual general meeting and will be eligible for re-election at such meeting.\nMr. Zimmermann brings a wealth of expertise and knowledge to his role at Acorn, gained from spending more than 12 years working in multiple countries in Asia. Since April of 2015 he has served as the Senior Director and Country Head of DKSH China, a leading Swiss Market Expansion Service provider with a strong global brand portfolio focused on Asia. From May 2013 to March 2015 Mr. Zimmerman served as Country Head and Interim Manager in Thailand for IngenioCorp Co. Ltd., a logistics and supply chain solutions provider. Prior to that, Mr. Zimmerman held various executive roles in Europe, Africa and the Asia-Pacific Region with some of the world's leading logistics and supply chain management and healthcare companies. During his time in Asia, he held several Senior Director positions, including Regional CFO Asia in Hong Kong and had the responsibility for business development in several Asian countries. Born and raised in Switzerland, Mr. Zimmermann speaks German, English, French and is proficient in Spanish and Portuguese. He holds a Federal Certificate in Commerce and Administration in Switzerland. He gained his professional qualification through management courses from the International Institute for Management Development (IMD), Lausanne with a focus on business strategy, entrepreneurship, marketing, finance and leadership and holds an executive MBA from the IMD in Lausanne, Switzerland.\nCommenting on Mr. Zimmerman's appointment, Acorn's President and CEO Jacob A. Fisch said, \"Mr. Zimmerman's expertise in capturing new business opportunities in Asia, accelerating growth and expanding into new markets will serve Acorn well. I look forward to working with him in our ongoing efforts to rebuild this business.\"\nAcorn's Executive Chairman Robert Roche added, \"Mr. Zimmerman's breadth of experience in international business, along with his strong leadership skills, makes him a welcome addition to the Board. I am confident Acorn will benefit from his insights and guidance.\"\nAbout Acorn International, Inc.\nCo-founded in 1998 by Executive Chairman Robert Roche , Acorn is a marketing and branding company in China with a proven track record of developing, promoting and selling a diverse portfolio of proprietary-branded products, as well as well-established and promising new products from third parties. Its business is currently comprised of two main divisions, its direct sales platforms and its nationwide distribution network. For more information visit www.acorninternationalir.com .\nSafe Harbor Statement\nThis news release contains forward-looking statements. These statements constitute \"forward-looking\" statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended, and as defined in the U.S. Private Securities Litigation Reform Act of 1995. can be identified by terminology such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"future,\" \"going forward,\" \"intends,\" \"outlook,\" \"plans,\" \"target,\" \"will,\" and similar statements. Such statements are based on management's current expectations and current market and operating conditions, and relate to events that involve known or unknown risks, uncertainties, and other factors, all of which are difficult to predict and many of which are beyond the Company's control, which may cause the Company's actual results, performance, or achievements to differ materially from those in the forward-looking statements. Further information regarding these and other risks, uncertainties, or factors is included in the Company's filings with the U.S. Securities and Exchange Commission. The Company does not undertake any obligation to update any forward-looking statement as a result of new information, future events, or otherwise, except as required by law.\nContact:\nAcorn International, Inc.\nCompass Investor Relations\nMs. Naomi Deng\nMs. Elaine Ketchmere, CFA\nPhone +86-21-5151-2944\nPhone: +1-310-528-3031\nEmail: dengqi@chinadrtv.com\nEmail: Eketchmere@compass-ir.com\nwww.chinadrtv.com\nwww.compassinvestorrelations.com\nView original content: http://www.prnewswire.com/news-releases/acorn-international-announces-appointment-of-new-director-300587741.html\nSOURCE Acorn International, Inc.", "external_links": ["http://www.acorninternationalir.com/", "https://www.huffingtonpost.com/author/robert-roche", "http://www.chinadrtv.com/", "http://www.prnewswire.com/news-releases/acorn-international-announces-appointment-of-new-director-300587741.html", "http://www.compassinvestorrelations.com/", "http://www.acorninternationalir.com/home/robert-roche/"], "published": "2018-01-25T00:30:00.000+02:00", "crawled": "2018-01-25T01:48:42.000+02:00", "highlightTitle": ""}