{"organizations": [], "uuid": "072fded32292fcb90c7e494ee1979e04b04ebb1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222144411&w=1200&r=LYNXMPEE0E0VV", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-alps-hirscher/alpine-skiing-drones-aircraft-and-injuries-fail-to-stop-hirscher-idUKKBN1F41O7", "country": "US", "domain_rank": 408, "title": "Alpine skiing - Drones, aircraft and injuries fail to stop Hirscher", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T15:13:00.000+02:00", "replies_count": 0, "uuid": "072fded32292fcb90c7e494ee1979e04b04ebb1e"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-alps-hirscher/alpine-skiing-drones-aircraft-and-injuries-fail-to-stop-hirscher-idUKKBN1F41O7", "ord_in_thread": 0, "title": "Alpine skiing - Drones, aircraft and injuries fail to stop Hirscher", "locations": [], "entities": {"persons": [{"name": "hirscher", "sentiment": "negative"}, {"name": "hirscher b", "sentiment": "negative"}, {"name": "mario mat", "sentiment": "none"}, {"name": "marcel hirscher", "sentiment": "none"}], "locations": [{"name": "austria", "sentiment": "none"}, {"name": "st. moritz", "sentiment": "none"}, {"name": "wengen", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 15 PM / Updated 7 minutes ago Alpine skiing - Drones, aircraft and injuries fail to stop Hirscher Brian Homewood 4 Min Read \nWENGEN, Switzerland (Reuters) - It takes more than an ankle injury, a mishap involving a military aircraft or a drone falling on to the piste to stop Marcel Hirscher. FILE PHOTO: Alpine Skiing - FIS Alpine Skiing World Championships - Men's Special Slalom - St. Moritz, Switzerland - 19/2/17 - Gold medalist Marcel Hirscher of Austria poses with his medals during the medal ceremony. REUTERS/Stefano Rellandini/File photo \nThe relentless Austrian is recognised as one of the finest-ever skiers after winning six successive titles in the overall World Cup, regarded as the pinnacle for skiers as it combines results from all disciplines over the whole season. \nYet, an Olympic gold remains conspicuously absent from the 28-year-old slalom specialist’s trophy cabinet. \nHe missed out on medals at the 2010 Games, finishing fourth in the giant slalom and fifth in the slalom, and had to settle for silver in the giant slalom in Sochi where he was pipped by compatriot Mario Matt on a tough, controversial course. \nIt is not something that bothers him unduly, however. ”If I win gold, that would be great,“ he said last year. ”But if not, I don’t think people are going to say that my career was rubbish.”. \nOn the World Cup circuit, Hirscher is peerless. \nHe won nine races on the way to claiming his first overall World Cup in 2012 and has gone on to become the first skier to win it six times. \nHopes of a seventh title this term appeared to be jeopardised when he broke his ankle in a training accident in August but Hirscher was never going to be bothered by that sort of setback. \nHe won the giant slalom at Alta Badia by a huge 1.70 metres and on Sunday filled one of the few holes in his career by winning the slalom at Wengen, the only so-called classic where he had not previously triumphed. It was his eighth World Cup win of the season and fifth in a row in the slalom. \n“Marcel is in a league of his own and it’s really hard to compete with him... we are trying our best,” said Swedish skier Andre Myhrer after the Wengen race. FILE PHOTO: Alpine Skiing - FIS Alpine Skiing World Cup - Men's Slalom - Kitzbuehel, Austria - 22/01/17 - Marcel Hirscher of Austria in action. REUTERS/Dominic Ebenbichler/File photo \nThe all-action Hirscher chooses motocross, kayaking and white-water rafting as his way of relaxing although he likes a quiet walk to wind down after a big race. It seems that nothing can get in his way. \nTwo years ago, Hirscher was nearly struck by a camera-carrying drone which fell from the air and missed him by centimetres during a World Cup giant slalom at Madonna di Campiglio. He went on to finish second. \nLast year, the giant slalom at the world championships in St Moritz was delayed after a military aircraft taking part in a training exercise cut the cable of an overhead television camera. \nThe camera fell into the finish line area but no skiers were hurt and Hirscher won the race. \nMarc Girardelli, himself the winner of five overall World Cup titles, said Hirscher’s form after his recovery may have demoralised his rivals further. \n”It was a hammer blow for every skier who has been preparing for months,” he said. “He has come back from injury, he is still in pain and is still faster than everyone else. I’ve never seen anything like it.” \nTwice overall World Cup champion Aksel Lund Svindal told Reuters that Hirscher would almost certainly come to be regarded as the sport’s second-greatest exponent after Ingemar Stenmark, who won 86 World Cup races. \n“It’s his consistency... he is able to pull through race after race after race,” said Svindal. \nSvindal said Hirscher’s dominance was especially remarkable in a sport where the slightest mistake can prove disastrous. \n“It’s small margins, if you make a mistake you’re out,” he said, adding that Hirscher’s avoidance of the speed events did nothing to detract from his record. \n“If you can have that kind of consistency, then it doesn’t matter, you don’t need to do downhill. You’re still a worthy winner of the World Cup.” Editing by Clare Fallon", "external_links": [], "published": "2018-01-15T15:13:00.000+02:00", "crawled": "2018-01-15T15:31:14.027+02:00", "highlightTitle": ""}