{"organizations": [], "uuid": "82f0b89bbb2e1f51364d0f463450f1c6d10c7897", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-germany-hatecrime/top-selling-german-newspaper-says-new-online-hate-speech-law-must-be-scrapped-idUSKBN1ET180", "country": "US", "domain_rank": 408, "title": "Top-selling German newspaper says new online hate speech law must be scrapped", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T13:21:00.000+02:00", "replies_count": 0, "uuid": "82f0b89bbb2e1f51364d0f463450f1c6d10c7897"}, "author": "", "url": "https://www.reuters.com/article/us-germany-hatecrime/top-selling-german-newspaper-says-new-online-hate-speech-law-must-be-scrapped-idUSKBN1ET180", "ord_in_thread": 0, "title": "Top-selling German newspaper says new online hate speech law must be scrapped", "locations": [], "entities": {"persons": [{"name": "julian reichelt", "sentiment": "none"}, {"name": "michelle martin", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}], "organizations": [{"name": "bild", "sentiment": "none"}, {"name": "min read  berlin", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 11:33 AM / in 9 hours Top-selling German newspaper says new online hate speech law must be scrapped Reuters Staff \n(Attention: strong language in eighth paragraph) \nBy Michelle Martin \nBERLIN (Reuters) - A new law meant to curtail hate speech on social media in Germany is stifling free speech and making martyrs out of anti-immigrant politicians whose posts are deleted, the top-selling Bild newspaper said on Thursday. \nThe law which took effect on Jan. 1 can impose fines of up to 50 million euros ($60 million) on sites that fail to remove hate speech promptly. Twitter has deleted anti-Muslim and anti-migrant posts by the far-right Alternative for Germany (AfD) and blocked a satirical account that parodied Islamophobia. \n“Please spare us the thought police!” read a headline in Wednesday’s Bild above an article that called the law a “sin” against freedom of opinion enshrined in Germany’s constitution. \nThe law requires social media sites to delete or block obviously criminal content within 24 hours but Bild Editor-in-Chief Julian Reichelt said it could be applied against anything and anyone since there was no definition of what was “manifestly unlawful” in most cases. \nIntended to prevent radical groups from gaining influence, it was having precisely the opposite effect, he said. \n“The law against online hate speech failed on its very first day. It should be abolished immediately,” Reichelt wrote, adding that the law was turning AfD politicians into “opinion martyrs”. \nAmong the tweets deleted was one by AfD lawmaker Beatrix von Storch criticizing police for tweeting in Arabic, saying they had sought “to appease the barbaric, Muslim, rapist hordes of men”. Police have since asked prosecutors to investigate her for possible incitement to hatred. \nA deleted tweet by another AfD member of parliament, Jens Maier, called Noah Becker - the son of former tennis champion Boris Becker - a “half-nigger”. \nJustice Minister Heiko Maas defended the law, telling Bild that freedom of opinion did not mean carte blanche to spread criminal content on the internet. \n“Calls to murder, threats, insults and incitement of the masses or Auschwitz lies are not an expression of freedom of opinion but rather attacks on the freedom of opinion of others,” he said. \nGermany has some of the world’s toughest laws on defamation, incitement to commit crimes and threats of violence, with prison sentences for Holocaust denial or inciting hatred against minorities. \nMaas said social networks needed to stick to the law like everyone else, adding: “Those who care about protecting freedom of opinion can’t just look on as criminal incitement and threats inhibit the open exchange of views.” Reporting by Michelle Martin; Editing by Robin Pomeroy", "external_links": [], "published": "2018-01-04T13:21:00.000+02:00", "crawled": "2018-01-04T13:49:12.016+02:00", "highlightTitle": ""}