{"organizations": [], "uuid": "f89a12b9b0c2f12cb51c485d99bff324266dca71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-plymouth-industrial-reit-acquires-portfolio-of-three-single-tenant-industrial-buildings-in-atlanta-for-11-point-4-million.html", "country": "US", "domain_rank": 767, "title": "Plymouth Industrial REIT Acquires Portfolio of Three Single-Tenant Industrial Buildings in Atlanta for $11.4 Million", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.967, "site_type": "news", "published": "2018-01-03T14:30:00.000+02:00", "replies_count": 0, "uuid": "f89a12b9b0c2f12cb51c485d99bff324266dca71"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-plymouth-industrial-reit-acquires-portfolio-of-three-single-tenant-industrial-buildings-in-atlanta-for-11-point-4-million.html", "ord_in_thread": 0, "title": "Plymouth Industrial REIT Acquires Portfolio of Three Single-Tenant Industrial Buildings in Atlanta for $11.4 Million", "locations": [], "entities": {"persons": [{"name": "bio-lab", "sentiment": "none"}, {"name": "jeff witherell", "sentiment": "none"}, {"name": "pendleton white", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "harland drive", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "dogwood drive", "sentiment": "none"}], "organizations": [{"name": "plymouth industrial", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "plymouth industrial reit, inc.", "sentiment": "neutral"}, {"name": "clairon metals corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON--(BUSINESS WIRE)-- Plymouth Industrial REIT, Inc. (NYSE American: PLYM) announced that on December 21, 2017 it acquired three single-tenant industrial buildings in Atlanta, Georgia totaling 330,361 square feet for $11.425 million in cash. The acquisition is projected to provide an initial yield of 8.3%.\nThe portfolio is occupied by three longstanding tenants with extended histories at the properties with excellent visibility and access to I-20. The 198,000-square-foot 1665 Conyers Drive is leased to DiversiTech, a leading supplier of HVAC components. The 100,000-square-foot 1715 Dogwood Drive is occupied by Bio-Lab, a chemical and cleaning products company for the pool and spa industries. The 32,361-square-foot 11236 Harland Drive is occupied by Clairon Metals Corporation, a leading metal stamping company.\nJeff Witherell, Chairman and Chief Executive Officer of Plymouth Industrial REIT, noted, “We are excited to extend our presence in the Atlanta market with such well-located buildings and strong tenants.”\nPendleton White, Jr., President and Chief Investment Officer, added, “We acquired these mission critical buildings, where two of the tenants have manufacturing facilities in close proximity, at well-below replacement cost and a combined weighted average lease term of over four years. With the I-20 East submarket possessing one of the lowest vacancy rates in Atlanta as well as limited amount of new supply, we are confident these assets will be strong long-term investments.”\nAbout Plymouth\nPlymouth Industrial REIT, Inc. is a full service real estate investment company structured as a vertically integrated, self-administered and self-managed real estate investment trust focused on the acquisition, ownership and management of single and multi-tenant industrial properties, including distribution centers, warehouses and light industrial properties, primarily located in secondary and select primary markets across the United States. The Company seeks to acquire properties that provide current operating income with the opportunity to enhance shareholder value through property re-positioning, capital improvements and restructuring tenant leases.\nForward-Looking Statements\nThis press release includes “ ” that are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933 and of Section 21E of the Securities Exchange Act of 1934. The in this release do not constitute guarantees of future performance. Investors are cautioned that statements in this press release, which are not strictly historical statements, including, without limitation, statements regarding management's plans, objectives and strategies, constitute Such are subject to a number of known and unknown risks and uncertainties that could cause actual results to differ anticipated by the forward-looking statement, many of which may be beyond our control. Forward-looking statements generally can be identified by the use of forward-looking terminology such as “may,” “plan,” “seek,” “will,” “expect,” “intend,” “estimate,” “anticipate,” “believe” or “continue” or the negative thereof or variations thereon or similar terminology. Any forward-looking information presented herein is made only as of the date of this press release, and we do not undertake any obligation to update or revise any forward-looking information to reflect changes in assumptions, the occurrence of unanticipated events, or otherwise.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180103005147/en/\nSCR Partners\nTripp Sullivan, 615-760-1104\nTSullivan@scr-ir.com\nSource: Plymouth Industrial REIT, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180103005147/en/"], "published": "2018-01-03T14:30:00.000+02:00", "crawled": "2018-01-03T13:57:47.000+02:00", "highlightTitle": ""}