{"organizations": [], "uuid": "4ff388cae96221603e47b0dd8d0f862d858d1956", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/11/12/101190203-Ripples_[XRP].1910x1000.jpeg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/05/cryptocurrency-ripple-briefly-drops-more-than-11-percent.html", "country": "US", "domain_rank": 767, "title": "Cryptocurrency ripple briefly drops more than 11%", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.021, "site_type": "news", "published": "2018-01-05T20:37:00.000+02:00", "replies_count": 0, "uuid": "4ff388cae96221603e47b0dd8d0f862d858d1956"}, "author": "Evelyn Cheng", "url": "https://www.cnbc.com/2018/01/05/cryptocurrency-ripple-briefly-drops-more-than-11-percent.html", "ord_in_thread": 0, "title": "Cryptocurrency ripple briefly drops more than 11%", "locations": [], "entities": {"persons": [{"name": "coinmarketcap", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ripple tumbled more than 11 percent, dropping below $3 Friday, after crossing above that level for the first time two days ago.\nThe digital currency, officially called XRP, was trading near $2.83, down 11.56 percent on the day and off 26 percent from its record high of $3.84 hit Thursday, according to CoinMarketCap. Ripple traded near $2.98 Friday afternoon.\nThe decline followed a Coinbase blog post released Thursday afternoon that pushed back against recent rumors the company would soon add ripple to its marketplace.\n\"As of the date of this statement, we have made no decision to add additional assets to either GDAX or Coinbase. Any statement to the contrary is untrue and not authorized by the company,\" the post said.\nRipple 12-month performance\nSource: CoinMarketCap\nCoinbase had more than 13 million users, as of the end of November, and is the leading way to buy and sell major digital currencies in the U.S. Bitcoin's offshoot, bitcoin cash, saw its price surge in late December around news that Coinbase was adding bitcoin cash trading .\nEven with Friday's decline, ripple had a market capitalization of about $109.6 billion and remained the second-largest digital currency by market capitalization, according to CoinMarketCap. Bitcoin , the largest cryptocurrency by market cap, traded about 11 percent higher near $16,500, according to Coinbase.\nRipple is officially a San Francisco-based startup developing a payments network for financial institutions. Co-founder Jed McCaleb has since left to create Stellar, which operates a payments network that allows exchange of government-backed currencies, such as turning U.S. dollars into euros, according to its website.\nStellar, or XLM, fell 12 percent, to 63.5 cents, Friday afternoon, according to CoinMarketCap. The digital currency had surged in the last few days to become the sixth-largest digital currency by market cap , but ranked ninth Friday, based on CoinMarketCap data.", "external_links": [], "published": "2018-01-05T20:37:00.000+02:00", "crawled": "2018-01-05T20:45:03.046+02:00", "highlightTitle": ""}