{"organizations": [], "uuid": "ab73c6259f1a2e5eb8d39b85339f3df42cebc0df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 77}, "facebook": {"likes": 239, "shares": 239, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/10/104763899-RTX23G65-oil.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/oil-price-crude-could-hit-80-by-end-of-2018.html", "country": "US", "domain_rank": 767, "title": "Oil price: Crude could hit $80 by end of 2018", "performance_score": 2, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.195, "site_type": "news", "published": "2018-01-03T05:10:00.000+02:00", "replies_count": 0, "uuid": "ab73c6259f1a2e5eb8d39b85339f3df42cebc0df"}, "author": "", "url": "https://www.cnbc.com/2018/01/02/oil-price-crude-could-hit-80-by-end-of-2018.html", "ord_in_thread": 0, "title": "Oil price: Crude could hit $80 by end of 2018", "locations": [], "entities": {"persons": [{"name": "yoon chou chong", "sentiment": "none"}, {"name": "chong", "sentiment": "none"}, {"name": "essam al-sudani", "sentiment": "none"}], "locations": [{"name": "amara", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "baghdad", "sentiment": "none"}, {"name": "halfaya", "sentiment": "none"}], "organizations": [{"name": "saudi aramco", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "natixis asset management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "16 Hours Ago | 02:24 \nThis year could mark a comeback for commodities, with oil potentially hitting $80 per barrel, a portfolio manager said on Wednesday. \nRestrained production among major oil producers and the \"greater impetus\" to maintain stability ahead of the widely-anticipated initial public offering of Saudi Aramco will support prices further this year, said Yoon Chou Chong, head of Asian equities at Natixis Asset Management. \n\"We've done a lot through the exporters, tech and we're still happy with them. (But) I think this might be the year for the return of the commodities, the oil,\" Chong told CNBC. He named commodities as a top trade for 2018. \n\"The $80-mark ... (doesn't) sound too preposterous, actually,\" he added. Essam Al-Sudani | Reuters People work at the Halfaya oilfield in Amara, southeast of Baghdad. \nOil prices opened the year above $60 a barrel — the strongest start to a calendar year since 2014. Both crude oil benchmarks — the U.S. West Texas Intermediate (WTI) and globally traded Brent — rose amid production cuts led by the Organization of the Petroleum Exporting Countries and anti-government protests in Iran. \nOil prices last hit $80 per barrel in in November 2014. Both WTI and Brent collapsed from above $100 per barrel in June 2014 to around $30 a barrel in January 2016 due to weak demand, a strong dollar and booming U.S. shale production. \nOPEC, along with other oil producers such as Russia , has curbed the supply of crude since January last year. The output cuts will be extended until the end of this year . Predictions for Asian stocks \nSeparately, Chong said Asian stocks could extend their gains this year. In particular, he said he likes Chinese stocks such as tech firm and exporters, both of which are still \"not too expensive.\" However, he said he would stay away from the region's utilities and telecom stocks. \nChong, like many other investors, downplayed risks to financial markets from North Korea's nuclear threats. He said that shifts in monetary policy globally will have a greater impact on where investors park their money. \n\"Investors have been taking it (North Korean risks) with a pinch of salt and assume that sanity will prevail eventually,\" Chong said. \"I think people will act rationally in the end. There are big interested parties — South Korea , China and the U.S. — whom I think wouldn't want (any catastrophe) to happen.\" \n— CNBC's Sam Meredith contributed to this report", "external_links": [], "published": "2018-01-03T05:10:00.000+02:00", "crawled": "2018-01-03T05:30:42.018+02:00", "highlightTitle": ""}