{"organizations": [], "uuid": "864ca3031b751c2777a84c635377f77a84ac7e19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-metals/metals-london-copper-climbs-off-two-week-trough-softer-dollar-supports-idUSL4N1P51K7", "country": "US", "domain_rank": 408, "title": "METALS-London copper climbs off two week trough, softer dollar supports", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T05:37:00.000+02:00", "replies_count": 0, "uuid": "864ca3031b751c2777a84c635377f77a84ac7e19"}, "author": "", "url": "https://www.reuters.com/article/global-metals/metals-london-copper-climbs-off-two-week-trough-softer-dollar-supports-idUSL4N1P51K7", "ord_in_thread": 0, "title": "METALS-London copper climbs off two week trough, softer dollar supports", "locations": [], "entities": {"persons": [], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "london metal exchange", "sentiment": "none"}, {"name": "shanghai futures exchange", "sentiment": "none"}, {"name": "world bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  METALS-London copper climbs off two week trough, softer dollar supports Reuters Staff 4 Min Read \nMELBOURNE, Jan 10 (Reuters) - London copper rose on Wednesday, away from the weakest in a fortnight struck in the previous session, as the dollar softened and the World Bank issued a solid view of global economic growth that supported demand expectations for metals. FUNDAMENTALS * COPPER: London Metal Exchange copper edged up by 0.3 percent to $7,121.50 a tonne by 0241 GMT, neutralising losses from the previous session when prices tipped their lowest since Dec. 22 at $7,086. * Shanghai Futures Exchange copper edged up 0.2 percent to 54,910 yuan ($8,411) a tonne, having found support at the 100-day moving average of 53,180 yuan a tonne. * NICKEL: ShFE nickel rose to its highest in nearly two months at 100,900 yuan a tonne. A trader said he expects China's nickel imports to fall away further after the country raised import taxes to 2 percent for 2018, from 1 percent last year. China's refined nickel imports slumped by 43.7 pct to under 200,000 tonnes in the first 11 months of 2017. * FORECASTS: The global economy is set to expand by 3.1 percent in 2018, slightly up from 3 percent last year and marking the first year since the 2008 Great Recession that it will near or achieve full growth potential, the World Bank said. * GERMANY ECONOMY: Industrial production and exports from Germany rose more than expected in November, prompting the government to raise its estimate of growth for 2017. * ALUMINIUM: U.S. aluminium products makers sought new trade protections against Chinese imports on Tuesday, accusing China Zhongwang Holdings Ltd and its affiliates of evading U.S. anti-dumping and anti-subsidy duties by shipping aluminium products through Vietnam. * ALUMINIUM: Norwegian aluminium maker Norsk Hydro can further increase its domestic output on top of the planned restart of a mothballed facility. * AUTO DEMAND: Potentially crimping metals demand, automakers in China face their weakest year of sales growth in at least two decades as a phasing out of tax cuts on smaller engine cars looks set to further dampen customer demand in the world's largest car market. * MARKETS: Benchmark U.S. Treasury yields hit a 10-month high on Tuesday after the Bank of Japan tweaked its bond-buying program, while stocks in world indexes continued their flying start to the year. * COMING UP: U.S. Import, Export Prices for Dec at 1330 GMT PRICES BASE METALS PRICES 0247 GMT Three month LME copper 7123.5 Most active ShFE copper 54920 Three month LME aluminium 2166.5 Most active ShFE aluminium 14960 Three month LME zinc 3340 Most active ShFE zinc 26175 Three month LME lead 2559 Most active ShFE lead 19475 Three month LME nickel 12720 Most active ShFE nickel 100640 Three month LME tin 19945 Most active ShFE tin 145220 BASE METALS ARBITRAGE LME/SHFE COPPER LMESHFCUc3 683.49 LME/SHFE ALUMINIUM LMESHFALc3 -1384.2 2 LME/SHFE ZINC LMESHFZNc3 377.96 LME/SHFE LEAD LMESHFPBc3 -672.76 LME/SHFE NICKEL LMESHFNIc3 2055.54 ($1 = 6.5286 Chinese yuan) (Reporting by Melanie Burton; Editing by Tom Hogue)", "external_links": [], "published": "2018-01-10T05:37:00.000+02:00", "crawled": "2018-01-10T05:59:03.006+02:00", "highlightTitle": ""}