{"organizations": [], "uuid": "4650323c7ee2d5c453682bfbf5a53a4df30e83d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/gettyimages-692694196.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/24/apple-homepod-tim-cook/", "country": "US", "domain_rank": 1196, "title": "Apple CEO Tim Cook: Why You'll Want HomePod Over Amazon Echo | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.192, "site_type": "news", "published": "2018-01-24T11:35:00.000+02:00", "replies_count": 0, "uuid": "4650323c7ee2d5c453682bfbf5a53a4df30e83d0"}, "author": "Don Reisinger", "url": "http://fortune.com/2018/01/24/apple-homepod-tim-cook/", "ord_in_thread": 0, "title": "Apple CEO Tim Cook: Why You'll Want HomePod Over Amazon Echo | Fortune", "locations": [], "entities": {"persons": [{"name": "tim cook", "sentiment": "negative"}, {"name": "don reisinger", "sentiment": "negative"}, {"name": "cook", "sentiment": "none"}, {"name": "siri", "sentiment": "none"}], "locations": [], "organizations": [{"name": "amazon echo", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "financial post", "sentiment": "none"}, {"name": "fortune", "sentiment": "none"}, {"name": "google home", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Don Reisinger 9:35 AM EST \nApple CEO Tim Cook is making the argument for buying a HomePod. And it surprisingly has little to do with the smart speaker’s virtual personal assistant Siri. \nSpeaking to the Financial Post in an interview this week, Cook said that the device’s audio quality will differentiate the HomePod in a market dominated by the likes of Amazon Echo and Google Home, and truly put music at the center of the broader experience. \n“We think one thing that was missing from this market was a quality audio experience, a very immersive audio experience,” Cook said in the interview. “Music deserves that kind of quality as opposed to some kind of squeaky sound.” \nCook went on to say that Apple’s software-hardware combination will also prove appealing. \nGet Data Sheet , Fortune’s technology newsletter \nApple unveiled the HomePod last year. The device is a smart speaker similar to the Amazon Echo and Google Home, but comes with higher-powered speakers, according to Apple. It’s also powered by Apple’s virtual personal assistant Siri, which can be used to turn on lights, interact with thermostats, and perform other functions. \nSince its announcement, some industry pundits questioned whether the HomePod could compete with Echo, which makes that device’s built-in assistant, Alexa, the central component. Alexa is generally considered a more capable virtual assistant than Siri and offers support for a variety of “skills” that range from controlling the smart home to ordering a pizza or Uber car. \nWhile Apple has touted the HomePod’s Siri support, the device’s sound quality has been featured most prominently in its sales pitch. In fact, the HomePod can be linked to other HomePods to use them as stereo speakers. HomePods in different rooms can also play different content, creating a multi-room audio setup. In some respects, the HomePod is one-part Amazon Echo and one-part Sonos, a popular wireless speaker with booming sound. \nWhether the HomePod will in fact deliver the best audio quality in the market remains to be seen. But we won’t need to wait long to find out: Apple announced on Tuesday that it’ll start selling the HomePod on February 9 . Apple will begin accepting pre-orders on Friday. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-24T11:35:00.000+02:00", "crawled": "2018-01-24T23:11:21.003+02:00", "highlightTitle": ""}