{"organizations": [], "uuid": "c635fd953789f5343c0a3080e770fb3308a68fcf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 28, "shares": 28, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225755313&w=1200&r=LYNXMPEE0Q0B2", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen/wozniacki-beats-halep-to-win-australian-open-idUSKBN1FG0FO", "country": "US", "domain_rank": 408, "title": "Wozniacki beats Halep to win Australian Open", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T13:44:00.000+02:00", "replies_count": 0, "uuid": "c635fd953789f5343c0a3080e770fb3308a68fcf"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen/wozniacki-beats-halep-to-win-australian-open-idUSKBN1FG0FO", "ord_in_thread": 0, "title": "Wozniacki beats Halep to win Australian Open", "locations": [], "entities": {"persons": [{"name": "ian ransom", "sentiment": "negative"}, {"name": "halep", "sentiment": "negative"}, {"name": "wozniacki", "sentiment": "negative"}, {"name": "dane", "sentiment": "none"}, {"name": "caroline wozniacki", "sentiment": "none"}, {"name": "simona halep", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 11:43 AM / Updated 40 minutes ago Wozniacki ends long wait for first grand slam title Ian Ransom 4 Min Read \nMELBOURNE (Reuters) - Caroline Wozniacki held firm to edge a brave Simona Halep in a classic Australian Open final on Saturday, claiming a long-awaited grand slam title after two heart-breaking near-misses. \nIn a captivating tussle played out in stifling humidity, the Dane hung tough in a nerve-shredding final set to win 7-6(2) 3-6 6-4 under the lights at a heaving Rod Laver Arena. \nShe swiped Halep’s world number one ranking in the process, six years after losing it at the 2012 tournament at Melbourne Park, the restoration having taken a record amount of time. \n“I have to take a second to hug Daphne... it’s a dream come true, and my voice is shaking, it’s a very emotional moment,” a teary-eyed Wozniacki said, cradling the Daphne Akhurst Memorial Cup at the presentation ceremony. \n“I want to congratulate Simona. I know today is a tough day and I‘m sorry I had to win.” \nAfter closing it out when Halep netted a backhand, the overwhelmed Dane threw her racket away and collapsed onto the blue hardcourt as the packed terraces roared. \nFollowing runner-up finishes at the 2009 and 2014 U.S. Opens, it was third time lucky for the 27-year-old who saved match points in her second round match against Jana Fett. \nMaking the breakthrough in her 43rd grand slam appearance -- only three players have needed more -- Wozniacki will no longer be known as one of the game’s best without a major success. \n“Honestly, I think that’s one of the most positive things about all of this,” the second seed told reporters. \n“I‘m never going to get that question again. I‘m just waiting for the question, ‘when are you going to win the second one?” \nTop seed Halep was gallant in defeat and at the end of an exhausting campaign, she came back from a break down in the final set to push within two games of victory. \nBut Wozniacki took full advantage of the fatiguing Romanian, claiming the last three games after some furious all-court play. Tennis - Australian Open - Women's singles final - Rod Laver Arena, Melbourne, Australia, January 27, 2018. Caroline Wozniacki of Denmark celebrates winning against Simona Halep of Romania. REUTERS/Toru Hanai \n“I was close again, but the gas was over in the end,” said twice French Open runner-up Halep, all class after her third grand slam final disappointment. \n“I‘m still losing and I‘m still waiting,” she added with a wry smile. “Maybe the fourth one will be with luck.” \nOn a steamy evening, Wozniacki’s edge in power told early as she roared to a 3-0 lead in the opening set before Halep could find her range. \nShe wobbled when serving for the set at 5-3 when a hollering fan broke her focus. Slideshow (16 Images) \nBut she was commanding in the tiebreak, closing it out swiftly with a blazing shot that all but knocked the racket out of Halep’s hand. \nThe world number one was on the back foot and suddenly dizzy, and she called a medical timeout to have her blood pressure taken after holding serve to 3-2 in the second set. \nShe then began grabbing at her left thigh after points, but somehow found the energy to break Wozniacki with a swashbuckling forehand down the line. \nNothing would come easy for Halep, who saved further break points in a nervous service game before claiming the set with a risky dropshot that Wozniacki failed to deal with. Related Coverage", "external_links": [], "published": "2018-01-27T13:44:00.000+02:00", "crawled": "2018-01-27T13:54:04.003+02:00", "highlightTitle": ""}