{"organizations": [], "uuid": "87a0cea9bae731ce5de11f7f395a1430b0117927", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-world-stocks-set-for-10th-straight-week-of-gains-euro-jumps-idUSL8N1PL23I", "country": "US", "domain_rank": 408, "title": "REFILE-GLOBAL MARKETS-World stocks party like it's '99, dollar wilts again", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.026, "site_type": "news", "published": "2018-01-26T18:06:00.000+02:00", "replies_count": 0, "uuid": "87a0cea9bae731ce5de11f7f395a1430b0117927"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-world-stocks-set-for-10th-straight-week-of-gains-euro-jumps-idUSL8N1PL23I", "ord_in_thread": 0, "title": "REFILE-GLOBAL MARKETS-World stocks party like it's '99, dollar wilts again", "locations": [], "entities": {"persons": [{"name": "curre", "sentiment": "none"}, {"name": "ritvik carvalho", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Refiles to add apostrophe in headline)\n* Graphic: World FX rates in 2018 tmsnrt.rs/2egbfVh\n* Stocks on longest weekly winning streak since ‘99\n* Dollar buckles again, worst weekly run since 2010\n* Pound boosted by GDP numbers\n* Oil helped by weak dollar, gold near 17-month high\nBy Ritvik Carvalho\nLONDON, Jan 26 (Reuters) - World stocks were set for their longest weekly winning streak since 1999 on Friday, while the dollar buckled again as its weakest run since 2010 reverberated through almost every major asset class.\nThe MSCI world equity index, which tracks shares in 47 countries, was inching higher ahead of what was expected to be another day of gains for Wall Street’s already-record high S&P 500 and Dow markets.\nMSCI’s world gauge was setting new milestones of its own, with its 10th week of gain on the trot securing its longest winning streak since 1999.\nEuropean shares edged up too though they were in the red for the week as the pressure of more euro strength, which has ripped to its highest in three years this week and is yet to suffer a weekly fall in 2018 took its toll.\nCurrency markets yo-yoed again on Friday. Comments from U.S. President Donald Trump that he “ultimately” wanted a strong dollar had given the greenback a lift, but it couldn’t hold the gains in European trading and slid steadily lower.\n“While President Trump’s comments prompted a short covering rally in the U.S. dollar, they won’t have alleviated investors separate concerns about recent belligerent US rhetoric on trade,” said Michael Hewson, chief markets analyst at CMC Markets in London.\nThe dollar index, which measures the greenback against a basket of six major currencies, last stood at 89.006.\nThe euro meanwhile, had risen as much as half a percent to trade just below its December 2014 high of above $1.25 it had hit on Thursday as the ECB showed only minor concern about the single currencies recent surge.\nNext up for U.S. traders was a speech by Trump at the World Economic Forum in Davos, Switzerland, followed by fourth quarter U.S. GDP numbers due at 1330 GMT that should show the world’s largest economy in robust health.\nAccording to speech excerpts Trump will say at Davos that only through fair and reciprocal trade, can there be a system that works for the United States and all nations.\nPARTY TIME Earlier in Asia, MSCI’s broadest index of Asia-Pacific shares outside Japan rose 0.4 percent for the day, led by gains in Chinese financial and property shares.\nThat left it with gains for 11 straight days, the longest sequence since 2015, and its seventh straight week of gains for the first time since 2010, though Japan’s Nikkei ended down 0.2 percent as the strength of the yen weighed.\nIn a weekly note on capital flows, Bank of America Merrill Lynch analysts said that 98 percent of global equity markets are now trading above 50 and 200-day moving averages, though the pace of the melt-up meant a correction was now increasingly likely.\nWorld equity markets have rallied over the past year, buoyed by a synchronised uptick in global economic growth in a boon to corporate profits and stock valuations. But some reckon other drives may be spurring the rally.\n“Investors have been fearful of valuations, fearful of geopolitical risks, but it feels like in the last few months, investor fears have been dissipating and greed has come to the fore,” said Mark Dowding of BlueBay Asset Management.\n“That’s why you see in equities a capitulation of part of the bears and something of an intensification of bull-market stocks. Having risen gradually for a number of years, the move looks likes it’s turning more parabolic in nature as greed takes over.”\nAustralian markets were closed for a public holiday.\nThe Dow and S&P 500 ended at their highest closing levels ever on Thursday although Wall Street relinquished bigger intraday gains after President Donald Trump said he wanted a stronger dollar. Futures indicated a positive open on Friday.\nTrump said on Thursday he ultimately wants the dollar to be strong, contradicting comments made by Treasury Secretary Steven Mnuchin one day earlier.\nWhile Trump’s comments briefly helped the U.S. currency come off a three-year low, it had fallen further by early European trade on Friday as traders took the view that a protracted decline in the greenback may be likely.\nAnother big mover in currencies on Friday was Britain’s pound, which rose as much as 1 percent after stronger than expected GDP numbers for the fourth quarter.\nA fourth quarter GDP reading from the United States is also due at 1330 GMT.\nOil prices reversed earlier falls as the weak dollar was seen supporting fuel consumption.\nU.S. crude futures were 0.1 percent higher at $65.56 per barrel after reaching $66.66 on Thursday, their highest since December 2014.\nBrent crude futures were down 0.2 percent at $70.28 per barrel.\nSpot gold was half a percent higher at $1,351.96 per ounce after sliding 0.8 percent overnight. It set $1,366.06 earlier on Thursday, its highest since August 2016. (Reporting by Ritvik Carvalho; additional reporting by Marc Jones and Dhara Ranasinghe; Editing by Matthew Mpoke Bigg)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-26T18:06:00.000+02:00", "crawled": "2018-01-27T00:16:25.006+02:00", "highlightTitle": ""}