{"organizations": [], "uuid": "9bbd2a08576a4958109f554e88f06dd112a9a8ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 29}, "facebook": {"likes": 1915, "shares": 1915, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224958012&w=1200&r=LYNXMPEE0N2A9", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-trump-russia-interview/trump-says-willing-to-be-interviewed-by-mueller-under-oath-idUSKBN1FD388", "country": "US", "domain_rank": 408, "title": "Trump says willing to be interviewed by Mueller under oath", "performance_score": 10, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T01:08:00.000+02:00", "replies_count": 0, "uuid": "9bbd2a08576a4958109f554e88f06dd112a9a8ca"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-russia-interview/trump-says-willing-to-be-interviewed-by-mueller-under-oath-idUSKBN1FD388", "ord_in_thread": 0, "title": "Trump says willing to be interviewed by Mueller under oath", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "mueller", "sentiment": "negative"}, {"name": "eric walsh", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "robert mueller", "sentiment": "none"}, {"name": "roberta rampton", "sentiment": "none"}, {"name": "mohammad zargham", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 11:08 PM / in 5 hours Trump says he is willing to testify under oath in U.S.-Russia probe Roberta Rampton , Warren Strobel 5     on Wednesday he would be willing to be interviewed under oath by Special Counsel Robert Mueller, who is investigating allegations of Russian meddling in the 2016 U.S. election. \n“I‘m looking forward to it, actually,” Trump, speaking to   House, said of an interview with Mueller, a former FBI director. “I would do it under oath.” \nAlthough Trump has pledged cooperation with Mueller’s probe before, Trump made his assertion as the White House and allies in Congress have stepped up attacks on the investigation’s credibility and Trump himself has hedged on whether he would answer questions. \nTrump’s attorneys have been talking to Mueller’s team about an interview, according to sources with knowledge of the investigation. “I would like to do it as soon as possible,” Trump said. \nTrump said, however, that setting a date certain for an interview would be “subject to my lawyers and all of that.” Asked whether he thought Mueller would treat him fairly, Trump replied: “We’re going to find out.” \nTy Cobb, the lawyer in charge of the White House response to Mueller’s probe, said in a statement that Trump was speaking hurriedly to reporters before departing on his trip to Davos, Switzerland. Cobb said Trump emphasized that he remained committed to cooperating with the investigation and looked forward to speaking with Mueller. \nCobb said Mueller’s team and Trump’s personal lawyers were working out the arrangements for a meeting. \nSources told Reuters earlier on Wednesday that senior U.S. intelligence officers including CIA Director Mike Pompeo had been questioned by the special counsel’s team about whether Trump tried to obstruct justice in the Russia probe. \nSuch questioning is further indication that Mueller’s criminal investigation into purported Russian interference in the election and potential collusion by Trump’s campaign includes examining the president’s actions around the probe. \nIn his remarks to reporters on Wednesday, Trump repeated past statements that there was no collusion between the campaign and Russia and “there’s no obstruction whatsoever.” The Kremlin has denied conclusions by U.S. intelligence agencies that Russia interfered in the election campaign using hacking and propaganda to try to tilt the race in Trump’s favor. \nTrump on Wednesday denied a Washington Post report that last year he had asked then-acting FBI Director Andrew McCabe whom he had voted for in 2016, which according to reports, left McCabe concerned about civil servants being interrogated about their political leanings. U.S. President Donald Trump speaks at a working session with mayors at the White House in Washington, U.S., January 24, 2018. REUTERS/Yuri Gripas \n“I don’t think so. I don’t think I did. I don’t know what’s the big deal with that, because I would ask you,” Trump said to reporters. COMEY FIRING \nIn interviews last year with Pompeo, Director of National Intelligence Dan Coats and National Security Agency Director Admiral Mike Rogers, the sources said Mueller’s team focused on whether Trump had asked them to lean on James Comey, the Federal Bureau of Investigation director until Trump fired him in May. \nComey said Trump dismissed him to try to undermine the agency’s Russia investigation. His firing led to Mueller’s appointment to take over the FBI probe and is central to whether Trump may have committed obstruction of justice. \nMueller also asked the officials if Trump tried to shut down intelligence investigations into Russian election meddling and into contacts between Russian officials connected with President Vladimir Putin’s government and associates of Trump or his campaign, the sources said on condition of anonymity. \nRepresentatives for the CIA declined to comment on whether Pompeo had been interviewed. \nMore than 20 White House personnel have voluntarily given interviews to Mueller’s team, Fox News reported on Wednesday. \nIt is unusual for FBI interviews to be conducted under oath, but even if Trump is not interviewed by Mueller’s team under oath, it would still be a crime for him to lie to federal agents, said Andrew Wright, a professor at Savannah Law School and a former associate counsel to President Barack Obama. \nThat is the charge to which former Trump national security adviser Michael Flynn and former Trump campaign adviser George Papadopoulos have both pleaded guilty. \nAn oath would be administered if Mueller issues a subpoena for Trump to testify before a grand jury as opposed to a private interview, Wright said. \nIn 1998, charges that then-President Bill Clinton lied under oath to a federal grand jury about his affair with White House intern Monica Lewinsky help lead to his impeachment by the U.S. House of Representatives. Clinton was acquitted by the U.S. Senate. Reporting by Roberta Rampton and Warren Strobel; Additional reporting by Jan Wolfe, Doina Chiacu and James Oliphant; Editing by Grant McCool and Peter Cooney", "external_links": [], "published": "2018-01-25T01:08:00.000+02:00", "crawled": "2018-01-25T01:14:30.000+02:00", "highlightTitle": ""}