{"organizations": [], "uuid": "7d6afe6b2e05a56d1a873f065bba069010dd6e71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-ssc-to-acquire-dst-systems.html", "country": "US", "domain_rank": 767, "title": "SS&C to Acquire DST Systems", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.02, "site_type": "news", "published": "2018-01-11T14:40:00.000+02:00", "replies_count": 0, "uuid": "7d6afe6b2e05a56d1a873f065bba069010dd6e71"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-ssc-to-acquire-dst-systems.html", "ord_in_thread": 0, "title": "SS&C to Acquire DST Systems", "locations": [], "entities": {"persons": [], "locations": [{"name": "windsor", "sentiment": "none"}, {"name": "kansas city", "sentiment": "none"}, {"name": "conn.", "sentiment": "none"}, {"name": "mo.", "sentiment": "none"}, {"name": "kansas city", "sentiment": "none"}, {"name": "missouri", "sentiment": "none"}], "organizations": [{"name": "ss&c", "sentiment": "negative"}, {"name": "ss&c technologies holdings, inc", "sentiment": "neutral"}, {"name": "dst systems, inc.", "sentiment": "none"}, {"name": "dst", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WINDSOR, Conn. and KANSAS CITY, Mo., Jan. 11, 2018 /PRNewswire/ -- SS&C Technologies Holdings, Inc. (\"SS&C\") (Nasdaq: SSNC), a leading global provider of financial services software and software-enabled services, and DST Systems, Inc. (\"DST\") (NYSE: DST), a leading provider of proprietary technology-based information processing and servicing solutions, today announced that the companies have entered into a definitive agreement wherein SS&C will acquire DST. Under the terms of the agreement, SS&C will purchase DST in an all-cash transaction for $84 per share plus assumption of debt, equating to an enterprise value of approximately $5.4 billion.\nDST is a global provider of specialized technology, strategic advisory and business operations outsourcing to the financial services and healthcare industries. DST provides solutions through a unique blend of industry knowledge and experience, technological expertise and service excellence to clients across asset management, brokerage, retirement and healthcare. Headquartered in Kansas City, Missouri, with more than 14,400 employees worldwide, DST generated pro forma revenue of $2.3 billion for the 12 months ended September 30, 2017.\nThe transaction significantly increases SS&C's scale, with approximately $3.9 billion in combined pro forma revenue and 13,000 clients. Additionally, the transaction expands SS&C's footprint into the US retirement and wealth management markets and adds 110+ million investor positions across DST's client base. The combination leverages SS&C's market leading software platform for institutional and alternative asset managers to drive increased automation and efficiency across wealth management account servicing.\nThe transaction also represents a continuation of SS&C's proven strategy of adding talented people and technology through acquisitions. This strategy, combined with its continued investment in its software stack, has created one of the world's leaders in software enabled services.\n\"The rate of change, the technology required and the requirements of integrated solutions in the investment and wealth management space are unprecedented. The combination of SS&C and DST is an exciting opportunity and will continue to deliver solutions, globally. We will, together, continue to build on the relationship since we acquired DST Global Solutions in 2014. We are also excited to have the DST employees from around the world join the SS&C team and look forward to having a continued local presence in Kansas City. Further, we look forward to partnering with DST's customers,\" said Bill Stone, Chairman and Chief Executive Officer of SS&C. \"The combination will position us to capitalize on the demand for outsourcing in financial services and better enable our clients to address increasing competitive and regulatory pressures.\"\n\"We are pleased to enter into this agreement with SS&C, which benefits DST shareholders and supports the continued success of our clients,\" said Steve Hooley, Chairman, President and Chief Executive Officer of DST. \"SS&C has a rich history of delivering best-in-class technology that complements DST's existing solutions, and, as part of SS&C, we will be able to advance our extensive, multi-year strategic transformation. We thank all of our employees around the world for working hard to make this compelling combination possible.\"\nSS&C expects $150 million of run-rate cost savings annually, achieved by 2020. The transaction is expected to be immediately accretive to its adjusted earnings per share before synergies, and is expected to result in mid-teens earnings growth in 2019.\nSS&C plans to fund the acquisition and refinance existing debt with a combination of debt and equity. For the twelve months ended September 30, 2017, consolidated EBITDA for the combined pro forma entity is expected to be approximately $1.3 billion, including synergies. SS&C expects pro forma net leverage to be in the low 5x area at closing and will deleverage by approximately 0.7x per year.\nBoth SS&C's and DST's Board of Directors have approved the transaction, and it is expected to close by the third quarter of this year. The transaction is subject to DST's stockholder approval, clearances by the relevant regulatory authorities and other customary closing conditions.\nCredit Suisse and Morgan Stanley acted as financial advisors and Davis Polk & Wardwell acted as legal advisor to SS&C. Credit Suisse and Morgan Stanley have provided fully committed debt financing for the transaction.\nBofA Merrill Lynch acted as financial advisor and Skadden, Arps, Slate, Meagher & Flom acted as legal advisor to DST.\nConference Call\nSS&C will host a conference call and webcast with the financial community today at 8:00 AM Eastern Time. Dial (877) 312-8798 (US and Canada) or (253) 237-1193 (International), and request the \"SS&C to Acquire DST conference call\"; conference ID# 1689698. Alternatively a live audio webcast can be accessed via http://investor.ssctech.com . To expedite the registration process, you may pre register for the event by clicking here . A replay of the conference call will be available one hour after the conference call, for 7 days. The dial-in number is (855) 859-2056 (US and Canada) or (404) 537-3406 (International); access code# 1689698\nAbout DST\nDST Systems, Inc. (NYSE: DST) is a leading provider of specialized technology, strategic advisory, and business operations outsourcing to the financial and healthcare industries. We assist clients in transforming complexity into strategic advantage by providing tools and services to help them stay ahead of and capitalize on ever-changing customer, business and regulatory requirements in the world's most demanding industries. For more information, visit the DST website at www.dstsystems.com .\nAbout SS&C\nSS&C is a global provider of investment and financial software-enabled services and software for the global financial services industry. Founded in 1986, SS&C is headquartered in Windsor, Connecticut and has offices around the world. Some 11,000 financial services organizations, from the world's largest institutions to local firms, manage and account for their investments using SS&C's products and services.\nAdditional information about SS&C (Nasdaq: SSNC) is available at www.ssctech.com .\nForward Looking Statements\nCertain information contained in this press release constitutes forward-looking statements for purposes of the safe harbor provisions under the Private Securities Litigation Reform Act of 1995. Forward-looking statements include statements concerning plans, objectives, goals, strategies, expectations, intentions, projections, developments, future events, performance, underlying assumptions, and other statements that are other than statements of historical facts. The forward-looking statements contained herein include, but are not limited to, statements about the expected effects on SS&C of the proposed acquisition of DST, the expected timing and conditions precedent relating to the proposed acquisition of DST, anticipated earnings enhance", "external_links": ["http://www.prnewswire.com/news-releases/ssc-to-acquire-dst-systems-300581328.html", "https://edge.media-server.com/m6/p/7nc3jh2c", "http://www.dstsystems.com/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51059124&newsitemid=20150316005302&lan=en-US&anchor=www.sec.gov&index=5&md5=8484b2cf7fe01c79cc26a1f31b04391e", "http://www.ssctech.com/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51059124&newsitemid=20150316005302&lan=en-US&anchor=www.sec.gov&index=3&md5=55135d747d7eec1d557c20cca84dd9ed"], "published": "2018-01-11T14:40:00.000+02:00", "crawled": "2018-01-11T15:00:48.021+02:00", "highlightTitle": ""}