{"organizations": [], "uuid": "0384a94b0314a22f7d34f017ae2c30aba66c2b37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-euro-zone-yields-steady-amid-years-first-wave-of-high-grade-supply-idUSL8N1P4221", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Euro zone yields steady amid year's first wave of high-grade supply", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T20:07:00.000+02:00", "replies_count": 0, "uuid": "0384a94b0314a22f7d34f017ae2c30aba66c2b37"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-euro-zone-yields-steady-amid-years-first-wave-of-high-grade-supply-idUSL8N1P4221", "ord_in_thread": 0, "title": "UPDATE 1-Euro zone yields steady amid year's first wave of high-grade supply", "locations": [], "entities": {"persons": [{"name": "abhinav ramnarayan", "sentiment": "none"}], "locations": [{"name": "netherlands", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "boj", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Germany, Netherlands and Austria sell bonds on Tuesday\n* Yields on all three well up from mid-December\n* BoJ buying pattern pushes U.S. Treasury yields up\n* Euro zone periphery govt bond yields tmsnrt.rs/2ii2Bqr (Writes through)\nBy Abhinav Ramnarayan\nLONDON, Jan 9 (Reuters) - Euro zone government bond yields resisted upward pressure from new supply and a rise in U.S. and Japanese peers on Tuesday, underscoring the strong demand for European assets in the market.\nOn a day when three euro zone countries held their first auctions of 2018 and 10-year U.S. Treasury yields hit their highest since March on news the BoJ had trimmed its purchases of long-dated Japanese government bonds, yields were flat to a touch lower across the euro zone.\nGermany, the Netherlands and Austria sold over 3.5 billion euros of bonds between them, receiving strong demand from investors.\nThe yield on all three countries’ debt has risen in recent weeks as the European economy motors on.\nHigh-grade bonds tend to underperform in benign conditions as investors switch to riskier assets with better returns. But as a result of the sell-off, those bonds are now looking attractive, analysts said.\n“The broader picture is yields are still low but we still need to be excited a bit on this (upward) move in the last few weeks,” said ING strategist Martin Van Vliet.\nThe yield on the region’s benchmark, German 10-year debt, was flat at 0.43 percent on Tuesday, well above the mid-December level of 0.30 percent.\nThe Dutch equivalent was also flat at 0.52 percent but was about 16 bps higher than its December low, while Austria has seen its 10-year borrowing costs increase 18 bps over the past month to 0.57 percent.\nIn a continuation of a recent trend, Southern European debt outperformed, and the gap between Spanish and German bond yields was at its tightest since September.\nNormally, an improvement in economic conditions would cause investors to be cautious about buying government bonds as it makes an early end to the European Central Bank’s bond-buying scheme more likely.\nBut with inflation yet to show a sustained increase, investors would feel reasonably safe buying debt.\n“To me, the current Bund yield level makes sense given economic data looks rock solid. The only thing we’re all waiting for is signs of inflationary pressure,” said Van Vliet.\nInflation in the euro zone slowed as expected in December to 1.4 percent, well below the ECB’s target of just under 2 percent.\nThe Bank of Japan meanwhile trimmed its buying of long-dated Japanese government bonds (JGBs) in market operations, stoking speculation about a future exit from its massive stimulus policy.\nYields on 20-to-40 year JGBs hit one-month highs following the news.\n“The fear of this being a prelude to BoJ reduction in purchases is misplaced, but it did move the market this morning along with the strong Japanese wages data,” said Mizuho strategist Antoine Bouvet.\nReporting by Abhinav Ramnarayan, additional reporting by Fanny Potkin; Editing by Raissa Kasolowsky\n ", "external_links": ["http://tmsnrt.rs/2ii2Bqr", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T20:07:00.000+02:00", "crawled": "2018-01-09T14:58:16.000+02:00", "highlightTitle": ""}