{"organizations": [], "uuid": "7592d01e52d89ffac941aab41efc7b8e0e2a0b8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-src-energy-issues-preliminary-fourth-quarter-2017-results-operations-update-initial-2018-guidance-fourth-quarter-2017.html", "country": "US", "domain_rank": 767, "title": "SRC Energy Issues Preliminary Fourth Quarter 2017 Results; Operations Update; Initial 2018 Guidance; Fourth Quarter 2017 Earnings and Conference Call Dates", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T00:10:00.000+02:00", "replies_count": 0, "uuid": "7592d01e52d89ffac941aab41efc7b8e0e2a0b8c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-src-energy-issues-preliminary-fourth-quarter-2017-results-operations-update-initial-2018-guidance-fourth-quarter-2017.html", "ord_in_thread": 0, "title": "SRC Energy Issues Preliminary Fourth Quarter 2017 Results; Operations Update; Initial 2018 Guidance; Fourth Quarter 2017 Earnings and Conference Call Dates", "locations": [], "entities": {"persons": [{"name": "henry hub", "sentiment": "none"}], "locations": [{"name": "denver", "sentiment": "none"}, {"name": "denver-julesburg basin", "sentiment": "none"}], "organizations": [{"name": "src", "sentiment": "neutral"}, {"name": "src energy inc.", "sentiment": "neutral"}, {"name": "nyse", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER, Jan. 30, 2018 (GLOBE NEWSWIRE) -- SRC Energy Inc. (NYSE AMEX:SRCI) (“SRC” or the “Company”), an oil and gas exploration and production company focused in the Denver-Julesburg Basin, today issues preliminary fourth quarter 2017 operating results, provides an operations update, issues initial 2018 guidance and announces its fourth quarter 2017 earnings release and conference call dates.\nProduction and Average Realized Pricing Summary\nThree Months Ended 12/31/2017 9/30/2017 Sequential\n% Chg. 12/31/2016 Average Daily Volumes 3-Stream 2-Stream Daily Production (BOE/day) 45,658 40,378 13 % 13,269 Liquids % 69% 67% 58% Product Price Received Crude Oil ($/Bbl) * $48.80 $41.89 16 % $40.94 Natural Gas Liquids ($/Bbl) $20.81 $17.32 20 % NA\nNatural Gas ($/Mcf) $2.21 $2.35 -6% $3.18 Differentials NYMEX WTI * $(6.57 ) $(6.29 ) 4 % $(8.20 ) NYMEX Henry Hub $(0.69 ) $(0.64 ) 8 % $0.14 Unit Costs Lease Operating Expense ($/BOE) $1.54 $1.17 32 % $4.08 * Adjusted to include transportation and gathering expense. For the fourth quarter ended December 31, 2017 crude oil accounted for approximately 51% of total equivalent production volumes. For the year ended December 31, 2017, production averaged 34,194 BOE per day, 47% oil and slightly ahead of the mid-point of the Company’s previously issued guidance.\n2017 Preliminary Year-End Reserves\nProved developed reserves and total proved reserves at year-end 2017 increased 389% and 144%, respectively, over year-end 2016 proved reserves as shown in the following table:\nYEAR-OVER-YEAR RESERVES 2017 2016 * Reserve Category Oil\n(MMbbls) Gas\n(Bcf) NGL\n(MMbbls) Net\nMMBOE Net\nMMBOE Change\n% Proved Developed 27 219 24 88 18 389 % Proved Undeveloped 43 341 40 139 75 85 % Total Proved 70 560 64 227 93 144 % * 2016 year-end reserves are reported in 2-stream equivalents Capital Expenditures\nDrilling and completion capital expenditures for the year ended December 31, 2017 were approximately $460 million. During the fourth quarter the Company chose to retain its interest in multiple non-operated wells located within SRC's core operating area which began producing late in Q4 2017. These wells represented approximately $35 million in non-operated drilling and completion capital expenditures in 2017. Given the timing of these wells, they had limited impact on SRC's 2017 production volumes; however, they should have a more measurable impact on 2018 production volumes.\nOperations Update\nDuring the quarter ended December 31, 2017, SRC drilled 27 gross (~25 net) wells and completed 12 gross (~11 net) wells. For the twelve months ended December 31, 2017, the Company drilled 115 gross (~103 net) wells and completed 115 gross (~102 net) wells.\nThe table below details all recent activity:\nGross Well Count by\nZone Pad Name Lateral Length Avg. WI Niobrara Codell Status Beebe 12 ML 100 % 7 5 TTS Leffler 12 LL 90 % 7 5 TTS Ag 12 LL 89 % 7 5 Stimulating Falken 12 LL, 6 SL 94 % 11 7 WOC Goetzel 12 ML 92 % 8 4 WOC Boomerang 12 ML, 4LL 83 % 10 6 Drilling Donn 13 LL 91 % 8 5 Drilling TTS - Turned to sales | WOC - Waiting on completion Preliminary 2018 Guidance\nThe Company expects full year 2018 production to be between 48,000 BOE/d and 52,000 BOE/d with oil making up 47% - 50% of production. The pace of completion activity is anticipated to be skewed towards the latter half of 2018 to align with natural gas processing capacity additions. Total drilling and completion capital expenditures are projected to be between $480 million and $540 million. In 2018 SRC expects to drill approximately 117 gross (100 net) wells and complete approximately 116 gross (103 net) wells on an operated basis. SRC's operational program for 2018 is similar to the program executed in 2017. The expected year-over-year capital expenditure increase is a function of productivity gains with respect to SRC's contiguous block of acreage, larger average working interest and anticipated cost pressures. Crude oil differentials, which include all transportation and gathering costs from the wellhead to the settlement point, are expected to remain relatively stable within a range of $6.00 to $6.50 per barrel.\nManagement Comment\nLynn A. Peterson, Chairman and CEO of SRC Energy commented, \"Our team's execution through 2017 was very positive. We have continued our strong operational momentum into 2018, which should lead to an alignment of SRC's operating cash flow with capital expenditures while continuing to deliver robust year-over-year growth.\"\nMr. Peterson added, “As it relates to midstream infrastructure, 2018 will be a year of change. Multiple gas processing facilities as well as oil gathering assets are currently under construction or are on the drawing boards as midstream companies respond to the growing needs.” He concluded, “As good stewards of SRC’s capital, we intend to maintain our strong balance sheet and operational flexibility, while focusing on delivering favorable returns on capital for our shareholders.”\nFourth Quarter 2017 Earnings Release and Call\nSRC plans to issue its fourth quarter earnings release on Wednesday, February 21, 2018 after the close of trading on the New York Stock Exchange.\nSRC will host a conference call on Thursday, February 22, 2018 at 11:00 a.m. Eastern time (9:00 a.m. Mountain time) to discuss the results. The call will be conducted by Chairman and CEO Lynn A. Peterson, CFO James Henderson, Chief Development Officer Nick Spence, Chief Operations Officer Mike Eberhard and Manager of Investor Relations John Richardson. A Q&A session will immediately follow the discussion of the results for the quarter.\nTo participate in this call please dial:\nDomestic Dial-in Number: (877) 407-9122\nInternational Dial-in Number: (201) 493-6747\nWebcast URL : http://srcenergy.equisolvewebcast.com/q4-2017\nReplay Information:\nConference ID #: 411931\nReplay Dial-In (Toll Free US & Canada): 877-660-6853\nReplay Dial-In (International): 201-612-7415\nExpiration Date: 3/8/18\nUpcoming Investor Conferences\nPresentations provided in conjunction with these events will be available on SRC's website at www.srcenergy.com the morning of the respective presentation. Members of SRC senior management will participate in the following hosted investor events, please refer to the Company’s website for specific presentation dates and attendees:\nJP Morgan Global High Yield & Leveraged Finance Conference - February 26-28, 2018 Miami, FL\nPiper Jaffray Energy Conference - March 1, 2018 Las Vegas, NV\nRaymond James Institutional Investor Conference - March 5-6, 2018 Orlando, FL\nScotia Howard Weil 2018 Energy Conference - March 25-28, 2018 New Orleans, LA\nAbout SRC Energy Inc.\nSRC Energy Inc. is a domestic oil and natural gas exploration and production company. SRC's core area of operations is in the Wattenberg Field of the Denver-Julesburg Basin. The Company's corporate offices are located in Denver, Colorado. More company news and information about SRC is available at www.srcenergy.com .\nImportant Cautions Regarding Forward Looking Statements\nThis press release contains within the meaning of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical fact are The use of words such as \"believes\", \"expects\", \"anticipates\", \"intends\", \"plans\", \"estimates\", \"should\", \"likely\", “guidance” or similar expressions indicates a forward-looking statement. Forward-looking statements herein include statements regarding expected fourth quarter, full-year 2017 and 2018 results, including capital expenditures, costs, drilling and completion activities, midstream activities, differentials and production. These statements are subject to risks and uncertainties and are based on the beliefs and assumptions of management, and information currently available to management. The actual results could differ materially from a conclusion, forecast or projection in the forward-looking information. Certain material factors or assumptions were applied in drawing a conclusion or making a forecast or projection as reflected in the forward-looking information. The identification in this press release of factors that may affect the Company's future performance and the accuracy of is meant to be illustrative and by no means exhaustive. All should be evaluated with the understanding of their inherent uncertainty. Factors that could cause the Company's actual results to differ materially from those expressed or implied by include, but are not limited to: the success of the Company's exploration and development efforts; the price of oil and gas; worldwide economic situation; change in interest rates or inflation; willingness and ability of third parties to honor their contractual commitments; the Company's ability to raise additional capital, as it may be affected by current conditions in the stock market and competition in the oil and gas industry for risk capital; the Company's capital costs, which may be affected by delays or cost overruns; costs of production; environmental and other regulations, as the same presently exist or may later be amended; the Company's ability to identify, finance and integrate recent or future acquisitions; the volatility of the Company's stock price; and the other factors described in the “Risk Factors” sections of the Company’s filings with the Securities and Exchange Commission, all of which are incorporated by reference in this release. Results presented for the fourth quarter of 2017 and for the full year 2017 are preliminary and subject to change as the Company finalizes its financial statements for the relevant periods.\nCompany Contact:\nJohn Richardson (Investor Relations Manager)\nSRC Energy Inc.\nTel 720-616-4308\nE-mail: jrichardson@srcenergy.com\nSource:SRC Energy Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=PmFBTZsA_r0AOU7lFcZgdZn6VLYRHKLZY8M4k8xRCzEOkvIBZbbb9zV6KK1fn7if9lVO3Le7zvcKiXcNJENHFqFu0sY32-pHBDvYCrIvyCc=", "http://srcenergy.equisolvewebcast.com/q4-2017", "https://www.globenewswire.com/NewsRoom/AttachmentNg/96b60e49-03f5-42c3-a9f5-d104658c40a6", "https://www.globenewswire.com/Tracker?data=aG8HkWzQpXW5QJfxQaEyRn8Le7zDkMm_1cofD6Eq3DIXC2rcSOvqYPR8SUu8GPHhf7gAC1NmATjQeknNK3ftjw=="], "published": "2018-01-31T00:10:00.000+02:00", "crawled": "2018-01-31T03:10:23.006+02:00", "highlightTitle": ""}