{"organizations": [], "uuid": "3f1321ad633d3328186eb3d11dda4ea8ee6d6188", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225551637&w=1200&r=LYNXMPEE0P12P", "site_section": "http://news.google.com/news?q=Freedom+of+Speech&hl=en&prmd=nbi&resnum=4&um=1&ie=UTF-8&output=rss", "section_title": "Freedom of Speech - Google News", "url": "https://www.reuters.com/article/us-lloyd-davos-commentary/commentary-global-takeaways-from-trumps-speech-idUSKBN1FF2C8", "country": "US", "domain_rank": 408, "title": "Commentary: Global takeaways from Trump's Davos speech - Reuters", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T20:01:00.000+02:00", "replies_count": 0, "uuid": "3f1321ad633d3328186eb3d11dda4ea8ee6d6188"}, "author": "", "url": "https://www.reuters.com/article/us-lloyd-davos-commentary/commentary-global-takeaways-from-trumps-speech-idUSKBN1FF2C8", "ord_in_thread": 0, "title": "Commentary: Global takeaways from Trump's Davos speech - Reuters", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "jo", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "lloyd", "sentiment": "none"}, {"name": "america first", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 5:49 PM / in 2 hours Commentary: Global takeaways from Trump's Davos speech John Lloyd 9 Min Read \n“When people are forgotten the world becomes fractured,” President Donald Trump observed to the Davos forum in his breathlessly-awaited speech Friday. That he himself was the fracturer-in-chief must have entered the minds of more than a few in the crowded hall. \nMany expected the speech to be a clash of civilizations: that of America First, the pursuit of national advantage, the raising of the barriers both to trade and to immigration – and that of cooperation, a lowering of borders and barriers, a privileging of free trade and – at least until recently – free movement of labor. Along with that, there was a zany, unpredictable often deeply unpleasant governing style, based heavily on tweets, and a hatred of news media – which in a post-speech Q-and-A he could not refrain from branding as “nasty, vicious…and fake.” (He got a few hisses and boos for that.) \nBut the speech was crafted for a kind of virtual togetherness, a merging of “America first” with everybody else as partners. America was certainly first, and Trump said he had put it there: the stock market had added $7 trillion, 2.4 million new jobs had been created and U.S. unemployment was at a new low “since my election.” This was good for everyone. And for many of the attendees there, they are part of the everyone. The top part, in the past, present and future. \nNot surprising. The world economy is growing. The giants are growing especially rapidly, with India, at over 7 percent in 2017, growing faster than China, at 6.9 percent. Trump can tweet with delight: the International Monetary Fund, not a friend, says that his tax cuts approved by Congress last month will likely cause businesses to invest more, create more jobs. Most boats are raised by this tide – even perhaps, a little, poor old Britain, suffering side effects of Brexit before it’s got to the exit, growing by only 1.8 per cent in 2017 but forecast by a government treasury minister to do better than the 1.6 percent this year that several forecasts claim. \nTrump did not hint at the widespread skepticism that this can last. William White, head of the Organisation for Economic Co-operation and Development’s review board, said that \"all the market indicators right now look very similar to what we saw before the Lehman crisis, but the lesson has somehow been forgotten.” Even if that can be disregarded, many of those in Davos this past week spoke as much about reforms and shifts in attitudes and troubles ahead as of growth. \nChristine Lagarde, the IMF’s managing director, though happy about improvement, warned of a social disaster even while economies grow, saying that , in Europe, “working-age people, especially the young, are falling behind. Without action, a generation may never be able to recover.” Indian Prime Minister Narendra Modi gave a somber speech , arguing that \"it feels like the opposite of globalization is happening…(it) cannot be considered less dangerous than climate change or terrorism.\" \nStill more chillingly, Freedom House, the U.S.-based institute which surveys the progress of democracy, civil society, freedom of speech and the media round the world has produced a report headlined “Democracy in Crisis” – a grim reportage showing that democracy’s “basic tenets – including guarantees of free and fair elections, the rights of minorities, freedom of the press, and the rule of law – came under attack around the world.” India's Prime Minister Narendra Modi warned about the 'opposite of globalization' at the World Economic Forum (WEF) annual meeting in Davos, January 23, 2018. REUTERS/Denis Balibouse \nThe new element in this from last time Freedom House looked is Trump and his radically anti-globalization, anti -free trade, anti-immigrant rhetoric. The U.S. president’s actions have been milder – or thwarted – than his words, but even as he told Davos delegates that “America First does not mean America alone,” he stressed that he was taking steps to secure an immigration system “stuck in the past.” \nTrump’s approach has fazed foreign political and business leaders and called into question some of the fundamentals of the Western world’s post-war assumptions – not least, that the United States was on the globalizers’ side. U.S. President Donald Trump and Klaus Schwab, founder and executive chairman of the WEF, at the annual meeting in Davos, January 26, 2018. REUTERS/Carlos Barria \nThe top people, bankers, industrialists, politicians, celebrities – the U.S. president is an unusual exception – are avatars of globalization. But the politicians among them mix with and solicit votes from ordinary people, who live their lives locally rather than globally and who are – in David Goodhart’s analysis –“somewhere” people as against the “anywhere” globalizers. The politicians know that in order to retain globalization and the benefits which flow from it, the “somewhere” people must share more in the fruits of globalization than they presently do. Unless that happens, the angry challenge to mainstream politics, to free markets and to capitalism itself will continue, grow and may become ungovernable. \nTrump has made it clear in the past he despises the Davos crowd: his erstwhile friend and chief counselor, Steve Bannon, now out of the White House and presumably no longer on the president’s speed dial, has said that “I’d rather be governed by the first hundred people at a Trump rally than by the Party of Davos,” continuing, in the same interview, to note that blue-collar workers like his father and grandfather, were “more decent, and have the community’s well-being more than these guys.” \nThere was none of that disdain for the white-collar executives in Trump’s carefully-crafted Davos speech. Instead, the U.S. president touted his tax changes and the message the “there’s never been a better time to do business in America.” \nHowever, globalization is a political as much as an economic movement, and in the end requires political support. The globalizers need at least the passive assent from those like the left-behinds, the somewheres, the people who have not done well out of the past decade since the financial crash and who will do much worse should the forecasts by experts like White and Lagarde prove well-founded. Every democratic leader must now be consumed with fear of a revolt, seeking policies which address that discontent and calms it, while trying to avoid even more debt on the nation’s balance sheet. \nThat’s a difficult trick – and one that democratic leaders must turn to now that the febrile anticipation of Trump’s speech is over and they descend from the snowy peaks of the Swiss Alps. About the Author John Lloyd co-founded the Reuters Institute for the Study of Journalism at the University of Oxford, where he is senior research fellow. Lloyd has written several books, including “What the Media Are Doing to Our Politics” and \"Journalism in an Age of Terror\". He is also a contributing editor at the Financial Times and the founder of FT Magazine. The views expressed in this article are not those of Reuters News. 0 : 0", "external_links": [], "published": "2018-01-26T20:01:00.000+02:00", "crawled": "2018-01-26T20:47:11.000+02:00", "highlightTitle": ""}