{"organizations": [], "uuid": "c69ef0a2bba7aeeb2dcb9d72e1a54da1fdeabf82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 18}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219489318&w=1200&r=LYNXMPEE0404U", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-saudi-aramco/saudi-arabia-changes-aramco-status-to-joint-stock-company-official-bulletin-idUKKBN1EU09O", "country": "US", "domain_rank": 408, "title": "Saudi Arabia changes Aramco status to joint-stock company - official bulletin", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T06:03:00.000+02:00", "replies_count": 0, "uuid": "c69ef0a2bba7aeeb2dcb9d72e1a54da1fdeabf82"}, "author": "", "url": "https://uk.reuters.com/article/us-saudi-aramco/saudi-arabia-changes-aramco-status-to-joint-stock-company-official-bulletin-idUKKBN1EU09O", "ord_in_thread": 0, "title": "Saudi Arabia changes Aramco status to joint-stock company - official bulletin", "locations": [], "entities": {"persons": [{"name": "mohammad bin salman", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "20th middle east", "sentiment": "none"}, {"name": "saudi aramco", "sentiment": "none"}, {"name": "manama", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "bahrain", "sentiment": "none"}], "organizations": [{"name": "aramco", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 3:28 AM / Updated 17 minutes ago Saudi Arabia converts Aramco into joint-stock company ahead of historic IPO Rania El Gamal , Aziz El Yaakoubi 4 Min Read \nDUBAI (Reuters) - Saudi Arabia has changed the status of its national oil giant Aramco to a joint-stock company as of Jan. 1, in a key step for an initial public offering (IPO) planned for later this year. FILE PHOTO: A view shows Saudi Aramco's Abqaiq oil facility in eastern Saudi Arabia in this undated handout photo. Saudi Aramco/Handout/File Photo via REUTERS \nThe sale of up to 5 percent of Saudi Aramco, expected to go ahead in the second half of 2018, is a centerpiece of Vision 2030, an ambitious reform plan to reduce the dependence of the Saudi economy on oil. The plan is championed by Saudi crown Prince Mohammad bin Salman. \nThe change, which was published in a cabinet decree in the kingdom’s official bulletin on Friday, is a requirement for local companies in Saudi Arabia ahead of listing, a senior Aramco source, who declined to be named, told Reuters. \n“As a customary step in the preparation process for a Saudi IPO, Saudi Aramco has converted to a joint stock company,” the source said. \n“This establishes the framework to allow future investors to hold shares in the company alongside its shareholder, the government.” \nBut it is an important step as it shows the IPO process, which could be the biggest in history raising up to $100 billion, is moving ahead despite market speculation it could be delayed or totally shelved. \nPrince Mohammad told Reuters in October it was still on track for 2018. \nAramco has a fully paid capital of 60 billion riyals ($16.00 billion) divided into 200 billion ordinary shares, according to the company’s bylaws published in the official bulletin. \nThe firm’s board will have 11 members and the power to list the company in domestic and international markets, it said. The government will propose 6 members of Aramco’s board, but shareholders with a more than 0.1 percent stake will have the right to propose a member to the general assembly. FILE PHOTO: A view shows Saudi Aramco's Wasit Gas Plant, Saudi Arabia December 8, 2014. Saudi Aramco/Handout/File Photo via REUTERS \nThe government will have the right to appoint or change the company’s chairman, a position currently held by Energy Minister Khalid al-Falih. \nThe government will remain the major shareholder of Aramco and retain the ultimate decision on output levels and production capacity, it said. \n“The state will remain the only responsible entity to make the final decisions regarding the maximum levels of hydrocarbons that can be produced at any time,” it said. FILE PHOTO: Logo of Saudi Aramco is seen at the 20th Middle East Oil & Gas Show and Conference (MOES 2017) in Manama, Bahrain, March 7, 2017. REUTERS/Hamad I Mohammed/File Photo \nSaudi officials have said domestic and international exchanges such as New York, London, Tokyo and Hong Kong have been looked at for a partial listing of the state-run oil firm. \nThey also left the door open for other options including an exclusive listing on the kingdom’s bourse Tadawul and an IPO coupled with a private placement to a strategic investor as a precursor to an international IPO. \nAramco’s IPO will comply with regulations of the Saudi stock exchange and also regulations of the international market where it will be listed, the official bulletin said. \nInvestors have long debated whether Aramco could be valued anywhere close to $2 trillion, the figure announced by the crown prince, who wants to raise cash through the IPO to finance investment aimed at helping wean the world’s biggest oil exporting nation off its dependency on crude. \nA kingpin of the Organization of the Petroleum Exporting Countries (OPEC), Saudi Arabia is also leading members and other rival oil producers such as Russia to restrict oil supplies under a global oil pact to drain inventories and boost oil prices. \nIn November, OPEC and non-OPEC producers agreed to extend oil output cuts until the end of 2018 as they try to finish clearing a global glut of crude while signaling a possible early exit from the deal if the market overheats. Additional reporting by Mohamed el Sherif and Katie Paul; Editing by Christopher Cushing and Muralikumar Anantharaman", "external_links": [], "published": "2018-01-05T06:03:00.000+02:00", "crawled": "2018-01-05T07:12:48.002+02:00", "highlightTitle": ""}