{"organizations": [], "uuid": "adfe05ef2e27c692bd027ceb386c694e5cf860b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104959070-GettyImages-880020862.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/nearly-400-million-lost-stolen-from-sales-of-new-digital-coins.html", "country": "US", "domain_rank": 767, "title": "Nearly $400 million lost, stolen from sales of new digital coins", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.024, "site_type": "news", "published": "2018-01-22T22:31:00.000+02:00", "replies_count": 0, "uuid": "adfe05ef2e27c692bd027ceb386c694e5cf860b9"}, "author": "Evelyn Cheng", "url": "https://www.cnbc.com/2018/01/22/nearly-400-million-lost-stolen-from-sales-of-new-digital-coins.html", "ord_in_thread": 0, "title": "Nearly $400 million lost, stolen from sales of new digital coins", "locations": [], "entities": {"persons": [{"name": "john macdougall", "sentiment": "negative"}], "locations": [{"name": "berlin", "sentiment": "none"}], "organizations": [{"name": "ernst & young", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nearly $400 million has been lost or stolen from coin sales known as initial coin offerings, accounting giant Ernst & Young said in a report released Monday.\nThat's more than 10 percent of the $3.7 billion raised in the initial coin offerings, and another worrying sign for the token sales.\nInitial coin offerings raise funds for projects based on blockchain technology by selling digital coins, which will grant access to a future technology platform, or at least climb in value, similarly to how digital currency bitcoin has soared in price. Developers also say the initial coin offering circumvents what can be a bureaucratic process of venture capital raising — EY estimates cumulative venture capital investments in blockchain projects is less than half what initial coin offerings have raised. \nBut the projects behind initial coin offerings often barely exist beyond a whitepaper and many are believed to be outright scams. Now there is a clear risk that investors' funds will never reach a project's developers.\n\"Phishing is the most common form of funds theft during ICOs,\" the EY report said, adding that \"hackers steal ... up to US$1.5 million in ICO proceeds per month.\"\nA phishing attack occurs when the hacker tricks someone into sharing valuable personal information by pretending to appear legitimate. For example, the report noted how scammers created a look-a-like page to eight cryptocurrency projects, and stole nearly $1.4 million in August alone.\n\nSource: Ernst and Young \nA cryptocurrency hack can also be more damaging than a cyberattack on a traditional financial institution.\nThe report pointed out that the average bank loss from a hack is $1.5 million, and funds are usually insured. In contrast, cryptocurrency exchanges averaged $2 billion in hacking losses as of November, and their blockchain technology prevents transactions from being reversed.\nMore worrisome is the loss of personal data from a hack. \"Most exchanges do not disclose policies and controls over personal data storage and use. This represents great value on the black market and chances of its misuse are high even without a breach,\" the report said.\nToken sales took off last year, reaching a peak of excitement in the summer. Many projects raised tens of millions of dollars despite only being in very early stages of development. As a sign of the risks, many initial coin offerings officially prohibit U.S. residents and citizens from participating out of fear the U.S. Securities and Exchange Commission will crack down if a project is unable to meet its business goals. In the last several months, China and South Korea banned coin offerings completely.\nPartly as a result of increased regulatory fears, blockchain projects have been finding it more difficult to raise money through coin offerings.\nJust 25 percent of initial coin offerings reached their fundraising goals in November, versus 90 percent in June, the EY report said. Citing TokenData, CNBC reported in late November that the month was also on pace to be the slowest for coin offerings since August.\n\nSource: Ernst and Young", "external_links": [], "published": "2018-01-22T22:31:00.000+02:00", "crawled": "2018-01-22T22:37:27.012+02:00", "highlightTitle": ""}