{"organizations": [], "uuid": "630e5039a80fb621a5579c64d91d1c9ba50d74fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/britain-stocks-factors/update-1-uk-stocks-factors-to-watch-on-jan-29-idUSL4N1PO2R6", "country": "US", "domain_rank": 408, "title": "UPDATE 1-UK Stocks-Factors to watch on Jan 29", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T09:44:00.000+02:00", "replies_count": 0, "uuid": "630e5039a80fb621a5579c64d91d1c9ba50d74fb"}, "author": "", "url": "https://www.reuters.com/article/britain-stocks-factors/update-1-uk-stocks-factors-to-watch-on-jan-29-idUSL4N1PO2R6", "ord_in_thread": 0, "title": "UPDATE 1-UK Stocks-Factors to watch on Jan 29", "locations": [], "entities": {"persons": [{"name": "carillion", "sentiment": "none"}, {"name": "melrose", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}], "organizations": [{"name": "financial reporting council", "sentiment": "none"}, {"name": "frc", "sentiment": "none"}, {"name": "kcom group plc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "gkn", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}, {"name": "east yorkshire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds company news items and futures)\nJan 29 (Reuters) - Britain’s FTSE 100 index is seen opening 18 points higher at 7,683.7 on Monday, according to financial bookmakers, with futures up 0.2 percent ahead of the cash market open.\n* KCOM: British telecoms company KCOM Group Plc said it expects annual core earnings to come in slightly ahead of its expectations, thanks to a multi-year rebate on its Hull and East Yorkshire network infrastructure.\n* GKN: GKN issued a new salvo against Melrose’s hostile bid on Monday by warning that raising the company’s debt ratio could reduce the strength of its covenants and therefore increase the cash needed to fund its pension.\n* CARILLION: Britain’s Financial Reporting Council (FRC) watchdog said on Monday it had opened an investigation into KPMG’s audit of the now-collapsed Carillion, covering the years 2014 to 2017.\nCarillion attempted to “wriggle out of its obligations” to pensioners for the last decade, according to Parliament’s Work and Pensions Select Committee.\n* ANGLO AMERICAN: Anglo American on Monday announced the sale of the New Largo thermal coal project in South Africa for approximately $71 million to a new majority black-owned-and-managed company.\n* PETRA DIAMONDS: Petra Diamonds Ltd said on Monday it expects full-year core earnings to come in about 10 percent to 15 percent below consensus, and cut its 2018 production forecast.\n* PROVIDENT FINANCIAL: Four former executives have raised employment tribunal claims for unfair dismissals against Provident Financial, dealing a fresh blow to a company struggling to revive its door-to-door operations, The Times reported.\n* SKY: Hedge fund Elliott Management Corp, founded by Paul Singer, has built a stake in Sky Plc, according to a regulatory filing published on Friday.\n* ANGLO AMERICAN: Anglo American on Friday clinched two long-awaited environmental licenses that pave the way for the global mining company to expand its Minas-Rio iron ore mine in the Brazilian state of Minas Gerais.\n* GKN: British engineering company GKN, which is facing a hostile bid from Melrose Industries, has received several approaches for its individual business, the Financial Times reported on Friday.\n* HSBA/QATAR: A boycott of Qatar by its neighbours has prompted HSBC to turn down a leading role on Doha’s new dollar bond as the bank treads a political tightrope in the Gulf, four banking sources familiar with the decision told Reuters.\n* US CFTC/HSBA: The U.S. derivatives regulator is set to announce it has fined European lenders UBS,HSBC and Deutsche Bank millions of dollars each for so-called “spoofing” and manipulation in the U.S. futures market, three people with direct knowledge of the matter told Reuters.\n* BRITAIN ENERGY: Britain’s decision to leave the European Union could lead to higher energy prices and energy supply shortages if the exit is not managed properly, a report by an upper-house parliamentary committee report said on Monday.\n* BREXIT: Britain could make it a requirement for regulators to help London remain a top global financial centre after Brexit, lawmakers said on Saturday in a report pitting parliament against the Bank of England.\n* The UK blue chip index closed 0.65 percent on Friday with healthcare shares contributing most to the broader rise and as buyers returned to the market following two days of declines driven by a strengthening sterling.\n* For more on the factors affecting European stocks, please click on: cpurl://apps.cp./cms/?pageId=livemarkets\nTODAY‘S UK PAPERS\n> Financial Times\n> Other business headlines Multimedia versions of Reuters Top News are now available for: * 3000 Xtra : visit topnews.session.rservices.com * For Top News : topnews.reuters.com (Reporting by Rahul B in Bengaluru)\n ", "external_links": [], "published": "2018-01-29T09:44:00.000+02:00", "crawled": "2018-01-29T10:02:49.021+02:00", "highlightTitle": ""}