{"organizations": [], "uuid": "c316ca9bbb0987fc93a2756e536f0418e14cc60e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224517630&w=1200&r=LYNXMPEE0M1C6", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-czech-election-president-migration/migration-drops-near-zero-in-czech-republic-but-sways-election-campaign-idUSKBN1FC25N", "country": "US", "domain_rank": 408, "title": "Migration drops near zero in Czech Republic but sways election campaign", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.222, "site_type": "news", "published": "2018-01-24T00:01:00.000+02:00", "replies_count": 0, "uuid": "c316ca9bbb0987fc93a2756e536f0418e14cc60e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-czech-election-president-migration/migration-drops-near-zero-in-czech-republic-but-sways-election-campaign-idUSKBN1FC25N", "ord_in_thread": 0, "title": "Migration drops near zero in Czech Republic but sways election campaign", "locations": [], "entities": {"persons": [], "locations": [{"name": "czech republic", "sentiment": "none"}, {"name": "prague", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "middle east africa", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "interior ministry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PRAGUE (Reuters) - The number of asylum seekers crossing the Czech Republic dropped in 2017 to negligible numbers, police said on Tuesday amid a presidential election in which illegal migration has become a hot topic.\nAlthough the country was largely untouched by a 2015 influx into the European Union of over one million migrants fleeing war and poverty in the Middle East Africa and Asia, fears of Muslim immigration have dominated the election debate.\nPolice said they detained 172 migrants in 2017 who sought to illegally transit the Czech Republic, mostly coming from Austria and heading onwards to neighboring Germany. They were mainly from Afghanistan, Iraq and Syria.\nThat compared with 2,294 detentions during the peak of 2015, and 511 in 2016. In separate data, the Interior Ministry said 116 people applied for asylum in January-November 2017, a tiny fraction of those doing so in west European countries.\nEx-communist central and eastern members of the EU with scant experience of non-Christian foreigners were the vanguard of a backlash against Germany’s decision in 2015 to open its doors to around a million mostly Muslim migrants.\nThey rebuffed an EU plan to distribute migrants among member states according to annual quotas, even though the vast bulk of migrants wanted to settle in the wealthier west rather than poorer east of the bloc.\nIn the event, the flow of migrants has largely dried up since borders were sealed along the migrants’ main overland Balkans corridor into the EU and Turkey stopped migrants taking boats across narrow sea channels to Greece.\nNevertheless, positions on migration may prove decisive in the Czech Republic’s closely contested presidential run-off on Jan. 26-27 in which academic Jiri Drahos is challenging incumbent Milos Zeman.\nZeman’s re-election campaign has seized on immigration as its main theme with the slogan, “Stop immigration and Drahos. This country is ours.”\nDozens of pro-Zeman billboards and media adverts suggest Drahos would be weak on rejecting EU pressure on each member state to accept migrants according to the quota system.\nLike Zeman and all parliamentary parties, Drahos has repeatedly insisted that he rejects the idea of quotas and that the bloc should better guard its external borders against incoming asylum seekers.\nOpinion polls ahead of the run-off vote show the soft-spoken Drahos, who favors closer EU integration, is neck-and-neck or slightly ahead of Zeman, who has courted the far right by rejecting Muslim immigration.\nReporting by Robert Muller; editing by Mark Heinrich\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T00:01:00.000+02:00", "crawled": "2018-01-24T15:54:00.021+02:00", "highlightTitle": ""}