{"organizations": [], "uuid": "140266d9d2cff10b11f48309e2a12e7b1e287a62", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222753797&w=1200&r=LYNXMPEE0G13N", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-kosovo-us-warcrimes/kosovo-to-face-harsh-consequences-if-war-crimes-court-scrapped-u-s-idUKKBN1F61W5", "country": "US", "domain_rank": 408, "title": "Kosovo to face harsh consequences if war crimes court scrapped - U.S.", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T17:01:00.000+02:00", "replies_count": 0, "uuid": "140266d9d2cff10b11f48309e2a12e7b1e287a62"}, "author": "", "url": "https://uk.reuters.com/article/uk-kosovo-us-warcrimes/kosovo-to-face-harsh-consequences-if-war-crimes-court-scrapped-u-s-idUKKBN1F61W5", "ord_in_thread": 0, "title": "Kosovo to face harsh consequences if war crimes court scrapped - U.S.", "locations": [], "entities": {"persons": [{"name": "delawie", "sentiment": "none"}, {"name": "greg delawie", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "kosovo", "sentiment": "none"}, {"name": "pristina", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "fatos bytyci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 3:03 PM / Updated 19 minutes ago Kosovo to face harsh consequences if war crimes court scrapped - U.S. Fatos Bytyci 3 Min Read \nPRISTINA (Reuters) - The U.S. ambassador to Kosovo warned the country’s leaders on Wednesday they would bear harsh consequences if parliament votes to scrap a war crimes court linked to its violent independence struggle. \nA parliamentary committee, meanwhile, put off decision on whether to put forward a vote to scrap legislation on setting up the court, which would try ethnic Albanians accused of war crimes against Serbs during the 1998-99 conflict. \nThe initiative was previously shelved in December under U.S. and European Union pressure, but since revived. \nU.S. Ambassador Greg Delawie told reporters that the initiative was “a terrible example” of self-centred interests prevailing “over the common good and Kosovo’s interests”. \n“The politicians ... despite their denials, would be subject to specific and harsh consequences should the initiative succeed,” Delawie said. \nLast week the European Union warned Kosovo - which aspires to closer links with the EU - that its relations with the bloc would suffer if it scrapped the law. \nGerman and French envoys lobbied Kosovo leaders in Pristina last week not to abolish the Specialist Chamber set up in 2015 to try ex-Kosovo Liberation Army (KLA guerrillas for alleged atrocities in the war that led to independence from Serbia. \nProponents of doing away with the court say it is mandated only to prosecute ethnic Albanians and that it would duplicate the work of other courts dealing with war crimes during the 1990s break-up of old Yugoslavia. \nPrime Minister Ramush Haradinaj, President Hashim Thaci and parliamentary speaker Kadri Veseli are former KLA commanders and could potentially be indicted by the court or called as witnesses, some Kosovo Albanian media reported. \n“Kosovo needs to be willing to close this chapter of history even if it means holding some of its wartime leaders to account,” Delawie told reporters. \nA 2011 report for the Council of Europe linked leading Kosovo figures – notably Thaci – to gruesome crimes against Serbs, including trade in organs harvested from prisoners of war. Thaci has denied any wrongdoing. \nThe court, based abroad in The Hague to minimise the risk of witness intimidation and judicial corruption, has yet to hear any cases. \nThe United States is Kosovo’s staunchest ally but Pristina also hopes for eventual association with the EU. To that end, the EU has told Pristina it must first root out rampant corruption and organised crime, prosecute war crimes and normalise relations with its neighbours including Serbia. Reporting by Fatos Bytyci; writing by Aleksandar Vasovic; editing by Ivana Sekularac and Mark Heinrich", "external_links": [], "published": "2018-01-17T17:01:00.000+02:00", "crawled": "2018-01-17T17:24:45.012+02:00", "highlightTitle": ""}