{"organizations": [], "uuid": "d0ededcf71a26eeefbdc4e7fce906cb8f604b5f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-executive-search-firm-following-its-own-succession-advice.html", "country": "US", "domain_rank": 767, "title": "Executive Search Firm Following its Own Succession Advice", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T19:07:00.000+02:00", "replies_count": 0, "uuid": "d0ededcf71a26eeefbdc4e7fce906cb8f604b5f5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-executive-search-firm-following-its-own-succession-advice.html", "ord_in_thread": 0, "title": "Executive Search Firm Following its Own Succession Advice", "locations": [], "entities": {"persons": [{"name": "leonard kieffer", "sentiment": "negative"}, {"name": "steven m. derks", "sentiment": "none"}, {"name": "roger quick", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "derks", "sentiment": "none"}, {"name": "mike kieffer", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "mda", "sentiment": "none"}, {"name": "muscular dystrophy association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 24, 2018 /PRNewswire/ -- Today, the Founders of Quick Leonard Kieffer, one of the country's leading retained executive search firms specializing in executive and board search for hospitals and health systems, academic medical centers, associations and professional societies, life sciences and medical device as well as large non-profits and foundations, announced the appointment of a new President and CEO, Steven M. Derks.\n\"We are delighted to welcome Steve to our firm and are confident his leadership will help us build on what we have established at Quick Leonard Kieffer. Steve believes deeply in our values of doing great work for our clients, assembling a top notch team of professionals that can find talent and discern great fit and ongoing learning so we continue to add value for our clients and candidates,\" said Mike Kieffer, Chair and Roger Quick, Vice Chair.\nDerks brings over 25 years of executive level leadership and experience to his new role heading the firm. From 2012 to 2017 he served as President and CEO of the Muscular Dystrophy Association (MDA), the iconic voluntary health association (VHA) known for its Jerry Lewis MDA Labor Day Telethon and summer camps for kids. MDA is the leader fighting muscular dystrophy and ALS through funding the continuum of research, clinical care, support services and education. There he led an aggressive reorganization and rebranding to reposition this $160 M per year non-profit. Prior to MDA, Derks was Chief Executive Officer of the American Cancer Society (ACS) – Illinois Division, one of 11 separately incorporated Divisions of the Society. He also served on the Nationwide Executive Team for ACS. During his tenure at ACS, he led the Smoke-free Chicago and Smoke-free Illinois campaigns, passing the most comprehensive clean indoor air laws in the United States. He also led the creation of a Patient Navigation System (PNS) that now annually serves over 60,000 newly diagnosed and patients in treatment. He helped found CEOs Against Cancer with David Bernauer, the then-Chairman and CEO of Walgreens as well as launched The Discovery Ball, now a $3 M per year black tie event funding cancer research, patient services, education and advocacy.\nEarlier in his career, Derks served as Vice President and one of 15 members of the Executive Cabinet of Advocate Health Care, one of the country's largest integrated delivery networks (IDN). Prior to this he served as Senior Director of Federal and State Government Relations for the Illinois Hospital Association (IHA) and as a governance consultant to hospital boards of directors.\n\"I am honored to be invited to lead QLK forward, working with Mike, Roger and our team. I believe my professional and civic work as well as my education and training are prelude to this next chapter serving clients to find great leadership talent for life-saving and life-enhancing missions,\" said Derks.\nDerks is also a co-founder of Horizons for Youth, a Chicago scholarship and mentoring program annually serving 250 at risk children. He serves as a Trustee of the International Association of Fire Fighters (IAFF) Charitable Foundation. He is a non-profit scholar and Fellow of CEO Perspectives, a CEO leadership program led by the University of Chicago Booth School of Business, Kellogg School of Management at Northwestern University and the Corporate Leadership Center. Derks is a Fellow and Past Board member of Leadership Greater Chicago and a member of the Economic Club of Chicago. He is also a former member of the Illinois State Board of Health, a gubernatorial appointment requiring Illinois Senate confirmation. Steve holds a bachelor's degree from the University of Illinois and a master's degree in health systems management from Rush University.\nAbout Quick Leonard Kieffer\nFounded in 1999, Quick Leonard Kieffer is one of the country's leading retained executive and board search firms specializing in the hospital, health sytem, academic medical center, life sciences and medical device industries. QLK also performs executive searches for associations, large non-profit organizations and foundations. For more information visit www.qlksearch.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/executive-search-firm-following-its-own-succession-advice-300587566.html\nSOURCE Quick Leonard Kieffer", "external_links": ["http://www.prnewswire.com/news-releases/executive-search-firm-following-its-own-succession-advice-300587566.html", "http://www.qlksearch.com/"], "published": "2018-01-24T19:07:00.000+02:00", "crawled": "2018-01-24T19:33:07.017+02:00", "highlightTitle": ""}