{"organizations": [], "uuid": "368a9871eeedbb4d726066e12dc2202f7e0107b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225505409&w=1200&r=LYNXMPEE0P0XQ", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/davos-meeting-ecb/ecb-warns-against-global-currency-war-idINKBN1FF1IS", "country": "US", "domain_rank": 408, "title": "ECB warns against global currency war", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T16:34:00.000+02:00", "replies_count": 0, "uuid": "368a9871eeedbb4d726066e12dc2202f7e0107b5"}, "author": "", "url": "https://in.reuters.com/article/davos-meeting-ecb/ecb-warns-against-global-currency-war-idINKBN1FF1IS", "ord_in_thread": 0, "title": "ECB warns against global currency war", "locations": [], "entities": {"persons": [{"name": "benoit coeure", "sentiment": "none"}, {"name": "coeure", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DAVOS/FRANKFURT (Reuters) - Attempts to target exchange rates risk setting off a currency war, a top European Central Bank executive argued on Friday, just days after U.S. officials made their case for a weaker dollar to boost trade.\nECB board member Benoit Coeure said at the World Economic Forum in Davos that talks over exchange rates should be returned to the confines of global meetings like the G7 and the G20, as the recent public noise is proving unhelpful.\n“The last thing the world needs today is a currency war,” Coeure said a panel at the World Economic Forum in Davos. “We live in a world where exchange rates are not and should not be targeted for competitive purposes.”\n“We see lots of volatility created recently by different statements and I think that’s just not helpful,” Coeure said. “Volatility is not helpful and if that would reach a point where it would create any unwarranted consequence for us, any unwarranted tightening for monetary policy, we would have to reassess.”\nCoeure’s comments come after U.S. officials earlier this week made the case for a weak dollar, sending the greenback tumbling to three year lows against the euro.\nHis remarks echoed those of ECB chief Mario Draghi who on Thursday took a swipe at Washington for talking down the dollar.\nThe currency volatility comes at an especially sensitive time for the ECB as it prepares to remove stimulus after nearly three years and 2 trillion euros worth of asset buys.\nThe stimulus has rekindled inflation but a strong euro will weigh on import prices, putting downward pressure on inflation and raising fears the ECB may not be able to end its bond buys as quick as hoped.\nDespite the currency’s strength, the euro zone economy is humming along and a key ECB survey published on Friday suggests that price growth could even be faster in the coming years than earlier thought.\nHeadline inflation will continue to miss the ECB’s target of almost 2 percent for years to come but projections in the survey were raised to 1.5 percent this year and 1.7 percent next year, underpinning ECB chief Mario Draghi’s cautious optimism after the bank’s policy meeting on Thursday.\nIndeed, Coeure added that wages are now ticking up at least tentatively, suggesting that the euro zone may be nearing a tipping point with regard to inflation.\nIn another piece of hopeful data, lending in December remained near post-crisis highs, thanks to ultra low borrowing costs.\nReporting by Noah Barkin and Silvia Aloisi in Davos, Balazs Koranyi and Francesco Canepa in Frankfurt; Editing by Toby Chopra\n ", "external_links": [], "published": "2018-01-26T16:34:00.000+02:00", "crawled": "2018-01-26T16:54:07.001+02:00", "highlightTitle": ""}