{"organizations": [], "uuid": "9b2a80786e727842abc5ca1bf5cd17ef5a7e99d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-the-escape-pod-hires-digital-veteran-blagica-bottigliero-as-director-of-social-strategy.html", "country": "US", "domain_rank": 767, "title": "The Escape Pod hires digital veteran Blagica Bottigliero as Director of Social Strategy", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T19:52:00.000+02:00", "replies_count": 0, "uuid": "9b2a80786e727842abc5ca1bf5cd17ef5a7e99d8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-the-escape-pod-hires-digital-veteran-blagica-bottigliero-as-director-of-social-strategy.html", "ord_in_thread": 0, "title": "The Escape Pod hires digital veteran Blagica Bottigliero as Director of Social Strategy", "locations": [], "entities": {"persons": [{"name": "blagica bottigliero", "sentiment": "negative"}, {"name": "blagi", "sentiment": "negative"}, {"name": "celia jones", "sentiment": "none"}, {"name": "blagic", "sentiment": "none"}, {"name": "bottigliero", "sentiment": "none"}, {"name": "blagica", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO--(BUSINESS WIRE)-- Independent agency The Escape Pod announced today that it has named Blagica Bottigliero as Director of Social Strategy. In this role, she is charged with overseeing all social media work for the agency’s roster of clients, building out its social capabilities, and bolstering The Escape Pod’s ability to deliver a fully integrated suite of services for fast-growing brands.\n“Blagica brings a unique blend of strategic chops and deep experience as a true social practitioner. She has been an avid thought leader since the early days of digital and has always advocated for brands to embrace social, not just as a marketing channel or set of tools, but a vital connection to the real people who shop for and buy their products. She is equally passionate about launching campaigns to geeking out on new gadgets to managing the daily grind of community moderation. I’m excited for our clients to benefit from her expertise and ability to translate our big ideas and apply them to social media platforms in bold, innovative ways,” said Celia Jones, CEO of The Escape Pod.\nBlagica has stewarded numerous brands into the digital space, from creating websites for Maytag and Purina, to being a founding member of the eMarketing team at Orbitz, to leading social media at Target and Motorola. On the agency side, she led Edelman Digital's Strategy division, as well as Co-Chairing the Cook County New Media Council and serving as VP of Digital Media at ModSquad, a global outsourcing and customer service company.\n“I’m thrilled to join an agency with such incredible momentum and a roster of really innovative brands. What I love about our integrated model is that we have the ability to infuse the craft and artistry of our creative ideas into every media and touchpoint seamlessly—be it a broadcast spot, social campaign, mobile app or Instagram post. I also admire The Escape Pod because it’s a place where seasoned people still retain a pulse on the work, even after more than a decade in business. How I thrive is by bringing the strategic depth, but also by getting my hands dirty. It’s that same ethos and passion that I bring to my job everyday,” said Blagica Bottigliero, Director of Social Media Strategy, The Escape Pod.\nTrue to her entrepreneurial roots, Blagica also founded and led her own startups and consultancies before joining The Escape Pod, working with such clients as Choose Chicago, The Chicago French Pastry School, Fashion Fair Cosmetics and Kennedy for Illinois. She is an established thought leader, serving as advisor to tech startup, Jiobit and speaking at numerous global conferences including TED and SxSW.\nAbout The Escape Pod\nNamed Ad Age’s 2017 Small Agency of the Year for the Midwest, The Escape Pod is an independent, Chicago-based creative powerhouse known for category-changing work that drives results for clients such as Merrick Pet Care, a2 Milk Company, EGO Power+, Southeastern Grocers (Winn-Dixie, BI-LO, Harveys and Fresco y Mas), SKIL and SKILSAW. In 2017, The Escape Pod formed The Escape Pod Group in partnership with digital production studio, ORA Interactive , and experiential agency, OutCold . The Escape Pod Group is a collective of specialty advertising agencies, purpose-built to deliver breakthrough ideas with speed, agility and cost-savings for clients. We combine creative firepower with full-service capabilities across creative, digital, social and experiential marketing. Our mission: to bring our clients’ brand propositions to life in the most dramatic manner possible. Learn more at www.theescapepodgroup.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005952/en/\nThe Escape Pod\nCelia Jones\nCEO\ncelia@theescapepodagency.com\nSource: The Escape Pod", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftheescapepod.com%2F&esheet=51748980&newsitemid=20180125005952&lan=en-US&anchor=The+Escape+Pod&index=3&md5=b51fecf0891b559d88510a871f284142", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.theescapepod.com&esheet=51748980&newsitemid=20180125005952&lan=en-US&anchor=The+Escape+Pod&index=1&md5=fc1c067004ebb3a564b2f1e4656687ee", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.outcold.com%2F&esheet=51748980&newsitemid=20180125005952&lan=en-US&anchor=OutCold&index=5&md5=62523693e06120d7a659dd345706e304", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fadage.com%2Farticle%2Fspecial-report-small-agency-conference-and-awards%2Fmidwest-gold-escape-pod%2F309874%2F&esheet=51748980&newsitemid=20180125005952&lan=en-US&anchor=Ad+Age%27s+2017+Small+Agency+of+the+Year&index=2&md5=ef089a729fde975b3c29203b5d2deabb", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Forainteractive.com%2F&esheet=51748980&newsitemid=20180125005952&lan=en-US&anchor=ORA+Interactive&index=4&md5=02027542c9c051f5525975e4f5d508cb", "http://www.businesswire.com/news/home/20180125005952/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.theescapepodgroup.com%2F&esheet=51748980&newsitemid=20180125005952&lan=en-US&anchor=www.theescapepodgroup.com&index=6&md5=9c671414e16845a7ef39a82075dff09b"], "published": "2018-01-25T19:52:00.000+02:00", "crawled": "2018-01-25T20:36:13.001+02:00", "highlightTitle": ""}