{"organizations": [], "uuid": "7ff7cd22c3dd5965c347b25cd3bc376bbacd21bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-legg-mason-reports-results-for-third-fiscal-quarter.html", "country": "US", "domain_rank": 767, "title": "Legg Mason Reports Results For Third Fiscal Quarter", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:15:00.000+02:00", "replies_count": 0, "uuid": "7ff7cd22c3dd5965c347b25cd3bc376bbacd21bd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-legg-mason-reports-results-for-third-fiscal-quarter.html", "ord_in_thread": 0, "title": "Legg Mason Reports Results For Third Fiscal Quarter", "locations": [], "entities": {"persons": [{"name": "joseph a. sullivan", "sentiment": "none"}, {"name": "legg mason", "sentiment": "none"}], "locations": [{"name": "baltimore", "sentiment": "none"}], "organizations": [{"name": "legg mason reports results", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "legg mason, inc.", "sentiment": "neutral"}, {"name": "legg mason", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BALTIMORE, Jan. 24, 2018 /PRNewswire/ -- Legg Mason, Inc. (NYSE: LM) today reported its operating results for the third fiscal quarter ended December 31, 2017.\nQuarters Ended\nNine Months Ended\nFinancial Results\nDec\nSep\nDec\nDec\nDec\n(Amounts in millions, except per share amounts)\n2017\n2017\n2016\n2017\n2016\nOperating Revenues\n$\n793.1\n$\n768.3\n$\n715.2\n$\n2,355.3\n$\n2,163.8\nOperating Expenses\n820.4\n623.9\n604.1\n2,131.0\n1,851.4\nOperating Income (Loss)\n(27.3)\n144.4\n111.2\n224.3\n312.4\nNet Income 1\n149.2\n75.7\n51.4\n275.8\n151.3\nNet Income Per Share - Diluted 1\n1.58\n0.78\n0.50\n2.86\n1.43\nAssets Under Management 2\n(Amounts in billions)\nEnd of Period Assets Under Management\n$\n767.2\n$\n754.4\n$\n710.4\n$\n767.2\n$\n710.4\nAverage Assets Under Management\n759.9\n750.3\n716.7\n750.6\n719.7\n(1) Net Income Attributable to Legg Mason, Inc.\n(2) December 2016 Assets Under Management (\"AUM\") excludes $13.7 billion of separately managed account assets which were\nclassified as Assets Under Advisement and reported as AUM effective April 1, 2017\nJoseph A. Sullivan, Chairman and CEO of Legg Mason said, \"Legg Mason's fiscal third quarter included strong core results driven by robust performance and advisory fees, and a keen focus on expense management.\n\"Long-term inflows of $2.2 billion were driven by fixed income inflows, partially offset by equity outflows. Alternative flows were flat for the period. Legg Mason's adjusted operating margin 3 was over 27%, the highest in nearly 10 years. And finally, Global Distribution had another quarter of net positive flows with strong persistency of assets.\n\"Stepping back from the quarter, we are pleased that expanding client choice is positioning us to create better outcomes for clients while creating more diversification, resiliency and better long-term returns for shareholders.\"\n(3) See \"Use of Supplemental Non-GAAP Financial Information.\"\nAssets Under Management of $767.2 Billion\nAssets Under Management were $767.2 billion at December 31, 2017 compared with $754.4 billion at September 30, 2017, resulting from $13.5 billion in positive market performance and other, $2.2 billion in long-term inflows and $0.1 billion in acquisitions, partially offset by liquidity outflows of $2.3 billion, negative foreign exchange of $0.4 billion and realizations of $0.3 billion.\nQuarter Ended December 31, 2017\nAssets Under Management\nAUM\n(in billions)\nFlows\n(in billions)\nOperating\nRevenue\nYield 1\nEquity\n$\n207.6\n$\n(3.2)\n61 bps\nFixed Income\n420.1\n5.4\n27 bps\nAlternative\n66.3\n—\n2\n64 bps\nLong-Term Assets\n694.0\n2.2\nLiquidity\n73.2\n(2.3)\n14 bps\nTotal\n$\n767.2\n$\n(0.1)\n38 bps\n(1) Operating revenue yield equals total operating revenues less performance fees divided by average AUM\n(2) Excludes realizations of $0.3 billion\nAt December 31, 2017, fixed income represented 55% of AUM, while equity represented 27%, alternative represented 9% and liquidity represented 9%.\nBy geography, 69% of AUM was from clients domiciled in the United States and 31% from non-US domiciled clients.\nAverage AUM during the quarter was $759.9 billion compared to $750.3 billion in the prior quarter and $716.7 billion in the third quarter of fiscal year 2017. Average long-term AUM was $685.3 billion compared to $675.1 billion in the prior quarter and $625.8 billion in the third quarter of fiscal year 2017.\nQuarterly Performance\nAt December 31, 2017:\n1-Year\n3-Year\n5-Year\n10-Year\n% of Strategy AUM beating Benchmark 4\n74%\n75%\n75%\n87%\n% of Long-Term U.S. Fund Assets Beating Lipper Category Average\nFixed Income\n81%\n76%\n78%\n89%\nEquity\n35%\n50%\n45%\n66%\nAlternatives (performance relates to only 3 funds)\n16%\n93%\n100%\nn/a\nTotal U.S. Fund Assets\n56%\n62%\n61%\n76%\n(4) See \"Supplemental Data Regarding Quarterly Performance.\"\nOf Legg Mason's long-term U.S. mutual fund assets, 49% were in funds rated 4 or 5 stars by Morningstar.\nOperating Results - Comparison to the Second Quarter of Fiscal Year 2018\nNet income was $149.2 million, or $1.58 per diluted share, compared to net income of $75.7 million, or $0.78 per diluted share, in the second quarter of fiscal year 2018. In addition to the net impact of the factors listed below, the increased earnings were driven by higher average AUM and higher non-pass through performance fees.\nThis quarter's results included:\nOne-time non-cash tax benefit of $213.7 million, or $2.27 per diluted share, related to the new tax law. Non-cash intangible asset impairment charge of $195.0 million, or $1.62 per diluted share. Discrete tax expense items of $7.4 million, or $0.08 per diluted share. EnTrustPermal acquisition and transition-related costs of $1.3 million, or $0.01 per diluted share.\nThe prior quarter's results included:\nSeverance charges of $1.7 million, or $0.01 per diluted share. EnTrustPermal acquisition and transition-related costs of $1.4 million, or $0.01 per diluted share. Year-to-date annualization tax benefit of $1.2 million, or $0.01 per diluted share.\nOperating revenues of $793.1 million were up 3% compared to $768.3 million in the prior quarter reflecting:\nAn increase in non-pass through performance fees of $28.0 million, which more than offset a decrease in pass through performance fees of $9.9 million. Excluding performance fees, operating revenues increased 1% due to higher average long-term AUM.\nOperating expenses were $820.4 million compared to $623.9 million in the prior quarter, but excluding the non-cash impairment charge of $195.0 million, expenses were up less than 1%, reflecting:\nLower compensation of $5.9 million driven by the decrease in Clarion pass through performance fees. Increases in Communications & Technology expenses and Other Expenses of $2.9 million and $3.3 million, respectively. A $4.3 million gain in the market value of deferred compensation and seed investments which is recorded as an increase in compensation and benefits with an offset in non-operating income, as compared to a $4.8 million gain in the prior quarter.\nNon-operating expense was $13.5 million, as compared to $18.1 million in the prior quarter reflecting:\nGains on corporate investments, not offset in compensation, were $1.5 million compared with gains of $2.4 million in the prior quarter. Gains on funded deferred compensation and seed investments, as described above. A $7.9 million gain associated with the consolidation of sponsored investment vehicles compared to a $2.1 million gain in the prior quarter. The consolidation of sponsored investment vehicles has no impact on net income as the effects of consolidation are fully attributable to noncontrolling interests.\nOperating margin was (3.4%) compared to 18.8% in the prior quarter, reflecting the impact of the non-cash impairment charge of $195.0 million. Operating margin, as adjusted 5 , was 27.2%, as compared to 24.9% in the prior quarter.\nNet income attributable to noncontrolling interests , excluding consolidated investment vehicles, was $13.6 million compared to $10.4 million in the prior quarter, principally related to Clarion, EnTrustPermal, RARE and Royce.\n(5) See \"Use of Supplemental Non-GAAP Financial Information.\"\nOperating Results - Comparison to the Third Quarter of Fiscal Year 2017\nNet income was $149.2 million, or $1.58 per diluted share, compared to net income of $51.4 million, or $0.50 per diluted share, in the third quarter of fiscal year 2017. In addition to the factors listed below, the increased earnings were driven by higher average long-term AUM and higher non-pass through performance fees.\nThis quarter's results included:\nOne-time non-cash tax benefit of $213.7 million, or $2.27 per diluted share, related to the new tax law. Non-cash intangible asset impairment charge of $195.0 million, or $1.62 per diluted share. Discrete tax expense items of $7.4 million, or $0.08 per diluted share. EnTrustPermal acquisition and transition-related costs of $1.3 million, or $0.01 per diluted share.\nThe prior year quarter's results included:\nNon-cash impairment charges of $35.0 million, or $0.25 per diluted share. A credit of $14.5 million, or $0.10 per diluted share, related to contingent consideration fair value adjustments. A gain of $4.0 million, or $0.03 per diluted share, on the sale of Legg Mason Poland. EnTrustPermal acquisition and transition-related costs of $3.0 million, or $0.02 per diluted share.\nOperating revenues of $793.1 million were up 11% compared with $715.2 million in the prior year quarter reflecting:\nIncreases principally due to higher average long-term AUM. An increase in non-pass through performance fees of $28.3 million, and an increase in pass through performance fees of $7.7 million.\nOperating expenses of $820.4 million were up 36% compared with $604.1 million in the prior year quarter reflecting:\nA non-cash impairment charge related to an intangible asset of $195.0 million, compared with non-cash impairment charges of $35.0 million in the prior year quarter. Increased compensation, related to increased revenues driven by higher average long-term AUM and performance fees. Acquisition and transition-related charges of $1.3 million, as compared with $3.0 million in the prior year. The prior year quarter included a contingent consideration credit adjustment of $14.5 million. A $4.3 million gain in the market value of deferred compensation and seed investments, which is recorded as an increase in compensation and benefits with an offset in non-operating income, compared with a gain of $1.5 million in the prior year quarter.\nNon-operating expense was $13.5 million, compared to $20.2 million in the prior year quarter reflecting:\nA $4.0 million gain on the sale of Legg Mason Poland in the prior year quarter. Gains on corporate investments, not offset in compensation, were $1.5 million compared with gains of $1.3 million in the prior year quarter. Gains on funded deferred compensation and seed investments, as described above. A $7.9 million gain associated with the consolidation of sponsored investment vehicles, as compared to an $0.8 million gain in the prior year quarter. The consolidation of sponsored investment vehicles has no impact on net income as the effects of consolidation are fully attributable to noncontrolling interests.\nOperating margin was (3.4%) as compared to 15.5% in the prior year quarter reflecting the impact of the non-cash impairment charge of $195.0 million. Operating margin, as adjusted, was 27.2%, as compared to 23.9% in the prior year quarter.\nNet income attributable to noncontrolling interests , excluding consolidated investment vehicles, was $13.6 million, compared to $13.1 million in the prior year quarter, principally related to Clarion, EnTrustPermal, RARE and Royce.\nQuarterly Business Developments and Recent Announcements\nMorningstar Inc. announced nominees for the U.S. Fixed Income Manager of the Year, which included David Hoffman, Stephen Smith, John McIntyre, and Anujeet Sareen for Brandywine Global's Global Opportunities Bond Fund (GOBSX) and Western Asset's Ken Leech and team for the Western Asset Core Plus Bond Fund (WACPX). Legg Mason, Brandywine Global, ClearBridge Investments and Western Asset were all recognized by Pensions & Investments (P&I) in their Best Places to Work in Investment Management survey for 2017. Legg Mason was ranked #73 overall and #3 among 30 Capital Markets companies in the Forbes/Just Capital, Just 100 annual ranking. RARE Infrastructure was named 2017 Listed Infrastructure Manager of the Year by Professional Pensions, a leading financial publication in the UK. Western Asset was ranked #1 in four out of seven categories in Chief Investment Officers' fifth annual ranking of liability driven investment (LDI) providers. Western was the top-ranked provider in the following categories: Responsiveness, Timely Reporting, Knowledge Sharing and Accessibility to Investment Team. On November 28, 2017, Legg Mason announced that Michelle Goldberg, a venture capital investor, and Alison Quirk, a financial services industry senior executive, were appointed to its Board of Directors, effective immediately. On December 22, 2017, Legg Mason repurchased all of the shares of the Company's common stock beneficially owned by Shanda Asset Management Investment Limited (\"Shanda\") in a private transaction.\nBalance Sheet\nAt December 31, 2017, Legg Mason's cash position was $680 million. Total debt was $2.5 billion and stockholders' equity was $3.8 billion. The ratio of total debt to total capital was 39%, an increase from 36% in the prior quarter. Seed investments totaled $271 million.\nIn the third fiscal quarter, the Company retired $299 million, or 7.5 million shares. The net impact of the share activity reduced the weighted average shares by 1.5 million. These repurchases included 5.6 million shares that the Company repurchased from Shanda in a private transaction funded by a draw on its revolver.\nConference Call to Discuss Results\nA conference call to discuss the Company's results, hosted by Joseph A. Sullivan, will be held at 5:00 p.m. EST today. The call will be open to the general public. Interested participants should access the call by dialing 1-800-447-0521 (or for international calls 1-847-413-3238), confirmation number 46274803, at least 10 minutes prior to the scheduled start to ensure connection. A live, listen-only webcast will also be available via the Investor Relations section of www.leggmason.com .\nThe presentation slides that will be reviewed during the discussion of the conference call will be available on the Investor Relations section of the Legg Mason website shortly after the release of the financial results.\nA replay of the live broadcast will be available on the Legg Mason website, www.leggmason.com , in the Investor Relations section, or by dialing 1-888-843-7419 (or for international calls 1-630-652-3042), enter pass code 46274803# when prompted. Please note that the replay will be available beginning at 8:00 p.m. EST on Wednesday, January 24, 2018, and ending at 11:59 p.m. EST on Wednesday, February 7, 2018.\nAbout Legg Mason\nGuided by a mission of Investing to Improve Lives,™ Legg Mason helps investors globally achieve better financial outcomes by expanding choice across investment strategies, vehicles and investor access through independent investment managers with diverse expertise in equity, fixed income, alternative and liquidity investments. Legg Mason's assets under management are $767 billion as of December 31, 2017. To learn more, visit our web site , our newsroom , or follow us on LinkedIn , Twitter , or Facebook .\nThis release contains forward-looking statements subject to risks, uncertainties and other factors that may cause actual results to differ materially. For a discussion of these risks and uncertainties, see \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in Legg Mason's Annual report on Form 10-K for the fiscal year ended March 31, 2017 and in the Company's quarterly reports on Form 10-Q.\nSupplemental Data Regarding Quarterly Performance\nStrategy Performance\nFor purposes of investment performance comparisons, strategies are an aggregation of discretionary portfolios (separate accounts, investment funds, and other products) into a single group that represents a particular investment objective. In the case of separate accounts, the investment performance of the account is based upon the performance of the strategy to which the account has been assigned. Each of our asset managers has its own specific guidelines for including portfolios in their strategies. For those managers which manage both separate accounts and investment funds in the same strategy, the performance comparison for all of the assets is based upon the performance of the separate account.\nApproximately eighty-seven percent of total AUM is included in strategy AUM as of December 31, 2017, although not all strategies have three-, five-, and ten-year histories. Total strategy AUM includes liquidity assets. Certain assets are not included in reported performance comparisons. These include: accounts that are not managed in accordance with the guidelines outlined above; accounts in strategies not marketed to potential clients; accounts that have not yet been assigned to a strategy; and certain smaller products at some of our affiliates.\nPast performance is not indicative of future results. For AUM included in institutional and retail separate accounts and investment funds managed in the same strategy as separate accounts, performance comparisons are based on gross-of-fee performance. For investment funds which are not managed in a separate account format, performance comparisons are based on net-of-fee performance. Funds-of-hedge funds generally do not have specified benchmarks. For purposes of this comparison, performance of those products is net of fees, and is compared to the relevant HFRX index. These performance comparisons do not reflect the actual performance of any specific separate account or investment fund; individual separate account and investment fund performance may differ. The information in this presentation is provided solely for use regarding this presentation, and is not directed toward existing or potential clients of Legg Mason.\nLong-term US Fund Assets Beating Lipper Category Average\nLong-term US fund assets include open-end, closed-end, and variable annuity funds. These performance comparisons do not reflect the actual performance of any specific fund; individual fund performance may differ. Past performance is not a guarantee of future results. Source: Lipper Inc.\nLEGG MASON, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF INCOME\n(Amounts in thousands)\n(Unaudited)\nQuarters Ended\nNine Months Ended\nDecember\nSeptember\nDecember\nDecember\nDecember\n2017\n2017\n2016\n2017\n2016\nOperating Revenues:\nInvestment advisory fees:\nSeparate accounts (1)\n$ 255,696\n$ 253,128\n$ 231,922\n$ 758,870\n$ 692,103\nFunds\n395,370\n393,035\n368,962\n1,170,633\n1,109,504\nPerformance fees\n58,926\n40,821\n22,913\n181,284\n82,342\nDistribution and service fees (1)\n81,463\n80,668\n90,195\n241,037\n276,122\nOther\n1,635\n686\n1,249\n3,446\n3,705\nTotal operating revenues\n793,090\n768,338\n715,241\n2,355,270\n2,163,776\nOperating Expenses: (2)\nCompensation and benefits\n362,071\n367,951\n327,862\n1,143,329\n1,054,817\nDistribution and servicing\n124,254\n123,634\n123,191\n370,237\n376,722\nCommunications and technology\n54,239\n51,299\n52,630\n155,841\n156,643\nOccupancy\n24,982\n25,171\n23,537\n74,561\n87,237\nAmortization of intangible assets\n6,071\n6,082\n7,277\n18,492\n19,251\nImpairment of intangible assets\n195,000\n—\n35,000\n229,000\n35,000\nContingent consideration fair value adjustments\n739\n—\n(14,500)\n(15,811)\n(39,500)\nOther\n53,067\n49,782\n49,078\n155,330\n161,252\nTotal operating expenses\n820,423\n623,919\n604,075\n2,130,979\n1,851,422\nOperating Income (Loss)\n(27,333)\n144,419\n111,166\n224,291\n312,354\nNon-Operating Income (Expense):\nInterest income\n1,827\n1,572\n1,713\n4,867\n5,106\nInterest expense\n(29,088)\n(29,077)\n(29,495)\n(87,431)\n(81,985)\nOther income, net\n5,519\n7,289\n6,126\n24,196\n22,686\nNon-operating income of\nconsolidated investment vehicles, net\n8,225\n2,094\n1,458\n11,316\n9,892\nTotal non-operating income (expense)\n(13,517)\n(18,122)\n(20,198)\n(47,052)\n(44,301)\nIncome (Loss) Before Income Tax Provision (Benefit)\n(40,850)\n126,297\n90,968\n177,239\n268,053\nIncome tax provision (benefit)\n(209,396)\n38,673\n26,441\n(142,468)\n71,654\nNet Income\n168,546\n87,624\n64,527\n319,707\n196,399\nLess: Net income attributable\nto noncontrolling interests\n19,324\n11,960\n13,088\n43,901\n45,067\nNet Income Attributable to Legg Mason, Inc.\n$ 149,222\n$ 75,664\n$ 51,439\n$ 275,806\n$ 151,332\n(Continued)\n(1) For the quarters ended December 31, 2017, September 30, 2017 and June 30, 2017, separate accounts advisory fees include $15.2 million, $13.8 million and $12.4 million, respectively, of revenue relating to retail separately managed accounts for which revenues were previously classified as Distribution and service fees. See note 2 on page 12.\n(2) Operating expenses include acquisition and transition-related costs related to business combinations.\nAcquisition and transition-related costs:\nCompensation\n$ 1,099\n$ 1,115\n$ 3,763\n$ 4,578\n$ 40,770\nOccupancy\n72\n(23)\n(962)\n170\n13,217\nOther\n141\n266\n222\n484\n18,997\nTotal acquisition and transition-related\ncosts\n$ 1,312\n$ 1,358\n$ 3,023\n$ 5,232\n$ 72,984\nLEGG MASON, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF INCOME, CONTINUED\n(Amounts in thousands, except per share amounts)\n(Unaudited)\nQuarters Ended\nNine Months Ended\nDecember\nSeptember\nDecember\nDecember\nDecember\n2017\n2017\n2016\n2017\n2016\nNet Income Attributable to Legg Mason, Inc.\n$ 149,222\n$ 75,664\n$ 51,439\n$ 275,806\n$ 151,332\nLess: Earnings (distributed and undistributed)\nallocated to participating securities (1)\n5,347\n2,687\n1,706\n9,639\n4,874\nNet Income (Distributed and Undistributed)\nAllocated to Shareholders (Excluding\nParticipating Securities)\n$ 143,875\n$ 72,977\n$ 49,733\n$ 266,167\n$ 146,458\nNet Income per Share Attributable to\nLegg Mason, Inc. Shareholders:\nBasic\n$ 1.59\n$ 0.78\n$ 0.50\n$ 2.87\n$ 1.44\nDiluted\n$ 1.58\n$ 0.78\n$ 0.50\n$ 2.86\n$ 1.43\nWeighted-Average Number of Shares\nOutstanding:\nBasic\n90,377\n93,087\n99,403\n92,770\n101,897\nDiluted\n90,833\n93,496\n99,568\n93,199\n102,102\n(1)\nParticipating securities excluded from weighted-average number of shares outstanding were 3,357, 3,417, and 3,404 for the quarters ended December 2017, September 2017, and December 2016, respectively, and 3,322 and 3,329 for the nine months ended December 2017 and December 2016, respectively.\nLEGG MASON, INC. AND SUBSIDIARIES\nCONSOLIDATING STATEMENTS OF INCOME\n(Amounts in thousands)\n(Unaudited)\nQuarters Ended\nDecember 2017\nSeptember 2017\nDecember 2016\nBalance Before\nConsolidation of\nConsolidated\nInvestment\nVehicles and\nOther (1)\nConsolidated\nInvestment\nVehicles and\nOther (1)\nConsolidated\nTotals\nBalance Before\nConsolidation of\nConsolidated\nInvestment\nVehicles and\nOther (1)\nConsolidated\nInvestment\nVehicles and\nOther (1)\nConsolidated\nTotals\nBalance Before\nConsolidation of\nConsolidated\nInvestment\nVehicles and\nOther (1)\nConsolidated\nInvestment\nVehicles and\nOther (1)\nConsolidated\nTotals\nTotal operating revenues\n$ 793,373\n$ (283)\n$ 793,090\n$ 768,361\n$ (23)\n$ 768,338\n$ 715,601\n$ (360)\n$ 715,241\nTotal operating expenses\n819,984\n439\n820,423\n623,814\n105\n623,919\n604,075\n—\n604,075\nOperating Income (Loss)\n(26,611)\n(722)\n(27,333)\n144,547\n(128)\n144,419\n111,526\n(360)\n111,166\nNon-operating income (expense)\n(19,970)\n6,453\n(13,517)\n(19,794)\n1,672\n(18,122)\n(20,545)\n347\n(20,198)\nIncome (Loss) Before Income Tax Provision (Benefit)\n(46,581)\n5,731\n(40,850)\n124,753\n1,544\n126,297\n90,981\n(13)\n90,968\nIncome tax provision (benefit)\n(209,396)\n—\n(209,396)\n38,673\n—\n38,673\n26,441\n—\n26,441\nNet Income\n162,815\n5,731\n168,546\n86,080\n1,544\n87,624\n64,540\n(13)\n64,527\nLess: Net income (loss) attributable\nto noncontrolling interests\n13,593\n5,731\n19,324\n10,416\n1,544\n11,960\n13,101\n(13)\n13,088\nNet Income Attributable to Legg Mason, Inc.\n$ 149,222\n$ —\n$ 149,222\n$ 75,664\n$ —\n$ 75,664\n$ 51,439\n$ —\n$ 51,439\nNine Months Ended\nDecember 2017\nDecember 2016\nBalance Before\nConsolidation of\nConsolidated\nInvestment\nVehicles and\nOther (1)\nConsolidated\nInvestment\nVehicles and\nOther (1)\nConsolidated\nTotals\nBalance Before\nConsolidation of\nConsolidated\nInvestment\nVehicles and\nOther (1)\nConsolidated\nInvestment\nVehicles and\nOther (1)\nConsolidated\nTotals\nTotal operating revenues\n$ 2,355,620\n$ (350)\n$ 2,355,270\n$ 2,164,162\n$ (386)\n$ 2,163,776\nTotal operating expenses\n2,130,412\n567\n2,130,979\n1,851,199\n223\n1,851,422\nOperating Income (Loss)\n225,208\n(917)\n224,291\n312,963\n(609)\n312,354\nNon-operating income (expense)\n(55,892)\n8,840\n(47,052)\n(53,063)\n8,762\n(44,301)\nIncome Before Income Tax Provision (Benefit)\n169,316\n7,923\n177,239\n259,900\n8,153\n268,053\nIncome tax provision (benefit)\n(142,468)\n—\n(142,468)\n71,654\n—\n71,654\nNet Income\n311,784\n7,923\n319,707\n188,246\n8,153\n196,399\nLess: Net income attributable\nto noncontrolling interests\n35,978\n7,923\n43,901\n36,914\n8,153\n45,067\nNet Income Attributable to Legg Mason, Inc.\n$ 275,806\n$ —\n$ 275,806\n$ 151,332\n$ —\n$ 151,332\n(1) Other represents consolidated sponsored investment products that are not designated as CIVs\nLEGG MASON, INC. AND SUBSIDIARIES\nSUPPLEMENTAL DATA\nRECONCILIATION OF OPERATING MARGIN, AS ADJUSTED (1)\n(Amounts in thousands)\n(Unaudited)\nQuarters Ended\nNine Months Ended\nDecember\nSeptember\nDecember\nDecember\nDecember\n2017\n2017\n2016\n2017\n2016\nOperating Revenues, GAAP basis\n$ 793,090\n$ 768,338\n$ 715,241\n$ 2,355,270\n$ 2,163,776\nPlus (less):\nPass-through performance fees\n(9,970)\n(19,874)\n(2,250)\n(95,275)\n(52,681)\nOperating revenues eliminated upon\nconsolidation of investment vehicles\n283\n23\n360\n350\n386\nDistribution and servicing expense excluding\nconsolidated investment vehicles\n(124,071)\n(123,578)\n(123,326)\n(369,998)\n(376,722)\nOperating Revenues, as Adjusted\n$ 659,332\n$ 624,909\n$ 590,025\n$ 1,890,347\n$ 1,734,759\nOperating Income (Loss), GAAP basis\n$ (27,333)\n$ 144,419\n$ 111,166\n$ 224,291\n$ 312,354\nPlus (less):\nGains on deferred compensation\nand seed investments, net\n4,333\n4,824\n1,474\n14,585\n9,072\nImpairment of intangible assets\n195,000\n—\n35,000\n229,000\n35,000\nAmortization of intangible assets\n6,071\n6,082\n7,277\n18,492\n19,251\nContingent consideration fair value adjustments\n739\n—\n(14,500)\n(15,811)\n(39,500)\nOperating loss of consolidated investment\nvehicles, net\n722\n128\n360\n917\n609\nOperating Income, as Adjusted\n$ 179,532\n$ 155,453\n$ 140,777\n$ 471,474\n$ 336,786\nOperating Margin, GAAP basis\n(3.4)\n%\n18.8\n%\n15.5\n%\n9.5\n%\n14.4\n%\nOperating Margin, as Adjusted\n27.2\n24.9\n23.9\n24.9\n19.4\n(1) See explanations for \"Use of Supplemental Non-GAAP Financial Information.\"\nLEGG MASON, INC. AND SUBSIDIARIES\nSUPPLEMENTAL DATA\nRECONCILIATION OF CASH PROVIDED BY OPERATING ACTIVITIES\nTO ADJUSTED EBITDA (1)\n(Amounts in thousands)\n(Unaudited)\nQuarters Ended\nNine Months Ended\nDecember\nSeptember\nDecember\nDecember\nDecember\n2017\n2017\n2016\n2017\n2016\nCash provided by (used in) operating activities, GAAP basis\n$ 117,323\n$ 289,329\n$ 209,102\n$ 293,072\n$ 346,961\nPlus (less):\nInterest expense, net of accretion and amortization\nof debt discounts and premiums\n28,503\n28,343\n28,534\n85,176\n78,927\nCurrent tax expense\n8,823\n9,662\n(2,981)\n24,557\n11,925\nNet change in assets and liabilities\n25,077\n(145,656)\n(108,242)\n92,744\n21,346\nNet change in assets and liabilities\nof consolidated investment vehicles\n21,873\n1,235\n43,732\n54,897\n(15,041)\nNet income attributable to noncontrolling interests\n(19,324)\n(11,960)\n(13,088)\n(43,901)\n(45,067)\nNet gains (losses) and earnings on investments\n(4,163)\n1,491\n2,432\n2,874\n(959)\nNet gains on consolidated investment vehicles\n8,225\n2,094\n1,458\n11,316\n9,892\nOther\n663\n194\n(638)\n934\n(1,137)\nAdjusted EBITDA\n$ 187,000\n$ 174,732\n$ 160,309\n$ 521,669\n$ 406,847\n(1)\nSee explanations for \"Use of Supplemental Non-GAAP Financial Information.\"\nLEGG MASON, INC. AND SUBSIDIARIES\n(Amounts in billions)\n(Unaudited)\nAssets Under Management\nQuarters Ended\nBy asset class:\nDecember 2017\nSeptember 2017\nJune 2017\nMarch 2017\nDecember 2016\nEquity\n$ 207.6\n$ 201.2\n$ 196.2\n$ 179.8\n$ 169.0\nFixed Income\n420.1\n411.9\n403.6\n394.3\n381.1\nAlternative\n66.3\n65.8\n66.5\n67.9\n71.5\nLong-Term Assets\n694.0\n678.9\n666.3\n642.0\n621.6\nLiquidity\n73.2\n75.5\n74.9\n86.4\n88.8\nTotal\n$ 767.2\n$ 754.4\n$ 741.2\n$ 728.4\n$ 710.4\nQuarters Ended\nNine Months Ended\nBy asset class (average):\nDecember 2017\nSeptember 2017\nJune 2017\nMarch 2017\nDecember 2016\nDecember 2017\nDecember 2016\nEquity\n$ 204.7\n$ 198.9\n$ 190.6\n$ 174.2\n$ 166.7\n$ 197.9\n$ 165.1\nFixed Income\n414.8\n410.2\n400.7\n388.1\n387.8\n408.7\n385.2\nAlternative\n65.8\n66.0\n67.4\n70.4\n71.3\n66.4\n66.0\nLong-Term Assets\n685.3\n675.1\n658.7\n632.7\n625.8\n673.0\n616.3\nLiquidity\n74.6\n75.2\n81.6\n86.2\n90.9\n77.6\n103.4\nTotal\n$ 759.9\n$ 750.3\n$ 740.3\n$ 718.9\n$ 716.7\n$ 750.6\n$ 719.7\nComponent Changes in Assets Under Management\nQuarters Ended\nNine Months Ended\nDecember 2017\nSeptember 2017\nJune 2017\nMarch 2017\nDecember 2016\nDecember 2017\nDecember 2016\nBeginning of period\n$ 754.4\n$ 741.2\n$ 728.4\n$ 710.4\n$ 732.9\n$ 728.4\n$ 669.6\nNet client cash flows:\nEquity\n(3.2)\n(2.4)\n1.0\n3.1\n(3.7)\n(4.6)\n(8.4)\nFixed Income\n5.4\n0.9\n0.3\n3.5\n0.5\n6.6\n7.3\nAlternative\n—\n(0.7)\n(0.8)\n(2.7)\n(0.8)\n(1.5)\n(4.4)\nLong-Term flows\n2.2\n(2.2)\n0.5\n3.9\n(4.0)\n0.5\n(5.5)\nLiquidity\n(2.3)\n0.2\n(11.5)\n(3.1)\n(6.9)\n(13.6)\n(24.2)\nTotal net client cash flows\n(0.1)\n(2.0)\n(11.0)\n0.8\n(10.9)\n(13.1)\n(29.7)\nRealizations (1)\n(0.3)\n(0.5)\n(1.3)\n—\n—\n(2.2)\n—\nMarket performance and other (2)\n13.5\n13.5\n24.7\n17.1\n(2.3)\n51.8\n25.7\nImpact of foreign exchange\n(0.4)\n2.2\n0.7\n4.0\n(8.4)\n2.5\n(5.4)\nAcquisitions (disposition), net\n0.1\n—\n(0.3)\n(3.9)\n(0.9)\n(0.2)\n50.2\nEnd of period\n$ 767.2\n$ 754.4\n$ 741.2\n$ 728.4\n$ 710.4\n$ 767.2\n$ 710.4\n(1) Realizations represent investment manager-driven distributions primarily related to the sale of assets. Realizations are specific to our alternative managers and do not include client-driven distributions (e.g. client requested redemptions, liquidations or asset transfers). Realizations of $0.2 billion, $0.4 billion, $0.4 billion, and $0.3 billion were included in net client cash flows for the quarters ended March 31, 2017, December 31, 2016, September 30, 2016, and June 30, 2016, respectively.\n(2) For the quarter ended June 30, 2017, Other includes a reclass, effective April 1, 2017, of $16.0 billion of certain assets which were previously included in Assets Under Advisement to Assets Under Management, specifically retail separately managed account programs that operate and have fee rates comparable to programs managed on a fully discretionary basis. These Assets Under Advisement as of the quarters ended March 31, 2017, December 31, 2016, and September 30, 2016 were $16.0 billion, $13.7 billion, and $12.8 billion, respectively. The quarter ended September 30, 2017 includes a reclassification of $1.0 billion from long-term net client cash flows to Market performance and other related to this AUM. For the quarter ended June 30, 2017, Other also includes a $3.7 billion reconciliation to previously reported amounts.\n(3) Due to effects of rounding, the sum of the quarterly results may differ immaterially from the year-to-date results.\nUse of Supplemental Non-GAAP Financial Information\nAs supplemental information, we are providing a performance measure for \"Operating Margin, as Adjusted\" and a liquidity measure for \"Adjusted EBITDA\", each of which are based on methodologies other than generally accepted accounting principles (\"non-GAAP\"). Our management uses these measures as benchmarks in evaluating and comparing our period-to-period operating performance and liquidity.\nOperating Margin, as Adjusted\nWe calculate \"Operating Margin, as Adjusted,\" by dividing (i) Operating Income, adjusted to exclude the impact on compensation expense of gains or losses on investments made to fund deferred compensation plans, the impact on compensation expense of gains or losses on seed capital investments by our affiliates under revenue sharing agreements, amortization related to intangible assets, income (loss) of consolidated investment vehicles, the impact of fair value adjustments of contingent consideration liabilities, if any, and impairment charges by (ii) our operating revenues, adjusted to add back net investment advisory fees eliminated upon consolidation of investment vehicles, less distribution and servicing expenses which we use as an approximate measure of revenues that are passed through to third parties, and less performance fees that are passed through as compensation expenses or net income (loss) attributable to non-controlling interests, which we refer to as \"Operating Revenues, as Adjusted\". The deferred compensation items are removed from Operating Income in the calculation because they are offset by an equal amount in Non-operating income (expense), and thus have no impact on Net Income Attributable to Legg Mason, Inc. We adjust for the impact of amortization of management contract assets and the impact of fair value adjustments of contingent consideration liabilities, if any, which arise from acquisitions to reflect the fact that these items distort comparison of our operating results with results of other asset management firms that have not engaged in significant acquisitions. Impairment charges and income (loss) of consolidated investment vehicles are removed from Operating Income in the calculation because these items are not reflective of our core asset management operations. We use Operating Revenues, as Adjusted in the calculation to show the operating margin without distribution and servicing expenses, which we use to approximate our distribution revenues that are passed through to third parties as a direct cost of selling our products, although distribution and servicing expenses may include commissions paid in connection with the launching of closed-end funds for which there is no corresponding revenue in the period. We also use Operating Revenues, as Adjusted in the calculation to show the operating margin without performance fees, which are passed through as compensation expense or net income (loss) attributable to non-controlling interests per the terms of certain more recent acquisitions. Operating Revenues as adjusted also include our advisory revenues we receive from consolidated investment vehicles that are eliminated in consolidation under GAAP.\nWe believe that Operating Margin, as Adjusted, is a useful measure of our performance because it provides a measure of our core business activities. It excludes items that have no impact on Net Income Attributable to Legg Mason, Inc. and indicates what our operating margin would have been without the distribution revenues that are passed through to third parties as a direct cost of selling our products, performance fees that are passed through as compensation expense or net income (loss) attributable to non-controlling interests per the terms of certain more recent acquisitions, amortization related to intangible assets, changes in the fair value of contingent consideration liabilities, if any, impairment charges, and the impact of the consolidation of certain investment vehicles described above. The consolidation of these investment vehicles does not have an impact on Net Income Attributable to Legg Mason, Inc. This measure is provided in addition to our operating margin calculated under GAAP, but is not a substitute for calculations of margins under GAAP and may not be comparable to non-GAAP performance measures, including measures of adjusted margins of other companies.\nAdjusted EBITDA\nWe define Adjusted EBITDA as cash provided by (used in) operating activities plus (minus) interest expense, net of accretion and amortization of debt discounts and premiums, current income tax expense (benefit), the net change in assets and liabilities, net (income) loss attributable to noncontrolling interests, net gains (losses) and earnings on investments, net gains (losses) on consolidated investment vehicles, and other. The net change in assets and liabilities adjustment aligns with the Consolidated Statements of Cash Flows. Adjusted EBITDA is not reduced by equity-based compensation expense, including management equity plan non-cash issuance-related charges. Most management equity plan units may be put to or called by Legg Mason for cash payment, although their terms do not require this to occur.\nWe believe that this measure is useful to investors and us as it provides additional information with regard to our ability to meet working capital requirements, service our debt, and return capital to our shareholders. This measure is provided in addition to Cash provided by operating activities and may not be comparable to non-GAAP performance measures or liquidity measures of other companies, including their measures of EBITDA or Adjusted EBITDA. Further, this measure is not to be confused with Net Income, Cash provided by operating activities, or other measures of earnings or cash flows under GAAP, and are provided as a supplement to, and not in replacement of, GAAP measures.\nWe have previously disclosed Adjusted EBITDA that conformed to calculations required by our debt covenants, which adjusted for certain items that required cash settlement that are not part of the current definition.\nView original content: http://www.prnewswire.com/news-releases/legg-mason-reports-results-for-third-fiscal-quarter-300587815.html\nSOURCE Legg Mason, Inc.", "external_links": ["https://www.linkedin.com/company/5232/", "http://www.prnewswire.com/news-releases/legg-mason-reports-results-for-third-fiscal-quarter-300587815.html", "http://www.facebook.com/leggmason", "https://www.leggmason.com/en-us/about/newsroom.html", "http://www.twitter.com/leggmason", "http://www.leggmason.com/"], "published": "2018-01-25T00:15:00.000+02:00", "crawled": "2018-01-25T02:19:56.000+02:00", "highlightTitle": ""}