{"organizations": [], "uuid": "ebaaac9ded430227a7225418f688bb8e558d6fef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/04/15/100643169-gold-bars-pyramid-ap.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/25/gold-inches-up-after-dropping-from-1-12-year-highs.html", "country": "US", "domain_rank": 767, "title": "Gold inches up after dropping from 1-1/2 year highs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T05:44:00.000+02:00", "replies_count": 0, "uuid": "ebaaac9ded430227a7225418f688bb8e558d6fef"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/25/gold-inches-up-after-dropping-from-1-12-year-highs.html", "ord_in_thread": 0, "title": "Gold inches up after dropping from 1-1/2 year highs", "locations": [], "entities": {"persons": [{"name": "mario draghi", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Gold rose on Friday, climbing back towards the previous session's 17-month peak as suggestions that senior U.S. officials may support a weaker dollar knocked the currency lower.\nThe dollar slid 0.4 percent against the euro on Friday as comments in favor of a weaker U.S currency by Treasury Secretary Steven Mnuchin — though later somewhat contradicted by U.S. President Donald Trump — led investors to suspect a protracted decline in the greenback may be likely.\nSpot gold was 0.39 percent higher at $1,352.91 an ounce at 1 p.m. EST, up 1.5 percent so far this week. The metal hit its highest since August 2016 on Thursday at $1,366.07. U.S. gold futures for February delivery were down 0.81 percent at $1,351.10 an ounce.\n\"Once again it's all about the dollar,\" Mitsubishi analyst Jonathan Butler said. \"Gold is now pushing against the highs of mid-2016 and threatening to break out to levels not seen since 2013, but it is looking overstretched on several technical indicators and there will probably be a degree of short-term profit taking.\"\n\"However our medium-term outlook remains constructive on gold and we could well see gold at $1,400 this year if the dollar and real rate environment remains favorable.\"\nDollar weakness tends to benefit assets priced in the U.S. unit, which become more affordable for holders of other currencies, while ultra-low interest rates cut the opportunity cost of holding non-yielding bullion.\nWorld stocks were set for their tenth straight week of gains on Friday, having rallied over the past year on the back of a synchronized uptick in global economic growth in a boon to corporate profits and stock valuations. Gold could benefit if that scorching run cools, GFMS analysts at Thomson Reuters said, predicting volatility in equities and concerns over global politics could lead to a spike in gold prices above $1,500 an ounce this year.\nIt was this week's best performing precious metal, climbing 2.4 percent from Friday's close.\n\"The U.S. dollar remains in the driving seat of the metal markets, causing a lot of volatility for silver,\" Julius Baer said in a note. \"We remain neutral but lift our twelve-month price target to $17.50 per ounce due to signs of improving industrial demand.\"\nAmong other precious metals, silver was up 0.66 percent at $17.41, having touched its highest in more than four months at $17.69 on Thursday. Platinum was up 0.28 percent at $1,013.30, while palladium fell 0.93 percent at $1,086. After hitting record highs early this year, the metal was on track for its second weekly loss, dropping nearly 1 percent so far this week.", "external_links": [], "published": "2018-01-26T05:44:00.000+02:00", "crawled": "2018-01-26T05:19:28.000+02:00", "highlightTitle": ""}