{"organizations": [], "uuid": "f0085c68f062c8800719ba151908324e440cc287", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/business-wire-aurora-diagnostics-completed-five-acquisitions-important-refinancing-in-2017.html", "country": "US", "domain_rank": 767, "title": "Aurora Diagnostics Completed Five Acquisitions, Important Refinancing in 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T17:45:00.000+02:00", "replies_count": 0, "uuid": "f0085c68f062c8800719ba151908324e440cc287"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/business-wire-aurora-diagnostics-completed-five-acquisitions-important-refinancing-in-2017.html", "ord_in_thread": 0, "title": "Aurora Diagnostics Completed Five Acquisitions, Important Refinancing in 2017", "locations": [], "entities": {"persons": [{"name": "daniel d. crowley", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "warwick", "sentiment": "none"}, {"name": "n.j.", "sentiment": "none"}, {"name": "alabaster", "sentiment": "none"}, {"name": "gaithersburg", "sentiment": "none"}, {"name": "r.i.", "sentiment": "none"}, {"name": "princeton", "sentiment": "none"}, {"name": "md.", "sentiment": "none"}, {"name": "plainsboro township", "sentiment": "none"}, {"name": "ala.", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}], "organizations": [{"name": "aurora diagnostics", "sentiment": "negative"}, {"name": "aurora diagnostics completed five acquisitions", "sentiment": "negative"}, {"name": "cbm pathology", "sentiment": "none"}, {"name": "university pathologists", "sentiment": "none"}, {"name": "pathology associates", "sentiment": "none"}, {"name": "cleveland skin pathology laboratory, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PALM BEACH GARDENS, Fla.--(BUSINESS WIRE)-- Aurora Diagnostics , the nation’s largest independent integrated anatomic pathology and oncology diagnostics practice, is celebrating 2017 achievements that include five acquisitions of high quality pathology practices and an important refinancing.\nThe acquisitions of University Pathologists in Warwick, R.I.; Pathology Associates of Princeton in Plainsboro Township, N.J.; Cleveland Skin Pathology Laboratory, Inc. in Cleveland, Ohio; CytoPath in Alabaster, Ala.; and CBM Pathology in Gaithersburg, Md., brought to 31 the number of affiliated local pathology practices in 19 states. The company also supports nearly 200 community hospitals and surgery centers around the country with pathology lab management and medical directorship services.\nThe refinancing, completed in May, exchanged senior notes that had been due in 2018 for a combination of new senior notes due in 2020 and warrants.\n“Aurora Diagnostics continues to seek opportunities for growth as we look to 2018,” said Daniel D. Crowley, Chairman, CEO and President of Aurora Diagnostics. “We have an outstanding platform to support community-based anatomic pathology practices. Our IT, sales, billing, procurement, human resources, payor contracting, lab management, and compliance infrastructure allows pathologists to focus on high quality diagnostic work and collaboration with the physicians who rely on them. The result is a professionally managed organization with national scale that values, preserves, and enables great cancer diagnostics and treatment in local communities across the country.”\nThe Company’s Aurora Research Institute (ARI), which provides cancer researchers access to a national human biospecimen network and offers clinical trial research services, continued to develop important relationships and new opportunities in 2017. Recently, ARI executed agreements with a major cancer center and two large GI clinics to offer patients an opportunity to participate in pre-clinical research trials. In December, ARI executed a master service agreement with an industry-leading diagnostic manufacturer to partner in new assay development. In addition, ARI won various RFPs in 2017 to provide clinical trial services and pre-clinical study support at its newly opened research laboratory in Las Vegas. It was a year of solid growth for ARI thanks to the excellent work of the ARI pathology team and ARI’s staff of clinical research coordinators.\nAbout Aurora Diagnostics\nAurora Diagnostics is the nation’s largest independent integrated oncology diagnostics company in the U.S. Its 31 community-based practices, with more than 190 board-certified pathologists, offer integrated diagnostic and personalized medicine consultations to thousands of physicians.\nReferring physicians include dermatologists, obstetricians and gynecologists, family practitioners, gastroenterologists, urologists, general surgeons, and oncologists. Aurora pathologists provide diagnostic opinions and work collaboratively with them to determine appropriate patient treatment options.\nAurora Diagnostics is also a leader in hospital lab management services, supporting nearly 200 hospitals and surgery centers throughout the country.\nAdditionally, the Company's Aurora Research Institute subsidiary is a leader in helping hospitals and independent labs ethically provide tissue and blood samples to researchers on the cutting edge of research for effective cancer treatments.\nFor additional information regarding Aurora Diagnostics and the services it provides, please visit the company website at www.auroradx.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180102005200/en/\nHalldin PR\nBill Halldin, 916-781-0657\nbill@halldinpr.com\nSource: Aurora Diagnostics", "external_links": ["http://www.businesswire.com/news/home/20180102005200/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.auroradx.com&esheet=51736281&newsitemid=20180102005200&lan=en-US&anchor=www.auroradx.com&index=2&md5=16eeaeac78c08397bb2953fd31840016", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.auroradx.com&esheet=51736281&newsitemid=20180102005200&lan=en-US&anchor=Aurora+Diagnostics&index=1&md5=a180a93bca8e851282edfa67284b8d2a"], "published": "2018-01-02T17:45:00.000+02:00", "crawled": "2018-01-02T19:21:54.029+02:00", "highlightTitle": ""}