{"organizations": [], "uuid": "ba9ae1923b603f7b34c9bb0e2b7b507055ff59bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/10/104890072-GettyImages-887657576.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/cryptocurrency-sell-off-tether-faring-better-than-rest.html", "country": "US", "domain_rank": 767, "title": "Cryptocurrency sell-off: Tether faring better than rest", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.155, "site_type": "news", "published": "2018-01-17T04:07:00.000+02:00", "replies_count": 0, "uuid": "ba9ae1923b603f7b34c9bb0e2b7b507055ff59bc"}, "author": "Saheli Roy Choudhury", "url": "https://www.cnbc.com/2018/01/16/cryptocurrency-sell-off-tether-faring-better-than-rest.html", "ord_in_thread": 0, "title": "Cryptocurrency sell-off: Tether faring better than rest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "coinmarketcap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Most major digital currencies suffered massive drops over the last 24 hours, but one token actually appeared to have posted gains.\nIt's called tether, and the digital asset aims to link the cryptocurrency environment to the fiat world by tying each token to government-backed currency. One tether token is meant to equal $1, but price-checking website CoinMarketCap shows the price varying by a few cents over time.\nIn fact, even though the cryptocurrency isn't designed to go up against the dollar, it's actually the only one of the top 50 digital currencies listed by market value on CoinMarketCap to see gains over the last day.\nThe digital currency traded at $1.04 at 10:05 a.m. HK/SIN, according to CoinMarketCap data, and was up 3.23 percent from a day ago. It had a market cap of $1.69 billion.\nshow chapters Bitcoin’s origin story remains shrouded in mystery. Here's why it matters 6:30 PM ET Fri, 27 Oct 2017 | 06:23 On the other hand, the site showed that major cryptocurrencies like bitcoin , ethereum and ripple were down 15, 16 and 24 percent over the same period, respectively.\nLast year, tether was reportedly hacked and nearly $31 million worth of its tokens were stolen.\nOn its website , tether claims that its tokens are fully backed by fiat currency assets that the company holds in its reserve account. That, the firm says, prevents the volatility usually seen in cryptocurrencies.\nIn fact, tether's built-in lack of volatility against the dollar is likely the reason for its small price increase during the broad cryptocurrency sell-off. Still, as a means of payment built on blockchain technology, it fits the definition of a cryptocurrency.\nBut tether has seen a fair amount of public criticism, which has included claims that the tokens are not meaningfully backed by U.S. dollars and has also touched on its apparent connection to the British Virgin Islands — which was demonstrated in leaked documents known as the Paradise Papers.\nWATCH: Bitcoin could be the biggest bubble in history – here's how show chapters Bitcoin could be the biggest bubble in history – here's how 8 Hours Ago | 02:00", "external_links": [], "published": "2018-01-17T04:07:00.000+02:00", "crawled": "2018-01-17T04:10:27.019+02:00", "highlightTitle": ""}