{"organizations": [], "uuid": "f235f672a4e3b041d967c935c125f51fcdbd3bc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-tricorbraun-acquires-leading-healthcare-packaging-company.html", "country": "US", "domain_rank": 767, "title": "TricorBraun Acquires Leading Healthcare Packaging Company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.91, "site_type": "news", "published": "2018-01-03T20:00:00.000+02:00", "replies_count": 0, "uuid": "f235f672a4e3b041d967c935c125f51fcdbd3bc7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-tricorbraun-acquires-leading-healthcare-packaging-company.html", "ord_in_thread": 0, "title": "TricorBraun Acquires Leading Healthcare Packaging Company", "locations": [], "entities": {"persons": [{"name": "keith strope", "sentiment": "none"}, {"name": "drew weidhorn", "sentiment": "none"}, {"name": "phil padgett", "sentiment": "none"}], "locations": [{"name": "st. louis", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "bayport", "sentiment": "none"}], "organizations": [{"name": "tricorbraun acquires leading healthcare packaging company", "sentiment": "negative"}, {"name": "tricorbraun inc.", "sentiment": "negative"}, {"name": "package all corp.", "sentiment": "none"}, {"name": "tricorbraun", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ST. LOUIS, Jan. 3, 2018 /PRNewswire/ -- TricorBraun Inc., a leading packaging solutions company, has acquired Package All Corp. ( packageall.com ), a 33-year-old healthcare-focused packaging distributor headquartered in Bayport, New York. As a result of this transaction, Package All has become a wholly-owned subsidiary of TricorBraun but will continue to be led by its current executive team.\n\"Package All has significant expertise in rigid packaging for the healthcare industry,\" said Keith Strope, Executive Chairman of TricorBraun. \"We are excited about the opportunities this acquisition creates to provide customers of both companies with expanded services.\"\nPackage All is a leading stocking distributor to the over-the-counter (OTC) generic pharmaceutical and nutraceutical industries, also providing packaging to several other industries, including personal care and beauty, sports and fitness, food and beverage, and household and industrial.\n\"There is strong equity in the Package All name and business model, created by founder Drew Weidhorn and by Phil Padgett as President and CEO, and we will continue using both,\" said Strope. \"We want to capitalize on the strong legacy built by Drew and Phil.\"\n\"The acquisition will be seamless,\" said Court Carruthers, President and CEO of TricorBraun. \"Everything will be business as usual, with new momentum. We want to leverage Package All's business model and grow with it. Package All's seven locations and more than 350,000 square feet of warehouse space will expand TricorBraun's overall offering.\"\nPhil Padgett said, \"We are extremely proud of the company we and our teammates have built together. Partnering with TricorBraun is an exciting next step in our successful history of growth. It will provide Package All and our customers immediate access to new products, a larger supply chain, and expanded services, such as design and engineering.\"\n\"We are highly focused on the further expansion of products and services for our customers,\" said Carruthers. \"Package All is a great company and we're proud to welcome Phil Padgett, his executive team and every Package All team member to the TricorBraun family.\"\nAbout Package All\nPackage All is an NFS, cGMP Certified stocking distributor headquartered in Bayport, NY. Founded in 1984, Package All has distribution centers on the East and West Coasts, with more than 350,000 square feet of storage space. The company is a leading stocking distributor to the over-the-counter (OTC) generic pharmaceutical and nutraceutical industries, also providing packaging to a number of other industries, including personal care and beauty, sports and fitness, food and beverage, and household and industrial. Package All's state-of-the-art warehouses feature live inventory systems (WMS), computerized electronic wire guidance for narrow aisle picking and scan guns (for speed and accuracy).\nAbout TricorBraun\nTricorBraun ( www.tricorbraun.com ) is a packaging solutions company, focused on providing innovative, custom solutions for its many customers. An industry leader in glass and plastic containers, closures, dispensers and tubes, TricorBraun operates from more than 40 locations throughout North America and internationally from London, England; Guangzhou, China; Hong Kong, and Mumbai, India. Our award-winning Design & Engineering Center provides forward-thinking service driven by consumer insight, market understanding and creative solutions. TricorBraun's advisory services range from preliminary planning and manufacturing oversight to warehousing and logistics programs.\nView original content with multimedia: http://www.prnewswire.com/news-releases/tricorbraun-acquires-leading-healthcare-packaging-company-300576947.html\nSOURCE TricorBraun", "external_links": ["http://packageall.com/", "http://www.tricorbraun.com/", "http://www.prnewswire.com/news-releases/tricorbraun-acquires-leading-healthcare-packaging-company-300576947.html"], "published": "2018-01-03T20:00:00.000+02:00", "crawled": "2018-01-03T22:58:01.000+02:00", "highlightTitle": ""}