{"organizations": [], "uuid": "a7f702f4fc5260637c119bf559392d499e0fc1b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 10}, "facebook": {"likes": 59, "shares": 59, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/will-govenment-shutdown-what-happens.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/19/government-shutdown-2018-what-happens/", "country": "US", "domain_rank": 1196, "title": "How Will a Government Shutdown Impact the U.S. Economy? | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.633, "site_type": "news", "published": "2018-01-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "a7f702f4fc5260637c119bf559392d499e0fc1b2"}, "author": "Lucinda Shen", "url": "http://fortune.com/2018/01/19/government-shutdown-2018-what-happens/", "ord_in_thread": 0, "title": "How Will a Government Shutdown Impact the U.S. Economy? | Fortune", "locations": [], "entities": {"persons": [{"name": "lucinda shen", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "negative"}, {"name": "office of management and budget", "sentiment": "none"}, {"name": "internal revenue service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Lucinda Shen January 19, 2018 \nIt’s the question of the day: Will Congress pass the short-term spending bill by its midnight Friday deadline, or will the federal government temporarily shutdown? \nNo one can say for sure—analysts say the chance of a shutdown ranges anywhere from 20 to 65%. \nBut it may be easier to gauge what might happen should a shutdown occur. Analysts need only look back to the October 2013 event for clues of what may unfold. \nFor starters, during a government shutdown, federal employees in the executive, legislative, and judicial branches are potentially eligible for unpaid leave, leaving some “essential” workers still in the system. Social security checks, for example, are expected to remain unaffected. \nThe approximately two-week shutdown in 2013 did, however, leave a modest mark on the U.S. economy, with GDP down slightly during that quarter as a result of unpaid workers spending less. Also, some $4 billion in tax refunds were delayed as a result of furloughed workers in the Internal Revenue Service, with the Office of Management and Budget saying the shutdown cost taxpayers some $2 billion in lost productivity. National parks alone lost some $500 million in revenue, as they, too, shut their gates during the 16-day shutdown. \nThe shutdown also impacted drug companies with the Food and Drug Administration delaying approval of medical devices and drugs. Investors also lost out on their regular doses of economic data which are often used to buy stocks or price goods. During the shutdown, federal agencies did not report the jobs numbers or consumer price index, among other data sets. \nNotably, following the 2013 shutdown, the government passed a bill to retroactively pay its workers for the time lost. \nFast forward to this year, and another potential shutdown may be hours away. Here’s what analysts have to say regarding the current situation: \nEvercore ISI analyst Dennis DeBusschere noted that while global stocks are trending higher, the threat of a shutdown is weighing on the U.S. dollar: \nGlobal equity markets are higher this morning despite rising concerns of a U.S. government shutdown that is weighing further on the dollar. WTI and Brent are lower after the EIA said the see non-OPEC supply gains growing in response to higher oil prices. PPI data released across Europe were better than expected, suggesting inflationary pressures, while still modest, are continuing to increase. That should continue to push bond yields higher and encourage central bankers to move toward normalizing still extremely accommodative monetary policy. Along those lines, the BoJ reiterated that they are confident inflation will move higher, even as they remain hesitant to tighten too quickly. \nIn the U.S, the Dow Jones Industrial Average is trading largely flat, while the S&P 500 nudged up 0.22%. \nA shutdown could also have longer-term negative effects on the U.S. economy. Height Analytics’ Stefanie Miller, who sees a 65% chance of Congress entering such a state again, pointed to the last shutdown in 2013 in which many furloughed federal employees stopped spending. \nA multi-week government shutdown would likely be meaningful and is a real possibility given the fact that some members of Congress who previously supported the December 21 continuing resolution (CR) are now resisting the idea of another short-term CR and are instead demanding a finalized FY 2018 budget deal before they’ll vote for a spending package. As we’ve written previously, that package will be difficult to deliver in less than a week. During the last multi-week shutdown in October 2013, annualized GDP growth for the quarter fell by 0.25%. Additionally, private sector jobs decreased by 120,000 during the two-week shutdown. Shopping by some 800,000 furloughed federal employees fell by 7%. As income of furloughed workers shifted to later in the month, consumption habits shifted as well (including on gasoline) and bill payments were delayed. \nIndeed, when tallying up the impact of the 2013 shutdown, President Barack Obama’s administration noted those same figures, adding that it may even be worse than estimated . \nGoldman Sachs analyst Alec Phillips said he anticipates a 35% chance of a shutdown—though he believes a short-term extension is more likely. \nA shutdown would have a modest economic impact, provided it does not last very long. We estimate that each week of shutdown would reduce real GDP growth in Q1 by 0.2 [percentage points, quarter over quarter] annualized. The effects would be reversed the next quarter, however. Shutdowns have also tended to have modest effects on financial markets. Most of the notable shutdowns over the last few decades coincided with debt limit deadlines. Even so, those led to only modest and temporary declines in equities and even smaller effects in Treasury yields and the dollar. With the debt limit deadline farther away, we would expect a muted initial reaction in financial markets to a shutdown. \nHorizon’s Chief Global Strategist Greg Valliere, meanwhile, noted that the real stakes lie in the politics in Washington, D.C. \nThus we may be in for a long shutdown: It’s possible that Congress could pass an emergency extension before midnight tonight, but both sides are hopelessly divided—and there’s no coherent leadership from the White House—so any last-minute reprieve would be exceedingly temporary. Both sides have already moved on to the blame game. \nAs we wrote yesterday, a relatively brief shutdown will have a modest impact on the economy. The real stakes, at least initially, are political—who gets the upper hand as the spin battle begins ahead of the fall elections. Both parties can’t wait to blame each other; this is how Washington thinks. \nHe also noted that much of the government will continue operating despite the shutdown: \nMuch would be exempted: Social Security checks wouldn’t be affected. Air traffic controllers and TSA screeners would continue to work. FEMA would react to natural disasters. The Centers for Disease Control would stay open. Federal prisons and VA hospitals would not be affected. The Postal Service would deliver the mail. Military readiness would not be affected. And Robert Mueller’s probe would continue. This is just a partial list. \nAll eyes are on the Senate to see what will transpire, now that the House has already passed a short-term spending bill. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-19T02:00:00.000+02:00", "crawled": "2018-01-20T17:41:39.020+02:00", "highlightTitle": ""}