{"organizations": [], "uuid": "cf072b813ecdb5fa01afd853e3dce3c615b84b77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-biobeats-appoints-iain-martin-as-ceo.html", "country": "US", "domain_rank": 767, "title": "BioBeats Appoints Iain Martin as CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T17:26:00.000+02:00", "replies_count": 0, "uuid": "cf072b813ecdb5fa01afd853e3dce3c615b84b77"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-biobeats-appoints-iain-martin-as-ceo.html", "ord_in_thread": 0, "title": "BioBeats Appoints Iain Martin as CEO", "locations": [], "entities": {"persons": [{"name": "iain martin", "sentiment": "negative"}, {"name": "david plans", "sentiment": "none"}, {"name": "iain", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "biobeats", "sentiment": "none"}, {"name": "axa", "sentiment": "none"}, {"name": "bnp paribas", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Former Moonpig MD joins revolutionary digital health start-up to spearhead global expansion Move highlights BioBeats’ intention to extend its leadership position in the wellbeing and digital health markets\nLONDON--(BUSINESS WIRE)-- BioBeats , the leader in digital health and artificial intelligence today announced it has appointed Iain Martin as Chief Executive Officer. Iain will succeed Dr. David Plans, Co-Founder and Chief Science Officer, who has successfully led the development of BioBeats transformational digital health app, Hear and Now , as well as being instrumental in closing five funding rounds and building solid commercial partnerships with the likes of global insurance and financial powerhouses AXA and BNP Paribas.\nSince being founded in 2013, BioBeats has developed revolutionary artificial intelligence (AI) algorithms and software. Its world-class team of scientists and designers includes renowned experts in AI, machine learning, wearables, cloud solutions and theoretical computer science. BioBeats solutions, based on years of research, provide insights into individual health and wellbeing by tracking data from wearable and smartphone sensors. Biometric and psychometric feedback are combined with unique machine learning algorithms to deliver personalized stress and productivity management tools based on clinically proven coaching techniques.\nBioBeats software identifies stress patterns using existing sensors in smartphones and wearable devices such as the Apple Watch, Garmin, Mio, FitBit and Microsoft Band, as well as devices by Huawei and LG through BioBeats’ collaboration with Google – allowing users to understand how their body and mind respond to stress and how it affects them in their work and personal life.\n\"I am thrilled to be here and excited about the possibilities,\" said Iain Martin. \"BioBeats, with its stand-out innovations in the digital health space, is poised to become a leader in this market. We are currently building computational models which are focused on discovering how stress affects people's wellbeing. Critically, these innovations will help users track and improve their overall wellbeing through the continuous monitoring of physical and mental stress in real-time. Our ultimate goal is to help users avoid chronic conditions that arise from unmanaged stress, such as heart disease. The world of digital health, and to an even further extent, the mindfulness and wellbeing industries, are in the midst of a step change that will profoundly shift how we address the chronic nature of stress - and I am proud to work with BioBeats as the pioneers in this effort.”\nIain has a wealth of experience gathered from more than 20 years’ in senior commercial, marketing, operational and technical roles. He is currently Chairman of My1stYears.com , an online retailer of personalized baby and toddler products.\nBefore joining BioBeats, Martin was Managing Director of Moonpig for nearly a decade. Iain joined Moonpig in January of 2006 as Commercial Director, and after successfully developing the first Moonpig TV adverts he took over as Managing Director in January of 2007. After an extended period of rapid expansion, Photobox Holdco bought Moonpig in 2011.\nPrior to Moonpig, Iain worked in across the Technology and Retail sectors where he led creative and technical teams at leading companies such as Hallmark, Marks & Spencer and Tigerprint.\nDavid Plans, Co-Founder of BioBeats, stated; “We are delighted to welcome Iain on board as we expand our commercial team and continue the laser-focused development of our digital health innovations. Iain’s experience will be invaluable in helping us move forward and evolve as an organization.”\n-Ends-\nTweet this! @joinBioBeats hires new CEO @iainmartin to spearhead growth and global expansion #digitalhealth #stressmanagement #medtech #Wellbeing http://bit.ly/2BwKqmE\nSupporting Resources\nBioBeats Website Latest BioBeats News Join us on Twitter Join us on LinkedIn Follow us on Instagram Follow us on Facebook Follow us on Youtube\n-Editor Notes-\nAbout BioBeats\nBioBeats is a digital health and artificial intelligence company that specialises in creating easy-to-use corporate and personal wellness solutions. Its world-class team of scientists and designers includes renowned experts in AI, machine learning, wearables, cloud solutions and theoretical computer science. BioBeats solutions, based on years of research, provide insights into individual health and wellbeing by tracking data from wearable and smartphone sensors. Biometric and psychometric feedback are combined with unique machine learning algorithms to deliver personalized stress and productivity management tools based on clinically proven coaching techniques.\nFollowing the launch of its consumer-facing app Hear and Now (recently featured in Apple App Store’s Best New Apps, April 2016), the team now provides tools to foster wellness at scale, with bespoke corporate versions in active deployment. The company's corporate offering provides solutions to help employees privately control their own wellness through the use of wearables and data-driven coaching.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180109006127/en/\nBioBeats\nName: Courtney\nEmail: PR@biobeats.com\nTelephone: 07867488769\nSource: BioBeats", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fbit.ly%2F2BwKqmE&esheet=51740286&newsitemid=20180109006127&lan=en-US&anchor=http%3A%2F%2Fbit.ly%2F2BwKqmE&index=4&md5=a5cce934fbce9e4712fcbbff46228ff7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fbiobeats.com%2Fhearandnow%2F&esheet=51740286&newsitemid=20180109006127&lan=en-US&anchor=Hear+and+Now&index=2&md5=2f6cd59086c7f1a7c131b19f029e0ae3", "http://www.businesswire.com/news/home/20180109006127/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fbiobeats.com&esheet=51740286&newsitemid=20180109006127&lan=en-US&anchor=BioBeats+Website&index=5&md5=fc2f73420766aa89623632f57c0232e4", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.facebook.com%2FBioBeats%2F&esheet=51740286&newsitemid=20180109006127&lan=en-US&anchor=Follow+us+on+Facebook&index=10&md5=19148313bb2d33ac16b841cbf1df5be8", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fyoutu.be%2FtcfAxuBn6fg&esheet=51740286&newsitemid=20180109006127&lan=en-US&anchor=Follow+us+on+Youtube&index=11&md5=7ac8d00404fe0b9bc11f420b6f8972d9", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fbiobeats&esheet=51740286&newsitemid=20180109006127&lan=en-US&anchor=Join+us+on+LinkedIn&index=8&md5=d49d532b36423a063b2c80f5f252d5f7", "http://bit.ly/2BwKqmE", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fbiobeats.com%2Fpress%2F&esheet=51740286&newsitemid=20180109006127&lan=en-US&anchor=Latest+BioBeats+News&index=6&md5=c06de48ba238427429950270277537bc", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fbiobeats.com&esheet=51740286&newsitemid=20180109006127&lan=en-US&anchor=BioBeats&index=3&md5=b5fbd1bad0483c972c2b3276057519d0", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.instagram.com%2Fgethearandnow%2F&esheet=51740286&newsitemid=20180109006127&lan=en-US&anchor=Follow+us+on+Instagram&index=9&md5=fbfd9822c7c7cc250346765099c2165c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fbiobeats.com&esheet=51740286&newsitemid=20180109006127&lan=en-US&anchor=About+BioBeats&index=12&md5=b565a8768cbaabf111b2745c0b6189f9", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2FjoinBioBeats&esheet=51740286&newsitemid=20180109006127&lan=en-US&anchor=Join+us+on+Twitter&index=7&md5=d01e8289c6ae902525308c31bf01dc7c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fbiobeats.com&esheet=51740286&newsitemid=20180109006127&lan=en-US&anchor=BioBeats&index=1&md5=9f5ff1c60ad87346ca04dffd5e5c17d4"], "published": "2018-01-09T17:26:00.000+02:00", "crawled": "2018-01-09T19:07:25.003+02:00", "highlightTitle": ""}