{"organizations": [], "uuid": "87cc72c65f65bc393e094bf846525c41a8ad8cda", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/usa-food-environment/do-good-meat-are-investors-only-after-their-pound-of-flesh-idUSL8N1PE4PP", "country": "US", "domain_rank": 408, "title": "Do-good meat: are investors only after their pound of flesh?", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T12:00:00.000+02:00", "replies_count": 0, "uuid": "87cc72c65f65bc393e094bf846525c41a8ad8cda"}, "author": "", "url": "https://www.reuters.com/article/usa-food-environment/do-good-meat-are-investors-only-after-their-pound-of-flesh-idUSL8N1PE4PP", "ord_in_thread": 0, "title": "Do-good meat: are investors only after their pound of flesh?", "locations": [], "entities": {"persons": [{"name": "leonardo dicaprio", "sentiment": "none"}, {"name": "mark", "sentiment": "none"}, {"name": "lee mannion", "sentiment": "none"}, {"name": "bill gates", "sentiment": "none"}, {"name": "richard branson", "sentiment": "none"}, {"name": "samir kaul", "sentiment": "none"}, {"name": "kaul", "sentiment": "none"}, {"name": "gates", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "microsoft", "sentiment": "none"}, {"name": "thomson reuters foundation", "sentiment": "none"}, {"name": "khosla ventures", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 10:01 AM / in 21 minutes Do-good meat: are investors only after their pound of flesh? Lee Mannion 6 Min Read \nLONDON, Jan 26 (Thomson Reuters Foundation) - What do Bill Gates, Richard Branson and Leonardo DiCaprio all have in common? \nAside from vast wealth and fame, all three are backing “alt- meat” - a fake meat they say has all the taste but none of the climate problems that come with traditional cattle farming. \n“If you’re able to create a product that tastes, smells, feels, looks and costs the same as ground beef, yet is made from plant-based materials, it’s a very large market,” said venture capitalist Samir Kaul. \nKaul is a partner at Khosla Ventures, which along with Microsoft founder Gates, has invested millions of dollars in Impossible Foods, which produces the Impossible Burger. \nImpossible because it is not meat, but part of a growing market in products that - unlike bean or Quorn burgers - simulate meat rather than just replace it with a veggie option. \nThe meat substitutes market will be worth nearly $6 billion by 2022, according to research firm Markets and Markets. \nBut industry analysts are cautious about the potential. \nThe United States is a nation of meat eaters - 98 per cent eat it at least once a week, according to Darren Seifer, a food consumption analyst for market research group NPD. \n“For success in the food industry you have to be patient. What we eat and drink is culturally based and very habitual. It might take as long as a decade to see if there is any moving the needle,” Seifer told the Thomson Reuters Foundation. FROM TEA TO FISH \nActor DiCaprio has previously invested in tea that provides an income to indigenous Amazonian families and in a farmed fish company, citing overfishing and collapsing marine ecosystems. \nGates also has previously invested with the environment in mind; he put money into Breakthrough Energy Ventures, a $1 billion-plus fund to finance emerging energy research to reduce global greenhouse gas emissions to near-zero. \nThere are a handful of international companies like Impossible producing meat that does not involve animals being killed, deforestation or significant production of greenhouse gases. Impossible says its burger creates 87 percent less greenhouse gas emissions than a meat equivalent. \nAbout 80 percent of all agricultural land is dedicated to grazing or growing feed for animals, the United Nations says. The livestock industry consumes 10 percent of the world’s fresh water, while generating methane and other planet-warming emissions, and causing large-scale deforestation. \nIn December, Beyond Meat, whose products look like meat but are made of plants, announced they had received investment of $55m from two investors with decidedly meaty credentials. \nTyson Foods, which produces a fifth of all animals eaten in the United States, was one; the other was Cleveland Avenue, a venture capital firm run by the former McDonalds Corp. CEO Don Thompson. \n“There are many issues that impact upon climate change, but few as negatively as livestock,” Richard Branson wrote in a blog post explaining why he had put his money into Memphis Meats, which is growing meat from animal cells in laboratories. \nIn the same blog, the Virgin boss revealed he had given up beef because of rainforest degradation. \nGates too has expressed concern for the environment in a blog post entitled: ‘Is there enough meat for everyone?’ \n“How can we make enough meat without destroying the planet?—one solution would be to ask the biggest carnivores (Americans and others) to cut back, by as much as half,” he wrote. MEATY INVESTMENT \nThe two biggest players that have gone to market in the United States - Beyond Meat and Impossible Foods - have now seen investment of more than $300 million. However, some people are not convinced the environment is their motivation. \n“Venture capitalists have pinpointed a growth area and the only thing they are looking for is a return,” Simeon Van der Molen of Moving Mountains, a plant-based burger company based in Britain, told the Thomson Reuters Foundation. \nA vegan who has sold eco-friendly cleaning products for 17 years, he will launch his own plant-based burger next month, effectively going into competition with the venture capitalists. \n“For me venture capitalists are only after their pound of flesh,” he said. He is aiming to keep the company independent. \nWhile motives might be questioned, there is no disagreement over the growing interest. \nMarket research company Mintel saw a 257 percent rise in new products labelled as vegan-friendly between 2011 and 2016. \nIn less than a year, the Impossible Burger (made of wheat, coconut and potato) has gone from being available in 11 restaurants to 500 in the United States. \nThat’s still a tiny fraction of the current market - 9 billion servings of burgers were ordered at restaurants and food outlets in 2014, according to U.S. market research group NPD. \nBeyond Meat, which makes chicken and sausages as well as burgers from pea protein, sells into 19,000 U.S. stores. \nVan der Molen says his target consumers will be flexitarians - people who eat meatless meals once a week or more. \n\"There are 500,000 vegans in the UK and 22 million flexitarians. What we want to do is get carnivores to make that conversion,\" Van der Molen said. (Reporting by Lee Mannion, editing by Lyndsay Griffiths. @leemannion; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org )", "external_links": [], "published": "2018-01-26T12:00:00.000+02:00", "crawled": "2018-01-26T12:18:05.010+02:00", "highlightTitle": ""}