{"organizations": [], "uuid": "6d76bc3cc25722ab3fe8ee491629ae2f59966939", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/images/at/1515983898353.jpg", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-wallace-euro-commentary/commentary-for-euro-reforms-growth-is-the-enemy-idUSKBN1F405V", "country": "US", "domain_rank": 408, "title": "Commentary: For euro reforms, growth is the enemy", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T10:24:00.000+02:00", "replies_count": 0, "uuid": "6d76bc3cc25722ab3fe8ee491629ae2f59966939"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-wallace-euro-commentary/commentary-for-euro-reforms-growth-is-the-enemy-idUSKBN1F405V", "ord_in_thread": 0, "title": "Commentary: For euro reforms, growth is the enemy", "locations": [], "entities": {"persons": [], "locations": [{"name": "europe", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Europe’s currency union - not so long ago on its sickbed - has started the year in rude health. The winning streak looks set to continue since economic confidence in the euro area is at its highest for almost two decades, but it will have an unwelcome side-effect. The more the euro zone economy thrives, the less pressure there will be on European politicians to take steps to prevent future crises.\nThe resurgence is welcome because it bolsters public support for the single currency. However, the boom fostered by the European Central Bank’s (ECB) easy money policies will tempt politicians to shun the hard decisions involved in deeper integration. Further reforms remain vital because the monetary union of 19 states lacks the same fiscal and political foundations that underpin a national currency. Instead there is a divide between northern economies that can cope with the rigor of a common currency and those in southern Europe that have found it hard going. The ECB has rescued the weaklings with its ultra-loose monetary policy, but that offers no more than temporary respite.\nA rare opportunity for pressing ahead with reforms appeared to open up last year when Emmanuel Macron prevailed over populist euro-skeptic forces in France. The new French president made clear he wanted to rev up the Franco-German engine for closer European integration, which had lapsed when the euro debt crisis was gravest between 2010 and 2012 and Germany took the lead owing to its stronger economy and sounder public finances. Specifically, Macron advocates a euro zone budget and finance minister, in effect the rudiments of a fiscal union to support the monetary union.\nJust as the reform locomotive was getting up steam in France, it ran into the political sidings in Germany. First, Angela Merkel’s governing CDU/CSU party bloc did much worse than expected in the German election in September, getting its lowest share of the vote since 1949. Then, the chancellor’s first attempt at creating a coalition government, with two ideologically opposed small parties, the pro-business FDP and the environmentalist Greens, collapsed in late November when the FDP abruptly broke off negotiations.\nFollowing the breakthrough in this month’s exploratory talks, a renewed coalition with the center-left SPD, with which Merkel has ruled Germany for eight of the past 12 years, now looks possible. But obstacles remain because any eventual formal agreement will have to be put to the SPD’s members, many of whom oppose a further partnership with Merkel since they believe it has undermined the party’s popular support. If they do not endorse a deal the chancellor faces an unpalatable choice between ruling as a minority government or another election, whose result might be as inconclusive as last year’s vote.\nEven if the strongly pro-European SPD does swallow its reservations and join a coalition government led by Merkel, the euro zone reform train Macron aimed to set rolling looks less likely to make progress than hoped. The German chancellor undoubtedly wants to engage with the French president, who saved Europe from a potentially shattering populist revolt following the Brexit vote. But her response is likely to be a more of a gesture than a genuine change of heart.\nAngela Merkel (CDU) addresses a media conference after exploratory talks about forming a new coalition government at the SPD headquarters in Berlin, Germany, January 12, 2018. REUTERS/Fabrizio Bensch Merkel after all devoted much time and effort during the crisis to minimizing calls on German taxpayers to support the monetary union, recognizing that this was essential if Germans were to continue backing the venture. She strongly opposed the idea of issuing eurobonds whose liabilities would be jointly shared across the monetary union, making this rejection one of her main campaign points in the 2013 federal election. German policymakers and advisers continue to argue that the euro area can work without a fiscal union. Tighter fiscal bonds would require in effect a political union as well, a project likely to fall foul of popular opposition in some countries to the necessary changes to the European treaties.\nAs a result any reforms that are made this year are likely to be more show than substance. The most likely of these will be a rebranding of the European Stability Mechanism (ESM), the euro zone’s bail-out fund created as a result of the crisis, as the European Monetary Fund. But Germany is likely to resist attempts to wrest away the effective national veto over the release of funds that it secured when the ESM was set up.\nIn fact, the most feasible reform that the euro area could make at this stage is to complete the banking union that it embarked upon at the height of the crisis, in mid-2012. This remains a work in progress. The most solid part of the construction is the creation of a single supervisor, a job given to the ECB. A new body has been created to tackle failing banks so that they can go under without causing disruption. But an essential component of a genuine banking union, a shared system of deposit insurance, remains on the drawing board.\nThe failure to introduce deposit insurance illustrates the obstacles to the reform locomotive. Northern countries fear that it is their depositors who will pick up the bill when less sturdy banks in southern Europe fail. Policymakers such as Jens Weidmann, head of the German Bundesbank, insist that there can be no shared insurance for banks weighed down by bad loans. However, efforts by the ECB to accelerate that weight loss have encountered fierce resistance in Italy, where bad loans are especially oversized. Italian policymakers for their part worry that a crackdown on bad loans could stifle a recovery that has only recently gathered momentum.\nYet if completing banking reform is hard, moving towards a fiscal union will be harder still. Just as Italian politicians are reluctant to grasp the nettle of bad loans, so German and Dutch politicians are loath to ask their citizens to make further potential fiscal sacrifices. That was difficult enough when the euro area appeared close to collapse. Now that all is apparently going well, it is even tougher.\nThis isn’t the first time the ECB may have won time for painful reforms only for politicians to waste it. During the first decade of the euro, which was launched in 1999, they did nothing to tackle the flaws in its design as a credit boom papered over the multiple defects. The harsh truth is that institution-building in Europe tends to occur when the continent is in crisis. Growth is the enemy rather than the friend of reform.\nAbout the Author Paul Wallace is a London-based writer. A former European economics editor of The Economist, he is author of “The Euro Experiment,” published by Cambridge University Press.\nThe views expressed in this article are not those of Reuters News.", "external_links": ["https://www.bundesbank.de/Redaktion/EN/Topics/2017/2017_11_20_weidmann_ebc.html", "https://ec.europa.eu/info/business-economy-euro/indicators-statistics/economic-databases/business-and-consumer-surveys/latest-business-and-consumer-surveys_en", "https://www.sachverstaendigenrat-wirtschaft.de/presse-jahresgutachten-2017-18.html?&L=", "http://www.elysee.fr/declarations/article/initiative-pour-l-europe-discours-d-emmanuel-macron-pour-une-europe-souveraine-unie-democratique/", "https://www.ecb.europa.eu/press/key/date/2017/html/ecb.sp171013_2.en.html", "http://www.consilium.europa.eu/en/press/press-releases/2017/12/15/remarks-by-president-donald-tusk-on-the-european-council-meetings-on-14-and-15-december-2017/", "http://www.dw.com/en/merkel-presents-election-platform/a-16901264"], "published": "2018-01-15T10:24:00.000+02:00", "crawled": "2018-01-15T07:03:09.000+02:00", "highlightTitle": ""}