{"organizations": [], "uuid": "dd6c5ed8cc6ea0f45b7fe611092bbf6e3148f5c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221088539&w=1200&r=LYNXMPEE0A0LK", "site_section": "https://www.reuters.com/finance/currencies", "section_title": "Currency Converter, Currencies News | Reuters.com", "url": "https://www.reuters.com/article/uk-britain-sterling/charts-point-to-more-pain-as-sterling-slips-idUSKBN1F011Q", "country": "US", "domain_rank": 408, "title": "Sterling slips against euro after ECB tapering signal", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-11T17:53:00.000+02:00", "replies_count": 0, "uuid": "dd6c5ed8cc6ea0f45b7fe611092bbf6e3148f5c0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-britain-sterling/charts-point-to-more-pain-as-sterling-slips-idUSKBN1F011Q", "ord_in_thread": 0, "title": "Sterling slips against euro after ECB tapering signal", "locations": [], "entities": {"persons": [{"name": "ranko berich", "sentiment": "none"}, {"name": "brexiteer nigel farage", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "monex europe", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "head of market analysis", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "former uk independence party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Sterling slipped to a one-week low against the euro on Thursday, as the single currency soared on talk that the European Central Bank could start to change its message of expansionary monetary policy in the coming months.\nAccording to the minutes of its latest meeting, the ECB should revisit its communication stance in early 2018, suggesting that policymakers could soon start preparing markets for the end of the bank’s massive stimulus scheme.\nThe euro jumped by more than a cent against the dollar, and surged as much as 0.7 percent on the day against the pound to reach 89.115 pence, its strongest against the British currency since Jan.\n“Today’s minutes are the clearest indication yet that governing council members are beginning to take note of the eurozone’s accelerating recovery,” said Ranko Berich, Head of Market Analysis at Monex Europe.\nAnalysts said the pound was also given some support by speculation that a second referendum on membership of the European Union could be held, after Former UK Independence Party leader and prominent Brexiteer Nigel Farage said he was warming to the idea of holding a second ballot.\nSterling was up a quarter of a percent against the dollar at $1.3539.\nOlivier Korber, a currency anaylst at Societe Generale in Paris, said a lot of bad news was priced into the pound and that its recovery in recent weeks - a 4.5 percent climb against the dollar - was mostly due to weakness in the U.S. currency.\nIf another referendum were held, therefore, or if the need for one became the consensus view, sterling would climb towards $1.40 or even higher than that.\n“The possibility of a second Brexit referendum or further BoE (Bank of England) tightening is definitely not priced by the FX market,” he said.\nEarlier, the pound had hit a two-week low of $1.3458.\n“Of all the currencies, the fundamentals are weakest for sterling,” said John Marley, head of FX strategy at currency risk-management firm Infinity International.\nEconomic data has weighed this week, with the British trade balance for November widening to its biggest in five months.\nNet long bets on sterling are near their highest levels in more than three years, according to data released by the U.S. Commodity Futures Trading Commission on Friday.\nReporting by Saikat Chatterjee and Jemima; Editing by David Goodman\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T17:53:00.000+02:00", "crawled": "2018-01-12T05:01:07.010+02:00", "highlightTitle": ""}