{"organizations": [], "uuid": "df2bfc75a8c1bb45bc3262a6d92f0698fbf2d4a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-russian-networks-pushing-conservative-meme-researchers-say.html", "country": "US", "domain_rank": 767, "title": "Russian networks pushing conservative meme, researchers say", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T03:25:00.000+02:00", "replies_count": 0, "uuid": "df2bfc75a8c1bb45bc3262a6d92f0698fbf2d4a3"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-russian-networks-pushing-conservative-meme-researchers-say.html", "ord_in_thread": 0, "title": "Russian networks pushing conservative meme, researchers say", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "bret schafer", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "hamilton 68", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "alliance for securing democracy", "sentiment": "none"}, {"name": "marshall fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — Twitter accounts linked to Russian influence operations are pushing a conservative meme related to the investigation of Russian election interference, researchers say.\nThe purported Russian activity involves the hashtag #ReleaseTheMemo, a reference to a secret congressional report about President Donald Trump's allegations that he was wiretapped by the Obama administration. A group that tracks Russian-linked social media influence campaigns says the volume of Russian-related #ReleaseTheMemo traffic represents the most coordinated such effort since their website launched in early August.\n\"I've never seen any single hashtag that has had this amount of activity behind it,\" said Bret Schafer, an analyst who helps runs the Hamilton 68 dashboard , a project with the Alliance for Securing Democracy at the German Marshall Fund. It tracks about 600 accounts that it says are tied to Russian-sponsored influence and disinformation campaigns; most of those accounts were promoting the same meme Friday.\nWHAT IS THE MEMO?\nThe underlying #ReleaseTheMemo drama started Thursday after Rep. Peter King, a New York Republican, revealed a brief report produced by Republican staff dealing with Trump's wiretapping allegations. The report stems from a lengthy investigation House Intelligence Chairman Devin Nunes conducted into the alleged surveillance of Trump transition aides and the revealing of names — or \"unmasking\" — of Trump aides in classified reports.\nRepublicans on the House Intelligence Committee voted on party lines — over Democratic member objections — early Thursday to make the brief, 3-page report available to members of Congress. But the same Republican members have said they cannot say what exactly the report shows because it is classified — and revealing classified information is a federal crime.\nCommittee officials who reviewed the documents said that they revolve around a dossier on Trump produced by former British intelligence officer Christopher Steele, and questions over whether it was used to obtain surveillance warrants. The report also relies on classified intelligence that is only available to a select group of lawmakers known as the \"Gang of Eight\" — a sign that some of the information is highly sensitive.\nThroughout the day Thursday and Friday, lawmakers walked in and out of a classified room in the Capitol to review the report — but never leaving with a copy because of the sensitive contents.\nWHERE DID THE MEME COME FROM?\nAs with previous spikes of coordinated activity tracked by the Hamilton 68 group — such as one surrounding the national anthem protest controversy at NFL games — it's hard to trace back to how it started, and how much the Russian-linked network might simply be mimicking a U.S. trend.\n\"My guess is this started organically,\" Schafer said. The website WikiLeaks was an early big promoter of #ReleaseTheMemo, and it received attention Thursday night from conservative personalities including the president's son, Donald Trump Jr., and Republican U.S. Rep. Steve King. It's possible that the Russian-affiliated accounts simple \"hopped on it, promoted it, amplified it,\" Schafer said.\nOn Friday, WikiLeaks founder Julian Assange blasted Hamilton 68 — where else? — on Twitter, calling its work \"propaganda\" and its methodology \"unfalsifiable\" and \"appalling.\"\nVEIL OF SECRECY\nRep. Raja Krishnamoorthi, an Illinois Democrat, said Friday that lawmakers had to sign a waiver produced by the House Intelligence Committee that barred them from obtaining copies of the report, taking notes about the report or discussing anything they read in the report. Krishnamoorthi said he did not know what the penalty was if anyone violated that waiver.\nHouse Russia investigation chairman Michael Conaway, a Texas Republican, said the intelligence committee could make this report available to the public directly. If the committee votes to \"override\" the classification of the material in the report, it would then move to the president, who would have five days to decide whether the classified material poses a national security risk. The full House could vote to override the president if he opted to keep the material secret.\nConaway said late Friday that he would like to make this report public, but declined to say if the intelligence committee would exercise its classification override powers.\nANOTHER TWITTER CLAMPDOWN\nMeanwhile, Twitter said in a blog post Friday that it would email nearly 678,000 people in the U.S. to notify them they had followed accounts linked to Russian propagandists or had retweeted or liked a tweet sent out by them around the 2016 election.\nIt also said it had found 1,062 new accounts associated with the Russian troll farm known as the Internet Research Agency. That brings the total to 3,814; Twitter has suspended those accounts.\nTwitter also identified another 13,500 automated accounts — for a total of 50,258 — that were linked to Russia and tweeting out election-related material. \"Any such activity represents a challenge to democratic societies everywhere, and we're committed to continuing to work on this important issue,\" the company said.\nSen. Mark Warner, the Democratic U.S. Senator from Virginia who's harshly criticized Twitter's lackluster investigation into Russian meddling, tweeted Friday that he was \"encouraged to see the company beginning to take responsibility\" in dealing with the issue.\nO'Brien reported from Providence, Rhode Island. AP technology writer Ryan Nakamura contributed to this report from San Francisco.", "external_links": [], "published": "2018-01-20T03:25:00.000+02:00", "crawled": "2018-01-20T19:01:19.011+02:00", "highlightTitle": ""}