{"organizations": [], "uuid": "2e09601c6f1671592bd684a70ac6de2b0765abfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/21/104911395-GettyImages-896135990-trump.1910x1000.jpg", "site_section": "http://www.newslookup.com/rss/newslookup-usnp.rss", "section_title": "US Newspapers: National", "url": "https://www.cnbc.com/2018/01/02/trump-tweet-says-he-has-bigger-nuclear-button-than-kim-jong-un.html", "country": "US", "domain_rank": 767, "title": "Trump says his 'Nuclear Button' is 'bigger' and more powerful than Kim Jong Un's", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T03:08:00.000+02:00", "replies_count": 0, "uuid": "2e09601c6f1671592bd684a70ac6de2b0765abfc"}, "author": "", "url": "https://www.cnbc.com/2018/01/02/trump-tweet-says-he-has-bigger-nuclear-button-than-kim-jong-un.html", "ord_in_thread": 0, "title": "Trump says his 'Nuclear Button' is 'bigger' and more powerful than Kim Jong Un's", "locations": [], "entities": {"persons": [{"name": "kim jong un", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "kim jong", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump said Tuesday that his \"Nuclear Button\" is \"much bigger & more powerful\" than the one controlled by North Korea's Kim Jong Un .\n\"Will someone from his depleted and food starved regime please inform him that I too have a Nuclear Button, but it is a much bigger & more powerful one than his, and my Button works!\" Trump tweeted.\nTrump tweet: North Korean Leader Kim Jong Un just stated that the \"Nuclear Button is on his desk at all times.\" Will someone from his depleted and food starved regime please inform him that I too have a Nuclear Button, but it is much bigger & more powerful one than his, and my Button works!\nThe threatening tweet followed a New Year's Day address from Kim, who said that North Korea's nuclear weapons can reach anywhere in the United States and threatened that he has a nuclear button on his desk.\nMuch of the world has been on edge as the two leaders have threatened one another's countries with nuclear weapons repeatedly over the last year. The United States and North Korea fought a war in the 1950s.\nOne strategist told CNBC on Tuesday that Trump actions against North Korea could result in a cold war between the U.S. and China.\nDavid Roche, president and global strategist at Independent Strategy, said such a turn of events between two economic and military powerhouses would have global implications for worldwide trade and investment.\nEarlier Tuesday, Trump said that sanctions on North Korea were \"beginning to have a big impact,\" following word of proposed talks between Pyongyang and Seoul about next month's Winter Olympics in South Korea.\nThe United States and its allies, including Japan and South Korea , have put increasing economic pressure on North Korea in an attempt to halt the reclusive regime's nuclear and missile development.\nExperts point out that the so-called \"Nuclear Button\" that Trump mentioned doesn't literally exist, though any U.S. nuclear actions would originate from the White House.\n— CNBC's Jacob Pramuk and Yen Nee Lee contributed to this report.\nWATCH: If President Trump were to order a nuclear strike, here's what would happen show chapters If President Trump were to order a nuclear strike, here’s what would happen 11:01 AM ET Wed, 11 Oct 2017 | 01:33", "external_links": [], "published": "2018-01-03T03:08:00.000+02:00", "crawled": "2018-01-03T03:37:36.007+02:00", "highlightTitle": ""}