{"organizations": [], "uuid": "9f426e069db6b2bbadc455c18c6b5348739b1296", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/business-wire-greenberg-traurig-to-move-center-of-new-york-operations-to-one-vanderbilt-as-early-momentum-builds-for-new-midtown-icon.html", "country": "US", "domain_rank": 767, "title": "Greenberg Traurig to Move Center of New York Operations to One Vanderbilt as Early Momentum Builds for New Midtown Icon", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-26T15:30:00.000+02:00", "replies_count": 0, "uuid": "9f426e069db6b2bbadc455c18c6b5348739b1296"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/business-wire-greenberg-traurig-to-move-center-of-new-york-operations-to-one-vanderbilt-as-early-momentum-builds-for-new-midtown-icon.html", "ord_in_thread": 0, "title": "Greenberg Traurig to Move Center of New York Operations to One Vanderbilt as Early Momentum Builds for New Midtown Icon", "locations": [], "entities": {"persons": [{"name": "greenberg traurig", "sentiment": "none"}, {"name": "greenberg traurig cou", "sentiment": "none"}, {"name": "daniel boulud", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "one vanderbilt avenue", "sentiment": "none"}, {"name": "one vanderbilt", "sentiment": "none"}], "organizations": [{"name": "greenberg traurig to move center of new york operations to one vanderbilt", "sentiment": "negative"}, {"name": "sl green realty corp.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "vanderbilt", "sentiment": "none"}, {"name": "greenberg traurig", "sentiment": "none"}, {"name": "sl green", "sentiment": "none"}, {"name": "td bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- SL Green Realty Corp. (NYSE:SLG), New York City’s largest commercial landlord, today announced that Greenberg Traurig, one of the world’s top law firms and the largest in the U.S., has signed a long-term lease to relocate the center of its New York operations to One Vanderbilt Avenue, the 1,401-foot skyline-shaping icon being constructed by SL Green at the doorstep to Grand Central Terminal.\nThe Greenberg Traurig lease signing comes on the heels of the recent announcement that German financial titans DZ and DVB Banks will take 35,000 square feet at One Vanderbilt, joining leading financial institution TD Bank and celebrated chef Daniel Boulud as tenants committing to the building more than two and a half years ahead of opening. Greenberg Traurig is signing a 15-year lease initially covering four contiguous floors. One Vanderbilt continues to attract companies demanding the most state-of-the-art product, further solidifying East Midtown’s status as the premier office destination in New York for leading companies from around the world.\n“Greenberg Traurig could have gone anywhere in New York and made a major statement by choosing to stay in East Midtown, reflecting the incredible demand we’re seeing for new construction in the most commuter-friendly location in the city,” said Marc Holliday, CEO of SL Green . “East Midtown is building on its historic status and convenience, with One Vanderbilt’s location, amenity and infrastructure proving to be a magnet for the most prestigious companies. We are thrilled to welcome Greenberg Traurig’s New York operations to the SL Green portfolio.”\n\"Greenberg Traurig has signed a lease to center its New York area operations at the extraordinary new project rising at One Vanderbilt,” said Richard A. Rosenbaum, Executive Chairman of Greenberg Traurig . “This will be a central part of our strategic plan to position our New York presence for a fast changing global marketplace. While our plans are in progress, we expect to use this opportunity to meet client needs by becoming substantially more efficient, provide for diverse needs and options, and by incorporating technological innovation, various means of delivering alternative services and more effective and diverse staffing and service management. Our firm will once again be a leader by utilizing both \"new law\" space planning in this state-of-the-art and perfectly located project in concert with a combination of alternative nearby locations to create an office campus which will collectively provide the most efficient and effective overall solution for our clients and talent alike. This is what the platform of the future will look like.\"\nOne Vanderbilt and its architecture firm, Kohn Pedersen Fox (KPF) Associates, were recognized earlier this month with the prestigious AIA NY Merit Award in Urban Design. One Vanderbilt construction is ahead of schedule for delivery in Q3 of 2020 as promised, with a Guaranteed Maximum Price contract secured, over 95% of the trades bought, and the pace of construction gaining steam. Since SL Green broke ground on the 1,401-foot building in 2016 the super structure has risen to seven stories tall and is expected to reach a height of 39 stories by the end of 2018. The completed building is expected to contain 25,000 tons of steel fabricated in the U.S.\nOne Vanderbilt will anchor the modernization of the Midtown business district, encompassing an entire city block, bounded by Madison and Vanderbilt Avenues to the west and east, and East 43rd and East 42nd Streets to the north and south. Expected to achieve both LEED Gold under version 4.0 and WELL certification, the trophy tower will feature floor-to-ceiling slab heights ranging from 14'6\" to 24', column-free floor plates, stunning 360-degree views through floor-to-ceiling windows and best-in-class infrastructure. It will provide tenants with a combination of amenities unrivaled in New York City, including a 30,000-square-foot tenant-only amenity floor with outdoor terrace. In partnership with Boulud, One Vanderbilt will offer a world-class 11,000 square-foot restaurant with private dining opportunities. Immediately adjacent to the city's most important transit hub, One Vanderbilt will provide direct connections to the Grand Central Terminal transit network and will invest $220 million in infrastructure upgrades to the system.\nBarry Gosin and Moshe Sukenik of Newmark Knight Frank represented Greenberg Traurig in the transaction.\nAbout SL Green Realty Corp.\nSL Green Realty Corp., an S&P 500 company and New York City's largest office landlord, is a fully integrated real estate investment trust, or REIT, that is focused primarily on acquiring, managing and maximizing value of Manhattan commercial properties. As of June 30, 2017, the Company held interests in 119 Manhattan buildings totaling 47.4 million square feet. This included ownership interests in 27.5 million square feet of Manhattan buildings and debt and preferred equity investments secured by 19.9 million square feet of buildings. In addition, the Company held ownership interests in 29 suburban buildings totaling 4.6 million square feet in Brooklyn, Long Island, Westchester County, Connecticut and New Jersey. To be added to the Company's distribution list or to obtain the latest news releases and other Company information, please visit our website at www.slgreen.com or contact Investor Relations at (212) 594-2700.\nAbout Greenberg Traurig\nGreenberg Traurig, LLP (GT) has more than 2,000 attorneys in 38 offices in the United States, Latin America, Europe, Asia and the Middle East. GT has been recognized for its philanthropic giving, was named the largest firm in the U.S. by Law360 in 2017, and is among the Top 20 on the 2017 Am Law Global 100.\nSLG - LEAS\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180126005142/en/\nSL Green Realty Corp.\nslgreen@berlinrosen.com\n646.452.5637\nSource: SL Green Realty Corp.", "external_links": ["http://www.businesswire.com/news/home/20180126005142/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.slgreen.com&esheet=51749236&newsitemid=20180126005142&lan=en-US&anchor=www.slgreen.com&index=1&md5=d77c9ac1f179658e3d719e7522b532a2"], "published": "2018-01-26T15:30:00.000+02:00", "crawled": "2018-01-26T17:57:56.001+02:00", "highlightTitle": ""}