{"organizations": [], "uuid": "90566c715822243a37c7c608973f726ed39b4980", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-sparefoot-kicks-off-10th-year-with-move-to-new-office.html", "country": "US", "domain_rank": 767, "title": "SpareFoot Kicks Off 10th Year with Move to New Office", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T15:30:00.000+02:00", "replies_count": 0, "uuid": "90566c715822243a37c7c608973f726ed39b4980"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-sparefoot-kicks-off-10th-year-with-move-to-new-office.html", "ord_in_thread": 0, "title": "SpareFoot Kicks Off 10th Year with Move to New Office", "locations": [], "entities": {"persons": [{"name": "chuck gordon", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "new office austin", "sentiment": "none"}, {"name": "perry brooks tower", "sentiment": "none"}, {"name": "university park", "sentiment": "none"}, {"name": "brazos", "sentiment": "none"}], "organizations": [{"name": "capital factory", "sentiment": "none"}, {"name": "university of texas", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas, Jan. 24, 2018 /PRNewswire/ -- SpareFoot, the world's largest marketplace for storage, moved its headquarters to University Park earlier this month. Founded in 2008, SpareFoot offers consumers the ability to compare self-storage, truck rental and moving services on SpareFoot.com and SelfStorage.com .\n\"The new headquarters building reflects the company culture of collaboration, creativity and collegiality as all 100 SpareFoot employees are now located on one floor,\" said co-founder and CEO Chuck Gordon. \"We've come a long way from our first offices inside Capital Factory, to the Perry Brooks Tower across the street at 720 Brazos, and now to our current space.\"\nLocated just north of downtown, University Park has on-site gym and yoga room; free covered parking and indoor bike storage; and is dog-friendly -- an absolute must for SpareFoot employees' \"SparePups.\"\nThe office features an open and bright layout with views of downtown and the University of Texas; a fully-outfitted on-site kitchen with in-house chef and culinary team; gaming area, and more. The layout includes multiple lounge areas for casual check-ins and co-working, as well as meeting rooms and a large event space.\nSpareFoot was one of just three percent of Austin companies designated as a Silver-Level Mother-Friendly Worksite in 2017 and the new space features a fully outfitted Mother's Room with comfortable space to pump milk, in-room fridge, and sink.\nIn 2017, employees formed The Diversity and Inclusion Task Force and the Women of SpareFoot. The company sent a large employee delegation to The Texas Conference for Women in 2016 and 2017 and was a sponsor of the Austin Pride Parade in 2017.\nThe company has participated in the Austin Startup Games since its inception and won overall gold four times, more than any other competitor. SpareFoot won a silver medal in the 2018 games, raising $10,000 for Breakthrough Central Texas . To date, SpareFoot has raised over $100,000 for nonprofit organizations from Startup Games winnings.\nEmployees at SpareFoot also regularly participate in volunteer and fundraising activities. In 2017, SpareFoot employees ran a Street Store for the homeless, raised money for the Central Texas Food Bank and Austin Pets Alive!, worked to beautify local parks, and gave time to Dress for Success.\nSpareFoot was named to the Top Company Cultures list in 2017 by Entrepreneur Magazine and has been named a Top Employer by the Austin American-Statesman since 2013.\nEmployee First Impressions\n\"We now have a facility that is as next-level as our talented team members and vision for the future. Having all employees on the same floor will save time and contribute to even more collaboration while getting closer as peers.\" - David Campuzano, Client Success Manager\n\"Being in downtown was awesome, but we're growing up, and the new digs really reflect that.\" -Tiffani Davidson, Email Marketing Manager\n\"I love going into the new office every day. Not only do I interact with other departments more frequently, but I also benefit creatively from being in a visually appealing environment.\" -Christine Walsh, Marketing Content Coordinator\nLearn more about the culture and benefits of working at SpareFoot and review current job openings on the SpareFoot jobs page .\nAbout SpareFoot\nSpareFoot.com is the largest marketplace for storage, making it easier to move and store your stuff. The SpareFoot website lets you find and compare the best storage deals near you, and instantly rent online or by phone for free. With the most up-to-date information on storage available, SpareFoot makes finding your stuff a home the easiest thing to cross off your to-do list.\nView original content with multimedia: http://www.prnewswire.com/news-releases/sparefoot-kicks-off-10th-year-with-move-to-new-office-300587305.html\nSOURCE SpareFoot", "external_links": ["https://about.sparefoot.com/jobs", "https://www.sparefoot.com/self-storage/blog/17608-sparefoot-among-3-of-austin-companies-with-silver-level-mother-friendly-worksite-designation/", "http://upaustin.com/", "https://www.sparefoot.com/", "http://breakthroughctx.org/", "http://www.prnewswire.com/news-releases/sparefoot-kicks-off-10th-year-with-move-to-new-office-300587305.html", "http://www.sparefoot.com/", "https://www.sparefoot.com/self-storage/blog/16925-sparefoot-wins-the-sixth-annual-startup-games/", "https://www.selfstorage.com/"], "published": "2018-01-24T15:30:00.000+02:00", "crawled": "2018-01-24T17:51:24.030+02:00", "highlightTitle": ""}