{"organizations": [], "uuid": "6661d7be17e471f5c7f6d8da21b1d63c14342441", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/africa-factors/african-markets-factors-to-watch-on-jan-22-idUSL8N1PH0KG", "country": "US", "domain_rank": 408, "title": "African Markets - Factors to watch on Jan. 22", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-22T14:15:00.000+02:00", "replies_count": 0, "uuid": "6661d7be17e471f5c7f6d8da21b1d63c14342441"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/africa-factors/african-markets-factors-to-watch-on-jan-22-idUSL8N1PH0KG", "ord_in_thread": 0, "title": "African Markets - Factors to watch on Jan. 22", "locations": [], "entities": {"persons": [], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "nigeria bonds nigeria", "sentiment": "none"}, {"name": "kenya central bank", "sentiment": "none"}, {"name": "anc", "sentiment": "none"}, {"name": "african national congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The following company announcements, scheduled economic indicators, debt and currency market moves and political events may affect African markets on Monday. - - - - - EVENTS: * Kenya Central Bank to hold its next rate-setting meeting. GLOBAL MARKETS Oil prices climbed on Monday, pushed higher by comments from Saudi Arabia that cooperation between oil producers who are currently withholding supplies would continue beyond 2018. WORLD OIL PRICES Oil prices climbed on Monday, pushed higher by comments from Saudi Arabia that cooperation between oil producers who are currently withholding supplies would continue beyond 2018. EMERGING MARKETS For the top emerging markets news, double click on AFRICA STOCKS For the latest news on African stocks, click on SOUTH AFRICA MARKETS South Africa's rand retreated from a two-and-a-half year high on Friday as a rally driven by a weaker dollar and optimism about the prospects for change under the new leader of the ruling African National Congress (ANC) ran out of steam. NIGERIA BONDS Nigeria plans to raise 315 billion to 385 billion naira ($1 billion to $1.26 billion) in the first quarter of the year through sales of naira-denominated bonds, the Debt Management Office said on Friday. KENYA MARKETS The Kenyan shilling was stable against the dollar on Friday, with market participants eyeing central bank's rate-setting meeting on Monday, traders said. CONGO SECURITY Congolese security forces shot dead at least six people and wounded dozens more as they fired tear gas to disperse a protest against President Joseph Kabila organised by the Catholic Church on Sunday, a U.N. peacekeeping mission in the country said. LIBYA OIL Libya's National Oil Corporation, NOC, announced on Sunday the reopening of the eastern As-Sarah oil fields, where more than 50,000 barrels per day (bpd) in a Wintershall [RIC:RIC:WINT.UL] concession had been shut in by a blockade since November. NIGERIA SECURITY Two Americans and two Canadians have been freed after being kidnapped in the nothern Nigerian state of Kaduna, a police spokesman said on Saturday. For the latest precious metals report click on For the latest base metals report click on For the latest crude oil report click on\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T14:15:00.000+02:00", "crawled": "2018-01-23T18:13:28.004+02:00", "highlightTitle": ""}