{"organizations": [], "uuid": "3c06e967fb19f55bcf7610b6fd39e80a5870f4c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/psa-vauxhall/update-1-peugeot-to-continue-vauxhall-recovery-plan-after-talks-with-uk-union-idUSL8N1PH47H", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Peugeot to continue Vauxhall recovery plan after talks with UK union", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T22:42:00.000+02:00", "replies_count": 0, "uuid": "3c06e967fb19f55bcf7610b6fd39e80a5870f4c9"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/psa-vauxhall/update-1-peugeot-to-continue-vauxhall-recovery-plan-after-talks-with-uk-union-idUSL8N1PH47H", "ord_in_thread": 0, "title": "UPDATE 1-Peugeot to continue Vauxhall recovery plan after talks with UK union", "locations": [], "entities": {"persons": [{"name": "costas pitas", "sentiment": "negative"}, {"name": "carlos tavares", "sentiment": "none"}, {"name": "len mccluskey", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "ellesmere port", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "peugeot", "sentiment": "negative"}, {"name": "vauxhall", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "general motors", "sentiment": "none"}, {"name": "unite union", "sentiment": "none"}, {"name": "opel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Recasts with comments after the meeting)\nBy Costas Pitas\nLONDON, Jan 22 (Reuters) - Peugeot said it would move ahead with recovery plans for its Vauxhall plants in Britain after agreeing on Monday to further talks with the UK’s biggest trade union.\nPSA-maker Peugeot acquired Vauxhall and Opel last year when it bought General Motors’ loss-making European arm, and has been pursuing a restructuring plan and cutting jobs to try to return it to profitability.\nThe Ellesmere Port plant in northern England builds the Astra Sports Tourer model, with the current run due to end in around 2021.\nPeugeot is due to decide as soon as this year whether to build future models at the site -- a key test of Britain’s ability to remain competitive as it leaves the EU.\nThe general secretary of the Unite Union, Len McCluskey, met PSA Chief Executive Carlos Tavares in Paris just two weeks after the firm said it would cut 250 jobs on top of 400 announced last year, when the site employed 1,900 people.\n“Further meetings are planned to quickly move this recovery plan for Vauxhall’s manufacturing sites to the highest level of performance, after years of degradation and in line with the PACE! recovery plan,” Peugeot said in a statement.\nUnite said Tavares had reiterated his desire not to close the British manufacturing sites, which also include a van factory in the southern English town of Luton.\nMcCluskey said he wanted to work constructively with Peugeot but threatened to damage the firm’s car sales in Britain, traditionally Vauxhall/Opel’s biggest market, if the firm tried to shut a British plant.\n“I repeated our determination to safeguard the UK plants and, if needs be, our willingness to disrupt PSA’s UK market share if the company fails to support this loyal workforce,” he said in a statement.\nPeugeot has said manufacturing costs in Britain are twice those of its French plants, and that it will only be able to make a decision on investment once this has been addressed, and it has a better idea of the shape of Britain’s future trading relationship with the EU.\nBritain hopes to secure the outline of a transitional Brexit deal, which will form a bridge from its current EU membership into a new relationship with the bloc, by the end of March.\nAutomakers are concerned that, without the right deal, their plants could be hit with tariffs and customs delays, putting their long-term viability at risk.\nMcCluskey said he would seek to meet British Business Minister Greg Clark as soon as possible.\n“The three parties – PSA, Unite and the UK government – must work together now to give our plants a future,” he said. (Reporting by Costas Pitas; Editing by Kevin Liffey)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T22:42:00.000+02:00", "crawled": "2018-01-23T17:54:32.004+02:00", "highlightTitle": ""}