{"organizations": [], "uuid": "81cf43903fcb169ab747aa9928157aa6eb1a5965", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-metals/metals-lme-copper-starts-2018-firmer-on-strong-china-demand-idUSL4N1OX142", "country": "US", "domain_rank": 408, "title": "METALS-LME copper starts 2018 firmer on strong China demand", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T09:25:00.000+02:00", "replies_count": 0, "uuid": "81cf43903fcb169ab747aa9928157aa6eb1a5965"}, "author": "", "url": "https://www.reuters.com/article/global-metals/metals-lme-copper-starts-2018-firmer-on-strong-china-demand-idUSL4N1OX142", "ord_in_thread": 0, "title": "METALS-LME copper starts 2018 firmer on strong China demand", "locations": [], "entities": {"persons": [{"name": "james regan", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "london metal exchange", "sentiment": "none"}, {"name": "shanghai futures exchange", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 7:25 AM / Updated 12 minutes ago METALS-LME copper starts 2018 firmer on strong China demand Reuters Staff 3 Min Read \n(Updates prices) By James Regan SYDNEY, Jan 2 (Reuters) - London copper was pushed higher on Tuesday on bets that demand in top consumer China will improve in 2018, keeping prices near four-year highs at the start of trading in the new year. China is the world's largest consumer of industrial metals and accounts for nearly half of global copper demand. The metal has been supported by Beijing's attack on polluting industries, supply reforms and robust demand growth. * COPPER: Three-month copper on the London Metal Exchange edged higher to $7,260 a tonne, as of 0713 GMT. The contract ended 2017 with an annual 31 percent price gain, reaching prices last seen in January 2014, after peaking at $7,312.50 on Dec. 28, according to Reuters data. * SHFE: The most-traded copper contract on the Shanghai Futures Exchange closed 0.6 percent lower at 55,250 yuan ($8,506.94) a tonne. * COPPER TREATMENT CUT: China's copper smelters on Friday lowered the floor for their treatment and refining charges (TC/RCs) in the first quarter of 2018 by 8.4 percent, signalling tighter supply of copper concentrate in the first three months of the New Year. * ALUMINIUM REFINERY GO-AHEAD: Guinea's government has approved a more than $2.8 billion investment by Chinese company TBEA Co Ltd in a new bauxite mine, an aluminium refinery and an aluminium smelter, the mines ministry said on Friday. * SAFETY WARNING: Shanghai has issued a warning on the safety of metal products manufactured by scandal-hit Japanese firm Kobe Steel Ltd and strengthened scrutiny measures, state-owned Xinhua News Agency reported, citing the city's inspection body. OTHER METALS: ShFE nickel ended 2.36 percent higher while tin closed 1 percent higher. Zinc finished 0.76 percent higher, while aluminium closed down 0.33 percent. * For the top stories in metals and other news, click or PRICES Three month LME copper Most active ShFE copper Three month LME aluminium Most active ShFE aluminium Three month LME zinc Most active ShFE zinc Three month LME lead Most active ShFE lead Three month LME nickel Most active ShFE nickel Three month LME tin Most active ShFE tin ARBS ($1 = 6.4947 Chinese yuan) (Reporting by James Regan; Editing by Richard Pullin and Sherry Jacob-Phillips)", "external_links": [], "published": "2018-01-02T09:25:00.000+02:00", "crawled": "2018-01-02T09:48:47.010+02:00", "highlightTitle": ""}