{"organizations": [], "uuid": "22fd578e0e2ef6645ab3645e96ea209bf2359d6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 35, "shares": 35, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/news/world", "section_title": "World News | Reuters.com", "url": "https://www.reuters.com/article/us-pakistan-climbers/bid-to-rescue-polish-man-french-woman-on-pakistan-peak-to-start-saturday-idUSKBN1FF21M", "country": "US", "domain_rank": 408, "title": "Bid to rescue Polish man, French woman on Pakistan peak to start Saturday", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T23:14:00.000+02:00", "replies_count": 0, "uuid": "22fd578e0e2ef6645ab3645e96ea209bf2359d6b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-pakistan-climbers/bid-to-rescue-polish-man-french-woman-on-pakistan-peak-to-start-saturday-idUSKBN1FF21M", "ord_in_thread": 0, "title": "Bid to rescue Polish man, French woman on Pakistan peak to start Saturday", "locations": [], "entities": {"persons": [{"name": "iqbal hussain", "sentiment": "none"}, {"name": "revol", "sentiment": "none"}, {"name": "elisabeth revol", "sentiment": "none"}, {"name": "masha gordon", "sentiment": "none"}, {"name": "asghar porik", "sentiment": "none"}, {"name": "nanga parbat", "sentiment": "none"}, {"name": "mackiewicz", "sentiment": "none"}, {"name": "karrar haidri", "sentiment": "none"}, {"name": "tomasz mackiewicz", "sentiment": "none"}], "locations": [{"name": "pakistan", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "himalaya", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "pakistan army", "sentiment": "none"}, {"name": "jasmine tours", "sentiment": "none"}, {"name": "nanga parbat", "sentiment": "none"}, {"name": "alpine club", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ISLAMABAD/WARSAW (Reuters) - Efforts to rescue a Polish man and a French woman stuck on a treacherous peak in northern Pakistan known to mountaineers as “Killer Mountain” are set to begin on Saturday, officials said.\nTomasz Mackiewicz from Poland and Elisabeth Revol of France were attempting to ascend the 8,126 meter (26,660 feet) Nanga Parbat in Pakistan’s Himalaya mountain range.\nFour members from a team of Polish climbers attempting the first winter ascent of nearby K2, the world’s second highest mountain, will assist in the rescue operation after a Pakistan Army helicopter picks them up from their base camp and flies them to Nanga Parbat.\n“They will be brought from K2 to Nanga Parbat and then the operation will begin,” Asghar Porik of Jasmine Tours told Reuters on Friday. Separately, a Pakistani tourism official, Iqbal Hussain, said the operation would begin on Saturday.\nMackiewicz and Revol got stuck at the 7,400 meter mark, from where they used a satellite phone to call for help, spokesman for the Alpine Club of Pakistan Karrar Haidri told Reuters.\nMasha Gordon, who has co-ordinated a crowdfunding campaign to fund the rescue operation, said Revol managed to bring Mackiewicz down to 7,280 meters and set him up in a tent to spend the night.\n“Eli is in the process of descending down and has last communicated from 6,671m,” Gordon said. “Though she has no tent, she is clearly lucid and is making progress on a descent to help get the rescue effort under way.”\nJanusz Majer, who helped prepare the Polish expedition team currently scaling K2, said that messages sent by Revol said Mackiewicz was suffering from snow blindness and frostbite.\n“He hid himself in a crevasse to seek protection from wind. Tomasz in the past has spent a couple of nights above 7,000 meters, but with all the needed equipment,” Majer said.\nThe crowdfunding campaign has raised around 62,500 euros ($75,000) by Friday evening, exceeding its target of 60,000 euros within several hours. The Polish government said it would provide financial guarantees and support for the rescue operation.\nMackiewicz has made six previous attempts to scale Nanga Parbat in winter, where perceived temperatures can reach minus 60 degrees Celsius. The first successful winter ascent of the mountain was made as recently as February 2016.\nPakistan rivals Nepal for the number of peaks over 7,000 meters (23,000 feet).\nIn June a Spanish man and an Argentinian perished in an avalanche while trying to scale Nanga Parbat.\n($1 = 0.8049 euros)\nReporting by Saad Sayeed in ISLAMABAD and Marcin Goettig in WARSAW, Additional reporting by Henri-Pierre Andre in PARIS, Editing by William Maclean and Alison Williams\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-26T23:14:00.000+02:00", "crawled": "2018-01-27T00:17:39.007+02:00", "highlightTitle": ""}