{"organizations": [], "uuid": "ee46c5fd8d9c6ded77f932030538a637957ad601", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/usa-banks-results-bonuses/wall-street-traders-brace-for-meager-paychecks-as-bonus-season-approaches-idUSL1N1P51V8", "country": "US", "domain_rank": 408, "title": "Wall Street traders brace for meager paychecks as bonus season approaches", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T08:00:00.000+02:00", "replies_count": 0, "uuid": "ee46c5fd8d9c6ded77f932030538a637957ad601"}, "author": "", "url": "https://www.reuters.com/article/usa-banks-results-bonuses/wall-street-traders-brace-for-meager-paychecks-as-bonus-season-approaches-idUSL1N1P51V8", "ord_in_thread": 0, "title": "Wall Street traders brace for meager paychecks as bonus season approaches", "locations": [], "entities": {"persons": [{"name": "catherine ngai", "sentiment": "none"}], "locations": [], "organizations": [{"name": "bank of america corp", "sentiment": "none"}, {"name": "citigroup inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "jpmorgan chase & co", "sentiment": "none"}, {"name": "goldman sachs group inc", "sentiment": "none"}, {"name": "morgan stanley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan 19 (Reuters) - Some traders at the largest Wall Street banks are about to get big, fat zeroes for bonuses while they watch markets thrive.\nTrading revenue was down significantly across the industry during the fourth quarter, wrapping up a year in which clients around the globe sat idle as market volatility hovered near historic lows.\nThe big five Wall Street banks – JPMorgan Chase & Co , Citigroup Inc, Bank of America Corp, Goldman Sachs Group Inc and Morgan Stanley – reported an average revenue decline of 32 percent for the fourth quarter, and 12 percent for the full year. Even though stock markets hit new highs and bond markets moved little, executives said it was hard to generate income from inactive customers.\nAs a result, bonuses could be 10 percent to 20 percent lower than the prior year, and traders who sit on desks that posted losses could get nothing at all, consultants and recruiters said in interviews.\n“Getting zero bonuses was unheard of a couple years ago, but it happens today,” said Alan Johnson, head of compensation consulting firm Johnson Associates.\n“I expect that there are people who will get no bonus” this season, he added.\nTraders have been feeling the crunch for several years, as trading revenue has been on a near-steady march downward and banks have embarked on aggressive cost-cutting campaigns. It has also become harder for traders to leave banks for attractive opportunities on the buy-side because active managers have been facing their own difficulties with performance and fund-raising.\nCommodities traders may have it the worst. Muted client activity and wild fluctuations in power and natural gas markets resulted in one of the worst years on record for many trading firms. Big names in energy trading, including hedge fund manager Andy Hall and Texas tycoon T. Boone Pickens, simply closed up shop.\nAfter posting one of the worst years on record, managers in Goldman Sachs’ commodities trading unit have told some staff to expect little to no bonus for 2017 performance, three people familiar with the matter told Reuters.\nThey were not authorized to speak on the record. Spokeswoman Tiffany Galvin declined to comment.\nWhile $0 bonus checks are still relatively rare, Wall Street banks are trying hard to keep a lid on compensation costs more broadly.\nGoldman cut its compensation costs 12 percent last year, even as it hired 2,200 more workers. Its average employee received $323,852 in compensation during 2017. That represented 37 cents for every dollar in revenue they produced, down from 38 cents the year before.\nCompensation costs in Morgan Stanley’s institutional business declined only slightly more than its revenue declined. The investment bankers and traders in that unit received 34 cents in compensation for every dollar in revenue they brought into the bank, down from 35 cents-per-dollar in 2016.\n“We pay for performance,” Chief Financial Officer Jon Pruzan said in an interview.\nHistorically during bonus season, traders have expected to take home some percent of either the revenue they generated during the year, or the value of their book of assets. That structure offered enormous upside for strong performance, but because it also encouraged risk-taking, banks have shifted to a model that adjusts for risk and is more discretionary, recruiters and consultants said.\nRoss Gregory, a director at the talent firm Proco Commodities, said he expects bonuses to be much lower this year because of those factors, as well as weak performance.\n“We foresee a softening in the bonuses at the Wall Street banks,” he said. (Reporting by Catherine Ngai; Additional reporting by Liz Hampton in Houston; Editing by Lauren Tara LaCapra and Lisa Shumaker)\n ", "external_links": [], "published": "2018-01-19T08:00:00.000+02:00", "crawled": "2018-01-19T08:32:50.016+02:00", "highlightTitle": ""}