{"organizations": [], "uuid": "c34fce6843b462e2ae625f7c42bce004fa9b45f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/18/104954084-GettyImages-904054670.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/18/asia-markets-us-politics-and-dollar-in-focus.html", "country": "US", "domain_rank": 767, "title": "Asia markets: US politics, dollar in focus", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T02:37:00.000+02:00", "replies_count": 0, "uuid": "c34fce6843b462e2ae625f7c42bce004fa9b45f2"}, "author": "Cheang Ming", "url": "https://www.cnbc.com/2018/01/18/asia-markets-us-politics-and-dollar-in-focus.html", "ord_in_thread": 0, "title": "Asia markets: US politics, dollar in focus", "locations": [], "entities": {"persons": [], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "wall street", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "thomson reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "u.s. congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC 100 --- \nIn South Korea, the Kospi tacked on 0.18 percent to end at 2,520.26. Automakers were in positive territory, with Hyundai Motor jumping 4.52 percent by the end of the session. Technology plays, however, were mostly lower. Index heavyweight Samsung Electronics erased early gains to decline 1.16 percent while rival SK Hynix fell 2.53 percent. \nDown Under, the S&P/ASX 200 edged down 0.15 percent to finish the session at 6,005.8. Major mining and energy-related stocks were lower, with Rio Tinto losing 1.04 percent, BHP declining 0.29 percent and Santos falling 1.34 percent by the end of the day. \nHong Kong's Hang Seng Index clung to narrow gains at 3:25 p.m. HK/SIN, trading higher by just 0.02 percent, after notching its third consecutive record close in the last session. Property developers recorded gains, with Country Garden climbing 3.27 percent, while financials were mostly in negative territory. \nShares of Tencent , a heavily weighted constituent on the index, were higher by 0.54 percent ahead of the market close. \nOn the mainland, the Shanghai composite tacked on 0.41 percent to close at 3,489.11. The Shanghai index had traded at its highest levels in two years earlier in the session following the release of robust Chinese growth numbers on Thursday. The Shenzhen composite erased early gains to close lower by 0.14 percent at 1,921.33. US government shutdown looms \nA looming government shutdown stateside was a \"binary event\" that was affecting risk sentiment in \"global markets, including those in Asia,\" Rob Carnell, Asia Pacific head of research at ING wrote in a morning note. \nU.S. stocks closed lower on Thursday as investors focused on the likelihood of that shutdown. The move lower came despite corporates stateside posting solid quarterly earnings: As of Wednesday, 78 percent of S&P 500 companies that have reported topped expectations, according to Thomson Reuters I/B/E/S . \nStill, the immediate focus for markets stateside remained a Friday deadline for the U.S. Congress to pass a stopgap funding bill . The House passed a spending bill late on Thursday, although it was less certain how the vote would play out in the Senate. \nYields on the 10-year U.S. Treasury note rose above 2.63 percent, its highest levels since 2016. \nThe dollar extended losses after edging down in the last session ahead of the Friday deadline stateside. The dollar index , which tracks the U.S. currency against six major peers, traded at 90.380 at 3:12 p.m. HK/SIN after falling as low as 90.113 overnight. \nWeakness in the dollar saw the euro extend overnight gains to trade at $1.2255 while the pound was steady. The greenback also drifted lower against the yen to fetch 110.84, a touch below Thursday's close of 111.05. \nThe Australian dollar rose to trade at $0.8009 in the wake of strong China economic data released in the previous session. Corporate news \nTrade in the shares of Wanda Hotel Development was halted Friday morning. The Hong Kong-listed developer said in a filing that the halt came before \"a possible very substantial disposal.\" \nMeanwhile, Ping An Insurance Group has raised almost $1 billion in funding ahead of a planned listing of a medical data unit, Reuters reported, citing sources. Ping An said in a Thursday statement that it was \"proactively developing\" technologies that supported its main business, but advised \"caution when dealing in the securities\" of the company. Hong Kong-listed Ping An traded higher by 0.22 percent by 3:15 p.m. HK/SIN as most other financial names declined. \nElsewhere, SoftBank Group on Thurday became Uber's largest shareholder after it officially closed a high-profile deal with the ride-hailing company. The deal had valued Uber at around $48 billion, which was a discount to a previous valuation of nearly $70 billion. SoftBank shares closed lower by 0.28 percent, underperforming most other Japanese tech stocks.", "external_links": ["http://lipperalpha.financial.thomsonreuters.com/2018/01/sp-500-17q1-earnings-dashboard/"], "published": "2018-01-19T02:37:00.000+02:00", "crawled": "2018-01-19T02:11:27.000+02:00", "highlightTitle": ""}