{"organizations": [], "uuid": "d4fe70af6963637f829eceb0d0210a41c943ec01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-civitas-capital-group-names-eugene-gene-fullam-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "Civitas Capital Group names Eugene \"Gene\" Fullam Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T19:37:00.000+02:00", "replies_count": 0, "uuid": "d4fe70af6963637f829eceb0d0210a41c943ec01"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-civitas-capital-group-names-eugene-gene-fullam-chief-financial-officer.html", "ord_in_thread": 0, "title": "Civitas Capital Group names Eugene \"Gene\" Fullam Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "fullam", "sentiment": "negative"}, {"name": "daniel j. healy", "sentiment": "negative"}, {"name": "eugene", "sentiment": "negative"}, {"name": "healy", "sentiment": "none"}, {"name": "gene", "sentiment": "none"}], "locations": [{"name": "dallas", "sentiment": "none"}, {"name": "vermont", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "civitas capital group", "sentiment": "negative"}, {"name": "citigroup", "sentiment": "none"}, {"name": "civitas", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 30, 2018 /PRNewswire/ -- CEO Daniel J. Healy today announced Eugene \"Gene\" Fullam as Chief Financial Officer and a Managing Director for Civitas Capital Group , a specialty asset management firm headquartered in Dallas.\n\"Gene's 35 years of experience in financial, operational, and strategic leadership in highly competitive financial industries will help Civitas as it expands its institutional investor base,\" CEO Healy said. He noted that Fullam's deep financial expertise and strategic skillset, coupled with his sterling reputation for integrity, made for a perfect match.\nMost recently, Fullam was appointed executive director of economic development and commerce at the Vermont EB-5 Regional Center. At the time, Vermont was one of only two states to operate its own EB-5 regional center.\n\"Number one, Gene is a proven high-integrity guy,\" Healy said. \"Beyond that, he'll offer invaluable advice on financial strategy as we expand our institutional investment platforms in 2018 and beyond.\"\nFullam has high-level experience across an array of investment firms, including Citigroup, HSBC, Lehman Brothers, and Standard & Poor's, where he worked with institutional issuers and investors on mergers and acquisitions, initial public offerings, and private placements. He later served as COO and CFO at International Bond & Marine, a privately owned insurance business.\n\"Civitas has an exceptional track record of delivering value to both institutional and EB-5 investors, and I see my role as overseeing and expanding the growth that follows such success,\" Fullam said. \"The company's culture of transparency and rigor are core values I share, ones that continue to be a competitive advantage. I'm delighted to join Civitas.\"\nCivitas Capital Group is a unique alternative asset management firm. We focus on niche, differentiated opportunities in real estate, lodging, and alternative credit. Our rich expertise, analytical rigor, and cultural competency yield compelling investment strategies for global institutional investors, family offices, and qualified individuals through our Alternative Investments and EB-5 Capital divisions.\nThis press release does not constitute an offer or solicitation with respect to the purchase or sale of any security in any jurisdiction in which such offer or solicitation is not authorized or to any person to whom it would be unlawful to make such offer or solicitation. Past performance is not necessarily indicative of future results.\nView original content with multimedia: http://www.prnewswire.com/news-releases/civitas-capital-group-names-eugene-gene-fullam-chief-financial-officer-300590353.html\nSOURCE Civitas Capital Group", "external_links": ["http://www.civitascapital.com/", "http://www.prnewswire.com/news-releases/civitas-capital-group-names-eugene-gene-fullam-chief-financial-officer-300590353.html"], "published": "2018-01-30T19:37:00.000+02:00", "crawled": "2018-01-30T20:52:26.000+02:00", "highlightTitle": ""}