{"organizations": [], "uuid": "365025ea7d2102c0b30e4334f033d251cb0dd129", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221498138&w=1200&r=LYNXMPEE0B19Y", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-ghouta/a-picture-and-its-story-syrian-pulled-from-rubble-mourns-martyred-young-son-idUKKBN1F123W", "country": "US", "domain_rank": 408, "title": "A picture and its story - Syrian pulled from rubble mourns 'martyred' young son", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T18:53:00.000+02:00", "replies_count": 0, "uuid": "365025ea7d2102c0b30e4334f033d251cb0dd129"}, "author": "", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-ghouta/a-picture-and-its-story-syrian-pulled-from-rubble-mourns-martyred-young-son-idUKKBN1F123W", "ord_in_thread": 0, "title": "A picture and its story - Syrian pulled from rubble mourns 'martyred' young son", "locations": [], "entities": {"persons": [{"name": "abu abdallah", "sentiment": "none"}, {"name": "abdallah", "sentiment": "none"}], "locations": [{"name": "ghouta", "sentiment": "none"}, {"name": "damascus", "sentiment": "none"}, {"name": "ghouta", "sentiment": "none"}, {"name": "eastern ghouta", "sentiment": "none"}, {"name": "saqba", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 4:55 PM / Updated 10 minutes ago A picture and its story - Syrian pulled from rubble mourns 'martyred' young son Reuters Staff 3 Min Read \nEASTERN GHOUTA, Syria (Reuters) - His brow dripping with blood and his skin caked with brick dust, Abu Abdallah was pulled out from under the rubble of his house near Damascus after it was blown up in an air raid. A man gets stuck under debris at a damaged site after an airstrike in the Saqba area, in the eastern Damascus suburb of Ghouta, Syria January 9, 2018. REUTERS/Bassam Khabieh/File photo \nHe was lucky to survive the bomb that fell while he was having breakfast, dropped by one of the countless warplanes that emergency workers say have pounded the rebel-held Syrian enclave of Eastern Ghouta in recent days. \nHis three-year-old son was not so fortunate. \n“We were sitting around, eating,” said Abu Abdallah - a sobriquet meaning ‘Abdallah’s father’ - as he recalled Tuesday’s strike. “My son wanted to use the toilet, so his mother took him. Then the missile came down.” \n“In less than a minute, the entire house fell on top of us.” \nRelatives in the living room were also trapped in the debris. Everyone was screaming. \n“I was under the rubble... and my head was bent down, I couldn’t raise it,” said Abu Abdallah, who declined to give his full name. “I said that’s it, this will be the end of me.” Abu Abdallah, 26, who was rescued from under the rubble after an airstrike, is seen at a relative's home in the Saqba area, in the eastern Damascus suburb of Ghouta, Syria, January 11, 2018. REUTERS/Bassam Khabieh \nSyrian troops and their allies have blockaded Eastern Ghouta, a densely populated pocket of satellite towns and farms, since 2013. It is the only remaining major rebel enclave near the Syrian capital. \nRescue workers arrived within minutes and then pulled his wife out, he recalled. ”She told them there is a boy... and they got him out,“ he added. ”Everybody in the house got out safely except the boy. He was martyred. \n“Honestly, I keep remembering the boy when they pulled him out... and the pressure with everything on top of me.” A man gets stuck under debris at a damaged site after an airstrike in the Saqba area, in the eastern Damascus suburb of Ghouta, Syria January 9, 2018. REUTERS/Bassam Khabieh/File photo \nAbu Abdallah, 26, comes from the eastern Ghouta village of Marj al-Sultan, which the Syrian army recaptured from insurgents in late 2015. He had moved deeper into the enclave to the town of Saqba with his family to try to escape the bombing. \n“Now it’s still not clear what we will do,” he said. His family is staying with relatives while he recovers from a head injury and a back strain. \nHome to around 400,000 civilians, the Eastern Ghouta enclave faces a humanitarian catastrophe, the U.N. human rights chief said this week. \nSyrian government forces and their allies have killed at least 85 civilians there since the end of December, including 21 women and 30 children, Zeid Ra‘ad al-Hussein also said. \n“The (world) should have mercy on these children and women because they have nothing to do with the fighting,” Abu Abdallah said. “If they want to fight, let them go fight on the frontlines. But why are they bombing us?” Writing by Beirut bureau; editing by John Stonestreet", "external_links": [], "published": "2018-01-12T18:53:00.000+02:00", "crawled": "2018-01-12T19:17:49.000+02:00", "highlightTitle": ""}