{"organizations": [], "uuid": "51766c8b46ca03d9088903c23f5deb2394e7fabd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/business-wire-warner-bros-pictures-to-distribute-the-follow-up-to-adetective-chinatowna-in-north-america.html", "country": "US", "domain_rank": 767, "title": "Warner Bros. Pictures to Distribute the Follow Up to “Detective Chinatown” in North America", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T21:30:00.000+02:00", "replies_count": 0, "uuid": "51766c8b46ca03d9088903c23f5deb2394e7fabd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/business-wire-warner-bros-pictures-to-distribute-the-follow-up-to-adetective-chinatowna-in-north-america.html", "ord_in_thread": 0, "title": "Warner Bros. Pictures to Distribute the Follow Up to “Detective Chinatown” in North America", "locations": [], "entities": {"persons": [{"name": "jeff goldstein", "sentiment": "none"}, {"name": "goldstein", "sentiment": "none"}, {"name": "wanda", "sentiment": "none"}, {"name": "jiang defu", "sentiment": "none"}, {"name": "jiang", "sentiment": "none"}], "locations": [{"name": "burbank", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "warner bros", "sentiment": "neutral"}, {"name": "wanda media", "sentiment": "none"}, {"name": "wanda media co., ltd.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The action comedy will open day-and-date in China and North America on February 16, 2018\nBURBANK, Calif.--(BUSINESS WIRE)-- Warner Bros. Pictures has acquired domestic distribution rights for the follow up to the Chinese hit “Detective Chinatown” from Wanda Media Co., Ltd., it was announced today by Jeff Goldstein, Warner Bros. Pictures’ President of Domestic Distribution, and Jiang Defu, General Manager of Wanda Media. The deal marks the second collaboration between the two companies, following last year’s worldwide blockbuster “Wonder Woman.”\nThe new action comedy has been slated for release in North America on Chinese New Year, February 16, 2018, day-and-date with its release in China. In the U.S., it is set to open in 48 markets.\nIn making the announcement, Goldstein stated, “China has become a major contributor to the global film industry and Wanda is a company at the forefront of that rise. We are excited to expand our relationship with them and to bring this new project to American audiences.”\nJiang stated, “This is an exciting new cooperation, which will expand the global footprint of Chinese language films. Warner Bros., as one of the most successful studios in the industry, will bring our latest movie to North American audiences, and we look forward to the launch of this fresh, comedy detective film during the Chinese New Year.”\nThe new film is the follow up to the Chinese hit “Detective Chinatown,” which opened in China in December 2015 and went on to gross more than $126 million (RMB 820m). It reunites writer/director Chen Sicheng and stars Wang Baoqiang and Liu Haoran, who reprise their roles as detectives Tang Ren and Qin Feng, respectively.\nWhen the case of New York Chinatown godfather Uncle Qi’s missing son turns into a murder investigation, the detective duo Tang and Qin team up again to hunt down the killer—this time with some help from the International Detective Alliance.\nThe main cast also includes Xiao Yang, Natasha Liu Bordizzo, Michael Pitt and Japanese star Tsumabuki Satoshi.\nThe movie was shot in New York City and Beijing.\nThis film is a presentation of Wanda Media Co., Ltd. And Horgos Shine Asia Pictures & Culture Media Co., Ltd., in association with China Film Co., Ltd., Wanda Pictures (Hong Kong) Co., Ltd., Huoerguosi Happy Picture Co., Ltd., Youku Pictures Co., Ltd., Xiomi Pictures Co., Ltd., Horgos Youth Enlight Pictures Co., Ltd., Beijing Sparkle Roll Media Corporation, Horgos Jin Yi Film Co., Ltd., Zhe Jiang Hengdian Film Co., Ltd., Dadi Century (Beijing) Co., Ltd., Gosh Film Entertainment Co., Ltd., Yili JoyPictures Co., Ltd., Huawen Picture Co., Ltd., and Lian Ray Pictures.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180119005619/en/\nWarner Bros. Pictures\nJack Horner\n(818) 954-3291\njack.horner@warnerbros.com\nSource: Warner Bros. Pictures", "external_links": ["http://www.businesswire.com/news/home/20180119005619/en/"], "published": "2018-01-19T21:30:00.000+02:00", "crawled": "2018-01-19T22:39:40.000+02:00", "highlightTitle": ""}