{"organizations": [], "uuid": "5245e0c5e58eb25e9dd8a9b36624afc08bbdec89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-665858840.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/01/hyundai-kia-sales-forecast-2018/", "country": "US", "domain_rank": 1196, "title": "Hyundai and Kia Flag Slow Sales Growth in 2018 | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.73, "site_type": "news", "published": "2018-01-03T01:02:00.000+02:00", "replies_count": 0, "uuid": "5245e0c5e58eb25e9dd8a9b36624afc08bbdec89"}, "author": "Reuters", "url": "http://fortune.com/2018/01/01/hyundai-kia-sales-forecast-2018/", "ord_in_thread": 0, "title": "Hyundai and Kia Flag Slow Sales Growth in 2018 | Fortune", "locations": [], "entities": {"persons": [{"name": "hyundai sant", "sentiment": "negative"}, {"name": "justin sullivan getty", "sentiment": "none"}, {"name": "kim jin-woo", "sentiment": "none"}], "locations": [{"name": "colma", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}], "organizations": [{"name": "hyundai", "sentiment": "negative"}, {"name": "hyundai motor", "sentiment": "negative"}, {"name": "kia motors", "sentiment": "negative"}, {"name": "kia", "sentiment": "none"}, {"name": "korea investment & securities", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "forecasts Hyundai Motor and Kia Motors Are Flagging Slow Sales Growth in 2018 Brand new Hyundai Santa Fe SUVs are displayed at a Hyundai dealership on April 7, 2017 in Colma, California. Justin Sullivan Getty Images By Reuters 11:02 PM EST \nSouth Korea’s Hyundai Motor (hymtf) and Kia Motors (kimtf) on Tuesday flagged only modest sales growth in 2018, suggesting a slow recovery from a slump linked to their lack of SUVs in the United States and diplomatic tensions with China. \nHyundai and smaller affiliate Kia, which together make the world’s fifth-largest automaker, said demand was expected to soften in the U.S. and Chinese markets as they unveiled a combined sales target of 7.55 million vehicles this year. \nAnalysts said that would be a slight increase on 2017, when the automakers are estimated to have sold about 7.3 million vehicles, their lowest in five years. \n“The target for Hyundai and Kia is lower than expected. It seems to be a conservative target, reflecting a slow recovery in China and ongoing U.S difficulties,” Kim Jin-woo, an analyst at Korea Investment & Securities said. \nThe 2017 sales figures are due out later on Tuesday but analysts expect the South Korean duo to fall well short of their target of 8.25 million vehicles, marking their third consecutive annual miss. \nHyundai Motor shares declined 2.2 percent after falling as much as 4.5 percent on Tuesday morning, and Kia Motors stocks were down more than 1.6 percent. The broader market rose 0.2 percent. \nThe firms’ sales tumbled last year in China, the world’s largest auto market, amid a chill between Beijing and Seoul over South Korea’s deployment of a U.S. anti-missile system. \nSales in China and the United States were also hurt by a failure to capitalise on surging demand for sports utility vehicles (SUVs). \nWhile Hyundai Motor has plans to offer more SUVs in the United States and China, analysts said new models such as the redesigned Santa Fe SUV may come too late in the year to significantly impact sales. \nThe expiration of a tax cut on small-engine cars in China also would be a negative for Hyundai’s sedan-heavy line-up, they said. \nHyundai Motor Group Chairman Chung Mon-koo said in a statement the South Korean automakers would launch 12 new or refreshed models this year. \nFor more on Hyundai and Kia, see Fortune’s video: \nThey would “actively venture into” new markets like Southeast Asia, as protectionism was expected to grow elsewhere, he added. \nSouth Korea and the United States will hold talks on a trade deal on Jan. 5 although U.S. President Donald Trump has threatened to withdraw from the pact. \nChung, 79, skipped his annual New Year speech to employees for a second year in a row. He has not made any public appearances since December, 2016. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-03T01:02:00.000+02:00", "crawled": "2018-01-02T06:15:12.000+02:00", "highlightTitle": ""}