{"organizations": [], "uuid": "b44b7ece79796534c04cd90d40d252f7b57996c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/business-wire-trieza-therapeutics-names-jeno-gyuris-ph-d-as-chief-scientific-officer.html", "country": "US", "domain_rank": 767, "title": "Trieza Therapeutics Names Jeno Gyuris, Ph.D., as Chief Scientific Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T16:00:00.000+02:00", "replies_count": 0, "uuid": "b44b7ece79796534c04cd90d40d252f7b57996c3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/business-wire-trieza-therapeutics-names-jeno-gyuris-ph-d-as-chief-scientific-officer.html", "ord_in_thread": 0, "title": "Trieza Therapeutics Names Jeno Gyuris, Ph.D., as Chief Scientific Officer", "locations": [], "entities": {"persons": [{"name": "jeno gyuris", "sentiment": "negative"}, {"name": "gyuris", "sentiment": "none"}, {"name": "dan hicklin", "sentiment": "none"}, {"name": "trieza", "sentiment": "none"}, {"name": "jeno", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}], "organizations": [{"name": "trieza therapeutics, inc.", "sentiment": "neutral"}, {"name": "trieza", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMBRIDGE, Mass.--(BUSINESS WIRE)-- Trieza Therapeutics, Inc. today announced that Jeno Gyuris, Ph.D., has joined the company as Chief Scientific Officer. Dr. Gyuris brings 25 years of scientific leadership experience in the biopharmaceutical industry and will lead all aspects of Trieza’s novel therapeutics discovery and development.\n\"We are delighted to welcome Jeno to the Trieza leadership team” said Dan Hicklin, Ph.D., President and Chief Executive Officer of Trieza. \"Jeno’s extensive scientific and oncology drug development expertise, coupled with his proven organizational and team building skills will accelerate Trieza’s efforts to advance novel cancer immunotherapies to the clinic as quickly and efficiently as possible.\"\nDr. Gyuris will work closely with existing scientific and operational staff to grow Trieza from its current incubator footprint to a fully independent development-stage company. He will also take a key role in interactions with potential investors and strategic collaborators to advance the Trieza pipeline.\n\"It is very exciting to join Trieza at such a pivotal stage” said Dr. Gyuris. \"The innovative science and progress of Trieza’s portfolio over the past two years has poised the company to play a leading role in the delivery of novel immunomodulatory therapies to battle cancer.”\nA veteran of the Cambridge biotech cluster, Dr. Gyuris has held a number of scientific leadership positions including Chief Scientific Officer of Aveo Pharmaceuticals and Executive VP, Research and Development and Chief Scientific Officer for Quiet Therapeutics. Jeno began his career in cancer biotherapeutics at Mitotix and held the role of Vice President of Molecular Technologies after the company’s acquisition by GPC Biotech.\nDr. Gyuris received his Ph.D. from the University of Szeged, Hungary, and completed a postdoctoral fellowship at Harvard Medical School and Massachusetts General Hospital.\nAbout Trieza Therapeutics, Inc.\nTrieza Therapeutics is a Cambridge, MA based biotechnology company building a portfolio of Immuno-modulatory Oncolytic Viruses (IOVs) as therapeutic candidates for cancer immunotherapy.\nTrieza’s approach to stimulate anti-tumor immune responses is based on a novel virus platform that combines potent yet tumor-selective lysis with rapid, transient expression of engineered transgenes encoding immuno-modulatory agents. Trieza’s current portfolio of preclinical IOVs includes viruses expressing immune-stimulants, checkpoint inhibitors, and ligands for T-cell costimulatory or coinhibitory receptors.\nThe company was formed in November 2016 as a spin-out from Potenza Therapeutics. Current investors include MPM Capital, Interwest Partners, and Astellas Venture Management, LLC.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180105005245/en/\nTrieza Therapeutics, Inc.\nEileen McCullough, 617-588-4158\nemccullough@trieza.com\nSource: Trieza Therapeutics, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180105005245/en/"], "published": "2018-01-05T16:00:00.000+02:00", "crawled": "2018-01-05T18:02:01.008+02:00", "highlightTitle": ""}