{"organizations": [], "uuid": "2e8e4acb082dd6cad0c6872676787b3e0dbe81fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/21/104855949-GettyImages-871795392.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/10/ethereum-price-hits-record-high-above-1400-up-17000-percent-in-a-year.html", "country": "US", "domain_rank": 767, "title": "Ethereum price hits a fresh record high, up over 13,000% in a year", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T11:16:00.000+02:00", "replies_count": 0, "uuid": "2e8e4acb082dd6cad0c6872676787b3e0dbe81fd"}, "author": "Arjun Kharpal", "url": "https://www.cnbc.com/2018/01/10/ethereum-price-hits-record-high-above-1400-up-17000-percent-in-a-year.html", "ord_in_thread": 0, "title": "Ethereum price hits a fresh record high, up over 13,000% in a year", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "enterprise ethereum alliance", "sentiment": "none"}, {"name": "coindesk", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "jp morgan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ethereum hit another all-time high Wednesday with the cryptocurrency now up more than 60 percent in a week.\nThe digital currency hit a record high of $1,417.38 before paring some of those gains, according to CoinDesk, a website that tracks the prices of the digital currency. Ethereum is up over 13,000 percent in the last year.\nEthereum is the world's second-largest cryptocurrency by market capitalization behind bitcoin , with a value of $131.5 billion, CoinDesk data shows.\nThe digital coin is backed by a blockchain, much like bitcoin, but the technology is slightly different and aimed at a specific use case: smart contracts . Many see it as a cryptocurrency with a real world use because of large companies that are experimenting with the technology.\nA consortium called the Enterprise Ethereum Alliance , which includes companies like Microsoft and JP Morgan , is looking to develop applications using the Ethereum blockchain.\nshow chapters What is Blockchain? 7:14 AM ET Thu, 14 Dec 2017 | 04:44 There also appears to be a sense of investors looking at alternative digital coins to make a profit. Ripple recently surged to a record high before plunging . Some of that money may have been funneled into ethereum. As of 8:00 a.m. London time on Wednesday, over 43 percent of purchases of ethereum had been made using bitcoin, according to CryptoCompare.\nLast year also saw just over $3.7 billion raised via initial coin offerings (ICO) , a process where a company can raise money by issuing a new digital token. Investors do not get a stake in the company, but these tokens can be traded, or may be used on a service that the issuing firm offers. Many of these ICOs are built on the ethereum protocol, which has helped the cryptocurrency gain traction.\nshow chapters Ethereum co-creator says the cryptocurrency could triple this year 7:31 PM ET Mon, 8 Jan 2018 | 05:45 \"Ether's price rally is a testament to the growing popularity of ethereum as a platform for decentralized applications. Over the last year and a half, we've seen that the majority of tokens issued during ICOs and traded on exchanges, have been coded to run on the ethereum network,\" Thomas Glucksmann, head of APAC business development for cryptocurrency exchange Gatecoin, told CNBC by email.\nSome of the developers behind ethereum have also been speaking publicly about the cryptocurrency. Steven Nerayoff, one of its co-creators said the increasing number of projects built on the Ethereum blockchain could trigger a so-called \"flippening\" in 2018, leading the digital coin to overtake bitcoin. Flippening refers to investors putting money into alternative cryptocurrencies.\nNerayoff told CNBC on Monday that the price of ethereum could \"easily\" double or triple by the end of the year.\nBut many have also sounded the alarm about the cyrptocurrency market. Another Ethereum co-founder Charles Hoskinson told CNBC on Tuesday that the cryptocurrency market will see a \"crash\" and then consolidation. Noted Wall Street bear Davis Stockman, Ronald Reagan's former director of the Office of Management, also told CNBC that the cryptocurrency boom will end disastrously.\n\"It's basically a class of really stupid speculators who have convinced themselves that trees grow to the sky,\" he said in an interview earlier this month.", "external_links": [], "published": "2018-01-10T11:16:00.000+02:00", "crawled": "2018-01-10T10:30:13.030+02:00", "highlightTitle": ""}