{"organizations": [], "uuid": "fad06561264d65090906ae022fed73c668cd51bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225612487&w=1200&r=LYNXMPEE0P1CK", "site_section": "http://feeds.reuters.com/reuters/INtopNews\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/soccer-england-yeo-mun/sanchez-stars-on-debut-to-help-manchester-united-progress-past-yeovil-idINKBN1FF2VQ", "country": "US", "domain_rank": 408, "title": "Sanchez stars on debut to help Manchester United progress past Yeovil", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T00:22:00.000+02:00", "replies_count": 0, "uuid": "fad06561264d65090906ae022fed73c668cd51bb"}, "author": "", "url": "https://in.reuters.com/article/soccer-england-yeo-mun/sanchez-stars-on-debut-to-help-manchester-united-progress-past-yeovil-idINKBN1FF2VQ", "ord_in_thread": 0, "title": "Sanchez stars on debut to help Manchester United progress past Yeovil", "locations": [], "entities": {"persons": [{"name": "sanchez", "sentiment": "negative"}, {"name": "romelu lukaku", "sentiment": "none"}, {"name": "jose mourinho", "sentiment": "none"}, {"name": "marcus rashford", "sentiment": "none"}, {"name": "ander herrera", "sentiment": "none"}, {"name": "sergio romero", "sentiment": "none"}, {"name": "alexis sanchez", "sentiment": "none"}, {"name": "jesse lingard", "sentiment": "none"}, {"name": "huish park", "sentiment": "none"}], "locations": [{"name": "yeovil", "sentiment": "none"}, {"name": "yeovil town", "sentiment": "none"}, {"name": "jordan green", "sentiment": "none"}], "organizations": [{"name": "manchester united", "sentiment": "negative"}, {"name": "manchester unite", "sentiment": "negative"}, {"name": "yeovil reuters staff", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Debutant Alexis Sanchez had little trouble adjusting to his new place in Manchester United’s line-up as he assisted the opening two goals in the Premier League club’s 4-0 FA Cup fourth round win at Yeovil Town on Friday.\nMarcus Rashford and Ander Herrera both benefited from the Chilean’s presence either side of halftime, while Jesse Lingard and Romelu Lukaku scored late on as the 12-times FA Cup champions overcame a spirited performance from the League Two hosts.\nDespite a shaky start to the match, it proved to be a very happy evening for manager Jose Mourinho to mark his 55th birthday, a day after committing his future to Old Trafford until 2020.\nThe Portuguese coach, who previously criticised his side for their lack of intensity in falling to lower league side Bristol City in the League Cup last month, this time hailed his side’s ‘correct attitude’ and singled out the maturity of his new signing in particular.\n“Everybody is happy that he (Sanchez) comes because good players want good players and Alexis is a fantastic player for us,” Mourinho told the BBC.\n“And the question as well is which one is going to be axed, where is he going to play – it is not about that for us. For us it is the fact that we have a fantastic group of attacking players and he’s another one with a bit more maturity, more experience.”\nSoccer Football - FA Cup Fourth Round - Yeovil Town vs Manchester United - Huish Park, Yeovil, Britain - January 26, 2018 Manchester United’s Alexis Sanchez celebrates their second goal with Scott McTominay Action Images via Reuters/Paul Childs Yeovil started the brighter of the two teams in front of a packed Huish Park and had the first shots on goal, Jordan Green in particular testing stand-in United goalkeeper Sergio Romero after 15 minutes.\nHowever, they went behind after 41 minutes when Sanchez played in Rashford who was fortunate that Yeovil defender Thomas James hesitated to clear, allowing the English striker to put the ball in.\nSlideshow (6 Images) Hopes of an upset were further dashed in a swift United counter-attack around the hour mark, with Sanchez once again the provider to the overlapping Herrera, who rifled in with his left foot.\nSanchez’s replacement Lingard continued his recent fine run of form by running into the opposition penalty area late on and firing in his 12th goal of the season in all competitions.\nLukaku then grabbed his third goal of 2018 with a close finish to cap a flattering win for Mourinho’s men.\nUnited will discover their fifth round opponents when the draw is made on Monday, two days before they return to Premier League action at Tottenham Hotspur.\nReporting by Christian Radnedge; Editing by Pritha Sarkar\n ", "external_links": [], "published": "2018-01-27T00:22:00.000+02:00", "crawled": "2018-01-27T00:53:25.002+02:00", "highlightTitle": ""}