{"organizations": [], "uuid": "438460b886bb9a008fa16efeeee6558a49ef6ce7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219624764&w=1200&r=LYNXMPEE040X4", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-global-economy-outlook/data-machine-cranks-back-into-high-gear-for-2018-idUKKBN1EU1I0", "country": "US", "domain_rank": 408, "title": "Data machine cranks back into high gear for 2018", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T17:12:00.000+02:00", "replies_count": 0, "uuid": "438460b886bb9a008fa16efeeee6558a49ef6ce7"}, "author": "", "url": "https://uk.reuters.com/article/uk-global-economy-outlook/data-machine-cranks-back-into-high-gear-for-2018-idUKKBN1EU1I0", "ord_in_thread": 0, "title": "Data machine cranks back into high gear for 2018", "locations": [], "entities": {"persons": [{"name": "angela merkel", "sentiment": "none"}, {"name": "lawson", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "stuttgart", "sentiment": "none"}, {"name": "reutlingen", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "min read  london - data", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 3:13 PM / Updated 9 minutes ago Data machine cranks back into high gear for 2018 Hugh , Lawson 4 Min Read \nLondon - Data in the weak ahead will enable investors to gauge the strength of German and British industry, U.S. spending and Chinese trade at the end of last year - and the first hints on the strength of economic activity at the start of 2018. FILE PHOTO - Semiconductor wafer is seen in a diffusion furnace in the company manufacturing base in Reutlingen near Stuttgart, Germany June 16, 2017. REUTERS/Michaela Rehle \nThe German economy has been firing on all cylinders in recent months, with consumption, state spending and rising exports driving growth in both industry and services. \nWith interest rates low and the labour market performing well, the economy has so far weathered the political impasse resulting from Chancellor Angela Merkel’s failure to form a government since an election in September. She launches coalition talks on Sunday with the Social Democrats, her partners from the 2013-17 administration. \nIndustrial orders have been strong in recent months, suggesting this sector of Europe’s biggest economy should gain steam at the start of 2018, although actual output has unexpectedly slipped following a more than six-year high hit in August. \nAnalysts at HSBC think that imbalance is likely to have rectified itself to some degree in November, and they forecast a hefty rise in output in particular. \n“We expect the order level to be unchanged in November after having risen in the three consecutive months,” they wrote in a note to investors. That would undercut the Reuters consensus forecast for a 0.5 percent rise in orders. \nBut HSBC expects production to have rebounded by 2.2 percent month on month in November, outstripping the Reuters consensus call for 1.8 percent. \nThe German orders data is due out on Monday, with output figures to follow on Tuesday. \nBy contrast, British industrial output has been buoyant, expanding in October at its fastest annual pace in almost a year. While the economy has lost momentum as sterling’s tumble after the Brexit vote sent inflation climbing, some exporters have gained from the weaker pound and the rebound in the euro zone economy. \n“While actual manufacturing output may not be as strong as ... surveys suggest, the uniformly sharp pick-up reported by them implies growth has been decent in November,” analysts at Investec wrote in a note. \n“Additional support may come from utilities output as temperatures dropped to more typical seasonal levels after a particularly mild October.” \nInvestec sees industrial production rising 0.8 percent on the month, more than double the Reuters consensus forecast for a 0.3 percent pickup. The data is due out on Wednesday. \nThere are no major central bank decisions due in the coming week. G2 FRIDAY \nThe broader outlook for both Germany and Britain depends to some extent on the performance of the world’s two behemoth economies, the United States and China, where economic growth has been met with gradually tightening monetary policies. \nU.S. consumer spending, which accounts for more than two-thirds of economic activity, has been supported by steady wage gains as the labour market tightens, potentially paving the way for more Federal Reserve interest rate hikes this year. \nIn November, retail sales across the country increased more than expected. Analysts at HSBC suggested the reading for December, due out on Friday, may show a slightly less frantic pace of shopping as Christmas approached. \nAnalysts polled by Reuters on average expect sales to have risen 0.5 percent month on month, slowing down from November’s 0.8 percent gain. \nThanks to strong global demand, consumers lapped up Chinese goods at a rapid rate last year, giving the economy a boost and providing policymakers with room to tighten rules to curb high-risk lending. \nIn November, exports and imports both unexpectedly accelerated, but analysts expect growth to continue cooling amid a government crackdown on financial risks and polluting factories. \nData for December is expected to show growth in both exports and imports eased somewhat last month, according to the consensus view of analysts polled by Reuters - but staying in or near double-digit percentages. Reporting by Hugh Lawson; editing by John Stonestreet", "external_links": [], "published": "2018-01-05T17:12:00.000+02:00", "crawled": "2018-01-05T17:24:35.005+02:00", "highlightTitle": ""}