{"organizations": [], "uuid": "35c8e2836bb366a68206694339e52541984bf9e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-aar-ceo-david-p-storch-announces-plans-to-retire.html", "country": "US", "domain_rank": 767, "title": "AAR CEO David P. Storch Announces Plans to Retire", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T01:00:00.000+02:00", "replies_count": 0, "uuid": "35c8e2836bb366a68206694339e52541984bf9e0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-aar-ceo-david-p-storch-announces-plans-to-retire.html", "ord_in_thread": 0, "title": "AAR CEO David P. Storch Announces Plans to Retire", "locations": [], "entities": {"persons": [{"name": "david p. storch", "sentiment": "negative"}, {"name": "storch", "sentiment": "none"}, {"name": "john m. holmes", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "holmes", "sentiment": "none"}, {"name": "james goodwin", "sentiment": "none"}], "locations": [{"name": "ill.", "sentiment": "none"}], "organizations": [{"name": "aar", "sentiment": "negative"}, {"name": "aar corp.", "sentiment": "negative"}, {"name": "the board", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "aar board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WOOD DALE, Ill., Jan. 9, 2018 /PRNewswire/ -- Chairman and Chief Executive Officer of AAR Corp. (NYSE: AIR), David P. Storch, 65, announced today his plan to retire as CEO after 39 years with the Company effective May 31, 2018. AAR President and Chief Operating Officer John M. Holmes was elected by the Board of Directors today at its regularly scheduled quarterly meeting to become CEO effective June 1, 2018. Storch will continue to lead the Board as its non-executive Chairman and work alongside Holmes on business strategy, talent development and industry relations.\n\"David's entrepreneurial spirit and leadership helped AAR to stay one step ahead during his 39 years at the Company. He not only had a vision but also the ability to rally AAR employees around his vision to take AAR to the next level,\" said AAR Board Member and Lead Director James Goodwin. \"The Board believes John has the experience to be the next leader, having learned every aspect of the business on his way up the ranks. The succession planning the Board conducted, under David's leadership, will allow for a smooth transition and continued success for the Company under John.\"\n\"The Board and I have tremendous confidence in John's ability to take AAR to new heights,\" said Storch. \"Since joining the Company in 2001, John has successfully navigated the peaks and valleys of the aviation industry. He has been a key leader in AAR's progress toward becoming the best provider of aviation services worldwide, consistently producing superior growth rates across the businesses.\"\nHolmes joined AAR from investment banking 16 years ago as Director of Mergers and Acquisitions, became General Manager of AAR's parts trading business in 2003, and progressively assumed responsibility for the other solutions that comprise Aviation Services – Integrated Supply Chain, OEM Aftermarket Solutions, Intelligent Solutions and MRO Services – culminating in becoming President and Chief Operating Officer of AAR on June 1, 2017.\n\"During his tenure at AAR, John has exhibited strong leadership skills, the vision to identify new markets for growth, and the ability to build a strong team around him,\" said Storch. \"Further, I have been grooming John for this day for the last few years, and the Board and I have been very impressed with his growth as a leader. We know he is ready for this next step.\"\n\"David has been a wonderful mentor since the day he hired me over 16 years ago,\" said Holmes. \"This is truly an honor, and I am grateful to the Board and humbled by the opportunity to continue the strong leadership that David has provided for the last few decades.\"\n\"We are well into the transformation of AAR, with more actions coming to better serve the needs of commercial and government customers worldwide,\" said Storch. \"I am proud of our upward trajectory and fully confident in the ability of John and our team to execute on our aspiration to be the best aviation services company in the world. I look forward to continuing to work closely with and mentor John as he assumes his new position.\"\nAbout AAR\nAAR is a global aftermarket solutions company that employs more than 5,000 people in over 20 countries. Based in Wood Dale, Illinois, AAR supports commercial aviation and government customers through two operating segments: Aviation Services and Expeditionary Services. AAR's Aviation Services include inventory management; parts supply; OEM parts distribution; aircraft maintenance, repair and overhaul; and component repair. AAR's Expeditionary Services include airlift operations; mobility systems; and command and control centers in support of military and humanitarian missions. More information can be found at www.aarcorp.com .\nThis press release contains certain statements relating to future results, which are forward-looking statements as that term is defined in the Private Securities Litigation Reform Act of 1995. These forward- based on beliefs of Company management, as well as assumptions and estimates based on information currently available to the Company, and are subject to certain risks and uncertainties that could cause actual results to differ materially from historical results or those anticipated, including those factors discussed under Item 1A, entitled \"Risk Factors\", included in the Company's Form 10-K for the fiscal year ended May 31, 2017. Should one or more of these risks or uncertainties materialize adversely, or should underlying assumptions or estimates prove incorrect, actual results may vary materially from those described. These events and uncertainties are difficult or impossible to predict accurately and many are beyond the Company's control. The Company assumes no obligation to update any forward-looking statements to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events. For additional information, see the comments included in AAR's filings with the Securities and Exchange Commission.\nView original content with multimedia: http://www.prnewswire.com/news-releases/aar-ceo-david-p-storch-announces-plans-to-retire-300580355.html\nSOURCE AAR", "external_links": ["http://www.aarcorp.com/", "http://www.prnewswire.com/news-releases/aar-ceo-david-p-storch-announces-plans-to-retire-300580355.html"], "published": "2018-01-10T01:00:00.000+02:00", "crawled": "2018-01-10T02:24:53.000+02:00", "highlightTitle": ""}