{"organizations": [], "uuid": "b2cd3e55d00c18ffa55901a38d76fa5d7d813fd9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/23/cnbc-interview-with-juan-manuel-santos-president-of-colombia-from-the-world-economic-forum-2018.html", "country": "US", "domain_rank": 767, "title": "CNBC Interview with Juan Manuel Santos, President of Colombia from the World Economic Forum 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.167, "site_type": "news", "published": "2018-01-23T19:54:00.000+02:00", "replies_count": 0, "uuid": "b2cd3e55d00c18ffa55901a38d76fa5d7d813fd9"}, "author": "", "url": "https://www.cnbc.com/2018/01/23/cnbc-interview-with-juan-manuel-santos-president-of-colombia-from-the-world-economic-forum-2018.html", "ord_in_thread": 0, "title": "CNBC Interview with Juan Manuel Santos, President of Colombia from the World Economic Forum 2018", "locations": [], "entities": {"persons": [{"name": "juan manuel santos", "sentiment": "negative"}, {"name": "steve sedgwick", "sentiment": "none"}], "locations": [{"name": "colombia", "sentiment": "none"}], "organizations": [{"name": "cnbc interview", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC Interview with Juan Manuel Santos, President of Colombia from the World Economic Forum 2018 Published 12:54 PM ET Tue, 23 Jan 2018 CNBC.com SHARES \nFollowing are excerpts from a CNBC interview with Juan Manuel Santos, President of Colombia and Steve Sedgwick from the World Economic Forum 2018. \nSteve Sedgwick: I'm delighted to welcome Juan Manuel Santos, the president of Colombia, to our show. Nice to see you Sir \nJuan Manuel Santos: Thank you for having me. \nSS: Well no it's absolute pleasure. Look, there are so many issues I can talk to you about. I mean, the electoral cycle, Colombian elections, 27th of May of course. You're not standing I believe. You had two terms as well. How well a place is Colombia? Given that everything that has gone on, everything you've done to bring peace to your country, to bring economic prosperity to your country. What kind of legacy are you leaving for the next man or woman? \nJMS: We are leaving a country at peace after more than fifty years of war; and a strong economy, an economy that has its fundamentals in place. It's growing. It's creating employment, farmer employment, it's at the centre of the integration, for example the Pacific Alliance which is doing very well. We leave a stronger democracy, more inclusive because of the peace. So I think Colombia is very well placed for the future and I hope that my successor simply builds on what we have built. \nSS: At this stage of peace, it can be fragile, and one hears reports about some troubles, perhaps they heard bombing here and there as well, about FARC resurgence in certain parts as well. Do you have concerns about the fragility of the peace accord or actually do you think it is built on pretty solid foundations? \nJMS: No it's build on pretty solid foundations. I say that building peace is like building a cathedral. You have to have a solid base and then you do it brick by brick. But the process is irreversible. There's no way back. And there are problems which are natural in the transition of a country that has been fifty years at war towards peace. There are some people who did not come into the democratic sphere, they are still outlaws. We have more than the capability to confront them. And all transitions are troublesome. But basically we are doing very well in less than a year. The FARC has given up their arms. They are now a political party. They are now doing politics which what a peace process was all about. \nSS: In terms of the economic dividend, turning farmers from illicit crops into ones that can actually boost your country's export, looking at mineral riots in parts of the country which were off bounds really for the federal government previously as well. What stage are we at? Because it is about domestic investment but also there's a huge number of international companies that I know you've worked so hard to get back into Colombia. \nJMS: Well, first… Simply to have peace brings huge investment. Areas like tourism, tourism is \nSS: Yeah \nJMS: one of the areas that \nSS: It's huge at the moment isn't it ? JMS: And it is growing at a very fast rate. Many people did not want to look at Colombia simply because we were on the list of countries with armed conflict. Not anymore. So we are seeing forward investment in many areas coming in, and you mentioned one which is very particular, where I think the benefit is going to be huge, which is the agro-business, the agriculture areas. More than one third of the country was out of bounds because of the war. And it is very fertile, very rich terrains. There are now being formalised. We are bringing infrastructure. We are giving part of the lands to the peasants. We are promoting investment in agro-business. So that's an area that has already been growing. The sector that is growing the fastest in Colombia strangely enough right now is the agricultural sector because of that. \nSS: One of your ministers was telling me I think it was about a year or so ago about how you would take advantage of perhaps Brazil's wows on the coffee production front and taking advantage on that as well. \nJMS: And we're doing that. \nSS: In some style sir. Now I do want to ask you about international partners. I haven't got a huge amount of time left with you; I know your time is very precious. Traditionally one would say the US is a very important international partner with you as well. Of course it has been on the war on drugs as well, amongst other things as well. Is US always looking now forward do you think into being the most reliable partner or is it… it almost seems conceivable that the country that countries such as China would be better investors and perhaps longer term partners given the different aspirations of the leadership of the two countries \nJMS: Well the US has been our number one for many, many years, in trade and in investment. And we are not one of the countries that have a negative balance with the US or… we're not in trouble. \nSS: Ok. \nJMS: And we hope we can grow much more. We're very near, from the coast of Colombia to Miami, it's two hours by flight so it's a market that we have to take even more advantage of because our free trade agreement with the US is relatively recent, it's not more than six, seven years. So we need to have more activity with the US but we're seeing the Chinese and other areas of the… the Europeans of course are very good partners, more and more interested in Colombia. Not only because of Colombia but because of our geographical location. We are at the centre of the Americas. \nSS: Sure. \nJMS: Because of the Pacific Alliance which is becoming very attractive for any investor. And so we are in a very good position. \nSS: Mister Meirelles which I am sure you know well, Finance Minister of Brazil, said to me \"a bit of advice Mr Trump: don't do it, don't go down the protectionist route.\" Have you got some advice for Mr Trump? \nJMS: The same. The same. I am a believer in free trade, fair free trade. Protectionism is something that will hurt everybody but I think especially the US. \nSS: It is a real pleasure speaking to you. More From CNBC News Releases ", "external_links": [], "published": "2018-01-23T19:54:00.000+02:00", "crawled": "2018-01-25T00:28:09.015+02:00", "highlightTitle": ""}