{"organizations": [], "uuid": "9cc11638fbd8932d3d24bfbe43e4090ed000965b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224341167&w=1200&r=LYNXMPEE0M02H", "site_section": "http://feeds.reuters.com/Reuters/domesticNews\r", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-shutdown-dreamers/dreamers-disappointed-that-congress-deferred-daca-deal-idUSKBN1FC05Q", "country": "US", "domain_rank": 408, "title": "'Dreamers' disappointed that Congress deferred DACA deal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T05:09:00.000+02:00", "replies_count": 0, "uuid": "9cc11638fbd8932d3d24bfbe43e4090ed000965b"}, "author": "", "url": "https://www.reuters.com/article/us-usa-shutdown-dreamers/dreamers-disappointed-that-congress-deferred-daca-deal-idUSKBN1FC05Q", "ord_in_thread": 0, "title": "'Dreamers' disappointed that Congress deferred DACA deal", "locations": [], "entities": {"persons": [{"name": "haron bernstein", "sentiment": "none"}, {"name": "jovan rodriguez", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "negative"}, {"name": "daca", "sentiment": "negative"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 2:01 AM / Updated 9 hours ago 'Dreamers' disappointed that Congress deferred DACA deal Sharon Bernstein 4 Min Read \n(Reuters) - Young “Dreamers” brought to the United States illegally as children were angry and disappointed on Monday after the U.S. Congress approved a temporary spending bill to end a three-day government shutdown without a deal to shore up their shaky legal status. \nU.S. Senate Democrats accepted the bill to restore funds to keep the government running for three more weeks in exchange for a promise by Republicans to hold a debate on the status of the young immigrants. \n“It’s irresponsible of everyone in Congress not to pass something,” said Jovan Rodriguez, 27, who was brought to the United States from Mexico by his parents when he was 3 years old. “I‘m really disappointed.” \nRepublican U.S. President Donald Trump was expected to sign the legislation, putting government workers who were furloughed back to work. \nLast year, Trump ordered an end by March to protections provided to the estimated 700,000 Dreamers under the 2012 Deferred Action for Childhood Arrivals program, or DACA, program, an executive order put in place by former Democratic President Barack Obama. \nUnder the program, young people who qualified were allowed to live openly in the United States, working and attending college and shielded from deportation. A court has put a temporary stay on Trump’s order. \nAfter news of the spending bill, some Dreamers and their supporters briefly blocked the entrance to Disneyland in California. Marches and civil disobedience were planned in Los Angeles, San Diego, Washington and elsewhere. \nDemocratic lawmakers had initially vowed to oppose any bill to fund the government without an agreement to restore the DACA protections. But Republicans refused to budge, instead tying the spending bill to a program favored by Democrats that provides healthcare to poor and working-class children. \n“Our members, including my brother Jonathan, are in greater danger today because of the cowardice of U.S. Senators,” activist Cristina Jimenez, executive director of group United We Dream said in an emailed statement. People protest for immigration reform for DACA recipients and a new Dream Act, in Los Angeles, California, U.S. January 22, 2018. REUTERS/Lucy Nicholson SCHUMER EXPECTS TO WIN DACA DEAL \nThe leader of the Senate Democrats, New York Senator Chuck Schumer, said on Twitter he believed he would have enough votes to bring a deal on DACA to the Senate floor and pass it. \nSchumer said he expected Republican Majority Leader Mitch McConnell to honor his promise to open debate on the issue. “If he does not honor our agreement, he will have breached the trust of not only the Democratic Senators but the members of his own party as well.” People protest for immigration reform for DACA recipients and a new Dream Act, in Los Angeles, California, U.S. January 22, 2018. REUTERS/Lucy Nicholson \nActivists said they planned to make their feelings known at the ballot box, targeting Republicans who have railed against illegal immigration as well as moderate Democrats who voted for Monday’s deal. \n“We will be organizing voters, the people who will bring the consequences,” Adrian Reyna, 26, said by telephone. \nAn Oakland, California, resident who was brought to the United States from Mexico at age 11, Reyna said he started to work for passage of legislation to protect fellow Dreamers during his student days at the University of Texas. \nAny legislation to protect Dreamers, even if it makes it through the Senate, could easily stall in the more conservative House of Representatives, unless Democrats manage to win back seats in the 2018 elections and exert more pressure, said Larry Sabato, a political analyst with the University of Virginia. \nThe headwinds scare Diego Corzo, an 27-year-old who built a successful real estate business in Texas but worries it could all be taken away. \n“I will be living under a lot of stress, a lot of uncertainty and fear that everything that I worked so hard to accomplish can be gone,” Corzo said by telephone. Reporting by Sharon Bernstein in Sacramento, Calif.", "external_links": [], "published": "2018-01-23T05:09:00.000+02:00", "crawled": "2018-01-23T05:21:06.008+02:00", "highlightTitle": ""}