{"organizations": [], "uuid": "53508d4879cea16569b0585f62cc965f83c2e252", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/myanmar-military/myanmar-to-sign-ceasefire-with-two-rebel-groups-amid-decades-of-conflict-idINKBN1FD0IK", "country": "US", "domain_rank": 408, "title": "Myanmar to sign ceasefire with two rebel groups amid decades of conflict", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T08:34:00.000+02:00", "replies_count": 0, "uuid": "53508d4879cea16569b0585f62cc965f83c2e252"}, "author": "", "url": "https://in.reuters.com/article/myanmar-military/myanmar-to-sign-ceasefire-with-two-rebel-groups-amid-decades-of-conflict-idINKBN1FD0IK", "ord_in_thread": 0, "title": "Myanmar to sign ceasefire with two rebel groups amid decades of conflict", "locations": [], "entities": {"persons": [{"name": "suu kyi", "sentiment": "none"}, {"name": "aung san suu kyi", "sentiment": "none"}, {"name": "aung hlaing", "sentiment": "none"}], "locations": [{"name": "myanmar", "sentiment": "none"}, {"name": "bangladesh", "sentiment": "none"}, {"name": "yangon", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "lahu democratic union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "new mon state party", "sentiment": "none"}, {"name": "nca", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "YANGON (Reuters) - Two armed ethnic groups in Myanmar have agreed to sign a ceasefire with the government, state media reported on Wednesday, as leader Aung San Suu Kyi seeks to revive a stuttering peace process to end decades of conflict.\nEnding near-perpetual civil war has been Suu Kyi’s stated top priority, but the Buddhist-majority country has seen the worst fighting with rebels in years since she took office 22 months ago.\nThe peace process, which has been eclipsed in world media coverage by the plight of hundreds of thousands of Muslim Rohingya refugees fleeing to neighbouring Bangladesh, is key to unlocking the resource-rich country’s potential and guaranteeing development for its more than 50 million people.\nNew Mon State Party and the Lahu Democratic Union agreed to sign the National Ceasefire Agreement (NCA) after a meeting with Suu Kyi and the military’s commander-in-chief, Senior General Min Aung Hlaing, in the capital, Naypyitaw, on Tuesday, state-run newspaper Global New Light of Myanmar reported.\n“I thank our ethnic national brothers and sisters and ethnic Mon and Lahu nationals for helping in the enduring existence of the union, peace in the union and development based on peace,” Suu Kyi was Quote: d as saying at a press briefing.\nIt was not immediately clear when the agreement will be signed.\nThe two groups have not engaged in active fighting with the military in recent years, but analysts said it marks a positive move for negotiations with other armed groups.\nAt least 10 rebel groups have not joined the NCA, an accord negotiated by the previous quasi-civilian administration. Suu Kyi has opened new round of talks with some of the groups since last May.\nThe Nobel Peace Prize winner had been criticised overseas for not standing up for the largely stateless Rohingya in the western state of Rakhine, where an army crackdown forced more than 688,000 to flee to Bangladesh since Aug. 25 last year.\nThe United Nations described Myanmar’s crackdown as ethnic cleansing of the Rohingya, a charge Myanmar denies.\nReporting by Yimou Lee and Shoon Naing; Editing by Nick Macfie\n ", "external_links": [], "published": "2018-01-24T08:34:00.000+02:00", "crawled": "2018-01-24T09:01:59.023+02:00", "highlightTitle": ""}