{"organizations": [], "uuid": "c305b143fa00e7bdb7fb2fc40b952d60e7722393", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1227029015&w=1200&r=LYNXMPEE0U1FJ", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-twitter-islamicstate/lawsuit-saying-twitter-aided-islamic-state-thrown-out-by-u-s-appeals-court-idUSKBN1FK2QD", "country": "US", "domain_rank": 408, "title": "Lawsuit saying Twitter aided Islamic State thrown out by U.S. appeals court", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T20:16:00.000+02:00", "replies_count": 0, "uuid": "c305b143fa00e7bdb7fb2fc40b952d60e7722393"}, "author": "", "url": "https://www.reuters.com/article/us-twitter-islamicstate/lawsuit-saying-twitter-aided-islamic-state-thrown-out-by-u-s-appeals-court-idUSKBN1FK2QD", "ord_in_thread": 0, "title": "Lawsuit saying Twitter aided Islamic State thrown out by U.S. appeals court", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - A federal appeals court in San Francisco ruled on Wednesday that Twitter Inc is not liable to families of two U.S. government contractors killed in an Islamic State attack in Jordan for having failed to block that group from using its accounts and messaging services.\nThe 9th U.S. Circuit Court of Appeals ruled 3-0 that the families failed to show that the Nov. 9, 2015 shooting deaths of Lloyd Fields and James Creach at a police training center in Amman resulted from Twitter’s knowing material support of Islamic State, which claimed responsibility for the attack.\nCircuit Judge Milan Smith said no damages were justified under the federal Anti-Terrorism Act because the plaintiffs, who include the victims’ widows, did not show “at least some direct relationship” between their injuries and Twitter’s conduct.\nHe said the plaintiffs did not show any connection between Twitter and the shooter, Jordanian police officer Anwar Abu Zeid, or that the attack was helped by or resulted from Islamic State’s presence on Twitter. The gunman was later killed by local security forces.\n“Communication services and equipment are highly interconnected in modern economic and social life, such that the provision of these services and equipment to terrorists could be expected to cause ripples of harm to flow far beyond the defendant’s misconduct,” Smith wrote. “Nothing in [the law] indicates that Congress intended to provide a remedy to every person reached by these ripples.”\nJoshua Arisohn, a lawyer for the families, said in an email that his clients were “extremely disappointed” and were weighing their legal options.\n“Requiring a more direct connection between the provision of material support to terrorists and the attacks that they carry out contravenes the central purpose of the Anti-Terrorism Act: holding enablers of terrorists accountable,” he said.\nTwitter and its lawyer, Seth Waxman of WilmerHale, did not immediately respond to requests for comment.\nWednesday’s decision upheld an August 2016 ruling by U.S. District Judge William Orrick in San Francisco.\nAlphabet Inc’s Google and Facebook Inc have also faced damages lawsuits for allegedly letting entities that U.S. authorities view as terrorist groups use their online platforms.\nThe case is Fields et al v Twitter Inc, 9th U.S. Circuit Court of Appeals, No. 16-17165.\nReporting by Jonathan Stempel in New York; Editing by Frances Kerry\n ", "external_links": [], "published": "2018-01-31T20:16:00.000+02:00", "crawled": "2018-01-31T20:33:37.003+02:00", "highlightTitle": ""}