{"organizations": [], "uuid": "9c0f846aa6e311aa4c4a162c060444689093a3c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/03/104925773-RTX42M7S.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/puerto-rican-christmas-felt-sadder-and-quieter-this-year-for-obvious-reasons.html", "country": "US", "domain_rank": 767, "title": "Puerto Rican Christmas felt sadder and quieter this year for obvious reasons", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.039, "site_type": "news", "published": "2018-01-04T20:02:00.000+02:00", "replies_count": 0, "uuid": "9c0f846aa6e311aa4c4a162c060444689093a3c7"}, "author": "Fred Imbert", "url": "https://www.cnbc.com/2018/01/04/puerto-rican-christmas-felt-sadder-and-quieter-this-year-for-obvious-reasons.html", "ord_in_thread": 0, "title": "Puerto Rican Christmas felt sadder and quieter this year for obvious reasons", "locations": [], "entities": {"persons": [{"name": "fred imbert", "sentiment": "negative"}, {"name": "hurricane maria", "sentiment": "none"}], "locations": [{"name": "san juan", "sentiment": "none"}, {"name": "puerto rico", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "fema", "sentiment": "none"}, {"name": "u.s. army corps of engineers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "I visited Puerto Rico for a week from Dec. 23 until Dec. 30. It was my first time visiting my friends and family since Hurricane Maria ravaged the island in September. I was happy to be back, but I also felt somewhat guilty not having experienced the destruction left in the storm's wake first-hand.\nI could tell people were exhausted from everything they went through. The uphill recovery they were staring down didn't help the situation, either.\nI went out for drinks with my brother-in-law one night. We ran into a friend of his that worked with the U.S. Army Corps of Engineers making sure the power generators used by FEMA were running smoothly.\nThis guy has traveled the entire island over the past three months. He told us stories of what he saw and gave his assessment of the situation. He said there are parts of the island that are slowly recovering. However, he would advise people to leave if they lived in one of the smaller towns in the center of the island.\nMy brother-in-law's friend noted he was skeptical of the government expecting to have power fully restored by May, especially in those smaller towns. Given what I know about the situation and what I saw, I can't say I'm surprised by this.\nIt's been more than three months since the storm hit the island. Only 55 percent of Puerto Rico Electric Power Authority customers have power. Many of those customers had to wait months before the power returned. My mom, for example, was without power for three months, with it only coming back in late December.\nThe blackouts not only led to desperation, but also deaths. An analysis conducted by The New York Times found that deaths in Puerto Rico stemming from the hurricane could total more than 1,000 . Also, more than 200,000 residents have now moved to Florida from the island after the hurricane.\nThe damage done to the island is still visible in Puerto Rico's capital, San Juan. On my way home from the airport, I saw power lines still down, intersections without working traffic lights and knocked-down road signs. The roads themselves were also in worse shape than prior to the hurricane's arrival. When I visited my brother, I saw a parking spot being taken up by a tree.\nFred Imbert | CNBC Damaged power lines hang over a street in San Juan, Puerto Rico. These are just some elements that made for an uncharacteristically calm Christmas in Puerto Rico.\nChristmas in Puerto Rico is usually quite different from Christmas in the U.S. It's livelier, it's warmer (both literally and figuratively), and it lasts a lot longer (people are usually celebrating the holidays until late January).\nThat excitement wasn't in the air this time.\nPuerto Ricans use Christmas and the holidays to forget about one's troubles and enjoy the company of their friends and family. And while I was lucky enough to do this, I could tell that my loved ones and the people I talked to were still recovering from the Category 4 storm on an emotional level.\nYou could also gauge the mood and general feeling in Puerto Rico just by going out at night.\nNightlife hubs like La Placita de Santurce and Old San Juan were filled with far less people than in years past. Just to give you an example, I went to La Placita one night. Usually, it would take at least 35 minutes to find a parking spot. This time, I was able to find a spot and arrive at the nearest bar in less than 10 minutes.\nI didn't get the sense that hope was completely lost, however. There are still lots of people in Puerto Rico betting the island will not only pull through but come out of this crisis stronger.\nThat hope, however, will not last forever.\nPuerto Rico's recovery will be long and arduous. Some people lost all of their belongings in the hurricane and decided to restart their lives elsewhere. Others left because they lost their jobs or businesses. Others are still weighing their options.\nThings will undoubtedly get tougher for Puerto Rico before they get better. But I do believe Puerto Rico will pull through and the little things like Christmas will go back to normal.\nWhen will that happen? I don't know, but I'm sure it will. At least I hope so.", "external_links": [], "published": "2018-01-04T20:02:00.000+02:00", "crawled": "2018-01-04T20:06:03.018+02:00", "highlightTitle": ""}