{"organizations": [], "uuid": "137ddf72025267464b24014c8b010781c4250a25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-southern-power-announces-acquisition-of-gaskell-west-1-solar-facility-in-california.html", "country": "US", "domain_rank": 767, "title": "Southern Power announces acquisition of Gaskell West 1 Solar Facility in California", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.99, "site_type": "news", "published": "2018-01-30T17:17:00.000+02:00", "replies_count": 0, "uuid": "137ddf72025267464b24014c8b010781c4250a25"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-southern-power-announces-acquisition-of-gaskell-west-1-solar-facility-in-california.html", "ord_in_thread": 0, "title": "Southern Power announces acquisition of Gaskell West 1 Solar Facility in California", "locations": [], "entities": {"persons": [{"name": "buzz miller", "sentiment": "none"}], "locations": [{"name": "california atlanta", "sentiment": "none"}, {"name": "kern county", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "southern company", "sentiment": "negative"}, {"name": "gaskell west", "sentiment": "negative"}, {"name": "southern power", "sentiment": "negative"}, {"name": "southern california edison", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 30, 2018 /PRNewswire/ -- Southern Company subsidiary Southern Power today announced the acquisition of its newest renewable asset, the 20-megawatt (MW) Gaskell West 1 Solar Facility in Kern County, California. This project aligns with Southern Power's business strategy of acquiring and developing projects covered by long-term contracts with counterparties with strong credit support.\n\"We are pleased to start the quarter with continued growth in our renewable portfolio,\" said Southern Power President and CEO Buzz Miller. \"Gaskell West 1 is an excellent fit for Southern Power's evolving business as we strive to meet market demands through our commitment to develop clean, safe, reliable and affordable energy resources for the benefit of our customers.\"\nConstruction of the approximately 280-acre project began in October 2017, and the facility is expected to begin commercial operation in March 2018. Southern California Edison will purchase the electricity and associated renewable energy credits (RECs) generated by the facility under a 20-year power purchase agreement and will have the option to keep or sell the associated RECs.\nSouthern Power purchased the facility from Recurrent Energy, which is developing the project. D.H. Blattner & Sons, Inc. is performing the engineering, procurement and construction (EPC) services, and First Solar Energy Services will operate and maintain the facility upon completion. Southern Power plans to use third-party tax equity as part of the funding of the transaction.\nThe announcement marks Southern Power's fifth solar facility within the county and 12 th solar facility within the state.\nWith the addition of Gaskell West 1, Southern Power owns more than 3,500 MW of renewable generation from 38 solar, wind and biomass facilities either announced, acquired or under construction from California to Maine. In total, the Southern Company system has added or announced more than 6,500 MW of renewable generation since 2012.\nAbout Southern Power\nSouthern Power, a subsidiary of Southern Company, is a leading U.S. wholesale energy provider meeting the electricity needs of municipalities, electric cooperatives, investor-owned utilities and other energy customers. Southern Power and its subsidiaries own 48 facilities operating or under development in 11 states with more than 12,800 MW of generating capacity in Alabama, California, Florida, Georgia, Maine, Minnesota, Nevada, New Mexico, North Carolina, Oklahoma and Texas.\nAbout Southern Company\nSouthern Company (NYSE: SO) is America's premier energy company, with 46,000 megawatts of generating capacity and 1,500 billion cubic feet of combined natural gas consumption and throughput volume serving 9 million electric and gas utility customers through its subsidiaries. The company provides clean, safe, reliable and affordable energy through electric utilities in four states, natural gas distribution utilities in seven states, a competitive generation company serving wholesale customers across America and a nationally recognized provider of customized energy solutions, as well as fiber optics and wireless communications. Southern Company brands are known for excellent customer service, high reliability and affordable prices that are below the national average. Through an industry-leading commitment to innovation, Southern Company and its subsidiaries are inventing America's energy future by developing the full portfolio of energy resources, including carbon-free nuclear, 21st century coal, natural gas, renewables and energy efficiency, and creating new products and services for the benefit of customers. Southern Company has been named by the U.S. Department of Defense and G.I. Jobs magazine as a top military employer, recognized among the Top 50 Companies for Diversity by DiversityInc, listed by Black Enterprise magazine as one of the 40 Best Companies for Diversity and designated a Top Employer for Hispanics by Hispanic Network. The company has earned a National Award of Nuclear Science and History from the National Atomic Museum Foundation for its leadership and commitment to nuclear development and is continually ranked among the top utilities in Fortune's annual World's Most Admired Electric and Gas Utility rankings. Visit our website at www.southerncompany.com .\nCautionary Notes Regarding Forward-Looking Statements:\nCertain information contained in this release is forward-looking information based on current expectations and plans that involve risks and uncertainties. Forward-looking information includes, among other things, statements concerning the construction and subsequent operation of the Gaskell West 1 Solar Facility. Southern Company and Southern Power caution that there are certain factors that can cause actual results to differ materially from the forward-looking information that has been provided. The reader is cautioned not to put undue reliance on this forward-looking information, which is not a guarantee of future performance and is subject to a number of uncertainties and other factors, many of which are outside the control of Southern Company and Southern Power; accordingly, there can be no assurance that such suggested results will be realized. The following factors, in addition to those discussed in each of Southern Company's and Southern Power's Annual Reports on Form 10-K for the year ended December 31, 2016, and subsequent securities filings, could cause actual results to differ materially from management expectations as suggested by such forward-looking information: the ability to control costs and avoid cost overruns during the development and construction of generating facilities, to construct facilities in accordance with the requirements of permits and licenses, and to satisfy any operational and environmental performance standards, including the requirements of tax credits and other incentives; and potential business strategies, including acquisitions or dispositions of assets or businesses, which cannot be assured to be completed or beneficial to Southern Company or Southern Power. Southern Company and Southern Power expressly disclaim any obligation to update any forward-looking information.\nView original content with multimedia: http://www.prnewswire.com/news-releases/southern-power-announces-acquisition-of-gaskell-west-1-solar-facility-in-california-300590242.html\nSOURCE Southern Power", "external_links": ["http://www.prnewswire.com/news-releases/southern-power-announces-acquisition-of-gaskell-west-1-solar-facility-in-california-300590242.html", "http://www.southerncompany.com/"], "published": "2018-01-30T17:17:00.000+02:00", "crawled": "2018-01-30T18:46:05.005+02:00", "highlightTitle": ""}