{"organizations": [], "uuid": "c502ef4d515e7a8afc33c31743b8ac1769ed55c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/02/15/104283820-GettyImages-635270998.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/fed-minutes-show-last-stand-by-yellen-and-the-doves.html", "country": "US", "domain_rank": 767, "title": "Fed minutes show 'last stand' by Yellen and the doves", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.038, "site_type": "news", "published": "2018-01-03T23:08:00.000+02:00", "replies_count": 0, "uuid": "c502ef4d515e7a8afc33c31743b8ac1769ed55c8"}, "author": "Patti Domm", "url": "https://www.cnbc.com/2018/01/03/fed-minutes-show-last-stand-by-yellen-and-the-doves.html", "ord_in_thread": 0, "title": "Fed minutes show 'last stand' by Yellen and the doves", "locations": [], "entities": {"persons": [{"name": "yellen", "sentiment": "negative"}, {"name": "jerome powell", "sentiment": "none"}, {"name": "janet yellen", "sentiment": "none"}], "locations": [], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "market insider fed", "sentiment": "negative"}, {"name": "federal open market committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Market Insider Fed minutes show 'last stand' by Yellen and the doves The final interest rate hike of the Yellen era was met by the usual divided Fed, but the scales will now tip toward the more hawkish voices. In minutes from its last meeting, the Federal Open Market Committee revealed a lingering divide over low inflation even as the Fed moved to raise interest rates. Janet Yellen will preside over one more meeting before Fed governor Jerome Powell takes over as Fed chair in February, and he will be surrounded by a new group of more hawkish voices. 1 Hour Ago | 04:37 \nThe final interest rate hike of the Yellen era was met by the usual divided Fed, but the scales will now tip toward the more hawkish voices. \nThe Federal Open Market Committee approved a quarter-point rate hike at its late December meeting, with most officials backing the continued path of gradual rate hikes. But according to the minutes from the Fed meeting , released Wednesday, there were Fed officials who were concerned by low inflation expectations even as others said they thought the tight labor market and tax hikes could help boost inflation. \nAs Janet Yellen prepares to hand the baton to incoming chair Jerome Powell in early February, the Fed is already commanding a more hawkish tone. Economists are increasingly expecting a potential four rate hikes this year, versus the three currently forecast by the Fed. \n\"It just seems the usual. The so-called hawks at the Fed are gradualists who think monetary policy needs to be normalized as the economy normalizes,\" said Ward McCarthy, chief financial economist at Jefferies. \"They don't want to fall behind the curve.\" \nOn the other side are the so-called doves, who McCarthy described as \"still perpetually pessimistic. This dose of policy normalization is an anathema to them, and they'll grab onto any straw to slow down the process. Frankly, this is their last stand, and they lost.\" \nYellen's Fed was centered around a dovish core, including Yellen as Fed chair, former Fed vice chair Stanley Fischer and New York Fed President William Dudley. Fischer has recently left the Fed, and Dudley is expected to leave in the middle of the year. \nThe Yellen Fed has raised rates five times, the first hikes since the Fed took the fed funds rate to zero during the financial crisis. It also has begun a process to scale back the Fed's balance sheet, expanded to $4.5 trillion by quantitative easing under former Fed chair Ben Bernanke as he sought to boost the economy. \n\"The Fed likes to be proactive, but it's reactionary,\" said Diane Swonk, CEO of DS Economics. Swonk said the strengthening labor market and higher wages would have helped push the Fed to hike rates and will push it further. \nThe tax cuts should further pressure labor costs in the U.S. at the same time the job market is tightening. \"It's a whole new world to have labor markets tighten again. It's something employers are just beginning to grasp,\" Swonk said. \n\"What's going to be interesting to see is [wage growth.] We know that there's going to be these one time earnings and there's going to be minimum wage increases and that's going to start showing up,\" Swonk said. A number of companies have announced one time bonuses for employees since the tax bill was signed into law last month. \nAlso this year the FOMC loses some of its more dovish voices, like Minneapolis Fed President Neel Kashkari and Chicago Fed President Charles Evans. Both voted against the rate hike. They are leaving the FOMC as part of a normal rotation making way for other members who happen to be more hawkish, like Cleveland Fed President Loretta Mester. \nThe Fed's next meeting is Jan. 30 and 31, and while it is Yellen's final meeting, there is not expected to be a rate hike. But the new Fed members could find their voices, including Randal Quarles, vice chair for supervision. \nPresident Donald Trump has also nominated former Fed official and Carnegie Mellon professor Marvin Goodfriend. \"He is a monetary policy scholar and one of his key criticisms of the Fed is they shouldn't fall behind the curve on inflation,\" said McCarthy. \nSluggish inflation has been an ongoing issue for the Fed, with some members expecting an eventual return to the Fed's 2 percent target and others wondering if there are other negative issues holding it back. \nThe market, during the Yellen era, was highly skeptical the Fed would raise rates because of low inflation, but as the Powell Fed and its new members are about to take over that view is changing, in part because the economy has accelerated and the tax cuts mean it could accelerate further. \n\"At the end of the day, the question is what happens to interest rates longer term,\" said Swonk. \"The economy is doing better, and the Fed is going to have to react to that.\" Patti Domm CNBC Markets Editor Playing", "external_links": [], "published": "2018-01-03T23:08:00.000+02:00", "crawled": "2018-01-03T23:33:27.024+02:00", "highlightTitle": ""}