{"organizations": [], "uuid": "948568f3f099f86049ec896851a644e7b3b858fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222409812&w=1200&r=LYNXMPEE0F0S0", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-israel-palestinians-gaza/palestinians-see-gaza-peace-dividend-pass-them-by-idUSKBN1F51DO", "country": "US", "domain_rank": 408, "title": "Palestinians see Gaza peace dividend pass them by", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:18:00.000+02:00", "replies_count": 0, "uuid": "948568f3f099f86049ec896851a644e7b3b858fd"}, "author": "", "url": "https://www.reuters.com/article/us-israel-palestinians-gaza/palestinians-see-gaza-peace-dividend-pass-them-by-idUSKBN1F51DO", "ord_in_thread": 0, "title": "Palestinians see Gaza peace dividend pass them by", "locations": [], "entities": {"persons": [{"name": "mahmoud abbas", "sentiment": "none"}], "locations": [{"name": "gaza", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "min read  gaza", "sentiment": "none"}, {"name": "pa", "sentiment": "none"}, {"name": "hamas", "sentiment": "none"}, {"name": "nidal al-mughrabi", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "palestinian authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GAZA (Reuters) - Life began to look up for Gaza’s Palestinians when reconciliation between its Hamas Islamist rulers and the West Bank-based Palestinian Authority in October brought a drop in crippling prices.\nThree months on, discount stickers still adorn goods from clothes to cars but few of the two million people in the enclave blockaded by Israel are buying.\nAlthough Hamas handed administrative control to the Western-backed PA, which lifted tax surcharges Hamas had imposed on businesses, making room for the price cuts, the rival leaderships are still arguing.\nThe result is that Palestinian President Mahmoud Abbas, who heads the PA, has not reversed a 30 percent wage cut he imposed in April on 60,000 civil servants who stayed on the PA’s payroll when the authority lost control of Gaza to Hamas in 2007.\nMany of those employees are now mired in debt to banks for loans they took out to get by.\nThe salary reductions “deprived the Gaza market of $160 million in the past eight months”, said Maher al-Tabbaa, an official with the Chamber of Commerce.\nFor individuals, the consequences are stark. In a Gaza pharmacy this week, Umm Ahmed considered which medicines on the prescription she had been given for her son she could afford.\n“Even in my dreams I never thought we would live through such misery,” she said as she chose two painkillers and left more expensive antibiotics in the drug store.\nTabbaa said any economic improvement in Gaza was largely dependent on Israel lifting the tight border restrictions it imposed after Hamas took power, a view that echoes World Bank reports over the years.\nIsrael cites security concerns for the measures, which include a naval blockade, an almost blanket ban on exports from the territory and restrictions on the import of items such as steel in case militants use them to make arms or fortifications.\nBattling an Islamist insurgency in the Sinai desert that borders Gaza, Egypt, the main mediator of inter-Palestinian reconciliation, also invokes security considerations in keeping its border with the enclave largely closed.\nINTERNATIONAL CONCERN Many countries, concerned over deepening economic hardship in Gaza, have urged more open borders.\nThe World Bank said in September alleviating restrictions on the movement of goods and people would allow critical trade to rebuild infrastructure and economy, both hit hard by a seven-week war between Israel and Gaza militants in 2014.\nSome 550 Gaza traders had permission to enter Israel as of December 2017, a drop of 85 percent since late 2015, according to a Palestinian committee that transfers entry requests to Israeli authorities.\nIsrael has said some permits were used to arrange smuggling of material, weapons or money to militants.\nA Palestinian man shops at a supermarket in Gaza City January 15, 2018. REUTERS/Mohammed Salem The World Bank projected real GDP growth of 4.0 percent in Gaza for 2017, not enough to prevent a near stagnation in real per capita income and an increase in unemployment.\nTabbaa put current unemployment in Gaza at 46 percent.\nWEAK SALES “Metro” the second largest supermarket in Gaza, said sales had dropped to their lowest point since the business opened several years ago.\n“People are only buying the very basic things, the most important of the important stuff,” Khalil al-Yazji, one of the owners, said. “We are unable to cover operating costs.”\nThe supermarket has dropped some staff and cut back on imports, fearing new stocks would only expire on the shelves.\nSlideshow (3 Images) In Gaza’s once bustling Old Market, spice store owner Mamdouh Zeineldeen said he might have to close his business.\n“Markets are collapsing, just like reconciliation,” he said.\nThe effects of armed conflict and economic woes in Gaza are also evident at Kerem Shalom, the only commercial crossing between Israel and the territory.\nSome 800 to 1,000 truckloads of goods for Gaza pass through Kerem Shalom every day, but Tabbaa said that number dropped to 400 in recent weeks after merchants cut imports due to weak consumer demand.\nTensions have also risen since President Donald Trump reversed decades of U.S. policy on Dec. 6 by recognizing Jerusalem as Israel’s capital.\nSixteen Palestinian protesters have been killed in clashes with police and Gaza militants have launched 18 cross-border rockets or mortar bombs into Israel, which has responded with air strikes. The exchange of fire has largely avoided casualties, but two Palestinian gunmen were killed in one retaliatory strike. [nL8N1P433C]\nIsrael closed Kerem Shalom on Saturday, a day before it destroyed what it said was a Hamas attack tunnel running underneath the facility.\nThe crossing reopened on Tuesday but further easing looks unlikely.\nHamas and the Palestinian Authority are still divided over the fate of 40,000 to 50,000 employees hired by Hamas since its 2007 takeover of Gaza. Security is another key sticking point, with Hamas still running the police and internal security in Gaza after handing administrative control to the PA.\nPeace talks between Israel and Abbas’s Palestinian Authority collapsed in 2014 and Palestinian unity was supposed to strengthen Abbas’s hand in his bid to establish a state in the West Bank and Gaza.\nBut Israel has balked at the reconciliation efforts, saying it would not negotiate with a Palestinian government dependent on support by Hamas, a group that advocates its destruction.\nEditing by Jeffrey Heller in Jerusalem and Philippa Fletcher\n ", "external_links": [], "published": "2018-01-16T14:18:00.000+02:00", "crawled": "2018-01-16T14:30:54.007+02:00", "highlightTitle": ""}