{"organizations": [], "uuid": "8e100ca63e50c4e3b38c5ac0f3efdd77fd400d82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 15, "shares": 15, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-903236370.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/10/theresa-may-avoidable-plastic-waste/", "country": "US", "domain_rank": 1196, "title": "U.K. Aims to Eliminate Avoidable Plastic Waste by 2042 | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.18, "site_type": "news", "published": "2018-01-11T23:31:00.000+02:00", "replies_count": 0, "uuid": "8e100ca63e50c4e3b38c5ac0f3efdd77fd400d82"}, "author": "Reuters", "url": "http://fortune.com/2018/01/10/theresa-may-avoidable-plastic-waste/", "ord_in_thread": 0, "title": "U.K. Aims to Eliminate Avoidable Plastic Waste by 2042 | Fortune", "locations": [], "entities": {"persons": [{"name": "jack taylor", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "fortune united kingdom the u.k. aims to eliminate avoidable plastic waste within", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "United Kingdom The U.K. Aims to Eliminate Avoidable Plastic Waste Within 25 Years British Prime Minister, Theresa May leaves 10 Downing Street for Prime Minister's Questions in London, England on January 10, 2018. Jack Taylor—Getty Images By Reuters 9:31 PM EST \nBritain’s Prime Minister Theresa May will pledge on Thursday to eliminate avoidable plastic waste within 25 years, in an attempt to shift the focus away from her government’s divisions over Brexit to a more wide-ranging domestic agenda. \nAfter months of headlines dominated by Brexit, scandal and an ill-judged election, May will try to show that she has a grip on domestic issues to help counter the rising popularity of the opposition Labour Party. \nIn a speech on the environment, May will announce plans to close the exemption that means retailers with fewer than 250 employees do not have to charge customers 5 pence for a single-use plastic bag. \nAvoidable plastic waste is a term used by industry to describe products including plastic bags, straws, coffee stirrers, soda and water bottles and most food packaging. \nMay will also urge supermarkets to introduce plastic-free aisles where all the food is loose and announce a consultation on changes to the tax system to help reduce the use of other single-use plastic items. \n“This truly is one of the great environmental scourges of our time,” May will say, according to excerpts of a speech released by her office. “In years to come, I think people will be shocked at how today we allow so much plastic to be produced needlessly.” \nFor more on Theresa May, watch Fortune’s video: \nMay will say over 1 million birds and over 100,000 other sea mammals and turtles die every year from eating and getting tangled in plastic waste, while one in three fish caught in the English Channel contains pieces of plastic. \nIn 2015, Britain introduced a charge of 5 pence on all single-use plastic bags provided by large shops, which led to an 83% reduction in UK plastic bags used in the first year. \nEarlier this week, a ban on plastic microbeads used in cosmetics and personal care products came into force across Britain. \nWorries about overuse of 2.5 billion disposable coffee cups each year have also been raised by campaigners, and the environmental audit committee last week called for a 25 pence “latte levy” to be charged on top of the price of a hot drink. \nEnvironment Secretary Michael Gove showed he was ready to practice what he preached, by turning up for a cabinet meeting clutching a reusable coffee mug earlier this week. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-11T23:31:00.000+02:00", "crawled": "2018-01-11T05:08:18.003+02:00", "highlightTitle": ""}