{"organizations": [], "uuid": "c0ee94bb07789b63c9d5c9ca48b154e9033117c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XC473_3m9JZ_TOP_20180122062738.jpg", "site_section": "https://www.wsj.com/news/markets", "section_title": "Stock Market &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/oil-pulls-back-on-u-s-output-forecast-1516620737", "country": "US", "domain_rank": 387, "title": "Oil Holds Steady on U.S. Output Forecast", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-22T18:58:00.000+02:00", "replies_count": 0, "uuid": "c0ee94bb07789b63c9d5c9ca48b154e9033117c7"}, "author": "Christopher Alessi", "url": "https://www.wsj.com/articles/oil-pulls-back-on-u-s-output-forecast-1516620737", "ord_in_thread": 0, "title": "Oil Holds Steady on U.S. Output Forecast", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "new york mercantile exchange", "sentiment": "none"}, {"name": "international energy agency", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "organization of the petroleum exporting countries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Oil prices wavered between gains and losses Monday as the market weighed expectations of rising U.S. production against signals from Saudi Arabia that OPEC would be willing to extend production cuts beyond 2018.\nU.S. crude futures recently traded up 13 cents, or 0.21%, to $63.50 a barrel on the New York Mercantile Exchange. Brent, the global benchmark, rose 20 cents, or 0.29%, to $68.81 a barrel on ICE Futures Europe.\nPrices surged at the end of last year and in the first weeks of 2018, pushed higher by a combination of strong demand, renewed geopolitical risk and tightening supplies following more than a year of restrained output from the Organization of the Petroleum Exporting Countries. Investors have amassed a record net bullish position on crude prices.\nBut the rally started to sputter last week amid concerns that the rapid rise in prices could bring on a wave of new production. Oil prices fell Friday after the International Energy Agency released its monthly oil market report, predicting U.S. crude production would climb above 10 million barrels a day this year, surpassing output from Saudi Arabia and rivaling that of Russia—the world’s two-largest crude producers.\n“Oil prices had chalked up losses again last week for the first time in five weeks, meaning their upward momentum seems to be faltering for now,” according to analysts at Commerzbank .\nPrices could still find support from Saudi Arabia’s ongoing commitment to hold back crude output.\n“We should not limit our efforts to 2018. We need to be talking about a longer framework for our cooperation,” Saudi Arabian Energy Minister Khalid al-Falih said on the sidelines of a meeting of the Organization of the Petroleum Exporting Countries on Sunday in Oman. Commenting on an OPEC-led agreement with nonmember allies like Russia to curb output, Mr. Falih said the group’s message should be: “This is something that is here to stay.”\nOPEC, of which Saudi Arabia is the de facto leader, and 10 members outside the cartel agreed late last year to extend an agreement to reduce the world’s oil production by 1.8 million barrels a day through the end of this year. The accord was first struck at the end of 2016 to rein in a global oil glut that has weighed on prices since 2014.\nAn oil drilling rig off the Pacific Ocean coastline. The IEA’s monthly oil market report predicted U.S. crude production would surpass output from Saudi Arabia and rival that of Russia this year. Photo: garcia/EPA/Shutterstock But others don’t put much stock in talk of additional cooperation and believe that OPEC’s commitment could waver in the face of higher prices.\n“At close to $70 Brent, there’s a little bit of lingering concern about whether these producers will start to cheat,” said Gene McGillian, research manager at Tradition Energy. “I think the market’s vulnerable to a correction.”\nGasoline futures recently rose 0.33% to $1.8697 a gallon. Diesel futures edged down 0.24% to $2.0535 a gallon.\nWrite to Christopher Alessi at christopher.alessi@wsj.com and Alison Sider at alison.sider@wsj.com", "external_links": [], "published": "2018-01-22T18:58:00.000+02:00", "crawled": "2018-01-22T21:58:35.000+02:00", "highlightTitle": ""}