{"organizations": [], "uuid": "8f774e4caaab1346a8ed6e841d7c8549a8409627", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222509410&w=1200&r=LYNXMPEE0F1FC", "site_section": "http://feeds.reuters.com/reuters/UKScienceNews/", "section_title": "Reuters: Science News", "url": "https://uk.reuters.com/article/uk-science-dinosaur/chinese-rainbow-dinosaur-had-iridescent-feathers-like-hummingbirds-idUKKBN1F4156", "country": "US", "domain_rank": 408, "title": "Chinese 'rainbow dinosaur' had iridescent feathers like hummingbirds", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T21:30:00.000+02:00", "replies_count": 0, "uuid": "8f774e4caaab1346a8ed6e841d7c8549a8409627"}, "author": "", "url": "https://uk.reuters.com/article/uk-science-dinosaur/chinese-rainbow-dinosaur-had-iridescent-feathers-like-hummingbirds-idUKKBN1F4156", "ord_in_thread": 0, "title": "Chinese 'rainbow dinosaur' had iridescent feathers like hummingbirds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 10:24 AM / Updated 2 hours ago Chinese 'rainbow dinosaur' had iridescent feathers like hummingbirds Will Dunham 3 Min Read \nWASHINGTON (Reuters) - There’s not a pot of gold at the end of the rainbow. There’s an iridescent dinosaur. An illustration of a reconstruction of the iridescent dinosaur which had rainbow feathers, named Caihong juji, unearthed in China, is shown in this October 31, 2016 photo released on January 15, 2018. Courtesy Velizar Simeonovski/The Field Museum for the University of Texas at Austin/Handout via REUTERS \nScientists on Monday announced the discovery of a crow-sized, bird-like dinosaur with colourful feathers from northeastern China that lived 161 million years ago during the Jurassic Period. \nThey named it Caihong, the Mandarin word for rainbow. Microscopic structures in the exquisitely preserved, nearly complete fossil unearthed in Hebei Province indicated that it boasted iridescent feathers, particularly on its head, neck and chest, with colours that shimmered and shifted in the light, like those of hummingbirds. \nThe discovery “suggests a more colourful Jurassic World than we previously imagined,” said evolutionary biologist Chad Eliason of the Field Museum in Chicago, one of the researchers in the study published in the journal Nature Communications. \nUsing powerful microscopes, the scientists detected within the feathers the remnants of organelles called melanosomes responsible for pigmentation. Their shape determines the colour. Caihong’s feathers had pancake-shaped melanosomes similar to those of hummingbirds with iridescent feathers. \nMuch of its body had dark feathers, but ribbon-like iridescent feathers covered its head and neck. While it possessed many bird-like characteristics, the researchers doubted it could actually get airborne. Its plumage could have attracted mates while also providing insulation. \nCaihong was a two-legged predator with a Velociraptor-like skull and sharp teeth, probably hunting small mammals and lizards. It had crests above its eyes that looked like bony eyebrows. \nMany dinosaurs possessed feathers. Birds evolved from small feathered dinosaurs near the end of the Jurassic Period. Caihong had fuzzy feathers and pennaceous ones, those that look like writing quills. It is the earliest-known creature with asymmetrical feathers, a trait used by birds to steer when flying. Caihong’s were on its tail, suggesting tail feathers, not arm feathers, were first utilized for aerodynamic locomotion. \n“It is extremely similar to some early birds such as Archaeopteryx,” said paleontologist Xing Xu of the Chinese Academy of Sciences, referring to the earliest-known bird, which lived 150 million years ago. “Its forelimbs were configured like wings. To be honest, I am not sure what function the feathers have, and I don’t think that you can completely exclude the possibility that the feathers helped the animal to get in the air.” \nAsked what someone might say upon seeing Caihong, University of Texas paleontologist Julia Clarke said, “‘Wow!’ And if they are anything like me, they might want one as a pet. Not suitable for children.” \nThe dinosaur’s full scientific name, Caihong juji, means “rainbow with a big crest.” Reporting by Will Dunham; Editing by Sandra Maler", "external_links": [], "published": "2018-01-16T21:30:00.000+02:00", "crawled": "2018-01-17T00:13:05.005+02:00", "highlightTitle": ""}