{"organizations": [], "uuid": "3cc57f791f19ead5a33566c62202ede95c1ae578", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928319-GettyImages-814600256.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/08/facebook-is-shutting-down-m.html", "country": "US", "domain_rank": 767, "title": "Facebook is shutting down M", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-08T21:10:00.000+02:00", "replies_count": 0, "uuid": "3cc57f791f19ead5a33566c62202ede95c1ae578"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/08/facebook-is-shutting-down-m.html", "ord_in_thread": 0, "title": "Facebook is shutting down M", "locations": [], "entities": {"persons": [], "locations": [{"name": "california", "sentiment": "none"}], "organizations": [{"name": "facebook m", "sentiment": "negative"}, {"name": "facebook", "sentiment": "negative"}, {"name": "facebook messenger", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook M, the text-based virtual assistant that used human workers to train an artificial intelligence system , is ending the human-assisted part of the service after two and a half years. The human-enhanced version of M, which was available through a bot on Facebook Messenger, only ever became available to about 2,000 people living in California. The final day of the will be January 19th, Facebook said, and contractors who worked on it will be offered other jobs at the company.\nFirst introduced in August 2015, aspects of the service will live on through M suggestions , which offers fully automated suggestions for payments, making plans, and sending stickers through Messenger. When it launched, Facebook described M as a \"beta\" and suggested the human-powered assistant would come to more users over time. But it never did. Upon shutting down the human-powered M, Facebook described it as an \"experiment.\"\n\"We launched this project to learn what people needed and expected of an assistant, and we learned a lot,\" the company said in a statement. \"We're taking these useful insights to power other AI projects at Facebook. We continue to be very pleased with the performance of M suggestions in Messenger, powered by our learnings from this experiment.\"\nI got access to M in October 2015, and used the service only about three dozen times over its lifespan. It felt like an amazing resource to have at my disposal, and yet in practice I almost never knew what to do with it. In most cases, I used M only when I knew that doing so would save me from making a phone call — because M would be making it for me. When I mentioned this to Mark Zuckerberg in an interview, he responded, \" I think that's probably not very different from other people .\"\nThat could speak to why Facebook had trouble making M more widely available. Fin, a new virtual-assistant startup founded by a former Facebook executive that closely mirrors the M service, charges a minimum of $120 to complete a task . Facebook lightly experimented with pushing recommendations to users through M — it asked me if I wanted to send flowers to anyone on Valentine's Day in 2016. It's possible to imagine a world where M was more successful at commerce, and was able to take a cut of revenue, defraying some of the costs of maintaining an around-the-clock service.\nBut bot-based commerce has been slow to take off, as most people continue to prefer native apps and the web over sending text messages. In the meantime, the M project taught Facebook about the range of tasks that people would use a virtual assistant to complete, and Facebook automated the tasks that it could. Having free access to an on-call virtual assistant always seemed to be a little too good to be true. And so I'll miss having M around, though not quite as much as I would have imagined when I first got access to it.", "external_links": ["https://www.fin.com/pricing", "https://www.theverge.com/2017/4/6/15200836/facebook-messenger-m-suggestions-ai-assisant", "https://www.theverge.com/a/mark-zuckerberg-future-of-facebook", "https://www.theverge.com/2015/10/26/9605526/facebook-m-hands-on-personal-assistant-ai"], "published": "2018-01-08T21:10:00.000+02:00", "crawled": "2018-01-08T20:17:33.003+02:00", "highlightTitle": ""}