{"organizations": [], "uuid": "9d3df3f032cc985aa8b506b862524671036e673e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/business-wire-iqors-svp-of-global-supply-chain-and-chief-sustainability-officer-jimmy-rodriguez-elected-to-quest-forums-2018-executive.html", "country": "US", "domain_rank": 767, "title": "iQor's SVP of Global Supply Chain and Chief Sustainability Officer Jimmy Rodriguez Elected to QuEST Forum's 2018 Executive Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-10T17:00:00.000+02:00", "replies_count": 0, "uuid": "9d3df3f032cc985aa8b506b862524671036e673e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/business-wire-iqors-svp-of-global-supply-chain-and-chief-sustainability-officer-jimmy-rodriguez-elected-to-quest-forums-2018-executive.html", "ord_in_thread": 0, "title": "iQor's SVP of Global Supply Chain and Chief Sustainability Officer Jimmy Rodriguez Elected to QuEST Forum's 2018 Executive Board of Directors", "locations": [], "entities": {"persons": [{"name": "rodriguez", "sentiment": "negative"}, {"name": "jimmy rodriguez", "sentiment": "negative"}, {"name": "hartmut liebel", "sentiment": "none"}], "locations": [{"name": "ersburg", "sentiment": "none"}, {"name": "fla.", "sentiment": "none"}], "organizations": [{"name": "svp", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Rodriguez brings more than 22 years of supply chain experience to the Supplier Director role\nST. PETERSBURG, Fla.--(BUSINESS WIRE)-- iQor, a global provider of customer interaction and product support services, today announced Jimmy Rodriguez, SVP of Global Supply Chain and Chief Sustainability Officer at iQor, was elected to QuEST Forum’s 2018 Executive Board of Directors.\nQuEST Forum is a global organization dedicated to quality and sustainability in the information and communications technology (ICT) community and Rodriguez brings more than 22 years of experience in the supply chain industry to the role, which will run through Dec. 31, 2019. iQor recently announced the adoption of the QuEST Sustainability Assessor to benchmark its new initiative, Sustainability 2020, which Rodriguez is leading, to create a greener, more environmentally friendly supply chain by reducing toxic e-waste and re-using precious resources and materials.\n“We are incredibly proud of Jimmy Rodriguez for being elected to the QuEST Forum Board of Directors,” said Hartmut Liebel, CEO of iQor. “His sustainability efforts at iQor have been significant and expand far beyond our company, helping our clients—some of the biggest technology brands in the world—meet their sustainability goals and practice the concepts of the circular economy.”\nAs the world’s largest product support company, iQor completes 20 million repairs of electronic devices, components and equipment each year, keeping products and materials in use and out of landfills through refurbishment, asset recovery and recycling. Recently, iQor achieved annual recycling figures of 80+ tons of metals, 7,500 tons of cardboard, 265 tons of plastic and 970 tons of e-scrap.\n“Last year the world generated more than 48 million tons of e-waste containing more than $50 billion worth of precious metals, yet only 20 percent of e-waste was recycled,” said Jimmy Rodriguez. “I am excited to lend my voice to help companies create benchmarks and best practices to meet our mission of creating closed-loop supply chains where 100 percent of materials are reused and recycled.”\nThe QuEST Forum Executive Board includes industry leaders, suppliers, service providers and other organizations associated with the ICT industry. This diverse leadership team will foster the association’s growth and help oversee currently established ICT initiatives, including TL9000.\n“We are delighted to have Jimmy Rodriguez join the board of QuEST Forum and through our recent merger, TIA (Telecom Industry Association),” said Fraser Pajak, COO of TIA and President of QuEST Forum Programs. “iQor has demonstrated a passion for sustainability and quality. I am confident Jimmy will add significant leadership and value as we work together to increase the performance of ICT companies on a global basis.”\nFor more information about TIA and QuEST Forum, please visit: http://www.questforum.org and http://tiaonline.org .\nAbout QuEST Forum\nQuEST Forum is a global organization dedicated to quality and sustainability in the ICT community. We are very unique in that we create a collaborative environment for service providers and suppliers, who are often times competitors, to come together and develop innovative solutions to relevant industry issues. QuEST Forum unifies the ICT community through the implementation of TL 9000 (an ICT specific quality management system that is built on ISO 9001), performance benchmarking, and a broad array of common metrics that support rapid industry adoption of new technologies and consistent quality of communication networks around the world.\nAbout iQor\niQor is the only global managed services provider embedded in the flow between product, people, and services, from point of customer acquisition to sustainable recycling. With 45,000 employees in 18 countries, we partner with many of the world's best-known brands to deliver aftermarket product and customer support solutions that span the consumer value chain, from customer care and receivables management to product diagnostics and repair services. Our award-winning technology, logistics, and analytics platforms enable us to measure, monitor, and analyze brand interactions, improve business processes, and find operational efficiencies that lead to superior outcomes for our partners across the customer and product life cycles. For more information, please visit us at www.iqor.com or follow us at www.twitter.com/iqor .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180110005060/en/\niQor\nRobert Burke\nrobert.burke@iqor.com\nSource: iQor", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.questforum.org&esheet=51740017&newsitemid=20180110005060&lan=en-US&anchor=http%3A%2F%2Fwww.questforum.org&index=1&md5=2fa833017ffb58f6b8ae994d6afab940", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.twitter.com%2Fiqor&esheet=51740017&newsitemid=20180110005060&lan=en-US&anchor=www.twitter.com%2Fiqor&index=4&md5=0bf29dc40db234bd0d126cf72b473958", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Ftiaonline.org&esheet=51740017&newsitemid=20180110005060&lan=en-US&anchor=http%3A%2F%2Ftiaonline.org&index=2&md5=df396455895fba4f043820f5dd9d7160", "http://www.businesswire.com/news/home/20180110005060/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.iqor.com&esheet=51740017&newsitemid=20180110005060&lan=en-US&anchor=www.iqor.com&index=3&md5=04ed0c7ee24b9b7209c7e68e854dafef"], "published": "2018-01-10T17:00:00.000+02:00", "crawled": "2018-01-10T18:47:33.000+02:00", "highlightTitle": ""}