{"organizations": [], "uuid": "ffaa655aae549c3c637465b7bbabed323feeada1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-golub-capital-bdc-inc-schedules-release-of-fiscal-year-2018-first-quarter-results.html", "country": "US", "domain_rank": 767, "title": "Golub Capital BDC, Inc. Schedules Release of Fiscal Year 2018 First Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.016, "site_type": "news", "published": "2018-01-12T00:11:00.000+02:00", "replies_count": 0, "uuid": "ffaa655aae549c3c637465b7bbabed323feeada1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-golub-capital-bdc-inc-schedules-release-of-fiscal-year-2018-first-quarter-results.html", "ord_in_thread": 0, "title": "Golub Capital BDC, Inc. Schedules Release of Fiscal Year 2018 First Quarter Results", "locations": [], "entities": {"persons": [{"name": "golub", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "nas", "sentiment": "negative"}, {"name": "golub capital bdc, inc", "sentiment": "neutral"}, {"name": "golub capital bdc, inc.", "sentiment": "neutral"}, {"name": "bdc", "sentiment": "none"}, {"name": "golub capital bdc", "sentiment": "none"}, {"name": "eastern time", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 11, 2018 /PRNewswire/ -- Golub Capital BDC, Inc., a business development company (NASDAQ: GBDC, www.golubcapitalbdc.com ), announced today that it will report its financial results for the quarter ended December 31, 2017 on Wednesday, February 7, 2018 after the close of the financial markets.\nGolub Capital BDC, Inc. will host an earnings conference call at 2:00 p.m. (Eastern Time) on Thursday, February 8, 2018 to discuss its quarterly financial results.\nAll interested parties may participate in the conference call by dialing (800) 954-0687 approximately 10-15 minutes prior to the call; international callers should dial (212) 271-4615. Participants should reference Golub Capital BDC, Inc. when prompted. An archived replay of the call will be available shortly after the call until 4:00 p.m. (Eastern Time) on March 10, 2018. To hear the replay, please dial (800) 633-8284. International dialers, please dial (402) 977-9140. For all replays, please reference program ID number 21879527.\nABOUT GOLUB CAPITAL BDC, INC.\nGolub Capital BDC, Inc. (\"Golub Capital BDC\") is an externally-managed, non-diversified closed-end management investment company that has elected to be treated as a business development company under the Investment Company Act of 1940. Golub Capital BDC invests primarily in senior secured and one stop loans of U.S. middle-market companies that are often sponsored by private equity investors. Golub Capital BDC's investment activities are managed by its investment adviser, GC Advisors LLC, an affiliate of the Golub Capital group of companies (\"Golub Capital\").\nABOUT GOLUB CAPITAL\nGolub Capital is a nationally recognized credit asset manager with over $20 billion of capital under management. For over 20 years, the firm has provided credit to help medium-sized U.S. businesses grow. The firm's award-winning middle market lending business helps provide financing for middle market companies and their private equity sponsors. Golub Capital's credit expertise also forms the foundation of its Late Stage Lending and Broadly Syndicated Loan businesses. Golub Capital has worked hard to build a reputation as a fast, reliable provider of compelling financing solutions, and we believe this has inspired repeat clients and investors. Today, the firm has over 300 employees with lending offices in Chicago, New York and San Francisco. For more information, please visit www.golubcapital.com .\nFORWARD-LOOKING STATEMENTS\nThis press release may contain \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Statements other than statements of historical facts included in this press release may constitute forward-looking statements and are not guarantees of future performance or results and involve a number of risks and uncertainties. Actual results may differ materially from those expressed or implied in the forward-looking statements as a result of a number of factors, including those described from time to time in filings with the Securities and Exchange Commission. Golub Capital BDC, Inc. undertakes no duty to update any forward-looking statement made herein. All forward-looking statements speak only as of the date of this press release.\nSource: Golub Capital BDC, Inc.\nView original content: http://www.prnewswire.com/news-releases/golub-capital-bdc-inc-schedules-release-of--fiscal-year-2018-first-quarter-results-300581713.html\nSOURCE Golub Capital BDC, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/golub-capital-bdc-inc-schedules-release-of--fiscal-year-2018-first-quarter-results-300581713.html"], "published": "2018-01-12T00:11:00.000+02:00", "crawled": "2018-01-12T01:57:15.008+02:00", "highlightTitle": ""}