{"organizations": [], "uuid": "d2b4f0592e8276f78a748063af216cfcaea1d042", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/norway-gas/update-1-norway-forecast-to-match-2017-record-pipeline-exports-this-year-idUSL8N1P648I", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Norway forecast to match 2017 record pipeline exports this year", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T17:22:00.000+02:00", "replies_count": 0, "uuid": "d2b4f0592e8276f78a748063af216cfcaea1d042"}, "author": "", "url": "https://www.reuters.com/article/norway-gas/update-1-norway-forecast-to-match-2017-record-pipeline-exports-this-year-idUSL8N1P648I", "ord_in_thread": 0, "title": "UPDATE 1-Norway forecast to match 2017 record pipeline exports this year", "locations": [], "entities": {"persons": [{"name": "gassco", "sentiment": "none"}, {"name": "frode leversund", "sentiment": "none"}, {"name": "nerijus adomaitis  stravanger", "sentiment": "none"}, {"name": "leversund", "sentiment": "none"}], "locations": [{"name": "gassco", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "baltic pipeline", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 3:23 PM / Updated 14 minutes ago UPDATE 1-Norway forecast to match 2017 record pipeline exports this year Reuters Staff \n* Norway exported 117.4 bcm of pipeline gas in 2017 \n* Gassco expects exports to remain steady in 2018 \n* Norway increased Troll gas field production quota \n* Gassco studies connection point for Baltic Pipeline (Adds quotes from Gassco CEO) \nBy Nerijus Adomaitis \nSTRAVANGER, Jan 11 (Reuters) - Norway’s pipeline exports of natural gas to Europe in 2018 should match last year’s record 117.4 billion standard cubic metres (bcm), the head of offshore pipeline system operator Gassco said. \nExports were driven by a combination of high production and processing capacity in 2017, as well as demand for Norwegian gas in Europe, Frode Leversund told Reuters on Thursday. \n“If you look at pipeline gas exports, we can foresee the same level (in 2018) as in 2017,”Leversund said. \nNorway meets about a quarter of Europe’s natural gas needs, and is the second largest supplier after Russia. Most of its deliveries are via a network of offshore pipelines to Britain, Germany, France and Belgium. \nIncreased production of gas resulted in Norway’s total petroleum output rising for the fourth year in a row in 2017, while oil production slipped from 2016, the Norwegian Petroleum Directorate said on Thursday. \nDemand for Norwegian gas was partly driven by output cuts at Groningen field, Europe’s largest gas field, in the Netherlands. \nThe Dutch gas regulator said on Thursday it would respond within the next two weeks to proposals to further reduce output from Groningen following an earthquake this week. \nNorway’s gas exports were also helped by the government increasing its production quota at its largest gas field Troll, which also produces oil, to 36 bcm from 33 bcm for the 12-month period started on Oct. 1. \nThe government regulates gas production at Troll to maintain the pressure needed to pump out oil. \nNorway’s export capacity is limited by how much gas can be processed on its onshore plants and Leversund said the offshore pipeline system could deliver up to 120 billion cubic metres of gas per year, giving some upside potential. \nAmong its planned investments, Gassco is planning to invest more than a billion crowns ($125 million) to upgrade its Kaarstoe gas processing plant, which sends gas to Germany, by 2021, Leversund said. \nWhile Gassco itself does not plan to build new export pipelines, Danish and Polish gas companies are working on a project to build a 10 bcm per year capacity pipeline to deliver gas from Norway to Poland via Denmark by 2022. \nGassco, on behalf of the project partners, has been studying a possible tie-in point for the new pipeline, and plans to deliver its report during the first-quarter, Leversund said. \nThe pipeline will not increase total export capacity, but will give Norway more flexibility in exporting gas, he added. ($1 = 8.0321 Norwegian crowns) (Additional reporting by Terje Solsvik in Oslo; editing by Alexander Smith)", "external_links": [], "published": "2018-01-11T17:22:00.000+02:00", "crawled": "2018-01-11T17:45:28.060+02:00", "highlightTitle": ""}