{"organizations": [], "uuid": "fac0e9f97199c4fe2665a3737c8ccada60c4e69b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-financo-announces-douglas-lehrman-as-new-managing-director.html", "country": "US", "domain_rank": 767, "title": "Financo Announces Douglas Lehrman as New Managing Director", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T22:03:00.000+02:00", "replies_count": 0, "uuid": "fac0e9f97199c4fe2665a3737c8ccada60c4e69b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-financo-announces-douglas-lehrman-as-new-managing-director.html", "ord_in_thread": 0, "title": "Financo Announces Douglas Lehrman as New Managing Director", "locations": [], "entities": {"persons": [{"name": "douglas lehrman", "sentiment": "negative"}, {"name": "lehrman", "sentiment": "none"}, {"name": "john berg", "sentiment": "none"}, {"name": "doug", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "financo", "sentiment": "negative"}, {"name": "healthcare services", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 11, 2018 /PRNewswire/ -- Financo, the leading boutique investment bank focused on the consumer sector, announced today that Douglas Lehrman has joined the firm as a Managing Director. Lehrman, a 30-year veteran of the Healthcare Services, Fitness, and Wellness space as both an investment banker and a principal investor will lead Financo's expansion into Healthcare Services. Doug's expertise in this arena and his wide-ranging transaction and operational experience as both a principal and an advisor, position him to work seamlessly with companies and private equity and venture capital firms.\nHe will be invaluable to a wide range of healthcare and related businesses from growth and digital enterprises to established healthcare operators as well. His role will include strategic advisory work, growth equity capital raises, strategic investments, and mergers and acquisitions.\nJohn Berg, CEO of Financo stated, \"After very successfully adding our Healthy Living practice in 2017, we are excited to further broaden our coverage to include Healthcare Services. This sector is growing at an extremely rapid pace and new and innovative business models are thriving. Healthcare will continue to evolve and develop through transparency to consumers, access to affordable care, and innovation. We are thrilled to have Doug joining us to lead this important effort. Doug delivers a level of tenured focus and extraordinary reach and knowledge in this industry that is rare to find. His highly personal and accessible style in dealing with businesses and entrepreneurs and vision for the future of healthcare, and his expertise is highly valued at Financo.\"\nDoug Lehrman commented, \"Financo offers me a wonderful platform in which to bring my collective years of experience to provided strategic advice, deliver equity capital, merger and acquisition services, and joint venture skills to a wide variety of healthcare businesses. My focus - as it has always been, is to advise businesses in building innovative enterprises at the intersection of healthcare services, retail and digital platforms, fitness, and medical nutrition, that challenges the status quo, improve the quality of life for consumers and impact the cost structure of the healthcare and the convenience and outcomes of healthcare delivery.\" Doug added he is excited to bring his many relationships to provide additional value to all areas at Financo.\nInquiries:\nCallie Weber\nCWeber@financo.com\nAbout Financo:\nFounded in 1971, Financo is an independent boutique investment bank providing merger and acquisition and other strategic financial advisory services to the global retail and consumer products sectors. The Firm's extensive transaction experience includes specialization in the accessories, apparel, athletic, beauty, e-commerce, footwear, general merchandise, healthy living, home furnishings, outdoor sectors and restaurants within which it has acted on behalf of many leading global brands. With its deep industry knowledge, extensive relationship network, and world-class execution capabilities, Financo provides the highest quality value-added advice to its global client base. www.financo.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/financo-announces-douglas-lehrman-as-new-managing-director-300581602.html\nSOURCE Financo", "external_links": ["http://www.financo.com/", "http://www.prnewswire.com/news-releases/financo-announces-douglas-lehrman-as-new-managing-director-300581602.html"], "published": "2018-01-11T22:03:00.000+02:00", "crawled": "2018-01-11T23:33:37.000+02:00", "highlightTitle": ""}