{"organizations": [], "uuid": "c9fdf5d81b5e30b9b930b3d859ab3d4cffedf302", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-fogo-de-chao-inc-reports-preliminary-results-for-the-fiscal-fourth-quarter-of-2017.html", "country": "US", "domain_rank": 767, "title": "Fogo de Chão, Inc. Reports Preliminary Results for the Fiscal Fourth Quarter of 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.827, "site_type": "news", "published": "2018-01-08T16:30:00.000+02:00", "replies_count": 0, "uuid": "c9fdf5d81b5e30b9b930b3d859ab3d4cffedf302"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-fogo-de-chao-inc-reports-preliminary-results-for-the-fiscal-fourth-quarter-of-2017.html", "ord_in_thread": 0, "title": "Fogo de Chão, Inc. Reports Preliminary Results for the Fiscal Fourth Quarter of 2017", "locations": [], "entities": {"persons": [{"name": "larry johnson", "sentiment": "none"}], "locations": [{"name": "dallas", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}], "organizations": [{"name": "fogo de chão, inc", "sentiment": "neutral"}, {"name": "fogo de chão, inc.", "sentiment": "neutral"}, {"name": "the company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 08, 2018 (GLOBE NEWSWIRE) -- Fogo de Chão, Inc. (“Fogo” or the “Company”) (NASDAQ:FOGO) today announced preliminary, unaudited financial results for its fiscal fourth quarter ended December 31, 2017.\nFourth quarter 2017 financial results, on a preliminary, unaudited basis, are expected to include the following:\nTotal revenue of approximately $88.8 million; Consolidated comparable restaurant sales increased 0.8%; U.S. company-owned comparable restaurant sales increased 2.4%; Brazil company-owned comparable restaurant sales decreased 6.6%.\n“We are pleased with our results for the quarter as well as our fiscal year. We believe that our commitment to expand into different dayparts, giving customers price optionality as well as all-day value offerings has and will continue to be the main growth drivers of our business,” said Larry Johnson, Chief Executive Officer of Fogo de Chão, Inc. “The Company has successfully completed its 2017 development plan and the class is performing well. In addition, our 2018 planned openings are well underway. We are also pleased with our recent remodels and expect to complete another four to five this year, including two in the first half of the year.”\nThe Company plans to release its fourth quarter and full year audited 2017 results after the market closes on Tuesday March 6, 2018. Event details will be shared at a later date.\nPreliminary results remain subject to the completion of normal quarter-end accounting procedures and adjustments and are subject to change.\nAbout Fogo de Chão\nFogo de Chão (fogo-dee-shown) is a leading Brazilian steakhouse, or churrascaria, which has specialized for nearly 40 years in fire-roasting high-quality meats utilizing the centuries-old Southern Brazilian cooking technique of churrasco. Fogo delivers a distinctive and authentic Brazilian dining experience through the combination of high-quality Brazilian cuisine and a differentiated service model known as espeto corrido (Portuguese for \"continuous service\") delivered by gaucho chefs. Fogo offers its guests a tasting menu of a variety of meats including beef, lamb, pork and chicken, simply seasoned and carefully fire-roasted to expose their natural flavors, a gourmet Market Table with seasonal salads, soup and fresh vegetables, seafood, desserts, signature cocktails and an award-winning wine list. The first Fogo de Chão opened in Brazil in 1979. The Company currently operates 38 restaurants in the United States, 9 in Brazil, two joint venture restaurants in Mexico, and one joint venture restaurant in Jeddah, Saudi Arabia. Visit FOGO.com for more information.\nSafe Harbor Statement\nThis release contains forward-looking statements, within the meaning of the Private Securities Litigation Reform Act of 1995, which are subject to risks and uncertainties. Forward-looking statements relate to expectations, beliefs, projections, guidance, future plans, objectives and strategies, anticipated events or trends and similar expressions concerning matters that are not historical facts, such as statements regarding our future financial condition or results of operations, our prospects and strategies for future growth, the development and introduction of new products, and the implementation of our marketing and branding strategies. Forward-looking statements can also be identified by words such as “may,” “will,” “should,” “expects,” “plans,” “anticipates,” “believes,” “estimates,” “predicts,” “potential,” “seeks,” “intends,” “targets” or the negative of these terms or other comparable terminology. Forward-looking statements are not guarantees of future performance and actual results may differ significantly from the results discussed in the forward-looking statements. Factors that might cause such differences include, but are not limited to, those discussed in the section entitled \"Risk Factors\" in our recent annual report on Form 10-K for the fiscal year ended January 1, 2017 filed with the Securities and Exchange Commission, and our discussion of risks in our quarterly reports on Form 10-Q. The forward-looking statements included in this press release are made only as of the date hereof. Except as required by applicable securities law, we undertake no obligation to update any forward-looking statement to reflect events or circumstances after the date on which the statement is made or to reflect the occurrence of unanticipated events.\nInvestor Contact:\nIR@fogodechao.com\n(972) 361-6225\nMedia Contact:\nJoy Murphy, ICR\nJoy.Murphy@icrinc.com\n(646) 277‐1242\nSource:Fogo de Chao", "external_links": ["https://www.globenewswire.com/Tracker?data=edUA8VJnjNb_gVKaDJ64BuNbXc4AOoH9TW-DQ92r1i_JpuXGziwz7OYdb9YGJpcHSfUk1Ypvw35smqMfrM1JWfBvwiO_HQM_lOG-kDeY-Uc=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/aa61fe5d-a31e-4b47-a452-c1c6d467512a"], "published": "2018-01-08T16:30:00.000+02:00", "crawled": "2018-01-08T18:51:49.022+02:00", "highlightTitle": ""}