{"organizations": [], "uuid": "f576e4167b0e2cf399a0caccd40ddf2221363252", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-thailand-king-insult/thai-activist-flees-royal-insult-charge-for-posting-bbc-article-idUSKBN1FH0R1", "country": "US", "domain_rank": 408, "title": "Thai activist flees royal insult charge for posting BBC article", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T18:29:00.000+02:00", "replies_count": 0, "uuid": "f576e4167b0e2cf399a0caccd40ddf2221363252"}, "author": "", "url": "https://www.reuters.com/article/us-thailand-king-insult/thai-activist-flees-royal-insult-charge-for-posting-bbc-article-idUSKBN1FH0R1", "ord_in_thread": 0, "title": "Thai activist flees royal insult charge for posting BBC article", "locations": [], "entities": {"persons": [{"name": "chanoknan ruamsap", "sentiment": "none"}, {"name": "maha vajiralongkorn", "sentiment": "none"}, {"name": "chanoknan", "sentiment": "none"}, {"name": "bhumibol aduly", "sentiment": "none"}], "locations": [{"name": "thailand", "sentiment": "none"}, {"name": "bangkok", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 4:29 PM / in 2 hours Thai activist flees royal insult charge for posting BBC article Reuters Staff 3 Min Read \nBANGKOK (Reuters) - A Thai pro-democracy activist said on Sunday she had fled Thailand after learning she would be prosecuted for defaming the monarchy for sharing on Facebook a 2016 BBC article deemed offensive to Thailand’s king. \nChanoknan Ruamsap said in a post on her Facebook account on Sunday that she received a summons earlier this month to hear a royal insult charge under Article 112 for posting a profile of the king from the BBC’s Thai-language service, which some deemed offensive. \nReuters could not immediately reach the Thai authorities or the BBC for comment. \n“It appears that I had been charged with 112 for sharing the BBC article in December 2016,” Chanoknan said. \n“I had less than 30 minutes to decide whether to stay or leave. It was a hard decision because this time I wouldn’t be able to come back.” \nThe BBC article was published shortly after King Maha Vajiralongkorn ascended the throne in December 2016 following the death of his father, King Bhumibol Adulyadej, who died that October aged 88. \nThailand has the world’s toughest lese-majeste law, known as Article 112. The law sets a sentence of up to 15 years in prison for each offense of royal insult committed. \nJatupat Boonpattararaksa, an activist who has staged several anti-junta protests, was arrested in 2016 and was sentenced last year to two and a half years in prison for posting the same BBC article. \nProsecutions under both the Computer Crime Act and the royal defamation law have increased sharply since a military junta took power in a 2014 coup. Since the coup, at least 94 people have been prosecuted for lese majeste. As many as 43 people have been sentenced, the iLaw group that monitors royal insult cases said earlier this month. \nPrime Minister Prayuth Chan-ocha, who heads the junta, has repeatedly vowed to stamp out critics of the monarchy and has also called for stronger prosecution of lese-majeste cases since the coup. \nCritics of the junta say the law has been used to silence its opponents while international rights groups and some Bangkok-based Western diplomats have decried Thailand’s harsh sentences for lese-majeste convictions. Reporting by Patpicha Tanakasempipat; Editing by Amy Sawitta Lefevre", "external_links": [], "published": "2018-01-28T18:29:00.000+02:00", "crawled": "2018-01-28T18:46:05.000+02:00", "highlightTitle": ""}