{"organizations": [], "uuid": "d20bb3b42cc37bde603bc539c27fff572cb89216", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219084728&w=1200&r=LYNXMPEE020WM", "site_section": "https://www.reuters.com/subjects/middle-east", "section_title": "Middle East Insight", "url": "https://www.reuters.com/article/us-israel-palestinians-deathpenalty/israeli-death-penalty-advocates-win-preliminary-vote-in-parliament-idUSKBN1ES1DT", "country": "US", "domain_rank": 408, "title": "Israeli death penalty advocates win preliminary vote in parliament", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T00:07:00.000+02:00", "replies_count": 0, "uuid": "d20bb3b42cc37bde603bc539c27fff572cb89216"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-israel-palestinians-deathpenalty/israeli-death-penalty-advocates-win-preliminary-vote-in-parliament-idUSKBN1ES1DT", "ord_in_thread": 0, "title": "Israeli death penalty advocates win preliminary vote in parliament", "locations": [], "entities": {"persons": [{"name": "avigdor lieberman", "sentiment": "none"}, {"name": "adolf eichmann", "sentiment": "none"}], "locations": [{"name": "israel", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "west bank", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JERUSALEM (Reuters) - Israel’s parliament gave preliminary approval on Wednesday for legislation that would make it easier for a court to impose a death sentence on assailants convicted of murder in attacks classified as terrorism.\nIsraeli military courts - which handle cases involving Palestinians in the occupied West Bank - already have the power to issue the death sentence, although this has never been implemented. The only case of an execution in Israel was carried out against convicted Nazi war criminal Adolf Eichmann in 1962.\nThe amendment to the penal code would still require three more readings if it is to become law. Currently, a death penalty can only be imposed if a panel of three military judges passes sentence unanimously. If the amendment is adopted, a majority verdict would suffice.\nWednesday’s motion was brought by Defence Minister Avigdor Lieberman, an ultra-nationalist in the conservative coalition government, who advocates tough action against Palestinian militants. Fifty-two of parliament’s 120 members voted in favor, and 49 were opposed.\nQadoura Fares, chairman of the Palestinian Prisoner Club which represents Palestinians jailed in Israel, denounced the vote as ”an expression of the state of blindness and confusion in the policies of this fascist regime (where) extremist parties race to pass racist laws.\n“While the world moves toward repealing the death penalty, Israel is working to ratify this law, which is directed against the Palestinians,” Fares told Reuters.\nIsraeli Prime Minister Benjamin Netanyahu voted for the motion but said that such legislation required deeper discussion and that the matter would now be considered at ministerial level before further debate in the Knesset.\nIn remarks to lawmakers, he said: “I think that in extreme cases, when somebody slaughters and laughs (as he kills), he should not spend the rest of his time in jail and should be executed.”\nAsked by an Israeli Arab lawmaker whether he would also apply this reasoning to Jewish militants convicted of killing Palestinians, Netanyahu said: “In principle, yes.”\nThe successful vote was the latest in a number of motions brought by right-wing coalition members who feel able to pressure Netanyahu’s brittle government into enacting hard-line legislation.\nWriting by Ori Lewis and Nidal al-Mughrabi; Editing by Richard Balmforth and Robin Pomeroy\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-04T00:07:00.000+02:00", "crawled": "2018-01-03T19:33:40.001+02:00", "highlightTitle": ""}