{"organizations": [], "uuid": "d26c9a2d2372b789a36887af122cc8a0b4a81d83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-black-cactus-global-inks-memorandum-of-understanding-to-acquire-icelandic-bank-with-nsb-holdings.html", "country": "US", "domain_rank": 767, "title": "Black Cactus Global Inks Memorandum of Understanding to Acquire Icelandic Bank with NSB Holdings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-18T16:00:00.000+02:00", "replies_count": 0, "uuid": "d26c9a2d2372b789a36887af122cc8a0b4a81d83"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-black-cactus-global-inks-memorandum-of-understanding-to-acquire-icelandic-bank-with-nsb-holdings.html", "ord_in_thread": 0, "title": "Black Cactus Global Inks Memorandum of Understanding to Acquire Icelandic Bank with NSB Holdings", "locations": [], "entities": {"persons": [], "locations": [{"name": "las vegas", "sentiment": "none"}, {"name": "reykjavik", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}], "organizations": [{"name": "black cactus global inks memorandum of understanding to acquire icelandic bank", "sentiment": "negative"}, {"name": "globe newswire", "sentiment": "negative"}, {"name": "nsb holdings", "sentiment": "negative"}, {"name": "mou", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "black cactus global", "sentiment": "none"}, {"name": "digital bank", "sentiment": "none"}, {"name": "nsb", "sentiment": "none"}, {"name": "european free trade association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS, Jan. 18, 2018 (GLOBE NEWSWIRE) -- Black Cactus Global (OTC Markets:BLGI) (the “Company) is pleased to announce that it has entered into a Memorandum of Understanding (“MOU”) with NSB Holdings ehf (“NSB”) of Iceland. The particulars of the MOU map out the plan for Black Cactus to become the majority stakeholder of a bank (“the Bank”) in Iceland for the purposes of creating the first fully digital bank\nThe acquisition of the Bank is a major step forward in Black Cactus Global’s strategic plan to become the first fully integrated digital financial institution with Blockchain technology as its operating foundation. The Company, in cooperation with NSB, will convert and rapidly develop the world’s first full-service Digital Bank based on Blockchain Technology.\nIceland boasts a fast moving, modern and competitive economy with a transparent and efficient regulatory system. NSB is a registered holding company in Iceland with offices in the capital of Reykjavik. Iceland is a member of the European Free Trade Association and also holds an extensive Free Trade Agreement with China.\nThe Bank of interest is fully licensed to operate in Iceland and, after approval, also operate within the European Union (EU) and the expanded area of the European Economic Area (EEA), which makes this an excellent opportunity to expand our operations to an international scale under comprehensive and efficient legislation. Black Cactus has plans to bring its specialized Blockchain applications, digital products and banking services to a wide array of commercial and governmental clients throughout the EU, North America and beyond.\nAbout the Company\nBlack Cactus Global is a technology development company with a focus on Blockchain, machine learning, cryptocurrency, and the Internet of Things. We partner with large corporations and specialised groups on global development and consulting projects in our key development areas of Fintech, digital media, financial services, cyber security, and healthcare.\nOur mission is to pioneer the application of Blockchain and overlapping technologies to protect IP and the security of data and financial transactions.\nFor further information please visit our website at: www.blackcactusglobal.com\nInvestor Relations:\nCompany Contact: Louis Silver\nTel: 1-610-710-1303 • Email: lsilver35@verizon.net ; louis@blackcactusglobal.com\nSafe Harbor Statements\nCertain information contained in this news release constitutes “forward-looking statements” as such term is used in applicable United States and Canadian laws. Generally, these forward-looking statements can be identified by the use of forward-looking terminology such as “expects” or “does not expect”, “is expected”, “anticipates” or “does not anticipate”, “plans”, “estimates”, “intends” or “believes”, or that certain actions, events or results “may”, “could”, “would”, “might” or “will be taken”, “occur”, or “be achieved”. Forward-looking statements are based on the opinions and estimates of management as of the date such statements are made, and are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking statements. Many of these factors are beyond the Company’s ability to control or predict. Important factors that may cause actual results to differ materially and that could impact the Company and the statements contained in this news release can be found in the Company’s filings with the SEC. Such risks and other factors include, among others, the ability to locate and acquire suitable interests in alternative medicine manufacturing operations on terms acceptable to the Company, the availability of financing on acceptable terms, accidents, labor disputes, acts of God and other risks of the alternative medicine industry including, without limitation, delays in obtaining governmental approvals or permits, title disputes or claims limitations on insurance coverage. The Company believes that the expectations reflected in the forward-looking statements included in this news release are reasonable; however, no assurance can be given that these expectations will prove to be correct, and such forward-looking statements should not be unduly relied upon. The Company assumes no obligation to update or supplement any forward-looking statements whether as a result of new information, future events or otherwise.\nSource: Black Cactus Global", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/f5dc352b-b387-4321-9ed2-8809db10066d", "https://www.globenewswire.com/Tracker?data=TFjBIDGbWGGuxg2RdxQCbQTtB5QS1XuG_vxpWYvGWv6TILAzpycMHbkPIjFdaw0HdGKSTCAvHhlDbUYgbYyOk7wiMeQYyDi2Sj3Bi2dblJM=", "https://www.globenewswire.com/Tracker?data=jKikR1VgiLT1_K5KwAedB8y4vdyH0YsDITOe0A4QJKeqhfb6QXBW6PPa9s8xEaUAtRikhTbMARgHFr_7sNRGZBPhh49vtQwXUhjyqLoWEEg=", "https://www.globenewswire.com/Tracker?data=vObyvfo92cfNAZucEEeCJ7b6Ngd9cI7I2Or9z3Z_RTCfPXLYQGA1TZ_lQcecVNHV3KyfljhSAlbGUBsSfXdZIEILlgi-vBlowZx1h2B4oGpEsCRENkrt18G2rsZm7A5i"], "published": "2018-01-18T16:00:00.000+02:00", "crawled": "2018-01-18T16:29:32.024+02:00", "highlightTitle": ""}