{"organizations": [], "uuid": "a8afedaae32111e1560657f450aee8783af03ff2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-american-eagle-outfitters-provides-fourth-quarter-update-reiterates-eps-guidance.html", "country": "US", "domain_rank": 767, "title": "American Eagle Outfitters Provides Fourth Quarter Update, Reiterates EPS Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T00:37:00.000+02:00", "replies_count": 0, "uuid": "a8afedaae32111e1560657f450aee8783af03ff2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-american-eagle-outfitters-provides-fourth-quarter-update-reiterates-eps-guidance.html", "ord_in_thread": 0, "title": "American Eagle Outfitters Provides Fourth Quarter Update, Reiterates EPS Guidance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PITTSBURGH--(BUSINESS WIRE)-- American Eagle Outfitters, Inc. (NYSE:AEO) fourth quarter comparable sales to date have increased 8%. The company is reiterating its previously issued fourth quarter EPS guidance in the range of $0.42 to $0.44 per diluted share. This compares to Adjusted EPS* of $0.39 last year.\nJay Schottenstein, Chief Executive Officer commented, “We are extremely pleased to report a successful holiday season with record sales and strong momentum across the American Eagle and Aerie brands. Customers responded well to our merchandise offerings, which fueled positive traffic both online and in stores.”\nEarnings guidance excludes the impact of tax reform and potential asset impairment and restructuring charges. The company will release fourth quarter and fiscal 2017 results on March 8, 2018 and will host a conference call to review financial results on that date.\n*Adjusted amounts are based on Non-GAAP results, as presented in the accompanying GAAP to Non-GAAP reconciliation.\nNon-GAAP Measures\nThis press release includes information on non-GAAP financial measures (“non-GAAP” or “adjusted”), including earnings per share information and the consolidated results of operations excluding non-GAAP items. These financial measures are not based on any standardized methodology prescribed by U.S. generally accepted accounting principles (“GAAP”) and are not necessarily comparable to similar measures presented by other companies. The company believes that this non-GAAP information is useful as an additional means for investors to evaluate the company’s operating performance, when reviewed in conjunction with the company’s GAAP financial statements. These amounts are not determined in accordance with GAAP and therefore, should not be used exclusively in evaluating the company’s business and operations.\nAbout American Eagle Outfitters, Inc.\nAmerican Eagle Outfitters, Inc. (NYSE: AEO) is a leading global specialty retailer offering high-quality, on-trend clothing, accessories and personal care products at affordable prices under its American Eagle Outfitters® and Aerie® brands. The company operates more than 1,000 stores in the United States, Canada, Mexico, China and Hong Kong, and ships to 81 countries worldwide through its websites. American Eagle Outfitters and Aerie merchandise also is available at more than 200 international locations operated by licensees in 24 countries. For more information, please visit www.ae.com .\n\"Safe Harbor\" Statement under the Private Securities Litigation Reform Act of 1995: This release contains forward-looking statements, which represent our expectations or beliefs concerning future events, including fourth quarter 2017 results. All forward-looking statements made by the company involve material risks and uncertainties and are subject to change based on factors beyond the company's control. Such factors include, but are not limited to the risk that the company’s operating, financial and capital plans may not be achieved and the risks described in the Risk Factor Section of the company's Form 10-K and Form 10-Q filed with the Securities and Exchange Commission. Accordingly, the company's future performance and financial results may differ materially from those expressed or implied in any such forward-looking statements. The company does not undertake to publicly update or revise its forward-looking statements even if future changes make it clear that projected results expressed or implied will not be realized.\nAMERICAN EAGLE OUTFITTERS, INC. GAAP TO NON-GAAP RECONCILIATION (unaudited) 13 Weeks Ended January 28, 2017 Diluted income per common share GAAP Basis $ 0.30 Add: Asset Impairment and Restructuring Charges (1) : 0.07 Add: Tax (2) : 0.02 Non-GAAP Basis $ 0.39 (1) - $21.2 million pre-tax asset impairments and restructuring charges relating to our wholly-owned businesses in the United Kingdom and Asia.\n(2) - GAAP tax rate included impact of valuation allowances on asset impairment and restructuring charges. Excluding the impact of those items resulted in a 33.9% tax rate for the quarter.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108006861/en/\nAmerican Eagle Outfitters, Inc.\nOlivia Messina, 412-432-3300\nSource: American Eagle Outfitters, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180108006861/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ae.com&esheet=51739908&newsitemid=20180108006861&lan=en-US&anchor=www.ae.com&index=1&md5=65554c28b2cec89fcf59ddccb36e9106"], "published": "2018-01-09T00:37:00.000+02:00", "crawled": "2018-01-09T09:40:20.689+02:00", "highlightTitle": ""}