{"organizations": [], "uuid": "b26f19d197351270f895c0e6d0f3adc6dab52e94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-solace-appoints-business-and-technology-industry-veterans-to-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Solace Appoints Business and Technology Industry Veterans to Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-10T16:00:00.000+02:00", "replies_count": 0, "uuid": "b26f19d197351270f895c0e6d0f3adc6dab52e94"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-solace-appoints-business-and-technology-industry-veterans-to-board-of-directors.html", "ord_in_thread": 0, "title": "Solace Appoints Business and Technology Industry Veterans to Board of Directors", "locations": [], "entities": {"persons": [{"name": "steve pusey", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "randy", "sentiment": "none"}, {"name": "randy cowen", "sentiment": "none"}, {"name": "les rechan", "sentiment": "none"}, {"name": "randolph", "sentiment": "none"}], "locations": [{"name": "ottawa", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}], "organizations": [{"name": "vodafone veterans to help guide the company", "sentiment": "negative"}, {"name": "solace appoints business and technology industry veterans to board of directors goldman sachs", "sentiment": "negative"}, {"name": "cowen", "sentiment": "none"}, {"name": "solace", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Goldman Sachs and Vodafone Veterans to Help Guide the Company as it Accelerates Growth and Expands into New Markets\nOTTAWA, Ontario, Jan. 10, 2018 /PRNewswire/ -- Solace announced today the addition of business and technology veterans Randolph (Randy) Cowen and Steve Pusey to its board of directors. Solace will leverage these leaders' expertise in business and technology-enabled transformation to guide the company's rapid growth as more organizations turn to their technology to move data between applications and devices as part of their hybrid cloud, internet of things (IoT) and digital transformation initiatives.\n\"As Solace continues to scale and transform into a hybrid cloud and IoT solutions company, Randy and Steve's guidance will be invaluable,\" said Les Rechan, CEO. \"We know 2018 will see more organizations than ever investing to improve the way they connect systems and people, and we have bold plans to establish undisputed market leadership in the trusted enterprise data movement solutions space.\"\nRandy Cowen brings 30 years of financial services and information technology experience to the board. He was with Goldman Sachs for more than two decades, serving in a variety of leadership positions such as co-chief administrative officer, global head of technology and operations, and chief information officer. He is currently a director of GTY Technology Holdings and a Bridge Growth Partners advisory board member.\nSteve Pusey is a well-known leader in the technology and telecommunication markets. His 35 years of international business experience includes his role of CTO at Vodafone, president of EMEA at Nortel and various positions at British Telecom. He is a Bridge Growth Partners senior advisor and serves on numerous telecom and IT advisory panels, including three years with the GSMA industry body and the boards of directors of Accedian Networks, Centrica, FireEye, GlobalLogic and Telatrix.\n\"Randy and Steve are highly experienced in successfully driving the implementation of transformative technologies, which matches Solace's goals perfectly,\" said Craig Betts, Solace's founder and executive chairman of the board. \"The board has long sought additions that would complement our strengths, and these new directors will play a critical role in Solace's continued growth as the company's revolutionary technology enables game-changing hybrid cloud and IoT initiatives.\"\nAbout Solace\nSolace technology routes information between applications, devices and people across clouds using open APIs and protocols. Solace helps companies modernize legacy applications and successfully pursue analytics, hybrid cloud and Internet of Things strategies. Leaders in a wide range of industries and around the world have used Solace technology to become more agile and efficient, to improve decision making and to offer their customers innovative data-driven services. Learn more at https://solace.com .\nPress contact for Solace:\nLori Niquette\nSHIFT Communications\nsolace@shiftcomm.com\n617-779-1800\nView original content with multimedia: http://www.prnewswire.com/news-releases/solace-appoints-business-and-technology-industry-veterans-to-board-of-directors-300580292.html\nSOURCE Solace", "external_links": ["http://www.prnewswire.com/news-releases/solace-appoints-business-and-technology-industry-veterans-to-board-of-directors-300580292.html", "https://solace.com/"], "published": "2018-01-10T16:00:00.000+02:00", "crawled": "2018-01-10T19:31:58.009+02:00", "highlightTitle": ""}