{"organizations": [], "uuid": "ca6353ddfdb9457ba3ad5b6044275ed3c8181ab1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/europe-stocks/live-markets-closing-snapshot-european-stocks-end-slightly-lower-idUSL8N1PC5OC", "country": "US", "domain_rank": 408, "title": "LIVE MARKETS-Closing snapshot: European stocks end slightly lower", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T19:16:00.000+02:00", "replies_count": 0, "uuid": "ca6353ddfdb9457ba3ad5b6044275ed3c8181ab1"}, "author": "", "url": "https://www.reuters.com/article/europe-stocks/live-markets-closing-snapshot-european-stocks-end-slightly-lower-idUSL8N1PC5OC", "ord_in_thread": 0, "title": "LIVE MARKETS-Closing snapshot: European stocks end slightly lower", "locations": [], "entities": {"persons": [{"name": "pearson", "sentiment": "none"}, {"name": "kit rees", "sentiment": "none"}, {"name": "danilo masoni", "sentiment": "none"}], "locations": [], "organizations": [{"name": "general electric", "sentiment": "none"}, {"name": "ubm * tech", "sentiment": "none"}, {"name": "siemens", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "asml", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 17 PM / in 31 minutes LIVE MARKETS-Closing snapshot: European stocks end slightly lower Reuters Staff 13 Min Read * European shares end slightly lower * Earnings in focus: ASML, Casino, Pearson, Burberry * Informa agrees to buy UBM * Tech stocks lead Wall St higher Jan 17 (Reuters) - Welcome to the home for real time coverage of European equity markets brought to you by Reuters stocks reporters and anchored today by Danilo Masoni. Reach him on Messenger to share your thoughts on market moves: danilo.masoni.thomsonreuters.com@reuters.net CLOSING SNAPSHOT: EUROPEAN STOCKS END SLIGHTLY LOWER European stocks have finished the session just slightly lower, as falls among health stocks and commodity firms weighed. Today has been a busy with company updates, and tomorrow we've got quite a few British firms giving trading updates too. Have a lovely evening - here's your closing snapshot: (Kit Rees) CONGLOMERATES? IT'S A KIND OF MAGIC, M&A BANKER RECKONS (1625 GMT) With General Electric considering a breaking-up and Siemens listing its healthcare business, it's tempting to call it a trend: \"The end of the industrial conglomerates\" was the title of Bayern LB's bond daily research today. After all, didn't Siemens boss Joe Kaeser declare last November that \"conglomerates of the old-fashioned kind have no future\"? As much as there are no driving forces in today's capitalism to revive the conglomerate model of the 70's and 80's, breaking up conglomerates is not a trend, it's just something you consider \"when the magic is gone\", an M&A banker just told us. By magic, he meant that only a handful of CEOs are successful enough to avoid the so-called \"conglomerate discount\", where a group's varied divisions are seen as being more valuable if they were split into separate companies. \"If investors are happy to pay a premium for Berkshire Hathaway shares it's because they think: 'Warren Buffet is a better stock picker than me',\" he reckons. Same thing with GE's former iconic CEO Jack Welch -- investors were happy to let him reign over a disparate empire as they were convinced he was the ultimate asset manager. It's just simply no longer the case, the banker said. Here's Jack Welch: (Julien Ponthus) THE GREAT BRITISH BARGAIN HUNT (1556 GMT) Here's a more positive view on British stocks from Richard Colwell, head of UK equities at Columbia Threadneedle Investments. He sees opportunities to buy inexpensive stocks as investors baulk at exposure to companies seen as Brexit victims or targets for disruption. \"You could consider UK equities an each-way bet for 2018. If equities around the globe grind higher, then at some point UK equities should be a catch-up trade,\" Colwell says in a note. \"But if global equities correct, then UK equities ought to be more resilient due to their low valuations and the fact that there is no ‘hot money’ in the UK market.\" (Kit Rees) NUDGING TOWARDS EQUITIES OVER BONDS (1416 GMT) Daniel Morris, senior investment strategist at BNP Asset Management, says that the strong economic growth we've been seeing would suggest that higher allocations to equities would be more appropriate. And this is despite the fact that retail investors put twice as much money into bond funds as they did into equities up to October last year (referencing figures from Broadridge Financial Solutions). \"Equities and credit should continue to offer the best hedge against the transition in central bank policies,\" Morris says. \"We expect equity market returns to again surpass those of fixed income in 2018. While valuations are somewhat high, they are not extreme and should be sustainable given that economic growth is expected to remain steady and inflation subdued.\" (Kit Rees) **** WHAT'S WORSE THAN OWNING A CARILLION SHARE? (1243 GMT) Holding a Carillion bond? While bond holders can usually expect to salvage some value in a bankruptcy, it appears the market is pricing in close to nothing for holders of Carillion's December 2019 convertible bond . It is trading at a cash price of less than 2, which roughly means it holds less than 2 percent of its face value. Yield: 286 percent... (the figure is purely theoretical given the bankruptcy procedure). Here's the bond's performance over the last 6 months: (Julien Ponthus and Abhinav Ramnarayan) U.S. EQUITIES, HAVE YOU SEEN THE RED FLAG? (NO, NOT THAT ONE) (1210 GMT) There's a warning sign creeping up on U.S. shares and, no, it's not the P/E ratios, Deutsche Bank's research found. \"While equity investors remain fixated on the market’s valuation relative to earnings, it is the dividend bubble quietly inflating in the background that should be of far greater concern\", the banks wrote in its \"13 tipping points in 2018\". It argues that \"History shows the Shiller multiple is terrible at indicating the right time to buy and sell\". \"The evidence shows that market gains in recent years have been propped up by unsustainable expectations of future dividends, and there are signs that 2018 could be the year the trend finally turns\", it believes. Here's a chart showing how a number of companies are stretching their pay-out ratio to keep up with dividend inflation: (Julien Ponthus) EUROPEAN BANKS ARE GARNERING ATTENTION (1153 GMT) In keeping with this wave of love for cyclical stocks, this time we've got analysts at Bankhaus Lampe saying that they prefer European banks over financial services. Bankhaus Lampe reckon that financial services, such as exchanges, will be supported by rising U.S. interest rates in the near term, but volatility is low and further gains for stocks such as asset managers may be more limited. \"Longer term (>12m), we believe that banks have greater upside potential, driven by yield curve steepening (QE tapering), cost savings (e-banking) and sector consolidation (or share buybacks) now that capital regulations (Basel 3) have been finalised,\" Bankhaus Lampe analysts say in a note. (Kit Rees) THE SILVER LINING TO A STRONGER EURO (1134 GMT) As the euro moves lower, European shares have cut losses with the STOXX 600 flat in late morning trade. But while there have been concerns more broadly about the euro's rise denting European company earnings, there is also a more positive view out there, as voiced by Chris Bailey, European strategist at Raymond James: \"Higher sentiment also means higher faith in pan-EU growth rates ... and with this comes the opportunity: outperformance and higher multiple potential for the more EU ‘domestic' -centred profit and cash flow generators,\" says Bailey in a note. \"That pushes you towards sectors including the financials, construction, retail, and telecoms versus the more export-centred ones.\" (Kit Rees) THE PROBLEM WITH \"VERY BRITISH\", BRITISH SHARES (1110 GMT) Viewed from the office of a Parisian asset manager, Carillion's collapse and this morning's concern surrounding Interserve are early signs of the pain Brexit is expected to bring and another reason to stay underweight on British shares. \"For all 'very British', British companies (that is almost entirely exposed to the UK economy) one can see that there is an issue with faltering sales\", said Olivier de Berranger, who heads asset management at France's La Financière de l’Echiquier. \"Markets pay little attention to Bre", "external_links": [], "published": "2018-01-17T19:16:00.000+02:00", "crawled": "2018-01-17T19:39:32.022+02:00", "highlightTitle": ""}