{"organizations": [], "uuid": "0ecf35368e0aa424985faf528c098129acdf8ec6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-amerisourcebergen-completes-acquisition-of-h-d-smith.html", "country": "US", "domain_rank": 767, "title": "AmerisourceBergen Completes Acquisition of H. D. Smith", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.038, "site_type": "news", "published": "2018-01-03T16:00:00.000+02:00", "replies_count": 0, "uuid": "0ecf35368e0aa424985faf528c098129acdf8ec6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-amerisourcebergen-completes-acquisition-of-h-d-smith.html", "ord_in_thread": 0, "title": "AmerisourceBergen Completes Acquisition of H. D. Smith", "locations": [], "entities": {"persons": [{"name": "h. d. smith", "sentiment": "negative"}], "locations": [{"name": "pa.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "abc", "sentiment": "negative"}, {"name": "amerisourcebergen corporation", "sentiment": "negative"}, {"name": "amerisourcebergen", "sentiment": "negative"}, {"name": "amerisourcebergen amerisourcebergen", "sentiment": "none"}, {"name": "h. d. smith", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VALLEY FORGE, Pa.--(BUSINESS WIRE)-- AmerisourceBergen Corporation (NYSE: ABC) today announced that it has completed the acquisition of H. D. Smith, the largest independent wholesaler in the U.S., for $815 million in cash, subject to a customary working capital adjustment. The acquisition is designed to enhance and expand AmerisourceBergen’s strategic scale, strengthen the company’s support to community pharmacy and drive long-term, durable value.\nAbout AmerisourceBergen\nAmerisourceBergen provides pharmaceutical products, value-driving services and business solutions that improve access to care. Tens of thousands of healthcare providers, veterinary practices and livestock producers trust us as their partner in the pharmaceutical supply chain. Global manufacturers depend on us for services that drive commercial success for their products. Through our daily work—and powered by our 20,000 associates—we are united in our responsibility to create healthier futures. AmerisourceBergen is ranked #11 on the Fortune 500, with more than $150 billion in annual revenue. The company is headquartered in Valley Forge, Pa. and has a presence in 50+ countries. Learn more at investor.amerisourcebergen.com .\nAmerisourceBergen's Cautionary Note Regarding Forward-Looking Statements\nCertain of the statements contained in this press release are “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Words such as “expect,” “likely,” “outlook,” “forecast,” “would,” “could,” “should,” “can,” “will,” “project,” “intend,” “plan,” “continue,” “sustain,” “synergy,” “on track,” “believe,” “seek,” “estimate,” “anticipate,” “may,” “possible,” “assume,” variations of such words, and similar expressions are intended to identify such forward-looking statements. These statements are based on management’s current expectations and are subject to uncertainty and change in circumstances. These statements are not guarantees of future performance and are based on assumptions that could prove incorrect or could cause actual results to vary materially from those indicated. Among the factors that could cause actual results to differ materially from those projected, anticipated, or implied are the following: unfavorable trends in brand and generic pharmaceutical pricing, including in rate or frequency of price inflation or deflation; competition and industry consolidation of both customers and suppliers resulting in increasing pressure to reduce prices for our products and services; changes in pharmaceutical market growth rates; changes in the United States healthcare and regulatory environment, including changes that could impact prescription drug reimbursement under Medicare and Medicaid; increasing governmental regulations regarding the pharmaceutical supply channel and pharmaceutical compounding; declining reimbursement rates for pharmaceuticals; federal and state government enforcement initiatives to detect and prevent suspicious orders of controlled substances and the diversion of controlled substances; increased public concern over the abuse of opioid medications; prosecution or suit by federal, state and other governmental entities of alleged violations of laws and regulations regarding controlled substances, and any related disputes, including shareholder derivative lawsuits; increased federal scrutiny and litigation, including qui tam litigation, for alleged violations of laws and regulations governing the marketing, sale, purchase and/or dispensing of pharmaceutical products or services, and associated reserves and costs, including the reserve recorded in connection with the proceedings with the United States Attorney’s Office for the Eastern District of New York; material adverse resolution of pending legal proceedings; the retention of key customer or supplier relationships under less favorable economics or the adverse resolution of any contract or other dispute with customers or suppliers; changes to customer or supplier payment terms; risks associated with the strategic, long-term relationship between Walgreens Boots Alliance, Inc. and the Company, including principally with respect to the pharmaceutical distribution agreement and/or the global generic purchasing services arrangement; changes in tax laws or legislative initiatives that could adversely affect the Company’s tax positions and/or the Company’s tax liabilities or adverse resolution of challenges to the Company’s tax positions; regulatory action in connection with the production, labeling or packaging of products compounded by our compounded sterile preparations (CSP) business; failure to realize the expected benefits from our reorganization and other business process initiatives; managing foreign expansion, including non-compliance with the U.S. Foreign Corrupt Practices Act, anti-bribery laws and economic sanctions and import laws and regulations; declining economic conditions in the United States and abroad; financial market volatility and disruption; substantial defaults in payment, material reduction in purchases by or the loss, bankruptcy or insolvency of a major customer; the loss, bankruptcy or insolvency of a major supplier; changes to the customer or supplier mix; malfunction, failure or breach of sophisticated information systems to operate as designed; risks generally associated with data privacy regulation and the international transfer of personal data; natural disasters or other unexpected events that affect the Company’s operations; the impairment of goodwill or other intangible assets, resulting in a charge to earnings; the acquisition of businesses that do not perform as expected, or that are difficult to integrate or control, including the integration of H. D. Smith and PharMEDium, or the inability to capture all of the anticipated synergies related thereto or to capture the anticipated synergies within the expected time period; the effects of disruption from the transactions on the respective businesses of the Company and H. D. Smith and the fact that the transactions may make it more difficult to establish or maintain relationships with employees, suppliers, customers and other business partners; the disruption of the Company’s cash flow and ability to return value to its stockholders in accordance with its past practices; interest rate and foreign currency exchange rate fluctuations; and other economic, business, competitive, legal, tax, regulatory and/or operational factors affecting the Company’s business generally. Certain additional factors that management believes could cause actual outcomes and results to differ materially from those described in forward-looking statements are set forth (i) in Item 1A (Risk Factors) in the Company’s Annual Report on Form 10-K for the fiscal year ended September 30, 2017 and elsewhere in that report and (ii) in other reports filed by the Company pursuant to the Securities Exchange Act.\n //www.businesswire.com/news/home/20180103005161/en/\nAmerisourceBergen Corporation\nKeri P. Mattox\nVice President, Corporate & Investor Relations\n610-576-7801\nkmattox@amerisourcebergen.com\nor\nBennett Murphy\nDirector, Corporate & Investor Relations\n610-727-3693\nbmurphy@amerisourcebergen.com\nSource: AmerisourceBergen Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestor.amerisourcebergen.com&esheet=51736877&newsitemid=20180103005161&lan=en-US&anchor=investor.amerisourcebergen.com&index=1&md5=36036b4cbd3ae5c569275b2e28628869", "http://www.businesswire.com/news/home/20180103005161/en/"], "published": "2018-01-03T16:00:00.000+02:00", "crawled": "2018-01-03T17:09:07.004+02:00", "highlightTitle": ""}