{"organizations": [], "uuid": "02f79adc3e3f65c0e48f8876b312849201573dfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222088978&w=1200&r=LYNXMPEE0E0EO", "site_section": "http://feeds.reuters.com/reuters/UKStocksAndSharesNews/", "section_title": "Reuters: Stocks & Shares News", "url": "https://uk.reuters.com/article/uk-europe-view-monday/daily-briefing-merkel-coalition-pact-misgivings-emerge-idUKKBN1F40T2", "country": "US", "domain_rank": 408, "title": "Daily Briefing: Merkel coalition pact - misgivings emerge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T10:23:00.000+02:00", "replies_count": 0, "uuid": "02f79adc3e3f65c0e48f8876b312849201573dfc"}, "author": "", "url": "https://uk.reuters.com/article/uk-europe-view-monday/daily-briefing-merkel-coalition-pact-misgivings-emerge-idUKKBN1F40T2", "ord_in_thread": 0, "title": "Daily Briefing: Merkel coalition pact - misgivings emerge", "locations": [], "entities": {"persons": [{"name": "merkel", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "milos zeman", "sentiment": "none"}, {"name": "martin schulz", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "dortmund", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "spd", "sentiment": "none"}, {"name": "social democratic party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 8:24 AM / Updated 27 minutes ago Daily Briefing: Merkel coalition pact - misgivings emerge Reuters Staff 6 Min Read \nLONDON (Reuters) - Despite Friday's preliminary coalition deal between Angela Merkel's conservatives and the rival SPD, it may not be all plain sailing towards her third government . Acting German Chancellor Angela Merkel and Social Democratic Party leader Martin Schulz attend a news conference after exploratory talks about forming a new coalition government at the SPD headquarters in Berlin, Germany, January 12, 2018. REUTERS/Hannibal Hanschke \nGrassroots SPD members made very clear at the weekend they feel short-changed by the accord and want substantial improvements in return for their backing at a congress set for next weekend. SPD leader Martin Schulz is due to make a statement tonight after party talks in Dortmund. Meanwhile Merkel is pushing to conclude by the middle of next month and her allies insist the SPD cannot now pick the deal apart. \nRussia-friendly Czech President Milos Zeman won the first round of voting to retain his job on Saturday , but the pro-western runner-up Jiri Drahos scored a solid 27 percent, making him a serious challenger in the second round vote in two weeks. Four other candidates who ended between the third and sixth place have all now endorsed Drahos, who is banking on a high turnout for the run-off vote. Zeman, who shunned public debates ahead of the first round, has now accepted Drahos' challenge to a television duel. \nThe collapse of British construction and services company Carillion has become increasingly political with Britain's opposition Labour Party calling for an investigation into the government's conduct in the matter. Notably Labour is asking why the government continued to award it contracts despite three profit warnings issued in the last six months; it also wants assurances the taxpayer won't be left footing the bill for its shortcomings. Czech President Milos Zeman next to his wife Ivana attends a news conference, after polling stations closed for the country's direct presidential election, in Prague, the Czech Republic January 13, 2018. REUTERS/Matej Stransky/Pool \nMARKETS \nThe surge goes on. MSCI’s all-country index of world stocks soared to new records overnight and gained almost 1 percent on the day, with MSCI’s Asia exJapan index breaching its 2007 high for the first time to set a new all-time record. The momentum of global economic growth through the closing months of last year is being underlined by the early stages of the fourth-quarter earnings season, where JPMorgan beat forecasts for its underlying profit growth last week and aggregate annual S&P500 earnings growth is now expected to come in at more than 12 percent. \nWall St stocks set new records on Friday , but U.S. markets will be mostly closed on Monday for the Martin Luther King Day holiday. The question of last week, however, was whether there was renewed pressure on the world’s main central banks to tighten monetary policy in the face of the ongoing boom. Signals that the European Central Bank was at least ready to review its stance has lifted euro/dollar to its highest since late 2014 overnight, setting a high of $1.2240 as it continued last week’s rally. This has depressed the dollar across the board and the dollar index set 3-year lows early on Monday. \nWhile headline December U.S. CPI inflation came in line with expectations on Friday, core inflation measures were ahead of forecasts but 10-year U.S. Treasuries remained calm. While Federal Reserve policy expectations have not shift much, all the speculation is surrounding the ECB and Bank of Japan’s super-easy monetary stance. Dollar/yen hit its lowest since September after upbeat comments from BOJ Governor Kuroda positive on inflation and the economy. The Canadian dollar too was firmer as markets brace for a possible interest rate rise from the Bank of Canada on Wednesday. \nSterling too added to its surge against the weak dollar on Friday to its highest since the June 2016 Brexit referendum. While the pound was little changed against the euro, it had been buoyed last week by reports of positive soundings on Brexit negotiations and even talk of growing support for a second referendum on leaving the European Union. European stocks futures are pointing to a slightly higher open. While it’s a quiet day in terms of company results, construction stocks will be in focus after Carillion collapsed after banks refused to lend it any more money. European retailers will be in focus after an update from Metro . Brent crude oil was firm just under $70. Editing by Toby Chopra", "external_links": [], "published": "2018-01-15T10:23:00.000+02:00", "crawled": "2018-01-15T11:04:32.013+02:00", "highlightTitle": ""}