{"organizations": [], "uuid": "8f96181d6b9bb37ac17c5c2f5d36234c27973863", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1225973485&w=1200&r=LYNXMPEE0R05Q", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-finland-election-president/finlands-president-niinisto-tipped-for-re-election-in-first-round-vote-idUSKBN1FH06X", "country": "US", "domain_rank": 408, "title": "Finland's president Niinisto tipped for re-election in first round vote", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T10:24:00.000+02:00", "replies_count": 0, "uuid": "8f96181d6b9bb37ac17c5c2f5d36234c27973863"}, "author": "", "url": "https://www.reuters.com/article/us-finland-election-president/finlands-president-niinisto-tipped-for-re-election-in-first-round-vote-idUSKBN1FH06X", "ord_in_thread": 0, "title": "Finland's president Niinisto tipped for re-election in first round vote", "locations": [], "entities": {"persons": [{"name": "niinisto", "sentiment": "negative"}, {"name": "pekka haavisto", "sentiment": "none"}, {"name": "sauli niinisto", "sentiment": "none"}], "locations": [{"name": "finland", "sentiment": "none"}, {"name": "helsinki", "sentiment": "none"}, {"name": "crimea", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "national coalition party", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 8:26 AM / in 42 minutes Finns, worried by Russia, hand president huge election win Jussi Rosendahl , Tuomas Forsell 3 Min Read \nHELSINKI (Reuters) - Finland’s President Sauli Niinisto cruised to a rare first round election win on Sunday after a campaign in which his delicate balancing of ties with neighbor Russia and the U.S.-led NATO military alliance resonated with voters. \nWith all votes counted, Niinisto won 62.7 percent of the vote, the election commission said, his closest rival Pekka Haavisto of the Greens of Finland securing just 12.4 percent. \n“I am very surprised at this kind of support. I must think hard how to be worthy of it,” Niinisto, 69, told reporters. \n“I have no intention of making changes just for the sake of making changes. Surely we will follow very closely what is happening outside of Finland, globally, and if needed, then we will surely react.” \nPro-EU Niinisto became the first candidate to win a first round victory since the electoral system was changed to a direct popular vote in 1994. \nEurosceptic politicians, Laura Huhtasaari from the nationalist Finns Party and independent Paavo Vayrynen, won 6.9 percent and 6.2 percent of votes, respectively. Turnout was 69.9 percent. \nDuring his first six-year term, Niinisto was instrumental in maintaining relations with Moscow, despite Finland backing western economic sanctions against Russia over its 2014 annexation of Crimea from Ukraine. Children watch as voter casts her ballot during presidential election in Helsinki, Finland January 28, 2018. Lehtikuva/Heikki Saukkomaa/via REUTERS \nFinland, which shares an 833-mile (1,340 km) border and a difficult history with Russia, has also developed closer ties with NATO but stopped short of full membership in line with a tradition of avoiding confrontation with Russia. \nThe president is in charge of foreign and defense policy together with the government, but otherwise the post has become largely ceremonial in the past few decades. Slideshow (13 Images) \nDespite Finland’s stance on sanctions against Russia, Niinisto has appeared as a low-profile middle-man between East and West and maintained regular contacts with Russian President Vladimir Putin. \n“I think there is no reason to seek a (NATO) membership as long as circumstances are as they are now,” Niinisto said on Sunday. “But if there are crucial changes in the environment, then we might be in a different situation.” \nPublic backing for joining NATO has lingered around 20 percent for years, although it briefly edged up in 2014 after Russia’s action in Crimea. \nNiinisto originally belonged to center-right National Coalition Party (NCP) but campaigned this time around as an independent. \nA lawyer by training, he was finance minister in the 1990s, becoming known for his government’s austerity measures following Finland’s recession, as well as the decision to join the euro area. Reporting by Jussi Rosendahl and Tuomas Forsell; Editing by Keith Weir and Jon Boyle", "external_links": [], "published": "2018-01-28T10:24:00.000+02:00", "crawled": "2018-01-28T10:41:42.032+02:00", "highlightTitle": ""}