{"organizations": [], "uuid": "37ffb11a73622d3ebcb7181047ffe763726e7a44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222525600&w=1200&r=LYNXMPEE0F1IQ", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-gymnastics-usa-nassar/victim-of-former-usa-gymnastics-doctor-says-abuse-led-to-dads-suicide-idUKKBN1F52NP", "country": "US", "domain_rank": 408, "title": "Victim of former USA gymnastics doctor says abuse led to dad's suicide", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T22:45:00.000+02:00", "replies_count": 0, "uuid": "37ffb11a73622d3ebcb7181047ffe763726e7a44"}, "author": "", "url": "https://uk.reuters.com/article/uk-gymnastics-usa-nassar/victim-of-former-usa-gymnastics-doctor-says-abuse-led-to-dads-suicide-idUKKBN1F52NP", "ord_in_thread": 0, "title": "Victim of former USA gymnastics doctor says abuse led to dad's suicide", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 8:47 PM / Updated 2 hours ago Victim of former USA gymnastics doctor says abuse led to dad's suicide Brendan McDermid 3 Min Read \nLANSING, Mich. (Reuters) - One of the victims of USA Gymnastics team physician Larry Nassar, who pleaded guilty to molesting dozens of girls, on Tuesday blamed the disgraced doctor for her father’s suicide. \nKyle Stephens, pausing to compose herself during Nassar’s sentencing hearing in a courtroom in Lansing, Michigan, said the doctor, a family friend, began molesting her when she was 6 years old and her parents did not believe her when she told them. \n“You convinced my parents that I was a liar,” Stephens said. \n“Little girls don’t stay little forever,” she added. “They grow into strong women that return to destroy your world.” \nOnce her father realized she was telling the truth, he took his own life, Stephens said. \nStephens was the first of nearly 100 women who are expected to provide victim-impact statements during the four-day hearing. \nProsecutors are seeking a life sentence for the 54-year-old Nassar, who served as the USA Gymnastics physician through four Olympic Games. \nSeveral victims gave emotional testimony on Tuesday and asked Ingham County Court Judge Rosemarie Aquilina to impose the maximum sentence. Kyle Stephens delivers a victim impact testimony during a sentencing hearing for Dr. Larry Nassar in Lansing, Michigan, U.S., January 16, 2018. REUTERS/Brendan McDermid \nNassar is already serving a 60-year-sentence after pleading guilty in July in federal court to child pornography charges. \nAttired in blue prison garb, Nassar sat with his head down on Tuesday and did not appear to make eye contact with the victims when they addressed him directly. At one point, he took off his eyeglasses and dabbed his eyes with a tissue. Slideshow (8 Images) \nAt a November hearing when he pleaded guilty to multiple counts of sexual assault, Nassar apologised for his crimes, the Lansing State Journal reported. \nNassar was the team physician for the Michigan State University gymnastics and women’s crew teams, as well as an associate professor at MSU’s College of Osteopathic Medicine. \nOlympic gold medallists Aly Raisman, Gabby Douglas and McKayla Maroney have gone public in recent months, saying they were assaulted by Nassar while undergoing treatment. \nOn Monday, four-time Olympic gold medallist Simone Biles said on her Twitter account that she, too, was abused by Nassar. An attorney for Nassar, Matt Newburg, declined on Monday to comment on Biles’ accusations. \nBiles and Raisman are among a number of victims who accuse USA Gymnastics and Michigan State of not properly vetting Nassar. \nBoth organizations previously said they were unaware of Nassar’s crimes. In March, USA Gymnastics president Steve Penny resigned amid criticism of the organization’s handling of the scandal. Additional reporting and writing by Keith Coffman in Denver; Editing by Leslie Adler", "external_links": [], "published": "2018-01-16T22:45:00.000+02:00", "crawled": "2018-01-17T00:11:40.010+02:00", "highlightTitle": ""}