{"organizations": [], "uuid": "7f7f4dd4011c470dcb8b640f03fca4b3e167e8d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 14, "shares": 14, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-891675014.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/16/net-neutrality-fcc-states-lawsuit/", "country": "US", "domain_rank": 1196, "title": "Net Neutrality: 21 States Sue FCC Over Ruling | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.931, "site_type": "news", "published": "2018-01-17T23:31:00.000+02:00", "replies_count": 0, "uuid": "7f7f4dd4011c470dcb8b640f03fca4b3e167e8d3"}, "author": "Reuters", "url": "http://fortune.com/2018/01/16/net-neutrality-fcc-states-lawsuit/", "ord_in_thread": 0, "title": "Net Neutrality: 21 States Sue FCC Over Ruling | Fortune", "locations": [], "entities": {"persons": [{"name": "alex edelman", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "district of columbia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "fcc", "sentiment": "negative"}, {"name": "federal communications commission", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Net neutrality 21 States Are Suing the FCC to Restore Net Neutrality Rules A woman holds a 'Save the Net' protest sign during a demonstration outside the FCC headquarters in Washington, D.C. on Dec. 13, 2017. Alex Edelman—AFP/Getty Images By Reuters 9:31 PM EST \nA group of 21 U.S. state attorneys general filed suit to challenge the Federal Communications Commission’s decision to do away with net neutrality on Tuesday while Democrats said they needed just one more vote in the Senate to repeal the FCC ruling. \nThe state attorneys, including those of California, New York and Virginia as well as the District of Columbia, filed a petition to challenge the action, calling it “arbitrary, capricious and an abuse of discretion” and saying that it violated federal laws and regulations. \nThe petition was filed with a federal appeals court in Washington as Senate Democrats said on Tuesday they had the backing of 50 members of the 100-person chamber for repeal, leaving them just one vote short of a majority. \nEven if Democrats could win a majority in the Senate, a repeal would also require winning a vote in the House of Representatives, where Republicans hold a greater majority, and would still be subject to a likely veto by President Donald Trump. \nSenator Ed Markey said in a statement that all 49 Democrats in the upper chamber backed the repeal. Earlier this month, Republican Senator Susan Collins said she would back the effort to overturn the FCC’s move. Democrats need 51 votes to win any proposal in the Republican-controlled Senate because Vice President Mike Pence can break any tie. \nTrump backed the FCC action, the White House said last month, and overturning a presidential veto requires a two-thirds vote of both chambers. \nStates said the lawsuit was filed in an abundance of caution because, typically, a petition to challenge would not be filed until the rules legally take effect, which is expected later this year. \nInternet advocacy group Free Press, the Open Technology Institute and Mozilla Corp filed similar protective petitions on Tuesday. \nThe FCC voted in December along party lines to reverse rules introduced in 2015 that barred internet service providers from blocking or throttling traffic or offering paid fast lanes, also known as paid prioritization. The new rules will not take effect for at least three months, the FCC has said. \nSenate Democratic Leader Chuck Schumer said the issue would be a major motivating factor for the young voters the party is courting. \nA trade group representing major tech companies including Facebook (fb) , Alphabet (goog) and Amazon.com (amzn) said it would support legal challenges to the reversal. \nThe FCC vote in December marked a victory for AT&T (t) , Comcast (etb) and Verizon Communications (vz) and handed them power over what content consumers can access on the internet. It was the biggest win for FCC Chairman Ajit Pai in his sweeping effort to undo many telecommunications regulations. \nWhile the FCC order grants internet providers sweeping new powers it does require public disclosure of any blocking practices. Internet providers have vowed not to change how consumers obtain online content. \nHouse Energy and Commerce Committee Chairman Greg Walden, a Republican, said in an interview on Tuesday he planned to hold a hearing on paid prioritization. He has urged Democrats to work constructively on a legislative solution to net neutrality “to bring certainty and clarity going forward and ban behaviors like blocking and throttling.” \nHe said he does not believe a vote to overturn the FCC decision would get a majority in the U.S. House. Representative Mike Doyle, a Democrat, said Tuesday that his bill to reverse the FCC decision had 80 co-sponsors. \nPaid prioritization is part of American life, Walden said. “Where do you want to sit on the airplane? Where do you want to sit on Amtrak?” he said. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-17T23:31:00.000+02:00", "crawled": "2018-01-17T04:40:09.011+02:00", "highlightTitle": ""}