{"organizations": [], "uuid": "6d2fefb5d767687b270742bf74ec0bed87397a11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-shyft-announces-promotion-of-priya-sapra-to-chief-operating-officer.html", "country": "US", "domain_rank": 767, "title": "SHYFT Announces Promotion of Priya Sapra to Chief Operating Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T16:15:00.000+02:00", "replies_count": 0, "uuid": "6d2fefb5d767687b270742bf74ec0bed87397a11"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-shyft-announces-promotion-of-priya-sapra-to-chief-operating-officer.html", "ord_in_thread": 0, "title": "SHYFT Announces Promotion of Priya Sapra to Chief Operating Officer", "locations": [], "entities": {"persons": [{"name": "priya sapra", "sentiment": "negative"}, {"name": "bhargava", "sentiment": "none"}, {"name": "sapra", "sentiment": "none"}, {"name": "zack king", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "waltham", "sentiment": "none"}], "organizations": [{"name": "shyft analytics", "sentiment": "negative"}, {"name": "shyft", "sentiment": "none"}, {"name": "customer success", "sentiment": "none"}, {"name": "product innovation for shyft", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WALTHAM, Mass., Jan. 16, 2018 /PRNewswire/ -- SHYFT Analytics , the leading data and analytics cloud for life sciences, today announced that Priya (Bhargava) Sapra has been named Chief Operating Officer and Chief Product Officer. Priya is part of SHYFT's executive team and oversees Product Innovation for SHYFT's award winning platform. Her role will expand to include leadership of the Customer Success organization, SHYFT's expert team responsible for managing the relationship with and success of the company's global customer base. Sapra will continue to report to CEO Zack King.\n\"We are fortunate to have incredible talent across SHYFT's executive team,\" said Zack King, founder and CEO at SHYFT. \"Priya exemplifies that and she is hands-down one of the best operating executives with whom I've had the pleasure of working. She has been critical to our impressive growth - under her leadership, she has grown the SHYFT Platform into the leading life sciences analytics cloud and expanded its footprint to address several major strategic healthcare problems across the industry.\"\nKing continued, \"Priya is taking on new and added responsibilities and I'm excited that she will bring her innovative talents directly to our customers and teams to accelerate the value they drive through their partnership with SHYFT. Our customers and products are in very good hands.\"\nPriya joined SHYFT in 2012 and has assumed a variety of leadership roles, most recently as Chief Product Officer. Her leadership has been critical throughout the company with significant contributions to the Executive, Product and Customer Success teams. As a passionate problem solver and operational wunderkind, Priya will enable our customers' success with new product innovations that will impact patient lives for years to come.\nPrior to SHYFT, Priya served as the Head of Analytics for Phreesia, a patient-centered health care technology company in New York, NY and Vice President of Quantitative Services for MedPanel, a research and consulting firm in Cambridge, MA. She earned her MBA in Entrepreneurship from Babson College as well as a Master's degree in Epidemiology and Biostatistics from Boston University. Priya completed her undergraduate studies from Massachusetts Institute of Technology (MIT) in Biology and Literature.\n\"It is a sincere privilege to serve as the leader of these two exceptional teams. Each is primed to accelerate our already exciting trajectory; further solidifying our position as an industry leader in life sciences data, analytics and technology,\" said Priya Sapra. \"My humble aspiration is to simply galvanize the ongoing evolution underway in both organizations and help each fully realize their potential, both independently and in cooperation. My hope is to maintain the highest levels of operational excellence by driving additional automated processes and developing more robust self-service environments for both our internal teams and external collaborators, while maintaining the high-touch customer partnership for which SHYFT is valued.\"\nAbout SHYFT\nSHYFT Analytics is the leading analytics cloud platform for life sciences with products and solutions designed specifically for the unique pharmaceutical, biotech, and medical device industry. SHYFT's Data Analytics Platform is the most efficient and scalable way to transform massive amounts of complex healthcare data into on-demand clinical and commercial insight. SHYFT is headquartered in Boston with offices in San Francisco and New York City. Learn more about SHYFT at www.shyftanalytics.com , or follow the company on Twitter @SHYFTAnalytics or LinkedIn .\nView original content: http://www.prnewswire.com/news-releases/shyft-announces-promotion-of-priya-sapra-to-chief-operating-officer-300581578.html\nSOURCE SHYFT Analytics", "external_links": ["http://www.shyftanalytics.com/", "http://www.prnewswire.com/news-releases/shyft-announces-promotion-of-priya-sapra-to-chief-operating-officer-300581578.html", "https://twitter.com/shyftanalytics", "https://www.linkedin.com/company/shyft-analytics"], "published": "2018-01-16T16:15:00.000+02:00", "crawled": "2018-01-16T16:18:03.003+02:00", "highlightTitle": ""}