{"organizations": [], "uuid": "a8741a5e6c1bf3349632667af0b974e4f2b1fd42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/03/17/104349215-Untitled.1910x1000.png", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/americans-would-rather-talk-about-weight-than-money.html", "country": "US", "domain_rank": 767, "title": "Americans would rather talk about weight than money", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.199, "site_type": "news", "published": "2018-01-22T16:52:00.000+02:00", "replies_count": 0, "uuid": "a8741a5e6c1bf3349632667af0b974e4f2b1fd42"}, "author": "Emmie Martin", "url": "https://www.cnbc.com/2018/01/22/americans-would-rather-talk-about-weight-than-money.html", "ord_in_thread": 0, "title": "Americans would rather talk about weight than money", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "bankrate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "For many Americans, money is not a topic that's openly talked about. Some are so willing to avoid the uncomfortable discussion that they'd prefer another much-maligned subject: Their weight.\nIn its 2017 Money Matters report , investing app Acorns surveyed more than 3,000 Americans between the ages of 18 and 44. When asked, \"Would you rather talk about how much you weigh or how much you have in savings?\" 68 percent chose their weight.\nThe breakdown by gender differed slightly. While 72 percent of men chose weight, only 64 percent of women did. What's unclear is if this means women are more willing to discuss their finances or less willing to discuss their bodies.\nJudging by the amount respondents reported saving last year, though, it might make sense that two-thirds of people would rather talk about weight.\nshow chapters Bill Gates’ net worth would tank if he was literally worth his weight in gold 6:02 PM ET Fri, 12 May 2017 | 00:58 Nearly 60 percent of Americans say they saved less than $99 per month in 2017. That's a mere $1,188 for the entire year.\nOne in four respondents say they put away nothing at all.\nData from Bankrate's latest financial security index survey backs up these startling statistics. According to the report, only 39 percent of survey respondents said they would be able to cover a $1,000 setback using their savings and 19 percent would have to turn to credit cards to deal with an emergency.\nA similar 2016 GOBankingRates survey found that 69 percent of Americans had less than $1,000 in total savings and 34 percent had no savings at all.\nThe Money Matters report also revealed how far Americans would go to put extra cash in their pockets. Only 8 percent of respondents would spend a week in jail in exchange for $1,000, but 38 percent would give up Internet access for a week and 41 percent would say adios to coffee for an entire year.\nThat $1,000 would be put to good use too. Only 10 percent would splurge on a big trip and 38 percent of respondents would use it to pay down debt.\nDon't miss: Here's why you shouldn't close out old credit cards, even if you don't use them\nLike this story? Like CNBC Make It on Facebook !\nshow chapters Suze Orman says this mental shift is the key to saving money 7:59 AM ET Wed, 1 Nov 2017 | 00:59", "external_links": [], "published": "2018-01-22T16:52:00.000+02:00", "crawled": "2018-01-22T16:59:56.005+02:00", "highlightTitle": ""}