{"organizations": [], "uuid": "660a8b3d720fce71cab973b82ac2e56896e0f95c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222923431&w=1200&r=LYNXMPEE0H095", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/us-southkorea-bitcoin-threats/old-hands-in-south-korea-bitcoin-market-unfazed-by-threats-of-ban-idINKBN1F70F9", "country": "US", "domain_rank": 408, "title": "Old hands in South Korea Bitcoin market unfazed by threats of ban", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T06:36:00.000+02:00", "replies_count": 0, "uuid": "660a8b3d720fce71cab973b82ac2e56896e0f95c"}, "author": "", "url": "https://in.reuters.com/article/us-southkorea-bitcoin-threats/old-hands-in-south-korea-bitcoin-market-unfazed-by-threats-of-ban-idINKBN1F70F9", "ord_in_thread": 0, "title": "Old hands in South Korea Bitcoin market unfazed by threats of ban", "locations": [], "entities": {"persons": [{"name": "dahee kim", "sentiment": "none"}, {"name": "marius zaharia", "sentiment": "none"}, {"name": "bitcoin", "sentiment": "none"}], "locations": [{"name": "south korea bitcoin", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "bitcoin", "sentiment": "none"}], "organizations": [{"name": "btc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 4:37 AM / Updated 11 hours ago Old hands in South Korea Bitcoin market unfazed by threats of ban Dahee Kim , Marius Zaharia 5 Min Read \nSEOUL/HONG KONG (Reuters) - Threats of a potential cryptocurrency trading ban in South Korea have scared many investors away, but some veterans of the young market are defiant, saying restrictions would be relatively easy to circumvent. \nAlthough the cryptocurrency market lost about $200 billion this week, or a third of its value, these investors - known within the community as “hodlers” after a misspelled meme that went viral during Bitcoin’s early days - are used to rollercoaster rides. \nChina's shutdown of local exchanges in September, for instance, caused a 50 percent drop in Bitcoin, but prices rebounded eight-fold to almost $20,000. Currently valued around $10,000, Bitcoin BTC=BTSP could be poised for a similar whirlwind this time around, some say. \n“In case the government shuts down all local exchanges, investors can always go abroad and open an account there,” said a South Korean student who declined to be named because of legal risks. “I can ask my friends who study abroad or travel there myself. It’s not that big of a problem.” \nCryptocurrency experts say the student probably has good reason to be relaxed. A ban could discourage new market entrants, but the anonymity of buyers and sellers and the ability to move digital assets anywhere in the world with a click makes it hard to impose restrictions on existing participants without a global consensus. \nPlaces like Singapore and Hong Kong maintain light regulations, while neighboring Japan has encouraged a vast ecosystem of companies and investors around digital assets by pioneering a set of rules for the industry. Germany has said national restrictions may be useless. \nVPNs, OFFLINE WALLETS \nAccording to industry experts, the first step to circumventing a ban is hiding IP addresses from authorities via virtual private networks (VPNs). \nTraders can then continue business as usual. Decentralized exchanges, such as Shapeshift or Stellar Dex, do not require identification and can be accessed from anywhere. \nCryptocurrency wallets such as Exodus and Jaxx are linked to such exchanges, so trading and storing the assets can still be anonymous. Authorities in countries with strong legal protections may need a warrant to check computers or smartphones for proof of such activity. \nEven then, unless caught in the act, the holder can claim no trading has taken place since the legislation was approved and has forgotten the password for the wallet. \nSome decentralized exchanges offer derivative products that allow betting on the price of a cryptocurrency against a fiat currency, including the Korean won and Chinese yuan. But cashing out in fiat is not possible on such exchanges. \nAn option in that case is to trade all cryptocurrencies for a top one such as Bitcoin, Ethereum or Litecoin, and sell it at one the 2,064 crypto ATMs in 61 countries, although the transaction fees can exceed 10 percent. If need be, coins can be stored on offline “wallets” the size of a USB stick. \nAlternatively, holders can open bank accounts in countries that have not banned Bitcoin, then join a local centralized exchange where they can trade cryptocurrencies for fiat. \n“I hold everything in a hard wallet the size of my thumb. I have copies of my private keys in a safe. I have accounts on four exchanges on three continents. If any government wants my money, good luck to them,” said a Hong Kong-based investor who claims to hold “about $1 million” in various cryptocurrencies. CROSSING BORDERS \nA 30-year-old nurse in Seoul said she had already switched to Hong Kong-based exchange Binance before the government’s warnings hit the market. Company officers at Seoul-based exchanges say, anecdotally, such moves have accelerated. \n“All this could lead to serious money outflow and only the government is not aware of it,” one officer said, requesting anonymity. \nSouth Korea accounts for between 5 and 15 percent of daily Bitcoin trading. The value of all Bitcoins is around $200 billion. \nIf opening accounts overseas proves difficult, friends, family or the local Bitcoin community can help. Another option is to find someone with access to an exchange - preferably using encrypted social media apps such as Whatsapp or Telegram - and sell to them at a discount. But fraud is a risk. \n“There could be a black market where people who can cash out offshore can pay you in won for your Bitcoins,” said Aurelian Menant, chief executive of Hong-Kong based exchange Gatecoin. \nBut that leaves the door open to “dodgy stuff,” Menant said, adding that the fear of scams in the aftermath of a ban may deter new investors, potentially shrinking Korean trading volumes “from billions to millions.” Reporting by Dahee Kim in SEOUL and Marius Zaharia in HONG KONG; Writing by Marius Zaharia", "external_links": [], "published": "2018-01-18T06:36:00.000+02:00", "crawled": "2018-01-18T07:01:28.028+02:00", "highlightTitle": ""}