{"organizations": [], "uuid": "e6ce35d0173881b8e81655837a0418dd7e23d1d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-capital-southwest-announces-third-quarter-fiscal-year-2018-earnings-release-and-conference-call-schedule.html", "country": "US", "domain_rank": 767, "title": "Capital Southwest Announces Third Quarter Fiscal Year 2018 Earnings Release and Conference Call Schedule", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-19T00:01:00.000+02:00", "replies_count": 0, "uuid": "e6ce35d0173881b8e81655837a0418dd7e23d1d1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-capital-southwest-announces-third-quarter-fiscal-year-2018-earnings-release-and-conference-call-schedule.html", "ord_in_thread": 0, "title": "Capital Southwest Announces Third Quarter Fiscal Year 2018 Earnings Release and Conference Call Schedule", "locations": [], "entities": {"persons": [], "locations": [{"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "capital southwest", "sentiment": "negative"}, {"name": "capital southwest corporation", "sentiment": "negative"}, {"name": "business development company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 18, 2018 (GLOBE NEWSWIRE) -- Capital Southwest Corporation (“Capital Southwest” or the “Company”) (Nasdaq:CSWC), an internally managed Business Development Company focused on providing flexible financing solutions to support the acquisition and growth of middle market businesses, announced today that it will release its third quarter 2018 results on Monday, February 5, 2018 after the market closes. In conjunction with the release, Capital Southwest has scheduled a conference call which will be broadcast live via phone and over the Internet on Tuesday, February 6, 2018 at 11:00 a.m. Eastern time. Investors may participate either by phone or audio webcast.\nBy Phone:\nDial (866)-502-8274 and provide the operator with Conference ID 2059388 at least 10 minutes before the call. A replay of the conference call will be available shortly afterwards until February 13, 2018, by dialing (855)-859-2056 and entering Conference ID 2059388.\nBy Webcast:\nConnect to the webcast using the Investor Relations section of Capital Southwest's website at www.capitalsouthwest.com , or by using https://edge.media-server.com/m6/p/fjcnt2yo . Please log in at least 10 minutes in advance to register and download any necessary software. A replay of the conference call will be available on Capital Southwest's website shortly after the call.\nAbout Capital Southwest\nCapital Southwest Corporation (Nasdaq:CSWC) is a Dallas, Texas-based, internally managed Business Development Company with approximately $293 million in net assets as of September 30, 2017. As a middle-market lending firm focused on supporting the acquisition and growth of middle market businesses, Capital Southwest makes investments ranging from $5 to $20 million in securities across the capital structure, including first lien, unitranche, second lien, subordinated debt and non-control equity co-investments. As a public company with a permanent capital base, Capital Southwest has the flexibility to be creative in its financing solutions and to invest to support the growth of its portfolio companies over long periods of time.\nForward-Looking Statements\nThis press release contains historical information and forward-looking statements within the meaning of The Private Securities Litigation Reform Act of 1995 with respect to the business and investments of Capital Southwest. Forward-looking statements are statements that are not historical statements and can often be identified by words such as “will,” “may,” “could,” “believe,” “expect“ and similar expressions and variations or negatives of these words. These statements are based on management's current expectations, assumptions and beliefs. They are not guarantees of future results and are subject to numerous risks, uncertainties and assumptions that could cause actual results to differ materially from those expressed in any forward-looking statement. These risks include risks related to changes in the markets in which Capital Southwest invests, changes in the financial and lending markets, regulatory changes, tax treatment and general economic and business conditions.\nReaders should not place undue reliance on any forward-looking statements and are encouraged to review Capital Southwest's Annual Report on Form 10-K for the year ended March 31, 2017 and subsequent filings with the Securities and Exchange Commission for a more complete discussion of the risks and other factors that could affect any forward-looking statements. Except as required by the federal securities laws, Capital Southwest does not undertake any obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events, changing circumstances or any other reason after the date of this press release.\nInvestor Relations Contacts:\nMichael S. Sarner, Chief Financial Officer\n214-884-3829\nSource:Capital Southwest Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/5a82239b-c87d-42f8-b03f-c9e4f9d7fc46", "https://www.globenewswire.com/Tracker?data=R61wHANfSySoU5tjX8ftxOM-J5xuCRMnUZeTNNTH_4qjBUgXLepIA50EbU9zsZSOabkspEfaYUsKix1wlGWu_xWsOMHZxS7cFUw0wGdCPqg=", "https://www.globenewswire.com/Tracker?data=qOcGVqLKhcPx3yfecDq-RNOYGXuqIZ4p5lzyZc_8kvq2R4uv43_CnxWeQKmtTmprCJhFvDGxEOlKF14059uQt2z4mFOmvhN07DTF1C4ppqXo-ltfpArGiV-4LzhbdI8ouzjYO8wiZ7yjv2Y3oi6KfA==", "https://edge.media-server.com/m6/p/fjcnt2yo"], "published": "2018-01-19T00:01:00.000+02:00", "crawled": "2018-01-19T01:02:27.003+02:00", "highlightTitle": ""}