{"organizations": [], "uuid": "68eacdbc65216e717ad845db42d4a9f031d9cca9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/11", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-evercore-reports-record-full-year-2017-results-quarterly-dividend-of-0-point-40-per-share.html", "country": "US", "domain_rank": 767, "title": "Evercore Reports Record Full Year 2017 Results; Quarterly Dividend Of $0.40 Per Share", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:00:00.000+02:00", "replies_count": 0, "uuid": "68eacdbc65216e717ad845db42d4a9f031d9cca9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-evercore-reports-record-full-year-2017-results-quarterly-dividend-of-0-point-40-per-share.html", "ord_in_thread": 0, "title": "Evercore Reports Record Full Year 2017 Results; Quarterly Dividend Of $0.40 Per Share", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 31, 2018 /PRNewswire/ --\nFourth Quarter 2017 Results\n2017 Full Year Results\nU.S. GAAP\nAdjusted (1)\nU.S. GAAP\nAdjusted (1)\nvs.\nQ4 2016\nvs.\nQ4 2016\nvs.\n2016\nvs.\n2016\nNet Revenues ($ millions)\n$\n540.0\n21%\n$\n465.5\n5%\n$\n1,704.3\n18%\n$\n1,625.8\n14%\nOperating Income ($ millions)\n$\n184.1\n89%\n$\n134.2\n6%\n$\n428.8\n64%\n$\n426.5\n13%\nNet Income (Loss) Attributable to Evercore Inc. ($ millions)\n$\n(19.4)\n(145%)\n$\n78.0\n5%\n$\n125.5\n17%\n$\n276.4\n24%\nDiluted Earnings (Loss) Per Share\n$\n(0.50)\n(151%)\n$\n1.55\n8%\n$\n2.80\n15%\n$\n5.45\n26%\nOperating Margin\n34.1\n%\n1,224 bps\n28.8\n%\n11 bps\n25.2\n%\n702 bps\n26.2\n%\n(24) bps\n(1) Excluded from the Company's Adjusted results is the impact of the enactment of the Tax Cuts and Jobs Act that was signed into law on December 22, 2017. See pages 3, 4, 6, 7 and A-3 for further discussion.\nBusiness and Financial\nHighlights\n-\nRecord Net Revenues, Net Income Attributable to Evercore Inc. and Earnings Per Share for full year 2017, on both a U.S. GAAP and an Adjusted basis\n-\nRecord fourth quarter Net Revenues, Net Income Attributable to Evercore Inc. and Earnings Per Share on an Adjusted basis. Record fourth quarter Net Revenues and Operating Income on a U.S. GAAP basis; Fourth quarter Net Income Attributable to Evercore Inc. and Earnings Per Share on a U.S. GAAP basis were negatively impacted by adjustments related to the Tax Cuts and Jobs Act\n-\nFull year U.S. GAAP and Adjusted Operating Margins sustained above 25%, while investing significantly in talent to position for future growth\n-\nAdvisory Revenues for 2017 increased 21% versus the prior year, on both a U.S. GAAP and an Adjusted basis\n-\nAdvising clients on strategic transactions globally:\n- Advising Qualcomm Incorporated on Broadcom Limited's $129 billion unsolicited takeover proposal\n- Advising the Board of Directors of Aetna on its $77 billion sale to CVS Health\n- Advising Energy Future Holdings on the ~$19 billion sale of Oncor to Sempra Energy\n- Advising the Special Committee of Global Logistic Properties Limited on its $16 billion sale to Nesta Investment Holdings Limited\nTalent\n-\nPaul R. Aaron joined the Advisory team in the fourth quarter focused on advising large multinational Industrial clients, completing 2017 with the addition of seven Advisory Senior Managing Directors and Senior Advisors\n-\nMichael J. Paliotta joined the Equities team as CEO in the fourth quarter, in addition to two Senior Managing Directors in Research in 2017\n-\nAnnounced the addition of one Senior Managing Director and promoted six Managing Directors to Senior Managing Director in Advisory in 2018\nStrategic\nTransaction\n-\nClosed the sale of the Institutional Trust and Independent Fiduciary business of Evercore Trust Company in October\nCapital Return\n-\nQuarterly dividend of $0.40 per share\n-\n$361.3 million returned to shareholders during the year through dividends and repurchases, including repurchases of 3.9 million shares/units at an average price of $75.02\nEvercore Inc. (NYSE: EVR) today announced its results for the full year ended December 31, 2017.\nLEADERSHIP COMMENTARY\nRalph Schlosstein, President and Chief Executive Officer\n\"Evercore's fourth quarter and full year 2017 results reflect continued strong performance in our Investment Banking business globally. We delivered our ninth consecutive year of growth in Adjusted revenues, Adjusted earnings and Adjusted EPS, reporting consistently competitive year over year operating margins despite making significant investments in the business through the addition of meaningful senior talent in both the Advisory and the Equities businesses. Strategic Advisory services drove our performance, supporting clients in M&A, restructuring, activism and defense and other strategic initiatives and Capital Advisory services, including underwriting, continued to grow rapidly. Our strong results enabled us to deliver significant value to our shareholders, returning more than $361 million of capital in 2017, through increased dividends and significant share repurchases,\" said Ralph Schlosstein, President and Chief Executive Officer.\nJohn S. Weinberg, Executive Chairman\n\"Our Advisory business continues to grow in reach and breadth. We finished the year ranked first in the global and U.S. league tables for announced transactions among independent advisors, fifth in the U.S. among all firms and seventh globally among all firms. Our teams are advising on the two largest M&A transactions for the year, three of the five largest public activist campaigns of 2017 and our restructuring business continues to be active in distressed industries globally,\" said John S. Weinberg, Executive Chairman. \"Fundamentals for a healthy M&A market remain in place globally and our clients continue to evaluate strategic actions to drive growth, to adapt to changing technologies and U.S. tax reform and to position for the synchronous improvement in the economic environment globally.\"\nRoger C. Altman, Founder and Senior Chairman\n\"Our consistent investment in talent over many years is clearly contributing to the strong results in our Advisory business. We are pleased with our early results in the Industrials sector, which added three SMDs last year, and expect to make significant investments in senior talent again in 2018,\" said Roger C. Altman, Founder and Senior Chairman. \"We are particularly pleased with the class of six Advisory Senior Managing Directors promoted in January; our largest ever class of internal promotions. Talent developed at the Firm now represents approximately 30% of our Advisory Senior Managing Director group. Overall the Firm has never been more capable.\"\nRalph Schlosstein, President and Chief Executive Officer\n\"We are excited by the opportunities ahead as we seek to serve clients in all important industry sectors, grow our capital advisory services, adapt research services to the changing market dynamics and selectively add to our wealth management capabilities,\" said Ralph Schlosstein, President and Chief Executive Officer. \"The Tax Cuts and Jobs Act delivers a significant future reduction in our tax obligations in the U.S. We plan to invest a portion of this savings in the expansion of our capabilities to serve future client needs and to use the remainder of the savings to support our strategic and financial objectives, including returning capital to our shareholders.\"\nSelected Financial Data - U.S. GAAP Results:\nThe following is a discussion of Evercore's results on a U.S. GAAP basis.\nU.S. GAAP\nThree Months Ended\nTwelve Months Ended\nDecember 31,\n2017\nDecember 31,\n2016\n%\nChange\nDecember 31,\n2017\nDecember 31,\n2016\n%\nChange\n(dollars in thousands, except per share data)\nNet Revenues\n$\n540,031\n$\n445,369\n21\n%\n$\n1,704,349\n$\n1,440,052\n18\n%\nOperating Income (1)\n$\n184,146\n$\n97,359\n89\n%\n$\n428,811\n$\n261,174\n64\n%\nNet Income (Loss) Attributable to Evercore Inc.\n$\n(19,412)\n$\n43,428\n(145%)\n$\n125,454\n$\n107,528\n17\n%\nDiluted Earnings (Loss) Per Share\n$\n(0.50)\n$\n0.98\n(151%)\n$\n2.80\n$\n2.43\n15\n%\nCompensation Ratio\n50.6\n%\n60.1\n%\n56.5\n%\n62.5\n%\nOperating Margin\n34.1\n%\n21.9\n%\n25.2\n%\n18.1\n%\nEffective Tax Rate\n100.7\n%\n40.0\n%\n59.1\n%\n44.5\n%\n(1) Operating Income for the three months ended December 31, 2017 includes Special Charges of $3.9 million recognized in the Investment Management segment. Operating Income for the twelve months ended December 31, 2017 includes Special Charges of $25.4 million recognized in the Investment Banking and Investment Management segments and for the three and twelve months ended December 31, 2016 includes Special Charges of $8.1 million recognized in the Investment Management segment.\nNet Revenues\nFor the three months ended December 31, 2017, Net Revenues of $540.0 million increased 21% versus the three months ended December 31, 2016, driven by an increase in Investment Banking revenues, primarily due to an increase in Advisory fees. For the twelve months ended December 31, 2017, Net Revenues of $1.704 billion increased 18% versus the twelve months ended December 31, 2016, driven by an increase in Investment Banking revenues, primarily due to an increase in Advisory fees. See the Business Line Reporting - Discussion of U.S. GAAP Results below for further information.\nOn December 31, 2017, the Company exchanged all of its outstanding equity interests in G5 for debentures of G5. Other Revenue, net, for the three and twelve months ended December 31, 2017 includes a loss of $16.3 million related to the release of cumulative foreign exchange losses resulting from the restructuring of our equity method investment in G5. Other Revenue, net, for the three and twelve months ended December 31, 2017 also includes a gain of $7.8 million related to the sale of the Institutional Trust and Independent Fiduciary business of ETC and an estimated gain of $77.5 million related to a reduction in the liability for amounts due pursuant to our tax receivable agreement, which was re-measured following the decrease in future income tax rates in the U.S., as discussed below in Effective Tax Rate.\nCompensation Ratio\nFor the three months ended December 31, 2017, the compensation ratio was 50.6% versus 60.1% for the three months ended December 31, 2016, driven by higher revenues in our Investment Banking business and the adjustment of amounts due pursuant to our tax receivable agreement, as well as lower costs associated with acquisition-related LP Units/Interests during 2017. For the twelve months ended December 31, 2017, the compensation ratio was 56.5% versus 62.5% for the twelve months ended December 31, 2016, driven by higher revenues in our Investment Banking business and the adjustment of amounts due pursuant to our tax receivable agreement, as well as lower costs associated with acquisition-related LP Units/Interests during 2017. See the Business Line Reporting - Discussion of U.S. GAAP Results below for further information.\nOperating Income\nFor the three months ended December 31, 2017, Operating Income of $184.1 million increased 89% versus the three months ended December 31, 2016, driven by an increase in Net Revenues, partially offset by increased compensation and non-compensation costs in the Investment Banking business. For the twelve months ended December 31, 2017, Operating Income of $428.8 million increased 64% versus the twelve months ended December 31, 2016, driven by an increase in Net Revenues, partially offset by increased compensation and non-compensation costs in the Investment Banking business. See the Business Line Reporting - Discussion of U.S. GAAP Results below for further information.\nEffective Tax Rate\nFor the three months ended December 31, 2017, the effective tax rate was 100.7% versus 40.0% for the three months ended December 31, 2016. For the twelve months ended December 31, 2017, the effective tax rate was 59.1% versus 44.5% for the twelve months ended December 31, 2016.\nIn conjunction with the enactment of the Tax Cuts and Jobs Act on December 22, 2017, which reduced income tax rates in the U.S. in future years, our tax provision for the three and twelve months ended December 31, 2017 includes a charge of $143.3 million primarily resulting from the estimated re-measurement of net deferred tax assets, which relates principally to temporary differences from the step-up in basis associated with the exchange of partnership units, deferred compensation, accumulated other comprehensive income and depreciation of fixed assets and leasehold improvements. This charge, as well as the reduction in the liability for amounts due pursuant to our tax receivable agreement described above, resulted in an increase in the effective tax rate of 59.3 and 27.1 percentage points for the three and twelve months ended December 31, 2017, respectively.\nThe provision for income taxes for 2017 also includes a benefit of $0.3 million and $24.0 million for the three and twelve months ended December 31, 2017, respectively, following the application of a new accounting standard, effective January 1, 2017, related to share-based compensation, which requires that the tax deduction associated with the appreciation in the Firm's share price upon vesting of employee share-based awards above the original grant price be reflected in income tax expense. This benefit resulted in a decrease in the effective tax rate of 0.2 and 5.5 percentage points for the three and twelve months ended December 31, 2017, respectively.\nThe effective tax rate is also impacted by the non-deductible treatment of compensation associated with Evercore LP Units/Interests.\nNet Income (Loss) and Earnings (Loss) Per Share\nFor the three months ended December 31, 2017, Net Income (Loss) Attributable to Evercore Inc. and Earnings (Loss) Per Share of ($19.4) million and ($0.50), respectively, decreased 145% and 151%, respectively, versus the three months ended December 31, 2016, principally driven by an increase in the effective tax rate.\nFor the twelve months ended December 31, 2017, Net Income Attributable to Evercore Inc. and Earnings Per Share of $125.5 million and $2.80, respectively, increased 17% and 15%, respectively, versus the twelve months ended December 31, 2016, principally driven by an increase in Net Revenues in the Investment Banking business, partially offset by an increase in the effective tax rate.\nSelected Financial Data - Adjusted Results:\nThe following is a discussion of Evercore's results on an Adjusted basis. See pages 7 to 8 and A-2 to A-14 for further information and reconciliations of these non-GAAP metrics to our U.S. GAAP results.\nAdjusted (1)\nThree Months Ended\nTwelve Months Ended\nDecember 31, 2017\nDecember 31, 2016\n%\nChange\nDecember 31, 2017\nDecember 31, 2016\n%\nChange\n(dollars in thousands, except per share data)\nNet Revenues\n$\n465,452\n$\n442,189\n5\n%\n$\n1,625,752\n$\n1,431,137\n14\n%\nOperating Income\n$\n134,192\n$\n127,010\n6\n%\n$\n426,497\n$\n378,829\n13\n%\nNet Income Attributable to Evercore Inc.\n$\n77,998\n$\n74,417\n5\n%\n$\n276,371\n$\n223,018\n24\n%\nDiluted Earnings Per Share\n$\n1.55\n$\n1.43\n8\n%\n$\n5.45\n$\n4.32\n26\n%\nCompensation Ratio\n57.3\n%\n57.2\n%\n58.5\n%\n57.3\n%\nOperating Margin\n28.8\n%\n28.7\n%\n26.2\n%\n26.5\n%\nEffective Tax Rate\n37.0\n%\n38.0\n%\n31.3\n%\n38.0\n%\n(1) Excluded from the Company's Adjusted results is the impact of the enactment of the Tax Cuts and Jobs Act that was signed into law on December 22, 2017. See pages 3, 4, 6, 7 and A-3 for further discussion.\nAdjusted Net Revenues\nFor the three months ended December 31, 2017, Adjusted Net Revenues of $465.5 million increased 5% versus the three months ended December 31, 2016, driven by an increase in Investment Banking revenues, primarily due to an increase in Advisory fees. For the twelve months ended December 31, 2017, Adjusted Net Revenues of $1.626 billion increased 14% versus the twelve months ended December 31, 2016, driven by an increase in Investment Banking Revenues, primarily due to an increase in Advisory fees. See the Business Line Reporting - Discussion of Adjusted Results below for further information.\nAdjusted Compensation Ratio\nFor the three months ended December 31, 2017, the Adjusted compensation ratio was 57.3%, versus 57.2% for the three months ended December 31, 2016, driven by increased compensation costs in the Investment Banking business, principally due to costs associated with new senior hires. For the twelve months ended December 31, 2017, the Adjusted compensation ratio was 58.5% versus 57.3% for the twelve months ended December 31, 2016, driven by increased compensation costs in the Investment Banking business, principally due to costs associated with new senior hires. The Adjusted compensation ratio reflects the cost associated with compensation awarded to employees based on their performance consistent with market rates, and the cost associated with the addition of senior professionals. These new hire costs reflect both the number and seniority of the personnel we recruit and have the potential to change the compensation ratio in any period. See the Business Line Reporting - Discussion of Adjusted Results below for further information.\nAdjusted Operating Income\nFor the three months ended December 31, 2017, Adjusted Operating Income of $134.2 million increased 6% versus the three months ended December 31, 2016, driven by an increase in Net Revenues, partially offset by increased compensation and non-compensation costs in the Investment Banking business. For the twelve months ended December 31, 2017, Adjusted Operating Income of $426.5 million increased 13% versus the twelve months ended December 31, 2016, driven by an increase in Net Revenues, partially offset by increased compensation and non-compensation costs in the Investment Banking business. See the Business Line Reporting - Discussion of Adjusted Results below for further information.\nAdjusted Effective Tax Rate\nFor the three months ended December 31, 2017, the Adjusted effective tax rate was 37.0% versus 38.0% for the three months ended December 31, 2016. For the twelve months ended December 31, 2017, the Adjusted effective tax rate was 31.3% versus 38.0% for the twelve months ended December 31, 2016. The Adjusted effective tax rate includes a benefit of $0.5 million and $26.6 million for the three and twelve months ended December 31, 2017, respectively, following the application of a new accounting standard, effective January 1, 2017, related to share-based compensation, which requires that the tax deduction associated with the appreciation in the Firm's share price upon vesting of employee share-based awards above the original grant price be reflected in income tax expense. This benefit resulted in a decrease in the adjusted effective tax rate of 0.4 and 6.4 percentage points for the three and twelve months ended December 31, 2017, respectively. Changes in the Adjusted effective tax rate are also driven by the level of earnings in businesses with minority owners.\nThe Adjusted effective tax rate excludes adjustments related to the impact of the enactment of the Tax Cuts and Jobs Act that was signed into law on December 22, 2017, as described above in Selected Financial Data - U.S. GAAP Results.\nAdjusted Net Income and Earnings Per Share\nFor the three months ended December 31, 2017, Adjusted Net Income Attributable to Evercore Inc. and Adjusted Earnings Per Share of $78.0 million and $1.55, respectively, increased 5% and 8%, respectively, versus the three months ended December 31, 2016, driven by an increase in Net Revenues in the Investment Banking business, partially offset by increased compensation and non-compensation costs.\nFor the twelve months ended December 31, 2017, Adjusted Net Income Attributable to Evercore Inc. and Adjusted Earnings Per Share of $276.4 million and $5.45, respectively, increased 24% and 26%, respectively, versus the twelve months ended December 31, 2016, principally driven by an increase in Net Revenues in the Investment Banking business and a decrease in the effective tax rate.\nAdjusted Net Income Attributable to Evercore Inc. and Adjusted Earnings Per Share for the twelve months ended December 31, 2017 was $249.8 million and $4.95, respectively, excluding the effects of the change in accounting for income taxes related to share-based payments, up 12% and 15%, respectively, versus the twelve months ended December 31, 2016.\nEvercore's quarterly results may fluctuate significantly due to the timing and amount of transaction fees earned, as well as other factors. Accordingly, financial results in any particular quarter may not be representative of future results over a longer period of time.\nNon-GAAP Measures:\nThroughout this release certain information is presented on an Adjusted basis, which is a non-GAAP measure. Adjusted results begin with information prepared in accordance with accounting principles generally accepted in the United States of America (\"U.S. GAAP\"), and then those results are adjusted to exclude certain items and reflect the conversion of vested and certain unvested Evercore LP Units and Interests into Class A shares. Evercore believes that the disclosed Adjusted measures and any adjustments thereto, when presented in conjunction with comparable U.S. GAAP measures, are useful to investors to compare Evercore's results across several periods and facilitate an understanding of Evercore's operating results. Evercore uses these measures to evaluate its operating performance, as well as the performance of individual employees. These measures should not be considered a substitute for, or superior to, measures of financial performance prepared in accordance with U.S. GAAP.\nEvercore's Adjusted Net Income Attributable to Evercore Inc. for the three and twelve months ended December 31, 2017 was higher than U.S. GAAP as a result of the exclusion of expenses associated with awards granted in conjunction with certain of the Company's acquisitions, and certain other business acquisition-related charges and Special Charges.\nAcquisition-related compensation charges for 2017 include expenses and the reversal of expenses associated with performance-based awards granted in conjunction with the Company's acquisition of ISI. The amount of expense or the reversal of expense for the Class G and H LP Interests is based on the determination if it is probable that Evercore ISI will achieve certain earnings and margin targets in future periods. Acquisition-related charges for 2017 also include professional fees incurred and amortization of intangible assets.\nSpecial Charges for 2017 relate to expenses for the impairment of goodwill in the Institutional Asset Management reporting unit and the impairment of our investment in G5 during the second quarter and the sale of the Institutional Trust and Independent Fiduciary business of Evercore Trust Company (\"ETC\") during the fourth quarter.\nGains resulting from the sale of the Institutional Trust and Independent Fiduciary business of ETC and from the reduction of amounts due pursuant to the tax receivable agreement in the fourth quarter of 2017 have also been excluded from Revenues.\nThe release of cumulative foreign exchange losses resulting from the restructuring of our equity method investment in G5 in the fourth quarter of 2017 has been excluded from Revenues.\nIn addition, for Adjusted purposes, client related expenses have been presented as a reduction from Revenues and Non-compensation costs.\nEvercore's Adjusted Provision for Income Taxes for the three and twelve months ended December 31, 2017 excludes adjustments related to the impact of the enactment of the Tax Cuts and Jobs Act that was signed into law on December 22, 2017, which resulted in a reduction in income tax rates in the U.S. in future years. Our adjusted tax provision for 2017 excludes a charge of $143.3 million primarily resulting from the estimated re-measurement of net deferred tax assets, which relates principally to temporary differences from the step-up in basis associated with the exchange of partnership units, deferred compensation, accumulated other comprehensive income and depreciation of fixed assets and leasehold improvements.\nEvercore's Adjusted Diluted Shares Outstanding for the three and twelve months ended December 31, 2017 were higher than U.S. GAAP as a result of the inclusion of Evercore LP Units, as well as the assumed vesting of certain Evercore LP Units/Interests and unvested restricted stock units granted to ISI employees.\nThis release also presents changes in Adjusted Investment Management Operating Income and Adjusted Investment Management Operating Margin from the prior-year periods assuming that the restructuring of certain Investment Management affiliates occurred on December 31, 2015. This includes the transfer of ownership of the Mexican Private Equity Business that occurred on September 30, 2016 and the sale of the Institutional Trust and Independent Fiduciary business of ETC that occurred on October 18, 2017. Evercore believes this is useful additional information for investors because it improves the comparability of period-over-period results and aligns with management's view of business performance.\nFurther details of these adjustments, as well as an explanation of similar amounts for the three and twelve months ended December 31, 2016 are included in Annex I, pages A-2 to A-14.\nBusiness Line Reporting - Discussion of U.S. GAAP Results\nThe following is a discussion of Evercore's segment results on a U.S. GAAP basis.\nInvestment Banking\nU.S. GAAP\nThree Months Ended\nTwelve Months Ended\nDecember 31, 2017\nDecember 31, 2016\n%\nChange\nDecember 31, 2017\nDecember 31, 2016\n%\nChange\n(dollars in thousands)\nNet Revenues:\nInvestment Banking Revenue\n$\n456,865\n$\n427,864\n7\n%\n$\n1,575,168\n$\n1,364,098\n15\n%\nOther Revenue, net\n61,925\n(509)\nNM\n59,100\n(239)\nNM\nNet Revenues\n518,790\n427,355\n21\n%\n1,634,268\n1,363,859\n20\n%\nExpenses:\nEmployee Compensation and Benefits\n266,261\n261,125\n2\n%\n926,494\n861,139\n8\n%\nNon-compensation Costs\n74,240\n67,674\n10\n%\n270,843\n251,360\n8\n%\nSpecial Charges\n—\n—\nNM\n14,400\n—\nNM\nTotal Expenses\n340,501\n328,799\n4\n%\n1,211,737\n1,112,499\n9\n%\nOperating Income\n$\n178,289\n$\n98,556\n81\n%\n$\n422,531\n$\n251,360\n68\n%\nCompensation Ratio\n51.3\n%\n61.1\n%\n56.7\n%\n63.1\n%\nNon-compensation Ratio\n14.3\n%\n15.8\n%\n16.6\n%\n18.4\n%\nOperating Margin\n34.4\n%\n23.1\n%\n25.9\n%\n18.4\n%\nRevenues\nU.S. GAAP\nThree Months Ended\nTwelve Months Ended\nDecember 31,\n2017\nDecember 31,\n2016\n%\nChange\nDecember 31,\n2017\nDecember 31,\n2016\n%\nChange\n(dollars in thousands)\nAdvisory Fees\n$\n384,571\n$\n352,976\n9\n%\n$\n1,324,412\n$\n1,096,829\n21\n%\nCommissions and Related Fees\n56,637\n63,097\n(10%)\n204,929\n231,005\n(11%)\nUnderwriting Fees\n15,657\n11,791\n33\n%\n45,827\n36,264\n26\n%\nInvestment Banking Revenue\n$\n456,865\n$\n427,864\n7\n%\n$\n1,575,168\n$\n1,364,098\n15\n%\nAdvisory Client Transactions\n246\n256\n(4%)\n574\n568\n1\n%\nAdvisory Fees in Excess of $1 million\n74\n82\n(10%)\n255\n246\n4\n%\nDuring the three months ended December 31, 2017, Advisory Fees increased 9% versus the three months ended December 31, 2016, driven primarily by the composition of fees in excess of $1 million, taking into account the size and type of transaction and the nature of services provided. Commissions and Related Fees for the three months ended December 31, 2017 decreased 10% from the fourth quarter of last year as institutional clients are adjusting the level and composition of trading volumes as well as payments for research services under a broad movement to passive investing strategies and lower levels of volatility. Underwriting Fees of $15.7 million for the three months ended December 31, 2017 increased 33% versus the fourth quarter of last year, as we participated in 18 underwriting transactions (vs. 14 in Q4 2016); 13 as a bookrunner (vs. 9 in Q4 2016).\nDuring the twelve months ended December 31, 2017, Advisory Fees increased 21% versus the twelve months ended December 31, 2016, driven primarily by the number and composition of fees in excess of $1 million, taking into account the size and type of transaction and the nature of services provided. Commissions and Related Fees for the twelve months ended December 31, 2017 decreased 11% from last year as institutional clients are adjusting the level and composition of trading volumes as well as payments for research services under a broad movement to passive investing strategies and lower levels of volatility. Underwriting Fees of $45.8 million for the twelve months ended December 31, 2017 increased 26% from last year, as we participated in 58 underwriting transactions (vs. 44 in 2016); 33 as a bookrunner (vs. 21 in 2016).\nOn December 31, 2017, the Company exchanged all of its outstanding equity interests in G5 for debentures of G5. Other Revenue, net, for the three and twelve months ended December 31, 2017 includes a loss of $16.3 million related to the release of cumulative foreign exchange losses resulting from the restructuring of our equity method investment in G5. Other Revenue, net, for the three and twelve months ended December 31, 2017 also includes an estimated gain of $77.5 million related to a reduction in the liability for amounts due pursuant to our tax receivable agreement, which was re-measured following the decrease in future income tax rates in the U.S. upon the enactment of the Tax Cuts and Jobs Act on December 22, 2017.\nExpenses\nCompensation costs of $266.3 million for the three months ended December 31, 2017 were up 2% compared to the fourth quarter of last year, driven by higher compensation costs as a result of increased headcount in the business, including new senior hires, as well as higher levels of revenue earned. Compensation costs of $926.5 million for the twelve months ended December 31, 2017 were up 8% compared to last year, driven by higher compensation costs as a result of increased headcount in the business, including new senior hires, as well as higher levels of revenue earned. The compensation ratio was 51.3% for the three months ended December 31, 2017, compared to 61.1% for the three months ended December 31, 2016 and 56.7% for the twelve months ended December 31, 2017, compared to 63.1% for the twelve months ended December 31, 2016. The decrease in the compensation ratio was driven by higher revenues and the adjustment of amounts due pursuant to our tax receivable agreement, as well as lower costs associated with acquisition-related LP Units/Interests during 2017. Compensation costs include $2.7 million and $18.0 million of expense for the three and twelve months ended December 31, 2017, respectively, related to the Class E LP Units and ($12.9) million of expense for the twelve months ended December 31, 2017 related to the Class G and H LP Interests issued in conjunction with the acquisition of ISI. The Company incurred an expense reversal in the first quarter of 2017 following a review of the outlook for the Evercore ISI business where the Company concluded that it would be appropriate to lower the level of earnings and margins that it considers probable of achievement for future periods. Compensation costs included $14.4 million and $80.4 million of expense for the three and twelve months ended December 31, 2016, respectively, related to the Class E, G and H LP Units/Interests issued in conjunction with the acquisition of ISI based on the probability assumptions in place at that time.\nAs discussed in \"Capital Transactions\" below, in July 2017, the Board of Directors approved the exchange of all of the outstanding Class H LP Interests into 1.9 million Class J LP Units, which will continue to vest based on the completion of service through February 15, 2020. This modification did not result in any further expense and the remaining expense as of the modification date will be recorded ratably from the date of modification to the final vesting date. Compensation costs include $3.7 million and $6.0 million of expense for the three and twelve months ended December 31, 2017, respectively, related to the Class J LP Units.\nNon-compensation costs for the three months ended December 31, 2017 were $74.2 million, up 10% compared to the fourth quarter of last year. The increase in non-compensation costs versus last year reflects the addition of personnel within most parts of the business. The ratio of non-compensation costs to net revenue for the three months ended December 31, 2017 was 14.3%, compared to 15.8% for the fourth quarter of last year. Non-compensation costs for the twelve months ended December 31, 2017 were $270.8 million, up 8% from last year. The increase in non-compensation costs versus last year reflects the addition of personnel within most parts of the business. The ratio of non-compensation costs to net revenue for the twelve months ended December 31, 2017 was 16.6%, compared to 18.4% last year, driven by increased net revenues.\nSpecial Charges for the twelve months ended December 31, 2017 reflect an impairment charge of $14.4 million incurred in the second quarter of 2017 related to the Company's equity method investment in G5, resulting from the sustained negative economic and political climate in Brazil.\nInvestment Management\nU.S. GAAP\nThree Months Ended\nTwelve Months Ended\nDecember 31,\n2017\nDecember 31,\n2016\n%\nChange\nDecember 31,\n2017\nDecember 31,\n2016\n%\nChange\n(dollars in thousands)\nNet Revenues:\nInvestment Management Revenue\n$\n13,221\n$\n17,965\n(26%)\n$\n61,685\n$\n75,807\n(19%)\nOther Revenue, net\n8,020\n49\nNM\n8,396\n386\nNM\nNet Revenues\n21,241\n18,014\n18\n%\n70,081\n76,193\n(8%)\nExpenses:\nEmployee Compensation and Benefits\n7,065\n6,506\n9\n%\n36,018\n39,451\n(9%)\nNon-compensation costs\n4,389\n4,605\n(5%)\n16,746\n18,828\n(11%)\nSpecial Charges\n3,930\n8,100\n(51%)\n11,037\n8,100\n36\n%\nTotal Expenses\n15,384\n19,211\n(20%)\n63,801\n66,379\n(4%)\nOperating Income (Loss)\n$\n5,857\n$\n(1,197)\nNM\n$\n6,280\n$\n9,814\n(36%)\nCompensation Ratio\n33.3\n%\n36.1\n%\n51.4\n%\n51.8\n%\nNon-compensation Ratio\n20.7\n%\n25.6\n%\n23.9\n%\n24.7\n%\nOperating Margin\n27.6\n%\n(6.6%)\n9.0\n%\n12.9\n%\nAssets Under Management (in millions) (1)\n$\n8,963\n$\n7,999\n12\n%\n$\n8,963\n$\n7,999\n12\n%\n(1) Assets Under Management reflect end of period amounts from our consolidated subsidiaries.\nRevenues\nU.S. GAAP\nThree Months Ended\nTwelve Months Ended\nDecember 31, 2017\nDecember 31, 2016\n%\nChange\nDecember 31, 2017\nDecember 31, 2016\n%\nChange\n(dollars in thousands)\nManagement Fees and Related Income:\nWealth Management\n$\n10,552\n$\n9,231\n14\n%\n$\n40,288\n$\n36,411\n11\n%\nInstitutional Asset Management\n1,530\n1,635\n(6%)\n6,580\n8,014\n(18%)\nTotal Management Fees and Related Income\n12,082\n10,866\n11\n%\n46,868\n44,425\n5\n%\nPrivate Equity Investments\n70\n1,531\n(95%)\n(915)\n8,582\nNM\nTotal\n12,152\n12,397\n(2%)\n45,953\n53,007\n(13%)\nDisposed Businesses (1)\n1,069\n5,568\n(81%)\n15,732\n22,800\n(31%)\nInvestment Management Revenue\n$\n13,221\n$\n17,965\n(26%)\n$\n61,685\n$\n75,807\n(19%)\n(1) Reflects the Institutional Trust and Independent Fiduciary business of ETC and Management Fees from the Glisco funds, which were previously consolidated businesses.\nOn October 18, 2017, the Company completed the sale of the Institutional Trust and Independent Fiduciary business of ETC. On December 31, 2017, the Company exchanged all of its outstanding equity interests in G5 for debentures of G5. On September 30, 2016, the Company completed the transfer of ownership and control of the Mexican Private Equity Business to a newly formed entity, Glisco Partners Inc., which is controlled by the principals of the business.\nManagement Fees and Related Income of $12.1 million for the three months ended December 31, 2017 increased 11% compared to the fourth quarter of last year, driven primarily by higher fees in Wealth Management.\nPrivate Equity Investments of $0.07 million for the three months ended December 31, 2017 decreased relative to the fourth quarter of last year, driven principally by lower realized and unrealized gains in Private Equity.\nManagement Fees and Related Income of $46.9 million for the twelve months ended December 31, 2017 increased 5% compared to last year, driven primarily by higher fees in Wealth Management in 2017.\nPrivate Equity Investments of ($0.9) million for the twelve months ended December 31, 2017 decreased relative to last year, driven by losses related to the wind-down of a Private Equity fund in Mexico in 2017 and higher performance fees in 2016.\nOther Revenue, net, for the three and twelve months ended December 31, 2017 includes $7.8 million related to a gain on the sale of the Institutional Trust and Independent Fiduciary business of ETC.\nExpenses\nInvestment Management's expenses for the three months ended December 31, 2017 were $15.4 million, a decrease of 20% compared to the fourth quarter of last year principally as a result of a reduction in Special Charges. Investment Management expenses for the twelve months ended December 31, 2017 were $63.8 million, down 4% from last year due to a reduction in compensation and non-compensation costs.\nSpecial Charges for the twelve months ended December 31, 2017 reflect an impairment charge of $7.1 million incurred in the second quarter of 2017 related to goodwill in the Company's Institutional Asset Management reporting unit where the fair value has been reduced relative to the remaining goodwill as a result of the sale of the Institutional Trust and Independent Fiduciary business of ETC. Special Charges for the three and twelve months ended December 31, 2017 also reflect charges related to the sale of the Institutional Trust and Independent Fiduciary business of ETC during the fourth quarter.\nBusiness Line Reporting - Discussion of Adjusted Results\nThe following is a discussion of Evercore's segment results on an Adjusted basis. See pages 7 to 8 and A-2 to A-14 for further information and reconciliations of these metrics to our U.S. GAAP results.\nInvestment Banking\nAdjusted\nThree Months Ended\nTwelve Months Ended\nDecember 31,\n2017\nDecember 31,\n2016\n%\nChange\nDecember 31,\n2017\nDecember 31,\n2016\n%\nChange\n(dollars in thousands)\nNet Revenues:\nInvestment Banking Revenue\n$\n445,970\n$\n421,246\n6\n%\n$\n1,547,363\n$\n1,340,976\n15\n%\nOther Revenue, net\n3,122\n2,123\n47\n%\n7,791\n9,339\n(17%)\nNet Revenues\n449,092\n423,369\n6\n%\n1,555,154\n1,350,315\n15\n%\nExpenses:\nEmployee Compensation and Benefits\n259,797\n246,635\n5\n%\n915,050\n780,293\n17\n%\nNon-compensation Costs\n60,274\n57,764\n4\n%\n232,795\n215,542\n8\n%\nTotal Expenses\n320,071\n304,399\n5\n%\n1,147,845\n995,835\n15\n%\nOperating Income\n$\n129,021\n$\n118,970\n8\n%\n$\n407,309\n$\n354,480\n15\n%\nCompensation Ratio\n57.8\n%\n58.3\n%\n58.8\n%\n57.8\n%\nNon-compensation Ratio\n13.4\n%\n13.6\n%\n15.0\n%\n16.0\n%\nOperating Margin\n28.7\n%\n28.1\n%\n26.2\n%\n26.3\n%\nAdjusted Revenues\nAdjusted\nThree Months Ended\nTwelve Months Ended\nDecember 31,\n2017\nDecember 31,\n2016\n%\nChange\nDecember 31,\n2017\nDecember 31,\n2016\n%\nChange\n(dollars in thousands)\nAdvisory Fees (1)\n$\n374,757\n$\n346,358\n8\n%\n$\n1,297,688\n$\n1,073,707\n21\n%\nCommissions and Related Fees\n56,637\n63,097\n(10%)\n204,929\n231,005\n(11%)\nUnderwriting Fees (2)\n14,576\n11,791\n24\n%\n44,746\n36,264\n23\n%\nInvestment Banking Revenue\n$\n445,970\n$\n421,246\n6\n%\n$\n1,547,363\n$\n1,340,976\n15\n%\nAdvisory Client Transactions\n246\n256\n(4%)\n574\n568\n1\n%\nAdvisory Fees in Excess of $1 million\n74\n82\n(10%)\n255\n246\n4\n%\n(1) Advisory Fees on an Adjusted basis reflect the reduction of revenues for client-related expenses and provisions for uncollected receivables of $10,202 and $8,082 for the three months ended December 31, 2017 and 2016, respectively, and $27,001 and $24,492 for the twelve months ended December 31, 2017 and 2016, respectively, as well as the reclassification of earnings (losses) related to our equity investment in G5 - Advisory of $1,464 for the three months ended December 31, 2016 and ($222) and $1,370 for the twelve months ended December 31, 2017 and 2016, respectively, and the reclassification of earnings related to our equity investment in Luminis of $388 and $499 for the three and twelve months ended December 31, 2017, respectively.\n(2) Underwriting Fees on an Adjusted basis reflect the reduction of revenues for expenses associated with revenue sharing engagements with third parties of $1,081 for the three and twelve months ended December 31, 2017.\nDuring the three months ended December 31, 2017, Advisory Fees increased 8% versus the three months ended December 31, 2016, driven primarily by the composition of fees in excess of $1 million, taking into account the size and type of transaction and the nature of services provided. Commissions and Related Fees for the three months ended December 31, 2017 decreased 10% from the fourth quarter of last year as institutional clients are adjusting the level and composition of trading volumes as well as payments for research services under a broad movement to passive investing strategies and lower levels of volatility. Underwriting Fees of $14.6 million for the three months ended December 31, 2017 increased 24% versus the fourth quarter of last year, as we participated in 18 underwriting transactions (vs. 14 in Q4 2016); 13 as a bookrunner (vs. 9 in Q4 2016).\nDuring the twelve months ended December 31, 2017, Advisory fees increased 21% versus the twelve months ended December 31, 2016, driven primarily by the number and composition of fees in excess of $1 million, taking into account the size and type of transaction and the nature of services provided. Commissions and Related Fees for the twelve months ended December 31, 2017 decreased 11% from last year as institutional clients are adjusting the level and composition of trading volumes as well as payments for research services under a broad movement to passive investing strategies and lower levels of volatility. Underwriting Fees of $44.7 million for the twelve months ended December 31, 2017 increased 23% from last year, as we participated in 58 underwriting transactions (vs. 44 in 2016); 33 as a bookrunner (vs. 21 in 2016).\nAdjusted Expenses\nAdjusted compensation costs were $259.8 million for the three months ended December 31, 2017, an increase of 5% from the fourth quarter of last year. Evercore's Investment Banking Adjusted compensation ratio was 57.8% for the three months ended December 31, 2017, down versus the Adjusted compensation ratio reported for the fourth quarter of last year of 58.3%, driven by higher revenues. Adjusted compensation costs for the twelve months ended December 31, 2017 were $915.1 million, an increase of 17% from last year, and the Adjusted compensation ratio was 58.8% for the twelve months ended December 31, 2017 compared to an Adjusted compensation ratio of 57.8% for the twelve months ended December 31, 2016, driven by higher compensation costs as a result of increased headcount in the business, including new senior hires, as well as higher levels of revenue earned.\nAdjusted non-compensation costs for the three months ended December 31, 2017 were $60.3 million, up 4% from the fourth quarter of last year. The increase in Adjusted non-compensation costs versus last year reflects the addition of personnel within most parts of the business. The ratio of Adjusted non-compensation costs to Adjusted net revenue for the three months ended December 31, 2017 was 13.4%, compared to 13.6% for the fourth quarter of last year. Adjusted non-compensation costs for the twelve months ended December 31, 2017 were $232.8 million, up 8% from last year due to the addition of personnel within most parts of the business. The ratio of Adjusted non-compensation costs to net revenue for the twelve months ended December 31, 2017 was 15.0%, compared to 16.0% last year, driven by increased net revenues.\nInvestment Management\nAdjusted\nThree Months Ended\nTwelve Months Ended\nDecember 31,\n2017\nDecember 31,\n2016\n%\nChange\nDecember 31,\n2017\nDecember 31,\n2016\n%\nChange\n(dollars in thousands)\nNet Revenues:\nInvestment Management Revenue\n$\n16,148\n$\n18,771\n(14%)\n$\n70,010\n$\n80,172\n(13%)\nOther Revenue, net\n212\n49\n333\n%\n588\n650\n(10%)\nNet Revenues\n16,360\n18,820\n(13%)\n70,598\n80,822\n(13%)\nExpenses:\nEmployee Compensation and Benefits\n7,065\n6,506\n9\n%\n36,018\n39,451\n(9%)\nNon-compensation Costs\n4,124\n4,274\n(4%)\n15,392\n17,022\n(10%)\nTotal Expenses\n11,189\n10,780\n4\n%\n51,410\n56,473\n(9%)\nOperating Income\n$\n5,171\n$\n8,040\n(36%)\n$\n19,188\n$\n24,349\n(21%)\nCompensation Ratio\n43.2\n%\n34.6\n%\n51.0\n%\n48.8\n%\nNon-compensation Ratio\n25.2\n%\n22.7\n%\n21.8\n%\n21.1\n%\nOperating Margin\n31.6\n%\n42.7\n%\n27.2\n%\n30.1\n%\nAssets Under Management (in millions) (1)\n$\n8,963\n$\n7,999\n12\n%\n$\n8,963\n$\n7,999\n12\n%\n(1) Assets Under Management reflect end of period amounts from our consolidated subsidiaries.\nAdjusted Revenues\nAdjusted\nThree Months Ended\nTwelve Months Ended\nDecember 31, 2017\nDecember 31, 2016\n%\nChange\nDecember 31, 2017\nDecember 31, 2016\n%\nChange\n(dollars in thousands)\nManagement Fees and Related Income:\nWealth Management\n$\n10,552\n$\n9,231\n14\n%\n$\n40,288\n$\n36,411\n11\n%\nInstitutional Asset Management\n1,530\n1,635\n(6%)\n6,580\n8,014\n(18%)\nTotal Management Fees and Related Income\n12,082\n10,866\n11\n%\n46,868\n44,425\n5\n%\nEquity in Earnings of Affiliates (1)\n2,943\n1,048\n181\n%\n8,561\n5,271\n62\n%\nPrivate Equity Investments (2)\n70\n1,325\n(95%)\n(915)\n8,376\nNM\nTotal\n15,095\n13,239\n14\n%\n54,514\n58,072\n(6%)\nDisposed Businesses (3)\n1,053\n5,532\n(81%)\n15,496\n22,100\n(30%)\nInvestment Management Revenue\n$\n16,148\n$\n18,771\n(14%)\n$\n70,010\n$\n80,172\n(13%)\n(1) Equity in G5 - Wealth Management, ABS and Atalanta Sosnoff on a U.S. GAAP basis are reclassified from Investment Management Revenue to Income from Equity Method Investments.\n(2) Management fees from Private Equity on an Adjusted basis reflect the reduction of revenues for provisions for uncollected receivables of $206 for the three and twelve months ended December 31, 2016.\n(3) Reflects the Institutional Trust and Independent Fiduciary business of ETC and Management Fees from the Glisco funds, which were previously consolidated businesses. Management fees from ETC on an Adjusted basis reflect the reduction of revenues for client-related expenses of $16 and $36 for the three months ended December 31, 2017 and 2016, respectively, and $236 and $700 for the twelve months ended December 31, 2017 and 2016, respectively.\nOn October 18, 2017, the Company completed the sale of the Institutional Trust and Independent Fiduciary business of ETC. On December 31, 2017, the Company exchanged all of its outstanding equity interests in G5 for debentures of G5. On September 30, 2016, the Company completed the transfer of ownership and control of the Mexican Private Equity Business to a newly formed entity, Glisco Partners Inc., which is controlled by the principals of the business.\nAdjusted Management Fees and Related Income of $12.1 million for the three months ended December 31, 2017 increased 11% compared to the fourth quarter of last year, driven primarily by higher fees in Wealth Management.\nEquity in Earnings of Affiliates of $2.9 million for the three months ended December 31, 2017 increased relative to the fourth quarter of last year, driven principally by higher income earned in the fourth quarter of 2017 by ABS, including an increase in performance fees.\nAdjusted Private Equity Investments of $0.07 million for the three months ended December 31, 2017 decreased relative to the fourth quarter of last year, driven principally by lower realized and unrealized gains in Private Equity.\nAdjusted Management Fees and Related Income of $46.9 million for the twelve months ended December 31, 2017 increased 5% compared to last year, driven primarily by higher fees in Wealth Management in 2017.\nEquity in Earnings of Affiliates of $8.6 million for the twelve months ended December 31, 2017 increased over 60% relative to last year, driven principally by higher income earned in 2017 by ABS, including an increase in performance fees.\nAdjusted Private Equity Investments of ($0.9) million for the twelve months ended December 31, 2017 decreased relative to last year, driven by losses related to the wind-down of a Private Equity fund in Mexico in 2017 and higher performance fees in 2016.\nAdjusted Expenses\nInvestment Management's Adjusted expenses for the three months ended December 31, 2017 were $11.2 million, up 4% compared to the fourth quarter of last year principally due to an increase in compensation costs. Adjusted Investment Management expenses for the twelve months ended December 31, 2017 were $51.4 million, down 9% from last year due to a decrease in compensation and non-compensation costs.\nAssuming the restructuring of our Investment Management affiliates noted above had occurred on December 31, 2015, Investment Management's Adjusted Operating Income would have decreased 5% when compared to the fourth quarter of last year and decreased 16% when compared to the twelve months ended December 31, 2016, and Investment Management's Adjusted Operating Margin would have been 35.5% for the three months ended December 31, 2017 compared to 42.8% for the fourth quarter of last year and 27.6% for the twelve months ended December 31, 2017 compared to 30.9% for the twelve months ended December 31, 2016.\nBalance Sheet\nThe Company continues to maintain a strong balance sheet, holding cash, cash equivalents, marketable securities and certificates of deposit of $738.1 million at December 31, 2017. Current assets exceed current liabilities by $536.2 million at December 31, 2017. Amounts due related to the Long-Term Notes Payable and Subordinated Borrowings were $175.1 million at December 31, 2017.\nOn October 18, 2017, the Company completed the sale of the Institutional Trust and Independent Fiduciary business of Evercore Trust Company for a purchase price of $34.8 million. This transaction resulted in a decrease in Goodwill of $28.4 million.\nCapital Transactions\nOn January 29, 2018, the Board of Directors of Evercore declared a quarterly dividend of $0.40 per share to be paid on March 9, 2018 to common stockholders of record on February 23, 2018.\nDuring the three months ended December 31, 2017, the Company repurchased approximately 27,000 shares at an average price per share of $80.16. During the twelve months ended December 31, 2017, the Company repurchased a total of 3.9 million shares/units at an average price per share/unit of $75.02.\nDuring the first quarter of 2017, after consideration of the market environment in which our equities business operates and the intermediate term cost structure of that business, we reduced the shares we expect to deliver, included in our Adjusted share base, for the 2014 acquisition of ISI from approximately 7.0 million shares to 5.4 million shares. Further, in July 2017, the Board of Directors approved the exchange of all of the outstanding Class H LP Interests into 1.9 million Class J LP Units, reducing the aggregate number of units to 5.3 million. The new units contain the same service vesting terms as the Class H LP Interests and are not entitled to distributions. The Class J LP Units do not have performance thresholds and the holders will be issued one share each of Class B common stock of Evercore Inc., which will entitle them to one vote on all matters submitted generally to holders of Class A and Class B common stock for each Class E LP Unit and Class J LP Unit held.\nThe total shares available to be granted in the future under the Amended and Restated 2016 Evercore Inc. Stock Incentive Plan was approximately 7.2 million as of December 31, 2017.\nThe Tax Cuts and Jobs Act is expected to deliver a significant reduction in our tax obligations in the U.S. in future years. We plan to invest a portion of this savings in the expansion of our capabilities to serve future client needs and to use the remainder of the savings to support our strategic and financial objectives, including returning capital to our shareholders.\nConference Call\nEvercore will host a related conference call beginning at 8:00 a.m. Eastern Time, Wednesday, January 31, 2018, accessible via telephone and the internet. Investors and analysts may participate in the live conference call by dialing (877) 359-9508 (toll-free domestic) or (224) 357-2393 (international); passcode: 9999798. Please register at least 10 minutes before the conference call begins. A replay of the call will be available for one week via telephone starting approximately one hour after the call ends. The replay can be accessed at (855) 859-2056 (toll-free domestic) or (404) 537-3406 (international); passcode: 9999798. A live audio webcast of the conference call will be available on the Investor Relations section of Evercore's website at www.evercore.com . The webcast will be archived on Evercore's website for 30 days after the call.\nAbout Evercore\nEvercore (NYSE: EVR) is a premier global independent investment banking advisory firm. We are dedicated to helping our clients achieve superior results through trusted independent and innovative advice on matters of strategic significance to boards of directors, management teams and shareholders, including mergers and acquisitions, strategic shareholder advisory, restructurings, and capital structure. Evercore also assists clients in raising public and private capital and delivers equity research and equity sales and agency trading execution, in addition to providing wealth and investment management services to high net worth and institutional investors. Founded in 1995, the Firm is headquartered in New York and maintains offices and affiliate offices in major financial centers in North America, Europe, South America and Asia. For more information, please visit www.evercore.com .\nInvestor Contact:\nJamie Easton\nHead of Investor Relations, Evercore\n212-857-3100\nMedia Contact :\nDana Gorman\nThe Abernathy MacGregor Group, for Evercore\n212-371-5999\nBasis of Alternative Financial Statement Presentation\nOur Adjusted results are a non-GAAP measure. As discussed further under \"Non-GAAP Measures\", Evercore believes that the disclosed Adjusted measures and any adjustments thereto, when presented in conjunction with comparable U.S. GAAP measures, are useful to investors to compare Evercore's results across several periods and better reflect management's view of operating results. These measures should not be considered a substitute for, or superior to, measures of financial performance prepared in accordance with U.S. GAAP. A reconciliation of our U.S. GAAP results to Adjusted results is presented in the tables included in Annex I.\nForward-Looking Statements\nThis release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, which reflect our current views with respect to, among other things, Evercore's operations and financial performance. In some cases, you can identify these forward-looking statements by the use of words such as \"outlook,\" \"backlog,\" \"believes,\" \"expects,\" \"potential,\" \"probable,\" \"continues,\" \"may,\" \"will,\" \"should,\" \"seeks,\" \"approximately,\" \"predicts,\" \"intends,\" \"plans,\" \"estimates,\" \"anticipates\" or the negative version of these words or other comparable words. All statements other than statements of historical fact included in this presentation are forward-looking statements and are based on various underlying assumptions and expectations and are subject to known and unknown risks, uncertainties and assumptions, and may include projections of our future financial performance based on our growth strategies and anticipated trends in Evercore's business. Accordingly, there are or will be important factors that could cause actual outcomes or results to differ materially from those indicated in these statements. Evercore believes these factors include, but are not limited to, those described under \"Risk Factors\" discussed in Evercore's Annual Report on Form 10-K for the year ended December 31, 2016, subsequent quarterly reports on Form 10-Q, current reports on Form 8-K and Registration Statements. These factors should not be construed as exhaustive and should be read in conjunction with the other cautionary statements that are included in this release. In addition, new risks and uncertainties emerge from time to time, and it is not possible for Evercore to predict all risks and uncertainties, nor can Evercore assess the impact of all factors on our business or the extent to which any factor, or combination of factors, may cause actual results to differ materially from those contained in any forward-looking statements. Accordingly, you should not rely upon forward-looking statements as a prediction of actual results and Evercore does not assume any responsibility for the accuracy or completeness of any of these forward-looking statements. Evercore undertakes no obligation to publicly update or review any forward-looking statement, whether as a result of new information, future developments or otherwise.\nWith respect to any securities offered by any private equity fund referenced herein, such securities have not been and will not be registered under the Securities Act of 1933, as amended, and may not be offered or sold in the United States absent registration or an applicable exemption from registration requirements.\nANNEX I\nSchedule\nPage Number\nUnaudited Condensed Consolidated Statements of Operations for the Three and Twelve Months Ended December 31, 2017 and 2016\nA-1\nAdjusted:\nAdjusted Results (Unaudited)\nA-2\nU.S. GAAP Reconciliation to Adjusted Results (Unaudited)\nA-4\nU.S. GAAP Segment Reconciliation to Adjusted Results for the Three and Twelve Months ended December 31, 2017 (Unaudited)\nA-9\nU.S. GAAP Segment Reconciliation to Adjusted Results for the Three and Twelve Months ended December 31, 2016 (Unaudited)\nA-10\nU.S. GAAP Segment Reconciliation to Consolidated Results (Unaudited)\nA-11\nNotes to Unaudited Condensed Consolidated Adjusted Financial Data\nA-12\nEVERCORE INC.\nCONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS\nTHREE AND TWELVE MONTHS ENDED DECEMBER 31, 2017 AND 2016\n(dollars in thousands, except per share data)\n(UNAUDITED)\nThree Months Ended December 31,\nTwelve Months Ended December 31,\n2017\n2016\n2017\n2016\nRevenues\nInvestment Banking Revenue\n$\n456,865\n$\n427,864\n$\n1,575,168\n$\n1,364,098\nInvestment Management Revenue\n13,221\n17,965\n61,685\n75,807\nOther Revenue\n74,950\n4,235\n87,492\n16,885\nTotal Revenues\n545,036\n450,064\n1,724,345\n1,456,790\nInterest Expense (1)\n5,005\n4,695\n19,996\n16,738\nNet Revenues\n540,031\n445,369\n1,704,349\n1,440,052\nExpenses\nEmployee Compensation and Benefits\n273,326\n267,631\n962,512\n900,590\nOccupancy and Equipment Rental\n13,257\n11,321\n53,448\n45,304\nProfessional Fees\n21,631\n17,795\n65,063\n57,667\nTravel and Related Expenses\n17,203\n15,207\n64,179\n57,465\nCommunications and Information Services\n10,528\n10,333\n41,393\n40,277\nDepreciation and Amortization\n6,552\n5,885\n24,819\n24,800\nSpecial Charges\n3,930\n8,100\n25,437\n8,100\nAcquisition and Transition Costs\n697\n89\n1,673\n99\nOther Operating Expenses\n8,761\n11,649\n37,014\n44,576\nTotal Expenses\n355,885\n348,010\n1,275,538\n1,178,878\nIncome Before Income from Equity Method Investments and Income Taxes\n184,146\n97,359\n428,811\n261,174\nIncome from Equity Method Investments\n3,331\n2,512\n8,838\n6,641\nIncome Before Income Taxes\n187,477\n99,871\n437,649\n267,815\nProvision for Income Taxes\n188,876\n39,913\n258,442\n119,303\nNet Income (Loss)\n(1,399)\n59,958\n179,207\n148,512\nNet Income Attributable to Noncontrolling Interest\n18,013\n16,530\n53,753\n40,984\nNet Income (Loss) Attributable to Evercore Inc.\n$\n(19,412)\n$\n43,428\n$\n125,454\n$\n107,528\nNet Income (Loss) Attributable to Evercore Inc. Common Shareholders\n$\n(19,412)\n$\n43,428\n$\n125,454\n$\n107,528\nWeighted Average Shares of Class A Common Stock Outstanding:\nBasic\n38,985\n39,101\n39,641\n39,220\nDiluted\n38,985\n44,524\n44,826\n44,193\nNet Income (Loss) Per Share Attributable to Evercore Inc. Common Shareholders:\nBasic\n$\n(0.50)\n$\n1.11\n$\n3.16\n$\n2.74\nDiluted\n$\n(0.50)\n$\n0.98\n$\n2.80\n$\n2.43\n(1) Includes interest expense on long-term debt and interest expense on short-term repurchase agreements.\nAdjusted Results\nThroughout the discussion of Evercore's business segments, information is presented on an Adjusted basis (formerly called \"Adjusted Pro Forma\"), which is a non-generally accepted accounting principles (\"non-GAAP\") measure. Adjusted results begin with information prepared in accordance with accounting principles generally accepted in the United States of America (\"U.S. GAAP\"), adjusted to exclude certain items and reflect the conversion of vested and certain unvested Evercore LP Units and Interests, as well as Acquisition Related Share Issuances and Unvested Restricted Stock Units granted to ISI employees, into Class A shares. Evercore believes that the disclosed Adjusted measures and any adjustments thereto, when presented in conjunction with comparable U.S. GAAP measures, are useful to investors to compare Evercore's results across several periods and facilitate an understanding of Evercore's operating results. The Company uses these measures to evaluate its operating performance, as well as the performance of individual employees. These measures should not be considered a substitute for, or superior to, measures of financial performance prepared in accordance with U.S. GAAP. These Adjusted amounts are allocated to the Company's two business segments: Investment Banking and Investment Management. The differences between the Adjusted and U.S. GAAP results are as follows:\n1. Assumed Vesting of Evercore LP Units and Exchange into Class A Shares. The Company incurred expenses, in Employee Compensation and Benefits, resulting from the vesting of Class E LP Units issued in conjunction with the acquisition of ISI, as well as Class G and H LP Interests and Class J LP Units. The amount of expense or the reversal of expense for the Class G and H LP Interests is based on the determination if it is probable that Evercore ISI will achieve certain earnings and margin targets in 2017 and in future periods. The Adjusted results assume these LP Units and certain Class G and H LP Interests have vested and have been exchanged for Class A shares. Accordingly, any expense or reversal of expense associated with these units and interests, and related awards, is excluded from the Adjusted results, and the noncontrolling interest related to these units is converted to a controlling interest. The Company's Management believes that it is useful to provide the per-share effect associated with the assumed conversion of these previously granted equity interests, and thus the Adjusted results reflect the exchange of certain vested and unvested Evercore LP partnership units and interests and IPO related restricted stock unit awards into Class A shares.\n2. Adjustments Associated with Business Combinations and Divestitures. The following charges resulting from business combinations and divestitures have been excluded from the Adjusted results because the Company's Management believes that operating performance is more comparable across periods excluding the effects of these acquisition-related charges:\na. Amortization of Intangible Assets and Other Purchase Accounting-related Amortization. Amortization of intangible assets and other purchase accounting-related amortization from the acquisitions of ISI, SFS and certain other acquisitions.\nb. Acquisition and Transition Costs. Primarily professional fees incurred, as well as the reversal of a provision for certain settlements in 2016 and costs related to transitioning acquisitions or divestitures.\nc. Fair Value of Contingent Consideration. The expense associated with changes in the fair value of contingent consideration issued to the sellers of certain of the Company's acquisitions is excluded from the Adjusted results.\nd. Gain on Transfer of Ownership of Mexican Private Equity Business. The gain resulting from the transfer of ownership of the Mexican Private Equity business in the third quarter of 2016 is excluded from the Adjusted Results.\ne. Gain on Sale of Institutional Trust and Independent Fiduciary business of ETC. The gain resulting from the sale of the Institutional Trust and Independent Fiduciary business of ETC in the fourth quarter of 2017 is excluded from the Adjusted Results.\nf. Foreign Exchange Gains / (Losses). Release of cumulative foreign exchange losses resulting from the restructuring of our equity method investment in G5 in the fourth quarter of 2017 are excluded from the Adjusted presentation.\n3. Client Related Expenses. Client related expenses, expenses associated with revenue sharing engagements with third parties and provisions for uncollected receivables have been classified as a reduction of revenue in the Adjusted presentation. The Company's Management believes that this adjustment results in more meaningful key operating ratios, such as compensation to net revenues and operating margin.\n4. Special Charges. Expenses during 2017 relate to the impairment of goodwill in the Institutional Asset Management reporting unit and the impairment of our investment in G5 in the second quarter and the sale of the Institutional Trust and Independent Fiduciary business of ETC during the fourth quarter. Expenses during 2016 related to a charge for the impairment of our investment in Atalanta Sosnoff during the fourth quarter.\n5. Income Taxes. Evercore is organized as a series of Limited Liability Companies, Partnerships, C-Corporations and a Public Corporation and therefore, not all of the Company's income is subject to corporate-level taxes. As a result, adjustments have been made to the Adjusted earnings to assume that the Company has adopted a conventional corporate tax structure and is taxed as a C-Corporation in the U.S. at the prevailing corporate rates and that all deferred tax assets relating to foreign operations are fully realizable within the structure on a consolidated basis. This assumption is consistent with the assumption that certain Evercore LP Units and Interests are vested and exchanged into Class A shares, as discussed in Item 1 above, as the assumed exchange would change the tax structure of the Company.\nExcluded from the Company's Adjusted results are adjustments related to the impact of the enactment of the Tax Cuts and Jobs Act that was signed into law on December 22, 2017, which resulted in a reduction in income tax rates in the U.S. in future years. The enactment of this tax reform resulted in a charge to the Provision for Income Taxes for the fourth quarter of 2017 of $143.3 million primarily resulting from the estimated re-measurement of net deferred tax assets, which relates principally to temporary differences from the step-up in basis associated with the exchange of partnership units, deferred compensation, accumulated other comprehensive income and depreciation of fixed assets and leasehold improvements. The tax reform also resulted in an estimated adjustment to Other Revenue of $77.5 million related to the re-measurement of amounts due pursuant to our tax receivable agreement, which was reduced due to the lower enacted income tax rates in the U.S. in future years.\n6. Presentation of Interest Expense. The Adjusted results present interest expense on short-term repurchase agreements, within the Investment Management segment, in Other Revenues, net, as the Company's Management believes it is more meaningful to present the spread on net interest resulting from the matched financial assets and liabilities. In addition, Adjusted Investment Banking and Investment Management Operating Income are presented before interest expense on debt, which is included in interest expense on a U.S. GAAP basis.\n7. Presentation of Income from Equity Method Investments. The Adjusted results present Income from Equity Method Investments within Revenue as the Company's Management believes it is a more meaningful presentation.\nThis release also presents changes in Adjusted Investment Management Operating Income and Adjusted Investment Management Operating Margin from the prior-year periods assuming that the restructuring of certain Investment Management affiliates occurred on December 31, 2015. This includes the transfer of ownership of the Mexican Private Equity Business that occurred on September 30, 2016 and the sale of the Institutional Trust and Independent Fiduciary business of ETC that occurred on October 18, 2017. Evercore believes this is useful additional information for investors because it improves the comparability of period-over-period results and aligns with management's view of business performance.\nEVERCORE INC.\nU.S. GAAP RECONCILIATION TO ADJUSTED RESULTS\n(dollars in thousands, except per share data)\n(UNAUDITED)\nThree Months Ended\nTwelve Months Ended\nDecember 31, 2017\nDecember 31, 2016\nDecember 31, 2017\nDecember 31, 2016\nNet Revenues - U.S. GAAP\n$\n540,031\n$\n445,369\n$\n1,704,349\n$\n1,440,052\nClient Related Expenses (1)\n(11,299)\n(8,324)\n(28,318)\n(25,398)\nIncome from Equity Method Investments (2)\n3,331\n2,512\n8,838\n6,641\nInterest Expense on Debt (3)\n2,466\n2,632\n9,960\n10,248\nGain on Sale of Institutional Trust and Independent Fiduciary business of ETC (4)\n(7,808)\n—\n(7,808)\n—\nForeign Exchange Losses from G5 Transaction (5)\n16,266\n—\n16,266\n—\nGain on Transfer of Ownership of Mexican Private Equity Business (6)\n—\n—\n—\n(406)\nAdjustment to Tax Receivable Agreement Liability (10)\n(77,535)\n—\n(77,535)\n—\nNet Revenues - Adjusted\n$\n465,452\n$\n442,189\n$\n1,625,752\n$\n1,431,137\nCompensation Expense - U.S. GAAP\n$\n273,326\n$\n267,631\n$\n962,512\n$\n900,590\nAmortization of LP Units / Interests and Certain Other Awards (7)\n(6,464)\n(14,490)\n(11,444)\n(80,846)\nCompensation Expense - Adjusted\n$\n266,862\n$\n253,141\n$\n951,068\n$\n819,744\nOperating Income - U.S. GAAP\n$\n184,146\n$\n97,359\n$\n428,811\n$\n261,174\nIncome from Equity Method Investments (2)\n3,331\n2,512\n8,838\n6,641\nPre-Tax Income - U.S. GAAP\n187,477\n99,871\n437,649\n267,815\nGain on Sale of Institutional Trust and Independent Fiduciary business of ETC (4)\n(7,808)\n—\n(7,808)\n—\nForeign Exchange Losses from G5 Transaction (5)\n16,266\n—\n16,266\n—\nGain on Transfer of Ownership of Mexican Private Equity Business (6)\n—\n—\n—\n(406)\nAmortization of LP Units / Interests and Certain Other Awards (7)\n6,464\n14,490\n11,444\n80,846\nSpecial Charges (8)\n3,930\n8,100\n25,437\n8,100\nIntangible Asset Amortization / Other Purchase Accounting-related Amortization (9a)\n2,235\n2,392\n9,411\n11,020\nAcquisition and Transition Costs (9b)\n697\n89\n1,673\n99\nFair Value of Contingent Consideration (9c)\n—\n(564)\n—\n1,107\nAdjustment to Tax Receivable Agreement Liability (10)\n(77,535)\n—\n(77,535)\n—\nPre-Tax Income - Adjusted\n131,726\n124,378\n416,537\n368,581\nInterest Expense on Debt (3)\n2,466\n2,632\n9,960\n10,248\nOperating Income - Adjusted\n$\n134,192\n$\n127,010\n$\n426,497\n$\n378,829\nProvision for Income Taxes - U.S. GAAP\n$\n188,876\n$\n39,913\n$\n258,442\n$\n119,303\nIncome Taxes (10)\n(140,203)\n7,301\n(128,064)\n20,837\nProvision for Income Taxes - Adjusted\n$\n48,673\n$\n47,214\n$\n130,378\n$\n140,140\nNet Income (Loss) Attributable to Evercore Inc. - U.S. GAAP\n$\n(19,412)\n$\n43,428\n$\n125,454\n$\n107,528\nGain on Sale of Institutional Trust and Independent Fiduciary business of ETC (4)\n(7,808)\n—\n(7,808)\n—\nForeign Exchange Losses from G5 Transaction (5)\n16,266\n—\n16,266\n—\nGain on Transfer of Ownership of Mexican Private Equity Business (6)\n—\n—\n—\n(406)\nAmortization of LP Units / Interests and Certain Other Awards (7)\n6,464\n14,490\n11,444\n80,846\nSpecial Charges (8)\n3,930\n8,100\n25,437\n8,100\nIntangible Asset Amortization / Other Purchase Accounting-related Amortization (9a)\n2,235\n2,392\n9,411\n11,020\nAcquisition and Transition Costs (9b)\n697\n89\n1,673\n99\nFair Value of Contingent Consideration (9c)\n—\n(564)\n—\n1,107\nAdjustment to Tax Receivable Agreement Liability and Income Taxes, Net (10)\n62,668\n(7,301)\n50,529\n(20,837)\nNoncontrolling Interest (11)\n12,958\n13,783\n43,965\n35,561\nNet Income Attributable to Evercore Inc. - Adjusted\n$\n77,998\n$\n74,417\n$\n276,371\n$\n223,018\nDiluted Shares Outstanding - U.S. GAAP\n38,985\n44,524\n44,826\n44,193\nLP Units (12)\n8,006\n7,544\n5,885\n7,479\nUnvested Restricted Stock Units - Event Based (12)\n12\n12\n12\n12\nUnvested Restricted Stock Units - Service Based (12)\n3,347\n—\n—\n—\nDiluted Shares Outstanding - Adjusted\n50,350\n52,080\n50,723\n51,684\nEVERCORE INC.\nU.S. GAAP RECONCILIATION TO ADJUSTED RESULTS (cont'd)\n(UNAUDITED)\nThree Months Ended\nTwelve Months Ended\nDecember 31, 2017\nDecember 31, 2016\nDecember 31, 2017\nDecember 31, 2016\nKey Metrics: (a)\nDiluted Earnings (Loss) Per Share - U.S. GAAP\n$\n(0.50)\n$\n0.98\n$\n2.80\n$\n2.43\nDiluted Earnings Per Share - Adjusted\n$\n1.55\n$\n1.43\n$\n5.45\n$\n4.32\nCompensation Ratio - U.S. GAAP\n50.6\n%\n60.1\n%\n56.5\n%\n62.5\n%\nCompensation Ratio - Adjusted\n57.3\n%\n57.2\n%\n58.5\n%\n57.3\n%\nOperating Margin - U.S. GAAP\n34.1\n%\n21.9\n%\n25.2\n%\n18.1\n%\nOperating Margin - Adjusted\n28.8\n%\n28.7\n%\n26.2\n%\n26.5\n%\nEffective Tax Rate - U.S. GAAP\n100.7\n%\n40.0\n%\n59.1\n%\n44.5\n%\nEffective Tax Rate - Adjusted\n37.0\n%\n38.0\n%\n31.3\n%\n38.0\n%\n(a) Reconciliations of the key metrics from U.S. GAAP to Adjusted results are a derivative of the reconciliations of their components on page A-4.\nEVERCORE INC.\nRECONCILIATION TO RESTRUCTURING OF INVESTMENT MANAGEMENT ADJUSTED RESULTS\n(dollars in thousands)\n(UNAUDITED)\nThree Months Ended\nTwelve Months Ended\nDecember 31,\n2017\nDecember 31,\n2016\n%\nChange\nDecember 31,\n2017\nDecember 31,\n2016\n%\nChange\nInvestment Management Net Revenues - U.S. GAAP\n$\n21,241\n$\n18,014\n18\n%\n$\n70,081\n$\n76,193\n(8%)\nAdjustments - U.S. GAAP to Adjusted (a)\n(4,881)\n806\nNM\n517\n4,629\n(89%)\nInvestment Management Net Revenues - Adjusted\n16,360\n18,820\n(13%)\n70,598\n80,822\n(13%)\nTransfer of Ownership of Mexican Private Equity Business (13)\n—\n—\nNM\n—\n(2,708)\nNM\nSale of Institutional Trust and Independent Fiduciary Business of Evercore Trust Company (14)\n(1,088)\n(5,554)\n80\n%\n(15,639)\n(19,497)\n20\n%\nAdjusted Investment Management Net Revenues - Including Restructuring of Investment Management Adjustments\n$\n15,272\n$\n13,266\n15\n%\n$\n54,959\n$\n58,617\n(6%)\nInvestment Management Expenses - U.S. GAAP\n$\n15,384\n$\n19,211\n(20%)\n$\n63,801\n$\n66,379\n(4%)\nAdjustments - U.S. GAAP to Adjusted (a)\n(4,195)\n(8,431)\n50\n%\n(12,391)\n(9,906)\n(25%)\nInvestment Management Expenses - Adjusted\n11,189\n10,780\n4\n%\n51,410\n56,473\n(9%)\nTransfer of Ownership of Mexican Private Equity Business (13)\n—\n—\nNM\n—\n(2,516)\nNM\nSale of Institutional Trust and Independent Fiduciary Business of Evercore Trust Company (14)\n(1,342)\n(3,198)\n58\n%\n(11,605)\n(13,474)\n14\n%\nAdjusted Investment Management Expenses - Including Restructuring of Investment Management Adjustments\n$\n9,847\n$\n7,582\n30\n%\n$\n39,805\n$\n40,483\n(2%)\nInvestment Management Operating Income (Loss) - U.S. GAAP\n$\n5,857\n$\n(1,197)\nNM\n$\n6,280\n$\n9,814\n(36%)\nAdjustments - U.S. GAAP to Adjusted (a)\n(686)\n9,237\nNM\n12,908\n14,535\n(11%)\nInvestment Management Operating Income - Adjusted\n5,171\n8,040\n(36%)\n19,188\n24,349\n(21%)\nTransfer of Ownership of Mexican Private Equity Business (13)\n—\n—\nNM\n—\n(192)\nNM\nSale of Institutional Trust and Independent Fiduciary Business of Evercore Trust Company (14)\n254\n(2,356)\nNM\n(4,034)\n(6,023)\n33\n%\nAdjusted Investment Management Operating Income - Including Restructuring of Investment Management Adjustments\n$\n5,425\n$\n5,684\n(5%)\n$\n15,154\n$\n18,134\n(16%)\nKey Metrics: (b)\nOperating Margin - U.S. GAAP\n27.6\n%\n(6.6%)\n9.0\n%\n12.9\n%\nOperating Margin - Adjusted\n31.6\n%\n42.7\n%\n27.2\n%\n30.1\n%\nAdjusted Operating Margin - Including Restructuring of Investment Management Adjustments\n35.5\n%\n42.8\n%\n27.6\n%\n30.9\n%\n(a) See pages A-9 and A-10 for details of U.S. GAAP to Adjusted adjustments.\n(b) Reconciliations of the key metrics are a derivative of the reconciliations of their components above.\nEVERCORE INC.\nRECONCILIATION TO ADJUSTED RESULTS EXCLUDING\nCHANGE IN ACCOUNTING FOR INCOME TAXES RELATED TO SHARE-BASED PAYMENTS\n(dollars in thousands)\n(UNAUDITED)\nTwelve Months Ended\nDecember 31, 2017\nDecember 31, 2016\n%\nChange\nNet Income Attributable to Evercore Inc. - U.S. GAAP\n$\n125,454\n$\n107,528\n17\n%\nAdjustments - U.S. GAAP to Adjusted (a)\n150,917\n115,490\n31\n%\nNet Income Attributable to Evercore Inc. - Adjusted\n276,371\n223,018\n24\n%\nChange in Accounting for Income Taxes Related to Share-Based Payments (15)\n(26,565)\n—\nNM\nAdjusted Net Income Attributable to Evercore Inc. - Excluding Change in Accounting for Income Taxes Related to Share-Based Payments\n$\n249,806\n$\n223,018\n12\n%\nDiluted Shares Outstanding - U.S. GAAP\n44,826\n44,193\n1\n%\nAdjustments - U.S. GAAP to Adjusted (a)\n5,897\n7,491\n(21%)\nDiluted Shares Outstanding - Adjusted\n50,723\n51,684\n(2%)\nChange in Accounting for Income Taxes Related to Share-Based Payments (15)\n(261)\n—\nNM\nAdjusted Diluted Shares Outstanding - Excluding Change in Accounting for Income Taxes Related to Share-Based Payments\n50,462\n51,684\n(2%)\nKey Metrics: (b)\nU.S. GAAP Diluted Earnings Per Share\n$\n2.80\n$\n2.43\n15\n%\nAdjusted Diluted Earnings Per Share\n$\n5.45\n$\n4.32\n26\n%\nAdjusted Diluted Earnings Per Share - Excluding Change in Accounting for Income Taxes Related to Share-Based Payments\n$\n4.95\n$\n4.32\n15\n%\n(a) See page A-4 for details of U.S. GAAP to Adjusted adjustments.\n(b) Reconciliations of the key metrics are a derivative of the reconciliations of their components above.\nEVERCORE INC.\nU.S. GAAP RECONCILIATION TO ADJUSTED RESULTS\nTRAILING TWELVE MONTHS\n(dollars in thousands)\n(UNAUDITED)\nConsolidated\nTwelve Months Ended\nDecember 31, 2017\nDecember 31, 2016\nNet Revenues - U.S. GAAP\n$\n1,704,349\n$\n1,440,052\nClient Related Expenses (1)\n(28,318)\n(25,398)\nIncome from Equity Method Investments (2)\n8,838\n6,641\nInterest Expense on Debt (3)\n9,960\n10,248\nGain on Sale of Institutional Trust and Independent Fiduciary business of ETC (4)\n(7,808)\n—\nForeign Exchange Losses from G5 Transaction (5)\n16,266\n—\nGain on Transfer of Ownership of Mexican Private Equity Business (6)\n—\n(406)\nAdjustment to Tax Receivable Agreement Liability (10)\n(77,535)\n—\nNet Revenues - Adjusted\n$\n1,625,752\n$\n1,431,137\nCompensation Expense - U.S. GAAP\n$\n962,512\n$\n900,590\nAmortization of LP Units / Interests and Certain Other Awards (7)\n(11,444)\n(80,846)\nCompensation Expense - Adjusted\n$\n951,068\n$\n819,744\nCompensation Ratio - U.S. GAAP (a)\n56.5\n%\n62.5\n%\nCompensation Ratio - Adjusted (a)\n58.5\n%\n57.3\n%\nInvestment Banking\nTwelve Months Ended\nDecember 31, 2017\nDecember 31, 2016\nNet Revenues - U.S. GAAP\n$\n1,634,268\n$\n1,363,859\nClient Related Expenses (1)\n(28,082)\n(24,492)\nIncome from Equity Method Investments (2)\n277\n1,370\nInterest Expense on Debt (3)\n9,960\n9,578\nForeign Exchange Losses from G5 Transaction (5)\n16,266\n—\nAdjustment to Tax Receivable Agreement Liability (10)\n(77,535)\n—\nNet Revenues - Adjusted\n$\n1,555,154\n$\n1,350,315\nCompensation Expense - U.S. GAAP\n$\n926,494\n$\n861,139\nAmortization of LP Units / Interests and Certain Other Awards (7)\n(11,444)\n(80,846)\nCompensation Expense - Adjusted\n$\n915,050\n$\n780,293\nCompensation Ratio - U.S. GAAP (a)\n56.7\n%\n63.1\n%\nCompensation Ratio - Adjusted (a)\n58.8\n%\n57.8\n%\n(a) Reconciliations of the key metrics from U.S. GAAP to Adjusted results are a derivative of the reconciliations of their components above.\nEVERCORE INC.\nU.S. GAAP SEGMENT RECONCILIATION TO ADJUSTED RESULTS\nFOR THE THREE AND TWELVE MONTHS ENDED DECEMBER 31, 2017\n(dollars in thousands)\n(UNAUDITED)\nInvestment Banking Segment\nThree Months Ended December 31, 2017\nTwelve Months Ended December 31, 2017\nU.S. GAAP Basis\nAdjustments\nNon-GAAP Adjusted Basis\nU.S. GAAP Basis\nAdjustments\nNon-GAAP Adjusted Basis\nNet Revenues:\nInvestment Banking Revenue\n$\n456,865\n$\n(10,895)\n(1)(2)\n$\n445,970\n$\n1,575,168\n$\n(27,805)\n(1)(2)\n$\n1,547,363\nOther Revenue, net\n61,925\n(58,803)\n(3)(5)(10)\n3,122\n59,100\n(51,309)\n(3)(5)(10)\n7,791\nNet Revenues\n518,790\n(69,698)\n449,092\n1,634,268\n(79,114)\n1,555,154\nExpenses:\nEmployee Compensation and Benefits\n266,261\n(6,464)\n(7)\n259,797\n926,494\n(11,444)\n(7)\n915,050\nNon-compensation Costs\n74,240\n(13,966)\n(9)\n60,274\n270,843\n(38,048)\n(9)\n232,795\nSpecial Charges\n—\n—\n—\n14,400\n(14,400)\n(8)\n—\nTotal Expenses\n340,501\n(20,430)\n320,071\n1,211,737\n(63,892)\n1,147,845\nOperating Income (a)\n$\n178,289\n$\n(49,268)\n$\n129,021\n$\n422,531\n$\n(15,222)\n$\n407,309\nCompensation Ratio (b)\n51.3\n%\n57.8\n%\n56.7\n%\n58.8\n%\nOperating Margin (b)\n34.4\n%\n28.7\n%\n25.9\n%\n26.2\n%\nInvestment Management Segment\nThree Months Ended December 31, 2017\nTwelve Months Ended December 31, 2017\nU.S. GAAP\nBasis\nAdjustments\nNon-GAAP Adjusted Basis\nU.S. GAAP\nBasis\nAdjustments\nNon-GAAP Adjusted Basis\nNet Revenues:\nInvestment Management Revenue\n$\n13,221\n$\n2,927\n(1)(2)\n$\n16,148\n$\n61,685\n$\n8,325\n(1)(2)\n$\n70,010\nOther Revenue, net\n8,020\n(7,808)\n(4)\n212\n8,396\n(7,808)\n(4)\n588\nNet Revenues\n21,241\n(4,881)\n16,360\n70,081\n517\n70,598\nExpenses:\nEmployee Compensation and Benefits\n7,065\n—\n7,065\n36,018\n—\n36,018\nNon-compensation Costs\n4,389\n(265)\n(9)\n4,124\n16,746\n(1,354)\n(9)\n15,392\nSpecial Charges\n3,930\n(3,930)\n(8)\n—\n11,037\n(11,037)\n(8)\n—\nTotal Expenses\n15,384\n(4,195)\n11,189\n63,801\n(12,391)\n51,410\nOperating Income (a)\n$\n5,857\n$\n(686)\n$\n5,171\n$\n6,280\n$\n12,908\n$\n19,188\nCompensation Ratio (b)\n33.3\n%\n43.2\n%\n51.4\n%\n51.0\n%\nOperating Margin (b)\n27.6\n%\n31.6\n%\n9.0\n%\n27.2\n%\n(a) Operating Income for U.S. GAAP excludes Income (Loss) from Equity Method Investments.\n(b) Reconciliations of the key metrics from U.S. GAAP to Adjusted results are a derivative of the reconciliations of their components above.\nEVERCORE INC.\nU.S. GAAP SEGMENT RECONCILIATION TO ADJUSTED RESULTS\nFOR THE THREE AND TWELVE MONTHS ENDED DECEMBER 31, 2016\n(dollars in thousands)\n(UNAUDITED)\nInvestment Banking Segment\nThree Months Ended December 31, 2016\nTwelve Months Ended December 31, 2016\nU.S. GAAP\nBasis\nAdjustments\nNon-GAAP Adjusted Basis\nU.S. GAAP\nBasis\nAdjustments\nNon-GAAP Adjusted Basis\nNet Revenues:\nInvestment Banking Revenue\n$\n427,864\n$\n(6,618)\n(1)(2)\n$\n421,246\n$\n1,364,098\n$\n(23,122)\n(1)(2)\n$\n1,340,976\nOther Revenue, net\n(509)\n2,632\n(3)\n2,123\n(239)\n9,578\n(3)\n9,339\nNet Revenues\n427,355\n(3,986)\n423,369\n1,363,859\n(13,544)\n1,350,315\nExpenses:\nEmployee Compensation and Benefits\n261,125\n(14,490)\n(7)\n246,635\n861,139\n(80,846)\n(7)\n780,293\nNon-compensation Costs\n67,674\n(9,910)\n(9)\n57,764\n251,360\n(35,818)\n(9)\n215,542\nTotal Expenses\n328,799\n(24,400)\n304,399\n1,112,499\n(116,664)\n995,835\nOperating Income (a)\n$\n98,556\n$\n20,414\n$\n118,970\n$\n251,360\n$\n103,120\n$\n354,480\nCompensation Ratio (b)\n61.1\n%\n58.3\n%\n63.1\n%\n57.8\n%\nOperating Margin (b)\n23.1\n%\n28.1\n%\n18.4\n%\n26.3\n%\nInvestment Management Segment\nThree Months Ended December 31, 2016\nTwelve Months Ended December 31, 2016\nU.S. GAAP\nBasis\nAdjustments\nNon-GAAP Adjusted Basis\nU.S. GAAP\nBasis\nAdjustments\nNon-GAAP Adjusted Basis\nNet Revenues:\nInvestment Management Revenue\n$\n17,965\n$\n806\n(1)(2)\n$\n18,771\n$\n75,807\n$\n4,365\n(1)(2)\n$\n80,172\nOther Revenue, net\n49\n—\n49\n386\n264\n(3)(6)\n650\nNet Revenues\n18,014\n806\n18,820\n76,193\n4,629\n80,822\nExpenses:\nEmployee Compensation and Benefits\n6,506\n—\n6,506\n39,451\n—\n39,451\nNon-compensation Costs\n4,605\n(331)\n(9)\n4,274\n18,828\n(1,806)\n(9)\n17,022\nSpecial Charges\n8,100\n(8,100)\n(8)\n—\n8,100\n(8,100)\n(8)\n—\nTotal Expenses\n19,211\n(8,431)\n10,780\n66,379\n(9,906)\n56,473\nOperating Income (Loss) (a)\n$\n(1,197)\n$\n9,237\n$\n8,040\n$\n9,814\n$\n14,535\n$\n24,349\nCompensation Ratio (b)\n36.1\n%\n34.6\n%\n51.8\n%\n48.8\n%\nOperating Margin (b)\n(6.6%)\n42.7\n%\n12.9\n%\n30.1\n%\n(a) Operating Income (Loss) for U.S. GAAP excludes Income (Loss) from Equity Method Investments.\n(b) Reconciliations of the key metrics from U.S. GAAP to Adjusted results are a derivative of the reconciliations of their components above.\nEVERCORE INC.\nU.S. GAAP SEGMENT RECONCILIATION TO CONSOLIDATED RESULTS\n(dollars in thousands)\n(UNAUDITED)\nU.S. GAAP\nThree Months Ended\nTwelve Months Ended\nDecember 31, 2017\nDecember 31, 2016\nDecember 31, 2017\nDecember 31, 2016\nInvestment Banking\nNet Revenues:\nInvestment Banking Revenue\n$\n456,865\n$\n427,864\n$\n1,575,168\n$\n1,364,098\nOther Revenue, net\n61,925\n(509)\n59,100\n(239)\nNet Revenues\n518,790\n427,355\n1,634,268\n1,363,859\nExpenses:\nEmployee Compensation and Benefits\n266,261\n261,125\n926,494\n861,139\nNon-compensation Costs\n74,240\n67,674\n270,843\n251,360\nSpecial Charges\n—\n—\n14,400\n—\nTotal Expenses\n340,501\n328,799\n1,211,737\n1,112,499\nOperating Income (a)\n$\n178,289\n$\n98,556\n$\n422,531\n$\n251,360\nInvestment Management\nNet Revenues:\nInvestment Management Revenue\n$\n13,221\n$\n17,965\n$\n61,685\n$\n75,807\nOther Revenue, net\n8,020\n49\n8,396\n386\nNet Revenues\n21,241\n18,014\n70,081\n76,193\nExpenses:\nEmployee Compensation and Benefits\n7,065\n6,506\n36,018\n39,451\nNon-compensation Costs\n4,389\n4,605\n16,746\n18,828\nSpecial Charges\n3,930\n8,100\n11,037\n8,100\nTotal Expenses\n15,384\n19,211\n63,801\n66,379\nOperating Income (Loss) (a)\n$\n5,857\n$\n(1,197)\n$\n6,280\n$\n9,814\nTotal\nNet Revenues:\nInvestment Banking Revenue\n$\n456,865\n$\n427,864\n$\n1,575,168\n$\n1,364,098\nInvestment Management Revenue\n13,221\n17,965\n61,685\n75,807\nOther Revenue, net\n69,945\n(460)\n67,496\n147\nNet Revenues\n540,031\n445,369\n1,704,349\n1,440,052\nExpenses:\nEmployee Compensation and Benefits\n273,326\n267,631\n962,512\n900,590\nNon-compensation Costs\n78,629\n72,279\n287,589\n270,188\nSpecial Charges\n3,930\n8,100\n25,437\n8,100\nTotal Expenses\n355,885\n348,010\n1,275,538\n1,178,878\nOperating Income (a)\n$\n184,146\n$\n97,359\n$\n428,811\n$\n261,174\n(a) Operating Income (Loss) excludes Income (Loss) from Equity Method Investments.\nNotes to Unaudited Condensed Consolidated Adjusted Financial Data\nFor further information on these adjustments, see page A-2.\n(1) Client related expenses, expenses associated with revenue sharing engagements with third parties and provisions for uncollected receivables have been reclassified as a reduction of Revenue in the Adjusted presentation.\n(2) Income (Loss) from Equity Method Investments has been reclassified to Revenue in the Adjusted presentation.\n(3) Interest Expense on Debt is excluded from the Adjusted Investment Banking and Investment Management segment results and is included in Interest Expense in the segment results on a U.S. GAAP basis.\n(4) The gain resulting from the sale of the Institutional Trust and Independent Fiduciary business of ETC in the fourth quarter of 2017 is excluded from the Adjusted presentation.\n(5) Release of cumulative foreign exchange losses resulting from the restructuring of our equity method investment in G5 in the fourth quarter of 2017 are excluded from the Adjusted presentation.\n(6) The gain resulting from the transfer of ownership of the Mexican Private Equity business in the third quarter of 2016 is excluded from the Adjusted presentation.\n(7) Expenses or reversal of expenses incurred from the assumed vesting of Class E LP Units, Class G and H LP Interests and Class J LP Units issued in conjunction with the acquisition of ISI are excluded from the Adjusted presentation.\n(8) Expenses during 2017 relate to the impairment of goodwill in the Institutional Asset Management reporting unit and the impairment of our investment in G5 in the second quarter and the sale of the Institutional Trust and Independent Fiduciary business of ETC during the fourth quarter. Expenses during 2016 related to a charge for the impairment of our investment in Atalanta Sosnoff during the fourth quarter.\n(9) Non-compensation Costs on an Adjusted basis reflect the following adjustments:\nThree Months Ended December 31, 2017\nU.S. GAAP\nAdjustments\nAdjusted\n(dollars in thousands)\nOccupancy and Equipment Rental\n$\n13,257\n$\n—\n$\n13,257\nProfessional Fees\n21,631\n(6,933)\n(1)\n14,698\nTravel and Related Expenses\n17,203\n(4,028)\n(1)\n13,175\nCommunications and Information Services\n10,528\n(22)\n(1)\n10,506\nDepreciation and Amortization\n6,552\n(2,235)\n(9a)\n4,317\nAcquisition and Transition Costs\n697\n(697)\n(9b)\n—\nOther Operating Expenses\n8,761\n(316)\n(1)\n8,445\nTotal Non-compensation Costs\n$\n78,629\n$\n(14,231)\n$\n64,398\nThree Months Ended December 31, 2016\nU.S. GAAP\nAdjustments\nAdjusted\n(dollars in thousands)\nOccupancy and Equipment Rental\n$\n11,321\n$\n—\n$\n11,321\nProfessional Fees\n17,795\n(4,813)\n(1)\n12,982\nTravel and Related Expenses\n15,207\n(2,999)\n(1)\n12,208\nCommunications and Information Services\n10,333\n(28)\n(1)\n10,305\nDepreciation and Amortization\n5,885\n(2,392)\n(9a)\n3,493\nAcquisition and Transition Costs\n89\n(89)\n(9b)\n—\nOther Operating Expenses\n11,649\n80\n(1)(9c)\n11,729\nTotal Non-compensation Costs\n$\n72,279\n$\n(10,241)\n$\n62,038\nTwelve Months Ended December 31, 2017\nU.S. GAAP\nAdjustments\nAdjusted\n(dollars in thousands)\nOccupancy and Equipment Rental\n$\n53,448\n$\n—\n$\n53,448\nProfessional Fees\n65,063\n(11,395)\n(1)\n53,668\nTravel and Related Expenses\n64,179\n(13,975)\n(1)\n50,204\nCommunications and Information Services\n41,393\n(107)\n(1)\n41,286\nDepreciation and Amortization\n24,819\n(9,411)\n(9a)\n15,408\nAcquisition and Transition Costs\n1,673\n(1,673)\n(9b)\n—\nOther Operating Expenses\n37,014\n(2,841)\n(1)\n34,173\nTotal Non-compensation Costs\n$\n287,589\n$\n(39,402)\n$\n248,187\nTwelve Months Ended December 31, 2016\nU.S. GAAP\nAdjustments\nAdjusted\n(dollars in thousands)\nOccupancy and Equipment Rental\n$\n45,304\n$\n—\n$\n45,304\nProfessional Fees\n57,667\n(12,105)\n(1)\n45,562\nTravel and Related Expenses\n57,465\n(10,606)\n(1)\n46,859\nCommunications and Information Services\n40,277\n(87)\n(1)\n40,190\nDepreciation and Amortization\n24,800\n(11,020)\n(9a)\n13,780\nAcquisition and Transition Costs\n99\n(99)\n(9b)\n—\nOther Operating Expenses\n44,576\n(3,707)\n(1)(9c)\n40,869\nTotal Non-compensation Costs\n$\n270,188\n$\n(37,624)\n$\n232,564\n(9a) The exclusion from the Adjusted presentation of expenses associated with amortization of intangible assets and other purchase accounting-related amortization from the acquisitions of ISI, SFS and certain other acquisitions.\n(9b) Primarily professional fees incurred, as well as the reversal of a provision for certain settlements in 2016 and costs related to transitioning acquisitions or divestitures.\n(9c) The expense associated with changes in the fair value of contingent consideration issued to the sellers of certain of the Company's acquisitions is excluded from the Adjusted results.\n(10) Evercore is organized as a series of Limited Liability Companies, Partnerships, C-Corporations and a Public Corporation and therefore, not all of the Company's income is subject to corporate-level taxes. As a result, adjustments have been made to the Adjusted earnings to assume that the Company has adopted a conventional corporate tax structure and is taxed as a C-Corporation in the U.S. at the prevailing corporate rates and that all deferred tax assets relating to foreign operations are fully realizable within the structure on a consolidated basis. This assumption is consistent with the assumption that certain Evercore LP Units and Interests are vested and exchanged into Class A shares, as the assumed exchange would change the tax structure of the Company.\nExcluded from the Company's Adjusted results are adjustments related to the impact of the enactment of the Tax Cuts and Jobs Act that was signed into law on December 22, 2017, which resulted in a reduction in income tax rates in the U.S. in future years. The enactment of this tax reform resulted in a charge to the Provision for Income Taxes for the fourth quarter of 2017 of $143.3 million primarily resulting from the estimated re-measurement of net deferred tax assets, which relates principally to temporary differences from the step-up in basis associated with the exchange of partnership units, deferred compensation, accumulated other comprehensive income and depreciation of fixed assets and leasehold improvements. The tax reform also resulted in an estimated adjustment to Other Revenue of $77.5 million related to the re-measurement of amounts due pursuant to our tax receivable agreement, which was reduced due to the lower enacted income tax rates in the U.S. in future years.\n(11) Reflects an adjustment to eliminate noncontrolling interest related to all Evercore LP partnership units which are assumed to be converted to Class A common stock in the Adjusted presentation.\n(12) Assumes the vesting, and exchange into Class A shares, of certain Evercore LP partnership units and interests and IPO related restricted stock unit awards in the Adjusted presentation. In the computation of outstanding common stock equivalents for U.S. GAAP net income per share, the Evercore LP partnership units are anti-dilutive. Further, as a result of the Company incurring a loss on a U.S. GAAP basis for the three months ended December 31, 2017, the additional shares of the Company's common stock assumed to be issued per the computation of diluted shares outstanding were antidilutive and consequently the additional shares have been excluded from the calculation of Diluted Shares Outstanding - U.S. GAAP. These shares have been included in the reconciliation to Diluted Shares Outstanding - Adjusted.\n(13) Assumes the transfer of ownership of the Mexican Private Equity business had occurred as of the beginning of the prior period presented and reflects adjustments to eliminate the management fees and expenses that were previously recorded from the Mexican Private Equity business and the addition of income from the Mexican Private Equity business if its results were based on the percentage of the management fees that the Company is currently entitled to. Management believes this adjustment is useful to investors to compare Evercore's results across periods.\n(14) Assumes the sale of the Institutional Trust and Independent Fiduciary business of ETC had occurred as of the beginning of the prior period presented and reflects adjustments to eliminate revenue and expenses that were previously consolidated from the Institutional Trust and Independent Fiduciary business of ETC. Management believes this adjustment is useful to investors to compare Evercore's results across periods.\n(15) Reflects the impact of the application of ASU 2016-09, \"Improvements to Employee Share-Based Payment Accounting\" which requires that excess tax benefits and deficiencies from the delivery of Class A common stock under share-based payment arrangements be recognized in the Company's Provision for Income Taxes rather than in Additional Paid-In-Capital under prior U.S. GAAP.\nView original content with multimedia: http://www.prnewswire.com/news-releases/evercore-reports-record-full-year-2017-results-quarterly-dividend-of-040-per-share-300590787.html\nSOURCE Evercore", "external_links": ["http://www.prnewswire.com/news-releases/evercore-reports-record-full-year-2017-results-quarterly-dividend-of-040-per-share-300590787.html", "http://www.evercore.com/"], "published": "2018-01-31T14:00:00.000+02:00", "crawled": "2018-01-31T19:00:05.021+02:00", "highlightTitle": ""}