{"organizations": [], "uuid": "60de48de5554cd289ee5b17db5bfd48c7f6b7cab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219581346&w=1200&r=LYNXMPEE040MM", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-cyber-microchips/apple-researchers-eye-patches-to-solve-intel-chip-flaws-idUSKBN1EU12H", "country": "US", "domain_rank": 408, "title": "WRAPUP-Apple, researchers eye patches to solve Intel chip flaws", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T13:37:00.000+02:00", "replies_count": 0, "uuid": "60de48de5554cd289ee5b17db5bfd48c7f6b7cab"}, "author": "", "url": "https://www.reuters.com/article/us-cyber-microchips/apple-researchers-eye-patches-to-solve-intel-chip-flaws-idUSKBN1EU12H", "ord_in_thread": 0, "title": "WRAPUP-Apple, researchers eye patches to solve Intel chip flaws", "locations": [], "entities": {"persons": [{"name": "kanishka singh", "sentiment": "none"}, {"name": "douglas busvine", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "intel", "sentiment": "negative"}, {"name": "apple inc", "sentiment": "none"}, {"name": "intel corp", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "amazon.com inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Intel Corp ( INTC.O ) downplayed concerns that software updates to address security vulnerabilities in its computer chips will degrade performance of computers as businesses and consumers scrambled to figure out whether installing the patches would slow their machines.\nThese flaws are security holes in nearly every computing device that make their data vulnerable to hacking.\nThe problem surfaced early this week when news broke that researchers were planning to release technical reports on the threats, sending businesses, governments and consumers scrambling to understand the extent of the threat and the cost of fixes. No clear consensus has emerged.\n“Intel continues to believe that the performance impact of these updates is highly workload-dependent and, for the average computer user, should not be significant and will be mitigated over time,” the world’s No. 1 chipmaker said in a release.\nThe release cited comments from Amazon.com Inc ( AMZN.O ), Apple Inc ( AAPL.O ), Alphabet Inc’s ( GOOGL.O ) and Microsoft Corp ( MSFT.O ), which said that they had seen no significant impact to performance after installing the patches.\nThey were among a group of firms that quickly patched their technology to mitigate against the threat from one of those vulnerabilities, dubbed Meltdown, which only affects machines running Intel chips.\nSlideshow (2 Images) Major software makers have not issued patches to protect against the second vulnerability, dubbed Spectre, which affects nearly all computer chips made in the last decade. However, Google, Firefox and Microsoft have implemented measures in most web browsers to stop hackers from launching remote attacks using Spectre.\nGovernments and security experts say they have observed no cyber attacks seeking to exploit either vulnerability, though they expect hackers to attempt to do so as they digest technical data about the security flaws.\nOne key risk is that hackers will develop code that can infect the personal computers of people visiting malicious websites, said Chris Wysopal, chief technology officer of cyber security firm Veracode.\nHe advised PC owners to install the security patches to protect against such potential attacks. There is less risk to computer servers at large enterprises, he said, because those systems are not used to surf the web and can only be infected in a Meltdown attack if a hacker has already breached that network.\nMicrosoft has issued a patch for its Windows operating system, and Apple desktop users with the most recent operating system are protected. Google has said most of its Chromebook laptops are already protected and the rest will be soon.\nApple said it plans to release a patch to its Safari web browser within coming days to protect Mac and iOS users from Spectre.\nWhile third-party browsers from Google and others can protect Mac users from Spectre, all major web browsers for Apple’s iOS devices depend on receiving a patch from Apple. That means hundreds of millions of iPhone and iPad users will be exposed to potential Spectre attacks while browsing the Web until Apple issues its patch.\nWriting by Jim Finkle in Toronto; Reporting by Kanishka Singh in Bengaluru and Douglas Busvine in Frankfurt; Editing by Nick Zieminski\n ", "external_links": [], "published": "2018-01-05T13:37:00.000+02:00", "crawled": "2018-01-05T13:51:43.011+02:00", "highlightTitle": ""}