{"organizations": [], "uuid": "acc67673314af85d0d99e1b6fb26be0fe8302858", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226532394&w=1200&r=LYNXMPEE0T0EG", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-afghanistan-blast-trump/afghanistan-says-taliban-will-have-to-be-defeated-after-trump-rejects-talks-idUKKBN1FJ0X1", "country": "US", "domain_rank": 408, "title": "Afghanistan says Taliban will have to be defeated, after Trump rejects talks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T10:12:00.000+02:00", "replies_count": 0, "uuid": "acc67673314af85d0d99e1b6fb26be0fe8302858"}, "author": "", "url": "https://uk.reuters.com/article/uk-afghanistan-blast-trump/afghanistan-says-taliban-will-have-to-be-defeated-after-trump-rejects-talks-idUKKBN1FJ0X1", "ord_in_thread": 0, "title": "Afghanistan says Taliban will have to be defeated, after Trump rejects talks", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "mirwais harooni", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "ashraf ghani", "sentiment": "none"}, {"name": "jibran ahmad", "sentiment": "none"}], "locations": [{"name": "afghanistan", "sentiment": "none"}, {"name": "pakistan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "kabul", "sentiment": "none"}], "organizations": [{"name": "taliban", "sentiment": "negative"}, {"name": "min read  kabul/peshawar", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 8:12 AM / Updated 2 hours ago Afghanistan says Taliban will have to be defeated, after Trump rejects talks Mirwais Harooni , Jibran Ahmad 4 Min Read \nKABUL/PESHAWAR, Pakistan (Reuters) - Afghanistan said on Tuesday the Taliban would have to be defeated on the battlefield after U.S. President Donald Trump rejected the idea of talks with the militants following a series of deadly attacks. \nThe Taliban reacted to Trump’s announcement by saying they never wanted to talk to the United States anyway, but one senior member of the group said he suspected efforts would still be made to get negotiations going. \nTalking to reporters at the White House on Monday, Trump condemned the militant group for recent carnage in Kabul and said the United States was not prepared to talk now. He pledged to “finish what we have to finish”. \nHis comments suggested he sees a military victory over the Taliban, an outcome that U.S. military and diplomatic officials say cannot be achieved with the resources and manpower he has authorized. \nA spokesman for Afghan President Ashraf Ghani said while the government had encouraged the Taliban to talk, the attacks in Kabul, including a suicide bomb attack on Saturday that killed more than 100 people, was a “red line”. \n“The Taliban have crossed a red line and lost the chance for peace,” said the spokesman, Shah Hussain Murtazawi. \n“We have to look for peace on the battlefield. They have to be marginalized.” \nHe declined to comment directly on Trump’s announcement. \nA spokesman for the Taliban, who are fighting to oust foreign forces, defeat the U.S.-backed government and impose their version of Islamic rule, said they never wanted to hold peace talks with the United States anyway. \n“Their main strategy is to continue war and occupation,” the spokesman, Zabihullah Mujahid, said in a statement. \nHe said Taliban fighters would respond in kind if the Americans wanted to focus on war: “If you emphasise war then our mujahideen will not welcome you with flowers.” \n‘PUBLIC CONSUMPTION’ \nTrump last year ordered an increase in U.S. troops, air strikes and other assistance to Afghan forces. \nThe U.S. ambassador to the United Nations, Nikki Haley, said this month the strategy was working and pushing the insurgents closer to talks. \nThat was before a suicide bomber penetrated the highly guarded centre of Kabul on Saturday and detonated an ambulance laden with explosives, killing more than 100 people and wounding at least 235. \nThat attack followed a brazen Taliban assault on the city’s Intercontinental Hotel on Jan. 20, in which more than 20 people, including four Americans, were killed. \nThe Taliban said the attacks were a message to Trump that his policy of aggression would not work. \nAnother Taliban member said the United States had been approaching states that have relations with the Taliban to try to get them to push the insurgents to the negotiating table. \n”President Trump is saying this for public consumption,“ the ‎Taliban member, who declined to be identified, said of Trump’s rejection of talks. ”He and his team are making every effort to bring us to the negotiating table. \n“Actually, the latest attack in Kabul awakened President Trump and his puppets in Afghanistan about the capability of the Taliban and their ability to mount big attacks anywhere.” \nThe Taliban refer to the Afghan government as U.S. “puppets”. \nThe United States believes the Haqqani network, a faction within the Taliban, was behind Saturday’s bomb blast in Kabul. \nIt and Afghanistan have long accused Pakistan of supporting the Taliban, and the Haqqani network in particular, as assets to be used in its bid to limit the influence of old rival India in Afghanistan. \nThis month, Trump ordered big cuts in security aid to Pakistan over its failure to crack down on militants. \nPakistan denies accusations it fosters the Afghan war, and condemned the recent attacks in Afghanistan. \nPakistani officials were not immediately available for comment on Trump’s rejection of talks with the Taliban. Writing by Robert Birsel; Editing by Clarence Fernandez", "external_links": [], "published": "2018-01-30T10:12:00.000+02:00", "crawled": "2018-01-30T10:28:06.022+02:00", "highlightTitle": ""}