{"organizations": [], "uuid": "2d283b1bc1d91a0d1486ef10b2522d4565a7c985", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/legal", "section_title": "Legal News | Reuters", "url": "https://www.reuters.com/article/legal-us-otc-funding/judges-keep-shielding-litigation-funding-agreements-despite-demands-for-transparency-idUSKBN1FC2WB", "country": "US", "domain_rank": 408, "title": "Judges keep shielding litigation funding agreements, despite demands for transparency", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T04:33:00.000+02:00", "replies_count": 0, "uuid": "2d283b1bc1d91a0d1486ef10b2522d4565a7c985"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/legal-us-otc-funding/judges-keep-shielding-litigation-funding-agreements-despite-demands-for-transparency-idUSKBN1FC2WB", "ord_in_thread": 0, "title": "Judges keep shielding litigation funding agreements, despite demands for transparency", "locations": [], "entities": {"persons": [{"name": "susan illston", "sentiment": "none"}, {"name": "bob goodlatte", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "house judiciary committee", "sentiment": "none"}, {"name": "rules committee", "sentiment": "none"}, {"name": "u.s. chamber of commerce", "sentiment": "none"}, {"name": "chevron", "sentiment": "none"}, {"name": "u.s. courts’ committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - For just about as long as the litigation funding industry has existed in a meaningful way in the U.S. – about a decade, give or take – defendants have been pushing to require plaintiffs to disclose details of their arrangements with outside financiers. They’ve tried in Congress, most recently in House Judiciary Committee Chairman Bob Goodlatte’s Fairness in Class Action Litigation Act , which has stalled in the Senate. They’ve also tried before the U.S. Courts’ Committee on Rules of Practice and Procedure. Last June, the U.S. Chamber of Commerce petitioned the Rules Committee to amend the Federal Rules of Civil Procedure to mandate disclosure of outside funding agreements. The committee entertained a presentation from the Chamber – and from opponents of mandatory disclosure – in November.\nIn a much less sweeping way, defendants have pressed for disclosure of funding arrangements in particular cases. Once in a while, they hit pay dirt. In 2016, U.S. District Judge Susan Illston of San Francisco granted Chevron’s motion to compel disclosure of a litigation funding contract in a class action by Nigerian fishermen claiming damages from an oil rig explosion off the coast of Nigeria. Judge Illston’s decision dovetailed with the Northern District of California’s consideration of a rule change to require plaintiffs to disclose outside funding. In January 2017, the district changed its courtwide standing order to mandate disclosure only in class actions.\nThe Chevron class action, however, is an outlier. Far more often, as Georgetown law professor Maria Glover detailed in \" Alternative Litigation Finance and the Limits of the Work-Product Doctrine ,\" a 2016 paper for the NYU Journal of Law and Business, judges have sided with plaintiffs arguing that their arrangements with litigation funders are protected work product. (Notably, the lead plaintiff in the Chevron case in which Judge Illston ordered disclosure did not claim work-product privilege.)\nIn the most recent example, last week U.S. District Judge Cathy Bissoon of Pittsburgh issued the redacted version of her decision denying a motion to compel by Seagate and Western Digital Corporation, which wanted to find out the details of how Lambeth Magnetic Structures is financing its patent infringement case against them.\nIn separate motions, Seagate and Western Digital – represented, respectively, by Faegre Baker Daniels and Latham & Watkins – argued that Dr. David Lambeth, LMS’s principal, must reveal his pre-suit discussions with litigation funders, as well as turning over an unredacted version of his final funding agreement, because the documents are commercial, not litigation work product. During part of the time LMS was talking to funders, it didn’t even own the IP at issue in the case, the motions said.\nLMS’s lawyers from Radulescu countered that all of Lambeth’s discussions were conducted in anticipation of litigation so they’re protected by the work-product privilege. Judge Bissoon agreed, holding simply that “these communications were primarily, perhaps exclusively, for the purpose of preparing for litigation (and) fall within work product immunity.”\nJudge Bissoon did not provide citations for her ruling, but the most thorough examination of work-product privilege and litigation funding is probably a 2014 opinion by U.S. Magistrate Jeffrey Cole of Chicago in Miller U.K. v. Caterpillar , which concluded that most (but not all) of the documents the plaintiff shared with litigation funders were protected by the work-product privilege because they anticipated litigation.\nProfessor Glover said the trend line is quite distinct: “Thus far, courts have generally held that materials containing communications between attorneys and third-party funders are protected by the work-product privilege, as they have been prepared ‘because of’ the prospect of litigation, even though they are also prepared for a business purpose,” she wrote in her 2016 NYU paper. “Even courts that characterize the funding arrangements as constituting a business transaction have held that they are still covered by the work-product privilege because they would not be prepared but for an impending litigation.”\nSince that paper’s publication, Glover said, she has not seen any published decisions holding that communications with litigation funders fall outside of the work-product privilege. My Westlaw check found two reported opinions from 2017 concluding the privilege does apply to litigation funding materials – ViaMedia v. Comcast from U.S. District Judge Amy St. Eve of Chicago and In re International Oil Trading Company from U.S. Bankruptcy Judge Erik Kimball of West Palm Beach – and no decisions reaching the contrary determination that the work-product privilege does not shield discussions and contracts with litigation funders.\n“The ‘in anticipation of litigation’ protection fits squarely on top of litigation funding,” Glover said.\nShe told me (and wrote in her 2016 paper) that she sees in the “categorical protection” judges have granted to plaintiffs seeking to ward off disclosure of their funding agreements an implicit rejection of the business lobby’s anti-funding campaign. “Judges perceive an attempt to disable people from being able to bring claims,” she said. The near-consensus among judges that work-product privilege applies “doesn’t happen without strong policy leanings,” Glover said.\nThe Chamber and its fellow litigation funding skeptics may still wrest disclosure requirements from Congress or concessions from the Rules Committee. But individual defendants trying to get hold of funding agreements are fighting an expanding body of precedent that says those deals are protected.\nThe views expressed in this article are not those of Reuters News.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://www.cand.uscourts.gov/news/210"], "published": "2018-01-24T04:33:00.000+02:00", "crawled": "2018-01-24T08:38:07.006+02:00", "highlightTitle": ""}