{"organizations": [], "uuid": "6c6c1e8ad49c9a833a392d09ad09e0846979b437", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222178480&w=1200&r=LYNXMPEE0E12W", "site_section": "http://feeds.reuters.com/reuters/UKStocksAndSharesNews/", "section_title": "Reuters: Stocks & Shares News", "url": "https://uk.reuters.com/article/us-carillion-restructuring-competitors/investors-see-few-silver-linings-in-carillion-collapse-idUKKBN1F41Q6", "country": "US", "domain_rank": 408, "title": "Investors see few silver linings in Carillion collapse", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T16:03:00.000+02:00", "replies_count": 0, "uuid": "6c6c1e8ad49c9a833a392d09ad09e0846979b437"}, "author": "", "url": "https://uk.reuters.com/article/us-carillion-restructuring-competitors/investors-see-few-silver-linings-in-carillion-collapse-idUKKBN1F41Q6", "ord_in_thread": 0, "title": "Investors see few silver linings in Carillion collapse", "locations": [], "entities": {"persons": [{"name": "liberum", "sentiment": "none"}, {"name": "babcock", "sentiment": "none"}, {"name": "tom pfeiffer", "sentiment": "none"}, {"name": "balfour beatty", "sentiment": "none"}, {"name": "kier", "sentiment": "none"}], "locations": [{"name": "carillion", "sentiment": "none"}, {"name": "interserve", "sentiment": "none"}, {"name": "balfour beatty", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "carillion", "sentiment": "none"}, {"name": "kier group", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "serco", "sentiment": "none"}, {"name": "costain", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 1:39 PM / Updated 17 hours ago Investors see few silver linings in Carillion collapse Tom Pfeiffer 4 Min Read \nLONDON (Reuters) - Investors struggled to find buying opportunities after the collapse of British construction and support services company Carillion on Monday, underscoring how risks have piled up for the whole industry. \nCalculating the implications of one of the biggest UK corporate failures of recent years is a challenge because of the wide scope of Carillion’s operations. \nCompanies from Serco to Interserve, Balfour Beatty and Kier Group could now pick up work from Carillion, which did everything from providing school meals to building hospitals and managing part of the mammoth HS2 north-south rail project. \nSerco shares jumped 5 percent on Monday, with speculation it will swoop in to take over attractive Carillion healthcare facility management contracts. \nMore work could come in for Babcock in defense, Costain and Kier in roads and Balfour Beatty in rail in coming months, broker Liberum said. \nIt said contractors had been reporting better terms of new trade in the past six months and the disruption from Carillion’s collapse may make customers think harder about driving deals that are too harsh for the supplier. \nBut such optimism was tempered by the simple fact of one of the sector’s biggest players going to the wall, with the government only willing to offer piecemeal help to minimize the disruption to public services. \n”People are looking at possible winners from this (but) in the short-term, it’s a pretty grim day for the UK construction sector,” said James Tetley, deputy head of research at N+1 Singer. FILE PHOTO: Carillion's Midland Metropolitan Hospital construction site in Smethwick, Britain January 11, 2018. REUTERS/Darren Staples/File Photo \nLiberum estimated Carillion owes 1.5 billion pounds ($2.1 billion) to its banks RBS, Barclays, HSBC, Lloyds and Santander, including 500 million of “reverse factoring” where they have paid suppliers, and expects them to lose hundreds of millions. \nThat will hardly make them more willing to lend to Carillion’s peers when they share so many of its problems - an environment of often low-profit work where contracts are structured so the supplier shoulders much of the risk. \n“Ultimately the situation around Carillion is a function of a competitive outsourcing and construction market in the UK, amplified by excessive financial leverage which has built up over recent years,” said UBS analysts. \n“While the departure of a competitor may ease this, we think the impact will likely be small given the fragmented nature of the market.” SUPPLY CHAIN RIPPLES \nMuch of Carillion’s work was tied up in joint ventures. Its partners may be happy to shoulder its share of the work but in some cases they will be obliged to, and it might not benefit them. \nWhere JVs have weak profitability or other problems, taking on even more of that business may hit earnings. Balfour Beatty and Galliford Try shares fell 2.4 percent and 3.5 percent respectively on Monday as they detailed the additional cost of completing projects in which they were a partner with Carillion. \nAnalysts see little major supply chain disruption because the industry had time to prepare, although shares in Speedy Hire - which counts Carillion among its biggest customers - dived 8 percent on Monday. \nThat share price fall “looks a little bit harsh but it’s trying to price in all of the downside,” said Tetley, who estimates Carillion was about 4 percent of Speedy Hire’s sales. Additional reporting by Tricia Wright, Kit Rees and Alasdair Pal; Editing by Mark Potter", "external_links": [], "published": "2018-01-15T16:03:00.000+02:00", "crawled": "2018-01-16T11:04:56.028+02:00", "highlightTitle": ""}