{"organizations": [], "uuid": "8b9d6f205347add7e81d1297643a7b9170c515f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 40, "shares": 40, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1219949665&w=1200&r=LYNXMPEE0602V", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-auckland-women/goerges-humbles-wozniacki-to-seal-auckland-title-idUSKBN1EW02Z", "country": "US", "domain_rank": 408, "title": "Goerges humbles Wozniacki to seal Auckland title", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T05:36:00.000+02:00", "replies_count": 0, "uuid": "8b9d6f205347add7e81d1297643a7b9170c515f0"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-auckland-women/goerges-humbles-wozniacki-to-seal-auckland-title-idUSKBN1EW02Z", "ord_in_thread": 0, "title": "Goerges humbles Wozniacki to seal Auckland title", "locations": [], "entities": {"persons": [{"name": "wozniacki", "sentiment": "negative"}, {"name": "sloane stephens", "sentiment": "none"}, {"name": "goerges", "sentiment": "none"}, {"name": "caroline wozniacki", "sentiment": "none"}, {"name": "venus wil", "sentiment": "none"}, {"name": "julia goerges", "sentiment": "none"}], "locations": [{"name": "auckland", "sentiment": "none"}, {"name": "auckland", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "auckland tennis centre", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "zhuhai", "sentiment": "none"}], "organizations": [{"name": "goerges", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUCKLAND (Reuters) - World number 14 Julia Goerges won her third successive tournament as she blasted her way to a 6-4 7-6(4) victory over Caroline Wozniacki to seal the Auckland Classic title on Sunday.\nGoerges was rarely troubled by the world number three as she used a powerful service and blistering forehands that kept the Dane pinned deep and unable to extend rallies beyond a few shots.\nThe 29-year-old German, who has played at the Auckland tournament every year since her first visit in 2010, extended her winning streak to 14-matches stretching back to last year when she won in Moscow and then the WTA Elite Trophy in Zhuhai.\n“It feels amazing, but it’s not just about winning here but about my consistency over the last few months,” Goerges said after she became the first woman to be presented with a korowai, or Maori feather cloak, that will be awarded to every subsequent winner.\n“I have become much more mature, that’s thanks to my team who have really changed my brain.”\nBad weather throughout the week wreaked havoc with the schedule in New Zealand’s largest city and both had been required to play their quarter-finals and semi-finals on Saturday.\nBoth players had made the final at the Auckland Tennis Centre before, with the German losing to Sloane Stephens in 2016, while Wozniacki lost to Venus Williams in 2015.\nGoerges however stamped her intentions on the opening point when she smashed a forehand service return back at Wozniacki’s feet and broke to take a 1-0 lead that she never relinquished.\nShe sealed the first set after 35 minutes with her seventh ace and then broke Wozniacki again in the first game of the second set and continued to just overpower the Dane.\nWozniacki had an opportunity to get back on serve in the fourth game when she had a break point but Goerges simply pulled out another ace and consolidated her lead.\nThe Dane, however, was finally getting into the match and while she blew her second break point two games later she finally broke in the eighth to get back on serve and then took a 5-4 lead.\nThat was the only chance she had, however, as Goerges forced a tiebreak and then raced through it to seal the title after 91 minutes with another forehand winner.\n“I have got a lot of matches under my belt and it was the type of preparation I hoped for,” Wozniacki said as she looked ahead to the Australian Open from Jan. 15-28.\n“Hopefully it will be a great couple of weeks.”\nReporting by Greg Stutchbury in Wellington; Editing by Amlan Chakraborty\n ", "external_links": [], "published": "2018-01-07T05:36:00.000+02:00", "crawled": "2018-01-07T05:59:33.002+02:00", "highlightTitle": ""}