{"organizations": [], "uuid": "a2de13bcca8f938b07ef03e089785474d8ce29d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/11/04/103139958-GettyImages-sb10064290d-001.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/employers-should-use-corporate-tax-cut-for-larger-401k-match.html", "country": "US", "domain_rank": 767, "title": "Employers should use corporate tax cut for larger 401(k) match", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.169, "site_type": "news", "published": "2018-01-16T16:07:00.000+02:00", "replies_count": 0, "uuid": "a2de13bcca8f938b07ef03e089785474d8ce29d0"}, "author": "Aaron Pottichen", "url": "https://www.cnbc.com/2018/01/16/employers-should-use-corporate-tax-cut-for-larger-401k-match.html", "ord_in_thread": 0, "title": "Employers should use corporate tax cut for larger 401(k) match", "locations": [], "entities": {"persons": [{"name": "aaron pottichen", "sentiment": "none"}, {"name": "lauren nicole", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "cls partners published", "sentiment": "none"}, {"name": "employee benefit research institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Today thousands of controllers, chief financial officers and finance people are discussing ways to best use that corporate tax reduction that was handed to them before the holidays. To help them in their discussions, I have outlined four reasons why they should consider using part of that corporate tax reduction to increase or start up a 401(k) plan employer match.\n1. Increasing or starting a match only helps to improve your employee's retirement outcomes. Recent research from the Employee Benefit Research Institute indicates that an employer match was 73 percent \"very likely or somewhat likely\" to help non-savers save for retirement.\n2. An employer match is not going to be wasted. With a vesting schedule, any employees who leave prior to fully vesting will have those non-vested dollars recouped by the employer to be used to offset the cost of the match in the future or decrease plan costs.\n3. Employees place high value on this benefit. Research from EBRI has sited the employer retirement plan as the second most important benefit employees receive from their employer . Putting more money behind a program your employees already value would help them appreciate the benefit even more. Better to back a winning horse than on one that employees may not appreciate.\n4. Nearly three out of four 401(k) plans provide an employer match. During the financial crisis, many of those employer matches were reduced or eliminated altogether. Since then, many have been increased.\nHowever, there is a certain section of plans that have yet to get their employer matches back to where they were prior to the financial crisis. Data from a recent BrightScope/ICI study show that in 2006 78 percent of all plans offered an employer match , and as of 2014, that was back up to 77 percent.\nYour Wealth: Weekly advice on managing your money Sign up to get Your Wealth\nJob Industry Advertising/Marketing Automotive Communications/PR Construction/Manufacturing Education Finance/Banking/Insurance Legal Media/Entertainment Medical/Health Care Mining/Oil/Gas/Utilities Gov't/Non-Profit Real Estate Retail Technology/IT Transportation/Shipping Travel/Hospitality Other Submit Please enter a valid email address Get this delivered to your inbox, and more info about about our products and service. Privacy Policy . There are two 401(k) plan segments where they have yet to get back to where they were in 2006. For plans less than $1 million in assets and between $1 million and $10 million, there are still fewer of them providing a match than in 2006. It is likely that many companies with plans this size are small businesses that file as an LLC and will be receiving a tax reduction in 2018.\nMore from Investor Toolkit:\nAdvisors turn to life coaches and counselors", "external_links": [], "published": "2018-01-16T16:07:00.000+02:00", "crawled": "2018-01-16T16:10:37.063+02:00", "highlightTitle": ""}