{"organizations": [], "uuid": "9474b8f2cf3e78014727467b6f647af379c9cd2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/news/world", "section_title": "World News | Reuters.com", "url": "https://www.reuters.com/article/us-congo-protests/congolese-police-fire-teargas-on-churchgoers-protest-idUSKBN1F1213", "country": "US", "domain_rank": 408, "title": "Congolese police fire teargas on churchgoers' protest", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-13T00:19:00.000+02:00", "replies_count": 0, "uuid": "9474b8f2cf3e78014727467b6f647af379c9cd2b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-congo-protests/congolese-police-fire-teargas-on-churchgoers-protest-idUSKBN1F1213", "ord_in_thread": 0, "title": "Congolese police fire teargas on churchgoers' protest", "locations": [], "entities": {"persons": [{"name": "kabila", "sentiment": "none"}, {"name": "pierrot mwanamputu", "sentiment": "none"}, {"name": "joseph kabila", "sentiment": "none"}], "locations": [{"name": "kinshasa", "sentiment": "none"}, {"name": "democratic republic of congo", "sentiment": "none"}, {"name": "kinshasa", "sentiment": "none"}, {"name": "congo", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "catholic", "sentiment": "none"}, {"name": "roman catholic church", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KINSHASA (Reuters) - Congolese police fired teargas on Friday to disperse dozens of churchgoers who had gathered in the capital Kinshasa to mourn seven people killed in protests against President Joseph Kabila two weeks ago.\nA Reuters cameraman who was filming the church service said police fired a volley of teargas outside, apparently to prevent the gathering turning into another political demonstration.\nScores have been killed in protests over Kabila’s future in the past two years and militia violence has destabilized swathes of Congo, stoking fears the vast central African country will slide back into civil wars.\nSecurity forces in Democratic Republic of Congo killed at least seven people in the capital on New Year’s Eve during demonstrations that Catholic activists organized to protest Kabila’s refusal to step down, the United Nations said. [nL8N1OV044].\nThe head of the Roman Catholic Church in Congo, Pierrot Mwanamputu, two days later condemned that repression as “nothing more, nothing less than barbarism”. [nL8N1OX34U] The police, which admit killing only four people, described those killed as militants and gangsters.\nThe Catholic church, an institution that enjoys broad credibility in Congo, has emerged as a lightning rod for opposition to Kabila’s efforts to stay in power with no mandate, while his political opposition remains weak and fragmented.\nIt brokered a deal between Kabila and the opposition at the end of 2016 under which an election would be held by early this year, but it has slipped again and is now loosely scheduled for the end of this year.\nThis has fueled suspicion that Kabila may try to remove constitutional term limits on continuing in office.\n“Our brothers and sisters died because they took a decision to remind us that (this) ... agreement must be respected,” Donation Bafuidinsoni, the Auxiliary Bishop of Kinshasa told mourners at the service.\nIts bishops are making ever louder criticism of human rights abuses by the government and alleged plans by Kabila to remove term limits stopping him from running for re-election -- Kabila has declined to comment on whether that is his intention.\nIn power since his father was killed in office in 2001, Kabila blames delays on the logistics of voter registration.\n“I don’t know why they fired teargas at us. Truly, this government has to go,” said a mourner fleeing the cloud of teargas who gave only her first name of Florence.\nWriting by Tim Cocks; Editing by Richard Balmforth\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-13T00:19:00.000+02:00", "crawled": "2018-01-12T18:27:45.040+02:00", "highlightTitle": ""}