{"organizations": [], "uuid": "7dc17d4373c255f1aa5239ceff648657285c76a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/13/104896511-GettyImages-890098682.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/23/bitcoin-broker-coinbase-booked-1-billion-in-revenue-last-year--so-the-company-has-told-hovering-vcs-to-back-off.html", "country": "US", "domain_rank": 767, "title": "Bitcoin broker Coinbase booked $1 billion in revenue last year — so the company has told hovering VCs to back off", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T14:14:00.000+02:00", "replies_count": 0, "uuid": "7dc17d4373c255f1aa5239ceff648657285c76a1"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/23/bitcoin-broker-coinbase-booked-1-billion-in-revenue-last-year--so-the-company-has-told-hovering-vcs-to-back-off.html", "ord_in_thread": 0, "title": "Bitcoin broker Coinbase booked $1 billion in revenue last year — so the company has told hovering VCs to back off", "locations": [], "entities": {"persons": [{"name": "coinbase", "sentiment": "negative"}], "locations": [{"name": "silicon valley", "sentiment": "none"}], "organizations": [{"name": "netflix", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coinbase, the bitcoin trading broker that has exploded in popularity as cryptocurrencies surge and nose dive, has encountered an unusual problem for a Silicon Valley startup: Too many investors are trying to get in.\nThe six-year-old company crossed $1 billion in revenue last year, Recode has learned from industry sources, a tremendous rise fueled by layman interest in both bitcoin and competing virtual currencies that users can buy and sell through the app.\nThe company's valuation has likely at least doubled since its last valuation of $1.6 billion in August. Coinbase was only expected to do about $600 million in yearly revenue as of September 30, according to people with knowledge of the figures, but bitcoin's run between Thanksgiving and Christmas boosted the company's 2017 revenue to over $1 billion.\nMore from Recode: \nHere's why people on Twitter are seeing news alerts that they didn't ask for\nNetflix now has nearly 118 million streaming subscribers globally\nNetflix added another 8.3 million subscribers in a 'beautiful' Q4 \nBitcoin is altogether only worth about $175 billion in market value as of today's trading price of about $10,500 — a 50 percent drop from just a month ago. And so Coinbase's $1 billion in revenue suggests it has become the most-used broker for bitcoin transactions.\nCoinbase makes money not on bitcoin's price but on the volume of trades — charging both the buyer and seller usually a fee between 0.25 percent and 1 percent of the total transaction size through the site. The company serves as both an exchange and a broker of deals, though it does not serve as a market maker that holds bitcoin.\nIts success has attracted overwhelming interest from outside investors in acquiring some of the company, with several shareholders telling Recode that venture capitalists and private brokers have recently begun asking them if they would consider selling their Coinbase shares.\nAnatoliy Zhdanov | Kommersant | Getty Images The only problem? Coinbase doesn't allow that.\nCoinbase effectively warned its own shareholders to not engage in those conversations in a statement to Recode this weekend.\n\"As a private company, Coinbase does not allow trading of stock on secondary markets for a variety of reasons, including the fact that there is not full and equal information available to the market,\" the company said. \"We will take appropriate action if we find people have sold Coinbase shares in violation of our agreements not to do so.\"\nInvestors are desperate to purchase shares in the company. But Coinbase already raised $100 million just six months ago — just before the bitcoin craze took off in earnest that fall — meaning that outside investors will have to wait for probably more than a year until the company is ready to raise another round of cash.\nThe problem, though, is that several company insiders expect the company to never fundraise again and that the round led by IVP in August could be the company's last before an IPO. Investors that spoke to company leadership later this fall were told that they could not currently buy shares in the company.\nSo with the front door closed, investors are now trying the back door.\nOne investor told Recode that he was being \"pinged constantly by secondary brokers\" seeking a small amount of shares to the company. A second investor said venture capitalists were reaching out to him directly to gauge his interest in parting with any of his holdings. Neither said conversations progressed to specifics over pricing.\nCoinbase said it was not aware of any secondary trades actually occurring; the company declined to comment when asked if it was aware of other stock sale conversations in addition to Recode's reporting.\nThat hasn't stopped people from trying. Yet multiple brokers told Recode the problem was that while so many investors are itching to buy shares, so few existing shareholders — be it employees or venture capitalists — are willing to supply them. That makes it hard to price a deal.\nOne solution could be a tender offer, in which Coinbase authorizes all existing shareholders to sell their stock to a new investor after the company opens its books and gives each shareholder the exact same chance to trade. Some Coinbase investors say the company could launch a tender offer later this year.\nLarge venture backers of Coinbase include Union Square Ventures, Andreessen Horowitz and DFJ, each of whom has a seat on its board.\nThe company, founded in 2012 by Brian Armstrong and Fred Ehrsam, allows both consumers and merchants to buy and sell not just bitcoin but also competing digital currencies such as litecoin and ethereum. The portal is attractive to venture capitalists, they say, because it allows them to place a bet on the broader cryptocurrency market as opposed to an investment in a specific blockchain-enabled technology or a specific currency.\nThe startup, which at one point was the most popular free app in the App Store, is credited with helping the currency appeal to the mainstream buyer. Coinbase now has more brokerage accounts, over 13 million, than the trading giant Charles Schwab.\nIn recent months, the company has moved into the business of storing digital cash for big institutions like hedge funds. But that wasn't always a sure thing, according to one person briefed on the plan: The company entered into late-stage talks last year to acquire what's known as a custody company to manage storage, but the deal fell through.", "external_links": [], "published": "2018-01-23T14:14:00.000+02:00", "crawled": "2018-01-23T14:41:04.054+02:00", "highlightTitle": ""}