{"organizations": [], "uuid": "1043bef7059b994335054e6f1a6e1355c6d137b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-veritext-acquires-david-feldman-worldwide-court-reporting.html", "country": "US", "domain_rank": 767, "title": "Veritext Acquires David Feldman Worldwide Court Reporting", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.084, "site_type": "news", "published": "2018-01-16T17:15:00.000+02:00", "replies_count": 0, "uuid": "1043bef7059b994335054e6f1a6e1355c6d137b5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-veritext-acquires-david-feldman-worldwide-court-reporting.html", "ord_in_thread": 0, "title": "Veritext Acquires David Feldman Worldwide Court Reporting", "locations": [], "entities": {"persons": [{"name": "veritext", "sentiment": "none"}, {"name": "nancy josephs", "sentiment": "none"}, {"name": "josephs", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "livingston", "sentiment": "none"}, {"name": "dfw", "sentiment": "none"}], "organizations": [{"name": "veritext acquires david feldman worldwide court reporting", "sentiment": "negative"}, {"name": "david feldman worldwide", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LIVINGSTON, N.J. , Jan. 16, 2018 (GLOBE NEWSWIRE) -- Veritext, the national leader in court reporting and litigation support solutions, today announces its acquisition of David Feldman Worldwide (DFW) Court Reporting . DFW’s experience with very complex litigation cases and exemplary customer service complements Veritext’s full breadth of technical solutions and world-class data security. Together they will offer clients of both companies premier court reporting and litigation support solutions.\n“DFW’s expertise in very complex litigation fits well with the experience and advanced technology Veritext brings to the table,” said Nancy Josephs, Chief Executive Officer of Veritext. Clients of DFW will have immediate access to Veritext’s state-of-the-art deposition suites, multimedia depositions, document repositories, remote depositions, online and mobile scheduling, paperless depositions and more. In addition, they will experience the world-class, HIPAA-compliant data security Veritext offers. “Combining the services of both companies makes the perfect union,” Josephs continued.\nDFW was founded by David Feldman in 2002 along with his two children, Michael and Sheril, who have owned and operated the company since 2009. DFW’s client-facing team will stay on with David Feldman Worldwide, a Veritext Company after the acquisition, ensuring that clients will receive the same stellar service they have come to expect. DFW is based in New York City and serves clients across the United States and in foreign locations.\n“By joining with Veritext, we will be able to offer our clients a full breadth of technology solutions to make the deposition process more effective. They will also have access to the more than 50 Veritext offices around the country,” said Michael Feldman, President of David Feldman Worldwide, a Veritext Company. “Veritext shares our commitment to quality court reporting and impeccable service, which makes this transition the perfect fit for our clients and our employees.”\nVeritext is the largest nationwide provider of deposition and litigation support solutions. The company provides court reporters, advanced technology and services to law firms and corporations across the United States. Veritext has been serving the legal community since 1997 and has extensive experience in all types of complex litigation. The company recently announced acquisitions in Florida and New Jersey and their expansion in the St. Louis marketplace.\nAbout Veritext\nVeritext is the leader in deposition and litigation support solutions. For law firms and corporations, the company provides national coverage, skilled court reporters, advanced technology and unmatched client service. Our solutions utilize the latest easy-to-use technologies that streamline the deposition process, enhance delivery flexibility and reliably handle the most complex cases. Proprietary video, mobile and remote services combined with unmatched security, including HIPAA and PII compliance, ensure that Veritext clients have the best tools available and the confidence of working with the market leader. More information can be found at www.veritext.com .\nContact:\nValerie E. Berger\n973.549.4541\nvberger@veritext.com\nSource: Veritext", "external_links": ["https://www.veritext.com/veritext-welcomes-florida-acquisitions/", "https://www.globenewswire.com/NewsRoom/AttachmentNg/97422bc7-c255-4931-bd12-c0045f22fc16", "https://www.david-feldman.com/index.php", "https://www.veritext.com/veritext-expands-its-deposition-and-litigation-support-services-in-st-louis-market/", "http://www.veritext.com/", "https://www.veritext.com/veritext-acquires-thomas-g-oakes-associates/"], "published": "2018-01-16T17:15:00.000+02:00", "crawled": "2018-01-16T18:32:29.010+02:00", "highlightTitle": ""}