{"organizations": [], "uuid": "bb86b04a95e953515ea0fdc94a21e2b8213d160a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-investor-forum-shareholders/bt-still-has-work-to-do-to-rebuild-shareholder-confidence-investor-group-idUKKBN1FE2J8", "country": "US", "domain_rank": 408, "title": "BT still has work to do to rebuild shareholder confidence - investor group", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T19:18:00.000+02:00", "replies_count": 0, "uuid": "bb86b04a95e953515ea0fdc94a21e2b8213d160a"}, "author": "", "url": "https://uk.reuters.com/article/uk-investor-forum-shareholders/bt-still-has-work-to-do-to-rebuild-shareholder-confidence-investor-group-idUKKBN1FE2J8", "ord_in_thread": 0, "title": "BT still has work to do to rebuild shareholder confidence - investor group", "locations": [], "entities": {"persons": [{"name": "ben martin", "sentiment": "none"}, {"name": "simon jessop", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "bt", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 19 PM / Updated 15 minutes ago BT still has work to do to rebuild shareholder confidence - investor group Ben Martin , Simon Jessop 3 Min Read \nLONDON (Reuters) - BT ( BT.L ) still has work to do to restore shareholders’ confidence after a difficult year that saw its shares plunge in the wake of an Italian accounting scandal, according to one of Britain’s leading investor groups. \nThe Investor Forum, an independent body whose members are institutions that manage about 14 trillion pounds ($20 trillion) of global assets, disclosed on Thursday that it had raised concerns with the telecoms giant last year at the behest of unhappy shareholders who own about 12 percent of the business. \n“The objective was to ensure that the company had a clear view of investor frustrations as well as an understanding of the need for prompt and decisive action to help restore the reputation of the company,” the Forum said in its annual report. \n“BT took comprehensive action to address a number of issues that were weighing on investors’ minds, but the process of rebuilding confidence is ongoing.” \nThe investor group said it had suggested that there would be “significant value” in holding a so-called “stewardship and strategy” meeting with investors this year as a way to improve engagement with institutions. \nBT shares have slumped 32 percent since last January, when it disclosed a 530 million-pound black hole in its Italian accounts and cautioned that public sector contract work was stalling. \nThe profit warning put pressure on Chief Executive Gavin Patterson and added to the challenges facing new Chairman Jan du Plessis, who took up his role as the head of BT’s board in November. \nThe Forum said its “engagement” with BT took place between February and July last year - before du Plessis took over. \nA spokesman for BT   \nThe Forum’s annual report sheds light on the group’s activities in 2017, when it said it engaged with 10 companies, including the London Stock Exchange ( LSE.L ) during its acrimonious dispute with activist hedge fund TCI over the departure of the exchange’s chief executive, Xavier Rolet. \nIt was also involved with Amerisur ( AMER.L ), IP Group ( IPO.L ), ECO Animal Health ( EAH.L ), Worldpay ( WP.N ) and Rio Tinto ( RIO.L )( RIO.AX ). \nThe Forum, which was launched in 2014, tries to keep a low profile and only discloses its work at companies once the talks are over. Reporting by Ben Martin and Simon Jessop; Editing by Adrian Croft", "external_links": [], "published": "2018-01-25T19:18:00.000+02:00", "crawled": "2018-01-25T19:42:16.000+02:00", "highlightTitle": ""}