{"organizations": [], "uuid": "c409789ece0c36c0287ab568a47af6d9bfac3e70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/domesticNews\r", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-cyber-nsa/ex-u-s-nsa-contractor-to-plead-guilty-to-massive-theft-of-secret-data-idUSKBN1ET05R", "country": "US", "domain_rank": 408, "title": "Ex-U.S. NSA contractor to plead guilty to massive theft of secret data", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T03:29:00.000+02:00", "replies_count": 0, "uuid": "c409789ece0c36c0287ab568a47af6d9bfac3e70"}, "author": "", "url": "https://www.reuters.com/article/us-usa-cyber-nsa/ex-u-s-nsa-contractor-to-plead-guilty-to-massive-theft-of-secret-data-idUSKBN1ET05R", "ord_in_thread": 0, "title": "Ex-U.S. NSA contractor to plead guilty to massive theft of secret data", "locations": [], "entities": {"persons": [{"name": "martin", "sentiment": "none"}, {"name": "glen burnie", "sentiment": "none"}, {"name": "harold martin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "baltimore", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}], "organizations": [{"name": "nsa", "sentiment": "negative"}, {"name": "u.s. national security agency", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - A former U.S. National Security Agency contractor has agreed to plead guilty to stealing classified information, according to court filings on Wednesday, in what may have been the largest heist of U.S. government secrets in history. \nHarold Martin is scheduled to plead guilty to one count of willful retention of national defense information at a federal court in Baltimore on Jan. 22, according to the filings. \nProsecutors said Martin, who was indicted last February, spent up to 20 years stealing highly sensitive government material from the U.S. intelligence community related to national defense, collecting a trove of secrets he hoarded at his home in Glen Burnie, Maryland. \nAuthorities said they seized 50 terabytes of data from Martin’s home, which officials said could be the biggest theft of classified information in U.S. history. \nThe government has not said what, if anything, Martin did with the stolen data. \nHe faces up to 10 years in prison on the single count. Martin has not struck a plea deal with prosecutors and could still be tried on the remaining 19 counts in the indictment, the court filings said. \nA lawyer for Martin did not immediately respond to a request for comment. \nThe NSA has been hit by a series of damaging data breaches in recent years. \nIn December, former NSA employee Nghia Hoang Pho pleaded guilty to illegally taking classified information that an intelligence official said was later stolen from his home computer by Russian hackers. \nMartin worked for Booz Allen Hamilton Holding Corp when he was taken into custody in August 2016. \nBooz Allen also employed Edward Snowden, who leaked a trove of secret files to news organizations in 2013 that exposed vast domestic and international surveillance operations carried out by the NSA. \nMartin was employed as a private contractor by at least seven companies, working for several government agencies beginning in 1993 after serving in the U.S. Navy for four years, according to the indictment. \nHis positions, which involved work on highly classified projects involving government computer systems, gave him various security clearances that routinely provided him access to top-secret information, it said. \nThe indictment also alleged that Martin stole documents from U.S. Cyber Command, the CIA and the National Reconnaissance Office. \nReporting by Eric Beech; Editing by Peter Cooney\n ", "external_links": [], "published": "2018-01-04T03:29:00.000+02:00", "crawled": "2018-01-04T03:49:45.000+02:00", "highlightTitle": ""}