{"organizations": [], "uuid": "92e8a76639226a886db76f708b3a2e16d87fc900", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226539748&w=1200&r=LYNXMPEE0T0FJ", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-northkorea-malaysia-kim-court/indonesian-accused-in-kim-jong-nam-killing-was-hired-for-prank-show-lawyer-says-idUKKBN1FJ0ZH", "country": "US", "domain_rank": 408, "title": "Indonesian accused in Kim Jong Nam killing was hired for prank show, lawyer says", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T10:44:00.000+02:00", "replies_count": 0, "uuid": "92e8a76639226a886db76f708b3a2e16d87fc900"}, "author": "", "url": "https://uk.reuters.com/article/uk-northkorea-malaysia-kim-court/indonesian-accused-in-kim-jong-nam-killing-was-hired-for-prank-show-lawyer-says-idUKKBN1FJ0ZH", "ord_in_thread": 0, "title": "Indonesian accused in Kim Jong Nam killing was hired for prank show, lawyer says", "locations": [], "entities": {"persons": [{"name": "kim jong nam", "sentiment": "negative"}, {"name": "gooi soon seng", "sentiment": "none"}, {"name": "siti aisyah", "sentiment": "none"}, {"name": "doan thi huong", "sentiment": "none"}, {"name": "azirul nizam che wan aziz", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}], "locations": [{"name": "vietnam", "sentiment": "none"}, {"name": "kuala lumpur airport", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 8:44 AM / Updated 33 minutes ago Indonesian accused in Kim Jong Nam killing was hired for prank show, lawyer says Reuters Staff 3 Min Read \nKUALA LUMPUR (Reuters) - A woman accused of killing the North Korean leader’s estranged half-brother was hired for a prank television show by a suspect wanted by the Malaysian police just over a month earlier, her lawyer told a court on Tuesday. \nIndonesian Siti Aisyah is accused with another woman, Doan Thi Huong from Vietnam, of killing Kim Jong Nam by smearing his face with VX, a banned chemical poison at Kuala Lumpur airport on Feb. 13 last year. \nDefence lawyers say the women thought they were playing pranks for a reality show and did not know they were poisoning Kim. They face the death penalty if convicted. \nOn Jan. 5 last year, Siti Aisyah was approached at a nightclub by a Malaysian taxi driver, who asked her if she would participate in a Japanese video prank show, her lawyer, Gooi Soon Seng, told the court during his questioning of the lead police investigator in the case, Wan Azirul Nizam Che Wan Aziz. \nThe following morning the taxi driver, Kamaruddin Masiod, also known as John, introduced Siti Aisyah to Ri Ji U, a North Korean posing as a Japanese man named James, at a shopping mall in Kuala Lumpur’s city centre, Gooi added. \nAfter Siti Aisyah agreed to the offer, she watched pranks being played by an unidentified woman, before joining in. She played pranks on three people near a fountain outside the mall entrance and was paid 400 ringgit ($102.70) by Ri at the end of the day, Gooi said. \nWan Azirul, the police witness, was unable to confirm the pranks took place. Vietnamese Doan Thi Huong, who is on trial for the killing of Kim Jong Nam, the estranged half-brother of North Korea's leader, is escorted as she arrives at the Shah Alam High Court on the outskirts of Kuala Lumpur, Malaysia January 22, 2018. REUTERS/Lai Seng Sin \n“I agree that Kamaruddin was the person who introduced the first accused (Siti Aisyah) to James, but the date and place, I‘m not sure,” Wan Azirul said. \nThe meeting of Siti Aisyah, Ri and Kamaruddin was captured in a photograph taken at the shopping mall, Gooi said. \nThe photo was released to reporters after Tuesday’s hearing. \nRi was named by Malaysian police as a suspect shortly after Kim Jong Nam’s killing and his photo was released to the media. \nDefence lawyers have argued the killing was politically motivated, with many key suspects linked to the North Korean embassy in Kuala Lumpur, suggesting the two women were merely unwitting pawns in the attack. \nPyongyang has denied accusations by South Korean and U.S. officials that North Korean leader Kim Jong Un’s regime was behind the killing. \nThe trial resumes on Feb. 8. \n($1=3.8950 ringgit)", "external_links": [], "published": "2018-01-30T10:44:00.000+02:00", "crawled": "2018-01-30T10:58:43.000+02:00", "highlightTitle": ""}