{"organizations": [], "uuid": "8d931584740d79d21e6b54bc44ec6802b80ca43c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKhealth/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-wrigley-lawsuit/wrigley-lawsuit-dont-use-starburst-skittles-to-sell-e-cigarette-liquid-idUKKBN1FJ2OV", "country": "US", "domain_rank": 408, "title": "Wrigley lawsuit: Don't use Starburst, Skittles to sell e-cigarette liquid", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T21:05:00.000+02:00", "replies_count": 0, "uuid": "8d931584740d79d21e6b54bc44ec6802b80ca43c"}, "author": "", "url": "https://uk.reuters.com/article/us-wrigley-lawsuit/wrigley-lawsuit-dont-use-starburst-skittles-to-sell-e-cigarette-liquid-idUKKBN1FJ2OV", "ord_in_thread": 0, "title": "Wrigley lawsuit: Don't use Starburst, Skittles to sell e-cigarette liquid", "locations": [], "entities": {"persons": [{"name": "jonathan stempel", "sentiment": "none"}, {"name": "wrigley", "sentiment": "none"}], "locations": [{"name": "wrigley", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "mars inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "wm wrigley jr co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 7:05 PM / Updated 2 hours ago Wrigley lawsuit: Don't use Starburst, Skittles to sell e-cigarette liquid Jonathan Stempel 2 Min Read \n(Reuters) - The chewing gum and candy company Wm Wrigley Jr Co said in a new lawsuit that a seller of e-liquid for electronic cigarettes should stop trading off its Starburst and Skittles brands in its marketing. \nIn a complaint filed on Monday in Chicago federal court, Wrigley accused Get Wrecked Juices LLC of infringing its trademarks and causing unspecified damages by selling “Pink Starburst” and “Skeetlez” e-liquid in colorful advertising. \nThe unit of privately-held Mars Inc said this included the depiction of a pink square resembling Starburst, and colored round “lentils” imprinted with the letter S resembling Skittles. \nWrigley said there was “growing concern” among U.S. regulators and politicians that the marketing of e-cigarette materials in candy flavors “harmfully targets” children. \n“Defendants have refused to cease their misappropriation of Wrigley’s famous and federally registered Starburst and Skittles trademarks ... in an intentional effort to trade off of the valuable goodwill that Wrigley has built up,” Wrigley said. \nWrigley’s lawsuit named Jacksonville, Florida-based Get Wrecked and principal Brian Edward Turner as defendants. They did not immediately respond on Tuesday to requests for comment. A lawyer for the defendants could not immediately be identified. \nThe U.S. Food and Drug Administration discourages children from using e-cigarettes, many of which contain nicotine, and has said it hopes this year to launch a full-scale education campaign to warn teenagers about the dangers. \nWrigley said Get Wrecked has ignored its demands to stop sales of infringing products, though it changed the “Skeetlez” product image to a rainbow. \nThe case is Wm Wrigley Jr Co v Get Wrecked Juices LLC et al, U.S. District Court, Northern District of Illinois, No. 18-00642. Reporting by Jonathan Stempel in New York; editing by Tom Brown", "external_links": [], "published": "2018-01-30T21:05:00.000+02:00", "crawled": "2018-01-30T21:34:57.000+02:00", "highlightTitle": ""}