{"organizations": [], "uuid": "dc9549e33832ece8a3662f93fb0fbe5d3d7e6124", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-actis-acquires-110-megawatt-solar-plant-in-chile-from-sunpower.html", "country": "US", "domain_rank": 767, "title": "Actis Acquires 110-Megawatt Solar Plant in Chile From SunPower", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.259, "site_type": "news", "published": "2018-01-25T16:05:00.000+02:00", "replies_count": 0, "uuid": "dc9549e33832ece8a3662f93fb0fbe5d3d7e6124"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-actis-acquires-110-megawatt-solar-plant-in-chile-from-sunpower.html", "ord_in_thread": 0, "title": "Actis Acquires 110-Megawatt Solar Plant in Chile From SunPower", "locations": [], "entities": {"persons": [{"name": "michelle bachelet", "sentiment": "none"}, {"name": "javier areitio", "sentiment": "none"}, {"name": "actis", "sentiment": "none"}], "locations": [{"name": "san jose", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "chile", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "santiago", "sentiment": "none"}, {"name": "metro de", "sentiment": "none"}, {"name": "el pelicano", "sentiment": "none"}, {"name": "atacama region", "sentiment": "none"}, {"name": "la higuera", "sentiment": "none"}, {"name": "coquimbo region", "sentiment": "none"}, {"name": "vallenar", "sentiment": "none"}], "organizations": [{"name": "sunpower corp.", "sentiment": "negative"}, {"name": "metro de santiago", "sentiment": "none"}, {"name": "sunpower", "sentiment": "none"}, {"name": "el pelicano solar plant", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, and SAN JOSE, Calif., Actis and SunPower Corp. (NASDAQ:SPWR) announced today that Actis has acquired the 110-megawatt (DC) El Pelicano Solar Plant in Chile, which uses SunPower® Oasis® power plant technology. It is expected to deliver 300 gigawatt hours per year of electricity to Metro de Santiago, Santiago's underground railway system. The project is in the municipality of La Higuera (Coquimbo Region) near Vallenar (Atacama Region), and commenced commercial operation on November 17, 2017.\n\"With a supportive regulatory environment and abundant solar resource, Chile is a market we know extremely well through our investments in the Aela Energía and Atlas Renewables platforms,\" said Javier Areitio, director at Actis. \"We are confident that in partnership with Metro de Santiago and SunPower, the El Pelicano plant will be a terrific illustration of clean, sustainable energy for many years to come.\"\nOn January 11, Metro de Santiago celebrated completion of the plant with an event at the site, attended by Chilean President Michelle Bachelet and Metro de Santiago President Rodrigo Azocar. Metro de Santiago will buy the power generated by the plant under a power purchase agreement. SunPower is providing operations and maintenance services for the facility under a long-term contract.\n\"Actis is focused on sustainable value, which makes the El Pelicano Solar Plant a great fit for its portfolio,\" said Chuck Boynton, SunPower chief financial officer. \"High performance SunPower Oasis technology is designed to cost-effectively maximize power generation for decades. Forward-looking organizations like Actis and Metro de Santiago are a global model for the development of solar power, reducing reliance on unsustainable energy sources.\"\nThe SunPower Oasis system is a fully-integrated, modular solar power block that is engineered for rapid deployment and optimizing land use. The high-efficiency SunPower solar panels installed at the site will be cleaned using SunPower's proprietary robotic solar panel cleaning technology, which uses 75 percent less water than traditional cleaning methods and can help improve system performance by up to 15 percent.\nWorldwide, more than 4.6 gigawatts of solar power plants operate today using SunPower's leading solar technology.\nAbout Actis\nActis is a leading investor in growth markets with over US$13 billion raised since inception. Actis targets consistent, competitive returns delivered responsibly through insights gained from trusted relationships and local knowledge, set within a culture of active ownership across Asia, Africa and Latin America.\nIn the power sector, Actis has committed US$5 billion to 33 energy infrastructure companies across 25+ countries generating 18 gigawatts of energy capacity and directly impacted 80 million consumers. Actis' investments in Chile include 1.2GW Pan-Latin American renewable energy platform, Atlas Renewable Energy and Chilean renewable platform Aela Energía which is targeting 330 megawatts of installed capacity.\nActis is a signatory to the United Nations backed Principles for Responsible Investment (PRI). Actis was awarded an A+, the highest grade attainable, in the PRI's latest assessment.\nAbout SunPower\nAs one of the world's most innovative and sustainable energy companies, SunPower Corporation (NASDAQ:SPWR) provides a diverse group of customers with complete solar solutions and services. Residential customers, businesses, governments, schools and utilities around the globe rely on SunPower's more than 30 years of proven experience. From the first flip of the switch, SunPower delivers maximum value and superb performance throughout the long life of every solar system. Headquartered in Silicon Valley, SunPower has dedicated, customer-focused employees in Africa, Asia, Australia, Europe, North and South America. For more information about how SunPower is changing the way our world is powered, visit www.sunpower.com .\nSunPower's Forward-Looking Statements\nThis press release contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995, including, but not limited to, statements regarding project plans and deliverables, projected energy output, anticipated product performance, cost savings, and continuity of business plans and strategies. These forward-looking statements are based on our current assumptions, expectations, and beliefs and involve substantial risks and uncertainties that may cause results, performance, or achievement to materially differ from those expressed or implied by these forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to: regulatory changes and the availability of economic incentives promoting use of solar energy, challenges inherent in constructing and maintaining certain of our large projects, competition and market conditions in the solar and general energy industry, and fluctuations or declines in the performance of our solar panels and other products and solutions. A detailed discussion of these factors and other risks that affect our business is included in filings we make with the Securities and Exchange Commission (SEC) from time to time, including our most recent reports on Forms 10-K and 10-Q, particularly under the heading \"Risk Factors.\" Copies of these filings are available online from the SEC or on the SEC Filings section of our Investor Relations website at investors.sunpowercorp.com . All forward-looking statements in this press release are based on information currently available to us, and we assume no obligation to update these forward-looking statements in light of new information or future events.\n©2018 SunPower Corporation. All Rights Reserved. SUNPOWER, the SUNPOWER logo, and OASIS are registered trademarks of SunPower Corporation in the U.S. and other countries as well.\nView original content: http://www.prnewswire.com/news-releases/actis-acquires-110-megawatt-solar-plant-in-chile-from-sunpower-300588115.html\nSOURCE SunPower Corp.", "external_links": ["http://www.prnewswire.com/news-releases/actis-acquires-110-megawatt-solar-plant-in-chile-from-sunpower-300588115.html", "https://c212.net/c/link/?t=0&l=en&o=2040937-1&h=2508868120&u=http%3A%2F%2Fwww.sunpower.com%2F&a=www.sunpower.com"], "published": "2018-01-25T16:05:00.000+02:00", "crawled": "2018-01-25T17:37:26.017+02:00", "highlightTitle": ""}