{"organizations": [], "uuid": "81b01f5bf43c481779261ccb7134e5435a5256f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/12/reuters-america-update-8-oil-retreats-from-70-highs-but-set-for-fourth-week-of-gains.html", "country": "US", "domain_rank": 767, "title": "UPDATE 8-Oil retreats from $70 highs but set for fourth week of gains", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T18:51:00.000+02:00", "replies_count": 0, "uuid": "81b01f5bf43c481779261ccb7134e5435a5256f5"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/12/reuters-america-update-8-oil-retreats-from-70-highs-but-set-for-fourth-week-of-gains.html", "ord_in_thread": 0, "title": "UPDATE 8-Oil retreats from $70 highs but set for fourth week of gains", "locations": [], "entities": {"persons": [{"name": "david gaffen", "sentiment": "none"}, {"name": "vagit alekperov", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "iea brent", "sentiment": "negative"}, {"name": "lukoil", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "organization of the petroleum exporting countries", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "brent", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* High prices risk encouraging shale production growth -IEA\nBrent, WTI hit highest since Dec 2014 on Thursday\n* Lukoil CEO: Russia should exit supply deal if oil stays near $70\n* Coming up: Baker Hughes U.S. oil rig count at 1 p.m./1800 GMT (Adds quotes, updated prices; changes bullets, byline, dateline, previous LONDON)\nBy David Gaffen\nNEW YORK, Jan 12 (Reuters) - Oil prices edged lower on Friday after hitting a three-year high the previous day, but the benchmarks remained on track for a fourth straight week of gains.\nA drawdown in U.S. inventories and a pullback in production, combined with steady demand and the extension of OPEC's global supply cut agreement, has bolstered the oil-market rally for several weeks, helping push Brent crude through $70 a barrel for the first time since December 2014.\nRussia's Lukoil Chief Executive Vagit Alekperov said Russia - part of the global agreement with the Organization of the Petroleum Exporting Countries to reduce supply - should start to exit the pact if crude prices remain at $70 a barrel for more than six months.\nBrent crude futures traded 13 cents lower at $69.13 a barrel by 11:27 a.m. EST (1627 GMT). U.S. West Texas Intermediate (WTI) crude futures fell 14 cents to $63.66. WTI hit its strongest since late 2014 at $64.77 on Thursday.\nFor the week, Brent was set for a 2.3 percent gain while WTI was on track for a 3.5 percent rise.\n\"If you look at any kind of momentum indicator this is telling you this is way overbought,\" said Robert Yawger, director of energy futures at Mizuho in New York. \"However, there are definitely issues supporting the market.\"\nMajor oil producing-countries have grown concerned that as prices remain near these levels, it will spur additional production from U.S. shale patches in Texas and North Dakota, risking overwhelming the market with additional supply, and hurting OPEC's market share.\nFatih Birol, head of the Paris-based International Energy Agency, said oil prices at $65 to $70 risked encouraging more oversupply from U.S. shale drillers.\nThe U.S. oil rig count, an early indicator of future output, rose more than 40 percent last year, according to Baker Hughes data. Drillers, however, cut five rigs last week despite higher prices. Baker Hughes data for this week is due at 1 p.m. EST.\nU.S. crude production fell in the most recent week by nearly 300,000 barrels per day to about 9.5 million bpd, which analysts attributed to the deep freeze across most of the country.\nThe U.S. Energy Department expects production will blow through 10 million bpd in the next few months, en route to 11 million bpd by next year, rivaling Russia and Saudi Arabia.\nGulf OPEC producers plan to keep their oil output in the current quarter below the year-earlier level despite strong demand growth and a drop in global inventories, a senior OPEC source familiar with Gulf oil thinking said.\nThe OPEC/Russia agreement to cut 1.8 million bpd is due to last until the end of 2018. Oil prices have found support from eight consecutive weeks of U.S. crude inventory drops.\nU.S. commercial crude stocks <C-STK-T-EIA> fell to 419.5 million barrels in the week to Jan. 5, right near the five-year average, the target for OPEC and others cutting output.\nFutures contracts show an expectation for prices to pull back by year end, with the December U.S. crude futures contract currently trading just above $60 a barrel.\nLater-dated futures trading lower than the spot price is known as backwardation, and is expected to inhibit production because it implies a lower price for future barrels sold.\n(Additional reporting by Ahmad Ghaddar in London and Henning Gloystein in Singapore; Editing by Marguerita Choy and Edmund Blair)", "external_links": [], "published": "2018-01-12T18:51:00.000+02:00", "crawled": "2018-01-14T00:10:29.006+02:00", "highlightTitle": ""}