{"organizations": [], "uuid": "b2456d580deb2da5e0b7ac8eb104be102ec417ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XB040_apple0_SOC_20180117182738.jpg", "site_section": "https://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1516276486", "country": "US", "domain_rank": 387, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T14:54:00.000+02:00", "replies_count": 0, "uuid": "b2456d580deb2da5e0b7ac8eb104be102ec417ae"}, "author": "Paul Page", "url": "https://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1516276486", "ord_in_thread": 0, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "locations": [], "entities": {"persons": [{"name": "tripp mickle", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}], "organizations": [{"name": "logistics news from - wsj", "sentiment": "negative"}, {"name": "apple inc.", "sentiment": "neutral"}, {"name": "apple", "sentiment": "none"}, {"name": "corning inc", "sentiment": "none"}, {"name": "wsj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Sign up: With one click, get this newsletter delivered to your inbox .\nApple Inc.’s AAPL 0.03% famously global supply chain may take on a more American look in the coming years. The electronics giant plans $30 billion in capital spending in the U.S. over five years, the WSJ’s Tripp Mickle reports, including investment in new facilities and new spending with U.S. suppliers that would inject new growth into the American economy . The plans signal an adjustment to Apple’s production strategy after years of criticism for its overseas manufacturing of its iPhone, which has created an eco-system of suppliers mostly across Asia. Apple expects to increase its spending on U.S. suppliers such as glass-maker Corning Inc. GLW 0.03% by about 10% this year to around $55 billion while expanding a fund devoted to fostering manufacturing in the U.S. Apple expects the investments to contribute $350 billion to the U.S. economy over the next five years, but that figure may grow if the company’s role as an electronics trend-setter extends to manufacturing and draws more factory work to the U.S.\nCSX Corp. isn’t done making its network smaller even as the railroad tries to win back shippers. James Foote, who took over as CEO last month, says the carrier is still looking at simplifying its network and reviewing plans to scale back by selling some track to other railroads. The WSJ’s Paul Ziobro writes the work is aimed at extending plans put into motion by Hunter Harrison, whose death last month raised questions about the future of Mr. Harrison’s “precision railroading.” Mr. Foote’s comments suggest there’s no slowdown in the effort to make CSX leaner, faster and more profitable. The new CEO has been taking that message to shippers who were stung last year by deep service problems. CSX’s fourth-quarter earnings added another message—volumes were down but operating profit rose, in part because of higher prices, signaling that freight rates are one area where CSX won’t be cutting back.\nAirbus SE are both Boeing Co. are scrambling to keep their production supply chains moving as fast as airlines are ordering planes. Airbus said this week it built a record 718 aircraft in 2017 and Boeing pushed 763 jets to customers, the WSJ’s Robert Wall reports, capping a delivery frenzy that’s been a boon to the jet makers’ profits while straining manufacturing and supply lines around the world . Airbus fell short of its target of building at least 200 A320neo planes last year because of lingering engine supply issues, among several problems that have hit the companies as their suppliers have tried to keep up with demand. That’s also strained relations between the aerospace giants and suppliers. Boeing is so concerned, the WSJ’s Doug Cameron writes, it is establishing a separate supplier of high-end aircraft seats with automotive seating supplier Adient PLC. It’s Boeing’s latest step to bolster its supply chain by bringing some work in-house and adding new suppliers.\nSUPPLY CHAIN STRATEGIES Apple iPhone X smartphones. Photo: Bloomberg News The path to new U.S. automotive factories is getting crowded. Nissan Co. is the latest to join the rush, with the company’s chief executive saying the car maker’s next expansion would likely include a new plant in the U.S. That expansion could be four or five years away, but the WSJ’s Sean McLain reports the outlook puts Japan’s Nissan on a growing list of foreign auto manufacturers looking to scale up in the U.S. Last week, Toyota Motor Corp. and Mazda Motor Corp. said they would build a $1.6 billion plant in Alabama., and Germany’s BMW AG is expanding production at a plant in South Carolina. The investments will make U.S. auto parts supply chains bigger and give them a different look. Nissan is planning a big push toward electric vehicles, and the company’s growth could push more of the metals, batteries and other parts for alternative-power cars through the U.S.\nQUOTABLE\n‘ The market is just strong everywhere. ’\n—John Leahy, chief operating officer at Airbus.\nNumber of the Day $3.028 Average per-gallon U.S. price for diesel fuel last week, the first time in three years it has cleared $3 a gallon.\nIN OTHER NEWS U.S. manufacturing output edged up 0.1%. in December as overall industrial production rose at a rapid pace . (WSJ)\nCanada’s central bank raised its main interest rate but said North American trade tensions cast a cloud over business investment . (WSJ)\nThe Federal Reserve reports tight labor markets across the U.S. but only modest wage and price growth . (WSJ)\nBritish aircraft-engine maker Rolls-Royce Holdings PLC may sell its commercial-marine division under a strategic review of its business. (WSJ)\nThe commanders of two U.S. destroyers involved in collisions that killed 17 sailors in Asia will be court-martialed on charges including negligent homicide. (WSJ)\nCasper Inc., an online direct-to-consumer mattress seller, named new leadership as it pushes an expansion strategy . (WSJ)\nBritish construction giant and government contractor Carillion went into liquidation after rescue talks failed . (WSJ)\nGeneral Motors has outsourced the material-handling tasks at all its China factories to third-party logistics companies. (Reuters)\nU.K. retailer Marks and Spencer is closing its main London distribution center , staffed by XPO Logistics Inc. and DHL Supply Chain. (Sky News)\nInstacart Inc. will acquire Toronto-based grocery digital tools startup Unata. (Globe and Mail)\nAlibaba Group Holding Ltd. is looking for a distribution center site in France. (Eseller Café)\nFourth-quarter sales at industrial parts supplier Fastenal soared 14.8% . (Industrial Distribution)\nVessel capacity operated by the top 15 container lines grew 12.6% last year, says research group Alphaliner. (WSJ)\nJapan’s shipbuilders say order volumes for mainstay merchant vessels rose 150% in 2017. (Nikkei Asian Review)\nU.S. importers want maritime regulators to set limits on special charges for cargo shipments held at ports. (American Shipper)\nThe Waterfront Commission of New York Harbor is suing over a new law aimed at pulling New Jersey out of the crime-fighting body . (Associated Press)\nShippers using Asia-Europe rail transport are setting long-term contracts in a show of growing confidence in the service. (Journal of Commerce)\nLoaded container imports at South Carolina’s Port of Charleston jumped 13.6% in December . (Charleston Post and Courier)\nNorway plans to shut down the country’s fur farms . (The Guardian)\nABOUT US Paul Page is deputy editor of WSJ Logistics Report. Follow him at @PaulPage , and follow the entire WSJ Logistics Report team: @brianjbaskin , @jensmithWSJ and @EEPhillips_WSJ . Follow the WSJ Logistics Report on Twitter at @WSJLogistics .\nWrite to Paul Page at paul.page@wsj.com", "external_links": ["https://twitter.com/PaulPage", "https://www.reuters.com/article/us-autoshow-detroit-gm-dhl/exclusive-gm-dhl-use-a-chinese-plant-to-lead-manufacturing-change-idUSKBN1F60DE", "https://www.theguardian.com/world/2018/jan/16/norway-ban-fur-farms-fox-mink-fashion", "https://twitter.com/WSJLogistics?lang=en", "https://www.theglobeandmail.com/report-on-business/grocery-delivery-company-instacart-acquires-toronto-based-startup-unata/article37623375/", "https://twitter.com/EEPhillips_WSJ?lang=en", "https://asia.nikkei.com/Business/Trends/Japan-s-shipbuilding-industry-turning-corner-as-orders-double", "https://www.inddist.com/news/2018/01/fastenal-sales-and-profits-soared-2017-vending-onsite", "https://www.usnews.com/news/best-states/new-jersey/articles/2018-01-17/suit-seeks-to-stop-christie-order-ending-ports-watchdog", "https://lloydslist.maritimeintelligence.informa.com/LL1120881/Box-shipping-The-big-get-bigger", "https://www.postandcourier.com/business/record-month-caps-record-year-for-containerized-cargo-at-the/article_505fcf74-fb9a-11e7-8f05-537c9096293c.html", "https://www.americanshipper.com/main/news/70299.aspx", "https://twitter.com/brianjbaskin?lang=en", "https://www.joc.com/rail-intermodal/shift-china-europe-rail-strategy-shippers-move-service-contracts_20180117.html", "https://twitter.com/jensmithWSJ", "https://news.sky.com/story/ms-puts-380-jobs-at-risk-in-london-logistics-shake-up-11211122", "https://esellercafe.com/alibaba-open-logistics-centre-france/"], "published": "2018-01-18T14:54:00.000+02:00", "crawled": "2018-01-18T18:46:25.002+02:00", "highlightTitle": ""}