{"organizations": [], "uuid": "ed4d425f8247b064dcf2ef17e88357052d5990cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218783147&w=1200&r=LYNXMPEE010CT", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-weather/deep-freeze-keeps-grip-on-eastern-united-states-expected-to-ease-idUKKBN1ER0P9", "country": "US", "domain_rank": 408, "title": "Deep freeze keeps grip on eastern United States, expected to ease", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T12:43:00.000+02:00", "replies_count": 0, "uuid": "ed4d425f8247b064dcf2ef17e88357052d5990cf"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-weather/deep-freeze-keeps-grip-on-eastern-united-states-expected-to-ease-idUKKBN1ER0P9", "ord_in_thread": 0, "title": "Deep freeze keeps grip on eastern United States, expected to ease", "locations": [], "entities": {"persons": [{"name": "reuters/eduardo munoz", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "rocky mountains", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "montana", "sentiment": "none"}, {"name": "midwest", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "atlantic coast", "sentiment": "none"}, {"name": "northeast ohio", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "indianapolis", "sentiment": "none"}], "organizations": [{"name": "national weather service", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 10:44 AM / Updated 16 minutes ago Deep freeze keeps grip on eastern United States, expected to ease Reuters Staff 3 Min Read \n(Reuters) - A record-shattering arctic cold wave kept its grip on much of the United States east of the Rocky Mountains on Tuesday but temperatures everywhere except the northeast were expected to warm thereafter. People cross 6th Avenue and 42nd Street as a cold weather front hits the region, in Manhattan, New York, U.S., December 30, 2017. REUTERS/Eduardo Munoz \nSchools remained shut as a result of the cold snap, which claimed four lives over the long New Year weekend. \nThe National Weather Service issued wind chill warnings for Tuesday as dangerously low temperatures were possible from eastern Montana across the Midwest, into the Atlantic Coast and the Northeast and down through the deep south. \nSchool districts in Iowa, Massachusetts, Indianapolis and Northeast Ohio cancelled or delayed the start of classes on Tuesday as bitterly cold temperatures 20 to 30 degrees Fahrenheit (11 to 17 degrees Celsius) below normal were expected across the eastern half of the United States. A man walks in falling snow at Times Square as a cold weather front hits the region, in Manhattan, New York, U.S., December 30, 2017. REUTERS/Eduardo Munoz \n“Just the bitter cold which is just too dangerous to put kids out on the street waiting for a bus that may not come,” said Herb Levine, superintendent of the Peabody School District, north of Boston, to a local CBS affiliate television station. \nThe bitter cold was blamed on the deaths of two men in separate incidents in Milwaukee, according to the Milwaukee Journal Sentinel. Another man was found frozen to death outside a church in Detroit while a homeless man was found dead on a porch in Charleston, West Virginia, local news reported. \nMany places across the United States saw record low temperatures over the last few days. Omaha, Nebraska, posted a low of minus 20 F (minus 29 C), breaking a 130-year-old record, and Aberdeen, South Dakota, shattered a record set in 1919 with a temperature of minus 32 F (minus 36 C). \nThe cold should ease across most of the United States after Tuesday, but the northeastern quarter of the country will see a repeat of the frigid temperatures from Thursday to Friday as another arctic blast hits the area. \nThe private AccuWeather forecaster said the cold snap could combine with a storm brewing off the Bahamas to bring snow and high winds to much of the Eastern Seaboard as it heads north on Wednesday and Thursday. Reporting by Brendan O'Brien in Milwaukee; Editing by Raissa Kasolowsky", "external_links": [], "published": "2018-01-02T12:43:00.000+02:00", "crawled": "2018-01-02T13:02:24.003+02:00", "highlightTitle": ""}