{"organizations": [], "uuid": "8f72324ef350ad80284002bb047da02e494a96f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/09/gettyimages-814034854.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/30/mark-zuckerberg-clueless-facebook-local/", "country": "US", "domain_rank": 1196, "title": "Facebook CEO Mark Zuckerberg's Clueless Local News Plans | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.45, "site_type": "news", "published": "2018-01-30T10:49:00.000+02:00", "replies_count": 0, "uuid": "8f72324ef350ad80284002bb047da02e494a96f7"}, "author": "Adam Lashinsky", "url": "http://fortune.com/2018/01/30/mark-zuckerberg-clueless-facebook-local/", "ord_in_thread": 0, "title": "Facebook CEO Mark Zuckerberg's Clueless Local News Plans | Fortune", "locations": [], "entities": {"persons": [{"name": "mark zuckerberg", "sentiment": "negative"}, {"name": "paul morris/bloomberg", "sentiment": "none"}, {"name": "zuckerberg", "sentiment": "none"}, {"name": "adam lashinsky", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "sun valley", "sentiment": "none"}, {"name": "idaho", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "clueless local news plans | fortune facebook", "sentiment": "negative"}, {"name": "allen & co.", "sentiment": "none"}, {"name": "harvard", "sentiment": "none"}, {"name": "facebook inc.", "sentiment": "none"}, {"name": "fortune", "sentiment": "none"}, {"name": "air force", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Adam Lashinsky 8:49 AM EST \nThis article first appeared in Data Sheet, Fortune’s daily newsletter on the top tech news. Sign up here . \nMy hunch is that Mark Zuckerberg has never covered a local hearing on a telephone utility’s desire to raise rates. He probably hasn’t sat in an airless room listening to citizens berating the Air Force’s decision to close a local base. Zuckerberg likely hasn’t waded into an animal-rights protest at a dry cleaner’s shop that stores fur coats in the summertime. While he was designing a proto-“Hot or Not” web site at Harvard he undoubtedly didn’t ponder a feminist art professor’s attack on male-dominant statues on campus. \nI covered all these topics in my very first experience as a reporter, with the outstanding college newspaper The Daily Illini at the University of Illinois at Urbana-Champaign—home to a computer science department that begat oodles of Silicon Valley luminaries. (I studied history.) \nThis is all relevant today because the Facebook (fb) boss said Monday his company would begin to promote local over national news. He said people in his travels across the land “kept telling (him) … how much we all have in common if we can get past some of the most divisive national issues.” We can make great progress, as these simple folk relayed to Zuckerberg, “if we could turn down the temperature” on this prickly national fare in favor of “concrete” concerns at the local level. \nIt can’t be easy being a clueless billionaire or the head of the company that has helped decimate the news industry’s business model without being willing to accept the responsibility of being branded a media company. \nThe suggestion that local issues are less contentious than national ones merely because they somehow involve a bunch of happy neighbors cordially engaging in the American democratic experiment is laughable. It’d even be amusing if the stakes weren’t so high. First Facebook decides to de-emphasize news altogether. Then it proposes a popularity contest to determine quality. Now it hopes to calm criticism of its own culpability in poisoning the political well by deflecting what its users see away from national topics. \nThe tech backlash pendulum will swing back one day. But not today. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-30T10:49:00.000+02:00", "crawled": "2018-01-30T16:02:02.022+02:00", "highlightTitle": ""}