{"organizations": [], "uuid": "ed4e5fde67604f51ec45fa4c5e5d13591d1f3f86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-the-first-bancorp-reports-record-results-for-2017.html", "country": "US", "domain_rank": 767, "title": "The First Bancorp Reports Record Results for 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-18T00:15:00.000+02:00", "replies_count": 0, "uuid": "ed4e5fde67604f51ec45fa4c5e5d13591d1f3f86"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-the-first-bancorp-reports-record-results-for-2017.html", "ord_in_thread": 0, "title": "The First Bancorp Reports Record Results for 2017", "locations": [], "entities": {"persons": [{"name": "tony c. mckim", "sentiment": "none"}], "locations": [{"name": "maine", "sentiment": "none"}, {"name": "damariscotta", "sentiment": "none"}], "organizations": [{"name": "first nat", "sentiment": "negative"}, {"name": "first bancorp", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "ional bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DAMARISCOTTA, Maine--(BUSINESS WIRE)-- The First Bancorp (Nasdaq: FNLC), parent company of First National Bank, today announced record operating results for the year ended December 31, 2017. Net income was $19.6 million, up $1.6 million or 8.8% from the $18.0 million reported for the year ended December 31, 2016. Earnings per common share on a fully diluted basis of $1.81 were up $0.15 or 9.0% compared to 2016. The Company also announced operating results for the quarter ended December 31, 2017. Net income was $5.1 million, up $766,000 or 17.7% from results reported for the fourth quarter of 2016, and earnings per common share on a fully diluted basis of $0.47 were up $0.07 or 17.5% from the same period in 2016.\n“I am very pleased to report that 2017 was the best annual performance in the Company’s history,” remarked Tony C. McKim, the Company’s President and Chief Executive Officer. “Increased net interest income was the primary driver for our 2017 performance, the result of continued strong growth across our business lines. The fourth quarter of 2017 was also the best quarter in the history of the Company, up $104,000 or 2.1% from the previous record set in the third quarter of 2017.\n“Earning assets increased $121.3 million in 2017,” noted President McKim. “Growth came primarily from the loan portfolio which increased $92.6 million to end the year at $1.16 billion. The commercial loan portfolio was the driver of this growth, up $64.7 million or 13.5%, while residential loans were up $20.8 million or 4.8% and municipal loans were up $6.3 million, or 23.4%. In addition, the investment portfolio grew $27.9 million or 5.2% over 2016. On the funding side of the balance sheet, low-cost deposits grew $55.2 million, or 8.6%, to $696.0 million as of December 31, 2017, while total deposits grew $175.9 million or 14.2% to $1.42 billion at year-end.\n“Our growth in earning assets led directly to increased net interest income,” President McKim continued. “On a tax-equivalent basis, net interest income was up $5.1 million or 11.2% from 2016, while our net interest margin held steady at 3.04% after three Federal Reserve rate hikes during the year. At $12.5 million, non-interest income in 2017 was level with the prior year, with a $269,000 increase in revenue from First Advisors, the Company’s wealth and investment management division, offsetting modest year-over-year reductions in deposit service charge and mortgage banking revenues. Non-interest expense in 2017 was up $2.3 million or 7.7% from 2016 levels. The Company’s investments in personnel and technology growth contributed to this increase, along with higher FDIC insurance expense.\n“We continue to be focused on overall credit quality in our loan and investment portfolios,” President McKim said. “Non-performing assets stood at 0.86% of total assets as of December 31, 2017, up from the 0.48% reported a year ago and down from the 0.94% reported as of September 30, 2017. Net charge offs were 0.12% of average loans in 2017, improved slightly from the 0.13% of average loans in 2016. We provisioned $2.0 million for loan losses in 2017, up $400,000 from the amount provisioned in 2016. The allowance for loan losses stood at 0.92% of total loans as of December 31, 2017, down from 0.95% of total loans a year ago.”\n“The strong financial results we posted in 2017 are demonstrated in our operating ratios,” observed F. Stephen Ward, the Company’s Chief Financial Officer. “For 2017, our return on average assets was 1.10% and our return on average tangible common equity was 13.11%, as compared to 1.12% and 12.42% respectively in 2016. Our return on average tangible equity continues to stand out in relation to the Bank’s UBPR peer group average, which stood at 10.19% as of September 30, 2017. We remain focused on operating efficiently, as shown in the improvement in our efficiency ratio to 49.72% for 2017, down from 50.43% in 2016. This measure remains well below the Bank’s peer group average which stood at 61.77% as of September 30, 2017.\n“The recently enacted Tax Cuts and Jobs Act of 2017 (\"the TCJA\") had little effect on our estimated 2017 results,” Mr. Ward continued. “Unlike a number of bank holding companies that have disclosed an expected negative impact to 2017 earnings attributable to the TCJA, the Company maintained a modest level of net deferred tax assets prior to enactment of the TCJA and, as a result, the adjustment of value required under Generally Accepted Accounting Principles (\"GAAP\") was limited. We recorded a provisional charge to current earnings related to the TCJA of $134,000 in the fourth quarter, and expect to benefit from the TCJA's reduction in the corporate tax rate going forward.\n“Shares of The First Bancorp ended 2017 at $27.23 per share, down $5.87 from our December 31, 2016 close of $33.10 per share. With dividends reinvested, our total return for 2017 was -14.70 %. While the price performance of our stock over the past year has been a disappointment, we continue to nicely outperform the broad market over a three-year period, with a total return of 68.7%, as compared to the S&P 500 which had a three-year total return with dividends reinvested of 38.3%, as well the Russell 2000, in which we are included, with a three-year total return of 32.9%. We have also outperformed the banking industry over the past three years, with total returns for The First Bancorp over the period exceeding both the 50.1% of the KBW Regional Bank Index and the 58.4% of the Nasdaq Bank Index. The Board of Directors maintained the quarterly dividend at 24 cents per share in the fourth quarter of 2017. Based on the December 31, 2017 closing price, our annualized dividend yield was an attractive 3.53%.”\n“We continue to execute on our strategic vision,” President McKim concluded. “The 7.4% growth in earning assets we experienced in the course of 2017 led directly to strong growth in net interest income and ultimately our bottom line results. I can’t say enough about our outstanding team of customer-focused banking professionals who are committed to building our business each and every day. Whether it’s through the businesses and building projects we’ve financed, our innovative Dream First Rewards program, the investment management expertise of First Advisors, or the many charitable causes we’ve supported, their impact is apparent in both the success of the Bank and wellbeing of the communities we serve.”\nThe First Bancorp Consolidated Balance Sheets (Unaudited)\nIn thousands of dollars except common stock data December 31, 2017 December 31, 2016 Assets Cash and due from banks $ 19,207 $ 17,366 Interest-bearing deposits in other banks 860 293 Securities available for sale 300,172 300,416 Securities to be held to maturity 256,567 226,828 Restricted equity securities, at cost 10,358 11,930 Loans held for sale 386 782 Loans 1,164,139 1,071,526 Less allowance for loan losses 10,729 10,138 Net loans 1,153,410 1,061,388 Accrued interest receivable 5,867 5,532 Premises", "external_links": ["http://www.businesswire.com/news/home/20180117006424/en/"], "published": "2018-01-18T00:15:00.000+02:00", "crawled": "2018-01-18T00:38:48.000+02:00", "highlightTitle": ""}