{"organizations": [], "uuid": "86677999363cad3d4640eaee7010df721575455f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-lisa-ellis-top-ranked-payments-processors-and-it-services-analyst-joins-moffettnathanson-llc.html", "country": "US", "domain_rank": 767, "title": "Lisa Ellis, Top-Ranked Payments, Processors and IT Services Analyst, Joins MoffettNathanson, LLC", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-24T16:00:00.000+02:00", "replies_count": 0, "uuid": "86677999363cad3d4640eaee7010df721575455f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-lisa-ellis-top-ranked-payments-processors-and-it-services-analyst-joins-moffettnathanson-llc.html", "ord_in_thread": 0, "title": "Lisa Ellis, Top-Ranked Payments, Processors and IT Services Analyst, Joins MoffettNathanson, LLC", "locations": [], "entities": {"persons": [{"name": "lisa ellis", "sentiment": "negative"}, {"name": "ellis", "sentiment": "none"}, {"name": "bernstein", "sentiment": "none"}, {"name": "lisa", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "bernstein", "sentiment": "none"}, {"name": "m.s.", "sentiment": "none"}], "organizations": [{"name": "llc", "sentiment": "negative"}, {"name": "sanford c. bernstein & co", "sentiment": "none"}, {"name": "mckinsey & co.", "sentiment": "none"}, {"name": "the college of william and mary", "sentiment": "none"}, {"name": "mckinsey", "sentiment": "none"}, {"name": "technology & telecom and marketing & sales", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 24, 2018 /PRNewswire/ -- MoffettNathanson, LLC announced today that Lisa Ellis will join the firm as a Partner. Ellis was most recently a Senior Research Analyst at Sanford C. Bernstein & Co. While at Bernstein, Ellis was the #1 Institutional Investor ranked Payments, Processors and IT Services analyst.\nLisa is also a recognized expert on Bitcoin and Blockchain, as well as other emerging cryptocurrencies. She has authored seminal investment research reports, and is a frequent commentator, on these and other disruptive payment technologies.\nPrior to Bernstein, Lisa spent thirteen years at McKinsey & Co. where she was a Partner in the firm's Technology & Telecom and Marketing & Sales consulting practices. While at McKinsey, Ellis was the lead partner on dozens of engagements focused in strategic areas including specialty networks, mobile applications, cloud, and outsourcing. In total, Lisa has nearly two decades of Technology experience as a research analyst and consultant.\nEllis holds a B.S. in Physics and Mathematics from The College of William and Mary, an M.S. in Materials Science and Engineering from The University of Virginia, and an M.B.A. from The Darden Graduate School of Business Administration at The University of Virginia.\n\"We are thrilled to partner with Lisa,\" said MoffettNathanson Co-Founder Craig Moffett. She is the dominant analyst in a complex and rapidly-changing industry that is central to the future of technology and global commerce.\"\n\"Our Partners and clients welcome Lisa. We all look forward to benefiting from her immense experience and knowledge,\" added co-founder Michael Nathanson.\n\"I'm excited to be joining the elite team of analysts at MoffettNathanson. At a time when both the Payments industry and Wall Street are facing rapid change, the MoffettNathanson platform will enable me to increase the depth and breadth of research services that I provide to my clients,\" Ellis said.\nMoffettNathanson has been a leader in the development of Wall Street's subscription-based payment model. A combination of regulatory and competitive forces is leading to the rapid dissolution of trading as the primary means of payment for research service. MoffettNathanson's subscription-based payment model allows the firm's clients to manage their research budgets more effectively by paying only for the research they value highly, while separately seeking best-execution trading.\nThe creation of a Payments, Processors and IT Services research offering represents MoffettNathanson's third expansion beyond its Media/Communications research roots since the firm's founding nearly five years ago. Over the course of the past year, the firm has hired veteran Software analyst Adam Holt to lead its Software research effort, as well as #1 ranked Retail analyst Greg Melich to lead its Retail and Internet Retail research offering.\nMoffettNathanson plans to partner with other sector-dominant analysts going forward, according to COO and Director of Research, Michael Rietbrock.\nwww.moffettnathanson.com\nView original content: http://www.prnewswire.com/news-releases/lisa-ellis-top-ranked-payments-processors-and-it-services-analyst-joins-moffettnathanson-llc-300586778.html\nSOURCE MoffettNathanson, LLC", "external_links": ["http://www.prnewswire.com/news-releases/lisa-ellis-top-ranked-payments-processors-and-it-services-analyst-joins-moffettnathanson-llc-300586778.html", "http://www.moffettnathanson.com/"], "published": "2018-01-24T16:00:00.000+02:00", "crawled": "2018-01-24T17:32:11.017+02:00", "highlightTitle": ""}