{"organizations": [], "uuid": "1fb2adc01c36121dfdfe2286d97df20bcbe1682e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 12}, "facebook": {"likes": 47, "shares": 47, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/17/104591426-RTS147UK-nafta.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/10/trumps-trade-tactics-are-becoming-a-bigger-worry-for-markets.html", "country": "US", "domain_rank": 767, "title": "Trump's trade tactics are becoming a bigger worry for markets", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.028, "site_type": "news", "published": "2018-01-11T02:14:00.000+02:00", "replies_count": 0, "uuid": "1fb2adc01c36121dfdfe2286d97df20bcbe1682e"}, "author": "Patti Domm", "url": "https://www.cnbc.com/2018/01/10/trumps-trade-tactics-are-becoming-a-bigger-worry-for-markets.html", "ord_in_thread": 0, "title": "Trump's trade tactics are becoming a bigger worry for markets", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}], "locations": [{"name": "detroit", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "windsor", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "nafta", "sentiment": "negative"}, {"name": "treasury", "sentiment": "none"}, {"name": "blackrock", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Trade is becoming a flashpoint for markets.\nTwice Wednesday, trade-related stories caused a flurry in financial markets, and strategists are increasingly concerned the Trump administration's trade policies could create new headwinds for a stock market that otherwise has many reasons to continue to rise.\nThe first story was a Bloomberg News report quoting unnamed Chinese officials, who were considering slowing or halting Treasury purchases because U.S. debt is no longer as attractive but also because of U.S. trade tensions. Treasury yields rose and the dollar slipped in reaction to that report, as traders focused on the potential impact on interest rates.\nThe second story was a Reuters report quoting unnamed Canadian government officials , who said during the afternoon session that they are increasingly convinced the U.S. will announce it will pull out of NAFTA. Stocks fell, the peso and Canadian dollar tumbled, and traders sold U.S. sectors that are sensitive to trade , such as autos.\nshow chapters Canada official: Higher chance US to pull out from NAFTA 20 Hours Ago | 01:26 \"People got immune to the idea of political risk influencing the markets in 2017 simply because it didn't, and so from that perspective, we just think people have overly discounted the inability of political risks to move stock prices,\" said Julian Emanuel, chief equity and derivative strategist at BTIG.\nStrategists have been pointing to trade as one of the biggest risks this year. BlackRock this week said it appears geopolitical risk from trade is rising, based on its proprietary index that tracks the mention of key issues in news stories and brokerage reports. \"… We believe risks such as a more muscular U.S. approach on trade bear watching,\" wrote BlackRock global chief investment strategist Richard Turnill, in a note.\nJanuary is a big month for trade for the Trump administration. The sixth round of talks on renegotiating the 24-year-old North American Free Trade Agreement begins Jan. 23 in Canada, but negotiators head to those talks still at odds on key issues. The Trump administration is also expected to issue two key trade decisions on steel and aluminum later this month, both of which could affect China.\nWhile most strategists do not expect the Chinese to take steps that would be disruptive to the Treasury market, the market did take the report somewhat seriously, and stock traders watched the move in interest rates.\nEurasia Group analysts said they were skeptical that China would use its investments in the Treasury market as a way to get back at the U.S. on trade threats. \"We heavily discount this theory. While US-China tensions are rising, it is very unlikely that China would slow its purchases of US treasuries to warn the Trump administration against aggressive trade measures. President Xi Jinping has plenty of more targeted tools to pressure the United States and retaliate against trade measures. These include informal regulatory actions to deny market access to US firms and exports,\" the analysts wrote. \"These are tools Beijing has used extensively, most recently against South Korea.\"\nAs for NAFTA, the market views that as a much more serious problem.\n\"The biggest threat to the economy and market right now is somehow finding ourselves in a trade war, because that's a war nobody wins,\" said Art Hogan, chief market strategist at B. Riley FBR. \"You have an administration that feels emboldened by their ability to pass tax reform. They feel like they can go on the defensive, and when that happens, mistakes can be made.\"'\nJens Nordvig, CEO of Exante Data, said NAFTA is by far the biggest risk on the trade front and the Trump administration could actually hurt the U.S. dollar if it pulls out. The Mexican peso could decline another 5 to 10 percent, and the Canadian dollar would also fall, but the greenback could see its value erode against the euro and yen, he said.\nIf the U.S. takes even more extreme protectionist measures, the dollar could begin to be less appealing as a reserve currency over the long term.\n\"It's not something that's going to be an on/off switch, but even the tiniest doubts\" could ultimately impact the dollar, he said.\nIf NAFTA is killed, Nordvig expects the U.S. and Canada, for instance, would resort to a bilateral deal they had before NAFTA unless the U.S. wants to reopen that agreement as well.\nProponents of NAFTA say its dissolution would create higher prices in the U.S. and hurt many industries, including autos and farming. President Donald Trump , as a candidate, ran on a platform against NAFTA and has said it is unfair to America. Critics say NAFTA has allowed Mexico to run a $60 billion trade deficit at the expense of U.S. jobs and manufacturing.\n\"I think if markets start reacting negatively to the possibility of NAFTA disappearing and also industries are really getting up in arms and kicking on the doors of their representatives, I imagine the administration would take notice. I don't think they would want to risk causing a disruption in markets,\" said Dana Peterson, U.S. and Canada economist at Citigroup.\nPeterson said a key time for NAFTA could be April, when the U.S. has to renew the trade rules under which it is renegotiating NAFTA. She said among the sticking points are the U.S. demand that rules over settlement disputes be changed as well as that NAFTA be up for renewal every five years. The U.S. also demands that NAFTA content in goods jump to 85 percent from just over 60 percent and that 50 percent be sourced from the U.S.\nAnother concern is that the NAFTA talks will be affected by politics. Political season in the U.S. is upcoming with fall midterm elections for Congress. Mexico's presidential election is July 1.\nFor now, analysts see the future for NAFTA as very unclear. \"It's a coin toss. It's 50/50,\" said Juan Carlos Hartasánchez, Albright Stonebridge Group director. \"I don't think now it's more likely the U.S. will withdraw, given the Canadians' comments.\"\nHe said there was some encouragement earlier this week from comments Trump made to farmers, who are concerned about losing NAFTA.\n\"On Nafta, I am working very hard to get a better deal for our country and for our farmers and for our manufacturers,\" Trump reportedly said at the American Farm Bureau Federation convention in Nashville, Tennessee. \"When Mexico is making all of that money, when Canada is making all of that money, it's not the easiest negotiation.\"\nWATCH: Companies with sales exposure to Canada, Mexico show chapters Here are companies with sales exposure to Canada, Mexico 19 Hours Ago | 01:23", "external_links": [], "published": "2018-01-11T02:14:00.000+02:00", "crawled": "2018-01-11T02:14:21.008+02:00", "highlightTitle": ""}