{"organizations": [], "uuid": "dbdb627abda181ea758dfcec86065c5087928541", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/24/104793262-GettyImages-699160213.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/theres-one-market-analyst-on-wall-street-who-thinks-a-bear-market-is-ahead.html", "country": "US", "domain_rank": 767, "title": "There's one market analyst on Wall Street who thinks a bear market is ahead", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.394, "site_type": "news", "published": "2018-01-08T17:34:00.000+02:00", "replies_count": 0, "uuid": "dbdb627abda181ea758dfcec86065c5087928541"}, "author": "Jeff Cox", "url": "https://www.cnbc.com/2018/01/08/theres-one-market-analyst-on-wall-street-who-thinks-a-bear-market-is-ahead.html", "ord_in_thread": 0, "title": "There's one market analyst on Wall Street who thinks a bear market is ahead", "locations": [], "entities": {"persons": [{"name": "barry bannister", "sentiment": "none"}, {"name": "bannister", "sentiment": "none"}], "locations": [], "organizations": [{"name": "venture capital there", "sentiment": "neutral"}, {"name": "stifel", "sentiment": "none"}, {"name": "fed", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Investors could be facing not only a tough year ahead but also a rough decade as dynamics shift and market returns get back to more normal levels, according to one forecast.\nRising bond yields and a more aggressive Fed are two of the primary drivers behind what Stifel's chief equity strategist, Barry Bannister, says will be a flat 2018, possibly a bear market in 2019 and close to a decade of muted returns.\n\"Valuation and household sector equity ownership point to a very low single-digit annualized S&P 500 total return through\" December 2026, Bannister said in a report for clients. \"On a positive note, this volatile but flat decade ahead is a better environment for active investing than passive strategies.\"\nGetty Images The lower returns would offset the boom market that began in 2009 and take the longer-run average closer to normal. The index has delivered an annual average return of about 15.5 percent during the run, about 50 percent higher than the norm over the past 30 years.\nFavored sectors for the shift include financials, energy and industrials.\nBannister's forecast runs counter to much of the chatter on Wall Street. Most analysts see a year of solid returns ahead, bolstered by tax reform and synchronized global growth, with any threat of a correction short-lived and unlikely to deter the second-longest bull market in history.\nHowever, his projection is that the S&P 500 ends 2018 at 2,750, essentially unchanged from Friday's close and up about 2.5 percent from the year's starting point. From there, investors would be hit with \"a bear market [in the first half of 2019] and a long period of S&P 500 adjustment to rising real rates through 2025 that leads to a sideways pattern for prices in the period.\"\nDuring that time, the index, including dividends, would rise just an average of 3 percent a year.\n\"Our approach to this late stage bull market is to raise target prices incrementally while awaiting the point at which monetary policy chokes equities and [a year later] the economy,\" Bannister said.\nThat point could happen quickly.\nThe tax reform package likely will boost economic growth and corporate earnings, but that would be met with a more aggressive Fed , Bannister said. As things stand, the central bank has indicated three interest rate hikes are likely this year followed by two more in 2019 and another one in 2020 before the benchmark funds rate finds a longer-term plateau of about 2.8 percent, according to projections released in December.\nThough Fed rate hikes over the past two years have had little effect on government bond yields, the Stifel forecast indicates that 2018 will be different, with the 10-year note climbing to close to 3 percent, or half a percentage point above where it traded Monday morning.\n\"We see a 2.96% 10Y yield near term as the yield curve races ahead of the Fed which has, literally, chosen to be 'behind the curve,'\" Bannister wrote. \"As rising yields, reflation, and curve steepening occur, we have recommended financials, energy, industrials, and capex tech for an unusual late-cycle relative move as the global economy recovers from prolonged depression-like conditions.\"\nHe sees global reflation trades working well this year but FANG stocks [ Facebook , Amazon , Netflix and Google-parent Alphabet ) \"vulnerable.\"\n\"This re-shuffling of deck chairs may limit S&P 500 upside in 2018 while providing for industry rotation and timing opportunities,\" he added.\nWATCH: The bulls see no end to the market rally in sight .\nshow chapters Bulls are betting this market will be the greatest of all time 8 Hours Ago | 01:19", "external_links": [], "published": "2018-01-08T17:34:00.000+02:00", "crawled": "2018-01-08T17:34:28.000+02:00", "highlightTitle": ""}