{"organizations": [], "uuid": "b8dd39364b773e744ce9396e085c4cc45937e21f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 70, "shares": 70, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221565860&w=1200&r=LYNXMPEE0B1KS", "site_section": "http://feeds.reuters.com/reuters/technologyNews", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-tech-ces-assistants/which-voice-in-your-fridge-makers-pick-virtual-assistants-idUSKBN1F12OQ", "country": "US", "domain_rank": 408, "title": "Which voice in your fridge? Makers pick virtual assistants", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T23:57:00.000+02:00", "replies_count": 0, "uuid": "b8dd39364b773e744ce9396e085c4cc45937e21f"}, "author": "", "url": "https://www.reuters.com/article/us-tech-ces-assistants/which-voice-in-your-fridge-makers-pick-virtual-assistants-idUSKBN1F12OQ", "ord_in_thread": 0, "title": "Which voice in your fridge? Makers pick virtual assistants", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 10:01 PM / in 12 hours Which voice in your fridge? Makers pick virtual assistants Paresh Dave 4 Min Read \nLAS VEGAS (Reuters) - Who would you rather have in your fridge? Alexa, Cortana, or some as-yet unknown virtual assistant? \nManufacturers of appliances and other products are considering factors such as ease of use and language support as they pick voice technology from what they view as a wide open battle between Alphabet Inc’s Google, Amazon.com Inc and others. \nConsumer demand is surging for the ability to summon music, order food and control lights by voice commands. Amazon.com’s Alexa voice assistant is the early leader and could spur up to $12 billion in Amazon sales in 2020, Stifel, Nicolaus & Co analysts projected this week. \nAmazon and Google combined have sold more than 30 million home speakers with virtual assistants, according to analyst estimates, and the firms are working with hardware partners to get the same software into more devices. \nHardware makers’ varying strategies and decisions, described in interviews with Reuters at this week’s consumer electronics industry’s CES conference in Las Vegas, reflect differing strengths of Google, Amazon and peers. \nGoogle Assistant attracts them with its expertise in answering complex questions, its ability to adapt to different settings and broader language support. Alexa can be used to command more devices, is associated with making purchases, and has become a household name. Microsoft Corp’s Cortana is optimized to work with its services, including Skype. \nApple Inc, whose Siri assistant features on millions of iPhones, has yet to weigh in on the market. \nAssistant makers are scouting for partners and offering technology for free, expecting to capitalize on their brand’s deeper integration into customers’ lives. An advanced microphone can add as little as $8 to the cost of a product, according to chipset maker MediaTek Inc. \nNeither Amazon nor Google is forcing exclusive deals, hardware executives say, with the understanding that consumers may prefer a different assistant in different settings. \nLG Electronics Inc chose Google for televisions it unveiled this week, but opted for Alexa in refrigerators because of its online shopping functionality. FILE PHOTO: An Amazon Dot is shown on top of a Hopper at the Dish Network booth during the 2017 CES in Las Vegas, Nevada January 6, 2017. REUTERS/Steve Marcus/File Photo BIG BRANDS NOT ONLY PLAYERS \nWhen Lenovo Group Ltd decided to create an assistant-enabled screen last summer that would sit on a kitchen counter like a mini-TV, it turned to Google. That was due to a many-year relationship that would help the PC maker get the product in stores fast, said Jeff Meredith, senior vice president for consumer computers and smart devices at Lenovo. \nThe biggest brands are not the only players in voice assistants. FILE PHOTO: A 10-inch Lenovo Smart Display with Google Assistant is shown during Pepcom's Digital Experience in Las Vegas, Nevada, U.S. January 8, 2018. REUTERS/Steve Marcus/File Photo \nTelevision maker TCL Corp is turning to video set top box manufacturer Roku Inc, which makes TCL’s TV operating system and has data on TCL customers that could improve personalization, said Chris Larson, senior vice president for North America at TCL. \nRoku’s assistant will be less complicated than Google or Alexa, and TCL had to stick to one assistant because it would too expensive to support multiple models, Larson added. \nJBL, by comparison, offers several speaker models, each with a different assistant. \nPeople can use a speaker with Cortana for Skype calls and access to their Outlook work calendar, said Michael Mauser, president of lifestyle audio at JBL parent Harman Kardon, a Samsung Electronics Co subsidiary. \nUsers who want multiple speakers find Google’s linking functionality more appealing, he said. \nFord Motor Co’s announced a year ago that Alexa would come to cars. That followed outreach by Amazon, which had seen social media posts about people using the portable Echo Dot smart speaker in their vehicles, said David Limp, Amazon’s senior vice president for devices and services. \n(This version of the story corrects title given by company in paragraph 11.) Reporting by Paresh Dave; Editing by Peter Henderson and Daniel Wallis", "external_links": [], "published": "2018-01-12T23:57:00.000+02:00", "crawled": "2018-01-13T00:12:00.006+02:00", "highlightTitle": ""}