{"organizations": [], "uuid": "891b91adf2d06ddbfb660e9fd138e04965f7939c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222013936&w=1200&r=LYNXMPEE0E01J", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-china-pollution/china-punishes-officials-for-tampering-with-smog-monitoring-idUKKBN1F4036", "country": "US", "domain_rank": 408, "title": "China punishes officials for tampering with smog monitoring", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T02:58:00.000+02:00", "replies_count": 0, "uuid": "891b91adf2d06ddbfb660e9fd138e04965f7939c"}, "author": "", "url": "https://uk.reuters.com/article/uk-china-pollution/china-punishes-officials-for-tampering-with-smog-monitoring-idUKKBN1F4036", "ord_in_thread": 0, "title": "China punishes officials for tampering with smog monitoring", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "xinyu", "sentiment": "none"}, {"name": "jiangxi", "sentiment": "none"}, {"name": "henan", "sentiment": "none"}, {"name": "xinyang", "sentiment": "none"}, {"name": "lee  china", "sentiment": "none"}, {"name": "houhai", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "min read  shanghai", "sentiment": "none"}, {"name": "ministry of environmental protection", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 12:58 AM / Updated 24 minutes ago China punishes officials for tampering with smog monitoring Reuters Staff 3 Min Read \nSHANGHAI (Reuters) - China has punished officials in the provinces of Jiangxi and Henan for tampering with pollution monitoring equipment in order to reduce smog readings, the environment ministry said in a notice on Sunday. A traditional pavilion is seen amid a smog in Beijing's Houhai area, China December 29, 2017. REUTERS/Jason Lee \nChina has been waging a “war on pollution” since 2014 in a bid to reverse the environmental and political damage done by more than three decades of untrammelled economic growth, but enforcement has been a constant problem. \nThe Ministry of Environmental Protection (MEP) said officials in the cities of Xinyu in Jiangxi and Xinyang in Henan, sought to reduce emissions readings by spraying water on their air quality sensors. \nBoth cities are major producers of polluting and energy-intensive nonferrous metals like aluminium and copper. \nThe two local governments said the officials responsible were dismissed or subjected to “administrative” punishments. \n“Regardless of whether they deny deliberately tampering and whether or not it has an obvious impact on emissions data, spraying water on air quality monitoring sampling points... disrupts the normal operations of air quality monitoring,” the ministry said on Sunday. \nThe MEP has tried to establish a real-time nationwide emissions monitoring system to help fight against pollution and ensure its rules are being enforced throughout the country. \nBut it has also been forced to crack down on the widespread falsification of data, with local officials accused of trying to evade responsibility by misusing or disabling monitoring equipment. Some firms have also sought to evade monitoring by operating only at night. \nThe ministry has sought to reduce “administrative interference” in its emissions data by bringing all its 1,436 monitoring stations under central government control and denying local authorities access to the equipment. \nThis isn’t the first time Henan has been castigated for failing to maintain the integrity of its air quality data, with the ministry accusing local firms of providing fraudulent emissions figures in March last year. \nLocal environmental officials in the northwestern city of Xian have also been punished for stuffing sensors with cotton and removing surveillance tapes. Reporting by David Stanway; Editing by Michael Perry", "external_links": [], "published": "2018-01-15T02:58:00.000+02:00", "crawled": "2018-01-15T03:29:32.010+02:00", "highlightTitle": ""}