{"organizations": [], "uuid": "c0f841533c75c4a8a3802197cc68835e4ed0b2ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-david-simonas-twin-capital-management-names-michael-horgan-as-co-chief-investment-officer.html", "country": "US", "domain_rank": 767, "title": "David Simon’s Twin Capital Management Names Michael Horgan as Co-Chief Investment Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.307, "site_type": "news", "published": "2018-01-18T15:45:00.000+02:00", "replies_count": 0, "uuid": "c0f841533c75c4a8a3802197cc68835e4ed0b2ff"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-david-simonas-twin-capital-management-names-michael-horgan-as-co-chief-investment-officer.html", "ord_in_thread": 0, "title": "David Simon’s Twin Capital Management Names Michael Horgan as Co-Chief Investment Officer", "locations": [], "entities": {"persons": [{"name": "michael horgan", "sentiment": "negative"}, {"name": "david simon", "sentiment": "negative"}, {"name": "simon", "sentiment": "none"}, {"name": "horgan", "sentiment": "none"}, {"name": "michael", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "twin capital management", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Twin Capital Management LLC (“Twin”), a New York-based alternative asset manager, announced today that it has named Michael Horgan as Co-Chief Investment Officer. Mr. Horgan will join Twin founder David Simon, in the CIO role overseeing the firm’s event-driven investment strategies, jointly responsible for research, security selection, portfolio construction and risk management.\nMr. Horgan has managed his own carve-out within the firm’s flagship fund for the past three years, demonstrating a track record of consistent returns across a portfolio allocated to merger arbitrage and special situation opportunities.\n“This is a well-earned promotion for Michael,” said Mr. Simon. “He has over a decade of experience in the event-driven space as a research analyst and more recently as a portfolio manager, and throughout his tenure at Twin he has contributed meaningfully to all areas of our investment activities. We are excited for him to step into the role and he has my full support, along with that of the entire firm. I look forward to working alongside him and seeing his continued growth trajectory at Twin.”\nMr. Horgan started his career on Wall Street at Banc of America Securities as an investment banking analyst in 2006. He transitioned to alternative asset management in 2007, joining Satellite Asset Management as an analyst in the risk arbitrage/special situation group. Mr. Horgan joined Twin in early 2009 as an event-driven analyst before moving to Guggenheim Global Trading in 2012, where he held the role of Co-Portfolio Manager of special situation strategies. He rejoined Twin in 2014 as a Senior Vice President of event-driven/special situations, taking on additional responsibilities as portfolio manager of his own carve-out. He graduated from Georgetown University, having spent a year of study at the London School of Economics, with a B.S. in Finance and Accounting.\nAbout Twin Capital Management:\nTwin Capital Management LLC is an alternative investment management firm founded by David Simon in 1988. The firm manages equity-based, event-driven strategies with the goal of consistently producing superior, risk-adjusted, and uncorrelated returns. Twin Capital Management’s investment process is designed to identify, analyze and maximize the upside of opportunities, while minimizing risk.\nPast performance is not indicative of future results. The information contained in this press release does not constitute an offer to sell or the solicitation of an offer to purchase interests in any fund managed by Twin Securities, Inc. Such an offer or solicitation can only be made pursuant to a final offering memorandum, only to investors who meet certain eligibility requirements, and only in those jurisdictions where permitted by law. An investment in a private fund is not appropriate or suitable for all investors and involves the risk of loss, as well as other risks more fully described in the offering memoranda. Twin Securities, Inc. is a registered investment adviser. More information about the adviser can be found in its ADV Part 2, which is available upon request by calling 212-687-6850.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180118005686/en/\nTwin Capital Management LLC\nKevin Gahwyler, 212-687-6850\nkgahwyler@twincap.com\nSource: Twin Capital Management LLC", "external_links": ["http://www.businesswire.com/news/home/20180118005686/en/"], "published": "2018-01-18T15:45:00.000+02:00", "crawled": "2018-01-18T16:30:11.007+02:00", "highlightTitle": ""}