{"organizations": [], "uuid": "33e9c33d5431b208b1146bec70c86694f13097c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-luna-dna-announces-dawn-barry-former-illumina-vp-as-president.html", "country": "US", "domain_rank": 767, "title": "Luna DNA Announces Dawn Barry, former Illumina VP, as President", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T18:00:00.000+02:00", "replies_count": 0, "uuid": "33e9c33d5431b208b1146bec70c86694f13097c1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-luna-dna-announces-dawn-barry-former-illumina-vp-as-president.html", "ord_in_thread": 0, "title": "Luna DNA Announces Dawn Barry, former Illumina VP, as President", "locations": [], "entities": {"persons": [{"name": "luna dna announces dawn barry", "sentiment": "negative"}, {"name": "luna", "sentiment": "negative"}, {"name": "bob kain", "sentiment": "none"}, {"name": "barry", "sentiment": "none"}, {"name": "dawn barry", "sentiment": "none"}, {"name": "johns hopkins", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}], "organizations": [{"name": "illumina", "sentiment": "negative"}, {"name": "stanford health care", "sentiment": "none"}, {"name": "university of michigan", "sentiment": "none"}, {"name": "duke university", "sentiment": "none"}, {"name": "duke health", "sentiment": "none"}, {"name": "ucsf", "sentiment": "none"}, {"name": "pmwc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 15, 2018 /PRNewswire/ -- Luna DNA , the first and only genomic and medical research knowledge base powered by the blockchain and owned by its community, announced today Dawn Barry as president. In this role, Barry will be responsible for leading operations, communicating and implementing company mission, and guiding overall strategy, direction, and growth.\nBarry will present at the 13th Precision Medicine World Conference (PMWC) on January 24, 2018, in Silicon Valley. Her talk will address how Luna DNA will leverage the blockchain for revolutionizing how medical research is conducted. Co-hosted with Stanford Health Care, UCSF, University of Michigan, Duke University, Duke Health, and Johns Hopkins, PMWC will cover disruptive approached and technologies in personalized medicine.\n\"Dawn's many years of experience in strategic development of emerging markets and dedication to genomic discovery make her the ideal fit for the role,\" said Bob Kain, CEO and co-founder, Luna DNA. \"She shares the team's passion for improving human health through community participation to harness the power of the genome.\"\nPreviously, Barry served as the vice president of Applied Genomics at Illumina (NASDAQ: ILMN) where she integrated market development strategies with product and business model innovation to accelerate the application of genomics in medicine and personal healthcare. Barry joined Illumina in 2005 as its first market development specialist and has since held leadership roles in business units, sales, and marketing for the company.\n\"With the intersection of genomics and the blockchain, in addition to the emergence of digital currencies, it became clear this was the time to get involved with a company building something truly unique to the space of medical discovery,\" said Barry. \"I'm thrilled to be joining Luna DNA where we can make a difference not only within communities but globally. Individuals engaging with researchers and being able to own, control and be rewarded for sharing their data is the right thing to do for science and for individuals who have the power to drive healthier communities.\"\nPrior to Illumina, Barry spent seven years at Genaissance Pharmaceuticals, one of the first genomics startups focused on individualized medicine and DNA-based diagnostic testing, with the primary responsibility of promoting clinical genetics testing services for pharmaceutical clinical trials. She holds a BS in biology from the University of Vermont and a MBA from the University of Connecticut School of Business.\nBarry spoke on the topic of sequencing the human genome at TEDxSan Diego and was honored as 2017 Business Woman of the Year by San Diego Business Journal.\nLuna DNA recently announced its launch and Seed funding round close. Following the appointment of Barry as president, Luna DNA plans to build-out its community, which rewards data contributions with Luna Coins, its own unique digital currency.\nAbout Luna DNA\nLuna DNA is the first and only genomic and medical research database powered by the blockchain and owned by its community. A Public Benefit Corporation, Luna DNA enables people to own and share their genomic information for the greater good of the community and medical research. The company is headquartered in San Diego, Calif. and was founded in 2017. Luna DNA encompasses a robust executive leadership team and advisory board, including several Illumina veterans, industry academics, and financial executives.\nFor more information visit www.lunadna.com .\nContact: Saramaya Penacho\nBAM Communications\n208-610-3375\nsaramaya@bamcommunications.biz\nView original content with multimedia: http://www.prnewswire.com/news-releases/luna-dna-announces-dawn-barry-former-illumina-vp-as-president-300582411.html\nSOURCE Luna DNA", "external_links": ["https://www.prnewswire.com/news-releases/first-genomic-platform-powered-by-the-blockchain-raises-2-million-in-funding-backed-by-illumina-veterans-300572865.html", "http://www.pmwcintl.com/2018sv/", "http://www.youtube.com/watch?v=M3SLHhWYxiY", "https://www.illumina.com/introduction.html", "http://www.prnewswire.com/news-releases/luna-dna-announces-dawn-barry-former-illumina-vp-as-president-300582411.html", "http://www.lunadna.com/", "https://www.lunadna.com/"], "published": "2018-01-15T18:00:00.000+02:00", "crawled": "2018-01-15T18:53:04.000+02:00", "highlightTitle": ""}