{"organizations": [], "uuid": "27750d025a7d02712f340efe0ab4fa891401f9a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/rts18bsl.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/03/bitcoin-altcoin-litecoin-ethereum-ripple/", "country": "US", "domain_rank": 1196, "title": "Altcoin Bitcoin Rivals Ripple, Litecoin Catching Up | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.2, "site_type": "news", "published": "2018-01-03T12:44:00.000+02:00", "replies_count": 0, "uuid": "27750d025a7d02712f340efe0ab4fa891401f9a1"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/03/bitcoin-altcoin-litecoin-ethereum-ripple/", "ord_in_thread": 0, "title": "Altcoin Bitcoin Rivals Ripple, Litecoin Catching Up | Fortune", "locations": [], "entities": {"persons": [{"name": "lex sokolin", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "autonomous research llp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 10:44 AM EST \nBitcoin alternatives are closing the gap with the market leader after names like stellar and cardano became red hot as 2017 was closing. \nThe biggest cryptocurrency’s share of market value has fallen to a record 36 percent from 56 percent a month ago, according to CoinMarketCap prices for coins and tokens. Stellar, designed for cross-border payments, has more than doubled in the first trading days of this year, achieving a record market cap of more than $13 billion. \nThat kind of move raises questions as to whether speculators will drive up second-tier digital coins at the expense of bitcoin, even though they have different purposes. The paper value of all cryptocurrencies combined has more than doubled to almost $700 billion in the past month. \n“The altcoins today, in large part, are not trying to be bitcoin competitors,” said Lex Sokolin, global director of fintech strategy at Autonomous Research LLP in London. “They are doing something else entirely — ethereum as a smart-contracts platform, iota as a machine-economy token, ripple for interbank payments, and so on.” How each is used “should become increasingly relevant as the novelty of crypto wears off.” \nRelative performance is now a multibillion-dollar question as professional investors search for ways to value digital assets that seem to defy traditional techniques, such as profit and dividend potential for equities, or industrial-demand outlooks for commodities. Correlation, for example, is one of many technical-analysis tools used across asset classes in forecasting, and altcoins historically have moved mostly in step with bitcoin. \nWhile there were many periods of disparity, on balance the group rose or fell together, a Bloomberg survey of more than 5,000 data points show from CoinMarketCap and CoinCap prices. With bitcoin rivals now making bigger gains, it matters more whether the group continues moving mostly in sync — as they largely have done ever since the early days when enthusiasts were mostly computer programmers and libertarians. \nWhile naysayers insist the crypto market has many signs of a bubble, speculating has been promising for many who bought second-tier coins. Ethereum, the second-largest by market value, has roughly tripled in the last two months. Cardano is up more than 40-fold in the period. That compares with an approximate doubling for bitcoin, which went more mainstream in December by sporting its first U.S. futures contracts. \nBitcoin was little changed on Wednesday and hasn’t gained for two successive days since touching a record high on Dec. 18. \nThe technical shortcomings of bitcoin signal its benchmark status may be taken away someday by a second-generation rival, according to Mike McGlone, a commodity strategist at Bloomberg Industries who likens the market to internet-based companies a few decades ago. \nFor a look at using Bloomberg functions to compare with dot-com bubble, click here. \n“When the frenzy subsides, 2Gs should continue to gain on bitcoin, which has flaws and where futures can be shorted,” McGlone wrote in a note last week. “Ethereum appears prime to assume benchmark status, though bitcoin forks ripple and litecoin are the primary up-and-coming contenders.” \nWith a $216 billion market value on Dec. 31, bitcoin was often the first stop — and maybe the last — for investors who then maybe dabbled in smaller, more volatile tokens. A surge in investor interest typically benefits the smallest more, simply because they have smaller market values, said Spencer Bogart, a partner at Blockchain Capital LLC in San Francisco. \n“This goes both directions though: often when crypto markets are falling you see a rotation out of the long-tail of crypto assets and into bitcoin, the ‘king of crypto,’ which is rightfully perceived to have the most staying power in the ecosystem,” Bogart said. Crypto Party \nAs the crypto party grew bigger, the crashers — blue-suited investors and hedge funds — have purchased mostly bitcoin, and they have different buying criteria than early converts who may have moved on to less-liquid units like dash or monero, according to industry observers. The diluted investor base may weaken the yoke to bitcoin, the biggest by market value, they say. \n“The capital base of these markets is evolving rapidly,” said Kyle Samani, managing partner of Multicoin Capital, a digital-asset hedge fund in Texas. “Before the recent bitcoin bull run, the investor base in crypto was mostly engineers, nerds, and libertarians. ” \nIn the U.S., Samani of Multicoin Capital says he sees a division between what’s on offer at the popular Coinbase exchange, and everything else. \n“Most retail investors are only buying assets available on Coinbase,” he said. “We should continue to see a decoupling between what’s on Coinbase versus other altcoins.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-03T12:44:00.000+02:00", "crawled": "2018-01-03T19:31:12.013+02:00", "highlightTitle": ""}