{"organizations": [], "uuid": "72d5fb57bf79eac32592662397e653e12b020327", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-citi-trends-announces-2017-holiday-sales-results.html", "country": "US", "domain_rank": 767, "title": "Citi Trends Announces 2017 Holiday Sales Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-09T00:05:00.000+02:00", "replies_count": 0, "uuid": "72d5fb57bf79eac32592662397e653e12b020327"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-citi-trends-announces-2017-holiday-sales-results.html", "ord_in_thread": 0, "title": "Citi Trends Announces 2017 Holiday Sales Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comparable store sales increased 4.8% in November/December\nCompany expects fourth quarter EPS to be in a range of $0.40 to $0.45, pending analysis of an expected charge from implementation of the Tax Cuts and Jobs Act\nSAVANNAH, Ga.--(BUSINESS WIRE)-- Citi Trends, Inc. (NASDAQ:CTRN) today reported unaudited sales for the first two months of the fourth quarter of fiscal 2017, in advance of its investor presentation at the ICR Conference on January 9, 2018.\nHoliday Sales – November and December 2017\nTotal sales in the first two months of the fourth quarter of 2017 increased 7.3% to $165.1 million compared with $153.9 million in the same period of 2016. Comparable store sales increased 5.5% in November and 4.5% in December.\nEarnings Forecast for the Fourth Quarter of 2017\nFor the fourth quarter of fiscal 2017, the Company expects diluted earnings per share to be in the range of $0.40 to $0.45 compared with $0.38 in the fourth quarter of fiscal 2016. Such guidance for the quarter assumes sales of approximately $211 million, cost of sales (exclusive of depreciation) of approximately $131 million and selling, general, administrative and depreciation expenses of approximately $72 million. As disclosed previously, this year’s fourth quarter includes a 14 th week that is expected to be break-even from a profit standpoint and also includes an expected increase in incentive compensation and insurance expense from last year’s fourth quarter totaling $1.7 million, which is expected to have a negative effect of approximately $0.09 on this year’s fourth quarter diluted earnings per share in relation to the fourth quarter of last year.\nThe Company is still evaluating the impact of the recent enactment of the Tax Cuts and Jobs Act (the “Act”) on its 2017 financial statements, and the guidance does not reflect a one-time, non-cash charge that is expected to be required in the fourth quarter as a result of the Act. While the Company expects its financial results and cash flows to benefit in future years from the reduction in the federal corporate tax rate pursuant to the Act, the Company anticipates that it will record a charge to decrease the value of its deferred tax assets from the previous 35% federal tax rate to the new 21% rate in the fourth quarter.\nBruce Smith, Acting Chief Executive Officer, commented, “We were very pleased with a 4.8% comparable store sales increase in the first two months of the quarter, which was on top of a 2.9% increase during the same period the previous year. All five of our major merchandise categories continued to contribute to the growth in comparable store sales.\nAs a result of the strong execution by the Citi Trends’ team, we are well positioned to complete our fifth consecutive quarter of comparable store sales increases, which we believe is an indication that our strategic efforts to drive sales in both apparel and non-apparel categories are working. Importantly, we believe these strong sales results have led to high-quality inventory levels as we begin to prepare for the spring selling season.\nFiscal 2017 has been an extremely good year thus far for Citi Trends, as we have built sales momentum, significantly improved earnings and returned $25 million to our stockholders in the form of a share repurchase program. As we move forward, we are very positive about Citi Trends’ future. We believe that continued comparable store sales increases and store unit growth, leading to increased profitability and cash flows, are reasonable expectations for our Company. Importantly, the realization of those goals would allow us to continue to return capital to our stockholders as part of our expanded capital return program announced earlier in 2017. We look forward to providing more details regarding our 2017 fourth quarter results and our 2018 expectations during our March 20, 2018 investor call.”\nAbout Citi Trends\nCiti Trends, Inc. is a value-priced retailer of urban fashion apparel and accessories for the entire family. The Company operates 547 stores located in 31 states. Citi Trends’ website address is www.cititrends.com . CTRN-G\nForward-Looking Statements\nAll statements other than historical facts contained in this news release, including statements regarding our future financial results and position, business policy and plans, objectives of management for future operations, management’s expectations and beliefs, and our intentions and ability to pay dividends and complete any share repurchase authorizations, are forward-looking statements within the meaning of the federal securities laws, including the Private Securities Litigation Reform Act of 1995, that are subject to material risks and uncertainties. The words \"believe,\" \"may,\" \"could,\" \"plans,\" \"estimate,\" \"continue,\" \"anticipate,\" \"intend,\" \"expect\" and similar expressions, as they relate to Citi Trends, are intended to identify forward-looking statements, although not all forward-looking statements contain such language. Statements with respect to earnings guidance are forward-looking statements. Investors are cautioned not to place undue reliance on any forward-looking statements and that any such forward-looking statements are subject to the finalization of the Company’s quarter-end financial and accounting procedures, including the assessment of the impact of the Tax Cuts and Jobs Act, are not guarantees of future performance or results and are inherently subject to risks and uncertainties, some of which cannot be predicted or quantified. Actual results or developments may differ materially from those included in the forward-looking statements as a result of various factors which are discussed in Citi Trends, Inc. filings with the Securities and Exchange Commission. These risks and uncertainties include, but are not limited to, uncertainties relating to economic conditions, growth risks, consumer spending patterns, competition within the industry, competition in our markets, the ability to anticipate and respond to fashion trends and the impact of tax reform and legislation, including the effects of the Tax Cuts and Jobs Act. Any forward-looking statements by the Company, with respect to earnings guidance, future performance or management’s expectations, the Company’s intention to declare and pay dividends, the repurchase of shares pursuant to a share repurchase program, or otherwise, are intended to speak only as of the date such statements are made. Except as required by applicable law, including the securities laws of the United States and the rules and regulations of the Securities and Exchange Commission, Citi Trends does not undertake to publicly update any forward-looking statements in this news release or with respect to matters described herein, whether as a result of any new information, future events or otherwise.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108006491/en/\nCiti Trends, Inc.\nBruce Smith, 912-443-2075\nActing Chief Executive Officer, Chief Operating Officer and Chief Financial Officer\nSource: Citi Trends, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180108006491/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cititrends.com&esheet=51739712&newsitemid=20180108006491&lan=en-US&anchor=www.cititrends.com&index=1&md5=da4a032714d22dd5c29824684b7be0e7"], "published": "2018-01-09T00:05:00.000+02:00", "crawled": "2018-01-09T09:40:27.407+02:00", "highlightTitle": ""}