{"organizations": [], "uuid": "113414fc9848178f8ed1608f65db8946faafc532", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 10, "shares": 10, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221098853&w=1200&r=LYNXMPEE0A0NJ", "site_section": "http://feeds.reuters.com/Reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/uk-britain-eu-farage/brexit-campaigner-farage-says-warming-to-idea-of-second-eu-referendum-to-end-debate-idUSKBN1F016Y", "country": "US", "domain_rank": 408, "title": "Brexit campaigner Farage says warming to idea of second EU referendum to end debate", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T18:41:00.000+02:00", "replies_count": 0, "uuid": "113414fc9848178f8ed1608f65db8946faafc532"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-britain-eu-farage/brexit-campaigner-farage-says-warming-to-idea-of-second-eu-referendum-to-end-debate-idUSKBN1F016Y", "ord_in_thread": 0, "title": "Brexit campaigner Farage says warming to idea of second EU referendum to end debate", "locations": [], "entities": {"persons": [{"name": "farage", "sentiment": "negative"}, {"name": "nigel farage", "sentiment": "negative"}, {"name": "tony blair", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "independence party", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "channel five", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 10:41 AM / Updated 34 minutes ago Brexiteers back second EU referendum to stop 'soft' departure from bloc William James 4 Min Read \nLONDON (Reuters) - Two of Britain’s most prominent Brexit campaigners endorsed a second referendum on leaving the European Union on Thursday as the best way to stop EU supporters from trying to water down, or even halt, the country’s departure from the bloc. \nBritons shocked the political establishment in June 2016 by voting 52 to 48 percent in favour of ending more than four decades of political, economic and legal ties with the EU. \nBut, with the nation still deeply polarised, disillusion over the complexity of withdrawal setting in and pessimism about the economic impact of Brexit rising, many in the fervently anti-EU camp fear an eventual “soft” withdrawal that would keep key ties and foil any clampdown on immigration. \nNigel Farage, a central figure in the “Leave” campaign ahead of the referendum and in its surprise outcome, said he was warming to the idea of holding a second vote to settle the argument on whether leaving was the right decision or not. \n“Maybe, just maybe, I‘m reaching the point of thinking that we should have a second referendum ... on EU membership,” the former leader of the small UK Independence Party told Channel Five’s “The Wright Stuff” show. \n“I think if we had a second referendum on EU membership we’d kill it off for a generation. The percentage that would vote to leave next time would be very much bigger than it was last time round.” \nOpinion polls show little sign of a change of heart among voters. A poll in December showed 51 percent would now keep EU membership and 41 percent wanting out. But pollster BMG said that shift was largely among those who did not vote - notably many young people - in 2016; around nine in 10 “Leave” and “Remain” voters hold fast to their views. \nConservative Prime Minister Theresa May has promised Britain will leave the EU in March 2019 and then enter a roughly two-year transition period for the government to implement new policies on issues such as trade, customs and immigration. \nAsked about Farage’s comments, May’s spokesman said: “We will not be having a second referendum.” FILE PHOTO - Brexit campaigner Nigel Farage leaves a meeting with European Union's chief Brexit negotiator Michel Barnier (unseen) at the EU Commission headquarters in Brussels, Belgium, January 8, 2018. REUTERS/Francois Lenoir \nFollowing Farage’s comments, tycoon Arron Banks, co-founder of the Leave.EU campaign that is credited with mobilising grassroots support for Brexit, also endorsed the idea of a second vote. He said May’s government was failing to deliver the kind of divorce that Britons voted for. \n“If we do not act radically now, we will sleepwalk into a faux Brexit, in name only,” he said in a statement, adding that May had “betrayed the nation”. \n“True Brexiteers have been backed into a corner and the only option now is to go back to the polls and let the people shout from the rooftops their support of a true Brexit.” \nMay, am ex-“Remainer” facing demands by powerful euroceptics in her party for a clean break from the EU, has committed to leaving the bloc’s single market and customs union, and said Britain should be prepared to walk away without an exit deal. \nBut, with business leaders’ alarmed at the spectre of “no deal”, she has made clear this is a last resort and that agreeing a divorce allowing for “frictionless” trade and financial and security links with the EU is the best option. \nMany of the Remain camp in Britain now focus on securing a soft Brexit rather than another referendum but some, including ex-Labour prime minister Tony Blair, say Brexit should be halted to safeguard Britain’s economy and international standing. \nNegotiations on Britain’s future trade relationship with the EU are to start in earnest in the spring. \nA number of lawmakers are arguing for a second public vote on the terms of the exit deal, saying Britons were asked in the 2016 referendum only whether they wanted to leave the EU, not about the conditions of departure. \nSome hardline pro-Brexit groups argue that May has crumbled in negotiations so far by agreeing to pay a 35-39 billion pound divorce bill and seek a staggered withdrawal from the EU. Reporting by William James; editing by Stephen Addison and Mark Heinrich", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T18:41:00.000+02:00", "crawled": "2018-01-11T13:32:42.022+02:00", "highlightTitle": ""}