{"organizations": [], "uuid": "dbfc73b067d54bb6d25374c549b7cf4cfd69dd05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-claires-stores-inc-retains-lazard-to-evaluate-capital-structure-solution.html", "country": "US", "domain_rank": 767, "title": "Claire's Stores, Inc. Retains Lazard to Evaluate Capital Structure Solution", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-23T01:45:00.000+02:00", "replies_count": 0, "uuid": "dbfc73b067d54bb6d25374c549b7cf4cfd69dd05"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-claires-stores-inc-retains-lazard-to-evaluate-capital-structure-solution.html", "ord_in_thread": 0, "title": "Claire's Stores, Inc. Retains Lazard to Evaluate Capital Structure Solution", "locations": [], "entities": {"persons": [{"name": "claire", "sentiment": "none"}, {"name": "ron marshall", "sentiment": "none"}, {"name": "lazard", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "claire's stores, inc", "sentiment": "neutral"}, {"name": "claire's stores, inc.", "sentiment": "neutral"}, {"name": "ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 22, 2018 /PRNewswire/ -- Claire's Stores, Inc. (the \"Company\") today announced that it has retained Lazard as its investment banker to evaluate a capital structure solution for the Company. Lazard's engagement is not related to operations, which remain strong. Claire's continued to record positive same-store consolidated sales growth of 2.7% for the first three quarters of 2017, and improved Adjusted EBITDA, which has grown $20.4 million, or 18.3%. The Company defines Adjusted EBITDA as earnings before income taxes, net interest expense, depreciation and amortization, loss (gain) on early debt extinguishments, and asset impairments. Adjusted EBITDA excludes management fees, severance, the impact of transaction-related costs and certain other items. A reconciliation to Adjusted EBITDA is attached.\nRon Marshall, CEO of the Company, said, \"The steps we are taking now with Lazard will help to ensure Claire's long-term success for years to come. We believe this is the right time to undertake this initiative and we want to assure our vendors, employees and stakeholders that we believe we have ample liquidity to honor our commitments through the completion of this process.\"\nMr. Marshall continued, \"The way consumers shop continues to evolve and we must evolve as well. As part of our 2018 growth plans, we will rollout to 4,000 stores with a large national retail chain and also plan to aggressively grow our online capabilities.\"\nAbout Claire's Stores, Inc.\nClaire's Stores, Inc. is one of the world's leading specialty retailers of fashionable jewelry and accessories for young women, teens, tweens and girls ages 3 to 35. The Company operates through its two store brand names: Claire's® and Icing®. The Company sells its products in 4,220 locations in 45 countries around the world, through company-owned stores, concessions and franchise locations. The Company has been piercing ears since 1978 with over 100 million ears pierced worldwide. More information regarding the Company is available on the Company's corporate website at www.clairestores.com .\nForward-looking Statements\nThis press release contains \"forward-looking statements\" which represent the Company's expectations or beliefs with respect to future events. Statements that are not historical are considered forward-looking statements. These forward-looking statements are subject to certain risks and uncertainties that could cause actual results to differ materially from those anticipated. Those factors include, without limitation: our level of indebtedness; general economic conditions; changes in consumer preferences and consumer spending; unwillingness of vendors and service providers to supply goods or services pursuant to historical customary credit arrangements; competition; general political and social conditions such as war, political unrest and terrorism; natural disasters or severe weather events; currency fluctuations and exchange rate adjustments; failure to maintain our favorable brand recognition; failure to successfully market our products through other channels, such as e-commerce; uncertainties generally associated with the specialty retailing business, such as decreases in mall traffic; disruptions in our supply of inventory; inability to increase same store sales; inability to renew, replace or enter into new store leases on favorable terms; increase in our cost of merchandise; significant increases in our merchandise markdowns; inability to grow our company-operated store base, expand our international store base through franchise or similar licensing arrangements or expand our store base through store concessions; inability to design and implement new information systems; data security breaches of confidential information or other cyber attacks; delays in anticipated store openings or renovations; results from any future asset impairment analysis; changes in applicable laws, rules and regulations, including laws and regulations governing the sale of our products, particularly regulations relating to heavy metals and chemical content in our products; changes in anti-bribery laws; changes in employment laws, including laws relating to overtime pay, tax laws and import laws; product recalls; increases in the costs of healthcare for our employees; increases in the cost of labor; labor disputes; loss of key members of management; increases in the cost of borrowings; unavailability of additional debt or equity capital; and the impact of our substantial indebtedness on our operating income and our ability to grow. These and other applicable risks, cautionary statements and factors that could cause actual results to differ from the Company's forward-looking statements are included in the Company's filings with the SEC, specifically as described in the Company's Annual Report on Form 10-K for the fiscal year ended January 28, 2017 filed with the SEC on April 14, 2017. The Company undertakes no obligation to update or revise any forward-looking statements to reflect subsequent events or circumstances. The historical results contained in this press release are not necessarily indicative of the future performance of the Company.\nNet (Loss) Income Reconciliation to Adjusted EBITDA\nAdjusted EBITDA represents net (loss) income, adjusted to exclude income taxes, interest expense and income, depreciation and amortization, loss (gain) on early debt extinguishments, asset impairments, management fees, severance and transaction related costs, and certain non-cash and other items. We use Adjusted EBITDA as an important tool to assess our operating performance. We consider Adjusted EBITDA to be a useful measure in highlighting trends in our business. We reinforce the importance of Adjusted EBITDA with our bonus eligible associates by using this metric in our annual performance bonus program. We believe that Adjusted EBITDA is effective, when used in conjunction with net (loss) income, in evaluating asset performance, and differentiating efficient operators in the industry. Furthermore, Adjusted EBITDA is defined in the covenants contained in our debt agreements and it is the metric we use to communicate our financial performance to our debt investors.\nAdjusted EBITDA is not a measure of financial performance under GAAP, and is not intended to represent cash flow from operations under GAAP and should not be used as an alternative to net (loss) income as an indicator of operating performance or to represent cash flow from operating, investing or financing activities as a measure of liquidity. We compensate for the limitations of using Adjusted EBITDA by using it only to supplement our GAAP results to provide a more complete understanding of the factors and trends affecting our business. Adjusted EBITDA has its limitations as an analytical tool, and you should not consider it in isolation or as a substitute for analysis of our results as reported under GAAP.\nSome of the limitations of Adjusted EBITDA are:\nAdjusted EBITDA does not reflect our cash used for capital expenditures; Although depreciation and amortization are non-cash charges, the assets being depreciated or amortized often will have to be replaced and Adjusted EBITDA does not reflect the cash requirements for such replacements; Adjusted EBITDA does not reflect changes in, or cash requirements for, our working capital requirements; and Adjusted EBITDA does not reflect the cash necessary to make payments of interest or principal on our indebtedness.\nWhile Adjusted EBITDA is frequently used as a measure of operations and the ability to meet indebtedness service requirements, it is not necessarily comparable to other similarly titled captions of other companies due to potential inconsistencies in the method of calculation.\nCLAIRE'S STORES, INC. AND SUBSIDIARIES\nADJUSTED EBITDA\n(UNAUDITED)\n(In Thousands)\nThree Months\nEnded\nOctober 28, 2017\nThree Months\nEnded\nOctober 29, 2016\nNine Months\nEnded\nOctober 28, 2017\nNine Months\nEnded\nOctober 29, 2016\nNet (loss) income\n$ (15,545)\n$ 150,578\n$ (42,791)\n$ 79,743\nIncome tax expense (benefit)\n1,758\n(749)\n3,878\n(888)\nInterest expense\n43,243\n47,112\n130,231\n157,828\nInterest income\n(14)\n(11)\n(28)\n(25)\nImpairment of assets (a)\n―\n142,271\n―\n142,271\nGain on early debt extinguishment\n(b)\n―\n(317,323)\n―\n(317,323)\nDepreciation and amortization\n10,755\n14,061\n32,848\n41,917\nAmortization of intangible assets\n1,315\n683\n3,177\n2,054\nStock compensation, book to cash\nrent (c)\n208\n(251)\n(364)\n(1,613)\nManagement fee, consulting (d)\n77\n1,010\n1,424\n2,750\nOther (e)\n638\n(419)\n3,256\n4,567\nAdjusted EBITDA\n$ 42,435\n$ 36,962\n$ 131,631\n$ 111,281\na)\nRepresents estimated impairment charges recorded in connection with the Company's assessment of impairment of\ngoodwill and other indefinite-lived intangible assets.\nb)\nIncludes gain on early debt extinguishment in connection with the completion of a private exchange of notes for term\nloan debt and write-off of unamortized debt financing costs associated with the refinancing of the former U.S Credit\nFacility.\nc)\nIncludes: non-cash stock compensation expense, net non-cash rent expense, amortization of rent free periods, the\ninclusion of cash landlord allowances, and the net accretion of favorable (unfavorable) lease obligations.\nd)\nIncludes: the former management fee paid to Apollo Management and Cowen Group, Inc. and non-recurring consulting\nexpenses.\ne)\nIncludes: non-cash losses on property and equipment primarily associated with remodels, relocations and closures and\nnon-cash asset write-offs; other payments associated with store closures; costs, including third party charges,\ncompensation, incurred in conjunction with the relocation of new employees; non-cash foreign exchange gains/losses\nresulting from intercompany transactions and remeasurements of U.S. dollar denominated cash accounts of our foreign\nentities into their functional currency; store pre-opening costs; and severance and transaction related costs.\nView original content: http://www.prnewswire.com/news-releases/claires-stores-inc-retains-lazard-to-evaluate-capital-structure-solution-300586296.html\nSOURCE Claire’s Stores, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/claires-stores-inc-retains-lazard-to-evaluate-capital-structure-solution-300586296.html", "http://www.clairestores.com/"], "published": "2018-01-23T01:45:00.000+02:00", "crawled": "2018-01-23T04:04:32.002+02:00", "highlightTitle": ""}