{"organizations": [], "uuid": "0606fc8edbfadaf84d63ac02b4fb920ae79240f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/30/the-associated-press-tesla-seeks-its-own-wisconsin-dealerships-to-teach-customers.html", "country": "US", "domain_rank": 767, "title": "Tesla seeks its own Wisconsin dealerships to teach customers", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T16:46:00.000+02:00", "replies_count": 0, "uuid": "0606fc8edbfadaf84d63ac02b4fb920ae79240f9"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/30/the-associated-press-tesla-seeks-its-own-wisconsin-dealerships-to-teach-customers.html", "ord_in_thread": 0, "title": "Tesla seeks its own Wisconsin dealerships to teach customers", "locations": [], "entities": {"persons": [{"name": "tesla", "sentiment": "negative"}, {"name": "chang sai", "sentiment": "none"}, {"name": "jonathan chang", "sentiment": "none"}], "locations": [{"name": "madison", "sentiment": "none"}, {"name": "wis.", "sentiment": "none"}, {"name": "tesla", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}, {"name": "palo alto", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "state assembly", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MADISON, Wis. (AP) — Tesla officials pressed Wisconsin legislators Tuesday to let them to establish their own dealerships in the state, saying the company needs direct contact with customers to teach them about the electric vehicles' technology.\nThe Palo Alto, California-based company sells its vehicles online and through its own dealerships using its own employees. Nearly two dozen states have Tesla stores, but Wisconsin law prohibits automakers from directly operating or controlling a dealership. A group of Republican lawmakers has introduced a bill that would exempt Tesla from that law, permitting the company to open its own retail shops.\nTesla attorney Jonathan Chang told the state Assembly and Senate transportation committees during a packed public hearing on the bill that driving a Tesla requires dramatic changes in driving habits. Franchise dealers lack the knowledge to educate customers about how to use the cars' technology properly, he said, claiming they often tuck electric cars away in the corner and direct customers away from them.\n\"It's really a culture shift,\" Chang said. \"Franchise dealers aren't able to sell these cars. Dealers aren't willing to invest that time. We're not here to overturn the franchise system. It sells internal combustion engines well. But the law shouldn't be used to block new companies from entering the free market.\"\nRepresentatives from the Wisconsin Automobile and Truck Dealers Association pushed back, saying the bill would signal the beginning of the end of franchise dealers.\nCar makers will create subsidiaries to sell electric cars exclusively so they can sell them directly, Bill Sepic, the association's president, told the committees. Tesla should sell its vehicles through traditional franchise dealerships like everyone else, he said. Allowing the company to set up its own dealerships could expose the state to unfair trade practice lawsuits by an established automaker, he warned\n\"Is it worth destroying a thriving, dependable industry?\" Sepic said.\nTesla owners told the committees they're tired of driving hundreds of miles to Tesla dealerships in Minneapolis and Chicago to buy and service their vehicles. Phil Levin, a 29-year-old videographer from Madison, said he will have to make a 300-mile round trip to Chicago to pick up his new Model 3.\n\"I just wish it was something we could buy in our home state,\" he said. \"It's a shame we have dozens of dealerships with Japanese and German cars in our state, but we ban high-tech cars manufactured right here in America.\"\nThe bill's chief Senate sponsor, Republican Chris Kapenga of Delafield, told the committees that fears of electric vehicles crowding out traditional gas-powered engines are unfounded.\n\"The facts are we have a Fortune 500 company who wants to do business here,\" he said. \"The principle of free market and government is what we're debating here.\"\nThe WATDA's Sepic rejected that notion.\n\"This bill is not about free enterprise,\" he said. \"This bill isn't about access. We're not prohibiting ownership. Are we even prohibiting the lawful sale of these vehicles? This bill isn't about jobs or economic development, either. It's a job killer.\"\nThe bill is AB 717/SB 605.\nThis story has been updated to correct the Tesla model Phil Levin ordered. He purchased a Model 3, not a Model S.\nFollow Todd Richmond on Twitter at https://twitter.com/trichmond1", "external_links": [], "published": "2018-01-30T16:46:00.000+02:00", "crawled": "2018-01-30T23:11:49.035+02:00", "highlightTitle": ""}