{"organizations": [], "uuid": "bb0db08374e74e0aee90503cf738bce3af75e48d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225312989&w=1200&r=LYNXMPEE0P00I", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-costa-rica-election/evangelical-tied-with-major-party-candidate-in-costa-rica-race-poll-idUKKBN1FF00F", "country": "US", "domain_rank": 408, "title": "Evangelical tied with major party candidate in Costa Rica race - poll", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T02:06:00.000+02:00", "replies_count": 0, "uuid": "bb0db08374e74e0aee90503cf738bce3af75e48d"}, "author": "", "url": "https://uk.reuters.com/article/uk-costa-rica-election/evangelical-tied-with-major-party-candidate-in-costa-rica-race-poll-idUKKBN1FF00F", "ord_in_thread": 0, "title": "Evangelical tied with major party candidate in Costa Rica race - poll", "locations": [], "entities": {"persons": [{"name": "alvarado", "sentiment": "none"}, {"name": "fabricio alvarado", "sentiment": "none"}, {"name": "antonio alvarez", "sentiment": "none"}, {"name": "antonio alvarez desanti", "sentiment": "none"}, {"name": "alvarez", "sentiment": "none"}], "locations": [{"name": "costa rica", "sentiment": "none"}, {"name": "san jose", "sentiment": "none"}, {"name": "central america", "sentiment": "none"}], "organizations": [{"name": "national liberation party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "opol consultores", "sentiment": "none"}, {"name": "national restoration party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 12:08 AM / Updated 11 minutes ago Evangelical tied with major party candidate in Costa Rica race - poll Reuters Staff 2 Min Read \nSAN JOSE (Reuters) - A conservative Christian evangelical from a tiny party and the candidate of one of Costa Rica’s main political groups are leading the field ahead of the first round of the country’s presidential election next month, a poll showed on Thursday. \nJournalist Fabricio Alvarado, the only lawmaker from the evangelical National Restoration party, was effectively tied with Antonio Alvarez, from the conservative National Liberation Party (PLN), according to the poll from OPol Consultores. \nThe 43-year-old Alvarado had 13.8 percent of support compared to 13.4 percent for Alvarez among a field of 13 candidates for the Feb. 4 vote, the poll showed. \nCoffee-producing Costa Rica, one of Central America’s more prosperous and stable nations, had been ruled by a two-party dynasty for decades until an upset in the 2014 vote, won by a center-left academic who had never held elected office. Antonio Alvarez Desanti, presidential candidate of the National Liberation Party, is seen before an interview with journalists, in San Jose, Costa Rica January 23, 2018. REUTERS/Juan Carlos Ulate \nThe poll tallied with others that showed Alvarez enjoying a meteoric rise after he opposed a January ruling by the Costa Rica-based Inter-American Court of Human Rights that called for same-sex marriage to be legalized in Latin America. \nThe poll was based on 3,270 face-to-face interviews carried out between Jan. 22 and Jan. 24, OPol Consultores said, and had a margin of error of 1.7 percentage points. \nSome 25 percent of voters said they were undecided. All the candidates were far from the 40 percent minimum needed to win in the first round. Without an outright winner, the two best-placed candidates would head to a run-off in early April. \nConservative lawyer Juan Diego Castro was in third place with 10.7 percent while the candidate from the ruling Citizens’ Action Party (PAC), Carlos Alvarado, had only 5 percent support. \nIncumbent President Luis Guillermo Solis is barred from seeking immediate re-election under Costa Rican law. Reporting by Enrique Andres Pretel; Editing by Daniel Wallis", "external_links": [], "published": "2018-01-26T02:06:00.000+02:00", "crawled": "2018-01-26T02:21:34.002+02:00", "highlightTitle": ""}