{"organizations": [], "uuid": "7aa7834745e91ca4922bf46bb4db15a2fcb0b2c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1226057181&w=1200&r=LYNXMPEE0R0OM", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-trade-nafta/canada-pm-opposition-wants-to-give-into-u-s-demands-on-nafta-idUSKBN1FH0QZ", "country": "US", "domain_rank": 408, "title": "Canada PM: Opposition wants to give into U.S. demands on NAFTA", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T18:26:00.000+02:00", "replies_count": 0, "uuid": "7aa7834745e91ca4922bf46bb4db15a2fcb0b2c9"}, "author": "", "url": "https://www.reuters.com/article/us-trade-nafta/canada-pm-opposition-wants-to-give-into-u-s-demands-on-nafta-idUSKBN1FH0QZ", "ord_in_thread": 0, "title": "Canada PM: Opposition wants to give into U.S. demands on NAFTA", "locations": [], "entities": {"persons": [{"name": "justin trudeau", "sentiment": "none"}, {"name": "david ljunggren", "sentiment": "none"}, {"name": "trudeau", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "ottawa", "sentiment": "none"}, {"name": "montreal", "sentiment": "none"}], "organizations": [{"name": "nafta", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "min read  montreal", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "afta", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 4:26 PM / Updated 2 minutes ago U.S. trade chief sees hope for NAFTA talks, says congressman David Lawder , David Ljunggren 3 Min Read \nMONTREAL (Reuters) - U.S. Trade Representative Robert Lighthizer is hopeful about talks to renegotiate the North American Free Trade Agreement but realizes a great deal of work remains, Republican U.S. Congressman Dave Reichert said on Sunday after a briefing. \nOfficials from the United States, Canada and Mexico will wrap up the sixth of seven planned rounds of talks on NAFTA in Montreal on Monday, with little sign of agreement on U.S. proposals to overhaul the $1.2 trillion pact. \nThe United States is open to the idea of extending the NAFTA talks, Reichert indicated after a briefing from Lighthizer in Montreal. The negotiations are supposed to wrap up by the end of March. \n“From trying to evaluate his words today, I would say he (Lighthizer) recognizes there’s a great deal of work to be done, but he’s hopeful,” said Reichert, chairman of the House Ways and Means Committee’s subcommittee on trade. \nU.S. President Donald Trump, who blames the 1994 treaty for job losses and a big trade deficit with Mexico, has repeatedly threatened to withdraw unless major changes are made. Markets have been nervous about the potential economic turmoil. \nWith the slow progress so far, Lighthizer, Canadian Foreign Minister Chrystia Freeland and Mexican Economy Minister Ildefonso Guajardo will meet in Montreal on Monday to review what has been achieved. \nSpeaking separately, Democratic Congressman Sander Levin told reporters in Montreal he was sure the United States would stay in the talks. FILE PHOTO - Canadian Prime Minister Justin Trudeau looks on during a news conference at the Great Hall of the People in Beijing, China December 4, 2017. REUTERS/Fred Dufour/Pool \nLighthizer could not be reached after the lawmakers’ comments. \nOfficials say that if the three conclude the process should continue, an additional round of talks will start in Mexico on Feb. 26. Slideshow (3 Images) \nThe talks are scheduled to finish by the end of March to avoid clashing with Mexico’s presidential election in July. Mexican officials now suggest the deadline could be extended. \n“We believe it’s more important to get a quality agreement than to tailor the negotiations to a strict timeline,” said Reichert. \nA senior source close to the talks told reporters late Saturday that “the United States needs to show flexibility” when it comes to its major proposed reforms to NAFTA. \n“Do we feel optimistic? I would say cautiously so,” added the source, who spoke on the condition of anonymity. \nChief negotiators had the day off on Sunday. With additional reporting by Anthony Esposito in Montreal; Editing by Lisa Von Ahn and Jeffrey Benkoe", "external_links": [], "published": "2018-01-28T18:26:00.000+02:00", "crawled": "2018-01-28T18:36:02.011+02:00", "highlightTitle": ""}