{"organizations": [], "uuid": "095b28d6ab1be586d9029f68fad99dcafb74c73e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/esure-group-ceo/update-1-uks-esure-ceo-steps-down-finance-chief-at-helm-in-interim-idUSL8N1PE10S", "country": "US", "domain_rank": 408, "title": "REFILE-UPDATE 2-UK's esure CEO steps down, finance chief at helm in interim", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T15:45:00.000+02:00", "replies_count": 0, "uuid": "095b28d6ab1be586d9029f68fad99dcafb74c73e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/esure-group-ceo/update-1-uks-esure-ceo-steps-down-finance-chief-at-helm-in-interim-idUSL8N1PE10S", "ord_in_thread": 0, "title": "REFILE-UPDATE 2-UK's esure CEO steps down, finance chief at helm in interim", "locations": [], "entities": {"persons": [{"name": "noor zainab hussain", "sentiment": "none"}, {"name": "peter wood", "sentiment": "none"}, {"name": "stuart vann", "sentiment": "none"}, {"name": "darren ogden", "sentiment": "none"}, {"name": "ben martin", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}], "organizations": [{"name": "investec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Fixes typographical errors and files to additional subscribers)\n* CEO steps down with immediate effect\n* Founder Peter Wood to take a more active role\n* New CEO could be insurance outsider- interim CEO\nBy Noor Zainab Hussain and Ben Martin\nJan 19 (Reuters) - The boss of Britain’s esure has stepped down with immediate effect in an abrupt move that will see founder Peter Wood take a more active role as the motor insurer hunts for a replacement, possibly from outside the industry.\nShares in esure rose 0.6 percent to 246.4 pence at 1027 GMT on Friday, helped by a trading update accompanying the announcement that an Investec analyst said was at the top of previous guidance.\nStuart Vann, who had been with the company 17 years and chief executive since 2012, was leaving by mutual consent and would be replaced on an interim basis by finance head Darren Ogden, esure said in a statement.\nThe business added that it was looking for a permanent successor and that Wood, its chairman and biggest shareholder who founded the insurer in 2000, would have more involvement in running the company to support Ogden, esure said.\nThe firm provides insurance to drivers and home owners in Britain. Under Vann, it floated its price comparison website, Gocompare.com, on the London Stock Exchange in 2016.\nVann and the board decided on his exit as the firm seeks to develop its longer term strategy for what it described as “an increasingly digital and data driven world”, esure said.\nWood’s increased involvement at esure comes after media reports in September that the founder was seeking a buyer for his 30.7 percent controlling stake, although a deal has not materialised.\n“The stepping down of the CEO with immediate effect and no signs of any trading mishaps indicates a possible fallout with the chairman and major shareholder,” said analysts at Barclays, adding a potential sale of Wood’s interest was a possible cause.\nOgden declined to comment on the share sale reports on Friday. Asked by Reuters if a potential stake disposal by Wood had driven Vann’s departure, Ogden reiterated that the firm’s desire to prepare for technological change was the reason.\n“The appointment of an outsider to the insurance sector with a strong consumer facing and digital distribution/data analytics background should not be ruled out,” said Andreas van Embden, an analyst at Peel Hunt, which is a corporate broker to esure.\nOgden said Vann was now on “gardening leave”, meaning he was no longer at work but still on the payroll, but would be available to the company if needed.\n“I’ve been with the company fifteen years, been CFO for over six years and I‘m providing the continuity,” Ogden told Reuters.\nWhen asked who might replace Vann, Ogden said: “The way the world is developing, we feel it’s more likely to be someone outside the insurance industry.”\nThe insurer posted a 25 percent increase in gross written premiums to 820 million pounds for 2017 and reported pretax profits would be between 30 to 35 percent higher at between 95 million pounds to 98 million pounds.\nBritain’s motor insurers have been helped by rising demand and legal changes that have raised the cost of motor insurance.\nReporting by Noor Zainab Hussain in Bengaluru and Ben Martin in London; Editing by Edmund Blair/Keith Weir\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T15:45:00.000+02:00", "crawled": "2018-01-20T17:31:54.003+02:00", "highlightTitle": ""}