{"organizations": [], "uuid": "33c2eb2cfe3a0c5f527d6abfe325a4f62971a98b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-owl-creek-issues-letter-to-brunswick-corporation-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Owl Creek Issues Letter to Brunswick Corporation Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T17:02:00.000+02:00", "replies_count": 0, "uuid": "33c2eb2cfe3a0c5f527d6abfe325a4f62971a98b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-owl-creek-issues-letter-to-brunswick-corporation-board-of-directors.html", "ord_in_thread": 0, "title": "Owl Creek Issues Letter to Brunswick Corporation Board of Directors", "locations": [], "entities": {"persons": [{"name": "creek", "sentiment": "none"}], "locations": [{"name": "brunswick", "sentiment": "none"}], "organizations": [{"name": "brunswick corporation board of directors owl creek", "sentiment": "negative"}, {"name": "brunswick", "sentiment": "negative"}, {"name": "ebitda", "sentiment": "none"}, {"name": "owl creek", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Owl Creek believes that all Brunswick stakeholders would benefit significantly from a spin-off of the fitness equipment business from the marine engine and boat manufacturing businesses\nOwl Creek believes that the marine segment on a stand-alone basis is worth more than the current valuation for all of Brunswick, implying the market assigns negative value to the fitness segment\nOwl Creek estimates that over 50% of the marine segment EBITDA is from aftermarket parts and accessories – a high quality and low cyclicality business that should command a premium valuation multiple\nOwl Creek believes that a separately traded fitness business would command a public market premium\nOwl Creek applauds Brunswick’s board and management team for their ongoing efforts to create value for shareholders, and believes that Brunswick’s board will review the spin-off of the fitness business in the near-term at upcoming Board meetings\nOwl Creek believes that Brunswick’s board has already begun the process of adding new directors in the ordinary course of business\nOwl Creek urges Brunswick to de-stagger the board resulting in annual elections for all directors\nNEW YORK--(BUSINESS WIRE)-- Investment funds advised by Owl Creek Asset Management, L.P. (“Owl Creek”) have acquired a meaningful ownership stake in Brunswick Corporation (“Brunswick” or the “Company”)(NYSE: BC), an American corporation that develops, manufactures and markets a wide variety of products, and today Owl Creek publicly released the following letter to the Board of Directors (the “Board”) of the Company:\nBoard of Directors Brunswick Corporation 26125 N. Riverwoods Blvd Suite 500 Mettawa, IL 60045 January 30, 2018\nDear Board of Directors:\nAs you are aware, investment funds advised by Owl Creek Asset Management, L.P. (“Owl Creek” or “we”) are shareholders of Brunswick Corporation (“Brunswick” or “the Company”) and beneficially own 2.5 million shares, or approximately 2.8% of the Company’s outstanding common equity. We have shared with you our view that Brunswick shares are significantly undervalued, and over the last month have been engaged in a constructive dialogue with the management team regarding ways to create incremental value for all Brunswick stakeholders. We are writing this letter to provide an overview of our discussions to date, as well as to update the Board on our current thoughts on the business and the way forward.\nOur discussions to-date have centered on three main areas of focus: (1) an immediate review of a spin-off of the Company’s fitness equipment segment; (2) the operating performance of the various business units; and (3) the potential for the shareholders to elect new directors who possess relevant experience in addressing the challenges and opportunities facing the Company at the 2018 annual meeting of shareholders.\nAt the core of our dialogue has been our strong view that all Brunswick stakeholders would benefit significantly from a spin-off of the fitness equipment business (“Fitness”) from the marine engine and boat manufacturing businesses (“Marine”) .\nSimilar to what we have shared with you recently, our thought process in support of a spin-off of Fitness is summarized below:\n1) Reduce conglomerate discount: Brunswick is currently valued in the market at a significant discount to the combined value of Marine and Fitness if they were independently traded. In fact, we believe that Marine on a stand-alone basis is worth more than the current stock market valuation for all of Brunswick, implying that the market is assigning negative value to Fitness . The conglomerate discount exists because there is no natural shareholder for both Marine and Fitness, and because of the complexity of analyzing the two businesses on a combined basis. Certain market participants would invest in a leading boat and marine engine franchise, but do not want to invest in or spend time analyzing a fitness equipment business. This is highlighted by the significant negative price reaction of Brunswick stock after the recent third quarter results, as well as the material underperformance of Brunswick shares vs. both peers and the S&P 500 index last year, despite strong overall performance in Marine. Similarly, there are investors that are bullish on health and wellness trends globally but Brunswick is not an efficient vehicle to invest in this theme despite having the largest fitness equipment manufacturer in the world because Fitness comprises only ~20% of consolidated EBITDA.\na. Brunswick is valued at discount to relevant marine comparables: Despite having a higher quality business with better growth prospects than almost all of its peers, Brunswick is valued at a significant discount. Below we provide several data points to highlight the extent of the current discount that the market is assigning to Brunswick.\ni. Brunswick currently has one of the lowest valuations of 19 publicly traded companies that we identified across boat manufacturing, engine manufacturing, powersports and leisure. 1 Relative to the median valuations for the group, Brunswick trades at a discount of ~30% on 2017E P/E, ~15% on 2017E EV/EBITDA, ~20% on 2018E P/E, and ~20% on 2018E EV/ EBITDA.\nii. Brunswick trades at a discount to all three publicly traded boat manufacturers (Malibu Boats, Marine Products Corp and MCBC Holdings) and about a 25% discount to the average P/E and EV/EBITDA multiple. Boat manufacturing is by far the most cyclical and competitive business in which Brunswick operates. The fact the Brunswick is trading at a substantially lower multiple than peers to its lowest quality business serves to highlight the extent of the conglomerate discount.\nb. Brunswick is valued at a discount to other powersports and engine manufacturing businesses, including those with significantly lower quality earnings streams. This includes those with minimal aftermarket parts sales, and those with flat or negative growth and margin pressure due to competitive and structural challenges.\nc. Brunswick trades at a significant discount to the best fitness comparable:\ni. Brunswick, with its Life Fitness, Cybex, Hammer Strength and Scifit brands is the market leader globally in commercial fitness equipment. Of the three major commercial fitness equipment competitors, we believe Technogym (TGYM IM) is the best comparable, as it is publicly listed and only manufactures fitness equipment.\nii. Technogym is valued at 28x 2018E P/E and 16x 2018E EV/EBITDA, or roughly 100% higher than Brunswick Corporation. It has a $2.5B Enterprise value despite being projected to generate revenue of about $750M in 2017, or over 25% less than Brunswick’s fitness business. Although recently Technogym has exhibited better growth and margin trends than Brunswick, we believe that Brunswick’s fitness business has the potential to perform as well or better than Technogym if it is able to improve execution.\niii. We believe that a separately traded fitness business could command a public market premium vs. other businesses with similar market positions and growth characteristics, as it could provide investors with an excellent vehicle to invest in global health and wellness growth trends. There are few ways to do this in the public markets currently.\n2) Improve overall operational execution through greater management focus and incentives: We believe that a separation of Marine and Fitness, which would create two independent management teams and boards, would very likely sharpen the strategy, execution and culture for each of the businesses. There would be more time and resources for the teams to focus on their respective businesses. It would also enable the businesses to provide direct, share-based incentives to each of the management teams.\na. We believe this to be particularly true in Fitness, where there are significant growth opportunities as greater health awareness drives increased exercise demand, and technology opens up new ways to engage workout participants as well as new revenue opportunities. In addition, developing markets, and China in particular, have massive growth potential over the next ten years, as gym membership penetration is growing rapidly but still a small fraction of that in developed markets. Without improved execution Brunswick runs the risk of missing out on these tremendous opportunities. An independent publicly traded fitness business would have improved operations, as the management team would be more focused, and more directly aligned with business performance through share compensation. For example, we believe that the integration of Cybex could have benefitted from greater management and Board focus. Lastly, a separation would likely create a greater culture of accountability and improve employee retention and recruitment.\nb. In addition, after a separation, the Board and management team would be free to focus 100% of their time on Marine and not be distracted or “spread too thin” because of Fitness. This will enable the Company to better maximize the potential of the engine and boat businesses.\n3) Enhanced M&A opportunities and improved cost of capital for both businesses: A separation would allow both Marine and Fitness to pursue independent M&A strategies, and acquisitions would be more impactful to each business. This is particularly true for Fitness, where we believe there is a significant M&A opportunity in certain niche fitness products as well as in the high margin rehab equipment market. As it stands, currently incremental bolt-on acquisitions in Fitness do not move the needle significantly for Brunswick as a whole and so are less likely to justify management and board time. Secondly, the independent businesses would garner a lower cost of capital which would also open the door to more accretive deal opportunities.\n4) No reasons to not separate the businesses: There is no material connection between Fitness and Marine, and we believe that the separation could be completed with minimal business disruption or additional cost. The only primary connection articulated by management is the ability to share human capital across the businesses. This is a relatively weak “synergy” and as discussed above, we believe separate businesses and publically traded stock would improve the ability to recruit and retain talent in each of the respective businesses.\n5) Now is the right time to execute the spin: We believe that now is an excellent time to execute on this transaction, as continuing to delay it only slows the process of reducing the conglomerate discount, and increases the risk of operational missteps. The marine trends are strong, and we believe will continue to be strong for the foreseeable future as boat sales remain well below scrappage rate. In addition, the passage of the tax plan should help to accelerate economic growth and boating demand. Now is the time to capitalize on these favorable trends and cyclical tailwinds for the benefit of shareholders. Furthermore, the longer these businesses remain together, the greater the chance is that the company’s overall execution is less than optimal, which directly harms all stakeholders in the business.\nIn addition, we estimate that over 50% of the Marine EBITDA is derived from the manufacturing and distribution of aftermarket parts and accessories, which is a high-quality revenue and earnings stream with significant pricing power and relatively low cyclical exposure. A spin-off of Fitness and more detailed segment disclosure at Marine would showcase this aftermarket business to market participants, which we believe would significantly improve Brunswick’s valuation.\nIn addition to the spin-off of Fitness, we have also discussed the operating performance in the boat manufacturing segment, and while we agree with the decision to sell Sea Ray, the boat manufacturing margins remain below peers and should be an area of continued focus by management and the Board.\nWe also discussed the Company’s corporate overhead costs, which are currently about $80 million per year and almost entirely comprised of holding company costs (headquarter costs, senior management salaries, board costs, audit and public company costs, etc.). This figure appears to benchmark higher than peers of similar size. We are encouraged that the Company has recently moved to a smaller corporate headquarters, partially to reduce costs, and we think the Board’s continued focus on reducing costs at the corporate level will create value going forward.\nFinally, we discussed the possibility of adding new directors at the upcoming shareholder meeting, as we believe Brunswick could benefit from new board members with recent expertise in creating significant shareholder value through spin-offs and divestitures, as well as experience in the fitness industry. We believe the Company currently lacks depth of board members with recent experience in these key areas that are so important to Brunswick today. These additions would further align the Board with its current needs and help to restore shareholder confidence after underperformance and missed expectations over the last several years.\nAfter significant discussion and deliberation, Owl Creek has chosen NOT to nominate Board members for the 2018 annual meeting ahead of the Company’s February 2 nomination deadline for the following reasons:\n1) We believe the management team and the Board will carefully evaluate a Fitness spin-off in the near-term, and we applaud management for indicating that it will include a discussion on this topic at its upcoming Board meeting in mid-February 2018.\n2) We believe that the Company will look for other ways to improve shareholder value, including reducing corporate costs and optimizing the boat margins.\n3) Brunswick has informed us that it is currently undergoing a search for new board members to replace the two members that will soon reach the 75-year-old age limit in the Board’s governance guidelines. While the Company has indicated that it is open to our suggestions for potential new board members, we have not come to any agreement or understanding on this topic. We do hope that management and the Board will take our suggestions seriously and are happy to see that this process has already begun.\n4) We believe that a proxy contest would consume Company resources, and potentially distract the Board and the Company during their on-going process to improve stakeholder value, including the separation of Marine and Fitness.\nWhile we are encouraged by our dialogue to date and have thus decided there is no need for a distracting proxy contest, we do strongly urge the Company to include a proposal in its 2018 proxy statement to de-stagger the Board so that all of the Company’s directors will be elected annually. This would afford shareholders the opportunity to elect the full Board at the 2019 annual meeting if Brunswick does not make significant progress on initiatives to improve shareholder value.\nTo conclude, while we have no information on the near-term results for the various businesses, we believe that Brunswick has significant long-term-upside if management and the Board are actively engaged and take the actions outlined above in the near term. We hope that our dialogue has helped to focus the Board on the key areas for Brunswick to create this incremental value and we look forward to continuing these productive conversations.\nRegards, Jeffrey Altman Managing Partner Owl Creek Asset Management, L.P. CC: corporate.secretary@brunswick.com\nCautionary Statement Regarding Opinions and Forward-Looking Statements\nCertain information contained herein constitutes “forward-looking statements” with respect to the Company, which can be identified by the use of forward-looking terminology such as “may,” “will,” “seek,” “should,” \"could,\" “expect,” “anticipate,” “project,” “estimate,” “intend,” “continue” or “believe” or the negatives thereof or other variations thereon or comparable terminology. Such statements are not guarantees of future performance or activities. Due to various risks, uncertainties and assumptions, actual events or results or actual performance may differ materially from those reflected or contemplated in such forward-looking statements. The opinions of Owl Creek Asset Management, L.P. and its affiliates (“Owl Creek”) are for general informational purposes only and do not have regard to the specific investment objective, financial situation, suitability or particular need of any specific person, and should not be taken as advice on the merits of any investment decision. This material does not recommend the purchase or sale of any security. Owl Creek reserves the right to change any of its opinions expressed herein at any time as it deems appropriate. Owl Creek disclaims any obligation to update the information contained herein. Owl Creek and/or one or more of the investment funds it manages may purchase additional shares or sell all or a portion of their shares or trade in securities relating to such shares.\nAbout Owl Creek Asset Management\nOwl Creek Asset Management, L.P. (“Owl Creek”) manages event-driven hedge funds as well as special co-investment funds that are dedicated to high-conviction investment ideas. Owl Creek was founded in 2002 by Chief Portfolio Manager, Jeffrey Altman, and currently has approximately $2.4 billion in assets under management. Owl Creek employs a global opportunistic value strategy that makes event-driven investments across all parts of a company’s capital structure and operates as a bottom-up, fundamental-driven investor, searching for undervalued investment opportunities.\n1 Based on 2018E P/E and 2018E EV/EBITDA. Comparable companies include HOG, PII, THO, WGO, DOO TO, CCL, RCL, LCII, LIND, HAS, MAT, NCHL, ISCA, CMI, BGG, MBUU, MPX, MCFT, HZO.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130005784/en/\nOwl Creek Asset Management\nKimberly Smith, 212-688-2550\nSource: Owl Creek Asset Management, L.P.", "external_links": ["http://www.businesswire.com/news/home/20180130005784/en/"], "published": "2018-01-30T17:02:00.000+02:00", "crawled": "2018-01-30T18:44:07.003+02:00", "highlightTitle": ""}