{"organizations": [], "uuid": "59c9659f0ac95f474d4fcb91876e70ccf8e16e06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/china-stocks-midday/china-stocks-ease-from-2-yr-highs-property-firms-weigh-hong-kong-down-idUSL4N1PK1VU", "country": "US", "domain_rank": 408, "title": "China stocks ease from 2-yr highs, property firms weigh; Hong Kong down", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T06:19:00.000+02:00", "replies_count": 0, "uuid": "59c9659f0ac95f474d4fcb91876e70ccf8e16e06"}, "author": "", "url": "https://www.reuters.com/article/china-stocks-midday/china-stocks-ease-from-2-yr-highs-property-firms-weigh-hong-kong-down-idUSL4N1PK1VU", "ord_in_thread": 0, "title": "China stocks ease from 2-yr highs, property firms weigh; Hong Kong down", "locations": [], "entities": {"persons": [], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "shenzhen", "sentiment": "none"}], "organizations": [{"name": "ssec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* SSEC -0.1 pct, CSI300 -0.5 pct, HSI -0.3 pct\n* HK->Shanghai Connect daily quota used 13.7 pct, Shanghai->HK daily quota used 12.4 pct\n* FTSE China A50 -1.0 pct, BNY Mellon ADR China Select Index +0.5 pct\nSHANGHAI, Jan 25 (Reuters) - China stocks retreated from two-year highs Thursday morning, led down by banks and property firms, as investors pocketed gains after recent strong rally. ** At 04:05 GMT, the Shanghai Composite index was down 5.07 points or 0.14 percent at 3,554.40. ** China’s blue-chip CSI300 index was down 0.47 percent, with its financial sector sub-index lower by 1.24 percent , the consumer staples sector down 0.93 percent, the real estate index down 2.42 percent and healthcare sub-index down 1.21 percent. ** Chinese H-shares listed in Hong Kong fell 0.92 percent at 13,495.7, while the Hang Seng Index was down 0.31 percent at 32,856.00. ** The smaller Shenzhen index was unchanged for the day and the start-up board ChiNext Composite index was higher by 0.89 percent. ** Around the region, MSCI’s Asia ex-Japan stock index was firmer by 0.22 percent while Japan’s Nikkei index was down 0.84 percent. ** The yuan was Quote: d at 6.33 per U.S. dollar, 0.46 percent firmer than the previous close of 6.359. ** The largest percentage gainers in the main Shanghai Composite index were Guizhou Redstar Developing Co Ltd up 10.04 percent, followed by CSSC Science & Technology Co Ltd gaining 9.97 percent and BEIJING BASHI MEDIA CO LTD up by 9.96 percent. ** The largest percentage losses in the Shanghai index were Nanjing Textiles Import & Export Corp Ltd down 9.99 percent, followed by Jiangsu Protruly Vision Technology Group Co Ltd losing 5.08 percent and Sichuan Swellfun Co Ltd down by 5 percent. ** So far this year, the Shanghai stock index is up 7.63 percent, while China’s H-share index is up 16.3 percent. ** The top gainers among H-shares were Air China Ltd up 5.06 percent, followed by Dongfeng Motor Group Co Ltd gaining 3.38 percent and PetroChina Co Ltd up by 2.9 percent. ** The three biggest H-shares percentage decliners were CITIC Securities Co Ltd which has fallen 3.71 percent, Zhuzhou CRRC Times Electric Co Ltd which has lost 3.1 percent and Huatai Securities Co Ltd, down by 2.9 percent. ** About 14.61 billion shares have traded so far on the Shanghai exchange, roughly 80.1 percent of the market’s 30-day moving average of 18.25 billion shares a day. The volume traded was 25.30 billion as of the last full trading day. ** As of 04:05 GMT, China’s A-shares were trading at a premium of 29.24 percent over the Hong Kong-listed H-shares. ** The Shanghai stock index is above its 50-day moving average and above its 200-day moving average. ** The price-to-earnings ratio of the Shanghai index was 16.18 as of the last full trading day while the dividend yield was 1.8 percent. ** So far this week, the market capitalisation of the Shanghai stock index has risen by 2.14 percent to 31.29 trillion yuan. ** In Hong Kong, the sub-index of the Hang Seng index tracking energy shares rose 1.6 percent while the IT sector fell 0.9 percent. The top gainer on Hang Seng was China Unicom Hong Kong Ltd up 3.88 percent, while the biggest loser was China Mengniu Dairy Co Ltd which was down 2.42 percent.\nReporting by Luoyan Liu and John Ruwitch; Editing by Richard Borsuk\n ", "external_links": [], "published": "2018-01-25T06:19:00.000+02:00", "crawled": "2018-01-25T06:30:31.005+02:00", "highlightTitle": ""}