{"organizations": [], "uuid": "ce14054a07486aa2f0f18c16d4844921118c2439", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets/asia", "section_title": "Asian Stock Market News | Reuters.com", "url": "https://www.reuters.com/article/china-stocks-close/shanghai-stocks-snap-winning-streak-resources-firm-weigh-idUSZZN2R7G00", "country": "US", "domain_rank": 408, "title": "Shanghai stocks snap winning streak, resources firm weigh", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T15:24:00.000+02:00", "replies_count": 0, "uuid": "ce14054a07486aa2f0f18c16d4844921118c2439"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/china-stocks-close/shanghai-stocks-snap-winning-streak-resources-firm-weigh-idUSZZN2R7G00", "ord_in_thread": 0, "title": "Shanghai stocks snap winning streak, resources firm weigh", "locations": [], "entities": {"persons": [], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "shenzhen", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHANGHAI, Jan 15 (Reuters) - Shanghai stocks fell on Monday to snap an 11-session winning streak, with gains in banking and real estate firms offset by resources and industrial shares, as investors took profits after recent bull run.\n** China’s bank lending halved in December as the government kept up its campaign to curb financial system risks, but banks still managed to dole out a record amount for the year amid the tighter scrutiny. Chinese authorities are trying to walk a fine line by containing riskier types of financing and slowing an explosive build-up in debt without stunting economic growth.\n** At the close, the Shanghai Composite index was down 18.95 points or 0.55 percent at 3,409.99. ** The blue-chip CSI300 index was flat, with its financial sector sub-index higher by 1.59 percent, the consumer staples sector down 0.36 percent, the real estate index up 2.12 percent and healthcare sub-index down 0.62 percent. ** The smaller Shenzhen index ended down 1.8 percent and the start-up board ChiNext Composite index was weaker by 2.97 percent. ** Around the region, MSCI’s Asia ex-Japan stock index was firmer by 0.31 percent while Japan’s Nikkei index closed up 0.26 percent. ** At 07:06 GMT, the yuan was Quote: d at 6.438 per U.S. dollar, 0.44 percent firmer than the previous close of 6.4665. ** The largest percentage gainers in the main Shanghai Composite index were Harbin Air Conditioning Co Ltd up 10.05 percent, followed by Shandong Lukang Pharmaceutical Co Ltd gaining 10 percent and Tederic Machinery Co Ltd up by 9.98 percent. ** The largest percentage losses in the Shanghai index were Beijing Vantone Real Estate Co Ltd down 10.07 percent, followed by Hang Xiao Steel Structure Co Ltd losing 10.03 percent and Avic Shenyang Aircraft Co Ltd down by 9.99 percent. ** So far this year, the Shanghai stock index is up 3.68 percent, the CSI300 is up 4.8 percent this year, while China’s H-share index listed in Hong Kong is up 6.5 percent. Shanghai stocks have risen 3.68 percent this month. ** About 23.20 billion shares were traded on the Shanghai exchange, roughly 146.2 percent of the market’s 30-day moving average of 15.87 billion shares a day. The volume in the previous trading session was 17.41 billion. ** As of 07:07 GMT, China’s A-shares were trading at a premium of 30.09 percent over the Hong Kong-listed H-shares. ** The Shanghai stock index is above its 50-day moving average and above its 200-day moving average. (Reporting by Shanghai Newsroom; Editing by Sam Holmes)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T15:24:00.000+02:00", "crawled": "2018-01-15T09:49:25.042+02:00", "highlightTitle": ""}