{"organizations": [], "uuid": "28b7e551fcb8ce3982023731c779cba71289ab1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/china-stocks-hongkong-close/hang-seng-falls-the-most-in-6-weeks-on-wall-street-retreat-yield-spike-idUSZZN2N7V00", "country": "US", "domain_rank": 408, "title": "Hang Seng falls the most in 6 weeks on Wall Street retreat, yield spike", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T10:36:00.000+02:00", "replies_count": 0, "uuid": "28b7e551fcb8ce3982023731c779cba71289ab1d"}, "author": "", "url": "https://www.reuters.com/article/china-stocks-hongkong-close/hang-seng-falls-the-most-in-6-weeks-on-wall-street-retreat-yield-spike-idUSZZN2N7V00", "ord_in_thread": 0, "title": "Hang Seng falls the most in 6 weeks on Wall Street retreat, yield spike", "locations": [], "entities": {"persons": [], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "hang seng china enterprises", "sentiment": "none"}, {"name": "hang lung properties ltd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "china enterprises", "sentiment": "none"}, {"name": "hang seng was country garden holdings co ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Hang Seng index ends down 1.1 pct\n* China Enterprises index HSCE falls 2 percent\n* HSI financial sector sub-index is 1.3 percent lower; property sector down 0.3 percent\nJan 30 (Reuters) - Hang Seng posted its biggest one-day loss in six weeks on Tuesday, as Wall Street weakness in the wake of a spike in global bond yields prompted investors to lock in profit in high-flying Hong Kong stocks. ** At close of trade, the Hang Seng index was down 359.60 points, or 1.09 percent, at 32,607.29. The Hang Seng China Enterprises index fell 1.98 percent to 13,389.38. **The sub-index of the Hang Seng tracking energy shares dipped 2.8 percent while the IT sector dipped 1.85 percent, the financial sector was 1.28 percent lower and property sector dipped 0.3 percent. ** The top gainer on Hang Seng was Country Garden Holdings Co Ltd, up 2.09 percent, while the biggest loser was Hang Lung Properties Ltd which was down 5.41 percent. ** China’s main Shanghai Composite index closed down 0.99 percent at 3,488.1888 points while its blue-chip CSI300 index ended down 1.07 percent. ** Around the region, MSCI’s Asia ex-Japan stock index was weaker by 1.37 percent while Japan’s Nikkei index closed down 1.43 percent. ** The yuan was Quote: d at 6.3398 per U.S. dollar at 08:10 GMT, 0.1 percent firmer than the previous close of 6.346. ** As of the previous trading session, the Hang Seng index was up 10.19 percent this year, while China’s H-share index was up 16.7 percent.\n** The top gainers among H-shares were China Merchants Bank Co Ltd up 2.04 percent, followed by Guangzhou Automobile Group Co Ltd gaining 1.72 percent and Great Wall Motor Co Ltd up by 1.04 percent. ** The three biggest H-shares percentage decliners were China Minsheng Banking Corp Ltd which was down 3.95 percent, PetroChina Co Ltd which fell 3.7 percent and Bank of China Ltd down by 3.5 percent. ** About 3.28 billion Hang Seng index shares were traded, roughly 138.4 percent of the market’s 30-day moving average of 2.37 billion shares a day. The volume traded in the previous trading session was 3.72 billion. ** At close, China’s A-shares were trading at a premium of 27.68 percent over the Hong Kong-listed H-shares. ** The price-to-earnings ratio of the Hang Seng index was 15.05 as of the last full trading day while the dividend yield was 2.6 percent. (Reporting by the Shanghai Newsroom; Editing by Sam Holmes)\n ", "external_links": [], "published": "2018-01-30T10:36:00.000+02:00", "crawled": "2018-01-30T11:21:10.037+02:00", "highlightTitle": ""}