{"organizations": [], "uuid": "924a535e53f33d2c608b6f73897f9bfa56c0046f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/afghanistan-children/six-afghan-children-killed-in-fighting-idINKBN1FF1MT", "country": "US", "domain_rank": 408, "title": "Six Afghan children killed in fighting", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T15:09:00.000+02:00", "replies_count": 0, "uuid": "924a535e53f33d2c608b6f73897f9bfa56c0046f"}, "author": "", "url": "https://in.reuters.com/article/afghanistan-children/six-afghan-children-killed-in-fighting-idINKBN1FF1MT", "ord_in_thread": 0, "title": "Six Afghan children killed in fighting", "locations": [], "entities": {"persons": [{"name": "mohammad radmanish", "sentiment": "none"}, {"name": "mohammad zaman", "sentiment": "none"}], "locations": [{"name": "afghanistan", "sentiment": "none"}, {"name": "jalalabad", "sentiment": "none"}, {"name": "ghazni", "sentiment": "none"}, {"name": "ghazni", "sentiment": "none"}, {"name": "kabul", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "taliban", "sentiment": "none"}, {"name": "intercontinental hotel", "sentiment": "none"}, {"name": "save the children aid group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 1:10 PM / Updated 7 hours ago Six Afghan children killed in fighting Reuters Staff 2 Min Read \nGHAZNI, Afghanistan (Reuters) - As many as six children were killed in fighting near the central Afghan city of Ghazni on Friday but there were conflicting accounts of how they died, with officials blaming the Taliban and others saying they died in an air strike by Afghan forces. \nFollowing high-profile attacks on the Intercontinental Hotel in Kabul and a compound of the Save the Children aid group in Jalalabad in recent days, the violence in Ghazni highlighted the daily toll on Afghan civilians across the country. \nProvincial officials said a Taliban mortar attack struck the village while the children were outside, killing the six and wounding two. \n“Children were playing in the yard of a house when the Taliban fired mortars. One hit the ground and killed six children and wounded two,” Ghazni police chief Mohammad Zaman told reporters. \nMohammad Radmanish, a spokesman for the defence ministry, also blamed Taliban for the attack: “We can say clearly that it was a rocket by the enemy forces.” he said. \n“The person who fired the rockets was killed by our forces and we seized his rocket.” \nHowever local people said the children died in an air strike by Afghan security forces, which have been conducting an increasing number of air operations as their fledgling air force has grown over the past year. \nTaliban spokesman Zabihullah Mujahid said the air strike had killed seven civilians, wounded six and destroyed four houses. \nA defence ministry official in Kabul said three civilians had been killed in an air strike near Ghazni but it was not clear whether they were children. \nAccording to the latest report from the United Nations, 2,640 civilians were killed and 5,379 wounded between January and September last year, with more than a third killed in ground engagements. Armed conflict killed 689 children and wounded another 1,791 during the period. Reporting by Mustafa Andalib; additional reporting by Mirwais Harooni and Hamid Shalizi in KABUL; editing by Nick Macfie", "external_links": [], "published": "2018-01-26T15:09:00.000+02:00", "crawled": "2018-01-26T15:22:34.003+02:00", "highlightTitle": ""}