{"organizations": [], "uuid": "5440e2f356aa7cd5b0b329292c5d880e1944e0be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-new-global-leaders-join-cdisc-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "New Global Leaders Join CDISC Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T23:17:00.000+02:00", "replies_count": 0, "uuid": "5440e2f356aa7cd5b0b329292c5d880e1944e0be"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-new-global-leaders-join-cdisc-board-of-directors.html", "ord_in_thread": 0, "title": "New Global Leaders Join CDISC Board of Directors", "locations": [], "entities": {"persons": [{"name": "decker", "sentiment": "none"}, {"name": "howard", "sentiment": "none"}, {"name": "chris decker", "sentiment": "none"}, {"name": "pam howard", "sentiment": "none"}], "locations": [{"name": "austin", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "clinical data interchange standards consortium", "sentiment": "negative"}, {"name": "fda phuse computational sciences collaboration", "sentiment": "none"}, {"name": "life sciences practice", "sentiment": "none"}, {"name": "phuse computational science steering committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas--(BUSINESS WIRE)-- The Clinical Data Interchange Standards Consortium (CDISC) today announced Chris Decker and Pam Howard have joined its Board of Directors to serve three-year terms, which began 1 January 2018.\nMr. Decker is Vice President, Life Sciences Practice at d-Wise, a technology and process consulting company focused on empowering innovation for a healthier world. He leads a large team of domain and technical expertise, delivering clinical systems integration, standards implementation, and adoption of technology within the clinical trial lifecycle. Mr. Decker served on the PhUSE Board of Directors for four years and, since 2005, as a volunteer across various CDISC teams, including co-lead of the ADaM Training sub-team. In addition, he co-led the creation and implementation of the FDA PhUSE Computational Sciences Collaboration where he serves as FDA PhUSE Liaison and co-lead of the PhUSE Computational Science Steering Committee.\nMs. Howard is Vice President, Biostatistics and Programming and Medical Writing, at ICON. Prior to this role, she held a number of senior positions within ICON, including VP of Data Management, VP of Clinical Operations and Global Business Lead for Metrics and Process Improvement Initiatives. Ms. Howard has always had an interest in standards, and has actively promoted the application of standards, in particular, to promote data-driven decision making, to increase the quality and productivity of clinical projects, and decrease their costs.\n“I am delighted Chris and Pam have joined our Board,” said David Bobbitt, President and CEO, CDISC. “Each brings valuable expertise in clinical research and a steadfast dedication to the global adoption of standards, which will provide strategic direction to CDISC and help us lay the foundation for a CDISC 2.0 Vision. We are grateful for their service.”\n“Service on the CDISC Board is a commitment to the clinical research community and to the discovery of new treatments,” added Stephen Pyke, Board Chair and Senior Vice President, Clinical Projects & Quantitative Sciences at GlaxoSmithKline. “We could not be more pleased that Chris and Pam are bringing their considerable knowledge and deep experience to our Board. Together, we are making a difference, collaborating to unlock cures.”\nContinuing Board members include Mr. Stephen Pyke (Chair), GlaxoSmithKline; Dr. David Hardison (Past Chair), ConvergeHEALTH by Deloitte; Dr. Charles Cooper, Becton Dickinson; Mr. David Evans, Accenture; Dr. Masanori Fukushima, Kyoto University and Translational Research Informatics Center; Ms. Margaret Keegan, Quintiles; Dr. Douglas Peddicord, Washington Health Strategies; Mr. Steve Rosenberg, Oracle Health Sciences; Ms. Joyce Sensmeier, Healthcare Information and Management Systems Society (HIMSS); Mr. John Speakman, New York University; Dr. Hiromichi Shirasawa, Merck; Ms. Névine Zariffa, AstraZeneca; Dr. Jonathan Zung, Covance.\nABOUT CDISC\nCDISC is a 501(c)(3) global nonprofit organization that develops data standards to foster smarter research and enable connections to healthcare. CDISC standards allow data to speak the same language, by providing common formats for data collection, data sharing, and data analyses to make the most of the valuable information offered by patients participating in research studies around the globe, enabling researchers to discover new treatments, find breakthroughs, and unlock cures. CDISC standards are required for regulatory submissions to the US FDA and Japan PMDA, are endorsed by the China CFDA, and are requested for use by the European Innovative Medicines Initiative (IMI). The suite of CDISC standards is freely available on the CDISC website .\nCDISC is funded through the generous support of over 450 member organizations from pharmaceutical, biotech, clinical research organizations, regulatory agencies, academia, and healthcare, as well as through grants, authorized CDISC Education courses, events, and charitable contributions. To find out more about how to support CDISC and get involved, please visit www.cdisc.org .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180118006316/en/\nCDISC\nAnn P. White, +1-512-363-5826\nawhite@cdisc.org\nSource: CDISC", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cdisc.org%2F&esheet=51745614&newsitemid=20180118006316&lan=en-US&anchor=www.cdisc.org&index=2&md5=57f9d6ca7922e83df1d43cc65803bf60", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cdisc.org%2F&esheet=51745614&newsitemid=20180118006316&lan=en-US&anchor=CDISC+website&index=1&md5=369d8a2c929402c41ca7417df760b9af", "http://www.businesswire.com/news/home/20180118006316/en/"], "published": "2018-01-18T23:17:00.000+02:00", "crawled": "2018-01-19T01:24:07.000+02:00", "highlightTitle": ""}