{"organizations": [], "uuid": "4a3e0f79f04c8cf1e1f0fae11d7671efe5c63bc9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/04/06/102563001-467701296.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/10/oil-markets-near-3-year-highs-on-tighter-us-market.html", "country": "US", "domain_rank": 767, "title": "Oil markets near 3-year highs on tighter US market", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.171, "site_type": "news", "published": "2018-01-11T04:10:00.000+02:00", "replies_count": 0, "uuid": "4a3e0f79f04c8cf1e1f0fae11d7671efe5c63bc9"}, "author": "Getty Images", "url": "https://www.cnbc.com/2018/01/10/oil-markets-near-3-year-highs-on-tighter-us-market.html", "ord_in_thread": 0, "title": "Oil markets near 3-year highs on tighter US market", "locations": [], "entities": {"persons": [], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "gonzales", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "organization of the petroleum exporting countries", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oil prices hit their highest levels in more than three years on Thursday despite warnings that a 13-percent rally since early December was close to running its course.\nBrent crude futures rose 44 cents to $69.64 a barrel by 10:12 a.m. ET (1512 GMT). The contract earlier hit $69.88, its highest since December 4, 2014, the last time Brent was above $70 a barrel.\nU.S. West Texas Intermediate (WTI) crude futures were up 87 cents, or 1.4 percent, at $64.44. They topped out at $64.77, a high going back to December 8, 2014.\nSentiment was boosted by a surprise drop in U.S. production and lower U.S. crude inventories in official data on Wednesday.\nshow chapters Jefferies: China demand, OPEC action to keep oil market undersupplied      13 Hours Ago | 02:03 \"The undeniable fact is that (U.S.) crude oil inventories are at their lowest level since August 2015,\" said PVM Oil Associates analyst Tamas Varga. \"OPEC is edging ever closer to its desired target of reducing OECD industrial stocks to the five-year average.\"\nData from the U.S. Energy Information Administration on Wednesday showed that crude inventories fell by almost 5 million barrels to 419.5 million barrels in the week to Jan. 5.\nU.S. production also fell by 290,000 barrels per day to 9.5 million bpd, the EIA said, despite expectations of output breaking through 10 million bpd.\nThe drop, likely to be because of extreme cold weather that halted some onshore output in North America, was expected to be shortlived.\nBut on Thursday UAE oil minister and current OPEC President Suhail al-Mazrouei said he expects the market to balance in 2018 and that the producer group is committed to its supply reduction pact until the end of this year.\nProduction cuts led by the Organization of the Petroleum Exporting Countries (OPEC) and Russia, which started in January last year and are set to continue throughout 2018, have underpinned prices.\nshow chapters Commodities tomorrow: Drawdown, US production drop drive crude higher      3:14 PM ET Wed, 10 Jan 2018 | 00:37 Still, downward pressure emerged in the physical market, where OPEC's second and third-largest producers, Iran and Iraq, this week cut their prices to remain competitive.\nFuel inventories in Asia and the United States remain ample and in some cases are rising.\nU.S. gasoline stocks climbed by a bigger than expected 4.1 million barrels, EIA data showed.\nIn Asia's Singapore oil trading hub, average refinery profit margins have fallen below $6 a barrel, their lowest seasonal level in five years.\n\"Markets are getting a bit fatigued and a healthy correction could be on the cards,\" said Stephen Innes, head of trading for Asia/Pacific at futures brokerage Oanda in Singapore.\n— CNBC's Tom DiChristopher contributed to this report.", "external_links": [], "published": "2018-01-11T04:10:00.000+02:00", "crawled": "2018-01-11T04:35:06.025+02:00", "highlightTitle": ""}