{"organizations": [], "uuid": "2d2c84527b5f2d55001419d3c2c1f7c5db545f75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225236224&w=1200&r=LYNXMPEE0O1H7", "site_section": "http://feeds.reuters.com/reuters/INformulaOne\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/us-awards-grammys-preview/2018-grammys-will-hip-hop-finally-even-the-score-idINKBN1FE25V", "country": "US", "domain_rank": 408, "title": "2018 Grammys: Will hip-hop finally even the score?", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T20:12:00.000+02:00", "replies_count": 0, "uuid": "2d2c84527b5f2d55001419d3c2c1f7c5db545f75"}, "author": "", "url": "https://in.reuters.com/article/us-awards-grammys-preview/2018-grammys-will-hip-hop-finally-even-the-score-idINKBN1FE25V", "ord_in_thread": 0, "title": "2018 Grammys: Will hip-hop finally even the score?", "locations": [], "entities": {"persons": [{"name": "scarano", "sentiment": "none"}, {"name": "jay", "sentiment": "none"}, {"name": "kendrick", "sentiment": "none"}, {"name": "jill serjeant", "sentiment": "none"}, {"name": "kendrick lamar", "sentiment": "none"}, {"name": "lauryn hill", "sentiment": "none"}, {"name": "ross scarano", "sentiment": "none"}, {"name": "jay-z", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "billboard magazine", "sentiment": "none"}, {"name": "grammys", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 6:41 PM / Updated 2 hours ago 2018 Grammys: Will hip-hop finally even the score? Jill Serjeant 3 Min Read \nNEW YORK (Reuters) - After several near misses and heaps of outrage, this could finally be hip-hop and R&B’s year at the Grammy Awards on Sunday where rappers Jay-Z and Kendrick Lamar dominate nominations for the top prizes on the biggest night in music. \nRap is now officially the biggest music genre in the United States after surpassing rock in 2017, but the odds are historically stacked against a hip-hop artist winning album of the year at the Grammys. \n“Hip-hop and black music in general has really had its finger on the pulse of the American temperament for the last few years,” Ross Scarano, vice president of content at Billboard magazine, told Reuters. \n“There is a sense that maybe this year some of the wrongs will be righted. I think people are looking to Kendrick and to Jay to do that,” Scarano said. \nIn the 60-year history of the most prestigious honors in music, only two hip-hop albums have ever won album of the year; Lauryn Hill’s “The Miseducation of Lauryn Hill” in 1999 and Outkast’s “Speakerboxxx/The Love Below” in 2004. \nLamar, 30, whose fusion of jazz, poetry and blues with social themes and love songs has made him one of the most innovative rappers of his generation, missed out in 2016 with his critically acclaimed album “To Pimp a Butterfly.” \nThis year, he is back with album of the year nominee “Damn.” and record of the year entry “Humble.” \nA year ago, British pop star Adele’s “25” swept aside Beyonce’s influential “Lemonade,” a win that stunned even Adele. \nThis year, Jay-Z, 44, was nominated for album of the year for “4:44,” in which he examines the infidelity that was so scathingly detailed by his wife Beyonce in “Lemonade.” \nScarano said the fact of Jay-Z “getting down on his knees, so to speak, and baring his soul really resonate in a year where we’ve seen a lot of men taken to task for really objectionable behavior.” \nJay-Z goes into Sunday’s ceremony in New York with a leading eight nominations followed by Lamar (7), Bruno Mars (6) and Childish Gambino, the alter ego of actor Donald Glover, with 5. Related Coverage Factbox: Key nominations for the 2018 Grammy Awards \nEd Sheeran was snubbed in the album, song and record of the year categories despite his romantic pop album “Divide” being the biggest seller of 2017. That omission leaves only New Zealand-born singer-songwriter Lorde’s album “Melodrama” and the Latin global hit single “Despacito” to mount a serious challenge in the top races. \nHowever, the Grammys aren’t just about the winners. In a three-hour live show where careers can be made or damaged, performers include Miley Cyrus, Elton John, U2, Sting, Kesha, Rihanna, Sam Smith, SZA and Broadway star Ben Platt. \nThe Grammy Awards, hosted by James Corden, will be broadcast live from New York’s Madison Square Garden on CBS television on Sunday starting at 7:30 pm ET. Additional reporting by Alicia Powell and Piya Sinha-Roy; Editing by Cynthia Osterman", "external_links": [], "published": "2018-01-25T20:12:00.000+02:00", "crawled": "2018-01-25T20:48:29.001+02:00", "highlightTitle": ""}