{"organizations": [], "uuid": "dafbef44cf6e29d6caf04fe269ffba62071f5372", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-indonesia-quake/earthquake-of-magnitude-6-1-strikes-off-indonesia-usgs-idUKKBN1FC0LU", "country": "US", "domain_rank": 408, "title": "Earthquake of magnitude 6.1 strikes off Indonesia - USGS", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T08:56:00.000+02:00", "replies_count": 0, "uuid": "dafbef44cf6e29d6caf04fe269ffba62071f5372"}, "author": "", "url": "https://uk.reuters.com/article/uk-indonesia-quake/earthquake-of-magnitude-6-1-strikes-off-indonesia-usgs-idUKKBN1FC0LU", "ord_in_thread": 0, "title": "Earthquake of magnitude 6.1 strikes off Indonesia - USGS", "locations": [], "entities": {"persons": [{"name": "usgs reuters sta", "sentiment": "negative"}, {"name": "clarence fernandez", "sentiment": "none"}, {"name": "muralikumar anantharaman", "sentiment": "none"}], "locations": [{"name": "indonesia", "sentiment": "none"}, {"name": "sukabumi", "sentiment": "none"}, {"name": "jakarta", "sentiment": "none"}], "organizations": [{"name": "usgs", "sentiment": "negative"}, {"name": "min read  jakarta", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. geological survey", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 6:58 AM / Updated 40 minutes ago Indonesia quake shakes capital, causes some injuries, damage in Java Reuters Staff 3 Min Read \nJAKARTA (Reuters) - Office workers fled high-rise buildings in the Indonesian capital on Tuesday after a strong earthquake shook the city, causing some injuries and damage to at least 130 buildings elsewhere on the densely populated island of Java. \nThe relatively shallow quake of magnitude 6 struck off Java, the U.S. Geological Survey said, and authorities ruled out the risk of a tsunami. \nMany people ran along the streets of downtown Jakarta, pointing at the buildings above them, witnesses said. Metro TV showed patients being evacuated from a hospital. \nThe quake struck about 104 km (64.62 miles) west of the city of Sukabumi, at a depth of 44 km (27 miles). Jakarta is about 100 km (62 miles) away. \n“In Cianjur, six students were seriously injured and two students suffered light injuries when the (school) roof collapsed,” Sutopo Purwo Nugroho, a spokesman for Indonesia’s disaster agency, said in a statement, referring to a district of West Java province. Office workers leave a building following an earthquake in Jakarta, Indonesia January 23, 2018. REUTERS/Darren Whiteside \nBesides schools, more than 130 houses and a mosque were damaged in the provinces of West Java and Banten, the agency said. \nThe quake was felt for about 10 to 15 seconds in Jakarta, though many residents thought it lasted far longer. Slideshow (2 Images) \n“I was just sitting down, then I felt the building swaying,” said Rudy Togatorop, 35, who works at the Chilean embassy. “The emergency stairs were very narrow. I was worried if something would happen.” \nIndonesia sits on the geologically active Pacific Ring of Fire and is regularly hit by earthquakes. In 2004, the Indian Ocean tsunami killed 226,000 people in 13 countries, including more than 120,000 in Indonesia. \nIn December, a quake of 6.5 magnitude killed at least three people when it hit Java, at a depth of 92 km (57 miles), and buildings in Jakarta swayed for several seconds. \nThe World Bank reckons natural disasters cost Indonesia 0.3 percent of its gross domestic product annually, but a 2015 government report on disaster risk management said a major earthquake, occurring once every 250 years, could cause losses in excess of $30 billion (£21.50 billion), or 3 percent of GDP. Reporting by Jessica Damiana, Tabita Diela and Angie Teo; Writing by Nick Macfie; Editing by Ed Davies", "external_links": [], "published": "2018-01-23T08:56:00.000+02:00", "crawled": "2018-01-23T09:13:17.005+02:00", "highlightTitle": ""}