{"organizations": [], "uuid": "6edafe269270616ab532e2b82d8011a6916bcd5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180110.html", "section_title": "Archive News &amp; Video for Wednesday, 10 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/britain-economy/update-1-industry-gives-brexit-bound-uk-economy-a-shot-in-the-arm-idUSL8N1P52FB", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Industry gives Brexit-bound UK economy a shot in the arm", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T21:09:00.000+02:00", "replies_count": 0, "uuid": "6edafe269270616ab532e2b82d8011a6916bcd5c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/britain-economy/update-1-industry-gives-brexit-bound-uk-economy-a-shot-in-the-arm-idUSL8N1P52FB", "ord_in_thread": 0, "title": "UPDATE 1-Industry gives Brexit-bound UK economy a shot in the arm", "locations": [], "entities": {"persons": [{"name": "david milliken", "sentiment": "none"}, {"name": "andy bruce", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "group of seven", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Industrial output growth beats forecasts in November * Manufacturing posts seventh gain in a row * Data puts UK on track for solid, if unspectacular, end to 2017 * 2018 likely to prove more difficult, say economists (Adds reaction) By Andy Bruce and David Milliken LONDON, Jan 10 (Reuters) - British industry enjoyed solid growth in November, benefiting from a global upturn that has allowed the economy to outperform gloomy forecasts made after 2016's Brexit vote, although it still lags behind its international rivals. The British economy grew more slowly than all other Group of Seven members in the first nine months of 2017 as consumer-facing sectors suffered from a surge in inflation caused by sterling's post-Brexit vote plunge. With departure from the European Union set for March 2019, few economists think growth will improve this year. But the latest official data signalled that industry remains a bright spot: Manufacturers recorded their fastest annual growth since March 2011 in the three months to the end of November, expanding by 3.9 percent year-on-year. The sector, which accounts for around a tenth of British economic output, also posted its seventh consecutive monthly expansion - the longest unbroken run in more than 20 years. The National Institute of Economic and Social Research (NIESR) said the figures pointed to GDP growth of 0.6 percent in the last quarter of 2017, which would be the strongest of the year and would lift full-year growth to 1.8 percent. The Bank of England said in November it expected growth to stick at 0.4 percent in the last three months of the year, after it raised its key interest rate for the first time since 2007. If growth turns out faster, it might boost the chance of the BoE raising rates again in May rather than later in 2018 as most economists expect. Financial markets were unmoved by the data, however. \"The UK will need more than just strong industrial production figures though if it is to fare well,\" said Christian Jaccarini, economist at the Centre for Economics and Business Research consultancy. Construction output in the three months to November contracted 2.0 percent compared with the previous three months, the biggest dip since August 2012, the Office for National Statistics said. Earlier on Wednesday, the British Chambers of Commerce said the economy looked set for an \"underwhelming\" 2018, with business subdued ahead of Brexit and reluctant to invest, according to its quarterly survey - the largest of its type. The ONS said industrial output rose by a monthly 0.4 percent in November, compared with 0.2 percent in October, the ONS said, spurring an annual rise of 2.5 percent. Economists taking part in a Reuters poll had expected to see output rise 0.3 percent on the month and 1.8 percent on the year. \"There was strong and widespread growth across (British) manufacturing with notable increases from renewable energy projects, boats, planes and cars for export,\" ONS statistician Ole Black said. Goods export volumes in the three months to November were 9.1 percent higher than the same period in 2016, though the goods trade deficit exceeded all forecasts in a Reuters poll. Other countries are doing better. German industrial output rose by 3.4 percent in November alone, its biggest gain since 2009 and one which puts the economy there on track for growth of at least 2.2 percent last year. Figures for Britain's services sector - which is around eight times the size of manufacturing and has been growing slowly - are due out on Jan. 26. Wednesday's data showed Britain's total trade deficit, which includes goods and services, hit a five-month high of 2.8 billion pounds in November. ($1= 0.7384 pounds) (Reporting by Andy Bruce and David Milliken; Editing by Hugh Lawson)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T21:09:00.000+02:00", "crawled": "2018-01-11T12:36:32.000+02:00", "highlightTitle": ""}