{"organizations": [], "uuid": "686904ad5ad042dc1dbe9e7022069f3f049a83bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222369499&w=1200&r=LYNXMPEE0F0IR", "site_section": "http://feeds.reuters.com/reuters/INtechnologyNews\r", "section_title": "Reuters: Technology News", "url": "https://in.reuters.com/article/markets-bitcoin/bitcoin-slides-14-percent-on-crackdown-fears-hits-four-week-low-idINKBN1F50UM", "country": "US", "domain_rank": 408, "title": "Bitcoin slides 14 percent on crackdown fears, hits four-week low", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T11:00:00.000+02:00", "replies_count": 0, "uuid": "686904ad5ad042dc1dbe9e7022069f3f049a83bf"}, "author": "", "url": "https://in.reuters.com/article/markets-bitcoin/bitcoin-slides-14-percent-on-crackdown-fears-hits-four-week-low-idINKBN1F50UM", "ord_in_thread": 0, "title": "Bitcoin slides 14 percent on crackdown fears, hits four-week low", "locations": [], "entities": {"persons": [{"name": "kim dong-yeon", "sentiment": "none"}, {"name": "jemima kelly", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "bitcoin", "sentiment": "negative"}, {"name": "coinmarketcap", "sentiment": "none"}, {"name": "yonhap", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON/NEW YORK (Reuters) - Bitcoin slid as much as 18 percent on Tuesday to a four-week low, as worries about a regulatory crackdown on the market spread after reports suggested it was still possible that South Korea could ban trading in cryptocurrencies.\nBitcoin’s slide triggered a selloff across the broader cryptocurrency market, with biggest rival Ethereum down 23 percent on the day at one point, according to trade website Coinmarketcap, and the next biggest, Ripple, plunging by as much as a third.\nBitcoin traded as low as $11,191.59 on the Luxembourg-based Bitstamp exchange. In New York trading, it edged up to $12,078, but that was still down 11.2 percent, leaving it on track for its biggest one-day fall since September.\n“With reports on a renewed crackdown on the cryptocurrency in China fueling anxiety over future restrictions, further losses could be on the cards (for bitcoin) in the near term,” said Lukman Otunuga, research analyst at FXTM in the UK.\n“The sharp depreciation witnessed in bitcoin today should remind investors on how explosively volatile and unpredictable the cryptocurrency can be,” he added.\nSouth Korean news website Yonhap reported that Finance Minister Kim Dong-yeon had told a local radio station that the government would be coming up with a set of measures to clamp down on the “irrational” cryptocurrency investment craze.\nSouth Korea said on Monday its plans to ban virtual coin exchanges had not yet been finalised, as government agencies were still in talks to decide how to regulate the market.\nFURTHER CHINA CRACKDOWN FILE PHOTO: A collection of Bitcoin (virtual currency) tokens are displayed in this picture illustration taken December 8, 2017. REUTERS/Benoit Tessier/Illustration/File Photo That came amid news that a senior Chinese central banker had said authorities should ban centralised trading of virtual currencies and prohibit individuals and businesses from providing related services.\nChina shut down exchanges operating on the mainland last year - a move that also sparked a selloff, though the market later recovered.\n“It’s mainly been regulatory issues which are haunting (bitcoin), with news around South Korea’s further crackdown on trading the driver today,” said Think Markets chief strategist Naeem Aslam, who holds what he described as “substantial” amounts of bitcoin, Ethereum and Ripple.\n“But we maintain our stance. We do not think that the complete banning of cryptocurrencies is possible,” he said.\nCryptocurrencies enjoyed a bumper year in 2017 as mainstream investors entered the market and as an explosion in so-called initial coin offerings (ICOs) - digital token-based fundraising rounds - drove demand for bitcoin and Ethereum.\nThe latest tumble leaves bitcoin down around 40 percent from a record high near $20,000 hit in mid-December, wiping about $130 billion off its total market value - the unit price multiplied by the number of bitcoins that have been released into the market.\n“From a technical standpoint, bitcoin is under pressure on the daily charts,” said Otunuga. “The breakdown below $12,000 may encourage a further decline towards $11,000 and $10,000, respectively.”\nA director at Germany’s central bank said on Monday that any attempt to regulate cryptocurrencies must be on a global scale as national or regional rules would be hard to enforce on a virtual, borderless community.\nThe latest plunge in the market came as wealth management firm deVere Group, which has $12 billion under advisement, said it was launching a cryptocurrency app that would allow users to store, transfer and exchange five of the biggest digital coins, citing “soaring global demand.”\nReporting by Jemima Kelly in London and Gertrude Chavez-Dreyfuss in New York; Editing by Robin Pomeroy and Frances Kerry\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-16T11:00:00.000+02:00", "crawled": "2018-01-16T12:27:09.017+02:00", "highlightTitle": ""}