{"organizations": [], "uuid": "30e761c884c08c88f0bbe5475ccba463f90d1443", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180121.html", "section_title": "Archive News &amp; Video for Sunday, 21 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/germany-politics/merkel-readies-for-intense-german-coalition-talks-after-tight-spd-vote-idUSL8N1PG12W", "country": "US", "domain_rank": 408, "title": "Merkel readies for intense German coalition talks after tight SPD vote", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T08:01:00.000+02:00", "replies_count": 0, "uuid": "30e761c884c08c88f0bbe5475ccba463f90d1443"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/germany-politics/merkel-readies-for-intense-german-coalition-talks-after-tight-spd-vote-idUSL8N1PG12W", "ord_in_thread": 0, "title": "Merkel readies for intense German coalition talks after tight SPD vote", "locations": [], "entities": {"persons": [{"name": "merkel", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "negative"}, {"name": "martin schulz", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "spd", "sentiment": "negative"}, {"name": "social democrats", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN, Jan 22 (Reuters) - German Chancellor Angela Merkel’s conservatives start preparing for formal coalition talks with the Social Democrats (SPD) on Monday, wasting no time after the centre-left party narrowly voted to go ahead following months of political deadlock.\nAt a nail-biter of a party congress, 56 percent of SPD delegates voted to pursue coalition talks with Merkel’s conservative bloc on the basis of a blueprint agreed earlier this month.\nThat was a narrower margin than many analysts had predicted and could embolden the SPD’s leaders to negotiate harder in talks.\nEyeing a fourth term as chancellor, Merkel wants the SPD to agree to a re-run of the ‘grand coalition’ that has ruled Europe’s economic powerhouse since 2013.\nShe said she looked forward to intensive talks on forming a stable government and her priorities were preserving Germany’s economic strength and ensuring social justice and security.\nThe SPD vote will be a relief to investors who worry that policymaking, both at home and in Europe, has ground to a halt.\nMerkel, SPD leader Martin Schulz and the leader of Merkel’s Bavarian allies, Horst Seehofer, may meet on Monday and the full talks may start as early as Tuesday or Wednesday.\nSeehofer has said he expects a new government to be in place in the first half of March.\nHowever, a final coalition deal is far from guaranteed.\nThe SPD have demanded improvements to appeal to their wary 443,000 members who will be ballotted on any coalition deal. Many fear voters will punish them for sharing power with Merkel again.\nAfter Sunday’s closer-than-expected result, the pressure is on SPD leaders to deliver in key areas, such as abolishing the differences between public and private health insurance and allowing family reunions for asylum seekers.\nSchulz, whose career was on the line on Sunday, said the vote handed him a “duty to fight for all those who had voted against”. “Let us now concretely improve the lives of people in the country,” he tweeted on Sunday evening.\nThe SPD’s parliamentary leader Andrea Nahles vowed to negotiate “until the other side squeals”.\nMerkel has made clear that the blueprint will form the basis of negotiations but that many questions have yet to be clarified in detail.\nBoth parties suffered heavy losses to the far-right in a September vote and Merkel was weakened further by the collapse in November of three-way coalition talks with other parties, raising questions about her future.\nIn the blueprint, there is a clause that envisages a review of the next government’s progress after two years to assess if changes are needed. This has led to speculation that it would be a good time for Merkel to step down.\nReporting by Madeline Chambers; Editing by Adrian Croft\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T08:01:00.000+02:00", "crawled": "2018-01-22T20:44:33.023+02:00", "highlightTitle": ""}