{"organizations": [], "uuid": "6fadfde46586205693b5acf015bb63e525688d61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-caterpillar-reports-fourth-quarter-and-full-year-2017-results-provides-outlook-for-2018.html", "country": "US", "domain_rank": 767, "title": "Caterpillar Reports Fourth-Quarter and Full-Year 2017 Results; Provides Outlook for 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T15:30:00.000+02:00", "replies_count": 0, "uuid": "6fadfde46586205693b5acf015bb63e525688d61"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-caterpillar-reports-fourth-quarter-and-full-year-2017-results-provides-outlook-for-2018.html", "ord_in_thread": 0, "title": "Caterpillar Reports Fourth-Quarter and Full-Year 2017 Results; Provides Outlook for 2018", "locations": [], "entities": {"persons": [], "locations": [{"name": "ill.", "sentiment": "none"}, {"name": "deerfield", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "caterpillar", "sentiment": "negative"}, {"name": "caterpillar inc.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DEERFIELD, Ill., Jan. 25, 2018 /PRNewswire/ --\nFourth Quarter\nFull Year\n($ in billions except profit per share)\n2017\n2016\n2017\n2016\nSales and Revenues\n$12.9\n$9.6\n$45.5\n$38.5\nProfit (Loss) Per Share\n($2.18)\n($2.00)\n$1.26\n($0.11)\nAdjusted Profit Per Share\n$2.16\n$0.83\n$6.88\n$3.42\nFourth-quarter sales and revenues up 35 percent Broad-based sales recovery gained momentum in the fourth quarter of 2017 Fourth-quarter 2017 results include a charge of $2.4 billion, or $3.91 per share, from U.S. tax reform legislation Expect growth in many end markets in 2018 Implementing new strategy focused on operational excellence and profitable growth\nCaterpillar Inc. (NYSE: CAT) today announced fourth-quarter and full-year results for 2017.\nSales and revenues in the fourth quarter of 2017 were $12.9 billion, compared with $9.6 billion in the fourth quarter of 2016. Fourth-quarter 2017 loss was $2.18 per share, compared with a loss of $2.00 per share in the fourth quarter of 2016.\nFull-year sales and revenues in 2017 were $45.5 billion, up about 18 percent from $38.5 billion in 2016. Full-year profit was $1.26 per share in 2017, compared with a loss of $0.11 per share in 2016.\nAdjusted profit per share in the fourth quarter of 2017 was $2.16, compared with fourth-quarter 2016 adjusted profit per share of $0.83. Adjusted profit per share in 2017 was $6.88, compared with 2016 adjusted profit per share of $3.42.\nAdjusted profit per share excludes several large adjustments consisting of the impact of U.S. tax reform, restructuring costs, mark-to-market losses for remeasurement of pension and OPEB plans, state deferred tax valuation allowance adjustments, a gain on sale of an equity investment in 2017 and a goodwill impairment charge in 2016. A discussion of these items is included in Q&A #1 on page 14.\nCaterpillar's financial position continued to strengthen in the fourth quarter. Machinery, Energy & Transportation (ME&T) operating cash flow was $1.3 billion during the fourth quarter of 2017 and $5.5 billion for the full year of 2017. The ME&T debt-to-capital ratio was 36.7 percent at the end of 2017, compared to 41.0 percent at the end of 2016. The company ended 2017 with an enterprise cash balance of $8.3 billion. In the fourth quarter of 2017, the company made a discretionary contribution to U.S. pension plans of $1.0 billion and a payment for early debt retirement of $958 million.\n\"After four challenging years, many key markets improved in 2017, and our global team delivered strong results. We remained focused on operational excellence and made early investments in profitable growth initiatives as we began to implement our new strategy,\" said Caterpillar CEO Jim Umpleby.\n2018 Outlook\nCaterpillar is beginning 2018 with strong sales momentum resulting from strong order rates, lean dealer inventories and an increasing backlog. Additionally, there are positive economic indicators across most of the world and in many of the company's end markets. Caterpillar is preparing its factories and suppliers to be ready for continued growth, while remaining focused on managing with a flexible and competitive cost structure that should enable the company to respond quickly if economic fundamentals change.\nThe company expects 2018 profit per share in a range of $7.75 to $8.75. Excluding restructuring costs of about $400 million, adjusted profit per share is expected in a range of $8.25 to $9.25.\n\"We are in the early stages of implementing our strategy for profitable growth. In 2018, we expect to make additional investments in the expanded offerings and services important for Caterpillar's long-term success. We will use our Operating & Execution Model to bias resources to areas that represent the greatest opportunity for return on our investments,\" said Umpleby.\n\"Our focus on operational excellence will not waver as we work to develop a more competitive and flexible cost structure, including implementing lean manufacturing principles. We are positioned to capitalize on continued sales momentum or quickly adjust should conditions change,\" added Umpleby.\nFollowing is a summary of the key drivers of sales assumptions included in the outlook:\nConstruction Industries – The company expects growth in 2018 with some tempering in the latter part of the year, largely due to anticipated seasonality of sales in China. Caterpillar expects improvement in North American residential, non-residential and infrastructure. The outlook does not include any impact from a potential U.S. infrastructure bill. Europe and Asia/Pacific are expected to continue to grow, and the recovery that started in Africa/Middle East and Latin America is expected to extend into 2018.\nResource Industries – The company believes that global economic momentum and increasing commodity prices are restoring miners' business confidence and financial health. The company anticipates miners' capital spend to increase as mining businesses invest in equipment replacement cycles. Higher machine utilization levels should support continued strong aftermarket parts opportunities. Strong global demand is expected to be a positive for heavy construction.\nEnergy & Transportation – Sales into Oil and Gas applications are expected to increase in 2018, led by reciprocating engines for gas compression and well servicing in North America. The current turbines backlog is healthy in support of the midstream pipeline business. The company expects an increase in Transportation primarily from recent acquisitions in rail services, while the locomotive and marine markets are expected to remain challenged. Power Generation sales are forecast to be slightly up after a multi-year downturn. Sales into Industrial applications are expected to be about flat.\nFollowing are key points to help understand the elements of the 2018 profit outlook:\nAn expected increase in sales volume is the most significant reason for the higher profit outlook, with volume increases forecasted across the three primary segments. Slightly favorable price realization is expected to be mostly offset by material cost increases due to higher commodity prices. Period costs excluding short-term incentive compensation expense are expected to increase due to labor inflation and targeted investments in profitable growth initiatives, including expanded offerings and services. The outlook includes short-term incentive compensation expense of about $900 million. Financial Products' segment profit is expected to be lower in 2018 than in 2017, primarily due to the absence of about $100 million of gains on sales of securities in 2017. The outlook assumes a tax rate of 24 percent, including the company's current estimate of the impact of U.S. tax reform legislation. ME&T capital expenditures are expected to be about $1.0 billion to $1.5 billion. No stock repurchases are assumed in the outlook. The outlook does not include a mark-to-market gain or loss for remeasurement of pension and OPEB plans or changes to provisional estimates recorded in 2017 for U.S. tax reform.\nNotes:\nGlossary of terms is included on pages 17-18; first occurrence of terms shown in bold italics. Information on non-GAAP financial measures is included on page 19. Caterpillar will conduct a teleconference and live webcast, with a slide presentation, beginning at 10 a.m. Central Time on Thursday, January 25, 2018, to discuss its 2017 fourth-quarter and full-year financial results. The accompanying slides will be available before the webcast on the Caterpillar website at http://www.caterpillar.com/investors/events-and-presentations .\nAbout Caterpillar:\nFor more than 90 years, Caterpillar Inc. has been making sustainable progress possible and driving positive change on every continent. Customers turn to Caterpillar to help them develop infrastructure, energy and natural resource assets. With 2017 sales and revenues of $45.462 billion, Caterpillar is the world's leading manufacturer of construction and mining equipment, diesel and natural gas engines, industrial gas turbines and diesel-electric locomotives. The company principally operates through its three primary segments - Construction Industries, Resource Industries and Energy & Transportation - and also provides financing and related services through its Financial Products segment. For more information, visit caterpillar.com . To connect with us on social media, visit", "external_links": ["http://www.caterpillar.com/investors/events-and-presentations", "https://mma.prnewswire.com/media/633266/Caterpillar_4Q_and_full_year_2017_highlights.pdf?p=original", "http://www.caterpillar.com/en.html"], "published": "2018-01-25T15:30:00.000+02:00", "crawled": "2018-01-25T17:35:24.001+02:00", "highlightTitle": ""}