{"organizations": [], "uuid": "e76e112791811ae7e827819fe5e0a965cc9a626c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221327701&w=1200&r=LYNXMPEE0B05B", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-fski-harlaut/no-big-air-or-big-hair-harlaut-eyes-slopestyle-gold-idUSKBN1F10AE", "country": "US", "domain_rank": 408, "title": "No big air or big hair, Harlaut eyes slopestyle gold", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T05:48:00.000+02:00", "replies_count": 0, "uuid": "e76e112791811ae7e827819fe5e0a965cc9a626c"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-fski-harlaut/no-big-air-or-big-hair-harlaut-eyes-slopestyle-gold-idUSKBN1F10AE", "ord_in_thread": 0, "title": "No big air or big hair, Harlaut eyes slopestyle gold", "locations": [], "entities": {"persons": [{"name": "harlaut", "sentiment": "none"}, {"name": "philip o'connor", "sentiment": "none"}, {"name": "henrik harlaut", "sentiment": "none"}], "locations": [{"name": "breckenridge", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": [{"name": "min read  stockholm", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STOCKHOLM (Reuters) - The flowing dreadlocks may be gone but the free spirit of Swedish slopestyle skier Henrik Harlaut remains, and the four-time X Games champion is aiming for gold in Pyeongchang.\nHarlaut’s combination of wild hair, low-hanging trousers and a spectacular fall when slopestyle made its debut at the 2014 Sochi Olympics made him an instant visual hit, as he went on to claim sixth place and win thousands of new fans.\nHis recent slopestyle victory in Breckenridge, Colorado where he led the field with a score of 95 from the judges after pulling off a dizzying 1620-degree spin during his run, indicates an ambitious skier in form.\n“I‘m just so, so happy,” he told reporters afterwards. “I’ve never pulled off that trick in competition before, and I’ve only ever done it three times.”\nA committed vegetarian, Harlaut chopped of his dreads last year to make wearing a helmet more comfortable.\n“I’ve cut it a few times, I’ve saved the original (dreads) that I had at the Olympics in a box in my apartment in Andorra,” he told Swedish radio in a recent interview.\nBorn in Stockholm, Harlaut moved to the Swedish skiing paradise of Are as a child and was both a promising hockey player and Alpine skier before turning to the breathtaking twists and tricks that make up freestyle skiing.\nFILE PHOTO: Sweden's Henrik Harlaut performs a jump during the men's freestyle skiing slopestyle qualification round at the 2014 Sochi Winter Olympic Games in Rosa Khutor February 13, 2014. REUTERS/Dylan Martinez/File Photo Though he is one of the world’s best slopestyle skiers, the 26-year-old is even more accomplished in the big air event, where competitors fly off a ramp before performing tricks to impress the judges.\nUnfortunately for Harlaut, a four-time X Games big air gold medallaist and World Cup winner, the discipline is only available for snowboarders in the current Olympic program but may be included for skiers from the Beijing Games in 2022.\n“If snowboarding (big air) is included, then skiing should also be included, as it’s at least as spectacular to watch,” Harlaut said.\nBoth laid back and ambitious, Harlaut splits his energies between competing and filming his exploits on the snow.\n”Competition pushes me to try new, crazy tricks that haven’t been done yet, and to do it with the maximum amount of style.\n“Filming helps me push my style even more because then you have the time to make it exactly how you would like it to be,” he said.\nThough he might have to wait four more years to compete in his preferred big air event, Harlaut heads to Pyeongchang determined to win slopestyle gold for Sweden.\n“In my head, I‘m unbeatable. I don’t want to sound cocky or anything, but you’ve got be like that in your thoughts,” he said.\nReporting by Philip O'Connor; Editing by John O'Brien\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-12T05:48:00.000+02:00", "crawled": "2018-01-12T05:59:17.004+02:00", "highlightTitle": ""}