{"organizations": [], "uuid": "c1d006309f8b3eadb1c197b3f709c5e0becc1bef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-apollo-investment-corporation-schedules-earnings-release-and-conference-call-for-third-quarter-of-fiscal-year-2018.html", "country": "US", "domain_rank": 767, "title": "Apollo Investment Corporation Schedules Earnings Release and Conference Call for Third Quarter of Fiscal Year 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.24, "site_type": "news", "published": "2018-01-04T00:00:00.000+02:00", "replies_count": 0, "uuid": "c1d006309f8b3eadb1c197b3f709c5e0becc1bef"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-apollo-investment-corporation-schedules-earnings-release-and-conference-call-for-third-quarter-of-fiscal-year-2018.html", "ord_in_thread": 0, "title": "Apollo Investment Corporation Schedules Earnings Release and Conference Call for Third Quarter of Fiscal Year 2018", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "apollo investment corporation", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Apollo Investment Corporation (NASDAQ: AINV) (the “Company”) announced today that it will report results for the quarter ended December 31, 2017 prior to the opening of the financial markets on Wednesday, February 7, 2018.\nThe Company will also host a conference call on Wednesday, February 7, 2018 at 10:00 a.m. Eastern Time. All interested parties are welcome to participate in the conference call by dialing (888) 802-8579 approximately 5-10 minutes prior to the call; international callers should dial (973) 633-6740. Participants should reference Apollo Investment Corporation or Conference ID # 3669008 when prompted. A simultaneous webcast of the conference call will be available to the public on a listen-only basis and can be accessed through the Event Calendar in the Investor Relations section of our website at www.apolloic.com . Following the call, you may access a replay of the event either telephonically or via audio webcast. The telephonic replay will be available approximately two hours after the live call and through February 28, 2018 by dialing (800) 585-8367; international callers please dial (404) 537-3406, reference Conference ID # 3669008. A replay of the audio webcast will also be available later that same day. To access the audio webcast please visit the Event Calendar in the Investor Relations section of our website at www.apolloic.com .\nAbout Apollo Investment Corporation\nApollo Investment Corporation (NASDAQ: AINV) is a closed-end investment company that has elected to be treated as a business development company under the Investment Company Act of 1940. The Company invests primarily in various forms of debt investments, including secured and unsecured debt, loan investments, and/or equity in private middle-market companies. The Company may also invest in the securities of public companies and structured products and other investments such as collateralized loan obligations and credit-linked notes. The Company seeks to provide private financing solutions for private companies that do not have access to the more traditional providers of credit. Apollo Investment Corporation is managed by Apollo Investment Management, L.P., an affiliate of Apollo Global Management, LLC, a leading global alternative investment manager. For more information, please visit www.apolloic.com .\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements involve risks and uncertainties, including, but not limited to, statements as to our future operating results; our business prospects and the prospects of our portfolio companies; the impact of investments that we expect to make; our contractual arrangements and relationships with third parties; the dependence of our future success on the general economy and its impact on the industries in which we invest; the ability of our portfolio companies to achieve their objectives; our expected financings and investments; the adequacy of our cash resources and working capital; and the timing of cash flows, if any, from the operations of our portfolio companies.\nWe may use words such as “anticipates,” “believes,” “expects,” “intends,” “will,” “should,” “may” and similar expressions to identify forward-looking statements. Such statements are based on currently available operating, financial and competitive information and are subject to various risks and uncertainties that could cause actual results to differ materially from our historical experience and our present expectations. Statements regarding the following subjects, among others, may be forward-looking: the return on equity; the yield on investments; the ability to borrow to finance assets; new strategic initiatives; the ability to reposition the investment portfolio; the market outlook; future investment activity; and risks associated with investing in real estate assets, including changes in business conditions and the general economy. Undue reliance should not be placed on such forward-looking statements as such statements speak only as of the date on which they are made. We do not undertake to update our forward-looking statements unless required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180103005851/en/\nApollo Investment Corporation\nElizabeth Besen, 212-822-0625\nInvestor Relations Manager\nebesen@apollolp.com\nSource: Apollo Investment Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.apolloic.com&esheet=51737178&newsitemid=20180103005851&lan=en-US&anchor=www.apolloic.com&index=1&md5=62ac2e346816cdac4dc847130e1d2fae", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.apolloic.com&esheet=51737178&newsitemid=20180103005851&lan=en-US&anchor=www.apolloic.com&index=2&md5=92d8c3c1c4f23cf55ef732a1ddd64a58", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.apolloic.com&esheet=51737178&newsitemid=20180103005851&lan=en-US&anchor=www.apolloic.com&index=3&md5=ae45e270b86cc6857ffe5a824df51316", "http://www.businesswire.com/news/home/20180103005851/en/"], "published": "2018-01-04T00:00:00.000+02:00", "crawled": "2018-01-04T00:23:11.003+02:00", "highlightTitle": ""}