{"organizations": [], "uuid": "19aa8f2423ea16840b78965e18544459a993a367", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-mimecast-doubles-down-on-cyber-resilience-for-email-with-two-key-executive-appointments.html", "country": "US", "domain_rank": 767, "title": "Mimecast Doubles Down on Cyber Resilience for Email with Two Key Executive Appointments", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T16:30:00.000+02:00", "replies_count": 0, "uuid": "19aa8f2423ea16840b78965e18544459a993a367"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-mimecast-doubles-down-on-cyber-resilience-for-email-with-two-key-executive-appointments.html", "ord_in_thread": 0, "title": "Mimecast Doubles Down on Cyber Resilience for Email with Two Key Executive Appointments", "locations": [], "entities": {"persons": [{"name": "mimecast", "sentiment": "none"}, {"name": "janet levesque", "sentiment": "none"}, {"name": "janet", "sentiment": "none"}, {"name": "marc french", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "lexington", "sentiment": "none"}, {"name": "mimecast", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LEXINGTON, Mass., Jan. 23, 2018 (GLOBE NEWSWIRE) -- Mimecast Limited (NASDAQ:MIME), a leading email and data security company, today announced Janet Levesque was appointed the Senior Vice President of Systems, Risk and Security, and Marc French has joined the company as its new Chief Trust Officer. These two newly developed leadership roles demonstrate Mimecast’s commitment to providing customers with cloud-based solutions to enhance their cyber resilience. Both of these important hires bring additional expertise to Mimecast to fortify our defenses and deliver better service to our customers.\nAs Senior Vice President of Systems, Risk and Security, Janet Levesque is responsible for global oversight of the internal technology application, security, infrastructure and risk teams. Janet will ensure security and technology are top priorities across the organization. She brings more than 25 years of progressive leadership experience across areas including information technology, security, technical audit and risk management. Most recently, Janet was the Chief Information Security Officer at RSA, the Security Division of Dell/EMC, where she led the enterprise information security, governance, risk and compliance programs. Prior to RSA, Janet established the information security and compliance program at Aspect Software as CIO.\nAs the new Chief Trust Officer, Marc French is responsible for driving a global strategy to help ensure customer confidence in Mimecast products and services. Mark is tasked with elevating the three pillars of trust: security, privacy, and transparency. He has been appointed Mimecast’s Data Protection Officer (DPO) and he will lead the company’s efforts to support the General Data Protection Regulation (GDPR), a new European privacy law due to take effect in May 2018. Marc joins Mimecast from Constant Contact, which was acquired by Endurance International Group, where he served as Chief Security Officer. He was responsible for all facets of security, compliance and privacy for this global multi-billion-dollar organization. Previously, he spent several years in senior security roles at EMC, RSA, Iron Mountain, Digital Guardian, and Dun & Bradstreet.\n“Mimecast is dedicated to enhancing the capabilities of its services to align with new privacy policies and cyber resilience requirements that are challenging organizations today, like GDPR, Australia’s Notifiable Data Breach regime, and POPI requirements in South Africa. We are doing this by ensuring we have the strongest team of leaders to help drive the company vision,” said Peter Bauer, chief executive officer at Mimecast. “\nLate last year, we welcomed Stephen Ward, TIAA’s Chief Information Security Officer, to our board of directions, and today we’re excited to welcome Janet and Marc as they bring deep experience in cybersecurity and IT business risk to Mimecast’s executive team.”\nAdditional Resources:\nMeet Mimecast’s Leadership team Visit the Trust Center for more Information on Mimecast Certifications, Attestations, and Assessments Download the Simplify GDPR Compliance for Email solutions brief Read Garret O’Hara’s blog post on Australia’s Notifiable Data Breach regime\nAbout Mimecast\nMimecast (NASDAQ:MIME) makes business email and data safer for 28,200 customers and their millions of employees worldwide. Founded in 2003, the company's next-generation cloud-based security, archiving and continuity services protect email and deliver comprehensive email risk management.\nMimecast Social Media Resources\nLinkedIn: Mimecast\nFacebook: Mimecast\nTwitter: @Mimecast\nBlog: Mimecast blog\nPress Contact\nAlison Raymond Walsh\nPress@Mimecast.com\n617-393-7126\nInvestor Contact\nRobert Sanders\nInvestors@Mimecast.com\n617-393-7074\nSource:Mimecast Limited", "external_links": ["https://www.mimecast.com/blog/2017/12/getting-ready-for-australias-mdb/", "https://www.mimecast.com/company/mimecast-trust-center/", "https://www.globenewswire.com/Tracker?data=73Azta3PSyoVEIvN0RoPQHO9eNvn8bRQjgWrwWhTebI1ELj2mxq2b8shkje37aKwdPhwYVv15zQ2fdLfFlaRYg3-BlMRtkqihbewc4CmKRI=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/533b3e10-830d-4abe-b59a-0cb7c420582f", "https://www.mimecast.com/company/leadership/", "https://www.globenewswire.com/Tracker?data=73Azta3PSyoVEIvN0RoPQL5JQw8nIbg2PQzwn3JjmNU88LbMQHZ7g4czjcxgUJPb0t9fpfEq7pTfKq8vlmXUwA==", "https://www.globenewswire.com/Tracker?data=73Azta3PSyoVEIvN0RoPQHLGo4efzh_1VYWGA5Xal7VEoRGZuLJsb8jg5H_iQWULpjp3Gl2PH0nO5UUV_xQJ7wNV3hepd2-5cJ6T4_yoRV8=", "https://www.globenewswire.com/Tracker?data=wCaj5JY4deXh5ZfkmPyJ1_06CBp9h3ATR2b4msIZNALvxrKOcW60R9T8kATrYogWYMd-XbUHRYywsD-hxZ4xxA==", "https://www.mimecast.com/globalassets/documents/solutionbriefs/eu-gdpr-sb.pdf", "https://www.globenewswire.com/Tracker?data=73Azta3PSyoVEIvN0RoPQB091wuvxJf5r5aPh7mNCf9gMglhsGHDGiA6XlUuZGcRoRZ96Rb2WAm5gnO4W-nvJg=="], "published": "2018-01-23T16:30:00.000+02:00", "crawled": "2018-01-23T17:32:23.012+02:00", "highlightTitle": ""}