{"organizations": [], "uuid": "f735a243d7209ff94f0c3f97762b78095122d3af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219047758&w=1200&r=LYNXMPEE020NX", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-alps-vonn/alpine-skiing-speed-queen-vonn-ready-for-battle-in-pyeongchang-idUSKBN1ES10G", "country": "US", "domain_rank": 408, "title": "Alpine skiing: Speed queen Vonn ready for battle in Pyeongchang", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T15:05:00.000+02:00", "replies_count": 0, "uuid": "f735a243d7209ff94f0c3f97762b78095122d3af"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-alps-vonn/alpine-skiing-speed-queen-vonn-ready-for-battle-in-pyeongchang-idUSKBN1ES10G", "ord_in_thread": 0, "title": "Alpine skiing: Speed queen Vonn ready for battle in Pyeongchang", "locations": [], "entities": {"persons": [{"name": "vonn", "sentiment": "negative"}, {"name": "lindsey vonn", "sentiment": "none"}], "locations": [{"name": "pyeongchang", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "lake louise", "sentiment": "none"}], "organizations": [{"name": "carroll", "sentiment": "none"}, {"name": "min read  los angeles", "sentiment": "none"}, {"name": "vail daily", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES (Reuters) - Lindsey Vonn has vowed not to take the safe option at what are likely to be her last Winter Olympics next month despite being dogged by questions about her health after recent crashes.\nThe 33-year-old American is the most successful World Cup women’s skier of all time with 78 victories while clinching four overall titles, but has only two Olympic medals -- a gold in downhill and bronze in super-G, both won in Vancouver in 2010.\nIn recent competitions, however, Vonn has seen a mix of crashes and wins, making her chances in Pyeongchang difficult to handicap.\nIn early December she crashed twice at Canada’s Lake Louise, where she has a long history of success, before racing to a super-G World Cup win at Val d‘Isere in France two weeks later.\n“As long as I‘m healthy and I‘m confident, then I’ll be in a great position when I get to Pyeongchang,” she told the Vail Daily in November.\n”Everyone asks me if I‘m afraid, after so many crashes do I take my foot off the gas pedal? And while I am smarter and I try to manage my risk better than I have in the past, it’s still ski racing.\n“You can try to manage risk as much as you want, but at the end of the day, it’s a dangerous sport.”\nFILE PHOTO: Olympic gold medalist skier Lindsey Vonn poses for a portrait in New York City, U.S., November 1, 2017. REUTERS/Carlo Allegri/File Photo Managing risk has been on her mind for the past four years after she missed the 2014 Sochi Olympics due to a right knee injury.\nIt was arguably the most serious of a career that had been relatively injury free during her first decade as a professional as she became a household name for her exploits on the slopes and off them, courtesy of a high-profile relationship with golfer Tiger Woods.\nSince the February 2013 crash that contributed to her missing the Sochi Games she has endured a series of setbacks that include multiple broken bones, surgeries and grueling rehabilitations.\n“I‘m 33, I’ve been injured quite a few times, but my passion for the sport has never changed,” she said.\n”Since I started skiing and started racing when I was eight years old, I’ve loved what I do, and I don’t want to stop doing it.\n”As long as I‘m enjoying it and I don’t have to use too much duct tape to hold my body together, I‘m good.\n“I‘m focused on winning the World Cups, but just getting to February healthy is the only thing I should be really focused on.”\nEditing by Greg Stutchbury\n ", "external_links": [], "published": "2018-01-03T15:05:00.000+02:00", "crawled": "2018-01-03T15:28:41.002+02:00", "highlightTitle": ""}