{"organizations": [], "uuid": "b67f389152482d2cd036205667ff270a29b773e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/30/reuters-america-corrected-update-2-oil-prices-extend-declines-on-stronger-dollar-rising-u-s-output.html", "country": "US", "domain_rank": 767, "title": "CORRECTED-UPDATE 2-Oil prices extend declines on stronger dollar, rising U.S. output", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T09:44:00.000+02:00", "replies_count": 0, "uuid": "b67f389152482d2cd036205667ff270a29b773e9"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/30/reuters-america-corrected-update-2-oil-prices-extend-declines-on-stronger-dollar-rising-u-s-output.html", "ord_in_thread": 0, "title": "CORRECTED-UPDATE 2-Oil prices extend declines on stronger dollar, rising U.S. output", "locations": [], "entities": {"persons": [{"name": "stephen innes", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "oanda", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "output@ (Corrects paragraph 12 to drop dollar symbol before index levels)\n* Drillers in US added 12 rigs in week to Jan. 26 -Baker Hughes\n* U.S. oil output soon expected to exceed 10 mln bpd\n* Oil prices still on track for fifth straight monthly gain\nTOKYO, Jan 30 (Reuters) - Oil prices fell on Tuesday for a second day as rising U.S. output and a strengthening dollar sapped demand for crude, pushing Brent below $69 a barrel for the first time in six days.\nBrent crude futures, the global benchmark, had declined 49 cents, or 0.7 percent, to $68.97 a barrel by 0522 GMT, after earlier dropping as low as $68.91. The contract for March delivery settled down $1.06, or 1.5 percent, at $69.46 a barrel on Monday.\nU.S. West Texas Intermediate crude futures dropped 70 cents, or 1.1 percent, to $64.86 a barrel. On Monday, they fell 58 cents, or 0.9 percent, to $65.56.\nPrices are still heading for a fifth straight monthly gain.\n\"Markets remain fragile to the downside,\" said Stephen Innes, head of trading for Asia-Pacific at futures brokerage Oanda in Singapore, citing a jump in the number of rigs drilling for oil in the United States.\nU.S. production is already on par with Saudi Arabia, the biggest producer in the Organization of the Petroleum Exporting Countries (OPEC). Only Russia produces more, averaging 10.98 million barrels per day (bpd) in 2017.\nU.S. output <C-OUT-T-EIA> has jumped more than 17 percent since mid-2016 and is expected to exceed 10 million bpd soon.\nDrillers in the U.S. added 12 oil rigs for new production in the week to Jan. 26, Baker Hughes reported on Friday.\nThe recent rally in oil prices had been fuelled by the U.S. dollar's six straight weekly slides. The greenback is down 3 percent so far this month.\nOil is priced in the greenback, so a falling dollar can boost demand for crude from buyers using other currencies.\nThe dollar index had been below 90 since Jan. 24, falling below 89 on Friday. But the index has rebounded since then to around 89.37, which has weighed on crude prices.\nInvestors are bracing \"for the upcoming refinery maintenance season amid a strong USD,\" ANZ Research said in a note.\nCrude prices may also be under pressure on expectations for U.S. inventories to rise for the first time in 11 weeks, according to a preliminary poll by Reuters on Monday.\n(Additional reporting by Henning Gloystein; Editing by Christian Schmollinger and Joseph Radford)", "external_links": [], "published": "2018-01-30T09:44:00.000+02:00", "crawled": "2018-01-30T15:12:46.010+02:00", "highlightTitle": ""}