{"organizations": [], "uuid": "9dcf7407f13ac153e177e5a86a1810c01257c93e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 82, "shares": 82, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/03/08/104329423-GettyImages-536216810.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/nucor-ceo-us-desperately-needs-new-infrastructure-steel-tariffs.html", "country": "US", "domain_rank": 767, "title": "Nucor CEO: US 'desperately' needs new infrastructure, steel tariffs", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-31T01:25:00.000+02:00", "replies_count": 0, "uuid": "9dcf7407f13ac153e177e5a86a1810c01257c93e"}, "author": "Elizabeth Gurdus", "url": "https://www.cnbc.com/2018/01/30/nucor-ceo-us-desperately-needs-new-infrastructure-steel-tariffs.html", "ord_in_thread": 0, "title": "Nucor CEO: US 'desperately' needs new infrastructure, steel tariffs", "locations": [], "entities": {"persons": [{"name": "mad money", "sentiment": "negative"}, {"name": "jim cramer top", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "jim cramer", "sentiment": "none"}, {"name": "john ferriola", "sentiment": "none"}, {"name": "ferriola", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}], "organizations": [{"name": "nucor", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ahead of President Donald Trump's State of the Union address on Tuesday, Nucor Chairman and CEO John Ferriola told CNBC that he wanted to hear a number of things from the country's chief.\n\"We'd like to hear some message on trade relief, trade actions, to deal with this illegally traded product that continues to flow into our country,\" Ferriola told \" Mad Money \" host Jim Cramer.\n\"We'd also like to see some action on an infrastructure bill,\" the CEO said. \"We're all seeing a robust recovery in the economy. That cannot be sustained without having a strong, modern, 21st-century infrastructure system, and we don't have that today. We need it desperately to maintain momentum in the economy.\"\nFerriola's first concern relates to Chinese steel dumping , or the practice of keeping steel costs artificially low to stifle foreign competition.\nThis hurts U.S.-based steel producers, many of which have had to shutter factories and curb production because they are unable to rival China's low prices.\nFerriola told Cramer on Tuesday that in 2017, Chinese steel imports \"captured 27 percent of [Nucor's] market.\"\nAs a result, companies like Nucor have been pushing for Trump and Commerce Secretary Wilbur Ross to use the Trade Expansion Act to place tariffs on or ban Chinese steel imports altogether.\nFerriola said it made \"no sense\" to him why congressional Democrats, who favor workers' rights, and congressional Republicans, who are pro-capital, haven't made serious efforts to support the tariffs.\n\"We all understand the need for a strong national defense. There's no way you can have a strong national defense, strong national security, without having a robust and sustainable steel industry,\" the CEO said.\nFerriola was still \"optimistic about 2018,\" citing tax reform, the potential for \"a much-needed infrastructure bill\" and the potential for trade discussions like these to result in legislation.\nThe CEO added that the optimism among his company's customers, which include automotive and energy companies, is the best he and his colleagues have seen since 2004.\nBut for Ferriola, many of the steel industry's prospects and economic contributions hinge on the fate of the proposed steel tariffs.\n\"[Our competitors have] about 3 blast furnaces in the United States that are currently shut down,\" Ferriola told Cramer. \"If you were to start those up, ... they would create an enormous number of jobs in our industry and supply about 10 million tons into our industry, more than what we would need to deal with the demand that we expect to see in 2018 and beyond.\"\nWatch John Ferriola's full interview here: show chapters Top steel CEO says US 'desperately' needs new infrastructure to sustain economic boom 21 Hours Ago | 08:57 Disclosure: Cramer's charitable trust owns shares of Nucor.\nQuestions for Cramer?\nCall Cramer: 1-800-743-CNBC\nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine\nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com", "external_links": [], "published": "2018-01-31T01:25:00.000+02:00", "crawled": "2018-01-31T01:24:59.005+02:00", "highlightTitle": ""}