{"organizations": [], "uuid": "6f0028ad7583cc1755787905a1d03ce9ed4a7fcb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/11/25/102217660-20141123-5964-903.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/here-are-the-stores-macys-is-closing-next.html", "country": "US", "domain_rank": 767, "title": "Here are the stores Macy's is closing next", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.148, "site_type": "news", "published": "2018-01-04T20:00:00.000+02:00", "replies_count": 0, "uuid": "6f0028ad7583cc1755787905a1d03ce9ed4a7fcb"}, "author": "Lauren Thomas", "url": "https://www.cnbc.com/2018/01/04/here-are-the-stores-macys-is-closing-next.html", "ord_in_thread": 0, "title": "Here are the stores Macy's is closing next", "locations": [], "entities": {"persons": [{"name": "macy", "sentiment": "negative"}, {"name": "adam jeffery", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "cincinnati", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}], "organizations": [{"name": "macy's", "sentiment": "neutral"}, {"name": "cnbc macy", "sentiment": "none"}, {"name": "macy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Here are the stores Macy's is closing next Macy's is closing close to a dozen stores early this year. The moves are part of a previously announced plan to trim the retailer's massive store fleet and cut back on expenses. Locations being closed include those in San Francisco, Cincinnati and Miami. CNBC.com SHARES \nMacy's will close nearly a dozen stores early this year, as part of a previously announced plan to trim the retailer's massive store fleet and cut back on expenses. \nAbout this same time last year, Macy's released more than 60 locations that would close in 2017, saying 100 total closures would take place over time. Eleven stores were officially added to that list Thursday. (See a full list of locations below.) Adam Jeffery | CNBC Macy's flagship store in New York. \nThe department store chain said it's nearing the completion of 81 of the 100 planned closures, with the 19 remaining locations having yet to be announced. Since 2015, Macy's has closed more than 120 stores. \nThe closures, along with other efforts, should help Macy's save as much as $300 million in expenses annually, starting in fiscal 2018, which will be reinvested back into the business, the company said. The closures will also result in about 5,000 job cuts. \n\"While closing a store is always a difficult decision because of the impact on our customers, our associates and the community, Macy's is delighted to have served these communities over the years,\" a spokeswoman said in a statement. \nThe Cincinnati-based retailer has said it wants to focus on its best real estate while investing more in its web operations, in a push to win more shoppers online. In recent months, foot traffic has also been steadily declining at many of America's less-profitable malls. \nMacy's shares have fallen more than 25 percent over the past 12 months, and the stock was down more than 3 percent Thursday on this news. \nThe following Macy's stores are closing in early 2018. In most cases, clearance sales will begin on Jan. 8 and run for up to 12 weeks. \nLaguna Hills Mall, Laguna Hills, CA Westside Pavilion, Los Angeles, CA Novato (Furniture), Novato, CA Stonestown Galleria, San Francisco, CA The Oaks, Gainesville, FL Magic Valley Mall, Twin Falls, IDHoney Creek Mall, Terre Haute, IN Birchwood Mall, Fort Gratiot Township, MI Fountain Place, Cincinnati, OH Burlington Town Center, Burlington, VT WATCH: Macy's warns despite solid holiday sales and tax cuts show chapters", "external_links": [], "published": "2018-01-04T20:00:00.000+02:00", "crawled": "2018-01-04T20:02:13.000+02:00", "highlightTitle": ""}