{"organizations": [], "uuid": "4c38a442ca2682164efd034e8553bb68323f8b0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-oil-refining-margins/crumbling-refinery-profits-threaten-opec-led-crude-rally-idUSKBN1FB1HF", "country": "US", "domain_rank": 408, "title": "Crumbling refinery profits threaten OPEC-led crude rally", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T20:12:00.000+02:00", "replies_count": 0, "uuid": "4c38a442ca2682164efd034e8553bb68323f8b0b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-oil-refining-margins/crumbling-refinery-profits-threaten-opec-led-crude-rally-idUSKBN1FB1HF", "ord_in_thread": 0, "title": "Crumbling refinery profits threaten OPEC-led crude rally", "locations": [], "entities": {"persons": [{"name": "jonathan leitch", "sentiment": "none"}, {"name": "wood mackenzie", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "u.s. gulf coast", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - The recent OPEC-led rally in crude prices is hitting refinery profits hard, flashing warning signs over oil’s bull run.\nA wave of refinery maintenance scheduled in spring could also put downward pressure on crude, analysts said.\nHigher oil prices typically quench consumption and squeeze profit margins at refiners that convert the feedstock into gasoline, diesel and aviation fuels.\nBenchmark profit margins in key refining hubs dropped sharply in recent weeks - by over 50 percent in the U.S. Gulf Coast and northwest Europe, Reuters data shows - increasing expectations that some refiners will reduce operating rates.\n“Margins have suffered and the biggest factor behind the weak margins we’ve seen is the run-up in crude prices,” said Jonathan Leitch, research director with‎ consultancy Wood Mackenzie.\nCrude prices have gained more than 50 percent since June, as production cuts by OPEC and a number of non-OPEC oil producers increasingly bite into global inventories.\nBut while crude stocks tumbled at increasingly higher rates throughout 2017, refineries around the world continued to run at record levels to meet demand and lock in strong margins.\nThe lag between the gain in crude prices and the decline in refining margins led in turn to a rise in stocks of products.\nIn the fourth quarter of 2017, refinery runs hit a record 81.5 million barrels per day (bpd), International Energy Agency data shows, tipping fuel supply into excess and sending cargoes into storage tanks after a year of drawdowns.\nAnd according to analysts FGE, fuel stocks in Europe, Singapore and the United States built by some 27.5 million barrels in the first two weeks of 2018.\nStocks are expected to grow further in coming weeks, a trend exacerbated by the rising oil price, which Wood Mackenzie says leads shippers to save fuel by reducing vessel speed and prompts power plants to use cheaper energy sources instead of fuel oil.\n“Refining margins are looking very shaky,” a European trader said. “Everyone’s asking each other about run cuts.”\nThe crude price also has a major impact on the operating costs of refiners, which consume more than 5 percent of the feedstock to power their plants.\nMAINTENANCE BOOST Margins are expected to receive a boost in coming months as plants close for seasonal maintenance before demand peaks in summer.\nBut that will likely put further pressure on crude prices as demand ebbs, while freeing up crude oil supplies.\nThis year, a large slate of maintenance closures in the Middle East, particularly Saudi Arabia, will take fuels off the market – underpinning margins worldwide.\nIn March, more than 900,000 bpd of refinery capacity will go offline in the Middle East, according to Energy Aspects, due in large part to work at Saudi Arabia’s 400,000-bpd Yanbu refinery.\n“Refineries are going to need to run flat out to meet that and they’re going to need a good margin to do so,” Leitch said. “Our forecast is that crude prices have hit the top and prices will come down.”\nReporting by Libby George and Ron Bousso; Editing by Dale Hudson\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T20:12:00.000+02:00", "crawled": "2018-01-23T17:51:49.023+02:00", "highlightTitle": ""}