{"organizations": [], "uuid": "d7044faf0941f89a37e1eb304705685bf278cc44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-worldas-premier-hr-technology-conference-and-content-leader-acquires-hrm-asia.html", "country": "US", "domain_rank": 767, "title": "World’s Premier HR Technology Conference and Content Leader Acquires HRM Asia", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-22T18:03:00.000+02:00", "replies_count": 0, "uuid": "d7044faf0941f89a37e1eb304705685bf278cc44"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-worldas-premier-hr-technology-conference-and-content-leader-acquires-hrm-asia.html", "ord_in_thread": 0, "title": "World’s Premier HR Technology Conference and Content Leader Acquires HRM Asia", "locations": [], "entities": {"persons": [{"name": "rebecca mckenna", "sentiment": "none"}], "locations": [{"name": "asia horsham", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}], "organizations": [{"name": "technology conference & exposition", "sentiment": "none"}, {"name": "lrp publications", "sentiment": "none"}, {"name": "diversified communications", "sentiment": "none"}, {"name": "hrm asia pte ltd", "sentiment": "none"}, {"name": "hrm magazine", "sentiment": "none"}, {"name": "hre", "sentiment": "none"}, {"name": "hrm asia congress series", "sentiment": "none"}, {"name": "hrm asia", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HORSHAM, Pa. and SINGAPORE, Jan. 22, 2018 (GLOBE NEWSWIRE) -- Human Resource Executive ® (HRE) magazine, organizer of the award-winning HR Technology Conference & Exposition ® , the world’s largest independent event dedicated to HR technology, announced today the acquisition of Singapore-based HRM Asia Pte Ltd ., a business unit of Diversified Communications. HRM Asia, a multi-platform network providing an array of thought-leading HR discussion and information to HR professionals of all ranks in Asia-Pacific, will globally expand the portfolio of HRE and its parent company, LRP Publications, in the region beyond its annual HR Tech China Conference. Assets attained include three world-class events: HR Summit & Expo, Smart Workforce Summit, the HRM Asia Congress Series; the popular annual HRM Readers’ Choice Awards, HRM Magazine and digital content.\n“As the leader in HR technology conferences and content, this acquisition is a logical progression in our global growth plan,” said Rebecca McKenna, Vice President of Global Events and Human Resource Executive ® Publisher. “It’s particularly exciting to deepen our relationships with multi-national vendors and HR professionals who are seeking to expand their position across APAC.”\nHuman Resource Executive ® magazine is a print and online publication covering important HR subjects such as HR technology, employee engagement, performance management, organizational leadership and career development. The award-winning HR Technology Conference & Exposition ® , indisputably the world’s largest independent event dedicated to propelling success in business through HR technology, is LRP’s global flagship event in the HR technology category.\n“The Asia-Pacific region is a prime source of business growth and qualified talent,” said Kenneth Kahn, President of LRP Publications and LRP Conferences, producers of the HR Tech Conference and publishers of Human Resource Executive ® magazine. “It’s also a region that has been at the forefront of HR technology trends, especially in its adoption of mobile technologies. HRM Asia has been influential in providing this community with relevant thought leadership.”\nKahn continued, “This acquisition enables us to reach even more HR professionals, regardless of where they are in their career path, by delivering quality global content, locally.”\nDiversified Communications’ Corporate Vice President, Oakley Dyer adds, “These HR conferences and publications fit perfectly within LRP’s existing portfolio and the sale is part of our strategy to narrow our geographic focus, while still investing in new industries that complement our existing portfolio.”\nHRM Asia will continue to operate under its own brand. Terms of the deal were not disclosed.\nFor all LRP and Human Resource Executive ® press inquiries, please contact Rennette Fortune, Public Relations Manager at 1-561-622-6520 or rfortune@lrp.com . For all Diversified Communications inquiries, please contact Oakley Dyer, Corporate Vice President – Strategy & Corporate Development at 1-207-842-5633 or odyer@divcom.com .\nAbout the HR Technology Conference & Exposition ®\nFounded in 1997, the HR Technology Conference is the world’s leading independent event on HR technology covering all the latest trends — Talent Acquisition, Employee Engagement, Diversity & Inclusion, Big Data and more! From strategy and selection to post-implementation, HR Tech is a pivotal stop for all organizations on their HR journey. Featuring more than 70 presentations delivered by senior executives from leading organizations, HR Tech never sells speaking slots, resulting in a high-caliber learning experience with real-world lessons and practical takeaways. HR Tech annually attracts industry experts, thought leaders, software vendors, senior HR executives, HR generalists, HR systems leaders, IT innovators and more. The show is also home to the annual Women in HR Technology Summit, which empowers women within HR and HR technology to grow personally and professionally. Additionally, HR Tech Conference hosts the world’s largest Expo of HR technology products and services — a number of vendors even choose to announce their latest products for the first time at the conference. There is no better place to touch, compare and contrast the latest solutions from leading vendors in every category, as well as start-ups. For more information, visit www.HRTechConference.com .\nAbout LRP\nLRP Publications, headquartered in Palm Beach Gardens, Florida, is a diversified media company. LRP Conferences, LLC, produces more than a dozen professional conferences and trade shows including: Future of Education Technology (FETC), Health & Benefits Leadership Conference, HR Technology ® Conference, HR in Hospitality Conference, and National Workers’ Compensation and Disability Conference ® . For a complete list of LRP products, conferences and trade shows, please visit www.lrp.com .\nAbout Diversified Communications\nDiversified Communications is a leading international media company providing market access, education and information through global, national and regional face-to-face events, digital products and publications. Diversified serves a number of industries including: food and beverage, natural and organic, healthcare, commercial marine and technology. As a privately held, third generation family-owned business, established in 1949, Diversified Communications is uniquely positioned to make long-term investments and carefully choose the areas in which it does business. For more information visit: http://www.divcom.com\nNote to editors: Trademarks and registered trademarks referenced herein remain the property of their respective owners. Media Contact: Rennette Fortune Public Relations Manager LRP Publications 561-622-6520 ext. 8674 rfortune@lrp.com\nSource:HR Technology Conference & Exposition", "external_links": ["https://www.globenewswire.com/Tracker?data=3M1M04cLt75DKsHSSfrs5z9xFoJGR6MkNuHnGSobuRXLZ4Rt44Zs0HHtg7YzqCNGKxk4J0yPgFA2bdp25OGKqg==", "https://www.globenewswire.com/Tracker?data=fPMYp4x5xgucRaixOQhee8wA-sRwhmuWi2OcfHzp963gsL7wo-zlQHKi4a1VcGyTgP3i0jZTjLZqzsvJluH8UsqDd6ZjWLt81b7B2a6mXSI=", "https://www.globenewswire.com/Tracker?data=yBawkguxkblzQTe3ZBZCgx3UYR4X67HvoDzNvwuS5ubGQyNWjte2bpmf_0pBBHWTRa62iATxrqISYS6hKApPv7z1oa_0kSRbo_ha-nzwbY0=", "https://www.globenewswire.com/Tracker?data=R1QOpvbWtcSeAl3UBngDbO-HeI9HJ5XaJ0cQnBB8_ibCPMrejUYpmoPygHyzyuQCkPoJ8QVSFXmVFvGjdt4lSg==", "https://www.globenewswire.com/Tracker?data=0SMMHc3_ArQudUrC-6yWu-jhARSwxBHJ85JAHq0DMimbmGnaQ276lXYkQiEppvk0wvwgHyky8V_66N_Twt4bQw==", "https://www.globenewswire.com/Tracker?data=4i0yTp9BRJ9Hk09Z0NkZDYuJz5tSpVl6rypqFNMae_7whZJfIIaV8WKuph3L0JHpwTtDv9uf4kStoF3XtG1Ln-OKPRbrrceiM5MQX_3cMhRsf2vq1foP7Si70qH_PbYT", "https://www.globenewswire.com/Tracker?data=GFWkKJBROXhaadPuCLUyfVzhkqVdyJPPti9we76T-qQvdUfr6Nindl4onxDxILrtftDpZkjV097JQTbq5_vCvvnRCsby4LYYX2swcVyP9vc=", "https://www.globenewswire.com/Tracker?data=sw6LXKtfle4HoEa-U7jfxgo56D5kP-e1sO2eO-rho0X4etEqMOhMVm5FZdkAjYfEu2HYssY5RET1QgbHNUAH49QXAe-uIh5AJk-x9ktEv-w=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/81d29b6d-1fab-487b-95d4-f96cc4ccca95", "https://www.globenewswire.com/Tracker?data=vHjHAGmyb-mwkJZgdAsmW883U0gn4Cypqrl7_O6a9CxM_-1s6315xJOdF74302T_oNCSZZn4xVSuzsYHsmCqeg=="], "published": "2018-01-22T18:03:00.000+02:00", "crawled": "2018-01-22T20:26:01.001+02:00", "highlightTitle": ""}