{"organizations": [], "uuid": "dbc1b486881bff148a026cc0c36c51c03a66e1a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225116963&w=1200&r=LYNXMPEE0O0O0", "site_section": "http://feeds.reuters.com/Reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-alabama-execution/killer-of-alabama-policeman-seeks-execution-reprieve-due-to-memory-loss-idUSKBN1FE1DP", "country": "US", "domain_rank": 408, "title": "Killer of Alabama policeman seeks execution reprieve due to memory loss", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T13:16:00.000+02:00", "replies_count": 0, "uuid": "dbc1b486881bff148a026cc0c36c51c03a66e1a0"}, "author": "", "url": "https://www.reuters.com/article/us-alabama-execution/killer-of-alabama-policeman-seeks-execution-reprieve-due-to-memory-loss-idUSKBN1FE1DP", "ord_in_thread": 0, "title": "Killer of Alabama policeman seeks execution reprieve due to memory loss", "locations": [], "entities": {"persons": [{"name": "julius schulte", "sentiment": "none"}, {"name": "madison", "sentiment": "none"}, {"name": "vernon madison", "sentiment": "none"}, {"name": "david beasley", "sentiment": "none"}], "locations": [{"name": "alabama", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "atmore", "sentiment": "none"}], "organizations": [{"name": "11th u.s. circuit court of appeals", "sentiment": "none"}, {"name": "u.s. supreme court", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "william c. holman correctional facility", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Attorneys for an Alabama man convicted of murdering a police officer in 1985 are asking the U.S. Supreme Court to halt his execution on Thursday because they said several strokes had left him unable to remember committing the crime.\nVernon Madison, 67, has spent more than three decades on death row for killing Mobile police officer Julius Schulte. His lethal injection would be the second in the United States this year if carried out at 6 p.m. CST at the William C. Holman Correctional Facility in Atmore.\nIn an appeal this week to the U.S. Supreme Court, Madison’s lawyers said he should not be executed because he is legally blind, cannot walk without assistance and is unable to recall the murder or understand his punishment.\n“His mind and body are failing,” lawyers wrote in the petition seeking a stay.\nThe court has not yet ruled.\nIn 2016, the Atlanta-based 11th U.S. Circuit Court of Appeals ruled that Madison was no longer legally eligible to be executed because of his memory loss.\nBut the U.S. Supreme Court in November reversed that decision, saying court precedent had not established “that a prisoner is incompetent to be executed because of a failure to remember his commission of the crime.”\nMadison’s attorneys have asked justices to reconsider the case. They said in their petition that the state failed to disclose that a court-appointed psychologist who evaluated the inmate was addicted to narcotics and had been suspended from his practice for forging prescriptions, making his findings invalid.\nLawyers for Alabama argue that Madison’s own expert witness has testified that he understands what he was tried for and “the meaning of a death sentence.”\nAccording to court records, Madison killed Schulte during a domestic dispute that Madison was having with his girlfriend.\nMadison appeared to leave his girlfriend’s home after retrieving his belongings, but then crept up behind Schulte as he sat in his patrol car and shot him twice in the back of the head with a .32-caliber pistol.\nMadison, who is black, was sentenced to death in 1994 in his third trial after his first two convictions were thrown out on appeal for racial discrimination in jury selection and other prosecutorial misconduct.\nReporting by David Beasley in Atlanta; Editing by Colleen Jenkins and Peter Cooney\n ", "external_links": [], "published": "2018-01-25T13:16:00.000+02:00", "crawled": "2018-01-25T13:33:19.066+02:00", "highlightTitle": ""}