{"organizations": [], "uuid": "e92b75fbaf2a7d7831b9150a905bfb251bb45080", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/china-stocks-hongkong-close/hong-kong-stocks-up-for-9th-day-close-at-10-year-high-idUSZZN2N7600", "country": "US", "domain_rank": 408, "title": "Hong Kong stocks up for 9th day, close at 10-year high", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T10:27:00.000+02:00", "replies_count": 0, "uuid": "e92b75fbaf2a7d7831b9150a905bfb251bb45080"}, "author": "", "url": "https://www.reuters.com/article/china-stocks-hongkong-close/hong-kong-stocks-up-for-9th-day-close-at-10-year-high-idUSZZN2N7600", "ord_in_thread": 0, "title": "Hong Kong stocks up for 9th day, close at 10-year high", "locations": [], "entities": {"persons": [{"name": "reu", "sentiment": "negative"}], "locations": [{"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "hang seng china enterprises", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "sino land co ltd", "sentiment": "none"}, {"name": "hsi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 28 AM / in 21 minutes Hong Kong stocks up for 9th day, close at 10-year high Reuters Staff 3 Min Read \nJan 5 (Reuters) - Hong Kong stocks rose for a ninth straight session on Friday, aided by strong gains by real estate firms, and the benchmark Hang Seng Index closed at a 10-year high. \n** Chinese appetite for Hong Kong equities, ample cash supply and optimism over share reforms could propel the city’s benchmark stock index up as much as 15 percent this year, after an already bullish run in 2017, fund managers and analysts say. ** At close of trade, the Hang Seng index was up 78.16 points or 0.25 percent at 30,814.64. The Hang Seng China Enterprises index rose 0.07 percent to 12,211.63. ** For the week, HSI was up 3.0 percent, its fourth straight such gain and its best week since the one ended on Oct. 6. \n**The sub-index of the Hang Seng tracking energy shares rose 0.8 percent while the IT sector rose 0.26 percent, the financial sector was 0.2 percent lower and property sector rose 2.32 percent. ** The top gainer on Hang Seng was Sino Land Co Ltd up 4.37 percent, while the biggest loser was Hengan International Group Company Ltd which was down 2.98 percent. ** China’s main Shanghai Composite index closed up 0.2 percent at 3,392.3555 points while its blue-chip CSI300 index ended up 0.25 percent. ** Around the region, MSCI’s Asia ex-Japan stock index was firmer by 0.52 percent while Japan’s Nikkei index closed up 0.89 percent. ** The yuan was quoted at 6.4847 per U.S. dollar at 08:11 GMT, 0.14 percent firmer than the previous close of 6.494. ** So far this year, the Hang Seng index is up 2.73 percent, while China’s H-share index is up 4.2 percent. As of the previous close, the Hang Seng has risen 2.73 percent this month. ** The top gainers among H-shares were China Vanke Co Ltd up 6.38 percent, followed by Postal Savings Bank of China Co Ltd gaining 3.1 percent and China Shenhua Energy Co Ltd up by 2.38 percent. ** The three biggest H-shares percentage decliners were New China Life Insurance Co Ltd which was down 3.74 percent, China Pacific Insurance Group Co Ltd which fell 3.1 percent and Ping An Insurance Group Co of China Ltd down by 2.0 percent. ** About 2.33 billion Hang Seng index shares were traded, roughly 135.5 percent of the market’s 30-day moving average of 1.72 billion shares a day. The volume traded in the previous trading session was 3.09 billion. ** At close, China’s A-shares were trading at a premium of 28.09 percent over the Hong Kong-listed H-shares. ** The price-to-earnings ratio of the Hang Seng index was 14.02 as of the last full trading day while the dividend yield was 2.8 percent. ** So far this week, the market capitalisation of the Hang Seng index has risen by 2.96 percent to HK$20.16 trillion. ** The short and one-factor leveraged Hang Seng index, which is designed to replicate the payoff of a short or leveraged portfolio and is linked to the movements of the Hang Seng Index, was lower by 0.25 percent on the day at 4,789.8 points. (Reporting by the Shanghai Newsroom)", "external_links": [], "published": "2018-01-05T10:27:00.000+02:00", "crawled": "2018-01-05T10:50:33.002+02:00", "highlightTitle": ""}