{"organizations": [], "uuid": "f299c9e4d154e5c568578d16921d3cdeadca3fbc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/column-marksjarvis-529plans/column-using-529-funds-to-pay-for-private-school-check-new-rules-idUSL2N1PI251", "country": "US", "domain_rank": 408, "title": "COLUMN-Using 529 funds to pay for private school? Check new rules", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T22:06:00.000+02:00", "replies_count": 0, "uuid": "f299c9e4d154e5c568578d16921d3cdeadca3fbc"}, "author": "", "url": "https://www.reuters.com/article/column-marksjarvis-529plans/column-using-529-funds-to-pay-for-private-school-check-new-rules-idUSL2N1PI251", "ord_in_thread": 0, "title": "COLUMN-Using 529 funds to pay for private school? Check new rules", "locations": [], "entities": {"persons": [{"name": "gail marksjarvis", "sentiment": "none"}, {"name": "uncle sam", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "nebraska", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 09 PM / in an hour COLUMN-Using 529 funds to pay for private school? Check new rules Reuters Staff \n(The opinions expressed here are those of the author, a columnist for Reuters.) \nBy Gail MarksJarvis \nCHICAGO, Jan 24 (Reuters) - Uncle Sam has given families the green light to use $10,000 per child each year to pay for private schools out of 529 savings plans, but parents cannot count on states to give them the same tax break. \nA new tax law went into effect on Jan. 1, leaving states scrambling to implement provisions that let families tap state-sponsored college savings plans for private elementary or secondary schools without owing taxes on the withdrawal. \nSome states, like New York and Nebraska, put pop-up warnings on their 529 college plan websites, saying that families should not assume their state will follow federal laws. The state treasurer’s office of Illinois, for one, does not intend to open the its program to private school tuition. \nCurrently, all states follow the federal government tax rules in one way: They all let people remove money from 529 plans and use it for college without paying taxes. But 33 states also give families additional tax deductions and credits when they contribute to 529 plans. The fate of those benefits is now unclear as states re-examine their rules in light of federal changes. \nOnly about 20 states currently automatically align their state laws on 529 plans to whatever the federal government decides, according to Paul Curley, director of college saving research for Strategic Insight. \nMany states will have to decide what to do next. States that have laws that specifically require 529 money go toward only college or higher education such as a technical school will also need to clarify their position for 2018 and the future. \nIf they stick with the requirement to use 529s for college, the money parents take out for K-12 private school tuition may be considered a non-qualified distribution. That means people would have to pay taxes and perhaps even penalties. \nIn states that do not end up following the new federal rules, there is more at stake for families than simply paying taxes on the money they withdraw to pay tuition for a private school. Some states give people who save in 529 plans rewards every year they contribute to the plan. The reward may be either a deduction or a tax credit. \nUnless some laws are changed, families could be forced to pay back the tax credits or deductions they received for putting money into 529 accounts if they use their savings for private school, said James DiUlio, chairman of the College Savings Plans Network, an umbrella group for the state plans. \nThe impact will vary by state, said Susie Bauer, senior vice president and 529 manager for Baird Private Wealth Management. She estimates that in Iowa, parents with $100,000 in income who contribute $1,500 a year for each of their two children to a 529 could owe $202 for each year if they spend that money on K-12 costs. In New York, parents with $100,000 in income might owe $146 for $3,000 in yearly contributions. In Illinois, the estimated amount is $84 per year, Bauer said. \nHow the money would be recovered is unclear. \nIn Illinois, as in many states, people either have tuition payments sent directly from the 529 to a college, or a parent pays tuition and requests that they be reimbursed from their 529 plan. Reimbursements are difficult to police but could be detected in an audit, said Illinois Treasurer spokesman Greg Rivara. \nThe money involved at the state level is significant. According to the Illinois Revenue Department, the state gives up $29 million in revenue for 529 tax breaks to encourage college savings. In California, it is estimated at $55 million. \nStates stand to lose millions more if parents start using these plans heavily for K-12 educations, keeping money in the accounts for a very short amount of time before spending it. (Editing by Beth Pinsker and Lauren Young; Editing by Cynthia Osterman)", "external_links": [], "published": "2018-01-24T22:06:00.000+02:00", "crawled": "2018-01-24T22:34:57.009+02:00", "highlightTitle": ""}