{"organizations": [], "uuid": "8badcfb1fcf14807e8ef258afb622a634bc3a654", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-rhythmone-plc-commences-exchange-offer-to-acquire-yume-inc.html", "country": "US", "domain_rank": 767, "title": "RhythmOne plc Commences Exchange Offer To Acquire YuMe, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.022, "site_type": "news", "published": "2018-01-05T00:43:00.000+02:00", "replies_count": 0, "uuid": "8badcfb1fcf14807e8ef258afb622a634bc3a654"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-rhythmone-plc-commences-exchange-offer-to-acquire-yume-inc.html", "ord_in_thread": 0, "title": "RhythmOne plc Commences Exchange Offer To Acquire YuMe, Inc.", "locations": [], "entities": {"persons": [{"name": "rhythmone", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "yume", "sentiment": "none"}, {"name": "yume", "sentiment": "none"}], "organizations": [{"name": "rhythmone plc commences exchange offer to acquire yume, inc", "sentiment": "neutral"}, {"name": "inc.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "acquisition", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON and SAN FRANCISCO, Jan. 4, 2018 /PRNewswire/ -- RhythmOne plc (LSE AIM: RTHM, \" Company \" or \" RhythmOne \") today commenced an exchange offer (the \" Offer \") for all of the outstanding shares of YuMe, Inc. (NYSE: YUME, \" YuMe \"), a leading digital video brand advertising provider, pursuant to the companies' previously announced merger agreement dated 4 September 2017 (the \" Acquisition \").\nSubject to the terms and conditions of the Offer, which is being made through a wholly owned subsidiary of RhythmOne, YuMe stockholders who validly tender their shares in the Offer will receive, for each share of YuMe common stock (\" YuMe Share\" ), $1.70 in cash without interest and 0.7325 ordinary shares of RhythmOne. The Acquisition is expected to close in the first calendar quarter of 2018.\nStrategically, RhythmOne believes the Acquisition will result in a combined entity with a complete end-to-end platform in one of the fastest growing segments of the industry, with the resources, relationships and talent to drive earnings growth both organically and through other potential acquisitions.\nThe Offer will expire at the time that is one minute following 11:59 p.m. Pacific time on 1 February 2018, unless the Offer is extended in accordance with U.S. tender offer rules and the terms set out in the prospectus/offer to exchange. The terms and conditions of the Offer are described in the exchange offer documents, which will be mailed to YuMe stockholders and have been filed with the Securities and Exchange Commission.\nUpon satisfaction of the conditions to the Offer, and after the YuMe Shares tendered in the Offer are accepted for payment, RhythmOne and YuMe intend, as soon as practicable, to effect a merger pursuant to Section 251(h) of the Delaware General Corporation Law, which does not require a vote of YuMe's stockholders, and which would result in each YuMe Share not tendered in the Offer (other than shares held by YuMe in treasury or by YuMe stockholders who have validly exercised their appraisal rights under Delaware law) being converted into the right to receive the same consideration received for each YuMe Share accepted in the Offer.\nThe Offer is subject to customary conditions, including the tender by YuMe stockholders of a number of YuMe Shares that represents at least a majority of the issued and outstanding YuMe Shares. The applicable waiting period under the Hart-Scott-Rodino Antitrust Improvements Act has expired, and accordingly this condition to the Offer has been satisfied. No approval of the stockholders of YuMe is required in connection with the proposed transaction.\nThe board of directors of YuMe has unanimously recommended that YuMe stockholders accept the Offer and tender their YuMe Shares to RhythmOne pursuant to the Offer. Certain YuMe stockholders and each of their respective affiliates, who between them hold approximately 29.0% of the YuMe Shares as of 2 January 2018, have agreed to tender their shares as part of the Offer.\nIn connection with the Offer, RhythmOne has filed a registration statement on Form F-4, which includes a prospectus/offer to exchange and certain ancillary documentation, which will be mailed to YuMe stockholders, and a tender offer statement on Schedule TO with the SEC. YuMe has filed a solicitation/recommendation statement on Schedule 14D-9 that will also be mailed to YuMe stockholders. These documents contain important information about the Offer that should be read carefully before any decision is made with respect to the Offer.\nRequests for copies of the prospectus/offer to exchange, the accompanying letter of transmittal and other exchange offer materials may be directed to Georgeson LLC, the information agent for the Offer, by phone toll-free at (866) 856-2826\nAbout RhythmOne\nRhythmOne provides streamlined, transparent connections between advertisers and audiences through a combination of differentiated supply, innovative technology and data-driven insights. Founded in 2004 in the UK, the Company pioneered Internet video search and works with digital advertisers, publishers and content providers to offer fully integrated, cross-screen solutions that span desktop and mobile video, rich media, display, social and native advertising. Through its fully integrated programmatic platform, RhythmMax, the Company represents digital advertising inventory across owned, controlled and extended supply sources. The RhythmMax platform includes unique brand safety technology, RhythmGuard, which combines leading third-party verification and proprietary filtering technologies to ensure inventory quality in brand safe environments. RhythmOne's end-to-end platform provides more direct, efficient and effective connections, driving ROI for advertisers and publishers. The Company is headquartered in San Francisco, United States with offices in the US, UK, Europe, APAC and Canada. For more information, please visit www.rhythmone.com .\nNumis Securities Limited (\" Numis \") which is authorised and regulated in the United Kingdom by the Financial Conduct Authority is acting for the Company and no one else as nominated advisor and UK broker and financial advisor only and will not afford the protections afforded to clients of Numis to any other person. To the fullest extent permitted by law Numis expressly disclaims any liability whatsoever arising out its role and/or of the contents of this announcement to any person other than the Company.\nForward-Looking Statements\nThis announcement contains (or may contain) certain forward-looking statements with respect to the proposed Acquisition, the expected timetable for the Offer, the benefits and synergies associated with the proposed Acquisition, future opportunities for the combined company and certain of RhythmOne's, YuMe's or the combined company's future expectations, beliefs, plans, objective, financial conditions, assumptions or future events or performance and which involve a number of risks and uncertainties. RhythmOne cautions readers that no forward-looking statement is a guarantee of future performance and that actual results could differ materially from those contained in the forward-looking statements. These forward-looking statements can be identified by the fact that they do not relate only to historical or current facts. Forward-looking statements are often, but not always, made through the use of words or phrases such as \"anticipate,\" \"believe,\" \"could,\" \"estimate,\" \"intend,\" \"may,\" \"outlook,\" \"plan,\" \"positioned,\" \"potential,\" \"predict,\" \"project,\" \"should,\" \"strategy,\" will,\" \"would\" and similar expressions.\nAll such forward-looking statements involve estimates and assumptions that are subject to risks, uncertainties and other factors that could cause actual future financial condition, performance and results to differ materially from the plans, goals, expectations and results expressed in the forward-looking statements and other financial and statistical data within this prospectus/offer to exchange. Among the key factors that could cause the failure of the Acquisition to be completed or, if completed, that could have an adverse effect on the results of operations, cash flows and financial positio", "external_links": ["http://www.prnewswire.com/news-releases/rhythmone-plc-commences-exchange-offer-to-acquire-yume-inc-300577929.html"], "published": "2018-01-05T00:43:00.000+02:00", "crawled": "2018-01-05T01:22:22.015+02:00", "highlightTitle": ""}