{"organizations": [], "uuid": "e1f9ac84f5dc35a1f9acca0bfeb91d2a5de64410", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-auckland-men/bautista-agut-beats-del-potro-to-win-auckland-title-idUKKBN1F2047", "country": "US", "domain_rank": 408, "title": "Bautista Agut beats del Potro to win Auckland title", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T06:38:00.000+02:00", "replies_count": 0, "uuid": "e1f9ac84f5dc35a1f9acca0bfeb91d2a5de64410"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-auckland-men/bautista-agut-beats-del-potro-to-win-auckland-title-idUKKBN1F2047", "ord_in_thread": 0, "title": "Bautista Agut beats del Potro to win Auckland title", "locations": [], "entities": {"persons": [{"name": "bautista agut", "sentiment": "negative"}, {"name": "del potro", "sentiment": "none"}, {"name": "juan martin del potro", "sentiment": "none"}, {"name": "roberto bautista agut", "sentiment": "none"}], "locations": [{"name": "auckland", "sentiment": "none"}, {"name": "auckland", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 13, 2018 / 4:41 AM / Updated 2 hours ago Bautista Agut beats Del Potro to win Auckland title Reuters Staff 3 Min Read \nAUCKLAND (Reuters) - Roberto Bautista Agut continued to shine in New Zealand when the Spaniard won his second Auckland Classic title with a 6-1 4-6 7-5 victory over second seed Juan Martin Del Potro on Saturday. \nDel Potro had advanced to the final behind his booming forehand that nullified the superb defensive game of David Ferrer. \nThe fifth seeded Bautista Agut, who clinched the title in 2016 but was unable to defend it last year due to illness, however, never let the tall Argentine settle or get into a rhythm on Saturday. \nHe romped through the first set in 31 minutes as he broke Del Potro three times and produced numerous forehand winners. \n“Roberto was just playing so well,” said Del Potro, who added he had played most of his matches in Auckland at night and was slow to adjust to the hot and humid conditions on Saturday. \n“He moves so fast from the baseline and he made it tough.” \nThe second set went on serve with neither able to get a break point opportunity until the 10th game, which Del Potro seized upon to send the match into a decider when Bautista Agut hit a backhand into the net after a cagey baseline rally. \nNeither player offered up many opportunities in the third set until the 11th game, when the Spaniard converted on the second of his break points to take a 6-5 lead and then held serve to triumph in a little more than two hours. \n“It was an unbelievable match today,” said Bautista Agut, who was presented with a ceremonial ‘taiaha’, or Maori wooden staff. \n”I have been fighting all week and felt like I wasn’t playing good tennis but today I did. \n“Juan Martin is very tough to beat and I think I just played two amazing games at the end of the match.” \nBoth players will now turn their attention to next week’s Australian Open in Melbourne, where Bautista Agut will play compatriot Fernando Verdasco in the first round. \nDel Potro, who will move back into the top 10 for the first time since 2014 after a succession of surgeries on both wrists, takes on American prospect Frances Tiafoe and he said the run to the Auckland final had been a massive confidence boost. \n”It’s a good start for me,“ he said. ”I didn’t expect to make a final in my first tournament of the year and I am looking forward to Melbourne. \n“It is a big event.” Reporting by Greg Stutchbury in Wellington; Editing by John O'Brien", "external_links": [], "published": "2018-01-13T06:38:00.000+02:00", "crawled": "2018-01-13T06:49:57.053+02:00", "highlightTitle": ""}