{"organizations": [], "uuid": "796f8940f5bb05568f69702b28b0dc0901f7a586", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-catalyst-orthoscience-strengthens-its-board-of-directors-with-the-addition-of-greg-rainey.html", "country": "US", "domain_rank": 767, "title": "Catalyst OrthoScience Strengthens Its Board of Directors with The Addition of Greg Rainey", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.017, "site_type": "news", "published": "2018-01-17T05:18:00.000+02:00", "replies_count": 0, "uuid": "796f8940f5bb05568f69702b28b0dc0901f7a586"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-catalyst-orthoscience-strengthens-its-board-of-directors-with-the-addition-of-greg-rainey.html", "ord_in_thread": 0, "title": "Catalyst OrthoScience Strengthens Its Board of Directors with The Addition of Greg Rainey", "locations": [], "entities": {"persons": [{"name": "greg rainey", "sentiment": "negative"}, {"name": "rainey", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "naples", "sentiment": "none"}], "organizations": [{"name": "inc.", "sentiment": "negative"}, {"name": "stryker corporation", "sentiment": "none"}, {"name": "orthoscience board", "sentiment": "none"}, {"name": "rti surgical", "sentiment": "none"}, {"name": "stryker", "sentiment": "none"}, {"name": "cas medical", "sentiment": "none"}, {"name": "joint medical corporation", "sentiment": "none"}, {"name": "cci performance group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NAPLES, Fla., Jan. 16, 2018 /PRNewswire/ -- Catalyst OrthoScience, Inc., a cutting-edge medical device company focused on the upper extremity orthopedics market, today announced the addition of Greg Rainey to its Board of Directors.\nMr. Rainey brings over forty years of experience to the Catalyst OrthoScience Board. Mr. Rainey's career has been in sales management and business development, serving a cross section of the healthcare industry including orthopedics, medical supplies and equipment, and biologics. Mr. Rainey is the founder and principal of CCI Performance Group, an executive consulting firm designed to deliver sustainable business solutions for both leading Fortune 500 healthcare companies and early-stage medical device ventures. Most recently, he served on the Board of Directors for RTI Surgical (RTIX), and currently sits on the Board of CAS Medical (CASM). Mr. Rainey's experience includes Stryker Corporation where he served as Vice President of Sales for the Orthopedic Division. Prior to Stryker, Mr. Rainey held sales leadership positions Joint Medical Corporation and U.S. Surgical Corporation. Mr. Rainey received his undergraduate degree in Biology from Loyola University.\n\"We are privileged to have Greg join our board at such an important time in our company's history. Greg's successful track record in orthopedics is critical to us as we expand the market presence of our disruptive, stemless shoulder replacement technology. We look forward to his contributions,\" said Bob Kaufman, Chairman and Chief Executive Officer of Catalyst OrthoScience.\nThe Catalyst CSR™ Total Shoulder System provides consistently reproducible shoulder joint restoration with a canal-sparing humeral implant that is smaller, more anatomically-shaped, and less invasive than traditional shoulder replacement\nCatalyst OrthoScience was founded in 2014 by orthopedic surgeon Steven Goldberg, M.D. saw the need to make shoulder replacement surgery less invasive and give patients a more normal feeling shoulder after surgery.\nAbout Catalyst OrthoScience Inc.\nHeadquartered in Naples, FL, Catalyst OrthoScience develops and markets innovative medical device solutions that make orthopedic surgery less invasive and more efficient for both surgeons and patients.\nThe company's first offering, the Catalyst CSR™ Total Shoulder System, represents the next evolution in stemless total shoulder arthroplasty. The Catalyst CSR™ is a single-tray total shoulder arthroplasty system containing a non-spherical humeral implant for consistent anatomic joint line restoration and specialized, patented glenoid instrumentation for a less invasive approach that preserves the natural anatomy and removes less of the patient's bone. The Catalyst CSR™ System is optimal for use in both the inpatient and outpatient settings and was cleared for use by the FDA in 2016.\nCatalyst OrthoScience's products are marketed under a variety of brands including Catalyst OrthoScience® and Catalyst CSR™. For additional information on the Company, please visit http://www.catalystortho.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/catalyst-orthoscience-strengthens-its-board-of-directors-with-the-addition-of-greg-rainey-300583672.html\nSOURCE Catalyst OrthoScience, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/catalyst-orthoscience-strengthens-its-board-of-directors-with-the-addition-of-greg-rainey-300583672.html", "http://www.catalystortho.com/"], "published": "2018-01-17T05:18:00.000+02:00", "crawled": "2018-01-17T05:18:02.012+02:00", "highlightTitle": ""}