{"organizations": [], "uuid": "641b175589299a90a718bc5c54476130a2edb1b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INoddlyEnoughNews\r", "section_title": "Reuters: Oddly Enough", "url": "https://in.reuters.com/article/lithuania-smuggling/ice-packs-cigarette-smugglers-find-frozen-route-to-lithuania-idINKBN1F8239", "country": "US", "domain_rank": 408, "title": "Ice packs: Cigarette smugglers find frozen route to Lithuania", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T18:40:00.000+02:00", "replies_count": 0, "uuid": "641b175589299a90a718bc5c54476130a2edb1b3"}, "author": "", "url": "https://in.reuters.com/article/lithuania-smuggling/ice-packs-cigarette-smugglers-find-frozen-route-to-lithuania-idINKBN1F8239", "ord_in_thread": 0, "title": "Ice packs: Cigarette smugglers find frozen route to Lithuania", "locations": [], "entities": {"persons": [{"name": "pukinskas", "sentiment": "none"}, {"name": "rokas pukinskas", "sentiment": "none"}], "locations": [{"name": "lithuania", "sentiment": "none"}, {"name": "belarus", "sentiment": "none"}, {"name": "vilnius", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 4:59 PM / Updated 4 hours ago Ice packs: Cigarette smugglers find frozen route to Lithuania Reuters Staff 2 Min Read \nVILNIUS (Reuters) - Tobacco smugglers are using river iceflows and GPS technology to transport their goods into Lithuania, where an estimated one in every six cigarettes smoked in 2016 was illegally imported. \nThe Baltic country’s border guard said on Friday it had found thousands of packets of cigarettes attached beneath blocks of ice on the river Neris, which runs into Lithuania from Belarus, since the ice began flowing two weeks ago. \nAround 1,000 packs were found last week and another 1,500 packs on Friday. The iceblocks carried GPS trackers to aid retrieval. \n“This is the first time we find cigarettes underneath the ice. However, smugglers continuously attempt to use that stretch of the river,” border guard spokesman Rokas Pukinskas told Reuters. “The imagination of these people knows no limits.” 1,500 packs of cigarettes found being smuggled under a block of ice flowing on river Neris from Belarus are seen near village of Moliai, Lithuania January 19, 2018 in this photo provided by State Border Guard Service. State Border Guard Service/Handout via REUTERS \nThe cigarettes, which are about four times more expensive in Lithuania than in Belarus, were worth an estimated 8,000 euros, Pukinskas said. \nKPMG came up with the one in six figure for smuggled cigarettes in a research report last year. That was the highest ratio in the European Union after Latvia, Greece and Ireland, the auditing firm said. \nMost come from Belarus, where taxes on tobacco are far lower than in Lithuania, and some are then sold on for even larger profits in countries such as Britain and Ireland, KPMG said. \nThe Lithuanian government has said it lost 50 million euros in unpaid taxes in 2015 alone due to tobacco smuggling. Reporting By Andrius Sytas; Editing by Niklas Pollard and Catherine Evans", "external_links": [], "published": "2018-01-19T18:40:00.000+02:00", "crawled": "2018-01-19T19:07:50.023+02:00", "highlightTitle": ""}