{"organizations": [], "uuid": "f2388816a95e18492929f057ce3671d625c1c89c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-doyen-elements-inc-acquires-7genx-llc-a-hemp-genetics-company.html", "country": "US", "domain_rank": 767, "title": "Doyen Elements, Inc. Acquires 7GENx, LLC, A Hemp Genetics Company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.762, "site_type": "news", "published": "2018-01-04T00:39:00.000+02:00", "replies_count": 0, "uuid": "f2388816a95e18492929f057ce3671d625c1c89c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-doyen-elements-inc-acquires-7genx-llc-a-hemp-genetics-company.html", "ord_in_thread": 0, "title": "Doyen Elements, Inc. Acquires 7GENx, LLC, A Hemp Genetics Company", "locations": [], "entities": {"persons": [], "locations": [{"name": "boulder", "sentiment": "none"}, {"name": "colo.", "sentiment": "none"}, {"name": "boulder", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}], "organizations": [{"name": "llc", "sentiment": "negative"}, {"name": "hemp genetics company", "sentiment": "negative"}, {"name": "doyen elements, inc.", "sentiment": "neutral"}, {"name": "doyen elements, inc", "sentiment": "neutral"}, {"name": "7genx llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOULDER, Colo., Jan. 3, 2018 /PRNewswire/ -- Doyen Elements, Inc. announces that on December 14, 2017, it entered into an equity purchase agreement to acquire 7GENx LLC, a Boulder, Colorado based hemp genetics research and development company for $4,200,000 pursuant to a promissory note due May 21, 2019.\n7GENx LLC focuses on creating proprietary hemp cultivators to meet the current and emerging market demands for use in breeding for agricultural, industrial and medical purposes. Its team of scientists collect data and analysis the chemical, genetic and phenotypic profiles of hemp, allowing the company to create proprietary varieties of hemp that are targeted for specific uses for current or emerging markets. Additionally, 7GENx intends to restore regenerative hemp based agriculture, food, fuel and fiber economies for the health, safety and welfare of the planet by providing small select farms in Colorado (and other states with state approved hemp programs) with hemp cultivation and harvesting techniques, elevated organic methods and practices, and proprietary CBD rich hemp varieties that meet state hemp program standards.\nAlong with this acquisition, the Company entered into a 3-year employment agreement with 7GENx founder, Shane Davis. Mr. Davis brings 26 years of biological experience, with a Biology and Molecular Genetics emphasis at the University of Maryland/Europe & Dickinson State University. Shane background and experiences includes plant breeder, genetics and permaculture expert - combining techniques from agronomy, plant breeding, plant spirit, population and phylogenetic genetics, and carbon biotechnology.\nAlso, this acquisition enables 7GENx to expand their work with farm program partners which are a main source of geographic data collection and harvested proprietary whole plant hemp extracts that are designed for a line of hemp-based products to include, but not limited to; CBD rich dietary supplements for humans and animals and CBD rich body care products.\n\"We are delighted to add 7GENx to our portfolio of companies that are helping the Hemp industry move forward with efficiency and business know-how,\" says Jeff Hranicka, COO of Doyen Elements, Inc. \"Hemp Technology is the future of agriculture and no other company is more apt to answer the need for the benefits of this plant than 7GENX. We look forward to seeing the research and implications that Shane and his team continue to develop.\"\n\"Hemp is one the most misunderstood plants in the United States,\" says Shane Davis of 7GENx. \"We are looking forward to restoring its place as a diverse and crucial part of our agriculture and commerce ecosystem in the US and beyond. We are delighted to be able to further our research and development in the field of Hemp agriculture with our partnership with Doyen Elements, Inc., to restore regenerative hemp based agriculture, food, fuel and fiber economies for the health, safety and welfare of the planet.\"\nFor more information about 7GENx or Doyen Elements, Inc. in the USA please contact info@doyenelementsus.com or visit www.doyenelementsus.com . (855) DOYEN-US\nAbout Doyen Elements Inc.\nLaunched in September 2016, Doyen Elements Inc. a US company, began as a consultancy firm and has evolved to include a research and development vertical for Industrial Hemp. Its leadership team merges traditional business management with a team of scientists that focus on data collection and analysis of chemical, genetic and phenotypic profiles of hemp, allowing the company to create proprietary varieties of hemp that are targeted for specific uses for the emerging markets.\nForward Looking Statements:\nThis communication shall not constitute an offer to sell or the solicitation of an offer to buy securities nor shall there be any sale of these securities in any state in which such solicitation or sale would be unlawful prior to registration or qualification of these securities under the laws of any such state.\nThis Press Release includes \"forward-looking statements\" within the meaning of the safe harbor provisions of the United States Private Securities Litigation Reform Act of 1995. These \"forward-looking statements\" that address activities, events or developments that Doyen Elements, Inc. expects, anticipates, or estimates may occur in the future. Generally forward-looking statements by words such as \"may,\" \"will,\" \"would,\" \"could,\" \"continue,\" \"potential,\" \"anticipate,\" \"believe,\" \"plan,\" \"estimate,\" \"expect,\" \"intend\" and other similar expressions. There are a numerous risks and uncertainties, both known and unknown, that could cause actual results to differ materially from the results implied by the forward-looking statements, which may include but are not limited to, business risks, general industry conditions and competition, general economic factors, governmental actions, legislative conditions, the impact of cannabis industry regulation, legislation in the United States and internationally and technological advances. Doyen Elements undertakes no obligation to publicly update any forward-looking statement, whether as a result of new information, future events or otherwise.\nView original content: http://www.prnewswire.com/news-releases/doyen-elements-inc-acquires-7genx-llc-a-hemp-genetics-company-300577209.html\nSOURCE Doyen Elements", "external_links": ["http://www.doyenelementsus.com/", "http://www.prnewswire.com/news-releases/doyen-elements-inc-acquires-7genx-llc-a-hemp-genetics-company-300577209.html"], "published": "2018-01-04T00:39:00.000+02:00", "crawled": "2018-01-04T00:25:19.018+02:00", "highlightTitle": ""}