{"organizations": [], "uuid": "438004577505e2d6aa5e4bd4bf15ad6c9cd99923", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-4web-medical-announces-record-sales-growth-in-2017.html", "country": "US", "domain_rank": 767, "title": "4WEB Medical Announces Record Sales Growth in 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.024, "site_type": "news", "published": "2018-01-10T20:44:00.000+02:00", "replies_count": 0, "uuid": "438004577505e2d6aa5e4bd4bf15ad6c9cd99923"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-4web-medical-announces-record-sales-growth-in-2017.html", "ord_in_thread": 0, "title": "4WEB Medical Announces Record Sales Growth in 2017", "locations": [], "entities": {"persons": [{"name": "geoffrey bigos", "sentiment": "none"}], "locations": [{"name": "dallas", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 10, 2018 /PRNewswire/ -- 4WEB Medical, the industry leader in 3D printed implant technology, announced today that the company posted 57% year-over-year growth for the 2017 fiscal year. In addition, 4WEB's fourth quarter results eclipsed the largest quarter in the company's history for revenue, units sold, surgeon users, and case volume. This achievement marks an impressive performance trend of seven quarters of consecutive growth.\n\"4WEB continues to drive growth with portfolio enhancements and new surgeon adoption of its truss implant technology. In 2017 we achieved an 84% increase in surgeon users with over 300 surgeons having used our implants nationwide,\" said Geoffrey Bigos, 4WEB Medical's Vice President of Spine Sales. \"This accomplishment was attributed to an expansion of our sales management team, the growth of our existing product offering, and significant investments in new product development.\"\n4WEB expects sustained growth in 2018 through continued adoption of its most recent product launches – a line of Hyperlordotic ALIF Implants and the Lateral Spine Truss System. The company plans to further accelerate its commercial expansion strategy with two additional product launches this year, building upon the most comprehensive 3D printed implant portfolio on the market today. These high-impact product launches will include cervical and anterior lumbar implants with integrated fixation.\n4WEB's proprietary truss implant technology is an open architecture scaffold that uses the mechanics of the design to stimulate an osteogenic response in adjacent cellular material. The additive manufacturing process used to produce the proprietary implant line creates a hierarchical surface roughness that improves initial fixation, provides a stable environment for bone growth, and contributes to the osteogenic nature of the implant design.\nJim Bruty, 4WEB Medical's Senior Vice President of Sales & Marketing added, \"It is imperative to innovate products that solve clinical problems for surgeons and patients. The advantages that the company's truss implants provide, compared to the antiquated annular implant designs offered by our competitors, has been a driving factor in increased surgeon adoption and 4WEB's 2017 growth.\"\n4WEB Medical is an implant device company founded in 2008 in Dallas, Texas. Thirty years of research in topological dimension theory led to the discovery of a novel geometry, the 4WEB, that can be used as a building block to create high-strength, lightweight web structures. The company leveraged this breakthrough along with cutting-edge 3D printing technology to develop 4WEB Medical's proprietary truss implant platform. The 4WEB Medical product portfolio for spine includes the Cervical Spine Truss System, the Anterior Spine Truss System, the Posterior Spine Truss System, and the Lateral Spine Truss System. 4WEB is actively developing truss implant designs for knee, hip, trauma and patient specific orthopedic procedures.\nFor more information about 4WEB Medical, 4WEB's Truss Implant Technology, and the Spine Truss Systems, please visit www.4WEBMedical.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/4web-medical-announces-record-sales-growth-in-2017-300580864.html\nSOURCE 4WEB Medical", "external_links": ["http://www.prnewswire.com/news-releases/4web-medical-announces-record-sales-growth-in-2017-300580864.html", "http://www.4webmedical.com/"], "published": "2018-01-10T20:44:00.000+02:00", "crawled": "2018-01-10T20:06:00.003+02:00", "highlightTitle": ""}