{"organizations": [], "uuid": "5f96fe8c7f3b86f94a8094302f85838bed80653c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-capital-markets-executives-at-leading-i-banks-forecast-a-jump-of-30-percent-in-u-s-ipo-proceeds-in-2018-according-to-bdo-usa.html", "country": "US", "domain_rank": 767, "title": "Capital Markets Executives at Leading I-Banks Forecast a Jump of 30 Percent in U.S. IPO Proceeds in 2018 According to BDO USA, LLP", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T18:04:00.000+02:00", "replies_count": 0, "uuid": "5f96fe8c7f3b86f94a8094302f85838bed80653c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-capital-markets-executives-at-leading-i-banks-forecast-a-jump-of-30-percent-in-u-s-ipo-proceeds-in-2018-according-to-bdo-usa.html", "ord_in_thread": 0, "title": "Capital Markets Executives at Leading I-Banks Forecast a Jump of 30 Percent in U.S. IPO Proceeds in 2018 According to BDO USA, LLP", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "bdo usa", "sentiment": "none"}], "organizations": [{"name": "sec", "sentiment": "negative"}, {"name": "capital markets executives", "sentiment": "negative"}, {"name": "majority believe trump", "sentiment": "none"}, {"name": "bdo usa, llp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Less Than a Quarter Feel SEC Negatively Impacts IPO Activity and Fewer View ICOs as Threat to IPOs, Majority Believe Trump had Positive Impact on 2017 IPOs\nCHICAGO--(BUSINESS WIRE)-- According to a new survey by BDO USA, LLP, one of the nation’s leading accounting and advisory firms, capital markets executives at leading investment banks are projecting significant growth in the number of initial public offerings (IPOs) on U.S. exchanges in 2018. Close to three-quarters (72%) predict an increase in the number of U.S. IPOs in the coming year, with eighteen percent describing the increase as substantial. One-fifth (20%) forecast activity staying about the same as 2017, while just 8 percent are projecting a decrease in offerings. Overall, bankers predict an 11 percent increase in the number of U.S. IPOs in 2018. They anticipate these offerings will average $260 million, which projects to $46 billion in total IPO proceeds on U.S. exchanges. This would represent an increase of 30 percent from 2017 proceeds.\n“In 2017, the U.S. IPO market bounced back from two consecutive years of dwindling offerings and proceeds raised. Capital markets executives clearly feel that the positive growth of the past year will continue in 2018 as they project significant increases in both the number of IPOs and in total proceeds raised,” said Christopher Tower, a Partner in the Capital Markets Practice of BDO USA. “Given the strong performance of last year’s offerings, the overall strength of the economy and low volatility in the greater stock market, many factors appear to be in place for increased offering activity in the coming year.”\nWhen asked for the most likely factor to spur increased IPO activity in 2018, 38 percent of the bankers cite continued positive returns from new offerings. Other potential drivers identified by the executives are the promise of meaningful tax reform (23%), the pricing of a major “name” offering (18%), continued regulatory rollbacks under the Trump administration (15%) and less favorable private valuations forcing businesses to the public markets (6%).\nSEC Impact on IPOs\nDespite the increase in IPOs on U.S. exchanges in 2017, offerings remain well below the all-time highs of the late 1990s. Some blame excessive SEC disclosure requirements for the drop-off in offerings. In contrast, others contend that there have been numerous changes to ease SEC regulations in recent years - such as the JOBS Act, allowing confidential filings and reducing disclosure requirements - to make it easier to navigate the IPO process. When asked whether they view SEC regulations as the reason for the historical drop in IPOs from the 1990s, just 24 percent agreed. The vast majority (76%) cited the wide availability of private financing at attractive valuations, high M&A activity, more discerning investors or other factors as playing a larger role than the SEC.\nTrump Bump\nIn last year’s BDO IPO Outlook survey, more than two-thirds (68%) of the capital markets community indicated that they felt President-elect Trump and the Republican-controlled Congress would have a positive impact on the U.S. IPO market. This year, looking back over 2017, a majority (58%) of the bankers feel the new President and Congress did have a positive impact on U.S. IPOs, compared to one-third (33%) who feel they had no impact on offering activity. Only nine percent indicated the President and Congress negatively impacted the market.\nICOs? No. Reg. A+? Yes\nInitial coin offerings (ICOs) became increasingly common in 2017, with some start-ups raising hundreds of millions in capital, but less than one-fifth (19%) of capital markets executives view ICOs as a future threat to traditional IPOs.\nA majority (64%) of bankers expect to see increased interest in Regulation A+ offerings which can raise up to $50 million in a 12-month period under scaled down regulations, but are not listed on exchanges. A slightly smaller majority (55%) view Regulation A+ offerings as an attractive alternative to a traditional IPO for smaller businesses.\n2018 Industry Outlook\nFor the fifth consecutive year, the healthcare industry was the bellwether of the U.S. IPO market and most capital markets executives believe the healthcare sector will have even more IPOs in 2018. Overall, a majority of bankers are forecasting an increase in IPOs from the technology (89%), biotech (71%) and healthcare (60%) industries. In addition, close to half of the executives also project an increase in offerings in the financial (45%) sector. (see chart below).\nIndustry\nIncrease\nStable\nDecrease\nTechnology 89%\n10% 1% Biotech 71%\n24% 5% Healthcare 60%\n29% 11% Financial 45%\n36% 19% Energy/Natural Resources 38% 39% 23% Media/Telecom 38% 34% 28% Industrial/Manufacturing 36% 42% 22% Real Estate 28% 48% 24% Consumer/Retail 20% 20% 60%\n(Proportions of Capital Markets Executives expecting IPO activity to increase, remain stable or decrease in specific industries.)\nOther major findings of the 2018 BDO IPO Outlook Survey:\n2017 IPO Recovery. After two consecutive years of diminishing offerings, IPO activity on U.S. exchanges was up significantly in 2017. Capital markets executives are split on the reason for the increase in offerings. When asked to identify the primary factor behind the jump in IPOs, an increased confidence in the U.S. economy (38%) is most often cited. Other drivers identified by the bankers were positive IPO performance encouraging additional offerings (18%), pro-business climate of the Trump administration and Republican-controlled Congress (18%), continued low interest rates pushing demand for higher yielding assets (13%) and increased investor cash flow into stock-focused mutual funds (13%). 2018 IPO Threats . When asked to comment upon the greatest threat to a healthy U.S. IPO market in 2018, almost one-third (33%) of I-bankers cite global political and economic instability, while just over one-fifth (22%) identify inflated private valuations that will not be supported in public markets. Smaller percentages focused on domestic political instability (18%), a failure of the Trump administration to deliver on deregulation (14%) and Federal Reserve rate hikes (13%). PE and VC Will be Lead Sources of IPOs. Private equity (40%) and venture capital (37%) portfolios are the most often mentioned sources of IPOs in the coming year. Spinoffs/divestitures (14%) and owner-managed, privately-held businesses (9%) are the other sources identified by the bankers. Valued Attributes of Offerings. When asked what offering attribute will be most valued by the investment community in 2018, three-quarters of the bankers cite either long-term growth potential (43%) or innovative businesses offerings/products (32%). Profitability (12%) Stable cash flow (11%), and low debt (2%) are mentioned by smaller proportions of participants.\nThese findings are from the 2018 BDO IPO Outlook , a national telephone survey conducted by Market Measurement, Inc. on behalf of the Capital Markets Practice of BDO USA. Executive interviewers spoke directly to 100 capital markets executives at leading investment banks regarding the market for initial public offerings in the United States in the coming year. The survey, which took place in December of 2017, was conducted within a scientifically-develope", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.bdo.com%2Finsights%2Fassurance%2Fclient-advisories%2F2018-bdo-ipo-outlook&esheet=51739856&newsitemid=20180109005295&lan=en-US&anchor=new+survey&index=1&md5=ae3cf3047dc07e82cbb31c77f6c40688", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.bdo.com%2Finsights%2Fassurance%2Fclient-advisories%2F2018-bdo-ipo-outlook&esheet=51739856&newsitemid=20180109005295&lan=en-US&anchor=2018+BDO+IPO+Outlook&index=2&md5=b7c1ab78730cdf2861fad15379479bc8", "http://www.businesswire.com/news/home/20180109005295/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.bdo.com&esheet=51739856&newsitemid=20180109005295&lan=en-US&anchor=www.bdo.com&index=3&md5=a4f402588ab1d8dbb89db6a700d6c947"], "published": "2018-01-09T18:04:00.000+02:00", "crawled": "2018-01-09T18:53:43.061+02:00", "highlightTitle": ""}