{"organizations": [], "uuid": "e3c605b1f5f49a7ef8af62dd6f5da5966cdaea0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218813870&w=1200&r=LYNXMPEE01072", "site_section": "https://www.reuters.com/news/world", "section_title": "World News | Reuters.com", "url": "https://www.reuters.com/article/us-northkorea-missiles-kimjongun-image/donned-in-light-gray-north-koreas-kim-targeted-softer-relaxed-image-in-new-years-address-idUSKBN1ER0CJ", "country": "US", "domain_rank": 408, "title": "Clad in light grey, North Korea's Kim goes for softer image in New Year address", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T15:11:00.000+02:00", "replies_count": 0, "uuid": "e3c605b1f5f49a7ef8af62dd6f5da5966cdaea0b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-northkorea-missiles-kimjongun-image/donned-in-light-gray-north-koreas-kim-targeted-softer-relaxed-image-in-new-years-address-idUSKBN1ER0CJ", "ord_in_thread": 0, "title": "Clad in light grey, North Korea's Kim goes for softer image in New Year address", "locations": [], "entities": {"persons": [{"name": "kim jong", "sentiment": "negative"}, {"name": "kim", "sentiment": "negative"}, {"name": "kim jong un", "sentiment": "none"}], "locations": [{"name": "seoul", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "korea institute for national unification", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL (Reuters) - The light-grey suit and matching tie that North Korea’s Kim Jong Un donned for his New Year’s address was likely carefully calculated to project a softer, more relaxed image to go with his surprise offer for talks with Seoul.\nDeparting from his usual black or navy suits, Kim gave his televised speech wearing black-rimmed glasses and slicked back hair, speaking fluently and rarely looking down to read as he raised the possibility of sending a delegation to the upcoming Winter Olympics in South Korea.\n“In this New Year’s address, North Korea seems to have taken great pains with the image portrayed by Kim Jong Un,” said an analysis by the state-run Korea Institute for National Unification after Kim’s speech.\n“The change from the previous dark Maoist suits to a softer toned grey Western-style suit likely aimed to underpin peace, which Kim stressed in his address,” the institute said.\nIt added that Kim’s style “reflected a relaxed state of mind” that likely resulted from his previous announcement that North Korea had achieved its nuclear ambitions.\nAfter a year dominated by fiery rhetoric and escalating tensions over Pyongyang’s nuclear weapons programme, Kim declared Monday that his country was “a peace-loving and responsible nuclear power” and called for lowering military tensions and improving ties with the South.\nKim also said he was open to dialogue with Seoul, prompting South Korea on Tuesday to propose high-level talks between the two countries on Jan. 9 at the border truce village of Panmunjeom.\nFILE PHOTO: North Korean leader Kim Jong Un waves to people attending a military parade marking the 105th birth anniversary of country's founding father, Kim Il Sung in Pyongyang, April 15, 2017. REUTERS/Damir Sagolj Analysts said the North Korean leader’s speech on Monday showed more confidence compared to previous years, his old habit of swaying from side to side while making speeches nearly undetectable. In his first New Year’s address as North Korea’s leader in 2013, Kim frequently sounded short of breath, his voice wavering from time to time.\nKim made his maiden public address in April 15, 2012 at a parade marking the centenary of his grandfather’s birth. This year, there was none of the uneasiness that marked that speech and his subsequent public addresses.\nHis voice, his hair shaved on the side, as well as his light-colored Western-style suit and glasses, were also reminiscent of his grandfather, Kim Il Sung, according to defectors and analysts. Kim Il Sung had a more gregarious and popular image than Kim Jong Un’s reclusive father, Kim Jong Il.\nKim Jong Un has embraced New Year addresses as a chance to outline his policies and rally the North Korean people. Last year, he used his speech to declare that North Korea was in the “final stages” of perfecting an intercontinental ballistic missile.\nKim Gun-hee, a consultant on image making and leadership, said the grey suit may have been designed to deflect some of the negative global attention Kim’s nuclear and missile tests have prompted.\n“When we advise clients who are in tough situations or are surrounded by unfavourable rumours, we tell them to wear either white or grey,” she said.\n“In the study of color psychology, white imbues innocence while grey tends to take attention away from you. Kim may have felt some pressure from being at the centre of global focus and turned to grey after sticking to dark tones for several years.”\nReporting by Christine Kim, additional reporting by Hyonhee Shin,; Editing by Soyoung Kim and Lincoln Feast\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-02T15:11:00.000+02:00", "crawled": "2018-01-02T18:25:24.005+02:00", "highlightTitle": ""}