{"organizations": [], "uuid": "5c63b5b4a73450e6e95a6aee69b4876440c122b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 26, "shares": 26, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/05/05/102650201-RTX19IUZ.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/up-to-15-percent-market-correction-in-2018-julius-baer-ceo.html", "country": "US", "domain_rank": 767, "title": "Up to 15 percent market correction in 2018: Julius Baer CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-31T11:23:00.000+02:00", "replies_count": 0, "uuid": "5c63b5b4a73450e6e95a6aee69b4876440c122b2"}, "author": "Natasha Turak", "url": "https://www.cnbc.com/2018/01/31/up-to-15-percent-market-correction-in-2018-julius-baer-ceo.html", "ord_in_thread": 0, "title": "Up to 15 percent market correction in 2018: Julius Baer CEO", "locations": [], "entities": {"persons": [{"name": "julius baer", "sentiment": "negative"}, {"name": "valentin", "sentiment": "none"}, {"name": "hodler", "sentiment": "none"}, {"name": "bernhard hodler", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A market correction is well overdue and investors should expect a price drop of up to 15 percent this year, Julius Baer Chief Executive Bernhard Hodler told CNBC Wednesday.\n\"Generally I think we will see sooner or later a correction — hopefully it will be like a 5, 10, 15 percent correction, another very large one, but I think that will happen sometime in 2018,\" Hodler said, sounding not in the least perplexed at the prospect.\nThe private Swiss banking group manages more than 388 billion Swiss francs ($416 billion) in assets.\nHodler acknowledged the current rosy picture for the global economy, saying, \"We are actually comfortable with the underlyings, corporate earnings, balance sheet quality, the GDP (gross domestic product) growth is predicted to be quite nice in 2018.\" He did note at the same time that \"there are some political risks and threats from protectionism.\"\nA market correction is a backtrack of at least 10 percent in a stock, an index or other security to account for an overvaluation in price, interrupting the market's upward trajectory.\nValentin Flauraud | Bloomberg | Getty Images A sign sits on a wall outside the offices of Julius Baer Group Ltd. in Geneva, Switzerland. The CEO's forecast is the latest of several such comments from investors and banking executives, who warn that the combination of highly overvalued markets and historically low volatility is simply not sustainable.\nDuring the World Economic Forum at Davos last week, Allianz CEO Oliver Bate echoed the same sentiment, albeit with more concern in his delivery, warning that markets are \"very dangerous\" and that the certainty of an impending market correction is \"absolutely clear.\"\nProminent market commentators have noted that today's stock market is the most overvalued on record — more so than in 1929, 2000 and 2007. The benchmark Dow Jones and S&P 500 indexes repeatedly hit record highs for the past several months until Monday, when the markets saw their first significant dips since the summer.\nJulius Baer on Wednesday reported it would increase its dividend after seeing double-digit growth for its net profits for 2017. Net profits rose 14 percent on 2016, reaching 705 million Swiss francs. The bank is the third-largest in Switzerland.\nshow chapters Julius Baer CEO: We are largest independent wealth manager in Brazil 12 Hours Ago | 01:55", "external_links": [], "published": "2018-01-31T11:23:00.000+02:00", "crawled": "2018-01-31T11:22:40.017+02:00", "highlightTitle": ""}