{"organizations": [], "uuid": "e2b10fba32def8b80795ab9db7ea03640f3ff6be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-bacardi-to-acquire-patran-tequila.html", "country": "US", "domain_rank": 767, "title": "Bacardi to Acquire Patrón Tequila", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.975, "site_type": "news", "published": "2018-01-22T23:28:00.000+02:00", "replies_count": 0, "uuid": "e2b10fba32def8b80795ab9db7ea03640f3ff6be"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-bacardi-to-acquire-patran-tequila.html", "ord_in_thread": 0, "title": "Bacardi to Acquire Patrón Tequila", "locations": [], "entities": {"persons": [], "locations": [{"name": "patrón", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "bacardi", "sentiment": "negative"}, {"name": "patrón spirits international ag", "sentiment": "none"}, {"name": "bacardi limited", "sentiment": "none"}, {"name": "bermuda & schaffhausen", "sentiment": "none"}, {"name": "patrón spirits international", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Adds clear market leader in fast-growing super-premium tequila segment to iconic portfolio\nHAMILTON, Bermuda & SCHAFFHAUSEN, Switzerland--(BUSINESS WIRE)-- Family-owned Bacardi Limited, the largest privately held spirits company in the world, announced today that it is expanding its portfolio of premium spirits with a definitive agreement to acquire 100% ownership of Patrón Spirits International AG and its PATRÓN ® brand, the world’s top-selling ultra-premium tequila. The transaction, which is subject to customary closing conditions, follows the successful relationship the companies have had for nearly a decade since Bacardi’s initial acquisition of a significant minority stake in Patrón in 2008. The transaction reflects an enterprise value for Patrón of US$5.1 billion and is expected to close in the first half of 2018.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180122006459/en/\nBacardi agrees to acquire 100% ownership of Patrón Spirits International and its PATRÓN® brand, the world’s top-selling ultra-premium tequila. (Photo: Business Wire)\nAccording to the most recent IWSR data, this transaction will make Bacardi the number one spirits player in the super-premium segment in the U.S. and the second largest spirits company in market share by value in the critically important United States market.\nPatrón was founded by entrepreneurs John Paul DeJoria and Martin Crowley with a mission to create a tequila that was “simply perfect,” a philosophy that continues to guide the business today. Patrón tequila is produced from the highest-quality 100% Weber Blue Agave, distilled through time-honored processes with meticulous precision and care, and delivered in iconic bottles that are a symbol of perfection around the world.\nTequila is one of the fastest-growing and most attractive categories in the spirits industry, with Patrón being the clear market leader in the super-premium segment. Super-premium brands continue to experience the fastest growth, and the trend is expected to continue.\n“We started this business more than a quarter century ago with a singular mission – to create an ultra-premium, luxury tequila,” said John Paul DeJoria, co-founder of Patrón tequila. “Today, with that continued commitment to quality and several other extraordinary brands in our portfolio, we produce more than three million cases of distilled spirits annually that are enjoyed around the world. I am proud of what our entire organization has accomplished, and the work we do in giving back to the people and communities in which we operate.”\n“Patrón and Bacardi were both founded on the principles of quality, integrity, and innovation, and driven by a sense of fearlessness – it’s in our DNA,” said Facundo L. Bacardi, Chairman of Bacardi Limited. “It has been a privilege being a partner for a number of years with a remarkable entrepreneur like John Paul DeJoria. John Paul’s vision, integrity, and courage are responsible for introducing the world to simply perfect tequila. As we move forward together, we will continue to pursue perfection as the guiding light in everything Patrón stands for.”\nBarry Kabalkin, Vice Chairman of Bacardi Limited and a member of the board of directors of Patrón since 2008, added, “Patrón is one of the world’s most coveted spirits brands, and we are thrilled to take our long-standing relationship to the next level. Working with the extraordinary team at Patrón, for whom we have the highest possible respect, we will stay true to our shared values. That’s a promise I made to John Paul, a one-of-a-kind visionary, and to Ed Brown, who over a period of nearly 20 years has successfully turned Patrón into an industry phenomenon. Patrón is a brand that transcends the tequila category and will uniquely complement the Bacardi portfolio of premium brands.”\n“Adding Patrón to the Bacardi portfolio creates a tremendous opportunity for the brand outside of the United States as Bacardi’s international distribution network will help grow Patrón around the world, increasing scale in the U.S. and globally,” said Mahesh Madhavan, CEO of Bacardi Limited. “I look forward to working with the talented team at Patrón.”\nThe Patrón leadership team, including Chief Executive Officer Edward Brown, Chief Operating Officer David R. Wilson, and Chief Marketing Officer Lee Applbaum, will continue in their roles.\n“Patrón is more than just a brand we have built; it has been a personal passion for nearly 20 years. I truly consider the Patrón team my extended family,” said Patrón President and CEO Edward Brown. “As Bacardi has had an ownership stake in Patrón for almost a decade now, and truly knows and appreciates our unique business, they are the best and most logical steward to continue our pursuit of perfection.”\nFollowing the closing of the deal, DeJoria will serve as an ambassador for Patrón in the role of Chairman Emeritus and intends to work with Bacardi in further advancing their combined dedication to philanthropic projects and environmental consciousness. Patrón’s efforts have included support for food banks, education, and disaster relief, as well as development of an eco-friendly reverse osmosis irrigation system, a process of recycling agave fibers from the tequila production process for use as fertilizer compost, and reforestation of trees in the community surrounding its tequila manufacturing operations in Atotonilco el Alto, Jalisco, Mexico.\nAs one of the world’s leading premium spirits companies, Bacardi is known for preserving and nurturing the unique heritage of brands it acquires and will continue to work with the leadership of Patrón as the guardians and inspiration of the brand. Patrón is set to join an iconic, one-of-a-kind portfolio that includes BACARDÍ ® , GREY GOOSE ® , BOMBAY SAPPHIRE ® , DEWAR’S ® , MARTINI ® , and a premium tequila portfolio of CAZADORES ® and CORZO ® .\nAbout Bacardi Limited\nBacardi Limited, the largest privately held spirits company in the world, produces and markets internationally recognized spirits and wines. The Bacardi brand portfolio comprises more than 200 brands and labels, including BACARDÍ ® rum, GREY GOOSE ® vodka, DEWAR’S ® Blended Scotch whisky, BOMBAY SAPPHIRE ® gin, MARTINI ® vermouth and sparkling wines, CAZADORES ® 100% blue agave tequila, and other leading and emerging brands including WILLIAM LAWSON’S ® Blended Scotch whisky, ERISTOFF ® vodka, and ST-GERMAIN ® elderflower liqueur.\nFounded nearly 156 years ago, in Santiago de Cuba on February 4, 1862, family-owned Bacardi currently employs approximately 5,500, operates more than 20 production facilities, including bottling, distilling and manufacturing sites, and sells its brands in more than 170 countries. Bacardi Limited refers to the Bacardi group of companies, including Bacardi International Limited. www.bacardilimited.com\nAbout Patrón\nPatrón Spirits International AG is a privately held, leading manufacturer of ultra-premium distilled spirits. Its portfolio includes the following product lines: Patrón ® , Roca Patrón ® , Gran Patrón ® , XO Cafe ® , Citrónge ® , Pyrat ® , and Ultimat ® , as well as limited and special edition distilled spirits. Patrón tequilas and liqueurs, Pyrat, and Ultimat are available in more than 100 countries and islands across the world and sold in global duty-free outlets. www.patronspirits.com\nEditor’s Note: Multimedia assets for Bacardi and Patrón are available for download via BusinessWire and www.bacardilimited.com and www.patronspirits.com .\n©2018 BACARDI\nBACARDI, THE BAT DEVICE & OTHER MARKS RELATED TO PRODUCTS IN THIS NEWS RELEASE ARE TRADEMARKS OF BACARDI & COMPANY LIMITED OR OF OTHER SUBSIDIARIES OF BACARDI LIMITED\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006459/en/\nBacardi Limited\nMedia Contacts:\nAmy Federman\nafederman@bacardi.com\nor\nGreg Cohen\ngcohen@patronspirits.com\nor\nInvestors:\nFor investor-related inquiries:\nbacardiinvestor@bacardi.com .\nSource: Bacardi Limited", "external_links": ["http://www.businesswire.com/news/home/20180122006459/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.bacardilimited.com&esheet=51747026&newsitemid=20180122006459&lan=en-US&anchor=www.bacardilimited.com&index=3&md5=bb2dd0de51a00f1383ff4053ef37c957", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.patronspirits.com&esheet=51747026&newsitemid=20180122006459&lan=en-US&anchor=www.patronspirits.com&index=4&md5=54a670a692d8884bc0028d85cf0ba2b3", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.patronspirits.com&esheet=51747026&newsitemid=20180122006459&lan=en-US&anchor=www.patronspirits.com&index=2&md5=a3d249ee5dfca60b485df1373b86197e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.bacardilimited.com&esheet=51747026&newsitemid=20180122006459&lan=en-US&anchor=www.bacardilimited.com&index=1&md5=b07a823f464b60e00d57be8f7012ba38"], "published": "2018-01-22T23:28:00.000+02:00", "crawled": "2018-01-23T02:15:59.039+02:00", "highlightTitle": ""}