{"organizations": [], "uuid": "2d8238811e7852451cb017e72d542719337ec63a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226539284&w=1200&r=LYNXMPEE0T0FE", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-europe-stocks/cyclical-reversal-dents-european-shares-idUKKBN1FJ0Z8", "country": "US", "domain_rank": 408, "title": "Cyclical reversal dents European shares as results roll in", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T12:05:00.000+02:00", "replies_count": 0, "uuid": "2d8238811e7852451cb017e72d542719337ec63a"}, "author": "", "url": "https://uk.reuters.com/article/uk-europe-stocks/cyclical-reversal-dents-european-shares-idUKKBN1FJ0Z8", "ord_in_thread": 0, "title": "Cyclical reversal dents European shares as results roll in", "locations": [], "entities": {"persons": [{"name": "helen reid", "sentiment": "none"}, {"name": "prabhav bhadani", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "wall street", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "jp morgan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "msci world", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 8:42 AM / Updated 4 minutes ago Cyclical reversal dents European shares as results roll in Helen Reid 4 Min Read \nLONDON (Reuters) - European shares fell back on Tuesday as global markets took a risk-averse turn, with cyclical sectors including mining and financials suffering the sharpest losses. \nEurope’s STOXX 600 dropped 0.6 percent at the open before easing slightly to trade down 0.3 percent, in line with euro zone blue-chips. \nThe falls followed weaker trading sessions in Asia and Wall Street. \n“Today is more of a temporary blip rather than a fundamental change in direction for equities. There were a number of technical indicators pointing towards market complacency and today’s move should provide some relief,” said Prabhav Bhadani, equity strategist at JP Morgan. \nThe cyclical sectors leading the charge year-to-date were the worst hit as investors took profits after a strong run. \nGoldman Sachs analysts said a correction was becoming increasingly likely as the new year ‘melt-up’ in stocks had helped the S&P 500 and MSCI World enter their longest period without a correction of more than 5 percent. \nMining and financial stocks were the biggest weight, while defensive sectors outperformed. \n“You are seeing some sector rotation with again the winners hit the hardest. People are still looking to stay invested but looking at things that have not performed, looking at value,” said Bhadani. \nBasic resources stocks .SXPP sank 1.4 percent, the biggest sectoral fallers as metals prices tumbled, dented by the strengthening dollar. Anglo American ( AAL.L ) was among the worst-performing. \nEurope’s banking stocks also fell 0.9 percent while financial services stocks dropped 0.8 percent. \nTech stocks .SX8P meanwhile outperformed the market, gaining 0.3 percent as they recovered from a pullback on Monday when a report Apple would halve iPhone X production weighed on chipmakers. \nResults drove the bulk of trading, with investors rewarding Swatch and Alfa Laval while Loomis and Philips disappointed. \nLoomis ( LOOMb.ST ) was bottom of the STOXX, down 7.9 percent after the Swedish support services firm reported fourth-quarter profit missed forecasts. \nSwatch ( UHR.S ) gained 2.8 percent after impressive results. The Swiss watchmaker’s profit rose 28 percent in 2017, and it said it expected ‘very positive’ growth in 2018. \n“The only fly in the ointment is the 20bps margin miss for the full year and approximately 50bps in the second half vs our and the market’s expectation, but this should be easy to digest given the overall good (top line) performance,” said Baader Helvea analysts. \nOutside of results-driven moves, Telecom Italia ( TLIT.MI ) rose 3.4 percent after sources said it had proposed to separate its network assets. \nSwedish engineering group Alfa Laval ( ALFA.ST ) rose 3 percent after its fourth quarter order intake far exceeded market forecasts. \nWind turbine maker Siemens Gamesa ( SGREN.MC ) gained 5 percent after its first-quarter results, bringing peer Vestas Wind ( VWS.CO ) up with it to the top of the STOXX. \nSiemens Gamesa reported orders significantly above brokers’ estimates, and a trader said the market was short the stock, making any good news an even bigger boost. \nMedical technology firm Philips ( PHG.AS ) fell back 2.5 percent, with traders pointing to the firm missing fourth-quarter earnings and revenue expectations. Reporting by Helen Reid; Editing by Kit Rees and Raissa Kasolowsky", "external_links": [], "published": "2018-01-30T12:05:00.000+02:00", "crawled": "2018-01-30T12:11:05.002+02:00", "highlightTitle": ""}