{"organizations": [], "uuid": "dfc53a78cbfdd4b271b8affb6feb8d078a028c76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226439482&w=1200&r=LYNXMPEE0T00B", "site_section": "http://feeds.reuters.com/reuters/INhollywood", "section_title": "Reuters: Hollywood News", "url": "https://in.reuters.com/article/us-britain-bbc/bbc-women-denounce-unequal-pay-as-heat-rises-for-broadcaster-idINKBN1FJ00Q", "country": "US", "domain_rank": 408, "title": "BBC women denounce unequal pay as heat rises for broadcaster", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T02:09:00.000+02:00", "replies_count": 0, "uuid": "dfc53a78cbfdd4b271b8affb6feb8d078a028c76"}, "author": "", "url": "https://in.reuters.com/article/us-britain-bbc/bbc-women-denounce-unequal-pay-as-heat-rises-for-broadcaster-idINKBN1FJ00Q", "ord_in_thread": 0, "title": "BBC women denounce unequal pay as heat rises for broadcaster", "locations": [], "entities": {"persons": [{"name": "estelle shirbon", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "negative"}, {"name": "nuj", "sentiment": "none"}, {"name": "national union of journalists", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bbc women", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 12:10 AM / Updated an hour ago BBC denies gender bias as women staff denounce unequal pay Estelle Shirbon 4 Min Read \nLONDON (Reuters) - Women working for the BBC have complained they are paid less than men in equivalent jobs and accused managers of misleading them about their pay to hide widespread gender discrimination at Britain’s public broadcaster. \nBut the BBC published a review of the pay of some 800 on-air staff, produced by PwC, which found no evidence of gender bias in pay decision-making at the broadcaster, a cherished institution funded by a license fee levied on TV viewers. \nThe BBC has been struggling to quell anger among female employees since it had to name its best-paid on-air staff last July and disclose their pay bands, revealing that two-thirds of them were men of whom some were paid far more than female peers. \nFemale staff seeking redress have become bogged down in opaque internal processes, according to BBC Women, a group of 170 staff. \n“Women have experienced veiled threats made against them when they raised the subject of equal pay,” the group said in written evidence to parliament’s media committee, which is due to hear evidence on BBC pay on Wednesday. \nThe BBC admits to a gender pay gap of 9 percent, meaning more men are in better paid jobs, but says this is narrower than the British average of 18 percent. The corporation does not admit to paying women less than men for equal work. \nBut the PwC review’s findings are unlikely to satisfy aggrieved female staff. BBC Women said it had no confidence in the review. \nThe group provided 14 examples of women who described frustrating battles with managers over pay discrimination. A woman is reflected as she passes the BBC's Broadcasting House in London, Britain July 19, 2017. REUTERS/Neil Hall/File Photo \n“I have co-presented with a male colleague for many years ... I estimate he’s paid around double what I earn for doing the same job,” said one of the unnamed women in a typical submission. “I raised the equal pay issue many times over the years, but nothing was done.” PAY CUTS FOR MEN \nParliament’s media committee is due to hear oral evidence on Wednesday from Carrie Gracie, the BBC’s former China editor who quit this month in protest over being paid less than her male peers, and from BBC Director-General Tony Hall. \nThe BBC will propose a pay cap of 320,000 pounds ($450,000) per year for news presenters as part of a wider restructuring of pay, its own media editor reported on Tuesday. \nBut lawmaker Damian Collins, chair of the media committee, said the cap would have made no difference in Gracie’s case. Her annual pay as China editor was 135,000 pounds while her counterpart Jon Sopel, North America editor, was paid between 200,000 and 250,000. \nSopel was one of six high-profile male presenters and journalists who agreed to take pay cuts after Gracie’s resignation, but Collins said that would not address what he called “the lack of equal pay throughout the organization”. \nThe pay issue has led to bizarre situations on BBC radio and TV, with some people whose own pay packages were part of the debate presenting news programs covering the topic. \nOn the day when news of Gracie’s resignation broke, she was co-presenting the flagship morning radio program Today with John Humphrys, a BBC veteran whose annual pay of over 600,000 pounds was one of the most controversial disclosures. \nHumphrys is one of the six men who have agreed to pay cuts. Reporting by Estelle Shirbon; Editing by Larry King and Robin Pomeroy", "external_links": [], "published": "2018-01-30T02:09:00.000+02:00", "crawled": "2018-01-30T02:41:03.044+02:00", "highlightTitle": ""}