{"organizations": [], "uuid": "c455e3f95ab9c0f9f1ceefc2a37856aec4c00f20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-university-of-st-augustine-for-health-sciences-names-dr-divina-grossman-president.html", "country": "US", "domain_rank": 767, "title": "University of St. Augustine for Health Sciences Names Dr. Divina Grossman President", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T21:56:00.000+02:00", "replies_count": 0, "uuid": "c455e3f95ab9c0f9f1ceefc2a37856aec4c00f20"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-university-of-st-augustine-for-health-sciences-names-dr-divina-grossman-president.html", "ord_in_thread": 0, "title": "University of St. Augustine for Health Sciences Names Dr. Divina Grossman President", "locations": [], "entities": {"persons": [{"name": "divina grossman", "sentiment": "negative"}, {"name": "grossman", "sentiment": "none"}, {"name": "wanda nitsch", "sentiment": "none"}, {"name": "john hoey", "sentiment": "none"}], "locations": [{"name": "san marcos", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "usahs", "sentiment": "none"}], "organizations": [{"name": "university of st. augustine for health sciences", "sentiment": "negative"}, {"name": "university of st.", "sentiment": "negative"}, {"name": "university of massachusetts, dartmouth", "sentiment": "none"}, {"name": "the board", "sentiment": "none"}, {"name": "gustine for health sciences", "sentiment": "none"}, {"name": "usahs", "sentiment": "none"}, {"name": "usahs board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN MARCOS, Calif., Jan. 22, 2018 /PRNewswire/ -- The Board of Directors of the University of St. Augustine for Health Sciences (USAHS) has named Dr. Divina Grossman as President, effective March 1, 2018. Dr. Grossman, a tenured professor who previously served as Chancellor of the University of Massachusetts, Dartmouth, has more than 30 years of experience as a leader, practitioner, researcher and innovator in higher education. Dr. Wanda Nitsch, who served as president of USAHS for six years, had announced her plan to retire at the beginning of 2018.\n\"The Board is extremely pleased that someone with Dr. Grossman's expertise and commitment to innovation in health sciences education will serve as the University's new president,\" said John Hoey, Chair of the USAHS Board. \"We believe Dr. Grossman brings a unique blend of strong interprofessional academic and health sciences credentials, outstanding operating experience, deep community linkages, and, most importantly, a powerful vision for advancing the transformation of USAHS into the nation's leading institution of graduate education in health sciences.\"\nPrior to serving as Chancellor at the University of Massachusetts, Dartmouth, Dr. Grossman was the Founding Vice President for Engagement at Florida International University, where she also served as Dean of the College of Nursing and Health Sciences. She formerly was the Department Chair and Associate Professor of Chronic Nursing Care at the University of Texas Health Science Center at San Antonio.\nDr. Grossman earned her PhD in Nursing at the University of Pennsylvania, Master of Science in Nursing at the University of Miami, and Bachelor of Science in Nursing at the University of Santo Tomas. She also completed the New Presidents Program at Harvard University. She is a lecturer, researcher, and widely published author on integrated health care topics.\nThroughout her career, Dr. Grossman has focused on community service and engagement initiatives that address the health and wellness of those in need. Through partnerships and pro-active outreach to local communities, Dr. Grossman has championed development of programs addressing community health needs, particularly in minority and disadvantaged populations. In addition to volunteering her time and expertise to local organizations and charitable groups, Dr. Grossman serves as Vice Chair and Board Member of Beyond Flexner Alliance – an organization of health professionals committed to equality of access to quality health care.\n\"This is an extraordinary transformational moment for our University,\" said Vivian Sanchez, CEO of USAHS. \"Thanks to the leadership of retiring president Dr. Nitsch, we have a strong foundation of graduate health sciences programs, a nationally recognized faculty of professionals, and alumni who are leaders in their field. Dr. Grossman has the academic credentials, higher education experience, and passionate commitment to innovation, research and diversity that will build upon this foundation and propel our University to global leadership in graduate health sciences education.\"\n\"I am both honored and humbled to have the opportunity to serve as president of this great institution,\" said Dr. Grossman. \"I look forward to working with the entire USAHS community at this pivotal moment in the University's history to shape the future of health care education in the nation and around the globe.\"\nThe Board of Directors of USAHS conducted a comprehensive, inclusive, national search for a new president, with input from academic leadership, faculty, and staff, as well as representatives from each of the University's campus locations. The full engagement and participation of the USAHS community in the search process were critical to the selection by the Board of Dr. Grossman.\nAbout the University of St. Augustine for Health Sciences\nThe University of St. Augustine for Health Sciences (USAHS) is a graduate institution that offers degree programs in physical therapy, occupational therapy, nursing, education and health science, as well as continuing education programs. Founded in 1979, USAHS has locations in St. Augustine and Miami, Florida; San Marcos, California; and Austin, Texas. USAHS is regionally accredited by the Western Association of Schools and Colleges Senior College and University Commission. USAHS completed a rigorous assessment by B Lab®, an independent non-profit organization that serves as a global movement of people using business as a force for good, and became a Certified B Corporation®. USAHS is a member of the Laureate International Universities network and Laureate Education, Inc. is a Certified B Corp® – the largest corporation ever to become a B Corp™. For more information about USAHS visit www.usa.edu .\nView original content with multimedia: http://www.prnewswire.com/news-releases/university-of-st-augustine-for-health-sciences-names-dr-divina-grossman-president-300586067.html\nSOURCE University of St. Augustine for Health Sciences", "external_links": ["http://www.usa.edu/", "http://www.prnewswire.com/news-releases/university-of-st-augustine-for-health-sciences-names-dr-divina-grossman-president-300586067.html", "https://www.usa.edu/"], "published": "2018-01-22T21:56:00.000+02:00", "crawled": "2018-01-22T23:21:24.000+02:00", "highlightTitle": ""}