{"organizations": [], "uuid": "d6659dff5c0240eefd0d552d82c98ac1345abb09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223977651&w=1200&r=LYNXMPEE0K0Y0", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-japan-economy-tankan/japan-manufacturers-mood-jumps-to-11-year-high-reuters-tankan-idUKKBN1FA174", "country": "US", "domain_rank": 408, "title": "Japan manufacturers' mood jumps to 11-year high - Reuters Tankan", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T01:10:00.000+02:00", "replies_count": 0, "uuid": "d6659dff5c0240eefd0d552d82c98ac1345abb09"}, "author": "", "url": "https://uk.reuters.com/article/uk-japan-economy-tankan/japan-manufacturers-mood-jumps-to-11-year-high-reuters-tankan-idUKKBN1FA174", "ord_in_thread": 0, "title": "Japan manufacturers' mood jumps to 11-year high - Reuters Tankan", "locations": [], "entities": {"persons": [{"name": "izumi nakagawa", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}], "organizations": [{"name": "reuters tankan", "sentiment": "negative"}, {"name": "japan inc", "sentiment": "none"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "boj", "sentiment": "none"}, {"name": "reuters tankan tetsushi kajimoto", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 11:11 PM / Updated an hour ago Japan manufacturers' mood jumps to 11-year high - Reuters Tankan Tetsushi Kajimoto , Izumi Nakagawa 3 Min Read \nTOKYO (Reuters) - Confidence among Japanese manufacturers jumped in January to an 11-year high, the Reuters Tankan poll showed on Monday, highlighting corporate optimism driven by nearly two years of uninterrupted economic expansion and a buoyant stock market. \nThe monthly poll, which tracks the Bank of Japan’s (BOJ) closely-watched tankan quarterly survey, followed a key gauge of capital spending out last week showing Japan Inc’s readiness to spend some of their huge cash pile, potentially spurring a virtuous cycle of investment, consumption and growth. \nThe positive data should bolster the confidence of the central bank, which is set to issue a rosy view of the economy at its two-day policy-setting meeting ending on Tuesday. \nStability in currencies, global demand for electronics and cars, and capital expenditure were cited among factors behind bullish manufacturing sentiment seen in the Reuters poll of 547 large and mid-sized companies. \nSome 255 companies responded to the anonymous survey during the January 4-17 polling period. \n“The market related to industrial machinery and semiconductors is buoyant, with the latter in particular skyrocketing,” a manager at a rubber manufacturer wrote in the survey. \nThe Reuters Tankan sentiment index for manufacturers stood at 35 in January, up from 27 in December, the first rise in three months. \nManufacturers in areas such as steel/nonferrous metals and chemicals, and metal production machinery led the gain. \nThe index matched the high reached in January 2007, around the time a booming economy allowed the BOJ to end a previous spell of quantitative easing and zero interest rates. The index is expected to remain unchanged over the next three months. \nBOJ Governor Haruhiko Kuroda is expected to reassure markets at this week’s policy-setting meeting that the central bank has no imminent plan to whittle down its huge monetary stimulus until its 2 percent inflation target is achieved. \nIn the Reuters Tankan, the service-sector sentiment index slipped to 33 in January from 34 in the previous month, with the information/communications industry falling from previous highs. \nThe service-sector index is expected to fall to 29 in April. \nThe BOJ’s latest tankan showed last month that big manufacturers’ confidence improved for a fifth straight quarter in December to hit an 11-year high, a sign of the economy’s broadening recovery on solid external demand and hefty corporate profits. \nThe Reuters Tankan’s sentiment indexes subtract the percentage of companies saying conditions are poor from those saying conditions are good. A positive number means optimists outnumber pessimists. Reporting by Tetsushi Kajimoto; Editing by Eric Meijer", "external_links": [], "published": "2018-01-22T01:10:00.000+02:00", "crawled": "2018-01-22T01:44:54.000+02:00", "highlightTitle": ""}