{"organizations": [], "uuid": "ad85af32d3f7b133f4b631444d620ecda3bcb281", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 24, "shares": 24, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220945246&w=1200&r=LYNXMPEE091J5", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-puertorico-debt-bankruptcy/puerto-rico-creditor-aurelius-asks-u-s-judge-to-throw-out-bankruptcy-idUSKBN1EZ2UR", "country": "US", "domain_rank": 408, "title": "Puerto Rico creditor Aurelius asks U.S. judge to throw out bankruptcy", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T23:56:00.000+02:00", "replies_count": 0, "uuid": "ad85af32d3f7b133f4b631444d620ecda3bcb281"}, "author": "", "url": "https://www.reuters.com/article/us-puertorico-debt-bankruptcy/puerto-rico-creditor-aurelius-asks-u-s-judge-to-throw-out-bankruptcy-idUSKBN1EZ2UR", "ord_in_thread": 0, "title": "Puerto Rico creditor Aurelius asks U.S. judge to throw out bankruptcy", "locations": [], "entities": {"persons": [{"name": "aurelius", "sentiment": "negative"}, {"name": "olson", "sentiment": "none"}, {"name": "nick brown", "sentiment": "none"}, {"name": "swain", "sentiment": "none"}, {"name": "laura taylor swain", "sentiment": "none"}, {"name": "theodore olson", "sentiment": "none"}], "locations": [{"name": "puerto rico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "min read  new york", "sentiment": "none"}, {"name": "u.s. district court", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "aurelius capital management", "sentiment": "none"}, {"name": "u.s. congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Aurelius Capital Management, a major Puerto Rico bondholder, asked a federal judge on Wednesday to throw out the U.S. territory’s historic bankruptcy, challenging the constitutionality of the board overseeing the island’s finances.\nAt a hearing in federal court in New York, Aurelius told U.S. District Court Judge Laura Taylor Swain that Puerto Rico’s oversight board was appointed by the U.S. Congress in violation of the Constitution’s appointments clause, which governs how certain public officials are designated.\n“Congress can go back and do this right,” Aurelius lawyer and former U.S. Solicitor General Theodore Olson said. “The president can make new appointments.”\nThe bankruptcy case filed by the board last May on Puerto Rico’s behalf should be thrown out, Olson added during a three-and-a-half hour hearing.\nSwain, who is presiding over Puerto Rico’s bankruptcy case, did not indicate when she may rule, and her decision is certain to be appealed by whichever side loses.\nThe case goes to the heart of how Puerto Rico is to restructure $120 billion in combined bond and pension debt, and who may oversee the process.\nA dismissal of the bankruptcy would add more uncertainty for an island already navigating the biggest restructuring in U.S. municipal history while struggling to recover from its worst natural disaster in 90 years, September’s Hurricane Maria.\nUnder a 2016 federal Puerto Rico rescue law known as PROMESA, Congress appointed six members to a board tasked with managing the territory’s finances, with President Barack Obama adding a seventh. PROMESA gave the board authority to push Puerto Rico into a court-supervised restructuring akin to U.S. bankruptcy, which it did in May.\nSince then, the board has pushed for drastic repayments cuts to bondholders like Aurelius, which holds around $468 million of Puerto Rico’s debt.\nAurelius says board members are federal officers, and under the appointments clause should have been appointed by the U.S. president, and confirmed by the Senate.\n“The president had to choose appointees from lawmakers’ lists,” Olson said. “Congress cannot put the president in that kind of box.”\nBy no means an effort to free Puerto Rico from federal oversight, Aurelius wants the bankruptcy nixed and, possibly, the reappointment of new board members by incumbent Republican President Donald Trump.\nCLASH OF LEGAL TITANS Its case is viewed as a long-shot, but the hedge fund, known for aggressive litigation, pulled out all the stops in tapping Olson.\nIn addition to his role as solicitor general, Olson is famous for representing Bush in 2000’s Bush v. Gore U.S. Supreme Court case, as well as challenging California’s “Proposition 8” ban on same-sex marriage.\nFor its part, the board hired ex-Obama Solicitor General Donald Verrilli, who argued on Wednesday that the board is “funded 100 percent out of the treasury of Puerto Rico,” and that its members are officers of that island, not the United States.\nVerrilli warned that Aurelius’ argument could call into question the federal government’s 1947 decision allowing Puerto Ricans to elect their own governor, potentially threatening Puerto Rico’s very right to self-rule.\nThe U.S. Department of Justice sided with the board, calling PROMESA “unquestionably constitutional.”\n“Despite all the former solicitor generals in the room today, we don’t feel this one is that close,” DOJ lawyer Thomas Ward said.\nThe case is In re: Commonwealth of Puerto Rico, 17-3283, in the U.S. District Court for the Southern District of New York.\nReporting by Nick Brown; Editing by Daniel Bases and Diane Craft\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-10T23:56:00.000+02:00", "crawled": "2018-01-11T00:37:10.031+02:00", "highlightTitle": ""}