{"organizations": [], "uuid": "b83ca57ea154dbac9a312aa3bc47d70abd97afa6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-honeywell-reports-strong-fourth-quarter-and-2017-results-raises-2018-guidance-to-reflect-lower-tax-rate.html", "country": "US", "domain_rank": 767, "title": "Honeywell Reports Strong Fourth Quarter And 2017 Results, Raises 2018 Guidance To Reflect Lower Tax Rate", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T14:30:00.000+02:00", "replies_count": 0, "uuid": "b83ca57ea154dbac9a312aa3bc47d70abd97afa6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-honeywell-reports-strong-fourth-quarter-and-2017-results-raises-2018-guidance-to-reflect-lower-tax-rate.html", "ord_in_thread": 0, "title": "Honeywell Reports Strong Fourth Quarter And 2017 Results, Raises 2018 Guidance To Reflect Lower Tax Rate", "locations": [], "entities": {"persons": [{"name": "darius adamczyk", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "morris plains", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "honeywell", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "intelligrated", "sentiment": "none"}, {"name": "uop", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MORRIS PLAINS, N.J., Jan. 26, 2018 /PRNewswire/ -- Honeywell ( NYSE: HON ) today announced financial results for the fourth quarter and full year of 2017, and raised its 2018 earnings 2 guidance by 20 cents to a new range of $7.75 - $8.00 to reflect an expected lower tax rate due to the U.S. Tax Cuts and Jobs Act of 2017.\n\"Honeywell delivered a strong fourth quarter, capping an exceptional year for the company,\" said Darius Adamczyk, president and chief executive officer of Honeywell. \"Fourth-quarter sales grew six percent organically, leading to full-year organic sales growth of four percent, driven by robust growth in Aerospace aftermarket, UOP, Advanced Materials, and Intelligrated. We leveraged HOS Gold to drive outstanding growth and expand segment margins by 70 basis points for the year. Earnings per share 3 were $1.85 in the fourth quarter and $7.11 for the full year, up 10 percent year over year, excluding the fourth-quarter charge related to U.S. tax reform and other items, as a result of our strong focus on growth and productivity. Our businesses achieved exceptional free cash flow, with 123 percent conversion in the fourth quarter and 90 percent conversion for the full year, exceeding the high end of our guidance for 2017.\n\"While delivering outstanding 2017 results, we also made significant investments in our future, including funding more than $350 million in restructuring projects,\" Adamczyk continued. \"We generated significant value for our shareowners in 2017 through a 12 percent increase in our dividend; $2.9 billion in share repurchases, including $1.6 billion in the fourth quarter; and the closing of three acquisitions. Our financial performance and aggressive capital deployment led to a total shareowner return of 35 percent, well ahead of the S&P's total shareowner return of 22 percent and the median return of our multi-industry peers of 24 percent.\n\"Honeywell's transformation to a software-industrial leader is well underway, and in 2018, we expect to complete the spin-offs of our Homes and Global Distribution business, and our Transportation Systems business, which will position Honeywell for future growth and margin expansion. After the spins, these businesses will be better positioned to maximize shareowner value through focused strategic decision making and capital allocation tailored for their end markets,\" Adamczyk said.\n\"I am confident in Honeywell's future, and our ability to continue to deliver for our shareowners and our employees. Our strong performance in 2017, together with the enactment of new U.S. tax legislation, has enabled us to increase our 401(k) match in the U.S. This is a sustained, annual benefit that will provide a more secure retirement for our employees. We believe that enhancing this benefit is extremely valuable and important to our employees over the long term,\" Adamczyk concluded.\nThe Company recorded a provisional charge of $3.8 billion in the fourth quarter to reflect the estimated impacts of the U.S. Tax Cuts and Jobs Act of 2017, including the U.S. tax on deemed repatriated earnings of non-U.S. subsidiaries, the writedown of net U.S. deferred tax liabilities at lower enacted corporate tax rates, and the effects of the implementation of the territorial tax system. The impacts of the legislation may differ from this estimate, possibly materially (and the amount of the provisional charge may accordingly be adjusted over the course of 2018), due to changes in interpretations and assumptions the Company has made, guidance that may be issued, and actions the Company may take as a result of the tax legislation. Honeywell has been a strong supporter of this legislation and is encouraged by the significantly enhanced capital mobility, lower U.S. corporate income tax rates, and more appealing investment environment in the U.S., which the legislation enables.\nHoneywell updated its 2018 guidance to reflect 2017 results and the anticipated impact of the U.S. tax reform. The company now expects that its 2018 effective tax rate will be between 22 percent and 23 percent. Full-year earnings per share 4 are now expected to be between $7.75 and $8.00, up 9 percent to 13 percent. A summary of the guidance changes can be found in the table below.\nHoneywell will discuss its results during an investor conference call today starting at 8 a.m. Eastern Standard Time.\nFourth-Quarter Performance\nHoneywell sales for the fourth quarter were up six percent on an organic basis and up nine percent on a reported basis. The difference between reported and organic sales relates to the impact of foreign currency translation. The fourth-quarter financial results can be found in Tables 2 and 3, below.\nAerospace sales for the fourth quarter were up five percent on an organic basis driven by growth in the commercial aftermarket and U.S. defense, and demand for light vehicle gas and commercial vehicle turbochargers in Transportation Systems. Segment margin expanded 270 bps to 22.9 percent, primarily driven by higher Commercial Aftermarket volumes, productivity net of inflation, lower year-over-year customer incentives, and commercial excellence.\nHome and Building Technologies sales for the fourth quarter were up three percent on an organic basis driven bycontinued demand in Products for fire and building offerings in Europe, as well as continued strength in Global Distribution and robust growth in China. Segment margin contracted 40 bps to 17.6 percent, driven by lower Security volumes and investments for growth, partially offset by commercial excellence.\nPerformance Materials and Technologies sales for the fourth quarter were up nine percent on an organic basis driven by strong growth across all businesses. UOP grew 12 percent on an organic basis driven by robust gas processing, catalyst, and equipment growth, and Advanced Materials grew 19 percent on an organic basis driven by continued demand for Solstice ® low-global-warming products.Short-cycle demand in Process Solutions was strong as well. Segment margin contracted 180 bps to 21.3 percent, primarily driven by an unplanned plant outage and a different year-over-year mix impact of catalyst sales combined with stronger equipment volumes in UOP versus our guidance, partly offset by productivity net of inflation and commercial excellence.\nSafety and Productivity Solutions sales for the fourth quarter were up 12 percent on an organic basis driven by double-digit organic sales growth at Intelligrated; higher volumes in industrial safety products, sensing controls, and voice-enabled workflow solutions; and strong Retail demand. Segment margin expanded 140 bps to 15.7 percent, primarily driven by higher volumes and productivity net of inflation.\nTo participate on the conference call, please dial (866) 548-4713 (domestic) or (323) 794-2093 (international) approximately ten minutes before the 8 a.m. EST start. Please mention to the operator that you are dialing in for Honeywell's fourth quarter 2017 earnings call or provide the conference code HON4Q17. The live webcast of the investor call as well as related presentation materials will be available through the \"Investor Relations\" section of the company's Website ( www.honeywell.com/investor ). Investors can hear a replay of the conference call from 1 p.m. EST, January 26, until 1 p.m. EST, February 2, by dialing (888) 203-1112 (domestic) or (719) 457-0820 (international). The access code is 9224317.\nTable 1: FULL-YEAR 2018 GUIDANCE 5\nPrevious Guidance\nCurrent Guidance\nSales\n$41.8B - $42.5B\n$41.8B - $42.5B\nOrganic Growth\n2% - 4%\n2% - 4%\nSegment Margin\n19.2% - 19.5%\n19.3% - 19.6%\nExpansion\nUp 30 - 60 bps\nUp 30 - 60 bps\nEarnings Per Share\n$7.55 - $7.80\n$7.75 - $8.00\nEarnings Growth\n6% - 10%\n9% - 13%\nFree Cash Flow 6\n$5.2B - $5.9B\n$5.2B - $5.9B\nTABLE 2: SUMMARY OF FINANCIAL RESULTS – TOTAL HONEYWELL\n(Sales, Cash Flow In $ Millions)\nFY 2016\nFY 2017\nChange\nSales\n39,302\n40,534\n3%\nOrganic\n4%\nSegment Margin\n18.3%\n19.0%\n70 bps\nOperating Income Margin\n17.0%\n17.6%\n60 bps\nEarnings Per Share\nReported\n$6.20\n$2.14\n(65%)\nEx-Pension MTM, 2016 Divestitures, Separation Costs,\n4Q16 Debt Refinancing and Tax Reform Charge\n$6.46\n$7.11\n10%\nCash Flow From Operations\n5,498\n5,966\n9%\nFree Cash Flow 6\n4,403\n4,935\n12%\n4Q 2016\n4Q 2017\nChange\nSales\n9,985\n10,843\n9%\nOrganic\n6%\nSegment Margin\n19.0%\n19.3%\n30 bps\nOperating Income Margin\n16.2%\n15.8%\n(40) bps\nEarnings/Loss Per Share\nReported\n$1.34\n($3.18)\n(337%)\nEx-Pension MTM, Separation Costs,\n4Q16 Debt Refinancing and Tax Reform Charge\n$1.74\n$1.85\n6%\nCash Flow From Operations\n2,042\n2,172\n6%\nFree Cash Flow 6\n1,696\n1,754\n3%\nTABLE 3: SUMMARY OF FINANCIAL RESULTS – SEGMENTS\n(Sales, Segment Profit In $ Millions)\nAEROSPACE\nFY 2016\nFY 2017\nChange\nSales\n14,751\n14,779\n~Flat\nOrganic\n2%\nSegment Profit\n2,991\n3,288\n10%\nSegment Margin\n20.3%\n22.2%\n190 bps\n4Q 2016\n4Q 2017\nSales\n3,666\n3,902\n6%\nOrganic\n5%\nSegment Profit\n739\n893\n21%\nSegment Margin\n20.2%\n22.9%\n270 bps\nHOME AND BUILDING TECHNOLOGIES\nFY 2016\nFY 2017\nChange\nSales\n9,490\n9,777\n3%\nOrganic\n2%\nSegment Profit\n1,621\n1,650\n2%\nSegment Margin\n17.1%\n16.9%\n(20) bps\n4Q 2016\n4Q 2017\nSales\n2,488\n2,615\n5%\nOrganic\n3%\nSegment Profit\n449\n461\n3%\nSegment Margin\n18.0%\n17.6%\n(40) bps\nPERFORMANCE MATERIALS AND TECHNOLOGIES\nFY 2016\nFY 2017\nChange\nSales\n10,436\n10,339\n(1)%\nOrganic\n8%\nSegment Profit\n2,112\n2,206\n4%\nSegment Margin\n20.2%\n21.3%\n110 bps\n4Q 2016\n4Q 2017\nSales\n2,540\n2,854\n12%\nOrganic\n9%\nSegment Profit\n587\n607\n3%\nSegment Margin\n23.1%\n21.3%\n(180) bps\nSAFETY AND PRODUCTIVITY SOLUTIONS\nFY 2016\nFY 2017\nChange\nSales\n4,625\n5,639\n22%\nOrganic\n5%\nSegment Profit\n680\n852\n25%\nSegment Margin\n14.7%\n15.1%\n40 bps\n4Q 2016\n4Q 2017\nSales\n1,291\n1,472\n14%\nOrganic\n12%\nSegment Profit\n185\n231\n25%\nSegment Margin\n14.3%\n15.7%\n140 bps\nHoneywell ( www.honeywell.com ) is a Fortune 100 software-industrial company that delivers industry specific solutions that include aerospace and automotive products and services; control technologies for buildings, homes, and industry; and performance materials globally. Our technologies help everything from aircraft, cars, homes and buildings, manufacturing plants, supply chains, and workers become more connected to make our world smarter, safer, and more sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom .\nThis release contains certain statements that may be deemed \"forward-looking statements\" within the meaning of Section 21E of the Securities Exchange Act of 1934. All statements, other than statements of historical fact, that address activities, events or developments that we or our management intends, expects, projects, believes or anticipates will or may occur in the future are forward-looking statements. Such statements are based upon certain assumptions and assessments made by our management in light of their experience and their perception of historical trends, current economic and industry conditions, expected future developments and other factors they believe to be appropriate. The forward-looking statements included in this release are also subject to a number of material risks and uncertainties, including but not limited to economic, competitive, governmental, and technological factors affecting our operations, markets, products, services and prices, as well as the ability to effect the separations. Such forward-looking statements are not guarantees of future performance, and actual results, developments and business decisions may differ from those envisaged by such forward-looking statements, including with respect to any changes in or abandonment of the proposed separations. We identify the principal risks and uncertainties that affect our performance in our Form 10-K and other filings with the Securities and Exchange Commission.\nInformation regarding the impact of the Tax Cuts and Jobs Act of 2017 (\"Tax Legislation\") consists of preliminary estimates which are forward-looking statements and are subject to change, possibly materially, as the firm completes its financial statements. Information regarding the impact of Tax Legislation is based on our current calculations, as well our current interpretations, assumptions and expectations relating to Tax Legislation, which are subject to further change.\nThis release contains financial measures presented on a non-GAAP basis. Honeywell's non-GAAP financial measures used in this release are as follows: segment profit, on an overall Honeywell basis, a measure by which we assess operating performance, which we define as operating income adjusted for certain items as presented in the Appendix; segment margin, on an overall Honeywell basis, which we define as segment profit divided by sales; organic sales growth, which we define as sales growth less the impacts from foreign currency translation and acquisitions and divestitures for the first 12 months following transaction date; free cash flow, which we define as cash flow from operations less capital expenditures and which we adjust to exclude separation costs and with respect to forward looking measures, adjustments to the provisional charge related to Tax Legislation, if and as noted in the release; free cash flow conversion, which we define as free cash flow divided by net income attributable to Honeywell excluding pension mark-to-market expenses, separation costs, the provisional charge related to Tax Legislation, and with respect to forward looking measures, adjustments to such provisional charge; and earnings per share, which we adjust to exclude pension mark-to-market expenses, as well as for other components, such as divestitures, debt refinancings, and exclusion of separation costs, the provisional charge related to Tax Legislation, and with respect to forward looking measures, adjustments to such provisional charge, if and as noted in the release. Other than references to reported earnings per share, all references to earnings per share in this release are so adjusted. The respective tax rates applied when adjusting earnings per share for these items are identified in the release or in the reconciliations presented in the Appendix. Management believes that, when considered together with reported amounts, these measures are useful to investors and management in understanding our ongoing operations and in the analysis of ongoing operating trends. These metrics should be considered in addition to, and not as replacements for, the most comparable GAAP measure. Refer to the Appendix attached to this release for reconciliations of non-GAAP financial measures to the most directly comparable GAAP measures. Forward looking quantitative reconciliations herein exclude separation costs because management cannot reliably predict or precisely estimate, without unreasonable effort, those costs given the preliminary nature of the estimates and exclude any adjustments to the provisional charge related to Tax Legislation as such charge is provisional.\n1 Free cash flow is cash flow from operations less capital expenditures; free cash flow conversion is free cash flow divided by net income attributable to Honeywell excluding pension mark-to-market expenses, separation costs related to the spin-offs of the Homes and Transportation Systems businesses and the provisional charge related to the Tax Cuts and Jobs Act of 2017\n2 EPS excludes pension mark-to-market, separation costs, and adjustments to the provisional charge related to the Tax Cuts and Jobs Act of 2017\n3 EPS, EPS V% exclude pension mark-to-market, 2016 divestitures, 4Q16 debt refinancing, separation costs, and the provisional charge related to the Tax Cuts and Jobs Act of 2017\n4 EPS, EPS V% exclude pension mark-to-market, 2016 divestitures, 4Q16 debt refinancing, separation costs related to the spin-offs of the Homes and Transportation Systems businesses, the provisional charge related to the Tax Cuts and Jobs Act of 2017 and adjustments to such charge\n5 EPS, EPS V% exclude pension mark-to-market, 2016 divestitures, 4Q16 debt refinancing, separation costs related to the spin-offs of the Homes and Transportation Systems businesses, the provisional charge related to the Tax Cuts and Jobs Act of 2017 and adjustments to such charge; free cash flow, free cash flow V% exclude separation costs and impacts from the Tax Cuts and Jobs Act of 2017\n6 Cash flow from operations less capital expenditures\nContacts:\nMedia\nInvestor Relations\nScott Sayres\nMark Macaluso\n(480) 257-8921\n(973) 455-2222\nscott.sayres@honeywell.com\nmark.macaluso@honeywell.com\nHoneywell International Inc.\nConsolidated Statement of Operations (Unaudited)\n(Dollars in millions, except per share amounts)\nThree Months Ended\nTwelve Months Ended\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nProduct sales\n$ 8,646\n$ 7,964\n$ 32,317\n$ 31,362\nService sales\n2,197\n2,021\n8,217\n7,940\nNet sales\n10,843\n9,985\n40,534\n39,302\nCosts, expenses and other\nCost of products sold (A)\n6,114\n5,625\n22,659\n22,170\nCost of services sold (A)\n1,382\n1,254\n4,916\n4,980\n7,496\n6,879\n27,575\n27,150\nSelling, general and administrative expenses (A)\n1,631\n1,493\n5,808\n5,469\nOther (income) expense\n18\n95\n(67)\n(102)\nInterest and other financial charges\n81\n86\n316\n338\n9,226\n8,553\n33,632\n32,855\nIncome before taxes\n1,617\n1,432\n6,902\n6,447\nTax expense\n4,016\n387\n5,204\n1,601\nNet income (loss)\n(2,399)\n1,045\n1,698\n4,846\nLess: Net income attributable to the noncontrolling interest\n12\n11\n43\n37\nNet income (loss) attributable to Honeywell\n$ (2,411)\n$ 1,034\n$ 1,655\n$ 4,809\nEarnings (loss) per share of common stock - basic\n$ (3.18)\n$ 1.36\n$ 2.17\n$ 6.29\nEarnings (loss) per share of common stock - assuming dilution\n$ (3.18)\n$ 1.34\n$ 2.14\n$ 6.20\nWeighted average number of shares outstanding - basic\n758.8\n762.4\n762.1\n764.3\nWeighted average number of shares outstanding - assuming dilution\n758.8\n(B)\n772.3\n772.1\n775.3\n(A) Cost of products and services sold and selling, general and administrative expenses include amounts for repositioning and other charges, pension and other postretirement (income) expense, and stock compensation expense.\n(B) Due to a loss for the period, no incremental shares are included because the effect would be antidilutive.\nBelow is a reconciliation of earnings per share to earnings per share, excluding pension mark-to-market expense, debt refinancing expense, separation costs, impact from the Tax Cuts and Jobs Act of 2017 (\"Tax Reform\"), and earnings attributable to 2016 divestitures. We believe this measure is useful to investors and management in understanding our ongoing operations and in analysis of ongoing operating trends. For the three months ended December 31, 2017, earnings per share utilizes weighted average number of shares outstanding, assuming dilution of 769.0 million.\nThree Months Ended\nTwelve Months Ended\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nEarnings (loss) per share of common stock - assuming dilution\n$ (3.18)\n$ 1.34\n$ 2.14\n$ 6.20\nPension mark-to-market expense (1)\n0.09\n0.28\n0.09\n0.28\nDebt refinancing expense (2)\n-\n0.12\n-\n0.12\nSeparation costs\n0.02\n-\n0.02\n-\nImpacts from Tax Reform\n4.88\n-\n4.86\n-\nEarnings attributable to 2016 divestitures (3)\n-\n-\n-\n(0.14)\nImpact of dilution of weighted average number of shares outstanding\n0.04\n-\n-\n-\nEarnings per share of common stock - assuming dilution, excluding pension\nmark-to-market expense, debt refinancing expense, separation costs, impacts from\nTax Reform, and 2016 divestitures\n$ 1.85\n$ 1.74\n$ 7.11\n$ 6.46\n(1) Pension mark-to-market expense uses a blended tax rate of 23% and 21.3% for 2017 and 2016.\n(2) Debt refinancing expense uses a tax rate of 26.5% for 2016.\n(3) Earnings attributable to 2016 divestitures use a blended tax rate of 33.9% for 2016.\nHoneywell International Inc.\nSegment Data (Unaudited)\n(Dollars in millions)\nThree Months Ended\nTwelve Months Ended\nDecember 31,\nDecember 31,\nNet Sales\n2017\n2016\n2017\n2016\nAerospace\n$ 3,902\n$ 3,666\n$ 14,779\n$ 14,751\nHome and Building Technologies\n2,615\n2,488\n9,777\n9,490\nPerformance Materials and Technologies\n2,854\n2,540\n10,339\n10,436\nSafety and Productivity Solutions\n1,472\n1,291\n5,639\n4,625\nTotal\n$ 10,843\n$ 9,985\n$ 40,534\n$ 39,302\nReconciliation of Segment Profit to Income Before Taxes\nThree Months Ended\nTwelve Months Ended\nDecember 31,\nDecember 31,\nSegment Profit\n2017\n2016\n2017\n2016\nAerospace\n$ 893\n$ 739\n$ 3,288\n$ 2,991\nHome and Building Technologies\n461\n449\n1,650\n1,621\nPerformance Materials and Technologies\n607\n587\n2,206\n2,112\nSafety and Productivity Solutions\n231\n185\n852\n680\nCorporate\n(96)\n(61)\n(306)\n(218)\nTotal segment profit\n2,096\n1,899\n7,690\n7,186\nOther income (expense) (A)\n(26)\n(103)\n28\n71\nInterest and other financial charges\n(81)\n(86)\n(316)\n(338)\nStock compensation expense (B)\n(43)\n(39)\n(176)\n(184)\nPension ongoing income (B)\n167\n154\n713\n601\nPension mark-to-market expense (B)\n(87)\n(273)\n(87)\n(273)\nOther postretirement income (B)\n5\n8\n21\n32\nRepositioning and other charges (B)\n(414)\n(128)\n(971)\n(648)\nIncome before taxes\n$ 1,617\n$ 1,432\n$ 6,902\n$ 6,447\n(A)\nEquity income (loss) of affiliated companies is included in segment profit.\n(B)\nAmounts included in cost of products and services sold and selling, general and administrative expenses.\nHoneywell International Inc.\nConsolidated Balance Sheet (Unaudited)\n(Dollars in millions)\nDecember 31,\nDecember 31,\n2017\n2016\nASSETS\nCurrent assets:\nCash and cash equivalents\n$ 7,059\n$ 7,843\nShort-term investments\n3,758\n1,520\nAccounts receivable - net\n8,866\n8,177\nInventories\n4,613\n4,366\nOther current assets\n1,706\n1,152\nTotal current assets\n26,002\n23,058\nInvestments and long-term receivables\n667\n587\nProperty, plant and equipment - net\n5,926\n5,793\nGoodwill\n18,277\n17,707\nOther intangible assets - net\n4,496\n4,634\nInsurance recoveries for asbestos related liabilities\n411\n417\nDeferred income taxes\n236\n347\nOther assets\n3,372\n1,603\nTotal assets\n$ 59,387\n$ 54,146\nLIABILITIES AND SHAREOWNERS' EQUITY\nCurrent liabilities:\nAccounts payable\n$ 6,584\n$ 5,690\nCommercial paper and other short-term borrowings\n3,958\n3,366\nCurrent maturities of long-term debt\n1,351\n227\nAccrued liabilities\n6,968\n7,048\nTotal current liabilities\n18,861\n16,331\nLong-term debt\n12,573\n12,182\nDeferred income taxes\n2,894\n486\nPostretirement benefit obligations other than pensions\n512\n473\nAsbestos related liabilities\n1,173\n1,014\nOther liabilities\n5,930\n4,110\nRedeemable noncontrolling interest\n5\n3\nShareowners' equity\n17,439\n19,547\nTotal liabilities, redeemable noncontrolling interest and shareowners' equity\n$ 59,387\n$ 54,146\nHoneywell International Inc.\nConsolidated Statement of Cash Flows (Unaudited)\n(Dollars in millions)\nThree Months Ended\nTwelve Months Ended\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nCash flows from operating activities:\nNet income (loss)\n$ (2,399)\n$ 1,045\n$ 1,698\n$ 4,846\nLess: Net income attributable to the noncontrolling interest\n12\n11\n43\n37\nNet income (loss) attributable to Honeywell\n(2,411)\n1,034\n1,655\n4,809\nAdjustments to reconcile net income (loss) attributable to Honeywell to net\ncash provided by operating activities:\nDepreciation\n183\n180\n717\n726\nAmortization\n100\n77\n398\n304\n(Gain) loss on sale of non-strategic businesses and assets\n7\n(2)\n7\n(178)\nRepositioning and other charges\n438\n128\n1,021\n695\nNet payments for repositioning and other charges\n(234)\n(205)\n(628)\n(625)\nPension and other postretirement (income) expense\n(85)\n111\n(647)\n(360)\nPension and other postretirement benefit payments\n(35)\n(33)\n(106)\n(143)\nStock compensation expense\n43\n39\n176\n184\nDeferred income taxes\n2,370\n(70)\n2,294\n76\nOther\n1,680\n227\n1,642\n194\nChanges in assets and liabilities, net of the effects of\nacquisitions and divestitures:\nAccounts receivable\n(274)\n(55)\n(682)\n(547)\nInventories\n141\n215\n(259)\n(18)\nOther current assets\n(581)\n(106)\n(568)\n(106)\nAccounts payable\n520\n272\n924\n254\nAccrued liabilities\n310\n230\n22\n233\nNet cash provided by operating activities\n2,172\n2,042\n5,966\n5,498\nCash flows from investing activities:\nExpenditures for property, plant and equipment\n(418)\n(346)\n(1,031)\n(1,095)\nProceeds from disposals of property, plant and equipment\n40\n17\n86\n21\nIncrease in investments\n(2,594)\n(871)\n(6,743)\n(3,954)\nDecrease in investments\n1,621\n1,023\n4,414\n3,681\nCash paid for acquisitions, net of cash acquired\n(10)\n(5)\n(82)\n(2,573)\nProceeds from sales of businesses, net of fees paid\n-\n(8)\n-\n296\nOther\n(22)\n124\n(218)\n282\nNet cash used for investing activities\n(1,383)\n(66)\n(3,574)\n(3,342)\nCash flows from financing activities:\nProceeds from issuance of commercial paper and other short-term borrowings\n4,893\n2,848\n13,701\n18,997\nPayments of commercial paper and other short-term borrowings\n(4,924)\n(4,887)\n(13,532)\n(21,461)\nProceeds from issuance of common stock\n57\n23\n520\n409\nProceeds from issuance of long-term debt\n1,199\n4,735\n1,238\n9,245\nPayments of long-term debt\n(223)\n(2,361)\n(292)\n(2,839)\nRepurchases of common stock\n(1,554)\n(213)\n(2,889)\n(2,079)\nCash dividends paid\n(565)\n(505)\n(2,119)\n(1,915)\nPayments to purchase the noncontrolling interest\n-\n-\n-\n(238)\nAdvanSix pre-separation funding\n-\n-\n-\n269\nAdvanSix pre-spin borrowing\n-\n-\n-\n38\nAdvanSix cash at spin-off\n-\n-\n-\n(38)\nOther\n(12)\n(2)\n(143)\n(42)\nNet cash (used for) provided by financing activities\n(1,129)\n(362)\n(3,516)\n346\nEffect of foreign exchange rate changes on cash and cash equivalents\n10\n(202)\n340\n(114)\nNet (decrease) increase in cash and cash equivalents\n(330)\n1,412\n(784)\n2,388\nCash and cash equivalents at beginning of period\n7,389\n6,431\n7,843\n5,455\nCash and cash equivalents at end of period\n$ 7,059\n$ 7,843\n$ 7,059\n$ 7,843\nHoneywell International Inc.\nReconciliation of Segment Profit to Operating Income and Calculation of Segment Profit and Operating Income Margins (Unaudited)\n(Dollars in millions)\nThree Months Ended\nTwelve Months Ended\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nSegment Profit\n$ 2,096\n$ 1,899\n$ 7,690\n$ 7,186\nStock compensation expense (A)\n(43)\n(39)\n(176)\n(184)\nRepositioning and other (B, C)\n(422)\n(136)\n(1,010)\n(679)\nPension ongoing income (A)\n167\n154\n713\n601\nPension mark-to-market expense (A)\n(87)\n(273)\n(87)\n(273)\nOther postretirement income (A)\n5\n8\n21\n32\nOperating Income\n$ 1,716\n$ 1,613\n$ 7,151\n$ 6,683\nSegment Profit\n$ 2,096\n$ 1,899\n$ 7,690\n$ 7,186\n÷ Sales\n10,843\n9,985\n40,534\n39,302\nSegment Profit Margin %\n19.3%\n19.0%\n19.0%\n18.3%\nOperating Income\n$ 1,716\n$ 1,613\n$ 7,151\n$ 6,683\n÷ Sales\n10,843\n9,985\n40,534\n39,302\nOperating Income Margin %\n15.8%\n16.2%\n17.6%\n17.0%\n(A) Included in cost of products and services sold and selling, general and administrative expenses.\n(B) Includes repositioning, asbestos, environmental expenses and equity income adjustment.\n(C) Included in cost of products and services sold, selling, general and administrative expenses, and other income/expense.\nWe define segment profit as operating income, excluding stock compensation expense, pension ongoing income or expense, pension mark-to-market expense, other postretirement income or expense, and repositioning and other charges. We believe these measures are useful to investors and management in understanding our ongoing operations and in analysis of ongoing operating trends.\nA quantitative reconciliation of segment profit, on an overall Honeywell basis, to operating income has not been provided for all forward-looking measures of segment profit and segment margin included herewithin. Management cannot reliably predict or estimate, without unreasonable effort, the impact and timing on future operating results arising from items excluded from segment profit, particularly pension mark-to-market expense as it is dependent on macroeconomic factors, such as interest rates and the return generated on invested pension plan assets. The information that is unavailable to provide a quantitative reconciliation could have a significant impact on our reported financial results. To the extent quantitative information becomes available without unreasonable effort in the future, and closer to the period to which the forward-looking measures pertain, a reconciliation of segment profit to operating income will be included within future filings.\nHoneywell International Inc.\nReconciliation of Organic Sales % Change (Unaudited)\nThree Months Ended\nTwelve Months Ended\nDecember 31,\nDecember 31,\n2017\n2017\nHoneywell\nReported sales % change\n9%\n3%\nLess: Foreign currency translation\n3%\n-\nLess: Acquisitions and divestitures, net\n-\n(1)%\nOrganic sales % change\n6%\n4%\nAerospace\nReported sales % change\n6%\n-\nLess: Foreign currency translation\n1%\n-\nLess: Acquisitions and divestitures, net\n-\n(2)%\nOrganic sales % change\n5%\n2%\nHome and Building Technologies\nReported sales % change\n5%\n3%\nLess: Foreign currency translation\n2%\n-\nLess: Acquisitions and divestitures, net\n-\n1%\nOrganic sales % change\n3%\n2%\nPerformance Materials and Technologies\nReported sales % change\n12%\n(1)%\nLess: Foreign currency translation\n3%\n-\nLess: Acquisitions and divestitures, net\n-\n(9)%\nOrganic sales % change\n9%\n8%\nSafety and Productivity Solutions\nReported sales % change\n14%\n22%\nLess: Foreign currency translation\n2%\n-\nLess: Acquisitions and divestitures, net\n-\n17%\nOrganic sales % change\n12%\n5%\nWe define organic sales percent as the year-over-year change in reported sales relative to the comparable period, excluding the impact on sales from foreign currency translation and acquisitions, net of divestitures. We believe this measure is useful to investors and management in understanding our ongoing operations and in analysis of ongoing operating trends.\nA quantitative reconciliation of reported sales percent change to organic sales percent change has not been provided for forward-looking measures of organic sales percent change because management cannot reliably predict or estimate, without unreasonable effort, the fluctuations in global currency markets that impact foreign currency translation, nor is it reasonable for management to predict the timing, occurrence and impact of acquisition and divestiture transactions, all of which could significantly impact our reported sales percent change.\nHoneywell International Inc.\nReconciliation of Organic Sales % Change (Unaudited)\nThree Months Ended\nDecember 31,\n2017\nUOP\nReported sales % change\n15%\nLess: Foreign currency translation\n3%\nLess: Acquisitions and divestitures, net\n-\nOrganic sales % change\n12%\nAM\nReported sales % change\n22%\nLess: Foreign currency translation\n3%\nLess: Acquisitions and divestitures, net\n-\nOrganic sales % change\n19%\nWe define organic sales percent as the year-over-year change in reported sales relative to the comparable period, excluding the impact on sales from foreign currency translation and acquisitions, net of divestitures. We believe this measure is useful to investors and management in understanding our ongoing operations and in analysis of ongoing operating trends.\nHoneywell International Inc.\nReconciliation of Cash Provided by Operating Activities to Free Cash Flow and Calculation of Free Cash Flow Conversion, Excluding Pension Mark-to-Market Expense, Separation Costs, and Impacts from Tax Reform (Unaudited)\n(Dollars in millions)\nThree Months Ended\nTwelve Months Ended\nDecember 31,\nDecember 31,\n2017\n2017\nCash provided by operating activities\n$ 2,172\n$ 5,966\nExpenditures for property, plant and equipment\n(418)\n(1,031)\nFree cash flow\n$ 1,754\n$ 4,935\nNet income (loss), attributable to Honeywell\n$ (2,411)\n$ 1,655\nPension mark-to-market expense, net of tax (A)\n67\n67\nImpacts from separation costs, net of tax\n14\n14\nImpacts from Tax Reform\n3,754\n3,754\nNet income, attributable to Honeywell, excluding pension mark-to-market expense,\nseparation costs and Tax Reform\n$ 1,424\n$ 5,490\nCash provided by operating activities\n$ 2,172\n$ 5,966\n÷ Net income (loss) attributable to Honeywell\n$ (2,411)\n$ 1,655\nOperating cash flow conversion\n-90%\n360%\nFree cash flow\n$ 1,754\n$ 4,935\n÷ Net income attributable to Honeywell, excluding pension mark-to-market expense,\nseparation costs and impacts from Tax Reform\n$ 1,424\n$ 5,490\nFree cash flow conversion %, excluding pension mark-to-market expense,\nseparation costs and impacts from Tax Reform\n123%\n90%\n(A) Pension mark-to-market expense uses a blended tax rate of 23% and 21.3% for 2017 and 2016.\nWe define free cash flow as cash provided by operating activities less cash expenditures for property, plant and equipment.\nWe believe that this metric is useful to investors and management as a measure of cash generated by business operations that will be used to repay scheduled debt maturities and can be used to invest in future growth through new business development activities or acquisitions, pay dividends, repurchase stock or repay debt obligations prior to their maturities. This metric can also be used to evaluate our ability to generate cash flow from business operations and the impact that this cash flow has on our liquidity.\nHoneywell International Inc.\nReconciliation of Cash Provided by Operating Activities to Free Cash Flow (Unaudited)\n(Dollars in millions)\nThree Months Ended\nTwelve Months Ended\nDecember 31,\nDecember 31,\n2016\n2016\nCash provided by operating activities\n$ 2,042\n$ 5,498\nExpenditures for property, plant and equipment\n(346)\n(1,095)\nFree cash flow\n$ 1,696\n$ 4,403\nWe define free cash flow as cash provided by operating activities less cash expenditures for property, plant and equipment.\nWe believe that this metric is useful to investors and management as a measure of cash generated by business operations that will be used to repay scheduled debt maturities and can be used to invest in future growth through new business development activities or acquisitions, pay dividends, repurchase stock or repay debt obligations prior to their maturities. This metric can also be used to evaluate our ability to generate cash flow from business operations and the impact that this cash flow has on our liquidity.\nHoneywell International Inc.\nReconciliation of Earnings Per Share to Earnings Per Share, Excluding Pension Mark-to-Market Expense, Separation Costs and Impacts from Tax Reform (Unaudited)\nTwelve Months Ended\nTwelve Months Ended\nDecember 31,\nDecember 31,\n2017 (1)\n2018\nEarnings per share of common stock - assuming dilution (EPS)\n$2.14\nTBD\nPension mark-to-market expense\n0.09\nTBD\nSeparation costs\n0.02\nTBD\nImpacts from Tax Reform\n4.86\nTBD\nEPS, excluding pension mark-to-market expense, separation costs, and impacts from Tax Reform\n$7.11\n$7.75- $8.00\n(1) Utilizes weighted average shares of approximately 772.1 million for full year. Pension mark-to-market expense uses a blended tax rate of 23%.\nWe believe earnings per share, excluding pension mark-to-market expense, separation costs and impacts from Tax Reform is a measure that is useful to investors and management in understanding our ongoing operations and in analysis of ongoing operating trends. For forward looking information, management cannot reliably predict or estimate, without unreasonable effort, the pension mark-to-market expense as it is dependent on macroeconomic factors, such as interest rates and the return generated on invested pension plan assets, the separation costs given the preliminary nature of the estimates, and any adjustments to charges from Tax Reform as the charges are provisional. We therefore do not include an estimate for the pension mark-to-market expense, separation costs, or adjustments to charges from Tax Reform in this reconciliation. Based on economic and industry conditions, future developments and other relevant factors, these assumptions are subject to change.\nHoneywell International Inc.\nReconciliation of Cash Provided by Operating Activities to Free Cash Flow Excluding Separation Costs and Impacts from Tax Reform (Unaudited)\n(Dollars in billions)\nTwelve Months Ended\nDecember 31,\n2018\nCash provided by operating activities\nTBD\nSeparation costs\nTBD\nImpacts from Tax Reform\nTBD\nExpenditures for property, plant and equipment\n~(0.9)\nFree cash flow\n~$5.2 - $5.9\nWe define free cash flow as cash provided by operating activities less cash expenditures for property, plant and equipment.\nWe believe that this metric is useful to investors and management as a measure of cash generated by business operations that will be used to repay scheduled debt maturities and can be used to invest in future growth through new business development activities or acquisitions, pay dividends, repurchase stock or repay debt obligations prior to their maturities. This metric can also be used to evaluate our ability to generate cash flow from business operations and the impact that this cash flow has on our liquidity. For forward looking information, management cannot reliably predict or estimate, without unreasonable effort, the separation costs given the preliminary nature of the estimates or the amounts from Tax Reform as the charges are provisional. We therefore do not include an estimate for the separation costs or impacts from Tax Reform in this reconciliation.\nView original content: http://www.prnewswire.com/news-releases/honeywell-reports-strong-fourth-quarter-and-2017-results-raises-2018-guidance-to-reflect-lower-tax-rate-300588714.html\nSOURCE Honeywell", "external_links": ["http://www.honeywell.com/newsroom", "http://www.prnewswire.com/news-releases/honeywell-reports-strong-fourth-quarter-and-2017-results-raises-2018-guidance-to-reflect-lower-tax-rate-300588714.html", "http://www.honeywell.com/", "http://www.honeywell.com/investor"], "published": "2018-01-26T14:30:00.000+02:00", "crawled": "2018-01-26T16:42:31.025+02:00", "highlightTitle": ""}