{"organizations": [], "uuid": "467fac494463b515fdd1038ccd8541ea7ba734ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-ecoark-announces-intentions-to-submit-bid-for-beef-processor.html", "country": "US", "domain_rank": 767, "title": "Ecoark Announces Intentions to Submit Bid for Beef Processor", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T16:30:00.000+02:00", "replies_count": 0, "uuid": "467fac494463b515fdd1038ccd8541ea7ba734ab"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-ecoark-announces-intentions-to-submit-bid-for-beef-processor.html", "ord_in_thread": 0, "title": "Ecoark Announces Intentions to Submit Bid for Beef Processor", "locations": [], "entities": {"persons": [{"name": "randy may", "sentiment": "none"}], "locations": [{"name": "rogers", "sentiment": "none"}, {"name": "ark.", "sentiment": "none"}], "organizations": [{"name": "submit bid for beef processor company plans to implement zest labs", "sentiment": "negative"}, {"name": "blockchain technology", "sentiment": "negative"}, {"name": "board", "sentiment": "none"}, {"name": "ecoark holdings, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Company Plans to Implement Zest Labs™ Solution with Blockchain Technology to Modernize and Provide True Transparency for the Beef Supply Chain\nROGERS, Ark.--(BUSINESS WIRE)-- Ecoark Holdings, Inc. (“Ecoark”), dba Zest Technologies™, (OTCQX: ZEST) today announced that it has obtained Board approval to submit a bid to purchase the key assets of a beef processing operation in a sales process conducted under Section 363 of the U.S. Bankruptcy Code. The bid would be subject to the receipt of competing offers from other potential bidders and court approval. Additional details will be provided on the transaction if and when it reaches a definitive agreement.\n“We see a tremendous opportunity to introduce disruptive technology to the beef supply chain to track and trace pedigree, farming practices, authenticity, food safety and freshness from birth of the animal through to the retail store or restaurant,” stated Randy May, Chairman and CEO of Zest Technologies. “We have a proven packing plant turnaround team which we plan to insert into this operation to work alongside its current management to create a state-of-the-art operation with breakthrough technology.”\nThe facility would be expected to generate significant revenue for Zest Technologies and allow it to utilize its Zest Labs freshness management solution, Zest Fresh™, proven to be effective within major retail chains. “Consumers are increasingly expecting more information about the food they’re being served and are demanding true transparency in the perishable supply chain,” stated Peter Mehring, CEO of Zest Labs. “Zest Fresh, with integrated blockchain support, can help address the increasing demand for complete visibility related to the provenance, source, quality, compliance and pedigree of meat from pasture to premium beef.”\n“We have confidence that our selected team, combined with the current management team, will be successful in steering this proven entity back to profitability and growth,” continued May. “The acquisition would be expected to generate over $75 million of annual revenue in its first year after the proposed acquisition, and along with the continued commercialization of Zest Fresh, will accelerate our overall growth and shorten our time to profitability.”\nAbout Ecoark Holdings Inc.\nEcoark Holdings, Inc. (OTCQX: ZEST) is focused on improving the agriculture and supply chain industries through innovative AgTech solutions for growers, processors, ranchers, restaurants and retail grocers. The Company offers a suite of proven solutions that address the $161 billion fresh food waste problem, improve delivered freshness, and provide true transparency for the fresh produce, meat and seafood supply chains. To learn more about Zest Labs, please click here . To watch a video about Zest Fresh, please click here .\nForward Looking Statements\nThis release contains forward-looking statements, including, without limitation, statements concerning the business and possible or assumed future results of operations of Zest Labs; and statements concerning the ability of Zest Labs’ technology to improve delivered quality consistency, significantly reduce perishable food waste, drive sustainability, and increase efficiency in the industry. Our actual results could differ materially from those anticipated in the forward-looking statements for many reasons including: access to growth capital on favorable terms; adverse economic changes affecting markets we serve; competition in our markets and industry segments; our timing and the profitability of entering new markets; greater than expected costs, customer acceptance of our products or difficulties related to our integration of the businesses we may acquire; and other risks and uncertainties as may be detailed from time to time in our public announcements and SEC filings. Although we believe the expectations reflected in the forward-looking statements are reasonable, they relate only to events as of the date on which the statements are made, and our future results, levels of activity, performance or achievements may not meet these expectations. We do not intend to update any of the forward-looking statements after the date of this document to conform these statements to actual results or to changes in our expectations, except as required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129005379/en/\nInvestor Relations:\nICR\nJohn Mills, 646-277-1254\nJohn.Mills@icrinc.com\nor\nPublic Relations:\nfama PR\nKeith Watson, 617-986-5001\necoark@famapr.com\nSource: Ecoark Holdings, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.zestlabs.com%2Fresources&esheet=51749929&newsitemid=20180129005379&lan=en-US&anchor=click+here&index=3&md5=c7b58a693c9fcc4eb3c09e073b02341c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.zestlabs.com%2F&esheet=51749929&newsitemid=20180129005379&lan=en-US&anchor=click+here&index=2&md5=cb2b689c1320a0b52c9dba9f6e8dd101", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.ecoarkusa.com%2F&esheet=51749929&newsitemid=20180129005379&lan=en-US&anchor=Ecoark+Holdings%2C+Inc.&index=1&md5=d421afcf9b3f2d489c2e2ac1316efe53", "http://www.businesswire.com/news/home/20180129005379/en/"], "published": "2018-01-29T16:30:00.000+02:00", "crawled": "2018-01-29T20:01:39.012+02:00", "highlightTitle": ""}