{"organizations": [], "uuid": "28b93330116e32821f731745039692eb1e068258", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-ableto-inc-announces-james-p-bradley-as-chairman-of-the-board.html", "country": "US", "domain_rank": 767, "title": "AbleTo, Inc. Announces James P. Bradley as Chairman of the Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T18:31:00.000+02:00", "replies_count": 0, "uuid": "28b93330116e32821f731745039692eb1e068258"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-ableto-inc-announces-james-p-bradley-as-chairman-of-the-board.html", "ord_in_thread": 0, "title": "AbleTo, Inc. Announces James P. Bradley as Chairman of the Board", "locations": [], "entities": {"persons": [{"name": "james p. bradley", "sentiment": "negative"}, {"name": "rob rebak", "sentiment": "none"}, {"name": "bradley", "sentiment": "none"}, {"name": "james bradley", "sentiment": "none"}, {"name": "jim", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "inc.", "sentiment": "negative"}, {"name": "inc", "sentiment": "negative"}, {"name": "aetna", "sentiment": "none"}, {"name": "ncqa", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "national committee for quality assurance", "sentiment": "none"}, {"name": "bain capital ventures", "sentiment": "none"}, {"name": "unitedhealthcare", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 9, 2018 /PRNewswire/ -- AbleTo, Inc., the leading provider of technology-enabled behavioral health solutions proven to improve patient outcomes and lower healthcare costs, announced today the addition of James Bradley as its new Chairman of the Board.\nMr. Bradley is an experienced technologist, entrepreneur, C-suite executive, and Board leader in both the for-profit and not-for-profit sectors. Notably, he served as Chief Information Officer of UnitedHealthCare and as Chairman at the National Committee for Quality Assurance (NCQA) and brings deep industry knowledge and experience in health information technology to AbleTo following its successful $36.6M Series D financing round, which was led by Bain Capital Ventures and Aetna.\n\"Jim is well-known for joining transformative companies and helping them solve big problems. Few problems are more pressing than the access, quality, and cost issues associated with behavioral health. Today, over 40 million people in the United States experience an unmet behavioral health need,\" said Rob Rebak, President and CEO of AbleTo. \"Health information technology is a fundamental part of scaling our solution, and Jim's leadership and experience in this area will help to accelerate our growth.\"\n\"AbleTo is a compelling combination of a healthcare IT company and a behavioral healthcare provider organization. I was very excited about AbleTo because of the way it combines evidence-based treatment, structured data capture, and predictive analytics to develop a platform that enables insurers and employers to address unmet behavioral health needs,\" said Mr. Bradley. \"I am thrilled to join Rob and the rest of the team as Chairman of the Board to help build a breakout market leader in the technology, data, and analytics-enabled behavioral health space.\"\nHealth IT Leadership in Corporations, Founding Start-Ups\nMr. Bradley began his career in large corporations including Pfizer (a senior divisional IT role), Aetna (led operations for the northern half of Aetna's managed care plans as part of its joint venture with the Volunteer Hospitals of America), and UnitedHealthCare (Chief Information Officer). Mr. Bradley then transitioned to working with start-ups and smaller organizations. He founded Abaton.com , a company that developed web based clinical transaction software. The company was sold to McKesson Corporation where Mr. Bradley served for several years in a senior role. Following this position, Mr. Bradley was the founding CEO of RxHub, now Surescripts, which today processes billions of transactions a year in support of providing patients with safe and cost-effective medications.\nBoard Service for Non-Profits, Venture-Backed Companies, and Government\nMr. Bradley then dedicated himself to Board work with small, venture-backed companies and non-profits. During this time, he served as Chairman at the NCQA, on the Board of the Research Foundation of the American Society of Health System Pharmacy, and as Chairman of the Boards of the University of Minnesota Medical Center/Fairview and the Health Data Consortium.\nMr. Bradley has also worked with government, serving as the Program Director of Northrop Grumman's National Health Information Network project, contracted by the Office of the National Coordinator for Health IT of the U.S. Department of Health and Human Services. Mr. Bradley was also asked by the Department of HHS to use medication prescribing history data to help reconstruct medical records lost during Hurricane Katrina.\nCreating Value for Small and Midsize Growth Companies\nToday, Mr. Bradley works with the management teams of small to midsize healthcare companies and their investors to build value for all stakeholders. He recently served as Chairman of the Board of Wellpartner, Inc, and Ability Networks, both of which achieved very successful exits for their shareholders, and currently serves as Chairman of both NovuHealth and Apixio.\nMr. Bradley holds an MBA from Washington University, St. Louis, MO, and received his BS and MS degrees from the University of Illinois. He has lectured at Harvard University, University of Pennsylvania's Wharton School, University of California, University of Minnesota, and other institutions on topics related to health information technology and policy.\nAbout AbleTo, Inc.\nAbleTo, Inc. is a market leader in providing technology-enabled behavioral health care. AbleTo has been treating patients for six years, and improves patient outcomes and lowers costs by providing treatment that integrates behavioral and medical health care. AbleTo's structured therapy programs strengthen medical recovery and self-care among members with chronic or complex clinical needs. AbleTo analytics, coupled with our multi-channel engagement platform, identify and engage members with unmet, often undiagnosed, behavioral health needs. A proprietary platform connects individuals and their care teams with AbleTo licensed providers who deliver weekly sessions by phone or video supported by an integrated digital experience. AbleTo programs are clinically proven to improve both behavioral health and medical outcomes while lowering overall spending for higher-cost, higher-risk members. AbleTo's investors include .406 Ventures, Sandbox Industries, HLM Venture Partners, Horizon Healthcare Services, Inc., Bain Capital Ventures, and Aetna Ventures. Follow AbleTo on LinkedIn and Twitter.\nMedia Contact:\nAbleTo, Inc.\nJohn D. Pelle\nTel: (718) 578-8275\nEmail: John.Pelle@AbleTo.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/ableto-inc-announces-james-p-bradley-as-chairman-of-the-board-300579440.html\nSOURCE AbleTo, Inc.", "external_links": ["https://www.prnewswire.com/news-releases/ableto-raises-366-million-in-series-d-funding-led-by-bain-capital-ventures-300508507.html", "http://www.prnewswire.com/news-releases/ableto-inc-announces-james-p-bradley-as-chairman-of-the-board-300579440.html", "https://www.linkedin.com/company-beta/806634/", "https://twitter.com/AbleTo_Health"], "published": "2018-01-09T18:31:00.000+02:00", "crawled": "2018-01-09T21:26:24.039+02:00", "highlightTitle": ""}