{"organizations": [], "uuid": "562b339c2bb7e566b2e91d048e8d35fe5fb2bdcc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180113&t=2&i=1221730628&w=1200&r=LYNXMPEE0C0F6", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-germany-politics/no-grand-coalition-opponents-of-merkel-alliance-hit-the-road-idUKKBN1F20ON", "country": "US", "domain_rank": 408, "title": "No Grand Coalition! Opponents of Merkel alliance hit the road", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T18:45:00.000+02:00", "replies_count": 0, "uuid": "562b339c2bb7e566b2e91d048e8d35fe5fb2bdcc"}, "author": "", "url": "https://uk.reuters.com/article/uk-germany-politics/no-grand-coalition-opponents-of-merkel-alliance-hit-the-road-idUKKBN1F20ON", "ord_in_thread": 0, "title": "No Grand Coalition! Opponents of Merkel alliance hit the road", "locations": [], "entities": {"persons": [{"name": "merkel", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "thomas escritt", "sentiment": "none"}, {"name": "horst seehofer", "sentiment": "none"}, {"name": "martin schulz", "sentiment": "none"}, {"name": "reuters/hannibal hanschke", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "bavaria", "sentiment": "none"}], "organizations": [{"name": "csu", "sentiment": "none"}, {"name": "christian social union", "sentiment": "none"}, {"name": "spd", "sentiment": "none"}, {"name": "social democratic party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 13, 2018 / 4:46 PM / Updated 26 minutes ago No Grand Coalition! Opponents of Merkel alliance hit the road Thomas Escritt 5 Min Read \nWERNIGERODE, Germany (Reuters) - Opponents of a renewed German “grand coalition” took to the road on Saturday, hoping to persuade members of their Social Democratic Party (SPD) to vote against governing with Chancellor Angela Merkel’s conservatives for another four years. Acting German Chancellor Angela Merkel, leader of the Christian Social Union in Bavaria (CSU) Horst Seehofer and Social Democratic Party (SPD) leader Martin Schulz attend a news conference after exploratory talks about forming a new coalition government at the SPD headquarters in Berlin, Germany, January 12, 2018. REUTERS/Hannibal Hanschke \nThe party’s rank-and-file, bruised after seeing the SPD’s previous stint as Merkel’s junior partner lead to its worst election result since 1933, is wary of its leaders’ calls for the party to step up for the sake of Germany’s stability. \nLeaders of the SPD and the conservative camp thrashed out a 28-page blueprint for a possible “GroKo” grand coalition government this week, recommending that their parties hold formal coalition talks. \nBut meeting in Wernigerode, a medieval town of half-timbered buildings at the foot of the thickly forested Harz hills, delegates at a regional party meeting wrestled with the issue, which has split the party down the middle. \n“Important demands that the SPD made ahead of the elections are simply not in the document,” said Kevin Kuehnert, leader of the SPD’s Jusos youth wing, who will spend the next week criss-crossing the country arguing for delegates to vote “No” to coalition talks at a special party congress next Saturday. \n“We Jusos aren’t going to make ourselves the servants of a Black (conservative) government that demands deportations or a refugee camp,” said Florian Luedke, a local youth delegate wearing a “NoGroKo” badge, to applause. \nThe slump in the SPD vote in the Sept. 24 national election has left the membership in a contrary mood, with many calling for the party to reinvent itself in opposition rather than attempt to implement what they see as thin gruel in the coalition blueprint. \nThe document is sprinkled with pledges - on strengthening the European Union, on supporting refugees, on tax and pensions - designed to appeal to the more radical membership. \nBut most fall far short of what the SPD campaigned for in the election. A tax hike for the wealthy or the establishment of parity between private and public healthcare were absent from the document thrashed out with Merkel’s Christian Democrats (CDU) and her still more conservative Bavarian CSU allies. \n“DAMNED LONELY” \nThe Jusos are angered particularly by the document containing an aspiration that migration not exceed 220,000 a year, dismissing it as an “asylum cap by another name”. \nThe SPD’s branch in North Rhine-Westphalia, Germany’s largest state, also opposes a repeat of the coalition. Hit by the decline in the heavy industry that had provided its traditional voter base, it was toppled in the regional government by Merkel’s CDU last year. \nEven some senior party figures are not completely sold on the idea. \n“There is a great deal of scepticism,” Manuela Schwesig, SPD state premier in the northeastern state of Mecklenburg-Vorpommern, told NDR Info radio. \nAcross the country, voters have deserted the SPD for the far-right Alternative for Germany (AfD) party or the Left party, formed from the ashes of the former East German Communist party. \nAddressing the regional congress in Wernigerode, Social Democrat Foreign Minister Sigmar Gabriel urged delegates to resist the temptation to lick their wounds in opposition, urging them to use power to give people a reason to vote for them. \n“If you never make compromises you’ll end up damned lonely, pretty quickly,” Gabriel said. Only in power can the SPD advance policies that would win it votes, he added. \nHe praised the deal’s commitment to strengthening the EU and tackling youth unemployment across the bloc, saying that in a world where U.S. President Donald Trump was an increasingly unreliable partner and China ever more powerful, social democracy was hard to achieve “by national means”. \nOn this, at least, the radical youth wing agreed with him. \n“There was lots of social democracy in the first bit on Europe, but after that it stops,” Luebke said of the coalition blueprint. “Vote against the Grand Coalition, and look for ways to renew our party.” Reporting by Thomas Escritt; Editing by Hugh Lawson", "external_links": [], "published": "2018-01-13T18:45:00.000+02:00", "crawled": "2018-01-13T19:17:46.085+02:00", "highlightTitle": ""}