{"organizations": [], "uuid": "1c2885b9d275390c5d82a181f5e7c9e65229ff96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/01/27/101365845-452089493.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/oil-us-may-soon-enjoy-energy-superpower-status-sp-global-platts-analyst-says.html", "country": "US", "domain_rank": 767, "title": "Oil: US may soon enjoy 'energy superpower' status, S&P Global Platts analyst says", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.425, "site_type": "news", "published": "2018-01-04T14:14:00.000+02:00", "replies_count": 0, "uuid": "1c2885b9d275390c5d82a181f5e7c9e65229ff96"}, "author": "Sam Meredith", "url": "https://www.cnbc.com/2018/01/04/oil-us-may-soon-enjoy-energy-superpower-status-sp-global-platts-analyst-says.html", "ord_in_thread": 0, "title": "Oil: US may soon enjoy 'energy superpower' status, S&P Global Platts analyst says", "locations": [], "entities": {"persons": [{"name": "wright", "sentiment": "negative"}, {"name": "martin fraenkel", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "washington township", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "s&p global platts", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The U.S. is well-placed to join the likes of Saudi Arabia and Russia as one of the world's leading energy powerhouses, an analyst said Thursday.\n\"There is a big shift in market structure taking place and I think, so far, it really hasn't got the attention it deserves. The U.S. is emerging as, not only a military and economic superpower, but as an energy superpower,\" Martin Fraenkel, president at S&P Global Platts, told CNBC.\n\"We are expecting that by 2020, the U.S. is going to be one of the top 10 oil exporters in the world,\" he added.\n'Big shift in the dynamics of energy markets' In recent years, America's unprecedented oil and gas boom has been driven by one factor above all others — and that's shale . The so-called shale revolution could help to alleviate Washington's reliance on foreign oil, including from turbulent Middle Eastern states, while also helping to export to more countries around the world.\nIn November, the International Energy Agency (IEA) projected a dramatic increase in shale production could transform the U.S. into the world's largest exporter of liquefied natural gas by the mid-2020s.\nThe same forecast also predicted that the U.S. would likely notch another milestone a couple of years later. The Paris-based organization said that by the late-2020s, the U.S. would begin to ship more oil to foreign markets than it imports.\nshow chapters Why oil has not been supporting related currencies      11 Hours Ago | 04:11 \"This is a big, big shift in the dynamics of energy markets and, in my view, will be a shift in geopolitical markets as well,\" Fraenkel said.\nThe price of oil collapsed from almost $120 a barrel in June 2014 due to weak demand, a strong dollar and booming U.S. shale production. OPEC's reluctance to cut output was also seen as a key reason behind the fall. But, the oil cartel soon moved to curb production — along with other oil producing nations — in late 2016.\nUS vs. OPEC war is 'far from over' A key step in clearing a global supply overhang has been OPEC and Russia scaling back production. And, in late November , the 14-member cartel and 10 other allied oil producers agreed to extend output cuts through to the end of 2018.\nWhile OPEC-led production cuts have helped to stabilize oil prices, the U.S. has seized on the opportunity to rapidly increase shale production.\nAkos Stiller | Bloomberg | Getty Images Khalid Bin Abdulaziz Al-Falih, Saudi Arabia's energy minister and president of OPEC, speaks as Alexander Novak, Russia's energy minister, left, listens during a news conference following the 172nd Organization of Petroleum Exporting Countries (OPEC) meeting in Vienna, Austria, on Thursday, May 25, 2017. \"As far as the oil supply and demand balance is concerned, last year was characterized by the battle between OPEC and U.S. shale producers. The annual price gains imply that OPEC is winning… but the war is far from over,\" Tamas Varga, analyst at PVM Oil Associates, said in a note Thursday.\nBrent crude traded at around $67.82 a barrel on Thursday morning, down 0.03 percent, while U.S. crude was seen at $61.82, up 0.3 percent.", "external_links": [], "published": "2018-01-04T14:14:00.000+02:00", "crawled": "2018-01-04T14:16:19.015+02:00", "highlightTitle": ""}