{"organizations": [], "uuid": "95c223c63cd5e6f0985c4f253ee67a940681ffb4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-target-raises-q4-guidance-on-stronger-than-expected-holiday-sales.html", "country": "US", "domain_rank": 767, "title": "Target Raises Q4 Guidance on Stronger-than-Expected Holiday Sales", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-09T14:59:00.000+02:00", "replies_count": 0, "uuid": "95c223c63cd5e6f0985c4f253ee67a940681ffb4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-target-raises-q4-guidance-on-stronger-than-expected-holiday-sales.html", "ord_in_thread": 0, "title": "Target Raises Q4 Guidance on Stronger-than-Expected Holiday Sales", "locations": [], "entities": {"persons": [], "locations": [{"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS, Jan. 9, 2018 /PRNewswire/ --\nComparable sales growth of 3.4 percent in the November/December period was driven by strong traffic growth and continued strength in digital sales, which are expected to grow more than 25 percent in 2017. The Company raised its fourth quarter and full-year 2017 EPS guidance, based on the benefit of stronger-than-expected sales and recently-enacted federal tax reform. Stores fulfilled 70 percent of Target's digital volume in November/December, meaning that stores enabled approximately 80 percent of the Company's comparable sales growth in that period. Comparable sales were positive and accelerated from the third quarter in all five of the Company's core merchandise categories: Home, Apparel, Food & Beverage, Hardlines and Essentials. The Company now expects fourth quarter comparable sales growth in a range around 3.4 percent and full-year 2017 comparable sales growth of more than 1 percent. The Company is currently planning for a low single-digit increase in its 2018 comparable sales and year-over-year stability in EPS generated by its core business, excluding the benefit from recently-enacted federal tax reform. For more background on holiday performance, please visit: https://corporate.target.com/article/2018/01/brian-cornell-holiday-2017-update\nTarget Corporation (NYSE: TGT) today announced that its comparable sales in the combined November/December period grew 3.4 percent, compared with the expected range of 0 to 2 percent. Comparable sales across all of the Company's core merchandise categories – Home, Apparel, Food & Beverage, Hardlines and Essentials – were positive and accelerated from the third quarter, reflecting strong traffic growth, positive store comps and continued strength in digital sales. Target now expects 2017 will be the fourth consecutive year in which its digital sales grow more than 25 percent.\n\"We are very pleased with our holiday season performance, which reflects the progress we've made against our strategy throughout the year,\" said Brian Cornell, chairman and chief executive officer of Target Corporation. \"We've positioned our stores at the center of a continually expanding suite of convenient fulfillment options and made significant investments in our team, which enabled our stores to fulfill 70 percent of all digital orders in the November/December period. As we look ahead to 2018, we will build on the foundation we established this year by launching additional exclusive brands, enhancing our digital capabilities, opening approximately 30 small-format stores and tripling the size of our remodel program to more than 325 stores. We will also remain focused on rapidly scaling up new fulfillment options including Same Day Delivery, which will be enabled by our acquisition of Shipt, and our recently launched Drive Up service.\"\nUpdated Fourth Quarter and Full-Year 2017 Guidance\nTarget now expects fourth quarter comparable sales growth in a range around 3.4 percent, consistent with results in the November/December period. This would translate into full-year 2017 comparable sales growth of just over 1 percent. Sales from new and non-mature stores are expected to contribute approximately 70 basis points to Target's fourth quarter sales growth. Combined with the impact of a 53 rd week in the 2017 fiscal year, Target's total sales are expected to grow more than 9 percent in the fourth quarter.\nFor fourth quarter 2017, the Company expects Adjusted EPS 1 of $1.30 to $1.40, compared to the prior range of $1.05 to $1.25. This expectation reflects a 6 to 8 cent benefit from a lower structural tax rate in January resulting from recently-enacted federal tax reform legislation. Fourth quarter GAAP EPS from continuing operations is expected to be higher than Adjusted EPS, reflecting an expected benefit driven primarily by a one-time change in Target's net deferred tax liabilities resulting from federal tax reform legislation. The impact of federal tax reform on the Company's net deferred tax liabilities remains under review and cannot be determined at this time. The Company expects to quantify this benefit in its fourth quarter earnings release on March 6. For full-year 2017, the Company now expects Adjusted EPS of $4.64 to $4.74, compared with prior guidance of $4.40 to $4.60. Full-year GAAP EPS from continuing operations is expected to be higher than Adjusted EPS, reflecting the previously-noted tax-reform benefit primarily related to Target's net deferred tax liabilities. In addition, full-year GAAP EPS from continuing operations will include the following two items recognized in prior quarters: (1) a 14-cent loss from the net impact of debt retirement costs; and (2) an 11-cent tax benefit related primarily to the Company's global sourcing operations.\nInitial Full-Year 2018 Guidance\nWhile Target continues to develop detailed financial plans for 2018, the Company is currently planning for a low single-digit increase in its 2018 comparable sales and year-over-year stability in EPS generated by its core business, excluding the benefit of federal tax reform. While the Company has not updated its expectations for 2018 capital expenditures, the benefit of recently-enacted federal tax reform legislation will create additional cash flow that Target will deploy in support of its longstanding capital deployment priorities, including capital investments, dividends and additional share repurchase.\nCombining expectations for stable core-business profitability with the benefit of federal tax reform, Target expects 2018 GAAP EPS from continuing operations and Adjusted EPS of $5.15 to $5.45.\nFourth quarter, full-year 2017 and full-year 2018 GAAP EPS from continuing operations may include the impact of additional discrete items which will be excluded in calculating Adjusted EPS. The Company is not currently aware of any such discrete items. All earnings per share figures refer to diluted EPS.\nMiscellaneous\nStatements in this release regarding fourth quarter and full-year 2017 and 2018 earnings per share and comparable sales guidance are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements are subject to risks and uncertainties which could cause the Company's actual results to differ materially. The most important risks and uncertainties are described in Item 1A of the Company's Form 10-K for the fiscal year ended Jan. 28, 2017. Forward-looking statements speak only as of the date they are made, and the Company does not undertake any obligation to update any forward-looking statement.\nAbout Target\nMinneapolis-based Target Corporation (NYSE: TGT) serves guests at 1,834 stores and at Target.com . Since 1946, Target has given 5 percent of its profit to communities, which today equals millions of dollars a week. For more information, visit Target.com/Pressroom . For a behind-the-scenes look at Target, visit Target.com/abullseyeview or follow @TargetNews on Twitter.\n1 Adjusted EPS, a non-GAAP financial measure, excludes the impact of certain discretely managed items.\nView original content with multimedia: http://www.prnewswire.com/news-releases/target-raises-q4-guidance-on-stronger-than-expected-holiday-sales-300579797.html\nSOURCE Target Corporation", "external_links": ["http://pressroom.target.com/pr/news/news.aspx", "http://www.prnewswire.com/news-releases/target-raises-q4-guidance-on-stronger-than-expected-holiday-sales-300579797.html", "https://corporate.target.com/article/2018/01/brian-cornell-holiday-2017-update", "https://twitter.com/targetnews", "http://www.target.com/abullseyeview"], "published": "2018-01-09T14:59:00.000+02:00", "crawled": "2018-01-09T15:43:22.047+02:00", "highlightTitle": ""}