{"organizations": [], "uuid": "3a4f996711305bffa66260de9b66eb0168a4b424", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226500039&w=1200&r=LYNXMPEE0T083", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-hna-group-creditors/chinas-hna-group-tells-creditors-it-may-face-at-least-2-4-billion-liquidity-shortage-in-first-quarter-bloomberg-idUSKBN1FJ0I8", "country": "US", "domain_rank": 408, "title": "China's HNA Group tells creditors it may face at least $2.4 bln liquidty shortage in Q1 -Bloomberg", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T07:26:00.000+02:00", "replies_count": 0, "uuid": "3a4f996711305bffa66260de9b66eb0168a4b424"}, "author": "", "url": "https://www.reuters.com/article/us-hna-group-creditors/chinas-hna-group-tells-creditors-it-may-face-at-least-2-4-billion-liquidity-shortage-in-first-quarter-bloomberg-idUSKBN1FJ0I8", "ord_in_thread": 0, "title": "China's HNA Group tells creditors it may face at least $2.4 bln liquidty shortage in Q1 -Bloomberg", "locations": [], "entities": {"persons": [{"name": "matthew miller", "sentiment": "none"}, {"name": "shri navaratnam", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing monitoring desk", "sentiment": "none"}, {"name": "hainan", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "hna group", "sentiment": "negative"}, {"name": "bloomberg reuters", "sentiment": "none"}, {"name": "hna", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHANGHAI/BEIJING (Reuters) - China’s HNA Group has told creditors it faces a potential cash shortfall of at least 15 billion yuan ($2.4 billion) in the first quarter, even as the company moves to sell more assets and reduce its leverage. HNA representatives made the statement to major creditor banks at a meeting called by the provincial government last week in Haikou, one person with knowledge of the meeting said.It is the first time HNA has quantified the repayment problems it currently faces.\nHNA chairman Chen Feng acknowledged the liquidity issue at a meeting with Reuters earlier this month, but expressed confidence the firm could manage its cash crunch and would continue to receive support from its lenders.\nIn recent weeks, the aviation-to-financial services conglomerate has announced asset sales, called off deals, and secured fresh bank credit lines to address a cash crunch that followed $50 billion in acquisitions over a two-year period.\nLast week, HNA said it had reached a deal to sell a building in Sydney for A$205 million to Blackstone Group ( BX.N ), earning A$88 million from the sale.\nThe company earlier in the month announced it had hired JP Morgan and Benedetto, Gartland and Company to look for buyers for its 29.5 percent stake in Spain’s NH Hotel Group ( NHH.MC ). The stake is valued at about 632 million euros at current prices.\nHNA is also planning to float airport ground services operator Swissport, and has scrapped plans to buy Value Partners Group ( 0806.HK ), the Hong Kong-listed asset manager, and create a real estate investment trust in Singapore.\nHNA’s Haikou meeting with creditors was reported earlier by Bloomberg News, which said the group faced first-quarter debt repayments of about 65 billion yuan.\nHNA expects its funding pressures to ease in the second quarter, Bloomberg said.\nCASH PROBLEM HNA’s liquidity squeeze came to light as local banks privately and publicly voiced concern after the group failed to repay some obligations, including aircraft lease payments, and as surging debt drove up the cost of the group’s short-term fund raising to new highs.\nLast week, one HNA unit told the Shanghai Stock Exchange that some of its accounts at a local Ningbo lender had been temporarily frozen, before the suspension was lifted.\nSignificant changes are expected. Seven of HNA’s listed units in China and Hong Kong have suspended trading in shares, ahead of an anticipated restructuring among group companies.\nHNA declined to comment about the Haikou meeting. Privately, HNA executives have bristled at the group’s portrayal by domestic and foreign media, arguing the group’s cash flow remained healthy and the current liquidity squeeze was only temporary.\nIn December, HNA said it received pledges of support for 2018 from eight big domestic policy and commercial banks, including China Development Bank, The Export and Import Bank of China, and the Industrial and Commercial Bank of China ( 601398.SS ) ( 1398.HK ).\nThe company also said it still had 310 billion yuan in unused credit facilities from financial institutions.\nThe liquidity problem exists “because we made a big number of mergers”, even as the external environment became more challenging and China’s economy “transitioned from rapid to moderate growth”, impacting the group’s access to new financing, Chen told Reuters.\n“Rate hikes by the Federal Reserve and deleveraging in China caused a liquidity shortage at the end of the year for many Chinese enterprises,” Chen said. “We’re confident we’ll move past these difficulties and maintain sustained, healthy and stable development.”\nHNA’s group borrowing, including bank loans and bonds, surged by more than one-third over the first 11 months of last year to 637.5 billion yuan, according to a China bond market filing by HNA.\nGroup assets reached 1.2 trillion yuan at the end of June, according to a separate bond market filing.\n($1 = 6.3280 Chinese yuan renminbi)\nReporting by Mattehw Miller in Beijing and Engen Tham in Shanghai; Additioanl reporting by Adam Jourdan and Beijing Monitoring Desk; Editing by Shri Navaratnam, Muralikumar Anantharaman and Mark Potter\n ", "external_links": [], "published": "2018-01-30T07:26:00.000+02:00", "crawled": "2018-01-30T07:37:08.021+02:00", "highlightTitle": ""}