{"organizations": [], "uuid": "1556d3210ef918ae31284fe85d38948bc9c2ead5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221083315&w=1200&r=LYNXMPEE0A0KF", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-draw/federer-to-open-australia-open-against-bedene-idUKKBN1F00Z3", "country": "US", "domain_rank": 408, "title": "Federer to open Australia Open against Bedene", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T11:23:00.000+02:00", "replies_count": 0, "uuid": "1556d3210ef918ae31284fe85d38948bc9c2ead5"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-draw/federer-to-open-australia-open-against-bedene-idUKKBN1F00Z3", "ord_in_thread": 0, "title": "Federer to open Australia Open against Bedene", "locations": [], "entities": {"persons": [{"name": "bedene reu", "sentiment": "negative"}, {"name": "federer", "sentiment": "negative"}, {"name": "aljaz bedene", "sentiment": "none"}, {"name": "victor estrella burgos", "sentiment": "none"}, {"name": "serena williams", "sentiment": "none"}, {"name": "maria sharapova", "sentiment": "none"}, {"name": "mihaela buzarnescu", "sentiment": "none"}, {"name": "grigor dimitrov", "sentiment": "none"}, {"name": "rafa nadal", "sentiment": "none"}, {"name": "caroline wozniacki", "sentiment": "none"}, {"name": "simona halep", "sentiment": "none"}, {"name": "tatjana maria", "sentiment": "none"}, {"name": "roger federer", "sentiment": "none"}], "locations": [{"name": "romania", "sentiment": "none"}, {"name": "melbourne park", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "min read  melbourne", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 9:29 AM / Updated 9 hours ago Federer to open Australia Open against Bedene Reuters Staff 3 Min Read \nMELBOURNE (Reuters) - Roger Federer will open his Australian Open title defence against Slovenian Aljaz Bedene next week, while top seed Rafa Nadal, the losing finalist last year, was paired with Dominican Victor Estrella Burgos at the draw on Thursday. Tennis - Australian Open - Melbourne Park, Melbourne, Australia, January 11, 2018. Switzerland's Roger Federer holds the Men's singles trophy as he participates in the official draw ceremony ahead of the Australian Open tennis tournament. REUTERS/David Gray \nWomen’s top seed Simona Halep of Romania faces Australian wildcard Destanee Aiava in the first round, with second seed Caroline Wozniacki starting out against Halep’s compatriot Mihaela Buzarnescu. \nSerena Williams will not defend the women’s title having had her first child last year but 2008 champion Maria Sharapova, who failed a drugs test at the tournament in 2016, is back unseeded after a ban and will face Germany’s Tatjana Maria. \nWilliams’s sister Venus, who lost to her sibling in the final last year, is seeded fourth and the 37-year-old was handed a tricky first encounter against Swiss former world number seven Belinda Bencic, who is 17 years her junior. \nMen’s third seed Grigor Dimitrov will face a qualifier, with Alexander Zverev, ranked fourth, playing Italian Thomas Fabbiano but with 2014 champion Stan Wawrinka, returning after surgery, in his section of the draw. \nYoung gun Zverev had little luck in his first Australian Open draw as a top five seed with either Wawrinka, who plays Ricardas Berankis, or Novak Djokovic potentially standing in his path in the quarter-finals. \nSix-times Melbourne Park champion Djokovic, seeded 14th after missing the back end of last season with an elbow injury, will take on American lefthander Donald Young in his first match with mercurial Frenchman Gael Monfils looming in round two. \nFederer also has Milos Raonic, Juan Martin del Potro, David Goffin and Tomas Berdych in his quarter of the draw, while Nadal would appear to have the easier section, although former U.S. Open champion Marin Cilic looms as a last-eight opponent. \nIf the draw goes to seeding, Dimitrov would face American Jack Sock in the last eight, with ailing world number five Dominic Thiem, who withdrew from Kooyong because of illness on Thursday, taking on Zverev. \nBritain’s Andy Murray and Japan’s Kei Nishikori have already withdrawn from the championships and women’s world number three Garbine Muguruza has twice pulled out of tournaments over the last two weeks due to leg cramps and a thigh problem. \nThe Wimbledon champion is scheduled take on France’s Jessika Ponchet in the first round, while French Open champion Jelena Ostapenko was paired with veteran Francesca Schiavone and U.S Open champion Sloane Stephens will take on China’s Zhang Shuai. \nAustralia’s sole men’s seed, Nick Kyrgios, takes on Brazilian Rogerio Dutra Silva and local women’s 18th seed Ashleigh Barty takes on Belarusian Aryna Sabalenka. Reporting by Nick Mulvenney in Sydney; Editing by John O'Brien", "external_links": [], "published": "2018-01-11T11:23:00.000+02:00", "crawled": "2018-01-11T11:41:12.042+02:00", "highlightTitle": ""}