{"organizations": [], "uuid": "db47732ac5c359f2cf20ef39fc39aa56f1e25f17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-peru-food-climatechange/perus-alpine-herders-revive-ancient-technologies-to-face-the-future-idUSKBN1EX1LT", "country": "US", "domain_rank": 408, "title": "Peru's alpine herders revive ancient technologies to face the future", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.331, "site_type": "news", "published": "2018-01-08T23:18:00.000+02:00", "replies_count": 0, "uuid": "db47732ac5c359f2cf20ef39fc39aa56f1e25f17"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-peru-food-climatechange/perus-alpine-herders-revive-ancient-technologies-to-face-the-future-idUSKBN1EX1LT", "ord_in_thread": 0, "title": "Peru's alpine herders revive ancient technologies to face the future", "locations": [], "entities": {"persons": [{"name": "florencia zapata", "sentiment": "none"}], "locations": [{"name": "rome", "sentiment": "none"}, {"name": "peru", "sentiment": "none"}, {"name": "andes", "sentiment": "none"}, {"name": "canchayllo", "sentiment": "none"}, {"name": "miraflores", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "tmi", "sentiment": "none"}, {"name": "mountain institute", "sentiment": "none"}, {"name": "yauyos cochas landscape reserve", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROME (Thomson Reuters Foundation) - With their alpine grasslands shrinking due to erratic rainfall and glacier retreat, herders in Peru’s central Andes have decided that the future lies in reviving the past.\nTo improve access to water and save their livestock, indigenous communities in the villages of Canchayllo and Miraflores have restored abandoned dams, reservoirs and canals that date back over 3,000 years.\nTwo years on from completion of the project - supported by The Mountain Institute (TMI), a U.S.-based non-profit - there are more and better quality pastures for sheep, cattle and alpaca to graze, and milk, meat, and crop yields have risen.\nThe project’s success, benefiting 9,600 people in the Nor Yauyos Cochas Landscape Reserve, has raised hopes for thousands of highland communities in Peru and elsewhere who are facing similar climate pressures, said Florencia Zapata of TMI, which works with mountain communities.\nIt could also have far-reaching impacts along the desert coast, home to almost 70 percent of the population, which receives less than 2 percent of Peru’s available water.\n“Water that most of the population depends on comes mainly from the mountains. So, we need to take care of (that water),” Zapata, who oversaw the project, told the Thomson Reuters Foundation in a phone interview.\nThe western ranges of the “brown” Andes - with a marked dry season - are dotted with remains of ancient infrastructures dedicated to managing water, said Jorge Recharte, director of TMI’s Andes program.\nThe ranges extend to Bolivia, Chile and Argentina and while some water structures are still in use, knowledge and understanding of them had started to vanish as populations dwindled due to migration to the cities, Recharte said.\nPeru’s glaciers are a source of fresh water for millions of people but they have diminished by 40 percent since the 1970s, government figures showed.\nThe South American country is home to 70 percent of the world’s tropical glaciers, which are “especially sensitive to warming temperatures”, the United Nations warned.\nFears over the melting of an Andean glacier has even led to an intercontinental lawsuit that environmentalists are watching closely.\n“As glacier retreat progresses and climate change kicks in... new lands are becoming available for agriculture in the Andes,” said Alexander Herrera, an archaeologist and associate professor at Colombia’s Universidad de los Andes.\n“Learning from the past is absolutely crucial for sustainable, low-risk, productive agriculture (of the kind) the Andes have had for thousands of years,” said Herrera, who was involved in the Canchayllo and Miraflores projects.\nGREY AND GREEN Peru has a long history of embarking on engineering feats to manage the flow of water for agriculture.\nThe Incas and the civilizations before them built terraces, cisterns and canals while modern government projects include the $500-million Olmos and the stalled Chavimochic III irrigation projects.\nIt was at one of the first meetings TMI organized in 2013 that locals raised the possibility of rehabilitating the neglected pre-Inca hydraulic structures.\nDesigned to slow the movement of water through grasses and soils, they replenished aquifers and springs and helped the grasslands retain more water, allowing biodiversity to flourish.\nThis way, the ecosystem acted as a buffer against flooding and drought and provided fodder for their animals, who in turn produce cheese and importantly manure, used to cultivate “thousands of native potato, corn, tuber and grain varieties”, Zapata said.\nThe restoration and adaptation of ancient terraces and canals for modern use has been pioneered by British archaeologist Ann Kendall since the late 1970s.\nBut other attempts by Andean governments and aid groups in the 1980s to revive these technologies for development failed because the focus was more on techniques and less on the needs of the locals, said archaeologist Herrera.\nIn Canchayllo and Miraflores, the restoration has combined ancient and modern technologies to meet the demands of herders, after months of consultation.\nThe restored systems incorporate “grey” infrastructure such as PVC pipes, water valves and fences and “green” elements such as restoration of grasslands and wetlands.\nThe restoration minimized the need for regular maintenance work since labor is in short supply, with the young and able moving to cities for better jobs.\n“It is not enough to just improve their infrastructure or water availability. If people are not organized to manage the infrastructure, it will collapse sooner or later,” Zapata said.\nNOT ANOTHER BURDEN Julio Postigo, a Peruvian expert on pastoralism in high altitudes, said poor, marginalized communities needed support from government to revive the ancient structures - just as families were supported centuries ago.\n“We tend to forget, when we romanticizes these Inca or pre-Inca or ancient responses, that they were never taken by individual families,” said Postigo, a senior research scientist at the University of Chicago’s National Opinion Research Center.\n“You’re talking about an empire that decided that that infrastructure was going to be built.”\nTMI said it was looking to train and work with the Peruvian government and other organizations to replicate the success of projects in central Peru.\nBut reviving ancient water systems must be part of a wider plan to help communities cope with climate change, said Postigo.\n“The people most vulnerable to climate change effects are those who are poorer, less educated, more marginal, indigenous,” he said in a phone interview.\n“We should fight poverty and improve living conditions. In doing so, those populations will be on a better foot to respond to climate change.”\nReporting By Thin Lei Win, Editing by Ros Russell; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, corruption and climate change. Visit www.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T23:18:00.000+02:00", "crawled": "2018-01-09T17:13:09.036+02:00", "highlightTitle": ""}