{"organizations": [], "uuid": "09b1c14a5491ad54c9902559d505336b6a591a00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/business-wire-metlife-declares-first-quarter-2018-common-stock-dividend.html", "country": "US", "domain_rank": 767, "title": "MetLife Declares First Quarter 2018 Common Stock Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T00:15:00.000+02:00", "replies_count": 0, "uuid": "09b1c14a5491ad54c9902559d505336b6a591a00"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/business-wire-metlife-declares-first-quarter-2018-common-stock-dividend.html", "ord_in_thread": 0, "title": "MetLife Declares First Quarter 2018 Common Stock Dividend", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}], "organizations": [{"name": "metlife", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "metlife, inc.", "sentiment": "neutral"}, {"name": "metlife metlife, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- MetLife, Inc. (NYSE:MET) today announced that its board of directors has declared a first quarter 2018 common stock dividend of $0.40 per share. The dividend will be payable on March 13, 2018, to shareholders of record as of Feb. 5, 2018.\nAbout MetLife\nMetLife, Inc. (NYSE: MET), through its subsidiaries and affiliates (“MetLife”), is one of the world’s leading financial services companies, providing insurance, annuities, employee benefits and asset management to help its individual and institutional customers navigate their changing world. Founded in 1868, MetLife has operations in more than 40 countries and holds leading market positions in the United States, Japan, Latin America, Asia, Europe and the Middle East. For more information, visit www.metlife.com .\nForward-Looking Statements\nThis news release may contain or incorporate by reference information that includes or is based upon forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements give expectations or forecasts of future events. These statements can be identified by the fact that they do not relate strictly to historical or current facts. They use words such as “anticipate,” “estimate,” “expect,” “project,” “intend,” “plan,” “believe,” “will,” “continuing,” “potential,” and other words and terms of similar meaning, or are tied to future periods, in connection with a discussion of future operating or financial performance. In particular, these include statements relating to future actions, prospective services or products, future performance or results of current and anticipated services or products, sales efforts, expenses, the outcome of contingencies such as legal proceedings, trends in operations and financial results.\nAny or all forward-looking statements may turn out to be wrong. They can be affected by inaccurate assumptions or by known or unknown risks and uncertainties. Many such factors will be important in determining the actual future results of MetLife, Inc., its subsidiaries and affiliates. These statements are based on current expectations and the current economic environment. They involve a number of risks and uncertainties that are difficult to predict. These statements are not guarantees of future performance. Actual results could differ materially from those expressed or implied in the forward-looking statements. Risks, uncertainties, and other factors that might cause such differences include the risks, uncertainties and other factors identified in MetLife, Inc.’s most recent Annual Report on Form 10-K (the “Annual Report”) filed with the U.S. Securities and Exchange Commission (the “SEC”), any Quarterly Reports on Form 10-Q filed by MetLife, Inc. with the SEC after the date of the Annual Report under the captions “Note Regarding Forward-Looking Statements” and “Risk Factors,” and other filings MetLife, Inc. makes with the SEC. MetLife, Inc. does not undertake any obligation to publicly correct or update any forward-looking statement if MetLife, Inc. later become aware that such statement is not likely to be achieved. Please consult any further disclosures MetLife, Inc. makes on related subjects in reports to the SEC.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180105005716/en/\nMetLife\nFor Media:\nAshia Razzaq, 212-578-1538\nor\nFor Investors:\nJohn Hall, 212-578-7888\nSource: MetLife, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180105005716/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.metlife.com&esheet=51738827&newsitemid=20180105005716&lan=en-US&anchor=www.metlife.com&index=1&md5=ef52dc099a8523f33ae2026a17a0cec4"], "published": "2018-01-06T00:15:00.000+02:00", "crawled": "2018-01-06T01:04:38.012+02:00", "highlightTitle": ""}