{"organizations": [], "uuid": "6996820a144fc4c822bfe49a193d37ad15234944", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/29/104741303-IMG_8456r-jim-cramer.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/05/cramer-remix-common-sense-can-make-you-money-in-this-market.html", "country": "US", "domain_rank": 767, "title": "Cramer Remix: Common sense can make you money in this market", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.157, "site_type": "news", "published": "2018-01-06T01:59:00.000+02:00", "replies_count": 0, "uuid": "6996820a144fc4c822bfe49a193d37ad15234944"}, "author": "Elizabeth Gurdus", "url": "https://www.cnbc.com/2018/01/05/cramer-remix-common-sense-can-make-you-money-in-this-market.html", "ord_in_thread": 0, "title": "Cramer Remix: Common sense can make you money in this market", "locations": [], "entities": {"persons": [{"name": "jim cramer cramer", "sentiment": "negative"}, {"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "none"}], "locations": [{"name": "canada goose", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "It used to be common sense that investors couldn't simply realize that it's cold outside, buy shares in a \"cold weather play\" like Canada Goose and make money, CNBC's Jim Cramer said on Friday.\nBut in this market, Cramer has watched common-sense investing come back into the fold as a winning strategy.\n\"Now, I'm not saying that stock-picking's back and index funds and ETFs are dead. No, those days are never coming back,\" the \"Mad Money\" host said. \"But I am saying that it's possible to pick a group of stocks that are better than average by just keeping your eyes open.\"\nFor example, investors who bought shares in oil service company Schlumberger after President Donald Trump announced he would open the country's off-shore sites for oil exploration made money. Investors who bought McDonald's after the company announced a new dollar menu made money.\n\"For almost two decades, picking stocks with no rigor almost always cost you money. I don't know how long the obvious will keep being profitable,\" Cramer admitted. \"But at least for the moment, simple common sense is actually making people money in this market and that's pretty darned wonderful, if you ask me. But enjoy it while it lasts.\"\nCramer's game plan: Feeding the beast Andrew Harrer | Bloomberg | Getty Images Jamie Dimon, chief executive officer of JPMorgan Chase, attends a Strategic and Policy Forum meeting with U.S. President Donald Trump, not pictured, in the State Dining room of the White House in Washington, D.C. last February. The stock market's bullish reaction to Friday's placid jobs report from the U.S. Labor Department gave Cramer pause as he looked ahead to next week.\n\"Once again, this market is downright shocking,\" he said. \"The bank stocks had been rallying for days because the economy's red-hot, hot enough that the Fed might have to raise rates repeatedly.\"\nCramer has long dubbed the financials as the market's most important leadership sector. But after the labor report showed a distinct decline in retail jobs — which Cramer attributed to the rise of e-commerce — industrial and transport stocks caught fire.\nCramer said that the industrials likely rose because buyers hoped the Fed would be cautious with its rate hike agenda, and the transports popped because of the online shopping boom.\n\"Throw in the big pushes from the analyst community on Amazon and Apple , two of the market's generals, and you get an electric tape full of new winners all plumped up to feed the beast ,\" Cramer said.\nWith that in mind, the \"Mad Money\" host turned to the stocks and events he'll be watching in the second week of the new year.\nS&P 500 winners Getty Images After one of the best years for the stock market that Cramer can remember, he wanted to get a better snapshot of the gains (and see what's ahead) by looking at the S&P 500 .\nOne of Wall Street's most relied-upon indexes, the S&P helps shed light on last year and, if analyzed properly, can make investors money in 2018, the \"Mad Money\" host said.\nSo Cramer went over the S&P's top performers for 2017 to see what they reveal about this year's layout, starting with the best of the best.\nS&P 500 losers Sebastien Bozon | AFP | Getty Images An employee of General Electric works on a gas turbine at the GE plant in Belfort, France. Cramer knows that looking back on a strong year for the markets shouldn't only include analyzing the best performers.\nThat's why the \"Mad Money\" host paired his analysis of the S&P 500's cream of the crop with a look at the index's worst-performing stocks , many of which could still recover in 2018.\n\"In a bull market, it's not that easy to be a real cellar dweller,\" Cramer said. \"You have to commit some pretty grievous sins to end up on this list. But remember, this is an incredibly forgiving market, so it's important not to get too judgmental lest we miss some real opportunities.\"\nConstellation Brands CEO on cannabis boom The rise of the cannabis industry has taken world markets by storm, so much so that Constellation Brands CEO Rob Sands felt his company should prepare to take part in the trend.\n\"In the U.S., [marijuana is] not legal at the current time, but obviously numerous states are legalizing it for recreational purposes. Canada is going to legalize it for recreational purposes at the beginning of this coming summer,\" Sands told Cramer on Friday . \"It's clear-cut that it's going to be a big market, and we think that it only makes sense to position ourselves to participate in that in the beverage end of the business.\"\nSands, who runs a massive alcohol distributor that owns ubiquitous brands like Corona, Modelo and Svedka, said his company wouldn't be able to participate in the U.S. market until cannabis becomes legal on a federal level.\nBut the CEO had some interesting prospects in his company's liquor segment that he hoped would continue to drive gains in the meantime, he told Cramer.\n\"Premium rum is a category that we think is ready to take off,\" Sands said. \"We thought that this was a good opportunity to participate in that category with a great brand called The Real McCoy. And I'd say the same thing for high-end brandy.\"\nWyndham Worldwide: Breaking up for the better? Cramer loves a good breakup, and the latest one he focused on was Wyndham Worldwide's plan to spin off its hotel business to become a pure play on timeshares and vacation rentals.\nThe \"Mad Money\" host likened the breakup to Marriott's move in 2011, when the company spun off its vacation rentals division. Both halves of that split are up big, making Cramer wonder whether Wyndham could see similar results.\n\"If you don't already own Wyndham Worldwide, you might want to wait for the breakup so that you can add to your position if we get a much-needed post-spin-off pullback in the timeshare division,\" Cramer said.\n\"Here's the bottom line: Wyndham Worldwide has been on fire, but with the spin-off of its hotel biz coming up next quarter, I think it's got more room to charge,\" he continued. \"If Wyndham follows in the footsteps of the Marriott breakup, even a little bit, then Chapter 2: The Breakup could be just as good as Chapter 1: The Marriage.\"\nLightning Round: Outlook on oils In Cramer's lightning round , he zipped through his take on some callers' favorite stocks:\nKinder Morgan : \"What can I say? It's going to do well just because we're out of pipe. It's not my favorite. I like Magellan Midstream Partners , MMP, which somebody initiated with a sell today. That person ought to come see me.\"\nRoyal Dutch Shell : \"Royal Dutch Shell is not my favorite, but you know what? It's not bad. I mean, I know that sounds like damning or faint praise, but I've just been so impressed with the big-caps [like] Chevron .\"\nDisclosure: Cramer's charitable trust owns shares of Schlumberger, Apple and Magellan Midstream Partners. \n ", "external_links": [], "published": "2018-01-06T01:59:00.000+02:00", "crawled": "2018-01-06T02:00:51.050+02:00", "highlightTitle": ""}