{"organizations": [], "uuid": "7564e0eee68d737fb2128b7c1056336ef265434b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-china-rights/chinese-authorities-disbar-second-rights-lawyer-in-two-weeks-idUSKBN1FC1DQ", "country": "US", "domain_rank": 408, "title": "Chinese authorities disbar second rights lawyer in two weeks", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.998, "site_type": "news", "published": "2018-01-23T19:38:00.000+02:00", "replies_count": 0, "uuid": "7564e0eee68d737fb2128b7c1056336ef265434b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-china-rights/chinese-authorities-disbar-second-rights-lawyer-in-two-weeks-idUSKBN1FC1DQ", "ord_in_thread": 0, "title": "Chinese authorities disbar second rights lawyer in two weeks", "locations": [], "entities": {"persons": [{"name": "xi jinping", "sentiment": "none"}, {"name": "sui muqing", "sentiment": "none"}, {"name": "sui", "sentiment": "none"}], "locations": [{"name": "guangdong", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "guangzhou", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - Authorities in China’s southern province of Guangdong have canceled the legal license of human rights lawyer Sui Muqing, he told Reuters on Tuesday, a week after another prominent rights lawyer was detained following similar punishment.\nSince coming to power in 2012, Chinese President Xi Jinping has presided over a sweeping crackdown on dissent, which has seen hundreds of rights lawyers and activists detained and dozens jailed.\n“I’ve taken on a lot of relatively high-profile human rights cases,” Sui told Reuters. “This is the settling of accounts after the autumn harvest,” he added, using a phrase that means to face the authorities after a movement has ended.\nAn active and outspoken rights lawyer based in the city of Guangzhou, Sui had regularly defended fellow lawyers and activists charged by the authorities.\nThe Guangdong justice bureau unexpectedly called him late on Monday, asking for a meeting the next day, at which officials handed him papers saying he had been disbarred for violating conduct rules for lawyers, Sui said.\nThe Guangdong justice bureau did not respond to requests for comment after office hours on Tuesday.\nYu Wensheng, another prominent rights lawyer who took on similar cases, was disbarred and then detained last week.\nIn its document notifying Sui of its decision, the bureau said he had broken China’s law for lawyers, as well as rules on the conduct of lawyers and law firms, according to a picture of the document seen by Reuters.\nAs evidence, it cited Sui’s failure to prevent a client from disrupting court order in Beijing in 2014, as well as an incident in which he took photos while meeting a client in a police station in the southwestern province of Sichuan in 2017.\nIn the Beijing case, Sui had been defending activist Ding Jiaxi, a leading figure in the “New Citizen’s Movement” that called for Chinese officials to disclose their assets as a part of gradual political change in China.\nSui denied that he had broken the rules or the law and said the 2014 case was too far in the past to reasonably be used as evidence against him.\nRights groups say that 2016 changes to measures on the conduct of lawyers and law firms, which heightened requirements for political loyalty, were designed to make it much more difficult to take on politically sensitive cases.\nReporting by Christian Shepherd; Editing by Clarence Fernandez\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T19:38:00.000+02:00", "crawled": "2018-01-23T13:52:17.013+02:00", "highlightTitle": ""}