{"organizations": [], "uuid": "fe42d1dd84ecede8c67cbddd18dc3e255ffc161d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-hashchain-technology-to-acquire-established-blockchain-technology-company-node40.html", "country": "US", "domain_rank": 767, "title": "HashChain Technology to Acquire Established Blockchain Technology Company NODE40", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-30T16:15:00.000+02:00", "replies_count": 0, "uuid": "fe42d1dd84ecede8c67cbddd18dc3e255ffc161d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-hashchain-technology-to-acquire-established-blockchain-technology-company-node40.html", "ord_in_thread": 0, "title": "HashChain Technology to Acquire Established Blockchain Technology Company NODE40", "locations": [], "entities": {"persons": [{"name": "hashchain", "sentiment": "none"}], "locations": [{"name": "vancouver", "sentiment": "none"}], "organizations": [{"name": "hashchain technology to acquire established blockchain technology company", "sentiment": "negative"}, {"name": "hashchain technology inc.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "node40 llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, Jan. 30, 2018 /PRNewswire/ - HashChain Technology Inc. (TSXV: KASH) (OTCQB: HSSHF) (\" HashChain\" or the \" Company \") today announced that the Company has entered into an agreement to acquire blockchain technology company, NODE40 LLC, (the \" NODE40 Business \" or NODE40 ) which includes a team of experienced blockchain experts and software engineers. This acquisition marks HashChain's initial move to diversify its crypto-currency mining strategy with blockchain based solutions.\nTerms of the Agreement\nUnder the asset purchase agreement for the acquisition of the Node40 Business (the \"APA\"), HashChain will acquire the NODE40 Business for a purchase price comprised of US$8,000,000 in cash, payable as to US$4,000,000 at closing (subject to a closing adjustment provision), and US$2,000,000 on each of 180 days and one year following the closing date, and a total of 3,144,134 common shares in the capital of HashChain (\"Shares\"), to be issued in the following amounts and on the following dates (each, an \"Issue Date\"): (i) 1,800,000 Shares on the closing date, (ii) 700,247 Shares on the date that is 180 days following the closing date; and (iii) 643,887 Shares on the one-year anniversary of the closing date, subject to NODE40s option to receive cash in lieu of up to 30% of the shares issuable pursuant to (ii) and (iii) above to a maximum of $600,000 USD for (ii) and $600,000 USD for (iii) above.\nThe acquisition of the NODE40 Business is subject to customary closing conditions, including the approval of the TSX Venture Exchange.\nNODE40's business comprises two major segments including 1) Cryptocurrency accounting solution for cryptocurrency trading, and 2) Masternode hosting.\nCryptocurrency Accounting Solution\nNODE40 Balance is a robust cryptocurrency reporting software that integrates directly with certain major cryptocurrency exchanges. Members of the blockchain community transacting in, trading, or mining digital currency, have likely triggered a taxable event and can be unaware of how to properly disclose these transactions to the government. With a cryptocurrency market size of $537 billion, (more than JP Morgan's value as reported by CNBC), government intervention into the cryptocurrency market is certain as is the need for more defined accounting solutions. To address a strict regulatory environment, NODE40 uses a coin-holder's transaction history and analyzes the blockchain to determine accurate valuations for every input and output comprising a transaction. Once a value has been assigned to every transaction, the service can report the current total asset value, income, and any realized gains or losses. It is expected that a greater number of countries will join those that have already imposed a higher degree of regulation like Australia, Israel, South Africa and others. NODE40 Balance is strategically positioned to work directly with tax authorities globally to adapt to their specific requirements.\nCoinbase, one of the leading exchanges for cryptocurrencies with billions of dollars exchanged on its platform, recently received a court order from the Internal Revenue Service (\"IRS\"), to hand over information on all customers who made a transaction worth $20,000 or more between 2013 and 2015, which is estimated to total 8.9 million transactions impacting more than 14,000 different account holders, according to Forbes.com .\n\"Cryptocurrency mining remains an important focus for HashChain, as we continue to acquire more Rigs and generate revenue on a large scale. The acquisition of the NODE40 Business is an important next step of creating a global blockchain technology company,\" said Patrick Gray, CEO and Founder of HashChain. \"Cryptocurrency accounting and reporting for tax purposes is a major concern in the industry at the moment. The recent Coinbase subpoena from the IRS highlights the significant need for the software developed by NODE40.\"\nMasternode Hosting Services\nNODE40 also provides Dash masternode hosting services. The company frees cryptocurrency investors from the technical hurdles and time investment needed to run Dash masternodes. Masternodes are full blockchain nodes that run the Dash blockchain and provide services to the network, such as locking transactions with InstantSend and voting on budget funding. Masternodes require a 1,000 Dash collateral, and an ability to run 24 hours a day without exceeding a one hour connection loss. Masternodes get paid 45% of the monthly block reward as incentive for providing services to the network. As part of the acquisition of the NODE40 business, NODE40 will pay to HashChain certain masternode rewards earned over the 26 months following the closing.\nAdditions to the HashChain Team\nPerry Woodin, co-founder of NODE40 and current HashChain advisor, is now the Company's new Chief Strategy Officer (CSO). Woodin will be instrumental in making decisions on the direction of HashChain as the company continues to scale their mining operations and invest in other important businesses related to blockchain technology. Woodin has extensive knowledge of Dash and other forms of cryptocurrency, and is considered an authority in the field of cryptocurrency accounting. He is one of two advisory members to Dash, the twelfth largest cryptocurrency ranked according to market capitalization, and an active participant in the cryptocurrency community.\n\"The acquisition of NODE40 by HashChain means we can rapidly grow our Blockchain service offerings,\" said Perry Woodin. \"We will be able to accelerate the integration of additional incentivized Blockchain applications into our hosting service. We expect to expand the NODE40 Balance accounting service to support additional transparent blockchains and integrate with many more exchanges.\"\nJoining Woodin from NODE40 is Sean Ryan, co-founder and Chief Technology Officer (CTO) of NODE40. Ryan is now the CTO of HashChain, bringing his expertise as an industry leader in the development of blockchain infrastructure services and cryptocurrency accounting. Under Ryan's technical guidance, HashChain will scale its service offerings to meet the demand of this growing industry.\n\"HashChain's acquisition of NODE40 brings together two complimentary organizations in the blockchain industry,\" said Sean Ryan. \"I am excited about leading the technical discussions required to support the rapid growth and acceleration of our infrastructure services and our increasingly important blockchain accounting service.\"\nAbout HashChain Technology Inc.\nHashChain is a blockchain technology company, and the first publicly traded (TSXV:KASH) (OTCQB: HSSHF) Canadian cryptocurrency mining company to file a final prospectus supporting highly scalable and flexible mining operations across all major cryptocurrencies. HashChain taps low-cost North American power, cool climate and high-speed Internet: the trifecta most critical to mining success, to create a competitive position for maximizing the number of mining 'wins.' HashChain currently operates 100 Dash mining Rigs, has purchased 770 Bitcoin Rigs and has entered into a purchase order for an additional 5,000 Rigs. Once all Rigs are operational HashChain will be consuming approximately 8.7 megawatts of power. HashChain also acquired a Dash Masternode for approximately USD $280,000 which requires a collateral investment of 1,000 Dash coins. NODE40 is an established blockchain technology company which comprises of two major segments including 1) Cryptocurrency accounting solution for cryptocurrency trading, 2) Masternode hosting services. HashChain is based in Vancouver, British Columbia. HashChain Mining is a wholly owned subsidiary of HashChain Technology Inc. based out of Albany, New York.\nOn Behalf of the Board,\nPatrick Gray\nCEO & Director\nFor Further information please contact:\nHashChain Technology Inc.\nLarry Heinzlmeir\nVice President, Marketing & Communications\nLarry@HashChain.ca\n604-537-8676\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\nCautionary Note Regarding Forward Looking Statements: Certain disclosure in this release, including statements regarding the acquisition by the Company of the NODE40 Business and GCPA (the \"Transactions\"), including the anticipated benefits to the Company of the Transactions, the performance of 5,000 Rigs ordered by the Company, the expected timing of delivery and installation of 770 Rigs and expectations regarding future operations may constitute forward-looking statements. In making the forward-looking statements in this release, the Company has applied certain factors and assumptions that are based on the Company's current beliefs as well as assumptions made by and information currently available to the Company, including that all conditions to the closing of the Transactions will be satisfied, including receipt of all required approvals, and the Transactions will complete on the terms set out in the APA and the SPA, the acquisition of the NODE40 Business will have the benefits to the Company anticipated by management, the 5,000 Rigs will be successfully ordered and delivered, the 5,000 Rigs will perform as expected by management and the timing, installation and performance of the 770 Rigs will be consistent with management's expectations. Although the Company considers these assumptions to be reasonable based on information currently available to it, they may prove to be incorrect, and the forward-looking statements in this release are subject to numerous risks, uncertainties and other factors that may cause future results to differ materially from those expressed or implied in such forward-looking statements. Such risk factors may include, among others, the risk that the conditions to the closing of the Transactions will not be satisfied, including the risk that required approvals are not obtained, and that the Transactions will not complete on the terms set out in the APA and the SPA or at all, the risk that the Transactions, if closed, will not result in the anticipated benefits to the Company; the risk that the 5,000 Rigs will not be successfully ordered from the manufacturer or, if so ordered, that the Rigs will not be delivered to the Company when expected by management or at all, the risk that the 5,000 Rigs will not perform as expected by management and the risk that the 770 Rigs will not be delivered to the Company or that the timing of the delivery and installation or the performance of the 770 Rigs will not be as expected by management. Readers are cautioned not to place undue reliance on forward-looking statements. The Company does not intend, and expressly disclaims any intention or obligation to, update or revise any forward-looking statements whether as a result of new information, future events or otherwise, except as required by law.\nSOURCE HashChain Technology Inc.", "external_links": ["https://www.forbes.com/", "https://www.node40.com/", "http://hashchain.ca/"], "published": "2018-01-30T16:15:00.000+02:00", "crawled": "2018-01-30T17:51:22.004+02:00", "highlightTitle": ""}