{"organizations": [], "uuid": "752d2cf3a1572ae8184302056ba54b8a783ce9b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222274426&w=1200&r=LYNXMPEE0F00G", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-continental-restructuring/germanys-continental-hires-jp-morgan-for-potential-break-up-sources-idUSKBN1F500U", "country": "US", "domain_rank": 408, "title": "Germany's Continental hires JP Morgan for potential break-up: sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T02:29:00.000+02:00", "replies_count": 0, "uuid": "752d2cf3a1572ae8184302056ba54b8a783ce9b9"}, "author": "", "url": "https://www.reuters.com/article/us-continental-restructuring/germanys-continental-hires-jp-morgan-for-potential-break-up-sources-idUSKBN1F500U", "ord_in_thread": 0, "title": "Germany's Continental hires JP Morgan for potential break-up: sources", "locations": [], "entities": {"persons": [{"name": "pamela barbaglia", "sentiment": "none"}, {"name": "elmar degenhart", "sentiment": "none"}, {"name": "arno schuetze", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "continental", "sentiment": "negative"}, {"name": "jp morgan", "sentiment": "negative"}, {"name": "continental ag", "sentiment": "none"}, {"name": "min read  frankfurt/london", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKFURT/LONDON (Reuters) - Germany’s Continental AG ( CONG.DE ) has hired JP Morgan ( JPM.N ) to advise on a possible break-up, sources told Reuters, as the auto parts maker repositions for a market focused on electric and self-driving vehicles.\nThe U.S. investment bank has been mandated by the Hanover-based component and tyre maker to work on strategic options, including a separation of its current businesses, three people familiar with the discussions said.\nContinental and JP Morgan both declined to comment on the bank’s role.\n“We are drawing on external expertise but are still pretty much at the start of the process,” Continental Chief Executive Elmar Degenhart said in an interview at the Detroit auto show.\nContinental said last week that it was in talks about a possible structural overhaul, confirming media reports, and pledged to flesh out its plans within six months.\nWith the auto industry wrapped up in a strategic transition to zero-emission and autonomous cars, carmakers and suppliers are adjusting their businesses and spinning off operations to focus more effectively on new technologies.\nDaimler ( DAIGn.DE ) has said it may split into separate legal entities, which could allow for a partial listing to raise funds to invest in future mobility technologies and services.\nParts makers such as Delphi ( DLPH.N ) and Autoliv ( ALV.N ) have spun off divisions or announced plans to do so, cheered by investors who see combustion-engine cars as a sunset industry.\nContinental has said software and electronics are the biggest growth drivers for the group, which also makes fuel-injection and transmission-control systems. It plans to boost sales to more than 50 billion euros ($61 billion) by 2020.\nIn the interview, Degenhart said structural change may be needed to deliver on Continental’s goal of exceeding global auto production growth by 4-5 percentage points.\n“We can’t expect that structures that were successful and appropriate over the past 10 years will also be the right ones in 10 years from now,” he said.\nNo specific plan has yet been drawn up, a person familiar with the matter said last week. Investment banks have presented ideas including a spin-off of the tyre operations, but Chief Financial Officer Wolfgang Schaefer has ruled out a spin-off of combustion engine assets.\nContinental said a year ago it was reviewing the strategy for its Powertrain division after earnings at the business, whose products include transmission control units and fuel pumps, failed to meet expectations.\nBut it has also pledged to keep developing new products and systems for combustion-engine vehicles until at least 2025, when it expects demand for electric cars to accelerate on the back of continuing reductions in battery prices.\n($1 = 0.8151 euros)\nAdditional reporting by Andreas Cremer in Detroit; Editing by Laurence Frost and Leslie Adler\n ", "external_links": [], "published": "2018-01-16T02:29:00.000+02:00", "crawled": "2018-01-16T02:44:09.008+02:00", "highlightTitle": ""}