{"organizations": [], "uuid": "fa109febb326935ed35f6d87df0a049a4d241077", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/india-aviation-airlines/low-cost-long-haul-flights-from-india-to-boost-leisure-travel-report-idINKBN1FK07H", "country": "US", "domain_rank": 408, "title": "Low-cost, long-haul flights from India to boost leisure travel - report", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T03:39:00.000+02:00", "replies_count": 0, "uuid": "fa109febb326935ed35f6d87df0a049a4d241077"}, "author": "", "url": "https://in.reuters.com/article/india-aviation-airlines/low-cost-long-haul-flights-from-india-to-boost-leisure-travel-report-idINKBN1FK07H", "ord_in_thread": 0, "title": "Low-cost, long-haul flights from India to boost leisure travel - report", "locations": [], "entities": {"persons": [{"name": "aditi shah", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "sri lanka", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}], "organizations": [{"name": "capa", "sentiment": "none"}, {"name": "min read  mumbai", "sentiment": "none"}, {"name": "capa india", "sentiment": "none"}, {"name": "expedia inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "spicejet ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI (Reuters) - The launch of low-cost, long-haul flights by Indian airlines will boost outbound leisure travel and open a multi-billion dollar opportunity for carriers, a report released on Wednesday showed.\nThe analysis by aviation consultant CAPA India and online travel agent Expedia Inc comes as large budget airlines IndiGo and SpiceJet Ltd draw up plans to fly as far as Europe and the United States.\nThe carriers have so far focused on shorter-range destinations such as Sri Lanka and Thailand.\nOnly 0.3 percent of Indians currently travel abroad for a holiday every year, a fraction of the estimated 100 million who could potentially afford to do so, CAPA’s analysis of household income shows. Most Indians travel for education, business or to visit friends and relatives.\nTourism spending by Indians could rise to as much as $40 billion by 2027 from about $16.4 billion in 2016, CAPA said, ranking it sixth in the world ahead of Canada, South Korea and Australia.\n“If there is any market where low-cost, long-haul can work it is India,” CAPA India CEO Kapil Kaul said at an aviation conference in Mumbai on Tuesday, citing its geographic location and a large order pipeline for new long-range narrowbody jets.\nSpiceJet Chairman Ajay Singh said on Tuesday low-cost long haul flights will be introduced as early as this winter.\nIndiGo is exploring long-haul operations and seeking rights to routes, parent InterGlobe Aviation Ltd told analysts last week.\nThe low-cost flights would compete against full-service Indian carriers Air India and Jet Airways as well as global rivals such as Emirates and Lufthansa.\nBUDGET GROWTH Low-cost carriers, launched in the early 2000s, already dominate domestic air travel with a two-thirds market share.\nThe share of budget airlines in the international market rose to about 23 percent in the fiscal year 2016/17 from 14.5 percent five years earlier, CAPA estimates.\nThat is expected to rise as Indian airlines have placed orders for nearly 800 re-engined aircraft, such as Airbus A320neos and Boeing Co 737 MAX narrowbodies.\nThe jets, with longer ranges than predecessors, will enable low-cost carriers to launch non-stop routes to Asian destinations such as Phuket, Manila, Hong Kong, and Hanoi that are otherwise unviable today.\nBy 2025, Indian budget carriers will operate close to 40 wide-bodied aircraft, which could deliver an additional 2 million annual outbound leisure travellers to places such as New York and Sydney, CAPA said.\nLow-cost carriers AirAsia India and Vistara, a full-service joint venture between Singapore Airlines and India’s Tata Group, are expected to launch their first international flights later this year.\nReporting by Aditi Shah, Editing by Jamie Freed and Biju Dwarakanath\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-31T03:39:00.000+02:00", "crawled": "2018-01-31T03:48:03.006+02:00", "highlightTitle": ""}