{"organizations": [], "uuid": "a567d900dbe792833def704367f7b3b7ab0a59fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/22/104913564-WEB.00_10_47_00.Still001.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/01/one-year-on-finland-universal-basic-income-experiment.html", "country": "US", "domain_rank": 767, "title": "One year on: Finland’s universal basic income experiment", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.081, "site_type": "news", "published": "2018-01-01T12:04:00.000+02:00", "replies_count": 0, "uuid": "a567d900dbe792833def704367f7b3b7ab0a59fa"}, "author": "Elizabeth Schulze", "url": "https://www.cnbc.com/2018/01/01/one-year-on-finland-universal-basic-income-experiment.html", "ord_in_thread": 0, "title": "One year on: Finland’s universal basic income experiment", "locations": [], "entities": {"persons": [{"name": "ruusunen", "sentiment": "none"}, {"name": "benjamin hall", "sentiment": "none"}, {"name": "mika ruusunen", "sentiment": "none"}], "locations": [{"name": "finland", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published 8 Hours Ago \nA routine trip to check the mail took an unexpected turn for Mika Ruusunen in November 2016. \n\"I opened it and I didn't understand it at all, so I gave it to my wife and asked her what the heck is this,\" Ruusunen said. \nIt was the Finnish government informing Ruusunen that he would start receiving free money each month as part of a first-of-its-kind experiment. \nRuusunen was among 2,000 unemployed Finns randomly selected from across the country for a trial testing universal basic income. Each month for two years he would receive 560 euros (roughly $670) from the government, tax-free. He was free to spend the money however he liked. \n\"I'm not accustomed to that kind of bureaucratic freedom,\" Ruusunen said. Benjamin Hall | CNBC Mika Ruusunen was selected to participate in Finland's universal basic income trial. Less bureaucracy, more flexibility \nReducing bureaucracy in the welfare system is one of the main aims of the universal basic income trial in Finland. The government is testing whether basic income is a more flexible policy than existing welfare programs for providing assistance and work incentives to an evolving workforce. \n\"It is assumed that this would be a policy that could activate people through different mechanisms and, well, we want to find out if that's the case,\" said Miska Simanainen, a researcher at Kela, the government organization overseeing the trial. \nFinland's universal basic income experiment launched January 1, 2017 and will run until the end of 2018. Official results from the trial won't be released until it concludes. Experts said it's not surprising the Nordic country known for its generous welfare benefits, like universal free education, is at the forefront of a new economic experiment. \n\"We have had political discussions on basic income for many years, actually, for a couple of decades in Finland,\" Simanainen said. \nThe idea of free money has become more popular in recent years thanks to advocates in Silicon Valley like Elon Musk and Mark Zuckerberg. They see universal basic as a cushion for workers whose jobs might be replaced by automation or robots. Advocates argue free money could provide workers with flexibility to retrain for a new career, pursue creative interests, or start their own business. show chapters 1:49 AM ET Thu, 28 Dec 2017 | 04:22 \nA key goal of the Finland experiment is to give unemployed people incentive to work by providing them with financial assistance even once they're employed. Researchers chose the 560-euro monthly amount because it roughly equals the current level of unemployment benefits. \n\"One main idea behind this version of basic income that we are testing is that it would replace the basic social benefits or at least basic unemployment benefits,\" Simanainen said. A 'win-win situation' \nTrial participant Mika Ruusunen had been unemployed for 16 months before he decided to go back to school to retrain for a career in IT. He had just landed an internship at a tech company when he found out he was selected for the experiment. \nRuusunen will continue to receive the free money each month even now that the company has hired him as a full-time worker. \n\"Before I get my current job I was already thinking about starting my own enterprise, and it's nice to know that I have still that option,\" he said. \"The basic income encourages people to do work, even [a] part-time job or lower income positions. It's kind of a win-win situation for society.\" \nBut not everyone in Finland sees the basic income experiment as win-win, especially if it encourages workers to accept low-wage work. Benjamin Hall | CNBC Finland is conducting a national experiment testing universal basic income. \n\"Our path shouldn't be to create low-wage jobs but to really improve education and to improve people's skills,\" said Antti Jauhiainen, author of the Finnish book \"The Welfare State Strikes Back.\" \nJauhiainen favors universal basic income but sees it as an added benefit versus a replacement for the current welfare system. He said that by targeting a small set of unemployed individuals, the trial is the \"wrong approach to a hugely important idea.\" \nRuusunen agreed the trial should be expanded beyond people who are unemployed for it to be a true universal basic income. He's optimistic the idea will have a prominent place in Finland's future. \n\"I think that about 100 years from now the people will see basic income as the same kind of thing as a universal suffrage,\" he said. \"I'm actually very proud that Finland was one of the first countries where it was tested.\"", "external_links": [], "published": "2018-01-01T12:04:00.000+02:00", "crawled": "2018-01-01T12:04:10.013+02:00", "highlightTitle": ""}