{"organizations": [], "uuid": "f4f1c6ac7e29c54c1133498e9fe471d8d7d434ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220585232&w=1200&r=LYNXMPEE0815G", "site_section": "http://feeds.reuters.com/reuters/UKDomesticNews/", "section_title": "Reuters: UK", "url": "https://uk.reuters.com/article/uk-britain-eu-germany/transition-period-has-priority-over-ultimate-brexit-british-ministers-write-idUKKBN1EY204", "country": "US", "domain_rank": 408, "title": "Transition period has priority over ultimate Brexit, British ministers write", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T18:49:00.000+02:00", "replies_count": 0, "uuid": "f4f1c6ac7e29c54c1133498e9fe471d8d7d434ae"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-eu-germany/transition-period-has-priority-over-ultimate-brexit-british-ministers-write-idUKKBN1EY204", "ord_in_thread": 0, "title": "Transition period has priority over ultimate Brexit, British ministers write", "locations": [], "entities": {"persons": [{"name": "reuters/peter nicholls", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "frankfurter allgemeine zeitung", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 4:49 PM / Updated 17 minutes ago UK ministers call for EU market access during Brexit transition Reuters Staff 2 Min Read \nBERLIN (Reuters) - British finance minister Philip Hammond and Brexit minister David Davis have called in a German newspaper for Britain to retain its current access to EU markets for a transition period before its final exit from the European Union. Britain's Chancellor of the Exchequer Philip Hammond arrives in Downing Street, London, January 9, 2018. REUTERS/Peter Nicholls \nThe ministers, who are due to begin a visit to Germany on Wednesday, wrote in a guest article for Wednesday’s Frankfurter Allgemeine Zeitung that was also in the interests of Germany and the European Union. \nThe transition period would start when Britain formally exits the EU’s single market and customs union. \n“During this period access to the markets of others should remain in its current form and on the basis of the existing rules, provisions and institutions of the EU,” they wrote. \nHaving such a time-limited transition period would give British and European companies time and ensure they only have to prepare for one set of changes, after the nature of Britain’s future trading partnership with the EU is clear, the ministers added. \nThe ministers wrote that the British government understood the German position that Britain could not leave the EU while at the same time enjoying all the benefits of EU membership. \nBut they added: “The EU’s priorities are not incompatible with ours: a deep and special partnership with our closest trade partners and allies.” \nIt was necessary to reach an agreement to promote banking sector cooperation in Europe after Brexit to preserve stability, they wrote. \nThey said Britain remained committed to Europe’s security and wanted Britain and the EU to work together closely against threats in future. \nOn trade, they wrote that Britain was aiming to achieve the world’s most ambitious economic partnership with the EU. \n“We should tackle this imaginatively and inventively, just as both of our countries have always acted in the EU, to get a tailored solution that builds on our deeply integrated and unique starting position,” they wrote. Reporting by Michelle Martin and Madeline Chambers; editing by Thomas Escritt and Andrew Roche", "external_links": [], "published": "2018-01-09T18:49:00.000+02:00", "crawled": "2018-01-09T19:13:01.007+02:00", "highlightTitle": ""}