{"organizations": [], "uuid": "9c4f037fc8b34fe82f31b7b12da9aed42ecf265c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-new-york-life-investment-management-announces-new-leadership-team-at-indexiq.html", "country": "US", "domain_rank": 767, "title": "New York Life Investment Management Announces New Leadership Team at IndexIQ", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-08T21:00:00.000+02:00", "replies_count": 0, "uuid": "9c4f037fc8b34fe82f31b7b12da9aed42ecf265c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-new-york-life-investment-management-announces-new-leadership-team-at-indexiq.html", "ord_in_thread": 0, "title": "New York Life Investment Management Announces New Leadership Team at IndexIQ", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 8, 2018 /PRNewswire/ -- New York Life Investment Management (NYLIM) has named a new leadership team at IndexIQ, NYLIM's global ETF business. Jon Zimmerman, currently the head of ETF product development at NYLIM, has been named IndexIQ's chief operating officer, a newly created role. Mr. Zimmerman, along with IndexIQ's current chief investment officer, Sal Bruno, will now report to Kirk Lehneis, who oversees NYLIM's mutual fund and ETF operations and serves as NYLIM's chief operating officer.\nThese changes, which are effective immediately, are part of a planned, post-acquisition leadership transition for IndexIQ, which was acquired by NYLIM in 2014. Adam Patti and David Fogel, who founded the business and have been serving as CEO and president of IndexIQ, respectively, will step down to serve as senior advisors, reporting directly to Mr. Lehneis.\nMr. Lehneis said regarding the news: \"We are confident that Jon and Sal possess the leadership and management capabilities needed to propel IndexIQ into its next phase of growth. The business is in a strong position, with growing assets and innovative new products that leverage the insights and expertise of our world class family of investment boutiques. We expect that Jon and Sal will help accelerate the expansion of this business as we further align our U.S retail offerings. We congratulate them on their new roles.\"\nMr. Patti added: \"As David and I move into our new roles and on to new challenges later this year, we are confident that the business we founded, and have grown significantly with NYLIM's partnership and support, is well positioned for future success. Most importantly, we have the utmost faith and confidence in the new leadership now in place, who share our commitment to innovation and will continue to enhance the value IndexIQ delivers to its investors. We look forward to seeing what the team at IndexIQ achieves next.\"\nMr. Lehneis also commented on the important contributions made by IndexIQ's founders, Mr. Patti and Mr. Fogel: \"We thank Adam and David for their leadership and partnership these last three years. They have built a growing and successful business, and we have appreciated their guidance as we've integrated IndexIQ into NYLIM, and brought its offerings to more investors. Jon, Sal and I will benefit from their counsel in the months ahead, as they plan their next endeavors.\"\nBio: Jon Zimmerman\nJon Zimmerman, chief operating officer of IndexIQ, formerly of NYLIM's Product Development Group, responsible for ETF product development across the retail and institutional channels. Prior to joining New York Life in 2015, Jon worked for Morgan Stanley, serving both its Equity Capital Markets and Wealth Management divisions. Jon received his B.A. in Economics from New York University.\nBio: Sal Bruno\nSal Bruno, chief investment officer of IndexIQ, is responsible for developing and maintaining the firm's investment strategies. Sal joined IndexIQ in 2007 from Deutsche Asset Management where he held several senior positions, including head of quantitative research and portfolio manager for a US large cap core equity mutual fund with approximately $6 billion in assets under management. Sal earned a B.S. in Applied Economics & Business Management from Cornell University and an M.B.A. degree in Finance and Economics from New York University Leonard N. Stern School of Business. He is a member of NYSSA and the CFA Institute. He also holds the Series 7 and Series 63 licenses.\nAbout New York Life\nNew York Life Insurance Company, a Fortune 100 company founded in 1845, is the largest mutual life insurance company in the United States* and one of the largest life insurers in the world. New York Life has the highest possible financial strength ratings currently awarded to any life insurer from all four of the major credit rating agencies: A.M. Best (A++), Fitch (AAA), Moody's Investors Service (Aaa), Standard & Poor's (AA+). ** Headquartered in New York City, New York Life's family of companies offers life insurance, retirement income, investments and long-term care insurance. New York Life Investments*** provides institutional asset management. Other New York Life affiliates provide an array of securities products and services, as well as retail mutual funds. Visit www.newyorklife.com for more information.\nNew York Life Investment Management LLC, an indirect subsidiary of New York Life Insurance Company, New York, NY 10010, provides investment advisory products and services. IndexIQ Advisors LLC is the wholly owned subsidiary of New York Life Investment Management Holdings LLC.\n*Based on revenue as reported by \"Fortune 500 ranked within Industries, Insurance: Life, Health (Mutual),\" Fortune magazine, 6/12/17. For methodology, please see http://fortune.com/fortune500/ .\n**Individual independent rating agency commentary as of 8/1/17.\n***New York Life Investments is a service mark used by New York Life Investment Management Holdings LLC and its subsidiary, New York Life Investment Management LLC.\nMedia Contact:\nAllison Scott, New York Life\n212-576-4517\nallison_scott@newyorklife.com\nView original content: http://www.prnewswire.com/news-releases/new-york-life-investment-management-announces-new-leadership-team-at-indexiq-300579139.html\nSOURCE New York Life", "external_links": ["http://www.prnewswire.com/news-releases/new-york-life-investment-management-announces-new-leadership-team-at-indexiq-300579139.html", "http://fortune.com/fortune500/", "http://www.newyorklife.com/"], "published": "2018-01-08T21:00:00.000+02:00", "crawled": "2018-01-09T09:36:42.541+02:00", "highlightTitle": ""}