{"organizations": [], "uuid": "1181b43d778b59064c6d22240a801046ddc08281", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223099976&w=1200&r=LYNXMPEE0H1L7", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-environment-plastic/evian-joins-big-brands-in-race-to-bin-plastics-idUSKBN1F72MW", "country": "US", "domain_rank": 408, "title": "Evian joins big brands in race to bin plastics", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T02:14:00.000+02:00", "replies_count": 0, "uuid": "1181b43d778b59064c6d22240a801046ddc08281"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-environment-plastic/evian-joins-big-brands-in-race-to-bin-plastics-idUSKBN1F72MW", "ord_in_thread": 0, "title": "Evian joins big brands in race to bin plastics", "locations": [], "entities": {"persons": [{"name": "david attenborough", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "costa", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "mcdonald", "sentiment": "none"}, {"name": "danone", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Thomson Reuters Foundation) - Evian became the latest big brand to turn its back on polluting plastics on Thursday, pledging to make its water bottles from recycled materials by 2025.\nIt joined British supermarket Iceland, coffee chain Costa and fast-food giant McDonald‘s, which have all announced similar decisions in the last month.\nEvian, the luxury mineral water brand owned by Danone, the world’s third-largest bottled water company, said it would redesign its packaging, accelerate recycling and recover plastic waste from nature.\nThe shift by some of the biggest high-street names answers widespread consumer disquiet over pollution, accelerated after popular British naturalist David Attenborough urged consumers to stop using plastic bottles and start protecting marine life in his “Blue Planet II” documentary series.\nSupermarkets have vowed to use less plastic packaging and a tax on plastic bags in Britain has led to safer alternatives.\nBut plastic bottles remain ubiquitous - strewn in garbage cans and littering waterways, after bottled water became a lifestyle choice in countries that offer a safe and easy alternative - tap water.\n“Evian will drive a step change to address the critical issue of plastic,” said global brand director, Patricia Oliva, in a statement. “We want to use the power of our global brand to take a leadership position.”\nVIRTUOUS CIRCLE The so-called “circular economy” approach is gaining ground in the fight to cut waste, and entails reusing products, parts and materials, producing no waste and pollution, and therefore using fewer new resources and energy.\nBritain’s Costa coffee chain said this week that it would remove plastic straws from its stores and replace them in 2018.\n“We will launch a non-plastic alternative straw this year as part of an ongoing review into all our packaging and takeaway cups,” said Jason Cotta, managing director of Costa UK & Ireland, part of Whitbread Plc.\nThis follows recommendations by British lawmakers in January for the introduction of a “latte levy” whereby consumers pay an extra 25 pence ($0.34) for a disposable coffee cup.\nBritish supermarket Iceland plans to eliminate plastic packaging from its own-brand products by the end of 2023 and will instead use paper and pulp trays along with paper bags, all of which are fully recyclable.\nPrime Minister Theresa May this month unveiled a new environmental agenda which seeks to eradicate avoidable plastic waste in Britain by 2042.\nThis follows a ban on plastic microbeads, common in body scrubs and shower gels.\nCLOGGED The combined steps by major consumer companies aim to address criticism that packaging and global transportation causes undue environmental damage, as mountains of plastic waste get dumped in landfill and oceans every year.\nEight million tonnes of plastic - bottles, packaging and other waste - enter the ocean every year, killing marine life and entering the human food chain, says the United Nations Environment Programme.\nThe world’s biggest restaurant chain McDonald’s Corp said on Tuesday it would switch to environmentally friendly packaging materials and offer recycling in all its restaurants.\nMcDonald’s said it aims to get all its packaging from renewable, recycled or certified sources by 2025, with a preference for products from responsibly managed forests.\nThe company will also make recycling available in all restaurants by 2025, up from about 10 percent, and eliminate foam packaging from its global supply chain by year-end.\n“Our customers have told us that packaging waste is the top environmental issue they would like us to address,” said Francesca DeBiase, McDonald’s chief supply chain and sustainability officer, in a statement.\nReporting by Adela Suliman; editing by Lyndsay Griffiths. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T02:14:00.000+02:00", "crawled": "2018-01-19T12:14:18.000+02:00", "highlightTitle": ""}