{"organizations": [], "uuid": "a884920e8349e11d917b34723ff7455fa038f680", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-armour-residential-reit-inc-aannounces-february-2018-dividend-of-0-point-19-per-common-share.html", "country": "US", "domain_rank": 767, "title": "ARMOUR Residential REIT, Inc. Announces February 2018 Dividend of $0.19 Per Common Share", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T00:15:00.000+02:00", "replies_count": 0, "uuid": "a884920e8349e11d917b34723ff7455fa038f680"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-armour-residential-reit-inc-aannounces-february-2018-dividend-of-0-point-19-per-common-share.html", "ord_in_thread": 0, "title": "ARMOUR Residential REIT, Inc. Announces February 2018 Dividend of $0.19 Per Common Share", "locations": [], "entities": {"persons": [], "locations": [{"name": "florida", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "arr", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "inc.", "sentiment": "neutral"}, {"name": "inc", "sentiment": "neutral"}, {"name": "armour", "sentiment": "none"}, {"name": "company’s common stock", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VERO BEACH, Florida, Jan. 29, 2018 (GLOBE NEWSWIRE) -- ARMOUR Residential REIT, Inc. (NYSE: ARR, ARR PrA and ARR PrB) (“ARMOUR” or the “Company”) today announced the February 2018 cash dividend for the Company’s Common Stock, which maintains the current monthly dividend rate of $0.19 per Common share.\nFebruary 2018 Common Stock Dividend Information\nMonth Dividend Holder of Record Date Payment Date February 2018 $0.19 February 15, 2018 February 27, 2018 Certain Tax Matters\nARMOUR has elected to be taxed as a real estate investment trust (“REIT”) for U.S. Federal income tax purposes. In order to maintain this tax status, ARMOUR is required to timely distribute substantially all of its ordinary REIT taxable income. Dividends paid in excess of current tax earnings and profits for the year will generally not be taxable to common stockholders.\nAbout ARMOUR Residential REIT, Inc.\nARMOUR invests primarily in fixed rate residential, adjustable rate and hybrid adjustable rate residential mortgage-backed securities issued or guaranteed by U.S. Government-sponsored enterprises (“GSEs”), or guaranteed by the Government National Mortgage Association. In addition, ARMOUR invests in other securities backed by residential mortgages for which the payment of principal and interest is not guaranteed by a GSE or government agency. ARMOUR is externally managed and advised by ARMOUR Capital Management LP, an investment advisor registered with the Securities and Exchange Commission (“SEC”).\nSafe Harbor\nThis press release includes “forward-looking statements” within the meaning of the safe harbor provisions of the United States Private Securities Litigation Reform Act of 1995. Actual results may differ from expectations, estimates and projections and, consequently, you should not rely on these forward-looking statements as predictions of future events. Words such as “expect,” “estimate,” “project,” “budget,” “forecast,” “anticipate,” “intend,” “plan,” “may,” “will,” “could,” “should,” “believes,” “predicts,” “potential,” “continue,” and similar expressions are intended to identify such forward-looking statements. These forward-looking statements involve significant risks and uncertainties that could cause the actual results to differ materially from the expected results. The Company disclaims any obligation to release publicly any updates or revisions to any forward-looking statement to reflect any change in its expectations or any change in events, conditions or circumstances on which any such statement is based, except as required by law.\nAdditional Information and Where to Find It\nInvestors, security holders and other interested persons may find additional information regarding the Company at the SEC’s internet site at www.sec.gov , or the Company website at www.armourreit.com , or by directing requests to: ARMOUR Residential REIT, Inc., 3001 Ocean Drive, Suite 201, Vero Beach, Florida 32963, Attention: Investor Relations.\nInvestor Contact:\nJames R. Mountain\nChief Financial Officer\nARMOUR Residential REIT, Inc.\n(772) 617-4340\nSource:ARMOUR Residential REIT, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=4ufmwp8vXBKOslNguvTLdtDK-U-uKZyYyMb8Wyv7VxG1JETz4l-ShjIAy97ofDUhJEuzlfnAWa0Ukh20QVr3joZT8zTqDsaXrbdxGm0IHXs=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/d49bb2ff-61f7-4f65-b3de-fba67c4cfb2a", "https://www.globenewswire.com/Tracker?data=U9FkoXGVVF8Zsv3XS8nNtL4pVfrThglAELE6S3vTQtmjSS_ivzkkdrsBIi-DIA3HRZXB3xCdp6mvNDCRbgS9rw=="], "published": "2018-01-30T00:15:00.000+02:00", "crawled": "2018-01-30T03:41:05.025+02:00", "highlightTitle": ""}