{"organizations": [], "uuid": "49252557763adddfb79805816c72d94e8243cce5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104934268-GettyImages-881815194-azar.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/hhs-nominee-azar-must-protect-medicare-obamacare-and-lower-drug-prices-commentary.html", "country": "US", "domain_rank": 767, "title": "HHS nominee Azar must protect Medicare, Obamacare and lower drug prices-commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-08T21:53:00.000+02:00", "replies_count": 0, "uuid": "49252557763adddfb79805816c72d94e8243cce5"}, "author": "Margarida Jorge", "url": "https://www.cnbc.com/2018/01/08/hhs-nominee-azar-must-protect-medicare-obamacare-and-lower-drug-prices-commentary.html", "ord_in_thread": 0, "title": "HHS nominee Azar must protect Medicare, Obamacare and lower drug prices-commentary", "locations": [], "entities": {"persons": [{"name": "obamacare", "sentiment": "negative"}, {"name": "alex azar", "sentiment": "negative"}, {"name": "azar", "sentiment": "negative"}, {"name": "eric thayer", "sentiment": "negative"}, {"name": "tom price", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "hhs", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "negative"}, {"name": "medicare", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "trump administration", "sentiment": "none"}, {"name": "senate finance committee", "sentiment": "none"}, {"name": "health and human services", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "aca", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Since taking office, the Trump Administration has taken deliberate actions to systematically sabotage and dismantle the Affordable Care Act (ACA) piece by piece, while the Republicans in Congress, with Trump cheer leading all the way, have worked hard to repeal the law. This has thrown American families and health care markets into a frenzy—who would be covered? What would it cost? What's the future of America's health care?\nThese are some of the many questions for Alex Azar to answer as the person who hopes to succeed Tom Price as the leader of the Health and Human Services agency (HHS) when he appears before the Senate Finance Committee on Tuesday.\nWhile Price distinguished himself as a zealous opponent of the ACA, Azar has the opportunity to enact a proactive agenda to improve America's health care. But first he has to decide whether he's going to be an agent for the future or a captive of his past as an executive for a top U.S. drug company.\nAzar can revive HHS's mission to \"enhance the health and well-being of Americans,\" or follow the profit-driven path he plowed at Eli Lilly which jacked up the price of insulin by 225 percent since 2011 . Given how much we still don't know about Azar even after his first confirmation hearing, we have some questions we hope he finally will answer during the remainder of the Senate confirmation process.\nWhat will you do to strengthen the Affordable Care Act (ACA) and expand access to affordable, quality care?\nInstead of working to expand enrollment in the marketplaces and working to stabilize insurance markets to ensure consumers have a wide choice of insurers, Republicans in Congress and the administration has taken several steps in the opposite direction.\nFrom the repeal of the individual responsibility provision of the law to the administration's proposed rule allowing insurers to offer bare-bones insurance without consumer protections , these moves only serve to increase costs and weaken Americans' health care.\nInstead of taking every step possible to undermine the law, we need an HHS secretary who will work to create more stable markets, strengthen the law, and expand access to affordable care. Will you work with the ACA instead of against it, Mr. Azar? The health care of millions depends on your answer. Will you commit to protect and invest in Medicaid and Medicare, so no one will lose coverage?\nBoth programs provide care for working families, children, seniors and people with disabilities and have come under threat since Trump took office. Each health care repeal bill would have made dramatic cuts to these programs and end Medicaid as we know it, as would the GOP's tax and budget plans.\nAzar is on the record favoring what Republicans often refer to as \"state flexibility\" on Medicaid and block grants , but those are just cuts in disguise. We cannot afford a leader of HHS who favors cuts to Medicaid and Medicare and supports efforts to undermine these programs. Which side will you be on, Mr. Azar? How do you plan to lower drug prices?\nWhen President Trump announced the nomination, he said Azar would lower drug prices. But he's nominated a drug profiteer to the post. Azar was most recently president of U.S. operations for Eli Lilly & Co., a company now under investigation for possible price fixing under his leadership and that paid the lowest U.S. tax rate among other leading American pharmaceutical companies.\nDrug companies cannot be allowed to exploit the need for life-saving prescription medicine. Even though Azar does not seem open to checks on the cost of drugs, we hope he will use his experience to help stop drug company price-gouging. What will you do, Mr. Azar – work for the people or the drug companies? Since taking office, President Trump has made it clear that Americans' health care will never be safe in his hands. The last thing we need at HHS is a leader who is hostage to both his boss and his drug industry past.\nAmericans are tired of waking up every day and wondering if their health care will be taken away or become too expensive. Every attempt by the House and Senate to repeal the ACA has been met with resounding opposition from the public.\nFor Azar, the central question is whether he will work for pharmaceutical corporations and Republican campaign contributors or the American people. Where do you stand, Mr. Azar? Who will you represent? Americans deserve to know.\nCommentary by Margarida Jorge and Ethan Rome, co-directors of Health Care for America Now , a national grassroots coalition that led the effort to pass, protect and promote the Affordable Care Act. It has come back together to fight against efforts to repeal and undermine the law.\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-08T21:53:00.000+02:00", "crawled": "2018-01-08T21:57:01.025+02:00", "highlightTitle": ""}