{"organizations": [], "uuid": "78ff59c7e458a3b1312239c4c4f4811c6ddc6431", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/business-wire-kala-pharmaceuticals-announces-topline-results-for-two-phase-3-trials-stride-1-and-stride-2-of-kpi-121-0-point-25-percent-in.html", "country": "US", "domain_rank": 767, "title": "Kala Pharmaceuticals Announces Topline Results for Two Phase 3 Trials (STRIDE 1 and STRIDE 2) of KPI-121 0.25% in Dry Eye Disease", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T15:00:00.000+02:00", "replies_count": 0, "uuid": "78ff59c7e458a3b1312239c4c4f4811c6ddc6431"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/business-wire-kala-pharmaceuticals-announces-topline-results-for-two-phase-3-trials-stride-1-and-stride-2-of-kpi-121-0-point-25-percent-in.html", "ord_in_thread": 0, "title": "Kala Pharmaceuticals Announces Topline Results for Two Phase 3 Trials (STRIDE 1 and STRIDE 2) of KPI-121 0.25% in Dry Eye Disease", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "kala pharmaceuticals", "sentiment": "negative"}, {"name": "itt", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Statistical significance achieved for the primary sign endpoint, conjunctival hyperemia at Day 15 in the ITT population, in STRIDE 1 (p<0.0001) Statistical significance achieved for the primary sign endpoint, conjunctival hyperemia at Day 15 in the ITT population, in STRIDE 2 (p<0.0001) Statistical significance achieved for the primary symptom endpoint, ocular discomfort severity at Day 15 in the ITT population, in STRIDE 1 (p<0.0001) Ocular discomfort severity at Day 15 in the ITT population showed improvement but did not reach statistical significance in STRIDE 2 (p=0.1298) Statistical significance for ocular discomfort severity at Day 15 in patients with more severe baseline discomfort was achieved in STRIDE 1 (p=0.0008), with a trend towards a treatment effect (p=0.0799) in STRIDE 2 Positive treatment effects observed for ocular discomfort severity in the ITT population at Day 8, a key secondary endpoint in both STRIDE 1 (p=0.0011) and STRIDE 2 (p=0.0408) KPI-121 0.25% was well-tolerated with elevations in IOP similar to placebo Conference call today at 8:00 AM Eastern Time\nWALTHAM, Mass.--(BUSINESS WIRE)-- Kala Pharmaceuticals, Inc. (NASDAQ:KALA), today announced topline results from its two Phase 3 clinical trials, STRIDE 1 and STRIDE 2 (STRIDE - S hort T erm R elief I n D ry E ye), evaluating the safety and efficacy of KPI-121 0.25% versus placebo in patients with dry eye disease.\nIn the STRIDE 1 trial, statistical significance was achieved for the primary sign endpoint of conjunctival hyperemia change from baseline to day 15 in the ITT population (p<0.0001) and the primary symptom endpoint of ocular discomfort severity change from baseline to day 15 in the ITT population (p<0.0001). Statistical significance was also achieved for a second pre-specified primary symptom endpoint of ocular discomfort severity change from baseline to day 15 in patients with more severe baseline ocular discomfort (p=0.0008). Statistical significance was not achieved for a second pre-specified primary sign endpoint, inferior corneal staining change from baseline to day 15 (p=0.1128). A positive treatment effect for ocular discomfort was also observed in the ITT population at day 8 (p=0.0011).\nKPI-121 was well tolerated in this trial with the most common adverse event in STRIDE 1 being instillation site pain, which was observed in 6.1% of patients in both the KPI-121 treatment group and the placebo group. The only other adverse event reported by greater than 1% of patients was eye irritation, which was reported in 1.1% of patients on KPI-121 vs. 1.5% of patients on placebo. Elevations in IOP, a known side effect with topical corticosteroid administration, were similar between the two groups with 0.4% in the KPI-121 group experiencing an increase in IOP of 5 mm of mercury (mmHg) or greater resulting in an IOP of 21 mmHg or greater compared to 0.4% in the placebo group.\nIn the STRIDE 2 trial, statistical significance was achieved for the primary sign endpoint of conjunctival hyperemia change from baseline to day 15 in the ITT population (p<0.0001). Statistical significance was not achieved for the primary symptom endpoint of ocular discomfort severity change from baseline to day 15 in the ITT population (p=0.1298), although a positive treatment effect was observed at day 8 (p=0.0408), a key secondary endpoint. A trend towards a positive treatment effect was observed for ocular discomfort severity change from baseline to day 15 in the patients with more severe baseline ocular discomfort (p=0.0799), which was a key secondary endpoint in this trial. KPI-121 was well tolerated in this trial with instillation pain being the most common adverse event In STRIDE 2 as reported by 5.7% of patients in the KPI-121 treatment group vs. 4.4% in the placebo group. The only other adverse event reported by greater than 1% of patients was blurred vision, which was reported in 0.2% of patients on KPI-121 vs. 1.3% of patients on placebo. Elevations in IOP were similar between the two groups with 1.1% in the KPI-121 group experiencing an increase in IOP of 5 mmHg or greater resulting in an IOP of 21 mmHg or greater compared to none in the placebo group.\n“We are pleased with the positive topline results of STRIDE 1, in which KPI-121 demonstrated statistically significant improvements in primary sign and symptom endpoints and are encouraged with the results in STRIDE 2, which showed statistical significance for the primary sign endpoint. Although we did not achieve statistical significance for the primary symptom endpoint in STRIDE 2, we did observe a strong trend towards a positive treatment effect in symptoms in more symptomatic patients, for which we achieved statistical significance in STRIDE 1,” said Mark Iwicki, Chief Executive Officer of Kala Pharmaceuticals. “We will continue to analyze the results of both Phase 3 trials and the totality of the data from all 3 trials conducted to date and expect to discuss our clinical program with the FDA. We believe that our preliminary, unaudited December 31, 2017 cash balance of approximately $114 million puts us in a strong position as we maintain our focus on moving this program forward to serve patients with dry eye disease.”\nThe two Phase 3 clinical trials were each multicenter, randomized, double-masked, placebo controlled, parallel-arm studies comparing KPI-121 to placebo each dosed four times a day (QID) for 14 days. Subjects who met initial screening and inclusion/exclusion criteria underwent a 2-week run-in period with placebo dosed in each eye QID for 14 days. Subjects who continued to meet inclusion and exclusion criteria after the run-in were randomized to either KPI-121 or placebo. A total of 918 patients were randomized in STRIDE 1 and 909 patients were randomized in STRIDE 2. Ocular discomfort severity was graded daily by the patient over the entire course of the trial using a visual analog grading scale recorded in a patient diary.\nConference Call\nKala will hold a conference call on Friday, January 5, 2018 at 8:00 AM ET to discuss results of the two Phase 3 pivotal trials of KPI-121 0.25% in dry eye disease. The dial-in numbers are 1-866-300-4091 for domestic callers and 1-703-736-7433 for international callers. The conference ID is 5364789. For an archived recording of the call and question and answer session, please visit the “Investors & Media” section on the Kala website at http://kalarx.com/ .\nPresentation at the 36 th Annual J.P. Morgan Healthcare Conference\nMark Iwicki, Chairman and Chief Executive Officer of Kala, will provide a corporate update on Monday, January 8, 2018 at 11:30 AM PT, followed by a question and answer session at 12:00 PM PT at the 36th Annual J.P. Morgan Healthcare Conference held at the Westin St. Francis Hotel in San Francisco, CA. For a live webcast and subsequent archived recording of the presentation and question and answer session, please visit the “Investors & Media” section on the Kala website at http://kalarx.com/ .\nAbout Dry Eye Disease\nDry eye disease is a chronic, episodic, multifactorial disease affecting the tears and ocular surface that can result in tear film instability, inflammation, discomfort, visual disturbance and ocular surface damage. Dry eye disease is estimated to affect approximately 33 million people in the United States, based on an estimated prevalence of 14.5% as described in The Beaver Dam Offspring Study, a major epidemiological study published in 2014 in the American Jo", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fkalarx.com%2F&esheet=51738424&newsitemid=20180105005184&lan=en-US&anchor=http%3A%2F%2Fkalarx.com%2F&index=1&md5=2b604223a119a0c19f7d2889ff78f59e", "http://www.businesswire.com/news/home/20180105005184/en/", "http://kalarx.com/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fkalarx.com%2F&esheet=51738424&newsitemid=20180105005184&lan=en-US&anchor=http%3A%2F%2Fkalarx.com%2F&index=2&md5=049bb723cf5df3280f60196385f0ec6c"], "published": "2018-01-05T15:00:00.000+02:00", "crawled": "2018-01-05T17:50:50.000+02:00", "highlightTitle": ""}