{"organizations": [], "uuid": "ad616de71f613b8c4b3a2f2790cec7bb56f12871", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 678, "shares": 678, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1218996768&w=1200&r=LYNXMPEE020AK", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-weather/eastern-u-s-braces-for-winter-storm-as-bitter-cold-remains-idUSKBN1ES0GM", "country": "US", "domain_rank": 408, "title": "Eastern U.S. braces for winter storm as bitter cold remains", "performance_score": 6, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T10:32:00.000+02:00", "replies_count": 0, "uuid": "ad616de71f613b8c4b3a2f2790cec7bb56f12871"}, "author": "", "url": "https://www.reuters.com/article/us-usa-weather/eastern-u-s-braces-for-winter-storm-as-bitter-cold-remains-idUSKBN1ES0GM", "ord_in_thread": 0, "title": "Eastern U.S. braces for winter storm as bitter cold remains", "locations": [], "entities": {"persons": [{"name": "brendan o'brien", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "eastern u.s.", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "u.s southeast", "sentiment": "none"}, {"name": "southern virginia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "new england", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}], "organizations": [{"name": "national weather service", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 8:32 AM / Updated 16 minutes ago 'Bombogenesis' takes aim at U.S. Northeast as South hit by snow Harriet McLeod , Scott Malone 4 Min Read \nCHARLESTON, S.C./BOSTON (Reuters) - A rare winter storm hit the U.S. Southeast on Wednesday, bringing Florida’s capital its first snow in three decades and snarling travel, while New England braced for a “bombogenesis” blizzard forecast to bring heavy accumulations on Thursday. \nThe governors of Florida, Georgia and North Carolina declared states of emergency, warning residents to expect icy roads and unseasonable freezing temperatures. Florida opened warming shelters for residents. \nAt least nine people have died in the record-low temperatures that have gripped much of the United States for the past few days, officials said. Police in Roseville, Michigan, on Wednesday said a 96-year-old woman, who had recently been diagnosed with dementia, was found lying dead in a playground, apparently having frozen to death after wandering outside in a robe and slippers. \nThe U.S. National Weather Service had blizzard warnings in effect from Virginia to Maine, with areas around Boston expected to see about a foot (30 cm) of snow on Thursday. Forecasters warned that snow would fall quickly, at a rate of several inches per hour, during the day, with the storm intensified by the “bombogenesis” effect, according to private forecaster Accuweather. \nIn historic Charleston, South Carolina, the winter storm shuttered carriage horse tour companies on Wednesday, city spokesman Jack O‘Toole said. A day earlier, a carriage horse slipped and fell on a patch of ice during a tour. \nResidents in nearby Mount Pleasant, South Carolina, on Tuesday headed to grocery stores in droves to stock up on food and supplies at local groceries, according to Nicholas Nichols, an employee at Publix grocery store. \n“They did restock last night. They were here until 4 in the morning,” Nichols said. \nThe wintry mix and low wind chills could cause widespread power outages and leave roads icy, making commuting treacherous for millions of Americans from northern Florida to southern Virginia, the National Weather Service said in a series of warnings. \nMany flights out of the Savannah/Hilton Head International Airport in Georgia and Tallahassee Airport in Florida were canceled. Pedestrians stop to look at the frozen Josephine Shaw Lowell Memorial Fountain in New York, January 3, 2018. REUTERS/Lucas Jackson \nThe weather service said its Tallahassee office measured a snow and sleet accumulation of 0.1 inch (2.5 mm) on its roof, the first time Florida’s capital has had snow since 1989. \nTwo to 3 inches (5-8 cm) of snow were expected in northeastern Florida, coastal Georgia and South Carolina, said weather service meteorologist Bob Oravec. \nBoston Mayor Marty Walsh ordered schools closed on Thursday, warning city residents that the peak of the storm would occur during the day, making travel extremely dangerous. Slideshow (9 Images) \n“Both rush hours will be affected,” Walsh told a news conference. “Be patient. With the amount of snow we’re getting here, we could be plowing your street and a half hour later it could look like we haven’t been there.” \n‘BOMBOGENESIS’ \nThe “bombogenesis” effect, also known as a “bomb cyclone,” was first described in a 1980 scientific paper by the late Fred Sanders, a professor at the Massachusetts Institute of Technology. It occurs when a storm’s barometric pressure drops by 24 millibars in 24 hours, greatly strengthening the storm. \nThe effect is seen along the northeastern coast every winter, but this storm will be particularly powerful, said Judah Cohen, a visiting scientist at MIT. \n“This one is unique in how quickly the pressure is going to fall,” Cohen said. “The pressures could rival a Category 1 or Category 2 hurricane.” \nSome coastal areas of Georgia, South Carolina, North Carolina and Virginia could ultimately receive up to 6 inches (15 cm) of snow and ice. \nAn arctic air mass will remain entrenched over the eastern two-thirds of the United States through the end of the week. Additional reporting by Suzannah Gonzales in Chicago, Brendan O'Brien in Milwaukee and Gina Cherelus in New York; Editing by Jeremy Gaunt and Jonathan Oatis", "external_links": [], "published": "2018-01-03T10:32:00.000+02:00", "crawled": "2018-01-03T10:44:19.009+02:00", "highlightTitle": ""}