{"organizations": [], "uuid": "d952b5567e0fbcd9538fc596b508111582b8c645", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220155736&w=1200&r=LYNXMPEE0705G", "site_section": "http://feeds.reuters.com/reuters/UKdomesticNews", "section_title": "Reuters: UK", "url": "https://uk.reuters.com/article/uk-britain-bbc/bbc-editor-quits-china-post-over-pay-discrimination-idUKKBN1EX06M", "country": "US", "domain_rank": 408, "title": "BBC editor quits China post over pay discrimination", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T05:34:00.000+02:00", "replies_count": 0, "uuid": "d952b5567e0fbcd9538fc596b508111582b8c645"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-bbc/bbc-editor-quits-china-post-over-pay-discrimination-idUKKBN1EX06M", "ord_in_thread": 0, "title": "BBC editor quits China post over pay discrimination", "locations": [], "entities": {"persons": [{"name": "gracie", "sentiment": "none"}, {"name": "carrie gracie", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "portland place", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 3:35 AM / Updated 3 hours ago Paid less than male peers, BBC China editor quits and speaks out Estelle Shirbon 5 Min Read \nLONDON (Reuters) - The BBC’s China Editor Carrie Gracie has quit her post in Beijing to fight for her right to pay equality with male peers, posting an attack on what she called the “secretive and illegal BBC pay culture”. FILE PHOTO: The main entrance to the BBC headquarters and studios is seen in Portland Place, London, Britain, July 16, 2015. REUTERS/Peter Nicholls/File Photo \nGracie’s revolt is part of the fallout from pay disclosures the British broadcaster was forced to make last July, which showed that two thirds of the highest earners on air were men, and that some of them were earning far more than women in equivalent roles. \nFunded by a licence fee levied on TV viewers and reaching 95 percent of British adults every week, the BBC is a pillar of the nation’s life, but as such it is closely scrutinised and held to exacting standards by the public and rival media. \nGracie’s stand was one of the top news headlines of the day on the BBC itself and on other British media, and many prominent women from the BBC and beyond voiced their support on social media under the slogan #IStandWithCarrie. \nGracie, who speaks fluent Mandarin and has reported on China for three decades, has not left the BBC. She said she was returning to her former post in the TV newsroom in London where she expected to be paid equally to men in equal jobs. \n“I am not asking for more money. I believe I am very well paid already -- especially as someone working for a publicly funded organisation. I simply want the BBC to abide by the law and value men and women equally,” she wrote on her website. \nGracie said she was paid 135,000 pounds ($182,800) a year as China editor. According to last July’s disclosures, North America Editor Jon Sopel earned between 200,000 and 250,000 pounds a year, while Middle East Editor Jeremy Bowen was in the 150,000 to 200,000 bracket. \nEurope editor Katya Adler, the BBC’s only other female editor in foreign news, did not feature in the disclosures, meaning her pay was less than 150,000 pounds. \nGracie said managers had offered to increase her pay to 180,000 pounds, but that was no solution. She rejected the rise and insisted that all four of the BBC’s international editors should receive equal pay. \n“I was not interested in more money. I was interested in equality,” she said during an interview on BBC radio. \nBritain enacted legislation outlawing sex discrimination in the 1970s and this was followed by an equality act in 2010, but women still earn less than men across much of the economy. \n“ENOUGH IS ENOUGH” \nThe BBC defended itself by saying its gender pay gap was below the national average and less bad than at many other organisations, adding that it was committed to wiping it out by 2020. It also said an independent audit of rank and file staff had found “no systemic discrimination against women” at the BBC. \nSeveral high-profile women seized on the Gracie story to say the problem was much bigger than the BBC and affected the whole of society. \n“Tip of the iceberg in @BBC & most other orgs (organisations). Equality Act 2010 means no hiding place for shameful discrimination against women. Ending it long overdue,” wrote prominent lawmaker Harriet Harman of the opposition Labour Party, a long-time advocate of women’s equality, on Twitter. \nAs in many other countries, pay inequality based on gender has been a persistent problem in Britain, which by some measures has performed worse than comparable European countries in recent years. Britain was ranked 15th in the World Economic Forum’s global gender gap index 2017, below France and Germany. \nBut Gracie said her complaint was not about the gender pay gap the BBC admits to, which stems from men earning more on average because they do more of the best paid jobs. “It is men earning more in the same jobs or jobs of equal value. It is pay discrimination and it is illegal,” she said. \nGracie accused the BBC of adopting a botched “divide and rule” response to the legitimate anger of female staff, offering pay rises to some women while locking down others in a protracted complaints process. In her own case, the process had been “dismayingly incompetent and undermining”, she said. \n“Enough is enough. The rise of China is one of the biggest stories of our time and one of the hardest to tell,” she wrote, citing Chinese state censorship, surveillance, police harassment and official intimidation. \n“I cannot do it justice while battling my bosses and a byzantine complaints process.” \n($1 = 0.7384 pounds)", "external_links": [], "published": "2018-01-08T05:34:00.000+02:00", "crawled": "2018-01-08T06:14:00.000+02:00", "highlightTitle": ""}