{"organizations": [], "uuid": "89e1e5c60bd57efd40e9e51c5fbfa28c00577632", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-aercap-holdings-n-v-announces-pricing-of-1-point-15-billion-aggregate-principal-amount-of-senior-notes.html", "country": "US", "domain_rank": 767, "title": "AerCap Holdings N.V. Announces Pricing of $1.15 Billion Aggregate Principal Amount of Senior Notes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T00:34:00.000+02:00", "replies_count": 0, "uuid": "89e1e5c60bd57efd40e9e51c5fbfa28c00577632"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-aercap-holdings-n-v-announces-pricing-of-1-point-15-billion-aggregate-principal-amount-of-senior-notes.html", "ord_in_thread": 0, "title": "AerCap Holdings N.V. Announces Pricing of $1.15 Billion Aggregate Principal Amount of Senior Notes", "locations": [], "entities": {"persons": [{"name": "pierce", "sentiment": "none"}], "locations": [{"name": "dublin", "sentiment": "none"}], "organizations": [{"name": "aercap holdings n.v.", "sentiment": "negative"}, {"name": "aer", "sentiment": "negative"}, {"name": "usa) inc.", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "fenner & smith incorporated", "sentiment": "none"}, {"name": "aercap global aviation trust", "sentiment": "none"}, {"name": "ireland capital designated activity company", "sentiment": "none"}, {"name": "bnp paribas securities corp.", "sentiment": "none"}, {"name": "merrill lynch", "sentiment": "none"}, {"name": "goldman sachs & co", "sentiment": "none"}, {"name": "j.p. morgan securities llc", "sentiment": "none"}, {"name": "hsbc securities", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DUBLIN--(BUSINESS WIRE)-- AerCap Holdings N.V. (“AerCap”) (NYSE: AER) has announced today that AerCap Ireland Capital Designated Activity Company and AerCap Global Aviation Trust (together, the “Issuers”), each a wholly-owned subsidiary of the Company, priced their offering of senior notes, consisting of $600 million aggregate principal amount of 3.300% Senior Notes due 2023 (the “2023 Notes”) and $550 million aggregate principal amount of 3.875% Senior Notes due 2028 (the “2028 Notes” and, together with the 2023 Notes, the “Notes”). The Notes will be fully and unconditionally guaranteed on a senior unsecured basis by the Company and certain other subsidiaries of the Company. The Issuers intend to use the net proceeds from the Notes for general corporate purposes.\nBNP Paribas Securities Corp., Goldman Sachs & Co. LLC, HSBC Securities (USA) Inc., J.P. Morgan Securities LLC and Merrill Lynch, Pierce, Fenner & Smith Incorporated are serving as joint book running managers for the underwritten public offering.\nThe Company has filed a registration statement (including a prospectus) on Form F-3 with the U.S. Securities and Exchange Commission (the “SEC”) for the underwritten offering to which this communication relates. The registration statement automatically became effective upon filing on June 22, 2015. Investors should read the accompanying prospectus dated June 22, 2015, the preliminary prospectus supplement relating to the offering dated January 16, 2018 and other documents the Company has filed with the SEC for more complete information about the Company and this offering. These documents may be obtained for free by visiting EDGAR on the SEC’s website at www.sec.gov .\nThe prospectus supplement and accompanying prospectus relating to the offering may be obtained from: BNP Paribas Securities Corp., 787 7th Avenue, New York, New York 10019 or by calling toll-free at 1-800-854-5674; Goldman Sachs & Co. LLC, 200 West Street, New York, New York 10282 or by calling toll-free at 1-866-471-2526; HSBC Securities (USA) Inc., 452 Fifth Avenue, New York, New York 10018 or by calling toll-free at 1-866-811-8049; J.P. Morgan Securities LLC, 383 Madison Avenue, New York, New York 10179 or by calling collect at 1-212-834-4533; Merrill Lynch, Pierce, Fenner & Smith Incorporated, One Bryant Park, New York, New York 10036 or by calling toll-free at 1-800-294-1322.\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy the Notes or any other securities, nor shall there be any offer, solicitation or sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout AerCap\nAerCap is the global leader in aircraft leasing with, as of September 30, 2017, 1,506 owned, managed or on order aircraft in its portfolio. AerCap has one of the most attractive order books in the industry. AerCap serves approximately 200 customers in approximately 80 countries with comprehensive fleet solutions. AerCap is listed on the New York Stock Exchange (AER) and has its headquarters in Dublin with offices in Los Angeles, Shannon, Fort Lauderdale, Singapore, Amsterdam, Shanghai, Abu Dhabi, Seattle and Toulouse.\nForward-Looking Statements\nThis press release contains certain statements, estimates and forecasts with respect to future performance and events. These statements, estimates and forecasts are \" \". In some cases, can be identified by the use of forward-looking terminology such as \"may,\" \"might,\" \"should,\" \"expect,\" \"plan,\" \"intend,\" \"estimate,\" \"anticipate,\" \"believe,\" \"predict,\" \"potential\" or \"continue\" or the negatives thereof or variations thereon or similar terminology. All statements other than statements of historical fact included in this press release are and are based on various underlying assumptions and expectations and are subject to known and unknown risks, uncertainties and assumptions, and may include projections of our future financial performance based on our growth strategies and anticipated trends in our business. These statements are only predictions based on our current expectations and projections about future events. There are important factors that could cause our actual results, level of activity performance or achievements to differ materially from the results, level of activity, performance or achievements expressed or implied in the As a result, we cannot assure you that the included in this press release will prove to be accurate or correct. In light of these risks, uncertainties and assumptions, the future performance or events described in the in this press release might not occur. Accordingly, you should not rely upon as a prediction of actual results and we do not assume any responsibility for the accuracy or completeness of any of these Except as required by applicable law, we do not undertake any obligation to, and will not, update any , whether as a result of new information, future events or otherwise.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116006799/en/\nAerCap Holdings N.V.\nFor Media:\nGillian Culhane, +353 1 636 0945\nVice President Corporate Communications\ngculhane@aercap.com\nor\nFor Investors:\nJoseph McGinley, +353 1 418 0428\nHead of Investor Relations\njmcginley@aercap.com\nSource: AerCap Holdings N.V.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51744250&newsitemid=20180116006799&lan=en-US&anchor=www.sec.gov&index=1&md5=2b8b4001cecfc7bd948511eb1219c60a", "http://www.businesswire.com/news/home/20180116006799/en/"], "published": "2018-01-17T00:34:00.000+02:00", "crawled": "2018-01-17T03:10:58.009+02:00", "highlightTitle": ""}