{"organizations": [], "uuid": "fab345329097f40954208941d586d73c51133968", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180110.html", "section_title": "Archive News &amp; Video for Wednesday, 10 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/psa-jobs-vauxhall/update-1-uk-business-minister-meets-peugeot-ceo-after-vauxhall-plant-job-cuts-source-idUSL8N1P52DT", "country": "US", "domain_rank": 408, "title": "UPDATE 1-UK business minister meets Peugeot CEO after Vauxhall plant job cuts- source", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T19:04:00.000+02:00", "replies_count": 0, "uuid": "fab345329097f40954208941d586d73c51133968"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/psa-jobs-vauxhall/update-1-uk-business-minister-meets-peugeot-ceo-after-vauxhall-plant-job-cuts-source-idUSL8N1P52DT", "ord_in_thread": 0, "title": "UPDATE 1-UK business minister meets Peugeot CEO after Vauxhall plant job cuts- source", "locations": [], "entities": {"persons": [{"name": "costas pitas", "sentiment": "negative"}, {"name": "greg clark", "sentiment": "none"}, {"name": "clark", "sentiment": "none"}, {"name": "carlos tavares", "sentiment": "none"}, {"name": "tavares", "sentiment": "none"}, {"name": "carlo", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "ellesmere port", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "peugeot", "sentiment": "negative"}, {"name": "vauxhall", "sentiment": "negative"}, {"name": "psa", "sentiment": "negative"}, {"name": "general motors", "sentiment": "none"}, {"name": "opel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Recasts with PSA boss meeting UK business minister)\nBy Costas Pitas\nLONDON, Jan 10 (Reuters) - Britain’s business minister Greg Clark is meeting Peugeot Chief Executive Carlos Tavares on Wednesday in Paris to discuss the firm’s Vauxhall car plant, a source told Reuters after the firm announced job cuts, raising concerns about the site’s future.\nPeugeot-maker PSA bought General Motors’ loss-making European arm, which operates as Opel on the continent and Vauxhall in Britain, last year and has been pursuing a restructuring plan to return it to profitability.\nThe French group said in October it would cut 400 jobs at its Ellesmere Port site and on Monday announced a further 250 losses, reducing the workforce by a third to make it more efficient, renewing workers’ fears about the future.\nThe source familiar with the matter said Clark and Tavares would discuss a number of issues and Wednesday’s face-to-face had been planned for some time.\n“The meeting has been in the diary for a while,” the source said.\nA PSA spokesman confirmed that the meeting was taking place.\n“Business as usual. Carlos Tavares meets quiet often members of government where the Group operates,” he said by email.\nThe firm is due to decide as soon as this year whether to build new cars at the site, in the latest test of Britain’s ability to attract investment as it leaves the European Union.\nThe head of Britain’s biggest trade union Len McCluskey is also due to meet Tavares this month and warned that any plans to close the firm’s Vauxhall car plant in northern England will cost it sales in Opel-Vauxhall’s largest market.\n“I‘m going to France in the next fortnight to meet with Carlos Tavares to tell him that we will not allow PSA to close a healthy UK plant,” McCluskey said on Twitter.\n“I will make it crystal clear to the PSA boss Carlos Tavares that if there is any attempt to close the Ellesmere Port Vauxhall plant we will make sure their market in the UK is finished for good,” he said.\nOpel-Vauxhall sold nearly 290,000 vehicles in Britain in 2016 compared with 260,000 in Germany.\nPeugeot, which is also cutting hours for workers at Opel, has said the job losses at Ellesmere Port are needed to boost efficiency at the plant by reducing it to one shift.\nBritain’s car industry body said last week that 2017 sales across the sector recorded their biggest drop since 2009, blaming plans to increase a levy on new diesel cars and weakening consumer confidence in the wake of Brexit.\nEditing by Edmund Blair and Adrian Croft\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T19:04:00.000+02:00", "crawled": "2018-01-11T12:41:04.000+02:00", "highlightTitle": ""}