{"organizations": [], "uuid": "ae5c21085dddc7e93917737a70740b87e869aab6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-biogennix-reports-record-growth-for-2017-expands-executive-management-team.html", "country": "US", "domain_rank": 767, "title": "Biogennix Reports Record Growth for 2017; Expands Executive Management Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T19:35:00.000+02:00", "replies_count": 0, "uuid": "ae5c21085dddc7e93917737a70740b87e869aab6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-biogennix-reports-record-growth-for-2017-expands-executive-management-team.html", "ord_in_thread": 0, "title": "Biogennix Reports Record Growth for 2017; Expands Executive Management Team", "locations": [], "entities": {"persons": [{"name": "peter gordon", "sentiment": "none"}, {"name": "rob cripe", "sentiment": "none"}, {"name": "cripe", "sentiment": "none"}, {"name": "biogennix", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IRVINE, Calif.--(BUSINESS WIRE)-- Irvine-based Biogennix , an osteobiologics company that develops, manufactures, and distributes proprietary bone graft substitutes used for bone fusion procedures, revealed today that it achieved record growth in 2017. The company closed the year with 47% growth, the broadest increase the company has experienced in its history.\nThe majority of Biogennix’s growth is attributed to increases in sales of the company’s novel bone graft substitutes, Morpheus™ and osteoSPAN™, both of which are resorbable, osteoconductive scaffolds ideally suited for bone regeneration. The Morpheus product is a moldable version of osteoSPAN which combines the granules with an organic binder, providing optimal handling characteristics for surgeons.\nThe company also kicked off 2018 with the announcement of two key new hires: Rob Cripe, who will assume the role of Chief Marketing Officer; and Peter Gordon, who has been named Eastern Area Sales Director.\nCripe brings over 25 years of medical device industry experience, specializing in worldwide commercial execution. Having held executive responsibilities for sales, marketing, clinical and product development teams with companies such as Zimmer/Biomet, Smith and Nephew and DJO Global, Cripe has a deep understanding of successful execution strategies in multi-billion dollar, public organizations. He has also held executive roles for smaller, privately held companies in biologics, stroke therapy and orthotics and prosthetics, giving him a well-rounded perspective of the start-up environment.\nGordon comes to Biogennix after five years with LDR Spine where he was responsible for sales growth in the New England region. Working through a distributor sales force he consistently grew sales each year and was one of the top ten Regional Managers in sales growth 4 out of 5 years during his tenure. Prior to LDR Spine Peter was Director of Field Marketing for Archus Orthopedics. He also has served as Director of Spinal Arthroplasty Education and as Regional Sales Manager with DePuy Spine while based in Seattle. He also gained experience with bone graft materials and biologics with GenSci Orthobiologics where he was Eastern Regional Sales Director, growing sales from 0 to over 5 million dollars in less than three years.\n“We’re pleased to report that 2017 was a benchmark year for us,” said Scott Bauccio, Biogennix’s Vice President of Sales and Business Development. “Our Morpheus and osteoSPAN bone graft products continued to exceed expectations on a national level and we believe that the products will fast become the standard of effectiveness and ease of use when it comes to bone graft substitutes in 2018. By further strengthening our executive team with top-caliber industry talent and expertise offered by Rob Cripe and Peter Gordon, we expect to continue to grow exponentially and expand upon last year’s success.”\nBiogennix is a leading developer of osteobiologic products specifically designed for spine fusion and bone trauma. The company is led by a team of scientists and industry veterans committed to delivering unique products for bone regeneration. Biogennix designs, manufactures and distributes all of its products from its Irvine facilities.\nBiogennix™ is a fully-integrated osteobiologic company headquartered in Irvine which develops, manufactures, and distributes proprietary bone graft substitutes used in bone fusion procedures. Learn more at biogennix.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180117005562/en/\nBiogennix\nPaul Williams, 310-569-0023\npaul@medialinecommunications.com\nSource: Biogennix", "external_links": ["http://www.businesswire.com/news/home/20180117005562/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.biogennix.com&esheet=51744440&newsitemid=20180117005562&lan=en-US&anchor=Biogennix&index=1&md5=8c57f7dbafe79d4b69f233710245fc7d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.biogennix.com&esheet=51744440&newsitemid=20180117005562&lan=en-US&anchor=biogennix.com&index=2&md5=c730ae766d3300fa880b9ed067a707a3"], "published": "2018-01-17T19:35:00.000+02:00", "crawled": "2018-01-17T21:23:38.009+02:00", "highlightTitle": ""}