{"organizations": [], "uuid": "47f60ce6614b40c4c86c166fae99d6281c8b2a56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/domesticNews\r", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-immigration-protections/u-s-to-end-protected-status-for-many-salvadoran-immigrants-washington-post-idUSKBN1EX1O2", "country": "US", "domain_rank": 408, "title": "U.S. to end protected status for many Salvadoran immigrants: Washington Post", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T17:39:00.000+02:00", "replies_count": 0, "uuid": "47f60ce6614b40c4c86c166fae99d6281c8b2a56"}, "author": "", "url": "https://www.reuters.com/article/us-usa-immigration-protections/u-s-to-end-protected-status-for-many-salvadoran-immigrants-washington-post-idUSKBN1EX1O2", "ord_in_thread": 0, "title": "U.S. to end protected status for many Salvadoran immigrants: Washington Post", "locations": [], "entities": {"persons": [{"name": "tim ahmann", "sentiment": "none"}, {"name": "mohammad zargham", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "washington post", "sentiment": "negative"}, {"name": "washington post reuters", "sentiment": "none"}, {"name": "post", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. department of homeland security", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 3:39 PM / Updated 3 hours ago U.S. moves toward expelling 200,000 Salvadorans Yeganeh Torbati 5 Min Read \nWASHINGTON (Reuters) - Some 200,000 Salvadoran immigrants allowed to live and work in the United States since 2001 will lose their right to remain in the country in 2019, officials said on Monday, marking the Trump administration’s latest move to tighten immigration enforcement. \nThe United States will end the Salvadorans’ temporary protected status (TPS) on Sept. 9, 2019, giving them 18 months to leave or seek lawful residency, and for El Salvador to prepare for their return, officials said. The status was granted in the wake of two devastating 2001 earthquakes in El Salvador that left hundreds of thousands in the country homeless. \nThe decision to end TPS for Salvadorans is part of the administration’s broader push to tighten immigration laws and expel those living in the United States illegally. The move was heavily criticized by immigrant advocates who said it ignored violence in El Salvador and gave the Salvadorans few options but to leave the United States or remain illegally. \nThe Trump administration has faced a series of deadlines over the past year to decide whether to end the protected status of immigrants in the United States whose home countries have been affected by disasters. \nSalvadorans are by far the largest group under TPS, a program administration officials said is supposed to provide a temporary haven for victims, not a permanent right to remain in the United States. \nCritics have complained TPS has allowed participants to repeatedly extend their stays in 6-month to 18-month increments. \nTrump administration changes to the TPS program mean that over the next two years approximately 250,000 people who previously had permission to live and work in the United States will be subject to deportation if they remain. \nHaitians and Nicaraguans will lose their protected status in 2019 and Hondurans, the second largest group in the program, could lose their rights later this year. \n“The past practice of allowing foreign nationals to remain in the United States long after an initial emergency in their home countries has ended has undermined the integrity of the program and essentially made the ‘temporary’ protected status a front operation for backdoor permanent immigration,” said Roy Beck, president of NumbersUSA, which favors less immigration overall. \n“WE‘RE NOT CRIMINALS” Demonstrators hold signs protesting the termination of Salvadorans' Temporary Protected Status (TPS) in front of the White House in Washington, D.C., U.S., January 8, 2018. REUTERS/Kevin Lamarque \nAdvocates of the program say long-term resident Salvadorans and their children should not be sent back to El Salvador, a country struggling with a weak economy and gang violence that has given it one of the world’s highest murder rates. \n“Our (U.S) government is complicit in breaking up families — nearly 275,000 U.S.-born children have a parent who is a TPS holder — and further destabilizing our neighboring countries,” said Oscar Chacon, executive director of Alianza Americas, an immigrant advocacy group. \nA senior administration official briefing reporters on the decision said it was based on the status of El Salvador’s recovery from the 2001 earthquakes. The country has received millions of dollars in aid for the recovery and rebuilt schools, homes and hospitals, the official said. Slideshow (5 Images) \nIn the past two years, the United States has repatriated 39,000 Salvadorans back to the country, showing the ability of the country to absorb an influx of its citizens, the official said. \nThe government of El Salvador said Monday it was glad the administration decided to at least leave the program in place until September 2019. \n”El Salvador’s Foreign Ministry lobbied heavily for the interests of our fellow citizens,” the government said in a statement, adding that it would continue to search for alternative solutions, seeking action by the U.S. Congress to protect the immigrants. \nThe U.S. Chamber of Commerce had urged the government to extend TPS protections for Salvadorans, Haitians and Hondurans, saying “the loss of employment authorization for these populations would adversely impact several key industries,” including “construction, food processing, hospitality, and home healthcare services.” \nPatricia Hernandez, 53, arrived in the United States in 2000 and applied for TPS after the 2001 earthquakes. She has lived in North Carolina for 18 years and runs a subcontracting construction business with her Honduran husband. The couple have two U.S.-born teenage sons. \n“This is a real blow for everyone,” said Hernandez by telephone. “Most of us pay taxes, we’re not living off the government, we’re not criminals.” \nThe family will move to Honduras with their children and the couple do not intend to return north, she said, though they worry about violence and political instability in central America. Additional reporting by Warren Strobel in Washington, Mica Rosenberg in New York and Nelson Renteria in San Salvador; Writing by Mohammad Zargham; Editing by Sue Horton and Andrew Hay", "external_links": [], "published": "2018-01-08T17:39:00.000+02:00", "crawled": "2018-01-08T17:58:47.022+02:00", "highlightTitle": ""}