{"organizations": [], "uuid": "b30233f17424a81c19e23b01c0d6c045362d3a27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-academy-of-managed-care-pharmacy-announces-new-president-elect-three-board-members.html", "country": "US", "domain_rank": 767, "title": "Academy of Managed Care Pharmacy Announces New President-Elect, Three Board Members", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-08T20:38:00.000+02:00", "replies_count": 0, "uuid": "b30233f17424a81c19e23b01c0d6c045362d3a27"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-academy-of-managed-care-pharmacy-announces-new-president-elect-three-board-members.html", "ord_in_thread": 0, "title": "Academy of Managed Care Pharmacy Announces New President-Elect, Three Board Members", "locations": [], "entities": {"persons": [{"name": "curry", "sentiment": "none"}, {"name": "deb curry", "sentiment": "none"}, {"name": "james kenney", "sentiment": "none"}, {"name": "kenny", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "alexandria", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "academy of managed care pharmacy", "sentiment": "negative"}, {"name": "the academy of managed care pharmacy", "sentiment": "negative"}, {"name": "massachusetts college of pharmacy and allied health sciences", "sentiment": "none"}, {"name": "amcp board", "sentiment": "none"}, {"name": "legislative and regulatory affairs committee", "sentiment": "none"}, {"name": "journal of managed care & specialty pharmacy", "sentiment": "none"}, {"name": "amcp", "sentiment": "none"}, {"name": "membership and special projects", "sentiment": "none"}, {"name": "formulary product & strategy", "sentiment": "none"}, {"name": "student pharmacist committee", "sentiment": "none"}, {"name": "amcp managed care", "sentiment": "none"}, {"name": "harvard pilgrim health care", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ALEXANDRIA, Va., Jan. 8, 2018 /PRNewswire-USNewswire/ -- The Academy of Managed Care Pharmacy (AMCP) is pleased to announce the recent election of four members to the AMCP Board of Directors for the 2018-2020 term. The new members, along with continuing members, will be sworn in at the AMCP Managed Care & Specialty Pharmacy Annual Meeting 2018, April 23-26 in Boston.\nAMCP President-Elect for 2018-19 is James Kenney, RPh, MBA, Manager of Specialty and Pharmacy Contracts at Harvard Pilgrim Health Care, and a faculty preceptor for the Massachusetts College of Pharmacy and Allied Health Sciences. Kenny has been a member of AMCP since 1988, and currently serves as a Director, as well as liaison to the Legislative and Regulatory Affairs Committee, Student Pharmacist Committee, and peer reviewer for the Journal of Managed Care & Specialty Pharmacy (JMCP).\nNew Directors for 2018-2020 term are:\nDeb Curry, PharmD (re-elected), Senior Director, Formulary Product & Strategy at OptumRx. Curry has been Chair of the Membership and Special Projects committees, and is co-founder and former leader of the Southwest AMCP Affiliate. She has presented at AMCP meetings and has published on managed care topics. Curry received the 2008 AMCP Spirit of Volunteerism award and is a Diamond-Level Visionary. Pat Gleason, PharmD, BCPS, FCCP, FAMCP, Senior Director, Health Outcomes, Prime Therapeutics, and adjunct professor at the University of Minnesota. Gleason has been a member of the JMCP Editorial Advisory Board for 10 years, serving for two years as its Chair. He has published frequently in JMCP, and has presented at AMCP meetings. In 2014, Gleason received the AMCP Spirit of Volunteerism Award. Debra J. Minich, BSPharm, RPh, Vice President, Clinical Account Services, MedImpact Healthcare Systems, Inc. Minich has been Chair of the Organizational Affairs Committee, and served as a member of the Schools of Pharmacy Relations and Finance committees. Minich also serves as an AMCP Diplomat for several colleges of pharmacies, and is past President of the AMCP Midwest Affiliate.\n\"Once again, AMCP is fortunate to have a group of highly qualified individuals to serve on the Board of Directors,\" says AMCP CEO Susan A. Cantrell, RPh, CAE. \"Their experience and expertise will guide the organization as we celebrate our 30 th anniversary and implement a new strategic plan. I look forward to working with them to further the goals and mission of AMCP.\"\nContinuing members are: current President Diana Brixner, RPh, PhD, FAMCP, who will move to Immediate Past President; current President-Elect Mitzi M. Wasik, PharmD, BCPS, FAMCP, FCCP, who will become President; Treasurer William H. Francis, BSPharm, MBA, RPh; Director Paul L. Jeffrey, PharmD; and Director Marissa Schlaifer, BSPharm, MS, RPh.\nAbout AMCP\nThe Academy of Managed Care Pharmacy is the nation's leading professional association dedicated to increasing patient access to affordable medicines, improving health outcomes and ensuring the wise use of health care dollars. Through evidence- and value-based strategies and practices, the Academy's 8,000 pharmacists, physicians, nurses and other practitioners manage medication therapies for the 250 million Americans served by health plans, pharmacy benefit management firms, emerging care models and government. www.amcp.org .\nView original content with multimedia: http://www.prnewswire.com/news-releases/academy-of-managed-care-pharmacy-announces-new-president-elect-three-board-members-300579153.html\nSOURCE Academy of Managed Care Pharmacy", "external_links": ["http://www.amcp.org/", "http://www.prnewswire.com/news-releases/academy-of-managed-care-pharmacy-announces-new-president-elect-three-board-members-300579153.html"], "published": "2018-01-08T20:38:00.000+02:00", "crawled": "2018-01-08T21:04:00.023+02:00", "highlightTitle": ""}