{"organizations": [], "uuid": "09c561d4570884f671fe8920cd4ce3b901025efd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-wilan-subsidiary-acquires-patent-portfolio-from-panasonic.html", "country": "US", "domain_rank": 767, "title": "WiLAN Subsidiary Acquires Patent Portfolio from Panasonic", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T14:30:00.000+02:00", "replies_count": 0, "uuid": "09c561d4570884f671fe8920cd4ce3b901025efd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-wilan-subsidiary-acquires-patent-portfolio-from-panasonic.html", "ord_in_thread": 0, "title": "WiLAN Subsidiary Acquires Patent Portfolio from Panasonic", "locations": [], "entities": {"persons": [], "locations": [{"name": "panasonic ottawa", "sentiment": "none"}], "organizations": [{"name": "quarterhill inc.", "sentiment": "negative"}, {"name": "wi-lan inc.", "sentiment": "negative"}, {"name": "nand flash memory", "sentiment": "none"}, {"name": "cetus technologies, inc.", "sentiment": "none"}, {"name": "panasonic corporation", "sentiment": "none"}, {"name": "solid state drives", "sentiment": "none"}, {"name": "ihs markit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OTTAWA, Jan. 8, 2018 /PRNewswire/ - Wi-LAN Inc. (\"WiLAN\"), a Quarterhill Inc. (\"Quarterhill\") company (TSX: QTRH) (NASDAQ: QTRH), today announced that its wholly-owned subsidiary Cetus Technologies, Inc. has acquired a portfolio of patents from Panasonic Corporation.\nThe portfolio relates to semiconductor memory technologies used in Dynamic Random Access Memory (\"DRAM\") as well as NAND Flash Memory. DRAM is used in markets that include PCs, Gaming, Mobile Handsets, Servers, Networking and Automotive. NAND Flash Memory is used in markets that include Mobile Handsets, Solid State Drives, Flash Cards and USB Flash Drives.\nAccording to the information and analytics research firm IHS Markit, worldwide revenues in 2017 are expected to be $72.2 billion for the DRAM industry and $53.8 billion for the NAND Flash Memory industry.\nAll other terms of the agreement are confidential.\nAbout WiLAN\nWiLAN, a Quarterhill company, is one of the most successful patent licensing companies in the world and helps companies unlock the value of intellectual property by managing and licensing their patent portfolios. The company operates in a variety of markets including automotive, digital television, Internet, medical, semiconductor and wireless communication technologies. For more information: www.wilan.com .\nAbout Quarterhill\nQuarterhill is a diversified investment holding company focused on growing its business by acquiring technology companies in the Industrial Internet of Things segment across multiple verticals. Quarterhill targets companies with a broad range of products and services that capture, analyze and interpret data, and that have strong financial performance, excellent management teams, strong intellectual property underpinnings and significant opportunities to develop long-term recurring and growing revenue streams. For more information: www.quarterhill.com .\nForward-looking Information\nThis news release contains and forward-looking information within the meaning of the U.S. Private Securities Litigation Reform Act of 1995 and other United States and Canadian securities laws. Forward-looking statements and forward-looking information are based on estimates and assumptions made by Quarterhill in light of its experience and its perception of historical trends, current conditions, expected future developments and the expected effects of new business strategies, as well as other factors that Quarterhill believes are appropriate in the circumstances. Many factors could cause Quarterhill's actual performance or achievements to differ materially from those expressed or implied by the or forward-looking information. Such factors include, without limitation, the risks described in its February 10, 2017 annual information form for the year ended December 31, 2016 (the \"AIF\") and its November 9, 2017 Management's Discussion and Analysis of Financial Condition and Results of Operations for the 3 and 9 months ended September 30, 2017 and 2016 (the \"Q3 MD&A\"). Copies of the AIF and the Q3 MD&A may be obtained at www.sedar.com or www.sec.gov . Quarterhill recommends that readers review and consider all of these risk factors and notes that readers should not place undue reliance on any of Quarterhill's Quarterhill has no intention, and undertakes no obligation, to update or revise any or forward-looking information, whether as a result of new information, future events or otherwise, except as required by law.\nAll trademarks and brands mentioned in this release are the property of their respective owners.\nSOURCE Wi-LAN Inc.", "external_links": ["http://www.quarterhill.com/", "http://www.sec.gov/", "http://www.wilan.com/", "http://www.sedar.com/"], "published": "2018-01-08T14:30:00.000+02:00", "crawled": "2018-01-08T15:31:55.421+02:00", "highlightTitle": ""}