{"organizations": [], "uuid": "25dde4567e07e6ae2f836ab0bb5958e41db0eac1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-strava-names-stephanie-hannon-as-chief-product-officer.html", "country": "US", "domain_rank": 767, "title": "Strava Names Stephanie Hannon as Chief Product Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-04T22:02:00.000+02:00", "replies_count": 0, "uuid": "25dde4567e07e6ae2f836ab0bb5958e41db0eac1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-strava-names-stephanie-hannon-as-chief-product-officer.html", "ord_in_thread": 0, "title": "Strava Names Stephanie Hannon as Chief Product Officer", "locations": [], "entities": {"persons": [{"name": "stephanie hannon", "sentiment": "negative"}, {"name": "strava", "sentiment": "negative"}, {"name": "hillary", "sentiment": "none"}, {"name": "hannon", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "strava", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "cto", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO--(BUSINESS WIRE)-- Strava , the social network for athletes, names Stephanie Hannon as Chief Product Officer. Hannon, an ex-Googler who served as Chief Technology Officer on the Hillary for America campaign, joins Strava to lead the next chapter of the company’s product and platform expansion. As the first female CTO on a presidential campaign, she oversaw a team of engineers and developers that leveraged the digital world to connect with real-world voters.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180104006194/en/\nStrava Names Stephanie Hannon as Chief Product Officer (Photo: Business Wire)\nComing off the campaign trail, she looked for the right opportunity to channel her skills into a new cause that could have a broad, positive global impact. As a relatively recent convert to triathlons, Hannon understood the impact that getting physically active could have. Joining the team at Strava, which sits at the center of the connected fitness world, was a natural step.\n“Sport can be an empowering and unifying force in the world at a challenging moment in history,” said Hannon. “Becoming active and fit transformed my life--it made me a happier, healthier, more resilient person both physically and emotionally. Being part of a company that brings useful analytics, community and inspiration to tens of millions of athletes is easy to get excited about.”\nAt Google, Hannon led global teams while working from the United States, Australia and Switzerland. She launched Google Transit, helped grow Gmail from its early days to 100M users, built Google Wave, and brought Google Maps to most of Europe, the Middle East and Africa. Additionally, she heavily focused on creating technologies to connect people to their cities and the physical world including the General Transit Feed Specification, Public Alerts and Google Timeline. She also worked on early experiments with Google Now to increase civic engagement and participation with local elections and government. She will apply this deep technical experience to further the development of Strava Metro, which anonymizes and aggregates millions of activities uploaded to Strava every week and partners with departments of transportation, city planners and engineering firms to improve infrastructure for bicyclists and pedestrians.\n“Steph brings an ideal combination of technical fluency, insight-led product development and international exposure from some of the best organizations in the world,” said James Quarles, Strava CEO. “Her career has been defined by a commitment to social impact and we’re thrilled to tap her leadership in pursuit of Strava’s mission to build the most engaged community of athletes in the world.”\nThe Strava Platform supports 300+ compatible devices and more than 20,000 third-party apps. Strava recently demonstrated the vast reach of their global athletic community, which grows by one million new members every 40 days, with the unveiling of its Global Heatmap. The map visualizes more than 1.3 million activities a day from its community of athletes that span more than 31 activity types including running, climbing, cycling and backcountry skiing.\nAbout Strava\nStrava is the social network for athletes. Our mobile apps and website connect millions of active people every day. All athletes belong on Strava, no matter where they live, which sport they love or what device they use. Join the community at strava.com .\nOur favorite stats:\n16 activities uploaded every second, 11 million every week 300+ compatible mobile phones and GPS devices 140+ employees, most in San Francisco with more in Hanover and Bristol 1,100+ professional athletes are on Strava 1 million athletes join every 40 days 2.3 billion kudos given between athletes last year $7.99 a month to make the most of your sport with Premium, or $59.99 a year 100+ cities making commuting better with Strava Metro\nAbout Strava Metro\nStrava Metro makes riding, running and walking in cities better. Metro anonymizes and aggregates the millions of human-powered activities uploaded to Strava every week, then partners with departments of transportation, city planners and engineering firms to improve infrastructure for bicyclists and pedestrians.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104006194/en/\nMax Borges Agency for Strava\nMedia Contact:\nJen Squilla, 305-204-9291\nstrava@maxborgesagency.com\nSource: Strava", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.strava.com%2Fpress&esheet=51737889&lan=en-US&anchor=Strava&index=6&md5=6a0a8a27e1bd59aaa6f5b7a869ba4eee", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.strava.com%2Fathletes%2F98935&esheet=51737889&newsitemid=20180104006194&lan=en-US&anchor=Stephanie+Hannon&index=2&md5=e5a1e2b25bbd0947ed92dead919a783b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Flabs.strava.com%2Fheatmap%2F&esheet=51737889&newsitemid=20180104006194&lan=en-US&anchor=demonstrated&index=3&md5=baf8dea071b56bb4a9a6fc2d37685d0b", "http://www.businesswire.com/news/home/20180104006194/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fstrava.com%2F&esheet=51737889&newsitemid=20180104006194&lan=en-US&anchor=strava.com&index=4&md5=2bad0a5a2326ce5c0ccedc92934cb60b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.Strava.com&esheet=51737889&newsitemid=20180104006194&lan=en-US&anchor=Strava&index=1&md5=76e0a74346db6376ba9e8fe82be0e5b1", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.maxborgesagency.com%2F&esheet=51737889&lan=en-US&anchor=Max+Borges+Agency&index=5&md5=204319961f859f5f6eeb45f57fa98712"], "published": "2018-01-04T22:02:00.000+02:00", "crawled": "2018-01-04T22:53:40.001+02:00", "highlightTitle": ""}