{"organizations": [], "uuid": "b9a52f8db7957b7ca595122d4b163f9643bd6824", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews\r", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-cuba-canada/no-conclusions-on-cause-of-health-symptoms-at-embassy-in-cuba-canada-official-idUSKBN1EZ20X", "country": "US", "domain_rank": 408, "title": "No conclusions on cause of health symptoms at embassy in Cuba - Canada official", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T17:47:00.000+02:00", "replies_count": 0, "uuid": "b9a52f8db7957b7ca595122d4b163f9643bd6824"}, "author": "", "url": "https://www.reuters.com/article/us-cuba-canada/no-conclusions-on-cause-of-health-symptoms-at-embassy-in-cuba-canada-official-idUSKBN1EZ20X", "ord_in_thread": 0, "title": "No conclusions on cause of health symptoms at embassy in Cuba - Canada official", "locations": [], "entities": {"persons": [{"name": "chizu nomiyama", "sentiment": "none"}, {"name": "leah schnurrediting", "sentiment": "none"}], "locations": [{"name": "cuba", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "havana", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "u.s. state department", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  ottawa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OTTAWA (Reuters) - Canada has not been able to identify what is behind unusual health symptoms, such as nausea and nosebleeds, reported by some diplomatic personnel and their family members in Cuba, a senior Canadian government official said on Wednesday.\nThe U.S. State Department said in August Americans linked to its embassy in Cuba had experienced physical symptoms caused by unspecified “incidents” starting as far back as late 2016. On Tuesday, it said investigators were looking at a range of theories, including the possibility of a “viral” attack.\nCanadian personnel have reported symptoms, including headaches, that began last March, the official told reporters. While most of the cases were reported in May, two were reported in August and December 2017 when individuals said they felt waves of pressure.\nOf the 27 personnel and family members that received medical testing, eight were found to have been sickened and needed a follow-up. They have since returned to work or school, the official, who cannot be identified due to the sensitivity of the situation, said.\nSome had heard high-pitched sounds in their homes, though only one reported getting sick afterward. No-one has been hospitalized, the official said.\nSymptoms experienced by U.S. diplomats have included hearing loss and headaches.\nCuban officials have denied any involvement or any knowledge of what was behind the incidents.\nWhile Canada has not concluded that the symptoms are the result of an attack, no possibilities have been ruled out, the Canadian official said.\nThe staffing level of the embassy in Havana has been maintained, though three families have voluntarily returned to Canada since this summer, the official said.\nThe United States last year sharply reduced its embassy staff.\nIn August, an official said Canada was not automatically assuming that Cuba was behind an alleged “acoustic attack” against U.S. and Canadian personnel in Havana.\nCanada has generally enjoyed good relations with Cuba, even as the United States mounted a decades-long economic blockade against the country.\nReporting by Leah Schnurr; editing by Chizu Nomiyama, Jonathan Oatis and Susan Thomas\n ", "external_links": [], "published": "2018-01-10T17:47:00.000+02:00", "crawled": "2018-01-10T18:07:28.004+02:00", "highlightTitle": ""}