{"organizations": [], "uuid": "a41c31ed3d50a27d60e3a8536e817ed879ae87ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218896378&w=1200&r=LYNXMPEE010Y0", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-dairy-auction-results/dairy-prices-rise-as-dry-weather-crimps-nz-production-idUSKBN1ER1S3", "country": "US", "domain_rank": 408, "title": "Dairy prices rise as dry weather crimps NZ production", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.18, "site_type": "news", "published": "2018-01-03T05:49:00.000+02:00", "replies_count": 0, "uuid": "a41c31ed3d50a27d60e3a8536e817ed879ae87ef"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-dairy-auction-results/dairy-prices-rise-as-dry-weather-crimps-nz-production-idUSKBN1ER1S3", "ord_in_thread": 0, "title": "Dairy prices rise as dry weather crimps NZ production", "locations": [], "entities": {"persons": [{"name": "susan kilsby", "sentiment": "none"}], "locations": [{"name": "nz", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "agri hq", "sentiment": "none"}, {"name": "fonterra", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SYDNEY (Reuters) - International milk prices posted their sharpest rise since May on Wednesday, as supply tightened in the world’s largest exporter, New Zealand.\nThe Global Dairy Trade Price Index (GDT) gained 2.2 percent at the first auction of the year, after the world’s biggest dairy processor, Fonterra, dropped its forecast for NZ milk collection last week for the second time in as many months.\nThe average selling price was of $3,124 per tonne, with prices for whole milk powder - the most widely traded product - posting the strongest gain, 4.2 percent.\n“There’s a growing realization that it’s quite serious, the situation in New Zealand, and I think prices have reacted to that,” Susan Kilsby, dairy analyst at Agri HQ told Reuters.\n“It’s really dry right across New Zealand’s dairy regions, and that means lower pasture growth and subsequent low milk production.”\nFonterra last week said it expected the dry weather to persist, and cut its collection forecast for the 2017-2018 season by nearly 3 percent. [nL4N1OT21F]\nThe New Zealand milk co-operative, which is owned by about 10,500 farmers, controls nearly a third of the world dairy trade. It already announced last month it was cutting its forecast payout to farmers for the season by NZ$0.35 ($0.25) to NZ$6.40 per kg of milk solids. [nL3N1O63B7]\nSkim milk powder prices rose 1.6 percent, and butter prices rose for the first time since October.\nAuction results can affect the New Zealand dollar as the dairy sector generates more than 7 percent of the nation’s gross domestic product.\nThe currency hit a ten-week high of $0.7128 overnight, after the auction, though this was aided by a weakening U.S. dollar.\nThe GDT index had fallen 3.9 percent to a 15-monnth low at the previous sale, and had dropped in five of the last six auctions, according to GDT Events, which is owned by Fonterra and runs the sale independently of the dairy giant.\nA total of 25,400 tonnes was sold at the latest auction, falling 14.2 percent from the previous one, the auction platform said on its website.\nA number of companies, including Dairy America and Murray Goulburn, use the platform to sell milk powder and other dairy products, with roughly half of buyers based in China as traders there seek to supplement flagging domestic milk supplies.\nThe auctions are held twice a month, with the next one scheduled for Jan. 16.\nReporting by Tom Westbrook and Bangalore Commodities desk; Editing by Robin Pomeroy\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-03T05:49:00.000+02:00", "crawled": "2018-01-03T06:26:34.003+02:00", "highlightTitle": ""}