{"organizations": [], "uuid": "83173efe8547f79cb586e0dff7f0fbdfe5e20b3b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets/indices", "section_title": "Market Indices | Reuters.com", "url": "https://www.reuters.com/article/global-precious/precious-gold-rises-on-wobbly-dollar-stocks-surge-after-u-s-govt-shutdown-ends-idUSL4N1PI1HJ", "country": "US", "domain_rank": 408, "title": "PRECIOUS-Gold rises on wobbly dollar; stocks surge after U.S. govt shutdown ends", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.636, "site_type": "news", "published": "2018-01-23T12:56:00.000+02:00", "replies_count": 0, "uuid": "83173efe8547f79cb586e0dff7f0fbdfe5e20b3b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-precious/precious-gold-rises-on-wobbly-dollar-stocks-surge-after-u-s-govt-shutdown-ends-idUSL4N1PI1HJ", "ord_in_thread": 0, "title": "PRECIOUS-Gold rises on wobbly dollar; stocks surge after U.S. govt shutdown ends", "locations": [], "entities": {"persons": [{"name": "nithin thomasprasad", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "u.s. senate", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Spot gold looks neutral in $1,329-$1,341 range -technicals * Dollar index near three-year lows hit last week * Platinum off highest in more than four months, hit on Monday (Updates with comments, latest prices) By Nithin ThomasPrasad Jan 23 (Reuters) - Gold prices edged up on Tuesday as the dollar hovered around three-year lows, with a surge in global equities capping further gains after a U.S. government shutdown came to a halt. Gold was mostly unaffected by the shutdown in the previous session, trading in a tight range defined on the low end by safe-haven demand amid the U.S. government closure and on the high end by the resiliency of the wider financial markets. Spot gold rose 0.2 percent to $1,336.26 per ounce at 0447 GMT, up for a third straight session. U.S. gold futures for February delivery rose 0.3 percent to $1,336.00 per ounce. The U.S. Senate voted on Monday to pass a temporary spending plan through Feb. 8 to end the government shutdown. Equity markets have since gained, with Wall Street's main indexes surging to record highs. \"Gold can gain from here as there could be some correction in the equity markets and cryptocurrencies have started to fall again. We can see more investors coming into gold, which could be positive for prices,\" said Hareesh V., head of commodity research at Geojit Financial Services. \"2018 is more or less going to be positive for gold as well as silver.\" Bitcoin was up 1 percent at $10,915 on the Luxembourg-based Bitstamp exchange. Prices have nearly halved in value from their peak of almost $20,000 in December, with investors gripped by fears regulators could clamp down on the volatile currency. \"We think that gold is toppy here based on our notion that the dollar is quite oversold and likely due for a modest bounce in which case some of the length being accumulated in gold will likely be pared back,\" said INTL FCStone analyst Edward Meir. \"We still maintain a cautious view for gold over the short-term,\" Meir said. Spot gold looks neutral in a range of $1,329-$1,341 per ounce and an escape could suggest a direction, according to Reuters Technical analyst, Wang Tao. Meanwhile, the dollar index , against a basket of six major currencies, was down 0.1 percent at 90.347, not far from three-year lows hit last week. Platinum was nearly flat at $995.30 per ounce, down from over four-month highs touched in the previous session. In other precious metals, silver rose 0.1 percent to $17.03 per ounce. Palladium declined 0.2 percent to $1,095.99 per ounce. (Reporting by Nithin Prasad and Nallur Sethuraman in BENGALURU; Editing by Tom Hogue)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T12:56:00.000+02:00", "crawled": "2018-01-23T07:45:05.021+02:00", "highlightTitle": ""}