{"organizations": [], "uuid": "5058b1a75866d546fe1a9f9f1d1c6d7930d2dad9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 39, "shares": 39, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/16/104589400-GettyImages-697832156.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/09/stocks-making-the-biggest-moves-premarket-tgt-amzn-uaa-pypl-more.html", "country": "US", "domain_rank": 767, "title": "Stocks making the biggest moves premarket: TGT, AMZN, UAA, PYPL & more", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-09T15:57:00.000+02:00", "replies_count": 0, "uuid": "5058b1a75866d546fe1a9f9f1d1c6d7930d2dad9"}, "author": "Fred Imbert", "url": "https://www.cnbc.com/2018/01/09/stocks-making-the-biggest-moves-premarket-tgt-amzn-uaa-pypl-more.html", "ord_in_thread": 0, "title": "Stocks making the biggest moves premarket: TGT, AMZN, UAA, PYPL & more", "locations": [], "entities": {"persons": [{"name": "brent saunders", "sentiment": "none"}], "locations": [{"name": "susqueha", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "uaa", "sentiment": "negative"}, {"name": "amzn", "sentiment": "negative"}, {"name": "reebok", "sentiment": "none"}, {"name": "nike", "sentiment": "none"}, {"name": "piper jaffray", "sentiment": "none"}, {"name": "allergan", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Traders and financial professionals work on the floor of the New York Stock Exchange (NYSE). \nCheck out which companies are making headlines before the bell : \nUnder Armour — Analysts at Susquehanna downgraded the athletics apparel to \"negative\" from \"neutral,\" noting the Under Armour brand remains at risk. \"Given poor brand distribution decisions, we believe UAA risks are becoming more like Reebok than Nike,\" analysts said. \nTarget — Target shares popped more than 4 percent in the premarket after the retailer reported stronger-than-expected sales for the holiday season. Target also raised its full-year outlook. \nAmazon — Piper Jaffray hiked its price target on the e-commerce giant's stock to $1,400 from $1,200, representing a 12.3 percent upside from Monday's close. \"Looking at data on overall holiday retail spend in the U.S. vs. our estimated Amazon domestic holiday GMV [gross merchandise value] suggests only low-to-mid single digit penetration for the company. The conclusion is that Amazon … is arguably still in the early innings of its share-gain potential.\" \nAllergan — Allergan issued weaker-than-expected guidance for fiscal 2018. CEO Brent Saunders attributing the weak expectations to \"loss of exclusivity revenue headwinds in 2018.\" \nUrban Outfitters — Urban Outfitter's stock dropped nearly 5 percent before the bell on the back of disappointing holiday sales. \nSeagate Technology — The hardware technology company issued gross margin, revenue and shipment guidance that surpassed analyst expectations. Seagate shares got a 7.1 percent boost in the previous session on a report that the company invested in Ripple, which owns the cryptocurrency XRP. \nBerkshire Hathaway — Warren Buffett's conglomerate is set to take a $37 billion windfall from the recent tax-code overhaul. The boost results from Berkshire lowering its tax liability on appreciated investments, according to Barclays. \nIntel — Intel unveiled its first autonomous car at the CES expo in Las Vegas. The car is the first in its 100-vehicle test fleet. \nPayPal — Analysts at Cowen upgraded the payments platform's stock to \"outperform\" from \"market perform\" and raised their price target to $88 from $67. \"We believe most of the bear theses have not and will not play out … while PYPL's growth trajectory remains among the most compelling in the Payments space.\" \nAlibaba — Founder Jack Ma said Alibaba will \"seriously consider\" listing shares in the Hong Kong stock market.", "external_links": [], "published": "2018-01-09T15:57:00.000+02:00", "crawled": "2018-01-09T15:15:25.000+02:00", "highlightTitle": ""}