{"organizations": [], "uuid": "03eaeb361d67d3afe119393c91ffc993d3078af9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-cobraas-puerto-rico-contract-increased-to-approximately-445-million-update-on-puerto-rico-activities.html", "country": "US", "domain_rank": 767, "title": "Cobra’s Puerto Rico Contract Increased to Approximately $445 million; Update on Puerto Rico Activities", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T00:05:00.000+02:00", "replies_count": 0, "uuid": "03eaeb361d67d3afe119393c91ffc993d3078af9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-cobraas-puerto-rico-contract-increased-to-approximately-445-million-update-on-puerto-rico-activities.html", "ord_in_thread": 0, "title": "Cobra’s Puerto Rico Contract Increased to Approximately $445 million; Update on Puerto Rico Activities", "locations": [], "entities": {"persons": [], "locations": [{"name": "puerto rico activities oklahoma city", "sentiment": "none"}, {"name": "puerto rico", "sentiment": "none"}, {"name": "prepa", "sentiment": "none"}], "organizations": [{"name": "puerto rico contract increased", "sentiment": "negative"}, {"name": "mammoth energy services, inc.", "sentiment": "neutral"}, {"name": "cobra acquisitions llc", "sentiment": "none"}, {"name": "puerto rico electric power authority", "sentiment": "none"}, {"name": "usk", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OKLAHOMA CITY, Jan. 29, 2018 (GLOBE NEWSWIRE) -- Mammoth Energy Services, Inc. (“Mammoth”) (NASDAQ:TUSK) today announced that its wholly owned subsidiary, Cobra Acquisitions LLC (“Cobra”), has executed an amendment to its existing contract to assist in the restoration of the utility infrastructure on the island of Puerto Rico. In the amendment, the original $200 million award has been expanded to approximately $445 million.\nContract Increase\nOn January 28, 2018, the Puerto Rico Electric Power Authority (“PREPA”) and Cobra executed a contract amendment that expanded the aggregate contract amount by approximately $245 million to address work requirements. The original $200 million contract value was effective on October 19, 2017 and fully utilized during the fourth quarter of 2017 due to the substantially greater deployment of resources. This contract amendment allows for continued deployment of resources into 2018.\nUnder the terms of the amended contract, the number of skilled workers requested by PREPA and provided by Cobra has increased to at least 880, up from 434, and the billable daily rate of those workers has been decreased. A copy of the amendment will be filed as an exhibit to the Form 8-K that will be filed with the Securities and Exchange Commission (“SEC”) in conjunction with this release.\nArty Straehla, Mammoth's Chief Executive Officer, stated, “We are proud that through our team’s hard work and professionalism PREPA has elected to increase the value of our contract. Our team is working closely with PREPA, FEMA, the US Army Corps of Engineers and other governmental agencies and, together, we are making significant progress to restore power to the affected areas in an orderly fashion. Furthermore, at the request of PREPA, FEMA reviewed our original contract with PREPA and our rates of service. In a letter dated December 23, 2017, FEMA determined that PREPA awarded our contract in compliance with emergency procurement provisions of the Commonwealth of Puerto Rico and Executive Orders issued as a result of the disaster, and also determined the costs under the contract to be reasonable.”\nCobra Energy Progress\nCobra offers a full complement of infrastructure services and continues to expand from its initial base of operations in Kentucky and Texas and now operates across the majority of the Northeast, Southeast and Midwestern portions of the United States. The company has agreements in place with private utilities, public Investor Owned Utilities (IOUs), Co-Operative utilities (Co-Op) and PREPA.\nEarnings Release and Conference Call Schedule\nMammoth intends to release financial results for the fourth quarter and full year of 2017 after the market close on Wednesday, February 21, 2018. A conference call to discuss the results has been scheduled for the following day, Thursday, February 22, 2018, at 10:00 a.m. Central Time (11:00 a.m. Eastern Time).\nIndividuals wishing to participate in the conference call should dial (844) 265-1561 or (216) 562-0385 for international callers, and use the passcode 1276679. The conference call will also be webcast and can be found at www.mammothenergy.com in the \"Investors\" section of the company's website.\nAbout Mammoth Energy Services, Inc.\nMammoth is an integrated, growth-oriented energy service company serving companies engaged in the exploration and development of North American onshore unconventional oil and natural gas reserves and energy infrastructure. Mammoth’s suite of services and products include: pressure pumping services, electrical utility construction services, natural sand and proppant services, well services, contract and directional drilling services and other energy services.\nInvestor Contact:\nDon Crist – Director, Investor Relations\ndcrist@mammothenergy.com\n(405) 608-6048\nMedia Contact:\nAndy Wilson\nAndrew.wilson@edelman.com\n(917) 607-6601\nForward-Looking Statements and Cautionary Statements\nThis news release (and any oral statements made regarding the subjects of this release) contains certain statements and information that include “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. All statements, other than statements of historical facts, that address activities, events or developments that Mammoth expects, believes or anticipates will or may occur in the future are forward-looking statements. The words “anticipate,” “believe,” “ensure,” “expect,” “if,” “intend,” “plan,” “estimate,” “project,” “forecasts,” “predict,” “outlook,” “aim,” “will,” “could,” “should,” “potential,” “would,” “may,” “probable,” “likely” and similar expressions, and the negative thereof, are intended to identify forward-looking statements. Without limiting the generality of the foregoing, forward-looking statements contained in this news release may include statements, estimates and projections regarding Mammoth’s business outlook and plans, future financial position, liquidity and capital resources, operations, performance, including under Cobra utility infrastructure restoration contract in Puerto Rico, acquisitions, returns, capital expenditure budgets, costs and other guidance regarding future developments. Forward-looking statements are not assurances of future performance. These forward-looking statements are based on management’s current expectations and beliefs, forecasts for Mammoth’s existing operations, experience and perception of historical trends, current conditions, anticipated future developments and their effect on Mammoth, and other factors believed to be appropriate. Although management believes that the expectations and assumptions reflected in these forward-looking statements are reasonable as and when made, no assurance can be given that these assumptions are accurate or that any of these expectations will be achieved (in full or at all). Moreover, these forward-looking statements are subject to significant risks and uncertainties, including those described in Mammoth’s Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and other filings Mammoth makes with the Securities and Exchange Commission, which may cause actual results to differ materially from its historical experience and present expectations or projections which are implied or expressed by the forward-looking statements. Important factors that could cause actual results to differ materially from those in the forward-looking statements include, but are not limited to: the failure to receive or delays in receiving governmental authorizations, approvals and/or payments; risks relating to economic conditions; delays in or failure of delivery of current or future orders of specialized equipment; the loss of or interruption in operations of one or more key suppliers or customers; the effects of government regulation, permitting and other legal requirements; operating risks; the adequacy of our capital resources and liquidity; weather; natural disasters; litigation; competition in the energy industry; and costs and availability of resources.\nReaders are cautioned not to place undue reliance on any forward-looking statement which speaks only as of the date on which such statement is made. Mammoth undertakes no obligation to correct, revise or update any forward-looking statement after the date such statement is made, whether as a result of new information, future events or otherwise, except as required by applicable law .\nSource:Mammoth Energy Services, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=A7rxKRs2L1az-dJALlHAvxlaobD7Hu228KXu8CwIOSxmHyJxxIQliUYiYWvneiPzW-M2Wmau68tBpdMigEldJV_eFjmsGlnIY0pFU8hbDR0=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/f045cdb2-0301-4077-b74c-8462d6d05433"], "published": "2018-01-30T00:05:00.000+02:00", "crawled": "2018-01-30T01:32:25.009+02:00", "highlightTitle": ""}