{"organizations": [], "uuid": "79773e2b2f90a0d10448882cbe9812e523e8c6a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223433463&w=1200&r=LYNXMPEE0I1MF", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-fed-williams/feds-williams-citing-tailwinds-says-u-s-economy-well-situated-idUSKBN1F82DL", "country": "US", "domain_rank": 408, "title": "Fed's Williams says three rate hikes 'good starting point'", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-20T02:56:00.000+02:00", "replies_count": 0, "uuid": "79773e2b2f90a0d10448882cbe9812e523e8c6a3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-fed-williams/feds-williams-citing-tailwinds-says-u-s-economy-well-situated-idUSKBN1F82DL", "ord_in_thread": 0, "title": "Fed's Williams says three rate hikes 'good starting point'", "locations": [], "entities": {"persons": [{"name": "williams", "sentiment": "negative"}, {"name": "jerome powell", "sentiment": "none"}, {"name": "john williams", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "fed", "sentiment": "negative"}, {"name": "federal reserve", "sentiment": "negative"}, {"name": "fed board", "sentiment": "none"}, {"name": "bay area council economic institute", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "san francisco federal reserve bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO (Reuters) - The Federal Reserve should continue to raise rates at a gradual pace during 2018, San Francisco Federal Reserve Bank President John Williams said on Friday, saying he expects the recent tax cuts and other tailwinds to boost economic growth this year.\n“Right now my base case is that three rate increases for 2018 seems like a good starting point.” Williams told reporters after a talk at the Bay Area Council Economic Institute, adding, “That’s not something that’s locked in.”\nWhile there are no signs in the wage or price data of an incipient surge in inflation, he said, “there are clearly signs… the economy does better than I expect,” but any increase in the rate-hike pace in response would be slight.\n“I am not really worried about throwing us off the gradual rate (increases),” he said. “It could be a little bit quicker pace of increases, somewhat quicker, but I don’t see any kind of game-changing shift in strategy.”\nWilliams is under consideration by the White House for the No. 2 spot at the Washington-based Fed Board under incoming Fed Chair Jerome Powell, the Wall Street Journal and the Financial Times reported this week.\nFILE PHOTO - San Francisco Federal Reserve President John Williams speaks to Reuters in San Francisco, California, U.S. on September 27, 2016. REUTERS/Stephen Lam/File Photo On Friday, Williams declined to comment, saying that the decision is up to the president of the United States. “I am not going to speculate on what will happen there,” he said somewhat tersely. “I’ll just leave it at that.”\nThe position would give Williams increased influence on U.S. monetary policymaking. He is a disciple of current Fed Chair Janet Yellen who ran the San Francisco Fed before she took the Fed Vice Chair job in 2010 and handed the reins at the regional Fed bank to Williams.\nSan Francisco Federal Reserve President John Williams poses for a photo at the Federal Reserve Bank of San Francisco, California, U.S., January 19, 2018. REUTERS/Ann Saphir Williams has been a key intellectual driver of a shift within the Fed toward expecting lower interest rates over the long-term for the U.S. economy, reflecting a slower rate of long-run economic growth than in the past. Trump has made faster long-run growth a central promise of his administration.\nWilliams said Friday that Powell would deliver “continuity” at the Fed, which he said is generally an institution uncomfortable with change.\nWilliams forecast the U.S. economy to grow at about 2.25 percent to 2.5 percent, fast enough to push the U.S. unemployment rate, now at 4.1 percent, to about 3.7 percent by the end of the year. He also said he expects inflation to rise to the Fed’s 2-percent goal over the next two years.\nReporting by Ann Saphir; Editing by Chizu Nomiyama\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-20T02:56:00.000+02:00", "crawled": "2018-01-19T22:37:14.000+02:00", "highlightTitle": ""}