{"organizations": [], "uuid": "499c620b9063169363d7846f3f14ca3a5c1947f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-markets/global-markets-asia-stocks-set-record-highs-us-govt-funding-woes-weigh-on-dollar-idUSL3N1PE1GF", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Asia stocks set record highs, US govt funding woes weigh on dollar", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T05:11:00.000+02:00", "replies_count": 0, "uuid": "499c620b9063169363d7846f3f14ca3a5c1947f1"}, "author": "", "url": "https://www.reuters.com/article/global-markets/global-markets-asia-stocks-set-record-highs-us-govt-funding-woes-weigh-on-dollar-idUSL3N1PE1GF", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Asia stocks set record highs, US govt funding woes weigh on dollar", "locations": [], "entities": {"persons": [{"name": "shinichi saoshiro", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* MSCI Asia-Pacific index and Nikkei both up 0.3 pct\n* Asia stocks stretch gains but stalling Wall St caps rise\n* Worries over possible US government shutdown weigh on dollar\n* US lawmakers try to cobble together deal to avert shutdown\n* Uptick in U.S. production drags crude prices down\nBy Shinichi Saoshiro\nTOKYO, Jan 19 (Reuters) - Asia stocks edged up to record highs on Friday, although losses on Wall Street slowed the advance, while worries over a possible U.S. government shutdown weighed on the dollar.\nMSCI’s broadest index of Asia-Pacific shares outside Japan added 0.3 percent to a record top. The index had climbed 1.2 percent on the week, during which it rode a surge in global equities.\nOptimism over the global economic growth outlook and improved corporate earnings have helped share markets rally at the start of 2018. Supporting economic confidence was data on Thursday that showed China’s growth in 2017 accelerated for the first time in seven years.\nAustralian stocks dipped 0.1 percent, South Korea’s KOSPI was flat and Japan’s Nikkei rose 0.3 percent. Shanghai advanced 0.5 percent.\n“We are likely to see equity markets go through temporary adjustment phases. But in the longer term, it looks to be a good year for global markets,” said Soichiro Monji, chief strategist at Daiwa SB Investments in Tokyo.\n“It is no longer about other markets following gains by U.S. equities. Fundamentals are strong globally, backed by major positive changes, such as the digital revolution we are currently witnessing,” he said.\nWall Street fell on Thursday as losses in industrials and interest-rate sensitive sectors offset marginal gains in tech stocks. The Dow slipped 0.37 percent, dipping from record highs.\nAgainst the yen, the dollar was 0.1 percent lower at 111.015 . It rose to 111.480 on Thursday before slipping on concerns over a possible U.S. government shutdown as lawmakers struggled to cobble a federal budget deal.\nThe focus was on whether lawmakers can reach at least a temporary agreement to fund government operations by a deadline on Friday.\nThe U.S. House of Representatives on Thursday passed a bill to fund government operations through Feb. 16 and avoid agency shutdowns this weekend when existing funding expires. But the bill must be approved by the Senate, where it faces an uncertain future.\n“There is a good chance the negotiations will take place until the last minute and keep the dollar on the defensive. That said, both the Republicans and Democrats want to avert a shutdown, especially with the U.S. midterm elections looming,” said Masafumi Yamamoto, chief forex strategist at Mizuho Securities in Tokyo.\nThe euro was steady at $1.2243 after gaining about 0.45 percent overnight.\nThe common currency advanced to a three-year peak above $1.2300 earlier this week on expectations that the European Central Bank would take steps towards winding back on stimulus measures to normalise monetary policy. The euro’s rally was tempered later as some ECB officials voiced worries about the currency’s strength.\nThe dollar index against a basket of six major currencies was flat at 90.502. It had fallen to a three-year trough of 90.113 on Thursday and was poised to lose 0.5 percent on the week.\nChina’s yuan breached the psychologically important 6.4 dollar level for the first time in more than two years.\nThe Australian dollar rose 0.15 percent to $0.8012, crawling back toward a four-month high of $0.8023 set on Wednesday and the New Zealand dollar was little changed at $0.7298.\nBrent crude futures lost 1.2 percent to $68.44 per barrel following data showing an uptick in U.S. production. U.S. crude oil futures slipped 1.5 percent to $63.00 per barrel.\nU.S. crude soared to a three-year peak near $65.00 on Tuesday, supported by supply cuts led by the Organization of the Petroleum Exporting Countries and a weaker dollar. But the advance has stalled as the market remains wary that output cuts will eventually trigger price hikes and lead to increased supply from shale-rich United States.\nSpot gold nudged up 0.15 percent to $1,329.38 an ounce as the dollar eased. The precious metal had risen to a four-month top of $1,344.43 on Monday on the back of the dollar’s sharp downturn. (Reporting by Shinichi Saoshiro; Editing by Sam Holmes and Richard Borsuk)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-19T05:11:00.000+02:00", "crawled": "2018-01-19T08:02:47.008+02:00", "highlightTitle": ""}