{"organizations": [], "uuid": "4d647ce08e9acffa173ab892c0a7cd27c1f42f09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219386108&w=1200&r=LYNXMPEE0318S", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-golf-woods/golf-tiger-to-start-2018-campaign-at-farmers-insurance-open-idUKKBN1ET24K", "country": "US", "domain_rank": 408, "title": "Golf - Tiger to start 2018 campaign at Farmers Insurance Open", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T20:19:00.000+02:00", "replies_count": 0, "uuid": "4d647ce08e9acffa173ab892c0a7cd27c1f42f09"}, "author": "", "url": "https://uk.reuters.com/article/uk-golf-woods/golf-tiger-to-start-2018-campaign-at-farmers-insurance-open-idUKKBN1ET24K", "ord_in_thread": 0, "title": "Golf - Tiger to start 2018 campaign at Farmers Insurance Open", "locations": [], "entities": {"persons": [{"name": "woods", "sentiment": "none"}, {"name": "tiger woods", "sentiment": "none"}], "locations": [{"name": "antalya", "sentiment": "none"}, {"name": "riviera", "sentiment": "none"}, {"name": "san diego", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "farmers insurance open", "sentiment": "none"}, {"name": "tiger woods foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 6:23 PM / Updated 30 minutes ago Golf - Tiger to start 2018 campaign at Farmers Insurance Open Reuters Staff 2 Min Read \n(Reuters) - Former world number one Tiger Woods will make his much-anticipated 2018 debut at this month’s Farmers Insurance Open in San Diego, his first official PGA Tour event since missing the cut at the same tournament last year. Tiger Woods of the U.S. tees off on the eighth hole during the third round of the inaugural Turkish Airlines Open in the southwest city of Antalya November 9, 2013. REUTERS/Umit Bektas/File Photo Picture Supplied by Action Images \nWoods, who returned to competition last month in an 18-man exhibition after a near 10-month layoff during which he had spinal fusion surgery, will also play the Feb. 15-18 Genesis Open at Riviera, which is run by the Tiger Woods Foundation. \n“I‘m very excited to be back at Riviera,” Woods, 42, said in a statement on his website on Thursday. \n”I haven’t played at Riviera in a tournament in a very long time. To be able to play in an event that I used to come to as an amateur, as a junior and now as the tournament host, that is on one of the most historic sites in all of golf, it’s a dream come true.” \nThe American 14-times major champion swung freely and with no sign of back pain at last month’s Hero World Challenge, where he began his latest comeback and finished tied for ninth in a field including eight of the world’s top 10 golfers. \nAfter that event Woods was vague when asked about his plans for 2018, saying only that he would set his playing schedule around building up toward the golf’s four major tournaments. \nHe will no doubt feel very comfortable when he tees it up at Torrey Pines, having won the event seven times. It is also the venue where he won the 2008 U.S. Open for the most recent of his 14 major titles. \nWoods fell flat in his PGA Tour return at the 2017 Farmers Insurance Open where he missed the cut by four shots. He then played the European Tour’s Dubai Desert Classic and withdrew with back spasms after an opening-round 77. \nThe Farmers Insurance Open begins on Jan. 25 at Torrey Pines. Reporting by Frank Pingue, editing by Ed Osmond", "external_links": [], "published": "2018-01-04T20:19:00.000+02:00", "crawled": "2018-01-04T20:34:51.006+02:00", "highlightTitle": ""}