{"organizations": [], "uuid": "b580c2002c548683629eec5d4f74ff5d4842df41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-heron-resources-announces-december-2017-quarterly-update-on-the-woodlawn-zinc-copper-project.html", "country": "US", "domain_rank": 767, "title": "Heron Resources Announces December 2017 Quarterly Update on the Woodlawn Zinc-Copper Project", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T15:55:00.000+02:00", "replies_count": 0, "uuid": "b580c2002c548683629eec5d4f74ff5d4842df41"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-heron-resources-announces-december-2017-quarterly-update-on-the-woodlawn-zinc-copper-project.html", "ord_in_thread": 0, "title": "Heron Resources Announces December 2017 Quarterly Update on the Woodlawn Zinc-Copper Project", "locations": [], "entities": {"persons": [], "locations": [{"name": "woodlawn zinc-copper project sydney", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "heron resources", "sentiment": "negative"}, {"name": "sedar", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "epc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sydney, Australia, Jan. 30, 2018 (GLOBE NEWSWIRE) -- January 30, 2018 – Sydney, Australia – Heron Resources Ltd. (TSX: HER; ASX: HRR) (\"Heron\" or the \"Company\") announces its quarterly activities for the three months ended December 31, 2017. Details of the Company's results are contained in the filing “Heron Resources Limited Quarterly Report December 2017” which is available on SEDAR at www.sedar.com and the Company's website www.heronresources.com.au\nDecember Quarter 2017 Highlights\nWoodlawn Zinc-Copper Project\nEarthworks – significant works completed over the process plant area, ROM pad, site access road and administration areas. Works commenced on Tailings Storage Facility 4, box-cut and haul road construction EPC – engineering design is 50% completed and procurement 30%. Civil works are scheduled to start in the current quarter Project Schedule – the project critical path schedule remains on track and on budget Underground Mining Contract – discussion are well advanced with award expected in the current quarter Port Contract – discussions are well advance and award is expected in the current quarter Operational Readiness – recruitment continues with a focus on the operational superintendents with a number of appointments expected in the current quarter\nWoodlawn Exploration\nMineral Resource Increase: Shallow G2 Mineral Resource was calculated with majority categorised as higher-confidence Indicated Mineral Resource for incorporation into the mining schedule Global underground Mineral Resource revised with a 12% increase in total Measured & Indicated tonnes Woodlawn Regional Exploration: Currawang - Down-hole electromagnetic (DHEM) surveys identified a number of significant off-hole conductors Peelwood - base-metal camp was acquired through tenement applications, which includes the area covering the previously reported JORC 2004 Mineral Resources and Ore Reserves Kangiara - RAB drilling program (41 holes for 639 m) completed with assays pending\nCorporate\nBoard of Directors – Dr Ian Pattison was appointed to the Heron Board as a Non-Executive Director Cash – A$109M unrestricted cash as at 31 December 2018 A$1.9M received for Heron’s Ardea Resources Loyalty options A$1.8M received as Heron’s 2017 R&D concession Debt – US$60M senior secured facility and US$16M silver prepayment facility remain undrawn Consolidation – the Company consolidated its listed and unlisted securities on a 1 for 10 basis\nWoodlawn Zinc-Copper Project\nHeron’s primary development project is the high-grade Woodlawn Zinc-Copper Project located 250km southwest of Sydney, New South Wales. The project consists of both a high-grade underground and a large medium grade tailings resource. The development approach envisages the construction of a single 1.5Mtpa processing plant capable of treating material from both sources. Planned production will see the generation of three separate base metal concentrates (zinc, copper and lead) with associated precious metal credits. In addition, the project is very well supported by excellent infrastructure, an existing mining lease and state government development approvals.\nWoodlawn is expected to become an important Australian near-term zinc producer delivering concentrates into a market with strong supply and demand fundamentals underpinning a strong commodity price.\nAbout Heron Resources\nHeron’s primary focus is the development of its 100% owned, high grade Woodlawn Zinc-Copper Project located 250km southwest of Sydney, New South Wales, Australia. In addition, the Company has a significant high quality, gold and base metal tenement holding in New South Wales and Western Australia.\nZinc equivalent calculation – Woodlawn\nThe zinc equivalent ZnEq calculation takes into account, mining costs, milling costs, recoveries, payability (including transport and refining charges) and metal prices in generating a Zinc equivalent value for Au, Ag, Cu, Pb and Zn. ZnEq = Zn%+Cu%*3.12+Pb%*0.81+*Au g/t*0.86+Ag g/t*0.03. Metal prices used in the calculation are: Zn US$2,300/t, Pb US$ 2,050/t, Cu US$6,600/t, Au US$1,250/oz and Ag US$18/oz. These metal prices are based on Heron’s long-term view on average metal prices. It is Heron’s view that all the metals within this formula are expected to be recovered and sold. Metallurgical metal recoveries used for the formula are: 88% Zn, 70% Pb, 70% Cu, 33% Au and 82% Ag; these are based on historical recoveries at Woodlawn and supported by metallurgical testwork undertaken during the 2015-16 feasibility study. Commodity prices and metallurgical recoveries are factored into the zinc equivalent calculation using a standard metal equivalent formula.\nCAUTIONARY NOTE REGARDING FORWARD-LOOKING INFORMATION\nThis news release contains forward-looking statements and forward-looking information within the meaning of applicable Canadian securities laws, which are based on expectations, estimates and projections as of the date of this news release. This forward-looking information includes, or may be based upon, without limitation, estimates, forecasts and statements as to management’s expectations with respect to, among other things, the timing and amount of funding required to execute the Company’s exploration, development and business plans, capital and exploration expenditures, the effect on the Company of any changes to existing legislation or policy, government regulation of mining operations, the length of time required to obtain permits, certifications and approvals, the success of exploration, development and mining activities, the geology of the Company’s properties, environmental risks, the availability of labour, the focus of the Company in the future, demand and market outlook for precious metals and the prices thereof, progress in development of mineral properties, the Company’s ability to raise funding privately or on a public market in the future, the Company’s future growth, results of operations, performance, and business prospects and opportunities. Wherever possible, words such as “anticipate”, “believe”, “expect”, “intend”, “may” and similar expressions have been used to identify such forward-looking information. Forward-looking information is based on the opinions and estimates of management at the date the information is given, and on information available to management at such time. Forward-looking information involves significant risks, uncertainties, assumptions and other factors that could cause actual results, performance or achievements to differ materially from the results discussed or implied in the forward-looking information. These factors, including, but not limited to, the ability to implement the Woodlawn Zinc-Copper Project Feasibility Study on time or at all, fluctuations in currency markets, fluctuations in commodity prices, the ability of the Company to access sufficient capital on favourable terms or at all, changes in national and local government legislation, taxation, controls, regulations, political or economic developments in Canada, Australia or other countries in which the Company does business or may carry on business in the future, operational or technical difficulties in connection with exploration or development activities, employee relations, the speculative nature of mineral exploration and development, obtaining necessary licenses and permits, diminishing quantities and grades of mineral reserves, contests over title to properties, especially title to undeveloped properties, the inherent risks involved in the exploration and development of mineral properties, the uncertainties involved in interpreting drill results and other geological data, environmental hazards, industrial accidents, unusual or unexpected formations, pressures, cave-ins and flooding, limitations of insurance coverage and the possibility of project cost overruns or unanticipated costs and expenses, and should be considered carefully. Many of these uncertainties and contingencies can affect the Company’s actual results and could cause actual results to differ materially from those expressed or implied in any forward-looking statements made by, or on behalf of, the Company. Prospective investors should not place undue reliance on any forward-looking information. Although the forward-looking information contained in this news release is based upon what management believes, or believed at the time, to be reasonable assumptions, the Company cannot assure prospective purchasers that actual results will be consistent with such forward-looking information, as there may be other factors that cause results not to be as anticipated, estimated or intended, and neither the Company nor any other person assumes responsibility for the accuracy and completeness of any such forward-looking information. The Company does not undertake, and assumes no obligation, to update or revise any such forward-looking statements or forward-looking information contained herein to reflect new events or circumstances, except as may be required by law.\nNo stock exchange, regulation services provider, securities commission or other regulatory authority has approved or disapproved the information contained in this news release.\nFOR FURTHER INFORMATION, CONTACT: Australia: Mr Wayne Taylor Managing Director and Chief Executive Officer Tel: +61 2 9119 8111 or +61 8 6500 9200 Email: heron@heronresources.com.au Canada: Tel: +1 647 862 1157 (Toronto) cmuir@heronresources.com.au www.heronresources.com.au\nSource: Heron Resources Limited", "external_links": [], "published": "2018-01-30T15:55:00.000+02:00", "crawled": "2018-01-30T17:46:26.013+02:00", "highlightTitle": ""}