{"organizations": [], "uuid": "210be36b71fee16f4afff8bd98dd51aeb7649c07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/subjects/aerospace-and-defense", "section_title": "Aerospace and Defense | Reuters.com", "url": "https://www.reuters.com/article/us-germany-wages/german-industrial-workers-stage-strikes-in-pay-dispute-idUSKBN1EX0RL", "country": "US", "domain_rank": 408, "title": "German industrial workers stage strikes in pay dispute", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T17:58:00.000+02:00", "replies_count": 0, "uuid": "210be36b71fee16f4afff8bd98dd51aeb7649c07"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-germany-wages/german-industrial-workers-stage-strikes-in-pay-dispute-idUSKBN1EX0RL", "ord_in_thread": 0, "title": "German industrial workers stage strikes in pay dispute", "locations": [], "entities": {"persons": [{"name": "knut giesler", "sentiment": "none"}], "locations": [{"name": "duesseldorf", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "north rhine-westphalia", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "kirchhoff", "sentiment": "none"}, {"name": "claas", "sentiment": "none"}, {"name": "otis", "sentiment": "none"}, {"name": "ig metall", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 9:58 AM / Updated an hour ago German industrial workers stage strikes in pay dispute Reuters Staff 3 Min Read \nDUESSELDORF, Germany (Reuters) - German industrial workers staged strikes at metals and engineering firms on Monday in support of wage claims by union IG Metall, which announced a further wave of walkouts for Tuesday. \nWith the economy in robust health and unemployment at record lows, the country’s biggest union is demanding an inflation-busting 6 percent pay hike this year for about 3.9 million workers, as well as a shorter working week. \nAhead of regional negotiations due to begin on Thursday, employers have so far offered 2 percent plus a one-off 200 euro ($240) payment in the first quarter. \nOn Monday, more than 3,000 employees downed tools at sports car maker Porsche in Stuttgart, and around 400 at elevator maker OTIS in Berlin were expected to do likewise. \nNight shift workers at automotive supplier Kirchhoff in the industrial heartland state of North Rhine-Westphalia also walked out, as did staff at farming machinery maker Claas, the union said. \n“The employers provoked these warning strikes with their behavior at the negotiating table,” Knut Giesler, head of IG Metall in North Rhine-Westphalia, said. \nIn the state, also Germany’s most populous, IG Metall has called for stoppages at 143 companies on Tuesday, including Lumileds, the LED components and car lighting business formerly owned by Philips ( PHG.AS ), and Thyssenkrupp ( TKAG.DE ) unit Rothe Erde in Dortmund. \nIndustrial action is also scheduled to the south in Bavaria, home to premium carmaker BMW ( BMWG.DE ) and engineering group Siemens ( SIEGn.DE ), where the union is threatening to shift from short warning strikes lasting only a few hours to full-day stoppages. \nThe dispute follows a strong year of growth in Europe’s largest economy, driven by domestic demand from record numbers of German workers while borrowing costs and inflation remain low and exporters benefit from a global recovery. \nThat pattern should extend through 2018, with the Ifo economic institute last month forecasting growth of 2.6 percent for the year. \nTalks between unions and employers’ associations are set for Thursday in the state of Baden-Wuerttemberg, where Volkswagen’s ( VOWG_p.DE ) Porsche, Mercedes-Benz maker Daimler ( DAIGn.DE ) and automotive suppliers including Bosch [ROBG.UL] are based. \nIn Bavaria, negotiations will resume on Jan. 15, and in North Rhine-Westphalia on Jan. 18. \nThe latter state’s sector employers’ association, Metall NRW, said the strikes risked damaging Germany industrial companies’ reputation as reliable suppliers. \n“I expect the union to take action at the negotiating table and not out in the streets,” Metall NRW director Luitwin Mallmann said in a statement. \n(This story corrects seventh paragraph to show Philips is no longer the owner of Lumileds.) Reporting by Matthias Inverardi; Additional reporting by Jan Schwartz, Alexander Huebner, Jan Schwartz, Ilona Wissenbach; Writing by Maria Sheahan; Editing by Jane Merriman and John Stonestreet", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T17:58:00.000+02:00", "crawled": "2018-01-08T14:09:33.000+02:00", "highlightTitle": ""}