{"organizations": [], "uuid": "015beb635f8d6118d91374cf17c6836fa26939cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/usa-trade-tariffs-southkorea/update-1-s-korea-says-to-complain-to-wto-about-u-s-tariffs-on-washing-machines-solar-panels-idUSL4N1PI1AV", "country": "US", "domain_rank": 408, "title": "UPDATE 2-S.Korea, China look for WTO support over U.S. tariffs on washing machines, solar cells", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T07:01:00.000+02:00", "replies_count": 0, "uuid": "015beb635f8d6118d91374cf17c6836fa26939cb"}, "author": "", "url": "https://www.reuters.com/article/usa-trade-tariffs-southkorea/update-1-s-korea-says-to-complain-to-wto-about-u-s-tariffs-on-washing-machines-solar-panels-idUSL4N1PI1AV", "ord_in_thread": 0, "title": "UPDATE 2-S.Korea, China look for WTO support over U.S. tariffs on washing machines, solar cells", "locations": [], "entities": {"persons": [{"name": "hyunjoo jin", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "kim hyun-chong", "sentiment": "none"}, {"name": "ju-min park", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "korea", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}], "organizations": [{"name": "wto", "sentiment": "negative"}, {"name": "lg electronics", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "world trade organization", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "samsung electronics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* U.S. slaps tariffs on washing machines, solar panels\n* South Korea, China to look for support from WTO members\n* Economists see risk of further moves, global trade damage\n* LG Electronics shares end up 0.5 pct after earlier fall\n* Samsung Electronics up 1.9 pct in line with S.Korea market (Adds European Commission and other European reaction)\nBy Ju-min Park and Stella Qiu\nSEOUL/BEIJING, Jan 23 (Reuters) - China and South Korea condemned steep import tariffs on washing machines and solar panels imposed by U.S. President Donald Trump, with Seoul set to complain to the World Trade Organization (WTO) over the “excessive” move.\nEurope also said on Tuesday it regretted the U.S. decision and would react “firmly and proportionately” if EU exports were hit by the tariffs, which Asia fears could be be the start of greater protectionism and stall a revival in global trade.\nTrump’s actions on trade during his first year had been less alarming than many outside the United States had feared, but Louis Kuijs, head of Asia economics at consultancy Oxford Economics in Hong Kong, said this may now be changing.\n“This could very well be just one step of many,” he said, adding that steel and aluminium were also on Washington’s list.\nEconomists still believe the United States will avoid taking measures that could impact U.S. companies global supply chains, particularly for cars and electronics. But the tariffs on washing machines will deal a heavy blow to South Korea’s Samsung Electronics and LG Electronics.\nTogether they ship between 2.5 million to 3 million washing machines annually to the United States, with sales of around $1 billion, and they hold a quarter of a U.S. market dominated by Whirlpool and General Electric Co .\n“It is clear that the latest safeguard measures would violate the WTO rules,” South Korea’s trade minister Kim Hyun-chong said in a meeting with industry officials. “We will actively respond to protectionist measures.”\nChina, the world’s biggest solar panel producer branded the move an “overreaction” and said it would work with other WTO members to protect its interests.\n“The U.S.’s decision ... is an abuse of trade remedy measures, and China expresses strong dissatisfaction regarding this,” Wang Hejun, the head of the commerce ministry’s Trade Remedy and Investigation Bureau, said in a statement.\nThe European Commission said it regretted the measures, had serious doubts that they met WTO conditions and would not hesitate to react if they harmed European Union exports.\nGerman Finance Minister Peter Altmaier told reporters in Brussels that the EU opposed protectionism and said that the measures would make products more expensive for Americans.\nChina’s Ministry of Industry and Information Technology (MIIT) said that the outlook for solar firms’ expansion overseas was not good because of protectionist sentiment, and that China was encouraging firms to build factories overseas.\nOther U.S. trading partners were also quick to react, with Mexico saying it would use legal means to ensure Washington met international obligations, pointing to compensation envisaged under the North American Free Trade Agreement.\nIndia has recently re-opened a U.S. dispute, alleging Washington has failed to comply with a ruling on solar power, while Vietnam has challenged U.S. anti-dumping measures against exports of fish fillets.\n“SECURITY AND TRADE LINKED”\nThe decisions in the two “Section 201” safeguard cases for washing machines and solar cells came after the U.S. International Trade Commission (ITC) found imports were “a substantial cause of serious injury to domestic manufacturers”.\nThe tariffs on washing machines exceeded the harshest recommendations from ITC members, while the solar tariffs were lower than domestic producers had hoped for.\nTrump ignored an ITC recommendation to exclude South Korean-produced washing machines from LG, with Washington set to impose a 20 percent tariff on the first 1.2 million imported large residential washers in the first year, and a 50 percent tariff on additional imports.\nThe tariffs fall to 16 percent, and 40 percent, respectively, in the third year.\nA 30 percent tariff will be imposed on imported solar cells and modules in the first year, declining to 15 percent by the fourth year. The measure allows 2.5 gigawatts of unassembled solar cells to be imported tariff-free in each year.\n“Last year, we thought nothing would happen, but now China should not have any illusion about it. If the U.S is using Section 201 to hit you, they will hit hard,” said Zhang Yi, chief economist at Capital Securities in Beijing.\nSome analysts in Seoul believed Trump was stepping up pressure on the Asian ally to rely more on him when dealing with North Korea, while gaining leverage renegotiating a bilateral free trade pact he has previously labeled “horrible”.\n“Security and trade are linked to each other under Trump,” said Choi Won-mog, an international trade law expert at Ewha University.\nA WTO filing published on Jan. 12 showed Seoul had already sought authorisation to impose annual trade sanctions worth at least $711 million on the United States, in response to the dispute over washing machines.\nSouth Korea also asked for permission to impose an open-ended amount of trade sanctions if Washington broke the same rules again on other products.\nSeoul has already demanded compensation because the United States missed a Dec. 26 deadline to comply with a ruling against duties of up to 82 percent it had imposed on appliances made by Samsung Electronics, LG Electronics and Daewoo Electronics.\nSamsung Electronics and LG Electronics expressed concern over the tariffs, saying they would hit U.S. consumers and jobs. (Reporting by Ju-min Park in SEOUL and Stella Qiu in BEIJING; Additional reporting by Hyun Joo Jin and Joyce Lee in SEOUL, Philip Blenkinsop in BRUSSELS; Editing by Simon Cameron-Moore and Alexander Smith)\n ", "external_links": [], "published": "2018-01-23T07:01:00.000+02:00", "crawled": "2018-01-23T07:16:50.000+02:00", "highlightTitle": ""}