{"organizations": [], "uuid": "eddf1ea7207cf391ac146ce1a59882fe775551cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKhealth/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-afib-survival/atrial-fibrillation-more-deadly-in-rural-u-s-hospitals-idUKKBN1ER1NP", "country": "US", "domain_rank": 408, "title": "Atrial fibrillation more deadly in rural U.S. hospitals", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T22:05:00.000+02:00", "replies_count": 0, "uuid": "eddf1ea7207cf391ac146ce1a59882fe775551cc"}, "author": "", "url": "https://uk.reuters.com/article/us-health-afib-survival/atrial-fibrillation-more-deadly-in-rural-u-s-hospitals-idUKKBN1ER1NP", "ord_in_thread": 0, "title": "Atrial fibrillation more deadly in rural U.S. hospitals", "locations": [], "entities": {"persons": [{"name": "lisa rapaport", "sentiment": "none"}, {"name": "wesley o’neal", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}], "organizations": [{"name": "atrial", "sentiment": "negative"}, {"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "emory university school of medicine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 8:05 PM / Updated 2 hours ago Atrial fibrillation more deadly in rural U.S. hospitals Lisa Rapaport 4 Min Read \n(Reuters Health) - - Among U.S. patients hospitalized for the common heart rhythm disorder known as atrial fibrillation, those in rural areas may be more likely to die than their urban counterparts, a new study suggests. \nResearchers examined data on 248,731 adults nationwide who were hospitalized for atrial fibrillation between 2012 and 2014. After accounting for patient characteristics and medical issues that can influence survival odds, rural patients were 17 percent more likely to die in the hospital, the study found. \n“Presumably, a higher risk of death in patients from rural regions was related to differences in practice patterns and access to specialists,” said lead study author Dr. Wesley O’Neal of Emory University School of Medicine in Atlanta, Georgia. \nAtrial fibrillation is often managed with medication. For more troublesome cases, common treatments include ablation, a minimally invasive surgery to destroy heart tissue that’s causing abnormal heart rhythms, and cardioversion, a procedure to shock the heart into a normal rhythm. \nBoth of these procedures were more likely to be done at urban hospitals, the study found. \n“Although we cannot equate a specific number or percentage of the observed mortality risk to differences in practice patterns or access to specialty care, our data do suggest that these differences exist,” O’Neal said by email. \nIn atrial fibrillation, electrical impulses in the upper chambers of the heart are chaotic, causing part of the heart muscle to quiver rather than contracting normally. As a result, blood doesn’t move as well to the heart’s lower chambers. This can lead to the formation of clots that can travel through the arteries. The risk of stroke is up to seven times higher in people with atrial fibrillation than in people without the disorder. \nThe analysis included almost 219,000 urban patients and nearly 30,000 urban patients from 44 states and the District of Columbia, representing more than 96 percent of the U.S. population. \nRural atrial fibrillation patients were more likely to die of all causes during their hospital stays, researchers report in Heart Rhythm. \nThis held true after accounting for several common medical conditions that can accompany atrial fibrillation including high blood pressure, diabetes, heart failure and kidney damage. \nOverall, 8 percent of urban atrial fibrillation patients had cardioversion procedures, compared with just 4 percent of their urban counterparts, the study found. \nAt the same time, 9 percent of urban patients got ablation procedures for atrial fibrillation, compared with 1 percent of people in rural hospitals. \nAbout 1.3 percent of atrial fibrillation patients died in rural hospitals, compared with 1 percent in urban facilities. \nThe study wasn’t a controlled experiment designed to prove whether or how hospital locations might influence survival odds for patients admitted with atrial fibrillation. \nResearchers also lacked data on the severity of medical conditions that might impact survival odds, the authors note. \nThe severity of problems like diabetes and high blood pressure can impact survival odds, as can access to care in the community, lifestyle factors and how well physicians follow guidelines for diagnosing and treating atrial fibrillation, Dr. Thomas Deering and Dr. Ashish Bhimani of the arrhythmia center at the Piedmont Heart Institute in Atlanta write in an accompanying editorial. \n“Existing information suggests that rural patients may have higher overall and cardiovascular mortality rates,” Deering said by email. “There is also some limited data suggesting that several atrial fibrillation outcomes, for example appropriate anticoagulation usage and appropriate referral for advanced procedural options such as ablation, are lower in rural than urban settings.” \nSOURCE: bit.ly/2CbXQp1 Heart Rhythm, online December 10, 2017.", "external_links": [], "published": "2018-01-02T22:05:00.000+02:00", "crawled": "2018-01-02T23:48:59.005+02:00", "highlightTitle": ""}