{"organizations": [], "uuid": "8eb6467e7add99adff2f69e386ea8b2caa72f3c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-tfi-tab-food-investments-launches-initial-public-offering.html", "country": "US", "domain_rank": 767, "title": "TFI Tab Food Investments Launches Initial Public Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-26T17:02:00.000+02:00", "replies_count": 0, "uuid": "8eb6467e7add99adff2f69e386ea8b2caa72f3c1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-tfi-tab-food-investments-launches-initial-public-offering.html", "ord_in_thread": 0, "title": "TFI Tab Food Investments Launches Initial Public Offering", "locations": [], "entities": {"persons": [], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}], "organizations": [{"name": "tfi tab food investments launches initial public offering istanbul", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "credit suisse securities", "sentiment": "none"}, {"name": "goldman sachs & co", "sentiment": "none"}, {"name": "morgan stanley & co", "sentiment": "none"}, {"name": "citigroup global", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ISTANBUL, Turkey and NEW YORK, Jan. 26, 2018 (GLOBE NEWSWIRE) -- TFI Tab Food Investments (“TFI”) today announced that it has commenced an initial public offering of 22,000,000 American Depositary Shares (“ADSs”), with each ADS representing 12 ordinary shares, including 4,500,000 ADSs to be sold by the Company and 17,500,000 ADSs to be sold by certain existing shareholders. The underwriters will have an option to purchase up to an additional 3,300,000 ADSs from certain existing shareholders. The Company will use the net proceeds it receives to repay a portion of outstanding indebtedness and will not receive any proceeds from the ADSs sold by the selling shareholders. The price range for the initial public offering is currently estimated to be between $9.00 and $11.00 per share. The Company has applied to list its ADSs on the Nasdaq Global Select Market under the symbol “TFIG”.\nMorgan Stanley & Co. LLC, Credit Suisse Securities (USA) LLC and Goldman Sachs & Co. LLC, are acting as bookrunning managers and representatives of the underwriters for the proposed offering. Citigroup Global Markets Inc. and J.P. Morgan Securities LLC are acting as bookrunners for the proposed offering. Rabo Securities U.S.A., Inc. is acting as a co-manager for the proposed offering.\nThe offering will be made only by means of a prospectus. When available, copies of the preliminary prospectus relating to the offering of these securities may be obtained from:\nMorgan Stanley & Co. LLC, Attention: Prospectus Department, 180 Varick Street, 2nd Floor, New York, NY 10014; Credit Suisse Securities (USA) LLC, Attn: Prospectus Department, One Madison Avenue, New York, NY 10010, telephone: 1-800-221-1037 or by emailing newyork.prospectus@credit-suisse.com ; or Goldman Sachs & Co. LLC, Prospectus Department, 200 West Street, New York, NY 10282, telephone: 1-866-471-2526, facsimile: 212-902-9316 or by emailing prospectus-ny@ny.email.gs.com .\nA registration statement relating to these securities has been filed with the U.S. Securities and Exchange Commission but has not yet become effective. These securities may not be sold, nor may offers to buy be accepted, prior to the time the registration statement becomes effective. This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such an offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout TFI\nTFI Tab Food Investments, Inc. is one of the world’s largest global restaurant operators by number of restaurants, with over 1,800 restaurants and more than 30,000 employees. During its 22-year history, TFI has grown its portfolio to include a broad range of quick service restaurants, or QSRs, mainly in Turkey and China. Its brand portfolio includes some of the most widely-recognized QSR brands in the world, including Burger King®, Popeyes®, Sbarro®, and Arby’s®, as well as its own brand, Usta Dönerci®.\nFor media inquiries, please contact:\nIn Turkey\nV Emir IŞIK\nTFI Tab Food Investments\n+90 212 310 4899\nisik.emir@tabfoods.com\nIn the U.S.\nRichard Jacques / Patricia Graue\nBrunswick Group\n+1 212 333 3810\nTFI@brunswickgroup.com\nSource: TAB Food Investments", "external_links": [], "published": "2018-01-26T17:02:00.000+02:00", "crawled": "2018-01-26T18:01:00.015+02:00", "highlightTitle": ""}