{"organizations": [], "uuid": "2ad378320d495405ca397e973d5acccff16e1971", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/business-wire-discover-recognized-for-customer-service-innovation.html", "country": "US", "domain_rank": 767, "title": "Discover Recognized for Customer Service Innovation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T21:30:00.000+02:00", "replies_count": 0, "uuid": "2ad378320d495405ca397e973d5acccff16e1971"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/business-wire-discover-recognized-for-customer-service-innovation.html", "ord_in_thread": 0, "title": "Discover Recognized for Customer Service Innovation", "locations": [], "entities": {"persons": [{"name": "glenn schneider", "sentiment": "none"}], "locations": [{"name": "riverwoods", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}], "organizations": [{"name": "customer service innovation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RIVERWOODS, Ill.--(BUSINESS WIRE)-- Discover has been named a 2018 Digital Edge 50 award winner for its in-app messaging functionality that leverages artificial intelligence (AI). This feature provides a responsive and intuitive messaging experience for customers while making it easier for service agents to deliver world-class customer service.\nIn-app messaging gives customers the flexibility to jump in and out of conversations with service representatives via the Discover mobile app at their convenience. Agents are always ready to respond with helpful support with the assistance of chatbots in the background utilizing natural language processing and machine learning.\n“At Discover, we are always looking to leverage innovative technologies to improve the customer experience,” said Glenn Schneider, chief information officer at Discover. “Our system analyzes customer messages in real-time and continuously learns, enabling our U.S.-based agents to deliver personalized service.”\nThe Digital Edge 50 distinction is awarded for innovation using technologies such as AI, mobile, analytics, the Internet of Things and cloud to deliver business results. Sponsored by IDG, a technology media, data and marketing services company, the awards recognize projects that create greater customer engagement and drive higher revenue and profits.\n“This year we have many winners employing AI and machine learning, or a combination of the two, demonstrating how quickly those technologies are taking hold,” said Anne McCrory, Digital Edge program chair and Group VP, Customer Experience and Operations, IDG Events and CIO Executive Council. “There are projects on data accessibility, digital assistants, sensors, and integrating numerous systems and data types for mobile users. All have remarkable returns, whether those are efficiencies or sales from new capabilities or even new businesses launching.”\nMore than 250 projects were nominated for the Digital Edge 50 awards. Selected by a panel of industry experts, and business and technology executives, applications were evaluated for complexity, business results and innovation. Winning projects used technology such as artificial intelligence, machine learning, virtual reality/augmented reality, cloud, data analytics, and mobile/smart devices.\nAbout Discover\nDiscover Financial Services (NYSE: DFS) is a direct banking and payment services company with one of the most recognized brands in U.S. financial services. Since its inception in 1986, the company has become one of the largest card issuers in the United States. The company issues the Discover card, America's cash rewards pioneer, and offers private student loans, personal loans, home equity loans, checking and savings accounts, and certificates of deposit through its direct banking business. It operates the Discover Network, with millions of merchant and cash access locations; PULSE, one of the nation's leading ATM/debit networks; and Diners Club International, a global payments network with acceptance in more than 185 countries and territories. For more information, visit www.discover.com/company .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180110006001/en/\nDiscover Financial Services\nSusan J. Villalobos\n224-405-5344\nsusanvillalobos@discover.com\n@Discover_News\nSource: Discover Financial Services", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.discover.com%2Fcompany&esheet=51741371&newsitemid=20180110006001&lan=en-US&anchor=www.discover.com%2Fcompany&index=1&md5=f062e40d39e0c1acacab118e21a361d7", "http://www.businesswire.com/news/home/20180110006001/en/"], "published": "2018-01-10T21:30:00.000+02:00", "crawled": "2018-01-10T23:30:14.025+02:00", "highlightTitle": ""}