{"organizations": [], "uuid": "b94c5c4ec4a1c82ce279e2d77b55bbe0827e871e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 69}, "facebook": {"likes": 32, "shares": 32, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104939467-Blockchain_Industry_Thumb_00000.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/10/in-the-world-of-cryptocurrency-buzz-blockchain-is-the-real-winner.html", "country": "US", "domain_rank": 767, "title": "In the world of cryptocurrency buzz, blockchain is the real winner", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.975, "site_type": "news", "published": "2018-01-11T16:00:00.000+02:00", "replies_count": 0, "uuid": "b94c5c4ec4a1c82ce279e2d77b55bbe0827e871e"}, "author": "Qin Chen", "url": "https://www.cnbc.com/2018/01/10/in-the-world-of-cryptocurrency-buzz-blockchain-is-the-real-winner.html", "ord_in_thread": 0, "title": "In the world of cryptocurrency buzz, blockchain is the real winner", "locations": [], "entities": {"persons": [{"name": "antonis polemitis", "sentiment": "none"}], "locations": [], "organizations": [{"name": "university of nicosia", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The investment world hasn't seen a party quite like bitcoin and cryptocurrency until 2017.\nBitcoin rose about twentyfold in value last year, ethereum surged more than 11,200 percent and ripple , the rising new coin, skyrocketed almost 10,000 percent. Consumed by the growth, many investors are seeing the cryptoworld only in the lens of price movements.\nBut for those who aren't interested in buying and selling and managing cryptocurrency portfolios, there's another way to invest in the space — learning and investing in the blockchain technology.\nBlockchain is a robust technology that resembles the internet in the early '90: It packs the potential to change the way we live, work, consume and interact.\n\"This is an industry that we think that over several decades will be as revolutionary as the internet. We're going to have several million people working in this industry, if not tens of millions,\" said Antonis Polemitis, CEO of the University of Nicosia and a pioneer in blockchain and cryptocurrency education. \"You are going to need accountants, auditors, lawyers and government regulators who understand how it works. \"\nIn the spring of 2014, the University of Nicosia established the world's first master's degree in digital currency and blockchain, taught online, where Polemitis co-teaches a course with industry thought leader Andreas Antonopoulos.\n\"If you can develop an expertise at this stage in time at blockchain, you'll have excellent job prospects and probably be pretty popular among your company because a lot of folks are trying to see where it fits in,\" Polemitis said. \"And there's not many people in the world (that) know how this works.\"\nTo be clear, bitcoin — the most popular blockchain application — is just one use for the technology. \"Blockchain technology has applicability to many business areas including government, healthcare, education, manufacturing, energy and supply chain,\" according to Gartner's blockchain trend insight report , released earlier this year. The firm's report also predicted that \"by 2030, the business value added by blockchain will grow to $3.1 trillion.\"\nTechnology giant IBM has built a blockchain unit to deploy the technology in various industries. Using its own blockchain platform Hyperledger , IBM is working with partners like Walmart to speed up food tracing, helping the FDA on optimizing information in clinic drug trials and collaborating with Northern Trust on revamping private equity administration.\nIBM blockchain projects In the case of Walmart, IBM was able to reduce a food tracing process from six days to about two seconds, thanks to blockchain. \"That kind of transformation can really speed up the decision-making process so you can minimize the health risk from a food-borne illness,\" said Marie Wieck, who runs the IBM blockchain unit.\nSince launching last February, the unit has grown to 1,500 people worldwide, worked on over 400 projects. \"In terms of blockchain [talents], I'm not able to hire fast enough, both at the technical level and at the business and data level,\" Wieck said.\nOne might ask, what really is a blockchain? It's essentially a new form of database. Think about a blockchain as a Google spreadsheet, where everyone can make changes, and updates are shared among participants. But what's unique about this spreadsheet is that every update is final, nobody can tamper with it. Many technologists call that \"digital immutability,\" meaning once you have committed a record on a blockchain, it's practically impossible to change the record.\nThat immutability is the special sauce that makes blockchain desirable across many industries. It creates trust, without needing a central authority such as a company or an organization to establish that trust. When every participant on a blockchain network understands that data can't be changed, they inherently trust the data. In return, it saves time and money from verifying transactions and communication.\nFor Dr. Bryant Joseph Gilot, a surgeon who transitioned to the blockchain health-care field, the immutability provided from blockchain is the key ingredient to speed up traditional clinical drug trials. He's working with a small group of people at Blockchain Health, building an application that's channeling blockchain's digital immutability to protect sensitive data in clinical drug trials.\n\"The data in clinical medicine is very sensitive. We really need to be able to lock it down,\" he said. \"So building cryptographic application on top of blockchain will be interesting.\"\nThe group also wants to offer a \"sophisticated access control mechanism, so your doctor can see it, your caretaker can see it, but not your insurance company, who might make a decision that won't benefit you but benefit them,\" Gilot said. The goal is to speed up the clinical trials process but still protect the integrity of the data, making room for more and better trials and ultimately \"get the ones that succeed out to patients sooner,\" he said.\nGilot worked as a general and cardiovascular surgeon for about 10 years. One day, he discovered Satoshi Nakamoto's bitcoin white paper (a nine-page paper containing the first-ever mention of bitcoin). \"Honestly I spent number of years not being able to put the paper down. I continued with my clinical work, and was entirely distracted for years. … I didn't think this was going to go away, it was keeping my interest for way too long. For me, I have a personal desire to place this technology in the way the current world operates. \"\nDr. Bryant Joseph Gilot. Chief medical officer at Blockchain Health Co. While blockchain can speed up traditional business practices like verifying information and transactions, there's no ignoring the fact that blockchain also has the potential to replace and eliminate human jobs.\n\"What blockchain offers, is not disrupting the job of barista, or the hamburger flipper. It's going to disrupt the jobs of what we consider white-collar workers, some of these people have master's degrees, and they are going to be out of work because of this technology,\" said Campbell Harvey , a finance professor at Duke University.\n\"Blockchain enables many different peer-to-peer situations that eliminates middle people. So anything to do with the so-called back office functions that exist in many firms, especially in financial firms, those are going to be the first job to disappear,\" said Harvey. For the last four years, Harvey has been teaching MBA students blockchain technology and encouraging them to build practical applications using the technology.\nHow does one brace themselves for a disruptive future? In the age of the internet and open-sourced data, acquiring a working knowledge of blockchain is, thankfully, straightforward. The University of Nicosia offers a free introductory MOOC (Massive Online Open Course) on digital currencies; Coursera has partnered with Princeton University, offering a free course on \"Bitcoin and Cryptocurrency Technologies\" ; Stanford, Duke, the University of California, Berkeley, and New York University offer courses and projects on the subject for students enrolled.\n\"The good news is I don't think you necessarily have to go back to school to understand this. I think you can do really a good amount of learning just by Googling What is a blockchain? What i", "external_links": [], "published": "2018-01-11T16:00:00.000+02:00", "crawled": "2018-01-11T16:10:19.064+02:00", "highlightTitle": ""}