{"organizations": [], "uuid": "0147d5f9f45ef4f3788f30a3ed8e649a36be1f3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-872362368.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/23/netflix-amazon-2018-academy-award-nominations/", "country": "US", "domain_rank": 1196, "title": "2018 Academy Award Nominations: How Netflix and Amazon Fared | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.741, "site_type": "news", "published": "2018-01-23T13:43:00.000+02:00", "replies_count": 0, "uuid": "0147d5f9f45ef4f3788f30a3ed8e649a36be1f3f"}, "author": "Tom Huddleston Jr.", "url": "http://fortune.com/2018/01/23/netflix-amazon-2018-academy-award-nominations/", "ord_in_thread": 0, "title": "2018 Academy Award Nominations: How Netflix and Amazon Fared | Fortune", "locations": [], "entities": {"persons": [{"name": "tom huddleston jr.", "sentiment": "negative"}, {"name": "rachel morrison", "sentiment": "none"}, {"name": "mary j. blige", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "netflix", "sentiment": "negative"}, {"name": "academy of motion picture arts and sciences", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Tom Huddleston Jr. 11:43 AM EST \nNetflix scored its first-ever Academy Award nominations for a feature film on Tuesday morning, as the streaming giant’s push to compete against traditional Hollywood studios on the industry’s most glitzy stage picked up steam. \nNetflix picked up four total Oscar nominations for its 2017 original film Mudbound , a drama set in the racially segregated U.S. South after World War II, including nods for the best adapted screenplay, cinematography, and original song (“Mighty River”) as well as a nomination for supporting actress Mary J. Blige. (And, one of those nominations even marked an Oscar-first: Rachel Morrison became the first female cinematographer ever nominated for an Academy Award in that category.) Netflix won its first Academy Award last year , for the documentary short White Helmets , but this marks the first time the streaming service has ever had one of its original feature films nominated for an Oscar. \nThe Academy of Motion Picture Arts and Sciences announced the latest batch of Oscar nominations early Tuesday morning. Netflix’s streaming rival, Amazon , received one Oscar nomination, for comedy The Big Sick ‘s original screenplay, a year after the e-commerce giant won it’s first Academy Awards for the drama Manchester by the Sea . \nNetflix also received three nominations in documentary film categories, including for Icarus and Strong Island in the Best Documentary Feature category, and for the documentary short Heroin(e) . Meanwhile, Netflix acquired foreign language film nominee On Body And Soul , from Hungary, in November and the film will debut on the streaming service next month. \nGet Data Sheet , Fortune’s technology newsletter. \nTuesday’s Oscar nominations are something of a culmination to what has already been a busy awards season for Netflix, which scored a dozen nominations at the 2018 Golden Globe Awards for Mudbound and multiple original TV series, including Stranger Things and The Crown . \nHowever, in the end, Netflix walked away with only one Golden Globe win, for actor Aziz Ansari of the comedy series Master of None . So, while Mudbound has been a consistent nominee throughout Hollywood’s drawn-out awards season, the film has yet to take home any major hardware, which means Netflix may not actually get to hear the company’s name called on Oscars night. \nThe Oscar winners will be revealed at the 90th Academy Awards on March 4. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-23T13:43:00.000+02:00", "crawled": "2018-01-23T22:45:30.027+02:00", "highlightTitle": ""}