{"organizations": [], "uuid": "71fe921dbb1542004bb3cc16537c8c57387547f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/melinda_gates_vc.jpg", "site_section": "http://news.google.com/news?hl=en&tok=LdqcmpRdm2GJ2h1O51UdUA&ds=n&pq=angel+invest&cp=21&gs_id=6y&xhr=t&q=VC+OR+Venture+Capital&newwindow=1&pws=0&bav=on.2,or.r_gc.r_pw.r_cp.r_qf.&bpcl=38093640&biw=1366&bih=653&um=1&ie=UTF-8&output=rss", "section_title": "VC OR Venture Capital - Google News", "url": "http://fortune.com/2018/01/23/raceahead-venture-capital/", "country": "US", "domain_rank": 1196, "title": "raceAhead: Venture Capital Gets Gritty - Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T21:53:00.000+02:00", "replies_count": 0, "uuid": "71fe921dbb1542004bb3cc16537c8c57387547f9"}, "author": "", "url": "http://fortune.com/2018/01/23/raceahead-venture-capital/", "ord_in_thread": 0, "title": "raceAhead: Venture Capital Gets Gritty - Fortune", "locations": [], "entities": {"persons": [{"name": "ellen mcgirt", "sentiment": "negative"}, {"name": "michal lev-ram", "sentiment": "none"}, {"name": "jennifer fonstad", "sentiment": "none"}, {"name": "melinda gates", "sentiment": "none"}, {"name": "theresia gouw", "sentiment": "none"}, {"name": "gouw", "sentiment": "none"}], "locations": [], "organizations": [{"name": "aspect ventures", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Ellen McGirt Updated: January 23, 2018 2:53 PM ET \nGrit week continues with this extraordinary piece from my Fortune colleague, Michal Lev-Ram, How Investors Like Melinda Gates Are Helping These VCs Tackle Tech’s Bro Problem . \nThe story begins with a well-deserved victory lap for Theresia Gouw and Jennifer Fonstad, the savvy co-founders of Aspect Ventures . The two serial entrepreneur/investors didn’t set out to start a women-focused venture firm when they opened their doors in 2014, but they did intend to build on an idea that was barely a bumper sticker phrase back then: “If you have more diversity you have better financial performance,” says Gouw. Their company is 50% women. \nBut wait, there’s more: \nOverall, women founders receive less than 3% of total VC dollars (women of color, meanwhile, get a meager 0.2%), but Aspect’s portfolio looks strikingly different from the norm: About 40% of the firm’s companies were founded by women, and 30% were started by minorities. Once, those numbers might have been a mere curiosity—today they are becoming a competitive advantage. While investing for diversity is something certain industry players have been pushing for a long time, the message is finally beginning to be received by the deep-pocketed individuals and institutions that fund the Silicon Valley ecosystem. Why? Ignoring it can be expensive. \nOver the course of their careers, explains Lev-Ram, Gouw and Fonstad’s investments have resulted in a collective seven public offerings, 26 acquisitions, and more than 500 financing rounds in follow-on capital. Next up for Aspect is a new investment fund, and Melinda Gates has signed on as a limited partner. “In many ways, the venture and startup ecosystem is still a boys’ club—one that all too often excludes, disadvantages, and mistreats talented women who want to contribute to it,” she told Fortune. \nAlong with Aspect portfolio firms, some atypical companies have excelled in spite of tech’s dominant bro culture, outliers which now offer signposts for a more prosperous and inclusive future. Here’s one example: The Austin-based WP Engine, a full-service platform for WordPress users. \nI had a chance to catch up with CEO Heather Brunner recently, to talk about her own funding milestone– the company, which now boasts an annual $100 million in revenue just completed a $250 million investment round from Silver Lake Partners. “This will really give us a chance to expand into new markets,” she told Fortune. \nA tech-industry veteran, Brunner has been a force for inclusive thinking since she took the helm as CEO in 2013. She’s a participant in Fortune’s CEO Initiative , working collaboratively with other executives to better help business address pressing social issues, and made sure WP Engine was among the first companies to sign on to the Obama Administration’s Equal Pay Pledge. \nAnd here’s the extra-gritty part: She’s learned to think about talent differently than most tech companies executives. \nWP Engine employees are 55% women and, in an unusual move, 35% of employees don’t have a college degree. (Also unusual: Past scrapes with the law aren’t necessarily a barrier to employment.) \n“When we decided that we were open to people without a college degree, it was game-changing for us,” says Brunner. \nInstead, they reach out to a wider universe including existing WordPress users, a naturally diverse lot. Many, hold down multiple jobs, and work on the side developing websites for other people. Others only build for themselves, showcasing blogs, selling their handiwork, talking about games, whatever. None of them fit a particular profile. While they start in customer support roles, there are clear pathways to move into more complex roles in support, sales, and engineering. “A quarter of our employees got a promotion in 2017,” says Brunner. \nBrunner says all the right things about the business case for inclusion, but she’s earned the right to make a philosophical one as well. “We want to inspire others by focusing on culture,” she says. “We believe that you can get outsize business results by being good and doing good.” On Point OscarsSoNotHispanic While we are correctly celebrating some outstanding milestones in today’s Oscars announcements, it is worth remembering that the group that Hollywood tends to ignore the most are Latinx. While Latinx make up 18% of the population in the United States and 23% of frequent moviegoers — they comprised only 3% of speaking roles during the last decade of mainstream filmmaking according to a study released in July by USC. The last Hispanic performer to win an Oscar was nine years ago. Can you name her, diversity trivia buffs? New York Times The U.S. has lost public trust, but journalists have gained it I’m still pouring through the 2018 Edelman Trust Barometer, a fascinating annual global analysis of the state of trust and credibility in the world, but I wanted to flag some highlights. First, the news for the U.S. is particularly grim: This country has experienced the most dramatic decline in public trust in the 18 years of the survey. (China, however, is on the rise.) But there are some points of light. Many types of credentialed experts have gained public trust over last year’s results: CEOs ticked up seven points, corporate boards rose six points and journalists rose twelve points, the biggest gain in the mix. Journalism! Oh, and good job to you too, CEOs. Edelman The Second Annual Women’s March was a voter registration effort in disguise And not much of a disguise at that. More than one million people poured into the streets for women’s marches over the weekend; some of the headline speakers then headed to Las Vegas for a “Power to the Polls” rally aiming to “convert the groundswell of momentum and activism into direct electoral power.” Planned Parenthood president Cecile Richards delivered a pointedly inclusive set of remarks. “The Women’s March fueled a feminist revolution,” Richards said. “White women, listen up. We’ve got to do better.” The Cut Wonder Woman 2 becomes the first production to adopt new anti-harassment guidelines The new guidelines, released by the Producers Guild of America on Friday are updated best practices aiming to help combat harassment on and off the set. Among other things, they suggest both in-person training and new reporting and documentation protocols. The recommendations call for an orientation of “attention and empathy” to reports of harassment, “while bearing in mind that the report itself does not predetermine guilt.” Wonder Woman 2 will be released on December 13th, 2019, and will reunite director Patty Jenkins and star Gal Gadot. Producer Brett Ratner, who has been accused of sexual misconduct and who financed the first film, has not been invited back. The Woke Leader The real-life Rosie the Riveter dies at 96 The woman behind the cultural icon known as “ Rosie the Riveter ,” part of a propaganda campaign to recruit women workers into the munitions industry during World War II, has died. Naomi Parker Fraley, who was recognized as the inspiration behind the poster in 2015, was 96-years-old. During World War II, Fraley was a factory worker at Alameda Naval Station, where a press photographer snapped a photo that would become the basis for the famous campaign. As always, there’s a bit of drama; the original photo misidentified the woman. Fraley caught the error herself, when she attended a reunion on factory workers some sixty years later. CNN First time director and screenwriter Cathy Yan makes her Sundance debut The film sounds beautiful and timely, and rich with details, as her previous work in journalism might suggest. The film is about people, relationships and the ties that break and bind as China develops at scale. “Everything in China seems to be very exaggerated and faster,” Yan says in this Q&A. “It’s going through the largest urbanization movement in history.” The story begins with disgust: The bodies of dead and diseased pigs float downstream from rural farms into the city of Shanghai, a real-life event she turned into a metaphor for unrelenting growth. “The biggest difference about what happened in real life and what happened in the movie is that the movie gives a reason for it, but in real life there wasn’t,” she says. OZY Fidel Castro once hit up FDR for some walking around money Much has been written about the life of Cuban leader Fidel Castro, particularly as the world’s relationship with Cuba evolves. But historian Michael Beschloss bested everyone by tweeting a picture of the hand-written note 12-year-old Fidel sent to President Franklin Roosevelt in 1940. In careful cursive, Fidelito explains that he had heard on the radio that Roosevelt was going to be President again, and was very happy about it. Then, after apologizing for his poor English, he asks Roosevelt to send him a ten dollar bill. “I have not seen a ten dollars bill green American and I would like to have one of them.” He included a return address. Twitter Quote", "external_links": [], "published": "2018-01-23T21:53:00.000+02:00", "crawled": "2018-01-24T02:00:58.026+02:00", "highlightTitle": ""}