{"organizations": [], "uuid": "7ea966f5e58fb7ea3ccc6afd9a822150f59d0e95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/07/gettyimages-632971268.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/23/satanic-temple-missouri-abortion/", "country": "US", "domain_rank": 1196, "title": "Satanists Take Missouri to Court Over Abortion Laws | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.137, "site_type": "news", "published": "2018-01-23T12:53:00.000+02:00", "replies_count": 0, "uuid": "7ea966f5e58fb7ea3ccc6afd9a822150f59d0e95"}, "author": "Chris Morris", "url": "http://fortune.com/2018/01/23/satanic-temple-missouri-abortion/", "ord_in_thread": 0, "title": "Satanists Take Missouri to Court Over Abortion Laws | Fortune", "locations": [], "entities": {"persons": [], "locations": [{"name": "missouri", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "supreme court", "sentiment": "none"}, {"name": "missouri supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "abortion Satanists Take Missouri to Court Over Abortion Laws An abortion opponent yells at a pro choice demonstrator in front of the Supreme Court building in Washington, D.C. on January 27, 2017. The Washington Post/Getty Images 10:53 AM EST \nThe Missouri Supreme Court is going to see one hell of a fight Tuesday. \nA group called the Satanic Temple is suing the state on behalf of an anonymous woman saying the state’s requirement to wait 72 hours before an abortion violates her religious beliefs. \nThe woman, who alleges she told doctors she “adheres to principles of the Satanic temple,” says she was forced to view an ultrasound of her fetus and read an informed consent booklet that said human life begins at conception. \nThe suit, which was filed in May 2015, maintains that statement is a non-medical religious viewpoint that violates the Establishment Clause, which prevents the government from passing legislation respecting an establishment of religion. The state disagrees, but in October a Missouri appeals court saw fit to escalate the case to the state Supreme Court. \n“Neither the Missouri Supreme Court nor the U.S. Supreme Court has considered whether a Booklet of this nature, an Ultrasound, an Audible Heartbeat Offer, and a seventy-two-hour Waiting Period violate the Religion Clause rights of pregnant women,” Judge Thomas Newton wrote. “Because we believe that this case raises real and substantial constitutional claims, it is within the Missouri Supreme Court’s exclusive jurisdiction.” \nThis isn’t the first time the Satanic Temple has raised constitutional questions. In 2015, it became involved in a fight over a 10 Commandments monument at the Oklahoma State House. It asked to be allowed to place a statue of the goat-headed deity Baphomet alongside the Commandments. The Oklahoma Supreme Court eventually ruled the Commandments monument had to be removed. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-23T12:53:00.000+02:00", "crawled": "2018-01-23T23:37:47.005+02:00", "highlightTitle": ""}