{"organizations": [], "uuid": "94367506d30f1ba4d226f0fe3ded4c7f7bd7a454", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226763867&w=1200&r=LYNXMPEE0U014", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-bp-exploration/bp-makes-two-discoveries-in-uk-north-sea-idUSKBN1FK01R", "country": "US", "domain_rank": 408, "title": "BP makes two discoveries in UK North Sea", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.101, "site_type": "news", "published": "2018-01-31T08:35:00.000+02:00", "replies_count": 0, "uuid": "94367506d30f1ba4d226f0fe3ded4c7f7bd7a454"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-bp-exploration/bp-makes-two-discoveries-in-uk-north-sea-idUSKBN1FK01R", "ord_in_thread": 0, "title": "BP makes two discoveries in UK North Sea", "locations": [], "entities": {"persons": [{"name": "achmelvich", "sentiment": "none"}, {"name": "mark thomas", "sentiment": "none"}, {"name": "paul b loyd junior", "sentiment": "none"}], "locations": [{"name": "uk north sea", "sentiment": "none"}, {"name": "uk north sea london", "sentiment": "none"}, {"name": "shetland", "sentiment": "none"}, {"name": "north sea", "sentiment": "none"}, {"name": "west shetlands", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "bp", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - BP has made two new oil and gas discoveries in the UK North Sea, it said on Wednesday, giving new impetus to its plans to boost production in the ageing basin into the middle of the century.\nThe new discoveries are also the latest bright spot for the North Sea after a number of large new fields started up in recent years, helping to reverse a long and gradual decline in output since the late 1990s.\n“These are exciting times for BP in the North Sea as we lay the foundations of a refreshed and revitalized business that we expect to double production to 200,000 barrels a day by 2020 and keep producing beyond 2050,” Mark Thomas, BP North Sea regional president, said.\nLondon-based BP said it had made one discovery in Block 29/4e in the central North Sea, named Capercaillie, and another in Block 206/9b west of Shetland, branded Achmelvich.\nBoth wells were drilled by the Paul B Loyd Junior rig in summer 2017. The size of the resource was not disclosed.\nThe discoveries will help boost production from BP’s recently-launched Quad 204 field in the West Shetlands as well as the Clair Ridge field, which is due to come into production this year, Thomas said.\nWith seven field start-ups in 2017, and five set to start in 2018, BP plans to boost its production by 800,000 barrels per day (bpd) by 2020, which will be mostly gas. It produced around 3.5 million bpd last year.\nThe company will nevertheless not change its spending plans because of rising global oil prices and is preparing to approve projects this year that can make money with prices below $40 a barrel, the head of its oil and gas division Bernard Looney told Reuters on Tuesday.\nNEW FIELDS And as oil prices recover to around $70 a barrel after a three-year downturn, so is activity in the North Sea.\n“The UK offshore oil and gas industry is stirring back to life, fueled by a robust uptick in the number of field development projects,” Oslo-based consultancy Rystad Energy said.\nUp to 13 fields in the UK North Sea are expected to get the go-ahead for development in 2018, compared with only four in the past two years, Rystad said.\nBP is 100 percent owner of Capercaillie while the Achmelvich well is operated by BP, with a 52.6 percent stake, together with Royal Dutch Shell, 28 percent, and Chevron, 19.4 percent, BP said in a statement.\nThe Capercaillie well was drilled to a total depth of 3,750 meters and encountered light oil and gas-condensate in Paleocene and Cretaceous-age reservoirs. The well data is currently under evaluation. Options are expected to be considered for a possible tie-back development to existing infrastructure.\nThe Achmelvich well was drilled to a total depth of 2,395 meters and encountered oil in Mesozoic-age reservoirs. Evaluation and interpretation of the well results is ongoing to assess future options.\nReporting by Ron Bousso; Editing by Adrian Croft\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T08:35:00.000+02:00", "crawled": "2018-01-31T04:28:56.008+02:00", "highlightTitle": ""}