{"organizations": [], "uuid": "324571319f04ce58d97161ebc243078568ac348c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-nam-tai-property-inc-reports-q4-2017-results.html", "country": "US", "domain_rank": 767, "title": "Nam Tai Property Inc. Reports Q4 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.031, "site_type": "news", "published": "2018-01-29T14:00:00.000+02:00", "replies_count": 0, "uuid": "324571319f04ce58d97161ebc243078568ac348c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-nam-tai-property-inc-reports-q4-2017-results.html", "ord_in_thread": 0, "title": "Nam Tai Property Inc. Reports Q4 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "shenzhen", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "nam tai property inc.", "sentiment": "negative"}, {"name": "nam tai property inc", "sentiment": "negative"}, {"name": "ntp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHENZHEN, China, Jan. 29, 2018 /PRNewswire/ -- Nam Tai Property Inc. (\"Nam Tai\" or the \"Company\") (NYSE Symbol: NTP) today announced its unaudited results for the third quarter ended December 31, 2017.\nKEY HIGHLIGHTS\n(In thousands of US dollars, except per share data, percentages and as otherwise stated)\nQuarterly Results\nTwelve Months Results\nQ 4 2017\nQ 4 2016\nYoY(%) ( c )\n12M 2017\n12M 2016\nYoY(%) ( c )\nOperation income\n$\n187\n$\n603\n(69)\n$\n1,851\n$\n2,508\n(26)\nNet operation income\n$\n187\n$\n603\n(69)\n$\n1,851\n$\n1,768\n5\n% of operation income\n100.0%\n100.0%\n100.0%\n70.9%\nOperating loss\n$\n(2,245)\n$\n(1,415)\n--\n$\n(7,599)\n$\n(6,591)\n--\n% of operation income\n(1200.6)%\n(234.7)%\n(410.5)%\n(262.8)%\nper share (diluted)\n$\n(0.06)\n$\n(0.04)\n--\n$\n(0.20)\n$\n(0.18)\n--\nNet income (loss) (a)(b)\n$\n(2,477)\n$\n(5,235)\n--\n$\n3,944\n$\n(9,534)\n--\n% of operation income\n(1,324.6)%\n(868.2)%\n213.1%\n(380.1)%\nBasic income (loss) per share\n$\n0.07\n$\n(0.14)\n--\n$\n0.11\n$\n(0.26)\n--\nDiluted income (loss) per share\n$\n0.07\n$\n(0.14)\n--\n$\n0.11\n$\n(0.26)\n--\nWeighted average number of shares ('000)\nBasic\n37,256\n36,647\n36,807\n36,673\nDiluted\n37,256\n36,647\n37,492\n36,673\nNotes:\n(a) Net loss for the three months ended December 31, 2017 mainly included a loss of $4.6 million related to the write down of our old factory buildings located on the eastern section of the Nam Tai Inno City site after their demolition and general and administrative expenses of $2.4 million; but partly offset by exchange gain of $2.4 million as a result of the appreciation of Renminbi against the US dollar in Q4 2017, interest income of $1.6 million earned from time deposits and net operation income of $0.2 million.\n(b) Net income for the twelve months ended December 31, 2017 mainly included exchange gain of $8.6 million as a result of the appreciation of Renminbi against the US dollar during the twelve months ended December 31, interest income of $7.6 million earned from time deposits, and net operation income of $1.9 million, but partly offset by general and administrative expenses of $9.5 million, loss of $4.6 million related to the write down of our old factory buildings located on the eastern section of the Nam Tai Inno City site after their demolition.\n(c) Percentage change is not applicable if either of the two periods contains a loss.\n(d) Capitalization on project investment was $4.3 million for Q4 2017, totaling $16.6 million for the twelve months ended December 31, 2017 and our accumulated project investment was $52.5 million up to December 31, 2017, which was recorded under the account of real estate properties under development in the balance sheet as at December 31, 2017.\n(e) This information has been published on the Company's website http://www.namtai.com/investors#investors/quarterly_earnings under the quarterly earnings report of Q4 2017 on page 8, Condensed Consolidated Statements of Comprehensive Income.\nSUPPLEMENTARY INFORMATION (UNAUDITED) IN THE FOURTH QUARTER OF 201 7\nKey Highlights of Financial Position\nAs of December 3 1 ,\nAs of December 31,\n2017\n2016\nCash, cash equivalents and short term\ninvestments\n$167.5 million (a)( b)\n$184.2 million\nRatio of cash ( c) to current liabilities\n9.45\n14.79\nCurrent ratio\n9.74\n16.63\nRatio of total assets to total liabilities\n14.79\n19.98\nReturn on equity\n1.6%\n(3.8)%\nRatio of total liabilities to total equity\n0.07\n0.05\nNotes:\n(a) Compared to December 31, 2016, the decrease of $16.7 million in the cash, cash equivalents and short-term investments was mainly due\nto the payments of $13.4 million for new office premises, $10.3 million for dividend payment, and $11.9 million being made for land\ndevelopment project and accordingly was recorded under the account of real estate properties under development in the balance sheet as\nof December 31, 2017; but partly offset by the exchange gain of $9.0 million as a result of the appreciation of Renminbi against the US\ndollar during the twelve months ended December 31, 2017, and proceeds of $6.9 million from shares issued for the exercise of share\noptions.\n(b) Cash in the financial ratio included cash, cash equivalents and short-term investments in the amount of $167.5 million and $184.2\nmillion as of December 31, 2017 and December 31, 2016, respectively.\nOPERATING RESULTS\nOperation income for the fourth quarter of 2017 and the same quarter of last year were mainly derived from the rental of properties and lands located in Shenzhen. Operating loss for the fourth quarter of 2017 was $2.2 million, an increase of $0.8 million, compared to operating loss of $1.4 million in the fourth quarter of 2016.\nNet loss for the fourth quarter of 2017 was $2.5 million compared to a net loss of $5.2 million in the fourth quarter of 2016. Net loss for the fourth quarter of 2017 mainly consisted of a loss of $4.6 million related to the write down of our old factory buildings located on the eastern section of the Nam Tai Inno City site after their demolition and general and administrative expenses of $2.4 million; but partly offset by an exchange gain of $2.4 million as a result of the appreciation of Renminbi against the US dollar in the fourth quarter of 2017, interest income of $1.6 million earned from time deposits and net operation income of $0.2 million. Net loss for the fourth quarter of 2016 mainly consisted of an exchange loss of $5.2 million as a result of the depreciation of Renminbi against the US dollar in the fourth quarter of 2016 and general and administrative expenses of $2.0 million; but partly offset by the interest income of $1.4 million earned from time deposits and net operation income of $0.6 million. Net loss per diluted share for the fourth quarter of 2017 was $0.07 per diluted share compared to net loss per diluted share of $0.14 per diluted share for the fourth quarter of 2016.\nNet income for the twelve months ended December 31, 2017 was $3.9 million compared to a net loss of $9.5 million for the twelve months ended December 31, 2016. Net income for the twelve months ended December 31, 2017 mainly consisted of an exchange gain of $8.6 million as a result of the appreciation of Renminbi against the US dollar during the twelve months ended December 31, 2017, interest income of $7.6 million earned from time deposits and operation income of $1.9 million; but partly offset by general and administrative expenses of $9.5 million, loss of $4.6 million related to the write down of our old factory buildings located on the eastern section of the Nam Tai Inno City site after their demolition. Net loss for the twelve months ended December 31, 2016 mainly consisted of general and administrative expenses of $8.4 million and exchange loss of $8.3 million as a result of the depreciation of Renminbi against the US dollar during the twelve months ended December 31, 2016; but partly offset by the interest income of $5.6 million earned from time deposits and net operation income of $1.8 million. Net income per diluted share for the twelve months ended December 31, 2017 was $0.11 per diluted share compared to net loss per diluted share of $0.26 per diluted share for the twelve months ended December 31, 2016.\nAs the majority of our assets are denominated in Renminbi, the translation of Renminbi denominated assets to US dollars for reporting purposes has resulted in foreign exchange gain for the twelve months ended December 31, 2017. Due to the fluctuation of exchange rate for Renminbi against the US dollar, foreign exchange gain for the twelve months ended December 31, 2017 was $8.6 million, or approximately 217.6% of the amount of our net income for this period. However, since the majority of our payment obligations are also denominated in Renminbi, we do not expect the movement of Renminbi against the US dollar to materially or adversely impact our business. Nevertheless, investors should consider that the purchasing power of US dollar figures for cash and cash equivalents and other short-term investments is not identical from period to period.\nCapitalization on project investment was $4.3 million for Q4 2017, totaling $16.6 million for the twelve months ended December 31, 2017 and our accumulated project investment was $52.5 million up to December 31, 2017, which was recorded under the account of real estate properties under development in the balance sheet as of December 31, 2017.\nOur business of land development is currently in the preparatory stage where it takes time to apply for the relevant licenses and permits from the PRC government. During this preparatory stage of the land development, our only sources of income are from limited deposit interest; therefore, we expect to continue to incur losses during this stage.\nPlease see page 7 of the Company's Condensed Consolidated Statements of Comprehensive Income for further details. This information has also been published on the Company's website at http://www.namtai.com/investors#investors/quarterly_earnings in the quarterly earnings report of Q3 2017 on page 7, Condensed Consolidated Statements of Comprehensive Income.\nCOMPANY OUTLOOK\nThe development of Nam Tai Inno Park in Guangming, Shenzhen, and Nam Tai Inno City in Gushu, Shenzhen, continues to proceed smoothly.\nThe Company has begun certain strategic cooperation with Kaisa Group Holdings Ltd. (\"Kaisa\"), including hiring a number of engineers and real estate professionals from Kaisa to join the Company as officers and employees, as well as appointing one of Kaisa's founders, Mr. Ying Chi Kwok, as an executive director. Based on the most recent filing by Kaisa, following its purchase of shares from our Chairman, Mr. M.K. Koo, and from the public market, Kaisa currently holds approximately 25.0% of the Company's outstanding share capital. With the injection of the new project team and the support from Kaisa, the Company has significantly increased its execution ability and has become less reliant on external consultants. It is expected that the Company will continue to consult with Kaisa from time to time, leveraging Kaisa's knowledge and experience in the areas of construction and real estate development. Effective February 1, 2018, the Company will also promote Mr. Ying Chi Kwok as our CEO and Ms. Yu Zhang as our CFO. Mr. M.K. Koo will remain as our Chairman of the Board and Mr. Julian Lin will remain as our President and General Counsel.\nThe construction of Nam Tai Inno Park continued with the excavation of its foundation and pile driving during the fourth quarter of 2017. The Company has been conducting a thorough review of its construction and marketing plans and decided to make certain significant improvements, including realigning the unit sizes with the projected market demand, installing more advanced building automation systems, air conditioning system and fire proofing. The Company has also been fine tuning certain schematic designs to increase construction efficiency, foot and vehicle traffic safety and achieve higher aesthetic value. Due to the size of the project and the resources required, the Company has also divided the site into eastern and western sections and will engage two separate main construction contractors, each of which will only be responsible for its own section, to ensure construction quality and safety. The two sections will commence construction simultaneously, in lieu of separate phases, to ensure no further delay with our construction plan. The Company expects to select the two main construction contractors in the first half of 2018.\nFor Nam Tai Inno City, the Company has also afforded its new project team the opportunity to conduct a thorough review of its former construction and marketing plans. Similar to Nam Tai Inno Park, Nam Tai Inno City will be constructed by sections, with Phase I, the eastern section, being constructed first, followed by Phase II, the western section. Building in phases will help the Company avoid over-flooding the market upon completion and better align the roll out of our units with Shenzhen's urban development plan. The Company plans to select the architectural design firm for Nam Tai Inno City during the first quarter of 2018, after the new project team has completed its review. In line with the previously announced schedule, the Company has begun to demolish its old factory buildings located on the Inno City site in the fourth quarter of 2017. The first stage of this process, the eastern section, is expected to be completed in the first half of 2018. After completing the demolition of the existing headquarters on the eastern section of the Inno City site, the Company will move its headquarters first to our existing offices in the western section of Inno City, then to another location in the Baoan, Shenzhen, purchased in April 2017.\nAs for the Wuxi facilities, the Company continues to search for both potential buyers or renters, with the primary focus on rental.\nFollowing below are summaries of our Nam Tai Inno Park and Nam Tai Inno City projects:\nPart I: G ross F loor A re as for the Two Projects:\nInno Park\nInno City\n(In square meters, except plot ratios)\nLand area\n103,739\n52,625\nPlot ratios\n2.59\n6.00\nOffice\n175,406\nOffice + Soho\n187,880\nApartment\n61,000\nApartment\n48,300\nGross floor area (GFA)\nCommercial\n28,594\nCommercial\n25,000\nOther\n4,159\nOther\n7,200\n269,159\n268,380\nUnderground floor area\n62,673\n80,000\nTotal construction floor area (CFA)\n331,832\n348,380\nRemark\nThe above figures are subject to adjustment upon the final\napproval of the relevant authorities in China.\nPart II: Timetable for the Two Projects:\nMain Certificates\nEstimated Completion Date\nInno City\nInno City\nInno Park\nPhase I\nPhase II\n2017\n2018\n2019\n2020\n2021\n2022\n2023\nObtained\nA\nLand Use Rights Certificate\nJune 2015\nApr. 2018\nOct. 2019\n*\n%\nObtained\nB\nLand Use Permit\nSep. 2015\nJune 2018\nDec. 2019\n*\n%\nC\nConstruction Planning\nPermit\nObtained\nAug. 2017\nDec. 2018\nJune 2020\n#\n*\n%\nD1\nEarly Construction Permit\nfor Pile Foundation\nObtained\nMay 2017\nN/A\nN/A\n#\nD2\nConstruction Permit for the\nMain Structure\nMay 2018\nJan. 2019\nJuly 2020\n#\n*\n%\nD3\nConstruction Acceptance\nCertificate for the Main\nStructure\nOct. 2019\nSep. 2020\nFeb. 2022\n#\n*\n%\nD4\nConstruction Completion\nOct. 2020\nNov. 2021\nMay 2023\n#\n*\n%\nE\nProperty Ownership\nCertificate\nOct. 2020\nNov. 2021\nMay 2023\n#\n*\n%\nRemarks\n1. Number signs # represent \"Inno Park\", while stars * represent \"Inno City – Phase I\" and percentage signs % represent \"Inno City – Phase II\".\n2. The construction of \"Inno Park\" has commenced from April 2017\n3. The construction of \"Inno City\" is expected to commence before December 2018.\nPart III: Budgetary Estimate for the Two Projects:\nTotal Cost\nInno Park\nInno C ity\n(US$ in million)\n1\nConstruction Cost\n312\n415\n2\nOperation Cost\n69\n43\nTotal\n$ 381\n$ 458\nRemark\nThe $839 million Schematic Design Estimation was prepared by our quantity\nsurveyor, Currie & Brown, based on a schematic design originally prepared by our\narchitectural design firm. This estimate will be used by us for cost control purposes\nto monitor the costs of design, construction, and other operations.\nThis estimation does not include the costs of marketing and interior furnishing and\nmakes no adjustment for inflation or financing costs. If the developed properties are\noffered for sale, the costs would also have to include payment for land appreciation\ntax.\nPotential Risks in O ur B usiness\nWe currently derive a majority of our income from interest income. Since 2016, we have seen a stabilizing trend on the benchmark interest rates in China. However, due to the current economic conditions in China, we expect the People's Bank of China (\"PBOC\") to keep Renminbi-denominated official time deposit interest rates in China at a low level throughout 2018. We expect to continue to incur operating losses in the first quarter of 2018 and beyond. With this lower interest rate environment and continued decrease in our level of deposit, we expect our income offset against these operating losses to materially decrease in future periods, which will accelerate the current decline of our cash and cash equivalents and other short-term investments.\nWe have only become a real estate developer after our electronic manufacturing businesses ceased in 2014. To ensure our successful transformation, we have engaged external advisors and sought potential strategic partners and investors, including Kaisa, to support our projects. We cannot assure you our efforts are sufficient in carrying out a transformation of this magnitude. Our Chairman, Mr. Koo, is 74 years old. Mr. Koo has begun his transition towards retirement in anticipation of age and health issues. We cannot assure you that our transition planning can be carried out smoothly, or that any successor will be able to manage our Company as effectively.\nAs the majority of our assets are denominated in Renminbi, the translation of Renminbi-denominated assets to US dollars for our reporting purposes has resulted in a foreign exchange gain in this quarter. As such, we do expect to see fluctuations in the reporting of foreign exchange loss/gain in the financial statements due to the movement of Renminbi against the US dollar. However, as a majority of our payments are in Renminbi, we also do not expect the movement of Renminbi against the US dollar to adversely impact our business. Nevertheless, investors should consider that the purchasing power of US dollar figures for cash and cash equivalents and other short-term investments is not identical from period to period.\nIn order for the projects to proceed smoothly, we will need to access additional funding. To do so, the Company will negotiate loans and credit lines with financial banks to source funds needed to assist in future development of the projects. These debt instruments often contain covenants limiting our flexibility in operating our business and can contain requirements that we meet certain milestones in our project development. There can be no assurance that we can successfully enter into these instruments with financial institution or that, if we do, we will be able to comply with the covenants or milestones these instruments may require. Failure to enter into these loans or credit lines or to comply with any terms required by this funding may delay our developments as we seek alternative sources of funding or prevent us from completing the developments entirely.\nAs of the end of 2017, we have a total cash balance of $167.5 million and no debt. With our current cash position, we believe our finances remain healthy to fund the initial stages of these property development projects until the end of 2018. All of our land development related applications are subject to government policies and regulations in the real estate market. As this is our first venture into the land development projects, we may encounter industry-specific difficulties that result in losses as we progress with our projects in Shenzhen. As we are currently in the planning stage of our property projects, and can only generate limited interest income from cash deposit, we will continue to record operating losses. Cash on hand is expected to drop continuously, but most of the incurred expenditures related to construction will be for project development, which will be capitalized as real estate properties under development (non-current asset) on our balance sheet. For more information on risks in our business, please refer to the Risk Factors section of our 2016 Annual Report on Form 20-F as filed with the SEC and on our website.\nAccording to our project development plan, project investment for Q1 2018 is estimated to be $16.4 million, and project investment for the year of 2018 is estimated to be $153.5 million.\nThe information contained in or that can be accessed through the website mentioned in this announcement does not form part of this announcement.\nPAYMENT OF QUARTERLY DIVIDENDS FOR 2018\nAs announced on October 30, 2017, the Company set the payment schedule of quarterly dividends for 2018. The dividend for Q4 2017 was paid on October 20, 2017.\nThe following table updates the previously announced schedule for declaration and payment of quarterly dividends in 2018.\nPayment\nRecord Date\nPayment Date\nDividend\n(per share)\nStatus\nQ1 2018\nDecember 31, 2017\nJanuary 19, 2018\n$\n0.07\nPaid\nQ2 2018\nMarch 31, 2018\nApril 20, 2018\n$\n0.07\nQ3 2018\nJune 30, 2018\nJuly 20, 2018\n$\n0.07\nQ4 2018\nSeptember 30, 2018\nOctober 19, 2018\n$\n0.07\nFull Year 2018\n$\n0.28\nThe Company's decision to continue making dividend payments in 2018 as set out and confirmed in the above table does not necessarily mean that cash dividend payments will continue thereafter or at the same amount. Whether future dividends after 2018 are to be declared will depend upon Company's future growth and earnings at each relevant period, of which there can be no assurance, and the Company's cash flow needs for business operations and transformation. Accordingly, there can be no assurance that cash dividends on the Company's common shares will be declared beyond those declared for 2018, and we also cannot assure you what the amounts of such dividends will be or whether such dividends, once declared for a specific period, will continue for any future period, or at all.\nPROPOSED SCHEDULE FOR RELEASE OF QUARTERLY FINANCIAL RESULTS FOR 2018\nTo maintain the efficiency of delivering the Company's quarterly financial results to the market, the Company's management has decided to follow approximately the same schedule of 2017 to release the quarterly financial results for 2018. Details of the expected quarterly release dates are as follows:\nAnnouncements of Financial Results\nQuarter\nDate of release\nQ1 2018\nMay 7, 2018 (Monday)\nQ2 2018\nJuly 30, 2018 (Monday)\nQ3 2018\nNovember 5, 2018 (Monday)\nQ4 2018\nJanuary 28, 2019 (Monday)\nFORWARD-LOOKING STATEMENTS AND FACTORS THAT COULD CAUSE OUR SHARE PRICE TO DECLINE\nCertain statements included in this press release, other than statements of historical fact, are forward-looking statements. Forward-looking statements generally can be identified by the use of forward-looking terminology such as \"may\", \"will\", \"expect\", \"intend\", \"estimate\", \"anticipate\", \"plan\", \"seek\", \"believe\" or \"timetable\". These forward-looking statements, which are subject to risks, uncertainties, and assumptions, may include projections of our future financial performance based on our growth strategies and anticipated trends in our business. These statements are only predictions based on our current expectations about future events. There are important factors that could cause our actual results, level of activity, performance, or achievements to differ materially from the results, level of activities, performance, or achievements expressed or implied by the forward-looking statements, including, but not limited to, delay in the Company's ability to obtain all requisite permits and approvals from relevant government authorities in relation to the redevelopment of two parcels of properties in Guangming, Shenzhen, and Gushu, Shenzhen, respectively, and the successful redevelopment of the two parcels of properties into Nam Tai Inno Park and Nam Tai Inno City; the sufficiency of the Company's cash position and other sources of liquidity to fund its property developments; continued inflation and appreciation of the Renminbi against the US dollar; rising labor costs in China and changes in the labor supply and labor relations. In particular, you should consider the risks outlined under the heading \"Risk Factors\" in our most recent Annual Report on Form 20-F and in our Current Report filed on Form 6-K from time to time. The Company's decision to continue dividend payments in 2017 does not necessarily mean that dividend payments will continue thereafter. Whether future dividends will be declared depends upon the Company's future growth and earnings, of which there can be no assurance, as well as the Company's cash flow needs for further expansion. Accordingly, there can be no assurance that cash dividends on the Company's common shares will be declared beyond those declared for 2017, what amount those dividends may be or whether such dividends, once declared for a specific period, will continue for any future period, or at all; and whether we will purchase any of our shares in the open markets or otherwise. Although we believe the expectations reflected in the forward-looking statements are reasonable, we cannot guarantee future results, level of activity, performance, or achievements. You should not rely upon forward-looking statements as predictions of future events. These forward-looking statements apply only as of the date of this press release; as such, they should not be unduly relied upon as circumstances change. Except as required by law, we are not obligated, and we undertake no obligation, to release publicly any revisions to these forward-looking statements that might reflect events or circumstance occurring after the date of this release or those that might reflect the occurrence of unanticipated events.\nABOUT NAM TAI PROPERTY INC.\nWe are a real estate developer. We hold two parcels of land located in Guangming and Gushu, Shenzhen, China. We are converting these two parcels of land that formerly housed the manufacturing facilities of our prior businesses into high-tech research and development centers, Nam Tai Inno Park and Nam Tai Inno City. We expect our principal income in the future will be derived from rental income from these research and development centers. Nam Tai Property Inc. is a corporation registered in the British Virgin Islands and listed on the New York Stock Exchange (Symbol: \"NTP\").\nPlease refer to the Nam Tai website ( www.namtai.com ) or the SEC website ( www.sec.gov ) for Nam Tai press releases and financial statements.\nNAM TAI PROPERTY INC.\nCONDENSED CONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nFOR THE PERIODS ENDED DECEMBER 31, 2017 AND 2016\n(In Thousands of US dollars except share and per share data)\nThree months ended December 31,\nTwelve months ended December 31,\n2017\n(Unaudited)\n2016\n(Unaudited)\n2017\n(Unaudited)\n2016\n(Audited)\nOperation income (1)\n$\n187\n$\n603\n$\n1,851\n$\n2,508\nOperation expense\n--\n--\n--\n740\nNet operation income\n187\n603\n1,851\n1,768\nCosts and expenses\nGeneral and administrative expenses\n2,432\n2,018\n9,450\n8,359\n2,432\n2,018\n9,450\n8,359\nOperating loss\n(2,245)\n(1,415)\n(7,599)\n(6,591)\nOther income (expenses), net (2)\n2,721\n(5,223)\n8,495\n(8,497)\nInterest income\n1,620\n1,403\n7,621\n5,554\nWrite off demolished building\n(4,573)\n--\n(4,573)\n--\n(Loss) income before income tax\n(2,477)\n(5,223)\n3,944\n(9,534)\nConsolidated net (loss) income\n$\n(2,477)\n(5,223)\n3,944\n(9,534)\nOther comprehensive income ( 3)\n2,259\n--\n6,311\n--\nConsolidated comprehensive (loss) income\n2,259\n6,311\nConsolidated comprehensive (loss) income ( 4)\n$\n(218)\n$\n(5,223)\n$\n10,255\n$\n(9,534)\n(Loss) earnings per share\nBasic\n$\n0.07\n$\n(0.14)\n$\n0.11\n$\n(0.26)\nDiluted\n$\n0.07\n$\n(0.14)\n$\n0.11\n$\n(0.26)\nWeighted average number of shares ('000)\nBasic\n37,256\n36,647\n36,807\n36,673\nDiluted\n37,256\n36,647\n37,492\n36,673\nNotes:\n(1) The property located at the site of Nam Tai Inno City – Phase II in Gushu has been rented to a third party lessee with a term of three and a half years ending in October 2017.\n(2) Other incomes (expenses), net, include an exchange gain of $2.4 million, income from selling residual scraps from demolished buildings, partly offset by loss from Wuxi operations of $0.2 million for the three months ended December 31, 2017.\n(3) An increase in other comprehensive income due to foreign exchange translation.\n(4) Consolidated comprehensive loss for the three months ended December 31, 2017 mainly include general and administrative expenses of $2.4 million, loss of $4.6 million related to the write down of our old factory buildings located on the eastern section of the Nam Tai Inno City site after their demolition；but partly offset by an exchange gain of $2.4 million as a result of the appreciation of Renminbi against the US dollar in the fourth quarter of 2017, interest income of $1.6 million earned from time deposits and net operation income of $0.2 million.\nNAM TAI PROPERTY INC.\nCONDENSED CONSOLIDATED BALANCE SHEETS\nAS AT DECEMBER 31, 2017 AND DECEMBER 31, 2016\n(In Thousands of US dollars)\nDecember 31 ,\n2017\nDecember 31,\n2016\n(Unaudited)\n(Audited)\nASSETS\nCurrent assets:\nCash and cash equivalents (1)\n$\n165,173\n$\n94,558\nShort term investments (1)\n2,319\n89,624\nPrepaid expenses and other receivables\n5,110\n4,034\nAssets held for sale\n--\n18,970\nTotal current assets\n172,592\n207,186\nReal estate properties under development, net (2)\n52,460\n37,779\nProperty, plant and equipment, net\n36,976\n3,735\nOther assets\n49\n101\nTotal assets\n$\n262,077\n$\n248,801\nLIABILITIES AND SHAREHOLDERS' EQUITY\nCurrent liabilities:\nAccounts payable\n$\n5,705\n$\n845\nAccrued expenses and other payables\n1,500\n1,405\nDividend payable\n10,514\n10,205\nTotal current liabilities\n17,719\n12,455\nEQUITY\nShareholders' equity:\nCommon shares\n376\n364\nAdditional paid-in capital\n249,856\n241,536\nRetained earnings\n(24)\n6,607\nAccumulated other comprehensive loss (3)\n(5,850)\n(12,161)\nTotal shareholders' equity\n244,358\n236,346\nTotal liabilities and shareholders' equity\n$\n262,077\n$\n248,801\nNote:\n(1) According to the definition of \"Balance Sheet\" under the Financial Accounting Standard Board (\"FASB\") Accounting Standards\nCodification (\"ASC\") 210-10-20, cash equivalents are short-term, highly liquid investments that are readily convertible to cash. Only\ninvestments with original maturities of three months or less when purchased qualify under that definition. Therefore, the fixed deposits\nmaturing over three months in amount of $2.3 million and $89.6 million as at December 31, 2017 and December 31, 2016, respectively,\nare not classified as cash and cash equivalents but are separately disclosed as short-term investments in the balance sheet.\n(2) Capitalization on project investment was $4.3 million for Q4 2017, totaling $16.6 million for the twelve months ended December 31,\n2017 and our accumulated project investment was $52.5 million up to December 31, 2017.\n(3) Accumulated other comprehensive loss represented foreign currency translation adjustment.\nNAM TAI PROPERTY INC.\nCONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS\nFOR THE PERIODS ENDED DECEMBER 31, 2017 AND 2016\n(In Thousands of US dollars)\nThree months ended December 31,\nTwelve months ended December 31,\n2017\n(Unaudited)\n2016\n(Unaudited)\n2017\n(Unaudited)\n2016\n(Audited)\nCASH FLOWS FROM OPERATING ACTIVITIES\nConsolidated net income (loss)\n$\n(2,477)\n$\n(5,235)\n$\n3,944\n$\n(9,534)\nAdjustments to reconcile consolidated net income (loss) to net cash provided by operating activities:\n86\nDepreciation and amortization of property, plant and equipment,\nland use rights and other assets\n16\n29\n328\n1,784\nLoss(gain) on disposal of property, plant and equipment\n--\n--\n(25)\n(14)\nGain on disposal of idle property, plant and equipment\n4,573\n--\n--\n(8)\nWrite off demolished building\n57\n4,573\nImpairment on other assets\n303\n57\nShare-based compensation expenses\n303\n388\n1,126\n1,035\nUnrealized exchange (gain) loss\n(526)\n3,248\n(6,712)\n3,370\nChanges in current assets and liabilities:\n(Increase) decrease in prepaid expenses and other receivables\n(1,202)\n38\n(1,035)\n(618)\n(Decrease) increase in accrued expenses and other payables\n(402)\n314\n3\n(1,225)\nTotal adjustments\n2,885\n(4,017)\n(1,035)\n4,324\nNet cash provided by (used in) operating activities\n$\n408\n$\n(1,218)\n$\n2,259\n$\n(5,210)\nCASH FLOWS FROM INVESTING ACTIVITIES\nPayments for real estate properties under development\n$\n(7,065)\n$\n(903)\n$\n(11,935)\n$\n(5,577)\nPurchase of property, plant & equipment\n(13,242)\n--\n(13,377)\n(525)\nDecrease (increase) in deposits for real estate properties under\ndevelopment\n81\n21\n(74)\n304\nDecrease in deposits for purchase of property, plant and equipment\n13,838\n--\n--\n4\nProceeds from disposal of property, plant and equipment\n--\n--\n67\n14\nProceeds from disposal of idle property, plant and equipment\n--\n--\n--\n8\nProceeds from disposal of demolished building\n550\n550\nCash received from finance lease receivable\n--\n--\n--\n1,371\nDecrease (increase) in short term investments\n7,725\n12,901\n87,384\n(39,719)\nNet cash provided by (used in) investing activities\n$\n1,432\n$\n12,901\n$\n62,615\n$\n(44,120)\nCASH FLOWS FROM FINANCING ACTIVITIES\nCash dividends paid\n$\n(2,596)\n$\n(734)\n$\n(10,266)\n$\n(2,936)\nProceeds from shares issued for option exercise\n3,023\n--\n6,908\n3,289\nShare repurchase program\n--\n--\n--\n(6,259)\nNet cash provided by (used in) financing activities\n$\n427\n$\n(734)\n$\n(3,358)\n$\n(5,906)\nNet increase (decrease) in cash and cash equivalents\n$\n2,267\n$\n10,067\n$\n67,516\n$\n(55,236)\nCash and cash equivalents at beginning of period\n161,407\n89,539\n94,558\n157,371\nEffect of exchange rate changes on cash and cash equivalents and short\nterm investments\n1,499\n5,048\n9,099\n(7,577)\nCash and cash equivalents at end of period\n$\n165,173\n$\n94,558\n$\n165,173\n$\n94,558\nNAM TAI PROPERTY INC.\nNOTES TO CONDENSED CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE PERIODS ENDED DECEMBER 31, 2017 AND 2016\n(In Thousands of US dollars)\nThese financial statements, including the consolidated balance sheet as of December 31, 2016, which was derived from audited financial statements, do not include all of the information and notes required by U.S. Generally Accepted Accounting Principles for complete financial statements and should be read in conjunction with the consolidated financial statements and accompanying notes included in the Company's annual report on Form 20-F for the fiscal year ended December 31, 2016. In the opinion of management, all adjustments (consisting of normal, recurring adjustments) considered necessary for a fair presentation have been included. Operating results for the interim periods presented are not necessarily indicative of the results that may be expected for the full year ended December 31, 2017. Accumulated other comprehensive loss represents foreign currency translation adjustments. The consolidated comprehensive income (loss) was $(2,477) and $(5,235) for the three months ended December 31, 2017 and 2016, respectively, and was $3,944 and $(9,534) for the twelve months ended December 31, 2017 and 2016, respectively. A summary of the operation income, other income (expenses), net, net income (loss) and long-lived assets by geographical areas is as follows:\nThree months ended December 31,\nTwelve months ended December 31,\n2017\n2016\n2017\n2016\nOPERATION INCOME WITHIN:\n-PRC, excluding Hong Kong\n$\n187\n$\n603\n$\n1,851\n$\n2,508\nOTHER INCOME (EXPENSES), NET:\n- Gain (loss) on exchange difference\n$\n2,419\n$\n(5,201)\n$\n8,582\n$\n(8,294)\n- Interest income from finance lease receivable\n--\n--\n--\n16\n- Gain on disposal of idle property, plant, and equipment\n529\n--\n529\n8\n- Loss from Wuxi operations\n(230)\n(164)\n(693)\n(634)\n- Others\n3\n142\n77\n407\nTotal other income (expenses), net\n$\n2,721\n$\n(5,223)\n$\n8,495\n$\n(8,497)\nNET INCOME (LOSS) FROM OPERATIONS WITHIN:\n- PRC, excluding Hong Kong\n$\n(5,292)\n$\n(146)\n$\n(6,759)\n$\n(2,106)\n- Hong Kong\n2,815\n(5,089)\n10,703\n(7,428)\nTotal net income (loss)\n$\n2,477\n$\n(5,235)\n$\n3,944\n$\n(9,534)\nDecember 3 1 ,2017\nDecember 31, 2016\nLONG-LIVED ASSETS WITHIN:\n- Real estate properties under development in PRC, excluding\nHong Kong\n$\n56,460\n$\n37,779\n- Property, plant and equipment in PRC, excluding Hong Kong\n33,894\n507\n- Hong Kong\n3,082\n3,228\nTotal long-lived assets\n$\n89,436\n$\n41,514\nView original content: http://www.prnewswire.com/news-releases/nam-tai-property-inc-reports-q4-2017-results-300589327.html\nSOURCE Nam Tai Property Inc.", "external_links": ["http://www.namtai.com/investors#investors/quarterly_earnings", "http://www.prnewswire.com/news-releases/nam-tai-property-inc-reports-q4-2017-results-300589327.html", "http://www.sec.gov/", "http://www.namtai.com/"], "published": "2018-01-29T14:00:00.000+02:00", "crawled": "2018-01-29T16:49:19.020+02:00", "highlightTitle": ""}