{"organizations": [], "uuid": "00c077e0d59eecc28f5ff6da92482e22c8a371a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/india", "section_title": "India", "url": "https://www.reuters.com/article/us-india-sexcrimes-justice/indian-rape-survivors-still-subjected-to-intrusive-illegal-tests-idUSKBN1EZ0PX", "country": "US", "domain_rank": 408, "title": "Indian rape survivors still subjected to intrusive, illegal tests", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.093, "site_type": "news", "published": "2018-01-10T16:26:00.000+02:00", "replies_count": 0, "uuid": "00c077e0d59eecc28f5ff6da92482e22c8a371a0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-india-sexcrimes-justice/indian-rape-survivors-still-subjected-to-intrusive-illegal-tests-idUSKBN1EZ0PX", "ord_in_thread": 0, "title": "Indian rape survivors still subjected to intrusive, illegal tests", "locations": [], "entities": {"persons": [], "locations": [{"name": "mumbai", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 8:26 AM / Updated 8 hours ago Indian rape survivors still subjected to intrusive, illegal tests Roli Srivastava 3 Min Read \nMUMBAI (Thomson Reuters Foundation) - Rape survivors in India continue to be subjected to intrusive tests that the government and courts banned years ago, campaigners said Wednesday. \nThe Supreme Court ruled in 2013 that the “two-finger test”, which involves a doctor inserting fingers into the vagina to determine if the victim is sexually active, violated the right to privacy. \nThe government in 2014 issued fresh guidelines that did away with the practice, which is primarily a virginity test, saying it “had no bearing on a case of sexual violence”. \nThe guidelines also directed investigators to focus more on victim and witness testimonies, rather than relying on physical examinations to check for injuries to the genital area. \nYet, the two-finger test continues to be performed, victim testimonies are given little weight and investigators are “preoccupied with genital injuries”, said more than 50 activists and experts in a letter to India’s health ministry. \n“The absence of injuries is frequently equated with the absence of assault and denies their rights and autonomy,” said the letter, which was shared with the Thomson Reuters Foundation. \nThe government introduced reforms after the fatal gang rape of a woman on a bus in Delhi in 2012, which sparked domestic and international outrage. \nCampaigners hoped that new guidelines would improve conviction rates by shifting the focus to testimonies rather than humiliating and ineffective medical tests. \nHowever, the letter states that just a handful of states have issued orders to implement the guidelines, and that only a few urban healthcare facilities in those states are following them. \n“(According to) the traditional form of examination, a majority of survivors would have not been raped,” said Padma Deosthali, a signatory who was key consultant to the government’s 2014 reforms. \nThe southern state of Kerala has issued its own version of the guidelines, which includes the two-finger test, said the letter which was sent to the health ministry last week. \nThe ministry said in an emailed response to questions that it is holding workshops across the country to help state authorities understand the guidelines. \nSome states have already implemented them, while others are in the process of doing so, the ministry said. \nThe ministry will take action if it receives reports that the guidelines are being ignored, said Sanjeeva Kumar, an additional secretary for health and family welfare. \nIn a report released late last year that examined the impact of the reforms, Human Rights Watch found that victims had little access to support services and doctors at a Rajasthan hospital were still performing the two-finger test. Reporting by Roli Srivastava @Rolionaroll; Editing by Jared Ferrie. Please credit Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women’s rights, trafficking, property rights, climate change and resilience. Visit news.trust.org", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T16:26:00.000+02:00", "crawled": "2018-01-10T15:58:09.005+02:00", "highlightTitle": ""}