{"organizations": [], "uuid": "f566d9f98c76cffceaa34d17b2eed62ef801e1d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/26/104610435-GettyImages-821729444_1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/britains-open-to-foreign-investment-trade-minister-fox-tells-china.html", "country": "US", "domain_rank": 767, "title": "Britain's open to foreign investment, trade minister Fox tells China", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-03T14:11:00.000+02:00", "replies_count": 0, "uuid": "f566d9f98c76cffceaa34d17b2eed62ef801e1d8"}, "author": "Eric Thayer", "url": "https://www.cnbc.com/2018/01/03/britains-open-to-foreign-investment-trade-minister-fox-tells-china.html", "ord_in_thread": 0, "title": "Britain's open to foreign investment, trade minister Fox tells China", "locations": [], "entities": {"persons": [{"name": "fox", "sentiment": "negative"}, {"name": "liam fox", "sentiment": "none"}, {"name": "eric thayer", "sentiment": "none"}], "locations": [{"name": "china the u.s.", "sentiment": "none"}, {"name": "china britain", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "american enterprise institute", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "moneygram international inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "moneygram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "British trade minister Liam Fox said on Wednesday that London would continue to welcome foreign investment, after a U.S. panel rejected a Chinese acquisition of a U.S. money transfer company on national security concerns.\nFox was on a visit to China , the latest installment in long-running economic talks between China and Britain , which has taken on new importance for Britain as it looks to re-invent itself as a global trading nation after leaving the European Union in 2019.\nThe U.S. rejection of China's Ant Financial's acquisition of MoneyGram International Inc is the most high-profile Chinese deal to be torpedoed under the administration of U.S. President Donald Trump .\nAsked whether Britain would serve as an alternative destination for such Chinese investment, Fox told Reuters in an interview that he hoped the investment relationship would \"work in two directions\", but that Britain would remain open.\n\"Of course, we would look, as other countries would do, at our security issues in terms of investment. But the UK has traditionally been an open country, welcoming of foreign direct investment. And we'll continue to do that,\" Fox said.\nHe did not comment specifically on the U.S. panel decision.\nChina is one of the countries with which Britain hopes to sign a free trade pact once it leaves the EU, and London and Beijing have been keen to show that Britain's withdrawal from the bloc will not affect ties.\nFox said that the issue of China's service sector openness was a \"big issue\" for Britain, but that there were more options than a post-Brexit free trade agreement (FTA) to get Beijing to open, including specific service sector agreements and mutual recognition deals.\n\"There are a whole range of tools in the box. And people tend to talk as though an FTA is the only tool we have available in terms of trade liberalization. It's not,\" he said.\nThe focus on a \"Golden Era\" of relations, trumpeted by China and Britain in 2015 when then-prime minister David Cameron hosted a state visit by Chinese President Xi Jinping, has cooled under Cameron's successor, Theresa May.\nIn 2016, May caused a diplomatic spat by unexpectedly deciding to delay approval of a partly-Chinese funded nuclear power project. She later granted it, but not before drawing criticism from Beijing.\nMay is expected to visit China later this month accompanied by a business delegation, diplomatic and business sources have told Reuters, though the trip has not been formally confirmed.", "external_links": [], "published": "2018-01-03T14:11:00.000+02:00", "crawled": "2018-01-03T14:10:58.006+02:00", "highlightTitle": ""}