{"organizations": [], "uuid": "46db8dbc9f0d0881177cadcc8f8408a93cdd00e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223485840&w=1200&r=LYNXMPEE0J01H", "site_section": "http://feeds.reuters.com/reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-maryland-baltimore/baltimore-fires-police-commissioner-who-failed-to-curb-murder-rate-idUSKBN1F9017", "country": "US", "domain_rank": 408, "title": "Baltimore fires police commissioner who failed to curb murder rate", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T02:28:00.000+02:00", "replies_count": 0, "uuid": "46db8dbc9f0d0881177cadcc8f8408a93cdd00e0"}, "author": "", "url": "https://www.reuters.com/article/us-maryland-baltimore/baltimore-fires-police-commissioner-who-failed-to-curb-murder-rate-idUSKBN1F9017", "ord_in_thread": 0, "title": "Baltimore fires police commissioner who failed to curb murder rate", "locations": [], "entities": {"persons": [{"name": "kevin davis", "sentiment": "none"}, {"name": "catherine pugh", "sentiment": "none"}, {"name": "darryl desousa", "sentiment": "none"}, {"name": "bernie woodall", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}], "locations": [{"name": "baltimore", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Baltimore’s mayor, citing a lack of progress in curbing violent crime in a city that had a historic murder rate last year, on Friday fired the city’s police commissioner and named a 30-year veteran of the department to lead it.\nMayor Catherine Pugh named Darryl DeSousa, 53, as the new commissioner, replacing Kevin Davis.\n“We need the numbers to go down faster,” Mayor Catherine Pugh said of the city’s violent crimes at a news conference.\n“The fact is, we are not achieving the pace of progress that our residents have every right to expect in the weeks since we ended what was nearly a record year for homicides,” she said.\nBaltimore in 2017 had 343 homicides, the highest per capita rate in the city’s history and by far the highest murder rate among the largest 30 U.S. cities, the Baltimore Sun reported.\nIn each year of Davis’ tenure, the city had at least 300 murders.\nDavis himself was named commissioner after the previous commissioner was fired following the death in April 2015 of 25-year-old Freddie Gray while he was in police custody. Davis was initially named interim commissioner, in July 2015, and was named permanently to the position in October of that year.\nDavis led a department marred by scandal in 2017, such as the arrests on racketeering charges of seven police officers.\nIn the first dozen days of 2018, there were 11 murders committed in the city, according to a log of the city’s homicides compiled by The Baltimore Sun.\nHomicides in Baltimore last year were 20 percent higher than New York, a city 10 times the size, The New York Times reported.\nDeSousa said that reducing violent crime will far and away be the top priority of the department under his leadership, adding that he will “immediately” add patrol officers on the city’s streets.\nDeSousa’s appointment is subject to approval by the City Council.\nA New York City native, DeSousa moved to Baltimore in 1983 to attend Morgan State University, a historically black institution. He left college to become a Baltimore police officer 30 years ago and later achieved a college degree, the city’s statement said.\nDavis’ firing comes after he said last week that the police department was making progress.\n“This is a dysfunctional police department,“ he said in an interview with the Baltimore Sun. ”I’m telling you as a person who has seen what a healthy organization looks like. This is not one of them. But we’re making huge strides in getting there.”\nReporting by Bernie Woodall in Fort Lauderdale, Fla.; Editing by Leslie Adler\n ", "external_links": [], "published": "2018-01-20T02:28:00.000+02:00", "crawled": "2018-01-20T02:53:28.009+02:00", "highlightTitle": ""}