{"organizations": [], "uuid": "6ec63fa53e9091a5c34c6e3e7451f6c86d0f67c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/china-economy-pmi-factory-official/update-1-china-january-factory-growth-dips-to-8-month-low-as-pollution-war-bites-idUSL4N1PQ16R", "country": "US", "domain_rank": 408, "title": "UPDATE 2-China January factory growth dips to 8-month low as pollution war bites", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T09:39:00.000+02:00", "replies_count": 0, "uuid": "6ec63fa53e9091a5c34c6e3e7451f6c86d0f67c6"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/china-economy-pmi-factory-official/update-1-china-january-factory-growth-dips-to-8-month-low-as-pollution-war-bites-idUSL4N1PQ16R", "ord_in_thread": 0, "title": "UPDATE 2-China January factory growth dips to 8-month low as pollution war bites", "locations": [], "entities": {"persons": [{"name": "stella qiu", "sentiment": "none"}, {"name": "ryan woo", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "pmi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Jan official factory PMI dips to 51.3, 8-month low\n* Jan official services PMI edges up to 55.3, 4-month high\n* Factory reading reinforces views economic momentum is cooling\n* But data suggests economy remains resilient (Adds breakdown of factory PMI, China composite PMI)\nBy Stella Qiu and Ryan Woo\nBEIJING, Jan 31 (Reuters) - Growth in China’s manufacturing sector slowed more than expected in January to an 8-month low in the face of a cooling property market and tighter pollution rules that have curtailed factory output.\nThe data, which gives global investors their first look at business conditions in China at the start of 2018, reinforced the view that the economy is beginning to gradually lose steam after growing by a better-than-expected 6.9 percent last year.\nThe official Purchasing Managers’ Index (PMI) released on Wednesday edged lower to 51.3 in January, compared with 51.6 in December. But it remained comfortably above the 50-point mark that separates growth from contraction on a monthly basis.\nAnalysts surveyed by Reuters had forecast the headline number would ease slightly to 51.5.\nIndexes for output, total new orders and imports all showed more moderate expansion in January compared with last month, while export orders fell marginally. The new export order index dropped to 49.5, 2.4 percentage point lower than December’s reading.\nHowever, the overall factory reading still appeared relatively solid, marking the 19th straight month of expansion and reinforcing expectations that any slowdown in the economy would be gradual. Economists polled by Reuters are pencilling in growth of 6.5 percent this year.\nA separate PMI on the steel sector rose to 50.9 in January from 50.2 in December.\nIn another sign of broader economic resilience, a sister survey showed activity in China’s service sector accelerated to a four-month high in January. The official non-manufacturing Purchasing Managers’ Index (PMI) rose to 55.3 from 55 in December.\nThe services sector accounts for over half of China’s economy, with rising wages giving Chinese consumers more spending power.\nA buoyant services industry is welcome news for the policymakers who are counting on growth in services and consumption to rebalance their economic growth model from its heavy reliance on investment and exports.\nTRADE RISKS Boosted by government infrastructure spending, a resilient property market and unexpected strength in exports, China’s manufacturing and industrial firms were a major driver behind the solid economic growth last year.\nBut analysts say increasing trade frictions with the United States could cloud the outlook for exporters in the world’s second-largest economy.\nU.S. President Donald Trump slapped steep tariffs on imported washing machines and solar panels last week. China is the world’s biggest solar panel producer.\nThe decisions were the first of several potential tariff actions that Trump may take in the coming weeks and months. He is also considering recommendations on import restrictions for steel and aluminium and other trade sanctions against China over its intellectual property practices.\nA slowing property market is also likely to dent China’s industrial activity this year, dampening demand for building materials from glass to steel. Property investment growth in December alone moderated to 2.4 percent from a year earlier, the lowest since July 2016.\nMoreover, China is expected to continue a wide-ranging crackdown this year on riskier types of financing and debt. The campaign is slowly pushing up companies’ borrowing costs and making it harder and more expensive for weaker firms to raise funds.\n“Looking ahead, some of the recent weakness in manufacturing may be partially reversed in the coming months as disruptions caused by the anti-pollution campaign fade,” Julian Evans-Pritchard, senior China Economist at Capital Economics, wrote in a research note on Wednesday.\n“But any rebound is likely to prove short-lived given that the drags on economic activity from slower credit growth and the cooling property market are set to intensify this year.”\nChina also published a composite PMI for the first time on Wednesday, covering both manufacturing and services activity in a bid to better capture overall economic trends.\nThe composite PMI stood at 54.6 in January, well above the 50-mark that separates expansion from contraction and unchanged for a third month.\nReporting by Stella Qiu and Ryan Woo; Editing by Kim Coghill\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T09:39:00.000+02:00", "crawled": "2018-01-31T16:10:01.012+02:00", "highlightTitle": ""}