{"organizations": [], "uuid": "f36d31fa0ab60fb9560175d6c8adbd787ef38881", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-nors-samuelsson/olympics-swede-samuelsson-sets-sights-on-biathlon-team-medal-idUKKBN1EW0I6", "country": "US", "domain_rank": 408, "title": "Olympics - Swede Samuelsson sets sights on biathlon team medal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T15:21:00.000+02:00", "replies_count": 0, "uuid": "f36d31fa0ab60fb9560175d6c8adbd787ef38881"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-nors-samuelsson/olympics-swede-samuelsson-sets-sights-on-biathlon-team-medal-idUKKBN1EW0I6", "ord_in_thread": 0, "title": "Olympics - Swede Samuelsson sets sights on biathlon team medal", "locations": [], "entities": {"persons": [{"name": "samuelsson", "sentiment": "negative"}, {"name": "sebastian samuelsson", "sentiment": "none"}], "locations": [{"name": "pyeongchang", "sentiment": "none"}, {"name": "solleftea", "sentiment": "none"}], "organizations": [{"name": "olympics", "sentiment": "none"}, {"name": "international biathlon union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 1:22 PM / Updated 12 minutes ago Olympics - Swede Samuelsson sets sights on biathlon team medal Philip O'Connor 3 Min Read \nSTOCKHOLM (Reuters) - After winning rookie of the year honours in his first season, biathlete Sebastian Samuelsson has set his sights on winning a medal in the relay with the Swedish team at the Pyeongchang Olympics. \nSamuelsson notched four top 20 finishes to come in 47th place overall in the 2016/17 International Biathlon Union (IBU) season as part of a youthful Swedish team and he is now switching his focus to Pyeongchang. \n“It would mean fulfilling a dream that I’ve had since I was small. Since I started with sport, the Olympics has been the big one,” Samuelsson said. \n“I’ve watched it on TV, it’s the big highlight for every athlete, and to experience that would be incredible.” \nSamuelsson started out as a cross-country skier before his head was turned while watching a biathlon competition in his home town of Solleftea, and soon after he was learning how to shoot with an air rifle. \n“It’s very technical, especially in the prone position as you have to lie in the same way every time to make sure the shots go to the same place,” he said. \n“It gets harder and harder the more pressure is on - all of a sudden if you’re shooting for a medal in the Olympics or a good place in the World Cup, it’s easy for your thoughts to run away and to get nervous. That makes it a lot harder,” he said. \nSamuelsson is well aware of his relative lack of comparative experience, and said he hopes to learn from the Olympics. \n”In some way, you want your best result for the season to be at the Olympics, to have a little better form, shoot well - it’s more about precision, to arrive there and have a good race and shoot well. \n“Then whatever place you get, that’s hard to say, but top 10 in the Olympics would be a dream. Top-20 would be good too, I‘m still a junior, I’ll be at the Olympics to see and learn.” \nSamuelsson and his team mates know that competition will be stiff in South Korea. \n“The IBU has invested in broadening the sport, even in smaller nations,” he said. \n”In cross-country skiing, there are very few nations who have a chance, but in the men’s class in biathlon, there’s probably 30 athletes who could win a medal if they have a good day. \n“Then you have the likes of Martin Fourcade of France, clearly those guys are a step ahead in some ways, so you can’t make a mistake with the shooting.” \nSamuelsson may be going to the Olympics to learn, but he believes that he and his fellow Swedes have a good shot at a medal. \n“In particular in the relay, I think Sweden have a really good chance,” he said. Reporting by Philip O'Connor, additional reporting by Haidar Hajdari; Editing by Greg Stutchbury", "external_links": [], "published": "2018-01-07T15:21:00.000+02:00", "crawled": "2018-01-07T15:37:52.001+02:00", "highlightTitle": ""}