{"organizations": [], "uuid": "8155f2443c5a882851c56dcc5f08709a6e750ea1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-context-labs-acquires-iot-impactlabs.html", "country": "US", "domain_rank": 767, "title": "Context Labs Acquires IoT ImpactLABS", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T16:00:00.000+02:00", "replies_count": 0, "uuid": "8155f2443c5a882851c56dcc5f08709a6e750ea1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-context-labs-acquires-iot-impactlabs.html", "ord_in_thread": 0, "title": "Context Labs Acquires IoT ImpactLABS", "locations": [], "entities": {"persons": [{"name": "dan harple", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}], "organizations": [{"name": "context labs", "sentiment": "none"}, {"name": "cxl", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMBRIDGE, Mass., Jan. 11, 2018 /PRNewswire/ -- Context Labs (CXL) announced today that it has acquired IoT ImpactLABS . The acquisition will further accelerate CXL's blockchain-based Immutably™ platform in its movement upstream in the supply chain, enabling the \"Supply Chain of Everything.\" The acquisition will accelerate integration with IoT-connected devices, sensors and systems.\nIn practical terms, this means that supply chains for perishable goods such as food can be tracked from field to table, water from source to tap, device firmware from burn-in to upgrade and climate data from sensor to research to analytics. Context Labs has coined this physical/digital/virtual blockchain-enabled environment the \"Supply Chain of Everything.\"\n\"This key functionality will further provide what the industry has coined the 'birth certificate' or 'passport' of physical things to be cryptographically encoded and tracked, from the point of inception through its end of life,\" stated Dan Harple, CEO of Context Labs. \"The IoT ImpactLABS acquisition strengthens our ProofWorks™ and Immutably™ platform to deeply enhance IoT/Blockchain integration, providing proof of the 'birth certificates' of things and data. It creates a verifiable proof of existence for the data or physical thing pinned to a particular point in time, with a 'context proof' in the interconnected network graph of supply chain partners.\"\nThe proofs and the signatures are registered on one or more public ledgers or published on widely available media channels such as Twitter, Facebook, etc. Context Labs' Scrivener Ledger provides interoperability between multi-ledger registrations, insuring multi-layered secure veracity and provenance.\nCommenting on the impact of the deal on the supply chain landscape, Bill McBeath, chief research officer at Chainlink Research , commented, \"With the cost of sensors and connectivity continuing to plummet, IoT-enabled supply chains are poised for wide adoption across myriad applications such as traceability (for provenance assurance, anti-counterfeiting, regulatory, etc.), predictive maintenance, freshness/expiration, environmental monitoring, precise ETA, cargo security and much more. Combining blockchain and network graph analysis with IoT-enabled supply chains provides very high confidence in the transactions and highly granular tamper-proof visibility data. The addition of ImpactLabs to Context Labs' already substantial portfolio makes them a leading player with a unique combination of capabilities in this area.\"\nIn an era of fake data, fake news and counterfeit/copied products, CXL's Immutably™ product line was designed to insure authenticity, provenance and reliability in the delivery of physical, digital and virtual goods. With this reality, customers increasingly seek to provide regulatory and legal certification specifying the provenance and authenticity of their products. The acquisition serves to drive authenticity and provenance further upstream into supply chains, making it even harder for fake data, fake news and counterfeit products to reach their targets.\nChris Rezendes, founder and managing director of IoT ImpactLABS, stated, \"The combination of our market-making and thought leadership with the core platform innovation from Context Labs is what our stakeholders have sought. The IoT ImpactLABS team has built significant, relevant experience with what works, and does not, in IoT specifically, and a related collection of digital tools more broadly. Through our focus on natural resources, smart cities, resilient infrastructure, food security and SMB Industry 4.0, we have developed a unique ability to identify and access a number of complex opportunities.\"\n\"With this deal, Context Labs is accelerating its platform to provide a device-agnostic Internet of Things (IoT) API layer to deliver a seamless 'plug and play' for a wide range of IoT devices, sensors, embedded systems and instrumentation. This innovation in IoT interoperability is a key differentiator for our Immutably™, Proofworks™ and Impact Analytics™ product line, giving customers what they have requested - the ability to identify, track and trace upstream IoT and sensor data into our supply chain platform,\" stated Gavin Nicol, CTO of Context Labs.\nThe world is in transition from centralized to decentralized structures. This relates to areas such as energy (e.g., distributed renewables), mobility (e.g., distributed ownership), land management (e.g., distributed finance) as well as currencies and markets in general. This trend affects all industries and it requires fundamentally new approaches (bottom-up rather than top-down) for industry and government. The private sector increasingly gets the message. The Context Labs product family has its core DNA in these transformative and disruptive technologies.\nCommenting on the acquisition, Rob van Kranenburg, founder of the IOT Council and Chair of AC4, Hyper Connected Society, The European Research Cluster on the Internet of Things, stated, \"The Context Labs combination with IoT ImpactLABS impacts the direction of a world in which every object will have a Digital Twin. As we build the ecosystem of digital twins, we best pay the utmost attention as we only get one chance of doing it in the most transparent and attested way. The Digital Twin may be a concept currently tied to Industrial IoT, but we are moving to a place that is more mainstream. Context Labs is leading a major step in this direction.\"\nAbout Context Labs\nContext Labs, with offices in Cambridge, Massachusetts, and Amsterdam, The Netherlands, provides enterprise-grade platform solutions that provide trust and transparency for all things digital and physical. We develop solutions that utilize blockchain technology to build confidence and trust with partners and consumers, transforming supply chain ecosystems. The company achieves this by delivering platform innovation integrating secure distributed and shared ledgers (Blockchain), network graph analytics and visualizations, machine learning, data interoperability and trusted identity management. The platform consists of several core components - Chainplate Foundation™, Snapshackle Interoperability™ and VUEgraph Analytics™ and product solutions - Immutably™, Proofworks™, Impact Analytics™, along with blockchain ecosystem consulting. Enabling the Supply Chain of Everything.\nWeb: www.contextlabs.com , www.proofworks.io , www.contextlabs.com/overview\ntwitter: @contextlabsbv\nE-mail: press@contextlabs.com\nAbout IoT Impact Labs\nImpactLABS brings together early-stage IoT companies, tech and industry leaders, small and mid-sized enterprises and subject matter experts to instrument the physical world with intelligence and intention for profit and resilience. The company is a proof point production plant, providing live-pilot early-stage IoT solutions with Fortune 500 technology and industry partners in the field with real-world innovators in small and mid-sized enterprises.\nWeb: www.iotimpactlabs.com\ntwitter: @ImpactLABS\nE-mail: press@contextlabs.com\nRelated Images\nimage1.png\nimage2.png\nRelated Links\nProofworks\nContext Labs Overview\nView original content with multimedia: http://www.prnewswire.com/news-releases/context-labs-acquires-iot-impactlabs-300581261.html\nSOURCE Context Labs", "external_links": ["http://www.theinternetofthings.eu/", "http://www.contextlabs.com/", "http://www.prnewswire.com/news-releases/context-labs-acquires-iot-impactlabs-300581261.html", "http://www.chainlinkresearch.com/", "http://www.proofworks.io/", "http://www.contextlabs.com/overview", "https://iotimpactlabs.com/", "http://www.iotimpactlabs.com/"], "published": "2018-01-11T16:00:00.000+02:00", "crawled": "2018-01-11T19:54:38.003+02:00", "highlightTitle": ""}