{"organizations": [], "uuid": "3afab9c3d91486e7c658ad101aea60957c4f16be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-finley-asphalt-concretes-newly-elected-chief-operating-officer-2018-corporate-upgrade.html", "country": "US", "domain_rank": 767, "title": "Finley Asphalt & Concrete's Newly Elected Chief Operating Officer & 2018 Corporate Upgrade", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T16:30:00.000+02:00", "replies_count": 0, "uuid": "3afab9c3d91486e7c658ad101aea60957c4f16be"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-finley-asphalt-concretes-newly-elected-chief-operating-officer-2018-corporate-upgrade.html", "ord_in_thread": 0, "title": "Finley Asphalt & Concrete's Newly Elected Chief Operating Officer & 2018 Corporate Upgrade", "locations": [], "entities": {"persons": [{"name": "erick finley", "sentiment": "none"}, {"name": "lewis finley", "sentiment": "none"}, {"name": "glenn shapiro", "sentiment": "none"}, {"name": "finley", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "manassas", "sentiment": "none"}], "organizations": [{"name": "finley asphalt & concrete", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MANASSAS, Va., Jan. 15, 2018 /PRNewswire/ -- In the first yearly executive board meeting led by company President Lewis Finley and CEO Erick Finley (plus other leading members) of Finley Asphalt & Concrete, the 50+ year paving company unanimously assembled to carve out a brand new and significant position of CHIEF OPERATING OFFICER- a leadership structure upgrade dedicated to meet the company's 2018 expansion plans. This vital role was appointed to Mr. Glenn Shapiro on the eve of his first year anniversary when he assumed the title of Vice President.\nBy definition, a Chief Operating Officer position holds the leadership and management capacity necessary to ensure that the company has the proper operational controls in administrative, reporting procedures, and people systems. One who holds this rank shall pursue continued and overall growth of the organization from the various significant angles while supporting both financial strength and operational efficiency.\nFulfilling the title of COO, Glenn Shapiro was dubbed this position as part evidence of Finley's evolutionary directive from the \"family-style\" blueprint it was founded with- to the modernizing roadmap that its future expects and deserves. He was carefully hand-selected based on his proven level of commitment to the company's overall mission. \"By modifying our leadership structure, we are (now) able to better diversify, manage our productivity, cover more ground and gain new strength from fresh ideas… and having Glenn carry that mantle represents our step in the right direction,\" states Erick Finley.\nMr. Shapiro defined his mark in the trade by working the many essential bases of growing an asphalt business from leadership positions. He spent over 12 years in the paving industry and earned his reputation and his holistic understanding of the world of asphalt. From companies on the rise to veteran pioneers like Finley, Glenn Shapiro's stellar track record carries a consistent mark of renewed vision to support quality service while inspiring internal improvements for the company he represents. He led marketing teams, expansion projects and national campaigns for major asphalt companies in the Northeast (such as Greenpatch, Cold Mix Manufacturing, RCA Asphalt, and GemSeal to name a few). Glenn captured many major touchdowns in the municipal and commercial fronts while earning new trusting relationships from the top players.\nGlenn Shapiro enters the new year 'armed and ready' with a new set of resources that grants him the keys to make even more of a difference and shape the next stage of success for the Finley brand. His dedication to \"spearhead the development, communication, and implementation of effective growth strategies\" means adapting to today's competitive arena and demands while facing the next phase of Finley's performance design.\nWith headquarters in Bristow and Richmond, VA, Finley Asphalt and Concrete has been servicing the region's commercial asphalt and paving needs for over 50 years and is recognized as one of the most reputable and top quality pacing contractors. For more info, visit: www.finleyasphalt.com or for media contact: call Ryan Schray at 703-201-8807 / 188658@email4pr.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/finley-asphalt--concretes-newly-elected-chief-operating-officer--2018-corporate-upgrade-300582075.html\nSOURCE Finley Asphalt & Concrete", "external_links": ["http://www.finleyasphalt.com/", "http://www.prnewswire.com/news-releases/finley-asphalt--concretes-newly-elected-chief-operating-officer--2018-corporate-upgrade-300582075.html"], "published": "2018-01-15T16:30:00.000+02:00", "crawled": "2018-01-15T19:02:51.011+02:00", "highlightTitle": ""}