{"organizations": [], "uuid": "ca45f7352cf890c86e626206c447d06b4ab10d60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/25/reuters-america-update-2-intuitive-surgical-sees-thinner-profit-margins-in-2018-shares-fall.html", "country": "US", "domain_rank": 767, "title": "UPDATE 2-Intuitive Surgical sees thinner profit margins in 2018, shares fall", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T01:45:00.000+02:00", "replies_count": 0, "uuid": "ca45f7352cf890c86e626206c447d06b4ab10d60"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/25/reuters-america-update-2-intuitive-surgical-sees-thinner-profit-margins-in-2018-shares-fall.html", "ord_in_thread": 0, "title": "UPDATE 2-Intuitive Surgical sees thinner profit margins in 2018, shares fall", "locations": [], "entities": {"persons": [], "locations": [{"name": "sunnyvale", "sentiment": "none"}], "organizations": [{"name": "thomson reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "intuitive surgical inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Sees 2018 margins at 70-71.5 pct, down from 71.9 pct in 2017\n* Expects 2018 operating expenses to grow 16-18 pct\n* Shares down 3 pct after the bell\n* 4th-qtr profit beats estimate (Adds profit margins forecast from earnings call, analyst comment; updates share price)\nJan 25 (Reuters) - Intuitive Surgical Inc said on Thursday it would continue to spend heavily on research and development in 2018, seeking to fend off competition and maintain its dominance in the surgical robotic systems market.\nCompany executives also forecast profit margins for 2018 below 2017 levels on a call with analysts after Intuitive reported better-than-expected earnings for the fourth quarter.\nSunnyvale, California-based Intuitive's shares, which hit a record high earlier in the day, fell 3 percent in after-hours trading.\nExcluding a $318 million tax expense, Intuitive reported earnings of $2.54 per share. The result exceeded analysts' average estimate by 30 cents, according to Thomson Reuters I/B/E/S.\nBut investors, who sent the company's stock up 73 percent last year and 23 percent in 2018, may have been expecting a bigger earnings outperformance, said Brandon Henry, an analyst at RBC Capital Markets.\nIntuitive has enjoyed a near monopoly in the market for robots used in abdominal surgery since launching its flagship device called da Vinci in 2000.\nBut the company has ramped up spending on product development in recent months to remain ahead of competition.\nThe FDA approved Transenterix Inc's surgical robot for abdominal surgery in October. The news weighed on Intuitive's stock price even though the device was not expected to compete directly with da Vinci.\nIntuitive said operating expenses rose 16.6 percent year-over-year to $306.3 million in the fourth quarter ended Dec. 31.\nOperating expenses this year will rise 16 to 18 percent above 2017 levels, as the company continues to invest in emerging markets and new technology including computer-assisted surgery, executives said. Analysts said the expense forecast was slightly higher than expected.\nIntuitive expects a 2018 gross profit margin of 70 percent to 71.5 percent of revenue, lower than the 71.9 percent it recorded in 2017.\n\"They don't have big deals on the horizon, and they should be investing internally,\" said RBC's Henry.\nThe higher spending comes amid strong demand for Intuitive's surgical robots.\nIntuitive shipped 216 da Vinci systems in the quarter, compared with 163 in the prior-year period.\nThe number of surgical procedures using its products rose about 17 percent in the fourth quarter. The company expects the number of procedures to rise 11-15 percent in 2018.\nReflecting the tax expense, Intuitive reported a net loss of $38.8 million in the quarter, compared with a profit of $204 million a year earlier.\nTotal revenue rose 17.9 percent to $892.4 million. (Reporting by Manas Mishra in Bengaluru; editing by Sai Sachin Ravikumar)", "external_links": [], "published": "2018-01-26T01:45:00.000+02:00", "crawled": "2018-01-26T11:21:39.007+02:00", "highlightTitle": ""}