{"organizations": [], "uuid": "190d66768fd460dd3c7f5be380c64d5617bedbe2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221463821&w=1200&r=LYNXMPEE0B11K", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-usa-economy/rents-boost-u-s-core-cpi-retail-sales-rise-solidly-idUSKBN1F11QD", "country": "US", "domain_rank": 408, "title": "Rents boost U.S. core CPI; retail sales rise solidly", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T16:19:00.000+02:00", "replies_count": 0, "uuid": "190d66768fd460dd3c7f5be380c64d5617bedbe2"}, "author": "", "url": "https://www.reuters.com/article/us-usa-economy/rents-boost-u-s-core-cpi-retail-sales-rise-solidly-idUSKBN1F11QD", "ord_in_thread": 0, "title": "Rents boost U.S. core CPI; retail sales rise solidly", "locations": [], "entities": {"persons": [{"name": "lucia mutikani", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "labor department", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - Underlying U.S. consumer prices recorded their largest increase in 11 months in December on strong gains in the cost of rental accommodation and healthcare, bolstering expectations that inflation will accelerate this year. \nThe strengthening domestic demand was also underscored by other data on Friday showing retail sales rising at a solid clip in December. The reports probably will keep the Federal Reserve on course to increase interest rates in March. \nThey raised the prospects of a more aggressive monetary policy tightening this year, especially against the backdrop of a $1.5 trillion package of tax cuts passed by the Republican-controlled U.S. Congress and signed into law by President Donald Trump last month. \nThe U.S. central bank is forecasting three rate increases this year. It raised borrowing costs three times in 2017. \n“The economy is doing quite well right now ... and well enough for the Fed to feel compelled to take steps to take the edge off before inflation truly becomes problematic,” said Jim Baird, chief investment officer at Plante Moran Financial Advisors in Kalamazoo, Michigan. \nThe Labor Department said its Consumer Price Index, excluding the volatile food and energy components, rose 0.3 percent last month as prices for new and used cars and trucks and motor vehicle insurance increased. \nThat was the biggest advance in the so-called core CPI since January 2017 and followed a 0.1 percent gain in November. The core CPI increased 1.8 percent in the 12 months through December, picking up from 1.7 percent in November. \nEconomists polled by Reuters had forecast core CPI rising 0.2 percent month-on-month and holding steady at 1.7 percent on an annual basis. Weak import and producer price data this week had raised concerns about the inflation outlook, although the two reports do not have a strong correlation with the CPI. \nEconomists are hoping that a tightening labor market, rising commodity prices, a weak dollar and fiscal stimulus will lift inflation toward the Fed’s 2 percent target this year. \nThe central bank’s preferred inflation measure, the personal consumption expenditures price index excluding food and energy, has missed its target since May 2012. \nThe dollar briefly trimmed losses against a basket of currencies after the CPI data, but later slumped to a four-month low on expectations that the European Central Bank would wind down its bond buying program this year. \nPrices for U.S. Treasuries fell, with the yield on the interest-rate sensitive two-year note rising to its highest since September 2008. Stocks on Wall street were trading higher. \nBROAD PRICE INCREASES Supporting the rise in underlying inflation pressures last month, rents increased 0.4 percent. Owners’ equivalent rent of primary residence climbed 0.3 percent after gaining 0.2 percent in November. \nThe cost of medical care increased 0.3 percent, with prices for prescription medication surging 1.0 percent after rising 0.6 percent in November. The cost of both hospital and doctor visits increased 0.3 percent. The higher healthcare costs led economists to expect the core PCE price index probably rose 0.2 percent in December after nudging up 0.1 percent in November. \nThe government will release the December core PCE price index data later this month. \nCheaper gasoline prices, however, limited the increase in the overall CPI to 0.1 percent in December after a 0.4 percent rise in November. That lowered the year-on-year increase in the CPI to 2.1 percent from 2.2 percent in November. \nLast month, gasoline prices fell 2.7 percent after rebounding 7.3 percent in November. Food prices rose 0.2 percent after being unchanged for two straight months. \nSeparately, the Commerce Department said retail sales rose 0.4 percent last month after advancing 0.9 percent in November. Retail sales increased 5.4 percent from a year earlier. \nSales last month were lifted by a 1.2 percent jump in receipts at gardening and building material stores and a 0.2 percent rise for auto dealerships. Excluding automobiles, gasoline, building materials and food services, retail sales increased 0.3 percent last month after an upwardly revised 1.4 percent surge in November. \nThese so-called core retail sales correspond most closely with the consumer spending component of gross domestic product. They were previously reported to have gained 0.8 percent in November. Last month’s increase in retail sales and the sharp upward revision to November data bolstered economists’ expectations of an acceleration in consumer spending in the fourth quarter. \nConsumer spending, which accounts for more than two-thirds of U.S. economic activity, increased at a 2.2 percent annualized rate in the third quarter. The economy grew at a 3.2 percent pace during that period. \n“The upward revisions to November and October put consumer spending on a stronger upward trajectory than we thought,” said John Ryding, chief economist at RDQ Economics in New York. \nAnother report from the Commerce Department showed business inventories increased 0.4 percent in November after being unchanged in October. \nAs a result of Friday’s data, the Atlanta Fed raised its fourth-quarter GDP growth estimate by five-tenths of a percentage point to a 3.3 percent rate. \nReporting by Lucia Mutikani; Editing by Andrea Ricci and Lisa Von Ahn\n ", "external_links": [], "published": "2018-01-12T16:19:00.000+02:00", "crawled": "2018-01-12T16:30:16.011+02:00", "highlightTitle": ""}