{"organizations": [], "uuid": "78808028a27760185251016594fe46c0a9b72cb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225787318&w=1200&r=LYNXMPEE0Q0HL", "site_section": "http://feeds.reuters.com/reuters/INhollywood", "section_title": "Reuters: Hollywood News", "url": "https://in.reuters.com/article/us-filmfestival-sundance-women/post-sundance-female-filmmakers-find-hollywood-dream-elusive-idINKBN1FG0ML", "country": "US", "domain_rank": 408, "title": "Post-Sundance, female filmmakers find Hollywood dream elusive", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T16:36:00.000+02:00", "replies_count": 0, "uuid": "78808028a27760185251016594fe46c0a9b72cb7"}, "author": "", "url": "https://in.reuters.com/article/us-filmfestival-sundance-women/post-sundance-female-filmmakers-find-hollywood-dream-elusive-idINKBN1FG0ML", "ord_in_thread": 0, "title": "Post-Sundance, female filmmakers find Hollywood dream elusive", "locations": [], "entities": {"persons": [{"name": "hannah fidell", "sentiment": "none"}, {"name": "piya sinha-roy", "sentiment": "none"}, {"name": "michael barker", "sentiment": "none"}, {"name": "tom bernard", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "hollywood", "sentiment": "negative"}, {"name": "sony pictures classics", "sentiment": "none"}, {"name": "university of southern california’s annenberg inclusion initiative", "sentiment": "none"}, {"name": "min read  los angeles", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES (Reuters) - Sundance, the premiere U.S. independent film gathering, this week saw a record number of female filmmakers showcased and it has championed women for four decades, but the Hollywood success that so often comes for male directors has proven elusive.\nA study published this month by University of Southern California’s Annenberg Inclusion Initiative analyzed 1,100 Hollywood films from 2007 to 2017 and found that out of 1,223 directors, women accounted for only 4 percent of honorees.\nIn contrast, women made up 37 percent of directors represented across the 122 films debuting at Sundance this week.\n“The biggest problem is that it is so much harder to convince studios ... that we can also make the bigger movies,” said Hannah Fidell, who wrote and directed “The Long Dumb Road,” debuting at Sundance.\nMichael Barker and Tom Bernard, who co-founded Sony Pictures Classics and often usher Sundance movies to Oscar success, said they have produced films by 59 female filmmakers, but that a lot of those filmmakers have struggled to find success elsewhere.\n“I don’t think women have been given those opportunities after their experience with us from all these other companies, and I think it’s right to stand up and say they deserve more attention than they were given,” Barker said.\nMale directors, such as Quentin Tarantino, David O. Russell, Darren Aronofsky and Damien Chazelle, who all got their starts at Sundance, have gone on to enjoy studio success.\nFILE PHOTO - 75th Golden Globe Awards – Arrivals – Beverly Hills, California, U.S., 07/01/2018 – Director Reed Morano. REUTERS/Mario Anzuoni This year’s Sundance festival comes amid the rise of the Time’s Up movement in Hollywood, launched by more than 300 industry figures to fight against sexual misconduct and discrimination in the workplace.\nSeveral panels at the festival focused on the gender gap in Hollywood with actresses such as Octavia Spencer speaking out about pay parity. Spencer said she and Jessica Chastain had teamed up to negotiate five times her asking salary for an upcoming film the two are working on together.\nAlong with pay issues, many filmmakers are looking for stories that move beyond female typecasts.\nReed Morano first came to Sundance in 2008 as the cinematographer for “Frozen River.” This year, she returned to Sundance with her film directorial debut “I Think We’re Alone Now,” centered on a man (Peter Dinklage) and a teenage girl (Elle Fanning) in a post-apocalyptic world.\n“Out of 10 projects I get sent, seven or eight are female protagonists and that’s not the only thing I‘m interested in,” Morano said.\n“I do think it’s unfair for women who get pegged with creating fare for other women,” she added.\nAfter writing and directing two films with strong female leads, Fidell said she purposely chose to center her latest film “The Long Dumb Road” on the story of two boys.\n“I was getting boxed into only making stories about women going crazy or young adult love stories,” Fidell said. “I made this hoping that ... it would really open up new doors for projects.”\nReporting by Piya Sinha-Roy, editing by G Crosse\n ", "external_links": [], "published": "2018-01-27T16:36:00.000+02:00", "crawled": "2018-01-27T17:03:16.040+02:00", "highlightTitle": ""}