{"organizations": [], "uuid": "d89ff68222fbab0e3faf12c2dc1a772f1f2ad2ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-firstenergy-corp-declares-unchanged-common-stock-dividend.html", "country": "US", "domain_rank": 767, "title": "FirstEnergy Corp. Declares Unchanged Common Stock Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.024, "site_type": "news", "published": "2018-01-16T20:31:00.000+02:00", "replies_count": 0, "uuid": "d89ff68222fbab0e3faf12c2dc1a772f1f2ad2ab"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-firstenergy-corp-declares-unchanged-common-stock-dividend.html", "ord_in_thread": 0, "title": "FirstEnergy Corp. Declares Unchanged Common Stock Dividend", "locations": [], "entities": {"persons": [], "locations": [{"name": "akron", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "west virginia", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "midwest", "sentiment": "none"}, {"name": "mid-atlantic", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "firstenergy corp", "sentiment": "negative"}, {"name": "firstenergy corp.", "sentiment": "negative"}, {"name": "firstenergy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AKRON, Ohio, Jan. 16, 2018 /PRNewswire/ -- The Board of Directors of FirstEnergy Corp. (NYSE: FE) today declared an unchanged quarterly dividend of 36 cents per share of outstanding common stock. The dividend will be payable March 1, 2018, to shareholders of record at the close of business on February 7, 2018.\nFirstEnergy is dedicated to safety, reliability and operational excellence. Its 10 electric distribution companies form one of the nation's largest investor-owned electric systems, serving customers in Ohio, Pennsylvania, New Jersey, West Virginia, Maryland and New York. The company's transmission subsidiaries operate more than 24,000 miles of transmission lines that connect the Midwest and Mid-Atlantic regions. Follow FirstEnergy on Twitter @FirstEnergyCorp or online at www.firstenergycorp.com .\nForward-Looking Statements : This news release includes forward-looking statements based on information currently available to management. Such statements are subject to certain risks and uncertainties. These statements include declarations regarding management's intents, beliefs and current expectations. These statements typically contain, but are not limited to, the terms \"anticipate,\" \"potential,\" \"expect,\" \"forecast,\" \"target,\" \"will,\" \"intend,\" \"believe,\" \"project,\" \"estimate,\" \"plan\" and similar words. Forward-looking statements involve estimates, assumptions, known and unknown risks, uncertainties and other factors that may cause actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements, which may include the following: the ability to experience growth in the Regulated Distribution and Regulated Transmission segments and the effectiveness of our strategy to transition to a fully regulated business profile; the accomplishment of our regulatory and operational goals in connection with our transmission and distribution investment plans, including, but not limited to, our planned transition to forward-looking formula rates; changes in assumptions regarding economic conditions within our territories, assessment of the reliability of our transmission system, or the availability of capital or other resources supporting identified transmission investment opportunities; the ability to accomplish or realize anticipated benefits from strategic and financial goals, including, but not limited to, the ability to continue to reduce costs and to successfully execute our financial plans designed to improve our credit metrics and strengthen our balance sheet; success of legislative and regulatory solutions for generation assets that recognize their environmental or energy security benefits, including the Notice of Proposed Rulemaking released by the Secretary of Energy and action by the Federal Energy Regulatory Commission (FERC); the risks and uncertainties associated with the lack of viable alternative strategies regarding the Competitive Energy Services (CES) segment, thereby causing FirstEnergy Solutions Corp. (FES), and likely FirstEnergy Nuclear Operating Company (FENOC), to restructure its substantial debt and other financial obligations with its creditors or seek protection under United States bankruptcy laws and the losses, liabilities and claims arising from such bankruptcy proceeding, including any obligations at FirstEnergy Corp.; the risks and uncertainties at the CES segment, including FES, and its subsidiaries, and FENOC, related to wholesale energy and capacity markets and the viability and/or success of strategic business alternatives, such as pending and potential CES generating unit asset sales, the potential conversion of the remaining generation fleet from competitive operations to a regulated or regulated-like construct or the potential need to deactivate additional generating units, which could result in further substantial write-downs and impairments of assets; the substantial uncertainty as to FES' ability to continue as a going concern and substantial risk that it may be necessary for FES, and likely FENOC, to seek protection under United States bankruptcy laws; the risks and uncertainties associated with litigation, arbitration, mediation and like proceedings, including, but not limited to, any such proceedings related to vendor commitments, such as long-term fuel and transportation agreements; the uncertainties associated with the deactivation of older regulated and competitive units, including the impact on vendor commitments, such as long-term fuel and transportation agreements, and as it relates to the reliability of the transmission grid, the timing thereof; the impact of other future changes to the operational status or availability of our generating units and any capacity performance charges associated with unit unavailability; changing energy, capacity and commodity market prices including, but not limited to, coal, natural gas and oil prices, and their availability and impact on margins; costs being higher than anticipated and the success of our policies to control costs and to mitigate low energy, capacity and market prices; replacement power costs being higher than anticipated or not fully hedged; our ability to improve electric commodity margins and the impact of, among other factors, the increased cost of fuel and fuel transportation on such margins; the uncertainty of the timing and amounts of the capital expenditures that may arise in connection with any litigation, including New Source Review litigation, or potential regulatory initiatives or rulemakings (including that such initiatives or rulemakings could result in our decision to deactivate or idle certain generating units); changes in customers' demand for power, including, but not limited to, changes resulting from the implementation of state and federal energy efficiency and peak demand reduction mandates; economic or weather conditions affecting future sales, margins and operations such as a polar vortex or other significant weather events, and all associated regulatory events or actions; changes in national and regional economic conditions affecting us, our subsidiaries and/or our major industrial and commercial customers, and other counterparties with which we do business, including fuel suppliers; the impact of labor disruptions by our unionized workforce; the risks associated with cyber-attacks and other disruptions to our information technology system that may compromise our generation, transmission and/or distribution services and data security breaches of sensitive data, intellectual property and proprietary or personally identifiable information regarding our business, employees, shareholders, customers, suppliers, business partners and other individuals in our data centers and on our networks; the impact of the regulatory process and resulting outcomes on the matters at the federal level and in the various states in which we do business including, but not limited to, matters related to rates; the impact of the federal regulatory process on FERC-regulated entities and transactions, in particular FERC regulation of wholesale energy and capacity markets, including PJM Interconnection, L.L.C. (PJM) markets and FERC-jurisdictional wholesale transactions; FERC r", "external_links": ["http://www.firstenergycorp.com/", "https://twitter.com/@FirstEnergyCorp", "http://www.prnewswire.com/news-releases/firstenergy-corp-declares-unchanged-common-stock-dividend-300583296.html"], "published": "2018-01-16T20:31:00.000+02:00", "crawled": "2018-01-16T21:17:07.021+02:00", "highlightTitle": ""}