{"organizations": [], "uuid": "7e77819bdd3a869e229904e85c3d3e70d3476f00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223917440&w=1200&r=LYNXMPEE0K0QY", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen/tennis-australian-open-day-seven-highlights-idUKKBN1FA0YO", "country": "US", "domain_rank": 408, "title": "Tennis - Australian Open day seven highlights", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T19:28:00.000+02:00", "replies_count": 0, "uuid": "7e77819bdd3a869e229904e85c3d3e70d3476f00"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen/tennis-australian-open-day-seven-highlights-idUKKBN1FA0YO", "ord_in_thread": 0, "title": "Tennis - Australian Open day seven highlights", "locations": [], "entities": {"persons": [{"name": "kyle edmund", "sentiment": "none"}, {"name": "nick kyrgios", "sentiment": "none"}, {"name": "nadal", "sentiment": "none"}, {"name": "diego schwartzman", "sentiment": "none"}, {"name": "grigor dimitrov", "sentiment": "none"}, {"name": "pablo carreno busta", "sentiment": "none"}, {"name": "dimitrov", "sentiment": "none"}, {"name": "rafa nadal", "sentiment": "none"}, {"name": "andreas seppi", "sentiment": "none"}, {"name": "marin cilic", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "rod laver arena", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 31 PM / Updated 21 minutes ago Tennis - Australian Open day seven highlights Reuters Staff 5 Min Read \nMELBOURNE (Reuters) - Bulgarian Grigor Dimitrov held his nerve to knock home favourite Nick Kyrgios out of the Australian Open in a fourth-round thriller at the Rod Laver Arena on Sunday. \nThird seed Dimitrov absorbed 76 winners and struck 64 of his own to prevail 7-6(3) 7-6(4) 4-6 7-6(4) and set up a quarter-final with unseeded Briton Kyle Edmund who beat Italian Andreas Seppi 6-7(4) 7-5 6-2 6-3. \nTop seed Rafa Nadal was rattled by a feisty challenge from Diego Schwartzman but fought back strongly to move past the diminutive Argentine 6-3 6-7(4) 6-3 6-3. \nThe 16-times grand slam champion, who was broken three times as he lost the third set, responded with grit to claim the win on the third match point with a rocketed backhand return. \nVictory ensured that Nadal will retain his world number one ranking as he set up a meeting with sixth seed and former U.S. Open champion Marin Cilic for a place in the semi-finals. \nCilic earlier ground down Spaniard Pablo Carreno Busta 6-7(2) 6-3 7-6(0) 7-6(3) at the Margaret Court Arena. \nSecond seed Caroline Wozniacki needed a shade over an hour to thrash Slovakia’s Magdalena Rybarikova 6-3 6-0 and advance to the quarter-finals. The Dane next meets Carla Suarez Navarro who beat Estonian Anett Kontaveit 4-6 6-4 8-6. \nBelgium’s Elise Mertens progressed to her maiden grand slam quarter-finals in her first appearance in the Australian Open main draw, beating Croatian Petra Martic 7-6(5) 7-5. \nHer opponent in the next round, Ukraine’s Elina Svitolina, firmed as a strong contender for the title with a flawless 6-3 6-0 victory over Czech qualifier Denisa Allertova in the early hours of Monday morning. \nHighlights of Sunday’s seventh day of the Australian Open, the first grand slam tournament of the year (times in GMT): 1352 SVITOLINA CRUISES PAST ALLERTOVA \nFourth seed Elina Svitolina dropped just three games before powering past Czech qualifier Denisa Allertova 6-3 6-0 and into the quarter-finals where she will meet Belgium’s Elise Mertens. \nAsked about being one of the title contenders at Melbourne Park, Svitolina said: “It’s more pressure but it also gives you extra confidence.” 1238 DIMITROV KNOCKS OUT KYRGIOS \nBulgarian third seed Grigor Dimitrov battled past local favourite Nick Kyrgios 7-6(3) 7-6(4) 4-6 7-6(4) in three hours and 26 minutes to advance to the quarter-finals. \n“Believe,” Kyrgios told Dimitrov, who is yet to win a grand slam, as the pair met at the net following the match. Dimitrov takes on Briton Kyle Edmund next. 0840 EDMUND KNOCKS OUT SEPPI \nBriton Kyle Edmund reached his first grand slam quarter-finals with a 6-7(4) 7-5 6-2 6-3 win over Italian Andreas Seppi. \n“It was a close first set and I didn’t feel I got the best start. He (Seppi) was hitting the ball very clean,” Edmund said in an on-court interview. Rafael Nadal reacciona durante el partido contra el argentino Diego Schwartzman en el Abierto de Australia, Rod Laver Arena, Melbourne, Australia, 21 de enero de 2018. REUTERS/Thomas Peter \n”In the second set I tried to shift the momentum and once I broke him in the last game of the second set I took control of the match. \n“He plays very well here. He has reached the fourth round a few times and is playing very well but so was I. Through to my first quarter-final - I am very happy.” 0820 NADAL OVERCOMES SCHWARTZMAN CHALLENGE \nWorld number one Rafa Nadal survived a mid-match surge from Argentine Diego Schwartzman to prevail 6-3 6-7(4) 6-3 6-3 in the fourth round. \nThe Spaniard will make his 10th quarter-finals appearance at the Australian Open against sixth seed Marin Cilic. 0745 MERTENS EASES PAST MARTIC Tennis - Australian Open - Rod Laver Arena, Melbourne, Australia, January 21, 2018. Grigor Dimitrov of Bulgaria chats with Nick Kyrgios of Australia after Dimitrov won their match. REUTERS/Edgar Su \nBelgium’s Elise Mertens reached her maiden grand slam quarter-finals with a 7-6(5) 7-5 victory over Petra Martic of Croatia. 0520 CILIC THROUGH TO QUARTER-FINALS \nSixth seed Marin Cilic recorded his 100th grand slam match win, beating Spaniard Pablo Carreno Busta 6-7(2) 6-3 7-6(0) 7-6(3) in the fourth round. \nHe reached his 11th grand slam quarter-final, tying Goran Ivanisevic for most quarter-final appearances at majors by a Croatian man. \n“It’s beautiful to hear them (milestones). I had my 300th career win at U.S. Open 2014... and I hope I can continue to win three more here,” Cilic, who lifted the 2014 U.S. Open title, said in an on-court interview. 0405 WOZNIACKI EASES INTO QUARTERS \nWorld number two Caroline Wozniacki needed just over an hour to beat Slovakia’s Magdalena Rybarikova 6-3 6-0 in the fourth round. \nThe Dane will next face Spain’s Carla Suarez Navarro in the quarter-finals. 0230 SUAREZ NAVARRO EDGES KONTAVEIT \nSpain’s Carla Suarez Navarro has reached the Australian Open quarter-finals for the third time, battling past 32nd seed Estonian Anett Kontaveit 4-6 6-4 8-6. 0015 PLAY UNDERWAY ON SCHEDULE \nPlay got underway on schedule at 11 a.m. local time (0000 GMT) at Melbourne Park, with Estonian Anett Kontaveit battling Spain’s Carla Suarez Navarro at Rod Laver Arena for a place in the quarter-finals. \nThe temperature was 25 degrees Celsius (77F) and forecast to reach a top of 26. Read our preview of the day’s action here: Compiled by Hardik Vyas; Editing by Toby Davis", "external_links": [], "published": "2018-01-21T19:28:00.000+02:00", "crawled": "2018-01-21T19:55:58.010+02:00", "highlightTitle": ""}