{"organizations": [], "uuid": "d28fa5e1bda0fb95dc0772f221ea7afa32c94b67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-aviation-finance-avolon/avolon-says-insulated-from-uncertainty-over-chinas-hna-idUSKBN1FD23C", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Avolon says insulated from uncertainty over China's HNA", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:37:00.000+02:00", "replies_count": 0, "uuid": "d28fa5e1bda0fb95dc0772f221ea7afa32c94b67"}, "author": "", "url": "https://www.reuters.com/article/us-aviation-finance-avolon/avolon-says-insulated-from-uncertainty-over-chinas-hna-idUSKBN1FD23C", "ord_in_thread": 0, "title": "UPDATE 1-Avolon says insulated from uncertainty over China's HNA", "locations": [], "entities": {"persons": [{"name": "avolon", "sentiment": "negative"}, {"name": "domhnal slattery", "sentiment": "none"}, {"name": "jp morga", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "avolon", "sentiment": "none"}], "organizations": [{"name": "global airfinance", "sentiment": "none"}, {"name": "hna group", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "hna", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bohai capital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DUBLIN (Reuters) - The head of Chinese-owned aircraft leasing company Avolon sought to dispel concerns about the risk of being stripped for cash by China’s HNA Group, saying it was adequately protected.\nAvolon has come under scrutiny over its links to HNA and credit ratings analysts said this week it would benefit from tougher safeguards against being forced to bail out the cash-strapped Chinese conglomerate. Avolon is fully owned by Bohai Capital, which is 52-percent owned by HNA Group.\n“We put in place over a year ago ... an insulation framework that quite simply was designed to protect Avolon, financially and otherwise, in the event of any downside scenario from its parent,” Avolon Chief Executive Domhnal Slattery said.\n“In my mind, that insulation framework works today,” he told the Global Airfinance conference in Dublin.\nHe also played down a recent spike in Avolon corporate bond rates, saying Avolon had access to multiple funding markets.\nJP Morgan managing director Mark Streeter was Quote: d earlier by Airfinance Journal as saying Avolon’s recent bond yields of around 5.5-6 percent were “not competitive” and “unsustainable”.\nYields on a five-year note, issued through Park Aerospace to help fund Avolon’s $10.4 billion 2017 takeover of CIT’s aircraft leasing arm, peaked at over 6.05 percent this month. They have fallen back to 5.2 percent, but remain above a fourth-quarter trough of 4.2 percent, according to Thomson Reuters data.\nHNA has been facing extra checks from banks and regulators following its July announcement that it had changed its shareholding structure, while indicating that two previously named shareholders were in fact proxies for company founders.\nIt has also struggled for cash, asking some lenders to extend loans and delaying payments to lessors in several cases.\n“Of course there is a massive amount of negative noise that started with HNA in the summer, but nothing has changed at Avolon,” Slattery told the conference.\nHe said a $365 million intercompany loan from Avolon to Bohai in the third quarter was unlikely to be repeated.\n“In our earnings call for the third quarter, we told investors that we don’t expect this to be part of our normal day to day activity, and I reiterate that here now.”\nFitch Ratings said last month that if Avolon sent additional intercompany loans to HNA or Bohai, it could “call into question the independence of Avolon’s decision-making process and the segregation of its financial resources from its owners”.\nReporting by Tim Hepher; Editing by Conor Humphries and Mark Potter\n ", "external_links": [], "published": "2018-01-24T16:37:00.000+02:00", "crawled": "2018-01-24T16:53:30.001+02:00", "highlightTitle": ""}