{"organizations": [], "uuid": "051759c74a05da08dd45ef1a66551af11488d4a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 479}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/first-on-cnbc-cnbc-transcript-merck-ceo-ken-frazier-speaks-with-cnbcs-meg-tirrell-today.html", "country": "US", "domain_rank": 767, "title": "FIRST ON CNBC: CNBC TRANSCRIPT: MERCK CEO KEN FRAZIER SPEAKS WITH CNBC’S MEG TIRRELL TODAY", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T01:51:00.000+02:00", "replies_count": 0, "uuid": "051759c74a05da08dd45ef1a66551af11488d4a1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/first-on-cnbc-cnbc-transcript-merck-ceo-ken-frazier-speaks-with-cnbcs-meg-tirrell-today.html", "ord_in_thread": 0, "title": "FIRST ON CNBC: CNBC TRANSCRIPT: MERCK CEO KEN FRAZIER SPEAKS WITH CNBC’S MEG TIRRELL TODAY", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WHEN: Today, Monday, January 8, 2018\nWHERE: CNBC's \"Closing Bell\" – Live from the J.P. Morgan Healthcare Conference\nFollowing is the unofficial transcript of a FIRST ON CNBC interview with Merck CEO Ken Frazier and CNBC's Meg Tirrell today, Monday, January 8th on CNBC's \"Closing Bell\" (M-F 3-5PM) live from the annual J.P. Morgan Health Care Conference. Following is a link to video from the interview on CNBC.com: https://www.cnbc.com/video/2018/01/08/merck-ceo-we-continue-to-work-with-trump-administration-to-try-and-do-whats-good-for-patients.html.\nAll references must be sourced to CNBC.\nKELLY EVANS: ALL DAY CNBC HAS BEEN LIVE OUT AT THE ANNUAL J.P. MORGAN HEALTH CARE CONFERENCE. IT'S THE BIGGEST HEALTH CARE INVESTING EVENT OF THE YEAR. MORE THAN 450 COMPANIES ARE IN ATTENDANCE. WE SAW SOME BIG MOVERS IN THE BIOTECH INDEX TODAY. MEG TIRRELL IS OUT THERE AND SHE JOINS US NOW ALONG WITH THE CEO OF MERCK, KEN FRAZIER, IN A FIRST ON CNBC INTERVIEW. MEG?\nMEG TIRRELL: KELLY, THANK YOU SO MUCH AND KEN, THANKS FOR JOINING US.\nKEN FRAZIER: IT'S MY PLEASURE.\nTIRRELL: I WANT TO START OFF WITH A BIG TOPIC PEOPLE ARE TALKING ABOUT HERE WHICH IS THE TAX OVERHAUL. THIS IS SOMETHING YOU'VE BEEN ADVOCATING FOR FOR SOME TIME. WHAT'S THAT GOING TO ENABLE MERCK TO DO? ARE YOU GOING TO BRING JOBS, ARE YOU GOING TO HIRE MORE, ARE YOU GOING TO INVEST MORE? WHAT WILL THIS ENABLE YOU TO DO?\nFRAZIER: WELLTHE MOST IMPORTANT THING ABOUT THIS IS IT WILL ALLOW US TO COMPETE ON AN EVEN BASIS WITH OUR EX-US COMPETITORS. AS IT RELATES TO OUR CAPITAL ALLOCATION, I DON'T THINK IT'S GOING TO CHANGE A LOT IN THE IMMEDIATE FUTURE. WE'RE GOING TO CONTINUE TO SPEND MONEY ON THE SCIENCE AS WE'VE ALWAYS DONE AND WE'RE GOING TO BUILD PLANTS WHERE WE HAVE AN OPPORTUNITY TO DO THAT AND WE'RE GOING TO HIRE PEOPLE WITH OUR BUSINESS EXPANDS.\nTIRRELL: SO HAVING ACCESS TO THAT OVERSEAS CASH ISN'T GOING TO INFLUENCE YOUR DECISION TO DO M&A?\nFRAZIER: WELL, ACTUALLY, BEFORE THIS NEW TAX PLAN, WE HAD ENOUGH POWER IN OUR BALANCE SHEET AND ENOUGH FINANCIAL FLEXIBILITY IN TERMS OF OUR ABILITY TO ACCESS CAPITAL, SO THAT WE COULD DO THE KINDS OF DEALS THAT MERCK WANTS TO DO LIKE BOLT-ON ACQUISITIONS. SO I DON'T THINK THAT THIS CHANGES THAT MUCH. WHAT IT DOES IS IT GIVES US MORE FINANCIAL FLEXIBILITY TO THINK ABOUT DIFFERENT WAYS TO GO ABOUT TRANSACTIONS.\nTIRRELL: WELL, IN THE POLITICAL FRONT, OF COURSE, ONE OF THE MAJOR STORIES OF LAST YEAR WAS WHEN YOU MADE THE DECISION TO LEAVE THE PRESIDENT'S MANUFACTURING COUNCIL AFTER THE EVENTS IN CHARLOTTESVILLE, CITING A MATTER OF PERSONAL CONSCIENCE TO STAND UP AGAINST INTOLERANCE AND EXTREMISM. AS A RESPONSE TO THAT, THE PRESIDENT TOOK TO TWITTER, AS HE OFTEN DOES, AND ACCUSED MERCK OF HAVING RIP-OFF DRUG PRICES. IN THE MONTHS SINCE THEN, HOW WOULD YOU DESCRIBE YOUR RELATIONSHIP WITH THE ADMINISTRATION?\nFRAZIER: WELL, WE CONTINUE TO WORK WITH BOTH THE CONGRESS AND THE ADMINISTRATION TO TRY TO DO WHAT'S GOOD FOR PATIENTS. THERE ARE REAL ISSUES THAT ARE OUT THERE FOR PATIENTS, THERE ARE REAL ISSUES FOR OUR ECONOMY, JOBS, INNOVATION WE CONTINUE TO WORK EFFECTIVELY, I THINK, WITH THE ADMINISTRATION AS WELL AS WITH CONGRESS ON THOSE ISSUES.\nTIRRELL: WERE YOU SURPRISED OR INSULTED WHEN THE PRESIDENT GOT PERSONAL WITH THESE TWEETS?\nFRAZIER: NO, I CAN'T SAY I WAS SURPRISED AND, YOU KNOW, I MADE MY STATEMENT, THE PRESIDENT MADE HIS STATEMENT IN RESPONSE?\nTIRRELL: DO YOU THINK HE'S BEEN GOOD FOR BUSINESS?\nFRAZIER: WELL I THINK THIS ADMINISTRATION IS FOCUSED ON AMERICAN COMPETITIVENESS, OUR ECONOMY AND JOBS. AND I THINK THAT'S A POSITIVE THING, NOT JUST FOR BUSINESS BUT FOR AMERICA AS A WHOLE.\nTIRRELL: ONE OF THE THINGS THAT MERCK HAS BEEN FOCUSING ON IS CANCER. AND YOUR BIG DRUG, KEYTRUDA, IN IMMUNO-ONCOLOGY. YOUR STOCK TOOK A HIT AT THE END OF LAST YEAR, AS YOU SAID YOU WERE GOING TO DELAY A FILING IN EUROPE AND HAVE SOME CLINICAL TRIAL RESULTS DELAYED THERE. DO YOU THINK INVESTORS WERE OVERREACTING TO THAT NEWS? HOW DO YOU DESCRIBE WHERE KEYTRUDA STANDS?\nFRAZIER: WELL I THINK FIRST OF ALL, IN THE LAST COUPLE YEARS, KEYTRUDA HAS HAD PHENOMENAL GROWTH. WE'RE TREATING NOW OVER 160,000 PATIENTS WORLDWIDE. WE'RE THE LEADER IN FIRST LINE LUNG, WE'RE THE ONLY DRUG THAT'S APPROVED IN FIRST LINE, BOTH AS MODEL THERAPY AND IN COMBINATION WITH CHEMOTHERAPY. SO I THINK WE'RE VERY WELL POSITIONED. I THINK THE ISSUE AROUND THAT STUDY FOR US WAS THAT WE WANTED TO THINK ABOUT THAT STUDY IN THE CONTEXT OF THE LONG TERM. WHAT IS IT THAT PHYSICIANS AND PATIENTS REALLY CARE ABOUT? THAT IS, DOES THE DRUG SHOW OVERALL SURVIVAL? AND WE DECIDED THAT IT WAS VERY IMPORTANT TO HAVE A ROBUST OVERALL SURVIVAL RESULT, AND SO WE EXTENDED IT IN ORDER TO DO THAT. I THINK THAT WAS THE RIGHT THING FOR THE DRUG IN THE LONG RUN.\nTIRRELL: AND YOU HAVE CONFIDENCE IN THAT STUDY?\nFRAZIER: ABSOLUTELY. BECAUSE, YOU KNOW, WE HAD ANOTHER STUDY, A SMALLER STUDY CALLED 21G. AND IN THAT STUDY IF YOU LOOK AT THAT DATA OVER A LONG PERIOD OF TIME, WE HAVE PROGRESSION-FREE SURVIVAL BUT WE ALSO HAVE A TREND TOWARD OVERALL SURVIVAL. SO AS WE LOOK AT THE STUDY OF THE SMALLER VERSION OF THIS STUDY, IT GIVES US CONFIDENCE THIS STUDY WILL BEAR OUT IN A VERY POSITIVE WAY, ALTHOUGH WE HAVE TO WAIT TO SEE THE DATA.\nTIRRELL: WELL, OVER THE WEEKEND WE HEARD FROM A PEER COMPANIES, PFIZER, THAT IT'S DECIDING TO TAKE INVEST THEMENT OUT OF CERTAIN AREAS OF NEUROSCIENCE, INCLUDING ALZHEIMERS AND PARKINSON'S DISEASE. THIS IS AN AREA WHERE MERCK HAS LATE-STAGE PROGRAMS WHERE YOU'RE INVESTING A LOT OF MONEY, I ASSUME, THESE BEING BIG INDICATIONS AND BIG TRIALS. WHAT IS YOUR COMMITMENT TO THE ALZHEIMERS SPACE?\nFRAZIER: WELL WE'RE CERTAINLY COMMITTED TO THE TRIALS THAT WE'RE RUNNING ON OUR BACE INHIBITOR. WE THINK THERE'S A LOT OF GOOD INFORMATION INCLUDING GENETIC INFORMATION THAT SUGGESTS THAT THIS IS A WORTHWHILE WAY TO PURSUE. WE ALSO BROUGHT IN A NEW COMPOUND, WHICH IS CALLED A TAU COMPOUND, WE BROUGHT IN FROM TEIJIN LAST YEAR, SO THOSE TWO PROGRAMS WE'RE VERY COMMITTED TO. BUT IF YOU TAKE A STEP BACK, I THINK ALL COMPANIES HAVE TO LOOK AT THEIR PORTFOLIOS AND HAVE TO REALLOCATE WHERE THEY THINK THEY HAVE THE BEST OPPORTUNITY. AT MERCK, WE'RE NOT COMMITTED JUST TO ONE AREA OF MEDICINE OR ANOTHER. WE'RE COMMITTED TO FINDING GREAT DRUGS.\nTIRRELL: KELLY, YOU HAVE A QUESTION?\nEVANS: MEG, THANK YOU, AND MR. FRAZIER, APPRECIATE YOU JOINING US. I WAS GOING TO ASK IN LIGHT OF EVERYTHING THAT'S HAPPENED WITHDRUG PRICES IN THE COUNTRY THE LAST COUPLE YEARS, WE'VE REPORTED AMAZON HAS LOOKED AT GETTING INTO THE PHARMACY BUSINESS. DO YOU THINK AMAZON'S ENTRY COULD BE GOOD FOR CONSUMERS? AND WOULD YOU EMBRACE THAT AS A DRUG DELIVERY MODEL?\nFRAZIER: WELL, I DON'T KNOW EXACTLY WHAT AMAZON HAS IN MIND. THAT'S IN THE DISTRIBUTION SIDE OF THE BUSINESS. WE'RE FOCUSED ON OUR BUSINESS BRINGING NEW INNOVATIVE DIFFERENTIATED MEDICINES TO MARKET FOR CONDITIONS LIKE ALZHEIMERS AND IMPORTANT CONDITIONS LIKE CANCER. SO IF THAT'S A MORE EFFICIENT WAY OF GETTING DRUGS TO PATIENTS, WE WOULD BE IN FAVOR OF IT.\nTIRRELL: AS WE THI", "external_links": ["https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=0ahUKEwilvf6UtcnYAhXxk-AKHVS1B5YQFggpMAA&url=https://www.cnbc.com/closing-bell/&usg=AOvVaw2Eh2V95iiStskaNyma61_D", "http://www.nbcumv.com/programming/cnbc"], "published": "2018-01-09T01:51:00.000+02:00", "crawled": "2018-01-09T09:40:59.236+02:00", "highlightTitle": ""}