{"organizations": [], "uuid": "661cf5c32e5b83816da5e347454419df9ffd8133", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222705584&w=1200&r=LYNXMPEE0G0PF", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-afghanistan-governor/pence-urges-peaceful-end-to-standoff-over-afghan-governor-idUSKBN1F61AE", "country": "US", "domain_rank": 408, "title": "Pence urges peaceful end to standoff over Afghan Governor", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T13:30:00.000+02:00", "replies_count": 0, "uuid": "661cf5c32e5b83816da5e347454419df9ffd8133"}, "author": "", "url": "https://www.reuters.com/article/us-afghanistan-governor/pence-urges-peaceful-end-to-standoff-over-afghan-governor-idUSKBN1F61AE", "ord_in_thread": 0, "title": "Pence urges peaceful end to standoff over Afghan Governor", "locations": [], "entities": {"persons": [{"name": "noor", "sentiment": "none"}, {"name": "ghani", "sentiment": "none"}, {"name": "ashraf ghani", "sentiment": "none"}, {"name": "atta mohammad noor", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "atta", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "balkh", "sentiment": "none"}, {"name": "kabul", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "south asia", "sentiment": "none"}], "organizations": [{"name": "pence", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "world bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 11:32 AM / Updated 8 minutes ago Pence urges peaceful end to standoff over Afghan Governor Reuters Staff 3 Min Read \nKABUL (Reuters) - U.S. Vice President Mike Pence called for a peaceful change of leadership in the northern Afghan province of Balkh, where the powerful governor has defied attempts by the central government to oust him for the past month amid sensitive ethnic rivalries. \nThe standoff between President Ashraf Ghani and Balkh Governor Atta Mohammad Noor has threatened to destabilize the fragile Western-backed administration in Kabul and raised fears the government could try to use force to break the stalemate. \nPence spoke to Ghani about Washington’s new South Asia strategy and afterwards posted a message on Twitter saying he had emphasized support for the Afghan government “to engage (with) Balkh Governor Atta and conduct peace transition of leadership”, \nNoor is one of the most prominent of a number of powerful regional leaders who have been a thorn in the side of Ghani, a former World Bank official named president after a disputed election in 2014. \nThe confrontation, amid increasing political maneuvering ahead of presidential elections next year, has been colored by the ethnic rivalries that have become increasingly prominent in Afghan politics. FILE PHOTO: Afghanistan's President Ashraf Ghani poses for a photograph at the 72nd United Nations General Assembly at the U.N. headquarters in New York City, U.S., September 21, 2017. REUTERS/Stephanie Keith \nNoor is a leader of Jamiat-i Islami, a party mainly supported by Persian-speaking ethnic Tajiks in the north who have become increasingly resentful of Ghani, a Pashtun, whom they accuse of favoring his own ethnic group, which is mainly based in the south and east. \nNegotiations between the president’s office and officials from Jamiat have been going on for weeks, so far without result and Western diplomats in Kabul are concerned the standoff could degenerate into violence. \nAs well as damaging the government, the uncertainty has threatened to undermine the new U.S. strategy of stepping up pressure on the Taliban through air strikes and increased support to Afghan security forces to try to force the insurgents to the negotiating table. \nOn Monday, the top U.S. and NATO commander in Afghanistan, Gen. John Nicholson, said that the United States and the international community wanted to see a peaceful solution. \n“We respect and support all Afghans and we hope, of course, internal political resolutions will occur so that we can move forward,” he told reporters at the margins of a change of command ceremony in the southern province of Helmand. \n“If this is sorted out, this is a big win because it demonstrates to all Afghans that differences can be resolved non-violently through a political process.” Reporting by James Mackenzie; Editing by Nick Macfie", "external_links": [], "published": "2018-01-17T13:30:00.000+02:00", "crawled": "2018-01-17T13:43:08.008+02:00", "highlightTitle": ""}