{"organizations": [], "uuid": "bd265dad80ec7adc95d9861d306f87e5ee459f04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226244963&w=1200&r=LYNXMPEE0S0K6", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/hongkong-politics/hong-kong-lawyers-condemn-unlawful-disqualification-of-candidate-idINKBN1FI0TM", "country": "US", "domain_rank": 408, "title": "Hong Kong lawyers condemn \"unlawful\" disqualification of candidate", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T11:05:00.000+02:00", "replies_count": 0, "uuid": "bd265dad80ec7adc95d9861d306f87e5ee459f04"}, "author": "", "url": "https://in.reuters.com/article/hongkong-politics/hong-kong-lawyers-condemn-unlawful-disqualification-of-candidate-idINKBN1FI0TM", "ord_in_thread": 0, "title": "Hong Kong lawyers condemn \"unlawful\" disqualification of candidate", "locations": [], "entities": {"persons": [{"name": "agnes chow", "sentiment": "none"}, {"name": "venus wu", "sentiment": "none"}, {"name": "greg torode", "sentiment": "none"}, {"name": "joshua wong", "sentiment": "none"}, {"name": "chow", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "bar association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG (Reuters) - A group of Hong Kong lawyers on Monday condemned a ban on a democracy activist by the territory’s government to stop her from contesting a by-election, describing it as the suppression of free expression and a curb on voting.\nThe weekend ban on Agnes Chow, a close ally of high-profile activist Joshua Wong, fuels wider fears of tightening political “red lines” by Beijing that could deny Hong Kong’s restive young people any political outlet beyond street protest.\nThe 21-year-old Chow becomes the 13th politician barred from standing for office or disqualified from the legislature in recent years.\nThe group of 30 mostly liberal lawyers, including the current and former heads of the Bar Association, said they did not mean to endorse Chow’s views, but wanted, instead, to protect candidates’ freedoms.\n“The decision has used political opinion or affiliation as a ground to deprive her of the right to stand for election – which is unreasonable, unlawful and unconstitutional,” it said in a statement.\nChief Executive Carrie Lam took office last year, vowing to heal Hong Kong’s political wounds, but her administration must also defend what Chinese President Xi Jinping has defined as “red lines” for the city: brooking no challenge to national sovereignty, security or the power of the central government.\nChow was disqualified on the grounds that self-determination is inconsistent with the principle of “one country, two systems,” a view echoed by Lam.\n“Any suggestion of Hong Kong independence or democratic self-determination ... deviates from the important basic principle of ‘one country, two systems,'” Lam told reporters on Saturday.\nPro-democracy activist Agnes Chow, 21, attends a rally after she was banned from running in a by-election, in Hong Kong, China January 28, 2018. REUTERS/Bobby Yip In calling for “self-determination”, Chow and her political party, Demosisto, say they are not advocating independence but instead demanding a referendum on Hong Kong’s future after 2047, which would include independence, among other options.\nThe Asian financial hub has been governed under a “one country, two systems” formula since its return from British rule in 1997, allowing autonomy and freedom not enjoyed in mainland China, such as an independent judiciary and limited democracy.\nThose freedoms, and Hong Kong’s relationship with Beijing, are enshrined in the territory’s mini-constitution known as the Basic Law that guarantees its capitalist way of life for 50 years.\nSlideshow (2 Images) The ban sparked anger among opposition leaders, who led a crowd of at least 2,000 people to protest against “political censorship” outside government headquarters on Sunday.\n“You are shutting the gates to us running for office,” said Wong, less than a week after his release from prison on bail. “We will open other gates to find a path for Hong Kong’s democratic movement.”\nPreviously disqualified politicians included those actively demanding independence or legislators who delivered profanity-laden oaths of office, but Chow’s disqualification thwarts Demosisto, seen as an emerging outlet for the city’s young people.\nThe decision can be challenged in court, but only after the vote, lawyers say. Still pending in the courts are legal challenges filed in 2016 by two pro-independence activists barred from running for office that year.\nThe protests of Chow and her supporters were “no big deal”, said China’s Global Times tabloid, published by the ruling Communist Party’s mouthpiece, the People’s Daily.\n“Chow’s ban sends a signal that advocating extreme thoughts can help garner attention, but risks losing the opportunity of being a lawmaker,” it said in an editorial on Monday. “The logic will be clearer in the future.”\nReporting by Greg Torode and Venus Wu; Additional reporting by Ben Blanchard in Beijing; Editing by Clarence Fernandez\n ", "external_links": [], "published": "2018-01-29T11:05:00.000+02:00", "crawled": "2018-01-29T11:35:43.104+02:00", "highlightTitle": ""}