{"organizations": [], "uuid": "8bffd65dd56cb5b288dca6cbd6a5e5b94f682cb8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-neurometrix-and-glaxosmithkline-consumer-healthcare-announce-strategic-collaboration-to-develop-and-expand-access-to-quell.html", "country": "US", "domain_rank": 767, "title": "NeuroMetrix and GlaxoSmithKline Consumer Healthcare Announce Strategic Collaboration to Develop and Expand Access to Quell Wearable Pain Relief Technology", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.988, "site_type": "news", "published": "2018-01-17T15:00:00.000+02:00", "replies_count": 0, "uuid": "8bffd65dd56cb5b288dca6cbd6a5e5b94f682cb8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-neurometrix-and-glaxosmithkline-consumer-healthcare-announce-strategic-collaboration-to-develop-and-expand-access-to-quell.html", "ord_in_thread": 0, "title": "NeuroMetrix and GlaxoSmithKline Consumer Healthcare Announce Strategic Collaboration to Develop and Expand Access to Quell Wearable Pain Relief Technology", "locations": [], "entities": {"persons": [], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "waltham", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}], "organizations": [{"name": "neurometrix", "sentiment": "neutral"}, {"name": "glaxosmithkline consumer healthcare announce strategic collaboration", "sentiment": "neutral"}, {"name": "glaxosmithkline", "sentiment": "none"}, {"name": "gsk consumer healthcare", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "gsk", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WALTHAM, Mass., Jan. 17, 2018 (GLOBE NEWSWIRE) -- NeuroMetrix, Inc. (Nasdaq:NURO) announced today a collaboration with GlaxoSmithKline (NYSE:GSK), one of the world's largest science-led global healthcare companies, involving Quell ® Wearable Pain Relief Technology™.\nThe key elements of the collaboration are as follows:\nGSK Consumer Healthcare acquires exclusive ownership of Quell technology for markets outside the U.S. NeuroMetrix retains exclusive ownership of Quell technology in the U.S. market. GSK Consumer Healthcare and NeuroMetrix to co-fund development of Quell technology for a three-year period beginning in 2018 through 2020, with subsequent annual renewals by mutual agreement. GSK Consumer Healthcare to pay NeuroMetrix $5M for the assets relating to Quell technology for markets outside the U.S and up to $21.5M, upon the achievement of certain development and commercialization milestones.\n\"We are excited by the opportunity to partner with GSK Consumer Healthcare to expand access to Quell technology among chronic pain sufferers around the world. GSK Consumer Healthcare is a world leader in over-the-counter pain relief, with several top global brands,” said Shai N. Gozani, M.D., Ph.D., President and Chief Executive Officer of NeuroMetrix. “We will continue to focus on building Quell into a leading U.S. consumer healthcare brand while collaborating with GSK on Quell product development and supporting their international commercialization efforts. We believe that GSK is our ideal Quell partner as we share a deep commitment to science-based therapies and to the health and quality of life of our customers.”\nCanaccord Genuity acted as financial advisor to NeuroMetrix in the transaction.\nAbout Quell\nQuell is an advanced, wearable technology for treating chronic pain. It can be worn during the day while active and at night while sleeping. Quell is drug-free and has been cleared by the FDA for treatment of chronic pain without a prescription. Quell users can personalize and manage therapy discreetly via the Quell app. Quell also offers health tracking relevant to chronic pain sufferers including pain, sleep, activity, and gait. Quell users can synchronize their data with the Quell Health Cloud, which provides customized feedback and powers one of the world’s largest chronic pain databases. Quell is available online and through select retailers. Visit QuellRelief.com for more information.\nAbout GSK\nGSK - a science-led global healthcare company with a special purpose: to help people do more, feel better, live longer. For further information please visit www.gsk.com\nAbout NeuroMetrix\nNeuroMetrix is an innovation driven healthcare company combining neurostimulation and digital medicine to address chronic health conditions including chronic pain, sleep disorders, and diabetes. The company's lead product is Quell, an over-the-counter wearable therapeutic device for chronic pain. The company also markets DPNCheck ® , a rapid point-of-care test for diabetic neuropathy, which is the most common long-term complication of Type 2 diabetes. For more information, please visit NeuroMetrix.com .\nSafe Harbor Statement\nThe statements contained in this press release include forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, including, without limitation, statements regarding the Company's expectations regarding the business and the anticipated milestones under the agreements entered into with GSK Consumer Healthcare, as well as events that could have a meaningful impact on the Company's revenues and cash resources. While the Company believes the forward-looking statements contained in this press release are accurate, there are a number of factors that could cause actual events or results to differ materially from those indicated by such forward-looking statements, including, without limitation, estimates of future performance, and the ability to successfully develop, receive regulatory clearance, commercialize and achieve market acceptance for any products. There can be no assurance that future developments will be those that the Company has anticipated. Such forward-looking statements involve known and unknown risks, uncertainties and other factors including those risks, uncertainties and factors referred to in the company's most recent Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, as well as other documents that may be filed from time to time with the Securities and Exchange Commission or otherwise made public. The company is providing the information in this press release only as of the date hereof, and expressly disclaims any intent or obligation to update the information included in this press release or revise any forward-looking statements.\nSource: NeuroMetrix, Inc.\nNeuroMetrix, Inc.\nThomas T. Higgins, 781-314-2761\nSVP and Chief Financial Officer\nneurometrix.ir@neurometrix.com\nSource:NeuroMetrix, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=SOIvJutd7x-x_uXnFXyGzHPFsnqgJBy0DTmNLYPQPXJMKvWi2W4K4KYiIQrOHgUAEykRDs0JxsmqqO6Whirv3mupIK3XgxnvbLrNTwPOEP2U5BD5dlxARo14DaeLrvc6V-aCoRpGuxWLrnM03qJWKr_rLOvMl4Y11WLMNzmUDo60fmszK4y8SB4xvpNrhNSs5RNtEHPuJg5A0eC7WcPeFi7SB_QY-qTrnxrOaBhGlKBD0cwoUn79U0RqqtsVS6e12Wn92xWZ0OSmk5Rs7go8J1mGGmK4X-avlUYnazK3h8fSOd6FUFyeeMGvFr4IAy31xa9Bc5KtSj3rnq4Bfqfrag==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/ff5fa8ed-ab11-4ec4-a680-6f46bf9e987f", "https://www.globenewswire.com/Tracker?data=BhYnEZ8O5KpUOOEha65avjMcjEhreup8K9VQ13VhzZEpqh7u0R5TPprKD266I5K6MRdeEPkJ1bcapFp6o1gEHfgUsZ5CyXmycYY4J3KQD2Qs0t9YWLchY0dXI_hrvDFyWLarMnjLGdclzC0wFiBoiI6p9K8w8qgdUqH5poc4qpCHhlydUofFHinkU-HQZ5-WNmDgQ54JmMt418j02_ONW6bOVZbt2MzE-wAXPlLsCtzaD6fvTuWluY7Y4tuVCv6ILEFGzLigrWqMDtPjj4waEOnTCcKBX3-R_EwTV9LkPvxz7lWBD2zeUHOzyNFSejc8_0duN1aXeTX--wszAdjxkA==", "https://www.globenewswire.com/Tracker?data=q1Kcks97Od2RZ3gvIAt3h98JZ-YKfBUUVkMcrkVACXA9czXbMaTvZLagXNnoSPNm1eNutsjb820jdNpZjbcv05KN6WZd7bHKtfxDfOq0mePX_zsvNjm4C02p0S4faEpA", "https://www.globenewswire.com/Tracker?data=3F5rINxxjD3xb8jJLHm1XUmrDH050qtkR6P48afhsRByGRrUZm1E-mZgUibc6Mips9pPTnh1qa-9kSlQ9oAAgA=="], "published": "2018-01-17T15:00:00.000+02:00", "crawled": "2018-01-17T15:46:39.003+02:00", "highlightTitle": ""}