{"organizations": [], "uuid": "fc570c3a5c515cca9981d9885e532b0b68c58101", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220644186&w=1200&r=LYNXMPEE081IT", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-markets-bitcoin-breakingviews/breakingviews-chancellor-bitcoin-will-never-be-real-money-idUSKBN1EY2MD", "country": "US", "domain_rank": 408, "title": "Breakingviews - Chancellor: Bitcoin will never be real money", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.487, "site_type": "news", "published": "2018-01-10T05:24:00.000+02:00", "replies_count": 0, "uuid": "fc570c3a5c515cca9981d9885e532b0b68c58101"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-markets-bitcoin-breakingviews/breakingviews-chancellor-bitcoin-will-never-be-real-money-idUSKBN1EY2MD", "ord_in_thread": 0, "title": "Breakingviews - Chancellor: Bitcoin will never be real money", "locations": [], "entities": {"persons": [{"name": "paul einzig", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "congo", "sentiment": "none"}], "organizations": [{"name": "reuters breakingviews", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON It’s easy enough to identify bitcoin and its ilk as being caught up in a speculative mania. A more difficult and important question is whether crypto-currencies have any future as money. In a world where the stability of conventional currencies is threatened globally by the vast expansion of central-bank balance sheets, high government indebtedness and the myriad ill consequences of ultra-low interest rates, it would be nice to believe this was the case. Yet bitcoin and its peers are not money and, unless they change fundamentally, never will be.\nBitcoin possesses many of the characteristics of a proper currency: it can be divided, stored (provided it’s not with a dodgy broker where it’s liable to disappear into the ether) and transferred. And its supply is limited. Money is just a social technology which has been through many previous incarnations – among the exotic varieties of cash listed by Paul Einzig in his book “Primitive Money” 70 years ago are gin, jam, mulberry cakes, rat traps (in the Congo), and woodpecker scalps. Most of our current money is already held in digital form as electronic book entries at the bank. At first glance, bitcoin with its distributed ledger appears to be simply an advance on the current financial technology.\nIts fervid exponents have even greater hopes. They claim that crypto-currencies hail the end of state-controlled money. Their vision is borrowed from the Austrian economist Friedrich Hayek, who envisaged a denationalisation of money that would bring about an end to both inflation and deflation, cure unemployment and result in the abolition of easy-money-peddling central banks, thereby limiting the reach of governments. What’s not to like?\nThe trouble is that bitcoin enthusiasts confuse the characteristics of money with its nature. This is a thorny subject. Mainstream economic theory has little to say on what money is, assuming it is a contrivance simply to do away with the bother of barter. In the era when bank notes were redeemable in gold, most people believed that money had the intrinsic value of the precious metal. But as John Law, who was responsible for the Mississippi Co bubble in the early 18th century, pointed out: “Money is not the value by which goods are exchanged but the value for which they are exchanged.” Simply put, gold derived much of its value from its use as money rather than the other way around.\nWhere, then, does money get its value? From the earliest times, going back at least to Mesopotamia in the third millennium B.C., money has been defined as a unit of account authorized by government for the payment of debts. The state theory of money holds that money is a credit issued by a sovereign, whose value comes from the fact that it can be used to pay taxes. Governments have tenaciously maintained control over the unit of account, a key aspect of sovereignty. The law prescribes this official money as legal tender for the repayment of debt.\nLaw and his contemporaries had another insight, namely that credit when it circulates acts as money. In the 18th century, much of what constituted money in England comprised bills of exchange issued by merchants against future receipts. At the same time, early English bankers were learning to create money through the act of lending. This bank money was backed by claims of real economic value. The credit theory of money maintains that money is just circulating credit. “Currency is ephemeral and cosmetic: it is the underlying mechanism of credit accounts and clearing that is the essence of money,” Felix Martin writes in his 2013 book “Money”.\nThe economic system commonly referred to as capitalism consists of a vast network of credit relations. Credit money is its key feature. Hayek, of course, realised this. His proposals to strip the government of its money monopoly envisaged the replacement of a dominant central bank with competing private money-issuing banks. Competition between the currency banks would thus produce a sounder currency. But Hayek’s money would still be of the credit variety.\nBitcoin and other crypto-currencies are a different kettle of fish. They purport to be non-credit currencies - that is, monetary assets without corresponding liabilities. Yet all money is by its nature a claim upon society, otherwise it cannot be spent. And why should society wish to confer vast monetary claims on the enterprising nerds and opportunistic speculators currently in possession of crypto-fortunes? More importantly, because crypto-currencies lack a mechanism for creating credit they are not well suited to the capitalist economy. Imagine what would happen if bitcoin were accepted as the monetary unit of account. The result would be a scarcity of the digital currency followed by a severe economic contraction and stagnation without end.\nThis is not going to happen. Not just because it makes no economic sense but because governments are never going to relinquish their monopoly over money any sooner than they will surrender their monopoly on violence. However desirable in theory it may be, Hayek’s proposal to denationalise money was just a pipe dream. As the Nobel laureate Quote: : “Everybody knows that if such a private experiment promised to succeed, governments would at once step in to prevent it.”\nEverybody, that is, apart from the speculators in crypto-currencies. Some of them privately concede that bitcoin may never become money as such, but say that it will retain value as an asset in the same way that gold survived its demonetisation. The counter-argument is that gold has a very long history, an extraordinary durability and a great inherent beauty which lends it enduring lustre, while bitcoin is just a clever piece of open-source software.\nThis is not to say that the blockchain and similar associated technologies have no future. The new high flyer, ripple, is working with banks to improve the global payments system. It’s a more modest aim than creating a new class of money - but a far more practical one.\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T05:24:00.000+02:00", "crawled": "2018-01-10T02:52:41.006+02:00", "highlightTitle": ""}