{"organizations": [], "uuid": "bb51cfd8257186619cf50ec230d3474d71d91da2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/29/reuters-america-fords-chariot-bus-shuttle-service-to-launch-in-london.html", "country": "US", "domain_rank": 767, "title": "Ford's Chariot bus shuttle service to launch in London", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T18:44:00.000+02:00", "replies_count": 0, "uuid": "bb51cfd8257186619cf50ec230d3474d71d91da2"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/29/reuters-america-fords-chariot-bus-shuttle-service-to-launch-in-london.html", "ord_in_thread": 0, "title": "Ford's Chariot bus shuttle service to launch in London", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Jan 29 (Reuters) - London approved on Monday Ford's plans to operate its Chariot minibus services as the automaker expands its mobility service designed to tap into growing demand in cities among those wishing to make trips rather than buy cars.\nChariot will be able to operate its pre-bookable only services in Britain's capital city for a year on three routes and nine months on a fourth route on a trial basis.\n\"This service has the potential to provide useful transport links in the areas they will serve, largely outside central London, and we will carefully monitor this trial,\" said a spokesman at regulator Transport for London (TfL).\nThe U.S. carmaker already operates its bus service in U.S. cities such as San Francisco and Seattle, allowing passengers to book seats for journeys generally between transport hubs and to and from park and ride facilities for the last mile of a trip.\nThe firm's proposed routes in London include areas south of the River Thames which are not close to underground stations including near the Battersea Power Station redevelopment, according to TfL's website.\nFord is trying to diversify into other modes of transportation from vehicles sold to consumers as new competitors from Alphabets Google to Uber shake up the traditional automotive industry.\nMajor carmakers are experimenting with mobility services, partnering with existing tech apps or developing their own offerings such as car clubs as they seek to appeal to young urbanites who have increasingly shunned vehicle ownership. (Reporting by Costas Pitas; Editing by Alison Williams)", "external_links": [], "published": "2018-01-29T18:44:00.000+02:00", "crawled": "2018-01-30T06:17:18.001+02:00", "highlightTitle": ""}