{"organizations": [], "uuid": "c148b6e44bdcd73be2eed1a94015aae041667c2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/business-wire-lowe-enterprises-investors-acquires-26-building-industrial-and-office-portfolio-from-aic-ventures.html", "country": "US", "domain_rank": 767, "title": "Lowe Enterprises Investors Acquires 26-Building Industrial and Office Portfolio from AIC Ventures", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T20:52:00.000+02:00", "replies_count": 0, "uuid": "c148b6e44bdcd73be2eed1a94015aae041667c2e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/business-wire-lowe-enterprises-investors-acquires-26-building-industrial-and-office-portfolio-from-aic-ventures.html", "ord_in_thread": 0, "title": "Lowe Enterprises Investors Acquires 26-Building Industrial and Office Portfolio from AIC Ventures", "locations": [], "entities": {"persons": [{"name": "bleecker p. seaman", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "midwest", "sentiment": "none"}, {"name": "eastern u.s.", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "connecticut", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "minnesota", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "aic ventures acquired", "sentiment": "negative"}, {"name": "lowe enterprises inv", "sentiment": "negative"}, {"name": "lowe enterprises investors acquires", "sentiment": "negative"}, {"name": "aic ventures", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Acquired in joint venture with investment client\nLOS ANGELES--(BUSINESS WIRE)-- Lowe Enterprises Investors (LEI), in a joint venture with an investment client, has acquired a 26-building portfolio of industrial and office buildings totaling 2.3 million square feet from AIC Ventures. The properties, known as the NL Ventures IX Portfolio, are located in 16 states, spanning 24 major submarkets primarily in the Midwest and Eastern U.S., with the largest concentrations in Connecticut, Illinois, Ohio, Minnesota, Wisconsin, Texas, and New Jersey.\n“The geographically diverse and triple net leased nature of the portfolio makes it an attractive investment opportunity for us and our client,” said Bleecker P. Seaman, co-CEO of LEI. “The geographic, tenant, and industry diversification provide attractive downside protection with a strong current yield.”\nThe majority of the properties are industrial buildings that range from flex to light manufacturing facilities, and four are suburban mid-rise office buildings. The buildings are 100 percent leased to long-term, single tenants with an average tenure of 25 years in the buildings and an average 13-year remaining lease term. Each property serves as a critical component of tenant operations, with 16 serving as tenants’ headquarters. The well maintained, efficient, and flexible buildings were constructed between 1954 and 2008. Many of the buildings have been upgraded and expanded over the years.\n“The NL Ventures IX portfolio is the seventh sale of industrial real estate assets to institutional investors in AIC Ventures’ history. The portfolio represents an excellent opportunity for a long-term investor to realize strong current yields across a diversified portfolio which increases annually, due to the consistent rent escalations built into each lease. The duration of these leases, and the strength of the tenant companies, represent a healthy long-term income stream for the investor,” said David Robshaw, president of AIC Ventures. “AIC will continue to actively acquire similar industrial and office assets throughout the U.S. for current and future NL Ventures Funds, and we will likely explore the sale of another diversified portfolio in 2019 or 2020,” added Robshaw.\nThe LEI acquisition and underwriting team was led by Peter Morgan, John Gaghan, and Alon Kraft. AIC Ventures was represented by Managing Partner Mike Baucus, and the Dallas HFF office in the sales process. For financing, LEI also used HFF, whose team included Senior Managing Director Mark West, Managing Director Brandon Chavoya, and Director Michael George, with financing provided by the Los Angeles office of Natixis.\nAbout LEI:\nLowe Enterprises Investors (LEI) provides real estate investment management services on behalf of a select list of the institutional and high net worth clients and partners through individually managed accounts, commingled fund relationships, and targeted investment programs. The firm has been responsible for $7 billion in real estate assets, including commercial, hospitality and debt investments, since inception in the late 1980s. LEI has been a leading value-added investor through multiple cycles, employing equity and structured debt in its investment strategies. The firm is based in Los Angeles and is an affiliate of Lowe, a national investment, development, and management firm. Since inception in 1972, Lowe has acquired, developed or managed more than $28 billion of real estate assets. Lowe maintains additional regional offices in Southern California, Denver, Philadelphia, Seattle, and Washington, DC. For more information about LEI, please visit: www.leinvestors.com\nAbout AIC Ventures:\nAIC is a provider of capital to middle market companies seeking to redeploy capital from real estate holdings to more productive areas of their business. The company is currently completing the investment phase for its 10th NL Ventures Fund as well as for its Income Fund, which is expected to acquire an additional $300 million in office and industrial properties throughout the United States. AIC Ventures has been an active buyer of single tenant commercial real estate assets, with over 220 acquisitions completed totaling $1.7 billion in investment value. With an unmatched reputation during its more than 27 years in business, AIC Ventures is the most trusted buyer in commercial real estate today. www.aicventures.com\nAbout HFF:\nHFF and its affiliates operate out of 25 offices and are a leading provider of commercial real estate and capital markets services to the global commercial real estate industry. HFF, together with its affiliates, offers clients a fully integrated capital markets platform including debt placement, investment advisory, equity placement, funds marketing, M&A and corporate advisory, loan sales and loan servicing. HFF, HFF Real Estate Limited, HFF Securities L.P. and HFF Securities Limited are owned by HFF, Inc. (NYSE: HF). For more information, please visit hfflp.com or follow HFF on Twitter @HFF.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180110005984/en/\nDiehl Communications\nKaren Diehl\n310-741-9097\nkaren@diehlcommunications.com\nSource: Lowe Enterprises Investors", "external_links": ["http://www.businesswire.com/news/home/20180110005984/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.leinvestors.com&esheet=51741410&newsitemid=20180110005984&lan=en-US&anchor=www.leinvestors.com&index=1&md5=b0e769c89081c6adf2af6cd58086c83e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.aicventures.com&esheet=51741410&newsitemid=20180110005984&lan=en-US&anchor=www.aicventures.com&index=2&md5=ec3f6025a726735bb76f3eddfe97765a"], "published": "2018-01-10T20:52:00.000+02:00", "crawled": "2018-01-10T20:08:04.002+02:00", "highlightTitle": ""}