{"organizations": [], "uuid": "2e7dc4203e8d44b6ff93dea0c676bc4adfe7c4d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-tech-stocks-reach-record-bond-yields-rise-again-idUSL4N1PO3DL", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Tech stocks reach record, bond yields rise again", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-29T18:11:00.000+02:00", "replies_count": 0, "uuid": "2e7dc4203e8d44b6ff93dea0c676bc4adfe7c4d5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-tech-stocks-reach-record-bond-yields-rise-again-idUSL4N1PO3DL", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Tech stocks reach record, bond yields rise again", "locations": [], "entities": {"persons": [{"name": "alasdair pal", "sentiment": "none"}, {"name": "rebecca o’keeffe", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Technology stocks hit all-time high\n* U.S. Treasury yields at multi-year highs\n* German bond yields rise as ECB urged to end asset purchases\n* Dollar set for biggest monthly fall in nearly 2 years\n* Graphic: World FX rates in 2018 tmsnrt.rs/2egbfVh\nBy Alasdair Pal\nLONDON, Jan 29 (Reuters) - Technology stocks rallied on Monday at the start of a big week of earnings for the sector globally, while bond yields hit multi-year highs as investors braced for major central banks to step back from ultra-easy monetary policies.\nEuropean shares were mixed in early trading, with the pan-European Stoxx 600 index broadly flat.\nTech was in focus after Swiss chipmaker AMS, a key supplier for U.S. giant Apple, reported a doubling of its 2017 revenues and raised its earnings guidance far in excess of expectations.\n“Technology stocks have been at the forefront of equity market gains, and this week is pivotal for keeping the momentum going,” said Rebecca O’Keeffe, head of investment at Interactive Investor.\nMSCI’s global information technology sector index was 1.4 percent higher at an all-time high.\nIndustry heavyweights Apple, Alphabet, Facebook , Microsoft and Amazon are all set to report earnings this week.\nTIGHTENING TALK U.S. and European bond yields both reached milestones as investors prepare for central banks to tighten monetary policy, and after a European Central Bank policymaker said the ECB should spell out it would end its bond purchases this year.\nDutch central bank chief Klaas Knot said on Sunday the ECB should make clear that it will end its asset purchases after the current bond buying programme ends in September, adding: “There is no reason whatsoever to continue the programme.”\nBorrowing costs for Germany, the euro zone’s biggest economy, rose, with the five-year bond yield briefly turning positive for the first time in more than three years to reach a high of 0.004 percent. It was last trading at minus 0.01 percent.\nU.S. Treasury yields also rose, continuing a move to multi-year highs after strong growth figures posted on Friday.\n“The Knot comments are a factor behind the sell-off in bonds today,” said DZ Bank rates strategist Andy Cossor. “There’s also the sell-off in U.S. Treasuries.”\nHelped by rising bond yields, the dollar edged higher against a basket of currencies, rising a quarter of a percent to 89.30 after scoring six consecutive weeks of losses.\nConflicting signals from top U.S. officials last week did little to discourage bearish positions, with net short dollar bets increasing to their highest level since October, according to latest positioning data.\nDespite Monday’s rise the dollar is set to post its biggest monthly decline since March 2016.\nThe currency’s decline has been a boon for many commodities, with gold making a 17-month top last week and last trading at $1,346 an ounce.\nOil prices dipped on Monday but remained just off their highest level in three years.\nBrent crude futures were holding atop $70 at $70.28 a barrel. U.S. crude futures were up 23 cents at $66.23. (Reporting by Alasdair Pal; Additional reporting by Dhara Ranasinghe and Saikat Chatterjee; Editing by Catherine Evans)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-29T18:11:00.000+02:00", "crawled": "2018-01-29T15:13:00.006+02:00", "highlightTitle": ""}