{"organizations": [], "uuid": "756e710f55e3b58a5a3648b0809f3510bd2b0988", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226940791&w=1200&r=LYNXMPEE0U0VB", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-pakistan-afghanistan-refugees/pakistan-recommends-five-month-extension-for-afghan-refugees-idUSKBN1FK1R7", "country": "US", "domain_rank": 408, "title": "Pakistan recommends five-month extension for Afghan refugees", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:44:00.000+02:00", "replies_count": 0, "uuid": "756e710f55e3b58a5a3648b0809f3510bd2b0988"}, "author": "", "url": "https://www.reuters.com/article/us-pakistan-afghanistan-refugees/pakistan-recommends-five-month-extension-for-afghan-refugees-idUSKBN1FK1R7", "ord_in_thread": 0, "title": "Pakistan recommends five-month extension for Afghan refugees", "locations": [], "entities": {"persons": [{"name": "asif shahzad", "sentiment": "none"}], "locations": [{"name": "pakistan", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "kabul", "sentiment": "none"}], "organizations": [{"name": "taliban", "sentiment": "none"}, {"name": "min read  islamabad", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 45 PM / in 6 minutes Pakistan recommends five-month extension for Afghan refugees Asif Shahzad 3 Min Read \nISLAMABAD (Reuters) - A Pakistani government ministry recommended on Wednesday that Afghan refugees be given a five-month extension of their stay, dispelling fears that a large-scale repatriation back to violence-plagued Afghanistan was imminent. \nPakistan is home to the world’s second-largest refugee population, with a total of 2.5 million Afghans, many of whom been living there since the Soviet invasion of Afghanistan in 1979. \nBut relations between the neighbors have deteriorated in recent years and took another turn for the worse this week after bloody Taliban attacks in Kabul. \nAfghanistan and the United States say Taliban and other militants plot carnage in safe havens on the Pakistani side of the border and have repeatedly called on Pakistan to do more to rein them in. \nThe tense relations led to concern that Pakistan might retaliate by pushing back Afghan refugees, particularly since official permission to stay was only extended for 30 days at the beginning of this month. \nBut a spokesman for Pakistan’s Ministry of States and Frontier Regions said it had decided that permission to stay should be extended for another five months. \n“The main reason for the extension is that it isn’t possible humanly to ask over one million people to leave at once,” the spokesman, Aqdas Shaukat, told Reuters. \n“Our understanding is that another five months will give the refugees a good time to leave gradually.” \nThe cabinet would decide on the recommendation next week, he said. \nPakistan complains that the large number of refugees are a burden, and says that Islamist militants often hide among them, but humanitarian agencies say Afghanistan could not cope with an influx of repatriated refugees at this time. \nIt is already struggling to help those refugees who have come back over recent years as well people displaced internally by fighting. \nIn 2017, fighting forced 360,000 people from their homes, the United Nations said in a recent report, while more than 17,000 people were displaced over the past week, the U.N. Organisation for the Co-ordination of Humanitarian Assistance said. \nOn the outskirts of Kabul, refugees who have come back from Pakistan and internally displaced people eke out a living on a windswept, muddy plain and wait for help. \n“We returned from Pakistan and have nothing here,” said one woman called Shazia, who came back three years ago. \n“Our children collect plastic and paper to keep us warm.” \nAnother returnee from Pakistan, Etibar Gul, also worried about his children. \n“There is no food or clothing,” he said. “Our children have nothing to wear in this cold.” Additonal reporting by Reuters TV in KABUL; Writing by Robert Birsel; Editing by Nick Macfie", "external_links": [], "published": "2018-01-31T14:44:00.000+02:00", "crawled": "2018-01-31T14:57:10.000+02:00", "highlightTitle": ""}