{"organizations": [], "uuid": "3768fbea9c377c8399764cdf0e57deefa20288ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221274360&w=1200&r=LYNXMPEE0A1YG", "site_section": "http://feeds.reuters.com/reuters/scienceNews", "section_title": "Reuters: Science News", "url": "https://www.reuters.com/article/us-space-mars/martian-ice-deposits-could-sustain-human-outposts-in-the-future-idUSKBN1F034E", "country": "US", "domain_rank": 408, "title": "Martian ice deposits could sustain human outposts in the future", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-12T07:25:00.000+02:00", "replies_count": 0, "uuid": "3768fbea9c377c8399764cdf0e57deefa20288ef"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-space-mars/martian-ice-deposits-could-sustain-human-outposts-in-the-future-idUSKBN1F034E", "ord_in_thread": 0, "title": "Martian ice deposits could sustain human outposts in the future", "locations": [], "entities": {"persons": [{"name": "colin dundas", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "south america", "sentiment": "none"}, {"name": "martian", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "flagstaff", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}], "organizations": [{"name": "nasa", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "astrogeology science center", "sentiment": "none"}, {"name": "u.s. geological survey", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - Scientists using images from an orbiting NASA spacecraft have detected eight sites where huge ice deposits near the Martian surface are exposed on steep slopes, a potential source of water that could help sustain future human outposts.\nWhile scientists already knew that about a third of the surface of Mars contains shallow ground ice and that its poles harbor major ice deposits, the research published on Thursday described thick underground ice sheets exposed along slopes up to 100 yards (meters) tall at the planet’s middle latitudes.\n“It was surprising to find ice exposed at the surface at these places. In the mid-latitudes, it’s normally covered by a blanket of dust or regolith,” loose bits of rock atop a layer of bedrock, said research geologist Colin Dundas of the U.S. Geological Survey’s Astrogeology Science Center in Flagstaff, Arizona, who led the study.\nThe latitudes were the equivalent on Earth of Scotland or the tip of South America.\nThe researchers used images from NASA’s Mars Reconnaissance Orbiter, which has studied the Martian atmosphere and terrain since 2006, including the history of apparent water flows on or near the surface.\nThe findings showed that ice may be more available than previously known for use as water to support future robotic or human exploration missions, perhaps even the establishment of a permanent Mars base. The water could be used for drinking and potentially conversion into oxygen to breathe.\n“Humans need water wherever they go, and it’s very heavy to carry with you. Previous ideas for extracting human-usable water from Mars were to pull it from the very dry atmosphere or to break down water-containing rocks,” said planetary scientist Shane Byrne of the University of Arizona Lunar and Planetary Laboratory, a co-author of the study in the journal Science.\n“Here we have what we think is almost pure water ice buried just below the surface. You don’t see a high-tech solution,” Byrne added. “You can go out with a bucket and shovel and just collect as much water as you need. I think it’s sort of a game-changer. It’s also much closer to places humans would probably land as opposed to the polar caps, which are very inhospitable.”\nThe deposits were found at seven geological formations called scarps, with slopes up to 55 degrees, in the southern hemisphere and one in the northern hemisphere.\n“Our interpretation is that this is consolidated snow deposited in geologically recent times,” Dundas said.\nReporting by Will Dunham; Editing by Sandra Maler\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T07:25:00.000+02:00", "crawled": "2018-01-12T02:23:03.008+02:00", "highlightTitle": ""}