{"organizations": [], "uuid": "d097bf408b7f48aad6341801b3c9f32fbe2d606c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222877730&w=1200&r=LYNXMPEE0H016", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/us-japan-india-train-exclusive/exclusive-japan-in-drivers-seat-for-indian-bullet-train-deals-idINKBN1F7036", "country": "US", "domain_rank": 408, "title": "Exclusive: Japan in driver's seat for Indian bullet train deals", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T02:40:00.000+02:00", "replies_count": 0, "uuid": "d097bf408b7f48aad6341801b3c9f32fbe2d606c"}, "author": "", "url": "https://in.reuters.com/article/us-japan-india-train-exclusive/exclusive-japan-in-drivers-seat-for-indian-bullet-train-deals-idINKBN1F7036", "ord_in_thread": 0, "title": "Exclusive: Japan in driver's seat for Indian bullet train deals", "locations": [], "entities": {"persons": [{"name": "rupam jain", "sentiment": "none"}, {"name": "neha dasgupta", "sentiment": "none"}, {"name": "narendra modi", "sentiment": "none"}, {"name": "modi", "sentiment": "none"}, {"name": "yuka obayashi", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 12:41 AM / Updated 31 minutes ago Exclusive: Japan in driver's seat for Indian bullet train deals Neha Dasgupta , Rupam Jain , Yuka Obayashi 7 Min Read \nNEW DELHI/TOKYO (Reuters) - Japanese steel and engineering companies are in the driver’s seat to bag major supply contracts for a $17 billion Indian bullet train, several sources said, undermining a key component of Prime Minister Narendra Modi’s economic policy - a push to ‘Make in India’. \nJapan is funding most of the project, and Japanese companies are likely to supply at least 70 percent of the core components of the rail line, said five sources in New Delhi with direct knowledge of the matter. \nA spokesman for Modi’s office declined comment. \nA Japanese transport ministry official involved in the project said the two countries were still working out a strategy for the supply of key components, and would unveil a plan for procurements around July. The official spoke on condition of anonymity. \nThe September 2017 agreement between Japan and India for the bullet train project included two clauses - the promotion of ‘Make in India’ and ‘Transfer of Technology’ - through which New Delhi had hoped to set up manufacturing facilities in the country, generate jobs and get a toehold in Japanese technology. \nModi faces a general election in 2019 and is under pressure to provide more jobs to millions of unemployed in India. Critics also say the bullet train is wasteful and that the money could be better used elsewhere. \n“The Japanese have reservations on certain issues because they have a concern that there is a difference in the culture and systems of Japan from the culture and systems in India,” said Achal Khare, the managing director of National High Speed Rail Corp Ltd (NHSRCL), the agency tasked to execute the bullet train project. \n“The work culture is very different,” he told Reuters. \nKhare did not elaborate but two Indian railways officials, who spoke on condition of anonymity, said their Japanese counterparts had raised questions about efficiency in Indian companies and their ability to meet timelines. \nThe World Bank currently ranks India 100th out of 190 nations on the ease of doing business, giving it relatively low marks for starting a business, enforcing contracts and dealing with construction permits. \nTomoyuki Nakano, director for international engineering affairs in the railway bureau at Japan’s transport ministry, said the issue was that Indian companies had no experience or technologies specializing in high-speed railway systems at present. \n“I don’t think Japanese are concerned about a difference in the work culture,” Nakano said. He and other Japanese officials said efforts were continuing to fulfill the ‘Make in India’ component of the agreement by promoting collaborations between companies from the two countries. \nStill, several Indian officials said it was by and large accepted that Indian companies would not have a major part to play in the bullet train project. \nJapan will get major leeway because the bullet train is largely funded by a 50-year loan provided by its government, said a close aide of Modi, who spoke on condition of anonymity. “At this stage to expect Indian companies to have a bigger share in manufacturing appears to be a little difficult,” said a senior official at the Indian government’s policy think-tank, NITI Aayog, who is involved in the negotiations. \nModi’s flagship ‘Make in India’ initiative aims to lift the share of manufacturing in India’s $2 trillion economy to 25 percent from 17 percent and create 100 million jobs by 2022. However, midway through Modi’s five-year term, manufacturing was still at 17 percent of India’s GDP in the 2016/17 financial year from 15 percent previously. ONLY ONE JOINT VENTURE FILE PHOTO: Performers walk at the exhibition centre of the 'Make In India' week in Mumbai, India, February 13, 2016. REUTERS/Danish Siddiqui/File Photo \nJapan’s Prime Minister Shinzo Abe laid the foundation stone for India’s first bullet train in September last year. It will link Mumbai with Ahmedabad, the largest commercial city in Modi’s home state Gujarat. \nNippon Steel and Sumitomo Metal Corp ( 5401.T ), Japan’s biggest steelmaker, and other companies like JFE Holdings Inc ( 5411.T ), Kawasaki Heavy Industries Ltd ( 7012.T ), Mitsubishi Heavy Industries Ltd ( 7011.T ), Toshiba Corp ( 6502.T ) and Hitachi Ltd ( 6501.T ) are likely to bid for various contracts, said three senior Indian government officials directly involved in the project. \nNippon Steel said it would not comment on specific projects. \nJFE, Hitachi and Toshiba said they were interested in the project but had not finalised plans, including any possibilities of joint ventures with Indian firms. \nMitsubishi Heavy said it had not decided if it wanted to be involved. \nThe sole collaboration aimed at the bullet train project is between Kawasaki Heavy Industries and India’s Bharat Heavy Electricals Ltd ( BHEL.NS ), which aims to win carriage orders. \nJapanese government officials have asked for more bullet train corridors in India before transferring technology, three senior Indian officials said. \nBut New Delhi is unlikely to announce any new projects until the final cost and commercial feasibility of the Mumbai-Ahmedabad link is clear, the officials said. \n“It’s like a chicken and egg situation on technology. The Japanese want an economy of scale and business but the Indian view is that India is a big market that once this market is explored the business will automatically be generated,” said Khare from NHSRCL. MISSED OPPORTUNITY \nNew Delhi has tried to help Indian steel companies grab a slice of the pie. \nThe Indian government last year mediated negotiations between Nippon Steel and India’s Jindal Steel and Power Ltd ( JNSP.NS ) to set up a joint venture to manufacture rails, but the talks fell through after the Japanese major raised quality concerns, three sources in New Delhi said. \nState-owned Steel Authority of India ( SAIL.NS ) (SAIL), which for decades has been the main supplier of rails to Indian Railways, was also overlooked by Japanese companies due to quality concerns, the sources said. \nNippon Steel declined comment and while Jindal and SAIL did not reply to e-mails seeking comment. \nLeft with little choice, Indian firms will now largely provide raw materials like cement and supply manpower for the assembly of rails, the sources said. \nIndia’s UltraTech Cement Ltd ( ULTC.NS ), Larsen & Toubro Ltd ( LART.NS ), Bharat Heavy Electricals Ltd <BHEL.NS > and Ambuja Cements Ltd ( ABUJ.NS ) are among those in the race for the supply of construction materials and power, the two Indian railways officials said. \nThese companies did not respond to Reuters’ requests for comment. Editing by Mayank Bhardwaj and Raju Gopalakrishnan", "external_links": [], "published": "2018-01-18T02:40:00.000+02:00", "crawled": "2018-01-18T03:06:43.029+02:00", "highlightTitle": ""}