{"organizations": [], "uuid": "0c519988d56965e6b331517a686373bc9550738f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-nci-appoints-brad-mascho-as-new-chief-artificial-intelligence-officer.html", "country": "US", "domain_rank": 767, "title": "NCI Appoints Brad Mascho as New Chief Artificial Intelligence Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T17:07:00.000+02:00", "replies_count": 0, "uuid": "0c519988d56965e6b331517a686373bc9550738f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-nci-appoints-brad-mascho-as-new-chief-artificial-intelligence-officer.html", "ord_in_thread": 0, "title": "NCI Appoints Brad Mascho as New Chief Artificial Intelligence Officer", "locations": [], "entities": {"persons": [{"name": "brad mascho", "sentiment": "negative"}, {"name": "paul dillahay", "sentiment": "none"}, {"name": "brad", "sentiment": "none"}, {"name": "masch", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "reston", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "nci", "sentiment": "negative"}, {"name": "nci, inc.", "sentiment": "neutral"}, {"name": "caio", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Company doubles down on innovation initiatives\nRESTON, Va.--(BUSINESS WIRE)-- NCI, Inc., a leading provider of information technology and professional services and solutions to U.S. Federal Government agencies, today announced Brad Mascho has joined the company as chief artificial intelligence officer (CAIO). In this role, he is responsible for leading a new corporate division focused around artificial intelligence (AI) initiatives and strategy to accelerate, automate and augment repeatable processes for NCI’s customers, quickly turning data into actionable intelligence.\n“NCI’s purpose is to bridge the gap between commercial innovation and missions of national importance,” said NCI CEO Paul Dillahay. “Being one of the first solution providers to add a CAIO is just another example of our commitment to innovation. Brad is the ideal visionary to help our clients realize the transformational impact happening at the intersection of AI, machine learning and predictive analytics. We are excited to add Brad’s entrepreneurial spirit to our executive leadership team.”\nBefore joining NCI, Mascho co-founded Columbus, Ohio-based CrossChx, the industry leader in building meaningful AI that empowers and scales humans. The CrossChx solution automates repetitive, high-volume tasks and workflows for healthcare clients. Backed by nearly $50 million in venture capital and under his direction as president, CrossChx quickly expanded to more than 100 employees and was named to Columbus Business First’s list of Best Places to Work for three consecutive years. The company partnered with hundreds of health systems and developed the first secure global identity layer of more than 70 million unique patient IDs, identified millions of medical record errors and helped combat prescription opiate abuses. Brad will remain a member of the CrossChx board of directors.\n“Artificial intelligence is a generation-changing technology with the potential to improve productivity in ways we have not seen for decades,” says Mascho. “NCI has made a very conscious decision to prioritize innovation and is perfectly positioned to bring game-changing solutions to the federal sector. I could not be more excited about the opportunity to spearhead these efforts and join the NCI team.”\nMascho earned a reputation as a “change agent” after tackling significant challenges in healthcare such as the opioid crisis and global identity resolution. He also spent a decade in Washington, D.C., as an advisor to several members of Congress and as an executive at a leading insurance association. Mascho earned a B.A. and M.A. from Miami University in Oxford, Ohio.\nNCI Spotlighting AI at HIMSS18\nNCI will be at the HIMSS18 Annual Conference & Exhibition, taking place March 5-9 in Las Vegas showcasing its AI, machine learning and data matching solutions. Attendees will be able to learn more and see real use cases of how the company is using AI solution sets to help federal customers tackle fraud, waste and abuse, the opioid crisis, administrative workflows, and more.\nNCI will be exhibiting in booth #10316. For more information, please visit: https://www.linkedin.com/showcase/himss-2018/\nAbout NCI, Inc.\nNCI is a leading provider of enterprise solutions and services to U.S. defense, intelligence, health and civilian government agencies. The company has the expertise and proven track record to solve its customers’ most important and complex mission challenges through technology and innovation. With core competencies in delivering cost-effective solutions and services in areas such as agile digital transformation; advanced analytics; hyperconverged infrastructure; cybersecurity and information assurance; fraud, waste and abuse detection; engineering and logistics; NCI’s team of highly skilled professionals are expanding their portfolio to include generation-changing technology offerings such as artificial intelligence for their government customers. Coupled with a refined focus on strategic partnerships, NCI is committed to bringing commercial innovation to missions of critical importance. Headquartered in Reston, Virginia, NCI has approximately 2,000 employees operating at more than 130 locations worldwide. For more information, visit www.nciinc.com or email contactnci@nciinc.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130005541/en/\nNCI, Inc.\nAmanda Hall, 703-707-6677\nDirector of Communications\nSource: NCI, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.nciinc.com&esheet=51750690&newsitemid=20180130005541&lan=en-US&anchor=www.nciinc.com&index=2&md5=1b77383837021d1270f8f042ebef11f2", "https://www.linkedin.com/showcase/himss-2018/", "http://www.businesswire.com/news/home/20180130005541/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.linkedin.com%2Fshowcase%2Fhimss-2018%2F&esheet=51750690&newsitemid=20180130005541&lan=en-US&anchor=https%3A%2F%2Fwww.linkedin.com%2Fshowcase%2Fhimss-2018%2F&index=1&md5=e563ede679f9364d0a4bffbd4d42c64e"], "published": "2018-01-30T17:07:00.000+02:00", "crawled": "2018-01-30T18:45:24.018+02:00", "highlightTitle": ""}