{"organizations": [], "uuid": "c011cbdf9c864014a54765815568e6e16a081f1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-govt-shutdown-deadline-nears-trump-says-not-looking-good.html", "country": "US", "domain_rank": 767, "title": "Gov't shutdown deadline nears; Trump says 'not looking good'", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T08:08:00.000+02:00", "replies_count": 0, "uuid": "c011cbdf9c864014a54765815568e6e16a081f1e"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-govt-shutdown-deadline-nears-trump-says-not-looking-good.html", "ord_in_thread": 0, "title": "Gov't shutdown deadline nears; Trump says 'not looking good'", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald", "sentiment": "negative"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — The government careened toward shutdown Friday night in a chaotic close to Donald Trump's first year as president, as Democrats and Republicans preemptively traded blame while still struggling to find some accord before a deadline at the stroke of midnight.\nThe lawmakers and Trump's White House mounted last-ditch negotiations to stave off what had come to appear as the inevitable, with the parties in stare-down mode over federal spending and proposals to protect some 700,000 younger immigrants from deportation.\nAfter hours of negotiating, the Senate scheduled a late-night vote on a House-passed plan.\n\"Not looking good,\" Trump tweeted Friday evening. It appeared likely to fail.\nThe election-year standoff marked a test of the president's much vaunted deal-making skills — and of both parties' political fortitude. Republicans, who control both Congress and the White House, faced the prospect of being blamed for the display of dysfunction — just the fourth shutdown in a quarter-century. It could also threaten to slow any GOP momentum, one month after passage of the party's signature tax cut law.\nDemocrats, too, risked being labeled obstructionist. Republicans branded the confrontation a \"Schumer shutdown\" and argued that Democrats were harming fellow Americans to protect \"illegal immigrants.\"\nTrump summoned Senate   to the White House Friday afternoon in hopes of cutting a deal. But the two New Yorkers, who pride themselves on their negotiating abilities, emerged from the meeting at the White House without an agreement, and Republicans and Democrats in Congress continued to pass off responsibility.\n\"We made some progress, but we still have a good number of disagreements,\" Schumer said upon returning to Capitol Hill. Budget Director Mick Mulvaney told CNN that \"Not much has changed\" over the course of the day, but he predicted a deal would be reached by Monday, when most government offices are to reopen after the weekend.\nDemocrats in the Senate served notice they would filibuster a four-week extension, the government-wide funding bill that cleared the House Thursday evening. They're seeking an even shorter extension that they think will keep the pressure on the White House to cut a deal to protect \"dreamer\" immigrants — who were brought to the country as children and are now here illegally — before their legal protection runs out in March.\nBut a White House official said Trump would oppose a mini-short-term agreement to keep the government open through the weekend, suggesting lawmakers would be in their exact same position in a few days.\nFor his part, Trump described his discussion with Schumer as an \"excellent preliminary meeting,\" tweeting that lawmakers are \"Making progress - four week extension would be best!\"\nSenate GOP leader John Cornyn of Texas said Trump told Schumer to work things out with Republican   and House Speaker Paul Ryan. McConnell did not attend the meeting because he was not invited, a Senate GOP aide said.\nTrump has been an unreliable negotiator in the weeks leading up to the showdown. Earlier this week he tweeted opposition to the four-week plan, forcing the White House to later affirmed his support. He expressed openness to extending the Deferred Action for Childhood Arrivals program, only to reject a bipartisan proposal. His disparaging remarks about African and Haitian immigrants last week helped derail further negotiations.\nStill, officials said the president has been working the phones trying to avert a shutdown. The president had been set to leave Friday afternoon to attend a fundraiser at his Palm Beach, Florida, estate marking the one-year anniversary of his inauguration, but delayed his travel until at least Saturday.\n\"I think the president's been very clear: he's not leaving until this is finished,\" Mulvaney told reporters.\nAs word of the Schumer meeting spread, the White House hastened to reassure Republican congressional leaders that Trump would not make any major policy concessions, said a person familiar with the conversations but not authorized to be quoted by name. Senate GOP leader John Cornyn of Texas said Trump told Schumer to work things out with Republican   and House Speaker Paul Ryan.\nOn Capitol Hill, McConnell said Americans at home would be watching to see \"which senators make the patriotic decision\" and which \"vote to shove aside veterans, military families and vulnerable children to hold the entire country hostage... until we pass an immigration bill.\"\nAcross the Capitol, the House backed away from a plan to adjourn for a one-week recess, meaning the GOP-controlled chamber could wait for a last-minute compromise that would require a new vote.\n\"We can't keep kicking the can down the road,\" said Schumer, insisting on more urgency in talks on immigration. \"In another month, we'll be right back here, at this moment, with the same web of problems at our feet, in no better position to solve them.\"\nThe four-week measure would be the fourth stopgap spending bill since the current budget year started in October. A pile of unfinished Capitol Hill business has been on hold, first as Republicans ironed out last fall's tax bill and now as Democrats insist on progress on immigration. Talks on a budget deal to ease tight spending limits on both the Pentagon and domestic agencies are on hold, as is progress on a huge $80 billion-plus disaster aid bill.\nBefore Thursday night's House approval, GOP leaders sweetened the stopgap measure with legislation to extend for six years a popular health care program for children from low-income families and two-year delays in unpopular \"Obamacare\" taxes on medical devices and generous employer-provided health plans.\nA shutdown would be the first since 2013, when tea party Republicans — in a strategy not unlike the one Schumer is employing now — sought to use a must-pass funding bill to try to force then-President Barack Obama to delay implementation of his marquee health care law. At the time, Trump told Fox & Friends that the ultimate blame for a shutdown lies at the top. \"I really think the pressure is on the president,\" he said.\nArguing that Trump's predecessors \"weaponized\" that shutdown, Mulvaney said Friday the budget office would direct agencies to work to mitigate the impact this time. That position is a striking role-reversal for the conservative former congressman, who was one of the architects of the 2013 shutdown over the Affordable Care Act.\nWith no agreement by midnight,   begin immediately locking its doors. The impact would initially be spotty — since most agencies would be closed until Monday — but each party would be gambling the public would blame the other.\nIn the event of a shutdown, food inspections, federal law enforcement, airport security checks, and other vital services would continue, as would Social Security, other federal benefit programs and military operations.\nAssociated Press writers Jill Colvin and Catherine Lucey contributed to this report.", "external_links": [], "published": "2018-01-19T08:08:00.000+02:00", "crawled": "2018-01-20T05:49:15.070+02:00", "highlightTitle": ""}