{"organizations": [], "uuid": "cd23ec6592920b4589d232e3e4ba64053efa4f3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222143553&w=1200&r=LYNXMPEE0E0VF", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-skat-kramer/dutch-talisman-kramer-hoping-to-strike-10000m-gold-idUKKBN1F41N0", "country": "US", "domain_rank": 408, "title": "Dutch talisman Kramer hoping to strike 10,000m gold", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T15:05:00.000+02:00", "replies_count": 0, "uuid": "cd23ec6592920b4589d232e3e4ba64053efa4f3d"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-skat-kramer/dutch-talisman-kramer-hoping-to-strike-10000m-gold-idUKKBN1F41N0", "ord_in_thread": 0, "title": "Dutch talisman Kramer hoping to strike 10,000m gold", "locations": [], "entities": {"persons": [{"name": "simon jennings", "sentiment": "negative"}, {"name": "kramer", "sentiment": "negative"}, {"name": "sven kramer", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": [{"name": "isu", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 10 PM / Updated 12 minutes ago Dutch talisman Kramer hoping to strike 10,000m gold Simon Jennings 4 Min Read \nLONDON (Reuters) - The Dutch speed skating team at the Winter Olympics in South Korea is hoping their talisman Sven Kramer can complete his dominance of the longer distances with an elusive gold in the 10,000 metres. FILE PHOTO: Speed Skating - ISU European Speed Skating Championships All Round medal ceremony- Heerenveen, the Netherlands - 8/1/17 Gold medal winner Sven Kramer of the Netherlands reacts on the podium. REUTERS/Michael Kooren/File Photo \nThe 31-year-old has won the event five times at the world single distance championships and broken the world record three times, and an Olympic gold in Pyeongchang would ease the heartache he endured at the 2010 Vancouver Games. \nKramer won gold in the 5,000 in Vancouver and finished first in the 10,000 final, but was disqualified for choosing the wrong lane after he received incorrect instructions from his coach. \nThe seven-time Olympic medallist took gold in the 5,000 and team pursuit at the Sochi Games four years ago, but finished behind team mate Jorrit Bergsma in the 10,000. \n“That’s for sure his target,” Arie Koops, technical director of the Dutch speed skating association, told Reuters. \n“Of course he’d like some more medals not only that one, but gold in the 10,000 will be a special target for him.” \nYet the Dutch may not have it all their own way in South Korea, with Kramer and Bergsma likely to face competition from Canada’s Ted Jan-Bloemen, who was born in the Netherlands. \nThe 31-year-old Jan-Bloemen obtained Canadian citizenship in 2014 and currently holds world records in both the 5,000 and 10,000, but next month’s Olympics will be his first. OLYMPIC VETERAN \nKramer, in contrast, got his first taste of the Winter Olympics at Turin in 2006, where he won silver in the 5,000 and bronze in the team pursuit. FILE PHOTO: Speed Skating - Men's 10000 meters - ISU European Speed Skating Championships All Round - Heerenveen, the Netherlands - 8/1/17Ê Sven Kramer of the Netherlands skates. REUTERS/Michael Kooren/File Photo \nSpeed skating runs in Kramer’s family -- his father Yep competed in the 1980 and 1984 Olympic Winter Games -- and his experience on the ice and reputation as one of the world’s best all-round skaters make him a formidable opponent. \nIt was Kramer’s experience that led to him being named to race in the mass start for the Netherlands at the Games, much to his own surprise as he is also in the 5,000 and team pursuit. \n“That was a big surprise,” Koops said. \n“But we already saw him competing in some Dutch mass start races, and he competed in our marathon in a race of 125 laps, so he is also doing his endurance training on the marathon.” \nUnlike most speed skating events on the long track where skaters race the clock, the mass start, which is making its Olympic debut in South Korea, involves a peloton so tactics and positioning come to the fore. \n“He is used to skating in a pack,” Koops added. \n“We wanted to bring our real best skaters into the mass start and our head coach for the team pursuit and mass start decided to bring in Sven Kramer as one of the best skaters of the Netherlands.” \nThe Dutch have also named sprinter Koen Verweij to partner Kramer, so the team can have the best of both worlds in the sport’s newest Olympic event. \n“The mass start has evolved really quickly,” Koops said. \n“You see more skaters who are skating in the 1,000 and 1,500, so there’s a lot of speed in the final sprint, that’s why I think the coach made his decision on Sven and Koen Verweij.” Editing by Greg Stutchbury", "external_links": [], "published": "2018-01-15T15:05:00.000+02:00", "crawled": "2018-01-15T15:31:15.005+02:00", "highlightTitle": ""}