{"organizations": [], "uuid": "3a5abe57302b7302c856de5a7af954c211f623ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 13}, "facebook": {"likes": 275, "shares": 275, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/brotopia-penguin-publishing-group-crop1.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/02/brotopia-book-silicon-valley-sex-party/", "country": "US", "domain_rank": 1196, "title": "Silicon Valley Sex Parties: Emily Chang's Brotopia | Fortune", "performance_score": 2, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.013, "site_type": "news", "published": "2018-01-03T18:32:00.000+02:00", "replies_count": 0, "uuid": "3a5abe57302b7302c856de5a7af954c211f623ea"}, "author": "Kirsten Korosec", "url": "http://fortune.com/2018/01/02/brotopia-book-silicon-valley-sex-party/", "ord_in_thread": 0, "title": "Silicon Valley Sex Parties: Emily Chang's Brotopia | Fortune", "locations": [], "entities": {"persons": [{"name": "emily chang", "sentiment": "negative"}, {"name": "kirsten korosec", "sentiment": "negative"}, {"name": "chang", "sentiment": "none"}], "locations": [{"name": "silicon valley", "sentiment": "none"}, {"name": "brotopia", "sentiment": "none"}], "organizations": [{"name": "silicon valley sex", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "vanity fair", "sentiment": "none"}, {"name": "penguin publishing group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Kirsten Korosec January 2, 2018 \nWomen trying to break into the bro-centric world of Silicon Valley apparently must also navigate another minefield: invitations to exclusive, drug-fueled sex parties attended by some of the tech industry’s most powerful men. \nAnd it isn’t once-in-blue-moon thing, either. These parties are a regularly tech industry occurrence, according to Bloomberg reporter Emily Chang’s forthcoming book, Brotopia: Breaking Up the Boys’ Club of Silicon Valley. Excerpted in Vanity Fair on Tuesday , the book will be released Feb. 6 by Portfolio, an imprint of Penguin Publishing Group. \nHere, a few of most disturbing details from Chang’s excerpt, which describes parties where the male guests and hosts include “powerful first-round investors, well-known entrepreneurs, and top executives.” The Double Standard \nTo be clear, Chang reports that no one is forced to go attend the parties and notes that many of the people she spoke to see them as a lifestyle choice. Rather than feeling shame, she said, some of her (largely anonymous) sources spoke “proudly about how they’re overturning traditions and paradigms in their private lives, just as they do in the technology world they rule.” \nHowever, many of the women cited tell a different story. Indeed, Chang writes that that the choice to attend such a party—or to turn down the invite—is more consequential for women than for men, particularly as it relates to their careers. \nFemale entrepreneurs told Chang that turning down invitations relegates them to “the uncool-kids’ table.” They miss opportunities to talk business and make deals, which they say always happens at these parties. However, attending the events can also have a negative impact. \nWhat happens at these sex parties doesn’t stay there, according to the excerpt. Instead, it turns into industry gossip and can provoke unwanted attention and even torpedo job opportunities. In one case, repeat entrepreneur Esther Crawford told Chang that an investor “found it difficult to think of her simply as an entrepreneur rather than as a potential hookup.” \nA key quote from an unnamed female entrepreneur: “If you do participate in these sex parties, don’t ever think about starting a company or having someone invest in you. Those doors get shut. But if you don’t participate, you’re shut out. You’re damned if you do, damned if you don’t.” Found Hounder \nThe idea that there are scores of women—sometimes called “founder hounders”—prowling Silicon Valley for a wealthy and innovative tech founder is rampant, writes Chang. The notion that there are women preying on these powerful men has helped them rationalize behavior that reportedly includes “feeding women inhibition-melting drugs at sex parties,” according to the excerpt. \nAs one anonymous male founder told Chang, “it’s women who are taking advantage of him and his tribe, preying on them for their money.” Even the MDMA is branded \nMDMA, which is also known as Ecstasy or Molly, is a common party favor at these events, according to Chang. It’s hardly surprising that drugs are being used at a sex party, but the branding might raise some eyebrows: At these Silicon Valley events, Chang reports that the Molly is sometimes molded into the logos of hot tech companies. The drug use apparently sparks “cuddle puddles,”—literally groups of people cuddling—as well as sexual encounters. Progressively Old School \nThe parties are structured to fulfill the traditional male heterosexual fantasies, with a demographic stacked in men’s favor. Only powerful men are invited and they are heavily outnumbered by the women, who tend to be young and work in tech or a related field like real estate or public relations, reports Chang. \n“Women are often expected to be involved in threesomes that include other women; male gay and bisexual behavior is conspicuously absent,” she writes. “Outside of the new types of drugs, these stories might have come out of the Playboy Mansion circa 1972.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-03T18:32:00.000+02:00", "crawled": "2018-01-03T01:02:26.003+02:00", "highlightTitle": ""}