{"organizations": [], "uuid": "dcd8421d765c8401363b4b38c1dbf2f28ed8395d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220493360&w=1200&r=LYNXMPEE080J2", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/tunisia-protests/tunisias-difficult-economic-situation-will-improve-in-2018-pm-idINKBN1EY0W6", "country": "US", "domain_rank": 408, "title": "Tunisia's difficult economic situation will improve in 2018 - PM", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T11:29:00.000+02:00", "replies_count": 0, "uuid": "dcd8421d765c8401363b4b38c1dbf2f28ed8395d"}, "author": "", "url": "https://in.reuters.com/article/tunisia-protests/tunisias-difficult-economic-situation-will-improve-in-2018-pm-idINKBN1EY0W6", "ord_in_thread": 0, "title": "Tunisia's difficult economic situation will improve in 2018 - PM", "locations": [], "entities": {"persons": [{"name": "ulf laessing", "sentiment": "none"}, {"name": "tarek amara", "sentiment": "none"}, {"name": "youssef chahed", "sentiment": "none"}, {"name": "john stonestreet", "sentiment": "none"}], "locations": [{"name": "tunisia", "sentiment": "none"}, {"name": "tunis", "sentiment": "none"}, {"name": "tunis", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "assembly of people's representatives", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TUNIS (Reuters) - Tunisian police clashed with anti-government protesters in the capital Tunis and several other towns on Tuesday, residents said, as fresh demonstrations against austerity measures broke out a day after one person was killed in unrest.\nTunisia's Prime Minister Youssef Chahed speaks at the Assembly of People's Representatives in Tunis, Tunisia November 21, 2017. REUTERS/Zoubeir Souissi/Files Protests erupted in at least 12 towns across Tunisia on Monday, among them the tourist towns of Sousse and Hammamet, against price and tax rises imposed by the government to reduce its ballooning deficit and satisfy international lenders.\nIn Tunis on Tuesday police fired tear gas in two districts and also fired gas at a crowd storming a supermarket of France’s Carrefour, a witness said. No casualties were reported.\nFresh clashes also broke out in Tebourba, a town 40 km (25 miles) west of Tunis where one protester was killed on Monday, witnesses said, and soldiers could be seen there and in Jelma, a central town where clashes were also reported.\nThe main opposition party had hours earlier called for protests to continue until the government scrapped what it called an unjust 2018 budget including price and tax hikes.\nWhile Tunisia is widely seen as the only democratic success story among the nations where Arab Spring revolts took place in 2011, it has had nine governments since then and none of them have been able to tackle growing economic problems.\nEurope is concerned about stability in Tunisia, partly because unemployment there has forced many young Tunisians to go abroad: The number of boats smuggling migrants to Italy has been rising and Tunisia has also produced the largest number of jihadists heading for battlefields in Iraq, Syria and Libya.\nPublic anger has been building since Jan. 1, when the government raised the prices of petrol and other items and hiked taxes on cars, phone calls, internet usage and hotel accommodation as part of those economic reforms.\nA year ago, the government agreed to a four-year loan programme with the International Monetary Fund worth about $2.8 billion in return for economic reforms.\n“Today we have a meeting with the opposition parties to coordinate our movements, but we will stay on the street and we will increase the pace of the protests until the unjust financial law is dropped,” opposition Popular Front leader Hamma Hammami told reporters.\nAdding to pressure on the government, Nourredine Taboubi, head of the labour union UGTT, demanded the minimum wage and aid for the poor be raised within a week, state news agency TAP said.\nPrime Minister Youssef Chahed called for calm, saying the economy would improve this year. Chahed, who heads a coalition of Islamist and secular parties, has been under constant pressure from labour unions over the faltering economy.\n“People have to understand that the situation is extraordinary and their country is having difficulties, but we believe that 2018 will be the last difficult year for the Tunisians,” Chahed said.\nThe 2011 uprising and two major militant attacks in Tunisia in 2015 damaged foreign investment and tourism, which accounts for eight percent of its economic activity.\n‘SACRIFICING THE POOR’\nThe demonstrations have so far been much smaller than previous protests since the overthrow of autocrat ruler Zine El-Abidine Ben Ali in 2011.\nBut those confrontations between the government, labour unions, Islamists and secular forces also started on a small scale before escalating.\nAnalysts say Chahed could amend some of his reforms. Under pressure from unions, officials have already agreed to increase public sector salaries this year and to avoid compulsory lay-offs which could provoke protests.\nThe government says it wants to cut the public sector wage bill to 12.5 percent of gross domestic product in 2020 from about 15 percent now by offering voluntary redundancies.\nBut it is also trying to impose higher petrol prices and contributions to social security, which are tough for many people to swallow after years of hardship.\n“At the time of Ben Ali, which we did not like, I filled my stand with vegetables, fruits and other items with 10 dinars, and now 50 dinars do not fill this gap. The situation has worsened dramatically,” said Fatma, a market woman in a Tunis.\n“The government is sacrificing the poor and the middle class by raising prices and ignoring tax evaders and businessmen,” she said.\nSeparately, a judge ordered the arrest of a finance ministry official on suspicion of graft, another judge said, the first such move against a senior official since Chahed announced a crackdown last year.\nThe country’s anti-corruption committee says graft is widespread. It has presented cases against 50 state officials accused of corruption.\nReporting by Tarek Amara and Ulf Laessing; Writing by Ulf Laessing; Editing by Raissa Kasolowsky, Hugh Lawson, William Maclean\n ", "external_links": [], "published": "2018-01-09T11:29:00.000+02:00", "crawled": "2018-01-09T11:58:41.033+02:00", "highlightTitle": ""}