{"organizations": [], "uuid": "1ce7117d6827cb88db94458b1950fcf628c4c926", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-mercer-advisors-acquires-austin-based-murray-co-asset-management.html", "country": "US", "domain_rank": 767, "title": "Mercer Advisors Acquires Austin-based Murray & Co. Asset Management", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:10:00.000+02:00", "replies_count": 0, "uuid": "1ce7117d6827cb88db94458b1950fcf628c4c926"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-mercer-advisors-acquires-austin-based-murray-co-asset-management.html", "ord_in_thread": 0, "title": "Mercer Advisors Acquires Austin-based Murray & Co. Asset Management", "locations": [], "entities": {"persons": [{"name": "dean murray", "sentiment": "none"}, {"name": "murray", "sentiment": "none"}, {"name": "dave", "sentiment": "none"}, {"name": "mercer", "sentiment": "none"}], "locations": [{"name": "santa barbara", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "southwest", "sentiment": "none"}, {"name": "tx", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}, {"name": "santa barbara", "sentiment": "none"}], "organizations": [{"name": "mercer advisors inc.", "sentiment": "negative"}, {"name": "mercer advisors acquires austin-based murray & co", "sentiment": "neutral"}, {"name": "murray & co.", "sentiment": "none"}, {"name": "ria", "sentiment": "none"}, {"name": "mercer", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SANTA BARBARA, Calif., Jan. 9, 2018 /PRNewswire/ -- Mercer Advisors Inc. (\"Mercer Advisors\"), a national Registered Investment Advisor (RIA) firm based in Santa Barbara, today announced the acquisition of Murray & Co., a privately owned and independent registered investment advisor (RIA).\nBased in Austin, TX, Murray & Co. was founded in 1999 by Dean Murray and has since grown to Assets Under Management (AUM) of $85 million. The firm's clients include high net worth individuals and families, endowments, non-profit foundations and corporate pension funds. Mr. Murray and his team will be joining Mercer.\n\"We are delighted that Dean Murray and his team will be joining the Mercer family and furthering our commitment to helping our clients on their journey to economic freedom,\" said Dave Welling Chief Executive Officer of Mercer Advisors. \"We are committed to being a driving force in the Texas market as well as throughout the Southwest. Murray & Co. is a great fit for Mercer both philosophically and culturally and we look forward to working with the Murray team to broaden our service to our existing and future clients.\"\nMercer has been active in Texas, last year merging with Houston-based Kanaly Trust and acquiring Dallas-based Pegasus Advisors. The two transactions helped to quickly establish Mercer's strong presence in the state with over $2 billion of combined AUM. Mercer Advisors' \"integration not aggregation\" acquisition strategy is gaining momentum in the independent RIA marketplace as mid-sized firms look for long-term solutions for their growth and succession. Through its size, scale and family office approach, Mercer is quickly becoming the firm of choice for firms to partner with in order to continue to provide an outstanding service experience for their clients, bring added investment, estate and tax resources into their offering, while providing a career expansion opportunity for staff.\nMercer Vice Chairman David Barton, who leads the company's M&A activity, said, \"Murray & Co. is well known in Austin and this transaction is an opportunity to invest in an established and well-positioned company that further builds our leadership position in Texas. Murray & Co.'s nearly 20-year commitment to its investors and their reputation in the market combine to make them an ideal partner who shares our principles and values and we are pleased to align with Dean and his team. Dean, a CFA, brings significant talent and experience to our team. Likewise, Dean and his team are looking forward to joining with us to benefit from Mercer's strong organic growth driven by our national sales force and channel partners, in addition to deepening client relationships through the delivery of Mercer's Family Office services.\"\nThis transaction increases Mercer's client assets to approximately $11.6 billion, with 7,800 clients nationwide.\nAbout Mercer Advisors\nEstablished in 1985, Mercer Advisors Inc. is a total wealth management firm that provides comprehensive, fee-only investment management, financial planning, family office services, retirement benefits and distribution planning, estate and tax planning, asset protection expertise, and corporate trustee and trust administration services. Mercer Advisors is the parent company of Mercer Global Advisors, one of the largest Registered Investment Advisors and financial planning firms in the U.S. with $11.6 billion in client assets and 7,800 clients. Headquartered in Santa Barbara, California, Mercer Advisors is privately held, has over 200 employees, and operates nationally through 26 branch offices across the country. For more information, visit www.merceradvisors.com .\nData as of November 28, 2017. Includes AUM, client, and personnel statistics from Kanaly Trust, a wholly owned subsidiary of Mercer Advisors.\nContact : Chris Tofalli\nChris Tofalli Public Relations, LLC\n914-834-4334\nView original content: http://www.prnewswire.com/news-releases/mercer-advisors-acquires-austin-based-murray--co-asset-management-300579627.html\nSOURCE Mercer Advisors", "external_links": ["http://www.merceradvisors.com/", "http://www.prnewswire.com/news-releases/mercer-advisors-acquires-austin-based-murray--co-asset-management-300579627.html"], "published": "2018-01-09T16:10:00.000+02:00", "crawled": "2018-01-09T17:54:17.000+02:00", "highlightTitle": ""}