{"organizations": [], "uuid": "2285543678c152b04be4803afebe72ebbb3fafc2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180129.html", "section_title": "Archive News &amp; Video for Monday, 29 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/olympics-2018-southkorea-northkorea/s-korea-says-still-pushing-forward-on-other-projects-with-n-korea-idUSL4N1PP1K8", "country": "US", "domain_rank": 408, "title": "S.Korea says still pushing forward on other projects with N.Korea", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.056, "site_type": "news", "published": "2018-01-30T11:38:00.000+02:00", "replies_count": 0, "uuid": "2285543678c152b04be4803afebe72ebbb3fafc2"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/olympics-2018-southkorea-northkorea/s-korea-says-still-pushing-forward-on-other-projects-with-n-korea-idUSL4N1PP1K8", "ord_in_thread": 0, "title": "S.Korea says still pushing forward on other projects with N.Korea", "locations": [], "entities": {"persons": [{"name": "north k", "sentiment": "negative"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "masikryong", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ministry of unification", "sentiment": "none"}, {"name": "unification ministry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL, Jan 30 (Reuters) - South Korea will go ahead with other Winter Olympics projects with North Korea despite Pyongyang calling off a joint cultural performance that was less than a week away, a South Korean government official said on Tuesday.\nNorth Korea called off the joint cultural performance, which had been scheduled for Feb. 4, late on Monday, blaming South Korean media for encouraging “insulting” public sentiment.\nHowever, the North and South were still in negotiations over details regarding sending South Korean athletes to train at North Korea’s Masikryong ski resort, an official at the Ministry of Unification in Seoul told Reuters.\nThere seemed to be no problems regarding plans for the joint training programme, said the official, who asked not to be identified because of the sensitivity of the matter.\nHowever, given the North’s decision on Monday, the official said it was unlikely that any joint performance would be held before the Winter Olympics begin in Pyeongchang on Feb. 9.\nThe Unification Ministry was expected to send its formal response to North Korea’s decision some time on Tuesday.\nNorth and South Korea launched rare talks early in January to bring North Koreans to the Pyeongchang Games after the North’s leader, Kim Jong Un, said in a New Year’s address he was willing to open up discussions with Seoul.\nPresident Moon Jae-in has seen his support rate drop over his administration’s response to North Korea’s participation in the Games, especially after it decided to form a combined women’s ice hockey team with athletes from the two Koreas for the Winter Olympics.\nMany South Koreans have complained that the unified women’s hockey team - the only such joint team to be formed - was unfair to the South Korean players. More than a hundred petitions against the unified team have been sent to the presidential Blue House’s website.\nGovernment and opposition parties criticised Pyongyang’s decision to call off the performance on Tuesday, with Moon’s Democratic Party saying in a statement “frequent promise-breaking leads to fatigue”.\n“It’s North Korea’s responsibility to show its sincerity. It’s no help flipping on agreements like one would flip their hand,” the party said. (Reporting by Christine Kim; Editing by Paul Tait)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T11:38:00.000+02:00", "crawled": "2018-01-30T18:56:18.017+02:00", "highlightTitle": ""}