{"organizations": [], "uuid": "609b9f76c73fd8caacd046b8290660d759368785", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-ellington-residential-mortgage-reit-announces-tax-treatment-of-2017-distributions.html", "country": "US", "domain_rank": 767, "title": "Ellington Residential Mortgage REIT Announces Tax Treatment of 2017 Distributions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.301, "site_type": "news", "published": "2018-01-31T00:20:00.000+02:00", "replies_count": 0, "uuid": "609b9f76c73fd8caacd046b8290660d759368785"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-ellington-residential-mortgage-reit-announces-tax-treatment-of-2017-distributions.html", "ord_in_thread": 0, "title": "Ellington Residential Mortgage REIT Announces Tax Treatment of 2017 Distributions", "locations": [], "entities": {"persons": [], "locations": [{"name": "greenwich", "sentiment": "none"}, {"name": "conn.", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "none"}, {"name": "real estate investment trust", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OLD GREENWICH, Conn.--(BUSINESS WIRE)-- Ellington Residential Mortgage REIT (NYSE:EARN) (the \"Company\") today announced the federal income tax treatment of the distributions on the Company's common shares paid in 2017. This information is being provided to assist shareholders with tax reporting requirements related to distributions by the Company.\nShareholders should review their Forms 1099 as well as other 2017 tax statements that they will receive from their brokerage firms or other institutions to ensure that the statements agree with the information provided below. Additionally, shareholders are encouraged to consult with their own professional tax advisors with respect to their individual tax consequences.\nAccording to the Internal Revenue Code of 1986 (\"the Code\"), if a Real Estate Investment Trust (\"REIT\") declares dividends in the last three months of a calendar year, with a record date in that calendar year, but which are payable in the first month of the following year, such dividends are considered paid for the recipient's tax and Form 1099 reporting purposes on the record date and not on the payable date, to the extent of the REIT’s remaining undistributed earnings and profits (as computed for income tax purposes) as of the last day of that calendar year. The Company declared a dividend in December 2016 (\"the 2016 fourth quarter dividend\") that was paid in January 2017. As previously announced in January 2017, $0.2528 per share of the 2016 fourth quarter dividend is considered to have been paid and taxable to shareholders in 2017. Furthermore, $0.3069 per share of the Company’s distributions reportable on 2017 1099s is deemed to be a return of shareholder capital.\nThus, during 2017, the Company paid total distributions of $1.6000 per share, of which $1.1459 will be treated as ordinary dividends for the tax year 2017. The Federal income tax classification of the 2017 distributions as they are expected to be reported on Form 1099-DIV is set forth in the following table:\nDeclaration\nDate\nRecord Date Payable Date Total\nDistribution\nPer Share\n2016\nDistribution\nPer Share\n2017\nDistribution\nPer Share\n2017\nOrdinary\nDividends\nPer Share\n2017 Return\nof Capital\nPer Share 1\n12/13/2016 12/30/2016 1/25/2017 $0.4000 $0.1472 $0.2528 $0.1994 $0.0534 3/6/2017 3/31/2017 4/25/2017 $0.4000 $0.4000 $0.3155 $0.0845 6/13/2017 6/30/2017 7/25/2017 $0.4000 $0.4000 $0.3155 $0.0845 9/12/2017 9/29/2017 10/25/2017 $0.4000 $0.4000 $0.3155 $0.0845 1 Reported as nondividend distributions on Form 1099.\nDuring 2017, the Company did not generate qualified dividend income (QDI). Further, no portion of the Company's 2017 dividend distributions is expected to consist of unrelated business taxable income (UBTI), which is subject to special tax reporting for certain tax exempt investors, or excess inclusion income.\nCautionary Statement Regarding Forward-Looking Statements\nThis press release contains forward-looking statements within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are not historical in nature and can be identified by words such as \"anticipate,\" \"estimate,\" \"will,\" \"should,\" \"may,\" \"expect,\" \"project,\" \"believe,\" \"intend,\" \"seek,\" \"plan\" and similar expressions or their negative forms, or by references to strategy, plans, or intentions. For example, our results can fluctuate from month to month and quarter to quarter depending on a variety of factors, some of which are beyond our control and/or difficult to predict, including, without limitation, changes in interest rates, changes in default rates and prepayment speeds, and other changes in market and economic conditions. Forward-looking statements involve numerous risks and uncertainties. Our actual results may differ from our beliefs, expectations, estimates, and projections and, consequently, you should not rely on these forward-looking statements as predictions of future events. Furthermore, forward-looking statements are subject to risks and uncertainties, including, among other things, those described under Item 1A to the Company's Annual Report on Form 10-K filed on March 13, 2017 which can be accessed through the link to our SEC filings under \"For Our Shareholders\" on our website ( www.earnreit.com ) or at the SEC's website ( www.sec.gov ). Other risks, uncertainties, and factors that could cause actual results to differ materially from those projected may be described from time to time in reports we file with the SEC, including reports on Forms 10-Q, 10-K and 8-K. We undertake no obligation to update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise.\nAbout Ellington Residential Mortgage REIT\nEllington Residential Mortgage REIT is a mortgage real estate investment trust that specializes in acquiring, investing in and managing residential mortgage- and real estate-related assets, with a primary focus on residential mortgage-backed securities for which the principal and interest payments are guaranteed by a U.S. Government agency or a U.S. government-sponsored enterprise. Ellington Residential Mortgage REIT is externally managed and advised by Ellington Residential Mortgage Management LLC, an affiliate of Ellington Management Group, L.L.C.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130006357/en/\nInvestor: Maria Cozine, Vice President of Investor Relations, (203) 409-3773 or info@earnreit.com ;\nor\nMedia: Amanda Klein or Kevin Fitzgerald, Gasthalter & Co., for Ellington Residential Mortgage REIT, (212) 257-4170 or Ellington@gasthalter.com .\nSource: Ellington Residential Mortgage REIT", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51751117&newsitemid=20180130006357&lan=en-US&anchor=www.sec.gov&index=2&md5=a6bda678ed85d3f1ea64f03212fa37b9", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.earnreit.com&esheet=51751117&newsitemid=20180130006357&lan=en-US&anchor=www.earnreit.com&index=1&md5=43ea26ea747c23b603cbc47fb83fc7be", "http://www.businesswire.com/news/home/20180130006357/en/"], "published": "2018-01-31T00:20:00.000+02:00", "crawled": "2018-01-31T02:49:27.040+02:00", "highlightTitle": ""}