{"organizations": [], "uuid": "af06a409d3c2a0495cdf41e0958621e2a866774b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-intec-pharma-names-r-michael-gendreau-m-d-ph-d-as-chief-medical-officer.html", "country": "US", "domain_rank": 767, "title": "Intec Pharma Names R. Michael Gendreau, M.D., Ph.D. as Chief Medical Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-31T16:00:00.000+02:00", "replies_count": 0, "uuid": "af06a409d3c2a0495cdf41e0958621e2a866774b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-intec-pharma-names-r-michael-gendreau-m-d-ph-d-as-chief-medical-officer.html", "ord_in_thread": 0, "title": "Intec Pharma Names R. Michael Gendreau, M.D., Ph.D. as Chief Medical Officer", "locations": [], "entities": {"persons": [{"name": "r. michael gendreau", "sentiment": "negative"}, {"name": "michael", "sentiment": "none"}, {"name": "jeffrey a. meckler", "sentiment": "none"}, {"name": "gendreau", "sentiment": "none"}], "locations": [{"name": "jerusalem", "sentiment": "none"}], "organizations": [{"name": "intec pharma ltd.", "sentiment": "negative"}, {"name": "ntec", "sentiment": "negative"}, {"name": "tase", "sentiment": "negative"}, {"name": "intec pharma", "sentiment": "negative"}, {"name": "fda", "sentiment": "none"}, {"name": "intec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JERUSALEM, Jan. 31, 2018 /PRNewswire/ -- Intec Pharma Ltd. (NASDAQ: NTEC) (TASE: NTEC), a clinical stage biopharmaceutical company focused on developing pharmaceutical therapies based on its proprietary Accordion Pill™ platform technology, today announced it has named R. Michael Gendreau, M.D., Ph.D. to the position of Chief Medical Officer. Dr. Gendreau, a seasoned industry veteran, brings to Intec Pharma over 30 years of experience in the drug development and pharmaceutical industry.\n\"I am delighted to have Michael join our executive team. He is an extraordinarily talented individual who has extensive clinical trial experience and has helped obtain multiple FDA approvals,\" said Jeffrey A. Meckler, Chief Executive Officer of Intec Pharma. \"His knowledge and experience will meaningfully impact and move forward our Accordion Pill clinical programs.\"\nMichael added, \"I am excited to join the Intec team. I look forward to contributing to the clinical development of the Accordion Pill technology platform and the completion of our Phase 3 AP-CD/LD program to bring this potentially game-changing therapy to Parkinson's patients around the world.\"\nDr. Gendreau joins Intec after having founded a consulting firm providing strategic advice on the design and management of clinical programs, strategic planning, and technology assessments for emerging pharmaceutical, diagnostic, and medical device companies. He has served on various scientific advisory boards, executive strategic planning boards, and Data Safety Monitoring Boards. Prior to his consulting career, Dr. Gendreau served as Chief Medical Officer at Cypress Bioscience, Inc., a clinical-stage biotech company developing therapies for central nervous system disorders. Additionally, he has served as Chief Medical Officer at other institutions including Battelle Memorial Institute. Dr. Gendreau received his B.S. in Chemistry from Ohio University, and earned his M.D./Ph.D. from The Ohio State University.\nAbout Intec Pharma Ltd.\nIntec Pharma is a clinical-stage biopharmaceutical company focused on developing drugs based on its proprietary Accordion Pill platform technology. The Company's Accordion Pill is an oral drug delivery system that is designed to improve the efficacy and safety of existing drugs and drugs in development by utilizing an efficient gastric retention and specific release mechanism. The Company's product pipeline includes two product candidates in clinical trial stages: Accordion Pill Carbidopa/Levodopa, or AP-CD/LD, which is being developed for the treatment of Parkinson's disease symptoms in advanced Parkinson's disease patients, and AP-CBD/THC, an Accordion Pill with the two primary cannabinoids contained in Cannabis sativa, cannabidiol (CBD) and tetrahydrocannabinol (THC), which is being developed for various indications including low back neuropathic pain and fibromyalgia.\nCautionary Note Regarding Forward-Looking Statements\nThis press release contains forward-looking statements about the Company's expectations, beliefs and intentions. Forward-looking statements can be identified by the use of forward-looking words such as \"believe\", \"expect\", \"intend\", \"plan\", \"may\", \"should\", \"could\", \"might\", \"seek\", \"target\", \"will\", \"project\", \"forecast\", \"continue\" or \"anticipate\" or their negatives or variations of these words or other comparable words or by the fact that these statements do not relate strictly to historical matters. These forward-looking statements are based on assumptions and assessments made in light of management's experience and perception of historical trends, current conditions, expected future developments and other factors believed to be appropriate. Forward-looking statements in this press release are made as of the date of this press release, and the company undertakes no duty to update or revise any such statements, whether as a result of new information, future events or otherwise. Forward-looking statements are not guarantees of future performance and are subject to risks and uncertainties, many of which are outside of the company's control. Important factors that could cause actual results, developments and business decisions to differ materially from forward-looking statements are described in the sections titled \"Risk Factors\" in the company's filings with the Securities and Exchange Commission, and include the following: the company's ability to develop and commercialize its product candidates and obtain additional financing necessary therefor; the length, cost and uncertain results of the company's clinical trials; including uncertainty regarding the Company's ability to enroll the required number of patients therein; the potential of adverse side effects, other safety risks, or legal prohibitions on the use of certain products in certain jurisdictions that could preclude the approval of the company's drug candidates; the availability of reimbursement from government authorities and health insurance companies for the company's products; the impact of product liability lawsuits; and the influence of extensive and costly government regulation.\nContacts:\nBob Yedid\nLife Science Advisors\n(646) 597-6989\nbob@lifesciadvisors.com\nView original content: http://www.prnewswire.com/news-releases/intec-pharma-names-r-michael-gendreau-md-phd-as-chief-medical-officer-300591042.html\nSOURCE Intec Pharma Ltd.", "external_links": ["http://www.prnewswire.com/news-releases/intec-pharma-names-r-michael-gendreau-md-phd-as-chief-medical-officer-300591042.html"], "published": "2018-01-31T16:00:00.000+02:00", "crawled": "2018-01-31T15:54:45.003+02:00", "highlightTitle": ""}