{"organizations": [], "uuid": "329f4e88278662c5cdea664aade1ce87a7a1d8b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/02/rts10ig7.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/24/academy-awards-best-picture-envelope-pricewaterhousecoopers/", "country": "US", "domain_rank": 1196, "title": "2018 Academy Awards: PwC Looks to Avoid Best Picture Mistake | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.84, "site_type": "news", "published": "2018-01-24T02:00:00.000+02:00", "replies_count": 0, "uuid": "329f4e88278662c5cdea664aade1ce87a7a1d8b1"}, "author": "Tom Huddleston Jr.", "url": "http://fortune.com/2018/01/24/academy-awards-best-picture-envelope-pricewaterhousecoopers/", "ord_in_thread": 0, "title": "2018 Academy Awards: PwC Looks to Avoid Best Picture Mistake | Fortune", "locations": [], "entities": {"persons": [{"name": "warren beatty", "sentiment": "none"}, {"name": "brian cullinan", "sentiment": "none"}, {"name": "martha ruiz", "sentiment": "none"}, {"name": "faye dunaway", "sentiment": "none"}], "locations": [{"name": "90th annua", "sentiment": "none"}], "organizations": [{"name": "la la land", "sentiment": "none"}, {"name": "pwc", "sentiment": "none"}, {"name": "academy of motion picture arts and sciences", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 \nLa La Land ! No, wait . . . Moonlight ! \nLast year’s Academy Awards ended with a shocking twist that could put even a Best Picture-winner to shame. Acting legends Faye Dunaway and Warren Beatty received the wrong envelope for their presentation of the evening’s final, and most prestigious award, which created a brief, alternate history where the musical La La Land triumphed over the poignant coming-of-age drama Moonlight , rather than the other way around. \nThe culprits? Two PricewaterhouseCoopers partners who were responsible for guarding the winners’ envelopes, and handing them to their respective presenters, had made the mistake and then failed to get the correct envelope (the one that said “ Moonlight “) to the Oscars stage in time to prevent the historic mix-up. \nThis year, though, PwC and the Academy of Motion Picture Arts and Sciences are determined to avoid a repeat of that history-making (and all around embarrassing) moment. Changing of the Guard \nFirst of all, PwC partners in question, Brian Cullinan and Martha Ruiz, will not be returning to the 90th Annual Academy Awards when the event takes place in March. (Don’t worry, they’re both still employed.) \nInstead, the Associated Press reports that PwC will not only send longtime partner Rick Rosas—who previously manned PwC’s Academy Awards post for 14 years—but, the accounting firm’s chairman and senior partner, Tim Ryan, will also be at the Oscars to oversee the process. In an interview with the AP, Ryan offered details on the steps PwC will take this year to avoid another snafu, including adding a third partner (PwC’s Kimberly Bourdon), who will be stationed with the show’s producers in a control booth. Choose Your Own Adventure \nRyan told the AP that PwC is busy “practicing the what-ifs” ahead of this year’s Academy Awards ceremony in March. “One of the most disappointing things to me was all the great work that had been done, not only last year but over the last 83 years, around accuracy, confidentiality integrity of that process,” he said. “And where we got it wrong was on the handing over of the envelope.” And the Envelope Goes To… \nOther changes for this year’s Oscars include a new backstage process for handing over winners’ envelopes to award presenters, where both the presenter and a stage manager confirm that they envelope making its way on stage correctly corresponds to the award category being presented. Dress Rehearsal \nAlso, all three PwC partners will attend Academy Award rehearsals, and they will adhere to a strict policy forbidding the use of cellphones or social media during the show. The Academy reportedly instituted the latter rule after Cullinan’s use of Twitter reportedly distracted him during last year’s event. \nGet Data Sheet , Fortune’s technology newsletter. \nLast year, the Academy announced that it would stick with PwC despite the major mistake. The firm has been working with the Academy Awards for more than eight decades. \nThe 90th Academy Awards will air on ABC at 8 p.m. ET on March 4. \nCLARIFICATION: PwC chairman and senior partner Tim Ryan will not be backstage at the Academy Awards ceremony in March, but he will attend the event to oversee the accounting firm’s process of handling the envelopes for each category’s winners. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-24T02:00:00.000+02:00", "crawled": "2018-01-25T13:16:50.014+02:00", "highlightTitle": ""}