{"organizations": [], "uuid": "d04d0e5322edf453fa8bfc4f3624397ecdd1fce0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-jack-ablin-joins-cresset-wealth-advisors-as-chief-investment-officer.html", "country": "US", "domain_rank": 767, "title": "Jack Ablin Joins Cresset Wealth Advisors as Chief Investment Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.863, "site_type": "news", "published": "2018-01-23T19:24:00.000+02:00", "replies_count": 0, "uuid": "d04d0e5322edf453fa8bfc4f3624397ecdd1fce0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-jack-ablin-joins-cresset-wealth-advisors-as-chief-investment-officer.html", "ord_in_thread": 0, "title": "Jack Ablin Joins Cresset Wealth Advisors as Chief Investment Officer", "locations": [], "entities": {"persons": [{"name": "jack ablin", "sentiment": "negative"}, {"name": "eric becker", "sentiment": "none"}, {"name": "avy stein", "sentiment": "none"}, {"name": "ablin", "sentiment": "none"}, {"name": "doug regan", "sentiment": "none"}, {"name": "jack", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cresset wealth advisors llc", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "j.p. morgan's private bank", "sentiment": "none"}, {"name": "cresset", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 23, 2018 /PRNewswire/ -- Cresset Wealth Advisors LLC , a registered investment advisory firm cofounded by longtime Chicago entrepreneurs and private investors Eric Becker and Avy Stein, today announced Jack Ablin as its Chief Investment Officer.\nAblin, who served as Executive Vice President and Chief Investment Officer at BMO Wealth Management for nearly 17 years, will oversee Cresset's investment policy and strategy and guide the firm's risk profile. Ablin is a frequent CNBC contributor and the author of Wall Street Journal-best seller \"Reading Minds and Markets: Minimizing Risk and Maximizing Returns in a Volatile Global Marketplace.\"\n\"I am thrilled Jack has joined our team, given his national profile and the wealth of experience and the expertise he brings in working with sophisticated clients,\" said Cresset Chief Executive Officer Doug Regan, formerly Midwest Region Head and Managing Director of J.P. Morgan's Private Bank. \"With his contemporary approach to investing, Jack will be an extremely valuable asset in driving growth and guiding our advisory teams and clients.\"\nCresset is a registered investment advisory firm offering sophisticated wealth planning and investment opportunities in tax-efficient traditional investments and access to direct alternatives. With its transparent, client-first investment model, Cresset is expanding its advisory team and client base.\n\"I am extremely impressed with the sophisticated operation and the caliber of the team that Eric, Avy and Doug have built, and I'm excited to be in such good company as we work to revolutionize the industry and open up new sources of investment opportunities for our clients,\" said Ablin.\nBecker and Stein through their private equity funds and individually have been involved in investing and growing over 150 businesses and raised funds over $8 billion. Their decades of successful investing gave them the unique expertise and marketplace insights to identify opportunities in wealth management and the world of private investment opportunities, leading to the launch of Cresset in 2017.\n\"What began as a personal research project for Avy and me to find the right management model for our family investments has become a mission to open up unprecedented access to new investment tools and vehicles that can be curated and tailored to meet a wide variety of client needs,\" said Becker. \"We founded Cresset because we recognized there was a better way to invest by enabling financial advisors to gain greater access to smart, efficient public and private investment solutions complemented by deep, comprehensive financial planning. With Jack joining our team, we are increasingly well positioned with a deep bench of talent that will transform how the industry enhances people's financial well-being.\"\nAbout Cresset Wealth Advisors\nCresset, a Chicago-based registered investment advisory firm, offers sophisticated wealth planning and investment opportunities in both tax-efficient traditional investments and access to direct alternatives. Visit www.cressetwealth.com .\nView original content: http://www.prnewswire.com/news-releases/jack-ablin-joins-cresset-wealth-advisors-as-chief-investment-officer-300586753.html\nSOURCE Cresset Wealth Advisors LLC", "external_links": ["http://www.prnewswire.com/news-releases/jack-ablin-joins-cresset-wealth-advisors-as-chief-investment-officer-300586753.html", "http://www.cressetwealth.com/"], "published": "2018-01-23T19:24:00.000+02:00", "crawled": "2018-01-23T20:21:08.006+02:00", "highlightTitle": ""}