{"organizations": [], "uuid": "7aae5ee349a1978e0010eb4477c9257db2c5917e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets/europe", "section_title": "European Stock Market News | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-inflation-subdued-but-euro-still-set-for-3rd-week-of-gains-idUSL4N1P03VB", "country": "US", "domain_rank": 408, "title": "FOREX-Inflation subdued, but euro still set for 3rd week of gains", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T20:58:00.000+02:00", "replies_count": 0, "uuid": "7aae5ee349a1978e0010eb4477c9257db2c5917e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-inflation-subdued-but-euro-still-set-for-3rd-week-of-gains-idUSL4N1P03VB", "ord_in_thread": 0, "title": "FOREX-Inflation subdued, but euro still set for 3rd week of gains", "locations": [], "entities": {"persons": [{"name": "saikat chatterjee", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "adp", "sentiment": "negative"}, {"name": "ecb", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar struggles despite strong ISM, ADP data\n* Graphic: World FX rates in 2017 tmsnrt.rs/2egbfVh\nBy Saikat Chatterjee\nLONDON, Jan 5 (Reuters) - The euro held near four-month highs on Friday as euro zone inflation data printed modestly, in line with forecasts.\nSentiment remained bullish, however, with some investors betting the ECB may have to start withdrawing its stimulus policies earlier than expected as the bloc’s economy strengthens.\nPrices rose 1.4 percent year on year last month, or 10 basis points slower than in the previous month due to smaller increases in food and energy prices.\nWith the dollar failing to draw any strength from this week’s manufacturing and private payrolls data and two U.S. interest rate hikes already baked into market expectations, traders believe there is more upside for the euro.\nMarkets are now focused on Friday’s U.S. non-farm payrolls report, which is expected to show job gains of 190,000 for December.\nDecember’s euro zone inflation data, meanwhile, underlined that price pressures will have to pick up meaningfully in the bloc before the European Central Bank starts to withdraw policy stimulus rapidly.\n“Any rate debate at the ECB is unlikely to be very lively even if GDP growth is healthy,” HSBC strategists wrote in an outlook note.\nOn Friday, the euro was broadly steady at $1.2060, just shy of a September 2017 high of $1.2092 and on track for a third consecutive week of gains.\nA break above that level would take the single currency to its highest since January 2015.\nSURPRISE PACKAGE? Any near-term shift in the ECB’s policy stance would be a surprise for financial markets, which expect policymakers to wind down their bond purchases later in the year.\n“Currency markets broadly know what the Fed is going to do this year but the ECB monetary policy may be the surprise package of 2018,” said Richard Falkenhall, senior FX strategist at SEB in Stockholm.\nMoney markets expect the U.S. Federal Reserve to raise interest rates two times this year compared to a Fed forecast of three times.\nIn contrast, markets don’t expect any change in interest rates in Europe until 2019, though some of those expectations may have been slightly bought forward in recent days after comments by senior ECB policymakers.\nThe ECB may end its stimulus programme this year if the euro zone economy continues to grow strongly, rate-setter Ewald Nowotny told a German newspaper.\n“Market participants might bank on the ECB following in the Fed’s footsteps earlier after all if the economic environment improves further, which would be a reason to prefer the euro over the dollar,” Commerzbank strategists said in a note.\nWeighed down by its weakness against the euro, the dollar’s index against a basket of six major currencies was poised for a loss of 0.3 percent this week.\nIt probed a three-month low of 91.751 on Tuesday and stood at 91.996, headed for its third week of losses.\nThe U.S. currency’s lack of traction was highlighted overnight as it failed to draw support from a stronger-than-expected jobs report. U.S. private employers added 250,000 jobs in December, data from ADP Research Institute showed, the biggest monthly increase since March.\nAlso weighing on the dollar was a renewed flattening of the U.S. yield curve with the spread of ten-year U.S. Treasury bonds over two-year debt falling below 50 basis points to its lowest in more than a decade.\nFor Reuters Live Markets blog on European and UK stock markets see reuters://realtime/verb=Open/url=http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets (Reporting by Saikat Chatterjee; editing by John Stonestreet)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets", "http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-05T20:58:00.000+02:00", "crawled": "2018-01-05T22:33:35.027+02:00", "highlightTitle": ""}