{"organizations": [], "uuid": "c0d8ea420c78020319ab0a4561736639a4e71f06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219149260&w=1200&r=LYNXMPEE02188", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-uber-fetch/uber-is-sued-over-payment-for-mobile-ads-it-called-fraudulent-idUSKBN1ES1ZI", "country": "US", "domain_rank": 408, "title": "Uber is sued over payment for mobile ads it called fraudulent", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T23:34:00.000+02:00", "replies_count": 0, "uuid": "c0d8ea420c78020319ab0a4561736639a4e71f06"}, "author": "", "url": "https://www.reuters.com/article/us-uber-fetch/uber-is-sued-over-payment-for-mobile-ads-it-called-fraudulent-idUSKBN1ES1ZI", "ord_in_thread": 0, "title": "Uber is sued over payment for mobile ads it called fraudulent", "locations": [], "entities": {"persons": [{"name": "yvonne gonzalez rogers", "sentiment": "none"}, {"name": "jonathan stempel", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "uber", "sentiment": "negative"}, {"name": "dentsu inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "fetch media ltd", "sentiment": "none"}, {"name": "uber technologies inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 9:35 PM / Updated 13 hours ago Uber is sued over payment for mobile ads it called fraudulent Jonathan Stempel 3 Min Read \n(Reuters) - A British mobile advertising agency has sued Uber Technologies Inc to force the ride-hailing company to pay millions of dollars of bills that Uber had refused to pay after claiming that ads being generated were fraudulent. \nFetch Media Ltd filed its lawsuit on Tuesday in the same California federal court where Uber had sued Fetch in September, accusing the agency of billing it for nonexistent, nonviewable or fraudulent ads, and failing to pass back rebates and commissions. \nUber voluntarily dismissed that lawsuit on Dec. 22, two weeks after the case was reassigned to U.S. District Judge Yvonne Gonzalez Rogers, and said it would instead pursue related claims in a San Francisco state court. \nAd fraud, sometimes called click fraud, is a persistent issue in online advertising, occurring when automated programs mimic legitimate users by clicking ads. \nFetch, a London-based unit of Japan’s Dentsu Inc, suggested that Uber dismissed its federal case on concern it might lose after it was assigned to Rogers, who has overseen other litigation involving the San Francisco-based company. \nIn Tuesday’s lawsuit, Fetch asked that Rogers be assigned to determine both companies’ contractual responsibilities, and direct Uber pay more than $19.7 million of invoices still owed for 2017. \n“Fetch does not believe that Uber can avoid federal-court scrutiny of its incorrect contract theories so easily,” the company said. \nUber did not immediately respond on Wednesday to requests for comment. \nThe Association of National Advertisers, a trade group, last May estimated that marketers would lose $6.5 billion in 2017 because of fake web traffic caused by “bots.” \nUber said in September that it had hired Fetch to place ads to encourage new riders to download the Uber app, and would pay for “legitimate clicks” that helped attract riders. \nBut it said Fetch wrongly claimed credit for app downloads that occurred without ads ever being clicked. Uber said it paid Fetch more than $82.5 million, but that Fetch’s failure to stop ad fraud contributed to at least $50 million of damages. \nAccording to Uber, the alleged fraud surfaced in early 2017 as customers began complaining about where its ads appeared. \nUber said, in one example, it had asked Fetch not to place ads on Breitbart.com, the conservative news website run by Steve Bannon, a former strategist for U.S. President Donald Trump, but that ads appeared there anyway. \nIn court papers, Fetch called Uber a “faithless business partner,” and said it had helped Uber monitor ad fraud despite not being contractually required. Fetch also said its work helped Uber register more than 35 million riders. \nThe case is Fetch Media Ltd v. Uber Technologies Inc, U.S. District Court, Northern District of California, No. 18-00015. Reporting by Jonathan Stempel in New York; Editing by David Gregorio", "external_links": [], "published": "2018-01-03T23:34:00.000+02:00", "crawled": "2018-01-04T00:11:40.024+02:00", "highlightTitle": ""}