{"organizations": [], "uuid": "7edd6906a88e9af0d612ecf85ce96214920c19ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 32}, "facebook": {"likes": 152, "shares": 152, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/02/104745827-robot.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/19832390/device/rss/rss.html", "section_title": "Asia-Pacific News", "url": "https://www.cnbc.com/2018/01/08/salaries-jobs-and-automation-christopher-pissarides-on-wages.html", "country": "US", "domain_rank": 767, "title": "Salaries, jobs and automation: Christopher Pissarides on wages", "performance_score": 1, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T06:55:00.000+02:00", "replies_count": 0, "uuid": "7edd6906a88e9af0d612ecf85ce96214920c19ed"}, "author": "Yen Nee Lee", "url": "https://www.cnbc.com/2018/01/08/salaries-jobs-and-automation-christopher-pissarides-on-wages.html", "ord_in_thread": 0, "title": "Salaries, jobs and automation: Christopher Pissarides on wages", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "11 Hours Ago | 04:38 \nThe subdued growth in wages amid an expanding economy and declining unemployment has puzzled many, but one economics professor said he may have an explanation for that phenomenon. \nThe answer lies in automation, according to Christopher Pissarides from the London School of Economics. He explained that technology has helped certain segments of the workforce do their jobs better and subsequently increase their incomes. \nBut technology hasn't made the same impact on workers at the lower-end, whose salaries have not grown much. That widening income gap is partly why wage growth, on a national level, has been subdued, he told CNBC on Tuesday. \n\"You see successful entrepreneurs becoming wealthy, for example, whereas at the lower end, computerization and robotics don't do anything for workers at the lower end, like the janitors, the cleaners,\" Pissarides, a 2010 Nobel laureate in economic sciences, said at the UBS Greater China Conference in Shanghai. \n\"So, it's very difficult to see wages rising by their own internal forces at the lower end,\" he added. \nMajor central banks such as the Federal Reserve and Bank of Japan are aiming for a 2 percent inflation target, which appeared elusive as wage growth has not caught up with a stronger economy and an improving jobs market. \nPissarides said he has always thought central bankers should re-think their inflation goal and set targets that tailor to the circumstances in their respective countries. There's little that central bankers can do, however, in curbing wage inequality, he said. \nGovernments, though, should support efforts to retrain and upgrade the skills of workers at the lower end, Pissarides said. That's because new technologies such as artificial intelligence would inevitably replace some jobs, and displaced workers must be able to fill new occupations that are created thereafter, he added.", "external_links": [], "published": "2018-01-09T06:55:00.000+02:00", "crawled": "2018-01-09T10:20:54.001+02:00", "highlightTitle": ""}