{"organizations": [], "uuid": "83382520e0eefc3810f4beb3aebd277198252119", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-safrica-politics-mckinsey/south-africa-wants-mckinsey-and-firm-linked-to-zumas-friends-to-repay-130-million-idUSKBN1F522U", "country": "US", "domain_rank": 408, "title": "UPDATE 2-South Africa wants McKinsey and firm linked to Zuma's friends to repay $130 mln", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T18:23:00.000+02:00", "replies_count": 0, "uuid": "83382520e0eefc3810f4beb3aebd277198252119"}, "author": "", "url": "https://www.reuters.com/article/us-safrica-politics-mckinsey/south-africa-wants-mckinsey-and-firm-linked-to-zumas-friends-to-repay-130-million-idUSKBN1F522U", "ord_in_thread": 0, "title": "UPDATE 2-South Africa wants McKinsey and firm linked to Zuma's friends to repay $130 mln", "locations": [], "entities": {"persons": [{"name": "zuma", "sentiment": "negative"}, {"name": "atul", "sentiment": "none"}, {"name": "jacob zuma", "sentiment": "none"}, {"name": "ajay", "sentiment": "none"}, {"name": "rajesh gupta", "sentiment": "none"}], "locations": [{"name": "africa", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "mckinsey", "sentiment": "negative"}, {"name": "eskom", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  johannesburg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JOHANNESBURG (Reuters) - South African authorities want global consultancy McKinsey and a local firm controlled by business friends of President Jacob Zuma to repay 1.6 billion rand ($130 million) they earned from a contract to advise state utility Eskom.\nTuesday’s announcement deepens the financial and reputational harm done to McKinsey in the country over the case, and the opposition said it was a fresh example of Zuma’s role in state corruption.\nOfficials are investigating whether McKinsey knowingly let funds from the utility be diverted to Trillian management consultancy as a way of securing the deal to advise Eskom in 2016. The firm was at the time controlled by Ajay, Atul and Rajesh Gupta, three brothers close to Zuma.\nThe move to recover money from McKinsey and Trillian comes after a court last month granted prosecutors the authority to freeze 1.6 billion rand of assets over the Eskom turnaround program.\nIt is one of the first instances in which the government has acted publicly against the brothers, who an anti-corruption watchdog has accused of using their friendship with Zuma to siphon off public funds.\nAs such, it reflects Zuma’s weakened position since he was replaced last month by Deputy President Cyril Ramaphosa as head of the ruling African National Congress. Ramaphosa won the closely fought party vote on a pledge to root out corruption in government.\n“The 1.6 billion, we are asking that they pay that back. That precisely relates to the Eskom contract,” Knorx Molelle, a senior prosecutor from the National Prosecuting Authority’s Asset Forfeiture Unit (NPA) told eNCA television.\nMolelle said the Authority was not about to seek arrests or court summonses prior to the end of an investigation. The NPA did not respond to a request for comment.\nMmusi Maimane, leader of South Africa’s largest opposition party, the Democratic Alliance, said the Guptas and Zuma should be prosecuted for their role in state corruption.\n“It is no secret that President Zuma is deeply compromised and implicated in this matter through his well-known relationship with the Guptas,” Maimane said in a statement.\nA spokesman for McKinsey said on Monday the firm would cooperate with authorities in their investigations and that it was ready to return the roughly 1 billion rand it had earned for advising Eskom.\nMcKinsey launched an internal investigation into its handling of the partnership with Trillian and says it ceased work with the firm in March 2016 after due diligence showed links to the Guptas.\nIts comments contradict the account given to Reuters in November by four sources familiar with the Eskom deal. They said McKinsey continued working with Trillian for four months after learning of its links to the Guptas.\nMcKinsey has lost several prominent clients including South Africa’s Standard Bank since the scandal broke.\nTrillian, the junior consultant on the Eskom contract, did not respond to a request for comment. When contacted in November, Trillian denied wrongdoing relating to the Eskom contract.\nZuma this month said he would set up a commission of enquiry into allegations of influence-peddling by the Gupta brothers.\nBoth Zuma and the Guptas deny wrongdoing. Zuma’s spokesman did not reply to a Reuters request for comment.\nEditing by Matthew Mpoke Bigg\n ", "external_links": [], "published": "2018-01-16T18:23:00.000+02:00", "crawled": "2018-01-16T18:44:03.029+02:00", "highlightTitle": ""}