{"organizations": [], "uuid": "7f6c426e677c7a29f250329d6707aae590b46a66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/18/104904619-GettyImages-893678538.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100727362/device/rss/rss.html", "section_title": "World News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/10/south-africa-president-zuma-survives-anc-meeting.html", "country": "US", "domain_rank": 767, "title": "South Africa President Zuma survives ANC meeting", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T17:46:00.000+02:00", "replies_count": 0, "uuid": "7f6c426e677c7a29f250329d6707aae590b46a66"}, "author": "Justina Crabtree", "url": "https://www.cnbc.com/2018/01/10/south-africa-president-zuma-survives-anc-meeting.html", "ord_in_thread": 0, "title": "South Africa President Zuma survives ANC meeting", "locations": [], "entities": {"persons": [{"name": "zuma", "sentiment": "negative"}, {"name": "jacob zuma", "sentiment": "negative"}, {"name": "ramaphosa", "sentiment": "none"}, {"name": "cyril ramaphosa", "sentiment": "none"}, {"name": "ace magashule", "sentiment": "none"}, {"name": "james lockhart smith", "sentiment": "none"}], "locations": [{"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "anc", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "cyril ramaphosa", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "african national congress", "sentiment": "none"}, {"name": "national executive committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Embattled South African President Jacob Zuma's position was not considered as senior members of his ruling African National Congress (ANC) party met for the first time since Cyril Ramaphosa won its leadership in December.\nSpeculation had been mounting that Zuma would be ousted at the National Executive Committee meeting on Wednesday, but \"the matter was not for any discussion or debate,\" ANC Secretary-General Ace Magashule told reporters, according to Reuters.\nZuma's lingering presence, despite his unpopularity with both markets and voters, has prompted analysts to cast doubt on the South African rand 's rebound, which is based on optimism surrounding Ramaphosa's potential as a reformer.\n\"The positive market reaction to Ramaphosa's win — which still leaves the rand way below where it was a few years ago — has gone as far as it is likely to,\" James Lockhart Smith, head of financial sector risk at consultancy Verisk Maplecroft, told CNBC via e-mail.\nshow chapters South Africa's ANC elects Cyril Ramaphosa to be next leader 4:27 AM ET Tue, 19 Dec 2017 | 03:02 \"South Africa is poorly positioned relatively to many other EMs (emerging markets) vis-a-vis the gradually tightening external environment, which will inevitably exert downward pressure as well,\" he added.\nThe rand has appreciated against the U.S. dollar since Ramaphosa's election to the ANC top spot. Ramaphosa, also South Africa's vice president, beat Zuma's ex-wife Nkosazana Dlamini-Zuma at a leadership vote at the party's National Conference in December.\nRamaphosa is viewed positively by markets for his pledge to fight corruption in South Africa.\nReflective of the currency's political sensitivity, the rand rallied 1 percent Tuesday following unconfirmed reports that Zuma had been ousted.\nSouth Africa's business confidence index rose for the second month in a row in December, it was announced Wednesday.\nshow chapters S&P: Weak GDP growth has further deteriorated South Africa’s finances 2:48 AM ET Mon, 27 Nov 2017 | 02:46 This was due to a \"more positive business mood and political developments that are expected to put South Africa in a position for more encouraging business and economic policy options,\" the South African Chamber of Commerce and Industry said in a statement.\nHowever, Piotr Matys, emerging market strategist at Rabobank, told CNBC: \"The market could be too optimistic about Ramaphosa's ability to implement much required structural reforms, which could be stalled by ANC officials who are still loyal to Zuma.\"\n\"Jacob Zuma's removal as president is an increasingly urgent priority for the new ANC leader Cyril Ramaphosa,\" Ben Payton, head of Africa at Verisk Maplecroft, wrote in a note Tuesday.\nBut Ramaphosa faces a tricky tightrope walk, appeasing both voters keen for corruption allegations against Zuma to be acted upon, as well as Zuma's own supporters within the ANC.\nPayton added: \"The details of the power transfer, however, are likely to prevent Ramaphosa from implementing much of his own agenda, at least until after 2019.\"", "external_links": [], "published": "2018-01-10T17:46:00.000+02:00", "crawled": "2018-01-10T18:03:15.015+02:00", "highlightTitle": ""}