{"organizations": [], "uuid": "67139e207faf3a9292e90e83cefa2c55f297bdb8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180116.html", "section_title": "Archive News &amp; Video for Tuesday, 16 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/world-news-schedule-at-0600-gmt-1-am-et/world-news-schedule-at-0600-gmt-1-am-et-idUSL3N1PB20V", "country": "US", "domain_rank": 408, "title": "WORLD-NEWS-SCHEDULE AT 0600 GMT/1 AM ET", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:03:00.000+02:00", "replies_count": 0, "uuid": "67139e207faf3a9292e90e83cefa2c55f297bdb8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/world-news-schedule-at-0600-gmt-1-am-et/world-news-schedule-at-0600-gmt-1-am-et-idUSL3N1PB20V", "ord_in_thread": 0, "title": "WORLD-NEWS-SCHEDULE AT 0600 GMT/1 AM ET", "locations": [], "entities": {"persons": [{"name": "clarence fernandez", "sentiment": "negative"}, {"name": "david brunnstrom", "sentiment": "none"}, {"name": "dick durbin", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "david ljunggren", "sentiment": "none"}, {"name": "josh smith", "sentiment": "none"}, {"name": "durbin", "sentiment": "none"}, {"name": "heekyong yang", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "haiti", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "koreas", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Editor: Clarence Fernandez + 65 6870 3861\nPicture Desk: Singapore + 65 6870 3775\nGraphics queries: + 65 6870 3595\n(All times GMT/ET)\nTOP STORIES Vancouver meeting focuses on sanctions as Koreas explore detente\nVANCOUVER - A meeting of nations that backed South Korea in the Korean war will look at how to better implement sanctions to push North Korea to abandon its nuclear weapons, officials say, even as the neighbours explore detente ahead of next month’s Winter Olympics. (NORTHKOREA-MISSILES/DIPLOMACY (UPDATE 3, PIX), moved, by David Ljunggren and David Brunnstrom, 812 words)\n+ See also:\n- OLYMPICS-2018/NORTHKOREA-ICEHOCKEY (PIX, TV), by Heekyong Yang and Josh Smith, 959 words\n- NORTHKOREA-MISSILES/CHINA-US (UPDATE 1), moving shortly, 353 words\nTrump blames U.S. Senator Durbin for blowing immigration deal\nWASHINGTON - U.S. President Donald Trump blames Senator Dick Durbin for blowing up talks on a deal to help immigrants brought to the country illegally as children and says the Democratic lawmaker misrepresented his comments about Haiti and African countries. (USA-IMMIGRATION/TRUMP (UPDATE 2), moved, by Jeff Mason, 410 words)\n+ See also:\n- BASKETBALL-NBA/JAMES (PIX), moved, by Rory Carroll, 350 words\n- USA-IMMIGRATION/TRUMP-NIGERIA (UPDATE 1), moved, 230 words\nErdogan: we will “strangle” U.S.-backed force in Syria “before it’s even born”\nBEIRUT/ISTANBUL - Turkey’s Tayyip Erdogan threatens to “strangle” a planned 30,000-strong U.S.-backed force in Syria “before it’s even born”, as Washington’s backing for Kurdish fighters drives a wedge into relations with one of its main Middle East allies. (MIDEAST-CRISIS/SYRIA (UPDATE 2), moved, by Ellen Francis and Ezgi Erkoyun, 810 words)\n+ See also:\n- MIDEAST-CRISIS/SYRIA-KURDS (INTERVIEW, PIX), moved, by Rodi Said, 710 words\nGerman parties rush to win activists to governing deal\nBERLIN - Political heavyweights from Germany’s conservatives and Social Democrats seek to shore up support for talks on joining forces in a coalition, after members of the centre-left party in one region vote against a deal. (GERMANY-POLITICS/ (UPDATE 4, PIX, TV), moved, by Thomas Escritt and Joseph Nasr, 730 words)\nASIA Prodded by China, Qantas amends website references to Taiwan, other regions\nSYDNEY/TAIPEI - Australia’s Qantas says it has amended its website to no longer refer to Taiwan and Hong Kong as countries, rather than Chinese territories, after China issued a warning to foreign airlines. (QANTAS-CHINA/ (UPDATE 1, PIX), moved, 414 words)\nIndonesia bourse observes a minute’s silence for injured after floor collapse\nJAKARTA - Indonesia’s stock exchange observes a minute’s silence at the start of trade for more than 70 people injured when a mezzanine floor in the building suddenly collapsed. (INDONESIA-STOCK EXCHANGE/ (TV, PIX), moved, by Tabita Diela, 373 words)\nVeteran U.S. diplomat Richardson to work for Reuters reporters release\nFormer New Mexico governor Bill Richardson says he will work towards securing the release of two Reuters journalists arrested in Myanmar, in his capacity as a member of an international advisory board on the crisis in Rakhine state. (MYANMAR-JOURNALISTS/, moved, 415 words)\nUNITED STATES Thirteen siblings found chained in California home; parents charged\nPERRY - A California couple is charged with torture after police rescued their 13 malnourished children from a home where some of them had been chained to beds, and neighbors describe the family as shut-ins who shunned social contact. (CALIFORNIA-HOSTAGES/ (UPDATE 4, PIX, TV), moved, by Mike Blake, 420 words)\nThree still missing in California’s deadly mudslides\nThe number of people missing from last week’s deadly Southern California mudslides falls to three as hundreds of rescue workers search for survivors from the rain-driven slides that killed 20 people. (CALIFORNIA-MUDSLIDES/ (UPDATE 1, PIX, TV), moved, 340 words)\nAMERICAS Pope arrives in Chile to bolster battered Church credibility\nSANTIAGO - Pope Francis arrives in Chile to start a trip aimed at bolstering the credibility of a local church battered by a sexual abuse crisis. (POPE-CHILE/ (UPDATE 1, PIX, TV), moved, by Dave Sherwood and Philip Pullella, 560 words)\n+ See also:\n- POPE-CHILE/NUCLEAR (PIX, TV), by Philip Pullella, 250 words\nVenezuela says five ‘terrorists’ arrested, others killed after shootout\nCARACAS - Venezuelan authorities arrest five members of a “terrorist cell” linked to self-proclaimed rogue Venezuelan helicopter pilot Oscar Perez, and kill several other militants during a shootout in a poor area outside Caracas. (VENEZUELA-POLITICS/PEREZ (UPDATE 2), moved, by Alexandra Ulmer and Andreina Aponte, 565 words)\nMIDDLE EAST & NORTH AFRICA At least 20 dead as clashes shut airport in Libyan capital\nTRIPOLI/TUNIS - Fierce clashes break out in the Libyan capital Tripoli, killing at least 20 people, shutting the airport, and damaging planes during what the government says is a failed attempt to spring militants from a nearby prison. (LIBYA-SECURITY/ (UPDATE 5, PIX, TV), moved, by Ahmed Elumami and Aidan Lewis, 590 words)\nEUROPE Madrid to maintain direct rule if self-exiled Catalan separatist re-elected - PM\nMADRID - Spain rejects as absurd suggestions that Catalan separatist Carles Puigdemont could lead the region from exile if elected president by the new Catalan parliament, and says if he is chosen Madrid would maintain direct central rule. (SPAIN-POLITICS/CATALONIA (UPDATE 2, PIX, TV), moved, 360 words)\nRomania’s PM resigns after losing party’s backing\nBUCHAREST - Romania’s Prime Minister Mihai Tudose resigns after his Social Democrat Party withdraws backing in an overwhelming vote, becoming the second premier ousted in seven months. (ROMANIA-GOVERNMENT/PM (UPDATE 2, PIX, TV), moved, by Radu-Sorin Marinas, 330 words)\nAFRICA South African court authorizes freezing of $130 mln in McKinsey case - source\nJOHANNESBURG - A South African court has authorized the freezing of 1.6 billion rand ($130 million) in assets earned by global consultancy McKinsey and a firm linked to friends of President Jacob Zuma, a source at the state prosecutors’ office tells Reuters. (SAFRICA-POLITICS/MCKINSEY, moved, by Alexander Winning, 460 words)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T14:03:00.000+02:00", "crawled": "2018-01-17T20:10:04.000+02:00", "highlightTitle": ""}