{"organizations": [], "uuid": "b710a74aba86e8290db2bc838c7b0b626a4996bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226543420&w=1200&r=LYNXMPEE0T0EA", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-syria-crisis-chemicalweapons-exclusiv/exclusive-tests-link-syrian-government-stockpile-to-largest-sarin-attack-sources-idUKKBN1FJ0NS", "country": "US", "domain_rank": 408, "title": "Exclusive: Tests link Syrian government stockpile to largest sarin attack - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T11:00:00.000+02:00", "replies_count": 0, "uuid": "b710a74aba86e8290db2bc838c7b0b626a4996bc"}, "author": "", "url": "https://uk.reuters.com/article/uk-syria-crisis-chemicalweapons-exclusiv/exclusive-tests-link-syrian-government-stockpile-to-largest-sarin-attack-sources-idUKKBN1FJ0NS", "ord_in_thread": 0, "title": "Exclusive: Tests link Syrian government stockpile to largest sarin attack - sources", "locations": [], "entities": {"persons": [{"name": "khan sheikhoun", "sentiment": "none"}, {"name": "khan al-assal", "sentiment": "none"}, {"name": "anthony deutsch", "sentiment": "none"}, {"name": "khan al-as", "sentiment": "none"}, {"name": "bashar al-assad", "sentiment": "none"}], "locations": [{"name": "ghouta", "sentiment": "none"}, {"name": "khan sheikhoun", "sentiment": "none"}, {"name": "damascus", "sentiment": "none"}, {"name": "idlib", "sentiment": "none"}, {"name": "aleppo", "sentiment": "none"}], "organizations": [{"name": "organisation for the prohibition of chemical weapons", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 6:49 AM / Updated 4 hours ago Exclusive: Tests link Syrian government stockpile to largest sarin attack - sources Anthony Deutsch 8 Min Read \nTHE HAGUE (Reuters) - The Syrian government’s chemical weapons stockpile has been linked for the first time by laboratory tests to the largest sarin nerve agent attack of the civil war, diplomats and scientists told Reuters, supporting Western claims that government forces under President Bashar al-Assad were behind the atrocity. \nLaboratories working for the Organisation for the Prohibition of Chemical Weapons compared samples taken by a U.N. mission in the Damascus suburb of Ghouta after the Aug. 21, 2013 attack, when hundreds of civilians died of sarin gas poisoning, to chemicals handed over by Damascus for destruction in 2014. \nThe tests found “markers” in samples taken at Ghouta and at the sites of two other nerve agent attacks, in the towns of Khan Sheikhoun in Idlib governorate on April 4, 2017 and Khan al-Assal, Aleppo, in March 2013, two people involved in the process said. \n“We compared Khan Sheikhoun, Khan al-Assal, Ghouta,” said one source who asked not to be named because of the sensitivity of the findings. “There were signatures in all three of them that matched.” \nThe same test results were the basis for a report by the OPCW-United Nations Joint Investigative Mechanism in October which said the Syrian government was responsible for the Khan Sheikhoun attack, which killed dozens. \nThe findings on Ghouta, whose details were confirmed to Reuters by two separate diplomatic sources, were not released in the October report to the U.N. Security Council because they were not part of the team’s mandate. \nThey will nonetheless bolster claims by the United States, Britain and other Western powers that Assad’s government still possesses and uses banned munitions in violation of several Security Council resolutions and the Chemical Weapons Convention. \nThe OPCW declined to comment. Syria has repeatedly denied using chemical weapons in the conflict now in its seventh year and has blamed the chemical attacks in the rebel-held territory of Ghouta on the insurgents themselves. \nRussia has also denied that Syrian government forces have carried out chemical attacks and has questioned the reliability of the OCPW inquiries. Officials in Moscow have said the rebels staged the attacks to discredit the Assad government and whip up international condemnation. \nUnder a U.S.-Russian deal after the Ghouta attack in 2013, Damascus joined the OPCW and agreed to permanently eliminate its chemical weapons programme, including destroying a 1,300-tonne stockpile of industrial precursors that has now been linked to the Ghouta attack. \nBut inspectors have found proof of an ongoing chemical weapons program in Syria, including the systematic use of chlorine barrel bombs and sarin, which they say was ordered at the highest levels of government. \nThe sarin attack on Khan Sheikhoun in April last year prompted U.S. President Donald Trump to order a missile strike against the Shayrat air base, from which the Syrian operation is said to have been launched. \nDiplomatic and scientific sources said efforts by Syria and Russia to discredit the U.N.-OPCW tests establishing a connection to Ghouta have so far come up with nothing. \nRussia’s blocking of resolutions at the Security Council seeking accountability for war crimes in Syria gained new relevance when Russia stationed its aircraft at Shayrat in 2015. \nWashington fired missiles at Shayrat in April 2017, saying the Syrian air force used it to stage the Khan Sheikhoun sarin attack on April 4 a few days earlier, killing more than 80 people. \nNo Russian military assets are believed to have been hit, but Moscow warned at the time it could have serious consequences. \nIn June, the Pentagon said it had seen what appeared to be preparations for another chemical attack at the same airfield, prompting Russia to say it would respond proportionately if Washington took pre-emptive measures against Syrian forces there. \n“SERIOUS LAB WORK” \nThe chemical tests were carried out at the request of the U.N.-OPCW inquiry, which was searching for potential links between the stockpile and samples from Khan Sheikhoun. The analysis results raised the possibility that they would provide a link to other sarin attacks, the source said. \nTwo compounds in the Ghouta sample matched those also found in Khan Sheikhoun, one formed from sarin and the stabiliser hexamine and another specific fluorophosphate that appears during sarin production, the tests showed. \n“Like in all science, it should be repeated a couple of times, but it was serious matching and serious laboratory work,” the source said. \nIndependent experts, however, said the findings are the strongest scientific evidence to date that the Syrian government was behind Ghouta, the deadliest chemical weapons attack since the Halabja massacres of 1988 during the Iran-Iraq war. \n“A match of samples from the 2013 Ghouta attacks to tests of chemicals in the Syrian stockpile is the equivalent of DNA evidence: definitive proof,” said Amy Smithson, a U.S. nonproliferation expert. \nThe hexamine finding “is a particularly significant match,” Smithson said, because it is a chemical identified as a unique hallmark of the Syrian military’s process to make sarin. \n“This match adds to the mountain of physical evidence that points conclusively, without a shadow of doubt, to the Syrian government,” she said. NO CHANCE REBELS BEHIND GHOUTA \nSmithson and other sources familiar with the matter said it would have been virtually impossible for the rebels to carry out a coordinated, large-scale strike with poisonous munitions, even if they had been able to steal the chemicals from the government’s stockpile. \n“I don’t think there is a cat in hell’s chance that rebels or Islamic State were responsible for the Aug. 21 Ghouta attack,” said Hamish de Bretton-Gordon, an independent specialist in biological and chemical weapons. \nThe U.N.-OPCW inquiry, which was disbanded in November after being blocked by Syria’s ally Russia at the U.N. Security Council, also found that Islamic State had used the less toxic blistering agent sulphur mustard gas on a small scale in Syria. \nThe Ghouta attack, by comparison, was textbook chemical warfare, Smithson and de Bretton-Gordon said, perfectly executed by forces trained to handle sarin, a toxin which is more difficult to use because it must be mixed just before delivery. \nSurface-to-surface rockets delivered hundreds of litres of sarin in perfect weather conditions that made them as lethal as possible: low temperatures and wind in the early hours of the morning, when the gas would remain concentrated and kill sleeping victims, many of them children. \nPre-attack air raids with conventional bombs shattered windows and doors and drove people into shelters where the heavy poison seeped down into underground hiding places. Aerial bombing afterwards sought to destroy the evidence. \nThe large quantity of chemicals used, along with radar images of rocket traces showing they originated from Syrian Brigade positions, are further proof that the rebels could not have carried out the Ghouta attack, the experts said. Reporting by Anthony Deutsch; editing by Giles Elgood", "external_links": [], "published": "2018-01-30T11:00:00.000+02:00", "crawled": "2018-01-30T11:37:19.051+02:00", "highlightTitle": ""}