{"organizations": [], "uuid": "a63afd8620a43bb5cce39431efd88d379dd6d3e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220605621&w=1200&r=LYNXMPEE081A2", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-egypt-politics/egypts-president-sisi-wins-huge-parliamentary-support-for-a-second-term-idUKKBN1EY28T", "country": "US", "domain_rank": 408, "title": "Egypt's President Sisi wins huge parliamentary support for a second term", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T20:24:00.000+02:00", "replies_count": 0, "uuid": "a63afd8620a43bb5cce39431efd88d379dd6d3e1"}, "author": "", "url": "https://uk.reuters.com/article/uk-egypt-politics/egypts-president-sisi-wins-huge-parliamentary-support-for-a-second-term-idUKKBN1EY28T", "ord_in_thread": 0, "title": "Egypt's President Sisi wins huge parliamentary support for a second term", "locations": [], "entities": {"persons": [{"name": "sisi", "sentiment": "negative"}, {"name": "hosni mubarak", "sentiment": "none"}, {"name": "abdel fattah al-sisi", "sentiment": "none"}, {"name": "mohamed mursi", "sentiment": "none"}, {"name": "abdel fattah al-sisi", "sentiment": "none"}], "locations": [{"name": "egypt", "sentiment": "none"}, {"name": "cairo", "sentiment": "none"}, {"name": "cairo", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "muslim brotherhood", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 6:26 PM / Updated 14 minutes ago Egypt's President Sisi wins huge parliamentary support for a second term Reuters Staff 3 Min Read \nCAIRO (Reuters) - Egypt’s President Abdel Fattah Al-Sisi has won the backing of over three-quarters of parliamentarians for a second term as president, lawmakers said on Tuesday, a day after a timeline for the election was announced. Egyptian President Abdel Fattah al-Sisi (R) greets faithful at the new Coptic Cathedral \"The Nativity of Christ\" in the new administrative capital, 45km east of Cairo, Egypt, January 6, 2018 in this handout picture courtesy of the Egyptian Presidency. The Egyptian Presidency/Handout via REUTERS \nSisi has yet to announce his candidacy for the ballot, scheduled for March 26-28. But he is widely expected to run and win the election. \nThe former general won a landslide victory in an election in 2014, one year after - as a military commander - he led the overthrow of elected president Mohamed Mursi of the Muslim Brotherhood. \nThe election will be Egypt’s third since the 2011 uprising that ended strongman Hosni Mubarak’s long rule. \nElection regulations stipulate that would-be candidates must obtain the backing of at least 20 members of parliament for their candidacy or must be supported by at least 25,000 eligible voters in at least 15 governorates. \nSo far, 464 of the 596 members of parliament have come forward to support Sisi, deputy secretary general of parliament Mohamed Nosair said. Lawmakers are not permitted to support more than one candidate. \nThe national election commission has said that candidates must register from Jan. 20 to 29 and that a final list of candidates will be announced on Feb. 20.] \nSisi’s critics say his popularity has been dimmed by austerity reforms, security problems and a crackdown on dissidents. But few contenders have come forward in a contest that most observers expect Sisi to win easily. \nFormer prime minister Ahmed Shafik, who was seen as the most serious potential challenger to Sisi’s rule, said on Sunday he was no longer considering running. \nAnother presidential hopeful, rights lawyer Khaled Ali, faces a potential three-month prison sentence for public indecency over an alleged rude hand gesture he made outside a courthouse last year. He may be disqualified from standing if he loses his appeal on March 7. \nHaitham al-Hariri, leader of a leftist bloc in parliament, told Reuters that his 16-member group of lawmakers has not signed on to Sisi’s nomination and remains open to backing other candidates. \n“The bloc has disagreements with policies but not with people... with the current policies being followed whether economic, social or security-related policies,” said Hariri. \n“The bloc doesn’t believe that the continuation of these policies is best for Egypt,” he said. Reporting by Nashaat Hamdy and Mahmoud Mourad; Writing by Eric Knecht; Editing by Hugh Lawson", "external_links": [], "published": "2018-01-09T20:24:00.000+02:00", "crawled": "2018-01-09T20:43:22.008+02:00", "highlightTitle": ""}