{"organizations": [], "uuid": "efe3dfc1f027cdfad0d7b8069623e4f708c70037", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221124864&w=1200&r=LYNXMPEE0A0VY", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-ecb-policy/ecb-to-revisit-policy-message-in-early-2018-minutes-idUKKBN1F01JR", "country": "US", "domain_rank": 408, "title": "ECB to revisit policy message in early 2018: minutes", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T14:38:00.000+02:00", "replies_count": 0, "uuid": "efe3dfc1f027cdfad0d7b8069623e4f708c70037"}, "author": "", "url": "https://uk.reuters.com/article/uk-ecb-policy/ecb-to-revisit-policy-message-in-early-2018-minutes-idUKKBN1F01JR", "ord_in_thread": 0, "title": "ECB to revisit policy message in early 2018: minutes", "locations": [], "entities": {"persons": [], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 12:39 PM / Updated an hour ago ECB may start tweaking policy message in early 2018: minutes Balazs Koranyi 4 Min Read \nFRANKFURT (Reuters) - The European Central Bank should revisit its communication stance in early 2018, accounts of its December meeting showed, suggesting that policymakers could soon start preparing markets for the end of the bank’s massive stimulus scheme. FILE PHOTO: European Union flags flutter outside the European Central Bank (ECB) headquarters in Frankfurt, Germany December 14, 2017. REUTERS/Ralph Orlowski/File Photo \nWith the euro zone seeing its best growth in a decade, the ECB should gradually shift its stance to avoid a more disruptive move later and should look at a broader revision of its policy guidance to reduce the focus on bond purchases and raise the emphasis on interest rates, the accounts showed. \nThe euro surged more than half of a percent against the dollar on the comments, with investors taking the relatively hawkish statement as a further signal that the ECB will wind down its 2.55 trillion euro bond purchase scheme this year if growth continues to roar ahead. \n“The language pertaining to various dimensions of the monetary policy stance and forward guidance could be revisited early in the coming year,” the accounts showed, referring to 2018. “The view was widely shared that... communication would need to evolve gradually, without a change in sequencing.” \nSidelining his critics, ECB President Mario Draghi stuck to his pledge last month to keep money pouring into the euro zone economy for as long as needed, despite improved growth and inflation prospects. STRONG GROWTH \nBut growth is into its fifth year, employment is at a record high and convergence between the 19-member currency bloc’s core and periphery has restarted, all pointing to unabated growth and a declining need for central bank help. \nIndeed, while policymakers suggested a gradual and careful shift, they argued for a guidance comprising the broader policy stance, a move that would signal the declining importance of bond buys and seen by some as a precursor to ending asset buys. \n“As progress was made toward a sustained adjustment in the path of inflation, the relative importance of the forward guidance on policy rates would increase,” policymakers said. \nWith euro zone output eliminating spare capacity this year, policymakers argued that no further easing in financial conditions was needed, and some even warned about the ECB falling behind the curve. \n“It was important for the forward guidance to be updated in line with evolving data with a view to avoiding more abrupt or disorderly adjustments at a later stage,” the ECB said. \nSome policymakers are already openly discussing life after the quantitative easing scheme ends, suggesting growing support for a decision to wind down the programme later this year. \nThe accounts suggested the first change might be dropping a pledge to buy bonds until inflation heads back to target. \nLaunched three years ago, the asset purchases depressed borrowing costs, staving off the threat of deflation and putting growth on its best run since before the bloc’s debt crisis. \nBut critics say that the scheme has run its course and in a period of above trend growth, artificially low borrowing costs risk more damage than good by inflating asset price bubbles. \nRunning at 30 billion euros per month at least until the end of September, the bond buys are expected by investors to end this autumn after a brief tapering period. But interest rates, still well into negative territory, are not expected to rise until around mid-2019. Reporting by Balazs Koranyi; Editing by Francesco Canepa", "external_links": [], "published": "2018-01-11T14:38:00.000+02:00", "crawled": "2018-01-11T15:01:48.107+02:00", "highlightTitle": ""}