{"organizations": [], "uuid": "46898237bc5eb51960354553c46984d38e701132", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-platinum-eagle-acquisition-corp-led-by-media-exec-jeff-sagansky-announces-closing-of-325-million-ipo.html", "country": "US", "domain_rank": 767, "title": "Platinum Eagle Acquisition Corp., Led by Media Exec Jeff Sagansky, Announces Closing of $325 Million IPO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T23:00:00.000+02:00", "replies_count": 0, "uuid": "46898237bc5eb51960354553c46984d38e701132"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-platinum-eagle-acquisition-corp-led-by-media-exec-jeff-sagansky-announces-closing-of-325-million-ipo.html", "ord_in_thread": 0, "title": "Platinum Eagle Acquisition Corp., Led by Media Exec Jeff Sagansky, Announces Closing of $325 Million IPO", "locations": [], "entities": {"persons": [{"name": "jeff sagansky", "sentiment": "negative"}], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "platinum eagle acquisition corp.", "sentiment": "negative"}, {"name": "media exec", "sentiment": "negative"}, {"name": "nasdaq capital market", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 17, 2018 /PRNewswire/ -- Platinum Eagle Acquisition Corp. (Nasdaq: EAGLU), the fourth public acquisition vehicle led by media executive Jeff Sagansky, today announced the closing of its $325 million initial public offering of 32,500,000 units at $10.00 per unit, including $25 million, or 2,500,000 units, sold pursuant to the underwriters' partial exercise of their over-allotment option. Each unit issued in the initial public offering consists of one Class A ordinary share and one-third of one warrant to purchase one Class A ordinary share at an exercise price of $11.50 per whole share. The units are listed on The Nasdaq Capital Market and trade under the ticker symbol \"EAGLU.\" Once the securities comprising the units begin separate trading, the Class A ordinary shares and warrants are expected to be listed on The Nasdaq Capital Market under the symbols \"EAGL\" and \"EAGLW,\" respectively.\nPlatinum Eagle Acquisition Corp. was formed for the purpose of effecting a merger, share exchange, asset acquisition, share purchase, reorganization or similar business combination with one or more businesses. Platinum Eagle's efforts to identify a prospective initial business combination target will not be limited to a particular industry, sector or geographic region. While Platinum Eagle may pursue an initial business combination opportunity in any industry or sector, it intends to capitalize on the ability of its management team to identify, acquire and operate a business or businesses that can benefit from its management team's established global relationships and operating experience. Platinum Eagle's management team has extensive experience in identifying and executing strategic investments globally and has done so successfully in a number of sectors, including media and entertainment.\n\"With our fourth acquisition vehicle, we will continue to look for companies where we can add value based on our experience, particularly media and entertainment companies that can benefit from the digital disruption that has transformed the business on a global basis,\" said Sagansky. \"As always, we will target fast growing businesses that can benefit from a Nasdaq listing, access to capital, and experienced sponsors.\"\nPlatinum Eagle's sponsor is Platinum Eagle Acquisition LLC, of which Mr. Sagansky is a Member. Joining him in the management of the company is President, Chief Financial Officer and Secretary, Eli Baker, who served as the Vice President, General Counsel and Secretary of one of Mr. Sagansky's prior public acquisition vehicles and as a director of another of Mr. Sagansky's prior public acquisition vehicles. Harry E. Sloan, who co-led two prior public acquisition vehicles with Mr. Sagansky, is a founding investor in Platinum Eagle alongside the sponsor. Deutsche Bank Securities Inc. and BofA Merrill Lynch are acting as the representatives of the underwriters for the offering and I-Bankers is serving as a manager.\nThe offering was made only by means of a prospectus. Copies of the prospectus may be obtained from Deutsche Bank Securities Inc., Attn: Prospectus Group, 60 Wall Street, New York, NY 10005, tel: (800) 503-4611, email: prospectus.CPDG@db.com ; or from BofA Merrill Lynch, Attention: Prospectus Department, NC1-004-03-43, 200 North College Street, 3 rd Floor, Charlotte, North Carolina 28255-0001, email: dg.prospectus_requests@baml.com .\nA registration statement relating to these securities was declared effective by the Securities and Exchange Commission on January 11, 2018. This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any State or jurisdiction in which such an offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such State or jurisdiction.\nFORWARD-LOOKING STATEMENTS\nThis press release contains statements that constitute \"forward-looking statements,\" including with respect to the anticipated use of the net proceeds. No assurance can be given that the net proceeds of the offering will be used as indicated. Forward-looking statements are subject to numerous conditions, many of which are beyond the control of Platinum Eagle, including those set forth in the Risk Factors section of the Company's registration statement and prospectus for Platinum Eagle's offering filed with the Securities and Exchange Commission (\"SEC\"). Copies are available on the SEC's website, www.sec.gov . Platinum Eagle undertakes no obligation to update these statements for revisions or changes after the date of this release, except as required by law.\nMEDIA CONTACT:\nJeff Pryor/ Priority PR\nt. (818) 661-6368\ne. jeff@prioritypr.net\nINVESTOR CONTACT:\nEli Baker\nt. (424) 284-3519\ne. elibaker@geacq.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/platinum-eagle-acquisition-corp-led-by-media-exec-jeff-sagansky-announces-closing-of-325-million-ipo-300584144.html\nSOURCE Platinum Eagle Acquisition Corp.", "external_links": ["http://www.prnewswire.com/news-releases/platinum-eagle-acquisition-corp-led-by-media-exec-jeff-sagansky-announces-closing-of-325-million-ipo-300584144.html"], "published": "2018-01-17T23:00:00.000+02:00", "crawled": "2018-01-17T23:52:39.012+02:00", "highlightTitle": ""}