{"organizations": [], "uuid": "14340ec71970f59443477e0246d10b76277aa832", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-sterlingjewelers-lawsuit/u-s-judge-excludes-70000-women-from-sterling-jewelers-sex-bias-lawsuit-idUSKBN1F603J", "country": "US", "domain_rank": 408, "title": "U.S. judge excludes 70,000 women from Sterling Jewelers sex bias lawsuit", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T02:46:00.000+02:00", "replies_count": 0, "uuid": "14340ec71970f59443477e0246d10b76277aa832"}, "author": "", "url": "https://www.reuters.com/article/us-sterlingjewelers-lawsuit/u-s-judge-excludes-70000-women-from-sterling-jewelers-sex-bias-lawsuit-idUSKBN1F603J", "ord_in_thread": 0, "title": "U.S. judge excludes 70,000 women from Sterling Jewelers sex bias lawsuit", "locations": [], "entities": {"persons": [{"name": "brendan pierson", "sentiment": "none"}, {"name": "jed rakoff", "sentiment": "none"}, {"name": "david bouffard", "sentiment": "none"}, {"name": "rakoff", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "akron", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "sterling jewelers", "sentiment": "negative"}, {"name": "signet jewelers ltd", "sentiment": "none"}, {"name": "sterling", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "sterling jewelers inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - A U.S. judge on Tuesday overturned an arbitrator’s ruling allowing about 70,000 women to take part in a nationwide sex discrimination case against Sterling Jewelers Inc even though they had not opted to join.\nU.S. District Judge Jed Rakoff in Manhattan ruled that only women who had opted to join the case against Sterling under Title VII of the Civil Rights Act when it was before the arbitrator could stay in the case.\nDavid Bouffard, a spokesman for Sterling, said Rakoff’s order left 254 women in the Title VII case.\nA group of former Sterling employees sued the Akron, Ohio-based company in 2008, claiming it systematically discriminated against women in pay and promotions in violation of Title VII and the federal Equal Pay Act. Rakoff subsequently sent the case to private arbitration.\nSterling, a unit of Signet Jewelers Ltd, said Tuesday that the claims were without merit. The company in May settled a similar case brought by the U.S. Equal Employment Opportunity Commission without agreeing to pay any money.\nBouffard said that close to 10,000 women had opted into the arbitration to bring claims as a class under the Equal Pay Act, but that the company was challenging the certification of that class.\nJoseph Sellers, a lawyer for the plaintiffs, said he intended to appeal Rakoff’s order.\n“We remain confident in the strength of our case and look forward to the trial scheduled in May, when at least 10,000 women who opted into the arbitration to participate in a class certified under the Equal Pay Act will have the opportunity to hold Sterling Jewelers accountable for its discriminatory conduct,” he said in an emailed statement.\nSignet’s stock plunged in February 2017 after 1,300 pages of documents in the case were made public in which women claimed they were groped, demeaned and pressured to have sex with male managers in exchange for raises and promotions.\nIn March 2017, Signet shareholders sued the company, claiming it broke the law by failing to disclose the severity of the sex bias claims.\nReporting By Brendan Pierson in New York; Additional reporting by Alison Frankel in New York; Editing by Cynthia Osterman\n ", "external_links": [], "published": "2018-01-17T02:46:00.000+02:00", "crawled": "2018-01-17T03:01:08.000+02:00", "highlightTitle": ""}