{"organizations": [], "uuid": "b892e28fa9d2387df28b2f418e62074a02eb30ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/03/hankook-mirae-technology-giant-robot.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/23/data-sheet-davos-killer-ai-robot/", "country": "US", "domain_rank": 1196, "title": "Data Sheet—Davos World Economic Forum: AI, Killer Robots | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.066, "site_type": "news", "published": "2018-01-23T10:31:00.000+02:00", "replies_count": 0, "uuid": "b892e28fa9d2387df28b2f418e62074a02eb30ab"}, "author": "Aaron Pressman", "url": "http://fortune.com/2018/01/23/data-sheet-davos-killer-ai-robot/", "ord_in_thread": 0, "title": "Data Sheet—Davos World Economic Forum: AI, Killer Robots | Fortune", "locations": [], "entities": {"persons": [{"name": "cassell", "sentiment": "none"}, {"name": "elon musk", "sentiment": "none"}, {"name": "justine cassell", "sentiment": "none"}, {"name": "fei-fei li", "sentiment": "none"}], "locations": [{"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "carnegie mellon university", "sentiment": "none"}, {"name": "stanford", "sentiment": "none"}, {"name": "google", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "8:31 AM EST \nArtificial intelligence already is a top topic at this year’s World Economic Forum in Davos, Switzerland. \nMonday night, amid a driving blizzard that snarled traffic around town, I hosted a small dinner featuring Carnegie Mellon University’s Justine Cassell. She is associate dean of technology, strategy, and impact at the university’s school of computer science, and an expert on the human role in artificial intelligence. Cassell let loose the best one-liner I’ve heard that combats Elon Musk’s fear that the robots will kill us all. “If you’re afraid of the android revolution,” she said, “just stand in a puddle. The robot will electrocute itself.” (She added: If you can’t find a puddle, just stand still for 40 minutes, the robot will run out of electricity.) \nTuesday morning I hosted another panel that featured the Stanford roboticist and machine-learning expert Fei-Fei Li. She is doing a stint at Google , working in its cloud business, and has admirably grasped the commercial aspects of her technical job quite well. She argues that “pre-data” companies can’t all of a sudden do AI themselves. The solution: Google Cloud, which would be happy to help. \n*** \nSpeaking of companies who want to come up to speed digitally and otherwise, I’m pleased to announce that later this year Fortune will launch its newest conference, Brainstorm Reinvent. Think of it as the mirror image of Brainstorm Tech in Aspen. Reinvent, which will be held Sept. 24-25 in Chicago , targets C-level executives in the industrial heartland, all of whom want to be on the right side of disruption. The founding sponsor of the event is McKinsey, the international consulting firm that’s keen to help non-tech-industry companies navigate these difficult straits. If you’d like to attend (or speak), drop me an email. \n*** \nMonday I noted that the backlash against the tech giants would be a preoccupation of at least Silicon Valley executives in Davos. In that vein, I highly recommend an engaging, erudite, cleverly written, and amusing cover story in The Economist , “Silicon Valley, we have a problem.” Incidentally, of the three tech giants the article calls out the most for potential antitrust actions, Amazon , Facebook , and Google, only the latter two are in Davos in force. In the magazine’s next tier, Microsoft has a Davos presence; Apple and Netflix do not. \n*** \nLine of the day (so far) … Rachel Botsman, author of Who Can You Trust? : “Convenience is trumping trust.” This on a Davos panel with Google Chief Financial Officer Ruth Porat (whose company gives away a ton of information in return for its users’ data) and Dara Khosrowshahi (whose company’s trustworthiness has plummeted). Adam Lashinsky @adamlashinsky NEWSWORTHY \nWatching all the time. Netflix attracted 8.3 million new subscribers in the fourth quarter, more than the 7.1 million it gained in the same quarter of 2016, and more that Wall Street expected . Netflix shares soared 11% in premarket trading on Tuesday giving the company a stock market value of over $100 billion. The company’s decision not to run unaired shows featuring Kevin Spacey led to a $39 million write-off, or “unreleased content we’ve decided not to move forward with,” Reuters reported . \nNot good. The fallout from the security attacks known as Meltdown and Spectre continued to bedevil Intel . The chipmaker said on Monday that two security patches it issued were causing problems including making PCs spontaneously reboot. Intel is “still trying to get a handle on what’s really happening,” IDC analyst Mario Morales said. Famed software developer Linus Torvalds called the patches “COMPLETE AND UTTER GARBAGE.” \nWho would possibly benefit? Billionaire publishing icon Robert Murdoch said Facebook should pay media companies a fee for distributing their content, the way cable companies pay TV channels a carriage fee. “The publishers are obviously enhancing the value and integrity of Facebook through their news and content but are not being adequately rewarded for those services,” Murdoch, executive chairman of publishing giant News Corp, wrote . \nWorkaround . Montana is trying a clever approach to enforce net neutrality even after the Federal Communications Commission revoked its rules and banned states from reimposing the protections. Gov. Steve Bullock signed an executive order requiring Internet service providers to abide by net neutrality principles in order to be eligible for state contracts. Expect lawsuits to follow. \nCop on the beat. Aspects of the bitcoin bubble , particularly legally questionable funds raised in initial coin offerings, are drawing the attention of U.S. regulators. Securities and Exchange Commission chairman Jay Clayton says he has put his staff “on high alert for approaches to ICOs that may be contrary to the spirit of our securities laws and the professional obligations of the US securities bar.” \nSaving power . A team of researchers at MIT developed a new way to make molten salt batteries much more practical. Instead of relying on a fragile ceramic membrane that made the batteries easily damaged, the team created a steel mesh to perform the same function. Now the batteries could be used to store power generated by wind and solar installations where the use of lithium batteries is too expensive. FOOD FOR THOUGHT \nStartups valued at $1 billion and up get the moniker “unicorn,” but the true rare discovery in Silicon Valley is women-led firms, Fortune writer Michal Lev-Ram observes in a new article examining how gender issues are playing out in venture capital. She talks to the two women founders of Aspect Ventures, Theresia Gouw and Jennifer Fonstad, about their approach: \nOverall, women founders receive less than 3% of total VC dollars (women of color, meanwhile, get a meager 0.2%), but Aspect’s portfolio looks strikingly different from the norm: About 40% of the firm’s companies were founded by women, and 30% were started by minorities. Once, those numbers might have been a mere curiosity—today they are becoming a competitive advantage. While investing for diversity is something certain industry players have been pushing for a long time, the message is finally beginning to be received by the deep-pocketed individuals and institutions that fund the Silicon Valley ecosystem. Why? Ignoring it can be expensive. \nLast summer, after six female founders accused venture capitalist Justin Caldbeck of making unwanted sexual advances, his firm, Binary Capital, spiraled downward fast. Caldbeck quickly resigned from the all-male firm. A new fund, then in the process of being raised by Binary, was abruptly halted. IN CASE YOU MISSED IT ", "external_links": [], "published": "2018-01-23T10:31:00.000+02:00", "crawled": "2018-01-23T17:36:04.002+02:00", "highlightTitle": ""}