{"organizations": [], "uuid": "0da311483c42a3aaad28f883fba321ce29b44a7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-argentina-grains-weather/exclusive-argentine-drought-hurts-corn-yields-more-area-cuts-possible-idUSKBN1FJ2AX", "country": "US", "domain_rank": 408, "title": "Exclusive: Argentine drought hurts corn yields, more area cuts possible", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.031, "site_type": "news", "published": "2018-01-31T00:30:00.000+02:00", "replies_count": 0, "uuid": "0da311483c42a3aaad28f883fba321ce29b44a7f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-argentina-grains-weather/exclusive-argentine-drought-hurts-corn-yields-more-area-cuts-possible-idUSKBN1FJ2AX", "ord_in_thread": 0, "title": "Exclusive: Argentine drought hurts corn yields, more area cuts possible", "locations": [], "entities": {"persons": [], "locations": [{"name": "argentina", "sentiment": "none"}, {"name": "buenos aires", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "agriculture ministry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BUENOS AIRES (Reuters) - Argentina’s corn crop will suffer yield losses due to drought this year and the estimated planting area may drop further because dry weather in the northern part of the country has blocked late-season planting, a top Agriculture Ministry official said.\nRegarding the country’s main cash crop, soybeans, no more planting area losses are expected for the 2017/18 season and the size of the harvest hinges on February rains, which will be crucial after three consecutive months of near constant sun, ministry Chief of Staff Santiago del Solar said in an interview.\nThe government last week trimmed its 2017/18 soy planting area estimate to 16.75 million hectares - which would be a 10-year low as growers pile into corn - from its previous 16.8 million hectare forecast. Forecasted corn area was reduced to 8.7 million hectares from 8.8 million hectares.\nOf that 8.7 million hectares, 2.2 million is non-commercial corn that will feed livestock without ever leaving the farm.\n“The drought had an impact on early-planted corn, particularly during the silking stage around Christmas time,” del Solar said. “When you travel around you can see that. Late planted corn may get some rains that could still help.”\nElaborating further on the corn area, del Solar said: “Maybe it’s going to be a little less” than the most recent 8.7 million hectare estimate.\nArgentina is the world’s No. 3 exporter of both corn and soybeans, and the No. 1 supplier of soymeal livestock feed.\nU.S. soybean futures climbed for the 10th time in 12 sessions on Tuesday while corn scaled to the highest level in more than five months amid concerns that the weather in South America could hamper production of the crops in Brazil and Argentina.\nDrought-hit Argentina received only scattered rain over the weekend, mostly in northern and central portions of the country, meteorologists said. They expect most crop areas to turn drier and warmer than normal this week.\n“Soy yields depend on how much rain we get in February, but the rain has to start now. It’s really critical,” del Solar said.\n“But we can see that over the next three or four days it’s not going to rain,” he added, gesturing toward the pristine blue skies outside the window of his Buenos Aires office.\nAlthough sunny, temperatures on the Pampas grains belt have not been excessively high. “It was not very hot over the last week, that helps a bit to mitigate the effect,” del Solar said.\nWith some U.S. trade agreements in doubt, del Solar said Argentina will be on the outlook for new export markets that could be left without U.S. farm products.\n“We don’t know exactly what’s going on with the trade agreements of the United States, but we will be there with great products at great prices offered to the countries that will need to buy from us,” del Solar said.\n“We are opening our economy.”\nPresident Mauricio Macri was elected in late 2015 on a platform of ditching trade and currency controls and reducing grains export taxes that had weighed on the farm sector during the administration of previous President Cristina Fernandez, who expanded the government’s role in Latin America’s No. 3 economy.\nAdditional reporting by Karl Plume in Chicago; Editing by Tom Brown\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T00:30:00.000+02:00", "crawled": "2018-01-31T16:53:24.000+02:00", "highlightTitle": ""}