{"organizations": [], "uuid": "2ed1b9b729b3dd3bf315e3eda585e9f63a183867", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224427674&w=1200&r=LYNXMPEE0M0KZ", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-thailand-fishing-labour/it-was-torture-grim-tales-in-thai-fishing-sector-despite-reforms-idUSKBN1FC0Z6", "country": "US", "domain_rank": 408, "title": "'It was torture': Grim tales in Thai fishing sector despite reforms", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.897, "site_type": "news", "published": "2018-01-23T17:33:00.000+02:00", "replies_count": 0, "uuid": "2ed1b9b729b3dd3bf315e3eda585e9f63a183867"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-thailand-fishing-labour/it-was-torture-grim-tales-in-thai-fishing-sector-despite-reforms-idUSKBN1FC0Z6", "ord_in_thread": 0, "title": "'It was torture': Grim tales in Thai fishing sector despite reforms", "locations": [], "entities": {"persons": [{"name": "brad adams", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "kuala lumpur", "sentiment": "negative"}, {"name": "human rights watch", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KUALA LUMPUR (Thomson Reuters Foundation) - Trafficked into work and routinely abused, migrant fishermen in Thailand are still subject to forced labor despite efforts by the government to clean up the industry, advocacy groups said on Tuesday.\nThailand’s multibillion-dollar seafood sector came under scrutiny in recent years after investigations showed widespread slavery, trafficking and violence on fishing boats and in onshore processing facilities.\nThe military, which took power since a 2014 coup, has rolled out reforms since the European Union in 2015 threatened to ban fish imports from Thailand unless it clean up the industry. But the advocacy group Human Rights Watch (HRW) says little has changed.\nBrad Adams, the group’s Asia director, said the measures should have given consumers in Europe, the United States and Japan the confidence that Thailand’s seafood does not involve forced labor.\n“Yet despite high-profile commitments by the Thai government to clean up the fishing industry, problems are rampant,” he added in a statement.\nIn a report released on Tuesday, HRW included testimonies from some 248 current and former fishermen who described their horrific working conditions. The workers, almost all from Myanmar and Cambodia, were interviewed between 2015 and 2017.\nMigrant workers sort fish and seafood unloaded from a fishing ship at a port in Samut Sakhon province, Thailand, January 22, 2018. Picture taken January 22, 2018. REUTERS/Athit Perawongmetha “It was torture. One time I was so tired I fell off the boat, but they pulled me back on board,” Zin Min Thet from Myanmar was Quote: d as saying in the report.\n“You can’t leave because if you leave you won’t get paid, and if you want to leave at the end it’s only if they let you,” another fisherman Bien Vorn from Cambodia told the New York-based rights group.\nSlideshow (8 Images) The world’s third largest seafood exporter, Thailand’s fishing industry employs more than 300,000 people, many of them migrant workers from neighboring countries. The sector has long been dogged by allegations of abuses.\nThe Labour Rights Promotion Network Foundation, a Thai advocacy group that supports migrant fishermen, said reforms introduced by the government often are not enforced by local officials.\n“The situation of forced labor is still serious. Very often the fishermen have no salary or cannot change their job,” its founder, Patima Tungpuchayakul, told the Thomson Reuters Foundation by phone from Thailand.\nMore than a third of migrant fishermen in Thailand were victims of trafficking, according to a study of 260 fishermen by anti-trafficking group the International Justice Mission last year.\nThe study found three-quarters of migrants working on Thai fishing vessels have been in debt bondage and work at least 16 hours a day.\nReporting by Beh Lih Yi @behlihyi, Editing by Jared Ferrie; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T17:33:00.000+02:00", "crawled": "2018-01-24T15:16:21.008+02:00", "highlightTitle": ""}