{"organizations": [], "uuid": "4742125e30f76a76e2db7b5dead6c08238eade1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221269628&w=1200&r=LYNXMPEE0A1XV", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-corn-whitecorn/grain-glut-leaves-u-s-farmers-facing-losses-from-specialty-corn-idUSKBN1F033X", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Grain glut leaves U.S. farmers facing losses from specialty corn", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T00:53:00.000+02:00", "replies_count": 0, "uuid": "4742125e30f76a76e2db7b5dead6c08238eade1b"}, "author": "", "url": "https://www.reuters.com/article/us-usa-corn-whitecorn/grain-glut-leaves-u-s-farmers-facing-losses-from-specialty-corn-idUSKBN1F033X", "ord_in_thread": 0, "title": "UPDATE 1-Grain glut leaves U.S. farmers facing losses from specialty corn", "locations": [], "entities": {"persons": [{"name": "michael hirtzer", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}, {"name": "kentucky", "sentiment": "none"}, {"name": "nebraska", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "chicago board of trade", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO (Reuters) - U.S. farmers who sought to boost revenues by planting corn used to make tortillas may be forced to sell their crops at a loss to makers of ethanol or animal feed because of a glut of what typically is a human food-grade product.\nOversupply of the most common grains such as corn and soybeans has spread to niche markets because so many farmers have switched to planting different strains of seed to diversify and bolster returns after four years of bumper crops cut farm income and pushed down prices for staple grains.\nWhite corn, which makes up roughly 1 percent of the 14.6 billion-bushel U.S. corn harvest, can command a premium of as much as $1 per bushel over the commoditized yellow strain. But premiums have shriveled to four-year lows - to as little as 5 cents above Chicago Board of Trade corn futures Cc1.\nToo many farmers planted white corn in states such as Illinois, Illinois, Kentucky and Nebraska. Corn prices in 2017 declined for the fifth straight year and record-large U.S. stocks pushed growers to look for potentially higher-value alternatives.\nHowever, as acres devoted to varieties such as white corn, organic and non-genetically modified corn continue to rise, the benefits have shrunk for farmers switching to such strains.\nWhite corn is used by companies such as the PepsiCo Inc ( PEP.O ) unit Frito-Lay to make corn chips, and by tortilla and chip makers including Chicago-based Azteca Foods. In South Africa, it is eaten as part of the breakfast staple pap and in Colombia and Venezuela in patties known as arepas.\nRandy Anderson, who has planted white corn for 10 straight years in southern Illinois, said the market has become crowded. Local elevators, such as a Bunge Ltd ( BG.N ) facility that loads grain barges on the Ohio River, are buying white corn at prices that are below his cost of production.\n“I feel like there could be a better bid in the near future,” Anderson said, adding that he was holding out for another 20 cents per bushel to bring him closer to eking out a profit.\nPremiums for white corn in the United States surged in 2015 and 2016 because of a drought-reduced South African harvest that led to increased U.S. exports and more demand from Mexico, which also shipped white corn to South Africa.\nBut with supplies in South Africa once again abundant following a record-large corn harvest, there is more global supply than demand.\nAnderson, who sold some white corn in 2016 at a 90-cent premium to CBOT futures, now can sell about 10 cents above futures. “This year, we are getting the same price for white corn as yellow corn,” he said.\nCBOT March corn futures CH8 settled a 1/4 cent lower at $3.48-3/4 per bushel, just above the contract’s lifetime low of $3.46-3/4, reached in December.\nSince the white corn growing region is centralized in a few U.S. states, the variety can be prone to more severe price fluctuations than the more widely grown yellow strain, Roger Theisen, specialty corn manager in DowDuPont Inc’s ( DWDP.N ) agriculture division, said in an email.\n“This means a single weather event can have a significant impact on white corn production in an area,” he said.\nDowDuPont has as much as a 90 percent market share of the global white corn seed market, according to industry sources. The company declined to comment on sales or market share but Theisen said, “the total food corn market is growing.”\nExports of U.S. white corn through November of 1.48 million tonnes were down about 10 percent from 2016’s corresponding total of 1.63 million tonnes, according to U.S. Department of Agriculture data. The value of those sales declined to $312 million, from $367 million in 2016.\nAnd there are signs that 2018 could see a further decline. South Africa is likely to return to its status as a net exporter, limiting demand for U.S. shipments, said Max Thomas-Olson, an analyst at Global Risk Management, which publishes the Orville Fisher White Corn Newsletter.\nBen Scholl, president of specialty grain buyer Lewis B. Osterbur and Associates, said many of his farmer clients are looking for places to sell their white corn.\n“End users have all they need and there’s more available to buy,” Scholl said.\nReed White, a 56-year-old farmer in Sturgis, Kentucky, said this spring he will plant no white corn for the first time in recent memory. He was not able to secure a big enough contract to supply white corn to a local tortilla maker and will instead plant only yellow corn.\n“If we could get a larger chunk of that business, we might consider growing for them,” he said.\nGrain handler Andersons Inc ( ANDE.O ), a Frito-Lay supplier, said it has a waiting list for farmers interested in growing white corn or other specialty varieties for the company.\n“It’s not uncommon for farmers to wait two or three years,” said Andy Vollmar, food and specialty ingredients director at Andersons.\nReporting by Michael Hirtzer; Editing by Simon Webb, Steve Orlofsky and Lisa Shumaker\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-12T00:53:00.000+02:00", "crawled": "2018-01-12T01:15:31.009+02:00", "highlightTitle": ""}