{"organizations": [], "uuid": "b72b1e6667c022b256ab592b05a3bdb06af7e9a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews\r", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-children-stress-education/doctors-and-teachers-could-team-up-to-reduce-stress-in-schools-idUSKBN1ET2F8", "country": "US", "domain_rank": 408, "title": "Doctors and teachers could team up to reduce stress in schools", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T23:40:00.000+02:00", "replies_count": 0, "uuid": "b72b1e6667c022b256ab592b05a3bdb06af7e9a0"}, "author": "", "url": "https://www.reuters.com/article/us-health-children-stress-education/doctors-and-teachers-could-team-up-to-reduce-stress-in-schools-idUSKBN1ET2F8", "ord_in_thread": 0, "title": "Doctors and teachers could team up to reduce stress in schools", "locations": [], "entities": {"persons": [{"name": "ann", "sentiment": "none"}, {"name": "kavitha selvaraj", "sentiment": "none"}, {"name": "carolyn crist", "sentiment": "none"}, {"name": "selvaraj", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "robert h. lurie children’s hospital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 9:44 PM / Updated 7 minutes ago Doctors and teachers could team up to reduce stress in schools Carolyn Crist 5 Min Read \n(Reuters Health) - - Partnerships between teachers and doctors could help students and school staffers better deal with “toxic stress,” suggests a former teacher turned doctor. \nPediatricians can help build resilience in both children and teachers to counter the effects of traumatic childhood experiences, poverty and violence, Dr. Kavitha Selvaraj of the Ann and Robert H. Lurie Children’s Hospital in Chicago writes in the journal Pediatrics. \n“Before I was a pediatrician, I was a teacher, and in my clinic I hear personal stories about people’s children and families that remind me of stories I heard from my students,” Selvaraj told Reuters Health. \nIn the essay, Selvaraj writes about her own experiences as a teacher in a stressed environment. A seventh-grade biology and health teacher in an underserved neighborhood, she wanted to serve as a role model and inspiration. But in her first year as a teacher, she felt extremely underprepared to handle behavioral outbursts - including being punched in the face by a student - and felt like she spent little time teaching. \nSelvaraj nearly quit that year, but didn’t. The students began to trust her, and they began visiting her classroom outside class time. One confided that he was often hungry and found it hard to concentrate at school. Another said he had nightmares after witnessing a fatal shooting in his neighborhood. Another said she was sexually abused by her stepbrother. Selvaraj was able to help these kids with food pantry referrals, conferences with parents and school counselors and calls to the Department of Child and Family Services, respectively. \n“Although I do not recommend getting punched in the face to help children thrive, the chain of events that unraveled,” she writes, “showed me that as a teacher and a caring adult figure, I was in a unique position to limit the long-term effects of toxic stress.” \nThese adverse childhood experiences, also known as ACEs, and early exposure to poverty can lead to toxic stress in children and negative health problems later in life. They also contribute to a higher chance of heart attack, stroke, mental health problems and substance abuse. \n“I didn’t realize then what I know now - that there are so many different people who can help children with these stressors,” Selvaraj said in a telephone interview. “As a teacher, I never dreamt of talking to a pediatrician. Why didn’t anyone tell me I didn’t have to do this alone?” \nPediatricians and teachers can team up to ask students, “What is happening to you?” rather than focusing on, “Why are you behaving this way?”, she said. Children with toxic stress have complex educational, behavioral and medical needs that can’t be handled by one industry or one person. \nDoctor-school collaborations have been successful for children with development disorders, ADHD, undernutrition, obesity, food allergies and asthma. Toxic stress can be added to that list, Selvaraj said. Addressing teacher stress, too, can help with burnout and teacher turnover. \nShe suggests giving teachers a professional support network, strategies to de-escalate charged situations and ways to manage behavior in children with high ACE scores. \n“We have worked closely with the American Academy of Pediatrics Association and leadership to create best practices on bully and peer victimization assessment,” said Dorothy Espelage, a psychology professor at the University of Florida in Gainesville, who wasn’t involved in the study. \nSeveral resources on the American Academy of Pediatrics website, AAP.org, give parents, teachers and doctors information about bullying, violence and toxic stress in students. \n“We encourage pediatricians to ask about peer relations and stresses at school during wellness checkups,” Espelage told Reuters Health by email. \nSelvaraj suggests promoting “the 7 C’s” of resilience: competence, confidence, connection, character, contribution, coping and control. This includes teaching emotional self-regulation strategies such as meditation and mindfulness in both the classroom and clinic, she said. Doctors and teachers can also talk regularly about at-risk children and their progress. \nIn a current study at four hospitals in Chicago, Selvaraj and fellow pediatricians are screening students for signs of toxic stress and unmet social needs such as food, housing, childcare, legal services and monthly bills. \n“Doctors often get nervous about asking these questions, and we need a massive effort to get everyone on the same page,” she said. “Partnerships won’t have power without parents, pediatricians and teachers involved. It’s a triad of support for our children.” \nSOURCE: bit.ly/2CoXfQP Pediatrics, online January 1, 2018.", "external_links": [], "published": "2018-01-04T23:40:00.000+02:00", "crawled": "2018-01-04T23:52:59.011+02:00", "highlightTitle": ""}