{"organizations": [], "uuid": "0c84182a7d90a3533945356ca0c3132ff43248b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 11}, "facebook": {"likes": 27, "shares": 27, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/09/06/103919061-GettyImages-531945292.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/07/williams-on-fed-rate-hikes-us-economy.html", "country": "US", "domain_rank": 767, "title": "Williams on Fed rate hikes, US economy", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.214, "site_type": "news", "published": "2018-01-07T13:17:00.000+02:00", "replies_count": 0, "uuid": "0c84182a7d90a3533945356ca0c3132ff43248b2"}, "author": "Andrew Harrer", "url": "https://www.cnbc.com/2018/01/07/williams-on-fed-rate-hikes-us-economy.html", "ord_in_thread": 0, "title": "Williams on Fed rate hikes, US economy", "locations": [], "entities": {"persons": [{"name": "williams", "sentiment": "positive"}, {"name": "john", "sentiment": "positive"}, {"name": "andrew harrer", "sentiment": "none"}, {"name": "john williams", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "san francisco fed", "sentiment": "positive"}, {"name": "fed", "sentiment": "positive"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "federal reserve bank", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Andrew Harrer | Bloomberg | Getty Images President of the Federal Reserve Bank of San Francisco, John Williams. \nThe Federal Reserve should raise interest rates three times this year given the already strong economy will get a boost from tax cuts , and can tighten more or less aggressively if needed, a key U.S. rate-setter said on Saturday. \nIn an interview, San Francisco Fed President John Williams painted a benign picture of the world's largest economy operating at or near its full capacity over the next few years. \nWhile his colleagues at the U.S. central bank see unemployment dipping only slightly from 4.1 percent currently, Williams predicted it would fall to 3.7 percent this year without any risk of a worrisome jump in inflation. \nThe comments from Williams, a veteran policymaker at a time of an unprecedented leadership overhaul at the Fed, suggest the central bank remains confident in its approach after a year of gradual tightening even in the face of the $1.5-trillion tax-cut bill passed last month. \n\"We're in a pretty good situation: the economy is doing great, everyone expects us to raise rates gradually ... and if the data change we can respond to that,\" said Williams, who has a vote on policy this year under a rotation. \n\"I'm not worried about inflation suddenly taking off,\" he told Reuters over lunch during an American Economic Association conference in Philadelphia. \"Something like three rate hikes makes sense to me\" this year, he added. \nThe U.S. central bank hiked rates three times in 2017 in response to robust growth and falling unemployment, despite sagging inflation which has fallen short of a 2 percent goal for more than five years. \nMedian forecasts from Fed officials see three more hikes in 2018 as the tax stimulus, including cuts for corporations and individuals, seeps into the economy. \nThe Trump administration argues the tax cuts will boost both business and consumer spending. But the individual income tax cuts are skewed toward higher-income households, which economists say have a low propensity to consume more as taxes fall. \nMany economists also believe companies will use much of the windfall on stock buybacks and debt reduction rather than capital expenditure. \nWilliams said the cuts should have a \"modest, positive effect\" on economic growth over the next three years due to consumer spending and business investment. He expects gross domestic product growth of 2.5 percent in 2018, in line with overall Fed estimates, as well as a modest boost to the labor force and productivity, which has been surprisingly weak through the recovery from recession. \nThe U.S. economy will be \"in a very positive place two years from now: I think we'll be at 2 percent inflation and around 4 percent unemployment,\" Williams said. (Reporting by Jonathan Spicer and Howard Schneider; Editing by Meredith Mazzilli) ", "external_links": [], "published": "2018-01-07T13:17:00.000+02:00", "crawled": "2018-01-07T13:17:29.012+02:00", "highlightTitle": ""}