{"organizations": [], "uuid": "fb57597277b3bd275b35372eeeaea777db78b9f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/pope-peru/pope-urges-hope-in-visit-to-peru-area-devastated-by-floods-idINKBN1F90TL", "country": "US", "domain_rank": 408, "title": "Pope urges hope in visit to Peru area devastated by floods", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T18:31:00.000+02:00", "replies_count": 0, "uuid": "fb57597277b3bd275b35372eeeaea777db78b9f5"}, "author": "", "url": "https://in.reuters.com/article/pope-peru/pope-urges-hope-in-visit-to-peru-area-devastated-by-floods-idINKBN1F90TL", "ord_in_thread": 0, "title": "Pope urges hope in visit to Peru area devastated by floods", "locations": [], "entities": {"persons": [{"name": "pope", "sentiment": "negative"}, {"name": "francis", "sentiment": "none"}, {"name": "philip pullella", "sentiment": "none"}, {"name": "teresa cespedes", "sentiment": "none"}, {"name": "trujillo", "sentiment": "none"}], "locations": [{"name": "peru", "sentiment": "none"}, {"name": "huanchaco", "sentiment": "none"}, {"name": "pacific", "sentiment": "none"}, {"name": "pacific ocean", "sentiment": "none"}, {"name": "la libertad", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TRUJILLO, Peru (Reuters) - Pope Francis, visiting an area of Peru that was devastated last year by heavy rains linked to climate change and plagued by gang violence, urged people not to lose hope.\nOn his penultimate day in Peru, Francis flew north to the this city near the Pacific Ocean to say Mass for about 200,000 people on the beach at the nearby oceanside town of Huanchaco.\n“Peruvians today do not have the right to lose hope,” he said in improvised comments in his homily to the vast crowd from his vantage point on a huge altar overlooking the Pacific.\nTrujillo, capital of the region of La Libertad, was hit by major floods after six landslides in less than a week at the beginning of 2017, leaving tens of thousands of people homeless. The vast majority of people affected were poor.\nThe disaster was caused by the climatic phenomenon called Niño Costero, a warming of surface waters on the Pacific Ocean that generates intense rains on the coast of South America. Scientists have said climate change will make El Ninos more frequent and intense.\n“You know the power of nature, you have experienced its force,” Francis said. “You had to face the brunt of the ‘Niño Costero’ whose painful consequences are still present in so many families, especially those who are not yet able to rebuild their homes”.\nPope Francis (C) celebrates a mass at Huanchaco beach in Trujillo, Peru January 20, 2018. REUTERS/Pilar Olivares Apocalyptic scenes recorded on cellphones and shared on social media broadened the sense of chaos. Bridges collapsed as rivers breached their banks and cows and pigs turned up on beaches after being carried away by rivers.\nFrancis, who has often warned about the effects that climate change has on the poor, wrote a major document in 2015 on the need to protect the environment in which he backed scientists who say climate change is at least partially caused by the burning of fossil fuels.\nPope Francis celebrates a mass at Huanchaco beach in Trujillo, Peru January 20, 2018. REUTERS/Pilar Olivares Throughout Peru, an unusually brutal rainy season last year killed at least 162 people, slowed economic growth sharply and caused damage equivalent to 2 percent of Peru’s gross domestic product. The cost of rebuilding damaged infrastructure was expected to be about $8 billion.\nIn his homily, Francis also mentioned increasing violence in the Trujillo area, where there have been hundreds of murders related to drug trafficking.\nThe pope said “organized violence, like contract killings, and the insecurity they breed,” insecure housing, and unemployment were the other “storms” the area had to bear.\nThousands of people spent the night on the beach in tents and sleeping bags waiting for the pope.\n“You cannot imagine the enthusiasm we have for the pope, our faith is so great that it makes us forget the cold and fatigue in this vigil,” said Roger Montañez, 56, who was wrapped in a blanket to protect from the ocean breeze.\nReporting By Philip Pullella; Editing by Bill Trott\n ", "external_links": [], "published": "2018-01-20T18:31:00.000+02:00", "crawled": "2018-01-20T19:18:47.002+02:00", "highlightTitle": ""}