{"organizations": [], "uuid": "c5bcf8a30b4563e1c3fcf0493bb335db1635e639", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKCricketNews/", "section_title": "Reuters: Cricket News", "url": "https://uk.reuters.com/article/cricket-test-zaf-ind-gibson/cricket-selection-headache-for-south-africa-ahead-of-test-idUKL8N1OX2FJ", "country": "US", "domain_rank": 408, "title": "Cricket-Selection headache for South Africa ahead of test", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T16:47:00.000+02:00", "replies_count": 0, "uuid": "c5bcf8a30b4563e1c3fcf0493bb335db1635e639"}, "author": "", "url": "https://uk.reuters.com/article/cricket-test-zaf-ind-gibson/cricket-selection-headache-for-south-africa-ahead-of-test-idUKL8N1OX2FJ", "ord_in_thread": 0, "title": "Cricket-Selection headache for South Africa ahead of test", "locations": [], "entities": {"persons": [{"name": "ottis gibson", "sentiment": "none"}, {"name": "mark gleeson", "sentiment": "none"}, {"name": "dale steyn", "sentiment": "none"}, {"name": "steyn", "sentiment": "none"}], "locations": [{"name": "south africa", "sentiment": "none"}, {"name": "newlands", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "ab de villiers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 2:50 PM / Updated 2 hours ago Cricket-Selection headache for South Africa ahead of test Mark Gleeson 3 Min Read \nCAPE TOWN, Jan 2 (Reuters) - South Africa have a selection conundrum as they consider their team to face India in the first test on Friday with veteran bowler Dale Steyn far from sure of a place in the side, coach Ottis Gibson said on Tuesday. \n“We have to try and pick the best team for the conditions and it is clearly a selection headache, but it is a good headache to have all the best players back and available to play,” he told a news conference. \nAB de Villiers has returned after a two-year hiatus from the test arena while Steyn is available again after a year-long lay-off and major shoulder surgery for the three match series against the top-ranked test team. \nBut Steyn, five wickets shy of becoming South Africa’s top test wicket taker, will only play if South Africa decide to go with an extra bowler on what is expected to be a green, seamer-friendly wicket at Newlands. \n“We don’t know just yet whether we will play him in the first test but, depending on the selection, he might well play,” Gibson said. \nThe 34-year-old Steyn has not had a rigorous examination of his injury since returning to action in November and it is a risk to play him, particularly if he breaks down as he did against England in late 2015 and Australia in 2016. \n“I don’t think that if we were to pick a three-man seam attack plus a spinner we would want to put him in, in case something happens and he leaves the team vulnerable if he can’t finish the game,” Gibson added. \n“I‘m not saying that will happen, but you don’t want to take that risk with the first test. We have to look at the best combination to try and win the game and he will certainly come into the discussion but it depends on the formation of the team we put on the field.” QUICK WICKET \nGibson, recently appointed South Africa coach after previously serving as England’s bowling coach, said the hosts had asked for a quick wicket to be prepared and that looks likely to be the case at the toss on Friday. But he warned the bowlers they still had to efficiently use the favourable conditions. \n“With some grass on the wicket, bowlers sometimes tend to get a bit carried away. You still have to put the ball in the right area. However the wicket looks, you still have to play well on it. We will be playing the best team in the world, so we have to bring our A-game,” he said. (Editing by Christian Radnedge)", "external_links": [], "published": "2018-01-02T16:47:00.000+02:00", "crawled": "2018-01-02T17:27:37.007+02:00", "highlightTitle": ""}