{"organizations": [], "uuid": "a4263a39e2e3cffd3db8e31f49438205dff1f245", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224734792&w=1200&r=LYNXMPEE0N0KA", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-myanmar-repatriation-rohingya/u-n-calls-on-myanmar-for-unhindered-access-to-rohingya-camps-idUKKBN1FD0Q8", "country": "US", "domain_rank": 408, "title": "U.N. calls on Myanmar for unhindered access to Rohingya camps", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T10:01:00.000+02:00", "replies_count": 0, "uuid": "a4263a39e2e3cffd3db8e31f49438205dff1f245"}, "author": "", "url": "https://uk.reuters.com/article/uk-myanmar-repatriation-rohingya/u-n-calls-on-myanmar-for-unhindered-access-to-rohingya-camps-idUKKBN1FD0Q8", "ord_in_thread": 0, "title": "U.N. calls on Myanmar for unhindered access to Rohingya camps", "locations": [], "entities": {"persons": [{"name": "justin forsyth", "sentiment": "none"}], "locations": [{"name": "myanmar", "sentiment": "none"}, {"name": "bangladesh", "sentiment": "none"}, {"name": "maungdaw", "sentiment": "none"}, {"name": "taung pyo letwe", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "rohingya", "sentiment": "negative"}, {"name": "u.n.", "sentiment": "negative"}, {"name": "united nations", "sentiment": "none"}, {"name": "unicef", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 8:00 AM / Updated 38 minutes ago U.N. calls on Myanmar for unhindered access to Rohingya camps Reuters Staff 4 Min Read \nMAUNGDAW, Myanmar (Reuters) - The United Nations on Wednesday called on Myanmar to give aid agencies unhindered access to camps it has built for tens of thousands of Muslim Rohingya refugees before they can return after fleeing Myanmar military operations last year. \nAn international delegation advising Myanmar toured the Taung Pyo Letwe refugee camp outside the town of Maungdaw near the Bangladesh border. Video of the camp shows long, plywood houses set on a rocky field and surrounded by a wire mesh fence topped with barbed wire. \nBangladesh on Tuesday delayed the repatriation of the largely stateless Rohingya to Myanmar as the process of compiling and verifying the list of people to be sent back was incomplete. \nBut the United Nations said necessary safeguards for the refugees were still missing. \n“Until the safety and wellbeing of any child returning to Myanmar can be guaranteed, talk of repatriation is premature,” UNICEF Deputy Executive Director Justin Forsyth said in a statement. \nThe UN Refugee Agency UNHCR said earlier “there are continued restrictions on access for aid agencies, the media and other independent observers” in Myanmar. \nThe UNHCR called on Myanmar “to allow the necessary unhindered humanitarian access in Rakhine State and create conditions for a genuine and lasting solution”. \nMore than 688,000 Muslim Rohingya and a few hundred Hindu Rohingya have fled to Bangladesh since Aug. 25 last year after the Myanmar military cracked down in the northern part of Rakhine state, amid witness reports of killings, looting and rape, in response to militant attacks on security forces. \nMany in Buddhist-majority Myanmar regard the Rohingya community as illegal immigrants from Bangladesh. The United Nations described Myanmar’s crackdown as ethnic cleansing, which Myanmar denies. People work inside a camp set up by Myanmar's Social Welfare, Relief and Resettlement Minister to prepare for the repatriation of displaced Rohingyas, who fled to Bangladesh, outside Maungdaw in the state of Rakhine, Myanmar January 24, 2018. REUTERS/Stringer FILLING OUT FORMS \nMyanmar officials told a news conference on Tuesday that Bangladesh was not ready to send back the refugees as scheduled because the potential returnees hadn’t completed the forms Myanmar provided attesting to their former residency in Myanmar. \n“They also have to check with the UNHCR about whether it’s voluntary,” Minister of International Cooperation Kyaw Tin told the news conference. Slideshow (5 Images) \n“They need a lot of time to fill out the forms and to determine if they really want to come back.” \nBut a UNHCR spokesperson in Bangladesh told Reuters the agency had not been involved “in the bilateral discussions on repatriations or signed any agreements”. \n“We would like to be part of the process and discussions to ensure the reparations are voluntary, safe and sustainable and that any returns are in line with international standards,” said Caroline Gluck, UNHCR’s senior public information officer, in Cox’s Bazar. \nMyanmar and Bangladesh agreed earlier this month to complete a voluntary repatriation of the refugees in two years. Myanmar says it has set up two reception centres and the temporary Taung Pyo Letwe camp to receive the first arrivals. \nThe plan has sparked fears in refugee camps in Bangladesh that people may be forced to return despite a lack of guarantees around their security. \nLate on Tuesday, U.S. State Department spokeswoman Heather Nauert said the delay in the repatriations was a good idea and Washington was concerned about a lack of access for U.N. organisations. Reporting by Zeba Siddiqui; Writing by Bill Tarrant and Euan Rocha; Editing by Nick Macfie", "external_links": [], "published": "2018-01-24T10:01:00.000+02:00", "crawled": "2018-01-24T10:16:32.031+02:00", "highlightTitle": ""}