{"organizations": [], "uuid": "1b5856d7291bcacd7a607d564b51817c27d73d17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/china-stocks-hongkong-close/hong-kong-stocks-rise-the-most-in-3-months-to-10-year-high-idUSZZN2N7300", "country": "US", "domain_rank": 408, "title": "Hong Kong stocks rise the most in 3 months to 10-year high", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T10:34:00.000+02:00", "replies_count": 0, "uuid": "1b5856d7291bcacd7a607d564b51817c27d73d17"}, "author": "", "url": "https://www.reuters.com/article/china-stocks-hongkong-close/hong-kong-stocks-rise-the-most-in-3-months-to-10-year-high-idUSZZN2N7300", "ord_in_thread": 0, "title": "Hong Kong stocks rise the most in 3 months to 10-year high", "locations": [], "entities": {"persons": [], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "sunny optical technology group co ltd", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "hang seng china enterprises", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "galaxy entertainment group ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 8:36   Hong Kong stocks rise the most in 3 months to 10-year high Reuters Staff 3 Min Read \nJan 2 (Reuters) - Hong Kong stocks rose the most in three months to a decade-high on Tuesday, led by mainland companies listed in the city, after Beijing kicked off H-share convertibility reform. \n** The market was also aided by China’s stronger-than-expected factory activity, as well as strong property sales performance during the last week of 2017. \n** At close of trade, the Hang Seng index was up 596.16 points or 1.99 percent at 30,515.31. The Hang Seng China Enterprises index rose 3.07 percent to 12,068.99. ** The sub-index of the Hang Seng tracking energy shares rose 2.9 percent while the IT sector rose 2.65 percent, the financial sector was 2.42 percent higher and the property sector rose 2.16 percent. ** The top gainer on the Hang Seng was Sunny Optical Technology Group Co Ltd up 9.61 percent, while the biggest loser was Galaxy Entertainment Group Ltd which was down 3.83 percent. ** China’s main Shanghai Composite index closed up 1.27 percent at 3,349.052 points while its blue-chip CSI300 index ended up 1.41 percent. ** Around the region, MSCI’s Asia ex-Japan stock index was firmer by 0.99 percent. ** The yuan was quoted at 6.4992 per U.S. dollar at 08:11 GMT, 0.12 percent firmer than the previous close of 6.5069. ** The top gainers among H-shares were China Vanke Co Ltd up 9.94 percent, followed by Great Wall Motor Co Ltd gaining 7.49 percent and Anhui Conch Cement Co Ltd up by 5.99 percent. ** The three biggest H-shares percentage decliners were Air China Ltd which was down 1.69 percent, Zhuzhou CRRC Times Electric Co Ltd which fell 0.1 percent and CGN Power Co Ltd down by 0.9 percent. ** About 2.44 billion Hang Seng index shares were traded, roughly 143.6 percent of the market’s 30-day moving average of 1.70 billion shares a day. ** At close, China’s A-shares were trading at a premium of 28.83 percent over the Hong Kong-listed H-shares. ** The price-to-earnings ratio of the Hang Seng index was 13.64 as of the last full trading day while the dividend yield was 2.9 percent. ** The short and one-factor leveraged Hang Seng index, which is designed to replicate the payoff of a short or leveraged portfolio and is linked to the movements of the Hang Seng Index, was lower by 1.97 percent on the day at 4,836.67 points. Reporting by the Shanghai Newsroom; Editing by Jacqueline Wong", "external_links": [], "published": "2018-01-02T10:34:00.000+02:00", "crawled": "2018-01-02T11:17:24.001+02:00", "highlightTitle": ""}