{"organizations": [], "uuid": "ce3ca7eaf231fffe00593f686d6298522e6432ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226644848&w=1200&r=LYNXMPEE0T158", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-saudi-arrests-corruption/saudi-arabia-says-it-has-seized-over-100-billion-in-corruption-purge-idUKKBN1FJ28K", "country": "US", "domain_rank": 408, "title": "Saudi Arabia says it has seized over $100 billion in corruption purge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T18:04:00.000+02:00", "replies_count": 0, "uuid": "ce3ca7eaf231fffe00593f686d6298522e6432ab"}, "author": "", "url": "https://uk.reuters.com/article/uk-saudi-arrests-corruption/saudi-arabia-says-it-has-seized-over-100-billion-in-corruption-purge-idUKKBN1FJ28K", "ord_in_thread": 0, "title": "Saudi Arabia says it has seized over $100 billion in corruption purge", "locations": [], "entities": {"persons": [{"name": "stephen kalin", "sentiment": "none"}, {"name": "katie paul", "sentiment": "none"}, {"name": "alwaleed bin talal", "sentiment": "none"}, {"name": "mohammed bin salman", "sentiment": "none"}, {"name": "waleed al-ibrahim", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "riyadh", "sentiment": "none"}, {"name": "ritz-carlton hotel", "sentiment": "none"}], "organizations": [{"name": "kingdom holding", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "mbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 4:05 PM / Updated an hour ago Saudi Arabia says it has seized over $100 billion in corruption purge Stephen Kalin , Katie Paul 5 Min Read \nRIYADH (Reuters) - Saudi Arabia’s government has arranged to seize more than $100 billion (70.84 billion pounds) through financial settlements with businessmen and officials detained in its crackdown on corruption, the attorney general said on Tuesday. The announcement appeared to represent a political victory for Crown Prince Mohammed bin Salman, who launched the purge last November and predicted at the time that it would net about $100 billion in settlements. \nDozens of top officials and businessmen were detained in the crackdown, many of them confined and interrogated at Riyadh’s opulent Ritz-Carlton Hotel. \nWell over 100 detainees are believed to have been released. \nBillionaire Prince Alwaleed bin Talal, owner of global investor Kingdom Holding ( 4280.SE ), and Waleed al-Ibrahim, who controls influential regional broadcaster MBC, were freed last weekend. \n“The estimated value of settlements currently stands at more than 400 billion riyals ($106 billion) represented in various types of assets, including real estate, commercial entities, securities, cash and other assets,” Sheikh Saud Al Mojeb said in a statement \nThe huge sum, if it is successfully recovered, would be a big financial boost for the government, which has seen its finances strained by low oil prices. The state budget deficit this year is projected at 195 billion riyals. \nIn total, the investigation subpoenaed 381 people, some of whom testified or provided evidence, Mojeb said, adding that 56people had not reached settlements and were still in custody, down from 95 early last week. \nThe government has generally declined to reveal details of the allegations against detainees or their settlements, making it impossible to be sure how much corruption has been punished or whether the $100 billion figure is realistic. \nThe only settlement disclosed so far was a deal by senior prince Miteb bin Abdullah to pay more than $1 billion, according to Saudi officials. Miteb was once seen as a leading contender for the throne, so his detention fuelled suspicion among foreign diplomats there might be political motives behind the purge. \nAlthough officials said both Prince Alwaleed and Ibrahim reached financial settlements after admitting unspecified “violations”, Prince Alwaleed continued to insist publicly he was innocent, while MBC said Ibrahim had been fully exonerated. \nEconomy minister Mohammed al-Tuwaijri told CNN this month that most assets seized in the purge were illiquid, such as real estate and structured financial instruments. That suggested the government may not have gained large sums of cash to spend. \nIn another sign that the investigation was winding down, a Saudi official told Reuters on Tuesday that all detainees had now left the Ritz-Carlton. The hotel, where the cheapest room costs $650 a night, is to reopen to the public in mid-February. \nSome detainees are believed to have been moved from the hotel to prison after refusing to admit wrongdoing and reach financial settlements; they may stand trial. \nBankers in the Gulf said the secrecy of the crackdown had unsettled the business community and could weigh on the willingness of local and foreign businesses to invest. \n“It’s reassuring if this situation is finally at an end, as the process was not clear from the start and at least if it is now ended, that provides some clarity and closure,” said a banker who deals with Saudi Arabia. \nBut Prince Mohammed appears to have won widespread approval for the purge among ordinary Saudis, partly because the government has said it will use some of the money it seizes to fund social benefits. \n“What has happened is great, it will be counted as a win for the government. Whoever the person is, he is being held accountable, whether a royal or a citizen,” said Abdullah al-Otaibi, drinking at a Riyadh coffee shop on Tuesday. \nAn international financier visiting the region said authorities’ tough approach might ultimately prove effective. \n“There are many different ways to fight corruption and not all of them are effective. Ukraine tried to do it by creating institutions, but that hasn’t really worked as that approach doesn’t change behaviour,” he said. \n“Saudi’s approach stands a better chance of being effective as it’s more direct.” Additional reporting by Sarah Dadouch in Riyadh and Tom Arnold in Dubai; Reporting by Andrew Torchia and Angus MacSwan", "external_links": [], "published": "2018-01-30T18:04:00.000+02:00", "crawled": "2018-01-30T18:37:18.002+02:00", "highlightTitle": ""}