{"organizations": [], "uuid": "3a7f560700addc2930e999be4590d0bae106489c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 9}, "facebook": {"likes": 264, "shares": 264, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/23/104790120-Photo-Oct-23-2-25-07-PM.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/27/saudi-billionaire-prince-alwaleed-bin-talal-is-released-from-captivity-probe-winds-down.html", "country": "US", "domain_rank": 767, "title": "Saudi billionaire Prince Alwaleed bin Talal is released from captivity, probe winds down", "performance_score": 2, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.171, "site_type": "news", "published": "2018-01-27T15:28:00.000+02:00", "replies_count": 0, "uuid": "3a7f560700addc2930e999be4590d0bae106489c"}, "author": "Mary Catherine Wellons", "url": "https://www.cnbc.com/2018/01/27/saudi-billionaire-prince-alwaleed-bin-talal-is-released-from-captivity-probe-winds-down.html", "ord_in_thread": 0, "title": "Saudi billionaire Prince Alwaleed bin Talal is released from captivity, probe winds down", "locations": [], "entities": {"persons": [{"name": "alwaleed bin talal", "sentiment": "negative"}, {"name": "bin talal", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "ritz-carlton", "sentiment": "none"}, {"name": "riyadh", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "mins ago mary catherine wellons", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "World News Saudi billionaire Prince Alwaleed bin Talal is released from captivity, probe winds down The billionaire member of Saudi Arabia's royal family, Alwaleed bin Talal has been held for more than 2 months amid a corruption crackdown. The terms of his release were not immediately clear, but a source told Reuters that bin Talal had \"arrived home.\" Published 8 Hours Ago Mary Catherine Wellons | CNBC Saudi Prince Alwaleed bin Talal. \nSaudi Arabian billionaire Prince Alwaleed bin Talal was released from detention on Saturday, family sources said, more than two months after he was taken into custody in the kingdom's sweeping crackdown on corruption. \nHis release came hours after he told Reuters in an interview at Riyadh's opulent Ritz-Carlton hotel that he expected to be cleared of any wrongdoing and be freed within days. \nThe terms of his release were not immediately clear, and Saudi officials could not immediately be reached for comment. \nBut the decision to free him, and the release of several other well-known tycoons on Friday, suggested the main part of the corruption probe was winding down after it sent shockwaves through Saudi Arabia's business and political establishment. \n\"He has arrived home,\" one source in Prince Alwaleed's family told Reuters. \nPrince Alwaleed had been confined at the Ritz-Carlton since early November, along with dozens of other senior officials and businessmen, part of Crown Prince Mohammed bin Salman's plan to reform oil superpower Saudi Arabia and consolidate his power. \nEarlier this week the attorney general said 90 detainees had been released after having their charges dropped, while others had traded cash, real estate and other assets for their freedom. Authorities were still holding 95 people, he said. Some are expected to be put on trial. \nOn Friday, an official Saudi source said several prominent businessmen have reached financial settlements with authorities, including Waleed al-Ibrahim, owner of regional television network MBC, who was released. Terms of his settlement were not revealed. \nSaudi authorities have said they expect to raise some $100 billion for the government through such settlements - a huge windfall for the state, which has seen its finances squeezed by low oil prices. Katie Paul | Reuters Maintaining innocence \nAllegations against Prince Alwaleed, who is in his early 60s, included money laundering, bribery and extorting officials, a Saudi official told Reuters in early November. \nIn his first interview since he was taken into custody, conducted hours before his release, Prince Alwaleed told Reuters that he was continuing to maintain his innocence of any corruption in talks with authorities. \nHe said he expected to keep full control of his global investment firm Kingdom Holding Co without being required to give up assets to the government. \nThe release of Prince Alwaleed, whose net worth has been estimated by Forbes magazine at $17 billion, is likely to reassure investors in his global business empire as well as in the Saudi economy broadly. \nDirectly or indirectly through Kingdom Holding, he holds stakes in firms such as Twitter Inc and Citigroup Inc, and has invested in top hotels including the George V in Paris and the Plaza in New York. \nHe described his confinement as a misunderstanding and said he supports reform efforts by the crown prince. \n\"There are no charges. There are just some discussions between me and the government,\" he said in the interview. \"I believe we are on the verge of finishing everything within days.\"", "external_links": [], "published": "2018-01-27T15:28:00.000+02:00", "crawled": "2018-01-27T15:31:11.006+02:00", "highlightTitle": ""}