{"organizations": [], "uuid": "ed6dbf77f5308f4e0c09b2c6e1f58fe2eb6378a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222414967&w=1200&r=LYNXMPEE0F0TF", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-usa-stocks/dow-on-track-to-top-26000-at-open-idUSKBN1F51GC", "country": "US", "domain_rank": 408, "title": "Dow on track to top 26,000 at open", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:40:00.000+02:00", "replies_count": 0, "uuid": "ed6dbf77f5308f4e0c09b2c6e1f58fe2eb6378a8"}, "author": "", "url": "https://www.reuters.com/article/us-usa-stocks/dow-on-track-to-top-26000-at-open-idUSKBN1F51GC", "ord_in_thread": 0, "title": "Dow on track to top 26,000 at open", "locations": [], "entities": {"persons": [{"name": "sruthi shanka", "sentiment": "neutral"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "dow", "sentiment": "neutral"}, {"name": "citigroup", "sentiment": "none"}, {"name": "wells fargo", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "unitedhealth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Wall Street paused its rally on Tuesday, weighed down by weakness in General Electric shares and as lower oil prices dragged down the energy sector.\nThe energy sector fell 1.2 percent as Brent crude oil shed some of its recent gains, falling nearly $1 per barrel. [O/R] Industrials and materials were the other major laggards on the S&P, down 0.9 percent and 1.2 percent, respectively.\nGeneral Electric fell 2.9 percent after raising the prospect of breaking itself up and announcing more than $11 billion in charges from its long-term care insurance portfolio and new U.S. tax laws.\nThe CBOE Volatility index, a widely followed measure of market anxiety, rose to a more than 1-month high of 11.66.\n“Lower energy prices are taking us down a little bit,” said Tracie McMillion, head of global asset allocation strategy at Wells Fargo Investment Institute in Winston-Salem, North Carolina.\nBut, she added, “investors are continuing to move into equities as they see returns. It’s feeding on itself, becoming a virtuous cycle, enticing more people in.”\nThe Dow Jones Industrial Average fell 10.33 points, or 0.04 percent, to 25,792.86, the S&P 500 lost 9.82 points, or 0.35 percent, to 2,776.42 and the Nasdaq Composite dropped 37.38 points, or 0.51 percent, to 7,223.69.\nEarlier on Tuesday, the Dow Jones Industrial Average had broken above the 26,000 mark for the first time as fourth-quarter earnings season got off to a strong start following upbeat results from UnitedHealth and Citigroup.\nUnitedHealth rose 1.9 percent after the largest U.S. health insurer reported results that beat estimates and raised its 2018 earnings outlook.\nMore than three quarters of the 30 S&P 500 companies that have reported so far have topped profit estimates, according to Thomson Reuters I/B/E/S.\n“You’d typically see and expect the markets to interpret that in a positive manner, but a lot of indices have moved back. What’s held them back seems to be company-specific,” said Shawn Cruz, senior trading specialist at TD Ameritrade in Chicago, making reference to General Electric.\nCruz added that the Federal Reserve Bank of New York’s business conditions index, which came in slightly below expectations on Tuesday, may have also contributed to Wall Street’s dip.\nMerck surged 5.8 percent after early results from a key study showed its blockbuster drug Keytruda and two chemotherapy medicines helped lung cancer patients live longer and stopped the disease from advancing.\nViacom fell 7.0 percent after sources told Reuters CBS Corp and the company were not in active merger discussions.\nDeclining issues outnumbered advancing ones on the NYSE by a 2.04-to-1 ratio; on Nasdaq, a 2.18-to-1 ratio favored decliners.\nThe S&P 500 posted 170 new 52-week highs and six new lows; the Nasdaq Composite recorded 243 new highs and 29 new lows.\nVolume on U.S. exchanges was 8.30 billion shares, compared to the 6.48 billion average over the last 20 trading days.\nAdditional reporting by Sruthi Shankar in Bengaluru; Editing by Anil D'Silva and James Dalgleish\n ", "external_links": [], "published": "2018-01-16T14:40:00.000+02:00", "crawled": "2018-01-16T14:50:36.000+02:00", "highlightTitle": ""}