{"organizations": [], "uuid": "4b7d83dec0fdb285bd5d4742bd9cf65506be752e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226336901&w=1200&r=LYNXMPEE0S15X", "site_section": "http://feeds.reuters.com/reuters/UKdomesticNews", "section_title": "Reuters: UK", "url": "https://uk.reuters.com/article/uk-russia-worldcup-england/no-tolerance-for-hooligans-at-russia-world-cup-uk-police-chief-idUKKBN1FI1YR", "country": "US", "domain_rank": 408, "title": "No tolerance for hooligans at Russia World Cup - UK police chief", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T17:41:00.000+02:00", "replies_count": 0, "uuid": "4b7d83dec0fdb285bd5d4742bd9cf65506be752e"}, "author": "", "url": "https://uk.reuters.com/article/uk-russia-worldcup-england/no-tolerance-for-hooligans-at-russia-world-cup-uk-police-chief-idUKKBN1FI1YR", "ord_in_thread": 0, "title": "No tolerance for hooligans at Russia World Cup - UK police chief", "locations": [], "entities": {"persons": [{"name": "mic", "sentiment": "negative"}, {"name": "holden", "sentiment": "none"}, {"name": "mark roberts", "sentiment": "none"}, {"name": "roberts", "sentiment": "none"}, {"name": "kazan", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "st petersburg", "sentiment": "none"}, {"name": "sheffield", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 3:43 PM / Updated 19 minutes ago No tolerance for hooligans at Russia World Cup - UK police chief Michael Holden 3 Min Read \nSHEFFIELD, England (Reuters) - Soccer hooligans can expect swift police action if they try to make trouble at this summer’s World Cup finals in Russia where authorities are already putting strict security procedures in place, Britain’s lead officer for soccer policing said. \nEngland and Russia were threatened with expulsion from the 2016 European Championship in France after brawls between Russian and English hooligans that both countries blamed on each other’s fans. \nRussian and British police have been cooperating to avoid a repeat this summer, Deputy Chief Constable Mark Roberts said, with Russian authorities visiting England to watch its soccer policing in action and British officials going to Russia to discuss tactics and strategies. \nRoberts said he was confident the Russians were on top of security at the tournament, which will be held in 12 venues in 11 cities, including Moscow, St Petersburg, Sochi and Kazan. \n“Gauging everything (the Russian police) have said, everything I’ve seen, there’s a high degree of commitment to deal with their own risk supporters as well as any visiting ones,” Roberts said in an interview at police headquarters in Sheffield, northern England, where he is based. \n“My sense is the hooligans in Russia will be wary of the Russian authorities.” \nEnglish fans have had a reputation for hooliganism since the 1970s and caused trouble in the 1998 World Cup in France and the European Championships in Belgium in 2000. England supporters gather before the Euro 2016 England versus Russia match in Marseille, France June 11, 2016. REUTERS/Jean-Paul Pelissier \nBritain has had success cracking down on the problem by banning travel for known troublemakers - nearly 2,000 people are currently banned - and giving police the power to confiscate their passports. \nNot one British national was arrested for soccer-related disorder at tournaments in South Africa in 2010, Poland and Ukraine in 2012 or Brazil in 2014. \nThe trouble in Marseilles two years ago reignited concerns that English soccer violence could return, however. Slideshow (2 Images) \n“I think they (the Russians) are wary as every host nation is,” Roberts said. \nWhile an estimated half a million British fans travelled to France in 2016 only about 10,000-20,000 fans were expected to make the trip to Russia, however, he said. \nEnglish fans should not misbehave in Russia and should expect serious consequences if they do, he said. \n“There is a tendency when English supporters travel abroad to try to push the buttons of the local people. My perception is that sort of attempt to press the buttons in Russia would be really dimly viewed,” Roberts said. \n“If people were to get drunk and behave in a way that was perceived locally as being disrespectful to the hosts, that could provoke an adverse reaction. I really would make the point to supporters travelling that there will be a robust police response.” Editing by Guy Faulconbridge and Sonya Hepinstall", "external_links": [], "published": "2018-01-29T17:41:00.000+02:00", "crawled": "2018-01-29T18:07:15.013+02:00", "highlightTitle": ""}