{"organizations": [], "uuid": "475cd87602554dbb638d14f478291876a1248ae0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-servicechannel-strengthens-executive-team-with-key-appointments.html", "country": "US", "domain_rank": 767, "title": "ServiceChannel Strengthens Executive Team with Key Appointments", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T17:00:00.000+02:00", "replies_count": 0, "uuid": "475cd87602554dbb638d14f478291876a1248ae0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-servicechannel-strengthens-executive-team-with-key-appointments.html", "ord_in_thread": 0, "title": "ServiceChannel Strengthens Executive Team with Key Appointments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Todd Lutwak and Kevin Ferguson Join from Andreessen Horowitz and Rocket Fuel\nNEW YORK--(BUSINESS WIRE)-- ServiceChannel , the leading online marketplace and SaaS platform for facilities managers, contractors, and technicians, today announced Kevin Ferguson as the company’s new chief revenue officer (CRO) and Todd Lutwak as its new head of business and marketplace development.\n“We could not be more excited and fortunate. Kevin and Todd bring us amazing insights and successes with customers, partners, and marketplaces,” said Tom Buiocchi, ServiceChannel’s CEO . “It’s evident that they’ll be able to help us move faster, and deliver even more innovation and benefits to facilities and contracting professionals.”\nKevin Ferguson brings more than two decades of proven sales and management experience and will lead global enterprise sales and strategic solutions for new and existing customers. He joins ServiceChannel from Rocket Fuel, where he oversaw North American sales. Ferguson also previously held senior roles at Invoca, Oracle, and Eloqua.\n“I’m delighted and excited – it’s very clear that ServiceChannel is ushering in the future for the facilities management (FM) industry,” said Ferguson. “The technology is second to none and as more companies move from legacy FM tools to modern solutions, ServiceChannel will be at the head of the class.”\nTodd Lutwak is tasked with leading strategic partnerships and defining platform and marketplace strategy as ServiceChannel’s new head of business and marketplace development. Lutwak most recently led the market development team as a partner at Andreessen Horowitz. Prior to that, Lutwak was vice president of selling at eBay, where he honed his expertise managing and scaling platform and marketplace business models.\n“After nearly two decades helping retailers establish and optimize their e-commerce businesses, I am eager to work on an industry-leading, two-sided marketplace, that brings benefits for retailers, restaurants, and any organization with a physical presence. ServiceChannel empowers businesses to drive significant improvements in cost savings, quality, and compliance, further optimizing their physical presence as a strategic advantage,” said Lutwak. “This company has the potential to be one of the great new business-to-business platforms by doing that for some of the world’s best-known brands.”\nAbout ServiceChannel\nServiceChannel provides facilities managers with a single platform to source, procure, manage, and pay for repair and maintenance services from commercial contractors across their enterprise. By delivering unprecedented transparency and data-driven analytics of service quality, across all trades, locations and contractors, facilities managers drive significant brand equity and ROI for their organizations without outsourcing or investing in new infrastructure. The world’s leading global brands use ServiceChannel solutions daily to help optimize millions of transactions and billions of dollars of spend annually. Learn more: servicechannel.info .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005404/en/\nInkHouse for ServiceChannel\nJill Rosenthal\nServiceChannel@InkHouse.com\nSource: ServiceChannel", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fhubs.ly%2FH09RS-00&esheet=51751279&newsitemid=20180131005404&lan=en-US&anchor=ServiceChannel&index=1&md5=d11f31e53bb30e724e692d60db381bf5", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fhubs.ly%2FH09RTdY0&esheet=51751279&newsitemid=20180131005404&lan=en-US&anchor=Kevin+Ferguson&index=2&md5=adda17cd8324cdde4e1c73619871b8d8", "http://www.businesswire.com/news/home/20180131005404/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fservicechannel.info%2F&esheet=51751279&newsitemid=20180131005404&lan=en-US&anchor=servicechannel.info&index=5&md5=373826c7534fb0ef2a626c4e1a7afbc2", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fhubs.ly%2FH09RTf50&esheet=51751279&newsitemid=20180131005404&lan=en-US&anchor=Todd+Lutwak&index=3&md5=7dde2e9e4b4e9ce9777e6502c1b1af12", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fhubs.ly%2FH08j9fh0&esheet=51751279&newsitemid=20180131005404&lan=en-US&anchor=Tom+Buiocchi%2C+ServiceChannel%27s+CEO&index=4&md5=b14bddf1ea76dec8bc19174e5e1381be"], "published": "2018-01-31T17:00:00.000+02:00", "crawled": "2018-01-31T18:47:42.034+02:00", "highlightTitle": ""}