{"organizations": [], "uuid": "e429d8ef1aa8d3ad803cc7786b8046e9253920e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-celgene-announces-retirement-of-executive-chairman-bob-hugin-and-appointment-of-ceo-mark-alles-as-chairman-of-the-board-of.html", "country": "US", "domain_rank": 767, "title": "Celgene Announces Retirement of Executive Chairman Bob Hugin and Appointment of CEO Mark Alles as Chairman of the Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T18:54:00.000+02:00", "replies_count": 0, "uuid": "e429d8ef1aa8d3ad803cc7786b8046e9253920e4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-celgene-announces-retirement-of-executive-chairman-bob-hugin-and-appointment-of-ceo-mark-alles-as-chairman-of-the-board-of.html", "ord_in_thread": 0, "title": "Celgene Announces Retirement of Executive Chairman Bob Hugin and Appointment of CEO Mark Alles as Chairman of the Board of Directors", "locations": [], "entities": {"persons": [{"name": "mark alles", "sentiment": "negative"}, {"name": "bob hugin", "sentiment": "negative"}], "locations": [{"name": "n.j.", "sentiment": "none"}], "organizations": [{"name": "celgene announces retirement of executive", "sentiment": "negative"}, {"name": "celgene", "sentiment": "negative"}, {"name": "celgene corporation", "sentiment": "none"}, {"name": "celgene board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Executive Chairman Bob Hugin to retire and step down from Celgene’s Board of Directors effective February 5, 2018\nDuring Bob Hugin’s 19-year tenure, Celgene expanded from 200 to 7,500 employees, received approvals for 8 therapies across 10 diseases in more than 70 countries and delivered industry-leading growth\nCEO Mark Alles appointed to additional role of Chairman of the Board of Directors\nSUMMIT, N.J.--(BUSINESS WIRE)-- Celgene Corporation (NASDAQ:CELG) today announced that Executive Chairman Bob Hugin has decided to retire from Celgene after 19 years of service and to step down from the Celgene Board of Directors, effective February 5, 2018. Chief Executive Officer Mark Alles has been appointed to the additional role of Chairman of the Board of Directors.\n“It has been a tremendous privilege to be part of Celgene’s growth and to help advance Celgene’s mission to serve patients through scientific breakthroughs in the treatment of cancer and other serious medical conditions,” said Bob Hugin, Executive Chairman of Celgene. “I am thankful to my colleagues at Celgene, as well as to patient advocates, medical researchers and physicians across New Jersey and throughout the healthcare system for their collaboration in advancing this fundamentally important mission in the service of patients.”\n“Bob Hugin has contributed immeasurably to Celgene during his 19-year tenure. Under his stellar strategic leadership and guidance, Celgene has achieved unprecedented growth, produced extraordinary business results, and most importantly has developed and delivered transformational therapies for patients,” said Mark Alles, Chief Executive Officer of Celgene. “Bob is an inspirational leader, a mentor and a friend to everyone associated with the organization. On behalf of all Celgene employees, we wish Bob and his family the best in the next chapter of his life.”\nBob Hugin joined Celgene in 1999 as Chief Financial Officer. He served as President and Chief Operating Officer from 2006 to 2010, and Chief Executive Officer from 2010 until becoming Executive Chairman in March 2016. Bob was elected to serve on the Board of Directors in December 2001 and became Chairman in June 2011.\nUnder Bob Hugin’s leadership as Chairman and CEO, Celgene’s net product sales and adjusted diluted earnings per share grew each year by double-digit percentages; Celgene’s portfolio of approved products doubled; and Celgene grew from a company with 2500 employees in 2010 to a company with 7500 employees today. Celgene’s late stage pipeline of potential breakthrough therapies also greatly expanded due to Bob Hugin’s pioneering strategy of combining internal company research expertise with external collaboration partners. During Bob Hugin’s tenure at Celgene, more than 2 million patients have been treated with one of Celgene’s medicines.\n“During his time at Celgene, Bob delivered industry-leading results while driving the strategic direction of the company with the highest standards of character, values and integrity. As a nationally recognized health care expert, Bob has led efforts across the health care system to improve patient access and outcomes through the advancement of innovative science. We are grateful for Bob’s legacy of leadership through service and wish him well in his future pursuits,” said Michael D. Casey, Celgene's Lead Independent Director and Chairman of the Nominating, Governance & Compliance Committee. “Mark is a tremendous leader and the best person to guide Celgene into its next phase of significant growth. Through his strategic leadership as CEO, Celgene has advanced and expanded its portfolio of potentially life-changing medicines.”\nCEO and newly appointed Chairman Mark Alles has been with Celgene since 2004. Under Mark’s leadership, Celgene has delivered impressive results and expanded its pipeline through accelerating clinical development of key assets and championing strategic business development. Prior to becoming CEO in 2016, Mark served as President and COO, and prior to that, as Executive Vice President and Global Head of Hematology & Oncology, helping to build Celgene’s Hematology & Oncology franchise, as well as various other senior leadership positions.\nAbout Celgene\nCelgene Corporation, headquartered in Summit, New Jersey, is an integrated global biopharmaceutical company engaged primarily in the discovery, development and commercialization of innovative therapies for the treatment of cancer and inflammatory diseases through next-generation solutions in protein homeostasis, immuno-oncology, epigenetics, immunology and neuro-inflammation. For more information, please visit www.celgene.com . Follow Celgene on social media: @Celgene , Pinterest , Facebook and YouTube .\nForward-Looking Statement\nThis press release contains forward-looking statements, which are generally statements that are not historical facts. Forward-looking statements can be identified by the words \"expects,\" \"anticipates,\" \"believes,\" \"intends,\" \"estimates,\" \"plans,\" \"will,\" \"outlook\" and similar expressions. Forward-looking statements are based on management's current plans, estimates, assumptions and projections, and speak only as of the date they are made. We undertake no obligation to update any forward-looking statement in light of new information or future events, except as otherwise required by law. Forward-looking statements involve inherent risks and uncertainties, most of which are difficult to predict and are generally beyond our control. Actual results or outcomes may differ materially from those implied by the forward-looking statements as a result of the impact of a number of factors, many of which are discussed in more detail in our Annual Report on Form 10-K and our other reports filed with the Securities and Exchange Commission.\nHyperlinks are provided as a convenience and for informational purposes only. Celgene bears no responsibility for the security or content of external websites.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129005762/en/\nCelgene\nMedia:\n+1-908-673-2275\nmedia@celgene.com\nSource: Celgene Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Fcelgene&esheet=51750053&newsitemid=20180129005762&lan=en-US&anchor=%40Celgene&index=2&md5=46015305d302502185c2324b3000b6d0", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.facebook.com%2FCelgene%2F&esheet=51750053&newsitemid=20180129005762&lan=en-US&anchor=Facebook&index=4&md5=6d7a4ec9ae7f1653a99280a44448ae91", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.youtube.com%2Fcelgene&esheet=51750053&newsitemid=20180129005762&lan=en-US&anchor=YouTube&index=5&md5=2fe8597d5555967348ae8abc70409e0e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.celgene.com&esheet=51750053&newsitemid=20180129005762&lan=en-US&anchor=www.celgene.com&index=1&md5=a12796566e595ff316eb3f9b9816e227", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.pinterest.com%2Fcelgene%2F&esheet=51750053&newsitemid=20180129005762&lan=en-US&anchor=Pinterest&index=3&md5=7305f69fe37a1e669e4e751f55158702", "http://www.businesswire.com/news/home/20180129005762/en/"], "published": "2018-01-29T18:54:00.000+02:00", "crawled": "2018-01-29T20:52:47.011+02:00", "highlightTitle": ""}