{"organizations": [], "uuid": "11ee0845d25a42045956cd8f41bbbe23844ca5dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-perkinelmer-announces-financial-results-for-the-fourth-quarter-and-full-year-2017.html", "country": "US", "domain_rank": 767, "title": "PerkinElmer Announces Financial Results for the Fourth Quarter and Full Year 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:15:00.000+02:00", "replies_count": 0, "uuid": "11ee0845d25a42045956cd8f41bbbe23844ca5dc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-perkinelmer-announces-financial-results-for-the-fourth-quarter-and-full-year-2017.html", "ord_in_thread": 0, "title": "PerkinElmer Announces Financial Results for the Fourth Quarter and Full Year 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "waltham", "sentiment": "none"}], "organizations": [{"name": "perkinelmer", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}, {"name": "euroimmun", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "inc", "sentiment": "none"}, {"name": "pki", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fourth Quarter 2017 GAAP revenue growth of 13% to $642 million; 6% organic revenue growth excluding EUROIMMUN Fourth Quarter 2017 GAAP losses per share from continuing operations of $0.35; Adjusted earnings per share of $0.97, an increase of 17% Completes EUROIMMUN acquisition Initiates FY 2018 GAAP earnings per share guidance of $2.28 from continuing operations; Adjusted EPS guidance of $3.50, an increase of 21%\nWALTHAM, Mass.--(BUSINESS WIRE)-- PerkinElmer, Inc . (NYSE: PKI), a global leader committed to innovating for a healthier world, today reported financial results for the fourth quarter and full year ended December 31, 2017.\nFourth Quarter 2017\nThe Company reported GAAP losses per share from continuing operations of $0.35, including the impact of the Tax Cuts and Jobs Act of 2017, as compared to GAAP earnings per share from continuing operations of $0.57 in the fourth quarter of 2016. GAAP revenue for the quarter was $641.6 million, as compared to $566.8 million in the fourth quarter of 2016. GAAP operating income from continuing operations for the quarter was $97.4 million, as compared to $80.4 million in the fourth quarter of 2016. GAAP operating profit margin was 15.2% as a percentage of revenue.\nAdjusted earnings per share from continuing operations for the quarter was $0.97, as compared to $0.83 in the fourth quarter of 2016. Adjusted revenue for the quarter was $641.8 million, as compared to $567.0 million in the fourth quarter of 2016. Adjusted operating income from continuing operations for the quarter was $137.0 million, as compared to $120.6 million for the same period a year ago. Adjusted operating profit margin was 21.4% as a percentage of adjusted revenue.\nFull Year 2017\nThe Company reported GAAP earnings per share from continuing operations of $1.42, including the impact of the Tax Cuts and Jobs Act of 2017, as compared to $1.96 in 2016. GAAP revenue for the year was $2.257 billion, as compared to $2.116 billion in 2016. GAAP operating income from continuing operations for the year was $304.8 million, as compared to $283.1 million in 2016. GAAP operating profit margin was 13.5% as a percentage of revenue.\nAdjusted earnings per share from continuing operations for the year was $2.90, as compared to $2.60 in 2016. Adjusted revenue for the year was $2.258 billion, as compared to $2.116 billion in 2016. Adjusted operating income for the year was $427.7 million, as compared to $393.6 million in 2016. Adjusted operating profit margin was 18.9% as a percentage of adjusted revenue.\nAdjustments for the Company's non-GAAP financial measures have been noted in the attached reconciliations.\n“It was a strong finish to a very good year as we not only delivered solid financial results but also made meaningful strategic moves that have improved the growth and competitive strength of our businesses,” said Robert Friel, chairman and chief executive officer of PerkinElmer. “With the completion of the EUROIMMUN transaction, we enter 2018 with an improved portfolio, wider reach and a more capable organization thereby increasing the positive impact we have on global health while continuing to create value for our shareholders.”\nFinancial Overview by Reporting Segment for the Fourth Quarter and Full Year 2017\nDiscovery & Analytical Solutions\nFourth quarter 2017 revenue of $448.2 million, as compared to $409.9 million for the comparable prior period. Reported revenue increased 9% and organic revenue increased 6.5%. Full year 2017 revenue of $1.578 billion, as compared to $1.513 billion in 2016. Full year 2017 reported and organic revenues increased 4%. Fourth quarter 2017 operating income of $77.0 million, as compared to operating income of $69.7 million for the comparable prior period. Full year 2017 operating income of $206.7 million, as compared to operating income of $196.8 million for 2016. Fourth quarter 2017 adjusted operating income of $93.7 million, as compared to $82.9 million in the comparable prior period. Fourth quarter 2017 adjusted operating profit margin was 20.9% as a percentage of revenue, as compared to 20.2% in the fourth quarter of 2016. Full year 2017 adjusted operating income of $270.9 million, as compared to adjusted operating income of $255.9 million for 2016. Full year 2017 adjusted operating profit margin was 17.2% as a percentage of revenue, as compared to 16.9% in 2016.\nDiagnostics\nFourth quarter 2017 revenue of $193.4 million, as compared to $156.8 million for the comparable prior period. Fourth quarter 2017 reported revenue increased 23% and organic revenue excluding EUROIMMUN increased 6%. Full year 2017 revenue of $678.5 million, as compared to $602.5 million in 2016. Full year 2017 reported revenue increased 13% and organic revenue excluding EUROIMMUN increased 5%. Fourth quarter 2017 operating income of $34.5 million, as compared to $36.3 million for the comparable prior period. Full year 2017 operating income of $149.6 million, as compared to operating income of $149.6 million for 2016. Fourth quarter 2017 adjusted operating income of $59.5 million, as compared to $48.1 million for the comparable prior period. Fourth quarter 2017 adjusted operating profit margin was 30.8% as a percentage of adjusted revenue, as compared to 30.6% in the fourth quarter of 2016. Full year 2017 adjusted operating income of $210.4 million, as compared to adjusted operating income of $185.8 million for 2016. Full year 2017 adjusted operating profit margin was 31.0% as a percentage of adjusted revenue, as compared to 30.8% in 2016.\nFinancial Guidance – Full Year 2018\nFor the full year 2018, the Company forecasts GAAP earnings per share from continuing operations of $2.28 and on a non-GAAP basis, which is expected to include the adjustments noted in the attached reconciliation, adjusted earnings per share of $3.50.\nConference Call Information\nThe Company will discuss its fourth quarter and full year 2017 results and its outlook for business trends in a conference call on January 25, 2018 at 5:00 p.m. Eastern Time. To access the call, please dial (541) 797-2422 prior to the scheduled conference call time and provide the access code 5294434.\nA live audio webcast of the call will be available on the Investor section of the Company’s Web site, www.perkinelmer.com . Please go to the site at least 15 minutes prior to the call in order to register, download, and install any necessary software. An archived version of the webcast will be posted on the Company’s Web site for a two week period beginning approximately two hours after the call.\nUse of Non-GAAP Financial Measures\nIn addition to financial measures prepared in accordance with generally accepted accounting principles (GAAP), this earnings announcement also contains non-GAAP financial measures. The reasons that we use these measures, a reconciliation of these measures to the most directly comparable GAAP measures, and other information relating to these measures are included below following our GAAP financial statements.\nFactors Affecting Future Performance\nThis press release contains \"forward-looking\" statements within the meaning of the Private Securities Litigation Reform Act of 1995, including, but not limited to, statements relating to estimates and projections of future earnings per share, cash flow and revenue growth and other financial results, developments relating to our customers and end-markets, and plans concerning business development opportunities, acquisitions and divestitures. Words such as \"believes,\" \"intends,\" \"anticipates,\" \"plans,\" \"expects,\" \"projects,\" \"forecasts,\" \"will\" and similar expressions, and references to guidance, are intended to identify forward-looking statements. Such statements are based on management's current assumptions and expectations and no assurances can be given that our assumptions or expectations will prove to be correct. A number of important risk factors could cause actual results to differ materially from the results described, implied or projected in any forward-looking statements. These factors include, without limitation: (1) markets into which we sell our products declining or not growing as anticipated; (2) fluctuations in the global economic and political environments; (3) our failure to introduce new products in a timely manner; (4) our ability to execute acquisitions and license technologies, or to successfully integrate acquired businesses such as EUROIMMUN and licensed technologies into our existing business or to make them profitable, or successfully divest businesses; (5) our failure to adequately protect our intellectual property; (6) the loss of any of our licenses or licensed rights; (7) our ability to compete effectively; (8) fluctuation in our quarterly operating results and our ability to adjust our operations to address unexpected changes; (9) significant disruption in third-party package delivery and import/export services or significant increases in prices for those services; (10) disruptions in the supply of raw materials and supplies; (11) the manufacture and sale of products exposing us to product liability claims; (12) our failure to maintain compliance with applicable government regulations; (13) regulatory changes; (14) our failure to comply with healthcare industry regulations; (15) economic, political and other risks associated with foreign operations; (16) our ability to retain key personnel; (17) significant disruption in our information technology systems; (18) our ability to obtain future financing; (19) restrictions in our credit agreements; (20) the United Kingdom’s intention to withdraw from the European Union; (21) our ability to realize the full value of our intangible assets; (22) significant fluctuations in our stock price; (23) reduction or elimination of dividends on our common stock; and (24) other factors which we describe under the caption \"Risk Factors\" in our most recent quarterly report on Form 10-Q and in our other filings with the Securities and Exchange Commission. We disclaim any intention or obligation to update any forward-looking statements as a result of developments occurring after the date of this press release.\nAbout PerkinElmer\nPerkinElmer, Inc. is a global leader focused on innovating for a healthier world. The Company reported revenue of approximately $2.3 billion in 2017, has about 11,000 employees serving customers in more than 150 countries, and is a component of the S&P 500 Index. Additional information is available through 1-877-PKI-NYSE, or at www.perkinelmer.com .\nPerkinElmer, Inc. and Subsidiaries CONDENSED CONSOLIDATED INCOME STATEMENTS Three Months Ended\nTwelve Months Ended\n(In thousands, except per share data) December 31,\n2017\nJanuary 1, 2017\nDecember 31,\n2017\nJanuary 1, 2017\nRevenue $ 641,630 $ 566,770 $ 2,256,982 $ 2,115,517 Cost of revenue 334,535 290,607 1,183,951 1,102,164 Selling, general and administrative expenses 172,271 162,795 616,167 600,885 Research and development expenses 37,667 32,926 139,404 124,278 Restructuring and contract termination charges, net (263 ) - 12,657 5,124 Operating income from continuing operations 97,420 80,442 304,803 283,066 Interest income (1,059 ) (341 ) (2,571 ) (702 ) Interest expense 11,430 10,750 43,940 41,528 Loss (gain) on disposition of businesses and assets, net\n8 - 309 (5,562 ) Other expense (income), net 6,152 847 (33,593 ) 3,734 Income from continuing operations, before income taxes 80,889 69,186 296,718 244,068 Provision for income taxes 119,333 6,897 139,828 28,362 (Loss) income from continuing operations (38,444 ) 62,289 156,890 215,706 Income from discontinued operations, before income taxes - 3,665 650 22,229 (Loss) gain on disposition of discontinued operations, before income taxes (556 ) - 179,615 619 Provision for income taxes on discontinued operations and dispositions 2,117 1,105 44,522 4,255 (Loss) gain from discontinued operations and dispositions (2,673 ) 2,560 135,743 18,593 Net (loss) income\n$ (41,117 ) $ 64,849 $ 292,633 $ 234,299 Diluted earnings per share: (Loss) income from continuing operations $ (0.35 ) $ 0.57 $ 1.42 $ 1.96 (Loss) gain from discontinued operations and dispositions (0.02 ) 0.02 1.22 0.17 Net (loss) income\n$ (0.37 ) $ 0.59 $ 2.64 $ 2.12 Weighted average shares of common stock outstanding 110,064 110,137 110,859 110,313 basic diluted diluted diluted ABOVE PREPARED IN ACCORDANCE WITH GAAP Additional Supplemental Information (1) : (per share, continuing operations) GAAP EPS from continuing operations $ (0.35 ) $ 0.57 $ 1.42 $ 1.96 Amortization of intangible assets 0.19 0.16 0.66 0.65 Purchase accounting adjustments 0.03 0.06 0.08 0.16 Significant litigation matter 0.02 - 0.02 - Acquisition and divestiture-related costs 0.20 0.01 (0.08 ) 0.01 Disposition of businesses and assets, net 0.00 - 0.00 (0.05 ) Mark to market on postretirement benefits (0.02 ) 0.14 (0.02 ) 0.14 Restructuring and contract termination charges, net (0.00 ) - 0.11 0.05 Tax on above items (0.07 ) (0.10 ) (0.27 ) (0.31 ) Impact of tax act 0.97 - 0.96 - Adjusted EPS $ 0.97 $ 0.83 $ 2.90 $ 2.60 (1) amounts may not sum due to rounding\nPerkinElmer, Inc. and Subsidiaries REVENUE AND OPERATING INCOME (LOSS) Three Months Ended\nTwelve Months Ended\n(In thousands, except percentages) December 31,\n2017\nJanuary 1, 2017\nDecember 31,\n2017\nJanuary 1, 2017\nDAS Reported revenue $ 448,189 $ 409,944 $ 1,578,459 $ 1,512,984 Reported operating income from continued operations 77,013 69,682 206,688 196,819 OP% 17.2 % 17.0 % 13.1 % 13.0 % Amortization of intangible assets 13,224 13,018 50,677 53,342 Purchase accounting adjustments 16 16 64 457 Acquisition and divestiture-related costs - 160 348 513 Significant litigation matter 2,700 - 2,700 - Restructuring and contract termination charges, net 730 - 10,446 4,740 Adjusted operating income 93,683 82,876 270,923 255,871 Adjusted OP% 20.9 % 20.2 % 17.2 % 16.9 % Diagnostics Reported revenue 193,441 156,826 678,523 602,533 Purchase accounting adjustments 189 184 745 711 Adjusted Revenue 193,630 157,010 679,268 603,244 Reported operating income from continued operations 34,531 36,345 149,636 149,577 OP% 17.9 % 23.2 % 22.1 % 24.8 % Amortization of intangible assets 8,176 4,572 22,983 18,120 Purchase accounting adjustments 2,753 6,703 9,153 16,955 Acquisition and divestiture-related costs 15,080 441 26,448 725 Restructuring and contract termination charges, net (993 ) - 2,211 384 Adjusted operating income 59,547 48,061 210,431 185,761 Adjusted OP% 30.8 % 30.6 % 31.0 % 30.8 % Corporate Reported operating loss (14,124 ) (25,585 ) (51,521 ) (63,330 ) Mark to market on postretirement benefits (2,068 ) 15,290 (2,114 ) 15,287 Adjusted operating loss (16,192 ) (10,295 ) (53,635 ) (48,043 ) Continuing Operations Reported revenue $ 641,630 $ 566,770 $ 2,256,982 $ 2,115,517 Purchase accounting adjustments 189 184 745 711 Adjusted Revenue 641,819 566,954 2,257,727 2,116,228 Reported operating income from continued operations 97,420 80,442 304,803 283,066 OP% 15.2 % 14.2 % 13.5 % 13.4 % Amortization of intangible assets 21,400 17,590 73,660 71,462 Purchase accounting adjustments 2,769 6,719 9,217 17,412 Acquisition and divestiture-related costs 15,080 601 26,796 1,238 Significant litigation matter 2,700 - 2,700 - Mark to market on postretirement benefits (2,068 ) 15,290 (2,114 ) 15,287 Restructuring and contract termination charges, net (263 ) - 12,657 5,124 Adjusted operating income $ 137,038 $ 120,642 $ 427,719 $ 393,589 Adjusted OP% 21.4 % 21.3 % 18.9 % 18.6 %\nREPORTED REVENUE AND REPORTED OPERATING INCOME (LOSS) PREPARED IN ACCORDANCE WITH GAAP\nPerkinElmer, Inc. and Subsidiaries CONDENSED CONSOLIDATED BALANCE SHEETS (In thousands) December 31, 2017\nJanuary 1, 2017\nCurrent assets: Cash and cash equivalents $ 202,134 $ 359,265 Accounts receivable, net 552,304 425,588 Inventories, net 351,675 246,847 Other current assets 93,952 99,246 Current assets of discontinued operations - 58,985 Total current assets 1,200,065 1,189,931 Property, plant and equipment: At cost 630,919 427,903 Accumulated depreciation (332,853 ) (282,409 ) Property, plant and equipment, net 298,066 145,494 Intangible assets, net 1,366,940 420,224 Goodwill 2,982,198 2,247,966 Other assets, net 244,304 204,679 Long-term assets of discontinued operations - 68,389 Total assets $ 6,091,573 $ 4,276,683 Current liabilities: Current portion of long-term debt $ 215,504 $ 1,172 Accounts payable 222,093 168,033 Short-term accrued restructuring and contract termination charges 8,759 7,479 Accrued expenses and other current liabilities 496,927 399,700 Current liabilities of discontinued operations 2,102 26,971 Total current liabilities 945,385 603,355 Long-term debt 1,790,605 1,045,254 Long-term liabilities 852,395 459,544 Long-term liabilities of discontinued operations - 14,960 Total liabilities 3,588,385 2,123,113 Total stockholders' equity 2,503,188 2,153,570 Total liabilities and stockholders' equity $ 6,091,573 $ 4,276,683 PREPARED IN ACCORDANCE WITH GAAP\nPerkinElmer, Inc. and Subsidiaries CONSOLIDATED STATEMENTS OF CASH FLOWS Three Months Ended\nTwelve Months Ended\nDecember 31, 2017\nJanuary 1, 2017\nDecember 31, 2017\nJanuary 1, 2017\n(In thousands) (In thousands) Operating activities: Net (loss) income $ (41,117 ) $ 64,849 $ 292,633 $ 234,299 Loss (gain) from discontinued operations and dispositions, net of income taxes 2,673 (2,560 ) (135,743 ) (18,593 ) (Loss) income from continuing operations (38,444 ) 62,289 156,890 215,706 Adjustments to reconcile income from continuing operations to net cash provided by continuing operations: Stock-based compensation 9,242 3,709 25,421 17,158 Restructuring and contract termination charges, net (263 ) - 12,657 5,124 Depreciation and amortization 29,493 25,465 105,000 99,972 Pension and other postretirement (benefits) expenses (10,439 ) 14,511 (10,439 ) 14,511 Change in fair value of contingent consideration 602 6,505 2,162 16,183 Amortization of deferred debt financing costs and accretion of discounts 656 630 2,592 2,137 Losses (gains) on disposition of businesses and assets, net 8 - 309 (5,562 ) Amortization of acquired inventory revaluation 1,948 - 6,188 396 Deferred taxes 25,277 (6,526 ) 28,854 (6,526 ) Contingencies and non-cash tax matters 1,313 (291 ) 182 (291 ) Changes in assets and liabilities which provided (used) cash, excluding effects from companies acquired: Accounts receivable, net (47,604 ) (24,040 ) (36,633 ) (18,960 ) Inventories 7,285 20,775 (17,923 ) 6,752 Accounts payable 46,791 24,852 34,331 30,716 Accrued expenses and other 102,233 14,707 (17,436 ) (53,540 ) Net cash provided by operating activities of continuing operations 128,098 142,586 292,155 323,776 Net cash provided by (used in) operating activities of discontinued operations - 6,136 (3,702 ) 26,839 Net cash provided by operating activities 128,098 148,722 288,453 350,615 Investing activities: Capital expenditures (16,728 ) (7,291 ) (39,089 ) (31,702 ) Settlement of cash flow hedges (23,879 ) - 36,541 - Purchases of investments (10,783 ) - (10,783 ) - Proceeds from surrender of life insurance policies - - 45 44 Changes in restricted cash balances - (14,959 ) 17,218 (16,959 ) Proceeds from disposition of businesses 1,100 - 1,100 21,000 Activity related to acquisitions, net of cash and cash equivalents acquired (1,403,606 ) - (1,527,183 ) (71,924 ) Net cash used in investing activities of continuing operations (1,453,896 ) (22,250 ) (1,522,151 ) (99,541 ) Net cash (used in) provided by investing activities of discontinued operations - (402 ) 272,779 (1,302 ) Net cash used in investing activities (1,453,896 ) (22,652 ) (1,249,372 ) (100,843 ) Financing Activities: Payments on borrowings (89,000 ) (98,000 ) (235,965 ) (902,507 ) Proceeds from borrowings 914,000 45,000 1,060,952 420,507 Proceeds from sale of senior debt - - - 546,190 Payments of debt issuance costs - - - (7,868 ) Settlement of cash flow hedges (2,285 ) (3,574 ) (13,824 ) (1,900 ) Net payments on other credit facilities (1,959 ) (261 ) (2,831 ) (1,096 ) Payments for acquisition-related contingent consideration - (42 ) (8,940 ) (155 ) Proceeds from issuance of common stock under stock plans 4,000 2,337 18,004 14,418 Purchases of common stock (354 ) (161 ) (3,834 ) (151,801 ) Dividends paid (7,716 ) (7,667 ) (30,793 ) (30,799 ) Net cash provided by (used in) financing activities of continuing operations 816,686 (62,368 ) 782,769 (115,011 ) Net cash used in financing activities of discontinued operations - - (533 ) - Net cash provided by (used in) financing activities 816,686 (62,368 ) 782,236 (115,011 ) Effect of exchange rate changes on cash and cash equivalents 1,758 (16,100 ) 21,552 (13,428 ) Net (decrease) increase in cash and cash equivalents (507,354 ) 47,602 (157,131 ) 121,333 Cash and cash equivalents at beginning of period 709,488 311,663 359,265 237,932 Cash and cash equivalents at end of period $ 202,134 $ 359,265 $ 202,134 $ 359,265 PREPARED IN ACCORDANCE WITH GAAP\nPerkinElmer, Inc. and Subsidiaries RECONCILIATION OF GAAP TO NON-GAAP FINANCIAL MEASURES (1) (In millions, except per share data and percentages) PKI Three Months Ended December 31, 2017\nJanuary 1, 2017\nAdjusted revenue: Revenue $ 641.6 $ 566.8 Purchase accounting adjustments 0.2 0.2 Adjusted revenue $ 641.8 $ 567.0 Adjusted gross margin: Gross margin $ 307.1 47.9 % $ 276.2 48.7 % Amortization of intangible assets 7.9 1.2 % 7.0 1.2 % Purchase accounting adjustments 2.2 0.3 % 0.2 0.0 % Mark to market on postretirement benefits 0.2 0.0 % 0.4 0.1 % Adjusted gross margin $ 317.4 49.4 % $ 283.8 50.0 % Adjusted SG&A: SG&A $ 172.3 26.8 % $ 162.8 28.7 % Amortization of intangible assets (13.4 ) -2.1 % (10.6 ) -1.9 % Purchase accounting adjustments (0.6 ) -0.1 % (6.5 ) -1.2 % Acquisition and divestiture-related expenses (15.1 ) -2.4 % (0.6 ) -0.1 % Significant litigation matter (2.7 ) -0.4 % - 0.0 % Mark to market on postretirement benefits 2.2 0.3 % (14.9 ) -2.6 % Adjusted SG&A $ 142.7 22.2 % $ 130.2 23.0 % Adjusted R&D: R&D $ 37.7 5.9 % $ 32.9 5.8 % Amortization of intangible assets (0.1 ) 0.0 % (0.0 ) 0.0 % Mark to market on post-retirement benefits 0.1 0.0 % 0.0 0.0 % Adjusted R&D $ 37.7 5.9 % $ 32.9 5.8 % Adjusted operating income: Operating income $ 97.4 15.2 % $ 80.4 14.2 % Amortization of intangible assets 21.4 3.3 % 17.6 3.1 % Purchase accounting adjustments 2.8 0.4 % 6.7 1.2 % Acquisition and divestiture-related expenses 15.1 2.4 % 0.6 0.1 % Significant litigation matter 2.7 0.4 % - 0.0 % Mark to market on postretirement benefits (2.1 ) -0.3 % 15.3 2.7 % Restructuring and contract termination charges, net (0.3 ) 0.0 % - 0.0 % Adjusted operating income $ 137.0 21.4 % $ 120.6 21.3 % PKI Three Months Ended December 31, 2017\nJanuary 1, 2017\nAdjusted EPS: GAAP EPS $ (0.37 ) $ 0.59 Discontinued operations, net of income taxes (0.02 ) 0.02 GAAP EPS from continuing operations (0.35 ) 0.57 Amortization of intangible assets 0.19 0.16 Purchase accounting adjustments 0.03 0.06 Significant litigation matter 0.02 - Acquisition and divestiture-related expenses 0.20 0.01 Gain on disposition of businesses and assets, net 0.00 - Mark to market on postretirement benefits (0.02 ) 0.14 Restructuring and contract termination charges, net (0.00 ) - Tax on above items (0.07 ) (0.10 ) Impact of tax act 0.97 - Adjusted EPS $ 0.97 $ 0.83 DAS Three Months Ended December 31, 2017 January 1, 2017 Adjusted revenue: Revenue $ 448.2 $ 409.9 Adjusted operating income: Operating income $ 77.0 17.2 % $ 69.7 17.0 % Amortization of intangible assets 13.2 3.0 % 13.0 3.2 % Purchase accounting adjustments 0.0 0.0 % 0.0 0.0 % Acquisition and divestiture-related expenses - 0.0 % 0.2 0.0 % Significant litigation matter 2.7 0.6 % - 0.0 % Restructuring and contract termination charges, net 0.7 0.2 % - 0.0 % Adjusted operating income $ 93.7 20.9 % $ 82.9 20.2 % Diagnostics Three Months Ended December 31, 2017 January 1, 2017 Revenue: Revenue $ 193.4 $ 156.8 Purchase accounting adjustments 0.2 0.2 Adjusted revenue $ 193.6 $ 157.0 Adjusted operating income: Operating income $ 34.5 17.9 % $ 36.3 23.2 % Amortization of intangible assets 8.2 4.2 % 4.6 2.9 % Purchase accounting adjustments 2.8 1.4 % 6.7 4.3 % Acquisition and divestiture-related expenses 15.1 7.8 % 0.4 0.3 % Restructuring and contract termination charges, net (1.0 ) -0.5 % - 0.0 % Adjusted operating income $ 59.5 30.8 % $ 48.1 30.6 % (1) amounts may not sum due to rounding\nPerkinElmer, Inc. and Subsidiaries RECONCILIATION OF GAAP TO NON-GAAP FINANCIAL MEASURES (1) (In millions, except per share data and percentages) PKI Twelve Months Ended December 31, 2017\nJanuary 1, 2017\nAdjusted revenue: Revenue $ 2,257.0 $ 2,115.5 Purchase accounting adjustments 0.7 0.7 Adjusted revenue $ 2,257.7 $ 2,116.2 Adjusted gross margin: Gross margin $ 1,073.0 47.5 % $ 1,013.4 47.9 % Amortization of intangible assets 29.3 1.3 % 30.3 1.4 % Purchase accounting adjustments 7.0 0.3 % 1.2 0.1 % Mark to market on postretirement benefits 0.1 0.0 % 0.4 0.0 % Adjusted gross margin $ 1,109.4 49.1 % $ 1,045.2 49.4 % Adjusted SG&A: SG&A $ 616.2 27.3 % $ 600.9 28.4 % Amortization of intangible assets (44.1 ) -2.0 % (40.7 ) -1.9 % Purchase accounting adjustments (2.2 ) -0.1 % (16.2 ) -0.8 % Acquisition and divestiture-related expenses (26.8 ) -1.2 % (1.2 ) -0.1 % Significant litigation matter (2.7 ) -0.1 % - 0.0 % Mark to market on postretirement benefits 2.2 0.1 % (14.9 ) -0.7 % Adjusted SG&A $ 542.6 24.0 % $ 527.8 24.9 % Adjusted R&D: R&D $ 139.4 6.2 % $ 124.3 5.9 % Amortization of intangible assets (0.3 ) 0.0 % (0.5 ) 0.0 % Mark to market on postretirement benefits 0.1 0.0 % 0.0 0.0 % Adjusted R&D $ 139.2 6.2 % $ 123.8 5.8 % Adjusted operating income: Operating income $ 304.8 13.5 % $ 283.1 13.4 % Amortization of intangible assets 73.7 3.3 % 71.5 3.4 % Purchase accounting adjustments 9.2 0.4 % 17.4 0.8 % Acquisition and divestiture-related expenses 26.8 1.2 % 1.2 0.1 % Significant litigation matter 2.7 0.1 % - 0.0 % Mark to market on postretirement benefits (2.1 ) -0.1 % 15.3 0.7 % Restructuring and contract termination charges, net 12.7 0.6 % 5.1 0.2 % Adjusted operating income $ 427.7 18.9 % $ 393.6 18.6 % PKI\nTwelve Months Ended December 31, 2017\nJanuary 1, 2017\nAdjusted EPS: GAAP EPS $ 2.64 $ 2.12 Discontinued operations 1.22 0.17 GAAP EPS from continuing operations 1.42 1.96 Amortization of intangible assets 0.66 0.65 Purchase accounting adjustments 0.08 0.16 Significant litigation matter 0.02 - Acquisition and divestiture-related expenses (0.08 ) 0.01 Gain on disposition of businesses and assets, net 0.00 (0.05 ) Mark to market on postretirement benefits (0.02 ) 0.14 Restructuring and contract termination charges, net 0.11 0.05 Tax on above items (0.27 ) (0.31 ) Impact of tax act 0.96 - Adjusted EPS $ 2.90 $ 2.60 PKI Twelve Months Ended December 30, 2018\nAdjusted EPS: Projected GAAP EPS from continuing operations $ 2.28 Amortization of intangible assets 1.26 Purchase accounting adjustments 0.26 Acquisition and divestiture-related expenses 0.17 Tax on above items (0.47 ) Adjusted EPS $ 3.50 DAS Twelve Months Ended December 31, 2017\nJanuary 1, 2017\nAdjusted revenue: Revenue $ 1,578.5 $ 1,513.0 Adjusted operating income: Operating income $ 206.7 13.1 % $ 196.8 13.0 % Amortization of intangible assets 50.7 3.2 % 53.3 3.5 % Purchase accounting adjustments 0.1 0.0 % 0.5 0.0 % Acquisition and divestiture-related expenses 0.3 0.0 % 0.5 0.0 % Significant litigation matter 2.7 0.2 % - 0.0 % Restructuring and contract termination charges, net 10.4 0.7 % 4.7 0.3 % Adjusted operating income $ 270.9 17.2 % $ 255.9 16.9 % Diagnostics Twelve Months Ended December 31, 2017\nJanuary 1, 2017\nRevenue: Revenue $ 678.5 $ 602.5 Purchase accounting adjustments 0.7 0.7 Adjusted revenue $ 679.3 $ 603.2 Adjusted operating income: Operating income $ 149.6 22.1 % $ 149.6 24.8 % Amortization of intangible assets 23.0 3.4 % 18.1 3.0 % Purchase accounting adjustments 9.2 1.3 % 17.0 2.8 % Acquisition and divestiture-related expenses 26.4 3.9 % 0.7 0.1 % Restructuring and contract termination charges, net 2.2 0.3 % 0.4 0.1 % Adjusted operating income $ 210.4 31.0 % $ 185.8 30.8 % (1) amounts may not sum due to rounding\nPerkinElmer, Inc. and Subsidiaries RECONCILIATION OF GAAP TO NON-GAAP FINANCIAL MEASURES (1) PKI Three Months Ended December 31, 2017\nOrganic revenue growth excluding EUROIMMUN: Reported revenue growth 13% Less: effect of foreign exchange rates 3% Less: effect of acquisitions including purchase accounting adjustments and impact of divested businesses 4% Organic revenue growth excluding EUROIMMUN 6% DAS Three Months Ended December 31, 2017\nOrganic revenue growth: Reported revenue growth 9% Less: effect of foreign exchange rates 3% Less: effect of acquisitions including purchase accounting adjustments and impact of divested businesses 0% Organic revenue growth 7% Diagnostics Three Months Ended December 31, 2017\nOrganic revenue growth excluding EUROIMMUN: Reported revenue growth 23% Less: effect of foreign exchange rates 3% Less: effect of acquisitions including purchase accounting adjustments and impact of divested businesses 14% Organic revenue growth excluding EUROIMMUN 6% (1) amounts may not sum due to rounding\nPerkinElmer, Inc. and Subsidiaries RECONCILIATION OF GAAP TO NON-GAAP FINANCIAL MEASURES (1) PKI Twelve Months Ended December 31, 2017\nOrganic revenue growth excluding EUROIMMUN: Reported revenue growth 7% Less: effect of foreign exchange rates 0% Less: effect of acquisitions including purchase accounting adjustments and impact of divested businesses 3% Organic revenue growth excluding EUROIMMUN 4% DAS Twelve Months Ended December 31, 2017\nOrganic revenue growth: Reported revenue growth 4% Less: effect of foreign exchange rates 0% Less: effect of acquisitions including purchase accounting adjustments and impact of divested businesses 0% Organic revenue growth 4% Diagnostics Twelve Months Ended December 31, 2017\nOrganic revenue growth excluding EUROIMMUN: Reported revenue growth 13% Less: effect of foreign exchange rates 1% Less: effect of acquisitions including purchase accounting adjustments and impact of divested businesses 7% Organic revenue growth excluding EUROIMMUN 5% (1) amounts may not sum due to rounding\nExplanation of Non-GAAP Financial Measures\nWe report our financial results in accordance with GAAP. However, management believes that, in order to more fully understand our short-term and long-term financial and operational trends, investors may wish to consider the impact of certain non-cash, non-recurring or other items, which result from facts and circumstances that vary in frequency and impact on continuing operations. Accordingly, we present non-GAAP financial measures as a supplement to the financial measures we present in accordance with GAAP. These non-GAAP financial measures provide management with additional means to understand and evaluate the operating results and trends in our ongoing business by adjusting for certain non-cash expenses and other items that management believes might otherwise make comparisons of our ongoing business with prior periods more difficult, obscure trends in ongoing operations, or reduce management's ability to make useful forecasts. Management believes these non-GAAP financial measures provide additional means of evaluating period-over-period operating performance. In addition, management understands that some investors and financial analysts find this information helpful in analyzing our financial and operational performance and comparing this performance to our peers and competitors.\nWe use the term “adjusted revenue” to refer to GAAP revenue, including purchase accounting adjustments for revenue from contracts acquired in acquisitions that will not be fully recognized due to accounting rules. We use the related term “adjusted revenue growth” to refer to the measure of comparing current period adjusted revenue with the corresponding period of the prior year.\nWe use the term “organic revenue” to refer to GAAP revenue, excluding the effect of foreign currency changes and including acquisitions growth from the comparable prior period, and including purchase accounting adjustments for revenue from contracts acquired in acquisitions that will not be fully recognized due to accounting rules. We also exclude the impact of sales from divested businesses by deducting the effects of divested business revenue from the current and prior periods. We use the related term “organic revenue growth” to refer to the measure of comparing current period organic revenue with the corresponding period of the prior year.\nWe use the term “adjusted gross margin” to refer to GAAP gross margin, excluding amortization of intangible assets, inventory fair value adjustments related to business acquisitions, and including purchase accounting adjustments for revenue from contracts acquired in acquisitions that will not be fully recognized due to business combination accounting rules. We also exclude adjustments for mark-to-market accounting on post-retirement benefits, therefore only our projected costs have been used to calculate our non-GAAP measure. We use the related term “adjusted gross margin percentage” to refer to adjusted gross margin as a percentage of adjusted revenue.\nWe use the term “adjusted SG&A expense” to refer to GAAP SG&A expense, excluding amortization of intangible assets, purchase accounting adjustments, acquisition and divestiture-related expenses, significant litigation matters and significant environmental charges. We also exclude adjustments for mark-to-market accounting on post-retirement benefits, therefore only our projected costs have been used to calculate our non-GAAP measure. We use the related term “adjusted SG&A percentage” to refer to adjusted SG&A expense as a percentage of adjusted revenue.\nWe use the term “adjusted R&D expense” to refer to GAAP R&D expense, excluding amortization of intangible assets. We also exclude adjustments for mark-to-market accounting on post-retirement benefits, therefore only our projected costs have been used to calculate our non-GAAP measure. We use the related term “adjusted R&D percentage” to refer to adjusted R&D expense as a percentage of adjusted revenue.\nWe use the term “adjusted operating income,” to refer to GAAP operating income, including revenue from contracts acquired in acquisitions that will not be fully recognized due to accounting rules, and excluding amortization of intangible assets, other purchase accounting adjustments, acquisition and divestiture-related expenses, significant litigation matters, significant environmental charges, and restructuring and contract termination charges. We also exclude adjustments for mark-to-market accounting on post-retirement benefits, therefore only our projected costs have been used to calculate our non-GAAP measure. We use the related terms “adjusted operating profit percentage,” “adjusted operating profit margin,” or “adjusted operating margin” to refer to adjusted operating income as a percentage of adjusted revenue.\nWe use the term “adjusted earnings per share,” or “adjusted EPS,” to refer to GAAP earnings per share, including revenue from contracts acquired in acquisitions that will not be fully recognized due to accounting rules, and excluding discontinued operations, amortization of intangible assets, other purchase accounting adjustments, acquisition and divestiture-related expenses, significant litigation matters, significant environmental charges, disposition of businesses and assets, net, and restructuring and contract termination charges. We also exclude adjustments for mark-to-market accounting on post-retirement benefits, therefore only our projected costs have been used to calculate our non-GAAP measure. We also adjust for any tax impact related to the above items.\nManagement includes or excludes the effect of each of the items identified below in the applicable non-GAAP financial measure referenced above for the reasons set forth below with respect to that item:\nAmortization of intangible assets— purchased intangible assets are amortized over their estimated useful lives and generally cannot be changed or influenced by management after the acquisition. Accordingly, this item is not considered by management in making operating decisions. Management does not believe such charges accurately reflect the performance of our ongoing operations for the period in which such charges are incurred. Revenue from contracts acquired in acquisitions that will not be fully recognized due to accounting rules—accounting rules require us to account for the fair value of revenue from contracts assumed in connection with our acquisitions. As a result, our GAAP results reflect the fair value of those revenues, which is not the same as the revenue that otherwise would have been recorded by the acquired entity. We include such revenue in our non-GAAP measures because we believe the fair value of such revenue does not accurately reflect the performance of our ongoing operations for the period in which such revenue is recorded. Other purchase accounting adjustments—accounting rules require us to adjust various balance sheet accounts, including inventory and deferred rent balances to fair value at the time of the acquisition. As a result, the expenses for these items in our GAAP results are not the same as what would have been recorded by the acquired entity. Accounting rules also require us to estimate the fair value of contingent consideration at the time of the acquisition, and any subsequent changes to the estimate or payment of the contingent consideration and purchase accounting adjustments are charged to expense or income. We exclude the impact of any changes to contingent consideration from our non-GAAP measures because we believe these expenses or benefits do not accurately reflect the performance of our ongoing operations for the period in which such expenses or benefits are recorded. Acquisition and divestiture-related expenses—we incur legal, due diligence, stay bonuses, interest expense, foreign exchange gains and losses, significant acquisition integration expenses and other costs related to acquisitions and divestitures. We exclude these expenses from our non-GAAP measures because we believe they do not reflect the performance of our ongoing operations. Restructuring and contract termination charges—restructuring and contract termination expenses consist of employee severance and other exit costs as well as the cost of terminating certain lease agreements or contracts. Management does not believe such costs accurately reflect the performance of our ongoing operations for the period in which such costs are reported. Adjustments for mark-to-market accounting on post-retirement benefits—we exclude adjustments for mark-to-market accounting on post-retirement benefits, and therefore only our projected costs are used to calculate our non-GAAP measures. We exclude these adjustments because they do not represent what we believe our investors consider to be costs of producing our products, investments in technology and production, and costs to support our internal operating structure. Significant litigation matters—we incurred expenses related to significant litigation matters. Management does not believe such charges accurately reflect the performance of our ongoing operations for the periods in which such charges were incurred. Significant environmental charges—we incurred expenses related to significant environmental charges. Management does not believe such charges accurately reflect the performance of our ongoing operations for the periods in which such charges were incurred. Disposition of businesses and assets, net—we exclude the impact of gains or losses from the disposition of businesses and assets from our adjusted earnings per share. Management does not believe such gains or losses accurately reflect the performance of our ongoing operations for the period in which such gains or losses are reported. Impact of foreign currency changes on the current period—we exclude the impact of foreign currency from these measures by using the prior period’s foreign currency exchange rates for the current period because foreign currency exchange rates are subject to volatility and can obscure underlying trends.\nThe tax effect for discontinued operations is calculated based on the authoritative guidance in the Financial Accounting Standards Board’s Accounting Standards Codification 740, Income Taxes. The tax effect for amortization of intangible assets, inventory fair value adjustments related to business acquisitions, changes to the fair values assigned to contingent consideration, other costs related to business acquisitions and divestitures, significant litigation matters, significant environmental charges, adjustments for mark-to-market accounting on post-retirement benefits, disposition of businesses and assets, net, restructuring and contract termination charges, and the revenue from contracts acquired with various acquisitions is calculated based on operational results and applicable jurisdictional law, which contemplates tax rates currently in effect to determine our tax provision. The tax effect for the impact from foreign currency exchange rates on the current period is calculated based on the average rate currently in effect to determine our tax provision.\nThe non-GAAP financial measures described above are not meant to be considered superior to, or a substitute for, our financial statements prepared in accordance with GAAP. There are material limitations associated with non-GAAP financial measures because they exclude charges that have an effect on our reported results and, therefore, should not be relied upon as the sole financial measures by which to evaluate our financial results. Management compensates and believes that investors should compensate for these limitations by viewing the non-GAAP financial measures in conjunction with the GAAP financial measures. In addition, the non-GAAP financial measures included in this earnings announcement may be different from, and therefore may not be comparable to, similar measures used by other companies.\nEach of the non-GAAP financial measures listed above is also used by our management to evaluate our operating performance, communicate our financial results to our Board of Directors, benchmark our results against our historical performance and the performance of our peers, evaluate investment opportunities including acquisitions and discontinued operations, and determine the bonus payments for senior management and employees.\nView source version on businesswire.com: http://www.businesswire.com/news/home/20180125006207/en/\nPerkinElmer, Inc.\nInvestor Relations:\nTommy J. Thomas, CPA, 781-663-5889\ntommy.thomas@perkinelmer.com\nor\nFara Goldberg, 781-663-5699\nfara.goldberg@perkinelmer.com\nSource: PerkinElmer, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.perkinelmer.com&esheet=51748895&newsitemid=20180125006207&lan=en-US&anchor=www.perkinelmer.com&index=3&md5=3e79b88b78e15500ae2a0f3617a292a7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.perkinelmer.com&esheet=51748895&newsitemid=20180125006207&lan=en-US&anchor=www.perkinelmer.com&index=4&md5=39e0b3027fd8b1a809da16ecfcd54aa9", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.perkinelmer.com%2Fcorporate%2Finvestors%2F&esheet=51748895&newsitemid=20180125006207&lan=en-US&anchor=Investor&index=2&md5=1686596b228c62d1194150a5558513d2", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.perkinelmer.com%2F&esheet=51748895&newsitemid=20180125006207&lan=en-US&anchor=PerkinElmer%2C+Inc&index=1&md5=1fbd3c76eab0ba0db98a36c7ad4a1978", "http://www.businesswire.com/news/home/20180125006207/en/"], "published": "2018-01-26T00:15:00.000+02:00", "crawled": "2018-01-26T02:30:53.013+02:00", "highlightTitle": ""}