{"organizations": [], "uuid": "bbd01d1623f42fb3141f352e5718e6a71d3c12fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-women-government-pay-factbox/factbox-how-much-do-you-earn-gender-pay-gap-around-the-world-idUSKBN1ES17I", "country": "US", "domain_rank": 408, "title": "Factbox: How much do you earn? Gender pay gap around the world", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-03T22:31:00.000+02:00", "replies_count": 0, "uuid": "bbd01d1623f42fb3141f352e5718e6a71d3c12fe"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-women-government-pay-factbox/factbox-how-much-do-you-earn-gender-pay-gap-around-the-world-idUSKBN1ES17I", "ord_in_thread": 0, "title": "Factbox: How much do you earn? Gender pay gap around the world", "locations": [], "entities": {"persons": [], "locations": [{"name": "london", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "yemen", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "wef", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Thomson Reuters Foundation) - Other countries should follow Iceland which has become the first country to make it illegal to pay men more than women, politicians and equal rights campaigners said on Wednesday.\nIceland has been widely praised for introducing legislation on Jan. 1 that imposes fines on any company or government agency with over 25 staff without a government certificate demonstrating pay equality.\nIceland is the world’s most gender equal country, according to the World Economic Forum (WEF), which analyzed gaps in education, health, economic opportunity and political empowerment. Yemen is the least gender-equal, it found.\nHere are some facts about the gender pay gap:\n* The average pay for women globally is $12,000, compared with $21,000 for men, WEF said last year, forecasting that women will not earn as much as men for 217 years.\n* Closing the pay gap could add an extra $250 billion to the GDP of Britain, $1,750 billion to that of the United States and $2.5 trillion to China’s GDP, it said.\n* The difference between hourly pay rates for men and women in Britain’s workforce fell to its lowest in 20 years in 2017, with male full-time employees earning 9.1 percent more than females, government data showed.\n* The top ranking countries for economic participation and opportunity are Burundi, Barbados, Bahamas, Benin and Belarus, all with a gap of less than 20 percent, WEF said.\n* The five worst are Syria, Pakistan, Saudi Arabia, Yemen and Iran, with an economic gender gap of at least 65 percent.\n* Globally, 22 percent of senior managers are women and they are more likely to work in industries with lower pay, WEF says.\n* Data shows an under-use of educated women in the workforce, largely because of additional responsibilities at home, discrimination and under-representation in fields like engineering, manufacturing and technology, it said.\n* The European Commission proposed in November a two-year plan for closing the gender pay gap after finding little improvement in the past five years, with women in the European Union earning 16.3 percent less per hour on average than men.\n* The proposal includes setting minimum sanctions for companies that do not provide equal pay and monitoring the diversity policies of Europe’s largest companies.\nReporting by Varsha Saraogi. Editing by Katy Migiro.; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women’s rights, trafficking, property rights, climate change and resilience. Visit news.trust.org to see more stories.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-03T22:31:00.000+02:00", "crawled": "2018-01-03T19:30:31.032+02:00", "highlightTitle": ""}