{"organizations": [], "uuid": "18b610d08e9d3e711c2a1e810b9dedbde56252e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223433031&w=1200&r=LYNXMPEE0I1M8", "site_section": "https://www.reuters.com/finance", "section_title": "Business News &amp; Financial News | Reuters", "url": "https://www.reuters.com/article/us-weekinsports-19jan2018/this-week-in-sports-a-turnaround-for-timberwolves-idUSKBN1F82KB", "country": "US", "domain_rank": 408, "title": "This week in sports: A turnaround for Timberwolves?", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-20T04:24:00.000+02:00", "replies_count": 0, "uuid": "18b610d08e9d3e711c2a1e810b9dedbde56252e0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-weekinsports-19jan2018/this-week-in-sports-a-turnaround-for-timberwolves-idUSKBN1F82KB", "ord_in_thread": 0, "title": "This week in sports: A turnaround for Timberwolves?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A wrap up of the week in sports news:\nThis season has marked a massive turnaround for the Minnesota Timberwolves franchise: Despite a couple of losses this week, the Timberwolves have enjoyed a strong season, including a five-game winning streak cut short this week by the Orlando Magic . Rick’s take: The next few weeks will be telling for the T-Wolves, as the franchise will be dealing with fans distracted by local Super Bowl activities – especially if the Vikings make it to the Big Game.\nJust a few weeks away from Super Bowl LII at U.S. Bank Stadium in Minneapolis, NBC has nearly sold out all of its ad spots for the game: NBC is charging upward of $5 million for 30-second ad spots for the Super Bowl this year and has found buyers for all but a few. Combined with ad sales for the Winter Olympics, NBC could expect sales revenue exceeding $900 million. Rick’s take: The two events, only five days apart, should bring a major windfall to NBC.\nThe NFL plans to put on three consecutive games in its International Series in the UK in 2018: The Oakland Raiders will play the Seattle Seahawks in Tottenham Hotspur’s new stadium on Oct. 14 this year, with the Jags facing off against the Eagles and the Titans tackling the Chargers in the following two Sundays. Rick’s take: With this move, the NFL inches closer to maintaining a week-in, week-out schedule in London, getting fans used to the routine. If 2018 goes well, look for four consecutive weeks of play there in 2019.\nNorway's team in action against Serbia at the EHF European Handball Championship. REUTERS/Marko Djurica Click here to see more of the best Reuters sports photography .\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-20T04:24:00.000+02:00", "crawled": "2018-01-20T03:02:49.014+02:00", "highlightTitle": ""}