{"organizations": [], "uuid": "c34b0eb360090297e2620ecb7b036e704541c40a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219340754&w=1200&r=LYNXMPEE030XF", "site_section": "http://feeds.reuters.com/reuters/UKStocksAndSharesNews/", "section_title": "Reuters: Stocks & Shares News", "url": "https://uk.reuters.com/article/us-global-banks-fees/commentary-banks-rake-in-record-fees-to-beat-trading-blues-idUKKBN1ET1O2", "country": "US", "domain_rank": 408, "title": "Commentary: Banks rake in record fees to beat trading blues", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T16:50:00.000+02:00", "replies_count": 0, "uuid": "c34b0eb360090297e2620ecb7b036e704541c40a"}, "author": "", "url": "https://uk.reuters.com/article/us-global-banks-fees/commentary-banks-rake-in-record-fees-to-beat-trading-blues-idUKKBN1ET1O2", "ord_in_thread": 0, "title": "Commentary: Banks rake in record fees to beat trading blues", "locations": [], "entities": {"persons": [], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "canary wharf", "sentiment": "none"}], "organizations": [{"name": "coalition", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 2:52 PM / Updated 23 minutes ago Commentary: Banks rake in record fees to beat trading blues 8 Min   By one measure, 2017 was the most lucrative year in history for investment banks. A general view of the Canary Wharf financial district in London, Britain October 24, 2017. REUTERS/Kevin Coombs \nThe fees they charged companies and other financial firms for advising on mergers and acquisitions, arranging loans, and underwriting sales of bonds and stocks reached $104 billion, according to Reuters data. \nThat was up 16 percent on the previous year and the highest annual total for investment banking fees since Reuters started tracking the data in 2000. \nThis is noteworthy in itself, but especially so in light of what’s happening to investment banks’ primary source of revenue: trading. \nRapid technological change, automated trading, tighter regulation that limits banks’ capacity to hold fixed income inventory on their books, and record low market volatility have conspired to reduce trading revenue in recent years. \nAccording to industry data provider Coalition, the top 12 investment banks pulled in $119 billion from bond, currency, commodities and equity trading in 2016, the last full year for which figures are available. That’s down nearly 15 percent from $140 billion in 2012. \nTrading accounted for revenues of $61.1 billion in the first half of 2017, Coalition figures show. As the bulk of trading activity is conducted in the first six months of any year, it looks like the 2017 total will be the lowest in years. \nMost of the decline is in fixed income, currency and commodities -- or FICC -- trading, where regulation has been tightened most and where banks have pulled back most. Equity trading is holding up better but remains a far smaller share of banks’ trading pie than FICC. \nThe new year is only a few days old but there is no sign of a pick-up in market volatility, a prerequisite for a rebound in trading activity and revenue. \nThe VIX index of implied volatility on Wall Street has traded below 9 percent on only seven days since its launch nearly 30 years ago. Six have been in the last six months, and two of them have been this week. \nEven though the Fed is raising U.S. interest rates and other central banks are gradually turning off the stimulus taps, currency and bond market volatility remains anchored near historic lows too. $104 BILLION BONANZA \nIn a world of weak trading, equity capital market (ECM) and debt capital market (DCM) activity is commanding a greater share of big banks’ revenues and profits with every passing year. \nA bumper 2017 was always likely given that last year saw a high number and value of deals across equity and debt markets, the lowest stock and bond volatility on record, and dozens of new highs for global stock markets. \nEven still, it was a remarkable year for fees. The record $104 billion was comprised of $28.1 billion from M&A advisory services, $31.3 bln from DCM activity, $22.4 bln from ECM underwriting and $22.2 bln from syndicating loans. \nECM fees leapt 42 percent to a three-year high of $22.4 billion. As a share of overall ECM activity that was 2.9 percent, according to Reuters calculations -- the highest in at least a decade and well up from 2.1 percent in 2016. \nThe surge in ECM fees far outstripped the rise in ECM activity and transaction value. \nCompanies raised $783.7 billion in equity during 2017, up 18 percent from the previous year and the strongest annual period for global ECM issuance in two years. The 5,735 ECM offerings during the year marked a rise of 21 percent over 2016 and was the strongest full-year period since records began in 1980, the Reuters data showed. \nDCM fees rose 15 percent to a new record $31.3 billion. Always tiny compared to overall DCM transactions, they rose to 0.4 percent of the value of transactions from 0.3 percent in 2016, according to Reuters calculations. \nAgain, the rise in fees wasn’t matched by changes in the value or number of transactions. The number of debt issues globally rose 11 percent to 23,321, a new record for a calendar year while DCM activity actually slipped to $7.2 trillion, although that was the second consecutive year above $7 trillion. \nThe opinions expressed here are those of the author, a columnist for Reuters. Reporting by Jamie McGeever; Editing by Catherine Evans", "external_links": [], "published": "2018-01-04T16:50:00.000+02:00", "crawled": "2018-01-04T17:25:44.005+02:00", "highlightTitle": ""}