{"organizations": [], "uuid": "f049e530c6816dfa84dc4989c074307d08a9b546", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/22/104233491-GettyImages-632370252.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100727362/device/rss/rss.html", "section_title": "World News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/25/netanyahu-previously-unimaginable-israeli-arab-alliances-now-growing.html", "country": "US", "domain_rank": 767, "title": "Netanyahu: Previously unimaginable Israeli-Arab alliances now growing", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-25T21:04:00.000+02:00", "replies_count": 0, "uuid": "f049e530c6816dfa84dc4989c074307d08a9b546"}, "author": "Natasha Turak", "url": "https://www.cnbc.com/2018/01/25/netanyahu-previously-unimaginable-israeli-arab-alliances-now-growing.html", "ord_in_thread": 0, "title": "Netanyahu: Previously unimaginable Israeli-Arab alliances now growing", "locations": [], "entities": {"persons": [{"name": "ara", "sentiment": "negative"}, {"name": "netanyahu", "sentiment": "negative"}, {"name": "benjamin netanyahu", "sentiment": "negative"}], "locations": [{"name": "middle east", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "united nations security council", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Israeli Prime Minister Benjamin Netanyahu admitted to creating stronger strategic alliances with Arab countries in the wake of an emboldened Iran, calling it \"an extraordinary thing\" that he has not seen in his country's entire history.\n\"There is an alliance between Israel and other countries in the Middle East that would have been unimaginable years ago. I've never seen anything like it in my lifetime,\" he said Thursday on panel at the World Economic Forum in Davos, Switzerland.\nNetanyahu ripped into the Iran nuclear deal , stressing that many countries, particularly in the Arab world, agree with him.\n\"If Iran tries to rush for a bomb, there are many countries that will not let them,\" the prime minister said. \"We would not let them acquire a nuclear weapon. There are Arab states, unnamed, that agree with me.\"\nThe Iran deal or the Joint Comprehensive Plan of Action (JCPOA), enacted in 2015 by Iran, the five permanent members of the United Nations Security Council — China, France, Russia, the U.K. and the U.S. — and Germany, allowed the lifting of international sanctions on Iran in exchange for compliance with restrictions on its nuclear program.\nThe UN's International Atomic Energy Agency confirms Iran is complying with the deal's rules, while its European signatories have praised it, saying it brought more stability to the region and averted a potential nuclear war.\nIsrael and Saudi Arabia were some of the deal's most prominent opponents.\nThe result has been a growing strategic alliance — one that has reportedly gone back for several years — between Israel, Saudi Arabia and Egypt, and it's become closer than at any point in the region's history.\n\"It is an extraordinary thing — it starts with a common concern, a common enemy, which is extremist Islam and terrorism, both Sunni and Shia extremism,\" Netanyahu said.\n\"Also,\" he said, \"Our common stance against Iran.\"\nAnd there was another source of this closeness, the prime minister said. \"It's the desire (of Arab states) to make use of the civilian technology in Israel has — in health, agriculture, water, energy — to better the lives of their citizens.\"\n\"I view that as a great promise of peace,\" he said. \"We see the beginning of changes in the attitudes toward Israel of (Arab) publics — not all of it, but a significant minority. That is hope, that is the future of peace, and that could mean the Palestinians too.\"\nThe comments come against a backdrop of ever-heating regional tensions between the Sunni Muslim Kingdom of Saudi Arabia and Shiite Muslim-dominated Iran, and amid continued anger across the Arab world at U.S. President Donald Trump's decision in December to name Jerusalem as the Israeli capital .\nshow chapters What is Davos? 12:34 AM ET Tue, 23 Jan 2018 | 03:12 Follow CNBC International on Twitter and Facebook .", "external_links": ["https://www.facebook.com/cnbcinternational", "https://twitter.com/cnbci"], "published": "2018-01-25T21:04:00.000+02:00", "crawled": "2018-01-25T21:39:00.002+02:00", "highlightTitle": ""}