{"organizations": [], "uuid": "a15e0a4618ca5605165322341a8b9ac0814fee70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/01/fortune-logo.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/06/hollywoods-china-challenge/", "country": "US", "domain_rank": 1196, "title": "China cries 'Wolf!' Should Hollywood worry? | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-06T10:31:00.000+02:00", "replies_count": 0, "uuid": "a15e0a4618ca5605165322341a8b9ac0814fee70"}, "author": "Clay Chandler", "url": "http://fortune.com/2018/01/06/hollywoods-china-challenge/", "ord_in_thread": 0, "title": "China cries 'Wolf!' Should Hollywood worry? | Fortune", "locations": [], "entities": {"persons": [{"name": "wolf", "sentiment": "neutral"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "state administration of press", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "8:31 AM EST \nGood morning and happy new year! \nOver the past decade, China has emerged as the world’s No. 1 consumer in a slew of important product categories: autos , mobile phones , semiconductors , elevators , luxury goods , beer , soy beans , pork , online games and men’s skin care . Hollywood has long salivated over the prospect that films, too, would be added to that list. \nThe breakneck growth of China’s box office between 2010 and 2015—when ticket sales soared from $1.51 billion to $6.8 billion—led many US film industry analysts to predict that 2017 would be the year China finally overtook the United States as the world’s No. 1 movie market. Alas, a shock slump in 2016 , when China’s movie box office actually declined in dollar terms to $6.58 billion, forced an industry-wide reassessment . Some experts warned China’s ascendence as No. 1 might not happen until well into the next decade . \nWell, the 2017 box office numbers are finally in. China’s media regulator—the State Administration of Press, Publication, Radio, Film and Television (a.k.a. SARFT)— reported last week that in 2017 China had total ticket sales of $8.59 billion. That fell well short of North American box office for 2017, estimated by comScore at $11.12 billion. Even so, analysts cheered the results as a healthy recovery for China. \nChina’s box office rebound should give Hollywood reason to rejoice. Since 1994, when China’s communist rulers eased a long-standing ban on all foreign films, growth in China’s box office has translated into hefty profits for US studios and distributors. Beijing replaced the ban with a quota system that limited the number of foreign films that could be screened per year, imposed strict rules on content, and restricted foreign distributors’ share of China ticket sales. U.S. filmmakers complained, but eventually learned to live with the proscriptions because American movies were so more popular (and profitable) than films produced in China. Blockbusters like Avatar and Titanic proved smash hits in China, raking in hundreds of millions of dollars. Many titles—including Pacific Rim , Transformers: Age of Extinction and Furious 7— earned far more money in China than they did in North America. Even films like Warcraft , which was pulled from American cinemas after less than a week, could hit the jackpot in China. In dollar terms, China’s ticket sales for 2017 grew 30% from last year. In North America, meanwhile, 2017 ticket sales dropped 2.3% from 2016’s record $11.4 billion. International films—most of them U.S.-made—claimed 46% of revenue in 2017, up from a 42% in 2016 and 38% in 2015. \nAnd yet, there are clear signs Hollywood’s dominance of China’s film scene has begun to fade. No fewer than four of the five highest grossing movies in China last year were locally produced. By far the biggest blockbuster was Wolf Warrior 2 , a jingoistic action film depicting the exploits of a Rambo-like former Peoples Liberation Army soldier who rushes to the rescue of Chinese nationals in Africa, pulverizing an American villain in the process. Wolf Warrior, which premiered in July, took in a record-shattering $854 million. The New Yorker ‘s Evan Osnos has penned a thoughtful essay on why such a nationalistic film seems to have struck such a powerful chord with Chinese audiences. (Beijing is so chuffed with Wolf Warrior that it has selected it for the best foreign-language film category of the 2018 Academy Awards.) \nChina’s second-most popular film in 2017 was The Fate of the Furious, which grossed less than half of Wolf Warrior. The next three most popular titles were all made in China: Never Say Die, about a boxer who magically switches bodies with a female reporter trying to expose him for taking bribes; Kung Fu Yoga , an action comedy starring Jacky Chan; and Journey to the West: Demons Strike Back, a fantasy adventure directed by Tsui Hark. \nIn recent weeks, despite a full scale marketing blitz by Disney , Star Wars: The Last Jedi , has left Chinese audiences underwhelmed . Instead, the hot ticket is Youth , a film depicting the triumphs and trevails of a group of young girls in a Chinese military performing arts troupe during the Cultural Revolution. \nAll of which suggests to me that the arc of China’s film industry may follow that of many other product categories in the country. As China’s economy matures and homegrown challengers come into their own, global players increasingly find themselves forced to scramble more frantically than ever to hang on to a shrinking share of a growing market. \nMore China news below. @claychandler Trade and Economy \nChina’s GDP revision. China has lowered its final 2016 gross domestic product figure to 74.36 trillion yuan ($11.47 trillion) from 54.2 billion yuan in initial estimates, due to a lower estimate in the services sector. The annual GDP growth rate remained unchanged at 6.7 percent. Reuters \nYes, we mind if you smoke: Growth in China’s manufacturing sector slowed in December thanks to sharp crackdown on air pollution and a cooling property market. The purchasing managers’ index also dipped. The Guardian \nCongress says Ant can’t: CFIUS has barred Ant Financial’s plan to acquire U.S. money transfer company MoneyGram International Inc due to national security concerns, making it the most high-profile Chinese deal to be blocked under the Trump administration. A $1.3 billion purchase of U.S. chip maker Lattice Semiconductor Corp by Chinese fund Canyon Bridge Capital Partners LLC was similarly shelved last year. Bloomberg \nThe call of home. Jia Yueting, the billionaire founder of LeEco, a troubled Chinese tech company once billed as the Netflix of China, has defied an order issued by the China Securities Regulatory Commission to return to China from the U.S. by the end of 2017 to sort out his mounting financial debt. The high-profile entrepreneur was placed onto an official list of debt defaulters in November, with official news agency Xinhua swiftly weighing in to publishing a stream of articles questioning Jia’s whereabouts and the firm’s financial health. BBC Technology and Innovation \nParty members wanted: News aggregation platform Jinri Toutiao says it plans to hire 2,000 content review editors to help scrub unwholesome and politically sensitive content from app. Toutiao and Phoenix News were rebuked by China’s regulators for disseminating pornography and publishing news without proper licenses. Toutiao says it’s looking for applicants with an interest in current affairs, a bachelor’s degree and a keen sense of what is (and is not) politically correct. The company says it will give preferential consideration to applicants who are members of the Communist Party. TechNode \nTencent, too. Tencent has put out a hiring ad for 200 content “patrollers”, who will find and delete illegal and inappropriate content across the firm’s multiple open content platforms. The new recruits, called the Penguin Patrol Unit after the firm’s mascot, will comprise veteran journalists, experi", "external_links": [], "published": "2018-01-06T10:31:00.000+02:00", "crawled": "2018-01-06T16:35:12.000+02:00", "highlightTitle": ""}