{"organizations": [], "uuid": "9838823df00863ea4588ddd43e27a41a50206e9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 34}, "facebook": {"likes": 12, "shares": 12, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XC824_cmonet_SOC_20180122203540.jpg", "site_section": "https://www.wsj.com/europe", "section_title": "The Wall Street Journal &amp; Breaking News, Business, Financial and Economic News, World News and Video", "url": "https://www.wsj.com/articles/netflix-plans-54-boost-in-ad-spending-to-promote-shows-1516672543", "country": "US", "domain_rank": 387, "title": "Netflix Plans 54% Boost in Ad Spending to Promote Shows", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T04:55:00.000+02:00", "replies_count": 0, "uuid": "9838823df00863ea4588ddd43e27a41a50206e9a"}, "author": "Alexandra Bruell", "url": "https://www.wsj.com/articles/netflix-plans-54-boost-in-ad-spending-to-promote-shows-1516672543", "ord_in_thread": 0, "title": "Netflix Plans 54% Boost in Ad Spending to Promote Shows", "locations": [], "entities": {"persons": [{"name": "reed hastings", "sentiment": "none"}, {"name": "david wells", "sentiment": "none"}], "locations": [], "organizations": [{"name": "netflix", "sentiment": "negative"}, {"name": "netflix inc.", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS As a number of large marketers cut back on ad spending, Netflix Inc. is moving in the opposite direction in a big way.\nThe streaming giant said during its fourth-quarter earnings presentation that it plans to raise its marketing spending 54% from $1.3 billion to $2 billion, as it looks to support its increasing investment in programming.\n“We’re seeing feedback that spending a little more on marketing is actually going to be better for the business overall because it amplifies the value of the content,” said Netflix CFO David Wells.\nNetflix said it would spend $7.5 billion to $8 billion on content this year, and continue an upward trajectory over the next couple of years. The company has 88 scripted series and has shelled out considerable sums on the highest-profile ones, like “The Crown,” “House of Cards,” and “Stranger Things.”\nNetflix’s software tailors content recommendations to households based on what they have watched--functionality that executives see as built-in marketing for shows. But Chief Executive Reed Hastings said that while the “holy grail dream is that the service was so good at promoting the new content in such relevant ways that we wouldn’t have to spend externally,” the company currently sees value in employing a mix of earned and paid advertising.\n“It still is a really good financial investment to increase the marketing,” said Mr. Hastings.\nSuch announcements are welcome in the ad and media industries, which have seen a number of brands -- especially consumer products companies -- pare back spending on marketing lately.\nExpect a decent chunk of Netflix’s outlays to go to digital giants. In a letter to shareholders, Netflix said free ad-supported internet video from companies like Facebook and YouTube is “a great advertising vehicle for Netflix.” During the presentation, Mr. Hastings added that the company is also “always trying to improve the product organically through social and PR.”\n“Netflix has been pretty efficient on how it’s spent marketing over the last few years,” said Justin Patterson, a research analyst at Raymond James. “If they are taking up marketing spend, that’s probably because they are seeing really good results in international markets.”\nMuch of the marketing strategy is “steered by data” that the company collects from city- and country-level experiments to determine the most efficient and productive ways to increase viewing on certain shows, said Mr. Hastings.\nOne thing Netflix is not experimenting with is turning its own platform into an advertising vehicle for other brands. Mr. Hastings described the “commercial-free path” as a “core differentiator.”\n“We’re going to continue to expand the relevance of a commercial-free service around the world and make that so popular that consumers are very used to, and appreciate, Netflix,” he said.\nWrite to Alexandra Bruell at alexandra.bruell@wsj.com", "external_links": [], "published": "2018-01-23T04:55:00.000+02:00", "crawled": "2018-01-23T10:03:16.009+02:00", "highlightTitle": ""}