{"organizations": [], "uuid": "9f9a7c65bfe94622cec700cab5348df2ff638f29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-caleresa-rick-ausick-announces-retirement.html", "country": "US", "domain_rank": 767, "title": "Caleres’ Rick Ausick Announces Retirement", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T00:15:00.000+02:00", "replies_count": 0, "uuid": "9f9a7c65bfe94622cec700cab5348df2ff638f29"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-caleresa-rick-ausick-announces-retirement.html", "ord_in_thread": 0, "title": "Caleres’ Rick Ausick Announces Retirement", "locations": [], "entities": {"persons": [{"name": "caleres", "sentiment": "negative"}, {"name": "rick ausick", "sentiment": "negative"}, {"name": "ausick", "sentiment": "none"}, {"name": "diane sullivan", "sentiment": "none"}, {"name": "rick", "sentiment": "none"}], "locations": [{"name": "st. louis", "sentiment": "none"}, {"name": "caleres", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President of Famous Footwear Plans to Transition through 2018\nST. LOUIS--(BUSINESS WIRE)-- Caleres (NYSE: CAL)( caleres.com ) today announced Rick Ausick, president of Famous Footwear, will retire in 2018 as part of a planned succession. Ausick, and his leadership team, have been integral in developing and executing Famous Footwear’s highly successful strategic plan. Ausick will remain actively involved and participate in day-to-day operations during both the search and transition.\n“The Caleres board of directors and its executive leadership has been preparing for Rick’s retirement by developing a deep bench of strong leaders at Famous Footwear and by expanding the breadth and depth of our Brand Portfolio,” said Diane Sullivan, CEO, president and chairman of Caleres. “We are actively managing the search for Rick’s successor, and, since it is incredibly important for us to find the right person for this role, we are considering both internal and external candidates. Our goal is to ensure a thoughtful, seamless transition.\n“Thanks to Rick and his entire leadership team, Famous Footwear remains on track to deliver low-single digit same-store-sales for fiscal 2017,” continued Sullivan. “The success we’ve seen at Famous over the past several years is due to work Rick and his team has completed in targeting high-value consumers and in developing our omnichannel capabilities. This strategic work will continue into 2018 and beyond.”\nAusick joined Caleres in 2002 as Famous Footwear’s senior vice president and chief merchandise officer, directing the chain’s merchandising assortment, achieving increased purchase ratios, lower inventories and faster merchandise turns. After spending three years as division president of wholesale, Ausick returned to Famous Footwear as division president in 2010. Ausick worked closely with the senior leadership team to transform Famous Footwear into a compelling retailer of nationally recognized brands for the family, offering consumers convenience and everyday value.\nCaleres has retained Kirk Palmer Associates to assist in the search for his successor and will review both internal and external candidates.\nSafe Harbor Statement Under the Private Securities Litigation Reform Act of 1995\nThis press release contains certain forward-looking statements and expectations regarding the company’s future performance and the performance of its brands. Such statements are subject to various risks and uncertainties that could cause actual results to differ materially. These risks include (i) changing consumer demands, which may be influenced by consumers’ disposable income, which in turn can be influenced by general economic conditions; (ii) rapidly changing fashion trends and purchasing patterns; (iii) intense competition within the footwear industry; (iv) political and economic conditions or other threats to the continued and uninterrupted flow of inventory from China and other countries, where the Company relies heavily on third-party manufacturing facilities for a significant amount of its inventory; (v) the ability to accurately forecast sales and manage inventory levels; (vi) cybersecurity threats or other major disruption to the Company’s information technology systems; (vii) transitional challenges with acquisitions; (viii) customer concentration and increased consolidation in the retail industry; (ix) a disruption in the Company’s distribution centers; (x) the ability to recruit and retain senior management and other key associates; (xi) foreign currency fluctuations; (xii) compliance with applicable laws and standards with respect to labor, trade and product safety issues; (xiii) the ability to secure/exit leases on favorable terms; (xiv) the ability to maintain relationships with current suppliers; (xv) the ability to attract, retain and maintain good relationships with licensors and protect intellectual property rights; and (xvi) changes to tax laws, policies and treaties. The company’s reports to the Securities and Exchange Commission contain detailed information relating to such factors, including, without limitation, the information under the caption Risk Factors in Item 1A of the company’s Annual Report on Form 10-K for the year ended January 28, 2017, which information is incorporated by reference herein and updated by the company’s Quarterly Reports on Form 10-Q. The company does not undertake any obligation or plan to update these forward-looking statements, even though its situation may change.\nABOUT CALERES\nCaleres is a diverse portfolio of global footwear brands. Our products are available virtually everywhere - in the over 1,200 retail stores we operate, in hundreds of major department and specialty stores, on our branded e-commerce sites, and on many additional third-party retail websites. Famous Footwear and Famous.com serve as our Family brands. Our Contemporary Fashion brands include Sam Edelman, Allen Edmonds, Franco Sarto, Vince, Via Spiga, George Brown Bilt, Diane von Furstenberg, Fergie Footwear and Carlos Santana. Naturalizer, Dr. Scholl’s Shoes, LifeStride, Bzees and Rykä represent our Healthy Living brands. Combined, these brands help make Caleres a company with both a legacy and a mission. Our legacy is our more than 130-years of craftsmanship, our passion for fit and our business savvy, while our mission is to continue to inspire people to feel good…feet first. Visit caleres.com to learn more about us.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006447/en/\nCaleres\nInvestor Contact:\nPeggy Reilly Tharp, 314-854-4134\nptharp@caleres.com\nor\nMedia Contact:\nKelly Malone, 314-854-4093\nkmalone@caleres.com\nSource: Caleres", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fcaleres.com%2F&esheet=51747665&newsitemid=20180123006447&lan=en-US&anchor=caleres.com&index=3&md5=5774ddbd6719260ed46289f933398aec", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Ffamous.com%2F&esheet=51747665&newsitemid=20180123006447&lan=en-US&anchor=Famous.com&index=2&md5=5c6084621f41253103c67037cc213340", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fcaleres.com%2F&esheet=51747665&newsitemid=20180123006447&lan=en-US&anchor=caleres.com&index=1&md5=c4457569f78b67010b72df736cff6cc7", "http://www.businesswire.com/news/home/20180123006447/en/"], "published": "2018-01-24T00:15:00.000+02:00", "crawled": "2018-01-24T01:20:46.010+02:00", "highlightTitle": ""}