{"organizations": [], "uuid": "edad5f333875299834e444c07f6e908f7ef36978", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-foundation-for-prader-willi-research-announces-hire-of-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "Foundation for Prader-Willi Research Announces Hire of Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T19:30:00.000+02:00", "replies_count": 0, "uuid": "edad5f333875299834e444c07f6e908f7ef36978"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-foundation-for-prader-willi-research-announces-hire-of-chief-executive-officer.html", "ord_in_thread": 0, "title": "Foundation for Prader-Willi Research Announces Hire of Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "walter", "sentiment": "none"}, {"name": "john walter", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "the foundation for prader-willi research", "sentiment": "negative"}, {"name": "prader-willi research", "sentiment": "negative"}, {"name": "fpwr", "sentiment": "none"}, {"name": "society", "sentiment": "none"}, {"name": "leukemia and lymphoma society", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WALNUT, Calif., Jan. 19, 2018 /PRNewswire/ -- The Foundation for Prader-Willi Research (FPWR), a nonprofit organization dedicated to supporting research that advances the understanding and treatment of Prader-Willi syndrome (PWS), announced today that it has hired John Walter as its new Chief Executive Officer. Walter is the former CEO of the Leukemia and Lymphoma Society where he dramatically expanded research to focus on partnerships with biotech and academia, and increased the Society's funding to more than $320 million annually. At FPWR, Walter will lead the organization in its next phase of growth and work with the current leadership and research teams to accelerate research and the development of therapies for PWS.\nEstablished in 2003, FPWR's research program has grown from funding small pilot studies to a robust and diverse research portfolio that facilitates and guides the PWS research agenda. FPWR has played an instrumental role in advancing the field of PWS research by supporting innovative research, encouraging collaboration, engaging pharmaceutical companies, and enabling a research-ready community. To date, FPWR has committed more than $10,000,000 to support PWS-related research with 148 research projects funded.\n\"As breakthroughs in genetics and other areas of study create new opportunities to address PWS, FPWR is ideally positioned to direct a new wave of translational research and forge new partnerships with academia and the biotech community,\" noted FPWR Board President, Dan Chorney. \"We are thrilled to have John join our organization given his track record of proven business leadership, successful management of growing organizations like FPWR, and experience working with all stakeholders in the therapeutic development process.\"\nImmediately prior to joining FPWR, Walter led the Alliance for Cancer Gene Therapy. From 1995 to 2014, Walter served in several positions for the Leukemia and Lymphoma Society including CEO, COO, executive vice president of Strategic Alliances & Business Development, CFO, and senior vice president of Finance & Information Technology. \"I am thrilled to join this dedicated group and lead the vision and research direction of FPWR,\" commented Walter. \"The commitment of the Board and the organization's focus on addressing the numerous symptoms of Prader-Willi while seeking a cure were major considerations for accepting this challenge. This is an incredible time to be working in genetic research.\"\nFPWR co-founder Alice Viroslav added that, \"John Walter's hiring is an important step forward for FPWR. He is exactly what is needed to take the organization to the next level of success. As a co-founder, it is wonderful to see the tremendous growth of the FPWR, and we are excited to see what the future holds for our loved ones with PWS.\"\nAbout Prader-Willi syndrome (PWS)\nPrader-Willi syndrome is a rare, genetic disorder affecting approximately 1 in 15,000 people. PWS is a complex condition that impacts nearly every system in the body. The hallmark symptom of PWS is hyperphagia, an unrelenting appetite and extreme hunger. A person with PWS never feels full. There are currently no effective treatments to regulate appetite in PWS and individuals with PWS require a highly restricted environment to prevent life-threatening overeating and obesity. Additional associated problems include growth hormone deficiency, behavioral challenges, intellectual disability, anxiety, sleep disturbances, and scoliosis.\nFor many individuals with PWS, the elimination of hyperphagia would represent a critical advance, bringing new possibilities for an independent life.\nAbout Foundation for Prader-Willi Research (FPWR)\nFPWR is composed of thousands of parents, family members, researchers, and others who are interested in addressing the many issues related to PWS, including childhood obesity, developmental delays, psychiatric disorders, and autism spectrum disorders. The mission of FPWR is to eliminate the challenges of Prader-Willi syndrome through the advancement of research and therapeutic development. FPWR supports cutting edge research studies around the world to advance the understanding of PWS, and collaborates with research institutions, pharmaceutical companies and the FDA to advance new treatments that will help those with PWS. To date, FPWR has funded over $10 million in PWS research. For more information please visit https://www.fpwr.org/ .\nMedia Contact:\nJohn Walter\nPhone: 914.413.1561\nEmail: john.walter@fpwr.org\nView original content: http://www.prnewswire.com/news-releases/foundation-for-prader-willi-research-announces-hire-of-chief-executive-officer-300585247.html\nSOURCE The Foundation for Prader-Willi Research", "external_links": ["https://www.fpwr.org/", "http://www.prnewswire.com/news-releases/foundation-for-prader-willi-research-announces-hire-of-chief-executive-officer-300585247.html"], "published": "2018-01-19T19:30:00.000+02:00", "crawled": "2018-01-19T20:50:45.022+02:00", "highlightTitle": ""}