{"organizations": [], "uuid": "b91b9cbdbf03fd6de1d3cdc583a4b4936c20d955", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/11/104463955-GettyImages-681934322.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/fbi-deputy-director-andrew-mccabe-frequent-target-of-trumps-ire-steps-down-nbc-news.html", "country": "US", "domain_rank": 767, "title": "FBI Deputy Director Andrew McCabe, frequent target of Trump's ire, steps down: NBC News", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T19:26:00.000+02:00", "replies_count": 0, "uuid": "b91b9cbdbf03fd6de1d3cdc583a4b4936c20d955"}, "author": "Jacob Pramuk", "url": "https://www.cnbc.com/2018/01/29/fbi-deputy-director-andrew-mccabe-frequent-target-of-trumps-ire-steps-down-nbc-news.html", "ord_in_thread": 0, "title": "FBI Deputy Director Andrew McCabe, frequent target of Trump's ire, steps down: NBC News", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "andrew mccabe", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "fbi", "sentiment": "negative"}, {"name": "nbc news", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com FBI deputy director Andrew McCabe is stepping down immediately. McCabe faced attacks from President Trump and some congressional Republicans, who accused him of political bias. McCabe will remain on the FBI payroll until March, when he is eligible to retire with full benefits. \nFBI deputy director Andrew McCabe, a frequent target of public attacks from President Donald Trump , is stepping down immediately, NBC News reported . \nMcCabe , who served a brief stint as acting director of the bureau after Trump fired ex-FBI chief James Comey, will remain on the payroll until March, when he is eligible to retire with full benefits, NBC said. He had been expected to leave. \nTrump and some Republicans in Congress have accused McCabe of political bias, citing his role at the FBI during investigations related to Hillary Clinton and Trump. They question his role in the Clinton email probe and the investigation into Russian efforts to influence the 2016 election and whether the Trump campaign coordinated with the Kremlin. \nTrump did not answer when asked by reporters Monday afternoon if he knew about McCabe's move. The White House was not involved in McCabe's decision, press secretary Sarah Huckabee Sanders told reporters Monday afternoon. \n\"The president was not part of this decision-making process,\" she said. \nShe referred questions to the FBI but added that Trump \"stands by\" his previous comments about McCabe. \nThe president had thrown jabs at McCabe in a manner unusual for a president and a top FBI official. Trump repeatedly accused McCabe of improper ties to Clinton because former Virginia Gov. Terry McAuliffe — a Clinton ally — backed McCabe's wife's run for a state office in 2015. The Wall Street Journal reported in October 2016 that McAuliffe gave nearly $500,000 to Jill McCabe's campaign for state Senate. \nThe FBI says McCabe followed the proper steps to avoid conflicts of interest. His wife's run for office also started months before he had any role in the Clinton probe. \nMore details about Trump's relationship with McCabe surfaced last week, when The Washington Post reported that the president asked him in May who he supported in the presidential election. \nIn December, the president also tweeted that McCabe was \"racing the clock to retire with full benefits.\" \nFormer Obama Attorney General Eric Holder praised McCabe's character and blasted \"bogus attacks\" on federal law enforcement agencies as attempts to distract attention. ", "external_links": [], "published": "2018-01-29T19:26:00.000+02:00", "crawled": "2018-01-29T19:30:18.003+02:00", "highlightTitle": ""}