{"organizations": [], "uuid": "aa61ef04c348e3866da8758ca3a26f4e70d89292", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-zumiez-inc-reports-december-2017-sales-results.html", "country": "US", "domain_rank": 767, "title": "Zumiez Inc. Reports December 2017 Sales Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.998, "site_type": "news", "published": "2018-01-04T00:00:00.000+02:00", "replies_count": 0, "uuid": "aa61ef04c348e3866da8758ca3a26f4e70d89292"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-zumiez-inc-reports-december-2017-sales-results.html", "ord_in_thread": 0, "title": "Zumiez Inc. Reports December 2017 Sales Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "lynnwood", "sentiment": "none"}, {"name": "wash.", "sentiment": "none"}], "organizations": [{"name": "zumiez inc", "sentiment": "neutral"}, {"name": "zumiez inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Net Sales Increased 11.4% to $160.0 Million\nDecember 2017 Comparable Sales Increased 7.9%\nLYNNWOOD, Wash., Jan. 03, 2018 (GLOBE NEWSWIRE) -- Zumiez Inc. (NASDAQ:ZUMZ) a leading specialty retailer of apparel, footwear, equipment and accessories for young men and women today announced that total net sales for the five-week period ended December 30, 2017 increased 11.4% to $160.0 million, compared to $143.6 million for the five-week period ended December 31, 2016. The Company's comparable sales increased 7.9% for the five-week period compared to a comparable sales increase of 3.4% in the year ago period.\nDue primarily to stronger than expected quarter-to-date sales and product margin performance, the Company is increasing guidance and now expects fiscal 2017 fourth quarter comparable sales growth of approximately 7%, and earnings per share between $0.88 and $0.90. This compares to the previous guidance for comparable sales growth between 3% and 5%, earnings per share between $0.78 and $0.84 and excludes any potential impact of recently passed tax reform.\nTo hear the Zumiez prerecorded December sales message, please dial (201) 689-8483 or (877) 523-5612, followed by the passcode # 986439 (ZUMIEZ).\nAbout Zumiez Inc.\nZumiez is a leading specialty retailer of apparel, footwear, accessories and hardgoods for young men and women who want to express their individuality through the fashion, music, art and culture of action sports, streetwear, and other unique lifestyles. As of December 30, 2017 we operated 701 stores, including 609 in the United States, 51 in Canada, and 34 in Europe and 7 in Australia. We operate under the names Zumiez, Blue Tomato and Fast Times. Additionally, we operate ecommerce web sites at Zumiez.com , blue-tomato.com and fasttimes.com .au.\nSafe Harbor Statement\nCertain statements in this press release and oral statements relating thereto made from time to time by representatives of the Company may constitute forward-looking statements for purposes of the safe harbor provisions under the Private Securities Litigation Reform Act of 1995. These statements include, without limitation, predictions and guidance relating to the Company's future financial performance, brand and product category diversity, ability to adjust product mix, integration of acquired businesses, growing customer demand for our products and new store openings. In some cases, you can identify forward-looking statements by terminology such as, \"may,\" \"should,\" \"expects,\" \"plans,\" \"anticipates,\" \"believes,\" \"estimates,\" \"predicts,\" \"potential,\" \"continue,\" or the negative of these terms or other comparable terminology. These forward-looking statements are based on management's current expectations but they involve a number of risks and uncertainties. Actual results and the timing of events could differ materially from those anticipated in the forward-looking statements as a result of risks and uncertainties, which include, without limitation, those described in the Company’s quarterly report on Form 10-Q for the quarter ended October 28, 2017 as filed with the Securities and Exchange Commission and available at www.sec.gov . You are urged to consider these factors carefully in evaluating the forward-looking statements herein and are cautioned not to place undue reliance on such forward-looking statements, which are qualified in their entirety by this cautionary statement. The forward-looking statements speak only as of the date on which they are made and the Company undertakes no obligation to publicly update such forward-looking statements to reflect subsequent events or circumstances.\nCompany Contact:\nDarin White\nDirector of Finance &\nInvestor Relations\nZumiez Inc.\n(425) 551-1500, ext. 1337\nInvestor Contact:\nICR\nBrendon Frey\n(203) 682-8200\nSource:Zumiez Inc", "external_links": [], "published": "2018-01-04T00:00:00.000+02:00", "crawled": "2018-01-04T00:21:14.003+02:00", "highlightTitle": ""}