{"organizations": [], "uuid": "4bf7aff57a5353b55a8c0dd2c1fbad7a00fb21b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/11", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-united-bancorp-inc-reports-2017-diluted-earnings-per-share-excluding-the-net-deferred-tax-asset-revaluation-of-0-point-75.html", "country": "US", "domain_rank": 767, "title": "United Bancorp, Inc. Reports 2017 Diluted Earnings per Share (excluding the net deferred tax asset revaluation) of $0.75, which is a 5.63% Increase over Diluted Earnings per Share of $0.71 reported in 2016, and a Forward Dividend Yield of 3.62% for the Ye", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-25T21:00:00.000+02:00", "replies_count": 0, "uuid": "4bf7aff57a5353b55a8c0dd2c1fbad7a00fb21b7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-united-bancorp-inc-reports-2017-diluted-earnings-per-share-excluding-the-net-deferred-tax-asset-revaluation-of-0-point-75.html", "ord_in_thread": 0, "title": "United Bancorp, Inc. Reports 2017 Diluted Earnings per Share (excluding the net deferred tax asset revaluation) of $0.75, which is a 5.63% Increase over Diluted Earnings per Share of $0.71 reported in 2016, and a Forward Dividend Yield of 3.62% for the Ye", "locations": [], "entities": {"persons": [{"name": "ye martins", "sentiment": "neutral"}, {"name": "randall m. greenwood", "sentiment": "none"}], "locations": [{"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "united bancorp, inc", "sentiment": "neutral"}, {"name": "united bancorp, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "martins ferry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MARTINS FERRY, Ohio, Jan. 25, 2018 /PRNewswire/ -- United Bancorp, Inc. (NASDAQ: UBCP), headquartered in Martins Ferry, Ohio, reported diluted earnings per share of $0.71 and net income of $3,546,000 for the year ended December 31, 2017. In the fourth quarter and for the year ended December 31, 2017, the Company recorded a $216,000, or $0.04 per share, one-time write down or revaluation of its net deferred tax asset as a result of the Tax Cuts and Jobs Act (\"tax act\") enacted on December 22, 2017. The tax act lowers the base corporate tax rate from 35% to 21%. Without this charge, the Company's diluted earnings per share would be $0.75 compared to $0.71 for the year ended December 31, 2016, an increase of 5.63%, and $0.20 versus $0.18 in the fourth quarter, an increase of 11.1%. Lastly, exclusive of the net deferred tax asset revaluation taken in 2017, the Company had net income of $3,762,000, which represents record earnings for the Company.\nRandall M. Greenwood, Senior Vice President, CFO and Treasurer remarked, \"We are happy to report that our Company had another solid year of performance this past year. While the tax act negatively impacted net income for 2017, the long term benefit of lower corporate tax rates outweighs this one-time write off. The Company had a solid increase in net income before taxes for the year ended December 31, 2017. During this period, the Company's net income before taxes increased by $429,000, or 8.3%, from the previous year. The primary driver of this increase of the Company's net income before taxes was the increase in interest income on loans, which was up by $716,000, or 4.7%, year-over-year. For the year, the Company had an increase in its average loans of $13.0 million or 3.8%. While growing its loan portfolio, the Company was able to maintain its overall stability in credit quality. Year-over-year, the Company continued to have very solid credit quality-related metrics supported by nonaccrual loans and loans past due 30+ days decreasing from a level of $3.1 million to $2.7 million, a decline of $392,000 or 12.6%. Further--- net loans charged off, excluding overdrafts, was $235,000 for 2017, which is a decrease of $46,000, or 16.4%, from the previous year. At this present level, total past due and nonaccrual loans to gross loans is a very solid 0.73%, versus 0.86% the prior year. In addition, net charge offs to average loans was a very respectable 0.07% for 2017.\" Greenwood continued, \"The net interest income for our Company increased year-over-year by $1.04 million, or 7.0%, even as we focused on growing retail core deposits to fund our growth. Total deposits increased by $47.2 million, or 13.9%, to a level of $386.0 million as of December 31, 2017. The Company was able to control its overall interest expense levels by attracting lower-cost retail funding to replace higher-cost wholesale funding advances that matured throughout this past year. Overall, the Company saw low-cost retail funding (consisting of non-interest and interest bearing demand and savings deposits) comprise $34.6 million of its growth in retail deposits year-over-year. In addition, the Company's time deposits, which consist of certificate of deposit or term funding, increased by $12.6 million, or 23.6%, for the same period. Even with the above-peer growth in retail core deposit funding, the Company experienced a decline in its overall interest expense to average assets, which decreased on a year-over-year basis from 0.43% to 0.39%. This decrease in the overall cost of funding is directly attributed to the repricing of $20.0 million of the Company's fixed rate advances from the Federal Home Loan Bank (FHLB) during the course of this past year. Not having these higher-costing wholesale advances on its balance sheet should continue to provide benefit to the company in 2018.\"\nRelating to the Company's net noninterest margin, Greenwood stated, \"The noninterest income of the Company was down by $229,000 year-over-year. The majority of this decrease in noninterest income is related to a $162,000 non-recurring gain that the Company realized on the sale of Bankers Bancshares, Inc. stock during 2016. On the noninterest expense-side of the net noninterest margin (and, as budgeted), the Company saw an increase in its overall noninterest expense levels after several years of decline. The Company saw its noninterest expense increase by $579,000 or 4.4%. Most of the increase in noninterest expense was related to infrastructure enhancement and personnel-related expenses as we prepare for the future growth that we envision and expenses related to our expansion into the Wheeling, West Virginia market with our new Loan Production Office, which should lead to our Company realizing higher levels of revenue as we saw this past year. Also adding to noninterest expense was the renaming of our single bank charter, The Citizens Savings Bank and its two divisions--- The Citizens Bank and The Community Bank--- to Unified Bank, which became effective on October 10, 2017. While we will not have the rebranding-related expenses in 2018, the Company will most likely dedicate to marketing-related expense a comparable amount of funding to better establish our new Unified Bank brand identity.\" Greenwood concluded, \"Considering that most of the aforementioned expenses are 'fixed,' we firmly believe that we should be able to drive higher levels of revenue without significantly adding to our overall noninterest expense levels in the short-term; therefore, enhancing our Company's earnings and returns.\"\nScott A. Everson, President and CEO stated, \"We are pleased to report the record level on net income realized by our Company in 2017 (exclusive of the deferred tax write off), which came in at $3,762,000. Our previous best year was 2008, which was prior to our industry being negatively impacted by the effects of the Great Recession. In addition, we are also pleased to report that we are executing upon our growth strategy, Mission 2020, which calls for our Company to grow its assets (in a profitable fashion) to a level of $1.0 billion or greater by the end of 2020. This past year, a lot of our focus was on solidifying the base that will firmly support our envisioned growth in the coming years. Even though we realize that we have an extremely long way to go in order to achieve our ambitious growth goal, it is gratifying to see the progress that we made toward supporting this goal and the organic growth that we achieved year-over-year. Although we will need to have a compounded annual growth rate of approximately thirty percent from the beginning of 2018 to achieve the level of growth envisioned under Mission 2020, we firmly believe that it is achievable with the infrastructure that we continue to build and the present vision that we have (which includes both organic and acquisition-related growth). From an organic perspective this past year, our Company grew its assets $21.3 million, or 4.9%, to an overall level of $459.3 million as of December 31, 2017. Most of this growth in assets occurred in our Company's higher-yielding loan portfolio, which enhanced the overall interest income that we realized. In addition, the overall level of net interest income realized by our Company increased year-over-year. Our Company was able to achieve this increase in net interest income by growing both its loans outstanding and lower-cost core deposit funding.\" Everson continued, \"As expected, we saw marginal growth in the net income that our Company produced in the first two quarters of this year and are extremely pleased to see that our earnings growth level is back to double digits on a percentage basis in the third and fourth quarters of 2017 (exclusive of the deferred tax write off in the fourth quarter of 2017). After several years of containment, our Company saw its overall noninterest expense levels increase this past year as we continue to build for the future and support our overall mission for growth. Most of the increase in our noninterest expense levels occurred in the following areas: hiring additional loan origination personnel to drive the revenue of our Company; completing the renovation of our Main Office to support an enhanced loan origination platform; reorganizing and enhancing our Information Technology function to better manage risk and serve our valued customers; opening a new Loan Production Office in the Wheeling, West Virginia market to increase overall loan production and to introduce our Company to a new, highly desirable market; marketing expense relating to the prime retail deposit pricing that we have been successfully promoting; and, lastly, legal and other expenses related to the renaming of our Company's single bank charter. Renaming our bank-level charter, Unified Bank, will allow us to establish a more effective brand and better support our envisioned growth objective.\" Everson concluded by stating, \"We firmly believe with our positioning over the course of the past year, our Company has high operating leverage which should allow us to enhance our revenue, while controlling our noninterest expense levels--- thus, leading to higher earnings and returns over the course of the next twelve to eighteen months. We continue to have extremely sound credit quality metrics, which should have a positive impact on our earnings for the foreseeable future. In addition, we continue to have a robust capital level, as evidenced by our overall equity to asset ratio of 9.56%, which will support our vision for growth in the intermediate term. Our Company continues to pay a generous cash dividend, which totals $0.51 on a trailing twelve month (TTM) basis (including the $0.05 special dividend paid this past December), which produces at TTM Yield of 3.9% as of year-end. At this level, our Company's cash dividend yield is significantly higher than that of the average bank in our country. With our recent focus of increasing the operating leverage and revenue of our Company, we firmly believe that we will continue to generate higher levels of net income and reward our shareholders by paying higher dividends and having further appreciation in our market value.\" Everson concluded, \"Our number one focus continues to be growing our shareholders' investment in our Company through profitable operations and strategic growth. In addition to driving the market value appreciation of our shareholders' ownership, we will continue striving to reward our owners by paying a solid cash dividend. Overall, we are pleased with the performance that our Company had in 2017 and the direction that we are going. We are extremely optimistic about our future potential and look forward to realizing this upside potential in future periods!\"\nUnited Bancorp, Inc. is headquartered in Martins Ferry, Ohio and has total assets of $459.3 million and total shareholder's equity of $43.9 million as of December 31, 2017. Through its single bank charter, Unified Bank, the Company has eighteen banking offices that serve the Ohio Counties of Athens, Belmont, Carroll, Fairfield, Harrison, Jefferson and Tuscarawas. The Company also operates a Loan Production Office in Wheeling, WV. United Bancorp, Inc. is a part of the Russell Microcap Index and trades on the NASDAQ Capital Market tier of the NASDAQ Stock Market under the symbol UBCP, Cusip #909911109.\nCertain statements contained herein are not based on historical facts and are \"forward-looking statements\" within the meaning of Section 21A of the Securities Exchange Act of 1934. Forward-looking statements, which are based on various assumptions (some of which are beyond the Company's control), may be identified by reference to a future period or periods, or by the use of forward-looking terminology, such as \"may,\" \"will,\" \"believe,\" \"expect,\" \"estimate,\" \"anticipate,\" \"continue,\" or similar terms or variations on those terms, or the negative of these terms. Actual results could differ materially from those set forth in forward-looking statements, due to a variety of factors, including, but not limited to, those related to the economic environment, particularly in the market areas in which the company operates, competitive products and pricing, fiscal and monetary policies of the U.S. Government, changes in government regulations affecting financial institutions, including regulatory fees and capital requirements, changes in prevailing interest rates, acquisitions and the integration of acquired businesses, credit risk management, asset/liability management, changes in the financial and securities markets, including changes with respect to the market value of our financial assets, and the availability of and costs associated with sources of liquidity. The Company undertakes no obligation to update or carry forward-looking statements, whether as a result of new information, future events or otherwise.\nUnited Bancorp, Inc,\n\"UBCP\"\nFor the Three Months Ended\n%\nDecember 31,\nDecember 31,\n2017\n2016\nChange\nEarnings\nInterest income on loans\n$ 4,125,937\n$ 3,917,550\n5.32%\nLoan fees\n219,199\n170,060\n28.90%\nInterest income on securities\n245,203\n156,276\n56.90%\nTotal interest income\n4,590,339\n4,243,886\n8.16%\nTotal interest expense\n438,033\n440,688\n-0.60%\nNet interest income\n4,152,306\n3,803,198\n9.18%\nProvision (Credit) for loan losses\n24,999\n(6,417)\n-489.57%\nNet interest income after provision for loan losses\n4,127,307\n3,809,615\n8.34%\nService charges on deposit accounts\n640,045\n625,204\n2.37%\nNet realized gains on sale of loans\n10,368\n29,209\n-64.50%\nOther noninterest income\n209,240\n201,442\n3.87%\nTotal noninterest income\n859,653\n855,855\n0.44%\nTotal noninterest expense\n3,483,535\n3,331,765\n4.56%\nIncome before income taxes\n1,503,425\n1,333,705\n12.73%\nDeferred tax asset write-down\n215,818\n-\nN/A\nIncome tax expense\n507,763\n432,470\n17.41%\nNet income\n$ 779,844\n$ 901,235\n-13.47%\nPer share\nEarnings per common share - Basic\n$ 0.16\n$ 0.18\n-11.11%\nEarnings per common share - Diluted\n0.16\n0.18\n-11.11%\nCash Dividends paid\n0.12\n0.11\n9.09%\nSpecial cash dividend paid\n0.05\n0.05\nN/A\nShares Outstanding\nAverage - Basic\n4,881,127\n4,945,219\nAverage - Diluted\n5,006,227\n5,053,740\nFor the Year Ended December 31,\n%\n2017\n2016\nChange\nEarnings\nInterest income on loans\n$ 15,901,522\n$ 15,185,245\n4.72%\nLoan fees\n901,706\n833,063\n8.24%\nInterest income on securities\n848,244\n616,826\n37.52%\nTotal interest income\n17,651,472\n16,635,134\n6.11%\nTotal interest expense\n1,763,485\n1,783,993\n-1.15%\nNet interest income\n15,887,987\n14,851,141\n6.98%\nProvision for loan losses\n99,996\n300,830\n-66.76%\nNet interest income after provision for loan losses\n15,787,991\n14,550,311\n8.51%\nService charges on deposit accounts\n2,501,983\n2,593,504\n-3.53%\nBOLI benefit in excess of surrender value\n-\n-\nN/A\nNet realized gains on sale of loans\n98,287\n97,355\n0.96%\nGain on sale of Great Lakes Bankers Stock\n-\n162,215\nN/A\nOther noninterest income\n851,748\n828,244\n2.84%\nTotal noninterest income\n3,452,018\n3,681,318\n-6.23%\nTotal noninterest expense\n13,650,053\n13,070,759\n4.43%\nIncome before income taxes\n5,589,956\n5,160,870\n8.31%\nDeferred tax asset write-down\n215,818\n-\nN/A\nIncome tax expense\n1,827,889\n1,580,291\n15.67%\nNet income\n$ 3,546,249\n$ 3,580,579\n-0.96%\nPer share\nEarnings per common share - Basic\n$ 0.72\n$ 0.72\n0.00%\nEarnings per common share - Diluted\n0.71\n0.71\n0.00%\nCash Dividends paid\n0.46\n0.42\n9.52%\nSpecial Cash Dividend\n0.05\n0.05\nN/A\nBook value (end of period)\n9.02\n8.63\n4.52%\nShares Outstanding\nAverage - Basic\n4,861,942\n4,907,799\nAverage - Diluted\n4,985,799\n5,016,320\nCommon stock, shares Issued\n5,435,304\n5,425,304\n---", "external_links": [], "published": "2018-01-25T21:00:00.000+02:00", "crawled": "2018-01-26T02:00:28.005+02:00", "highlightTitle": ""}