{"organizations": [], "uuid": "7d39a6495163fc9d5ae526ea60ad33c9a51f928f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-skyline-and-champion-home-builders-announce-agreement-on-business-combination-to-create-the-nations-largest-publicly-traded.html", "country": "US", "domain_rank": 767, "title": "Skyline and Champion Home Builders Announce Agreement on Business Combination to Create the Nation's Largest Publicly Traded Factory-Built Housing Company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T17:00:00.000+02:00", "replies_count": 0, "uuid": "7d39a6495163fc9d5ae526ea60ad33c9a51f928f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-skyline-and-champion-home-builders-announce-agreement-on-business-combination-to-create-the-nations-largest-publicly-traded.html", "ord_in_thread": 0, "title": "Skyline and Champion Home Builders Announce Agreement on Business Combination to Create the Nation's Largest Publicly Traded Factory-Built Housing Company", "locations": [], "entities": {"persons": [], "locations": [{"name": "mich.", "sentiment": "none"}, {"name": "ind.", "sentiment": "none"}, {"name": "elkhart", "sentiment": "none"}, {"name": "troy", "sentiment": "none"}], "organizations": [{"name": "largest publicly traded factory-built housing company", "sentiment": "neutral"}, {"name": "skyline corporation", "sentiment": "neutral"}, {"name": "skyline", "sentiment": "none"}, {"name": "champion enterprises holdings", "sentiment": "none"}, {"name": "champion home builders, inc.", "sentiment": "none"}, {"name": "chb international b.v.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ELKHART, Ind. and TROY, Mich., Skyline Corporation (\"Skyline\") (AMEX: SKY) and Champion Enterprises Holdings, LLC (\"Champion\"), the parent company of Champion Home Builders, Inc., today announced that they have entered into a definitive agreement for the two companies to combine their operations. Under the terms of the agreement, Champion will contribute 100% of the shares of its operating subsidiaries, Champion Home Builders, Inc. and CHB International B.V., to Skyline. In exchange, Skyline is currently expected to issue approximately 47.8 million shares to Champion, representing 84.5% of the common stock of the combined company on a fully-diluted basis. Prior to closing, Skyline expects to declare a dividend to its existing shareholders of its excess net cash available for distribution under the agreement after certain transactional expenses.\nAmong the numerous benefits the combined company is expected to bring to all stakeholders include:\nSignificantly increased size and scale, with pro forma combined revenue of greater than $1 billion over the past twelve months*\nStrong pro forma balance sheet and significant cash flow to support continued flexibility and long-term strategic growth\nSignificant annual synergies\nThe combined company will be known as Skyline Champion Corporation and trade on the NYSE American under the ticker symbol \"SKY.\" The Board of Directors will comprise eleven members, nine of which will be directors designated by Champion and two of which will be designated by Skyline. Upon closing of the transaction, Champion Chief Executive Officer, Keith Anderson, will serve as Chief Executive Officer of Skyline Champion Corporation. Additionally, Laurie Hough, Champion Chief Financial Officer, will serve as Chief Financial Officer of the combined company. Skyline anticipates nominating John Firth, current Chairman of the Board of Skyline, and Rich Florea, current Chief Executive Officer of Skyline, as Directors of the combined company and Art Decio, an original founder of Skyline and member of the Board of Directors since 1959, as a senior advisor to the combined company's Board of Directors. Skyline Champion Corporation's principal offices will remain in Elkhart, Indiana with additional executive offices in Troy, Michigan.\nThe business combination will create the nation's largest publicly traded factory-built housing company, with greater than $1 billion in pro forma revenue over the past twelve months.* The combined company will have an expansive operational footprint throughout North America, with 36 manufacturing facilities, 24 of which are in the top 20 states for manufactured housing shipments. Skyline Champion Corporation will offer manufactured, modular and park model homes as well as commercial structures. Additionally, the combined company will have 21 owned factory-direct retail locations and provide transportation services to the manufactured housing industry from 10 locations across the United States.\nIt is anticipated that the transaction will generate significant annual synergies to be achieved through direct cost savings, reduced overhead costs and operational improvement opportunities. Additional synergies also are expected through cross-selling and distribution optimization by leveraging the combined company's owned and independent dealer network.\nRich Florea, Chief Executive Officer of Skyline said, \"The combination of Skyline and Champion represents a unique opportunity for two well-respected companies with strong brand history to come together and continue providing high-quality homes for customers, while also providing the greatest long-term value for shareholders. The combined company will have a strong presence throughout North America and will operate at a significant scale in addition to offering a broader choice of homes to customers. We believe Skyline Champion Corporation will be well positioned for impressive growth in the coming years, to the benefit of employees, shareholders and customers.\"\nKeith Anderson, Chief Executive Officer of Champion commented, \"Getting to know the Skyline team has reaffirmed our belief that the two companies are a great fit for a combination. Both companies share a deep commitment to providing quality products and outstanding customer service. We will remain focused on executing our strategy as an even stronger company. I am particularly pleased that Art Decio has agreed to serve as a senior advisor to the Board. Art is a legendary figure in manufactured housing and we are fortunate to have the benefit of his lifelong commitment to quality and integrity in our industry.\"\nArt Decio, Skyline's largest shareholder, has agreed to vote in favor of and fully support the transaction.\nArt commented, \"Champion and Skyline are tremendous brands in our industry, both dating back to the 1950s. Walter and Henry, Champion's founders, built a tremendous company that will be a great partner with Skyline. Both Skyline and Champion share similar corporate cultures and have earned a reputation for uncompromising integrity across their relationships with communities, retailers, suppliers and customers. Skyline Champion Corporation will be well positioned to continue to grow and serve its customers with the best products the industry has to offer.\"\nThe transaction, which is expected to be completed in the first half of 2018, is subject to the receipt of regulatory approvals and other customary closing conditions as well as the approval of Skyline shareholders. In connection with the transaction, Skyline intends to file with the SEC a proxy statement and other relevant materials and documents regarding the proposed transaction.\nJefferies LLC served as financial advisor to Skyline and Barnes & Thornburg LLP acted as Skyline's legal counsel. Ice Miller LLP acted as legal counsel to Skyline's Special Committee of the Board. RBC Capital Markets, LLC served as financial advisor to Champion and Ropes & Gray LLP acted as Champion's legal counsel.\nIn connection with the transaction, Skyline and Champion have received a joint commitment from RBC Capital Markets, LLC and Jefferies LLC, contingent upon the closing of the transaction, to consolidate and upsize existing revolving credit facilities for use by the combined company.\nAbout Skyline Corporation:\nSkyline Corporation and its consolidated subsidiaries design, produce, and market manufactured housing, modular housing, and park models to independent dealers, developers, campgrounds, and manufactured housing communities located throughout the United States and Canada. The company has eight manufacturing facilities in seven states. Skyline Corporation was originally incorporated in Indiana in 1959, as successor to a business founded in 1951, and is one of the largest producers of manufactured and modular housing in the United States. For more information, visit http://www.skylinecorp.com .\nAbout Champion Enterprises Holdings, LLC :\nChampion Enterprises Holdings, LLC was formed in 20", "external_links": ["http://www.prnewswire.com/news-releases/skyline-and-champion-home-builders-announce-agreement-on-business-combination-to-create-the-nations-largest-publicly-traded-factory-built-housing-company-300578036.html"], "published": "2018-01-05T17:00:00.000+02:00", "crawled": "2018-01-05T17:54:39.025+02:00", "highlightTitle": ""}